{"Viewing Distance":"Unknown","Disposition":"Unresolved","Object Flight Path":"Stationary,Straight-line path","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.892477,+-78.869809(19980)&iwloc=A&hl=en\"> mufon case (19980) map </A>","divs":["Sighting DetailsHi, I live outside Buffalo NY. I have always been interested in astronomy, Space technology, and UFO's,. I have had experiences with what I believe were alien spacecraft. First time back in 1965 or 1966 when I was about 4 or 5 years old living in Buffalo NY. A space craft silently hovered over my house. It was dark outside and what I saw was a saucer shaped craft about 100 feet in diameter with colored flashing lights that circled around the circumference of the craft. It made no sound. I was looking out the front window and it disappeared over the house. I told my mother but she ignored me. Probably thought it was my imagination which was not the case. 43 years later I can still see the image of what I saw in the sky. While I was living there I also recall one time a sharp jolting pain in the back of my neck while I was playing outside and then I don't recall much after that. Another time recently about 7 years ago I was messing around on the internet searching for area 51 when I came across a website area51.com. It was totally blacked out. I thought this was strange. I was playing with the mouse and left clicked and dragged the curser across the screen and that opened up a screen that said if you are an alien to email us at the web address. So I played along and emailed them telling them I am an alien on earth and I am stranded. I never got a reply but about a month later I saw a blinking light over my house high in the sky that was about the size of a planet. It was not moving or making a sound. My video cameras battery was dead and by the time I set up the electric cord it was gone. It was there about 10 minutes and I wasted too much time just looking at it. I saw another strange thing over the airport around this same time period when there appeared to be a thick black line in the sky that got smaller and closed out after a few minutes. I reported this to the air force or some government agency and never heard another thing. It wasn't long later that my wife filed for a divorce. She totally changed who she used to be. It was like she didn't even know me anymore and I didn't kow here. My son has reported that strange things have occurred inside the house including a ball of light that floats around near the ceiling. I saw this myself one time when I it woke me as I was sleeping on the couch. He would also tell me he saw something looking into his bedroom window late at night. One time there was snow on the ground and he said to me Dad look at those footprints. The footprints were non human and looked to be on two feet. Not an animal I was familiar with. I wanted to pass these experiences along to you to see if these are similar to anyone else who has reported anything similar in the same time frame and location. Also I wanted to know how I can become an investigator and if you can send me information. Thanks."],"Country":"United States","Weather Factors":"Unknown","Object Shape":"Circle, Oval, Star-like","Region":"New York","Latitude":"42.892477","Log Number":"US-10172009-0006","Date Submitted":"10/17/2009 05:35 UTC","Case Number":"19980","Date of the Event":"10/30/1965 12:00 UTC","Longitude":"-78.869809","files":["/var/www/straped/mufon/html2text/19980.html.txt","/var/www/straped/mufon/org/19980.html"],"trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around October 30th 1965"],"Tags":"City","City":"Buffalo","Summary":"Circular or oval shaped with colored lights around the circumference. Small non moving flashing light over my home. No sound to either."}