{"Object Shape":"Triangle","Region":"Texas","Case Number":"19998","divs":["sighting detailswent out into my backyard early in the evening. no moon or stars were visible yet. in the west \\ northwest sky was a bright triangle \\ diamond shaped object. at first i might have thought it was a blimp or a balloon. but it sat too still in the sky. it was so still it was almost creepy. it gave me the weirdest feeling. i watched it for what must have been thirty or forty-five minutes and took some pictures and video or my cheap digital camera. i finally went back inside because i had dinner on the stove and i didn't want it to burn, but i kept peaking at it from time to time, and it was just there. finally about an hour later when it was a little bit dimmer (but still no stars out) i could tell that this object was not just reflecting the sunlight, but was actually glowing, kinda a blue light, kinda like the blue halogen light color like are on some newer cars. then i noticed a tiny red dot that had dropped below it for a short distance. then very strangely the triangle slowly faded into a small dot much like the one below it. then they both slowly just faded and vanished. it's hard to describe. they didn't just fly away or move off into the distance, they just faded off. i actually had a very similar experience to this a few years ago, but didn't have a camera then. in the pictures you can tell the diamond \\ triangle shape but really can't get much more detail. sorry, but at least it's something. it amazes me that other people saw the same thing and are describing it in almost the exact same words. how amazing!"],"Tags":"City","Country":"United States","Disposition":"IFO","Sighting Duration":"01:30:00","Date of the Event":"10/17/2009 07:00 UTC","Log Number":"US-10182009-0011","City":"Lubbock","map":"<A HREF = \"http://maps.google.com/maps?q=33.587523,+-101.851166(19998)&iwloc=A&hl=en\"> mufon case (19998) map </A>","Object Features":"Undisclosed","Object Flight Path":"Stationary","Summary":"Triangle / Diamond shaped object with smaller orb, pics taken","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-101.851166","files":["/var/www/straped/mufon/html2text/19998.html.txt","/var/www/straped/mufon/more/19998_submitter_file1__ufoOct1709009.JPG","/var/www/straped/mufon/more/19998_submitter_file2__Oct1709UFO3.jpg","/var/www/straped/mufon/more/19998_submitter_file3__Oct1709UFO1.jpg","/var/www/straped/mufon/org/19998.html"],"Latitude":"33.587523","Date Submitted":"10/18/2009 11:01 UTC","trends":["There have been 18 other sightings in Lubbock","There were 2 other sightings in Lubbock on or around October 17th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown"}