{"Case Number":"19992","Object Features":"Other","Country":"United States","Summary":"Craft observed going north on Route 684","divs":["Sighting DetailsWhile driving North at 5:15 pm to 6:00 I observed a cloud that was following my car northbound on the west side of Route 684. The cloud drew my attention because it did not proceed east with the other clouds formations proceeding in an easterly direction.the wheather was overcast so I became puzzled as to why the cloud was not moving over me toward the east. The cloud followed me north on Route 684 from White Plains or the 287 and 684 interchange. This was for at least 20-25 minutes. As I approached Purdys the cloud emitted a craft. It came from the left front of the cloud. No winged or fans were visible. There was no noise. The craft descended from the cloud about 50-100ft. The cloud was approxitimately tree top + 100ft. The craft descended and stabilized directly parallel to me as I was moving at 65 mph up 684. It had observed me in a fixed position for about 5 minutes. The craft had a cross on the front. There was a figure of a singular figure in the upper left corner. There was no propulsion exhaust of any kind. The Kraft seem to observe me and then ascended back up backing up onto the same position in the cloud. It seemed to hook back into a position in the cloud. The cloud than banked west in a slow northwesterly direction. This occurred just before reaching exit 7 or the town of Brewster. The cloud then took on a more difinitive shape of a square hour glass. Rectangular in the middle but round square in the front and back. There was no noise or exhaust. I thought I may have been seeing some kind of illusion. After three months I saw a Progrem called UFO files. The program showed the four kinds of alien species visiting the earth. One of the ships shown in the lower right corner was the ship I observed. I then emailed Bob Byrne of UFO Hunters and asked how to report this. He advised me to report it to an agency in Florida. I did but they returned my email with a message that they could not open emails with attachments. I believe this craft may be operating in the westchester croton system since I commute daily along 684 and have seen another event I have not been able to explain. There was a light coming from the sky to the reservoir at White Plains. This was a heavy foggy night. All I could see as I was moving north was a beam of light faintly coming from the sky. I could not see any craft. I have also seen the cloud formation over my house. I fell I am being observed."],"trends":["There have been 4 other sightings in White Plains","There were no other sightings in White Plains on or around November 30th 2002"],"files":["/var/www/straped/mufon/html2text/19992.html.txt","/var/www/straped/mufon/org/19992.html"],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"New York","City":"White Plains","Object Flight Path":"Straight-line path","Date Submitted":"10/18/2009 02:26 UTC","Source":"MUFON","Log Number":"US-10182009-0005","Date of the Event":"11/30/2002 12:00 UTC","Longitude":"-73.76007","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Egg, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=41.043256,+-73.76007(19992)&iwloc=A&hl=en\"> mufon case (19992) map </A>","Latitude":"41.043256"}