{"Region":"Saskatchewan","divs":["Sighting Details I saw a UFO on November 26th. Me and my 2 friends droveout kinda on the outskirts of town to just chill out and talk. Weparked off the side of the road, and we must have been there forabout an hour or so. We were talking and talking when we saw thisreally bright lights in the back window. We thought it was a carcoming down the road. The lights were getting brighter and brighter,and we were like a2424hole,has his brights on, but they eventuallygot so bright that we knew it was a car, and there were way more than2 lights on it anyway. We got the hell outta there as fast as wecould so we took off up ahead of the road, knowing that it would leadus knowherethe nearest town in that direction would be at least a45 minute drive. We could still see the lights behind us. We realizedthat this way was definitely not the way home, so we all agreed toturn around and get back into the city as fast as possible. We turnedaround and started driving back. There is a bit of a hill on the wayback, and the UFO must have lowered a bit or something bc althoughwe could not see the actual lights anymore, we could see itsradiance shining out from behind the hill. It was so bright, kindof an orangy red colour. And we were driving right towards thefreakin thing. I was so scared, my foot was shaking and and bouncingup and down on the gas pedal. I started saying the Our Father I wasso scared. It soon moved to our left and flew into the air quickly aabout 100 ft. I looked long and flat, with some type of aerodynamicpoint on the front, and theres was dozens of brights orange andyellow lights all over it. We had our windows rolled down about6 inches bc we had been smoking. Anyeays, we hadnt rolled themup at all, and we noticed that this aircraft was not making anynoise at all. It had no wings, or propellor, and it was just hoveringin the sky, in the exact same spot for about 30 sec- 1 min. All wecould say was what the hell is that, drive faster, etc. It beganmoving towards our right so that we could now see it out of th"],"City":"Saskatoon","Source":"MUFON","Case Number":"1999","Date of the Event":"11/26/2002 11:45 UTC","Tags":"City","Country":"Canada","files":["/var/www/straped/mufon/html2text/1999.html.txt","/var/www/straped/mufon/org/1999.html"],"Object Features":"Patterned Surface","Date Submitted":"11/26/2002 11:45 UTC","trends":["There have been 16 other sightings in Saskatoon","There were no other sightings in Saskatoon on or around November 26th 2002"],"Latitude":"52.13437","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Longitude":"-106.647656","map":"<A HREF = \"http://maps.google.com/maps?q=52.13437,+-106.647656(1999)&iwloc=A&hl=en\"> mufon case (1999) map </A>","Disposition":"Unresolved","Log Number":"","Object Shape":"Other","Sighting Duration":"00:05:00","Object Flight Path":"Stationary","Summary":"Flying very low, very bright, made no sound"}