{"Object Shape":"Cigar, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=42.706062,+23.330421(19993)&iwloc=A&hl=en\"> mufon case (19993) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsUFO over Vitosha - 16 septevri 2009 With friends decided to get on the shelters' Blue Arrow. The closer we come to it, the clouds rose over the ridge of the Vitosha mountain. We reached the saddle before the shelter. Before us and left a little rose \"Belchov top, right - the top part of\" said \"after his saddle, which is located hut Academica. Glahneha ears of silence. Suddenly I noticed the background of white, fluffy clouds above the \"peak Belchov, dark gray to black, vretenoobrazen flying object, moving right along the 'said'. Flew as part of his right tapering was lower than the left, head resembled a beak of a bird in the end. \"Tail\" like a \"plane\". Therefore, in the first moment I thought that I plane. But the \"plane\" of the background of what is said is unthinkable - it is very low and too close to cliffs and mountain tops? Therefore consider that it is a descending eagle shrunk wings dive towards their prey. I told her friend: \"See: Eagle!\" And why the \"Eagle\"? Maybe I noticed the magnitude. I have often seen similar scenes in the region - and Magpie-legged hawks in flight like flying to the prey, but not to this magnitude. Then I changed my mind, an eagle in these places I've ever seen. It is therefore correct: \"It must be a hawk!\" The site continued to fly and I expect that in a moment or two should start to drop rapidly \"said\". But he continued to fly on its horizontal axis. Rather than fly hut and Academica. Already aware that the object is not a bird, the duration of flying requires the use of wings, which did not see - not the object changed its flight speed, trajectory or, simply change its form - above and beyond the hut looked like squat body, such as boiler, with rounded left and right part. I understand that we see UFO and I reached the camera, hooked on my belt. Do not lose sight of the object. Eschewed and the chance for a quality shooting diminished. Soon after overtaking hut Academica and continue towards the village of Bistrica, \"site\" make a left turn to Vitosha and while he built a second and enter the fluffy, white clouds and disappeared from sight. Do me the impression that \"the object\" in the right hand edge, the one who flew with the \"forward\" to seeing yellow strip that suggested for tsilindrichnostta of the site. Whether it is \"picked\" from the astronomical and aviodispecherskata base situated at the very Lyublyana? According to us - witness this event, \"the object\" flying height of the base and was not more than 500 meters from them. Was 11.30 hours. I hope that we were not just us - the only witnesses of this UFO phenomenon. Flew over the hut Academica, and very close to the village Bistrica, and a hut near Aleko ... I did attempt to draw it. The first painting depicts \"objects\" in the first few seconds, when his form was vretenoobrazna. Another painting depicts \"object\" when I looked around (and last) hut Academica. A dorabotka picture below is the place where we watched the \"Properties\". He flew against the backdrop of \"said\" coming from the left, and flew near the hut Academica."],"Weather Factors":"Unknown","City":"Sofia","Country":"Bulgaria","Sighting Duration":"Undisclosed","Latitude":"42.706062","Date of the Event":"09/16/2009 11:30 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"10/18/2009 05:32 UTC","Region":"Sofia-grad","files":["/var/www/straped/mufon/html2text/19993.html.txt","/var/www/straped/mufon/more/19993_submitter_file1__NLOlastKazan.JPG","/var/www/straped/mufon/more/19993_submitter_file2__NLOvitosha.JPG","/var/www/straped/mufon/more/19993_submitter_file3__16sep2009.JPG","/var/www/straped/mufon/org/19993.html"],"Case Number":"19993","Tags":"City","Source":"MUFON","Summary":"UFO over mountain Vitosha - Sofia","trends":["There have been 5 other sightings in Sofia","There were no other sightings in Sofia on or around September 16th 2009","This sighting has never been favorited.",""],"Longitude":"23.330421","Log Number":"BG-10182009-0006","Viewing Distance":"Unknown"}