{"Source":"MUFON","Region":"Florida","Date Submitted":"10/18/2009 09:07 UTC","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other, Unknown","Log Number":"US-10182009-0008","Object Flight Path":"Stationary","Date of the Event":"09/14/2009 08:30 UTC","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"30.060151","divs":["Sighting DetailsI had let my pups out for potty break before going to bed, Approximately 8:30 PM. They wanted to play tag. I would go to frount door and they would be at the back and vice versus. When I finally cought them at the frount door and got their attention I was rather upset at them. But before I got them inside Out of the courner of my right eye I noticed a STAR, it was flashing red fascits .It looked like it was stationed over the Gulf at about a 35 degree angle W-NW It appeared to be red, scarlet or saphire colored with BLACK between the fascits. Like a Star with multipal points on it. In the distance I also cought a glimpse of a smaller star reflecting the same blinking frequency as the one nearest to me. I almost had the feeling that the star was reflecting the anger,anoyance I had felt towards my Pups at that moment. (I had had multipal teeth extractions and did not feel well)Needless to say I was taken by supprise And frightened at the sight of the star and how it seemed to be picking up on my feelings and frustration at that perticular moment. Whether the red flashing was directed to me directly I do not know. But I feel like the reaction of the star was some how related to me at the time because the intensity of the red appeared to increase briefly as I watched it. My pups and I went inside to bed and from then on I have put them out on a tether at night for a potty break. No more tag. I was supprised ,frightened at the sight and intensity of the stars reaction to my frustration and anger at that moment. It was as if the hair on the back of my neck stood up and I had a chilling sensation. It still upsets me today. This took place over a month ago."],"City":"Mayo","Summary":"Star with red (saphire red fascets ) and black between one over gulf and another in the distance nearly out of view.","Country":"United States","files":["/var/www/straped/mufon/html2text/19995.html.txt","/var/www/straped/mufon/org/19995.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.060151,+-83.172388(19995)&iwloc=A&hl=en\"> mufon case (19995) map </A>","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around September 14th 2009"],"Object Features":"Patterned Surface, Appendage(s)","Longitude":"-83.172388","Disposition":"Unknown","Case Number":"19995","Weather Factors":"Does Not Apply","Tags":"City"}