{"Log Number":"US-10182009-0018","Object Features":"Other","Longitude":"-117.557118","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20005.html.txt","/var/www/straped/mufon/more/20005_submitter_file1__skypictures.jpg","/var/www/straped/mufon/more/20005_submitter_file2__skypictures.jpg","/var/www/straped/mufon/more/20005_submitter_file3__skypictures1.jpg","/var/www/straped/mufon/org/20005.html"],"Object Shape":"Cigar, Disc, Oval, Sphere","Disposition":"IFO","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Glinting light, flashing light caught my attention ...seemed to change...huge glowing light appeared","City":"Corona","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"33.881924","divs":["Sighting DetailsWe were driving to a local park on Saturday afternoon. I always take pictures of the sky and landscapes when we take long drives. I noticed something very stunning, a bright light flashing in the afternoon sky. It was about 4:30pm. We were driving along the I15 freeway near the 1st exit to Corona when I first noticed it. I thought maybe it was a small plane, but then I zoomed in x4 to x16 and all I could see was this cigar shape or elongated oval shape glinting every few seconds. I took several pictures over five minutes, as it changed into a round oval shape with a massive glowing light emitting from it. After about a minute it seemed lose its beautiful glow and became more dull. I then noticed a small cloud or gray object that seemed to be staying near it and at times going away from it. Then suddenly, they both were gone. I could no longer find either of them in the sky. Before they faded my husband reminded me to zoom back out and to attempt to get photos of something nearby to contrast the object. When I got home I viewed the pictures, blew them up and contrasted them with various pictures taken of planes at a similar distance. You can always see the wing and or tail, this object was mainly light, no tail or wing."],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=33.881924,+-117.557118(20005)&iwloc=A&hl=en\"> mufon case (20005) map </A>","Date of the Event":"10/17/2009 12:00 UTC","trends":["There have been 36 other sightings in Corona","There were no other sightings in Corona on or around October 17th 2009","This sighting has never been favorited.",""],"Tags":"City","Case Number":"20005","Date Submitted":"10/18/2009 05:53 UTC","Region":"California"}