{"Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Carlisle","There were no other sightings in Carlisle on or around October 17th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=40.20895,+-77.18794(20000)&iwloc=A&hl=en\"> mufon case (20000) map </A>","City":"Carlisle","Weather Factors":"None","Tags":"City","Case Number":"20000","Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet","Latitude":"40.20895","Object Shape":"Egg, Sphere","Longitude":"-77.18794","Object Features":"None","Disposition":"Unresolved","Summary":"egg shaped ufo at 500ft altitude..","Log Number":"GB-10182009-0013","Region":"Pennsylvania","Date Submitted":"10/18/2009 03:14 UTC","divs":["sighting detailsmyself and a friend came across a ufo while driving to work. the object was 6 miles south of carlisle at time stated above. the object was at an altitude of around 500ft (i know this as we managed to pass the object within 200yards of passing the roundabout\\rotary) we pulled over to get a better look at this very strange glowing object which was moving very slowly across avery clear night sky, we managed to get a photo of this object using a 8 mega pixal camera phone. while we were watching the object another car pulled up from which an old women got out and asked if we were watching the ufo (thank god someone else saw this)we said yes and tried to get some movie footage using the camera phone again. as we did this the object faded away!!!!! the strange thing is we had a wierd feeling the object was still there?? after a few minutes we decided it was time to get to work so headed off to carlisle. around 100 yards down the road we were still looking into the sky to relocate the object when all of a sudden it reappeared from nothing and shot off in a northerly direction at what can only be described as impossible speed (i have seen the euro fighter quite regulary as the raf train for operations abroard in my local area) the object we saw was on a very different level altogether!!!! hope this sheds some light!!"],"Date of the Event":"10/17/2009 08:50 UTC","files":["/var/www/straped/mufon/html2text/20000.html.txt","/var/www/straped/mufon/more/20000_submitter_file1__eggufoatcarlisle.jpg","/var/www/straped/mufon/org/20000.html"]}