{"divs":["Sighting DetailsI was in Hobbs motor sports park, walking through the staging lanes. When I heard a another quy ask \"what's that in the sky?\" There was a group of 4 guys that I did not know, I am from Texas. They were looking at a light north east of the track about 35 degrees above the herizon. It was light blue and about a quater size of the moon and was stationary. I did a 360 and noticed that there was no stars visible in the sky. It was right at dusk. I watched the light for about 2 minutes just observing and listen to the guys talk. It stayed stationary so I walked 50 yards back to the pits where the race care was. Checked the car over. I looked back at the sky and nothing was there and the sky was clear. roughly 15 minutes later i notice that the star were visible. Off and on all evening I would check the sky trying to find the object, i never saw it again. I talked to my wife in Abilene around midnight, and she kidded my about it. I woke up this morning and came home to find others had seen things in the same region around the same time I did. So I thought I would send this in."],"City":"Hobbs","Latitude":"32.712502","Country":"United States","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Sighting Duration":"00:10:00","Viewing Distance":"Unknown","Tags":"City","Disposition":"Insufficient Data","Summary":"light blue light north east of hobbs motorsport park at about 35 degree above ground quater size of full moon","Date Submitted":"10/18/2009 10:35 UTC","Log Number":"US-10182009-0021","map":"<A HREF = \"http://maps.google.com/maps?q=32.712502,+-103.13054(20008)&iwloc=A&hl=en\"> mufon case (20008) map </A>","Source":"MUFON","trends":["There have been 5 other sightings in Hobbs","There were no other sightings in Hobbs on or around October 17th 2009"],"Region":"New Mexico","Case Number":"20008","Object Shape":"Circle, Oval","Date of the Event":"10/17/2009 05:44 UTC","Longitude":"-103.13054","files":["/var/www/straped/mufon/html2text/20008.html.txt","/var/www/straped/mufon/org/20008.html"]}