{"Tags":"City","Source":"MUFON","City":"Miami","Longitude":"-80.433577","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI went to take my dog out to relieve himself before bed, and I was enjoy the beautiful clear, windy cool night, looking up at the clear sky at a very bright star, then I thought I saw next to it another flashing moving star, then I noticed it had three lights flashing, that it was a moving object, at first it looked like the lights were in a row, 2 green and red light in the middle,then as it came closer, it seemed the red light was lower than the green, like a triangle facing down, the top two corners being green and the third point being red,it was extremely high up, I could not see the shape of the object, it appeared to be kind of oval, it flew towards the north, I followed it until it was over my house then I went inside to call my husband to come and take a look, he took about 3 minutes to come outside,but it was gone, it had dissapeared. I saw it in the far south side extremely high up and followed it come closer all the way to ontop of my house in about 1 minute, minute and a half. The lights rotated in flashing, they flashed like in a pattern. I was very speculative, I was wondering if it was a weather balloon, they always talk about people, misinterpreting what they see. I tried to researched what the wether balloons look like on the internet,and if they have lights, but most sites said they are usually released during the day or at 12 pm and 12 am. This was before those time and the lights rotated a flashing sequenced, not just a simple flash. Whatever it was it was not an airpalne."],"Summary":"flashing 2 green lights with red light in center extremely high moved","files":["/var/www/straped/mufon/html2text/20013.html.txt","/var/www/straped/mufon/org/20013.html"],"Weather Factors":"Unknown","Date of the Event":"10/18/2009 11:20 UTC","Object Features":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=25.64798,+-80.433577(20013)&iwloc=A&hl=en\"> mufon case (20013) map </A>","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Date Submitted":"10/19/2009 12:21 UTC","Case Number":"20013","trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around October 18th 2009"],"Latitude":"25.64798","Region":"Florida","Object Shape":"Star-like, Other, Unknown","Log Number":"US-10192009-0002"}