{"Date of the Event":"10/17/2009 06:35 UTC","Source":"MUFON","divs":["Sighting Details I am an amateur astronomer with a 13 in diameter telescope. I have been viewing through this scope for about 15 years. I am a former pilot too I set up the scope in my backyard in Nipomo California it was dusk at 6:35 pm I pointed my scope at what I thought was Jupiter. (Jupiter turned out later was hidden from my view at the time by a tree) This event lasted at least 3 minutes. I looked at the object it had roughly the same diameter as Jupiter through my scope using an eyepiece that gives me 49 power. As I looked at the object which I thought was Jupiter there was what I thought one of the moons of Jupiter the smaller object started moving back and forth above the larger object in about a 180 degree arc lasting about 1 second. I watched this go on for at least a minute. I checked my scope thought perhaps I was picking up a reflection. My optics were ok. As I looked at the two objects the smaller one appeared to shoot out a small beam of light, a laser? The color of the beam appeared to be a combination green and orange. The smaller object continued to move back and forth in an arc above the larger object while aiming the beam. Both objects stayed in my field of view they did not move as out of my field of view or were stationary in my field of view other than the smaller object shooting the beam moving back and forth above the larger object. I watched this beam shoot out of the larger object for close to another minute then the larger object exploded into at least 2 dozen pieces each a bright white like the original larger object. I then watched the object that shot the beam move slowly away from the debris cloud. I tracked it with my scope. It then appeared to take on an elongated shape a very dark red rust color it also had a flashing light at the rear. I moved my scope back to the debris cloud and back to the object that shot the beam a couple of times. Then the debris cloud was gone and I lost the object that shot the beam. It was later after the incident was over that I realized that Jupiter was still behind a tree in my backyard. The object when I saw it was at the same elevation above the horizon but about 15 to 20 degrees north of Jupiter. The object was almost in the constellatiion Pegasus. That is all I have I was the only one who saw it. I do not know what I saw I cannot explain it"],"Date Submitted":"10/19/2009 11:38 UTC","Log Number":"US-10192009-0008","Object Shape":"Sphere, Star-like","Region":"California","files":["/var/www/straped/mufon/html2text/20019.html.txt","/var/www/straped/mufon/org/20019.html"],"Tags":"City","Summary":"Two UFO's one large one small the small one used a beam to explode the big one","Latitude":"35.048915","Longitude":"-120.466739","Object Features":"None","Object Flight Path":"Stationary,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=35.048915,+-120.466739(20019)&iwloc=A&hl=en\"> mufon case (20019) map </A>","Weather Factors":"None","trends":["There have been 3 other sightings in Nipomo","There were no other sightings in Nipomo on or around October 17th 2009"],"Sighting Duration":"Undisclosed","Case Number":"20019","Disposition":"Insufficient Data","City":"Nipomo","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown"}