{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20015.html.txt","/var/www/straped/mufon/org/20015.html"],"Longitude":"-117.923587","Log Number":"US-10192009-0004","Region":"California","Object Shape":"Triangle","Latitude":"33.62326","City":"Newport Beach","Object Features":"Undisclosed","Country":"United States","Date Submitted":"10/19/2009 02:02 UTC","trends":["There have been 16 other sightings in Newport Beach","There were no other sightings in Newport Beach on or around October 15th 2009"],"Case Number":"20015","Source":"MUFON","Disposition":"Unknown","Summary":"Black triangle lights on three corners","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.62326,+-117.923587(20015)&iwloc=A&hl=en\"> mufon case (20015) map </A>","divs":["Sighting DetailsI went out side to look at the stars. It was an exceptionally clear night. A few weeks earlier I was able to easily spot satellites and my girl friend who is 34 can clearly make them out too. I was watching a small plane cross the sky just north of John wayne air port. When watching the plane I noticed movement catch my eye. Then I saw it. It traveled below the plane at high speed It was only visible because of the three points of light on the tips and the way that it blocked out the stars as a solid object would. I may have been only 30 feet long or so. It traversed the whole sky in less than two seconds so excess of twenty miles per second or 1200mph. it also did one zig zag manuver that was impossible for a human to withstand. the forces of traveling from straight to horizontal then straight at that speed would kill you. so the pilot must somehow be immune to inertia. It looks like it moves with the thoughts of the pilot. It made no sound and left no trail. I am very sure about what I saw. I feel like it must have somehow been related to the sighting in sad diego that occured at exactly the same time. the craft was definitely in a hurry to get somewhere. What also strikes me as strange was it seemed like as soon as I was tracking it. was when it zig zagged and then accelerated out of sight. approximately 10 seconds after the object went over. two helicopters flew across the area from the south in a wide circle scanning with spottlights all over in the air and ground. They made a wide turn circling back south towards the ocean."],"Object Flight Path":"Path with directional change","Date of the Event":"10/15/2009 07:33 UTC","Viewing Distance":"501 Feet - 1 Mile"}