{"Summary":"Two lights moving together like a jellyfish.","Country":"Canada","City":"Edmonton","Source":"MUFON","Case Number":"20012","files":["/var/www/straped/mufon/html2text/20012.html.txt","/var/www/straped/mufon/org/20012.html"],"Date Submitted":"10/19/2009 12:01 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=53.551174,+-113.483202(20012)&iwloc=A&hl=en\"> mufon case (20012) map </A>","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been 70 other sightings in Edmonton","There was one other sighting in Edmonton on or around October 16th 2009"],"divs":["Sighting DetailsI was driving east towards Manning Drive (Hwy 15) on 153 ave in Edmonton, Alberta, with my wife when we saw an unusually bright light in a near (if not) stationary position to the south of us (around 7:45PM), about 1.5 hands high from the horizon. It seemed to be quite large and brilliant, like a planet but slightly bigger and brighter without a shimmer, but we could see the clouds behind it. Both of us thought it was odd but figured it was probably the police helicopter spot light in the distance. We both had our view of the light blocked by a house just before turning south onto Manning Drive, but when we past the house the light was gone. There were no blinking lights as customary with helicopters and airplanes. A few minutes later I dropped my wife off to run her errands while I went to run mine. About 15 minutes later I was walking out of the Blockbuster Video store in Clareview (137 ave and 40 st) towards my vehicle, looking westwards, when I saw a very similar light to the first one but this time it was moving, and in a different position than earlier. The movement was absolutely bizarre! It was two lights now, the larger looking like the first light I saw with my wife, and the second looking much smaller and directly below the larger one. I'm accustomed to seeing helicopters in this area, they take off from CFB Edmonton regularly, plus we have police and news choppers in town too. And I'm accustomed to seeing planes. This pair of lights moved like NOTHING I have ever seen. The smaller, lower one moved down like a yo-yo, but instead of going back up, the larger, higher light would pull towards it, losing altitude, at the same distance and speed the smaller light moved first. It looked organic! I mean, it was like watching a jellyfish move in slow-motion rewind. There were two other people in that area of the parking lot with me who had left the video store just steps ahead of me who noticed me standing there with my vehicle door open frozen and staring at the western sky, but I don't think they looked in the direction I was looking or really even gave me a second thought as they got in their car without pausing. I didn't feel any strong emotions like fear, but I was somewhat nervous. I recall thinking \"it must be huge, and moves so strangely, what the **** is that?\" After 8 of these yo-yo + pull down maneuvers the lights were behind a distant building about 300-500 metres away (for those familiar with Clareview it would be the Marble Slab store from standing in front of Blockbuster). I'm not sure of the distance it was away from me, but when the lights were blocked by the building the larger one was about pea sized, and I assume since there's nothing but parking lots and traffic for about 1.5 kilometres from me in the direction I was staring, that's pretty big. I got in my vehicle and drove out of the parking lot onto 137 ave going westbound as reasonably fast as I could to pick my wife up so we can search for the lights but wasn't able to locate them again. I consider myself an objective person. I am fascinated by the UFO phenomena, but also try to reason out less exciting explanations first. In this case I've considered maybe it was a kite or balloon of some sort someone might have been playing with. It would have to be huge. What gets me though is it did not move like a typical aircraft or toy does. And those movements really looked natural, quite literally like a jellyfish swimming backwards. It was just so bizarre!"],"Date of the Event":"10/16/2009 07:45 UTC","Object Shape":"Circle, Diamond, Oval, Sphere, Star-like, Teardrop, Other","Region":"Alberta","Tags":"City","Latitude":"53.551174","Sighting Duration":"Undisclosed","Longitude":"-113.483202","Log Number":"CA-10192009-0001"}