{"Date of the Event":"11/29/2002 08:30 UTC","Country":"United States","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=41.330824,+-94.013839(2001)&iwloc=A&hl=en\"> mufon case (2001) map </A>","Tags":"City","trends":["There has been one other sighting in Winterset","There was one other sighting in Winterset on or around November 29th 2002"],"Viewing Distance":"20 Feet or Less","Region":"Iowa","Longitude":"-94.013839","divs":["Sighting Detailswas on my way inside from work when i heard a strange whining noise i jumped andturned around. what looked like a psychadellic cone came hovering downward. Itlanded approxametly 15 feet in front of me and nocked me to the ground. I thenran inside to use the cell phone, which to my surprise was emitting a strangewhirring noise. I obsereved that the tv and computer where flashing and changingatations randomly. the music that my cd player was playing became verrydistorted and a voice came on the track. It was ery deep and distorted. Iscreamed and ran to the window. a small violet object came hovering towards mefrom he cone with a gun like object in his hand. It looked like some sort ofape. It approached the window and i recoiled in fear i felt helpless he fadedout of view and then appeared diectly in front of me. I screamed Back you deviland i noticed the device he was holding was actually a probe of some sort. Iturned and coward in the corner facing the wall with my butt in the air.I then felt a great pain in my anus and screamed at the top of my lungs. Iquickly turned and he was gone. confused, i"],"Sighting Duration":"00:10:00","City":"Winterset","Log Number":"","Weather Factors":"Windy, Fog","Case Number":"2001","Date Submitted":"11/29/2002 08:30 UTC","Latitude":"41.330824","Object Features":"Window(s), Appendage(s)","Summary":"Alien Encounter","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2001.html.txt","/var/www/straped/mufon/org/2001.html"],"Object Shape":"Cone","Object Flight Path":"Other"}