{"Latitude":"38.260175","Source":"MUFON","Object Flight Path":"Path with directional change","Disposition":"Unknown","Object Shape":"Blimp, Bullet, Missile, Cigar, Cylinder, Disc","Object Features":"Appendage(s), Other","Date of the Event":"10/11/2009 04:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.260175,+-85.750106(20021)&iwloc=A&hl=en\"> mufon case (20021) map </A>","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"None","Sighting Duration":"Undisclosed","Summary":"Multiple clear images taken of unknown craft in sky during a clear day.","Case Number":"20021","Tags":"City","Region":"Kentucky","Date Submitted":"10/19/2009 11:43 UTC","files":["/var/www/straped/mufon/html2text/20021.html.txt","/var/www/straped/mufon/org/20021.html"],"trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around October 11th 2009"],"City":"Louisville","divs":["Sighting DetailsI was driving down the street and noticed a friend and his mother starring at something in the sky. I approached them and noticed a tiny black dot that they pointed out to me. I went into my car and grabbed my camera with a long lense and began to take pictures of the craft. It was below the clouds and over a mile out to the South-east. I did not hear anything. The craft was moving across the sky heading from the east to the south part of the sky, and at times appeared to move towards and away from us. When I reviewed the images, the craft not only moved in vectors but seems to rotate around its own axis. as the craft rotated it took on different shapes. one image looks like a metallic blimp, when the next image looked like a saucer of some sort. when another image looked more like the bottom of an iron. I did not appreciate any lights coming from the craft but the sun did reflect off its skin. I also did not see any smoke or jet streams coming off the craft. The whole moment lasted about 1 minute and a few seconds. After the last picture I took the image vanished into thin air. During the whole time I was standing in one spot taking the images. Each image taken was about 2-3 seconds apart. Took a total of 11 images in sequence. I thought it was a balloon when I first looked at it. I was not upset or anxious when seeing the craft. I just did not know what it could be. I showed the picts to many of my friends and co-workers and they can not explain what they see either because in each image the craft takes on a different look. I would like to be contacted by MUFON to discuss these images and would be glad to send them at that time. They are quite large files and I am not sure how to upload them correctly to your site. These images are in very good quality. I may consent to release of info to third parties after discussing case with MUFON."],"Longitude":"-85.750106","Log Number":"US-10192009-0010"}