{"Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting Details Hi, I would like to start by first saying that if we only had the technology that we have today back in 1982 I would of had the best shots or video of the giant black silent triangle. After about 28 yrs later of seeing the object I remember it like it just happened and after watching UFO hunters and now discovering MUFON it brings back memories of that crystal clear sighting. Im happy to give a description to what I saw that fall night inlate Sep early Oct of 1982. While pulling into the driveway of our home with my parents in Owasco NY about 10 pm my father said hey look at that thing, as we all got out of the car this breathtaking craft just came over are house the size of I would say a home depot of today. It was right over are heads roughly 100 ft. It looked like a ship out of star wars it did not make a sound as it just drifted or floated over are heads it had some white lights but not that big in fact very small I did not see any other colored lights the thing that was so amazing is how large it was and it did not make any noise was totally silent the truth of the matter is if I had a video camera I don't think I could of used it due to the factI was in such shock seeing this thing. the whole sighting took from 3-5 minutes before it went out of sight. this was a once in a lifetime experience that has stayed with me my whole life I was 16 then.I read a lot about triangle craft. What I can say is that the object I saw was going 10 to 20 mph no noise what so ever triangle in shape, 2 football fields large and black and nothing we have today is anything like this no Aura ,stealth, human made anything this was from out of this world or maybe they have been here all along."],"Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Owasco","This sighting has never been favorited."],"Latitude":"42.855","Case Number":"20027","Log Number":"US-10192009-0016","Tags":"City","Summary":"Triangle craft in 1982 in upstate NY.","Date of the Event":"09/15/1982 12:00 UTC","Object Features":"Undisclosed","Object Shape":"Boomerang, Triangle","Country":"United States","Viewing Distance":"Unknown","City":"Owasco","Longitude":"-76.46556","files":["/var/www/straped/mufon/html2text/20027.html.txt","/var/www/straped/mufon/org/20027.html"],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=42.855,+-76.46556(20027)&iwloc=A&hl=en\"> mufon case (20027) map </A>","Region":"New York","Weather Factors":"Unknown","Date Submitted":"10/19/2009 07:18 UTC"}