{"Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Summary":"saw large triangular shape at night , silent, smoo","Longitude":"-94.919814","Date of the Event":"11/30/2002 07:45 UTC","trends":["There have been 8 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around November 30th 2002"],"Log Number":"US-08072011-0070","map":"<A HREF = \"http://maps.google.com/maps?q=39.315761,+-94.919814(2002)&iwloc=A&hl=en\"> mufon case (2002) map </A>","Region":"Kansas","Latitude":"39.315761","Object Flight Path":"Unknown","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI was standing on my back porch looking up at the night sky, and it was amazingthat I had just thought to myself thast I onlt had about a thirty degree view ofthe overhead sky because I have a canvas awning over the back deck. I pftenlook up at the stars and have on numerous occasions been lucky enough to see asatelite.I was looking straight up and noticed three points of light that I st firstthought to be stars. I then noticed that they were moving...in unison. theyformed a triangle of sorts. I could not make out any surface detail. It semedto be a matte or dark color, if it was a color. I even think it could have beentransparent. I continued to look at it. To say the least, I was shocked. Itwas moving towards the north, slowly. Gently, flowingly, and silently itchanged direction towards the north east and then to the north west.It was ableto change direction witin the span of its own size on its own axis I thenthought it had the same type of fluidity of motion that a glider aircraft wouldhave. But that doesnt make sense either. Within less tghan a minute I could nolonger see it. It blended in with the backdrop of stars. Man the strange thingis this was huge, and it was dead silent. But why the lights This was strange. I live 20 miles from Kansas City Intl Airport and I see aircraft all the time. But this made NO noise, it had NO lights from passenger compartments, NO landinglights, NO flashing lights.I dont know what my lat and long is."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/2002.html.txt","/var/www/straped/mufon/org/2002.html"],"Date Submitted":"11/30/2002 07:45 UTC","Object Features":"Other","Case Number":"2002","Sighting Duration":"00:00:59","Source":"MUFON","City":"Leavenworth"}