{"Case Number":"20024","divs":["sighting detailson wednesday, october 14th just before 8 om, my brother called me as he was driving back home from tucson. as he was driving in to maricopa, he saw several orange lights appear around the a harrah's casino. my family notices these orange flights somewhat regularly around town, hovering above neighborhoods or on the outskirts near the dairy farms and such. we have no idea what they are. so i hopped in my car and my boyfriend and i drove a couple minute's drive out to west farrell road and n maricopa road\\highway 347, right next to harrahs. we saw three sets of bright orange lights hovering above the field behind the casino. the middle set of lights were lower than the other two. we stayed for about 10 or 15 minutes, and in that span of time most of the flights flickered on and off a couple times before completely going out. a couple minutes later, we saw one set of lights reappear a little further to the south west. we used our binoculars, but still couldn't figure out what the light source was. i took a short video of this final set of lights on my iphone before we headed back home."],"Tags":"City","files":["/var/www/straped/mufon/html2text/20024.html.txt","/var/www/straped/mufon/org/20024.html"],"City":"Phoenix","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.455267,+-112.072247(20024)&iwloc=A&hl=en\"> mufon case (20024) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"33.455267","Longitude":"-112.072247","Summary":"Three sets of orange flights seen hovering behind Harrah's Casino in Maricopa, AZ.","Disposition":"Unknown","Region":"Arizona","Date of the Event":"10/14/2009 07:55 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Date Submitted":"10/19/2009 04:41 UTC","Viewing Distance":"Unknown","Object Shape":"Sphere","Log Number":"US-10192009-0013","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 14th 2009","This sighting has never been favorited.",""],"Source":"MUFON"}