{"Object Flight Path":"Unknown","divs":["sighting detailsi was physically sleeping when a \"power\" started \"pulling\" my consciousness upwards. there were loud thunderclaps as i moved through golden circles as if in a vortex. i looked up and saw a bearded man who looked like jesus and krishna. he was smiling fixedly at me and his eyes were unnaturally large. he appeared to have tongues of fire about his head. his smile seemed to indicate he was pleased with me. around his head was the blackness of deep space. i thought why doesn't he ever speak to me in my dreams as we looked at each other. (i have seen this particular being on several occasions.) before i had completed that thought there were three loud syllables uttered. the third syllable ended with a roaring sound and i found my self wide awake in bed. these experiences have occurred to me so often in my life that as soon as i felt my consciousness being drawn inexorably upward i thought with some irritation: now what? this is only one of many experiences. thank you for your time. would you please forward this to: craig r. lang, ms cht certified hypnotherapist, anomaly researcher\\investigator author, the cosmic bridge ph# 763-257-7334 crlang@mm.com www.thecosmicbridge.com www.craigrlang.com"],"Summary":"Experienced being taken \"up\" within circles of golden light and thunder","trends":["There has been one other sighting in Lino Lakes","There were no other sightings in Lino Lakes on or around June 7th 2008"],"Weather Factors":"Does Not Apply","Source":"MUFON","Object Shape":"Disc, Sphere","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=45.169514,+-93.083412(20026)&iwloc=A&hl=en\"> mufon case (20026) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Latitude":"45.169514","Date Submitted":"10/19/2009 05:16 UTC","Country":"United States","Log Number":"US-10192009-0015","Disposition":"Unknown","City":"Lino Lakes","Object Features":"Undisclosed","Tags":"City","Date of the Event":"06/07/2008 11:00 UTC","files":["/var/www/straped/mufon/html2text/20026.html.txt","/var/www/straped/mufon/org/20026.html"],"Case Number":"20026","Longitude":"-93.083412"}