{"files":["/var/www/straped/mufon/html2text/20029.html.txt","/var/www/straped/mufon/org/20029.html"],"trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around January 13th 1998"],"Latitude":"33.43546","Tags":"City","Region":"Arizona","Longitude":"-111.934065","Case Number":"20029","Object Flight Path":"Path with directional change","Weather Factors":"None","Object Shape":"Saturn-like, Unknown","Date Submitted":"10/19/2009 09:36 UTC","divs":["Sighting DetailsIn January 1998, my wife had just returned home from an Army deployment in Bosnia. Upon picking her up in NC and returning to Tempe, AZ (our home at the time), we spent an evening reconnecting in our backyard on the trampoline. We hadn't seen eachother in almost 7 months and I was very playful doing backflips and the such to show off. After exhausting myself and coyfully trying to talk her into joining me on the trampoline, she made an observation in the night sky just above me. She observed a descending bright light that we first thougt was an airplane in the pre-dusk sky. I promptly looked up to where she indicated and noticed the same thing. As the light descended, it came to an ubrupt stop, then changed into a bright red, elongated line. As an Army Aviator I was stunned at what I just witnessed. The light then became a black dot and then \"shot\" out of the atmosphere. It was not that dark yet and very clear against the bluish sky that it moved faster than anything I have ever seen. Even though I am not convinced that I witnessed a \"ufo\", this experience haunts me to this day. My wife and I are extremely skeptical and worldly people, yet we cannot explain the strange occurrence of that night. My gut tells me, but can't convince me that I and my wife witnessed something other-worldly. After 17 years of Active duty in the Army, I now feel compelled to tell our story, as insignificant as it may seem."],"Summary":"descending yellow light, then red, black spot and gone","Country":"United States","Source":"MUFON","City":"Tempe","Date of the Event":"01/13/1998 05:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.43546,+-111.934065(20029)&iwloc=A&hl=en\"> mufon case (20029) map </A>","Disposition":"Unknown","Object Features":"Other","Log Number":"US-10192009-0018","Viewing Distance":"Over One Mile"}