{"Case Number":"20031","Object Shape":"Circle, Sphere","Region":"Pennsylvania","Tags":"City","trends":["There have been 3 other sightings in Horsham","There were no other sightings in Horsham on or around October 19th 2009"],"Longitude":"-75.128506","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Weather Factors":"Unknown","divs":["sighting detailsi was conducting zone inspections of our base. i glanced up and noticed two amber orbs traveling ese around 300 to 400 mph. they did not have any anti collision lights. they seemed to dim and brighten erraticlly but slow. they were about a thousand ft. apart one behind the other moving in a straight line. after about 30 seconds they simultaneously dimmed out completely. there was no faint outline once they were lights out. they never reappeared. my first thought was that they were military aircraft until they shut off there lights. military aircraft only do that in a theater of war not in heavily congested airspace over u.s. soil like philadelphia and it's suburbs. aside from the heavy air traffic the skies were completely clear, no clouds and you could see every star in the sky. i've spent the last 14 years in the navy with the first 10 in aviation as an aviation structural machanic working on f-14 tomcats a\\b\\d, mh-53 sea dragons, ch-46 sea nights and mh-60s nighthawks. the last 4 as a military police officer. i know aircraft! they were not civilian or military. they were either topsecret a\\c or offworld."],"City":"Horsham","Date of the Event":"10/19/2009 08:25 UTC","files":["/var/www/straped/mufon/html2text/20031.html.txt","/var/www/straped/mufon/org/20031.html"],"Log Number":"US-10192009-0020","Summary":"Two amber orbs traveling east south east over NAS JRB Willow Grove.","Object Features":"None, Unknown","Country":"United States","Source":"MUFON","Sighting Duration":"00:00:30","Date Submitted":"10/19/2009 10:17 UTC","Viewing Distance":"Over One Mile","Latitude":"40.178442","map":"<A HREF = \"http://maps.google.com/maps?q=40.178442,+-75.128506(20031)&iwloc=A&hl=en\"> mufon case (20031) map </A>"}