{"Date of the Event":"10/17/2009 10:00 UTC","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 17th 2009"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-112.072407","Object Shape":"Flash, Sphere","Log Number":"US-10202009-0003","files":["/var/www/straped/mufon/html2text/20039.html.txt","/var/www/straped/mufon/org/20039.html"],"Summary":"Bright orange color object(s) seen transiting slowly; then instantly disappears; then it reappears shortly later; flashes a bright light, then totally disappears.","map":"<A HREF = \"http://maps.google.com/maps?q=33.450377,+-112.072407(20039)&iwloc=A&hl=en\"> mufon case (20039) map </A>","divs":["Sighting DetailsOn October 17, 2009 around 10:00AM in Mesa, AZ, I was busy and diligently doing stuff on my computer --the computer's monitor is situated directly and closely in front of a large window-- when an orange object(s) transiting in the sky away from me heading East caught my attention. The orange object came from a direction that I normally don't see jets transiting except for one occasion: it was large military jet I think flying at an extremely and ridiculously low altitude. As I was watching the bright orange, color object through the window, I was thinking that it might be one of those commercial jets which has some orange paint on it as part of its logo. But the one thing that was odd about it, the orange object's speed was way too slow for it to be a jet. As I lazily sat there in my chair watching the orange color object, I was beginning to think that it could be just a balloon that I was seeing transiting. As I slightly squinted my eyes and strained to see it better because of the bright sunlight, it looked like there may be 2 orange color, round objects. It almost seemed like 1 orange and round object (which was slightly bigger) was rotating upwards somewhat around the smaller orange color and round object. For about 10 or 15 seconds I was observing these orange color objects when it just disappeared instantly in the sky. The orange objects didn't just fade away; it just instantly disappeared! I thought to myself, \"Now that's strange!\" I then rushed outside onto my patio, and I peered in the general area in the sky intensely to see if this orange object(s) can be seen, or if it would reappear again. For about a minute or two, I watched the area of the sky where I once saw the object, but I didn't see it again at that moment. I then walked back inside and sat down in front of my computer, and I gazed out the window again thinking to myself, \"What was that?\" It wasn't no more 30 seconds after I sat down that I saw the orange object again in almost the same area of the sky. It only briefly appeared bright orange, then I saw a flash of brilliant light similar to sunlight being reflected off a mirrored surface, then I saw nothing more in the sky. I immediately jumped out of my chair; and I grabbed my camera which was nearby, then I quickly hurried outside onto my patio. All that took less than 5 seconds. I was determined to get a picture of what ever it was that was flying in the sky. I looked again with extreme determination in the general area of the sky, but still I didn't see anything including while I was looking through my telescopic lens on the camera. I watched the sky for about 5 minutes. Then I came back inside into the apartment, and I watch the sky from the chair with the camera on my lap for about 10 minutes. But I didn't see anything after that second time. As I recollect, the sky was absolutely clear and brilliantly blue. No wind was blowing; it was dead calm. The humidity was very low, and the temperature around mid 80's. There was no noise of a jet that could be heard, and no contrail was seen anywhere in the sky. The object was seen at a low altitude that most jet around here fly at. The object distant was not far away in distant from me: maybe at 4 or 5 football lengths at the most. If I was to hold something like a pea at arms length away from me, the object size would probably be between either one-quarter or half the size of a pea."],"City":"Phoenix","Weather Factors":"None","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","Latitude":"33.450377","Date Submitted":"10/20/2009 01:33 UTC","Source":"MUFON","Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile","Case Number":"20039","Disposition":"Insufficient Data"}