{"files":["/var/www/straped/mufon/html2text/20037.html.txt","/var/www/straped/mufon/org/20037.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.169167,+-70.924444(20037)&iwloc=A&hl=en\"> mufon case (20037) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"10/20/2009 12:26 UTC","Log Number":"US-10202009-0001","Longitude":"-70.924444","Country":"United States","City":"Madbury","Region":"New Hampshire","Source":"MUFON","Case Number":"20037","divs":["Sighting DetailsWe were outside of our house in Madbury NH(we live in the country) on October 19 2009.Starting at 11:00 pm and we went inside at 11:45 pm.It is 35 degrees outside.We noticed 3 bright white lights with flashing red light on bottem center and yellow,green and blue flashing lights on the sides. We used banoculers and the objects seemed to be spinning but stayed in one place. We really could not make out the shape because they were spinning that it was hard to make out.With the naked eye they looked star like but a little bigger and very bright. We tried to take pictures but could not zoom in enough.We thought maybe the 1st one we saw was a plane,do to the red light flashing but when we noticed it was not moving and there was more then one color of light flashing we were not sure what it was..When we then noticed the other two near the first one...We were very curious..We could also hear a loud hum noise..Like you were standing next to a transformer(no transformers near us)(Which led us to google and then to this site mufon.com)We watched for about 45 minutes until they just vanished into thin air. We will keep an eye out the next few nights and will report if we see this again.."],"Latitude":"43.169167","Summary":"3 bright lights with flashing colors","Disposition":"Unknown","trends":["There has been one other sighting in Madbury","There were no other sightings in Madbury on or around October 19th 2009"],"Date of the Event":"10/19/2009 11:00 UTC","Object Shape":"Diamond, Star-like","Tags":"City","Weather Factors":"None","Object Flight Path":"Stationary"}