{"Date Submitted":"10/19/2009 10:25 UTC","Summary":"There were three of them in a triangular formation moving at a slow speed, followed by a fourth one about 10 minutes later.","Object Shape":"Fireball","City":"Grand Blanc","Case Number":"20032","Latitude":"42.934328","Country":"United States","Region":"Michigan","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20032.html.txt","/var/www/straped/mufon/org/20032.html"],"Longitude":"-83.626732","trends":["There have been 5 other sightings in Grand Blanc","There were no other sightings in Grand Blanc on or around May 31st 2009"],"Object Features":"Undisclosed","divs":["Sighting DetailsWe were at us-23 drive-in movies on Fenton Rd between Hill and Maple roads waiting for the show to begin. When I noticed a fireball looking object coming from the east and positioned north of the theater. A few seconds later two more fireball looking objects positioned themselves under the first one to form a triangular formation. They were moving at a very slow rate of speed and consistently remained the same amount of distance from one another. There were no blinking lights on the objects. There were an orangish bright color like the sun. I couldn't believe it, I tried to photograph it with my cell phone but it wouldn't show up. I could only view blackness in my phone. I kept following the path of the objects until they disappeared from view into the clouds. Approximately 10 minutes later and after the movie had started a fourth object with the exact same appearance came from the same direction and headed in the same direction as the other three. It was moving at a higher rate of speed and I followed it too until it dissappeared into the clouds."],"Weather Factors":"Unknown","Date of the Event":"05/31/2009 12:00 UTC","Source":"MUFON","Log Number":"US-10192009-0021","Disposition":"Insufficient Data","Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.934328,+-83.626732(20032)&iwloc=A&hl=en\"> mufon case (20032) map </A>"}