{"Longitude":"-98.810752","Country":"United States","trends":["There have been 2 other sightings in Eastland","There were no other sightings in Eastland on or around October 19th 2009"],"Region":"Texas","files":["/var/www/straped/mufon/html2text/20034.html.txt","/var/www/straped/mufon/org/20034.html"],"Date of the Event":"10/19/2009 08:20 UTC","City":"Eastland","Case Number":"20034","Date Submitted":"10/19/2009 11:16 UTC","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unknown","Object Flight Path":"Stationary,Other","Latitude":"32.40616","Log Number":"US-10192009-0023","Weather Factors":"None","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.40616,+-98.810752(20034)&iwloc=A&hl=en\"> mufon case (20034) map </A>","Object Shape":"Circle, Star-like, Other","Summary":"White, orange lights seen near Lake Leon, Eastland County, Texas; singularly and then 3 in row, horizontally.","divs":["Sighting DetailsAt about 2020, my husband and I were driving South on 2461, and at approximately 30-50 yards South of the intersecting lights on 570 and 2461, my husband saw a white light that contained some orange color to it, appear and then disappear. It was low to the ground, around maybe 1-2 miles up. It was difficult to determine the distance it was from us. It did not move, only appeared bright and then disapeared. He did not know what the object was, he only knew it was like a star, but much brighter. He asked me if I saw the bright light, and I told him I did not. I asked him if it was a reflection or an airplane, and he said no. After it disappeared, we both continued to look for it, but it did not reappear at that time. I did eventually see an airplane's lights at a much farther and higher distance and mentioned this to him, and we decided it could have been a plane. We arrived home and unloaded shopping bags from our vehicle. I got some books from inside the house and left again. I drove up my driveway, turned to the Southwest and the light appeared very brightly, only once, and again disappeared. To me, this light was a light orange color. It did not appear white to me. I called my husband, who had stayed behind at our home, on my cell phone and told him I saw his light. I continued driving to the LaMancha entrance and stopped, looking in the same direction the orange light had been. At this time, I do not recall if I saw it again or not and my husband does not recall if I mentioned seeing it a second time. I turned right on 570 heading Northeast, followed a curve to the East, Southeast, to cross the dam. At this time, my husband was still on the phone with me and he went outside to look more. As we were talking, 3 orange lights appeared in the East-southeast direction and were lined up horizontally. They remained on for 1-2 seconds and disappeared. We both saw this at the same time. This was closer to just before 2100, approximately 2050-2055. After we saw this, I became very excited, but sort of nervous because I did not know what this was. My husband just told me to deliver the books and get back home. As I drove to deliver the books, we remained on the phone together talking because I was nervous driving alone, and we saw airplane lights that seemed to be watching the area where these lights were. When I got to my destination, I watched momentarily and noticed fast-moving airplane lights and another airplane or helicopter below the 2 fast-moving ones. All of them appeared to be circling the area where the lights had been."]}