{"Sighting Duration":"00:10:00","Object Features":"Other","Log Number":"US-10192009-0024","trends":["There have been 15 other sightings in Amarillo","There was one other sighting in Amarillo on or around October 17th 2009"],"Tags":"City","City":"Amarillo","Summary":"Bright blue white diamond shape that dropped red sphere","Date Submitted":"10/19/2009 11:18 UTC","Object Shape":"Diamond","Viewing Distance":"Unknown","Latitude":"35.231397","Longitude":"-101.825377","Country":"United States","Date of the Event":"10/17/2009 07:20 UTC","Disposition":"IFO","Case Number":"20035","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=35.231397,+-101.825377(20035)&iwloc=A&hl=en\"> mufon case (20035) map </A>","Weather Factors":"None","Object Flight Path":"Stationary","Source":"MUFON","divs":["sighting details while my wife was driving to store 5601 amarillo blvd west i ( passenger) noticed a very bright star to the west at the intersection of avondale and west 9th. when we got to store i pointed it out to my wife. the next night we are at 2530 s georgia we came out of the store it was 7:20 pm and the car is parked to the south and in the sw sky is the bright star again. we get out the field glasses to get a better look. the man in the truck next to ask what we are looking at. he sees it also and then a few other people notice it in the parking lot too. what we see is a blue white diamond shape object very bright. in the field glasses it appears to have 4 bright spots going across a line that would be 1\\4 down from the top. my wife looks with the field glasses and sees the red sphere dropping from the white line heading to the bottom or point of the object. other noticed the red sphere as it existed the object and drifted down out of the object. then the white object changed it shape to an inverted tear drop and then both red and white objects faded away. time was about 7:30. the object was still all during our viewing of it.are feelings in awe of what we had seen. as so were others in the parking lot."],"files":["/var/www/straped/mufon/html2text/20035.html.txt","/var/www/straped/mufon/org/20035.html"]}