{"divs":["Sighting DetailsBest friend and i were walking through field at strathacona community centre(pender st east& princess ave)on our way home something made me look up and i saw 4 or 5 green orbs buzzing around each other then going together tight right away i knew they were not man made. Then an aquientence of ours came towards us from other entrance on(keefer st east & heatly ave) i will always remember her because Sarah Devries beccame one of the first 39 missing women from the downtown east side. Together the three of us watched these green lights buzz around each other then come together tight about three or for times i am sure we watched these green glowing ufos for approx 25 min then they formed a straight line and started to blink one after anotherfrom left to right.then all of sudden a thick green laser beam shot out towards the south west from the objects and they were gone. Right after that the four spot lights at the P.N.E. turned on and started to shine and rotate to wards the sky.Iwas left exilarated. I would welcome a hypnotist to help me recall exact time and date. There was another time i saw a slow moving ufo that left a long sparkling trail behind it.bright sunny day 3pm. I promise that the above is true!!!"],"Object Flight Path":"Path with directional change,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/20040.html.txt","/var/www/straped/mufon/org/20040.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.733368,+-127.643651(20040)&iwloc=A&hl=en\"> mufon case (20040) map </A>","trends":[],"Region":"British Columbia","Viewing Distance":"20 Feet or Less","Date Submitted":"10/20/2009 02:27 UTC","Longitude":"-127.643651","Object Shape":"Circle, Disc, Sphere","Latitude":"53.733368","Country":"Canada","Sighting Duration":"Undisclosed","Weather Factors":"Medium","City":"Undisclosed","Case Number":"20040","Log Number":"CA-10202009-0004","Disposition":"Unresolved","Date of the Event":"10/15/1993 12:00 UTC","Tags":"City","Summary":"4or5 green ufos swarmed around each other then came together tight then blinked one after another in straight line left to right.","Object Features":"Dome","Source":"MUFON"}