{"City":"Undisclosed","Longitude":"-81.513294","Object Flight Path":"Straight-line path","Case Number":"20048","Region":"Florida","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"10/20/2009 03:45 UTC","files":["/var/www/straped/mufon/html2text/20048.html.txt","/var/www/straped/mufon/org/20048.html"],"Date of the Event":"03/31/2009 12:00 UTC","divs":["Sighting DetailsI was driving south on scenic hwy, towards town at about 9 PM.i saw what appeared to be a plane making an approach to the airport. i noticed that it seemed to be flying to low and too slow. i watched it until i got to Hyde Park Drive and pulled over to the side of the road. My son and i watched as it crossed Hyde Park at a very slow rate of speed, about 15 or 20 mph. it made no sound whatsoever. it crossed Hyde Park and continued north following the path of scenic hwy. we were both astounded and he said \"Its going too slow and its not making any noise.\" he is autistic and i was surprised he mentioned it at all. It was triangular in shape and about 200 feet long and about 75 feet wide. it had bright white lights along its edge and a orange glow coming from the rear. i have included a sketch i made. It was like nothing i have ever seen before and i have seen many strange things in my life. It was no more than a hundred feet or so in the air and no more than a few hundred feet from me. i am a land surveyor so i have a pretty good judge of distance. we watched as it continued north along scenic hwy. i don't know why i didn't turn around and try to follow it. i have included a sketch i made."],"Disposition":"Unknown","Object Features":"Undisclosed","Summary":"spotted something on scenic hwy","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=27.671287,+-81.513294(20048)&iwloc=A&hl=en\"> mufon case (20048) map </A>","trends":[],"Log Number":"US-10202009-0012","Latitude":"27.671287","Country":"United States","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Tags":"City"}