{"Summary":"Huge triangle over me, moving slow with three red lights.","Date of the Event":"10/19/2009 09:15 UTC","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Region":"California","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20046.html.txt","/var/www/straped/mufon/org/20046.html"],"Case Number":"20046","Country":"United States","City":"Fresno","Object Features":"Unknown","Log Number":"US-10202009-0010","Source":"MUFON","Latitude":"36.753347","Longitude":"-119.769566","Date Submitted":"10/20/2009 11:51 UTC","Tags":"City","Sighting Duration":"00:00:15","map":"<A HREF = \"http://maps.google.com/maps?q=36.753347,+-119.769566(20046)&iwloc=A&hl=en\"> mufon case (20046) map </A>","trends":["There have been 63 other sightings in Fresno","There was one other sighting in Fresno on or around October 19th 2009"],"Weather Factors":"Unknown","divs":["Sighting DetailsOn 10-19-09 at or about 2115 hours I was sitting on my patio smoking before getting ready for work. I heard the sound of two jet fighters taking off from FAT, this is normal and I can always see them during the day or their lights at night because the wind blows from the west here and that's how the air traffic works out of FAT, most of the time. I was looking for the Air National Guard fighters and didn't see them like I always do. I looked down for a sec and something caught my eye. I looked back up and saw something huge, dark as the night sky, moving from north to the south, three red lights forming a triangle with one flashing light on the left side. It was moving slow and there was sound like a jet engine. This thing was huge. I can't say how huge or high it was because it's hard to guess. If I tried to guess, I'd say it was 200 ft and the size of a football field. When I first saw it, I thought it was normal air traffic because everything out of FAT flys over me. However, all the air traffic that does fly over me has their landing or take off, cabin lights on. This thing was blacked out except for those red lights. I was frightened by this because I didn't know what it was. I told my wife and she said she'd saw the same thing a year ago. After I saw this I only told two people for fear of what people might think or say. I lost sight of it as it passed over me traveling south and over my roof. I think it was something we have because of this. Aliens don't need anti-collision lights or jet engines. I would think. So here's your report...It still freaked me out."]}