{"Case Number":"20051","Country":"United States","Log Number":"US-10212009-0001","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"36.040895","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Longitude":"-114.976621","Object Features":"Unknown","Weather Factors":"None","Date of the Event":"10/19/2009 02:30 UTC","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around October 19th 2009"],"Summary":"I saw 3 floating lights hovering above a mountain which then came and flew over me low and turned hard and flew away all silently","map":"<A HREF = \"http://maps.google.com/maps?q=36.040895,+-114.976621(20051)&iwloc=A&hl=en\"> mufon case (20051) map </A>","files":["/var/www/straped/mufon/html2text/20051.html.txt","/var/www/straped/mufon/org/20051.html"],"Region":"Nevada","Sighting Duration":"Undisclosed","Object Shape":"Diamond, Unknown","City":"Henderson","divs":["Sighting DetailsIn the early morning hours of the 19th of October, 2009, I was returning to my home in the SE part of henderson when I noticed three extremely bright lights hovering over the mountain my home resides no more than 3 miles away from me. I was immediately curious and pulled onto a dirt road outside my neighborhood to watch the strange lights. After staring for about 7 to 10 minutes I decided that perhaps they put lights on top of the mountain for some reason when I finally noticed the lights to be getting brighter. I exited my vehicle to get a better look at what was now traveling towards me because I began to think it was an airliner yet it was making no noise and was flying too low over the mountain to be one. I immediately when for my phone to try to get a picture but my phone was acting strange and I could not get to its camera. I watched as this silent object moved towards me and eventually I noticed that on the bottom side of it were 5 large, extremely bright, rectangular-shaped lights. Due to the lights unearth it and the dark sky I was unable to determine the shape of the object but I would guess it was almost diamond shape due to the locations of other bright white lights on it. This object had my completely transfixed, I could not remove my gaze for it and I wantd to take a picture and call out for other people but I was frozen in shock, and curiosity. It flew very low over me compared to all airliners in my area i would say approximately 400 feet. after flying over me it made a hard turn towards the north and turned extremely shap for an object of its size rather effortlessly. I saw it continuing to turn and it had made a 270 degree turn quickly and disappeared behind the mountain."],"Disposition":"Unknown","Tags":"City","Date Submitted":"10/21/2009 01:47 UTC"}