{"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/20052.html.txt","/var/www/straped/mufon/org/20052.html"],"Latitude":"40.765209","Tags":"City","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.765209,+-111.887177(20052)&iwloc=A&hl=en\"> mufon case (20052) map </A>","Object Shape":"Triangle","Summary":"Triangle shaped object, dull red corners like glowing embers, grey bottom","Case Number":"20052","Date of the Event":"10/20/2009 10:45 UTC","divs":["Sighting DetailsWe were behind an office complex having a conversation when I looked up and saw what I thought was a shooting star and then I noticed there were three moving objects, not just one. They were dull red lights connected and the base of the object appeared to be grey or dullish grey. I grabbed my friend and pointed up and he saw it drifting North also. We watched it for under half a minute. It was traveling North and then it was obscured by the city lights of SLC. It was stunning. At first I thought it was a shooting star, as we see those a lot in Utah. Then, seeing that it did not fade I suspected it was an airplane as it was parallel to the SLC flight path (heading North). Then it had no flashing lights, only a soft reddish glow (like hot metal or burning embers?). Then it was gone. The hair stood up on the back of my neck. I was stunned and amazed at what I saw. I was frightened and amazed at the same time. I kept looking to the sky after it was gone to see if it would happen again, but I did not see it again. I did call out to another person who was 20 feet away from us but he was too late looking up to see anything. It drifted off into the lights of SLC so I could no longer see it. SLC = Salt Lake City"],"Date Submitted":"10/21/2009 02:12 UTC","Log Number":"US-10212009-0002","Region":"Utah","Object Features":"None","Sighting Duration":"Undisclosed","City":"Salt Lake City","Weather Factors":"None","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around October 20th 2009"],"Object Flight Path":"Hovering then path","Source":"MUFON","Longitude":"-111.887177","Country":"United States"}