{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/20059.html.txt","/var/www/straped/mufon/org/20059.html"],"Source":"MUFON","Log Number":"US-10212009-0009","Summary":"saw a very large ufo over our house","Country":"United States","Date Submitted":"10/21/2009 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.32186,+-82.350553(20059)&iwloc=A&hl=en\"> mufon case (20059) map </A>","Longitude":"-82.350553","trends":["There have been 7 other sightings in Johnson City","There were no other sightings in Johnson City on or around October 8th 2009"],"City":"Johnson City","divs":["Sighting Detailson oct.8,2009 at approx. 10:00am my wife saw a very large ufo over our house in jonesborough,tn. she described it as being very large(bigger than our house),white and shaped like a disk with dome shaped top. it was not very high by her estimate (probable less than 1000ft.), it was almost motionless and it was silent. it's edges were rounded instead of being sharp and there appeared to be something like windows around the bottom part. we left the house and about one-half mile away she saw it again. she became excited and told me it was aliens. i saw the object which i first took to be an airplane seen from the side, but it was motionless and silent. i could not stop because another vehicle was behind me but i did see it as i drove to a place to stop. we turned around and drove back to get a look. we saw the object which was probable less than one-half mile away. it went from being motionless to assuming a constant speed. it did not slowly accelerate, it just assumed a speed or velocity. it changed course, moved away from us quickly went to a distant point of light."],"Object Features":"Dome, Window(s)","Region":"Tennessee","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/08/2009 10:00 UTC","Case Number":"20059","Object Flight Path":"Stationary","Latitude":"36.32186","Object Shape":"Disc","Weather Factors":"None","Sighting Duration":"Undisclosed"}