{"City":"Gresham","Country":"United States","Object Features":"Unknown","Longitude":"-122.427731","Case Number":"20053","divs":["sighting detailsat approximately 8:45pm on october 20th, i saw a low flying jet fly above my grandmother's house as i walked to my vehicle. as i watched where it was heading, i saw a low, hovering gathering of lights. i decided to drive toward the object to get a better look, and i saw what appeared to be a square\\multisided shape with various colored lights (red, blue and white. the red lights slowly blinked) hovering over some houses and countryside. several (what appeared to be) jets or airplanes were in the area, flying in the general area of the craft, and kept changing their direction, in what appeared to be pursuit or at least surveillance of the craft. as i drove nearer to the craft, i could hear a loud rumbeling sound. i drove back to my grandmother's house, and grabbed my grandmother's camera, and she and i went after the craft again. i took some pictures, but nothing turned out. we followed the craft down pleasant valley road towards boring, or. we kept losing sight of the craft through the trees, but kept seeing various jets flying overhead. eventually, we turned back toward my grandmother's house. to the south, we saw what appeared to be the craft swiftly speed up to the sky and slowly fade away. i am still very shaken up about this."],"Sighting Duration":"Undisclosed","Summary":"UFO over Gresham outskirts being circled by fighter jets?","Date Submitted":"10/21/2009 02:33 UTC","Object Shape":"Disc, Square, Rectagular","files":["/var/www/straped/mufon/html2text/20053.html.txt","/var/www/straped/mufon/org/20053.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.508906,+-122.427731(20053)&iwloc=A&hl=en\"> mufon case (20053) map </A>","Log Number":"US-10212009-0003","Viewing Distance":"101-500 Feet","Latitude":"45.508906","Tags":"City","Disposition":"Unknown","Source":"MUFON","Weather Factors":"None","Region":"Oregon","trends":["There have been 19 other sightings in Gresham","There were no other sightings in Gresham on or around October 20th 2009"],"Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"10/20/2009 08:45 UTC"}