{"Country":"United States","files":["/var/www/straped/mufon/html2text/20069.html.txt","/var/www/straped/mufon/org/20069.html"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.730108,+-81.238527(20069)&iwloc=A&hl=en\"> mufon case (20069) map </A>","Disposition":"IFO","trends":["There have been 6 other sightings in Painesville","There were no other sightings in Painesville on or around October 21st 2009"],"Sighting Duration":"Undisclosed","Latitude":"41.730108","Source":"MUFON","Region":"Ohio","Object Features":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"10/21/2009 07:30 UTC","Log Number":"US-10212009-0019","Object Shape":"Star-like","Viewing Distance":"Unknown","Case Number":"20069","Longitude":"-81.238527","divs":["Sighting DetailsThis evening I decided to go out on deck in my backyard to look at the stars. I do this all the time. Tonight I saw something strange, and its been a long time since I have seen anything strange in the sky. I see a bright orange light emerge from behind the trees. It had two whit lights on its sides, maybe on the fuselage or something. As I watch this fly over it does something that surprised me. Suddenly it's lights turn off for about a second, and it lights back up again but with a whole new light patten that looks similar to any regular airplane flying over. I go in the house to tell my husband what I was, of course he looks at me like I am a freak. I go back outside to watch some more and to my surprise I see another orange light (same as the other) coming over the trees and this time I yell for my husband, and of course he doesn't come. Then can you believe it....the orange light gos out and all I see is a red and white blinking light in the distance. This time it seemed to change much sooner then the other one. The first one was closer when the light went out and then changed. I live in the country, and I see planes fly over all the time, this is something I never see. Is this normal behavior of and airplane. Can an airplane change its light pattern in the middle of a flight and is what I described seem normal?? Could this have been a UFO???"],"Summary":"Bright orange light turns into a airplane right before my eyes","Tags":"City","City":"Painesville","Date Submitted":"10/21/2009 10:51 UTC"}