{"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Latitude":"30.334804","Summary":"White streak across sky for 3 seconds at tremendous speed then disappeared.","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around October 21st 2009"],"files":["/var/www/straped/mufon/html2text/20064.html.txt","/var/www/straped/mufon/org/20064.html"],"Date of the Event":"10/21/2009 07:34 UTC","City":"Jacksonville","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"None","Log Number":"US-10212009-0014","Tags":"City","Object Shape":"Flash, Oval","Source":"MUFON","Disposition":"IFO","Region":"Florida","Sighting Duration":"Undisclosed","Longitude":"-81.653641","divs":["Sighting DetailsI stepped out of the European Street Cafe on San Marco St. in Jacksonville, FL and tuened left to walk to my car. I believe I was facing north. I looked up into the dark sky. I saw a white streak travelling at veryhig speed from lef to right, possibly west to east. My first thoughtwas \"if thats a jet, it's moving through the cloud cover (est. 5-10k feet) at an amazin speed\". My next thouht was \" a jet can't move that fast across the sky, regardless of the relatively low altitude\". When the light winked out completely after 2 to three observed seconds, I felt strongly it was no jet- besides, I relized there was no jet noise. Ifit were at a higher than my perceived altitude, I may not have been able to hear it over the ambient city noise, but that would have raised its relative speed to an even higher level, convincing me more that it wasn't a jet. My next thought was \"that may have been the end of life of a meteoror boloid (is that what a glowing burning rock is called?). The color of the speeding licht was white and bluish, possibly accounted for if it was penetrating the cloud cover. There was no yellow flame appearance, or explosion at the end- it just winked out."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.334804,+-81.653641(20064)&iwloc=A&hl=en\"> mufon case (20064) map </A>","Case Number":"20064","Date Submitted":"10/21/2009 08:19 UTC"}