{"Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Date Submitted":"10/21/2009 03:43 UTC","Object Features":"Other","Case Number":"20062","Date of the Event":"10/21/2009 01:30 UTC","trends":["There have been 4 other sightings in Greenville","There were no other sightings in Greenville on or around October 21st 2009"],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20062.html.txt","/var/www/straped/mufon/org/20062.html"],"City":"Greenville","Longitude":"-77.361914","divs":["Sighting DetailsI was out in a field with my friend and we had been there since 9:30pm to see the orionid meteor shower that morning. Around 1 am the meteors began falling more frequently then out of no where a huge bright light just showed up behind a tree. We clearly saw red lights and blue lights alternating with white. It allmost was pulsating and alternating with the blue and red light. The red was on the top right corner and the blue was on the bottom left and the white light was constant and pulsing. It kept moving and disappearing behind the tree and i mention it to my friend \"what is that\" and from that point we stared at it constantly. He joked around and said oooo its a UFO and i said i wont get freaked out until it gets above the tree line. I went through every possible scenerio to figured out what this thing was. 5 min approx. after he joked around and i said something about the tree line it did a direct vertical jump and went straight up in to the middle of the sky and began to hover and it was clearly dancing around and going up and down then left then right then down again and it kept getting dimmer and dimmer and over the course of 4 hours it moved from the tree light up in between 2 stars and stayed there even when the stars moved in the turning of the night going into morning the object clearly made it a point to stay within these two stars. Then around 4 30 am i went to check on it again and i stayed out there prob 15 minutes and the object began to get very bright and then just disappeared within seconds. I am going to sit outside again tonight to see if i can shed some more light on this but i went through every possible explanation and none of them make sense. I called my mother at 3 in the morning asking her what she thought it could be because she used to be in the air force and i didnt know if it was a type of plane, weather balloon, satelite, helicopter, tower, but nothing could explain it i hope someone can help. Please help me shed some light on this i am truely in shock right now. There are no photos of the object because it was to dark to take a good picture but i tried and they all came out black."],"Weather Factors":"None, Does Not Apply","Latitude":"35.618731","Object Shape":"Cone, Circle, Star-like, Triangle","Source":"MUFON","Log Number":"US-10212009-0012","map":"<A HREF = \"http://maps.google.com/maps?q=35.618731,+-77.361914(20062)&iwloc=A&hl=en\"> mufon case (20062) map </A>","Viewing Distance":"Unknown","Summary":"During the Orionid Meteor Shower","Tags":"City","Sighting Duration":"03:00:00","Region":"North Carolina"}