{"Object Shape":"Disc","Country":"United States","files":["/var/www/straped/mufon/html2text/20061.html.txt","/var/www/straped/mufon/org/20061.html"],"Longitude":"-74.159872","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Nutley","There were no other sightings in Nutley on or around March 22nd 1977"],"Tags":"City","Latitude":"40.822317","City":"Nutley","Summary":"40ft across ,over the house across the street on a60 degree angle tome","Source":"MUFON","Case Number":"20061","Log Number":"US-10212009-0011","divs":["sighting detailsi was painting the eave in front of the house prior to buying it through the va. my wife andthe owners son were standing on the walk leading to the front door. it was a quite day,the first nice day of that month. icould hear the traffic from the park way 3\\4s of a mile away, suddenly it became very quiteand i felt the sensation of needles running across my back, i turned tosee the disc over the house across the street hovering at a 60degree angle. i called to my wife and frank, they were looking at not moving i yelled at them to turn and look. they didn't acknowlege me. i felt like i hada muffler over my head as i could hear my self talking,but nothing was coming outi got off the ladder came off the roof my wife and frank did't look at me,they were looking at where i had been. i ran to the side walk wheni got there it started to move very slowly going to the verticle and made 90 degree to west[it was just above the telephone poles it proceded west and rose slightly appox.200ft angled slightly and accelerated at extremely fast rate of speed, i could see aring of light on the leading edge of the disc. i went back to my wife and they asked me where i went. to this day my wife says that she didn't see or hear anything"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.822317,+-74.159872(20061)&iwloc=A&hl=en\"> mufon case (20061) map </A>","Date of the Event":"03/22/1977 02:30 UTC","Weather Factors":"Unknown","Date Submitted":"10/21/2009 03:17 UTC","Region":"New Jersey"}