{"Country":"United States","divs":["Sighting DetailsI never had any reason to look up at the stars unless there was a meteor shower going on but all that changed when I got stuck working the graveyard shift about a year ago. I am a maintenance technician and at work we can't smoke in the break room so me and the guys went outside to burn one. That's when one of the maintenance guys said that recently he saw a bright light in the sky that was turning off and on. And one of the other maintenance guys said he saw something like that too, he said it was weird almost like it was taking pictures because the light would get bright then turn off. Now I have seen this bright light in the sky a total of 3 times since then.The first time in Nov. 2008 around 2:30 am located in the western sky ,thats when from the corner of my eye this very bright light caught my attention.. I kept looking in that direction and saw nothing but a few seconds later there it was again, got real bright then dimmed out. The second time in Dec. 2008 around 3:00 am. in the northern sky a co-worker said hey look over there it's one of those bright flashing lights. We saw it grow in intensity then dim out repeating the cycle for 2 minutes. The most recent sighting was on July 7,2009 at 4:45 am.located in the n.eastern sky.I was outside setting up my telescope, I had plans to see jupitor for the first time through a telescope, the skys were clear and Jupitor was really bright. As I was getting lined up with the spotting scope there it was a bright light that would it grow in intensity then dim out repeating the cycle for only 30 seconds. But this time it acted as if it was trying to mimick a star or a planet."],"Case Number":"20072","Longitude":"-117.285475","Date of the Event":"07/07/2009 04:45 UTC","Log Number":"US-10222009-0002","City":"San Bernardino","Object Features":"None","Region":"California","Date Submitted":"10/22/2009 01:07 UTC","Source":"MUFON","Latitude":"34.114795","Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in San Bernardino","There were no other sightings in San Bernardino on or around July 7th 2009"],"Object Flight Path":"Stationary","Tags":"City","Summary":"Stationary,high altitude, bright pulsing light","files":["/var/www/straped/mufon/html2text/20072.html.txt","/var/www/straped/mufon/org/20072.html"],"Object Shape":"Flash, Star-like","Weather Factors":"None","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.114795,+-117.285475(20072)&iwloc=A&hl=en\"> mufon case (20072) map </A>","Disposition":"IFO"}