{"Weather Factors":"None, Unknown","Tags":"City","divs":["Sighting DetailsI was in the porch, reading a book with the artificial ligth we had there. LosAngeles, July 7, 2000, Silverlake Hills. I saw what I thought could be a lostfirework The 4th of July was close aproaching from the North, over the mountainswith an erratic trajectory, when it was just over my head stopped suddenly andbecame very, very brilliant, with an extremely glowing brigth white light.Itcould be an explosion of some sort. After 30 seconds of so...the ball of lightgrows bigger and projected four rays of light that made a perfect cross. At thispoint I called my roommate and both of us saw the fenomenon. It lasted around 20minutes, after that all that was left was a glowing phosphorescent green light.We were convinced we were seing a real UFO. It was around 920 PM, at 10 PM thenews on TV announced that a U.S missile interceptor launched from a PacificIsland had missed its target a dummy warhead gliding throught space, authoritiessaid Friday. There are pictures in the LA Times of Sunday July 9,2000. However,there are some data that doesnt match with what I saw. For instance what I sawwas the supposed dummy warhead that according to the newspaper continued itscourse towards the Pacific instaid of freezed over Silverlake and diplay thelight show. The first report on TV we heard around 10 PMtalked about the warheadcrashing agains an unidentified object. We never heard this version again. Butwe saw helicopters above our heads flying around the area where we saw thelights. The timing its odd too, since as far as we remember it did happenedbefore according to the news happened. But since the whole thing was part of afailed24100 million test for the anti-missile system we havent heard a word or readanything else beside the loussy report of the Los Angeles Times."],"Object Shape":"Sphere","Object Features":"Unknown","Latitude":"34.058254","Viewing Distance":"Unknown","Case Number":"2007","City":"Los Angeles","Date of the Event":"07/07/2000 09:20 UTC","Log Number":"","Longitude":"-118.239355","Sighting Duration":"00:30:00","Date Submitted":"07/07/2000 09:20 UTC","Summary":"UFO July 7, 2000, around 920 PM Silverlake Hills,","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 7th 2000"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.058254,+-118.239355(2007)&iwloc=A&hl=en\"> mufon case (2007) map </A>","Region":"California","files":["/var/www/straped/mufon/html2text/2007.html.txt","/var/www/straped/mufon/org/2007.html"],"Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Path then hovering","Country":"United States"}