{"City":"Manchester","Object Features":"None","Longitude":"-71.445759","Date of the Event":"10/05/2007 12:00 UTC","Weather Factors":"None","trends":["There have been 19 other sightings in Manchester","There were no other sightings in Manchester on or around October 5th 2007"],"Source":"MUFON","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=42.99719,+-71.445759(20070)&iwloc=A&hl=en\"> mufon case (20070) map </A>","Object Flight Path":"Straight-line path","Case Number":"20070","Latitude":"42.99719","divs":["Sighting DetailsWell I will start from 2 days prior, At about 8 or 9 o'clock pm, I was letting my dog out for a bathroom run before we got settled in. The sky was clear and all the stars were visible. I started to notice a star moving straight for a short period of time pretty fast then suddenly it started going diaginal but at the same speed, so I just figured it was a satilite. The next 2 days went by and I thought nothing of it, until I was letting the dog out again as usual, at about the same time as 2 days prior and I had noticed that the moon was full and huge that night and as I was looking at it from my front steps I noticed a similar star except only this time it was lower or at least seemed lower, and was moving slower than last time. So this time I yelled into the door way for my girlfriend and brother to come out to see what it was that I had been seeing, They came out and I pointed it out to them in which they both saw it, my brother got bored quick and said it was nothing and went back into the house but my girlfriend stayed. We watched it moving from the left of the sky to the right and then suddenly as we were BOTH seeing this star moving it just stopped and did not move at all, NOW SATAILITES DON\"T DO THAT! \"that I know of\". I called my mother instantly to tell her what we were witnessing and as I was talking to her, about ten minutes went by and it was still there in the same spot. I hung up with my mother and started looking at this star with my girl for a little longer, (Now we kept looking because its not everyday stars just stop moving), anyway the star was in the same position for about 15 minutes in tottal when the craziest thing I had ever witnessed had happened. The star got really bright almost as if it was about to become a bigger star then just shot straight up and was gone. The thing is when it happened I felt weird almost like being in a fun house, My brain was not concepting what had just happened almost not believing even though it was staring right in the face. My girlfriend and I Looked at each other at the same exact time after it had dissapeared and yes we both saw the same exact STAR???? Ever since I have been obsessed with finding out some truth to everything. I feel mankind can handle change. I know its a little late for me to be talking about it now but at that time I would not have known who to tell."],"Viewing Distance":"Unknown","Region":"New Hampshire","Sighting Duration":"Undisclosed","Date Submitted":"10/21/2009 11:42 UTC","Tags":"City","Log Number":"US-10212009-0020","files":["/var/www/straped/mufon/html2text/20070.html.txt","/var/www/straped/mufon/org/20070.html"],"Country":"United States","Object Shape":"Star-like","Summary":"unlike anything I would think to be made by mankind."}