{"files":["/var/www/straped/mufon/html2text/2008.html.txt","/var/www/straped/mufon/org/2008.html"],"Latitude":"28.678797","City":"Oviedo","Date Submitted":"12/02/2002 02:26 UTC","Case Number":"2008","map":"<A HREF = \"http://maps.google.com/maps?q=28.678797,+-81.20704(2008)&iwloc=A&hl=en\"> mufon case (2008) map </A>","Object Features":"Undisclosed","Date of the Event":"12/02/2002 02:26 UTC","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Log Number":"","Sighting Duration":"00:10:00","Summary":"Saw an irratic and slow moving light","Object Shape":"Sphere","Region":"Florida","Source":"MUFON","Country":"United States","Longitude":"-81.20704","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","divs":["Sighting DetailsIt was around 226 AM on early December 2nd, 2002. I was busy turning off variouslights in the house and preparing to go to bed. I put my 2 cats out the frontdoor and went to the back of the house to draw my vertical blinds closed thesliding glass door leading to the backyard. As I did so, I noticed a slow,steady moving object with very bright light heading in a SouthSoutheasterlycourse. Living in Oviedo, Florida, we are located between Sanford InternationalAirport and Orlando Insternational Airport and have planes frequently landing ateither airport. I stepped outside to observe the object looking for anypulsating red lights or strobes typical on airplanes. As the object got closerin view, I noticed there were no strobes or red lights seen on wingtips. I alsonoticed the light coming from it was a bluish hazeextremely bright white light.This light was brighter than any landing light seen on an airplane. The lightalso faded a little but never lost its brillance. The light continued its coursewith slight irratic movement to the right. It would almost move slow then speedup going straight sideways only a few meters or so, then continue going forwardagain. After realizing what I was possibly viewing, I noticed that everythingaround me in terms of the environment was extremely still, dead silent and verycold it was cold last night in Orlando, some 40 degrees. The silencestillnesswas very unnerving. This caused a sense of fear in me and something instinct,not telepathy was telling me to get back inside the house. For some reason, Ihad a general fear of the object but was extremely curious. Perhaps, this wasdue to various abduction stories you hear about along with the high profilecases such as Travis Walton. I went back in the house to collect my nerves. WhenI had worked enough courage to look back out, the object was gone completely. Iwonder if Sanford International, Orlando International or NASA picked upanything on radar"],"trends":["There have been 2 other sightings in Oviedo","There were no other sightings in Oviedo on or around December 2nd 2002"]}