{"trends":["There has been one other sighting in Burrillville","There were no other sightings in Burrillville on or around October 22nd 2009"],"Object Shape":"Circle","City":"Burrillville","divs":["Sighting DetailsI was up working late on some files for the next day and went out back to have a smoke. I turned on the light and sat at the table. As I looked out towards the yard, I saw a star that seemed to be flickering. I thought it was something to do with the clouds. I then saw it move to the left and right. I went back in to get my glasses. As I looked more, the light was going side to side, up and down in a 12 inch section of sky. My oldest son has his bedroom next to where I smoke and I knocked on his window to come out. He came out but then went back to get his glasses. He saw the same motions of the object that I had been seeing. We also saw several shooting stars close to the vacinity of the object. There were no flashing lights but it did change in intensity. I called up for my other son but he did not get up. My wife came out to see what was going on and saw this as well. She had to work later and went back to bed. I then called my younger brother in Boston to see if he could see anything from there but it was too cloudy for him. I told him I would talk to him tomorrow. I got my camera but I could not focus the object. My older son got a flashlight with a red laser light and he flashed it at the object. The object then began to move away until it was no longer visible."],"Date Submitted":"10/23/2009 01:24 UTC","files":["/var/www/straped/mufon/html2text/20086.html.txt","/var/www/straped/mufon/org/20086.html"],"Summary":"Circular light danced across a section of sky before disappearing.","Case Number":"20086","Log Number":"US-10232009-0002","Latitude":"41.968333","map":"<A HREF = \"http://maps.google.com/maps?q=41.968333,+-71.683056(20086)&iwloc=A&hl=en\"> mufon case (20086) map </A>","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"10/22/2009 11:50 UTC","Object Features":"None","Viewing Distance":"Over One Mile","Region":"Rhode Island","Country":"United States","Disposition":"IFO","Object Flight Path":"Path with directional change","Longitude":"-71.683056"}