{"Region":"Pennsylvania","Date Submitted":"10/23/2009 12:33 UTC","Object Flight Path":"Undisclosed","Object Shape":"Flash, Unknown","Summary":"Bright flash in the sky followed by a still trail that dissapeared.","map":"<A HREF = \"http://maps.google.com/maps?q=39.787126,+-75.971925(20085)&iwloc=A&hl=en\"> mufon case (20085) map </A>","Tags":"City","divs":["Sighting DetailsOk, Im not entirely sure if it was a UFO that I saw but there is no current scientific explantion of what I witnessed. My friend I were standing in my driveway smoking cigarettes when we both noticed a bright flash in the sky like a camera flash, it didnt really come from any specific point but more of a general area of the night sky, as soon as the flash subsided (which only lasted for a split second) a large streak appeared horizontaly (it appeared all at once, not extending) where the flash came from. I would have thought it was a meteor or comet except for the fact that the streak was not moving, it appeared and stayed completely still, it was incredibly bright and large, probably about the size of orions belt. The streak was a white light but it looked like it had a blueish gray tint around it, it was visible for approximatly 20seconds then it slowly started to fade away until there was nothing there. I have tried to figure out what this was to great lengths only to find there is no explanation for such a celestial occurence. The flash was white and the streak following it was a simple thick line stretching across the night sky, I can not stress enough the fact that the streak did not move, it appeared all at once and stayed where it was until it faded away. To be honest it looked alot like when spacecraft in science fiction movies make a \"jump to hyperspace\", bright flash, followed by a still trail of light, I know that sounds ridiculous but I just want to describe it to the best of my ability. Please if you have heard of anything else like this let me know, I cant let this go unnoticed, Its been killing me, I have never seen anything like it before in my life."],"Country":"United States","Longitude":"-75.971925","Sighting Duration":"00:01:00","trends":["There have been 4 other sightings in Oxford","There were no other sightings in Oxford on or around October 22nd 2009"],"Source":"MUFON","Date of the Event":"10/22/2009 08:15 UTC","Case Number":"20085","Object Features":"Undisclosed","Weather Factors":"Unknown","City":"Oxford","files":["/var/www/straped/mufon/html2text/20085.html.txt","/var/www/straped/mufon/org/20085.html"],"Viewing Distance":"Unknown","Latitude":"39.787126","Disposition":"Insufficient Data","Log Number":"US-10232009-0001"}