{"City":"Preston","Date Submitted":"10/23/2009 04:33 UTC","trends":["There has been one other sighting in Preston","There were no other sightings in Preston on or around October 23rd 2009"],"Latitude":"42.096313","Weather Factors":"None, Does Not Apply","Viewing Distance":"Unknown","Tags":"City","divs":["Sighting DetailsI have been noticing at night many \"shooting stars\" tonight I counted 24 of them. but i the previous last couple of nights I have counted only around 7 to 10. This has sparked my interest in shooting star watching. tonight I was on my back porch when I saw a red shniing object suddenly appear and move over our house so I ran out to the fron door and watched it untill it stopped and ten another shining star like light began binking on and off . Then the red object would do the same.I watched the star like object move over to the red object and they both dissapeared. I sat outside to see if something else would happen, when I oberved many more shooting stars appear ad at one point I saw very far up in the sky a white falsh of light that moved in a spiral motion and the it also dissapeared as well. in terms of describing my feelings I felt no fear but I felt excitement.And I waited outside hoping to see more. Yet on my first observation night of the shooting starss I woke up at 5 am to smoke a cigarette and witnessed sseveral shooting stars in which all were heading in the same direction. I suddenly felt fearful and although it was dark out side I saw something like a shape of a human in the back yard where tall weeds are the only thinng out back besides a small fence to keep in th dogs from getting off the property. The human shape was rather tall and what frightened me the most was that it was coming in my direction and it looked like a vague light was outlining the shape and I could see the tall weeds through it. As it moved closer it did not disturb the weeds as it moved through them.I only witnessed this for about 3 seconds and quickly went back into the house and locked the door. I could not go back to sleep becauseI was so frightened."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.096313,+-111.876617(20087)&iwloc=A&hl=en\"> mufon case (20087) map </A>","files":["/var/www/straped/mufon/html2text/20087.html.txt","/var/www/straped/mufon/org/20087.html"],"Object Shape":"Fireball, Flash, Other","Sighting Duration":"00:45:00","Summary":"Bright red moving object stopped mid air and another object began flashing.","Object Features":"Appendage(s)","Case Number":"20087","Object Flight Path":"Straight-line path,Other","Log Number":"US-10232009-0003","Country":"United States","Disposition":"Insufficient Data","Date of the Event":"10/23/2009 01:30 UTC","Source":"MUFON","Longitude":"-111.876617","Region":"Idaho"}