{"trends":["There have been no other sightings in Seaford","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/2009.html.txt","/var/www/straped/mufon/org/2009.html"],"Date Submitted":"12/02/2002 05:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.641226,+-75.611038(2009)&iwloc=A&hl=en\"> mufon case (2009) map </A>","City":"Seaford","Latitude":"38.641226","Case Number":"2009","Weather Factors":"Unknown","Date of the Event":"12/02/2002 05:20 UTC","Source":"MUFON","Sighting Duration":"00:00:59","Summary":"I saw a green tinted flash traveling across the sk","Longitude":"-75.611038","Viewing Distance":"Over One Mile","Log Number":"","Object Flight Path":"Straight-line path","Country":"United States","divs":["Sighting DetailsI was driving to work going north on Rt 13 and at that time in the morning it isstill dark and there is not a lot of traffic on the road. Out of the corner ofmy eye I saw the object streaking across the sky. At first I thought it was afalling star but first of all it was too big for that and secondly it was greenin color. Finally what made me realize that it wasnt a falling star was the factthat it was traveling south to north, not top to bottom like a falling starwould normally do. My reaction to this sighting was to hit the brakes and swervemy truck involuntarily. Thankfully there were no vehicles around. The objectreminded me of two things. First the size and shape looked like the Haley cometthat was in the sky several years ago but this was green in color and travelingvery fast. Secondly it reminded me of the pictures from the news of misslesbeing fired over in Iraq at night. It was traveling at what I would think themissle rate of speed but looked like the Haley comet, but green. I did becomescared because when it disappeared I was honestly waiting for an explosion tooccur."],"Object Features":"Undisclosed","Region":"Delaware","Tags":"City","Object Shape":"Bullet, Missile","Disposition":"Insufficient Data"}