{"Object Flight Path":"Stationary,Other","Country":"United States","Summary":"Star like, moving fast, changing direction instantly, swaying back and forth.","Disposition":"Unknown","trends":["There have been 4 other sightings in Troutdale","There were no other sightings in Troutdale on or around October 20th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.540796,+-122.382613(20097)&iwloc=A&hl=en\"> mufon case (20097) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20097.html.txt","/var/www/straped/mufon/org/20097.html"],"Region":"Oregon","Longitude":"-122.382613","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"20097","City":"Troutdale","divs":["Sighting DetailsFirst i would like to tell you that about a year ago i wrote you about a sighting i saw. This time there is no dowt in my mind what i saw and a few family members saw. Here is what we witnessed... I was out side with my new dog it was between 10:30-11:30pm Monday October 19 2009,when it started. I was sitting down smoking when i had noticed a loud jet fly by which i thought was strange, then i see a police hellicopter going over my house.(i think 2 hellicopters went by) Dogs are barking and it was just weird to see that. I made a joke about \"war of the worlds\" and as i am standing out in the middle of my yard i see this thing going across the sky. It looked like a sattlelight moving. But then the direction changed, it started swaying back and forth like a rocking motion. There is nothing we have that can do that. I yelled for my brother to come out and see. I pointed to what i was looking at and then he had told me did you see it just stop and take off. I told him that i did and as we were looking he couldn't believe what he was witnessing. I couldn't either! It would zoom fast, sway. So basically it went over my house and changed it direction kind of like a u-turn. We ran out in my front yard and continued to watch it untill we couldn't see it no more. We discussed what we just saw and new that it wasn't something of our own. I was so amazed i went back out to my backyard and started to look up again. In my mind i was expecting something to be on the news because of all of the activity in the sky. Right above my house there is this star formation that has 3 stars across then below it in the middle was another one. Kind of like an arrow shape. The bottom one was moving like it was playing around. Almost like a swimming motion. It looked like a star that was moving to where it wasnt noticable to where if you looked up you would say \"what's that in the sky\" it seemed to be out of the atmasphere. (i can explain it much better talking to someone, it's hard to write what i saw so bare with me) It was going in circles and it would go in one direction and then instantly change direction. It was moving to where it was staying in the star formation. It did this for about an hour or more. I notice that when it moved i can almost see tracers from the light coming from it. It would go right to left up and down and like i said circle motions. It seemed to me that it was watching something or waiting. I don't know if it had to do with that jet in the sky or not but it was something else? I can say that i have seen a UFO. I know what sattlelights look like, i know what a plane looks like and this wasnt one of those. We know what we saw and i could put my hand on the Bible and swear to what i saw. I really thought there was going to be other witnesses to this or on the news, that's how postive i was. It was an experiece of a life time! I didn't know what to do about this. But everyone keeps telling me to write you guys. So that's where i am right now. All i know is what i saw and it needed to be shared with you guys. Just to let you know i am not the kind of person who fabricates things like this. I do believe that we are NOT alone in this universe. If you have any questions about what i told you please feel free to write me back. I can maybe then explain to you what i saw and maybe then you can maybe tell me what i saw or if there was anyone else that had seen the same thing. Like i said this note is a little confusing. Sorry! Thank you for your time to read my letter. Bye the way i didn't get any vidio or pictures cause i don't have a good camera that can take pictures in the night sky especially stars. I am dissapointed that i couldn't, all i have is in memory. Thanks again! Sara Churney"],"Date of the Event":"10/20/2009 12:00 UTC","Object Shape":"Star-like","Latitude":"45.540796","Log Number":"US-10232009-0013","Date Submitted":"10/23/2009 10:21 UTC","Object Features":"Undisclosed"}