{"Log Number":"GB-10242009-0006","Tags":"City","Summary":"A ball of light that seems to change colour, started moving slowly but then sped up and flew of into the distance","files":["/var/www/straped/mufon/html2text/20104.html.txt","/var/www/straped/mufon/org/20104.html"],"trends":["There have been 9 other sightings in Leeds","There were no other sightings in Leeds on or around October 23rd 2009"],"Disposition":"Unresolved","Source":"MUFON","Case Number":"20104","Date Submitted":"10/24/2009 01:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.806569,+-1.543647(20104)&iwloc=A&hl=en\"> mufon case (20104) map </A>","Sighting Duration":"00:01:02","City":"Leeds","Region":"England","Object Shape":"Circle, Disc, Oval, Sphere, Star-like","Object Features":"Unknown","Weather Factors":"Unknown","Date of the Event":"10/23/2009 10:03 UTC","Viewing Distance":"Unknown","Country":"United Kingdom","Longitude":"-1.543647","Latitude":"53.806569","Object Flight Path":"Path with directional change","divs":["sighting details it was friday night, oct 23rd and i was at home playin poker online with a couple of friends. we decided to take a break to have a drink and cigarette. as i stepped outside something in the sky immediately caught my eye. it was a ball of light that seemed to be changing colour. i could see it very clearly and knew right away that it wasn't a plane or helicopter, so i ran inside and grabbed my mobile phone to film it. it was moving slowly initially but then seemed to speed up and quickly flew off into the distance. i've never seen anything like this before and was baffled, i've always been a bit sceptical of ufo sighting reports and have no real interest in looking for ufo's or anything like that, this was a first and i found it quite an eerie experience. i don't know what it was, i'm not claiming it to be 'paranormal' i'm just baffled and pleased i managed to get some footage. make of it what you will, or maybe someone can explain it? i'm sure there are much better reports and footage than mine but hopefully people will find it interesting and i thought i'd better report it to someone because it definitely wasn't something you would expect to see in the sky whilst standing outside your house in the city! i've tried sending the video using the online 'multimedia attachments' but i keep getting an error. the video is now posted on youtube: http:\\\\www.youtube.com\\watch?v=zevtqqlxc48 kind regards andy (leeds, uk)"]}