{"City":"Elko","divs":["Sighting Detailsthis is basicly a follow up story to my mom's story. I was sitting in the back seat of my truck around 10:00 pm i was also lisning to my mp-3 player. then my mom and dad started saying that they could see somthing in the sky so i quikly turned off my mp-3 and looked towards the sky. sure enogh there was a big brite orange ball of light and i started to get scared. i am in the civil air patrol and know what ground observation is and it was no plane nor missle. it wasn't a helicopter either the ball of light was about he size of a penny if you staitened out your arm. we were north east of mcgill out by lages junction. when we saw the first light then we pulled over before we got to lages to se if we would see them again. then a minute passed we decided to pull up to the junction and parked in a parking lot we saw two more ufos at the same time then they disapeared and i was focosed on he sky rihgt in front of me about 1o minutes later we were getting ready to go when we saw three of them. after the fact we saw 5 or 6 jets on sfter burner that was when we left they came from the soth wst vegas area then we saw no more ufos"],"Weather Factors":"Unknown","Country":"United States","Date of the Event":"10/01/2009 10:00 UTC","Latitude":"40.834441","Summary":"big brite orange rond object","Region":"Nevada","Object Shape":"Circle","trends":["There have been 4 other sightings in Elko","There were no other sightings in Elko on or around October 1st 2009"],"Tags":"City","Object Features":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.834441,+-115.758873(20105)&iwloc=A&hl=en\"> mufon case (20105) map </A>","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20105.html.txt","/var/www/straped/mufon/org/20105.html"],"Case Number":"20105","Sighting Duration":"Undisclosed","Longitude":"-115.758873","Object Flight Path":"Undisclosed","Log Number":"US-10242009-0007","Date Submitted":"10/24/2009 01:56 UTC"}