{"trends":[],"Object Features":"Undisclosed","City":"Undisclosed","Object Shape":"Sphere, Star-like, Triangle, Other","files":["/var/www/straped/mufon/html2text/20100.html.txt","/var/www/straped/mufon/org/20100.html"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.782451,+-119.408132(20100)&iwloc=A&hl=en\"> mufon case (20100) map </A>","Tags":"City","Country":"United States","Source":"MUFON","Case Number":"20100","Latitude":"36.782451","Sighting Duration":"Undisclosed","divs":["Sighting DetailsHanging out with friends outside in a grass area. Then I see a very bright star and point it out to a friend a few minutes later. most friends believed it was a star, and one thought it was a plane. But it was extraordinarily bright. then it appeared to be moving at an upward diagonal, and before we knew it, it was approaching in our direction and was immediately above us just one minute after thinking it was a star. It was like it changed shapes and lights formations the whole way and so first appeared to be a plane approaching with bright white lights, then a triangle with blue and red lights on the tips, and then an airplane as it was right above us, I meant DIRECTLY above us. and it couldn't have been more than 700 feet above the ground But strangely enough, if we weren't outside I doubt we would have ever heard it because it was sooo quiet, and the sound was like that of a super sonic jet, only muffled as it flew relatively slow above us. And a strange thing about the aircraft as if flew directly above us was that it had three very bright lights in a triangle formation on the front of the cockpit and never before have I seen that on an airplane. I am convinced that this is an alien craft that can not only change its shape but also make sounds to resemble an airplane. At the time of the event, all the things I described happened so fast that I my mind couldn't comprehend what was happening, so i simply had to tell myself that it HAD to be an airplane. I was not scared much but definitely excitedm confused and mystified. I just watched it fly off in the shape of some kind of long airplane until it went out of my sight behind the Houses"],"Summary":"Triangle like, black sides, but then morphed into an airplane shape much longer than before","Date Submitted":"10/24/2009 02:34 UTC","Date of the Event":"10/23/2009 10:30 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-10242009-0002","Disposition":"Insufficient Data","Weather Factors":"Unknown","Longitude":"-119.408132"}