{"Longitude":"-106.919461","Date Submitted":"10/24/2009 03:59 UTC","trends":["There have been 6 other sightings in Gunnison","There were no other sightings in Gunnison on or around October 24th 2009"],"Log Number":"US-10242009-0009","Country":"United States","Source":"MUFON","Region":"Colorado","Case Number":"20107","divs":["Sighting DetailsI was looking south. and there were two crafts with red and white blinking lights traveling east to south west. I couldnt tell how far away they were. Whether it was one mile or ten miles. im leaning more towards the closer side. But they appeared to be very low. it was about 9 pm, so it was dark already. But they appeared to be just above the horizon of the mountains. So, i took a cue from Dr. Steven Greer, and i tried to mentally communicate with them. after a few seconds the second craft sped up and was in then in front of the other, but maintained their course to the west, south west. i ran inside to get my girlfriend. but becuase of their blinking lights she dismissed them as planes. But i didnt hear any jet or helicopter noise at all. and their blinking lights were not even similar. if they were military, they should blink in the same repetition. but each of the crafts blinking appeared to be totally random. i know that cseti is having their conference in Rio Rico right now. so i didnt want to interfere. I hope that was the direction that they were heading. lets hope cseti gets come good evidence (sigh...)"],"Tags":"City","Weather Factors":"Unknown","Latitude":"38.548775","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/20107.html.txt","/var/www/straped/mufon/org/20107.html"],"Summary":"Either military or ET. 2 flying objects at night. Probably ET though.","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","City":"Gunnison","map":"<A HREF = \"http://maps.google.com/maps?q=38.548775,+-106.919461(20107)&iwloc=A&hl=en\"> mufon case (20107) map </A>","Object Shape":"Unknown","Disposition":"Unresolved","Date of the Event":"10/24/2009 12:00 UTC","Viewing Distance":"Unknown"}