{"Weather Factors":"Unknown","Object Flight Path":"Unknown","Sighting Duration":"00:05:00","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=28.244177,+-82.719267(2011)&iwloc=A&hl=en\"> mufon case (2011) map </A>","divs":["Sighting DetailsAfter watching fireworks on the 4th of july and then going over to a friends, weleft to go home. While driving down a dirt road, my wife and kids startedscreaming, look look oh my god, LOOK I could not imediatley see what they werelooking at, but just prior to turning on our road, I saw it, I was totallyastounded. A triangle shaped craft hovering just over the tree tops, I turnedonto our road and pulled right underneath it. As I could not hear any sound, Iturned off the car engine, still no sound, I got out of the car. Standingdirectly beneath the object, 50-60 I could only hear a faint whir. I literallystarted banging my head on the car, I was and still am in a state of total aweFinally, I bent down to pick up a rock, I was going to try to see what sound orreation would occur. Then my wife and kids really started screaming they did notknow what happened to me, I imedately stood up and then the craft gently startedmoving opisite the direction the car was pointing. I jumped in and made a quickU turn, just as we started to catch up, it started increasing speed, just enoughto stay ahead of us. By the time we reached the end of the road, we weretraveling 80 mph foot to the floor. There were tall trees at the end of theroad, so the craft climbed steeply at least 45 Degrees, then banked hard left,flying over what is referred to as the Potburg Ranch Property, several hundredacres of wooded land. The craft never exceeded 200 altitude. The body was wellcamoflauged against the nite sky, it had only 3 lites eminatting from it, 2 onthe rear, 1 on the front, all were redorange, and projector like, we could notsee the source of the light. I stood beneath this object for a good minute andlikely closer to 2 minutes. It was aprox. the size of a large doublwide Moblehome and hovered not more than 60 above myour heads, the only sound was a faintwhirring noise, probably more silent than my computer cooling fan. I called theLocal Sheriffs Office the same night, they actually laughed at me, I did noteven say UFO, or anything of the sort. I just said there was a strange objectand wanted to know if they had any other reports. There is no admitted craft,either civillian or military that could do what this object did. I still feel asense of helplessness"],"Latitude":"28.244177","Case Number":"2011","Region":"Florida","Longitude":"-82.719267","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around June 4th 1994"],"Object Shape":"Triangle","Date of the Event":"06/04/1994 12:15 UTC","Country":"United States","Log Number":"","City":"New Port Richey","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/2011.html.txt","/var/www/straped/mufon/org/2011.html"],"Summary":"Triangle shaped UFO viewed from 50-60 feet, overhe","Tags":"City","Source":"MUFON","Viewing Distance":"21-100 Feet","Date Submitted":"06/04/1994 12:15 UTC"}