{"Longitude":"-79.824495","Latitude":"37.816239","Object Flight Path":"Stationary","City":"Clifton Forge","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20118.html.txt","/var/www/straped/mufon/org/20118.html"],"Date Submitted":"10/25/2009 04:28 UTC","Viewing Distance":"21-100 Feet","Object Features":"Other, Unknown","Source":"MUFON","trends":["There have been no other sightings in Clifton Forge","This sighting has never been favorited."],"Weather Factors":"Fog, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.816239,+-79.824495(20118)&iwloc=A&hl=en\"> mufon case (20118) map </A>","Disposition":"Unknown","Date of the Event":"05/31/1995 12:00 UTC","Region":"Virginia","Log Number":"US-10252009-0003","Country":"United States","Object Shape":"Disc, Other","Case Number":"20118","Tags":"City","Summary":"I was 9 years old, woke in the middle of night, saw craft landed on ground outside my window, 5 or six large circular flashing lights, huge craft","divs":["Sighting DetailsI had just moved to a new home located on Longdale Furnace Rd., just down the street from the Triangle Country Store, and across from the Retirement Home, I was 9 years old at the time. I was sleeping on a love seat in the living room as we had not moved our bedroom furnishings into the house at this time, my mother was asleep on the couch across from me, and my sister in a chair that was in front of the living room window, wich was facing towards the interstate off ramp wich is beside the Triangle Country Store, several hundred feet from our house wich was nearby on a hill. The sighting occured through this window. I awoke sometime late that night, or in the early Am hours of the morning. I do not know the exact time. My attention was directly drawn to the large window behind the chair my sister was sleeping in, as I was sleeping in a love seat facing this window. Imediately I observe what I know to be a UFO from pictures I had seen in books, or perhaps from a movie such as ET. I was stunned, very much in awe of this thing, It was huge, it is hard for me to say how far it was away but it appeared to be some distance. The craft contained 5 or 6 visible lights wich were circular in shape, they appeared to me to be the size of large vehichles or perhaps 15 yards in diameter. It also had some lights near the top of it that didn't go out, they appeared to be rectangular, or like grates or something. The length of this thing seemed to be very long, like 100 feet, or close to that. However with the fact that there are trees in the yard and none were visible, only this craft, it may have been very much closer and it may have been a smaller craft, though it still seemed so large to me. It was black or very dark gray and black, you could make out the shape and such from the flashing of the very bright lights. The spectrum of the lights was nothing like a regular bulb, and it did not project the light but it seemed to stay close with the craft only illuminating enough of the object to make out a basic outline. These lights flashed in strange patterns they would flash in a sucession with one illuminating for a moment, then it would fade out and then the next would light up, and so on down the line, it also did other patterns of alternate blinkings. I sat there in great fear watching this craft. I got up off the couch and tried to wake my mom up, \"Mom there's a ship outside!!!\" \"GET UP\". I tried and tried to get her to awaken telling her repeatedly, but she could not be roused from her sleep. She told me to go to sleep and that I was going to scare my sister, from her mostly sleeping state. I really wanted my mom to see this, or someone. But, I didn't want to wake my sister up and scare her. So I went and lay back down on the couch and watched this craft for a long time. At some point durring watching it I drifted off to sleep, though I do not know how I could do such a thing, it was almost as though the lights hypnotized me or put me in a trance. I specificaly remember taking mental pictures with my mind, that I would never forget this thing or what it looked like. To this day it is one of the most amazing things I have ever seen. I very much wished that our family would have had our video camera availabe, as a tape of this thing would blow any known footage of a UFO out the water. This thing was so strange and not normal. It could have been military, but I believe it was Celestial, It was my first encounter with such a thing, though I have made other sightings since, far less up close, ones in the air. I imediately knew this thing to be a UFO though I did not observe it flying, I would like to go back to the area, and look at the trees nearby to try and see what distance it might have been away, It seems that it was farther away and very very large, but there were some trees in our yard, It may be it was very much closer and that it was actually on the hillside, in the side yard of the house. The one thing that stands out to me most of all were those very large circular lights and the trance like patterns that they flashed, it was calming and unerving at the same time. I did not feel like I was in terror, but i did feel aprehensive, were these Aliens I wondered. I knew little on the subject, but had heard some adults talk about such things in the past. This thing truly amazed me, and had an affect on the rest of my life. It would not be the last time I seen objects. Most recently in the past 2 years, I have had several alien contact experiences that occured in lucid dreams. When these started to occur memories immediately shifted to this first major event that happened when I was very young, might it be that I have been taken on such craft before? I would not doubt it. It seems that I have established a rapport with unknown entities. At this point I'm trying to figure out what's going on with me, and what everything means. Theres so much I'd like to share, but this of course is not the place. I lost sight of the object due to falling asleep, I don't remember having any dreams that night, just falling asleep at some point and then waking up the next day fully remembering the event. My mother has since passed away, and my sister never saw the object. So I am the lone witness of the event. I did tell most all the adults my mom, her friends, and my sister about my experience. Very amazing experience, have been highly interested in UFO's ever since. This was not a hallucination, it was not a made up story, this is 100% accurate. I moved from that house about a year later, I no longer live in Alleghany County Virginia, I now live in central VA."]}