{"divs":["Sighting DetailsAt around 5:24pm on Saturday, October 24th I was outside taking pictures of the natural landscape as I am prone to do when I spotted a white round object sitting still in the sky at about 90 degrees from the horizon. The object remained steady at the same spot in the sky and I quickly started taking pictures of it. I was also able to yell towards the house and both my wife and my daughter ran out and also were able to observe the object while I continued to take more pictures. Throughout this whole process the object did not move from the location that it was first observed in the sky. I was able to take 26 pictures in RAW and 26 in JPEG before a group of clouds moved in and obscured the object from sight. Eventually the clouds moved away, however the object was no longer visible in the sky once visibility was clear again. Strangely enough the object was very similar in appearance to the previous object that I captured on October 11th of this year (as reported to the ufo center previously) except that this time it was not moving."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.717142,+-80.051365(20117)&iwloc=A&hl=en\"> mufon case (20117) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20117.html.txt","/var/www/straped/mufon/more/20117_submitter_file1__IMG_0759.JPG","/var/www/straped/mufon/more/20117_submitter_file2__IMG_0774.JPG","/var/www/straped/mufon/more/20117_submitter_file3__IMG_0785.JPG","/var/www/straped/mufon/org/20117.html"],"City":"West Palm Beach","Object Flight Path":"Stationary","Weather Factors":"None","Case Number":"20117","Log Number":"US-10252009-0002","Disposition":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around October 24th 2009","This sighting has never been favorited.",""],"Latitude":"26.717142","Region":"Florida","Longitude":"-80.051365","Object Features":"Unknown","Date of the Event":"10/24/2009 05:24 UTC","Date Submitted":"10/25/2009 01:46 UTC","Summary":"White spherical object standing still in the sky.","Object Shape":"Sphere"}