{"Longitude":"-95.053611","Log Number":"US-10242009-0014","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"00:10:00","Case Number":"20112","City":"Crosby","Date of the Event":"10/24/2009 06:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.917898,+-95.053611(20112)&iwloc=A&hl=en\"> mufon case (20112) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/20112.html.txt","/var/www/straped/mufon/org/20112.html"],"Weather Factors":"Unknown","Tags":"City","Disposition":"Unknown","Date Submitted":"10/24/2009 09:16 UTC","Latitude":"29.917898","divs":["Sighting DetailsOn October 24th at 608 pm Gregory H. 13 yrs and Alex L. also 13 were outside their rural neighborhood playing in the street. They both noticed a star -like sphere at an etimated distance of 2-3 miles and an estimated altitude of 15 k feet. It was rising from the horizon as planes would from the local Houston IC airport but made a complete and immediate 90 degree turn in midflight that appeared to be traveling much faster than commercial aircraft and drew the attention of both teenagers. At this time 3 other identical objects also rose from the horizon and matched altitude with the original object.At this time Alex went inside his home to get a pair of high quality binoculars.During the 2-3 minutes he was doing this Greg said the original object shifted into a diamond and the others remained spherical.Greg also noticed what appeared to be a helicopter 3-5 miles in the distance approaching the objects at a much slower rate.When Alex returned from getting the binoculars he also noticed the diamond shape. Both report that the other 3 objects begin to move towards the west at a much faster rate than other aircraft normally seen in the area.They both also report that the object shifted into a triangle at this time all the while remaining blue luminescent. As Alex looke through the binoculars at the object both witnesses state the object seemed to simply disappear before the helicopter could reach the area. No other helicopters or craft were seen in the 2 hours following the incident.Also strangely enough air traffic in the area seemed unusually slow following this incident. We live only 12 miles from Hou IC airport and both kids are used to seeing air traffic in the area.I am the Father of Greg H. and what gives this sighting credibility to me is that both children are honor roll Gifted and talented program children who have proven their honesty and character many times.Greg is in the ROTC program and knows basic astronomy and has a good knowledge of the types of local aircraft with above avg time spent observing the sky.Alex is in the scouts and also has some astronomy experience and is quite observant. I was an investigator for the State of Texas for several years and took notes within an hour of the sighting from both witnesses independently and their stories were completely consistent in such a way I dont believe they could have recalled a false story with such consistently had it not been true.Both kids are of above average character and intelligence and this carries weight with me because about 3 years ago I saw something like this with another witness in almost the same area and never reported it because i am in a security related field and worried about reprecussions. One final interesting note is we live less than 2 miles from the famous Cash UFO encounter in Dayton,Tx where multiple witnesses saw several UFOS and trailing black copters which were caught on film. Several very credible and honest people that I personally know were intimidated by \"govt types\" after the original Cash incident. While I am a firm believer in UFOS both children appear to be slightly skeptical yet open minded.Both state that the objects were absolutely not wind powered craft and appeared to move many times faster than any aircraft they have ever seen.They both claim to have felt excited as the craft began to change shape and make 90 degree turns that apparently seemed to prove they were non terrestrial.They also felt disbelief and doubt at what they were seeing and seemed quite puzzled and curious when questioned.As a trained investigator I can tell you that the level of consistency from the seperated witnesses was so high that I can only assume it was true and pretty damn accurate.Keep an eye on these skys because we have had an increase in the last few years.We have since bought a digital camera and dvr to attempt to catch activity on film."],"trends":["There have been 3 other sightings in Crosby","There were no other sightings in Crosby on or around October 24th 2009"],"Viewing Distance":"Unknown","Region":"Texas","Summary":"Multiple shapeshifting objects that were visible at dusk performing unatural aerobatic manuevers and morphing with two consistent and credible teenage witnesses.","Source":"MUFON","Object Shape":"Diamond, Sphere, Star-like, Triangle"}