{"Source":"MUFON","Latitude":"32.362848","Date of the Event":"03/15/1996 12:00 UTC","Viewing Distance":"Unknown","Object Flight Path":"Other","Region":"Mississippi","Log Number":"US-10252009-0011","Disposition":"IFO","Case Number":"20126","Tags":"City","Summary":"Huge fireball hit ground.","Object Shape":"Fireball","Object Features":"None","Sighting Duration":"Undisclosed","trends":[],"Longitude":"-89.397528","Country":"United States","files":["/var/www/straped/mufon/html2text/20126.html.txt","/var/www/straped/mufon/org/20126.html"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.362848,+-89.397528(20126)&iwloc=A&hl=en\"> mufon case (20126) map </A>","Date Submitted":"10/25/2009 08:43 UTC","divs":["Sighting DetailsWe took a few days off to go to the gulf to ride seadoo's as it was still too cold to ride in St Louis. we were on our way home, heading up a back road to my friends parents house in Mississippi to stay the night before returning on our way home. around midnight the night light up like day time, never saw anything so bright that could turn the night into day. Looked up and we saw a white maybe a bit bluish fireball heading from east to west at about a 45 degree arc (not at a straight 45 degree angle but kind of curved) It was way slower than a meteor, I would say it took 30 to 45 seconds to fall all the way to the ground. It was in between the size of a quarter and a half dollar from my viewpoint, so it was much larger than a meteor. This happened back in 96', I had never really thought of it as a UFO before but I was watching some youtube videos and it made me think about the thing I saw. I never thought it was a meteor, but never did have anyone give a good explanation of what it was. Whatever it was It hit the ground, I remember we braced our selves thinking the ground would shake when it hit but it did not, no sound nothing. we did think about trying to find it but there was no way we could have. If you have any idea odf what this was please let me know, or if you had any other reports about this please let me know. Oh, The dat could be wrong, I am pretty sure it was March, could have been 95' or 96' just not sure. thanks, John"],"City":"Undisclosed"}