{"Object Shape":"Bullet, Missile","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","City":"Vermilion","Weather Factors":"Unknown","Longitude":"-82.356867","Date of the Event":"10/25/2009 07:15 UTC","Region":"Ohio","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Vermilion","There were no other sightings in Vermilion on or around October 25th 2009"],"Date Submitted":"10/25/2009 10:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.429639,+-82.356867(20128)&iwloc=A&hl=en\"> mufon case (20128) map </A>","Log Number":"US-10252009-0013","Summary":"Fast moving, dart like object w/2 bright white lights","Source":"MUFON","Object Flight Path":"Straight-line path","Case Number":"20128","files":["/var/www/straped/mufon/html2text/20128.html.txt","/var/www/straped/mufon/org/20128.html"],"Tags":"City","Object Features":"None","Latitude":"41.429639","Disposition":"Unknown","divs":["sighting detailsat approx. 7:15 am eastern dst i was entering st rt 2 from st rt 60 eastbound in erie co., oh. i was on the entrance ramp when i noticed a low flying, fast moving object to my left, or north. it was just starting to get light, but the sky was still dark with heavy clouds. at first i thought it was an aircraft, but at the speed it was flying at that height made me remark to my passenger to look also. i slowed to a stop and we both observed that the object was not an airplane but a long, dart like object with a bright, almost led like, white light at each end. it flew in a straight line for what i estimate was 1\\2 of a mile, about 1\\4 mile away at no more than 300 ft. altitude. i estimated the speed to be over 300 mph. i had the window down and could hear no noise from yhe object. i am a retired police officer and have received training in speed estimation for use with speeding radar citations. the object then either disappeared entirely, or made an immediate 90 degree turn to the north and accelerated very rapidly out of sight. i thought i saw a diminishing light to the north where the object disappeared, but i cannot say for sure. my passenger is a paramedic\\fireman and he also observed the object speeding across the sky and then vanish. there was no flame trail or smoke that would be associated with fireworks or a flare, nor was it an airplane."]}