{"Object Features":"Undisclosed","Latitude":"29.564118","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20127.html.txt","/var/www/straped/mufon/org/20127.html"],"City":"Seabrook","Date of the Event":"10/16/2009 08:00 UTC","Viewing Distance":"Unknown","Date Submitted":"10/25/2009 10:50 UTC","Source":"MUFON","trends":["There has been one other sighting in Seabrook","There were no other sightings in Seabrook on or around October 16th 2009"],"Weather Factors":"None","Longitude":"-95.025484","Disposition":"Unknown","Case Number":"20127","map":"<A HREF = \"http://maps.google.com/maps?q=29.564118,+-95.025484(20127)&iwloc=A&hl=en\"> mufon case (20127) map </A>","divs":["Sighting DetailsMy husband and I were sitting outside after dark in our spa relaxing after a long week. We were chatting when my husband says \"do you see that?\" I said what? He says \"a big black triangle, its moving pretty fast.\" I am trying to follow where he his pointing and I am thinking to myself that I dont hear anything. He is pointing almost straight up but toward the SSE which is towards the water (Galveston Bay). I mention that I cant see it and then he says \"it's gone.\" I said \"what was it?\" He said \"it must be a new stealth plane although it was bigger.\" He said he noticed it because, as it was flying, it created a distortion in the air around it, much like the heat distortion one sees on the roadway on a hot summer day. Now, we live near Ellington Field (an old air base) and NASA JSC. We see and hear lots of different types of planes all the time so i know he has a pretty good frame of reference. So we tell ourselves it must have come from Ellington. Well just the other day I was watching tv and came across a show about ufo's. They started to describe flying black triangles. I recorded the show and then asked my husband to watch it. He said that what he saw was very similar but there were no lights. After reading more and finding out that these sightings are very common, I decided to write this report. BTW, we are not \"ufo nuts\", we are educated (chemist and engineer) middle class people who lead very average lives. In summary: Large black triangle, no lights, no sound, with distortion of the air around it (shimmering). Moving very fast."],"Log Number":"US-10252009-0012","Country":"United States","Region":"Texas","Tags":"City","Summary":"Black triangle over Seabrook","Object Shape":"Triangle","Object Flight Path":"Straight-line path"}