{"Tags":"City","Viewing Distance":"101-500 Feet","Country":"United States","Longitude":"-120.990848","Sighting Duration":"00:01:00","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around July 20th 2009"],"Log Number":"US-10252009-0010","divs":["Sighting DetailsI was ouutside on my trampoline from about 7pm to 12pm watching shooting stars with my brother. we had been out there for a while so my brother went inside to go to bed. i asked him to stay outside because we might see more shooting stars but he wanted to go to sleep. so i stayed out there just star gazing and hoping to see more shooting stars when something caught my eye and i thought it was another shooting star so i quickly look and find it wasnt a shooting star it was incredible. it was about 7 balls of light not very bright but bright enough to see, and it was in formation in the shape of a boomerang. also out of the 7 balls 2 or 3 switched spots .it came over my house from the east and was headed south west. now, what is really incredible about it was that i was talking about this subject all day and then i see one. it really satisfyed my couriosity for wanting to see a ufo in my lifetime. i cant go into detail about my emotions and feelings and the insight it gave me for my life but i just want people to know what i saw. also what went through my head the second i saw it was what am i looking at. i thought it might be a bunch of birds in a v formation but it was to bright to be birds and going to fast."],"Summary":"i saw a boomerang shaped ufo in modesto at 12pm","map":"<A HREF = \"http://maps.google.com/maps?q=37.640277,+-120.990848(20125)&iwloc=A&hl=en\"> mufon case (20125) map </A>","files":["/var/www/straped/mufon/html2text/20125.html.txt","/var/www/straped/mufon/org/20125.html"],"Date of the Event":"07/20/2009 11:00 UTC","Latitude":"37.640277","Disposition":"Insufficient Data","Object Flight Path":"Path with directional change,Other","Object Features":"Other","Object Shape":"Boomerang","Source":"MUFON","City":"Modesto","Case Number":"20125","Date Submitted":"10/25/2009 07:37 UTC","Region":"California","Weather Factors":"Unknown"}