{"Case Number":"20129","Weather Factors":"Unknown","Longitude":"-83.004336","Date Submitted":"10/25/2009 11:05 UTC","Country":"Canada","Viewing Distance":"Unknown","Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=42.256458,+-83.004336(20129)&iwloc=A&hl=en\"> mufon case (20129) map </A>","divs":["Sighting DetailsThe contributor (me) wishes to remain anonymous. I used to work as a reporter at a Canadian news outlet in the 1990's. One day (probably around October 1995) I was working in the newsroom when a man came in and asked to speak to a reporter. The man identified himself as Ken Suominen of Windsor, Ontario. He stated that he had recently experienced a UFO encounter and asked if anyone else had reported the same event. I told him that to the best of my knowledge no one else had. He then handed me a detailed handwritten description of the event and requested that I file a news report to see if anyone else saw what he saw. I told him I would read his account and contact him if I required more information. He then left my office. I have no specific memory of Mr Suominen but I had not met him before or since. I did not write down his address or phone number at the time we spoke, which would lead me to believe he may have been reluctant to provide this information. Or perhaps he did not have a permanent address or telephone number. I do recall thinking he seemed sincere about his claim at the time. However I was not willing to approach my Assignment Editor to do anything with his story. The pages he gave me were copied on a \"thermal roll\" fax machine and stapled together at the upper-left. I placed them in a \"curiosity file\" and forgot about them. Somehow over 15 years and several career changes the \"curiosity file\" made its way to a box of old papers at my home, which I recently went through while preparing for an upcoming move. I have heard about your organization and your website and I thought you might find this useful. Mr Suominen's written account is provided as a scanned .pdf attachment, which I hope will upload correctly. Again, I do not wish to be associated with this report or contacted by your organization in any way. I have nothing more to add."],"Object Shape":"Unknown","Latitude":"42.256458","City":"Windsor","Summary":"Contributor is filing a report of a stranger's UFO sighting.","Log Number":"CA-10252009-0014","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/20129.html.txt","/var/www/straped/mufon/org/20129.html"],"trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around July 11th 1994","This sighting has never been favorited.",""],"Source":"MUFON","Object Features":"Undisclosed","Date of the Event":"07/11/1994 12:00 UTC","Tags":"City"}