{"Object Flight Path":"Straight-line path","City":"Conway Longs","divs":["Sighting DetailsI was leaving a friends house about 4AM on the morning of Thanksgiving. LeavingConway, I was driving northwest on HWY 701 towards HWY 22. It was a very clearnight and I had been admiring the sky as I was driving. I noticed a brightgolden object off to the right. I figured it was the planet Venus but continuedto watch it as I drove, because it looked much bigger and brighter than Venusand it was a very bright gold. As I got onto 22 going east towards Myrtle Beach,the object was now on my far right. Glancing at it occaisionally, it suddenlycrossed my field of view moving towards the North Carolina border, where it cameto a dead stop. I noticed that it was a sort of a flatened cone shape, almostlike a spinning top. It faded for a few moments then reappeared. Turning ontoHWY 905, I was now driving towards the object.When I got home, it was still hovering just above the treeline. The objectremained in place, I continued to watch it for about 30 minutes from my backdoor window until I became too tired and went to bed around 5AM.During this time I became very nervous, because down the road it appeared to benear the location of my house. Next door in a neighbors yard, a group of dogswere extremely agitated, barking and yelping uncontrollably. Admitedly, thesedogs do bark frequently, but they have never behaved this intensely. I haventdiscussed this with anyone except the friend whose house I had been leaving.Again I ask my name be witheld."],"Object Shape":"Cone","Weather Factors":"Unknown","Summary":"ConwayLongs, South Carolina","Log Number":"","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-78.822848","Date of the Event":"11/28/2002 04:30 UTC","Country":"United States","Sighting Duration":"01:59:00","Date Submitted":"11/28/2002 04:30 UTC","Case Number":"2012","trends":["There have been no other sightings in Conway Longs","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/2012.html.txt","/var/www/straped/mufon/org/2012.html"],"Tags":"City","Disposition":"Unknown","Source":"MUFON","Object Features":"Dome","Region":"South Carolina","Latitude":"33.858113","map":"<A HREF = \"http://maps.google.com/maps?q=33.858113,+-78.822848(2012)&iwloc=A&hl=en\"> mufon case (2012) map </A>"}