{"Source":"MUFON","Latitude":"41.270927","Date of the Event":"02/29/1980 12:00 UTC","Case Number":"20132","Date Submitted":"10/26/2009 03:00 UTC","Viewing Distance":"20 Feet or Less","Summary":"Triangular shaped object with bright lights on leading edge.","map":"<A HREF = \"http://maps.google.com/maps?q=41.270927,+-73.777634(20132)&iwloc=A&hl=en\"> mufon case (20132) map </A>","files":["/var/www/straped/mufon/html2text/20132.html.txt","/var/www/straped/mufon/org/20132.html"],"Log Number":"US-10262009-0001","Object Shape":"Triangle","Longitude":"-73.777634","Weather Factors":"None","City":"Yorktown Heights","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Region":"New York","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Yorktown Heights","This sighting has never been favorited."],"Object Features":"None","divs":["Sighting DetailsI was on my way to visit a friend in Yorktown Heights off Granite Springs Road. Prior to making the right turn I noticed this grouping of triangular lights coming out of the west from the direction of the Taconic State Parkway. At first I didn't think anything of it as westchester County airport was to the East of me and I assumed that it was an aircraft on approach. Than it dawned on me that the light configuation was all wrong and this object was either large or extremely low flying. I am a USAF veteran and know the standard light configurations of militay and civilian aircraft. After making the turn onto Granite Springs I pulled my car to the shoulder and got out for a better look. By this time the object was headed right for my location and getting larger by the second. When the leading edge was directly above me I noticed the lights on the edge to be evenly spread approximately 30 yards apart. The object appeared to be 500 to 700 feet above the ground traveling at about 40 knots. From tip to tip I estimate its width to have been 300 to 350 yards. Other than the lights on its leading edge it was jet to muted black with no discernible structural features. Once directly above me it completely blocked out my North and South horizons. No sky or stars were visible except beyond the leading edge. I heard a low pitched modulating motorized sound, nothing like an aircraft engine more like an electrical turbine but muffled. I followed the crafts flight after it passed me continuing East for a few minutes and noted two bright lights coming out of the southwest and heard the distinctive sound of two F4 Phantoms at about 5 to 7000 feet descending and headed towards the object. As the jets on descent were about a mile away from the object its lights just sort of flashed and it completely disappeared from the sky. Some weeks later I read a newspaper article about this object they called the westchester wing which speculating that it was a hoax perpetuated by a group of ultralight pilots. If there was any truth in that, they must have been the greatest pilots on the face of the planet and had perfectly tuned ,synchronized and muffled their engines. There would have to have been 50 or more of them flying wingtip to wing tip and nose to tail and maintaing the exact altitude and attitude in the moonless dark during my sighting of 15 or more minutes. A feat I know to be aerodynamically impossible for an ultralight."]}