{"Log Number":"US-10262009-0002","Region":"New York","files":["/var/www/straped/mufon/html2text/20133.html.txt","/var/www/straped/mufon/org/20133.html"],"Object Shape":"Cross, Sphere","Object Flight Path":"Stationary","Case Number":"20133","Viewing Distance":"101-500 Feet","Latitude":"41.263364","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.263364,+-73.680094(20133)&iwloc=A&hl=en\"> mufon case (20133) map </A>","Country":"United States","Object Features":"None","divs":["Sighting DetailsIt was early one Sunday morning just as the sun was peaking over the hills to my east while driving north on I 684. It was looking like to shape up to be a beautful spring morning with hardly a cloud in the sky. I was approaching a section of the highway where Byram lake is directly adjacent to the southbound lanes when I noted what looked like a strange flickering shining cell tower in the middle of the lake.It was in the shape of a giant stylized cross with what looked like sharp leading edges and tapered to points at the ends of the arms. It looked really strange when the rising sun peaked over the hills adjacent and I noted these sherical mylar ballon like objects moving up and down out of the water. Of course my curiosity was peaked so at this point I put on my flashers, slowed my car and moved onto the left shoulder of the road until I got a clear view between the trees. Being springtime and the leaves hadn't opened yet on the trees. This cross object was 300 or more feet in height with the arms about 200 feet wide and hovering about 10 feet off the water. I got out of my car, I was viewing this thing from about a quarter mile in distance. Its surface was highly reflective and reflecting the topography around it, if it weren't for the bright morning sun reflecting it would have been nearly invisible. I watched a few minutes as about a dozen of these shiny sherical balls kind of floated in and out of the water, some appeared to be dripping water as they rose up slowly from the lake. They appeared to be about 7 to 10 feet in diameter. They just sort of floated up slowly meandering to either the vertical or horizontal arm of the cross and just looked like they melded onto them. The surface of the cross looked perfectly smooth, no humps, bumps or any apertures were noted prior to the spheres appearance or disappearence onto the surface. A few cars had passed in the meantime when this black Bronco pulled onto the shoulder in front of me and the driver got out to also look. We both sort of looked on in silent amazement when after another 30-40 seconds the cross just rose straight up into the air, as if being pulled by a tether line at ever increasing speed and dissappeared into the stratosphere. There was absolutely no sound to be heard from the object even as it was ascending at what had to be faster than sound speed. I said to the guy driving the Bronco \" Can you believe that?\" He looked at me and said\" I don't know about you, but I'm not telling anyone they'll think we're crazy!\" He hopped in his vehicle put on his blinker and drove away. Well I know I'm not crazy, maybe a little twisted like most, but I've never heard of an object like this described before and I've been a skeptical believer since project Blue Book days. I am an Air Force veteran with flight experience as well as a respected health care professional and think I'm eminently qualified to discern an illusion, delusion or hallucination from reality!"],"Date of the Event":"03/31/1985 06:00 UTC","Tags":"City","Source":"MUFON","Weather Factors":"None","Disposition":"Unresolved","trends":["There have been no other sightings in Katonah","This sighting has never been favorited."],"Summary":"Shiny cross shaped UFO directly over lake off Interstate 684","City":"Katonah","Date Submitted":"10/26/2009 04:50 UTC","Longitude":"-73.680094"}