{"Longitude":"-83.926055","files":["/var/www/straped/mufon/html2text/20146.html.txt","/var/www/straped/mufon/org/20146.html"],"Sighting Duration":"00:10:00","Case Number":"20146","Object Features":"Undisclosed","divs":["Sighting DetailsMy boyfriend and his friend were driving from Lansing to Ann arbor to play a concert at the blind pig.My friend and i left 10 minutes after them following the same route heading to Ann arbor, my boyfriend had called us multiple times to tell us that he just saw green disc shaped objects on the highway heading the opposite direction but we didn't hear the call because our music was up. then we realized that he was calling and picked up the phone and just at that moment we saw the green lights right in front of us hovering but moving slowly directly above us, we told him they were right above us and he said he saw them 5 min before we did they were floating in perfect symmetry perfectly spaced apart and flying toward the trees. we watched them float in front of us then over our car then about 100feet above the trees we watched them for ten min in the review mirror until they floated out of sight. they made no sound and floated in such symmetry i don't think any plane or helicopter could be so precisely symmetrical in floating together. when i noticed the orbs i looked at the clock imediatly and tracked the time the whole sighting, as far as i'm concerned i have never seen lights morph like that or that shape of a vehicle in the sky. three other people can tell you the same story. there was a lot of traffic and a semi pulled over watching this happen. i wouldn't doubt others have reported this sighting. it was like nothing i have ever saw. We tried to snap a picture but in the shock we were in we took the picture in the car and the glare may have impared the picture but if it turns out when we develope the film i will post it. it had rained that night but stopped."],"City":"Howell","Summary":"5 to 6 green morphing to red disc shaped objects flying in perfect sequence perfectly spaced aqnd traviling in a slanted rectangle formation above the highway 96 and then moving toward the trees about 100 feet above the trees","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.615025,+-83.926055(20146)&iwloc=A&hl=en\"> mufon case (20146) map </A>","Date Submitted":"10/26/2009 07:57 UTC","Viewing Distance":"21-100 Feet","Object Flight Path":"Hovering then path","Date of the Event":"10/25/2009 09:08 UTC","Latitude":"42.615025","Country":"United States","Object Shape":"Circle, Disc, Square, Rectagular","Log Number":"US-10262009-0015","trends":["There have been 20 other sightings in Howell","There were no other sightings in Howell on or around October 25th 2009"],"Region":"Michigan","Weather Factors":"Rain, Light","Disposition":"Insufficient Data","Tags":"City"}