{"Sighting Duration":"Undisclosed","Log Number":"US-10262009-0014","Source":"MUFON","Date Submitted":"10/26/2009 07:28 UTC","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/20145.html.txt","/var/www/straped/mufon/org/20145.html"],"Country":"United States","Region":"Oregon","Longitude":"-122.602938","Weather Factors":"Unknown","City":"Oregon City","trends":["There have been 7 other sightings in Oregon City","There were no other sightings in Oregon City on or around October 25th 2009"],"Object Shape":"Unknown","Case Number":"20145","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.363283,+-122.602938(20145)&iwloc=A&hl=en\"> mufon case (20145) map </A>","divs":["Sighting DetailsIt was 2:30am Saturday night (Sunday Morning) and my boyfriend took the dogs out in rhe back yard one last time before we went to bed and then called me outside to look at a \"UFO\" I was like yeah right whatever, but when outside and he pointed up and this bright light in the sky I looked and told him it was an airplane, (it initally looked liked the headlight of a oncoming jet) but a kept watching and it was not moving, it was hovering and it was shimmering or sparkling like a star, but was different from anything I ever saw. Stood there for a minute or two and decided to go get the binoculars and told my boyfriend to stay there and watch it, I ran in and got the binoculars and when we looked in the binoculars it was the weirdest thing either of us had ever seen, it was a multi colors bouncing or hovering around in the sky, very hard to describe cause I have never seen anything like it. We were both shocked, and just could not beleive what we were seeing! We stayed out there watching and it seemed like it was getting further away and then it was gone instantly. I was excited, nervous and scared all at once. I got on the internet tried to search other sightings similar to ours, I have been obsessed ever since the sighting trying to get an answer as to what it was. We decided to go back out there one last time before getting into bed and it was back, but in a different location, looked through binoculars and saw same thing. Very strange."],"Disposition":"Unknown","Summary":"Saw a bright white light hovering got binoculars and and through binoculars saw multi colors shimmering and hovering and then it seemed to be getting further away and just a few seconds it was gone!","Object Features":"Unknown","Latitude":"45.363283","Date of the Event":"10/25/2009 02:30 UTC","Viewing Distance":"Over One Mile"}