{"Date of the Event":"10/26/2009 09:20 UTC","Object Shape":"Other","City":"Flint","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around October 26th 2009"],"Tags":"City","Latitude":"43.018527","Log Number":"US-10262009-0011","Object Features":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Source":"MUFON","Region":"Michigan","Summary":"UFO sighting over I-69 towards lansing between Irish Rd. and Shwartz Creek.","Weather Factors":"Unknown","Case Number":"20142","map":"<A HREF = \"http://maps.google.com/maps?q=43.018527,+-83.678206(20142)&iwloc=A&hl=en\"> mufon case (20142) map </A>","Longitude":"-83.678206","files":["/var/www/straped/mufon/html2text/20142.html.txt","/var/www/straped/mufon/org/20142.html"],"Sighting Duration":"00:15:00","Object Flight Path":"Undisclosed","Date Submitted":"10/26/2009 02:28 UTC","divs":["Sighting DetailsI was leaving on my way back to school. I got on the interstate at the Irish Rd. Exit at about 9:20 PM. I noticed light out of the corner of my left eye, so I looked in that direction. When I first looked at it I thought it might be one of those lights that are used at concerts, or big events [the kind that sort of criss cross in a sense]. As I continued to watch I noticed that it was four opaque lights that were tear-dropped shape, but they had darker white circles in the center of them. The lights would come together in a center and immediately bounce back out. Once they hit about 50 ft out in each direction they would come back and repeat the process. The lights as a whole were also rotating at a relatively slow pace. After about five more minutes I realized that there was no way this was from a light because it had been moving parallel to my car ( about 100 - 200 ft. up)for about 10 minutes. The object made no noise, and seemed much too large to be any form of aircraft. [It was about 100 ft x 100 ft.] I thought it was the coolest thing ever, and I immediately called my dad after my realization because we are obsessed with this sort of thing. After another 5 minutes or so it started making it's way further left over the woods, and I lost sight of it. It was definitely the most amazing thing I've ever seen."],"Country":"United States"}