{"Summary":"5 green balls of light floating over Datapak Services and western I-96 as we travelled eastbound. Lights changed to red revealing vague yet solid cylindrical or rectangualr shape","Region":"Michigan","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Latitude":"44.321574","Date of the Event":"10/25/2009 09:02 UTC","Tags":"City","Sighting Duration":"00:01:00","Object Features":"Other","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Other,Unknown","Log Number":"US-10262009-0017","Date Submitted":"10/26/2009 10:45 UTC","Case Number":"20148","City":"Undisclosed","divs":["Sighting Details On October 25th, 2009 at 9:02 p.m. I was the passenger in a two seat pickup truck driving eastbound down I-96 on my way to play a concert in Ann Arbor with my band Dr. Device. We had just passed the Kensington Valley Shopping Center and were in in the Howell Area. As we passed Datapak Services inc. on our left, Myself (passenger) and the driver of the truck noticed 5 distinct and strangely luminous green balls in the sky. Initially we thought they were lights attached to a radio tower (which in itself was of note, as we drive this route often at night and in daylight and have never noticed such a tower), but soon we visually confirmed they were actually independent objects moving and hovering above the buildings to our left and further toward the westbound side of I-96. They appeared incredibly low in altitude and of good size, no more than 100ft above the treeline(probably more like 50ft), and well under the scattered broken clouds that were strewn about the sky. There was light rain at the time. They seemed to be very slowly traveling west in a symmetrical trajectory. We we're only to observe these what I would call craft for 1 minute as we drove out of site of them, but we made the following observations: - They made no sound - No FAA or blinking lights - Moved in formation rectangular formation but also, - Displayed independent movement at one time - Changed color from green to red - Witnessed 4 minutes later by 2 people we knew, who were only a few miles behind us on I-96 en route to the same location More Details: We observed the first three (from left to right) change colors from green to red in a blink of an eye. This revealed to me what seemed to actually be 5 solid cylindrical or rectangular shaped craft.It seemed the green light was on one end of the craft, then would change (better described visually as morph)to the other end and become red (maybe the craft was rotating 180 degrees quickly). Never did any of them have both color lights on at one time. The colored lights didn't emanate, refract off the windshield, or blink like the other lights we are used to seeing in the night sky, they were soft and glowing bright but not lighting up the surrounding sky, clouds, buildings or ground below. The fourth in succession remained green, and as I watched the Fifth it turned to red and dipped down and moved westward as the still green craft (fourth) moved straight across East; the first three maintained their trajectory. After this they seemed to re-assume a symmetrical flight path, it was at this point I lost sight as we drove further east down I-96. The last thing seen by the driver was that the crafts were solid and dark on the bottom, while a bit lighter on their topside with the aforementioned light on the end (seemingly round). At this point I called to our friends trailing us by a few minutes down I-96E and they we're already having an identical sighting. The driver of the truck I was riding in previously did not believe there was any credence to the UFO phenomena, and this event has his beliefs completely reversed, as it was quite amazing."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.321574,+-85.594654(20148)&iwloc=A&hl=en\"> mufon case (20148) map </A>","Weather Factors":"Rain, Light","trends":[],"files":["/var/www/straped/mufon/html2text/20148.html.txt","/var/www/straped/mufon/org/20148.html"],"Object Shape":"Cylinder, Sphere, Square, Rectagular","Country":"United States","Longitude":"-85.594654"}