{"Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Boomerang","Tags":"City","City":"Littleton","map":"<A HREF = \"http://maps.google.com/maps?q=39.614801,+-105.00985(20147)&iwloc=A&hl=en\"> mufon case (20147) map </A>","Summary":"I saw the lights first then felt the vibration and dull humm. looked up and there it was.","Sighting Duration":"Undisclosed","Case Number":"20147","Object Flight Path":"Straight-line path","Object Features":"Window(s)","trends":["There have been 29 other sightings in Littleton","There were no other sightings in Littleton on or around October 23rd 2009","This sighting has never been favorited.",""],"Date Submitted":"10/26/2009 10:14 UTC","Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-105.00985","Log Number":"US-10262009-0016","Disposition":"Unknown","divs":["Sighting DetailsI was standing on my back patio when I saw a string of lights against the starlit clear night sky. I heard, or rather felt a low vibration and dull humming sound. As I looked closer I saw a boomerang shape aircraft moving slowly about 1000 to 1500 ft in the air. It was moving too low and slow for its size (about 200 yards from end to end). It had no landing lights, but it did have interior lights that shone through rectangular windows which ran from one end of the boomerang to the other. There was no fuselage or tail section. The event happened quickly as the aircraft passed out of my line of sight. My apartment building was in the way. I ran to the parking area and looked up to where I thought the aircraft should be, and it was simply gone. I live across the street from and old Martin-Marietta aeronotics campus in Littleton, and the aircraft was actually traveling in the direction of the existing Lockeed Martin plant. My speculation is that it was a version of the B-2 Stealth aircraft. It was certainly stealthy, and had a black almost fluid quality to the texture of the exterior. It almost blended in with the night sky. I was not firightend by the sighting, but at the time it was quite surprising. I'm sure my blood pressure went up a few notches."],"Country":"United States","files":["/var/www/straped/mufon/html2text/20147.html.txt","/var/www/straped/mufon/org/20147.html"],"Date of the Event":"10/23/2009 12:00 UTC","Latitude":"39.614801"}