{"Summary":"Glowing saucer slowly came low over the trees, hovered, then left at high speed leaving a streak","Longitude":"-83.718231","Log Number":"US-10272009-0002","Country":"United States","Date Submitted":"10/27/2009 02:36 UTC","Tags":"City","divs":["Sighting DetailsATTENTION--ATTENTION--CMS ADMINISTRATOR------THIS IS A CMS TRAINING REPORT AND IS NOT A REAL EVENT-----THIS IS TO BE USED FOR DEMONSTRATION PURPOSES FOR MUFON OF GEORGIA FIs AND FITs. PLEASE REMOVE THIS REPORT FROM CMS IN ABOUT TWO WEEKS--------------TOM SHEETS, SD MUFONGA, 27OCT09 My driver was taking me home tonight at 9:00PM. He drove me east on Strouds Creek Rd. and when we came to the intersection at County Line Rd. we saw it. It was glowing, so I thought it was blimp with lights at first, but it was a round saucer like UFO. It was headed toward us low over the trees real slow, about 200 feet up. Then it stopped and just hung in the air for about 45 seconds, then took off about 5 times faster than those jets the Blue Angels team fly at airshows. It left a golden streak as it flew off out of sight back to the west behind the car. The streak then vanished in a few seconds. We heard a sort of swishing sound and the car engine cut off. I've never seen anything like it except on those shows on the History Channel. I was so shook up, I got out my flask of sour mash and we both had a stiff drink and then skint it for home. I called the Sheriff, but he told me to just sleep it off and to remember to vote for him in the next election. I will be happy to talk to anyone in MUFON that can tell me what happened!"],"trends":["There have been no other sightings in Social Circle","This sighting has never been favorited."],"Case Number":"20152","Latitude":"33.656228","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Object Shape":"Disc","Object Features":"Undisclosed","Region":"Georgia","City":"Social Circle","Date of the Event":"10/26/2009 09:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.656228,+-83.718231(20152)&iwloc=A&hl=en\"> mufon case (20152) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/20152.html.txt","/var/www/straped/mufon/org/20152.html"]}