{"Disposition":"IFO","Region":"Texas","trends":["There have been 2 other sightings in Gainesville","There were no other sightings in Gainesville on or around April 30th 2004"],"Case Number":"20150","Date of the Event":"04/30/2004 07:30 UTC","Object Features":"Window(s), Wings","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Date Submitted":"10/26/2009 11:29 UTC","Source":"MUFON","Weather Factors":"None","Latitude":"33.630191","files":["/var/www/straped/mufon/html2text/20150.html.txt","/var/www/straped/mufon/org/20150.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.630191,+-97.124385(20150)&iwloc=A&hl=en\"> mufon case (20150) map </A>","Longitude":"-97.124385","City":"Gainesville","Log Number":"US-10262009-0019","Object Shape":"Other","Summary":"Silent aircraft at low altitude of model DC-10 with no aparent malfunctions","Country":"United States","divs":["sighting detailsin the late evening hours roughly 1 hour before sunset i was walking from my house to my car. looking up above the treeline toward the east i saw a dc-10 passenger jet. strangely tho she was solid black with no running lights and no identifiable markings. her distance from me was about 1\\4 mile and alt about 300 to 400ft. unsettling truth she was at standard cruising speed about 220-250 knots and she made absolutely no noise. i find the silence unsettling because i was a submariner sonar technician for the u.s. navy and have been trained to hear what can easily be missed. the aircraft was traveling wnw through an area riddled with cell and base station towers most towers 300 to 600ft tall and a few 1500ft+ with guide lines for stability. new stealth tech for military? smuggling? private enterprise? these people had an intimate knowledge of the areas infrastructure. i felt the persons onboard saw me and that i was not supposed to have seen them. the hairs on the back of my neck stood up, not in fear, but anticipation for an upcoming confrontation with officials who would like to keep this event secret. i lost sight of the aircraft as it passed beyond the western treeline."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City"}