{"Longitude":"-71.406864","Source":"MUFON","trends":["There have been 27 other sightings in Providence","There was one other sighting in Providence on or around November 30th 2002"],"Object Features":"None","Date Submitted":"10/27/2009 12:15 UTC","Object Shape":"Square, Rectagular","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"41.825599","Tags":"City","Object Flight Path":"Stationary","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/20151.html.txt","/var/www/straped/mufon/org/20151.html"],"Case Number":"20151","Summary":"Object floating 300ft up. Rectangular in shape, rusty brown color. It reminded me of a piece of a iron girder.","Weather Factors":"None","Date of the Event":"11/30/2002 12:00 UTC","Viewing Distance":"101-500 Feet","divs":["Sighting Details I was driving on my way home from work, and had just got on route 6 south in providence. It was about 4pm. almost as soon as i got on the highway i saw the object.It was a dark color and contasted against the blue sky. The object, as I first noticed reminded me of a large slab of rusted brown iron girder. The object appeared motionless the entire time I observed it. I pulled over in the breakdown lane, to get a better look. it appeared to be around 300ft off the ground. the sky was clear and there were no other objects near it to get a better perspective. The object was rectangular was about 20ft long and 10 ft wide. i was about 300yds from the object. The object looked like a slab of rusted iron girder. however when i scanned the area below and near it, there was no crane, or equipment that could hoist that type of object. As mesmerized, and curious as to what I was seeing, the hazardous position of being in the breakdown lane at rush hour, led me to stop watching and continue with my commute. I felt confused about the object. After I felt that I ruled out other flying and hovering objects , as well as dirigible ( Hood Ice cream has one, and I,ve seen it, and this was not it. And when I saw there appeared to be nothing, no crane or other mechanical explanation, i was mysterfied. I remember I ran the event over and over in my mind trying to come up with an explanation, which I haven't yet found. I did not even consider the possibility of an ufo because I didn't think it fit any category of reported objects. I've never told anyone about this. A site on the internet sparked the memory of the experience. The time period that this took place was between 2000-2005. I realize that is a long time but unfortunately that is my only reference memory."],"Region":"Rhode Island","map":"<A HREF = \"http://maps.google.com/maps?q=41.825599,+-71.406864(20151)&iwloc=A&hl=en\"> mufon case (20151) map </A>","City":"Providence","Log Number":"US-10272009-0001"}