{"Disposition":"IFO","Weather Factors":"None","Date of the Event":"10/28/2009 07:10 UTC","Viewing Distance":"Unknown","Case Number":"20164","Country":"United States","trends":["There have been 2 other sightings in Gatesville","There were no other sightings in Gatesville on or around October 28th 2009"],"Log Number":"US-10282009-0004","Object Features":"Unknown","Latitude":"31.436954","map":"<A HREF = \"http://maps.google.com/maps?q=31.436954,+-97.734701(20164)&iwloc=A&hl=en\"> mufon case (20164) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Flash","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20164.html.txt","/var/www/straped/mufon/org/20164.html"],"divs":["Sighting DetailsI'm on my back porch very often in the mornings and have been at this location for 4 years. Normal air traffic consist of low flying helicopters from Fort Hood and an occasional plane on landing pattern for airport at Killeen, TX. The air space around my area is restricted because of the Fort Hood military base and George Bush's ranch down the road so normally only military craft are in the location where I saw this event. The sun was coming up but it was still dark enough to see a few stars, expesially the Bright star in the East. Something extremely bright was traveling from North West of me toward the South East at a strange pace. Due to the brightness and speed of the object, it made it hard for me to determine what type of craft it was. I never heard any sounds that one would normally hear when air traffic is around. I knew it was out of the ordinary at first but when it completely disappeared, I knew something was different. After about one minute of watching this object, it vanished. I searched the sky for another few minutes in the direction it was heading without successfully locating it again."],"Object Flight Path":"Straight-line path","City":"Gatesville","Date Submitted":"10/28/2009 09:02 UTC","Region":"Texas","Summary":"Light brighter than the north star traveling slowly in restricted air space.","Tags":"City","Longitude":"-97.734701"}