{"trends":["There have been no other sightings in San Miguel","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.752468,+-120.696283(20162)&iwloc=A&hl=en\"> mufon case (20162) map </A>","Disposition":"Insufficient Data","Summary":"Fireball SSW of San Miguel, CA","Country":"United States","Tags":"City","Date Submitted":"10/28/2009 01:01 UTC","Weather Factors":"Windy, Medium","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Source":"MUFON","Longitude":"-120.696283","City":"San Miguel","divs":["Sighting Detailsthe time wa between 2116 and 2122 PST on 27 October 2009. I was driving on 10th street heading south right at the camp roberts boarder. I saw a redish orange firey ball standing in the sky about 40 degrees westwardly off the road (SSW), and an elevation about 25d. It seemed to hover there for the duration of the time, not moving closer or backward and not adjusting in intensity. It was twice as bright as Venus and a little larger. I could trace a straight line between venus and the brightest star in the sky pointing to it with equa-distant intervles (probably no help). I took a few quick snap shots with my camera, brief video, and test a friend in the town south of me to try and get a tringulation of the thing; while I smoked my ciggorette. My friend didn't get out to see it fast enough. after I jumped back in my car it was gone. I have watched a bunch of rocket launches from Vandenburg AFB (this was brighter, and didn't move). And I am in the satellite communications field (not a satellite). I have been an airplane and UFO fenatic sense I was a kid, and Have actually begun to get my piolets license with pigs can fly. One of my hobbys is stargasing (so was my dads) so I'm farmiliar with some of the random sights that people claim to be UFOs. I could not explain what I saw and would like to get the info e-mail to me if anyone else saw it. Thank you"],"Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/20162.html.txt","/var/www/straped/mufon/org/20162.html"],"Latitude":"35.752468","Date of the Event":"10/27/2009 09:16 UTC","Log Number":"US-10282009-0002","Case Number":"20162","Region":"California","Object Features":"Unknown"}