{"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"06/15/1974 12:00 UTC","Object Shape":"Sphere","Latitude":"35.401875","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.401875,+-97.589267(20167)&iwloc=A&hl=en\"> mufon case (20167) map </A>","Tags":"City","Longitude":"-97.589267","files":["/var/www/straped/mufon/html2text/20167.html.txt","/var/www/straped/mufon/org/20167.html"],"Disposition":"Unknown","Object Flight Path":"Other","Case Number":"20167","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around June 15th 1974"],"City":"Oklahoma City","Log Number":"US-10282009-0007","divs":["Sighting DetailsWe were living temporarily at the Thunderbird Motel in NE OKC right on hwy 66. We were watching an overhead funnel cloud as the funnel kept dipping down slightly, bobbing up and down. Suddenly a spherical object came below the cloud level, as if it was studying the funnel cloud. It was @ 100ft in diameter, with lighted panels,about6'high by 10' long,flashing in an AC chaser-like sequence counter-clockwise. The peculiar thing was that it would flash a different color at each panel succesion, but the same panel would flash different colors. It simply drifted alongside the cloud, and I could see mechanical arms that were retracted as if they were landing gear. I only saw two, so I assume there was a third that didn't face our direction. There was NO SOUND! It finally just rose back into the cloud. I counted how many of us saw that, and, including myself, there were exactly 30 of us. We discussed whether we should call authorities about it, and decided they'd think we were crazy, so we didn't. After moving to TN another event happened 8-27-94 that was completely different, so I'll call this website back to tell you what happened that time. Jim"],"Weather Factors":"Windy","Region":"Oklahoma","Date Submitted":"10/28/2009 01:56 UTC","Summary":"Vehicle descends next to funnel cloud"}