{"Case Number":"20166","Latitude":"43.005296","Country":"United States","Weather Factors":"Windy, Light","Region":"New York","Longitude":"-78.181657","files":["/var/www/straped/mufon/html2text/20166.html.txt","/var/www/straped/mufon/org/20166.html"],"Source":"MUFON","divs":["Sighting DetailsMy husband and I were heading towards Pavilion, NY from Batavia, NY on Route 63 on October 26, 2009. It was very dark out and about 8:15pm when we saw an object with 5 LARGE white lights and 1 SMALL red blinking light hovering low above the road in the distance ahead. Coming from Batavia we thought it was a radio tower or airplane or something of that nature. As we neared it we noticed it was some type of aircraft. We both were pretty calm at first because neither my husband or I believed in UFO's. As we drove directly under this object we both became extremely nervous. I didn't know what to make of what I just saw, my husband couldn't even speak. I know we were not the only ones who saw it because there were several cars in front of us an behind us. The cars in front of us were pulling off to the side of the road to look at it and other cars were swerving in their lane trying to look at the object. The object would not move. We opened our windows but no noise was present. After we drove a little ways up the road the object disappeared without a trace. When we arrived home about 7 minutes later, we stepped out of our car and the air smelled different, kind of like ozone or something like that. Then, a half hour later, my husband stepped out onto the deck for his last cigarette of the evening and looked up at the sky because he heard a noise. He then knocked on the window for my brother and I to come outside. There was an odd humming noise unlike an airplane in the sky. We looked up and I saw an aircraft that looked like a square on top of a rectangle though my husband said it reminded him of the shape of an arrowhead sort of but without a point on the end. It was moving sideways. We watched until it disappeared once again. Later, about 3am that morning we were awoken by the odd humming again. We looked out the windows but saw nothing. However, there was an unfamiliar high pitched noise coming from the corn field behind our house. Lasted about 15 minutes then just stopped. Did not get much sleep that night because we were already a little shaken by what we had already seen."],"trends":["There have been 7 other sightings in Batavia","There were no other sightings in Batavia on or around October 26th 2009"],"Object Flight Path":"Stationary,Hovering then path,Other","Date Submitted":"10/28/2009 11:57 UTC","Viewing Distance":"21-100 Feet","Tags":"City","Object Shape":"Square, Rectagular, Star-like","Date of the Event":"10/26/2009 08:15 UTC","City":"Batavia","Sighting Duration":"Undisclosed","Summary":"Object over Route 63 just outside Batavia, NY maintained a stable position over the road, about 30 ft above the road.","Object Features":"Unknown","Log Number":"US-10282009-0006","map":"<A HREF = \"http://maps.google.com/maps?q=43.005296,+-78.181657(20166)&iwloc=A&hl=en\"> mufon case (20166) map </A>","Disposition":"IFO"}