{"Tags":"City","Case Number":"20161","files":["/var/www/straped/mufon/html2text/20161.html.txt","/var/www/straped/mufon/org/20161.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Other","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around April 2nd 2007"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.540606,+-81.376086(20161)&iwloc=A&hl=en\"> mufon case (20161) map </A>","Date Submitted":"10/28/2009 12:07 UTC","Source":"MUFON","Country":"United States","Region":"Florida","Date of the Event":"04/02/2007 09:30 UTC","Object Features":"Wings","Disposition":"Unknown","Latitude":"28.540606","Longitude":"-81.376086","Log Number":"US-10282009-0001","divs":["Sighting DetailsI was driving home from class and was on the 408W around exit 12 or 11 in Orlando. (For those who don't know this route takes you thru the city of Orlando on a kind of highrise highway). It was around 9:30pm and I was alone. I noticed a red shine reflecting off the buildings windows, about halfway up the buildings height My initial impression was that it must be some kind of promotional thing or maybe an ambulance reflecting as the light was pulsing. Those thoughts were quickly gone when I saw what looked to be a red blood cell-looking object quickly floating from in between the two buildings! When I saw it, my thoughts were excited, as I have been intrigued by UFO's since I can remember, and here was one, maybe a mile away from me! Then, without warning, it turned to its right(my left) and quickly glided over to my minivan that I was driving. As it flew over I noted how much it did look like a red blood cell. It had this plasma-like see-thru forcefield surrounding it and in the very center was a constantly glowing red ball, it would light up every other second and would make the entire plasma-like field around it glow a bright red. I did also notice that it didn't seem to reflect on the tree leaves, almost as if the plasma collected the light. It flew over, silently, to my van where it flew with my van for about a mile or two, right in front maybe about 15-25ft in front and slightly above the minivan's windshield. I would like to take a moment to point out the size of this object, which with plasma-like shield and all was no larger than my minivan. I'm watching this, I'm driving about 75mph on the highway and it must have been moving at the same speed because it stayed equidistant from me the entire time. After what seemed to be 1, maybe 2 minutes, the plasma-like substance surrounding it faded out and the red center ball spun to the left in a way that seemed internal but it created a yellowish sort of light that seemed more a result of the speed of its spin more than a color change, as the red color seemed to over-envelope it (almost as if the yellowish light was peek-a-booing thru it). I watched this spinning went on, and the spinning ball shape-shifted and grew wings with little lights underneath the tips of the wings, the left light was a white blinking, the right was a yellow blinking light. Underneath the center of it was still the red blinking light. To tell it best it appeared to be a very small plane. Only, it was no plane that I've ever encountered as it would have to be flying backward at 75mph. Also, if you would, imagine the red blinking light in the center of it to be an axis of sorts, so while the rest of the \"plane\" was wobbly, the center remained in the same spot. I felt awed. I felt as if I were going crazy, I questioned my sanity. I remember I looked in my rearview mirror and all the cars that were around me were way back, almost slowed to a crawl, I also realized that no one was in front of me anymore. I guess people figured better me to handle it than have it come to their vehicle. I looked back at the ufo, it was still very much 15-25ft in front of me, still, as I felt, watching me I don't know why I felt that way, but it was like it was showing itself to me, showing me, \"look what I can do\". I did not feel threatened, and I certainly wasn't scared of it, it was almost in a sense, exciting. I was lucky to see this, so close. I felt what I was seeing was rare. And, I don't know if this will make any sense, but I felt like it was being coy or playing with me. I don't know why I feel that way, but it didn't hurt me nor anyone else and it left me feeling so pleasant at the end that is how I feel. I suppose now is the best time to say how I lost sight of this. As I was driving, there was a police cruiser with his lights flashing but NO siren, he almost hit my minivan when he slid in between myself and the ufo. The UFO veered off to the right where there was a 10ish story brick building, it flew to the top window and produced a very bright white light and it flashed the window, seemingly peeking inside, and hovered there. I truly wish I could have stayed and watched but my drive home was long and I wouldn't get home till 10:30 as it were, so I drove home. I did note, however, that the police cruiser never pulled me, I was never contacted about it and I never saw anything about this on the news. I hope this information helps and, if you have any questions about what I have seen, feel free to contact me."],"City":"Orlando","Summary":"Red Pulsating Blood Cell UFO that Shapeshifted at Close Proximity","Viewing Distance":"20 Feet or Less"}