{"trends":["There have been no other sightings in Fort Fisher","This sighting has never been favorited."],"Date Submitted":"12/08/2002 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.971751,+-77.917599(2016)&iwloc=A&hl=en\"> mufon case (2016) map </A>","Region":"North Carolina","Object Flight Path":"Straight-line path","Longitude":"-77.917599","Case Number":"2016","Latitude":"33.971751","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Other","Log Number":"","Summary":"saw bright lighted object with no sound","Date of the Event":"12/08/2002 11:30 UTC","Sighting Duration":"00:05:00","Tags":"City","Weather Factors":"Windy","Object Shape":"Oval","divs":["Sighting DetailsI was sitting on a large rock at the beach staring at the sky, and I noticedwhat appeared to be a bright star, but it moved very slowly and was closer thanit first appeared. It got closer, but no sound, and no colored flashing lightslike an airplane has. It got fairly close. It looked like an egg shapedobject, with an aura around it of whiteblue-white light that got brighter as itgot closer, but never flashed, and never had a sound. It was heading up thecoast northwards and sort of inland, stopped, and reversed direction withoutturning. It came very close, within 1000 feel I think, but was hard to tellcause the light was so bright I couldnt tell. The object didnt appear to haveany windows or doors, but the light ring around it was so bright it was hard totell. Nothing seemed reflective. During this time, I tried to use my cellphone to call a friend, but it just said it was searching for service, and Iusually have great signal there. When the object got closest, it stopped andhovered for like 45 seconds, without a sound. It then went almost straight up,stopped and dissapeared so fast, I couldnt beleive it I felt very mezmerizedwhile watching it, and then afterwards I felt very uneasy about it. I didnttell anyone about it until now, cause i guess people would think I was strangeor something."],"files":["/var/www/straped/mufon/html2text/2016.html.txt","/var/www/straped/mufon/org/2016.html"],"Country":"United States","Disposition":"Insufficient Data","City":"Fort Fisher"}