{"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Summary":"I watched it appear and disappear right before my very eyes!!!","Case Number":"20168","Disposition":"Unknown","Date Submitted":"10/28/2009 02:00 UTC","Longitude":"-95.556402","Date of the Event":"09/25/2009 06:30 UTC","Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Stafford","There were no other sightings in Stafford on or around September 25th 2009"],"Object Shape":"Circle, Fireball, Star-like","City":"Stafford","Latitude":"29.617887","divs":["Sighting DetailsI have always been completely fascinated by the sky in all it's celestial wonder. Not because of the many infinite and unexplained phenomena and mysteries that it beholds but because in my opinion it is the most beautiful form of live art.This is where I most vehemently see and feel God...in nature. The clouds, the sunsets, sunrises, everything about the sky completely enthralls and captivates me. I am a very scientific person and also a very, very spiritual person. I am skeptical about things such as UFO's, ghosts, spirits, aliens, and anything that I cannot see or feel for myself. I have always said, it's not that I don't believe, I am very open minded but I need to see things like this for myself in order to truly believe. This is why this occasion just leaves me speechless. I don't know how to explain what I saw. But I SAW IT. My fiance and I were driving from our place to visit our parents near Stafford driving down Beltway 8 south and approaching the Gessner exit when I was merely looking out of my fiance's window up at the clouds in the sky. He was driving, I was in the passenger seat. The sun was setting at the time so it was still bright out but not so bright that a very brilliant light in the sky could've been overlooked. That is exactly what I saw. I saw a round, incredibly bright, bright light that seemed to be moving with the car. I knew right away it wasn't a plane or any other type of machine of that nature. I just felt that it was something....different....something I couldn't quite put my finger on. It was ....it just was. It wasn't the typical UFO sighting I've heard about or even the kind we see in movies. There was no actual tangible object I was looking at. It was just a very bright light. And I would've not been the least bit suspicious of said light except that I asked my fiance if he could see it too. So he turned his head in that direction and was able to witness it as well but only for a few seconds as he had to concentrate on the road. So I continued to stare at it, and it seemed almost immediately after I mentioned it to my fiance and he saw it, well, this is what happened next. As I stared at the light it seemed to get bigger and brighter and then it seemed to be moving away rapidly because it got smaller, then smaller, then just zoomed away instantaneously and disappeared. I watched the whole thing happen right before my eyes. I was the president of the astronomy club in college, I know what stars look like, what planets look like, I can tell you almost every single celestial phenomena involving clouds and actual scientific celestial things I can tell you what the airplane towers look like, I HAVE NEVER IN MY ENTIRE LIFE SEEN ANYTHING LIKE THIS!!! I know I didn't imagine it although sometimes I wonder if it would be better to believe that. I don't know to explain what I saw or even try to make sense of it, all I know is that I saw something. I don't know why, but I did. And I have to be honest, although I have no clue what it was it's not something one can easily forget. It gave me a whole new perspective on the place I already called home and couldn't wait to get back to, the stars, the world above and beyond us. I've always thought this universe and it's infinite vastness was just too big for us to be alone but what I saw that night, well maybe it's just a little firmer tug on my heartstrings. Maybe it was just the confirmation I needed."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/20168.html.txt","/var/www/straped/mufon/org/20168.html"],"Log Number":"US-10282009-0008","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.617887,+-95.556402(20168)&iwloc=A&hl=en\"> mufon case (20168) map </A>","Region":"Texas","Weather Factors":"Unknown","Object Features":"Undisclosed"}