{"Disposition":"Unknown","Date Submitted":"10/28/2009 01:58 UTC","City":"Houston","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Case Number":"20163","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"10/26/2009 12:00 UTC","Country":"United States","Log Number":"US-10282009-0003","Latitude":"29.766893","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around October 26th 2009"],"Summary":"Abduction","Region":"Texas","Object Features":"Undisclosed","divs":["Sighting DetailsI have written to this site a couple of time describing the encounters that I have had with other-worldly beings and since my last sighting I have seen nothing. To touch on my first encounter again, the first time I encountered an unexplained being I remember being brought aboard their craft. Many years later I noticed an object in my bottom lip that felt hard to the touch. Years after that, my dentist noticed the object in an x-ray and was later unable to identify the object. Last night's incident was unbelievable, even by my standards. I was asleep Monday night at about 10:30 P.M. in my living room. I awoke at around 2:00 A.M. to move to my bedroom. Then I seem to have a dream of standing in front of a crowd of people and teaching them something I cannot remember. Then I awoke on the floor of my room late for work, disoriented, and wet. The strangest thing is that my mother who sleeps across the hall from me had a similar dream and woke up in the same manner. Whether or not people in this world believe in such circumstances is something left up to the mind of the individual, however I have gone through a life of encounters. I have proof hidden in my lower lip. I was told and taught something, I just wish I could remember what. There is no memory of an object or beings, only the strange environment and the lapse in time. I felt at peace. I was happy. I was a leader in this group. The truth will come out. I am tired of forgetting these events!"],"Longitude":"-95.36086","map":"<A HREF = \"http://maps.google.com/maps?q=29.766893,+-95.36086(20163)&iwloc=A&hl=en\"> mufon case (20163) map </A>","files":["/var/www/straped/mufon/html2text/20163.html.txt","/var/www/straped/mufon/org/20163.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City"}