{"Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"20169","Region":"Oklahoma","divs":["Sighting DetailsI was talking with a neighbor outside. I was glancing at the sky occasionally as I usually do. I noticed what appeared to be an airplane coming in my direction from the west. I decided to see which airplane it was. My father was an air traffic controller and always looked at the sky and would identify planes. As it approached it was becoming bigger and brighter where I thought it was going to crash as it seemed to be so low. I also noted that there was no flashing lights to identify it as a plane. It made no sound as it flew overhead and continued across the sky slowly. I was very bright. It began to go more Southwest and at some point changed color to a golden color. The neighbor and I were both speachless. I was laughing because to me it was something I could not explain. I watched it until it went out of view. We did not even remember what we were talking about because it was so strange to experience what we saw. The following month I attended the astronomy club meeting and asked about what I saw. I was told that it had to be an iridium satellite. I did not report it anywhere else at the time because I took what they said for the explanation."],"Weather Factors":"None","City":"Moore","Log Number":"US-10282009-0009","map":"<A HREF = \"http://maps.google.com/maps?q=35.341138,+-97.484443(20169)&iwloc=A&hl=en\"> mufon case (20169) map </A>","Disposition":"Unknown","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around September 15th 2008"],"Country":"United States","Longitude":"-97.484443","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/15/2008 12:00 UTC","Date Submitted":"10/28/2009 02:22 UTC","Summary":"irridium flare or ufo","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/20169.html.txt","/var/www/straped/mufon/org/20169.html"],"Latitude":"35.341138","Object Shape":"Circle"}