{"Disposition":"Insufficient Data","Date Submitted":"10/27/2009 10:44 UTC","Latitude":"39.170295","Object Flight Path":"Straight-line path","Longitude":"-86.522186","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/20160.html.txt","/var/www/straped/mufon/org/20160.html"],"trends":["There have been 12 other sightings in Bloomington","There were no other sightings in Bloomington on or around October 26th 2009"],"Summary":"White sphere traveling @ a high rate of speed 330 degrees NW","divs":["Sighting Details On October 26, 2009 @ approximately 1545 Eastern Standard Time, I stepped out on my back patio when I heard a jet flying over east to west to land @ a nearby airport 5 miles west of my house. I looked directly up to try and locate it when much to my surprise, I witnessed a spherical white object flying in a straight path of 330-340 degrees north to northwest @ a high rate of speed. The experience lasted approx. 3-4 seconds before it disappeared over the horizon. I'm guessing the altitude of the object was approx. 10,000-to 25,000 ft. because it flew beneath the few scattered cirrus clouds that were present. My first thought was that it was a satellite passing by, but I tried to rule that out because there was no glare from the sun which was starting to set to the southwest as well as traveling below the cirrus clouds. It also did not have a tail or debris field behind it, nor was there any light emittance that I could tell, which makes me want to rule out a meteor. The speed was much faster than a satellite which I have viewed hundreds of times yet slower than a meteor. The best description as far as the size would be if I were to hold up cottonball or possibly a golfball with my arm fully extended. For several years, F-16s would fly over our house on training runs at approx. 10-20,000 ft. and I could usually watch them fly over for a good 12-15 seconds at a probable speed of 400-600 mph. Being an analytical person, I find this anomaly to be challenging and quite simply, the last thing I ever expected to see when I looked up. I'm trying to make comparisons to the F-16s, meteors, and satellites that I've viewed over the years and am completely stumped! Did anyone else witness this same event over central Indiana or the midwest at that approximate time and date?"],"Date of the Event":"10/26/2009 03:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.170295,+-86.522186(20160)&iwloc=A&hl=en\"> mufon case (20160) map </A>","Viewing Distance":"Unknown","Region":"Indiana","Case Number":"20160","Source":"MUFON","Country":"United States","Object Features":"Unknown","Weather Factors":"None","Log Number":"US-10272009-0010","Tags":"City","Sighting Duration":"Undisclosed","City":"Bloomington"}