{"Object Shape":"Triangle","Latitude":"39.382262","Summary":"Dark triangular object seen next to 46 in Cory are","Object Flight Path":"Stationary","Log Number":"","Sighting Duration":"00:05:00","City":"Cory","Object Features":"Window(s)","Date Submitted":"11/30/1988 11:00 UTC","divs":["Sighting DetailsI had this experience when I was college in Bloomington. I cant be certain ofthe dates because it was several years ago. It was most likely like 10 or 11 atnight.I was on highway 46. I was somewhere between where 59 intersects with 46 andRiley. I believe that I was near the Cory area or approaching Riley.It was a clear night and there was some moonlight as I remember. So visibilityin the night sky was good. As I looked ahead on the left hand side of the roadin the distance I saw a dark object in the night sky. I thought it was a lowflying airplane. But, it seemed pretty low to the ground and I couldnt yet makeout any lights. I was curious about this dark spot and kept my eye on it as Iwent down the highway. The dark spot remainded stationary and became larger thecloser I got to it. I could see the dark object wasnt far from the road on theleft hand side. As I got closer, I began to slow down so I could better see theobject. There were two cars in front of me and they also slowed down.As I got closer to the object, I could make out the form - triangular. I couldeven see white lights coming from what I thought were cockpit lights. As I goteven closer, I could see that these were recentangular windows at one end of thetriangular object. As I came right up on the object, I pulled off onto theright hand side shoulder of the road. So did the two cars ahead of me. Irolled down my driver side window and looked squarely at the object.It was 300-500 yards away. It was triangular. It was dark. It had white lightcoming out of the rectangular windows. I seem to vaguely remember it had someother lights. The object was hovering. Actually, I dont think the object movedfrom the first moment that I spotted it. It was only a few hundred feet up inthe air. It was large. Ive seen the stealth bomber at the Indy 500. I wouldsay it was in that size range.Up to this point, I was curious. As I got closer, I became more and moreinquisitive - I wanted to know what this strange thing was. As I began toexamine the object in a fairly close proximity, I became distrubed. First offall, it was hovering. That didnt seem right. Then I realized that I didnt hearit making any NOISE. At that point in time, I became afraid. The two cars thathad pulled over in front of me were quickly pulling back onto the road and sodid I. We all proceeded away at a high rate of speed. I distinctly rememberinga feeling that what I was seeing - wasnt right. I felt it wasnt something thatfor wh"],"Disposition":"Unknown","Weather Factors":"Unknown","trends":["There have been no other sightings in Cory","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.382262,+-87.205849(2017)&iwloc=A&hl=en\"> mufon case (2017) map </A>","Source":"MUFON","Region":"Indiana","Country":"United States","Tags":"City","Case Number":"2017","Longitude":"-87.205849","Viewing Distance":"101-500 Feet","Date of the Event":"11/30/1988 11:00 UTC","files":["/var/www/straped/mufon/html2text/2017.html.txt","/var/www/straped/mufon/org/2017.html"]}