{"Longitude":"-90.193194","Summary":"Large Triangle Traversing St. Louis.","Weather Factors":"Unknown","Date of the Event":"10/24/2009 09:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.629772,+-90.193194(20172)&iwloc=A&hl=en\"> mufon case (20172) map </A>","Viewing Distance":"Unknown","Object Features":"Unknown","Date Submitted":"10/28/2009 02:56 UTC","Disposition":"Hoax","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around October 24th 2009","This sighting has never been favorited.",""],"Sighting Duration":"00:01:00","Region":"Missouri","Object Shape":"Triangle","City":"St Louis","files":["/var/www/straped/mufon/html2text/20172.html.txt","/var/www/straped/mufon/more/20172_submitter_file1__2009102421010000.JPG","/var/www/straped/mufon/org/20172.html"],"Latitude":"38.629772","Log Number":"US-10282009-0012","Country":"United States","Object Flight Path":"Path with directional change","Source":"MUFON","Tags":"City","Case Number":"20172","divs":["Sighting DetailsI was going to a friend's house about 3 miles from my home. I was just about there, coming to a major city intersection where I would take a right. A few minutes earlier I'd already noticed a bright single white oval light coming towards me from my left, lower in the sky, but it seemed probably a commercial airliner. When it got closer, it showed a green navigation light on a wing with bright landing lights, or so it then seemed. But, when it crossed behind some trees, the navigation light had become white! At this point it was just about in front of me, just to the left. As the craft continued to move east from right to left across my field of vision, directly over the road in front of me, it slowly tilted up its bottom towards my direction showing a perfect isosceles triangle of white lights with a single red blinking light, with a small red \"halo\" around it, in the middle. The craft continued to move slowly, then slowly rotated its bottom back down again while also starting a slow bank towards the north. At that point all three white lights started to blink. The car in front of me literally stopped in road after turning just slightly towards where the craft was banking away. I had to stop my car to avoid hitting him, and pulled around him while the craft was lost from sight behind some trees. I've filed this report because I feel bad that I didn't stop also, as I'm ninety-nine and forty-four one hundredths percent sure that he also saw what I did and was astonished at what he was seeing. I guess he was hoping that I or someone would stop too to verify with him what he saw. I'm sure there are are other people that could have seen this large object fly over St. Louis too, so I'm reporting this should anybody be looking for such verification. I've created an image of the exact location but for it being a cloudy day instead of a cloudy night: The craft was \"painted\" in to show a facsimile of what was seen at one point that night."]}