{"trends":["There have been 2 other sightings in Benson","There were no other sightings in Benson on or around October 26th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsAfter leaving Kartchner Caverns in Benson, Arizona I was taking scenic pictures of the mountains on the way home using my Fuji 70EXR 10 megapixel digital camera. I took them out the passenger side window with the window down. It was approximately 1-2pm. Upon getting back to the resort I looked at the pictures and saw this object in one of the photos. I hadn't noticed it when I took the photo. The photo shows a hazy whitish oval with a slighty purple rim that appears to be infront of the mountain and in between me and the mountain. Not sure what it is but thought I'd submit this incase someone else in the area had an experience. Also I should mention the previous day while visiting Coronado National Park at roughly the same time, I saw in the sky a highly reflective or brightly illuminated object slowing moving north. It did not look like a plane. I watched it for several seconds and then it completely disappeared out of a clear blue sky. I got out of the car to look for it and took photos of the sky, and it was nowhere to be seen nor did it appear on any photos. Fellow guests back at our resort the Eplendor in Rio Rico also reported seeing a similar object that was visible for approximately 15 seconds around 7pm the same evening, also moving north. I should add that I have a masters degree in Astronomy from Swinburne University and am an USAF vet. Neither object was Venus!"],"Object Shape":"Oval, Unknown","Latitude":"31.967861","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/20175.html.txt","/var/www/straped/mufon/more/20175_submitter_file1__ArizonaUFO102609.JPG","/var/www/straped/mufon/org/20175.html"],"Date Submitted":"10/28/2009 11:07 UTC","Longitude":"-110.294517","map":"<A HREF = \"http://maps.google.com/maps?q=31.967861,+-110.294517(20175)&iwloc=A&hl=en\"> mufon case (20175) map </A>","Summary":"Oval hazy object near mountain.","Object Flight Path":"Unknown","Date of the Event":"10/26/2009 12:00 UTC","Log Number":"US-10282009-0015","Viewing Distance":"Over One Mile","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Unknown","Country":"United States","Weather Factors":"None","City":"Benson","Case Number":"20175","Region":"Arizona"}