{"Object Features":"None","Country":"United States","Latitude":"42.907248","map":"<A HREF = \"http://maps.google.com/maps?q=42.907248,+-85.791978(20176)&iwloc=A&hl=en\"> mufon case (20176) map </A>","Date Submitted":"10/29/2009 12:06 UTC","Weather Factors":"Unknown","Longitude":"-85.791978","Date of the Event":"10/27/2009 07:45 UTC","Log Number":"US-10292009-0001","Sighting Duration":"Undisclosed","City":"Georgetown Township","Viewing Distance":"Unknown","Region":"Michigan","Tags":"City","trends":["There has been one other sighting in Georgetown Township","There were no other sightings in Georgetown Township on or around October 27th 2009"],"Source":"MUFON","Object Shape":"Sphere","Disposition":"IFO","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsI came home & stopped in the driveway & got out of the car & retrieved the newspaper from the box. I got back in the car and started pulling toward the garage when I looked up into the sky toward the north and noticed several orange globes of light mostly in a staight line moving from north to southwest. I shut off the car and got out to observe better. I walked out of the light of the garage into the darker area west of the garage and noticed more lights appearing from the north. There were about 4 that seemed bunched up and then they aligned into a straight line and moved toward the west where, one by one, they just disappeared. In all there were about 10. There was no sound to them. I could hear the announcer at the high school football field, but there was no other sound. I observed that there was no wind and the moon was slightly obscured by clouds to the south & east of the driveway. I ran to the door of the house and called to my husband, but he did not hear me as he was in the basement and I did not want to lose sight of the globes so I did not go & get him. It took about 5 minutes for this to finish. There was no mention on the 11:00 pm news and no reports on the internet. I regret that I did not have my camera, as my husband, mother and brother do not believe me. Can you please tell me what they were?"],"files":["/var/www/straped/mufon/html2text/20176.html.txt","/var/www/straped/mufon/org/20176.html"],"Case Number":"20176","Summary":"10 orange globes of light flying from north to west with no sound & then disappearing."}