{"Latitude":"43.16953","Longitude":"-77.603062","Log Number":"US-10282009-0013","trends":["There have been 53 other sightings in Rochester","There was one other sighting in Rochester on or around October 25th 2009"],"City":"Rochester","Viewing Distance":"20 Feet or Less, 21-100 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","Region":"New York","divs":["sighting detailsgentlemen: i live on lake ontario and for the past year have been filming many ufo events on the lake. i have invited witnesses to do our ufo night watching and have on my video camera 60-70 strange encounters. i have multiple orange shaped intelligent flying objects flying over lake, i have white orbs appearing and flying towards my house. i have seen 2 huge ships. the first time was a very large almost giant diamon shaped ship traveling at a high rate of speed spinning with red, white lights among other lights and the ship was spinning rapidly. i have seen lights that look like stars at first glow very bright and suddenly dart in close to my home. i have used things such as very bright glowing lamps in total darkness which seems to almost attract them, i have used lasers and i am successfull at attracting them about 50% of the times that i have tried. i have on tape a strange object come up from the lake and appear about 50 feet in front of me and a group of witnesses just this past may. this happened while i was filming a white orb coming toward us, and suddenly a splash from the lake and this object came up people within the group started to run away (this is all documented on my camera) i live approximately 1\\2 mile from guinea nuclear plant and since there is a restrictive no fly zone the triangel red blinking objects are here frequently. i began noticing these objects while sitting on my dock watching sunset and i saw a silver like cylinder shaped flying around, this is what started my fascination, my neighbors can attest to many of the things i have stated here and i actually believe that i can attract these crafts using some of the methods i have developed that seem to get their attention and since i now have so many documented events and over 20 people who have been invited and have witnessed these strange events, i believe u can gather evidence here that may prove it once and for all. i should tell you that on more than one occasion myself and the people i was with did feel threatened and the ufos did seem aggresive , but for the most part they seem to go away quickly when they feel like it. i am very close to actually making my own documentary footage and inviting people thru ads so i have differnet peopls real live accounts on tape, i would like to keep my footage to myself right now but will provide it to you if you would like to investigate these multiple sightings."],"Case Number":"20173","Summary":"Orange, White lights Triangle shaped and also Diamond Shaped with red lights","Date Submitted":"10/28/2009 03:29 UTC","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.16953,+-77.603062(20173)&iwloc=A&hl=en\"> mufon case (20173) map </A>","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20173.html.txt","/var/www/straped/mufon/org/20173.html"],"Source":"MUFON","Date of the Event":"10/25/2009 12:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Circle, Cylinder, Diamond, Disc, Egg, Fireball, Triangle","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change"}