{"Date of the Event":"10/27/2009 06:47 UTC","Country":"United States","Case Number":"20174","trends":["There have been 5 other sightings in Artesia","There were no other sightings in Artesia on or around October 27th 2009","This sighting has never been favorited.",""],"City":"Artesia","Weather Factors":"Windy, Medium","Region":"New Mexico","Latitude":"32.844314","Summary":"3 white lights in a trangle formation","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI was on my computer and looked out the window. I saw what looked like 2 lights flying next to each other. I went to the front door and looked out to see what looked like 3 bright round lights flying in a triangle formation. I called for my dad and mom to look at it. My mom came out first and saw it too. Then my dad came out and right away said it was one of those triangle UFO's we here about. He then went in the house and came back out to the front with his night vision camera that is attached to a camcorder. My dad filmed the UFO. I got some binoculars from the house and looked at it closer, but by that time it was moving away from us. What I saw was 2 bright white lights in the front, 2 blinking lights in the middle(1 red and 1 white), then 3 bright white lights in the back. I couldn't tell for sure but there might of been a tail of an airplane in the back. When I watched the video my dad filmed, it did not look like a airplane though and we did not hear any jet or airplane sounds at all. It was below the clouds so I would think it would of made a sound if it was. We watched the object from our front porch facing east at first, then the object turned toward the west where we lost it in the trees to the north of us. The object flew from the south to the north then west. The sighting lasted about a minute and a half."],"Date Submitted":"10/28/2009 09:24 UTC","files":["/var/www/straped/mufon/html2text/20174.html.txt","/var/www/straped/mufon/more/20174_submitter_file2__TRIUFO.jpg","/var/www/straped/mufon/org/20174.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.844314,+-104.399846(20174)&iwloc=A&hl=en\"> mufon case (20174) map </A>","Object Shape":"Triangle","Log Number":"US-10282009-0014","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Longitude":"-104.399846","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data"}