{"trends":["There have been 404 other sightings in Los Angeles","There were 4 other sightings in Los Angeles on or around March 19th 2009","This sighting has never been favorited.",""],"Source":"MUFON","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","City":"Los Angeles","Date of the Event":"03/19/2009 12:00 UTC","Country":"United States","Tags":"City","Disposition":"IFO","Case Number":"20188","Log Number":"US-10292009-0013","Object Shape":"Boomerang, Chevron","Object Features":"Undisclosed","Longitude":"-118.478036","Latitude":"34.237022","divs":["Sighting DetailsPhotographs were taken in March of a low-flying craft resembling a B2-Bomber, but which possessed the abilities to stay in relatively the same place, invert itself, rotate and seemingly just sit on the wind. Southern California at this time was covered in dark, gray skies. The object appeared through the cloud formations and appeared not to move for prolonged periods of time. After approximately twenty minutes, in seemed to recede farther in the distance until completely enveloped by the clouds. When seen moving, the craft sailed upon a straight trajectory (indicating intelligently-controlled) and also arced high and behind the tree seen in the photograph. As the form allows only 3 photographs to be uploaded at a time, please check the following reports which will carry the rest of them. There are 13 in total - some the original shot - others a maximized, zoomed in version indicated by their title."],"Sighting Duration":"Undisclosed","Summary":"Photographed Black Triangle in Stormy Skies - PART IV","files":["/var/www/straped/mufon/html2text/20188.html.txt","/var/www/straped/mufon/more/20188_submitter_file1__Delta6-Original-CenterFrame.jpg","/var/www/straped/mufon/more/20188_submitter_file2__Delta6-Maximized.jpg","/var/www/straped/mufon/more/20188_submitter_file3__Delta7-Original.jpg","/var/www/straped/mufon/org/20188.html"],"Date Submitted":"10/29/2009 06:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.237022,+-118.478036(20188)&iwloc=A&hl=en\"> mufon case (20188) map </A>","Viewing Distance":"Unknown","Region":"California"}