{"files":["/var/www/straped/mufon/html2text/2018.html.txt","/var/www/straped/mufon/org/2018.html"],"Latitude":"33.01625","Longitude":"-92.724324","City":"Junction City","Date of the Event":"06/30/1999 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.01625,+-92.724324(2018)&iwloc=A&hl=en\"> mufon case (2018) map </A>","divs":["Sighting Detailsme and my wife were driving along a back road, just talking. it was clear andpretty day. we were heading west and you couldnt notice these two lights in thesky. i already new what they were, because i had seen it before one night. i askmy wife did she see them she said yes. i told her that is what i seen onenight. i couldnt beleive it, i am actually seeing it again. i went into town andasked people that were standing out did they see them no one seemed to notice.the first time i seen it was a few years earlier. i was laying out early onemorning3am-4amin my girlfriends driveway. at first, i thought it was a shootingstar, but it didnt burn out. then i thought it was a plane, maybe a jet. it wasmoving quickly. but i know that planes have red blue lights on the wings and ithink a red light on the tail. this object had no other colored lights. i didntthink anything strange untill it started glowing really bright. it went fromwhat looked like a star to a street light in the sky. at that point i sat up, iwas laying on my back. i asked my girlfriend did she see that plane go into acloud and started glowing. i probably sat another hour starring into the skywaiting for it to come out the clouds. it never did.it kinda scared me. ithought it may have been a space shuttle blowing up. the light in the sky was sointense, it put you in mind of the beams you hear people joking about comingfrom spaceships. the one that comes down and picks you up but only it was in thesky. that made me wonder if i had been abducted. but i know that i didnt feelany different or feel like i had been anywhere. my girlfriend didnt seeanything. the 2nd time i seen it me and my now wife was traveling a back road.we were taking the long way into town. about 3 mile out of town i seen them inthe sky. i touched my wife and told her ther they are, thats what i seen thatnight. i had been telling her about it for years. there were 2 softball sizefromwhere we was bright light in the sky. we both seen them. they zig zag a littlebit in front of us, just out of sight to tell what they really were. then onewent into a cloud then glowed and dissapeared. the other just glowed in the openand dissapeared. we both made sure we really saw what we did, or storiesmatched. i didnt tell, her but again i wondered had we been abducted. but ithink they were just letting me know that i really seen what i had seen thatnight. i had tears in"],"Tags":"City","Date Submitted":"06/30/1999 12:00 UTC","Summary":"star bright light","trends":["There have been 9 other sightings in Junction City","There were no other sightings in Junction City on or around June 30th 1999"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"Arkansas","Log Number":"","Sighting Duration":"00:05:00","Country":"United States","Object Shape":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Case Number":"2018","Disposition":"Unknown","Source":"MUFON"}