{"Object Shape":"Bullet, Missile","divs":["Sighting DetailsI was at my Mothers house staying with her because her father recently passed away. We were packing that evening getting ready to drive back to Colorado. My mom lives in the U.P. of Michigan on Little Bay de Noc, a horseshoe shaped bay. You can see the other side, which is a peninsula straight across. My dog was whining to go outside, so I opened the sliding glass door to let him out. The sliding glass door is on the lake side from the door to the lake is about 600 feet or more. The back yard from the house is flat then drops off down a hill then the shore line begins. There are not many trees looking straight out the back, but to the right the trees are thicker, so there is a pretty clean view straight out the back of her house. So, I went outside with my dog, it was a very cold evening. My dog wanted to come back inside right away, so I kept saying,\" come on go potty\". As I was motioning him to go out into the yard, I notice a (boat) on the lake. I thought it was very strange for someone to be out fishing on such a cold, cold night, but not unheard of right? Especially in Michigan. I looked at it again and noticed it did not have a light on the front or rear, it had a light blue line than was angled slightly, the back being higher than the front. I thought to myself that someone tricked out their boat with rope lights. All of a sudden it took off speeding, but I did not hear any noise. It is very easy to hear noise on the lake because of the way the bay is shaped like a horseshoe. I slapped my face a couple times, blinked my eyes, thinking what the heck is that. Then the light stopped again, then it took off at lighting speed again without a sound, it continued stopping and speeding about 3 times with no hint of sound. It was going from left to right, so I just stood on the deck watching and listening, until it hit the area of trees on the right. The moon was almost full so the light was shining down on the water. As I continued to watch, I lost site at the trees, but waited to see if it would continue toward the moon light on the bay, but I did not see it again. My dog was already in the house, for some reason, he did not want to be outside, and i felt uncomfortable not having him outside with me. I was afraid to go to the edge of the hill and watch more closely. I stood at the sliding door watching for about 5 more minutes, but nothing. I went back into the house and grabbed mom's room-mate and told him what I saw, so we stood outside for 10 to 15 minutes longer and never saw the light again. Throughout the evening, I would open the sliding glass door and look at the bay, I did here weird noises in the woods after the siting. It freaked me out, so I went back into the house. I had a very creepy feeling the rest of the night along with sleep loss. This is the 2nd siting that I have seen over the bay, the 1st time was back in 1980. For some reason I wasn't as creeped out over this siting, as I was with the one I saw in 1980."],"Object Flight Path":"Straight-line path","Case Number":"20191","Log Number":"US-10292009-0016","Latitude":"45.861984","Summary":"Saw a light blue line on top of the water moving very fast then stopping.","files":["/var/www/straped/mufon/html2text/20191.html.txt","/var/www/straped/mufon/org/20191.html"],"Region":"Michigan","trends":["There have been 4 other sightings in Gladstone","There were no other sightings in Gladstone on or around September 30th 2009"],"Tags":"City","Object Features":"Other","Weather Factors":"None","City":"Gladstone","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date Submitted":"10/29/2009 06:52 UTC","Date of the Event":"09/30/2009 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.861984,+-87.014895(20191)&iwloc=A&hl=en\"> mufon case (20191) map </A>","Source":"MUFON","Longitude":"-87.014895","Sighting Duration":"Undisclosed","Disposition":"Unknown"}