{"Object Shape":"Other","Object Features":"Window(s), Wings","Country":"United States","divs":["Sighting DetailsMy friend Joan had left a friend of hers to drive to my house, about a 2 mile drive straight down a main city street, Morganford. Almost immediately she noticed a very bright white light in the distance in the air, traveling towards her, right over the street she was on. As it got closer she could see the light was a rectangular \"viewing window\" on the front of the craft. Stopped at a light, sticking her head out the window, she looked straight up as it passed directly over her head. The fuselage was tube shaped, not tapered at the front and back as most planes are. The wings were delta shaped, with a single red light underneath each wing, not at the tips. Also, there were two additional \"windows\" underneath the craft, each where the wings met the fuselage at the front and back. The craft moved slowly, but as fast as a slow moving plane would. She didn't notice any sound. From her description, I created an image of the overhead sighting, which she says looks just like what she saw."],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/20195.html.txt","/var/www/straped/mufon/more/20195_submitter_file1__2009091722500000.jpg","/var/www/straped/mufon/org/20195.html"],"Longitude":"-90.192134","Disposition":"Hoax","Tags":"City","Region":"Missouri","Log Number":"US-10292009-0020","map":"<A HREF = \"http://maps.google.com/maps?q=38.628072,+-90.192134(20195)&iwloc=A&hl=en\"> mufon case (20195) map </A>","Date Submitted":"10/29/2009 09:03 UTC","City":"St Louis","Date of the Event":"09/17/2009 10:50 UTC","Summary":"Strange Air Craft Flying Down St. Louis City Street at Night.","Latitude":"38.628072","Viewing Distance":"Unknown","Sighting Duration":"00:03:00","Source":"MUFON","Case Number":"20195","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around September 17th 2009","This sighting has never been favorited.",""],"Weather Factors":"None"}