{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.628702,+-90.196554(20196)&iwloc=A&hl=en\"> mufon case (20196) map </A>","divs":["Sighting DetailsA loud explosion was heard outside my house that shook my house and me, and neighbors houses as well. The neighbors came out and I could hear them chatting, the windows were open. At the time of the \"explosion,\" I was praying with Joan. In a strange irony, EXACTLY as I prayed out loud that God protect Joan, with our eyes closed we both heard and felt a very loud \"explosion\" that seemed close by, shaking us and the house. We had already been praying, so we shortly finished and I went out front, but those neighbors we'd heard come out and talking had gone back in. As reported to MUFON, thirteen days earlier on September 17th Joan witnessed an unconventional craft fly over her on her way to my house. Anyway, I then went back in and out my back door, and two neighbors were still talking outside. My next door neighbor, and her husband, by her own initiative and repeated testimony with questions, stated she and her husband saw a \"huge\" white light over the cross-street at the same time of the explosion. Both neighbors, the other two houses down, had their houses shake too. My next door neighbor, whose house was to my back as I was sitting on my couch with Joan, were sitting on their couch facing in the opposite direction in their house than I was in mine. We both only have windows on the north side of our houses which look out to the street we live on, they are the last house on our street. Looking out their window, where our street ends in a \"T\" with a main city street, Morganford, she and her husband saw a \"huge\" white light over the street at that location at the time of the explosive bang, that only lasted for the duration of the sound. I asked her if she didn't just see a flash of light, or a light over the cemetery sky bordering that main street, but she emphatically said \"No\" to those things, and described seeing a \"huge flash of white light over the street\" at the time of the explosive bang that shook our homes, like a white \"ball\" of light she said!"],"Date of the Event":"09/30/2009 08:01 UTC","Weather Factors":"None","City":"St Louis","Region":"Missouri","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/20196.html.txt","/var/www/straped/mufon/org/20196.html"],"Object Shape":"Sphere","Case Number":"20196","Country":"United States","Sighting Duration":"00:00:01","Longitude":"-90.196554","Date Submitted":"10/29/2009 09:51 UTC","Object Features":"Undisclosed","Summary":"Explosion Shakes Houses and Neighbor Sees White Light Ball Over Street.","trends":["There have been 74 other sightings in St Louis","There was one other sighting in St Louis on or around September 30th 2009"],"Object Flight Path":"Undisclosed","Disposition":"Hoax","Latitude":"38.628702","Log Number":"US-10292009-0021"}