{"Sighting Duration":"Undisclosed","Date Submitted":"10/29/2009 08:44 UTC","files":["/var/www/straped/mufon/html2text/20193.html.txt","/var/www/straped/mufon/org/20193.html"],"Disposition":"IFO","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.785404,+-73.96078(20193)&iwloc=A&hl=en\"> mufon case (20193) map </A>","Viewing Distance":"Over One Mile","Country":"United States","Source":"MUFON","Tags":"City","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around October 27th 2009"],"Region":"New York","Object Features":"Undisclosed","Date of the Event":"10/27/2009 09:45 UTC","Latitude":"40.785404","Object Flight Path":"Stationary","Log Number":"US-10292009-0018","Longitude":"-73.96078","Case Number":"20193","divs":["Sighting DetailsObject observed was triangular in shape comprised of three intensely luminated spheres which stay in position for several hours unaffected by Earth's rotation or wind related movements visible from the playing field of our local High School. I phoned in my verbal description to Mr. Robert D. Long, Assistant State Director, Mufon, NY who advised me to fill out this report on the main site. We originally sent report to NY Mufon, site did not work on several attempts. These lights were first observed by me around October 21, 2009 at approximately 6:55 P.M. I observed these lights (riding in my car) out of the corner of my eye because of their brightness and as I continued to watch noticed they were not in motion in any way. At first lights did not seem suspicious, however, as I continued on my way could not help (in other directions) see these bright lights as they stayed fixed. Traffic took me away from continuing to observe these lights. It was not until tonight, October 26th at around 9:45 P.M., that the incident became more significant. My daughter called me on her cell that she wanted me to see some lights she observed, stating that she had seen them in the same week prior (as did my wife), and I should be outside waiting to be picked up to view. As we drove to the sighting area, she explained what she observed two hours previously. It was at that time I recalled my sighting of the same objects, and when we arrived there they were in the exact spot I saw them on the 21st. Again, there was no motion, just intense, bright orbs, forming a triangle which reminded me of the Phoenix Lights. All of a sudden one orb moved in a semi-circular motion (clockwise and upward) to the side of the upper most orb. That was the only motion observed at any time. Later, they were in the same formation as first observed. Note, on the 25th, around 5:30 P.M. there was unusual helicopter traffic, whether more than one was difficult to ascertain, nor were they visible to my eyes though very loud. They circled for about 15-20 minutes continuously. Connected? Not known. I mentioned that to my daughter. We continued to drive in an attempt to find a clearer vantage point without tree lines or buildings which obstructed out view. As we drove they stayed fixed. They dimmed for a brief moment, several seconds, then became brighter once more. We realized we had no chance of moving to a clear area. My daughter then suggested we return to the original viewing spot. On the way back they were still visible until we arrived at the original spot and were shocked to see they were gone! Tonight the weather was overcast, very little visibility and the Planet Jupiter was next to the moon (dimly visible), just enough to make out each body. These bright objects had to be below that cloud cover to shine so intensely. My daughter attempted to take a phone photo. Only two objects were dimly visible. Tomorrow, if these objects follow the previous pattern and time frame, we will have a better camera to take photos. I will attempt to see if these objects will show at dusk and later. If so will record times, areas, and motion(s) (if any). I repeat, they remained motionless, unaffected by even the Earth's motion. They were not aircraft nor were they flares or reflections from ground objects. These lights had not been seen by either of us at any time prior to these sightings. I would like to know if others in my area had reported what we observed, officially or unofficially. Thank You for taking the time to view my report. Hopefully we can get these lights on camera. I delayed my entry to observe another night. Weather was heavy rains, no visibility. Tonight the 29, the lights are visible and in a different formation though triangular. One object dimmed, this is the 2nd time, and the formation changed. That same light appeared in a different spot (lower,fixed). I could not get a clear photo. I would like to know if other reports in my area have been recorded. Thank you for taking time to read my notes. Sincerely, Art Moyano"],"Weather Factors":"None","Summary":"Triangular shaped UFU comprised of three illuminated speres in a fixed postion with a time length of several hours","City":"New York"}