{"Longitude":"-91.826913","files":["/var/www/straped/mufon/html2text/20197.html.txt","/var/www/straped/mufon/org/20197.html"],"City":"Undisclosed","Weather Factors":"None","Object Flight Path":"Undisclosed","Disposition":"Hoax","Date of the Event":"11/30/2002 12:00 UTC","Case Number":"20197","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.969413,+-91.826913(20197)&iwloc=A&hl=en\"> mufon case (20197) map </A>","Source":"MUFON","Object Shape":"Chevron, Diamond, Triangle","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","trends":[],"Country":"United States","divs":["Sighting DetailsI was on a rural road just out of Sikeston, Missouri and noted 4 bright lights first in kind of a chevron, then making a square. They moved a little east, then back. A larger round whihte light seemed to rise up and meet them and moved to the middle of the formation, like the 5 sponts on a die, then they moved East slowly. Less than a minute later they came back and the 4 circled the 1 mid light and they moved to the North at a slow speed. A few days before this I had noticed 12 military helicopters at the local air port, at least 4 of which were large dual propped vessels. One had a long item like a lance going to a tapered point running it's entire right side approximately 35 feet in length. We rarely have that many of any aircraft here .. 4 helicopters a week would be unusual. The night of the sighting these copters were heard from the south of me, and I saw two of the bigger helicopters clearly, and could hear the prop sound identifying them. The sighted craft mad no sound, and one in the middle did go from white to green, back to constant white. This was near Rainbow aLake Road in Sikeston, just east of Interstate 55 and a little north of Interstate 57."],"Date Submitted":"10/29/2009 10:35 UTC","Log Number":"US-10292009-0022","Latitude":"37.969413","Region":"Missouri","Viewing Distance":"Unknown","Summary":"round lights appearing as in formation, met by a 5th light. Flew a pattern several times."}