{"Longitude":"-84.330767","Object Features":"Other","Region":"Georgia","Country":"United States","Summary":"Looking at Stars, UFO Appeared above Tree, UFO Size of a House.","Weather Factors":"Unknown","Date Submitted":"10/29/2009 11:02 UTC","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Disc","Tags":"City","Source":"MUFON","City":"Dunwoody","Latitude":"33.948432","Date of the Event":"11/30/1994 12:00 UTC","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Case Number":"20199","map":"<A HREF = \"http://maps.google.com/maps?q=33.948432,+-84.330767(20199)&iwloc=A&hl=en\"> mufon case (20199) map </A>","Object Flight Path":"Stationary","Log Number":"US-10292009-0024","divs":["Sighting DetailsIt was mid evening on a cool night , and I had gone to look at stars with a small telescope it was dark out already and cool and you could see the stars I placed the Telescope on the hood of one of our car in my driveway. While I was looking through the Scope I saw a light through the viewing lense I came out from behind the telescope and looked up at the tree top and house top level there was a disc with circular lights around the bottom of the craft in a circular pattern of red yellow red yellow all the way around the bottom of the Craft near the edge.It was hovering right over me I had never seen anything like it, it was extremmly close to me and and I could tell it was not a plane, blimb, or helicopter,During this I felt more fear than I ever have in my entire life. I stared for I don't how long I beleive a couple of seconds and the ran into the house and where my dad was in the room that had a large window facing the direction of the craft an screamed for him to look out the window to see the craft by that time it was gone the incedent had to have lasted less that five minutes but more than one"],"files":["/var/www/straped/mufon/html2text/20199.html.txt","/var/www/straped/mufon/org/20199.html"],"trends":["There has been one other sighting in Dunwoody","There were no other sightings in Dunwoody on or around November 30th 1994"]}