{"Latitude":"40.135239","Disposition":"Unknown","Object Features":"Unknown","Date Submitted":"10/30/2009 12:05 UTC","Log Number":"US-10302009-0001","files":["/var/www/straped/mufon/html2text/20202.html.txt","/var/www/straped/mufon/org/20202.html"],"Source":"MUFON","Country":"United States","Sighting Duration":"00:00:30","Longitude":"-79.859982","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.135239,+-79.859982(20202)&iwloc=A&hl=en\"> mufon case (20202) map </A>","Summary":"A bright orb-likeobject","trends":["There have been 6 other sightings in North Belle Vernon","There were no other sightings in North Belle Vernon on or around October 20th 2009"],"Region":"Pennsylvania","divs":["Sighting DetailsI was looking out my window, just looking at the night time lights and stars which i do frequently when I noticed a very bright light directly above my line of sight. It looked like a street light size light compared to the stars around it. After seeing it with my peripheral vision I looked right at it and for aprox 30 secs I watched it just sit there. Every once in a while it would flicker a little but not much, the shape and size stayed true the whole time as well. After the 30 secs it began to what seemed like just fade out or fly strait away from my vantage point, it just kept getting smaller, dimmer until it was gone. What made me watch it was in the direction of the orb we can see life flight helicopters take off and fly and when i first saw the light thats what i thought it was. However, when it is the copter the light tends to bounce and move, even change intensity, this did not, it was bright white and huge compared to the size of the stars. This is not the first time either, over the past month or so i've seen it 4 or 5 times, covering an area of about 45 degrees in sight line but always in the same area. There was also no noise with the sightings and always the same outcome, just fades away or flies away getting smaller and dimmer. I've lived here my whole life and I am what my wife calls a star gazer because I love to look at them and i have seen some crazy things in the sky but this is the first time I felt i needed to tell someone. And after seeing a special on the history channel about orbs on UFO hunters I decided to contact you because that was exactly what i saw. While observing it I felt calm but yet fearful of what I was seeing, sort of like, Is that really what I think it is. I hope I am not alone because I don't want to seem crazy so would you please let me know if there are any other people seeing these, I am not making this up and am now trying to get them on film"],"Case Number":"20202","City":"North Belle Vernon","Object Flight Path":"Stationary,Straight-line path","Date of the Event":"10/20/2009 09:20 UTC","Object Shape":"Circle","Weather Factors":"None","Tags":"City"}