{"Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/20203.html.txt","/var/www/straped/mufon/org/20203.html"],"Object Features":"Unknown","Source":"MUFON","Date of the Event":"11/30/2002 12:00 UTC","Country":"United States","Case Number":"20203","Longitude":"-94.448006","Date Submitted":"10/30/2009 12:22 UTC","Sighting Duration":"Undisclosed","Latitude":"39.565555","Object Shape":"Circle, Flash, Sphere","divs":["Sighting Detailshave seen this several times over the past 5 years in two differant areas of the sky on most occasions had been one orb that flashes light can be sitting still pretty low in the sky then will shoot up very fast and back to the position first observed,will start to shoot away then shoot back total oppisite direction and suddenly just dissapear!my oldest and middle daughter have seen this with me on several occasions as well. I have ALWAYS been afraid to say anything to anyone ever!this most recent time I wanted proof even just for myself so i grabbed the only video devise I own and that is my cell phone I took 3 cell phone videos one after another after I had been watching it for about 8 or 9 minutes,I ussualy freeze and am stunned to the point its only after it has disappeard that I think\"Wow I should have tryed to take a Pic.of that or a video\" This time I got my cell video! Its not perfect but you can see that it is round fairly small stationary then moves very fast then just disappears! I was never going to report this to anyone not even my husband,until I was watching TV and saw a peice on all of the Missouri sightings of the SAME EXACT THING!!!! and a video a guy had taken in Missouri that looked and acted exactly like what I have seen and videoed! I am not doing this for publicity AT ALL! but when they were talking about the investigations around here I thought my date, time, and video, may help or match up with someone elses account on the same date and time. My daughters and I all 4 feel very scared almost frozen when we have watched this!!!! almost a feeling of could they know that I am looking at it (them)??? and was scared to even take the video!When I showed my daughters the video back they said \"Mom you sound terrified\" I said \"I was very scared\" If this can help with anything or anyone would like our account of what we have seen I would be willing to talk to someone. Thanks I dont have the capability to send my cell video to the computer but could and would be able to send it to another cell phone number I tried that by sending it to my daughters phone wich I had her delete after we made sure they would send! There is audio on my video as well,another point I will make is that even as close as we have seen this it has always been SILENT!!!!"],"Log Number":"US-10302009-0002","Summary":"multiple sightings!cell video for this one.stays n 1 spot then shoots aross n back up n down","City":"Plattsburg","trends":["There have been no other sightings in Plattsburg","This sighting has never been favorited."],"Region":"Missouri","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.565555,+-94.448006(20203)&iwloc=A&hl=en\"> mufon case (20203) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"None"}