{"files":["/var/www/straped/mufon/html2text/20200.html.txt","/var/www/straped/mufon/more/20200_submitter_file1__2009062520550001.JPG","/var/www/straped/mufon/more/20200_submitter_file2__2009062521011005.jpg","/var/www/straped/mufon/org/20200.html"],"Date of the Event":"06/25/2009 08:55 UTC","Tags":"City","Disposition":"Hoax","divs":["Sighting DetailsI'd been praying alone, in my mind, for about a half-hour after someone had left my house. I got to the point of asking God to let me know how I should live me life, as it had now become evident a significant relationship had changed. At the EXACT moment I completed that request in my mind, sitting on my couch looking out the window at the same time, I saw a point of light rise up from behind a tree and grow lengthwise in size then stop and become a horizontal white line of shimmering light in the sky. I often see airplanes coming into the airport turning around in that part of the sky, but this light was much wider than the airplane headlights I see. I could only figure it was a large airplane, so I kept looking at it, expecting it to bank out of its turn I figured it was in - I wanted to see what this craft was, it was relatively big! The white line didn't move, but grew in size a bit, 10 to 20 percent. I then looked at the clock to note the time of 8:55 PM. It stayed in that position for about 30 seconds. It then started to move very slowly to the left, its right side seeming to tilt up at a faster rate than it was moving left, but through the area of movement it remained light, \"sparkling\" away as it tilted to about a 60 degree angle, the light dissapating until two clearly spherical white balls of light remained. I could see the sky between the balls of light, and the overall intensity was dimmer than the white line it was before. The craft(s) was still slowly moving left, but had only moved about it's \"line\" length in the time it took the \"line\" to tilt and look like two distinct balls. The two balls then sped off left behind a tree, seemingly without accelerating, they just started moving at the speed they sped off at from the very slow speed they were when a line. The balls reminded equidistant from each other, and were so straight it was like they were on rails. I ran outside to see if they would emerge from the other side, but I didn't see them. I went back in and got my camera to take a picture of my viewpoint from inside looking out at the sky conditions. I did that, and was sitting there looking out the window when I heard a light wind blow then saw what seemed to be a very low flying commercial airliner fly right over my house! It was about 85 degrees in temperature that evening with humidity about the same percentage. The air was very still, which is rare for where I live in the city, which is why I noticed the wind start to blow. I had my camera! I went outside on my front porch and put it on my porch railing to get a picture of the very silent craft now completing a banking maneuver, still close enough that I could fit the craft within my hand width. Everything worked until I hit the shutter and it failed! At that point the camera would do nothing, including off or on!! Of course I'm frustrated, and the craft is now getting off in the distance. Suddenly, the camera just comes back on in my hands, so I reset on the porch railing and took two shots although it was now much further away. I actually captured it, although perhaps indistinct from a plane to most people. It wasn't FAA legal by its light, no red and green lights on wingtips, and the blinking was wrong, and not always blinking but steady. It was a triangle of lights, red in the lead, although closer to what would seem to be its midsection, and white on the \"wingtips.\" In terms of describing it in UFO patterns, it was a triangle with the front light out. The white lights always blinked AFTER it passed my house, steady when it went over, and the red light usually didn't blink, but did sometimes. The attached triangle picture is actual, the spheres picture is a \"hybrid,\" created using the real picture I took of the sky a few minutes after I'd seen the white line and balls, which I \"painted\" in with Microsoft Paint. The hybrid image yet looks very close to real as I saw them. I found it ironically interesting that the location in the sky where I eventually actually captured the triangle is EXACTLY where the white line hovered!!"],"City":"St Louis","Object Features":"Unknown","Region":"Missouri","Object Shape":"Boomerang, Cigar, Sphere","Latitude":"38.634902","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around June 25th 2009","This sighting has never been favorited.",""],"Date Submitted":"10/29/2009 11:09 UTC","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","Source":"MUFON","Weather Factors":"None","Log Number":"US-10292009-0025","Sighting Duration":"00:15:00","Longitude":"-90.190174","map":"<A HREF = \"http://maps.google.com/maps?q=38.634902,+-90.190174(20200)&iwloc=A&hl=en\"> mufon case (20200) map </A>","Summary":"Bright White Line in Sky Tilts and Changes to Two Balls, Triangle Flies Over House.","Case Number":"20200"}