{"divs":["Sighting DetailsI am a small business owner and my wife is a minister. On the night of the 19th of April 2006 me and my wife were traveling north on the highway that goes through Yuma proving grounds at about 9:45 at night when I noticed to the east directly above the proving grounds several lights flashing in a random pattern;I pulled over and we got out to get a better look, after a few seconds the lights changed the pattern that they were flashing on and off, the lights seem to be in a large rectangular pattern and I heard a faint popping sound each time the lights flashed, the lights were several hundred feet in the air and were not moving, the air felt electrified and the top of my head felt numb, we were only looking at them for maybe 10 minutes but when we got back into our vehicle nearly 45 minutes had passed also when we tried to film them nothing showed up. I can not explain what we saw but it was not a plane or helicopter and not some kind of lighted structure unless it was taller than a skyscraper, I have been through the proving grounds many times before and since and I have never seen anything like that except that 1 time."],"Country":"United States","Tags":"City","Date of the Event":"04/19/2006 09:45 UTC","files":["/var/www/straped/mufon/html2text/20219.html.txt","/var/www/straped/mufon/org/20219.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.149202,+-114.429215(20219)&iwloc=A&hl=en\"> mufon case (20219) map </A>","Date Submitted":"10/31/2009 01:47 UTC","Longitude":"-114.429215","Latitude":"33.149202","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"Arizona","Source":"MUFON","Object Shape":"Flash","Sighting Duration":"Undisclosed","Summary":"7-8 flashes of light","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around April 19th 2006"],"City":"Yuma","Case Number":"20219","Log Number":"US-10312009-0002","Disposition":"Unknown","Object Flight Path":"Stationary"}