{"files":["/var/www/straped/mufon/html2text/20218.html.txt","/var/www/straped/mufon/more/20218_submitter_file1__10-11-09_1744.jpg","/var/www/straped/mufon/org/20218.html"],"Longitude":"-96.765983","Tags":"City","Weather Factors":"Unknown","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around October 11th 2009","This sighting has never been favorited.",""],"Source":"MUFON","City":"Dallas","Sighting Duration":"Undisclosed","Region":"Texas","divs":["Sighting DetailsMy 13 year old son and his 2 friends were hanging out at one of the boys house (Oct. 11, 2009) when they were talking about spirit orbs and catching them on camera. So they went out on the back patio late afternoon, it was misty and cool that day. He opened his cell phone to take randon pics to try and capture orbs. He took 3 pics which 2 were blurry of the willow tree that is in the boys back yard. The last one he took was of the grass, tree, a ball, and sky. The following evening he was going back through his pics and noticed the UFO in the clear pic he took. He came down stairs and showed his dad then showed me. My first reaction was that is a UFO, and I asked where he got the pic, he said he took it. My husband fowarded the pic to his phone so he could zoom in on it. It is very clear that it is a UFO. I know that it is not a flying pig, witch, Santa, bird, plane, or the all too famous \"weather balloon\". I asked the boys did they see it or hear it. They did not and were totally in \"awe\" over the whole thing. I want clarification on the pic from a UFO pro. Some people think we are crazy or that we photo shopped the pic. I wish I owned that program and had the knowledge of how to edit pics, but I don't. My kids tell me I am crazy and well maybe sometimes I am when they make me crazy. LOL. My family has always believed in UFO's, so when we saw this pic we were like \"wow\", \"see they do exist\". My family is not scared since the discovery of the pic, UFO's have been around for along time, and I think if they meant us harm they would have done so a long time ago. You can't see who is piloting the craft so I can't for sure tell you if it is an alien or human."],"Summary":"Teenage son caught a disc shape with his camera phone at a freinds house outside. He did not see it with his naked eye, noticed the object the nect night.","Object Shape":"Disc","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=32.810815,+-96.765983(20218)&iwloc=A&hl=en\"> mufon case (20218) map </A>","Object Features":"None","Case Number":"20218","Log Number":"US-10312009-0001","Date of the Event":"10/11/2009 12:00 UTC","Viewing Distance":"Unknown","Latitude":"32.810815","Country":"United States","Date Submitted":"10/31/2009 12:54 UTC","Disposition":"Unknown"}