{"Country":"United States","Weather Factors":"None","Date of the Event":"10/31/2005 02:10 UTC","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around October 31st 2005"],"Case Number":"20217","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.887022,+-111.749872(20217)&iwloc=A&hl=en\"> mufon case (20217) map </A>","Source":"MUFON","Longitude":"-111.749872","Object Flight Path":"Path with directional change,Other","divs":["Sighting DetailsAt the time I was a truck driver - had started driving at 12:00 a.m. after 10 hr. break. First saw white orbs in sky - they would move rapidly across sky and then either go straight up or would - without turning - reverse direction - there were at least 3 doing this at a higher elevation - several hundreds of feet up in sky. I then saw 3 flying side by side at a low elevation - as if they had taken off from a runway and were flying in a straight line - moving in a direction that would lead them to pass right in front of me. As they got closer to the highway (I-10) for a brief second they were so low that my vision was blocked by an overpass. As they passed on the other side of the overpass they for less than a second - turned into 3 small glowing jets - one pink - one blue and the other white. As they topped the overpass they turned back into white orbs and suddenly swarmed each other - in the same ways that bees swarm around each other - they then made a sharp turn and shot up into the sky and dispersed. Another semi was coming from the opposite direction on I-10 and should have seen everything. I called out on the radio \"wow, did you see that?\" and he asked \"did I see what?\" - I described what I had just seen and he basically asked what kind of drugs I was on, saying that what ever it was - he wanted some. About 2 miles up the road I came across a car that was turned over on the side of the road and a state trooper was approaching on the opposite side of the highway. He waited for me to pass the overturned vehicle and then crossed thru the median headed towards the vehicle. Thats it. On the 3 jets - you could tell that they were not real - but they were glowing like glow sticks and you could actually see black outlines on the outside of the inner glow - more like an animation than a real jet. I truly halfway expected to see the Warner Brothers symbol appear in the sky above them with Porky the Pig sticking his head through and saying \"That, that thats all folks\". Wasn't drinking - was not sleeping - had just finished my 10 hr. break. Drove a semi for 3 years and had never seen a UFO and drove many miles at night time in the middle of nowhere."],"Region":"Arizona","Date Submitted":"10/30/2009 11:31 UTC","Object Shape":"Sphere, Other","City":"Casa Grande","Log Number":"US-10302009-0015","Disposition":"Unknown","Object Features":"Unknown","Summary":"Several white orbs - 3 that color and shape - then swamed in circles.","Tags":"City","Sighting Duration":"00:00:40","Latitude":"32.887022","files":["/var/www/straped/mufon/html2text/20217.html.txt","/var/www/straped/mufon/org/20217.html"]}