{"map":"<A HREF = \"http://maps.google.com/maps?q=29.729648,+-84.981744(20211)&iwloc=A&hl=en\"> mufon case (20211) map </A>","Region":"Florida","Weather Factors":"None","Viewing Distance":"Unknown","Latitude":"29.729648","Case Number":"20211","files":["/var/www/straped/mufon/html2text/20211.html.txt","/var/www/straped/mufon/org/20211.html"],"Log Number":"US-10302009-0009","trends":["There have been 4 other sightings in Apalachicola","There were no other sightings in Apalachicola on or around June 29th 2009"],"City":"Apalachicola","Object Features":"Unknown","Disposition":"IFO","Summary":"Orange lights appearing in the night sky","Object Shape":"Unknown","Source":"MUFON","Tags":"City","Date of the Event":"06/29/2009 12:00 UTC","Date Submitted":"10/30/2009 01:34 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy family and I rented a beach house on St. George Island, FL from June 28 - July 5, 2009. Our sightings started on either the night of June 28 or 29. (Someone else in my family might remember which night it started.) We were all sitting on the screened porch with the lights off, overlooking the Gulf and enjoying the sounds of the ocean and each other's company. It was about 10pm. We were all just talking and my mom and I happened to be looking at the same direction of the night sky when, out of nowhere, a group of about 3 or so orange lights just appeared. They were about 70 degrees up from the horizon. It was like they all came on together as a group, since they were all near each other, but didn't all come on exactly at the same time. It was either that or, maybe it could have only been 2 total lights, its just they were moving around and going on and off? The orange lights is just what they were--just orange dots of light appearing in the sky. There was no sound at all. The dots did not move around themselves, they just flashed on and off, like a flashlight. The first thing that popped out of my mouth was \"...was that...a plane?\" Which is funny I said that since it most certainly did not look like a plane! My mom, the biggest skeptic ever, agreed that it definitely did not look like a plane, or anything we had ever seen before or heard of before. My dad is retired military and he said they definitely weren't flares, since flares don't just come on brightly as an orange dot and flash on and flash off. They would flash on for maybe 3 secs then flash off. The same thing happened again and again that night and other nights during that week we stayed there. The groups of orange lights did not always come on in the same spot, it was always a different spot in the sky where a group would appear. We all watched for them every night the rest of the week. We saw them mostly the first few nights of the week, and after that didn't really see them much anymore, sadly... It was so cool and I am totally interested in UFO's and am so happy to have seen some!"],"Object Flight Path":"Stationary,Other","Longitude":"-84.981744","Country":"United States"}