{"files":["/var/www/straped/mufon/html2text/20225.html.txt","/var/www/straped/mufon/org/20225.html"],"Weather Factors":"Windy, Light","City":"Sunrise Beach","Summary":"2 UFO's both same shape silver, flying together 50-60 foot diameter 2 witnesses","Latitude":"38.180084","Object Shape":"Disc","Sighting Duration":"00:01:10","Country":"United States","Case Number":"20225","Longitude":"-92.781275","Region":"Missouri","Date Submitted":"10/31/2009 08:52 UTC","divs":["Sighting Details We were driving back from an early morning Missouri Youth Deer Hunt to prepare for a football game. I looked at the clock and said, \"you have time to nap it's 9:38 and your game isn't till noon.\" My son said to me dad there are two odd disks in the air. We were on hwy 5 just south of MM road heading North about 2 miles out of Sunrise Beach at the Lake of the Ozarks. I looked to \"humor\" the child and to my dismay I too saw two craft that appeared white. I then slowed to about 35 mph looked up at about 35 degrees above the horizon and estimated them at 50 or 60' silver disks just after they seemed to \"hover\" and we both were rather shocked. I continued on, they raised in altitude so that I couldn't see them and continue to drive, as there was no place to turn off to observe them, I told my son to keep an eye on them. He did and I peaked again and saw one flash away. I asked him where the other was and he said it \"snapped away to the east\" it was wierd. I've seen a UFO 2 other times in my life both times with witnesses. First in Bristol Tennesse in 1960 and in Columbia Mo in 1966. Do you have other reports? I never would have believed it \"what my son said\" unless I had seen it myself. They weren't planes, birds etc as we've pleanty of vultures and eagles around here as well as gulls and it wasn't conventional aircraft, it was truely amazing. I've 2 degrees and am a decorated USN Vet that worked for the NAVSECGRU so I am careful before I declare something spectacular. I think either the military up at the base some 60 miles away has some interesting items or we aren't alone it was that awsome. A concerned Dad"],"Log Number":"US-10312009-0008","trends":["There have been 2 other sightings in Sunrise Beach","There were no other sightings in Sunrise Beach on or around October 31st 2009"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Date of the Event":"10/31/2009 09:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.180084,+-92.781275(20225)&iwloc=A&hl=en\"> mufon case (20225) map </A>","Source":"MUFON","Object Features":"Dome","Tags":"City","Disposition":"Unknown"}