{"Region":"Idaho","Country":"United States","files":["/var/www/straped/mufon/html2text/20221.html.txt","/var/www/straped/mufon/org/20221.html"],"City":"Undisclosed","Object Flight Path":"Hovering then path","Latitude":"44.074632","Object Features":"None","Longitude":"-114.732261","Date of the Event":"09/15/2002 12:00 UTC","trends":[],"Sighting Duration":"Undisclosed","Disposition":"IFO","Source":"MUFON","Tags":"City","Object Shape":"Circle","Viewing Distance":"20 Feet or Less","Summary":"a glowing bright basketball size orb round orb","map":"<A HREF = \"http://maps.google.com/maps?q=44.074632,+-114.732261(20221)&iwloc=A&hl=en\"> mufon case (20221) map </A>","Weather Factors":"Unknown","Log Number":"US-10312009-0004","Case Number":"20221","Date Submitted":"10/31/2009 11:47 UTC","divs":["Sighting DetailsAfter seeing your show concerning the sightings of orbs this week on television, I finally decided to tell my story too. I have already told family, friends and neighbors of this experience mostly to get their reactions and to see if they had had similar. I also want to emphasize that this statement is every word the truth. I am telling it because I have never expected to see anything in my lifetime like it, I am now 67 years old, I still work as an fc bookkeeper and tax preparer. I am not looking to have my story on television nor am I looking for money. I just would like to let you know as investigators of these type of phenomenon about it. Maybe my story is unusual or maybe not but to me it is because after watching your show I made the decision to tell you and my husband agreed with me: I had taken my new puppy out to relieve herself around 3 a.m. We had only had her a short time and I was working on her potty training. As I was standing in our yard with her I noticed a bright glowing light a few feet to the East of me about 10-12' high and directly over our 4' fence. A lot of things were running through my mind because we live in a very wooded area and we have 12 acres of land and it is very dark in here at night. We also are isolated from neighbors so I was somewhat concerned as to what I was looking at and where and how did it come from. As I was looking at it I decided to move and to my surprise it also moved the same way I did. Then I bent down from my waist side ways, it did the same, then I bent from my waist sideways again on the opposite side, it did the same. So I thought it was somehow like being remotely controlled and I thought someone was playing a joke on me because I thought it was being playful and what else would do that. I could think of nothing. I continued to do that a few more times.It always mimicked my movements. Then all of a sudden it came over the fence and started coming toward me and then I became very concerned, I quickly grabbed my puppy and got into the house, locked the doors,ran up the stairs to our bedroom and tried to wake my husband. That is my story. I don't know what it was, or if I will ever see anything like it again. It had some sort of intelligence and seemed palyful or teasing at first. It made absolutely no noise at any time. I hope that my experience with this phenomenon might be useful to you somehow in your work with the unknown. Thank You for reading my statement and if you have any questions I would be happy to answer them. Sincerely, Marian Kamin"]}