{"map":"<A HREF = \"http://maps.google.com/maps?q=40.65355,+-73.9468(20223)&iwloc=A&hl=en\"> mufon case (20223) map </A>","City":"New York","Region":"New York","Object Features":"Unknown","Log Number":"US-10312009-0006","Latitude":"40.65355","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around February 14th 2009","This sighting has never been favorited.",""],"Disposition":"Unresolved","Date Submitted":"10/31/2009 02:10 UTC","Summary":"The object looked like was hanging in the air , but it was moving very slow.","Tags":"City","divs":["sighting detailsi live in brooklyn heights in tall building on xxth floor with a balcony. that day i smoked cigarettes on the balcony. the view i have is partial new jersey sky and partial brooklyn and far away queens sky. every day i see a lot of planes in the sky and i know how they're moving, how they look like. i notice this object immediately. why? because, when you step on my balcony you can't see much of people, traffic, so basically nothing is going on except what's on the sky. and this object looked like wasn't moving (read: moving too slow for a plane or and definitely didn't looked like a helicopter). that's why it has come to my attention. i didn't know what to think about it, because every day i see strange objects on the sky, but always i was looking for the explanation for it and most of the time it was something i know. usually plane, sometimes a bird, balloon. the object appeared from north making left turn into east part of the sky. the object looked like was hanging in the air , but it was moving very slow. all i was thinking was to take the best picture possible. my girlfriend couldn't see nothing. the object was really far away from my balcony. disappeared in the sky after few minutes. about 10-15 minutes later the same object appeared again , but this time it was much closer, moving about the same speed making the same left turn. basically the same event but much closer, and girlfriend was able to see it. the first and the second event was about the same period of time no longer than 5 minutes. first submitted picture (original) is darker than the time of the day at that time due dark lens i was using f\\5.6 and maximum focal length 300mm with 3x teleplus pro 300 extender. picture is blurred, because i couldn't use auto focus only manual focus."],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Circle, Egg, Oval, Unknown","Case Number":"20223","Longitude":"-73.9468","Country":"United States","Date of the Event":"02/14/2009 04:00 UTC","files":["/var/www/straped/mufon/html2text/20223.html.txt","/var/www/straped/mufon/more/20223_submitter_file1__IMG_6645.JPG","/var/www/straped/mufon/more/20223_submitter_file2__IMG_6645lighter.jpg","/var/www/straped/mufon/more/20223_submitter_file3__IMG_6645b.jpg","/var/www/straped/mufon/org/20223.html"],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Flight Path":"Path with directional change"}