{"Disposition":"Unknown","Region":"Indiana","Date of the Event":"08/10/2009 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"10/31/2009 02:39 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Tags":"City","Longitude":"-84.999409","Case Number":"20220","Weather Factors":"None","City":"Angola","Latitude":"41.634773","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/20220.html.txt","/var/www/straped/mufon/org/20220.html"],"Object Shape":"Disc, Other, Unknown","Source":"MUFON","trends":["There has been one other sighting in Angola","There were no other sightings in Angola on or around August 10th 2009"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.634773,+-84.999409(20220)&iwloc=A&hl=en\"> mufon case (20220) map </A>","divs":["Sighting DetailsI took my daughters camping at Jellystone Campground, close to Angola.Once my kids were in the tent asleep I noticed 3 slow moveing lights in the north sky. I have had interest in this subject since I was a child. I have always watched the sky. First learning how easily simple things like a star can seem to be a UFO, until driving toward it for an hour or so . With some research I was chasing mars. But what I saw was not normal. This happened about 3 months ago. I actually found on google video, the EXACT same thing someone had recorded a couple years ago from the same approx. location. I have the video on my cell but the quality is horrible. I have a degree in electronics and feel I am amply educated. Feel free to contact me and Ill answer anything I can. And if need I will locate the video on google. I tried to contact the person who put the video up but couldnt get a responce. I wasnt going to say anything but I am atualy looking into becomeing a MUFON investigator so...I should help any way I can in this pursute of truth. One thing I remember vividly is the way they seemed to float in straight random patterns, like they were bouncing of a wall of somesort. And sorry for the bad spelling...next time I will use spell check. And also I just changed my phone number so if you contact me via email I will have a number for you."],"Log Number":"US-10312009-0003","Summary":"2 lights hovering in the north sky"}