{"Object Features":"Undisclosed","divs":["Sighting DetailsI was sitting at my cubicle at work which is located next to large plexiglasswindows. I was day-dreaming and I looked outside and into the sky where I saw adistant object that at the time looked to be floating around, resembling abird,which is what I thought it was to begin with. I was staring at the birdpondering what it must be like to be able to fly to such amazing heights when Irealized that the objects structure did not resemble a bird at all. It seemedmore block-like or cylinder-like if the cylinder were lying horizontal, orpossibly even saucer shaped. I then got up and went to stand at the window totry to get a closer look when the object began to descend in a way totallyunlike that of any bird or plane that I have ever seen. It began descendingdownward in what appeared to be a straight line. The object was movingrelatively slowly and appeared quite distant. Distance in height if not length.It seemed to be black in color though that could be due to the distance I wasfrom the object. I watched to see if it would disappeared behind an approachingcloud but it remained in view as it moved over the cloud, still moving slowlydown toward the horizon. It eventually did disappear behind a cloud effectivelyleaving my frame of view. I did however seem to lose the object for briefseconds on a couple of occasions before finding it again as it descended,superimposed over the clouds, but I contribute that to my own eyes.The only reason I am reporting this sighting at all is because of its shapedistinguishing it from any bird or plane I have ever witnessed, and the way itdescended. Outside of VTOL craft I have never heard of any other craft to tothis. It also seemed smaller than a commercial airliner though again, it couldbe the distance causing a distortion of my perception. I know there have beenmany reported sightings all across the world recently and I am also curious toknow if there have been any other sightings in my area. Any information as tothe possiblity of the object being extra-terrestrial would be appreciated and ifthere is anymore information I can givethough it would be limited if anything atallI would be more than happy to share.Regards,Josh Bjerke"],"Summary":"Fall of the Sky Rock","Region":"Florida","Longitude":"-80.286226","map":"<A HREF = \"http://maps.google.com/maps?q=26.157174,+-80.286226(2023)&iwloc=A&hl=en\"> mufon case (2023) map </A>","Log Number":"","Source":"MUFON","Country":"United States","Object Flight Path":"Unknown","Date Submitted":"12/11/2002 12:10 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Cylinder","City":"Sunrise","Disposition":"Unresolved","Latitude":"26.157174","files":["/var/www/straped/mufon/html2text/2023.html.txt","/var/www/straped/mufon/org/2023.html"],"Sighting Duration":"00:05:00","Date of the Event":"12/11/2002 12:10 UTC","trends":["There have been 12 other sightings in Sunrise","There were no other sightings in Sunrise on or around December 11th 2002"],"Case Number":"2023"}