{"Country":"United States","Summary":"About 60-70 ft long with white lights the whole length.","divs":["Sighting DetailsI was the right side back seat passenger,the boy I was dating was behind the driver and the driver was my friends boyfriend at the time and she was the front seat passenger.It was about 9:00 pm.We were driving to her Aunts house to drink alcohol because we were all under age and we were teens,the only one who was not going to drink was the guy I was seeing.We were driving with the windows down and the radio at the time was playing Led Zepplin.I remember freezing in the back seat of the 2 door car and it was pretty windy out.We saw this huge object really close to the road on the opposite side of the road,Maybe about 20-30 yards away. We had no idea what the thing was so the driver pulled over on that side so we were facing the traffic on the opposite side of the road,but there were no other cars.The lights were so bright,I have never encountered since a light that was so pure.we were like what the F is that.All of a sudden it started to rise, straight up with no sound of an engine or swirling blades of a helicopter,just nothing,no movement under the thing and there were tons of fallen leaves that should have blown around but didn't, there was no more wind and the sound felt like it was being sucked out of the car.we watched it and I was trying to yell to the driver that this was scary and he needed to get the f outta there,but I couldn't even hear my own voice.It just kept rising and I saw my friend hitting her boyfriend but could't hear what she was saying.All of the sudden we started moving ,the driver was pulling away and like a huge rush of all sound came whooshing back into the car and I heard my friend yell get the f outta here now!I was trying to shove his seat also to get his attention.We were all freaked out and realized that we thought we were only there for a couple of minutes and it was now 15 minutes later than when we pulled up.we were late getting to her Aunts house but we should have been on time even pulling over for the couple of minutes we thought we had.I didn't even pay any attention to the guy I was with til after and he was real scared too.He said he was yelling too but we all could not hear each other."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.075189,+-70.880019(20238)&iwloc=A&hl=en\"> mufon case (20238) map </A>","Log Number":"US-11012009-0008","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Other","Date Submitted":"11/01/2009 12:55 UTC","Date of the Event":"11/16/1985 09:00 UTC","files":["/var/www/straped/mufon/html2text/20238.html.txt","/var/www/straped/mufon/org/20238.html"],"City":"Hanson","Source":"MUFON","Case Number":"20238","Object Flight Path":"Stationary,Hovering then path,Other","Disposition":"Unknown","Object Shape":"Square, Rectagular","Region":"Massachusetts","Longitude":"-70.880019","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Hanson","This sighting has never been favorited."],"Weather Factors":"Windy, Medium","Latitude":"42.075189"}