{"Latitude":"46.686413","Case Number":"20239","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.686413,+-68.011882(20239)&iwloc=A&hl=en\"> mufon case (20239) map </A>","Object Features":"Unknown","trends":["There have been 2 other sightings in Presque Isle","There were no other sightings in Presque Isle on or around November 1st 2009","This sighting has never been favorited.",""],"Viewing Distance":"101-500 Feet","Summary":"Large bright half oval object of yellowish orange color with bright half bubble type light to top right of dome sending out strobe like beams.","Date of the Event":"11/01/2009 05:30 UTC","divs":["Sighting DetailsAfter a stormy rainy night I awakened to make a trip to the bathroom. Since there is no illuminated clock in the bedroom I checked the time in an adjacient room after changing clocks due to daylight savings time. When returning to bed I looked out the window facing directly west and saw a very large bright HALF OVAL object of yellowish color with an orange tint which was completely stationary. There was a half bubble type light at the top right of the dome which was emitting extremely bright white strobe type beams of light going at a 45 degree angle going up toward the sky then down to the ground. There was no sound of any kind. The object looked flat on the bottom. but this could be a misconception since this ground is flat potato field and slopes down in back for some distance. Bearing this in mind the object certainly could have been a different shape on the bottom that was not visable. The moon was not out and the object was IN FRONT OF THE TREE LINE. From my perspective the object appeared to be about 60 feet long and 500 feet from the house. I watched this object for about 10 min. trying to make something rational out of it and then it vanished like someone had shut off a light bulb. I have included a sketch for your observation. This has been a bit un nerving. Have not walked down to where the object was since we would be up to our knees in mud right now. Answers please......"],"Longitude":"-68.011882","Source":"MUFON","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/20239.html.txt","/var/www/straped/mufon/more/20239_submitter_file2__2009_1101picsfirst0002.JPG","/var/www/straped/mufon/org/20239.html"],"Disposition":"Unknown","Date Submitted":"11/01/2009 12:58 UTC","City":"Presque Isle","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Region":"Maine","Weather Factors":"Windy","Log Number":"US-11012009-0009","Tags":"City"}