{"Source":"MUFON","Case Number":"20230","Date of the Event":"10/31/2009 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.510979,+-90.46397(20230)&iwloc=A&hl=en\"> mufon case (20230) map </A>","divs":["Sighting DetailsSeveral of us were sitting around a fire pit giving out candy to the trick or treaters when this bright light was spotted in the sky. We all began watching it and it was hovering in the same spot, then moved slightly to the right and stopped again. We were discussing what it could possibly be because it wasn't a plane, it didn't look like a helicopter. There was no sound from it. It was flashing like amber, white lights and was in our sight for a couple of minutes then just sort of dimmed its lights and when it did it was sort of red, then just faded out of our sight. Approximately 30 minutes later it appeared again, this time coming closer toward us rather rapidly,then just stopping abruptly in flight. It hovered there for a minute or two, appearing to flash its lights again, yet it almost looked like it was on \"fire\" but it wasn't on fire. It hovered there a minute or two then slowly the lights faded out again just as they had the first time. Then about an hour later it appeared again, in approximately the same spot, it moved a little to the left, hovered again then faded out again for the third time. We called the local radio station but no one had called in about it. I called MUFON and left a message and then I called the police. The police said no other reports had been made that they knew of but would keep an eye on the sky."],"Longitude":"-90.46397","Summary":"Bright lights - amber flashing. Appeared 3 different times in a 2 hr period. Almost appeared to be as fire, but still had flashing lights.","Sighting Duration":"02:00:00","trends":["There have been 5 other sightings in Fenton","There were no other sightings in Fenton on or around October 31st 2009"],"Object Features":"Undisclosed","Log Number":"US-10312009-0013","Disposition":"Unknown","Object Flight Path":"Undisclosed","Region":"Missouri","Latitude":"38.510979","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"10/31/2009 10:51 UTC","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/20230.html.txt","/var/www/straped/mufon/org/20230.html"],"City":"Fenton","Tags":"City"}