{"City":"New York","Date of the Event":"09/18/2009 06:30 UTC","files":["/var/www/straped/mufon/html2text/20243.html.txt","/var/www/straped/mufon/org/20243.html"],"Source":"MUFON","Latitude":"40.772128","Longitude":"-73.827084","Object Shape":"Circle","Tags":"City","Object Features":"Unknown","Summary":"It was a small circle lookin thing that did not move like a plane.It moved from side to side and up and down","Region":"New York","Country":"United States","Disposition":"Unresolved","Log Number":"US-11012009-0013","Date Submitted":"11/01/2009 01:28 UTC","Object Flight Path":"Other","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.772128,+-73.827084(20243)&iwloc=A&hl=en\"> mufon case (20243) map </A>","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around September 18th 2009"],"divs":["Sighting DetailsIt was around 630pm i went out side my job to smoke a ciggiret and talk to my co-workers that were out side. As I was smoking I decided to look upin the sky cause it was starting to get dark and we were talking about how the summer is over and how quick it went by. As we were talking i looked up and was looking south on union street when i seen something at first i didnt say anything to the guy i work with. i saw what looked like a bright orange light and i thought it was a shooting star cause the way it was falling, but then just stoped. as i was looking at it, it got brighter and brighter. it then moved east came down and moved west in a zigzag fashion. I taped one of the guys that was out side with me and we all looked up and were amazed we seen it move back up and it went stright back up and then came back down. when it came back down it stood ther in that one place for a few seconds and then moved to the east. then it started to dim. we found that weird that it moved and started to dim out but for a quick couple of seconds it had gotten brighter untill it dimed out completely. When i had first seen it i was kinda of excited thinking it was a shooting star never really seen one like that but when i seen it move i knew it wasnt one. Ive seen an object like that befor at my mothers house 2 years back. i had told the guyhs at my job the day after i saw it at my mothers and the were make jokes on me for days. but when we all seen that we were all quiet we never seen this befor. we just want to know if any has seen something like that befor or we the olny ones."],"Viewing Distance":"Over One Mile","Case Number":"20243","Sighting Duration":"Undisclosed"}