{"Disposition":"Insufficient Data","Date Submitted":"11/01/2009 01:07 UTC","Region":"West Virginia","Sighting Duration":"Undisclosed","Latitude":"38.420371","files":["/var/www/straped/mufon/html2text/20241.html.txt","/var/www/straped/mufon/org/20241.html"],"City":"Cross Lanes","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.420371,+-81.790685(20241)&iwloc=A&hl=en\"> mufon case (20241) map </A>","trends":["There have been no other sightings in Cross Lanes","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","Country":"United States","Log Number":"US-11012009-0011","Date of the Event":"09/01/1998 07:00 UTC","Viewing Distance":"Unknown","Case Number":"20241","divs":["Sighting DetailsNot sure of the exact date or year. Was sometime between 1996 and 1998. I was in my car with my mother. We had just left home to grab a bite to eat at the local pizza hut. Driving up the hill on the main road we saw a black object above the car. My mother remembers the shape of it differently than I do ever since the night we first saw it. She saw it as a triangle and I saw it as a round object with one red light on one side and another red light on the other. The lights were shaped like rectangles. The sun was still out and bright but all I saw from the rest of the shape was black and featureless. Id say it was about 5 feet across. I did have a much better view because i was in the passanger seat. I moved up and was looking out the front windsheild because it was right above our car. We slowed down and was probably going about 5MPH and it stayed right above the car. A car was coming up behind us so we started moving again cause we were right in the middle of the main road. I am not sure why we didnt just stop the car and get out. As we drove away it started slowly going off into the distance and we lost sight of it as we went around the turn. It was not scary at all. It just seemed exciting. When we got home from eating it was already dark. We looked in the sky and there were at least about a dozen airplanes flying around the area. Flying every way you could think of. Crossing paths and everything. We figured someone must have reported something. I've still never seen that many planes flying around at one time."],"Object Shape":"Circle","Object Features":"Undisclosed","Longitude":"-81.790685","Source":"MUFON","Summary":"saw black w/ one red and one green light ufo above car","Tags":"City"}