{"Case Number":"2024","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.617737,+-121.916622(2024)&iwloc=A&hl=en\"> mufon case (2024) map </A>","Longitude":"-121.916622","Source":"MUFON","Object Shape":"Undisclosed","Tags":"City","trends":["There have been 6 other sightings in Pacific Grove","There were no other sightings in Pacific Grove on or around December 11th 2002"],"Disposition":"Insufficient Data","Summary":"Dull orange ufos above Monterey Peninsula","Viewing Distance":"Over One Mile","Latitude":"36.617737","City":"Pacific Grove","Weather Factors":"Unknown","Log Number":"","files":["/var/www/straped/mufon/html2text/2024.html.txt","/var/www/straped/mufon/org/2024.html"],"Date of the Event":"12/11/2002 12:00 UTC","Country":"United States","Date Submitted":"12/11/2002 12:00 UTC","divs":["Sighting DetailsWed. Dec. 11, 2002, Pacific Grove, California, 1230 a.m. Clear starry sky.Looked up to constellation Orion, in south sky. Below Orion, saw dull orangelight slowly moving northnorthwest, towards Pacific Grove and Pacific Ocean.Moving at speed slightly slower than a satellite, slightly larger in size than asatellite, and the color definitely different than a satellite. Seemed to betravelling low enough to be in earths atmosphere, not high enough to be inspace. Kept observing to see if it were an airplane. No flashing aircraftlights, just the dull orange light. From start of observation, craft moved inone line of direction, fairly straightahead but with a gentle curve westward,and pace was slow and steady. A barely visible vapor trail was being leftbehind the moving craft. Craft travelled this path for approximately 3 to 5minutes. Then craft slowed, hovered for a moment, then moved forward. Duringthis change in motion, a smaller dull orange light, approx. 14 to 18 the size oforiginal light, moved from the back of original light, moving south, away fromoriginal light, for a small distance, then disappeared. Original light movednorthnorthwest for a bit longer with slower, unsteady pace. Then light dimmed,brightened briefly, then disappeared. Total time approx. 6-7 minutes.Thoughts, feelings When I first looked up toward Orion and saw the light, thepath and speed of the light seemed like a satellite. But the light was larger,with a different color, and moving slower, than a satellite. Then I noticed thevapor trail behind the light. The trail remained in the sky after the light haddisappeared, slowly dispersing. When the light slowed, and hoveredwavered, thenmoved forward at varying speed, that took away the possibility of an airplane orsatellite. The smaller light coming out of the back of the original light wasdefinitely different. While observing, was enjoying the experience, even wavedhello to the light, though it was way up there.There was a missile test from Vandenberg AFB sometime in the night, so hope thiswas not part of that. The slow and odd travel of this craft seems completelydistinct from missiles and interceptors."],"Sighting Duration":"00:10:00","Object Features":"Undisclosed","Region":"California"}