{"Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/20244.html.txt","/var/www/straped/mufon/org/20244.html"],"divs":["sighting detailsi was four years old. we lived outside lake carmel while my father attended ibm school. the house was directly across from a lake (my older sister knows how to get there, i don't remember). i was awakened by lots of light \"bouncing\" around my room. when i looked out the window i saw a giant column of light going in\\coming out of the water of the lake. there were \"tinkerbell\" lights dancing all around the area. when i turned around there was a being (like the ones in cocoon) who communicated future things to me-i don't remember, or would understand, what i learned until my adulthood, and feel there is more locked inside. i felt the most love coming from the being; and ever after when i saw reflected light (like sunlight off a cup of coffee)i would become really excited because \"lighty\" was coming (he never did); but that's what my parents teased me about as my \"imaginary friend\". i have felt the same energy once since in a group meditation and believe the being's name to be hilarion, though what i have read that was supposedly channeled by hilarion doesn't \"feel\" right. i have always been different and have many other reasons why, but i believe what happened when i was four was very real."],"Source":"MUFON","trends":["There has been one other sighting in Lake Carmel","There were no other sightings in Lake Carmel on or around November 30th 1955"],"Latitude":"41.469772","Date of the Event":"11/30/1955 12:00 UTC","Weather Factors":"None","City":"Lake Carmel","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Region":"New York","Sighting Duration":"Undisclosed","Date Submitted":"11/01/2009 01:32 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.469772,+-73.661103(20244)&iwloc=A&hl=en\"> mufon case (20244) map </A>","Longitude":"-73.661103","Disposition":"Insufficient Data","Summary":"Only saw large golden column.","Case Number":"20244","Object Shape":"Other","Log Number":"US-11012009-0014","Tags":"City"}