{"Latitude":"33.842881","Date Submitted":"11/01/2009 06:03 UTC","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Case Number":"20251","map":"<A HREF = \"http://maps.google.com/maps?q=33.842881,+-81.154414(20251)&iwloc=A&hl=en\"> mufon case (20251) map </A>","trends":[],"Weather Factors":"None","Sighting Duration":"00:15:09","files":["/var/www/straped/mufon/html2text/20251.html.txt","/var/www/straped/mufon/org/20251.html"],"Source":"MUFON","Summary":"Saw square to rectangular black dot against clouds high in sky. that seemed not to be moving then some other vehiccle higher than that appearin smaller.","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Square, Rectagular","Object Features":"None","City":"Undisclosed","Log Number":"US-11012009-0021","Region":"South Carolina","divs":["Sighting DetailsI was driving on the 526 from Mt. Pleasant where I work to North Charleston where I live. It was a bit before sunset and I noticed this black rectangular object high in the sky against some clouds. Well I slowed a bit but had to keep driving since is unsafe to stop on the 526. I kept watching and watching and it didn't seem to be moving or moving very far, very fast at all. I then noticed another object, higher still and off to the right of it somewhat. Very small and I do wear glasses but it might have been plane shaped. At that time I wondered if it could be a helicopter or plane of some sort with something in tow. I thought maybe it was a plane pulling behind one of those signs like I see off the coast of Daytona sometimes. But way too high for that and I sure couldn't read any message if that were an advertisement plane. Now I saw no rope or tow chain either, just the two objects. I watched until I passed \"North Rhett\" exit ramp I believe it was, and watched until I passed the Rivers Avenue exit ramps. They began to move and I kept watching as I was driving, though trying to drive carefully. I let my immagination go a little and I say it looked like a borg cube caught in enterprises tractor beam. But seriously, this was very different. I think it was flatter at one angle and wider at some other angle. I thought, \"What is that, is it a parachute of some kind being dangled down from some plane?\" I just don't have a clue. Well what made me notice it, I always watch the sky and hope to see a UFO. When I first noticed it I swear I thought it was a UFO. I like to consider the reasonable and think it was a helicopter towing something. I guess that is possible but highly unlikely and uncommon for around here. I mean for a plane or a helicopter to be towing something around here would seem dangerous to me. I thought could it be a plane involved in some scientific experiment of some sort? Maybe an airforce helicopter dangling something down for some experiment. But maybe these two objects weren't physically connected and just were somehow in formation with eachother. The rectangular black object was definately not a plane or a helicopter, what it actually was, I have no clue. I lost sight of the object because the trees are dense going towards the exit that I take to get home. I couldn't see anymore due to the area I entered into."],"Tags":"City","Disposition":"Unknown","Date of the Event":"11/01/2009 05:10 UTC","Longitude":"-81.154414"}