{"Date Submitted":"11/01/2009 08:58 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:04:00","Summary":"Three \"Tongues of Fire\" float over neighborhood cemetery.","Case Number":"20258","Log Number":"US-11012009-0028","Weather Factors":"Windy, Light","Object Features":"None","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around July 4th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.633662,+-90.193374(20258)&iwloc=A&hl=en\"> mufon case (20258) map </A>","Object Flight Path":"Path with directional change","Object Shape":"Fireball, Teardrop","Country":"United States","Longitude":"-90.193374","Tags":"City","Source":"MUFON","divs":["Sighting DetailsOpening the back door to go out and set up for the evening's festivities, I immediately noticed three bright orange lights floating towards my direction underneath the low and slow moving overcast clouds. Standing there for a few seconds, I could discern they were actually moving in a direction along a major city street, Morganford, just on the other side of it from me, where there is a blocks sized historic city cemetery. The lights seemed to be bobbing in the gentle but steady wind that was also moving along that direction. I noted to my friend who was standing with her back to that in the yard, that I wondered if they were Chinese lanterns, many being reported in England during late Spring and early Summer there. Neither of us have ever seen them, only pictures, but each orange light looked like a tongue of fire. We both agreed that each seemed to not have a distinct outline, but was in the shape of a \"campfire\" including intensity of color and brightness of the \"flame,\" but the \"fire\" didn't flickr. It was more like it was light being emitted from the base of the \"fire\" making the \"flame.\" They moved along, if a car, at 5 to 10 miles per hour, and appeared to be directly over the cemetery as they went by. They slowly ascended from about 15 degrees initially to about 45 degrees when they passed right by the house. When they were approaching close to the house, each of them \"vibrated\" at a different time within a few seconds of each other, not at the same place in the sky, nor in sequence. The middle, the first then last fire oscillated perpendicular to the direction it was going, several times in succession per each oscillation, at least three times its length in each oscillated direction. I've never heard of a crosswind making Chinese lanterns oscillate that way, nor not an external structure around the internal flame. Also, just as they passed the house, the clouds right by them light up with lighting bolts visible within them but made no sound! It was the only lightening we saw all night. They then seemed to start to ascend at a much faster rate and were either dimming out or getting closer to the clouds, at which point we stopped looking at them."],"City":"St Louis","Region":"Missouri","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/20258.html.txt","/var/www/straped/mufon/org/20258.html"],"Date of the Event":"07/04/2009 07:00 UTC","Latitude":"38.633662"}