{"Date Submitted":"11/02/2009 12:24 UTC","Summary":"Second time spotting long white cylinder object.","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/20261.html.txt","/var/www/straped/mufon/org/20261.html"],"Source":"MUFON","divs":["Sighting DetailsTonight, my family and I took a long drive in the country to take photos of the autumn leaves. As we were returning home, my daughter said \"What's that up in the sky?\" We all turned to look, and I first noticed the moon, which looked pretty bright, and I saw a jet flying underneath it (going in opposite direction). At first I thought this is what she was talking about. My mother was also in the car and spotted what my daughter was seeing. It was then, that I looked to the right of the moon and saw the exact same thing I did nearly a month ago. I pulled off on a side road so my son could see it, he got out of the car, but it dissappeard from his line of view, by then it was already gone. I regretfully was not able to get any photos. This had the same long cylinder-like appearance as what I saw before. It was about 4:45 or so, and the sun had already started to set. The object was very bright white looking. We didn't notice wings or any flashing lights, just as in the incident before. This time it was heading south and did not seem to be moving nearly as fast, but still fast enough to not be able to get a good view before going over the tree tops. This object was nearly in the same area as where it was spotted before. No chem-trails, and we couldn't tell if it was making sound as we were in the car, and closer to the interstate. We pulled back onto the main road, and tried to catch up and see if we could spot it again, but it was already gone. I sure would like to know if others have seen this as well. Thank you."],"Weather Factors":"None","Longitude":"-85.499292","Object Features":"None","trends":["There have been 10 other sightings in Cookeville","There were no other sightings in Cookeville on or around November 1st 2009"],"Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Latitude":"36.167339","Case Number":"20261","Log Number":"US-11022009-0001","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.167339,+-85.499292(20261)&iwloc=A&hl=en\"> mufon case (20261) map </A>","City":"Cookeville","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Cylinder","Tags":"City","Date of the Event":"11/01/2009 04:45 UTC"}