{"Date Submitted":"11/02/2009 02:52 UTC","files":["/var/www/straped/mufon/html2text/20268.html.txt","/var/www/straped/mufon/org/20268.html"],"Log Number":"US-11022009-0008","Object Features":"Undisclosed","divs":["Sighting DetailsI was riding in the passenger seat driving down I35 going south in the middle of george town and when I looked over to my right I saw a big circular object sitting just above the wooded area that was glowing red blue yellow green and white and the colors look like they spinning and pulsating at the same time. The object was just sitting there not moving. We was driving at about 70-75 Mph. It almost look like there was 2 parts to it, like the lights on the outside that was flashing and pulsating was on something that was spinning and the middle part was not moving I asked my girlfriend to look but she was too late we was already at the windy part of the highway and she was driving. It was weird I been thinking about it ever since I didn't tell my girlfriend much about it because she would call me a nut and try to tell me I must of saw something else. I don't know what it was but I know it wasn't something common it gave me chills. It looked like the top to a cooking pan. If I find a picture of something that looks like it I will post it at a later date."],"Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.636324,+-97.668571(20268)&iwloc=A&hl=en\"> mufon case (20268) map </A>","Weather Factors":"Unknown","Tags":"City","Object Shape":"Circle, Disc","Sighting Duration":"Undisclosed","Case Number":"20268","Object Flight Path":"Undisclosed","Date of the Event":"11/01/2009 12:00 UTC","Source":"MUFON","trends":["There have been 6 other sightings in Georgetown","There were no other sightings in Georgetown on or around November 1st 2009"],"Country":"United States","Longitude":"-97.668571","Summary":"just over the wooded area going south on I35 in georgetown tx","City":"Georgetown","Latitude":"30.636324","Disposition":"Unknown","Viewing Distance":"Unknown"}