{"Log Number":"BR-11022009-0006","files":["/var/www/straped/mufon/html2text/20266.html.txt","/var/www/straped/mufon/more/20266_submitter_file1__ufobrazil.JPG","/var/www/straped/mufon/more/20266_submitter_file2__ufobrazil2.JPG","/var/www/straped/mufon/org/20266.html"],"Latitude":"-10.168891","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsMy wife's friend in Brazil often drives along a highway near Palamas, TO that is known for sightings of orbs. He is a well-respected business owner and city council president, family man and very down to earth. He saw the orb approach his car and match his speed and direction ahead of the car approximately a quarter of a Kilometer ahead. He took two photos with his cell phone. THE CELL PHONE DOES NOT HAVE A FLASH. I tried duplicating the pictures with a digital camera and my cell phone, and this is definately NOT the result of a flash going off in the car. THe dirt on the windshield would be predominately lit. The best duplication I got was with my cell camera, in twilight, of a bright street light. THere seems to be a reflection on the road of the light. One could argue that the orb is a reflection of the light on the road, but I tried to duplicate that theory with oncoming headlights and it never looked anything like the photos. THe orb appears too bright in the actual photos. You can see the windshield (dirty) and the orb does not seem to be a reflection on the windshield. The gentleman's wife also reported seeing a green orb flying very close to her car along the same road about a year before. This stretch of road and the surrounding area is well known for sightings of this type."],"Longitude":"-48.331717","trends":["There have been no other sightings in Palmas","This sighting has never been favorited."],"Date Submitted":"11/02/2009 10:34 UTC","City":"Palmas","Case Number":"20266","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Summary":"Bright orb follows car, then streaks away. 2 cell phone pictures taken","Object Shape":"Fireball, Sphere","Country":"Brazil","Region":"Tocantins","map":"<A HREF = \"http://maps.google.com/maps?q=-10.168891,+-48.331717(20266)&iwloc=A&hl=en\"> mufon case (20266) map </A>","Date of the Event":"08/31/2009 12:00 UTC","Object Flight Path":"Path with directional change","Object Features":"Undisclosed","Source":"MUFON","Tags":"City"}