{"Latitude":"45.153461","Date of the Event":"11/01/2009 01:50 UTC","Object Shape":"Cigar","Object Features":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20263.html.txt","/var/www/straped/mufon/org/20263.html"],"Case Number":"20263","Object Flight Path":"Stationary,Path with directional change","divs":["Sighting Details On November the first at 13:50 pm I was driving north on hwy 99e going to work when two objects passed over my left shoulder headed north going very fast. 99e runs along side Interstate 5 and is a path that many airlines take on the way to Portland International Airport so planes in the sky are common. There is also a National Guard fighter wing stationed at the airport and as a fan of the military I always watch the skies in hopes of seeing fighter planes. These objects were long; cigar shaped and appeared to be shinny as if they were chrome plated. They looked to be moving faster than fighter jets but appeared to be small like they had a lot of altitude. At first I thought they were fighter planes until they made a sharp right (easterly) downward turn then they appeared to be tumbling end over end and twisting out of control towards the ground. Simultaneously as they neared the ground a third object flew directly over my truck and caught up with them. As the third object arrived they all stopped in an elongated triangle formation then appeared to move north again. Just as they began to move they disappeared from sight. Because of the size of the objects it looked as though they were very far away but when they began the tumble and connected with the third object it was clear they were much closer than I thought. Perhaps only 200 feet or so off the ground at their lowest point and, less than a mile in front of me."],"Log Number":"US-11022009-0003","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Woodburn","There were no other sightings in Woodburn on or around November 1st 2009"],"Disposition":"Unknown","Weather Factors":"None","Country":"United States","Viewing Distance":"Unknown","City":"Woodburn","Summary":"two cigar shaped objects flying at high rate of speed changing directions wildly then were joined by a third object and disapeared.","Longitude":"-122.847432","Date Submitted":"11/02/2009 04:04 UTC","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.153461,+-122.847432(20263)&iwloc=A&hl=en\"> mufon case (20263) map </A>","Tags":"City"}