{"Country":"United States","Object Flight Path":"Undisclosed","City":"Undisclosed","Date of the Event":"11/01/2009 04:45 UTC","Log Number":"US-11022009-0007","Latitude":"44.320034","Tags":"City","Disposition":"Insufficient Data","Case Number":"20267","Date Submitted":"11/02/2009 11:05 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20267.html.txt","/var/www/straped/mufon/org/20267.html"],"Summary":"dull metallic object that wobbled around in a circle off its axis with something rotating around it.","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=44.320034,+-85.592794(20267)&iwloc=A&hl=en\"> mufon case (20267) map </A>","Viewing Distance":"Unknown","trends":[],"Sighting Duration":"Undisclosed","Longitude":"-85.592794","Object Features":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsI was outside raking the yard when I saw an object approaching from a distance that moved slowly. I thought that it was some sort of balloon.As it got closer it was visibly rotating in a circle with a wobble movement. As it wobbled to a certain degree it reflected light making it more visible.There was something rotating slowly around it in a circle. It increased altitude slightly and hovered for awhile then moved slightly from over the krogers grocery store to over the rite aid store on Davison rd which was even closer to me. It remained there for approximately 30 minutes and it was then that I could hear the sounds that it made which sounded like a strong rush of water.There were some sort of energy around it that pulsated that was very visible.I wanted to tell others in the vacinity to simply look up and see what was so close over their heads but i did not do so because i didnt want people to think that I was weird.I called a couple people and even tried to use my phone to capture a picture but when i looked through the finder i guess the object was too far away to be seen through the cellphone.My feeling was one of aww and I felt like this was something that I would never be able to explain or see again in my lifetime..It was no airplane or helicopter or any flying object known to man. I wanted to contact Bishop international airport but after doing some research I read that they refer all of those type of things to the FAA and it seemed like abit much to get into. So I did nothing..But im sure this object showed up on some radar."]}