{"Weather Factors":"Unknown","Latitude":"32.525152","Summary":"Cone shaped lights over Schreveport, LA","Sighting Duration":"00:00:59","Object Shape":"Cone","Country":"United States","Date Submitted":"12/06/2002 03:00 UTC","Tags":"City","Longitude":"-93.750179","Log Number":"","files":["/var/www/straped/mufon/html2text/2027.html.txt","/var/www/straped/mufon/org/2027.html"],"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was driving on Interstate 10 east from Burbank, Cal to Johnson City, TN. Itwas 300 AM and I was on the eastern outskirts of Schreveport, LA. There waslittle traffic and it was exceptionally clear, and I noticed to my right high inthe sky a movement of light. At first I thought it was a star twinkling, but Irealized quickly that a two toned light sort of cone shaped descended rapidly toa position just to the upper right of my vehicle. It stopped in mid air for asecond or two, then started drifting south west downward behind some trees. Iattempted to pull off but the guardrail did not allow a space large enough topull off. The road veered to the left and I lost sight of the object and myposition. The top of the cone was a brilliant radiating white light with thebottom two thirds a bright glowing green color. The colors were so bright theyseemed surreal. It all happened in less than a minute. It was astonishing and Icould not settle down for a long time. There is a military base there so itcould have been associated with that.I logged on to the local papers when Ireturned to TN to see if it had been seen by others. I called the Times butcould not verify anything. I am a member of MUFON and have investigated severalsightings and an abduction in TN. I own several businesses and am not active inthis subject. This is my only sighting, but it certainly got me wide awake inmore ways than one."],"Object Flight Path":"Straight-line path","Object Features":"Undisclosed","trends":["There have been 16 other sightings in Shreveport","There were no other sightings in Shreveport on or around December 6th 2002"],"Source":"MUFON","Date of the Event":"12/06/2002 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.525152,+-93.750179(2027)&iwloc=A&hl=en\"> mufon case (2027) map </A>","Region":"Louisiana","Case Number":"2027","Disposition":"Unknown","City":"Shreveport"}