{"trends":[],"Sighting Duration":"Undisclosed","Log Number":"US-11022009-0015","Region":"Florida","Weather Factors":"Windy, Fog","Disposition":"Insufficient Data","Latitude":"27.673727","Summary":"There was a large white cigar shaped craft that was hovering in my yard around 9pm","Object Flight Path":"Undisclosed","Longitude":"-81.512564","Tags":"City","divs":["Sighting DetailsYesterday there was a large white craft that was hovering in my yard around 9pn.It was atleast a couple feet long.It at first came in the form of a star.As it has been for several months.Since around August I have been seeing these star like UFO's.Everyday I go outside they blink there lights only for me.And when I tell everyone else the lights stop. Just 10 minutes ago I went outside and said \"blink your lights\" and sure enough the light was blinking and then started coming closer and closer to the house.So back to the story. So I was looking out the front window thinking it was my mom and sister returning home and that's when I noticed the blinking \"star\".This time I actually saw colors coming from the blinking hovering star I had never seen.There was red.I just continued to look at the \"star\" for a few minutes and then I went to the bathroom.When I went back to the window the bathroom was right over my sisters window which is the front of the house. I decided to take a closer look and go outside.So I put a coat on and headed out the door to take a look.When I looked I first saw the blinking light and then that's when I saw the whole body right there about 12-15 feet in the air floating above the front yard.It was cigar shaped and it sorta glowed either white or like a silvery,white,maetallic color.Towards the front the light was red and blinking.As soon as I saw that I immediatley ran in the house and locked the door.I called my mom and stayed on the phone with her till she came home. Now I had looked out the window again and this time it was gone and there was no sound no vibration it was just gone.I would expect noises from something so large but,there was nothing. The object was about as thick or thicker than a full grown pine tree. When my mom arrived I showed her the lights and she insisted that they were plains but,they weren't.One they never moved the lights circled the house.They sat there blinking and sitting.Again there was no sound and there was no movement.I no it was a star either since it was red and blinked and slowly moved closer to the house. I continued to show my mom but she thinks i's a plain and it's not.It was so fustrating because it didn't move and it was so close to the house.There's no way it's a plain. I keep going outside right now and all I have to do is yell blink and the lights blink uncontrolably.It's crazy.Now the craft was in the yard yesterday but I went out there again when my mom arrived and I said blink and all of a sudden there was a red burst and what looked like a \"shooting star\" bursted out the sky.My mom again trying to play the scientist was like \"it's just a shooting star.\" I know it's not though because right when I said blink it came from right over the house right in front of us and just bursted out. It's so fustrating when she thinks it's these other things when clearly it's not.My sister even saw it and was trying to tell her.Anyways. That's pretty much what happened.If I go outside and request for the lights it'll go off again.It's so strange. There's other odd things that's been happening as well but this was the most profound."],"Country":"United States","City":"Undisclosed","Source":"MUFON","Object Shape":"Bullet, Missile, Cigar, Cylinder, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=27.673727,+-81.512564(20275)&iwloc=A&hl=en\"> mufon case (20275) map </A>","Date of the Event":"11/01/2009 12:00 UTC","Object Features":"Undisclosed","Case Number":"20275","Date Submitted":"11/02/2009 08:24 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20275.html.txt","/var/www/straped/mufon/org/20275.html"]}