{"Source":"MUFON","Date Submitted":"11/02/2009 06:59 UTC","Log Number":"US-11022009-0011","Object Flight Path":"Straight-line path","Tags":"City","Date of the Event":"09/24/2009 12:00 UTC","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around September 24th 2009"],"Longitude":"-84.543343","Viewing Distance":"Unknown","Region":"Georgia","Summary":"Bright blue-green light moving at high speed East-West Direction","Object Shape":"Circle, Other","files":["/var/www/straped/mufon/html2text/20271.html.txt","/var/www/straped/mufon/org/20271.html"],"Country":"United States","Weather Factors":"None, Does Not Apply","Case Number":"20271","Disposition":"Unknown","Object Features":"None","Sighting Duration":"00:05:00","Latitude":"33.959142","divs":["sighting detailswhile driving south on interstate 85 just south of atlanta, my brother-in-law, my son (18 y\\o) and myself spotted a very bright blue-green light in the night sky (it was around midnight). although we were not able to make out any kind of shape it was quite obviously not an airplane (no lights other than a single bright illumination), and it was traveling at a very high rate of speed. there were in fact a few airplanes in the sky at the time, and this object was going much faster and was alot brighter than anything else around. i have lived close to the world's busiest airport for much of my life and am familar with most of the aircraft that populate the sky over and around atlanta. this was unlike anything i have ever seen. there must be others that saw the same thing. i would love to compare notes and hear from anyone that may have seen it. i wish i could provide more detail but i can only report what i (or we) saw and i know there could be a rational explanation for what we saw but i have seen many different types of aircraft and i have flown more than most and i can honestly say this was something other than what one would normally see streaking through the sky, even in atlanta at night."],"City":"Marietta","map":"<A HREF = \"http://maps.google.com/maps?q=33.959142,+-84.543343(20271)&iwloc=A&hl=en\"> mufon case (20271) map </A>"}