{"Longitude":"-122.414156","map":"<A HREF = \"http://maps.google.com/maps?q=37.77813,+-122.414156(20279)&iwloc=A&hl=en\"> mufon case (20279) map </A>","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around October 11th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsGoing through my photos from trip to San Francisco. Sensor on my Canon 20D is very dirty and I am cleaning up my photos a lot these days. Spots appear the most on sky shots, and on this particular shot I saw one spot that seemed to have a density and shape I never seen before or since on other shots from that trip. I have submitted three versions of same photo, one with no photo shopping, one where I cleaned up all spots but one in question and a third with high contrast, removed the color and reduced the noise around the \"UFO\". Never heard anything or saw anything when I took the photo. It is taken on top of Fort Point under the Golden Gate bridge looking west towards the Pacific Ocean. An interesting sidenote this was taken the afternoon around the time of the Fleet Week air show which included the Blue Angel. Maybe \"they\" were in the solar system and wanted to check out the show!? First time I picked up something like this, who knows, but it has that classic saucer shape."],"Date of the Event":"10/11/2009 02:26 UTC","files":["/var/www/straped/mufon/html2text/20279.html.txt","/var/www/straped/mufon/more/20279_submitter_file1__IMG_0991.JPG","/var/www/straped/mufon/more/20279_submitter_file2__OntopofFortPointwithGoldenGategirdwork.jpg","/var/www/straped/mufon/more/20279_submitter_file3__Somethingnotrightin10881UFO.jpg","/var/www/straped/mufon/org/20279.html"],"Source":"MUFON","Region":"California","Disposition":"IFO","Date Submitted":"11/02/2009 10:38 UTC","Log Number":"US-11022009-0019","Weather Factors":"Unknown","Latitude":"37.77813","Summary":"Interesting shape in photo","Tags":"City","City":"San Francisco","Object Flight Path":"Undisclosed","Case Number":"20279","Object Shape":"Circle","Object Features":"Undisclosed","Viewing Distance":"Unknown"}