{"City":"Lake Geneva","Object Flight Path":"Path with directional change","Weather Factors":"None","Object Features":"None","Date Submitted":"11/03/2009 02:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.598104,+-88.43078(20284)&iwloc=A&hl=en\"> mufon case (20284) map </A>","Log Number":"US-11032009-0004","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Lake Geneva","There were no other sightings in Lake Geneva on or around August 20th 1978"],"Latitude":"42.598104","divs":["Sighting Details Sometime during the late summer of 1978, my now ex-wife and I were visiting the Southern Wisconsin tourist town of Lake Geneva. We were walking in a southeasterly direction in the 800 block of Wrigley Dr. near the northern end of the lake. It was just as the last rays of the sunset were lighting up a few clouds to the West. It was at that time that we noticed a saucer shaped craft above us, it was approximately 80 deg. from the horizon. There were 3 other people besides us also in the immediate vicinity, (within earshot that is). I remember making the comment that \"We are now experiencing a UFO people.\" The 50 yd diameter craft was remarkably close, only about 150 yards away. We saw many details on the craft, not all of which we can remember. It moved silently and very slowly for 100 yards or so from west to east. It then changed direction to go away from us in a southerly direction at an ever increasing speed. We watched the craft until it was out of sight. My wife and I then proceeded to our car which was parked across the street and we left the area going on Hwy. 12 south. When we had reached an area that was approximately near where County Hwy. U crosses Hwy. 12, it was already nightfall. It was at that time that we saw what we have assumed is the same craft, however it was brilliantly lit up with a wide lateral band around the craft. We noticed that it was a very complicated pattern of everchanging multi-colored lights. Now this was 1978, it has only been recently that I have compared the lights to what today we would call a very complicated screensaver or even fractal color display. I pulled the car over to get a better look, but my wife looked very terrified, so i pulled back onto the road. I know what I saw. I have worked for many years in the aerospace business as a R&D machinist. I know it was not of this planet."],"Date of the Event":"08/20/1978 09:15 UTC","Case Number":"20284","Longitude":"-88.43078","Viewing Distance":"101-500 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/20284.html.txt","/var/www/straped/mufon/org/20284.html"],"Object Shape":"Circle, Disc","Disposition":"Unknown","Country":"United States","Summary":"Up close saucer over Lake Geneva, Wi. in 1978.","Region":"Wisconsin","Source":"MUFON"}