{"Case Number":"20285","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date of the Event":"11/02/2009 07:00 UTC","Sighting Duration":"00:15:00","City":"Cincinnati","files":["/var/www/straped/mufon/html2text/20285.html.txt","/var/www/straped/mufon/org/20285.html"],"Region":"Kentucky","Summary":"lots of orange orbs coming up from horizon, followed by a black triangle, all completely silent","Log Number":"US-11032009-0005","Weather Factors":"None","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.108658,+-84.50493(20285)&iwloc=A&hl=en\"> mufon case (20285) map </A>","divs":["Sighting Detailsorange orbs were appearing over the horizon from the south, to my front, and the east, to my left. the orbs were coming up one after another, after another. in a uniform fashion, one by one. they would appear, sometimes go dim, sometimes get brighter, and they all would eventually disappear. but for some strange reason i never got to witness the disappearing. a new orb would appear to my left, and when i looked back to the front 1 or 2 would be gone, but then another would pop up over the horizon. it was unreal. well in the middle of all this the infamous black triangle showed up. it was completely silent. you hear people say completely silent, but you just don't realize how eerie it is to see a craft like that not making a sound until you see it yourself. it just seemed so smooth, best way to put it. it either passed by twice, or else 2 made a single pass by. shortly after the triangle(s) showed up the orbs stopped appearing. the whole experience was really overwhelming. i've never seen so much activity in the sky, there were orange balls everywhere, and they just kept coming and going. now i wish that i would of recorded the whole event, but after i got a lot on tape i just wanted to take it all in. i was missing out on the show trying to zoom in, adjust focus, and keep it all in frame. of course, when i turned the camera off, the activity really increased. i may have gotten the best footage ever of the legendary black triangle, had my camera been rolling. it passed right in front of me. at this point there were like 3 orbs straight ahead, 3 to the left, then the black triangle rolls through. i scrambled for the camera again, and thankfully i did manage to get the triangle on tape. the video really doesn't do much for how exciting this whole experience really was. i wish you could of seen it with your own eyes. i've seen many weird looking distant lights, strobing and everything. but this was like a smack in the face, here we are! kind of thing."],"Object Shape":"Circle, Fireball, Sphere, Triangle","Country":"United States","Latitude":"39.108658","Source":"MUFON","Disposition":"IFO","Longitude":"-84.50493","Object Features":"Other","trends":["There have been 5 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around November 2nd 2009","This sighting has never been favorited.",""],"Tags":"City","Date Submitted":"11/03/2009 03:12 UTC"}