{"Region":"Nevada","City":"Reno","Sighting Duration":"00:01:00","Summary":"dark triangular object directly overhead, turning","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Object Shape":"Triangle","Longitude":"-119.808083","Date of the Event":"07/15/1977 12:00 UTC","Viewing Distance":"Unknown","Log Number":"US-11032009-0001","Country":"United States","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/20281.html.txt","/var/www/straped/mufon/org/20281.html"],"divs":["Sighting DetailsIt was approximately summer in Reno when i was a teenager. Weather was clear and warm because I was outside. We lived on the NE corner of Lander and St. Lawrence streets. I was doing something in the yard, maybe just finishing washing the car or a similar activity. Some movement overhead caught my eye. When i looked up i saw what i believed at the time was a black or dark hang- glider directly overhead. It had a redish circular spot at each corner on the underside. The red spots were not overly bright, but visible. If it was a hang-glider, it would have been about 200 to 300 feet directly above me as I was looking up between two trees that were separated by about 20 feet. It was completely silent and turned 180 degrees in a quick, flat, fashion. After the turn, my view was blocked by the trees. I quickly rushed out to the street to see its continued path, but it was gone. At the time, i wondered what idiot would be flying a dark hang-glider directly above the city and at such a low altitude, and where would they land. Because of the shape and the quietness, my mind just assumed it was a hang-glider. The incident seemed odd and out of place at the time, so I have always remembered it very clearly. However I didn't give it a whole lot of additional thought until recently when i saw a program about triangular UFOs in Nevada, then it clicked. It was not a hang-glider and could have been at any elevation if it were larger or smaller. Probably larger. I don't know the date for sure, but I lived at that house from 1973 to 1978, I was between 13 and 18, and i know it was in a warmer time of year, perhaps May to September, and the weather was dry and I believe cloudless. My recollection is that I was old enough to drive at the time. I thought i should report this and to see if anyone else saw similar things around the same time."],"Object Features":"Patterned Surface","Date Submitted":"11/03/2009 12:10 UTC","Latitude":"39.537953","Case Number":"20281","map":"<A HREF = \"http://maps.google.com/maps?q=39.537953,+-119.808083(20281)&iwloc=A&hl=en\"> mufon case (20281) map </A>","Source":"MUFON","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around July 15th 1977"]}