{"Latitude":"39.115662","Summary":"Bright white light - rectangular","Disposition":"Unresolved","Source":"MUFON","Region":"Virginia","Date of the Event":"09/13/2000 05:55 UTC","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=39.115662,+-77.563602(2028)&iwloc=A&hl=en\"> mufon case (2028) map </A>","City":"Leesburg","trends":["There have been 8 other sightings in Leesburg","There were no other sightings in Leesburg on or around September 13th 2000"],"Object Features":"Undisclosed","Object Flight Path":"Unknown","Date Submitted":"09/13/2000 05:55 UTC","Object Shape":"Square, Rectagular","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/2028.html.txt","/var/www/straped/mufon/org/2028.html"],"Weather Factors":"Unknown","Case Number":"2028","Sighting Duration":"00:05:00","Tags":"City","Longitude":"-77.563602","divs":["Sighting DetailsI was driving out of my development heading for work at 555 AM. When I first sawthe object I thought it was a blimp completely illuminated in the distance. As Idrove towards the end of my street, the object became much more clear and theshape became much more defined. I believe that the object was moving towards mydevelopment as I was driving towards the object. The object was a perfectrectangle tilted approximately 20-30 degrees long axis horizontal. The objectwas completely illuminated to the point where all I could see was a white lightin the shape of a rectangle. If I had to guess at a distance Id say the objectwas between 1000 and 2500 away from me. It lit up the sky like a full moon doeson a dark night it was still pitch black outside. I turned onto another streetand continued driving while looking out the window at the object. It was movingparallel to the street I was on and about the same speed 45 mph. For a splitsecond my line of sight was blocked by some trees. When I could see again, theobject was much farther away several miles and all I could see was a very smallilluminated rectangle."]}