{"Summary":"I witnessed two cylindrical ufos over south philadelphia. both moved silently emitting lights and one changed form.","Object Shape":"Circle, Cylinder, Other","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00","Date Submitted":"11/03/2009 04:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.961925,+-75.161649(20295)&iwloc=A&hl=en\"> mufon case (20295) map </A>","Log Number":"US-11032009-0015","Region":"Pennsylvania","Country":"United States","Tags":"City","Disposition":"Insufficient Data","City":"Philadelphia","Latitude":"39.961925","Object Features":"Undisclosed","Case Number":"20295","Weather Factors":"Light","divs":["Sighting DetailsI was out having a cigarette on my roof deck in south Philadelphia around 1:35 am Nov. 2nd 2009. It was a little cloudy, but the moon was very bright, so visibility was good in terms of lighting. I was sitting, looking at the sky, when something moving caught my eye from the north. I didn't know what it was at first. I could tell it wasn't a plane, as i see many every night and am very familiar with their appearance at various altitudes at night. It was coming from the north going south. I thought maybe it was some kind of balloon or kite, but as it got closer, almost directly above me, I could see it was neither of these things. Although details of its surface were difficult to make out, the shape was very clear. It was a light color, maybe grayish, and in a cylindrical shape. It was difficult to tell exactly how high up it was, but it was lower than most of the clouds in the sky, and didn't seem to be that far away. This makes the size difficult to judge, but it must have been at least 100 ft. It was a very quiet night and it was clear this thing was not making a sound. The objects flight position is difficult to explain. The cylinder was parallel to the ground, but it was moving at about a 45 degree angle from its flight path. At some point while watching I had stood up, and as it passed over it looked like it was emitting several points of light along its length. These lights were whitish, but were not very bright at all. After it moved a little south of me it entered into some lower clouds, and i was unable to see it again. I sat back down, completely shocked and trying to figure out what i had just see. I looked back up hoping to see further evidence of what had just happened. After about a minute or so my eye caught a similar movement coming from the same direction, but a little more east of me. When i saw the second one coming i felt shocked. After the first disappeared i was trying to convince myself it had been some sort of floating debris, my imagination, or a prank as i had seen the story about the balloon boy a couple weeks ago. But when the second appeared i was immediately convinced that non of these were true. At first it appeared very similar to the first. It moved silently and steadily southward. After about ten seconds or so of observation I saw it was emitting lights just as the first one did, however, at this point the object seemed to change its shape. It seemed to curl up into a spiral like circle, but it s speed or path did not change. As it proceeded south this one too entered into some low clouds and I didn't see it again."],"Date of the Event":"11/02/2009 01:35 UTC","Source":"MUFON","Longitude":"-75.161649","files":["/var/www/straped/mufon/html2text/20295.html.txt","/var/www/straped/mufon/org/20295.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around November 2nd 2009"]}