{"Longitude":"-115.169756","Weather Factors":"Unknown","Latitude":"36.122026","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.122026,+-115.169756(2029)&iwloc=A&hl=en\"> mufon case (2029) map </A>","Object Flight Path":"Stationary","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/2029.html.txt","/var/www/straped/mufon/org/2029.html"],"trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 24th 1978"],"Object Shape":"Unknown","divs":["Sighting DetailsChristmas Eve 1978, around 2am, I was traveling westbound on Spring Mtn Rd inLas Vegas, NV after dropping a friend off after we had been out for the evening,and a midnight Christmas breakfast. I turned right onto Valley View Blvdheading north, and as I was coming up to a radio tower on my left, I looked up,noticed redgreenwhite lights and thought, oh how cute, someone decorated thetower for Christmas. I then turned left onto Pennwood heading west to go home. As I was about halfway between Valley View and approaching the 4-way stop signat Arville, I noticed to my left south that the redgreenwhite lights were nolonger at the radio tower but seemed to be pacing me. There was no sound, and Icould not make out any shape whatsoever. I just saw the lights - I cannotrecall any particular configuration - just a red, a green and a white light. Itwas definitely NOT a plane, nor a helicopter. As low as the lights were, had itbeen a helicopter, it would have been VERY loud. When I slowed down, it sloweddown. I stopped at the 4-way stop, proceeded straight across Arville and abouta short block down, turned left into my apt complex Wood Creek Apts, which werestill under construction. In fact, only the townhouses on the street and mybuilding of 1BR apts were complete. Everything else was under construction andthe complex was quite dark. As I turned in, I noticed the lights were still tomy left - hovering. Still no sound. I had to make an immediate right turn, andtraveled about 100-150 feet to my parking space, turned right into my coveredparking space. Turned my car off and stepped out and locked the car. As Iwalked out from underneath the cover, I looked up I would have been facingsouth, towards the sidewalk to my apt and saw the lights almost directly aboveme 300-500 feet up and slightly left. I turned slightly more to my left eastbecause I also noticed that there was a single, but very bright white light thatwas positioned in the sky in the vicinity of the moon, but much closer to Earth- it was just that the light was in that area of the sky at the time. I startedto walk towards the sidewalk but I looked down what was going to be the rest ofthe parking lot, which would have been perpendicula"],"Summary":"Christmas Eve 1978 - Las Vegas Lights","Viewing Distance":"101-500 Feet","Sighting Duration":"01:59:00","Log Number":"","Tags":"City","City":"Las Vegas","Region":"Nevada","Date Submitted":"12/24/1978 02:00 UTC","Case Number":"2029","Country":"United States","Object Features":"Patterned Surface","Date of the Event":"12/24/1978 02:00 UTC"}