{"Tags":"City","Date Submitted":"11/03/2009 09:53 UTC","Sighting Duration":"Undisclosed","Log Number":"US-11032009-0019","divs":["Sighting DetailsI am 14 years old and I went outside to make sure by bb sister and my moms boyfriends son comes in the house. I came to about the edge of my driveway and I saw my moms boyfriends son. I turned to my right to look at the stars when suddently I see a star that appears to be too low to be one.I rush into the house to get the camera I borrowed from school for photography to take a picture.When I got outside it was split in two. There was one above the other. You could easily tell that these were no stars. The two were not exactly above each other but more like one was higher than the other. The one that was higher started moving more too the right at a fast pace. The one below it slowly followed about 2 or 3 minutes behind the other.I cept taking pictures until it was out of my sight. I only have two good photos of them. After they left I got my sister in the house and my moms boyfriends son too.After I go to 911 .com to report what I saw. Then I started looking on google to see what you were supppost to do when you saw a UFO. After that I went back outside to look at the stars again but when I get outside my door I see the moon and it is closer and more oddly colored than usuall(I take pictures of this also). About 5 minutes later I see a sigar shaped craft about 20 to 30 feet away from me.I try to take pictures of it but the camera would not take them right.I tried my best.After that I go back on the internet and I stumble upon this sight and now I am writing this to whoever it may concern.However, since i do not have the cord to download the pictures, someone will half to come see them."],"City":"Sacramento","Object Features":"Unknown","Latitude":"38.584262","Weather Factors":"Unknown","Longitude":"-121.48679","Summary":"It looked like a star, but it split in two and started to move.","Country":"United States","Object Flight Path":"Path then hovering,Other,Unknown","Date of the Event":"11/03/2009 05:07 UTC","Disposition":"Hoax","Object Shape":"Circle, Flash, Sphere, Star-like, Unknown","Case Number":"20299","map":"<A HREF = \"http://maps.google.com/maps?q=38.584262,+-121.48679(20299)&iwloc=A&hl=en\"> mufon case (20299) map </A>","files":["/var/www/straped/mufon/html2text/20299.html.txt","/var/www/straped/mufon/org/20299.html"],"Region":"California","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around November 3rd 2009"],"Source":"MUFON"}