{"Object Shape":"Star-like, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.507104,+-78.739181(20302)&iwloc=A&hl=en\"> mufon case (20302) map </A>","Log Number":"US-11042009-0002","City":"Angier","Date of the Event":"11/04/2009 01:00 UTC","Object Features":"Unknown","trends":["There have been no other sightings in Angier","This sighting has never been favorited."],"divs":["Sighting Detailsmy friend and i were outside his house in Angier, NC. we were just looking at the sky when we noticed what we thought was an unusually bright star. we watched it for a few moments when we noticed that it was slowly moving down toward the treeline. it was NOT blinking, or flashing like any conventional aircraft, so we continued to carefully watch it for about 10 minutes until it moved below the trees and out of sight. we decided to stay outside to see if we could catch another glimpse of the object. after about 5 minutes, we saw 4 black helicopters with spotlights come from behind us, moving in a large circle. just as the helicopters moved out of sight, while we were standing in the road in front of the house, a loud, high pitched, almost \"flock-of-bird-like\" sound, pass right over our heads. it sounded like it was less than 20 feet away, but due to the fact I've never heard a sound like it before, i cant judge distance acurately. after some time, we decided to head inside and with a last glance around the sky, saw a red light moving across the sky above the treeline. at first i thought it was a helicopter, but when i looked at it through the binoculars, i saw that the light was solid, not blinking, so I'm not really sure about the nature of it."],"Longitude":"-78.739181","Disposition":"Unknown","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Unknown","Source":"MUFON","Summary":"moving ball of light, followed by 5 low, circling helicopters, and a strange, LOUD noise.","Sighting Duration":"Undisclosed","Case Number":"20302","files":["/var/www/straped/mufon/html2text/20302.html.txt","/var/www/straped/mufon/org/20302.html"],"Latitude":"35.507104","Date Submitted":"11/04/2009 01:16 UTC","Country":"United States","Weather Factors":"Windy","Region":"North Carolina","Viewing Distance":"501 Feet - 1 Mile, Unknown"}