{"Object Features":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Weather Factors":"Unknown","Date of the Event":"05/31/1987 11:20 UTC","Object Flight Path":"Unknown","Log Number":"","Country":"United States","Object Shape":"Unknown","City":"Undisclosed","Date Submitted":"05/31/1987 11:20 UTC","Case Number":"2030","Source":"MUFON","Longitude":"-116.419389","Region":"Nevada","Summary":"BRIGHT LIGHT","divs":["Sighting DetailsCOUNTRYUSASTATE_PROVINCETXThe three of us were traveling N.E. along a two lane road around 2315 hrs. whenwe observed a bright light in the middle of the roadway approx.14 mileahead.Isaid to Chris,what is that His reply was,maybe its a police helicopterHe,Chris,told me to turn around.I did so. As we began to head S.W.,I told Christo look behind us because the light was now moving towards us.As i increasedspeed toward 90mph the light overtook us. The light proceeded toparallel ourcourse.Between us was a row of trees.Itold Chris that there was an opening inthe trees just ahead of us and that i was going to turn left toward this lightwhen we got to the clearing and stop the car with my brights shined on them.Whenwe got to the clearing i did turn toward the light.I then got out of the car asif to challenge the light. What seemed liked seconds later the light proceededto travel straight up until i could no longer see it.it made no sond of ascentsuch as acopter or jet would do.William asked me to get back into the car so wecould go .On our way home we stopped at a gas station to buy gas .When Chris andi walked inside the man said,you fellas are lucky.i was just about to close.ilooked at my watch which read 2320 and asked what time do you close Hhis replywas 2400 which by his wallclock was 2min. away.i asked Chris what time his watchread ,his reply was 2320 but it stopped.so when i looked back at my own watchthat is when i noticed that mine also had stopped. I HAVE INFORMATION WHICH INEED TO GET RID OF. MEMMORIES WHO DO I NEED TO TALK TO IF NOT YOU. MY FRIENDSARE NOW DEAD ..AM I NEXT 600 N.HENDERSON FT.WORTH TX. 76107COUNTYTARRANTNEAR_TOWN_OR_CITYNEWARKSITEruralSKYclearCLOUD_COVERCLOUD_COVERTOTAL_WITNESSES3MUFON_REPORTEES0WITNESS_LOCATIONgrouped"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.80261,+-116.419389(2030)&iwloc=A&hl=en\"> mufon case (2030) map </A>","files":["/var/www/straped/mufon/html2text/2030.html.txt","/var/www/straped/mufon/org/2030.html"],"Latitude":"38.80261","Tags":"City","trends":[],"Sighting Duration":"00:30:00"}