{"files":["/var/www/straped/mufon/html2text/20301.html.txt","/var/www/straped/mufon/org/20301.html"],"Date of the Event":"10/11/2009 12:00 UTC","Region":"Ontario","divs":["Sighting DetailsI was at the Loblaws Parking Lot - The Real Canadian Superstore at Oxford and Hyde Park in London Ontario Canada. I was with my husband picking up a few things for our Canadian Thanksgiving weekend before the Holiday. I was exiting the parking lot and heading to our car when I looked up into the sky and noticed a UFO object that appeared to look like a globe of orange in the sky directly to the south of the store. I have no idea what type of distance away it would have been but it was clearly not typical of an air plane as it was stationary - I felt as if it knew I noticed it. I of course pointed it out to my husband and we both just looked in awe of this object trying to make sense of it. We watched this object that was stationary for about 4-5 minutes and then all the sudden it went directly up into the sky in a matter of seconds until it was gone. I was in complete shock. I went home directly after - we live about a 4 minute drive from the store and of course went outside immediately to look at the sky more. All of the sudden there were military planes cris-crossing over our home moving very fast doing formation patterns for about an hour. The jets flew back and forth in pairs. There were two sets of pairs. These jets made no noise which for jets moving as fast as these were rather interesting considering jets generally make quite a large amount of noise. I have no doubt whatsoever that this was a UFO sighting and I must say I can't believe there was no talk about this from anyone else? If anyone saw this orange globe I would like to discuss it in more detail. London Ontario Canada"],"Case Number":"20301","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.988668,+-81.238618(20301)&iwloc=A&hl=en\"> mufon case (20301) map </A>","trends":["There have been 32 other sightings in London","There were no other sightings in London on or around October 11th 2009"],"Object Flight Path":"Undisclosed","Latitude":"42.988668","Source":"MUFON","Object Shape":"Circle, Fireball","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-81.238618","Log Number":"CA-11042009-0001","Weather Factors":"Unknown","Country":"Canada","City":"London","Summary":"Glowing Orange Ball - Over Real Canadian Superstore RCS London, Ontario, Oct. 11, 2009","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"11/04/2009 12:51 UTC"}