{"Date Submitted":"11/04/2009 12:39 UTC","Latitude":"34.146363","trends":["There have been 4 other sightings in Calabasas","There were no other sightings in Calabasas on or around November 3rd 2009"],"Weather Factors":"None","Source":"MUFON","Longitude":"-118.655463","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.146363,+-118.655463(20307)&iwloc=A&hl=en\"> mufon case (20307) map </A>","Object Features":"None","Case Number":"20307","Object Shape":"Blimp, Cigar","files":["/var/www/straped/mufon/html2text/20307.html.txt","/var/www/straped/mufon/org/20307.html"],"Date of the Event":"11/03/2009 09:15 UTC","City":"Calabasas","Summary":"stationary long thin white object hovered then disappeared leaving small blurry patch in sky","divs":["Sighting DetailsI was driving uphill (north) on Cold Canyon Road to reach Mulholland Highway. My peripheral vision caught something like an aircraft in the clear blue sky as viewed between two houses. It appeared to be stationary and not quite like an airliner. It made me think of a blimp. I lost sight of the object behind a house. Twenty seconds later I was driving west on Mulholland Highway and saw a large thin white shape like an elongated cigar hovering in the sky above the mountains. It may have been tapered at the ends. It was larger than an airliner and appeared to be stationary or moving very slowly. There were no lights or markings on the object. I continued to drive west, alternately looking at the road ahead and the object every two to three seconds. I wanted to pull over, but did not want to look away from the object for very long, so I kept driving. After about the sixth time of looking back and forth the object disappeared. I did not see it disappear. I had looked at the road for two to three seconds and when I looked back for the object, it was gone. In the object's former location I saw a small roundish patch of what looked like turbulent air, or a blurry place in the sky. From the first moment I saw the object I felt somewhat excited and very sure that it was not an ordinary aircraft. I felt somewhat mesmerized by the whole event. I have been thinking about it frequently. I am a scientist employed by the State of California."],"Country":"United States","Log Number":"US-11042009-0006","Region":"California","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Disposition":"Insufficient Data"}