{"Case Number":"20303","map":"<A HREF = \"http://maps.google.com/maps?q=38.543459,+-121.278373(20303)&iwloc=A&hl=en\"> mufon case (20303) map </A>","Object Shape":"Disc, Star-like","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"11/04/2009 05:48 UTC","Disposition":"Unknown","Weather Factors":"Unknown","Latitude":"38.543459","Log Number":"US-11042009-0003","Source":"MUFON","Longitude":"-121.278373","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been no other sightings in Mather,","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/20303.html.txt","/var/www/straped/mufon/org/20303.html"],"divs":["Sighting Details On the morning of September 17,2009 at 4:10am, I was awake again from not being able to sleep. I walked outside into my backyard to get some fresh air and stretch; it was very warm outside still being a really hot summer here in the Sacramento valley. Now, I live right next to Mather Airport, I used to be a pilot, I've worked at different airports around the area, and I've lived in this area all of my 32 years on this Earth, including when Mather airport was Mather AFB. I know airplanes and I know helicopters and I've flown both. I looked up at the stars as I often do if I can't sleep early in the morning when the stars are shining their brightest. A moving light caught my eye in the south-eastern sky. My first initial thought was, an airplane, at first glance. I live right, right next to the airport, and aircraft fly in and out constantly. But this craft was especially bright, blinking several different colors very rapidly, with kind of a disk shape with a glowing-ish ball underneath...and then it stopped moving. At this point the craft appeared to be maybe 1 or more miles away; it was 4am and no moon, lights or other objects to reference. The creepiest thing for me to admit (as chills consume me now), is when I actually looked directly at the craft, it stopped. I had the strongest feeling I was being watched during the entire encounter. The UFO never made a single sound and there were no passing aircraft for the whole sighting which lasted roughly 25-30 minutes. At first I thought I was seeing things, maybe because I was so groggy and sleepy, but the craft began to move around the south-eastern sky with rapid movements up, down, side to side, forwards, backwards, but never leaving this area of the sky. I had my cell-phone in my pocket so I called my wife outside to confirm I wasn't hallucinating. She confirmed that I wasn't nuts. She grabbed me the video camera and I recorded this object for rougly 25minutes. I was overwhelmed, shocked, mystfied... and scared mostly. Scared because my wife and I had an encounter of the 3rd kind exactly ten years earlier, in a little 400sq ft cottage (our first house), exactly five miles away, also way out in the country. We don't talk about it to this day. My wife gets very upset if I even bring it up. To this day I'm not allowed to talk about it with her. It's too long of an event to post. Now, at this time I haven't released the video to anyone and I've only shown family and close family friends. I had to use two tapes to record it, because of course with my luck the first tape ran out after about 10 min. The second tape has some \"night shot\" footage and some flashlight-light shining on the trees that gives perspective on the depth of feild in relation to the object; but the end of the first tape has the most dramatic shots of the object moving all over the sky in a fast dance of movements, almost as if it heard me egging it on to \"move\" more for video. I was having a difficult time keeping the object in frame, focused, or just not bouncing around by my body movements, so I held the camera perfectly still and thats when it's movements went bizerk, so you can really see it's radical direction changing. The object never really \"flew\" away, or left, but seemed to (please don't think i'm crazy) move in front of a star and I guess become invisible or something...I don't know. I do know that everyone I show the video to is shocked and dumbfounded by what they see. I would like to share this video, but not over the internet. I'm already nervous not knowing what could happen if I send this information. I'm not nuts, crazy, loony, whacko or paranoid, just wigged out by these events maybe even traumatized. So now what....whats next."],"Object Features":"Unknown","Region":"California","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Summary":"Very bright, flashing multi-colored lights on body, glowing ball-like bottom light thingy, moving all over the sky very fast stop/turns","Date of the Event":"09/17/2009 04:15 UTC","City":"Mather,"}