{"Tags":"City","Summary":"large triangular formation- 3 separate craft in perfect triangle formation","Region":"Nova Scotia","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Country":"Canada","divs":["Sighting DetailsMy girlfriend and I traveled to Cape Breton in the winter of 2008 to visit my ailing grandfather, in Nova Scotia, Canada. He had been suffering from serious dementia, so it prevented us ever seeing him this particular weekend. In order to make the best of our time, we decided to do some snowboarding, hiking, and a bit sightseeing. On our way home from the Membertou reservation in Sydney late one night, rather, early in the morning, maybe 2am, we were traveling on the TransCanada Highway just outside of Ross Ferry and as my girlfriend was driving I per-chanced to notice a massive triangular formation of what looked like three stars all moving in unison across the entire expanse of sky. From one side of the horizon to the other. I can't tell you from what direction it came or where it traveled to since the area was a little unfamiliar to me. I originally thought that this was some kind of team, in formation, perhaps a team of satellites flying in formation on some kind of joint space mission, as I've seen satellites before but these were significantly brighter than satellites. I had also never heard of a fleet of satellites flying together like this and I try and pay attention to science news. My second thought was that this was some sort of massive solid object, but couldn't confirm this as it was difficult to see whether stars could be seen passing behind the formation in the moving car. Unfortunately my girlfriend can't corroborate my sighting, as she never did see the formation, but can corroborate the event taking place. I got her eventually pull the car over for her to witness this amazing sight but by that time, whatever it was that I had seen had already disappeared over the horizon. Then today, as I checked the updates from your newsletter and watched the footage of the triangular UFO seen in Michigan I was dumbfounded because this object, or rather objects (?) was (were) identical to the one that I had seen! It seemed to be the same size in reference to passing stars and in the identical type of configuration with one star seeming to slightly off making it more of an isosceles triangle rather than an equilateral triangle. It was so comforting to to know that this event was actually documented by someone, AND IN VIDEO. Brilliant video I may add! This was not the first time I had witnessed strange sky anomalies but rather one of many that I have been lucky enough to have witnessed over the course of my life. My first also taking place in Cape Breton when I was twelve with my father and sister on a sunset fishing trip. My most recent sighting, however has been my most impressive, in Newfoundland, Canada, (another Canadian island...interesting...) this past summer in Gros Morne National Park, which my girlfriend was also witness too. There was similar sighting mentioned by a listener who wrote in to you, describing it's exit as being like the 'star trek warp drive'. But that's another story however. Love the program, keep up the good work. Can't wait for the next episode."],"Date Submitted":"11/04/2009 09:08 UTC","Longitude":"-60.186024","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"02/10/2007 12:00 UTC","Source":"MUFON","Latitude":"46.1388","files":["/var/www/straped/mufon/html2text/20316.html.txt","/var/www/straped/mufon/org/20316.html"],"Disposition":"Unresolved","Log Number":"CA-11042009-0016","Object Features":"Unknown","Object Shape":"Triangle","City":"Sydney","map":"<A HREF = \"http://maps.google.com/maps?q=46.1388,+-60.186024(20316)&iwloc=A&hl=en\"> mufon case (20316) map </A>","trends":["There have been 11 other sightings in Sydney","There were no other sightings in Sydney on or around February 10th 2007"],"Sighting Duration":"Undisclosed","Case Number":"20316"}