{"Object Shape":"Other","Date of the Event":"11/02/2009 01:23 UTC","Log Number":"US-11042009-0015","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Latitude":"26.930874","files":["/var/www/straped/mufon/html2text/20315.html.txt","/var/www/straped/mufon/org/20315.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Disposition":"Insufficient Data","City":"Punta Gorda","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.930874,+-82.041946(20315)&iwloc=A&hl=en\"> mufon case (20315) map </A>","Longitude":"-82.041946","Summary":"Witnessed possible alien being and witnessed unexplained light formation.","divs":["Sighting DetailsThis report is being transposed by Morgan Beall (MUFON Investigator) direct from witness at his residence. 9-9-2009 Witnessed two pairs of lights near my back yard in empty lots that are wooded. The lights seemed to dance and moved between trees and brush. Once I stepped out they both pointed directly at me as if the lights were mounted on a helmet or head. The lights were amber in color and round. 10-25-2009 9:30pm Witnessed strange lights moving through wooded areas near my residence moving in and out of the tree coverage. Sighting lasted about a minute. Video was taken of this event. One light was due west about 300 yards from my property. 10-29-2009 Noticed strange lights in the sky, East horizon. The first light traveled in from the sky at about a 45 degree angle and stopped suddenly. About a minute later a second light streaked in from the south and also stopped suddenly. At about this time I started taping the event. About 2 to 3 minutes later the third light came in from the north and streaked in is 3 separate busts of speed. Once all three lights were in a triangle formation they seemed to instantly inch towards the middle of the formation as if it \"docked\". The Formation of lights then slowly started to drift down towards the ground. The formation of lights then seemed to quickly shift a few degrees instantly. A second witness my wife witnessed this and quickly went back into the house. At this point I could hear a helicopter approaching from the south. The Helicopter seemed to approach the formation of lights and or between me and the lights. The helicopter also flew directly over my house and circled the house after I pointed the camcorder at it with its IR light on about three times. The Objects eventually went up slowly and started to separate and disappeared over a long period of time. The helicopter returned the next night but flew in one direction. 11-3-2009 About 1:25sm in the morning we heard noses in the back yard. Sun in Law and myself went to the backyard. We could hear noises and braches braking. My sun in law pointed his light in the shrubs and we saw what looked like a pal white skin arm grasping a branch. It seemed to duck the light and hide but we should still see the hand and part of the arm. We froze and went into a sort of shock and returned to the house quickly returned to the house and did not go back outside. The hand seemed to have a total of 4 digits, 3 fingers and one thumb the center finger was longer the other two fingers. The skin was pale gray."],"Source":"MUFON","trends":["There have been 10 other sightings in Punta Gorda","There were no other sightings in Punta Gorda on or around November 2nd 2009"],"Case Number":"20315","Sighting Duration":"Undisclosed","Date Submitted":"11/04/2009 09:01 UTC"}