{"Region":"Wisconsin","Object Features":"Undisclosed","trends":["There have been 4 other sightings in Superior","There were no other sightings in Superior on or around July 9th 2008"],"Longitude":"-92.09789","divs":["Sighting Detailsan evening after fishing all day,cooking,a few beers.sun down pretty clouds. close to nitefall.saw somthing from left of lake.followed it to us.about 20 feet above us.200 yards out.shocking part was the speed.estemit 15 to 18 mph. not enough for any.air plane to have lift. ive built radiocontroled planes since kid.40 years. if you held a flatblack book and held it out lengthwise,that was shape. it had 4 lites that pointed downward.2 bright white and 2 red. cant rember which was in front or back.i understand about military drones and stuff were not supposed to know about. it may have been one. but what kind of gravitational lift system could it have.ive seen many of your shows and have always been interested in this .but have never seen anything untill this event.i promise you if you ever contacted the other people with me, they would tell you the same facts.the only thing different from our sighting rather than what ive seen on your show, is that it did have a sound.as it passed buy and we were behind the tail or flatspot,it did have sound of very muffled somewhat quiet sound of a fan. almost like a smallshopvac.with the high freaquency,top end muffled down..im not trying to be on your show. but this has completly changed my life.hope its a stealth.drone.if you hear anything that resembles my story.could you please let me know. dave aldrich."],"Summary":"7 people in evening on lake with cliffs. Just relaxing. Looking out over lake.","Weather Factors":"Unknown","Log Number":"US-11042009-0017","Tags":"City","Case Number":"20317","map":"<A HREF = \"http://maps.google.com/maps?q=46.720631,+-92.09789(20317)&iwloc=A&hl=en\"> mufon case (20317) map </A>","City":"Superior","Disposition":"Unknown","Sighting Duration":"00:02:00","Latitude":"46.720631","files":["/var/www/straped/mufon/html2text/20317.html.txt","/var/www/straped/mufon/org/20317.html"],"Country":"United States","Viewing Distance":"Unknown","Object Shape":"Square, Rectagular","Source":"MUFON","Object Flight Path":"Undisclosed","Date Submitted":"11/04/2009 10:54 UTC","Date of the Event":"07/09/2008 12:00 UTC"}