{"map":"<A HREF = \"http://maps.google.com/maps?q=40.138999,+-79.860992(20310)&iwloc=A&hl=en\"> mufon case (20310) map </A>","City":"North Belle Vernon","Disposition":"IFO","Weather Factors":"None","Summary":"I've been seeing stationary orbs but this time it tricked me and moved","trends":["There have been 6 other sightings in North Belle Vernon","There were no other sightings in North Belle Vernon on or around November 3rd 2009"],"Case Number":"20310","files":["/var/www/straped/mufon/html2text/20310.html.txt","/var/www/straped/mufon/org/20310.html"],"Date Submitted":"11/04/2009 01:21 UTC","Source":"MUFON","Country":"United States","Longitude":"-79.860992","Date of the Event":"11/03/2009 10:15 UTC","Tags":"City","Object Flight Path":"Hovering then path","Viewing Distance":"Over One Mile","Sighting Duration":"00:01:00","Object Shape":"Circle, Star-like","divs":["sighting detailsas i mentioned in a previous entry i enjoy star gazing, the other night was one i will never forget. also i have mentioned that i have been seeing large stationary orb\\circle shaped lights about the size of an aspirin in the night sky. these have been just fading out, and i have been seeing things out of the corner of my eye but when i turn they're gone. well last night i found out why, i was looking at a group of 3 stars in a triangle shape, it stood out to me because of how perfectly even it was. i looked away for a second and when i came back to the stars one of them was moving away slowly from the other 2. after about 5 seconds it flared up like the lights i have been seeing then just disappeared again. there is no way this was an airplane or helicopter or satellite, it was with the other stars for a good while, perfectly still then moved away in a direction away from the direction of the stars rotation which from my point is left to right on an upward motion in the sky, from 7 o'clock to 1 o'clock approx. this is the same fade out i have described before. on oct 30 there was also a sighting but this time there was a vapor trail after it disappeared. the trail appeared instantly across the sky when the object had totally faded out, the weird thing about this trail was it evaporated all at the same time, not like normal ones do, which fade out from the oldest point first, it disappeared all at once after several minutes. this was easy to see on a clear night with nearly a full moon. the night of the 3rd had a full moon and was clear as well."],"Object Features":"Unknown","Latitude":"40.138999","Region":"Pennsylvania","Log Number":"US-11042009-0009"}