{"divs":["Sighting DetailsI had been planning to have a bonfire in a field behind a barn behind our rural house, for my three kids. Last night was a good night to do it: little or no wind, a bright moon to the east, and relatively dry conditions. After a late dinner ended around 7:20 pm, I got my three kids, aged 7, 4 and 2, all bundled up (temp was around 37 degrees), and drove my Jeep out to the spot. I had the tailgate lifted up and a quilt set for them to watch me start our bonfire, a thirty-foot long accumulation of branches and leaves from the year. I routinely tell my son of my UFO and MIB research, and at his urging, occasionally tell him UFO stories at bedtime. BTW: Other than an unusual red flare some years ago and numerous meteors (and one demonstrable hoax this past 4th of July), I have never seen a UFO before, and have never reported one. As the kids piled out of the Jeep, unwilling to wait in its relative warmth before the fire got going, I happened to say to my son, \"Wouldn't it be great if tonight was the night we finally saw a UFO?\" We inspected the sky to the south and southwest, where the open fields provided an unobstructed view. Jupiter was clearly visible, and with the moon to the east and barely over the barn, it did little to interfere with the stars to the south. My son pointed out a series of flashing lights high in the sky heading west-southwest, and asked if that was a UFO. I assured him it was a normal commercial plane. But then, directly due south, we both spotted a strong stationary light, whitish-orange in color, at least twice the brilliance or more of Jupiter and twice as big, seemingly hanging above a distant treeline a mile or so away. It had no accompanying flashing lights, and I would have taken it for the spotlight of a helicopter if it had been paired with navigation lights. Measuring with my arm extended, it was exactly one finger width above the treeline, but other than the brightness and its color (whitish-orange, almost like a sodium-vapor street light), there was no way to discern a shape nor its distance. It could have been right above the trees, or it could have been a dozen miles away. We both watched it for a minute or more, and realized it was not moving at all, neither left-right nor up and down. I had to attend to my other two children, and instructed my son to keep watching it. I marked the spot where we were watching (near two large tree stumps), and moved east to light the bonfire. My son reported a few moments later that it was still there, and that he thought it may have moved from right to left a small amount (heading east), but was still just as bright. I took about a minute or two to lite the fire and then turned to look where he had indicated, but the light had vanished. He turned to look south again and was amazed. He'd just turned for a few seconds to watch me, and then looked back and the light was gone. We watched the area and waited for a few more minutes, but there was no additional sighting of the light. The time from when we first noticed the light to when my son lost sight of it may have been as long as five minutes or as short as three minutes. I am CERTAIN it was not a commercial aircraft (too low on the horizon), nor was it a planet or star. And the lack of any navigation or blinking lights indicated it was not likely a helicopter. There was no sound. Time of sighting was between 7:45 pm and 8:00 pm. We were a little disappointed that it had left so soon, but were also a little excited that it was a possible unexplained event. When my wife joined us in the field with marshmallows a few minutes later, my son enthusiastically explained the event to her, but in a detailed and unhurried manner. The arrival of the marshmallows and the quick buildup of the bonfire soon diverted our attention. Note: We live less than a mile from a few industrial strip-mall type buildings, but none use sodium vapor lamps, and they all lie to the southwest and further west of that. There are no industrial areas to our south, nor any streetlights of any kind, for well over ten miles. Nor are there any north-south roads that could account for the lights as being reflected headlights as vehicles travel uphill, and the roads around here are relatively flat for long stretches anyway. Note also, I've previously explained to my son the methods for determining the size and direction of any UFO he was ever lucky enough to spot, using his fingers and hands as measuring devices with his arm fully extended, to note the exact spot where he was standing and any identifiable trees or buildings to mark what direction the sighting occurred. His calm and attentive watching of the light made me happy he'd learned this well. I understand that distant, undefinable lights don't make for a very interesting sighting, but I'm also aware that even a simple sighting such as this can help corroborate an event in a nearby location, such as Albion, Indiana (a few miles to our southwest), or Fort Wayne (around 30 miles to the south). Another sighting could allow this one to be used to triangulate more accurately where such an event may have occurred. Keep watching the skies!"],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/20318.html.txt","/var/www/straped/mufon/org/20318.html"],"Case Number":"20318","Longitude":"-85.263855","Weather Factors":"None","Object Flight Path":"Hovering then path","Summary":"Unusually bright light low in the south, suddenly vanished","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.450798,+-85.263855(20318)&iwloc=A&hl=en\"> mufon case (20318) map </A>","City":"Kendallville","Object Features":"None","Object Shape":"Star-like","Disposition":"Unknown","Source":"MUFON","trends":["There have been 2 other sightings in Kendallville","There were no other sightings in Kendallville on or around November 3rd 2009","This sighting has never been favorited.",""],"Log Number":"US-11042009-0018","Date of the Event":"11/03/2009 07:55 UTC","Latitude":"41.450798","Country":"United States","Date Submitted":"11/04/2009 11:18 UTC","Tags":"City","Region":"Indiana"}