{"Object Shape":"Disc","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around October 18th 2009","This sighting has never been favorited.",""],"Case Number":"20329","Source":"MUFON","Disposition":"Unresolved","Summary":"Witnessed thee silver disc-shaped objects floating southwest, became stationary in sky about three minutes, ascended into clouds until no longer visible. Also drifted apart as ascended.","Tags":"City","Country":"United States","Latitude":"41.881414","Date Submitted":"11/05/2009 08:08 UTC","Region":"Illinois","Sighting Duration":"Undisclosed","Longitude":"-87.625308","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=41.881414,+-87.625308(20329)&iwloc=A&hl=en\"> mufon case (20329) map </A>","files":["/var/www/straped/mufon/html2text/20329.html.txt","/var/www/straped/mufon/org/20329.html"],"Object Flight Path":"Stationary,Path then hovering","divs":["Sighting DetailsI was at home watching the areplanes come in, Chicago has a lot of air traffic. I noticed objects much smaller than planes and disc shape, silver floating in the sky which distracted me. They were floating slowly in a south western direction for a few minutes since noticing them, suddenly they came to a halt and hovered stationary for about three minutes before ascending into the sky in the direction from which they came until they dissapeared. One other thing to note. I stood in my room with a very careful eye on these things so to see as much of them as i could possibly see and i noticed that as they ascended into the sky one (the one on the far left of my video) drifted away from the other two to the north. This was witnessed in the uptown neighborhood of Chicago and the objects were directly over Montrose Beach at what seemed like approximatel 2,000 ft in the air. I suspected hang gliders and i suspected balloons neither of those could explain the behaivor of these objects to my knowledge. I felt excited and extremely curious about these objects because there is little evidence to suggest normalcy. When they were too small for my eyes to detect, may have gone beyon the cloud line."],"Object Features":"Unknown","Date of the Event":"10/18/2009 02:00 UTC","City":"Chicago","Log Number":"US-11052009-0011"}