{"divs":["Sighting DetailsI was on my way home from work going west on the Route 30 bypass near the Downingtown, Pennsylvania Route 282 exit, when I saw a speck of light in the top of my windshield directly over my car heading due west. At first I thought it was a shooting star, then realized quickly that the sky was covered by a low, dark cloud deck so it couldn't possibly be a meteor. The object was heading due west at the most amazingly fast speed, made a sharp right turn as it neared the horizon, and disappeared over the NW horizon in less than 10 seconds from the time I first saw it. It was very low in the sky and obviously below the cloud deck, I would estimate at around 1 - 2 thousand feet up. The area over Route 30 is an approach path for airplanes to the Philadelphia International Airport, so there are always planes in the sky, both approaching and leaving Philly airspace. There is also a Keystone helicopter operation about 10 miles further west on Route 30, so there are very often helicopters in the airspace also. I could see both airplanes and a helicopter in the air at the same time I spotted the object. It was most definitely something else. I've never seen anything move that fast in the sky, it was amazing. I would like to know if anyone else saw and reported it."],"Log Number":"US-11052009-0005","Latitude":"40.015736","City":"Downingtown","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","trends":["There have been 8 other sightings in Downingtown","There were no other sightings in Downingtown on or around November 4th 2009"],"Object Shape":"Star-like","Longitude":"-75.695824","map":"<A HREF = \"http://maps.google.com/maps?q=40.015736,+-75.695824(20323)&iwloc=A&hl=en\"> mufon case (20323) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/20323.html.txt","/var/www/straped/mufon/org/20323.html"],"Object Features":"Unknown","Case Number":"20323","Date of the Event":"11/04/2009 05:30 UTC","Object Flight Path":"Path with directional change","Weather Factors":"None","Sighting Duration":"Undisclosed","Date Submitted":"11/05/2009 10:21 UTC","Summary":"Streaking star-like object over road out of sight over horizon in less than 10 seconds","Disposition":"Unknown","Region":"Pennsylvania"}