{"Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Unknown","Longitude":"-89.287284","Source":"MUFON","Case Number":"20325","Log Number":"US-11052009-0007","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Latitude":"31.979042","Summary":"Bronze colored object streaked across sky from northwest to southeast.","trends":["There have been no other sightings in Bay Springs","This sighting has never been favorited."],"divs":["Sighting Details I was in my front yard working on my tree stand and playing with my dog.The dog is a black lab and loves to chase after low-flying birds.I had been pointing out tree top level birds to her as they flew overhead when I saw what at first I thought was a hawk diving after a mouse or squirrel.The object was at approximately 45 degrees when I first saw it,and I watched it until it faded into the distance at about the same elevation in the opposite direction.There was no fireball, no trail behind it, and no sound. I waited for several minutes expecting to hear a sonic boom and also trying to understand what I had just seen. It was bronze in color with a lighter gold or copper in the center. It was visible through a 90 degree sector of the sky and was about 20 degrees north east from straight overhead from my position.It covered the entire distance in about two or three seconds.Hold a quarter-inch bead at arms length and that is the size it appeared in the sky. Afterwards, maybe five minutes or so, it finally soaked-in that either I had witnessed a very close call with an apparently large meteor, or I had actually seen a UFO. I was excited afterwards and since my wife was at work, I talked with my mother and sister about it."],"Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Bay Springs","Region":"Mississippi","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.979042,+-89.287284(20325)&iwloc=A&hl=en\"> mufon case (20325) map </A>","files":["/var/www/straped/mufon/html2text/20325.html.txt","/var/www/straped/mufon/org/20325.html"],"Object Shape":"Disc, Sphere","Date Submitted":"11/05/2009 04:04 UTC","Date of the Event":"11/01/2009 12:00 UTC"}