{"Sighting Duration":"00:05:10","Date Submitted":"11/05/2009 11:10 UTC","City":"Cincinnati","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/20324.html.txt","/var/www/straped/mufon/org/20324.html"],"Region":"Ohio","divs":["Sighting DetailsIt was around 11:30 pm on September 26 2009,approximate date, and me and my friend went out to the front to have a smoke. My friends house sits on a hill so we can clearly see downtown from where we were. We walked down the street a little bit to light the cig,didnt want mom to know we were smoking, i looked up on the clear night sky and very clearly we could both see 5 fireball sphere shaped objects just dancing in the clear night sky. They were trailing each other like staying in a curvy line moving all around the sky. Suddenly a one fireballs light just cut off which made it 4, and then another,and then another. They all cut off one by one until they were all gone. About 10 seconds after they all cut off they all popped back on at the same time until they all joined into 1 small fireball, I dont know how, and just suddenly raised altitude very very quickly until i couldnt see it again. Im a believer so i automatically thought that they were UFO's. During the sighting all I could do was watch in awe because it was my first time seeing a UFO,actually 5. Thats more then people see in a lifetime and i saw it in 5 minutes.Incredible!"],"Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","Summary":"5 fireball shaped objects dancing in the sky.","Latitude":"39.109788","Object Shape":"Fireball, Sphere","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around September 26th 2009"],"Date of the Event":"09/26/2009 11:30 UTC","Case Number":"20324","Country":"United States","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.109788,+-84.50637(20324)&iwloc=A&hl=en\"> mufon case (20324) map </A>","Weather Factors":"None","Source":"MUFON","Log Number":"US-11052009-0006","Viewing Distance":"101-500 Feet","Longitude":"-84.50637"}