{"City":"Santa Barbara","trends":["There have been 20 other sightings in Santa Barbara","There were no other sightings in Santa Barbara on or around November 2nd 2009"],"Log Number":"US-11052009-0002","Source":"MUFON","Date Submitted":"11/05/2009 03:04 UTC","Weather Factors":"None, Hail","Object Flight Path":"Straight-line path","Longitude":"-119.69394","Latitude":"34.4253","map":"<A HREF = \"http://maps.google.com/maps?q=34.4253,+-119.69394(20320)&iwloc=A&hl=en\"> mufon case (20320) map </A>","Sighting Duration":"Undisclosed","Summary":"aircraft East to West, 2 red synchronous flashing wing lights (front), 3 big white lights rear in a row, silent, flew directly overhead, appeared to be unknown aircraft type","Region":"California","files":["/var/www/straped/mufon/html2text/20320.html.txt","/var/www/straped/mufon/org/20320.html"],"Date of the Event":"11/02/2009 11:30 UTC","Case Number":"20320","Object Shape":"Triangle","Tags":"City","Disposition":"IFO","divs":["sighting detailsi was watching tv and heard a loud aircraft overhead at aprox. 11:25pm on nov. 2, 2009. for my neighborhood, this was an unusual flight path so i got up and went outside on my deck to check it out. it was a medium size airplane heading towards santa barbara airport (ne to w\\sw) i then turned around to look east and saw several small planes with typical blinking lights, and then saw one with two bright red lights blinking simultaneously coming in a straight line on a path that would fly over my house. the time was approx. 11:27pm. i went inside for 5 seconds and picked up my field glasses and returned to the deck, getting the aircraft into my field of vision. i followed it as it went over my house, thinking that this configuration of simultaneous double red blinking lights was atypical for standard planes at night. it was not very high in the sky going over my house and it appeared to be of an airplane silhouette in the front half. i couldn't make out any silhouette of the tail section. as it traveled west, i looked at the back of the craft. it had three big unblinking white lights, larger than any i have ever seen on an aircraft. the lights gave the impression that the back of the craft was flat (which may be why i couldn't pick it out in silhouette overhead) and overall shape of the craft might be triangular. the body was dark and blended in with the background of the night sky. i remember listening for sound. it was running silent. it was not flying particularly fast and it held a straight course. i lost sight of the craft as it went past the hill behind my house about 11:30pm. my feeling was this was an atypical aircraft of unusual design and mechanics. i have never seen anything like it before. i tried to research this as a prototype plane or something currently flying in our skies, but have come up empty. if you know what this is, please let me know!"],"Country":"United States","Object Features":"Wings","Viewing Distance":"501 Feet - 1 Mile"}