{"Log Number":"US-11052009-0012","Case Number":"20330","divs":["Sighting DetailsMy wife and I were driving around talking with my two year old and 4 year old in the back of our jeep as we approached our road on 300S. I drove past on 900E so we could talk a little more and the kids could wind down. I drove approach a quarter mile south east of my home and suddenly I saw out of the corner of my left eye something large and bright. I have been thinking hard about this for a while and I guess it was so unusually that my first thought was to stop. I slammed on the brakes pretty hard enough that my boys were pretty upset. I said something to my wife like \"are you seeing this\" and see responded. That she was! What we saw was high in the air and a straight line of several large bright amber lights. This span was so large that I just knew there was absolutely no way I was looking at a plane. In fact there were planes in the sky flying at a much higher altitude due south probably from louisville airport and they look nothing like this. I would estimate the view of this object at the size of a football field in length. We slowly drove forward and after about a minute it was gone. I drove to the end of the half mile road turned around and kept my eye on the sky the whole time and never saw it again. It did not fade away it was there on sec and gone the next? As soon as it was gone I said to my wife \"Is that not the strangest thing you have ever seen\" and see confirmed it was unusual. I really can't figure out what this could be we did have some military aircraft flying low about a month ago, but unless they were flying low and in a line and then shut the lights off I cant explain it. The aircraft we have had are osprey's or some variation I think.. The Osprey's are rather loud, we had the radio on so I couldn't hear anything. I have not seen any of these flying in at least a month though as training has slowed down. Also as intent as I was watching I am pretty sure I would have made out the blinking lights. Whatever we saw as either a massive illusion of several lights we thought were possibly one object or something very large. As soon as I got home I watched this section of the sky and for a few more minutes saw a lot of activity of aircraft and glimmers but nothing like what we saw before. I have lived hear for 9 years and watched the sky often and there is just nothing in the sky like what we saw. I tried to rule out barn lights or radio towers but there is really nothing in that section of the sky?"],"files":["/var/www/straped/mufon/html2text/20330.html.txt","/var/www/straped/mufon/org/20330.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.20399,+-85.91585(20330)&iwloc=A&hl=en\"> mufon case (20330) map </A>","trends":["There have been 14 other sightings in Columbus","There were no other sightings in Columbus on or around November 5th 2009"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Several bright low lights in straight line suddenly vanished","Longitude":"-85.91585","Object Shape":"Oval","Source":"MUFON","Latitude":"39.20399","Tags":"City","Region":"Indiana","Date of the Event":"11/05/2009 08:10 UTC","Sighting Duration":"Undisclosed","Disposition":"IFO","Date Submitted":"11/05/2009 10:02 UTC","City":"Columbus","Country":"United States"}