{"divs":["Sighting DetailsMonday night, November 2nd, 2009; about 6:30 pm. Got to work (I'm a firefighter at a local Helicopter facility and was standing by for their Night Vision Goggle training) and as soon as I stepped out of the truck, I looked up at the sky. It was a clear, beautiful night, full moon, no clouds, not very dark, but enough dusk as to where I could easily see the brighter stars. One particularly caught my eye, and I said to my friend, Wes, \"Hey man, look how bright this star is!\" Wes looked and was just as amazed as I was at it's brightness. All of a sudden, it drastically dimmed. It went from the brightest object in the sky, to a pin point; but we could still see it. It was very high in altitude. As soon as it dimmed, it very quickly traveled North for approximately 10-15 seconds, then, without stopping or turning around, went due South for the same amount of time and then vanished. When we saw the object at it's brightest, it was stationary; I had noticed it for about 30 seconds before my friend, Wes, had. It did not move until it dimmed. Then went North, South, and poof, gone. I'm very curious as to what this is. I do not think it was a star, nor a man-made object. In my opinion, this was an intelligent aircraft that us humans could not possibly create. I've never seen anything move like that. Thanks, Jeremy P."],"trends":["There have been 5 other sightings in Justin","There were no other sightings in Justin on or around November 2nd 2009"],"Sighting Duration":"00:00:30","Object Shape":"Circle, Sphere, Star-like","Log Number":"US-11052009-0013","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Viewing Distance":"Over One Mile","Country":"United States","Region":"Texas","Object Features":"Unknown","Source":"MUFON","Summary":"Brightest Star in sky. immediately and rapidly faded upon seeing. moved North then South","Weather Factors":"None, Does Not Apply","Latitude":"33.089164","City":"Justin","files":["/var/www/straped/mufon/html2text/20331.html.txt","/var/www/straped/mufon/org/20331.html"],"Tags":"City","Case Number":"20331","Date of the Event":"11/02/2009 06:30 UTC","Longitude":"-97.295009","map":"<A HREF = \"http://maps.google.com/maps?q=33.089164,+-97.295009(20331)&iwloc=A&hl=en\"> mufon case (20331) map </A>","Disposition":"IFO","Date Submitted":"11/05/2009 10:23 UTC"}