{"Weather Factors":"Windy, Fog","Disposition":"IFO","Latitude":"33.950696","Date Submitted":"11/06/2009 01:19 UTC","Object Features":"Dome","Country":"United States","City":"Moreno Valley","Viewing Distance":"20 Feet or Less","Case Number":"20334","map":"<A HREF = \"http://maps.google.com/maps?q=33.950696,+-117.222762(20334)&iwloc=A&hl=en\"> mufon case (20334) map </A>","Date of the Event":"11/05/2009 09:07 UTC","Log Number":"US-11062009-0002","Object Shape":"Blimp, Circle, Egg, Fireball, Oval, Sphere, Star-like","Region":"California","files":["/var/www/straped/mufon/html2text/20334.html.txt","/var/www/straped/mufon/org/20334.html"],"Source":"MUFON","Summary":"An object being too low in the ground with a bright light going up and spliting in half","divs":["Sighting DetailsIt was 9 o'clock i just left my girlfriend house she lives in Moreno Beach. As i was driving down Moreno Beach i was looking straight ahead but a bright yellow and orange sphere caught my attention, there was a truck there i thought that person is working on the electricity pole but it was odd to know that the object was going higher and higher but slowly the object was in the street of Moreno Beach and Alessandro right in the corner as i pass driving i thought to my self that person was not working on no pole so i stop the car and i look at the object still going up. The the most interesting thing happen it split in half making two yellow and orange sphere i saw a car where i first saw the object near the ground and i saw people looking at it too i drove to them while still trying not to loose the flying objects. i ask a male african american \"what was that.\" he said\" i don't know \" thats when i knew it was a UFO as i park my car in front of his jeep i stop the car and look at it and there were both going two diffrent locations one going to Perris and the other towards the riverside mountain. *when i first look at the object i though it was just a ordinary light helping some one to see but it was not . *The object was bright yellow and orange going at a speed of 5 miles an hour or less but it was slow to go up in the sky . the object then splits in half and make two object going two diffrent places i must say that the object going to Riverside mountain had something coming out as sparks and fade away. *i lose sight of the object by leave the area"],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in Moreno Valley","There were no other sightings in Moreno Valley on or around November 5th 2009"],"Longitude":"-117.222762","Tags":"City"}