{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20336.html.txt","/var/www/straped/mufon/org/20336.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.009965,+-82.045712(20336)&iwloc=A&hl=en\"> mufon case (20336) map </A>","Longitude":"-82.045712","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Date of the Event":"11/06/2009 06:30 UTC","Object Features":"Undisclosed","Case Number":"20336","Object Shape":"Sphere","Source":"MUFON","City":"Middleport","divs":["Sighting Detailsstanding on sidewalk in middleport talking with my mother and a friend of ours she graduated highschool with. i was listening to them chat and staring at the sky and all that was in it because thats what i love doing. it was dark and VERY clear. as i was looking up i seen the sphere traveling across the sky and said hey look. my mother of 53 seen it, our friend of the same age seen it( he wears glasses), and i seen it. there was also a commercial jet in the air at the same time we all compared it to. i have to say there was no comparison at all. it wasnt a satellite as my mother and our friend would not have been able to see it... i look for anything flying in the sky because im an aviation nut. i felt excited that i wasnt the only witness as i see these things almost nightly from my porch. my mother kept asking what this object was and i kept telling her i could tell her what it wasnt. anyways we lost sight once it got to far away to see. we started all chatting again...i looked up and another was crossing the sky in an entirely different direction. they both witnessed it along with me as well. i wish i knew what they were. i see them all the time, including the night before this."],"trends":["There have been 4 other sightings in Middleport","There were no other sightings in Middleport on or around November 6th 2009"],"Latitude":"39.009965","Region":"Ohio","Log Number":"US-11062009-0003","Summary":"bright white sphere's seen by mother, myself, and mutual friend.","Tags":"City","Date Submitted":"11/06/2009 01:38 UTC","Disposition":"Insufficient Data"}