{"map":"<A HREF = \"http://maps.google.com/maps?q=43.104228,+-77.884454(20339)&iwloc=A&hl=en\"> mufon case (20339) map </A>","Source":"MUFON","Date Submitted":"11/06/2009 10:13 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20339.html.txt","/var/www/straped/mufon/org/20339.html"],"Region":"New York","Weather Factors":"Does Not Apply","Longitude":"-77.884454","Object Shape":"Oval, Unknown","Object Features":"Undisclosed","Latitude":"43.104228","City":"Churchville","Tags":"City","Object Flight Path":"Undisclosed","Country":"United States","Summary":"Oval craft.","Sighting Duration":"Undisclosed","divs":["Sighting Details I would like if u could report it I would appreciate it. The address is 260 Harmon R.d. Churchville, NY 14428. It happened at my parents farm where I grew up. I am 31 now but was 10 at the time in 1988. I saw it in December 8th at roughly 8pm. My dad and I were walking up the road from the barn where we did chores (fed animals) which is about 100 to 150 yds from my parents. We were on the road almost to our driveway about 10 yds when my dad said he had to check on cows. So he left and then about 1min to 2 min later I saw a neon orange oval craft rise from what appeared to be the gully which is on top of a hill across from my parents approx 200 yds away. It rose from gully due south n then came north in about 3 seconds to hovering approx 3 to 4 ft above road. It took up virtually whole road. I would estimate 20 to 25 ft wide and 10 ft tall. It had an orange gaseous aura that enveloped over an apparent solid structure. Thru center of craft it had glasslike round window portholes like that of a cruiseship that couldn't c thru. It. Hovered without noise for 3 to 4 min n then shot off thru two trees in a southwesterly direction n vanished several seconds later. I was about 15 ft from craft. I ran in as fast as I could to tell my parents after it was gone. Several days later I was poked in the side by something that felt like a long finger next to bed by the window.. My room was dark n I could not c what it was bc had sleeping bag zipped to top bc scared at nite after sighting. I had dream I tried to yell for parents but couldn't get words out n felt paralyzed n remember dream about running from giant ufo and jumping into window with several other teenagers. Several yrs later in bout 97 saw multi colored lights in woods across from farm on relatives land green red yellow white while driving about 40 yds away. The latest paranormal exp was last hunting season in woods on land we have 3 mi from farm .Saw what I can only describe as little person 3 ft tall with white skin black almond native or asian lookin eyes but bigger without whites of eyes just black wearin camo hat like us. It had a small nose n thin lips My dad n buddys backs were turned but I saw it bc I was facing it. It looked like a hybrid mix . I have had a few more exp n many happened after saw ufo but some happened up to last nov when saw lil person"],"Log Number":"US-11062009-0006","Case Number":"20339","trends":["There has been one other sighting in Churchville","There were no other sightings in Churchville on or around December 8th 1988"],"Disposition":"Unknown","Date of the Event":"12/08/1988 08:00 UTC"}