{"Summary":"V shaped, black with a light at each point.","City":"Forest Grove","Latitude":"45.519836","Source":"MUFON","Object Shape":"Boomerang","divs":["sighting detailsi was driving down hwy 26 going west bound after work around 7:45pm. i got close to my exit north plains\\cornelius and i noticed this ball of light in the distance. at first i thought it was a helicopter which i see many times when i'm coming home at night. as i got closer i thought it might be a star, i wasn't sure. many times i see this ball of light and as i get closer i see it's a helicopter using search lights traffic reporting for the local news. i took the exit and continued to watch this ball of light as i waited for the stop light to change. as the light got closer it split into two lights parallel to each other. i continued to watch it and as it got closer the lights became three. i watched the lights and a v shaped object passed over the over pass, not large about the size of a large airplane. it was black and not triangular, like a v strip with a point of light at the tip and one on each tail. i drove down north plains road and stopped and watched it as it went toward portland and it just got smaller in the distance. i guess my question is, did anyone else see this? you can contact me but this is pretty much all i saw."],"Country":"United States","Viewing Distance":"101-500 Feet","trends":["There have been 2 other sightings in Forest Grove","There were no other sightings in Forest Grove on or around November 4th 2009"],"Date Submitted":"11/05/2009 11:38 UTC","Sighting Duration":"Undisclosed","Longitude":"-123.110663","Tags":"City","Date of the Event":"11/04/2009 07:45 UTC","Disposition":"Unknown","Region":"Oregon","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.519836,+-123.110663(20332)&iwloc=A&hl=en\"> mufon case (20332) map </A>","files":["/var/www/straped/mufon/html2text/20332.html.txt","/var/www/straped/mufon/org/20332.html"],"Log Number":"US-11052009-0014","Object Flight Path":"Straight-line path","Case Number":"20332","Object Features":"None"}