{"Sighting Duration":"Undisclosed","Country":"United States","divs":["sighting details while smoking outside, i like to 'study' the sky and look for any high altitude air traffic and\\or anomolies such as space junk re-entering the atmosphere, meteors, and watch for satellites passing as well. i observed what appeared to be a long cylindrically shaped object on a west to east trajectory at very high altitude travelling at a very high rate of speed and totally silent. the object had a 'soft blue' 'non-flashing' light at each end of it's 'fuselage'. this object went from the west horizon to the east horizon in less than two (2) minutes. after living near both an airport and air force base for 48 years,i am very familiar with the various configurations of aircraft nav-lights which is why this object grabbed my attention so quickly. this object flew directly over both will rogers world airport located in oklahoma city, ok. and tinker air force base located in midwest city, ok. i am quite sure that will rogers' a.t.c. saw this object on radar and due to the clear conditions they should have had a rather high 'seiling' or 'altimeter'. i believe that tinker air force base closes it's tower at 11:00 p.m. so there was probably no military detection. my thought was that this was not a domestic aircraft nor an anomoly!"],"Summary":"Cylinrical shaped object with 'soft blue' light at each end and no noise/con-trail went from horizon to horizon in 2 minutes!","Source":"MUFON","Date of the Event":"07/15/2009 11:30 UTC","Tags":"City","Disposition":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-11062009-0005","City":"Oklahoma City","trends":["There have been 78 other sightings in Oklahoma City","There was one other sighting in Oklahoma City on or around July 15th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.46966,+-97.515418(20338)&iwloc=A&hl=en\"> mufon case (20338) map </A>","Object Shape":"Cylinder","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/20338.html.txt","/var/www/straped/mufon/org/20338.html"],"Region":"Oklahoma","Date Submitted":"11/06/2009 06:24 UTC","Longitude":"-97.515418","Case Number":"20338","Viewing Distance":"Over One Mile","Latitude":"35.46966","Weather Factors":"Unknown"}