{"Summary":"A black hazy object shooting up, down, right, & left. Moving so fast leaving a trail behind it giving the appearance of a snake.It seemed alive.","Date of the Event":"11/06/2009 11:50 UTC","Object Flight Path":"Other","City":"North Olmsted","Weather Factors":"None","Object Features":"None","Longitude":"-81.923473","Log Number":"US-11062009-0014","Case Number":"20347","files":["/var/www/straped/mufon/html2text/20347.html.txt","/var/www/straped/mufon/org/20347.html"],"Latitude":"41.415602","Tags":"City","divs":["sighting detailsi was driving on the freeway and the cleveland airport was to my right. i always look at the sky above the airport to see the planes landing and taking off. i noticed something very out of place in the sky to the left of the airport\\runways. it was hazy black and pulsing. or it seemed like it was pulsing. it was zig zagging and moving up and down. when it moved it was going so fast it gave the appearance of a trail behind it that was lighter in color then the object and transparent. it's movements were very smooth and made it look alive. i pulled onto the side of the freeway and grabbed my phone to take a picture. as soon as i put my hand on the phone the object seemed to disappear. i was shaking because i knew that what i saw was a ufo. i took two photos of the same area that i saw the ufo floating in and included some landmarks to show my position. the sky was clear and sunny. there was no contrails or clouds when i snapped the shot. i have two photos of a strange vapor trail that shoots right over the runways of the airport and it makes a sharp turn. i did not see this with the naked eye or i would of taken many more pictures. it shows that something was there and it moved very very fast. if you use the paintbrush program on your computer and click on the \"airbrush\" then make the pen larger and drag it over the page that is the best way i can explain what i saw."],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Ohio","Country":"United States","trends":["There have been 2 other sightings in North Olmsted","There were no other sightings in North Olmsted on or around November 6th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=41.415602,+-81.923473(20347)&iwloc=A&hl=en\"> mufon case (20347) map </A>","Object Shape":"Other","Date Submitted":"11/06/2009 07:44 UTC","Disposition":"Unknown","Source":"MUFON"}