{"Summary":"I saw a small bright stationary object, which remained motionless then sped off.","Date Submitted":"11/06/2009 04:55 UTC","Sighting Duration":"00:01:30","trends":["There have been 659 other sightings in Montgomery","There were no other sightings in Montgomery on or around November 6th 2009"],"City":"Montgomery","map":"<A HREF = \"http://maps.google.com/maps?q=32.369795,+-86.294149(20343)&iwloc=A&hl=en\"> mufon case (20343) map </A>","divs":["sighting detailswhile standing on my patio today on a clear day, i looked up, as i often do, because airliners fly regularly on a path over my house (at high altitude). when i looked up a small relatively bright object caught my attention. it was motionless, quite small and almost glowed a white light with just a hint of red on one edge. i walked back in my house, got some binoculars and tried to focus on it. i was unable to get focused very well and i did not have a stable platform to keep it in a stable view. at this time i thought it was probably some kind of weather balloon or some other kind of balloon that had floated to a high altitude. i stopped trying to see it with the binoculars, and put my glasses back on and looked at it again. i was about to loose interest, still thinking it was some \"normal\" event when it suddenly began to move in a northerly direction. it moved for a second or two at a moderate pace and then quickly picked up speed and rapidly sped away at a very fast speed. it didn't appear to rise, it just moved at a very high rate of speed out of my field of view. it traveled in a very deliberate path and did not seem to float or drift. it traveled much too fast to be anything like an airplane or balloon. the altitude appeared to be relatively high, as in a few thousand feet, and the size appeared to be small. from my perspective the size was about the same as a bright planet would look, but this object was being controlled by some means. i do no know how long it had been there, but it lasted about 1 1\\2 minutes from the i first saw it until it moved off."],"Object Features":"None","Date of the Event":"11/06/2009 03:12 UTC","Region":"Alabama","Weather Factors":"Unknown","Log Number":"US-11062009-0010","Country":"United States","Latitude":"32.369795","Source":"MUFON","Object Shape":"Sphere, Star-like","Longitude":"-86.294149","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20343.html.txt","/var/www/straped/mufon/org/20343.html"],"Disposition":"Unknown","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path","Case Number":"20343"}