{"Weather Factors":"None","Sighting Duration":"Undisclosed","Case Number":"20345","trends":["There has been one other sighting in Hightstown","There were no other sightings in Hightstown on or around November 6th 2009"],"Log Number":"US-11062009-0012","Source":"MUFON","Summary":"Revolving, Rotating, Hopping around Sphere Shaped object","Latitude":"40.269554","Country":"United States","Object Shape":"Circle, Saturn-like, Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/20345.html.txt","/var/www/straped/mufon/org/20345.html"],"Object Features":"Dome","Viewing Distance":"Unknown","Date Submitted":"11/06/2009 05:57 UTC","Region":"New Jersey","divs":["sighting detailsi was getting ready to go to bed, but because i had early dinner i was a little hungry. so i asked my husband to get a few candies left over from the halloween. while i eat them (3) i was sitting in the bed watching outside. i have 2 boys 9yrs and 2.5 yrs, and they both have been sick for about a week with extremely high tempreture. so i have been sleeping with both of them in our guest bedroom. while i ate i was starring outside at the sky which was relatively clear. i saw aircrafts flying around with their blinking\\non-blinking lights as usual. since the sky was clear i continued starring at the sky and realized that one light which i thought was and aircraft light flying in the direction east to west hasn't moved for about 10min. so thought why has that aircraft not moved at all, and payed a little more attention to it. it had gotten a little closer by then and i starred at it and saw it giving different lights (blue, red, green and yellow) now i felt even more curious. continued to look at it. my excitment grew deeper and i call my husband who was on his laptop in our master bedroom. i call him over and asked to pay attention to this object, and after a few min. we realized this was an unusual object in the sky. like any other person, we both told 'what if its a ufo.' but my husband doesn't really believe in ufo so we watched for some more time and the movement of the object was a little more clearer. now my husband was also curious, i asked him to get a camera (we don't have any high-tech one although). but anyways, we got what we have and tried to zoom in and out excitment got even deeper becuase we could catch something in that tiny camera. we kept talking to each other with excitment-may be its a ufo or may not. but then what it this object. i could record only about 20- 25 min. 2 reason- the capacity of my camera as well as my hands starting hurting. it was difficult to hold the camera still for long. i tried my best. but all the time i kept asking myself what is this object. it moved a little to the north and then rose up-straight in the sky and after about a 1 hr started drifting to the south. i watched it for a 3 hrs, until it moved out of the range of my window. i have recorded what i could see. i would like to show this recording to someone who understand objects in the sky. i would not call it a ufo unless endorsed by an expert. please contact me for more evidence of what i have seen."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.269554,+-74.523209(20345)&iwloc=A&hl=en\"> mufon case (20345) map </A>","City":"Hightstown","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown","Longitude":"-74.523209","Date of the Event":"11/06/2009 11:15 UTC"}