{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20351.html.txt","/var/www/straped/mufon/org/20351.html"],"Disposition":"IFO","City":"Roanoke","Latitude":"33.005953","Tags":"City","Region":"Texas","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Date Submitted":"11/06/2009 10:35 UTC","trends":["There have been 2 other sightings in Roanoke","There were no other sightings in Roanoke on or around November 6th 2009"],"Longitude":"-97.223578","Object Shape":"Triangle","Date of the Event":"11/06/2009 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.005953,+-97.223578(20351)&iwloc=A&hl=en\"> mufon case (20351) map </A>","Case Number":"20351","Summary":"Triple lights in a triangle shape over Fort Worth near Roanoke","Country":"United States","Log Number":"US-11062009-0018","divs":["Sighting DetailsI arrived home (in Roanoke, which is a suburb of Fort Worth, TX) about 7:15pm CST and was bringing in dinner, when my 7 year old daughter noticed \"yellow shooting stars\" in the sky. I looked towards the Southwest and saw three yellowish, extremely bright lights, in an upside-down triangular shape. All three of these lights were definitely separate entities, but were in perfect formation with each other, almost moving as one. When I first saw them, they were heading straight down with a tail behind them - kind of reminded me of what a comet would look like. All three of them made this streak behind them, then slowed down and the streak stopped. The light then faded slowly out to a pinprick and then all the sudden, they brightened back up again and went back higher in the sky and repeated the process over again. They fell slowly from the sky and had a trail behind them. The trail again phased out and then the light dimmed again to a pinprick. I ran inside the house and got my husband to come out and see it also. He watched the trio of lights do the same thing I saw two more times and then it disappeared from sight and didn't reappear. Unfortunately, the lights vanished before we could get video on it. During and after, there was a huge plane of some kind that was circuling the airspace. When it turned, it was almost at a perfect 90 degree angle, which for a plane this big, it was amazing to watch. We didn't get a close look at the plane as it was winter months here and it was already dark, but we definitely saw it's massive size and the lights that were on it. It was also apparent that the triangluar-type lights were not part of this plane shape. Rather, it looked like the plane was circling the area, almost like it was looking out for these lights, or whatever was making them. I checked online and wasn't able to find any reports of special events in the area that would give a legitimate excuse for the lights. If anyone knows what these lights were, please let me know!!"],"Source":"MUFON","Object Features":"Unknown"}