{"City":"Jacksonville","Longitude":"-81.655555","Case Number":"20357","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around November 6th 2009","This sighting has never been favorited.",""],"Region":"Florida","Summary":"Solid, Super bright light intersecting with jet, then making turns and then disappearing in Jax FL","Country":"United States","Viewing Distance":"Over One Mile","Latitude":"30.34587","Date of the Event":"11/06/2009 07:04 UTC","Sighting Duration":"00:01:30","Disposition":"Insufficient Data","divs":["Sighting DetailsMy girl and I were having some people over for dinner last night. Our company (a couple and their son) arrived about 6.45p. I had already put some potatoes on the grill to cook, and at about 7p I went outside to flip them. The husband of the couple (Call him 'S') followed me out there, because we were already in the middle of a conversation about the real estate market. At exactly 7.04 I felt the need to look at the sky. First thing I noticed was a really bright, white light..and when I say bright, I mean WAY brighter than anything else in the sky. The object looked almost stationary. Then I noticed it moving. I couldn't figure out what it was...the only thing I could think of is the ISS. It was at this point that I yelled at 'S' to get out and look at it. He was now on his phone, but he came out from under the covered patio...he was as awe-struck as I was. At this point, he noticed a jet in the sky. Then we both noticed that this bright object and the jet were going to perfectly intersect in the sky. The object started moving faster, and by our estimation traveling about twice as fast as the jet. I almost thought it was a rocket or something at this point, because of the timing of the event. Now both of us are really in awe! After they crossed paths, the object seemed to increase speed even more. It made a gentle sweeping northerly turn...followed by a gentle sweeping easterly turn...followed by a another gentle sweeping northerly turn...and then again, followed by a gentle sweeping easterly turn. Then it just faded away. I'm not sure if this was because it was going into the earths shadow...but I can say this, unless we have satellites that turn, this was not a satellite. I also know it was not a shooting star, and it wasn't another plane. Now, I'm shooting myself for not having my camera on hand. So, I had to draw a picture of what I saw. Also, this may have something to do with it...we have a international air show in town this week. So, who knows..."],"Date Submitted":"11/07/2009 09:33 UTC","files":["/var/www/straped/mufon/html2text/20357.html.txt","/var/www/straped/mufon/org/20357.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.34587,+-81.655555(20357)&iwloc=A&hl=en\"> mufon case (20357) map </A>","Object Shape":"Star-like","Source":"MUFON","Log Number":"US-11072009-0006","Weather Factors":"Unknown"}