{"Source":"MUFON","Weather Factors":"Light","Log Number":"US-11062009-0017","Object Features":"Dome","Object Shape":"Disc","Date Submitted":"11/06/2009 09:44 UTC","Summary":"Disk shaped with clockwise rotating bright white lights","trends":["There have been 7 other sightings in Blythe","There were no other sightings in Blythe on or around December 11th 2008"],"Tags":"City","Longitude":"-114.579604","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Date of the Event":"12/11/2008 09:10 UTC","Case Number":"20350","Latitude":"33.618963","Region":"California","City":"Blythe","divs":["Sighting DetailsMy wife and I were driving from Tucson, Arizona to Indio, California for a weekend event. It was Thursday, December 11, 2008. That night was the night of a full moon. After driving West through Blythe, California on interstate 10, my wife and I started seeing bright orbs in the sky. The orbs were not to far in the sky and would come on one below the other, like a traffic light sequence. This continued on the North side of the freeway and a couple of times on the South, so we were observing the sky very intently trying to figure out what these were. As I looked toward the South, A string of bright white lights appeared. My wife and I booth saw them, but in the bright moon light, I could make out the dark shape of a disk. The lights were on the edge and rotating in a clockwise direction. The lights came on and went off in the time it takes to say, now you see me, now you don't. It looked as if it was lighting up an area to land. The craft was approximately 500 feet in the sky, at a 30 degree angle from the ground, appeared and disappeared. It was between 9:00 and 9:30PM, PT. It was a life changing event to realize that something like that exists. The hair on my arms stood up and my eyes watered. We continued to look as we continued on but nothing else appeared. I look around every time we travel through that area. The area is Northwest of the Yuma Proving Grounds, so it may be a craft being tested from the base in Yuma.....or maybe not."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.618963,+-114.579604(20350)&iwloc=A&hl=en\"> mufon case (20350) map </A>","files":["/var/www/straped/mufon/html2text/20350.html.txt","/var/www/straped/mufon/org/20350.html"],"Disposition":"IFO"}