{"divs":["Sighting DetailsWE WALKED OUT OF KONAMI WHERE WE HAD DINNER AND IN THE SKY NEXT TO THE BRIGHT STAR (OR PLANET) WE SEE EVERY NIGHT WAS ANOTHER BRIGHT LIGHT THAT LOOKED THE SAME BRIGHTNESS AND SIZE (BUT YOU COULD TELL IT WAS LOWER). THEN IT STARTED MOVEING TO THE LEFT OF THE STAR (OR PLANET) VERY SLOW WITH NO INDICATER LIGHTS OR STROBES , YOU COULD TELL IT WAS DIFFERANT SINCE THERE WERE PLANES FLYING IN THE DISTANCE IN THREE PARTS OF THE SKY IN DIFFERANT DIR AND YOU COULD SEE THERE MARKER LIGHTS CLEARLY. THE LIGHT WAS GOING MUCH SLOWERAND ALMOST OVERHEAD THERE WERE NO CLOUDS AND YOU COULD SEE STARS,AS THE LIGHT GOT AS FAR AS IF YOU HELD UP A YARDSTICK AT ARMS LENGTH AWAY IT BEGAN TO FADE ,THEN TURN SOLID RED AND THEN BLINKING OUT ALTOGETHER.I KNOW IT WASN'T OUT OF MY LINE OF SIGHT BECAUSE I WAS ON A HILL THAT OVERLOOKED A VALLEY AND COULD SEE FOR AT LEAST TWO MILES ALL AROUND BUT BEHIND ME.I LIVE IN THE PATH OF THE AIRPORT SO I SEE,FILM AND TAKE PICTURES OF PLANES AND ODD THINGS IN THE SKY OFTEN, AND THIS ACTED LIKE NO PLANE OR SATELLITE.IT MAKES ME HAPPY TO KNOW WE MAY NOT BE ALONE."],"Source":"MUFON","Date of the Event":"11/06/2009 08:30 UTC","Object Features":"None","Longitude":"-86.603376","Latitude":"33.622825","Weather Factors":"None","Disposition":"Unknown","Date Submitted":"11/07/2009 02:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.622825,+-86.603376(20360)&iwloc=A&hl=en\"> mufon case (20360) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Trussville","There were no other sightings in Trussville on or around November 6th 2009"],"City":"Trussville","Object Shape":"Sphere, Star-like","Viewing Distance":"20 Feet or Less","Country":"United States","files":["/var/www/straped/mufon/html2text/20360.html.txt","/var/www/straped/mufon/org/20360.html"],"Region":"Alabama","Log Number":"US-11072009-0009","Object Flight Path":"Hovering then path","Summary":"BRIGHT LIGHT FADING TO RED THEN BLINKING OUT.","Tags":"City","Case Number":"20360"}