{"Case Number":"20365","Disposition":"Unknown","Date of the Event":"11/07/2009 06:30 UTC","Sighting Duration":"Undisclosed","Log Number":"US-11072009-0014","divs":["Sighting DetailsI was heading out the door to work and noticed a light pattern moving slowly over my neighbors house away from mine. It was only a few thousand feet up, what I would consider lower or equal to a helicopter height. this wasn't the normal \"lights in the sky\". This was a full disc shaped craft with lights moving around it counter clockwise. It was moving away and I could see the lights as they circled around, disappeared as it went in front of my line of sight and came back around. By far the most amazing thing i've ever seen. It moved slowly over my neighborhood and went just out of my sight. I ran down the road a bit to continue to watch it and when I got there, it was gone. Totally gone. As I looked around, just above me a typical \"ball of light\" materialized out of nowhere and zipped off towards the craft I had just watched. This entire event was about 10 minutes. This first craft I saw was so clear and moving so slow that if I would have had a video camera, it would have been the best UFO footage I've ever seen. Bummer"],"Region":"Virginia","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","City":"Elkton","files":["/var/www/straped/mufon/html2text/20365.html.txt","/var/www/straped/mufon/org/20365.html"],"Latitude":"38.407904","Longitude":"-78.623628","Object Features":"Unknown","Summary":"Disc slowly over my neighborhood followed by another","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","trends":["There has been one other sighting in Elkton","There were no other sightings in Elkton on or around November 7th 2009"],"Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.407904,+-78.623628(20365)&iwloc=A&hl=en\"> mufon case (20365) map </A>","Object Shape":"Disc","Date Submitted":"11/07/2009 08:11 UTC"}