{"Sighting Duration":"00:05:00","trends":["There have been 4 other sightings in Keller","There were no other sightings in Keller on or around November 6th 2009"],"Summary":"Fiery meteor splits into three UFOs in Keller, Texas","Log Number":"US-11072009-0010","City":"Keller","Region":"Texas","Object Features":"None","files":["/var/www/straped/mufon/html2text/20361.html.txt","/var/www/straped/mufon/org/20361.html"],"Longitude":"-97.242152","divs":["Sighting DetailsI was watching television at about 7:15pm and had the back door open so that my dogs could run in and out. My Pomeranian began barking and wouldn't stop. I yelled to her to be quiet as I thought she was barking at the dog next door. She continued to bark and ran inside and began frantically barking at me. It was then that I noticed she was looking out the window at the sky behind me. I ran outside and when I looked up I saw a large flaming meteor about the size of a full moon. It was black in the center with white flames around it and red on the edge of the tail. It was so large and moving so quickly I froze and the only thing I could think of is if this thing crashes we are going to die. Before I could gain my composure and decide what to do it changed right before my eyes. It suddenly stopped and became a smaller flamed object and turned into one, then two, then three huge balls of extremely white light. It was as if they had been stacked one behind the other. One to the right then one to the left while the last remained in the center. They were very bright and each about the size of a full moon. They were perfectly spaced apart in a straight line. It took a minute for my thoughts to catch up as a second before I was deciding how to survive a crashing meteor and now that was gone and I had accept a new impossible situation in a very short amount of time. I remember saying out loud, \"What is happening?\" and that is when I noticed some neighbors talking in hushed voices and I believe that they were seeing it too. After hovering in a line for a few seconds they began to flash on and off. When they would turn back on they would be in a different location in the sky. They seemed to take turns flashing on and off. They went from a straight line to a triangle and then a diagonal line. They seemed to go through several patterns but I don't recall all of them. They also were higher and lower in the sky at different times. They finally ended up in an upside down triangle. The top two would flash in and out. And finally did not come back. The last one remained and this was the only time that I saw actually movement instead of flashing in and out and ending up in a different location. It floated slowing towards the ground and I really thought it was going to land. It hovered very low for a few seconds and then if finally flashed out. I stood in the silence and could not believe how quiet it was. There were the normal planes approaching and waiting to land at DFW airport. I could not believe I did not see any military aircraft or some type of activity to signify that something amazing just happened. I finally saw a large plane that seemed very close to the ground but I could not tell if it was military in the dark. I waited a little while longer and a single helicopter flew around the neighborhood briefly and then it was gone."],"Date of the Event":"11/06/2009 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.93814,+-97.242152(20361)&iwloc=A&hl=en\"> mufon case (20361) map </A>","Viewing Distance":"Unknown","Weather Factors":"None","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"11/07/2009 02:26 UTC","Object Shape":"Circle, Fireball","Source":"MUFON","Disposition":"IFO","Latitude":"32.93814","Country":"United States","Tags":"City","Case Number":"20361"}