{"Country":"United States","divs":["sighting detailswell, after viewing a strange huge red craft dip low into the park from my window, i ran out to central park to capture it on film. by the time i arrive at the great hill in central park, 3 huge blackchoppers begin to surround me and either monitor me or the red craft that resembles orbs attached together to form some sort of airplane. it was very scary. i was very frightened. they just stood over the hill and over my head for a while. the red craft re-appears and you see the blackchoppers start to react to it.. one chopper flew directly under the red craft. the craft was above the choppers and i and the 2 witnesses i bumped into saw it all. after a while, the choppers leave and the red craft begins to fly lower and lower. it also begins to fly directly over me as well. this happened on wednesday night. the choppers came back a few hours later and began to fly over the park once again. what the crafts looks like is multiple orbs, green, white, red all huddled and attached to each other to form a plane. the \"craft\" seems to at times change shape or patterns in mid air. at times it looks like helicopter, then an airplane and even an airplane flying backwards... somes times just 2 lights are flashing, other times 4-6... no noise , just a loud humming sound.. very strange.. this is over central park in nyc, and nothing is suppose to be flying that low due to new 9\\11 flight regulations. my footage is from on top of the great hill, located on 104th & 105th and central park. the highest point in central park.. those black choppers are here for a reason.. i think either the military is up to something or the choppers are the ufos them selfs who mimic our planes and helicopters.. (vik456@youtube) vik456 nyc"],"City":"New York","Disposition":"Unresolved","Latitude":"40.791734","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around November 4th 2009","This sighting has never been favorited.",""],"Case Number":"20362","Weather Factors":"Unknown","Longitude":"-73.95737","Object Shape":"Disc, Flash, Square, Rectagular, Triangle","Summary":"Choppers surround me and UFO in Central Park.","Date of the Event":"11/04/2009 12:00 UTC","Object Flight Path":"Undisclosed","Region":"New York","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Date Submitted":"11/07/2009 04:00 UTC","Log Number":"US-11072009-0011","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20362.html.txt","/var/www/straped/mufon/org/20362.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.791734,+-73.95737(20362)&iwloc=A&hl=en\"> mufon case (20362) map </A>"}