{"Latitude":"34.097871","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/2036.html.txt","/var/www/straped/mufon/org/2036.html"],"Country":"United States","Object Flight Path":"Stationary","Object Features":"Undisclosed","Longitude":"-98.570613","Date of the Event":"05/31/1992 11:30 UTC","Tags":"City","Case Number":"2036","divs":["Sighting DetailsI lived with my parents out in the country, about 6 miles out of a small towncalled Burkburnett. I worked the late shift at a hospital and was heading homeat around 1130 at night. I was all alone on the 2-lane highway that led to myhouse and about 3 or more miles from town when I suddenly noticed my carengulfed in blue lights. I thought that a police officer had been hidingsomewhere and was going to pull me over. But, when I looked in my rearviewmirror I saw nothing behind me. I looked to my left Southerly, and saw largeblue lights in the field next to me. I couldnt take my eyes off of the objectand knew that it was not an oil rig, plane, or helicopter because it wasstationary just above the ground and very large. I remember looking down at myspeedometer, flooring my car out of fear, and then looking back again to wherethe object had been. It was pitch black. From what I did see, the craft hadthe bluest lights I had ever seenmoving from left to right over and over, pulsating and very bright. My car waslit up, as the lights relfected off of the exterior and on the inside of myvehicle. I drove home as fast as I could, looking up above me and around me,afraid that I would be taken. I know it was something not normal.P.S. I would like to also add that I had experiences afterwards in my bedroomand ended up taking a visit to a therapist about my experience. I will sharethat if requested."],"Summary":"Bright Blue Lights","trends":["There have been 2 other sightings in Burkburnett","There were no other sightings in Burkburnett on or around May 31st 1992"],"Date Submitted":"05/31/1992 11:30 UTC","Log Number":"","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"101-500 Feet","Sighting Duration":"00:05:00","Region":"Texas","City":"Burkburnett","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.097871,+-98.570613(2036)&iwloc=A&hl=en\"> mufon case (2036) map </A>"}