{"Summary":"4 bright white lights changing formation","Region":"Ohio","Date Submitted":"11/07/2009 10:47 UTC","Object Features":"None","Tags":"City","Case Number":"20369","Disposition":"IFO","City":"Cincinnati","Sighting Duration":"Undisclosed","divs":["Sighting DetailsFrom 45224, north boundary of city of Cincinnati,Ohio, USA, in the southern sky shortly before 8pm. There was one large soft-white spherical glow appeared in the sky and slowly dropped in altitude. It split and became 4 distinct lights. These lights were surprisingly bright and large for the dusk sky. There were airplane headlights in the sky at various locations that were very small, distant, and dim in comparison. The four lights formed a diamond pattern and held static in the air, about APPROX 3000 feet altitude. I thought for sure people on Interstate 75 at about Mitchell exit (exit 6) southbound would see it. I approximate that the lights were above Spring Grove Cemetery. I was on the phone with my husband, who also saw exactly the same thing from a different vantage point from the car. After they held the diamond pattern, they moved with a swiftness and a very short \"tail\" like a comet, but it was blurry, like blurry lights. They changed formation and seemed to \"swirl\" down slowly blinking on and off until they were all off. I could not tell if they were dark, gone, or below the horizon. I have never seen anything like this before. My husband and I agree- this was definitely not a plane or a blimp. We were sure it was alien. Absolutely sure. It was beautiful and fascinating, but we were both terrified, too. He saw a red light orb UFO when he was young, but I have never seen anything like this."],"Object Shape":"Circle, Sphere","Source":"MUFON","Latitude":"39.107338","Date of the Event":"11/07/2009 07:40 UTC","files":["/var/www/straped/mufon/html2text/20369.html.txt","/var/www/straped/mufon/org/20369.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","trends":["There have been 82 other sightings in Cincinnati","There was one other sighting in Cincinnati on or around November 7th 2009"],"Country":"United States","Log Number":"US-11072009-0018","map":"<A HREF = \"http://maps.google.com/maps?q=39.107338,+-84.50611(20369)&iwloc=A&hl=en\"> mufon case (20369) map </A>","Weather Factors":"None","Longitude":"-84.50611"}