{"Date Submitted":"06/30/1998 12:00 UTC","Region":"Alaska","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=63.596963,+-154.490122(2037)&iwloc=A&hl=en\"> mufon case (2037) map </A>","Date of the Event":"06/30/1998 12:00 UTC","Latitude":"63.596963","City":"Kassan","Summary":"Flying Sticks","Tags":"City","files":["/var/www/straped/mufon/html2text/2037.html.txt","/var/www/straped/mufon/more/2037_submitter_file1__NadiaBaileyPhotographInvestigation.jpg","/var/www/straped/mufon/more/2037_submitter_file2__File0043BaileyPhoto2.jpg","/var/www/straped/mufon/org/2037.html"],"Longitude":"-154.490122","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was with some friends and my boyfriend up on the ridge above the KassanPeninsula taking pictures to send to my parents of the ferry route that we take when we come from Ketchikan. I had a strange feeling because of the heights andwas interested in this cedar snag for some reason. I took two or three picturesof it and then didnt think anymore about it. Well since then i have movedseveral times and have gotten a computer through a grant and was looking atpictures to put on my t-shirts when I saw something on the picture and decidedto throw it away and then I decided to take a closer look at it with amagnifying glass. I then put it in the scanner and blew it up and that is when Isaw the same stick figure that I saw in the clip of a man named Jose who hadtaken a bunch of them in a deep hole where they were climbing into. I have beensearching the internet now for two years and happened to be watching on theScience channel and there was the clipping where he went to Mufon to have andelderly expert examine his film. I have the print and the negative .I am in theprocess of moving my house around but it is in with my photos because I haveblown it up for someone else to see. I hope this is the right place to inquireabout this strange little stick object that appeared in my photo . I know it isnot the camera because i have more than one photo of the snag and the stickobject only appears in one of them"],"Case Number":"2037","Weather Factors":"Unknown","Disposition":"Unknown","Source":"MUFON","Object Shape":"Other","Country":"United States","Log Number":"","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Kassan","This sighting has never been favorited."],"Sighting Duration":"00:00:59"}