{"divs":["sighting detailsi was driving south on us-220 approximately five miles north of rockingham when i saw, to the south-south-east, three lights, which i thought were on some unusual plane for a split second. the lights, as you can see in the illustration i have provided, were arranged triangularly with two white lights forming the points at the base of the triangular formation and a red light at the point. i call it the \"point\" because of the orientation of the object. the red light was pointed in the direction it was traveling. this object was moving impossibly fast. it appeared to be at some distance and was moving in the sky more quickly than anything man-made i've ever seen. i would compare the speed to that of a \"shooting star\"\\meteorite burning through the atmosphere. after several seconds of acceleration from west to east, in a fashion comparable to how the delorean of back to the future fame would speed up before disappearing, the object sped up and then -- nothing. it completely disappeared from the sky."],"Sighting Duration":"Undisclosed","Tags":"City","Case Number":"20380","Date Submitted":"11/08/2009 02:07 UTC","Date of the Event":"11/08/2009 12:00 UTC","Summary":"A stable formation of three lights (2x white, 1x red, at point) moving FAST and disappearing suddenly.","Source":"MUFON","Country":"United States","Region":"North Carolina","Weather Factors":"Unknown","City":"Rockingham","Object Shape":"Triangle","Log Number":"US-11082009-0008","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Rockingham","There were no other sightings in Rockingham on or around November 8th 2009","This sighting has never been favorited.",""],"Latitude":"34.9491","map":"<A HREF = \"http://maps.google.com/maps?q=34.9491,+-79.767996(20380)&iwloc=A&hl=en\"> mufon case (20380) map </A>","files":["/var/www/straped/mufon/html2text/20380.html.txt","/var/www/straped/mufon/more/20380_submitter_file1__sighting.jpg","/var/www/straped/mufon/org/20380.html"],"Disposition":"Unknown","Viewing Distance":"Unknown","Longitude":"-79.767996"}