{"divs":["Sighting DetailsI was awakened & knew to go to my back picture window. (I was awakened by a voice asking me to come o the window.) There was a stationary vortex looking glowing white mist light in my backyard. I went to the back door, opened it & continued to look at it. I felt peaceful and calm. I thought it was a spirit, as I had been experiencing spirit visits 4 days in a row prior to this event. (I had been hellping spirits cross over.) It extended approx. 8-10 feet from ground to top, though it didn't touch the ground; it appeared to float. I said my St. Michael prayer & watched it. It slowly faded away like a fog leaving after it rolls in. It then was gone. My chocolate lab was barking. This had happened 2 days prior also. The next day I went out to look and there were no marks on my grass--as if nothing was there. About a week later my dad said, \"Deborah, I saw something last night in the yard.\" He told me he saw a white light as a mist in the same spot I saw the light. I told him what it looked like at the same time he was telling me. He said, \"Wait, you saw it?\" I said, \"I've seen it twice a week ago.\""],"Date Submitted":"11/08/2009 08:49 UTC","Summary":"Awoke to see round misty light just off ground, disappeared after 5-10 min.","Longitude":"-79.834216","Object Flight Path":"Undisclosed","Region":"Pennsylvania","Log Number":"US-11082009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=42.215613,+-79.834216(20387)&iwloc=A&hl=en\"> mufon case (20387) map </A>","Tags":"City","Country":"United States","Sighting Duration":"00:07:00","Weather Factors":"Unknown","trends":["There have been 3 other sightings in North East","There were no other sightings in North East on or around August 7th 2009"],"files":["/var/www/straped/mufon/html2text/20387.html.txt","/var/www/straped/mufon/org/20387.html"],"Object Features":"Undisclosed","Case Number":"20387","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"42.215613","Date of the Event":"08/07/2009 03:00 UTC","Disposition":"Insufficient Data","Object Shape":"Sphere","City":"North East"}