{"Summary":"Bright yellow star-like with a faint \"halo\" as such around it slowing moving,low altitude, no noise at all.","Latitude":"34.771684","divs":["Sighting DetailsI was working in my yard today and I have always been a \"sky watcher\" so to speak but I have only witnessed one strange object in my life until today. I was looking up and I noticed in the northern sky there were at least (4) chemtrails (I guess is what you would call them) running across and parallel with one another. One of them was extrvemly thick and not as long as the others. While I was observing them, I notced (2) other jets in the sky. One was travling in a direction not even close to the trails (and was not leaving any sign of a trail) and the other was travling southeast across the trails or above them. (hard to tell really) The reason I say that is because when this jet reached the thick chemtrail I lost sight of it until it went thru it or over it or whatever. This jet was not leaving any sign of a trail either and it was also much lower altitude than the other one. I could hear the engines on this one and see it very clear since it was fairly low altitude. It wasnt so low per say as it were coming in or taking off (not that low) but just \"cruizing\" at what I would call a normal low altitude from what I have personally see in jet planes. Then I noticed another jet traveling in another direction close to the chemtrails but not leaving one itself. The chemtrails were made before any of these planes were sighted but I didnt see what made the trails. I never thought anything was really \"out of the ordinary\" so to speak until I looke toward the south and then I noticed there was what appeared to be a large star when a halo of sorts encircling it moving northeast very slowly at a very low altitude. Now this craft was flying at an altitude I would compare to a \"cessna\" or maybe an \"ultralite\" aircraft. It never behaved eratic or anything but proceeded in a straight line northeast and never made any sound what so ever. It never blinked or there were no other lights near it. I have never seen any planes or helicopters fly that low and not make a sound at all. It flew right over my house and I observed it for at least 2-minutes or slightly longer. I have never reported anything like this before and have only experienced one other strange sighting in my life which actually was stranger than this but that was back in 1996. I hope someone can investigate this because I do not think that this was a normal craft. Please let me know if anyone else saw this or can explain it. I didnt have time to get my camera or binoculars or anything so I have no photos but I know what I saw. I watched the craft until it dissapered over the trees in mu yard and I could no longer see it. Please keep my personal info private. thank you........Randall K. Herron"],"Date Submitted":"11/08/2009 08:01 UTC","Region":"Georgia","Log Number":"US-11082009-0013","Object Shape":"Circle, Sphere, Star-like","Disposition":"Unknown","trends":["There have been 6 other sightings in Chatsworth","There were no other sightings in Chatsworth on or around November 8th 2009"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/20385.html.txt","/var/www/straped/mufon/org/20385.html"],"City":"Chatsworth","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.771684,+-84.761028(20385)&iwloc=A&hl=en\"> mufon case (20385) map </A>","Weather Factors":"None","Country":"United States","Case Number":"20385","Sighting Duration":"Undisclosed","Longitude":"-84.761028","Tags":"City","Date of the Event":"11/08/2009 05:00 UTC","Source":"MUFON"}