{"Object Shape":"Square, Rectagular","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.764939,+-111.884417(2038)&iwloc=A&hl=en\"> mufon case (2038) map </A>","Latitude":"40.764939","Longitude":"-111.884417","Disposition":"IFO","Object Features":"Undisclosed","Log Number":"","Object Flight Path":"Straight-line path","Case Number":"2038","Tags":"City","divs":["Sighting DetailsI was about 10 yrs old I thinkit was about 20 years ago. I was in Salt Lake CityUtah where my house was. I was just walk around on front of my house doingnothing. I just happened saw there were two objects very long rectangler whitelike Pearl looking and it stays close to each other like 11 and have never moveaway from each other. I am deaf myself and I was not understanding the worldaround me Behind eduacated at that timeI was just curious and wondering what itwas and confused. I knew it was not plane or anything that I have seen before. Ihad very little understanding about aliens and UFO at that time so I justthought it might be possible that the Earth has strange way of nature make itsfloating objects. It just keep on moving and hoovering from south to north realyslow. When it gets smaller and I hurried to get my mom to witcness it as welland went inside but mom was not around so I went back outside and it was alreadydisappeared or might be farther and smaller that I couldnt find it anymore. Fora years that I have always remember it and fear by it. I always felt that I wasbeing watched that I was not allow to tell anybody about it. Sometime I wonderif I had telepathy from them but never sure of it. I have had nightmares once inawhile after that happens. Now it not much anymore but I do still feel that theydo remember me very well. I just cant explain it thur email because I am notgood in English. I am telling you 100 per cent truth that I know it somethingout there what I saw adn have no doubt in my heart. I cant give accurracte whatyear it was because I never understood the year when I was little so it wasabout around 1982. I hope you can be of help and thank you for your time. pleasedont remove me and ask me any questions that I will answer to all with 100 percent truth with all my heart."],"Summary":"long white pearl like 11 objects","Date Submitted":"11/30/1981 02:00 UTC","files":["/var/www/straped/mufon/html2text/2038.html.txt","/var/www/straped/mufon/org/2038.html"],"Date of the Event":"11/30/1981 02:00 UTC","Sighting Duration":"00:10:00","Country":"United States","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around November 30th 1981"],"Viewing Distance":"101-500 Feet","Region":"Utah","Source":"MUFON","City":"Salt Lake City"}