{"trends":["There have been 8 other sightings in Tracy","There were no other sightings in Tracy on or around November 5th 2009"],"Object Flight Path":"Path with directional change","Date Submitted":"11/08/2009 02:21 UTC","Source":"MUFON","Object Features":"None","Latitude":"37.748591","Weather Factors":"Unknown","divs":["Sighting DetailsIt was about 8:30 PM on Nov. 5, 2009. Our neighbor had just come over to talk to my Mom and her wife about the bike ride they went on that day, and I stepped outside for a cigarette. My usual smoking area is on the back porch and I regularly observe the sky when out there (making me quite familiar with the night sky in my area). While looking towards the East, I noticed a white strobing sphere in the sky, about 30' above horizon and at a far distance. The sphere was about twice the size of Venus and the luminosity was greater than that of Polaris. This is a common area to spot commercial airlines flying towards the Bay area, but the light I saw was strobing way too fast to be the lights on a plane or helicopter (the skies were pretty clear too). There also weren't any red or blue lights like you find on the starboard and port side of an airliner, nor did I hear the sound of a helicopter or plane. This strobing sphere flew at a high rate of speed from the East to the West, passing in front of me at about a 70' angle at the closest. I quickly yelled for my mother to come out and look to make sure I wasn't hallucinating (I knew I wasn't, but needed someone else to see what I saw). She came out and spotted the object as well. The object continued at a high speed to the West for a little bit longer, it didn't appear to fly over the hills between Tracy and Livermore. The object then began traveling NNW. Now, I say \"began traveling\" because there was no visible turn made. It was like if you move the mouse cursor to the left steadily, then immediately shift to moving it to nearly the middle of the top of your screen. A conventional aircraft would have a visible curve in their trajectory when making that kind of an angle change, but this didn't. Two conventional airliners flew into the viewable sky and I was able to point out to my mother the significant speed and altitude differences. After that, my mother went inside and I continued to watch the object fly off to the NNW. It faded away from view when it got too far. At first, I tried to convince myself it was some kind of satellite, but I later realized satellites don't make turns like that. Now, I don't know what I saw, but I'm sure it wasn't conventional aircraft or a satellite. During and after the observation, I would have to say I've been excited. I've seen enough evidence from others to know that extraterrestrials exist and have wanted to spot an actual UFO for quite some time. I knew the first steps were to watch the night sky, so I have been for some time. I'm happy to have finally seen something I can't explain."],"Disposition":"IFO","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.748591,+-121.419233(20381)&iwloc=A&hl=en\"> mufon case (20381) map </A>","Longitude":"-121.419233","Viewing Distance":"Over One Mile","City":"Tracy","Date of the Event":"11/05/2009 08:30 UTC","Log Number":"US-11082009-0009","Case Number":"20381","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/20381.html.txt","/var/www/straped/mufon/org/20381.html"],"Object Shape":"Sphere","Region":"California","Country":"United States","Summary":"Strobing white sphere at high altitude flying at high speed"}