{"Latitude":"40.339848","Object Features":"Appendage(s)","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsI had justed finished work and stopped to talk with a co worker when I noticed this brilliant light traveling at a high rate of speed. Not as fast as, say a shooting star but more like a military jet fighter. It was almost a blinding white light and I watched it as it traveled across the sky at a steady speed when it started to slow down and then went vertical and turned bright red and increased to a phenomenal speed and went straight to the stars where it disappeared. The sky was clear and visability was almost perfect. There was no other traffic in the sky in the vacinity of the craft. The shape appeared oval with points of light jutting from the nose and tail and sides of the craft. A total of 4 points. It's trajectory was unwavering, no side to side or up and down manuvers. I watched it for a good two minutes as it crossed clear sky and then when it turned straight up and disappeared in a matter of 2 to 3 seconds. The person that was with me witnessed the whole episode but would rather remain silent on the matted and seemed pretty shakin up by the event. If he changes his mind about making a report I will addhis statement to this report. My vehicle was parked too far away to retrieve a camera so I just watch and mentally recored what I was seeing. I am a Chief Investigator for MUFON. ID# 11555"],"Case Number":"20386","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around November 8th 2009"],"Disposition":"Unknown","Date of the Event":"11/08/2009 06:14 UTC","Summary":"Bright Starlike object altitute approx. 30000 ft. moving NE speed of a military jet. Object slowed to about 2/3 it's traveled speed and then went vertical and the white light turned red and it climbed to the stars where it disappeared into infinity.","City":"Reading","Region":"Pennsylvania","Viewing Distance":"Over One Mile","Longitude":"-75.922255","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Circle, Oval","Log Number":"US-11082009-0014","Date Submitted":"11/08/2009 08:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.339848,+-75.922255(20386)&iwloc=A&hl=en\"> mufon case (20386) map </A>","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/20386.html.txt","/var/www/straped/mufon/org/20386.html"]}