{"Object Flight Path":"Other","trends":["There have been 5 other sightings in Rock Hill","There were no other sightings in Rock Hill on or around November 8th 2009"],"Viewing Distance":"Unknown","Log Number":"US-11092009-0007","Object Features":"Unknown","divs":["Sighting DetailsLast night while watching television at 8pm I decided to go out to look at the stars for awhile. Looking at the stars on clear nights is something I do regularly when it's warm. The sky last night was very clear and the light pollution was low so I could see so many stars and satellites. While watching a satellite cross the sky from north to south I noticed a small red light zip across the sky in a zig-zag pattern. It took it about a second and a half to go from the north all the way across my field of view straight over my head and to the south. To put the speed in perspective it was like pointing a red laser pointer at the ceiling and zig-zag it across the ceiling. At first I thought that was what it was...A laser pointed across the night sky but...I don't know how that could be because there were NO clouds last night for a laser pointer to project on. Now this happened VERY quickly and the only reason I saw it was because I was already watching the satellite coming towards me from the north. It was very close to a second and a half for it to go all the way across my night sky directly over my head and vanish to the south. So I looked back to find my satellite and it was just starting to go over my head. Right behind the satellite was a V-Shaped configuration of lights One red light in front and two white lights on tip of it's wings. (<) The lights were not strobing or blinking which was very unusual to me as everything passing this way is usually aircraft beginning their trip from Charlotte Douglas Itnl Airport. The Triangle passed the satellite and kept going south, never blinking. As I was watching the Triangle from behind me I could hear the blades of a helicopter coming from the north, same direction the Red light and the Triangle came from. The copter seemed to be very high in the sky because the sound was kinda muffled and the blinking red and white lights on it looked like small lights. I mean the lights were small and the sound was muffled which led me to believe it was very high. I was shocked about this sighting. Nothing about it \"felt\" normal to me. I have to add that this is the second sighting I've had here in Lancaster of the red, zig-zagging light. I saw the very same thing back in 2006 and thought it was odd. It also made it's way across the sky in less than two seconds. I reported it too I believe. This is also the third night this week I've heard a helicopter outside. Hope this helps someone. I'm kinda stunned. g"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.924867,+-81.025078(20399)&iwloc=A&hl=en\"> mufon case (20399) map </A>","Summary":"Red light at high altitude, \"zig-zagging\" across the sky very fast. Followed by a triangle alignment of light moving very slow in the same direction.","Date Submitted":"11/09/2009 12:12 UTC","Longitude":"-81.025078","Object Shape":"Sphere, Triangle, Unknown","Case Number":"20399","Date of the Event":"11/08/2009 08:30 UTC","Latitude":"34.924867","City":"Rock Hill","Country":"United States","Disposition":"Hoax","Tags":"City","Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"South Carolina","files":["/var/www/straped/mufon/html2text/20399.html.txt","/var/www/straped/mufon/org/20399.html"]}