{"Viewing Distance":"21-100 Feet, 101-500 Feet","Latitude":"37.741595","Country":"United States","Disposition":"Insufficient Data","Longitude":"-121.124383","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Ripon","Weather Factors":"Unknown","Object Features":"Wings, Unknown","trends":["There have been 4 other sightings in Ripon","There were no other sightings in Ripon on or around November 8th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=37.741595,+-121.124383(20392)&iwloc=A&hl=en\"> mufon case (20392) map </A>","Log Number":"US-11082009-0020","Tags":"City","Object Shape":"Cross, Unknown","Case Number":"20392","divs":["sighting detailsfrom highway 99 going southbound at 6:20 p.m. i could see some objects about 1 mile away or slightly less. they all had varying lights, all had a bright blue to them, then other colors as well. they all seem to fly back and fourth in a loop. they were next to mistlin park in ripon, ca. i drove right under them. 1 appeared to mostly stay stationary, the others hovered in little circles and loops. all had strange colored blue lights some had red and white as well. one of the objects came right above the parking lot i was in, i rolled my window down and there was no noise from a propulsion system. they appeared to only be about 50 to 100 feet in the air, but it could be more. they almost looked like radio controlled, but there was nobody around that seemed to be flying them, and there was no noise like a radio controlled object was there. one went over my car, and it was like a cross shape lights going straight about 5 of them blue then two behind the third one down then another single one and then five where wings could be and there was a silloette like a plane sorta.i don't know what i saw but it was definately strange. i watched it them for about 20 mins, so did a few other people, then i had to leave. i am still puzzled as to what the heck they were. i don't know of any objects that fly with no sound that appeared to be the size of a basketball(probably in actuality bigger) and have bright blue round almost solar\\led type lighting on them. i was only able to get a 20 second video of it with my phone."],"Date of the Event":"11/08/2009 06:20 UTC","Summary":"4 objects in sky in Ripon, CA.","Region":"California","Object Flight Path":"Stationary,Hovering then path,Path then hovering","files":["/var/www/straped/mufon/html2text/20392.html.txt","/var/www/straped/mufon/org/20392.html"],"Date Submitted":"11/08/2009 11:41 UTC"}