{"Tags":"City","Date of the Event":"12/17/2002 06:45 UTC","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.801182,+-68.777814(2039)&iwloc=A&hl=en\"> mufon case (2039) map </A>","Summary":"Variable Oscillating Red Light, Very Slow Mover","Log Number":"","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around December 17th 2002"],"Source":"MUFON","Date Submitted":"12/17/2002 06:45 UTC","Latitude":"44.801182","Object Shape":"Undisclosed","Sighting Duration":"00:30:00","Weather Factors":"Unknown","divs":["Sighting Details1. I first noticed the object as I was driving south on Stillwater avenue fromOrono into the commercialmall area of Bangor, ME. On the long stretch ofStillwater there is very little light pollution, and with a clear sky there wasa lot to look at. Since I was travelling south the whole time, I had a clearview of the object for a good 10-15 minutes, without interruption.2. The object was very noticable in that it was where no other pusling redlights typically are, and it behaved differently. While there are towers in thearea with flashing red lights, this object was intense in a different fashion,appearing to be much higher aircraft height rather than tower height, movingvery slowly.3. My first thought was that it was a tower light, as they also pulse red...but it appeared to be too distant and far too high. My second thought was thatit had to be a plane, except that it moved so slowly you really had toconcentrate on the object to realize that it was moving, and that it bore noother of your typical aircraft lighting... no white, no headlight, just solidand intense red.4. My reaction was interest, primarily... once I had identified it as a pointof interest, I kept my eyes on it the whole 10-15 minutes it took me totravelling from the top of the hill obvious when travelling along stillwaterdown towards and through bangor to the BestBuy near the mall. Aside form havingto pay attention to traffic, I never let the object out of my sight, and evenstood outside my car, in the BestBuy parking lot, observing it 2-5 minutes.5. The object got my attention via its actions... it was quite obviously notattached to a tower as it did move, but it seemed to be far too slow to be aplane, even a helicopter of which there are few to spare in this rural area. Though this is only a guess, Id think that had I been standing in one spot thewhole time of observation, the object may have only moved a few degrees acrossthe southern sky the whole time observed. Of particular note was theoscillation of the object... there was a definite but changing pattern to itspulsing... it went from staying a solid red for a good 30 seconds towards itsfirst off state and then sequentially speeding up to about 1hz before beginningto slow back towards another 30 second solid red.6. I finally walked into BestBuy, spent about 10 minutes inside, and came outand almost immediately reacquired the object... but at that point it was soclose to the artificial horizon signs, buildings, etc that I only saw it forabout another 30 seconds befor"],"files":["/var/www/straped/mufon/html2text/2039.html.txt","/var/www/straped/mufon/org/2039.html"],"Region":"Maine","Case Number":"2039","Longitude":"-68.777814","City":"Bangor","Object Features":"Undisclosed"}