{"trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around November 8th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/08/2009 07:16 UTC","City":"Charlotte","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path","divs":["Sighting DetailsTwice a week I travel this same specific route to a friend's house, every Sunday and Tuesday. Ever since my first sighting on February 10th on this route (An extraordinary experience where I passed within 100 feet of a saucer shaped UFO's base) I have began to consciously watch the sky for anomalies that aren't of human make. Earlier tonight I was traveling North on the inner loop of I-485. The weather was crystal clear. At this hour on this specific highway an individual can spot several planes making their decent into Charlotte Douglas international airport. This night was no exception. Shortly after I made my way off the ramp that connects I-85 North to I-485 North I spotted about half a dozen lights on the early night sky, all of which I assumed to be man-made airplanes. As I approached the first set of lights that I had assumed to be a plane I noticed that it wasn't actually moving, it was just sitting in the sky above the trees well off to the right of the highway, hovering. The lights were a triangle pattern, with a bright white light on each corner and 2 dimmer white lights on what looked like the two leading sides. There was also a dim red light in the middle sort of off-center on the object. When I noticed the peculiar immobility of the object my eyes became fixed on it and I started to slow down. The object seemed to be moving extremely slowly, I'd guess less than 10 or 20 miles per hour. There were clearly no blinking lights on the object that most all man-made planes have. I pulled over and got out of my car for a better look and to possibly snap a picture with my phone but within seconds it seemed to change the direction that it was drifting in and it descended out of view. Night had fallen and I could not make out much more than lights and a triangle shadow above the lights, yet the fact that it was clearly not moving like a plane should leaves no doubt in my mind that this object was not human made. After I had gotten back into my car to continue my trip I called a friend who did some sketches for me of my first sighting. Within a minute or two of calling him I had passed under what was clearly man made planes or helicopters traveling toward the direction of my sighting (although that direction was still the correct direction to travel to reach the international airport.). The dark sky hid the true nature of these crafts, yet I heard the muffled buzz of an engine or propellers. What was peculiar about these crafts was the fact that they were black and had minimal lighting. They were also moving much slower than typical plane which led me to believe they were helicopters. They also seemed to be t the relative same height as the low hovering triangle was, if not a bit higher in altitude. This is my second sighting this year and both have happened within a few miles from each other. I have read that these things are attracted to power plants. The McGuire nuclear station is just minutes from both of these sightings and may or may not have anything to do with these sightings."],"Disposition":"Unknown","Country":"United States","Region":"North Carolina","Tags":"City","Sighting Duration":"00:00:45","map":"<A HREF = \"http://maps.google.com/maps?q=35.230267,+-80.833507(20395)&iwloc=A&hl=en\"> mufon case (20395) map </A>","Summary":"Dark triangle with 6 distinct lights on the base","files":["/var/www/straped/mufon/html2text/20395.html.txt","/var/www/straped/mufon/org/20395.html"],"Object Features":"Other","Date Submitted":"11/09/2009 03:52 UTC","Weather Factors":"None","Latitude":"35.230267","Log Number":"US-11092009-0003","Case Number":"20395","Longitude":"-80.833507","Object Shape":"Triangle"}