{"Log Number":"US-11092009-0005","City":"Robinson","Viewing Distance":"Unknown","Object Features":"None","Summary":"huge orange light, turned blue and disappeared","Region":"Kansas","Date Submitted":"11/09/2009 11:33 UTC","Sighting Duration":"00:00:20","Source":"MUFON","Date of the Event":"11/06/2009 07:15 UTC","Case Number":"20397","divs":["Sighting DetailsSometime after 7 o'clock Friday night my husband and I were driving in a rural lake area, having dropped off one of the kids for an event, enjoying the beautiful weather while we had some time to kill. We had stopped the car and moved around a couple times admiring the night sky since it was dark (no city lights) and flat and we were able to get great views of the stars. We were both commenting that it had been a long time since we'd seen so much of the night sky, since we don't often find ourselves in the country at night. We were also talking about how many airplanes we were able to see. I commented that I don't see many shooting stars these days (didn't see any that night either) and this experience made me want to bring out a blanket and lay on my back staring at the stars. We decided to leave to head back to town and were just driving over the dam of the lake (I was driving) when we both saw at the same time out my window (would have been NE), a HUGE glowing orange light not far over the horizon. My window was down at the time. My husband said, \"What's that?\" and I said, \"It's way too big to be a planet.\" But it was red, like Venus. We were creeping along in the car looking at it when I decided to stop. Just as I was shutting the car down, it disappeared. My husband said that he observed it turn blue right before it disappeared, but I did not observe that as I was distracted with putting the car in gear and shutting it off. I only viewed the tail end of its disappearance. We never saw it move in the sky, just remain still then disappear. We both got out of the car at that point and continued to observe the sky for about 20 minutes, going back to the same spot to see if the mysterious bright light would return, but it did not."],"Longitude":"-95.410535","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/20397.html.txt","/var/www/straped/mufon/org/20397.html"],"Disposition":"Unknown","Weather Factors":"None","Latitude":"39.816669","Country":"United States","Object Shape":"Circle","trends":["There have been no other sightings in Robinson","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.816669,+-95.410535(20397)&iwloc=A&hl=en\"> mufon case (20397) map </A>","Tags":"City"}