{"Case Number":"20393","Date of the Event":"10/25/2009 06:45 UTC","Source":"MUFON","Region":"Wisconsin","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/20393.html.txt","/var/www/straped/mufon/org/20393.html"],"Date Submitted":"11/09/2009 12:07 UTC","Log Number":"US-11092009-0001","divs":["sighting detailsi was driving south on kettle moriane drive 1\\8 mi north of west bend wi. i glanced up at the half moon in the clear sky which centered in the upper wind shield when i noticed an unusual object moving west to east approaching the road i was driving on. it was approx twice the size of a twin prop plane, triangle shape (the bright half moon revealed the outline), with a luminous light at each rounded point. all three lights were pointed directly downward with the forward one being faded orange in color and the two rear lights being white. i pulled over and turned off the radio and opened the window to put my head out to get a better unobstructed view. the object made no sound as it traveled at approx 80 to 100 mi per hour at approx 800 ft alt. the entire sighting lasted 5 min until i lost sight of it beyond some trees. we have a local airport not far away and anything at this altitude should be comming from or going to it, but when i turned sw onto hihway d 2 min later it had bypassed the airport to the north headed east toward port washington and lake michigan."],"Latitude":"43.430168","trends":["There have been 3 other sightings in West Bend","There were no other sightings in West Bend on or around October 25th 2009"],"City":"West Bend","Country":"United States","Longitude":"-88.173888","map":"<A HREF = \"http://maps.google.com/maps?q=43.430168,+-88.173888(20393)&iwloc=A&hl=en\"> mufon case (20393) map </A>","Tags":"City","Weather Factors":"None","Object Shape":"Triangle","Sighting Duration":"00:05:00","Disposition":"Insufficient Data","Object Features":"None","Summary":"Triangle shaped object traveling from west to east at aprox 80 to 100 mi hr at aprox 800 to 1000 ft altitude"}