{"Date of the Event":"11/05/2009 03:00 UTC","Region":"South Carolina","Summary":"Seen from Cruise ship Crown Princess Starboard side after awakening from vivid nightmares","Latitude":"32.780056","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.780056,+-79.923072(20396)&iwloc=A&hl=en\"> mufon case (20396) map </A>","Weather Factors":"Windy","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around November 5th 2009"],"Log Number":"US-11092009-0004","divs":["Sighting DetailsI'd had terrible dreams during the night.The kind of dreams where upon awakeningyou are so sad and scared til you realize 'Oh,Thank God,it's only a dream!' I dreamt I saw a cat outside my cabin balcony window.Weird.I thougt to let it in and felt something nudge me. Scene changes and I see three ugly dogs.And I'm looking for the cat in three dark doorways. I only find a bloodless cat's leg. I'm so horrified. Then I'm back on the ship but it's heading into a cave system of three dark openings we are sailing into.I'm surrounded by a blackness and I awaken. I sit up in bed and look outside through the sliding glass door I see three dots of starry-light in a triangular formation rise up from below and right angle turn and float towards the bow. 'What the H is that?' I say aloud. I rush out onto the balcony but see nothing. I think, Could it have been a trick of the light on the glass, but where from we were in the middle of the ocean en route to Charleston ,SC from Norfolk, VA.Perhaps an oceanic anomaly. What is strange to me is the series of threes that were in the dream."],"Source":"MUFON","Longitude":"-79.923072","Case Number":"20396","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Shape":"Star-like, Triangle","Viewing Distance":"21-100 Feet","Date Submitted":"11/09/2009 11:20 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/20396.html.txt","/var/www/straped/mufon/org/20396.html"],"Object Features":"None, Unknown","City":"Charleston"}