{"Case Number":"20403","Object Features":"None","Summary":"I filmed a very bright light in the sky at night after 9:30pm back in October of 2002 or 2003","Latitude":"32.810325","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around September 30th 2003"],"divs":["Sighting DetailsI was on my way back from bible study comming down walnut hill going east when I noticed a bright light in the sky. I knew it could not have been venus or the evening start because it was just too bright. At the time we were living in a condo at Trinity Meadows on 9696 Walnut street. When I got to the apartment I ran upstairs and grabbed my camera and started filming. I was standing behind a fence that separated the condos from the soccer field behind Richland Community College. The film is a little shaky and grainy at first (until I swithced to night vision). I tried to get shots of the backround for reference. I even filmed several planes flying by it. It was perfectly round adn appeared to be changing colors. I believe I filmed for atleast an 45 mins. I even asked a couple of other people out if they could see it and explain it. You'll hear. I also saw it the nigt before but dismissed it and didn't think anything of it. But it did not return after i filmed it. I checked every night for a week. SO OF THE SHOTS ARE SO CLEAR THAT I BELIEVE YOU CAN ACTUALLY SEE IT 'SPINNING'. I called my condo and got the time...quit filming....went in to get something to eat when I came back outside I continued filming but it had moved 'north' a bit and seemed to be lower on the horizon. It gets shaky towards the end but you can see it 'drift' or 'float' behind a light post as it seems to grow dimmer and it doesn't come out the other side??I filmed for a bit longer but it never showed up.....I didn't report it to anyone but did let some close friends and 'professional' people see it too adn they could not identify or explain the light I filmed....which was silent. You can clearly hear when another plane flys by...but this thing didn't make a sound. The date and the time are approximate....it has been a long time."],"Region":"Texas","Date Submitted":"11/09/2009 04:46 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.810325,+-96.760313(20403)&iwloc=A&hl=en\"> mufon case (20403) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Country":"United States","Log Number":"US-11092009-0011","Sighting Duration":"Undisclosed","Longitude":"-96.760313","Date of the Event":"09/30/2003 10:00 UTC","Disposition":"Unknown","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/20403.html.txt","/var/www/straped/mufon/org/20403.html"],"City":"Dallas","Tags":"City","Source":"MUFON"}