{"Disposition":"Insufficient Data","Country":"United States","divs":["Sighting DetailsI was on American Airlines flight 3030 from San Francisco to St. Louis onDecember 17, 2002. We were descending into St. Louis under partly cloudyconditions and I was seated on the right side of the plane a Boeing 757 in anexit row seat 10F. I was looking out the window, watching the ice crystalswithin a cloud as they were illuminated by the planes strobe light, when twobright white lights came out from underneath our aircraft at a distance of7E50 meters approximate since I find it hard to estimate distance when lookingout of a plane under normal conditions, let alone at night in a cloud.The two lights were identical to those found on the tips of aircraft wings,spaced approximately as a wingspan, which led to my initial thought that we hadhad a close call with another aircraft. The lights continued to rise whilemoving away from our plane for about 20 seconds. I mentioned to my seat matethat I thought wed nearly been hit and he looked out and saw the lights as theymoved away.I continued to watch the lights, for about 20 seconds, as they rose to ouraltitude and at an unknown distance but still visible within the cloud. From theframe work of lights on the tips of an aircrafts wings, the lights then rolledto the right 180 degrees, before coming back towards our plane. When firstnoticed, the midpoint of the two lights was centered forward of my seat, and asthey returned they were further back towards the tail of the plane.At that point, I assumed they were the lights of another plane due to theirresemblance with the wingtips lights of aircraft and their behaviour as ifconnected by a rigid body. As they neared our plane, they gained a litlealtitude and disappeared just before they would have passed over our plane.As mentioned, I first assumed the lights to be connected with another aircraft.But, as I thought about it further, I realized that another aircraft would havehad other lights on under those conditions the red and green lights on the topand bottom of the fuselage, the strobe lights, and the headlights. None of thesewere observed. Also, with the lights performing a 180 degree roll assuming theywere connected the other craft would have been inverted either when passingunder or over our plane.I havent been able to explain this to myself. Maybe someone else from the planesaw something, and thought to report it as well."],"Date Submitted":"12/17/2002 07:00 UTC","Date of the Event":"12/17/2002 07:00 UTC","Viewing Distance":"21-100 Feet","Object Shape":"Undisclosed","Region":"Missouri","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.635702,+-90.198064(2040)&iwloc=A&hl=en\"> mufon case (2040) map </A>","files":["/var/www/straped/mufon/html2text/2040.html.txt","/var/www/straped/mufon/org/2040.html"],"trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around December 17th 2002"],"Longitude":"-90.198064","Sighting Duration":"00:05:00","City":"St Louis","Latitude":"38.635702","Log Number":"","Case Number":"2040","Tags":"City","Weather Factors":"Rain","Summary":"Lights seen from aircraft window, close encounter","Object Features":"Undisclosed","Object Flight Path":"Unknown"}