{"Date Submitted":"11/09/2009 10:35 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.739614,+-84.328341(20419)&iwloc=A&hl=en\"> mufon case (20419) map </A>","files":["/var/www/straped/mufon/html2text/20419.html.txt","/var/www/straped/mufon/org/20419.html"],"Object Flight Path":"Hovering then path","Object Shape":"Sphere","Sighting Duration":"Undisclosed","trends":["There have been 10 other sightings in Loudon","There were no other sightings in Loudon on or around October 29th 2009"],"City":"Loudon","Date of the Event":"10/29/2009 06:55 UTC","Region":"Tennessee","Source":"MUFON","Disposition":"Unknown","divs":["Sighting DetailsI was on my way to work. I was driving down commerce street in Loudon. there is a train track that run along side of commerce street. I was driving, there was a train coming down the track a few second before I got to highland ave at the stop sign. I notice the railroad crossing gates was going up and down, while the train was going by the crossing at highland ave. that was weird to me. I turn right onto highland ave. then I turn left at the warehouse gate. there was two guys. David and Jerry waiting in a truck for me to open the gate. I got out of my car and unlock the gate. then I walked back and got into my car and the two guys in the truck drove on in and park the truck in front of the warehouse, then they got out of there truck. they had to wait for me to open the warehouse door. then I pulled in and parked my car a different area in the parking lot. I got out of my car and started walking toward the warehouse door. then David said what is that in the sky. I turn around and looked up and started watching it . David keep asking me what it was then I told him it was a UFO. I keep watching the UFO. it was moving slow around 5 miles a hour, it was about 200 feet off of the ground flying across the parking lot. it was a round ball of light about the size of a basketball. the light was not like a regular light. like a star light color I stop watching the UFO. then I turn around and started unlocking the warehouse door. then I walk inside of the warehouse and unset the burglar alarm. David and Jerry walk in after I got the burglar alarm unset. I went back out the door to see if the UFO was still out there it was still there moving slow . I watched the UFO until it was out of sight."],"Case Number":"20419","Longitude":"-84.328341","Weather Factors":"Fog","Viewing Distance":"101-500 Feet","Log Number":"US-11092009-0027","Object Features":"None","Summary":"a ball of light flew acoss the parking lot when i arrive to work that morning it was a star light color but it was big as a baskeball","Latitude":"35.739614","Tags":"City"}