{"map":"<A HREF = \"http://maps.google.com/maps?q=42.276471,+-89.091265(20418)&iwloc=A&hl=en\"> mufon case (20418) map </A>","Log Number":"US-11092009-0026","Viewing Distance":"Unknown","Summary":"flying cigar shaped object observer by 3 or more","Latitude":"42.276471","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","City":"Rockford","Case Number":"20418","Region":"Illinois","Date Submitted":"11/09/2009 10:34 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsWhile traveling east on Harrison avenue to go to Cherryvale Mall I observed an object in the sky that didn't look like a plane. It was already getting dark and we could tell the object had NO lights blinking at all. I brought this to the attnetion of my daughter and at first she didn't see it as it had gome behind the trees. I traveled a little further east and turned off Harrison Blvd. with hopes that we could see it again. Sure enough it magically appeared again in the open so we could all see it. As the object continued to move eastward, we re-entered eastbound Harrison Blvd and made the turn to go northward towards the object and the mall. I turned into a business right away which gave us a clear view of the sky where the object had been and was traveling to, but we lost view of the object. We carefully observed the area and sky for several minutes looking for any clue of other possible aircraft, balloons, helecopters, birds, and ahything else that might be the object we had observed, but there was nothing in the area. The object had just vanished. We all agreed that the object we had seen was not a plane. The was not visible trail left behind the object. The conditions were as follows. The time was 440pm CST. The sky was clear with a few clouds, but the sky was blue and it was starting to get a little dark. What made me notice the object was that it was larger than a normal airplane for the distance it was from us and it had no lights. Also it was traveling slower than a normal plane for that size of an aircraft."],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/20418.html.txt","/var/www/straped/mufon/org/20418.html"],"Source":"MUFON","Date of the Event":"11/09/2009 04:40 UTC","Longitude":"-89.091265","Country":"United States","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around November 9th 2009"],"Disposition":"Unresolved","Object Shape":"Cigar"}