{"Source":"MUFON","Date Submitted":"11/09/2009 09:14 UTC","Region":"Maryland","Date of the Event":"11/08/2009 06:30 UTC","Country":"United States","Object Shape":"Unknown","Tags":"City","Case Number":"20413","Longitude":"-76.658577","trends":["There have been no other sightings in Parkton","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.644112,+-76.658577(20413)&iwloc=A&hl=en\"> mufon case (20413) map </A>","Object Flight Path":"Undisclosed","Latitude":"39.644112","divs":["Sighting DetailsMy bro in law and myself had just arrived at my house , parked at the top of my driveway at right around 6:30 pm. It was dark , and we were unloading firewood. I noticed an extremely bright light moving from the southwest to the northeast , the object appeared to be cruising altitude for a jet, I see plenty of them day and night. It stood out because of it's intense brightness and it was moving at a good speed, above average for something that high to move across the whole sky in a minute or so. As it got closer the light remained intense, so much so that it made my eyes blur a bit when staring. As it flew directly over head I pointed it out to my brother in law, he commented that it hurt his eyes to watch it, I pointed out that there were no blinking lights at all, he acknowledged this and agreed that this was peculiar . When the object was about 80% across the sky it faded very fast and dissapeared completely . We stood there dumbfounded and I commented that he had witnessed his first UFO. We both agreed that that was not a plane and we had witnessed something very peculiar. As far as the sky, it was clear and dark with lots of stars visible as well as moving aircraft."],"City":"Parkton","Object Features":"Undisclosed","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-11092009-0021","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20413.html.txt","/var/www/straped/mufon/org/20413.html"],"Summary":"ultra bright object"}