{"Longitude":"-83.147062","Log Number":"US-11092009-0025","files":["/var/www/straped/mufon/html2text/20417.html.txt","/var/www/straped/mufon/org/20417.html"],"Viewing Distance":"21-100 Feet","Latitude":"42.664916","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Rochester Hills","Object Flight Path":"Path then hovering","Disposition":"Unknown","Date Submitted":"11/09/2009 10:15 UTC","Source":"MUFON","Summary":"Three metallic spheres flying in formation","divs":["Sighting DetailsBack in the summer of 1994 my folks were having a family pool party. I was not outside at the time, but in the kitchen. I heard my Dad calling me loudly from outside. Not sure what he wanted I went out onto the deck to see him pointing up in a south easterly direction. Coming over the neighbor's house behind us, where three beige metallic spheres flying in a v formation, approximately a 100 feet in the air, heading in a north westerly direction. One in front and two spread evenly behind the first. There was absolutely no sound coming from these objects. The spheres then stopped moving and lined up in a perfectly straight line. One next to the other. They then began to rotate their positions, juggling their positions in perfect unison. They did this for a short period and then went into the v formation again, before continuing their movement in a north westerly direction. We watched them go over our house until we couldn't see them anymore. At the time everyone was a little stunned by what they saw. I remember feeling unnerved by what we had just seen, knowing that they were not balloons of any type and their behavior suggested deliberate, intelligent movement."],"Object Features":"None","Country":"United States","Tags":"City","Case Number":"20417","map":"<A HREF = \"http://maps.google.com/maps?q=42.664916,+-83.147062(20417)&iwloc=A&hl=en\"> mufon case (20417) map </A>","Region":"Michigan","Object Shape":"Sphere","Date of the Event":"05/31/1994 12:00 UTC","trends":["There have been 10 other sightings in Rochester Hills","There were no other sightings in Rochester Hills on or around May 31st 1994"]}