{"Case Number":"2041","Weather Factors":"Unknown","Object Shape":"Cylinder","Log Number":"","Object Flight Path":"Straight-line path","trends":["There have been 3 other sightings in DeLand","There were no other sightings in DeLand on or around December 4th 2002"],"Object Features":"Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.028318,+-81.303118(2041)&iwloc=A&hl=en\"> mufon case (2041) map </A>","Summary":"Cigar shaped objects observed in Deland, Florida","City":"DeLand","Country":"United States","Tags":"City","Longitude":"-81.303118","divs":["sighting detailswitness stated that he had taken his step-son to see the eye doctor and that hewas sitting in the office reading a book. as he was sitting there, somethinginside him told him to go outside but he ignored the feeling. again, he got thesame feeling and this time went outside, not knowing why. while outside, herolled a cigarette and as he was rolling the cigarette he heard a loud noisethat sounded like an owl hooting. he could not believe that an owl would behooting in the daytime. as he started to scan the trees looking for the owl, heobserved two cigar-shaped objects in the sky. they appeared to be playing tag,as one would zoom forward and stop until the other one would catch up; then theother one would zoom forward and stop. he watched these cigar-shaped objects forabout 5 minutes, during which time the owl continued to hoot. as he watched thetwo craft, they appeared to go out like a light bulb going on\\off - they werethere and then they were not. at this time, he observed two other adults thatwere also watching the objects. he asked them if they were seeing the same thingas he was seeing and they said they were. he ask them for their names but theyrefused to give him that information and got into their vehicle and left. as hewas standing there, he again heard the owl hooting and looked up and observedanother cigar shaped craft. he does not know if it was one the original onesthat he observed or a new one. it too would speed forward and then stop. hestates that after a minute, it shut down like a lightbulb and he could not seeit any more. as he was looking in the sky, he observed 4 jet fighters circle theareas where the craft was observed and then they left heading east.witness states that he has had numerous ufo sightings in his life and that thiswas the first time that the had seen a cigar shaped object and the first timethat he had seen fighter jets come to where the craft had been."],"Date Submitted":"12/04/2002 08:00 UTC","Sighting Duration":"00:05:00","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Region":"Florida","Latitude":"29.028318","Date of the Event":"12/04/2002 08:00 UTC","files":["/var/www/straped/mufon/html2text/2041.html.txt","/var/www/straped/mufon/org/2041.html"]}