{"Date Submitted":"11/10/2009 12:35 UTC","Country":"United States","Weather Factors":"Unknown","City":"Lufkin","Date of the Event":"11/09/2009 10:30 UTC","trends":["There have been 7 other sightings in Lufkin","There were no other sightings in Lufkin on or around November 9th 2009"],"Sighting Duration":"00:02:30","Source":"MUFON","Object Features":"Unknown","Viewing Distance":"Over One Mile","Latitude":"31.346681","Region":"Texas","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was outside smoking a cig', saw a very bright light in the east north east sky. It was moving very fast, with no apparent airplane or helicopter lights. The light stayed very bright and moved horizontally towards the north. Id estimated the distance at five miles or so but could have been much further. My mind doesnt want to believe that because the further away it would have been would have suggested it going much faster than any planes can fly and the size of the object would've been very large as well. After about two minutes of tracking this thing my friend went inside to get a camera, when it all of a sudden blinked out. After about five seconds it blinked back on again at the same distance, estimated, that it would've traveled had it been visible the whole time. It blinked on and off two more times, a total of three, when it finally stayed off. I was watching from a porch on a hill with two other witnesses. All of us had a very good and a large panoramic view of the skyline over the trees. There were two separate airplanes in different directions flying at the same time overhead. This was nothing unusual to me because we see them all of the time. I grew up on a military base and am very familiar with all types of aircraft. I am an amateur astronomer who knows what a satellite and a meteorite look like as well. Definite ufo in my book, wish Id had time to get a pic...."],"Summary":"Very bright light, no fading or blinking, fast moving orb of some kind","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/20426.html.txt","/var/www/straped/mufon/org/20426.html"],"Log Number":"US-11102009-0002","Case Number":"20426","Disposition":"Unknown","Longitude":"-94.719407","map":"<A HREF = \"http://maps.google.com/maps?q=31.346681,+-94.719407(20426)&iwloc=A&hl=en\"> mufon case (20426) map </A>","Tags":"City"}