{"Longitude":"-99.895353","Latitude":"31.975699","files":["/var/www/straped/mufon/html2text/20421.html.txt","/var/www/straped/mufon/org/20421.html"],"Case Number":"20421","Log Number":"US-11092009-0029","trends":[],"Viewing Distance":"Unknown","Tags":"City","Date of the Event":"11/09/2009 06:30 UTC","Object Features":"Undisclosed","Date Submitted":"11/09/2009 10:56 UTC","Country":"United States","divs":["Sighting DetailsI have seen a strange sphere flying object one morning when leaving work around 5 am and since then I have been watching the skies diligently and know very well the difference between airplanes small and large and helicopters by now I can tell by the light patterns what an object is. I was leaving work and it was right around 6:15-6:30 am and at first when this caught my eye I thought it may be a possible helium balloon or a weather blimp, I knew it was not a plane or helicopter. It was fairly long and the shape of a non cut cigar at one end had a white strobe light flashing very fast almost looked like a sparkler and at the opposite end it seemed wider but not to much and had white lights that flashed from side to side and when it was actually in flight going in front of me with the wide end farthest away from me it seemed that the lights on the wide end were more to the left of the aircraft not in total synch but strangely to the outside of the left. When I first came up on it it was hovering in a slanted direction yet seem to be flying in that position the same direction as I was driving and as I came up close to it I could see it very clear then, it's position turned straight and was still flying in front of me to my right and as it flew ahead of me I saw that it looked as though it were metal and glass, the rounded end being metal and in the middle it was a mixed make up of glass or clear material outlined in metal, at the wide end there was metal in the middle then the clear on each side outlined in the metal and at the end of the wide end there was a dome right in the middle of it which was smaller than the width of the end, there was no light on the dome. As it flew beyond me it got pretty far then stopped and hovered there until I came up on it again and as I drove under it I could see it very well and all of a sudden it started flying backwards with the cigar end leading. I thought that it was gone and that was the last of it so I kept driving and watching the sky and was sad that it was gone but from the corner of my eye I saw it soaring ahead again to my left side this time flying fast, and again it stopped until I came to it and it started going backwards again. I remembered thinking does this thing know I am watching it and I wish it would follow me to my house so my kids could see this, it was astounding and I wondered if any of the people in the cars passing by had noticed it besides me but, as it flew backward I figured that was it but in a bit it was up on my right side again and this time it soared ahead flying strangely sideways and kept going farther to the right more toward the west. I was on LBJ about to go east on I30 taking the Texarkana exit and lost sight of the object at that time. I have my own Ideas and thoughts on this but who really knows at this point. Someday I feel we will all know exactly what they are...."],"City":"Undisclosed","Object Flight Path":"Undisclosed","Source":"MUFON","Summary":"Cylinder metal and glass aircraft with strobe like flashing white light in the rear and back and forth white light in front..","Sighting Duration":"Undisclosed","Region":"Texas","Object Shape":"Cylinder","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.975699,+-99.895353(20421)&iwloc=A&hl=en\"> mufon case (20421) map </A>","Weather Factors":"Unknown"}