{"Case Number":"2043","Tags":"City","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=41.520052,+-81.488732(2043)&iwloc=A&hl=en\"> mufon case (2043) map </A>","Object Features":"Unknown","City":"Lyndhurst","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/2043.html.txt","/var/www/straped/mufon/org/2043.html"],"Object Flight Path":"Straight-line path,Path with directional change","Disposition":"Unknown","trends":["There has been one other sighting in Lyndhurst","There were no other sightings in Lyndhurst on or around February 16th 1995"],"Source":"MUFON","Latitude":"41.520052","Sighting Duration":"00:30:00","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","Summary":"Three strobing, lights accompinaned by loud roarin","Country":"United States","Date Submitted":"02/16/1995 09:30 UTC","Date of the Event":"02/16/1995 09:30 UTC","Region":"Ohio","divs":["Sighting DetailsAt 2130 hours on 2-16-95, while reading, ironically, Timithy Goods book, Abovetop secret, I heard what I thought was a large jet passing overhead. This isnot unusual, as a small airport is nearby and our home is in the path of flightfor it and the larger Hopkins airport, twenty miles west of here. As Icontinued reading, I realized that the jet roar was getting louder andsustaining itself, seemingly overhead. I glanced out the west window of theroom and saw three strobing lights, like aircraft lights, in the west sky atabout 40 degrees. The were arranged in a flat triangular shape, two of theclose and the third some distance away. At arms length, that distance was abouteight inches. The close lights would strob together, the third strobing afterthe others had cycled off. The cycle took one second, but the interval betweenthe strobing was about one fifth of a second. In other words, the three lightswould strob, first the two, then the one, leaving a blank spot for four fifthsof a second.I watched for about one minute, opening the window to listen to the roaringsound, which was comming from the direction of the lights and filled the area. It was a cold night, and I closed the window. I realized that the lights werenot moving. I called my wife, who thought they were aircraft, but she soonrealized that they were different, due to the lack of motion. At that point,she became disturbed, saying I dont want to know what that is and left the room. I picked up a pair of 7 x 35 binoculars at this point and looked for anyoutline of a craft, but could see none. The space between the lights was thesame as the surrounding sky, flat, gray and overcast. The lights did not seemto be near the cloud base, as there was no reflection on the clouds. I guessedthat the lights were around 1,000 up at most. After 3 minutes of observataion,I noticed a slight movement towards the west. I continued watching it moveslowly west, this taking around nine more minutes. It never occured to me tograp my camera, I was just glued to the binoculars. As it got lower in the sky,and was about to dissapear behind the roof tops, I noticed the lights rotateslightly to the north, then fade back to the west. At that point, visuals werelost as it went"],"Longitude":"-81.488732"}