{"Log Number":"US-11102009-0011","Summary":"Shooting star-like","Date Submitted":"11/10/2009 11:34 UTC","Latitude":"35.158574","Case Number":"20435","divs":["Sighting DetailsLast night at around 2:45 AM, I let our big orange cat out so he could do big orange cat related things. I was swaddled in my robe against the the November chill. I was wide awake from too much coffee earlier in the day and decided to have a cigarette on the porch. I live in the middle of the city and our house is located almost directly under the path of incoming air traffic from Memphis International Airport. 3AM is magic time because FedEx recieves most of their overnight packages starting then. I can sit outside and literally see the rivets on the underbelly of incoming cargo planes. So, I am sitting on the porch, just flicked the cigarette in the yard (I'll pick it up later), and petting my big orange kitty, Sam, when it dawns on me that the air traffic has thinned to nearly zero. Maybe it was a slow night in the overnight shipping business...who knows, right? Sometimes it's slow, sometimes it extremely heavy. At this point, I get up to go back inside. Just as I am walking opening the door, I hear the Doppler Effect of really loud, fast engines. The cat scurries in and I walk back out. I missed the first jet, but not the second and third. Memphis INT. has a National Guard base within it's borders, so again, not a big thing to see fighter jets landing or taking off. What made me stay outside was the fact that these guys aren't landing. Instead they are flying around, criss-crossing the city. I sit back down on the steps and look up. As soon as I look up, I see a shooting star. I think, \"Rad!!! Jets and meteors!\" The shooting star appeared on the horizon directly in front of me then skimmed the atmosphere from a six o'clock position to about the mid-way point in the sky from my point of view (figure that out in your mind). It was bright white and awesome. At this point the jet sounded as if they pulled off their engines and went in for a landing. Then the shooting star reappeared... High, very high in the sky, directly over head. I stared at it and thought, \"Huh...it slowed down.\" At this point, I was still thinking it was a meteor or something. Then the damn then made a slow, wide arch to my left and doubled back on itself. It then made a very fast, serpentine movement back to the six o'clock position and quickly faded from view. I sat there and it occured to me that I had seen a ufo. I couldn't sleep. I literally sat on the porch for half an hour, then sat on the couch until daybreak. I was scared for some reason because right before the thing faded from view (and I will swear on my life) there was a flash that lasted a fraction of a second that lit up my street . I know it wasn't a trick of my eyes because every dog in the neighborhood lost it's mind at the same time. Anyways, that's my story..."],"Disposition":"Insufficient Data","Date of the Event":"11/10/2009 03:15 UTC","files":["/var/www/straped/mufon/html2text/20435.html.txt","/var/www/straped/mufon/org/20435.html"],"trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around November 10th 2009"],"Object Shape":"Star-like","Viewing Distance":"Unknown","Region":"Tennessee","City":"Memphis","map":"<A HREF = \"http://maps.google.com/maps?q=35.158574,+-90.04074(20435)&iwloc=A&hl=en\"> mufon case (20435) map </A>","Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-90.04074"}