{"map":"<A HREF = \"http://maps.google.com/maps?q=35.981453,+-78.508523(20431)&iwloc=A&hl=en\"> mufon case (20431) map </A>","Date of the Event":"09/17/2009 08:15 UTC","divs":["Sighting DetailsI am reporting this on behalf of my finance, who has looked over the report and confirmed its accuracy. I have attached photos from a report of a recent UFO event in Sicily on September 26, 2009 that looks almost identical to what she saw but for the coloration, and her report refers to the photos of that sighting... She witnessed a very similar UFO at about 8:15 AM, 17 September 2009, as she was driving on Forrestville Rd. from Heritage subdivision toward Hwy. 401, continuing past the power lines on the left near the entrance to Stonegate subdivision. Around the next bend, as the road straightened she saw a large orb just over the tree line. The orb was about the size of a softball (at arms length), and had a brilliant fluorescent yellow coloration. It stood out against the grey, overcast morning sky. Shortly after seeing the orb, it appeared to flip over on its side, changing into a generally rectangular shape; and flew off at an angle, disappearing within a second. There was no sound nor contrail, but she is uncertain how far away it was. A car was traveling in front of her but she could not catch it to ask the driver if they saw it too. The entire experience lasted 5-7 seconds. It was a very odd experience, and she has never witnessed anything remotely like that before or since."],"Object Shape":"Circle, Square, Rectagular","Tags":"City","Date Submitted":"11/10/2009 07:59 UTC","Log Number":"US-11102009-0007","Summary":"Large Orb Spotted in Raleigh, NC","trends":["There have been 2 other sightings in Wake Forest","There were no other sightings in Wake Forest on or around September 17th 2009","This sighting has never been favorited.",""],"Region":"North Carolina","Object Features":"Undisclosed","Sighting Duration":"00:00:07","Object Flight Path":"Undisclosed","Latitude":"35.981453","Case Number":"20431","Country":"United States","files":["/var/www/straped/mufon/html2text/20431.html.txt","/var/www/straped/mufon/more/20431_submitter_file1__ufosicily.jpg","/var/www/straped/mufon/more/20431_submitter_file2__ufosicily2.jpg","/var/www/straped/mufon/org/20431.html"],"Viewing Distance":"Unknown","Longitude":"-78.508523","Disposition":"Unknown","City":"Wake Forest","Weather Factors":"Unknown","Source":"MUFON"}