{"Country":"United States","Log Number":"US-11102009-0006","Source":"MUFON","Object Features":"Dome","Viewing Distance":"20 Feet or Less, Unknown","Object Flight Path":"Stationary,Hovering then path","divs":["Sighting DetailsMy boyfriend and I were listening to the Blossom Goodchild stuff about the \"federation of light\" And how they were supposed to visit. Well in trying not to be 100% claimed by it, we were unable to pull ourselves to not think about it. So the night of \"said arrival\" We stayed up late looking into the sky. He was at his house and i was at mine. I went outside with a blanket and laid on my porch at about 10:00 PM. My father came outside to smoke a cigarette. We talked about why i believed in UFOs and other acts of this \"sci-fi\" stuff as he called it. After about 2 hours of my sitting in the cold he cam back outside with some hot tea and asked if anything had happened yet. Then just after he asked that and i said no, he asked me what \"that\" was; first we saw this item which looked like a normal shooting star, but it was huge and shot across the sky, then we heard an explosion and it broke into 3 different lights. We wrote it off as just being a shooting star that exploded upon hitting the atmosphere, and continued on it's path (But we never thought we would hear it). About 30 minutes after that, I saw this weird star above the trees from the direction that the shooting star had disappeared, it was changing colors but just staying there, I was confused and asked my dad if he could see it, because I figured My eyes were playing tricks on my after starring at a black sky for 2 hours, He said he could see it but not when he was looking directly at it, he could only see it when he looked to the side of it. It was changing from blue, to red, green, yellow, and then white. We talked about what it could be, feeling bad that my telescope broke just 3 months before, and figured it was just reflecting off the clouds, and that it was just the city lights, it never moved all night. We waited to see if anything else would happen, at about 2:30 AM I saw this item from around that star all the sudden there was an orange light. I called my dad back outside to ask him what it was. It was to big to be a satellite, and moving to fast, but it was still moving slow. My dad pointed at it and said \"See that, sometimes planes turn on their front lights, and they have an orange tint to them, it's probably just a plane\", but we watched it for an hour slowly moving over the sky, never blinking. At one point it was right over us and almost stopped. Usually if a plane was that close, we would see the lights blinking, it seemed to be big enough like a plane Only about 300 feet in the air, but it looked small enough to be a plane 2000 feet in the air, i was confused how it could look two different sizes. It was just a solid orange color I went inside to get a camera but it was pitch black and the only camera i had was a little 50$ one, that can't even pick up the moon on a dark night. We followed the light until it started to speed up, just before it hit the tree line it shot almost straight up into the air, and the orange light turned a red color. My dad and I looked at each other, and I shouted \"OH MY GOD! I know you saw that! That was NOT a plane!!\" My dad sat down and was trying to think, trying to label it as any and all technological item he ever saw. He said when he was working on the air craft carrier before I was born they saw three of those things, each time at the same time. When they asked the captain he just said \"The air force never tells us when they like to run their planes.\" But my dad swears he was in the room with the radar and nothing came up one night. He said \"We saw an airplane and caught it on radar, but something was right behind it, that same orange color, but the only thing that came up was the air plane. We radioed the plane and asked if the captain could see any lights around it, and he answered no, but we followed it until the plane was out of sight, the light stayed at least 400 feet behind the plane, until it just vanished. It looked so bright the captain had to have seen it.\" He went back inside saying \"I don't believe all this crap\" and told my mom, She came out and talked to me about how every time about 20 years someone claims to speak to aliens and how i shouldn't get my hopes up like she did when she was my age. She explained that it was a little weird all this was happening on the night my boyfriend and I had talked about for 4 months but that it was all coincidental and could be explained. I called my boyfriend and told him about it, he said he never saw anything but that he heard an explosion about 3 hours ago, when I had seen the shooting star. But he said you should never be able to hear when a shooting star explodes like that. We talked about that night for the rest of the night, I never saw anything else that night and never went to sleep. I asked my other friends and they all heard the explosion but never saw anything."],"City":"Chattanooga","Date Submitted":"11/10/2009 04:16 UTC","Summary":"Orangish light in sky","Sighting Duration":"05:15:11","Weather Factors":"Windy","Region":"Tennessee","trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around October 8th 2008"],"Tags":"City","files":["/var/www/straped/mufon/html2text/20430.html.txt","/var/www/straped/mufon/org/20430.html"],"Date of the Event":"10/08/2008 02:35 UTC","Case Number":"20430","map":"<A HREF = \"http://maps.google.com/maps?q=35.05036,+-85.30104(20430)&iwloc=A&hl=en\"> mufon case (20430) map </A>","Disposition":"Unknown","Object Shape":"Fireball, Oval, Star-like","Latitude":"35.05036","Longitude":"-85.30104"}