{"files":["/var/www/straped/mufon/html2text/20436.html.txt","/var/www/straped/mufon/org/20436.html"],"Viewing Distance":"Unknown","Date of the Event":"11/04/2009 09:11 UTC","Source":"MUFON","Summary":"Very beautiful ship have seen many/ This one had red lights on it.","divs":["Sighting DetailsIve been terrized for 10 long months now. Have had more clamps then I do body. Tried to be friends with these guys but the ones left on my land and oin my neighborhood are not good at all.. They are greens and have possibilaty traped a wonderful gray Alien in side of my body.. Left to die in spirit form. I have billions of little cloan souls in side of my body. My daily routene is to try to get as many of them out as posible. MY eyes are now distroyed,my bones are now distroyed, I no longer have a life left. Every day and nght I'm going threw hell. I killed my self 2 times and they keep saveing my life just to continue to distroy my life. Im now considering driving my van off of a cliff hoping that will free me but probably not since they are very good healers. Im not aloud to live and im not aloud to die. I can no longer work and im now in total isolation. Im only 40 years of age and my life is now ruiened. I have more clamps than I have a body. They keep clamping and un clamping making me clinge and I now can barley move. My 14 Year old child is clamped as well but at least theres no wires with it. They constantly heat my body up just like right now threw there wires that go with the clamps. Ive tried to be friends with them but all they want to do is distroy me for no reason. Ive been praying for 9 months and cant get God and Jesus they have new technology to block prayers. Just dont know what to do any more. I really wish I never moved to this state. Pleas help me!!!! Angel Francisco 104 G and E Circle Inwood WV, 25428------( 304) 229-6109"],"Date Submitted":"11/10/2009 01:35 UTC","Case Number":"20436","Object Flight Path":"Stationary,Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=39.46345,+-77.959087(20436)&iwloc=A&hl=en\"> mufon case (20436) map </A>","Object Shape":"Circle, Square, Rectagular, Triangle","Latitude":"39.46345","Object Features":"Unknown","Disposition":"Hoax","City":"Martinsburg","Log Number":"US-11102009-0012","Weather Factors":"Unknown","Region":"West Virginia","Country":"United States","Longitude":"-77.959087","Sighting Duration":"01:00:00","Tags":"City","trends":["There have been 9 other sightings in Martinsburg","There were no other sightings in Martinsburg on or around November 4th 2009"]}