{"map":"<A HREF = \"http://maps.google.com/maps?q=51.45232,+-0.967991(20447)&iwloc=A&hl=en\"> mufon case (20447) map </A>","Longitude":"-0.967991","Date Submitted":"11/10/2009 09:24 UTC","divs":["sighting detailsthere were seven hot air ballons in the sky above my house my aim was to take a photograph of them all in one shot. i noticed a small group of white clouds that seemed to be following the balloons. they were out of place as the sky was clear blue & they were the only clouds in the sky. i then saw the sun hit an object in the sky, the sun reflected off the object, created a dazzeling star affect. my sister also saw this. as this happened & we both said wow! what was that. we lodgically said maybe the sun had shone on a plane as it had banked while changing it's course. i watched the balloon's untill they all decended one by one in the same area. i thought i saw several shiney objects during this time but could not be sure as they were brief glimpses. as i watched the last balloon decend i then saw the massive dark disc very clearly move across the horizion from right to left. i then lost sight of the object. the objects seemed to be following\\observing the hot air balloon's. these objects can be seen in most of the photograph's i had taken that day of the hot air balloon's. i was at home - at one point i spoke to my sister on the phone - she was travelling in a car on the m25 towards london, i asked her if she could see the balloon's she could see the same ballon that i was observing as we spoke, she described the balloon to me it was the only multi-coloured balloon in the sky as the others were red. we both saw the object reflecting the sun creating a massive bright star in the sky."],"Summary":"Seen while taking photo's of hot air balloons","Country":"United Kingdom","Object Shape":"Cross, Disc","Disposition":"Unresolved","Latitude":"51.45232","Source":"MUFON","City":"Reading","Weather Factors":"None","Date of the Event":"09/14/2008 06:27 UTC","Log Number":"GB-11102009-0023","files":["/var/www/straped/mufon/html2text/20447.html.txt","/var/www/straped/mufon/more/20447_submitter_file1__2shapesinsky.JPG","/var/www/straped/mufon/more/20447_submitter_file2__threeshapesinthesky.JPG","/var/www/straped/mufon/more/20447_submitter_file3__oneshapeinsky.JPG","/var/www/straped/mufon/org/20447.html"],"Case Number":"20447","Sighting Duration":"Undisclosed","Region":"","Tags":"City","Object Flight Path":"Other","trends":["There have been 48 other sightings in Reading","There was one other sighting in Reading on or around September 14th 2008","This sighting has never been favorited.",""],"Object Features":"Unknown","Viewing Distance":"Unknown"}