{"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Hawkins","This sighting has never been favorited."],"Object Features":"Dome, Window(s)","Country":"United States","Latitude":"45.514968","Date Submitted":"11/10/2009 05:30 UTC","City":"Hawkins","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/20443.html.txt","/var/www/straped/mufon/org/20443.html"],"Weather Factors":"None","Longitude":"-90.719866","Log Number":"US-11102009-0019","Disposition":"Unknown","Case Number":"20443","Summary":"Coming home from work at 7.15 am.","divs":["Sighting DetailsHi iam Chester Golat and on the Morning of june 21 1978 me and 3 other people that i ride with to work as we car pool from conrath wis USA and from Shedon wis USA to work in Hawkins wis USA about 30 miles East from Conrath on hiway 8. Barb was driving that day and we all just got off from work and we clock out at about 7.01 and was all in barbs car by 7.05 me Chet and 2 other guys and Barb was the driver that week. we went down hiway 8 west heading home at about 7.13 am we seen something up in the sky to our Left or south of us as it soom across the sky and then just stop and then another one came sooming across the sky from our our Left and then stop about 50 feet from the 1st one. Then the 1st one moved down and the 2nd one moved over where the 1st one was as a 3rd one came in to where the 2nd one was. NOW a 4th one came in and all 4 were Now i a LIKE a Square Box and a 5th one just came above them and just sat there as the other 4 UFO began to go in Circles and follow each other arounr in the Square as the 5th UFO just sat up above them. We pulled the car over to the side of the road and stop and i Chet and one other guy got out of the car and sat on the hood of the car and just watch them as other cars went on by us And some other cars did stop to. Then just as thay came thay left one of them in the Square Circles just left out of the Circles to the top left of it as you could see it move out of the Circles to the top left in a line left and up and out of the Circles and then was just going and a fast as that one left so did the next one and so did the next one and so did the next one all inthe same way and then the 5th one just shot of in the same way. Wow we could not Belive it what just saw for about 27 minutes. we got back in the car and talk about it some and me chet and the other guy got chewed out some for geting out of the car to watch it. But it was ok with us as we got to watch a great show. Barb did tell us about another time when she had seen a UFO and so did Chet back in 1974 in Conrath. as we were all heading home. I Chet was in the Natl. Grd for 4 years now and i Raced RUPP Snowmobiles and Tractor pulled a ALLIS-CHALMERS D-17 and a WD-45 And Raced a CHEVROLET Stock Car and work at Golat IMPL in Conrath wis witch was a ALLIS-CHALMERS & NEW-IDEA & WOLLIN Silo Delear and work out at NORCO windows in Hawkins."],"Sighting Duration":"Undisclosed","Date of the Event":"06/21/1978 07:03 UTC","Region":"Wisconsin","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.514968,+-90.719866(20443)&iwloc=A&hl=en\"> mufon case (20443) map </A>","Object Shape":"Circle, Disc, Oval","Source":"MUFON"}