{"Object Features":"None","Log Number":"IQ-11102009-0024","Source":"MUFON","Weather Factors":"Unknown","Latitude":"33.34148","Longitude":"44.421539","Date Submitted":"11/10/2009 10:26 UTC","Tags":"City","Case Number":"20448","files":["/var/www/straped/mufon/html2text/20448.html.txt","/var/www/straped/mufon/org/20448.html"],"City":"Baghdad","Object Flight Path":"Path then hovering","Sighting Duration":"00:02:00","Disposition":"Unresolved","Region":"Baghdād","divs":["Sighting DetailsThis at least proves that the US has circular recon vehicles which are some of the objects that are mistaken for extraterrestial vehicles. I've talked to several people that have seen the video from the gun camera of the plane that dropped the bombs on the farmhouse that killed Zarkawi but nobody sees the circular device that seems to be either aiming the bombs or controlling its trajectory.It appears that it has the ability to confirm if there is movement after the first attack because it comes into an area that is free of dust from the first bomb and moves back to allow for another attack. After the second attack the vehicle moves off at a fast rate of speed. Please look at the attack on youtube and reply as to what you think that this device is. It's obviously quiet because it seems to be very low and near to the farmhouse. I can understand why the Government would want to keep this a secret but I don't understand why other people haven't seen it in the video. The object comes into frame above and to the top of the farmhouse and makes a half circle to the opposite side of the farmhouse. After the first weapon hits the house, the object moves into a frontal position to obviously view the destruction and then the final bomb is released while the object takes the same position below the farmhouse. The object then moves back to it's first vantage point to see the destruction again and then speeds off."],"Date of the Event":"Unknown","trends":["There have been 6 other sightings in Baghdad","There were no other sightings in Baghdad on or around"],"Object Shape":"Circle","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.34148,+44.421539(20448)&iwloc=A&hl=en\"> mufon case (20448) map </A>","Summary":"UFO was present before the bombing of terrorist Zarkawi.","Country":"Iraq"}