{"Viewing Distance":"Unknown","Source":"MUFON","divs":["sighting detailsarrived home from work, around 6:00 p.m. got out of my car and looked up over across the street. five disc-shaped objects up maybe several hundred feet hovering in the sky. one shot a firework-like display towards the ground. as i can see more precisely with my glasses on (although certainly well enough to see what i did without them!), i turned around to grab them out of my car (took maybe 4 seconds). when i looked back up, they were all gone. i was stunned, wondering what they were. my thoughts were along the line of \"what the ??!!@@@ were those?!\"; although, i was also thinking that they looked exactly like 5 ufo's hovering. decided to go for a walk down the street. saw what looked like one more again towards the west (towards the mountains...i live on the front range with the mountains to the west)...it was a disc-looking shape, all bright (it is totallly dark here by 6:00 now, since the time change), moving very slowly, and then disappeared. i couldn't really tell if it just disappeared or went behind a house. continued walking for about 10 minutes, and then went back home and took a drive towards the west where there aren't many houses\\obstacles for night-sky viewing; but, didn't see anything else. very intiguing, mysterious incident. i wish there had been a neighbor outside."],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.176897,+-105.091968(20446)&iwloc=A&hl=en\"> mufon case (20446) map </A>","Date of the Event":"11/10/2009 06:00 UTC","Weather Factors":"Unknown","Longitude":"-105.091968","Date Submitted":"11/10/2009 09:03 UTC","files":["/var/www/straped/mufon/html2text/20446.html.txt","/var/www/straped/mufon/org/20446.html"],"Disposition":"IFO","Log Number":"US-11102009-0022","Tags":"City","City":"Longmont","Object Shape":"Disc","Case Number":"20446","Region":"Colorado","trends":["There have been 30 other sightings in Longmont","There were 3 other sightings in Longmont on or around November 10th 2009"],"Summary":"Five very bright disc-shaped objects maybe several hundred feet up. One shot bright firework-like lights down.","Latitude":"40.176897","Country":"United States","Object Flight Path":"Undisclosed"}