{"Date Submitted":"11/10/2009 04:13 UTC","Date of the Event":"02/15/2009 04:55 UTC","Case Number":"20441","Log Number":"US-11102009-0017","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.490722,+-122.79903(20441)&iwloc=A&hl=en\"> mufon case (20441) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/20441.html.txt","/var/www/straped/mufon/org/20441.html"],"trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around February 15th 2009"],"Sighting Duration":"Undisclosed","Object Shape":"Sphere, Other, Unknown","Region":"Oregon","Summary":"Red and Blue Spheres in police spotlight","City":"Beaverton","Weather Factors":"Fog, Light","Object Flight Path":"Stationary","Latitude":"45.490722","divs":["Sighting DetailsI was recently talking with a friend of mine about a Very strange event I had witnessed earlier this year and he suggested I report this to Mufon. so here I go. Late February or Early March of this year(2009) (Sorry I do not have exact date and time I know I should have written it down!) in the city of Beaverton Oregon At exactly 4:55am I was awakend by a loud explosion, this explosion was not like a gunshot which i did hear occasionally in the area, this was more like a sound a large power transformer gives off when it blows! It was so powerful it shook my entire apartment and rattled the windows. I immediately jumped up out of bed frightened and looked out my bedroom window. My bedroom window faced our apartment complexes small parking lot and just past the parking lot is a fence followed by houses on the next block over. Through my window I looked out and across the parking lot and over an adjacent house I noticed two strange slowly pulsating stationary lights. One light a was dark red and one a dark blue. These lights were spaced maybe 20-25 feet apart, one of them appeared to be right above the roof of this house and the other other appeared to be slightly lower just at the fence line level between 2 houses. At almost the moment I fixed my eyes on these 2 strange lights I heard a police megaphone kick on and the voice of an officer specifically warning \"Do not leave your residence, this is the police stay inside your home\" At this point I became curious, alarmed about what was going on the next block over so I quickly threw on some clothes on, stepped outside and tried to get a better look at exactly what I was seeing some 100 feet away above this house. I watched these lights above this house, staring at them...I have never seen anything quite like this before. I'm a cigarette smoker and spent alot of time on my porch looking in this direction. This was something bizarre! I cautiously decided to try to get closer look so I walked about half way across the parking lot with my eyes fixed on the 2 objects when I noticed the red colored light had dissapeared, just vanished! About 3 seconds later I could hear the police saying something but I could not make it out, their voices raised...and then immediately following that they began focusing spotlights at the top of a tall tree sitting next to this house. They were scanning the top of this tree with the spotlights for about 15 seconds. Apparently looking for something, the object that vanished..or maybe from their vantage point they spotted something else that I did not see from my line of sight. At this point I got scared and decided for my own personal safety that I should not continue any farther across the parking lot and turned around. I then decided to walk to the enterance of the apartment complex and look down the street in the direction of the next block over and I noticed an unmarked police car blocking both lanes of the next road over, it had its headlights off, I could see it was an unmarked because the flashers were on and illuminating the hood and roof of the car and it was not marked like a normal Beaverton police cruiser. I have told this story to a few people, and most have written the red and blue lights I saw off as comming from police cruisers on the next street, but I know these strange lights or orbs or whatever that they were, were definatly not comming from the cruisrs and they were not reflections. They were hovering objects maybe the size of basketballs and once they disapeared the police were searching the trees for them. Later that same day I was perplexed by what it was I had witnessed, I could not get it out of my mind. It was eating at me because of how unusual it was so I contacted the Washington County Sheriffs department from my work phone during my lunch break. I got a gal on the phone who immediately put me on hold after a brief rundown of my question..I was put on hold for more then 15 mins and eventually I was transfered to what I was told was a 'Corporal' who informed me that the Sheriffs department had no record of officers on SW Hazel St that morning. The next day after work I walked over to the next street over and knocked on the door of 4 houses and asked the residents what it was that they had seen, unfortunately 3 out of the 4 were hispanic and spoke little to no english and the one who did talk did not know what it was himself. I know it sounds crazy, but this is really what I saw that morning, im sure someone in the neighborhood or complex heard and seen this besides me."],"Source":"MUFON","Viewing Distance":"101-500 Feet","Country":"United States","Longitude":"-122.79903","Disposition":"Unknown"}