{"Summary":"Passed by my window and stopped high behind a tree, did 4 recordings with night vision","divs":["sighting detailsi caught something out my window on sunday night when hurricane ida was passing by, it was very windy with high wind gusts.. i saw a light go by my window and i got up to see what it was, i saw this craft stationary behind a tree in my yard, and i saw a small plane fly under it and it never moved. i ran to get my night vision set up, tv on and camcorder to record it.. it was behind the tree but if you keep watching the wind will start to blow the tree up and you can see it clearly, also its very slowly moving away and down and near end of first vid its under the branch and you can see it better, but its farther and not as clear.. i did 4 videos of this. it was two lights, like headlights of a plane, yet it was moving away, i should not see lights if it was moving away as the lights would be in front of it. the next say i emailed the chief at sheriff's office and asked if any police helicopters were out at this time. he responded telling me they did not fly all day sunday and to call the faa. i did that next, i talked to two guys at same time and they told me nothing was in my area and certainty nothing stationary in this wind. they then asked for my web address to see the object. i did not leave my email or phone number. anyway. here are the four videos i took... first one i ended to try to move my cam higher to see if i can see it better, it moved away from tree and i did, at the end of second one.. i dropped my cam :( 3rd.. it moved behind house and i raised my cam higher on 4th vid.. again it went behind the house and that was end of it... let me know what you think. . gwen http:\\\\www.youtube.com\\user\\chantmiss *my site* http:\\\\www.youtube.com\\watch?v=-iamtytouze 1 http:\\\\www.youtube.com\\watch?v=8g-bucxo-gg 2 http:\\\\www.youtube.com\\watch?v=vfebqhekjrg 3 http:\\\\www.youtube.com\\watch?v=eorq-tvfw4s&nr=1 4"],"Region":"Florida","Country":"United States","Case Number":"20444","Log Number":"US-11102009-0020","Disposition":"IFO","City":"Bradenton","Date of the Event":"11/08/2009 07:20 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Flash, Other","trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around November 8th 2009","This sighting has never been favorited.",""],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=27.503348,+-82.569539(20444)&iwloc=A&hl=en\"> mufon case (20444) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"11/10/2009 05:32 UTC","files":["/var/www/straped/mufon/html2text/20444.html.txt","/var/www/straped/mufon/org/20444.html"],"Latitude":"27.503348","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path","Object Features":"Unknown","Longitude":"-82.569539"}