{"Log Number":"","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.463299,+-81.244338(2044)&iwloc=A&hl=en\"> mufon case (2044) map </A>","Viewing Distance":"101-500 Feet","Object Shape":"Cylinder","Latitude":"41.463299","City":"Newbury","Disposition":"IFO","Tags":"City","Sighting Duration":"00:05:00","Date of the Event":"09/14/1984 01:30 UTC","files":["/var/www/straped/mufon/html2text/2044.html.txt","/var/www/straped/mufon/org/2044.html"],"Case Number":"2044","Object Features":"Undisclosed","Source":"MUFON","Longitude":"-81.244338","divs":["Sighting DetailsAs I left a relatives house, alone, at one thirty AM, I stoped at the top of hisdriveway, looking right, then left for traffic on a dark, country road. As Ilooked left, a row of bright, colored lights ascended above trees across theroad and about 150 yards distance. As I watched, the lights stopped just abovethe treetops. The lights flashed brightly, in two pairs of colors, moving leftto right as, red, green white, red, green, white. I rolled down the window ofthe car, but heard nothing, not even the typical night sounds, no crickets orother things. Thinking about what I had read to do if you spot a strange, UFOlike object, I stuck my arm out and held my left index finger against thehovering lights. They were as long as my finger at arms length, and just a tadthinner.For some reason which I still cannot understand, I decided to proceed to my lefton my usual route home, instead of running into the house to notify my relative. So I turned towards the lights, and as I did, they began to move south towardsme. As I drove and got opposite their position, I looked up through mywindshield, at which time I saw them pass right overhead, looking brighter andlarger. I did not look to my left to see where they had gone, and to this dayit is a disturbing thought. Why didnt I look My next recollection is drivingon that road to the next street,about another half mile, where I would make aright turn. I was only what seemed to be a few feet from the location where theoverflight had taken place, but all I could say to myself was, Whats theGoodyear blimp doing out here so late Could that have been the blimp Why did ithover In a few seconds, I was approaching the stop sign at my right turn. Isaw movement above and to my left, discovering the line of lights approachingfrom the left. As I stopped my car at the intersection, the lights stopped andhovered over the road ahead of me, about 100 yards distant. At this point, Ibecame extremely frightened, realising that a UFO was d"],"Region":"Ohio","Object Flight Path":"Unknown","Weather Factors":"Unknown","Date Submitted":"09/14/1984 01:30 UTC","Summary":"six colored llights in a line, rise, hover and cha","trends":["There have been 3 other sightings in Newbury","There were no other sightings in Newbury on or around September 14th 1984"]}