{"Sighting Duration":"00:03:00","Disposition":"Unknown","Tags":"City","Date Submitted":"11/11/2009 05:34 UTC","Longitude":"-86.576514","Latitude":"34.737999","Summary":"A white flashing light follwed by a red light that fades out slower and repeats; approx. 500 feet above Drake/Whitesburg intersection area.","Log Number":"US-11112009-0006","Country":"United States","Region":"Alabama","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.737999,+-86.576514(20458)&iwloc=A&hl=en\"> mufon case (20458) map </A>","Case Number":"20458","trends":["There have been 17 other sightings in Huntsville","There were no other sightings in Huntsville on or around November 3rd 2009"],"City":"Huntsville","Weather Factors":"None","divs":["sighting detailsaround 6:15-6:45ish cst on the evening of nov. 3rd, i was driving southbound on the parkway. in the distance, to the left (east) as i was going by the parkway city mall area and overpass, there was a stationary flashing white light that was followed by a bright red light that faded out much slower; it continued in that pattern (white flash, red fade, white flash, red fade). i understand that there's many towers on the mountains\\monte santo mtn in the distance but this was much closer and much lower and appeared to be around the drake ave\\whitesburg intersection area and in the air around 500ft (?). it was well above the trees but still below the top of the mountain range in the distance. the light\\object was stationary, as well. i continued south and took the airport rd. exit, headed east on it and the light was still stationary in the distance from what i could tell. it was definitely apparent that it was not near or on the mountain range at this time as the mountain range was several, several miles still east of the light from this vantage point. airport rd. eventually turns south and crosses a mountain; i lost sight of it then due to direction and visibility. i witnessed the light for only a few minutes due to driving but it could of have been lingering there for much, much longer. after a few more nights of driving in that direction after dark, there is no sign of any new towers in that area and i have not seen any other lights in that airspace again since. i've been a resident of this immediate area for over a decade and cannot remember any other incidents or lights similar to this in our area."],"files":["/var/www/straped/mufon/html2text/20458.html.txt","/var/www/straped/mufon/org/20458.html"],"Object Shape":"Circle, Flash, Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Stationary","Date of the Event":"11/03/2009 06:30 UTC"}