{"Weather Factors":"Unknown","Case Number":"20452","Log Number":"CA-11102009-0028","trends":["There has been one other sighting in Canmore","There were no other sightings in Canmore on or around September 18th 2009"],"City":"Canmore","Country":"Canada","Latitude":"51.086985","Date of the Event":"09/18/2009 11:30 UTC","Viewing Distance":"Unknown","Date Submitted":"11/10/2009 11:28 UTC","divs":["Sighting DetailsI originally posted this in the space.com forums under the unexplained I came to the conclusion that there was a very good chance I would never see one. My conclusion was wrong. Last night ( Friday September 18th) I saw something that I had never seen before. I live in the Canadian Rockies in the province of Alberta. My house is situated on the end of town, less then a Kilometre West is complete wilderness. My room faces south looking onto the backyard, behind the backyard lies a green space. The green space which is several kilometres long and 400 metres wide borders more houses on the other side. There is not a lot of light pollution where I live so stars and planets are easily distinguishable. At around 11:30 Pm I was lying in bed and I felt a little bit uncomfortable so I decided to change the position of my pillow. My bed faces North and is pressed against the southern wall so if I turn my head south I can see out my window and see the sky clearly.As I was doing this I was sitting upright, I moved my pillow and began to lay back when something out of the corner of my eye caught my attention. I quickly turned my head south and saw a bright star, all seemed normal and I continued to look at the sky. All of a sudden a bright light appeared west and quite close to this star, it continued to move west rather slowly. I continued to watch this object for another 10 seconds before it stopped and disappeared. It reappeared at a much lower altitude and slightly further to the west and after 10 more seconds it disappeared. Once again reappearing but at a much higher altitude and further west. This pattern continued for 30 more seconds until I could not see it anymore through the thicket of trees off in the distance. I have no idea what I saw last night. I am certain it wasn't my mind playing tricks on me. The UFO could not have been a plane or satellite because these could not possibly behave the same way. There is a possibility that it was a weather phenomenon unknown to me. The weather conditions were clear skies with low humidity and around 14 degrees celsius."],"Object Features":"Undisclosed","Summary":"Ufo in the canadian rockies","files":["/var/www/straped/mufon/html2text/20452.html.txt","/var/www/straped/mufon/org/20452.html"],"Tags":"City","Region":"Alberta","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:01:00","Object Flight Path":"Undisclosed","Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=51.086985,+-115.346814(20452)&iwloc=A&hl=en\"> mufon case (20452) map </A>","Longitude":"-115.346814"}