{"Sighting Duration":"00:00:10","Object Features":"None","Disposition":"Insufficient Data","Date Submitted":"11/11/2009 04:40 UTC","Longitude":"-106.644897","Latitude":"35.092081","divs":["Sighting DetailsAt 5:00 am I was walking my dog with my gf when we noticed a small airplane moving slowly from east to west. When it got over our house moving west, we suddenly caught a large grey object moving N to S just missing the small plane we were watching. At first we thought that's a bird because sometimes you can see birds in the dark if they are low enough to the ground and have a large wingspan. Within a fraction of a second we realized this was no bird but rather a large boomerang shaped flying wedge gliding smoothly and silently across the dark pre-sunrise sky.It was dimly lit with 3 or 4 lights on the bottom of the craft on each of the leading edges. They were symmetrical i.e. 7 or 8 lights. We had been out for about 15 minutes so our eyes were night adjusted. This craft was dark grey,but slightly lighter than the sky. Still, we wouldn't have seen it if we hadn't been looking up at the exact moment it passed over the flight path of the small plane we had been watching. I'm an ex-usaf weather observer and I'm very well trained in cloud heights. I'm estimating the altitude at 8,000 ft and the size as twice that of a 747 and completely silent. This object was menacing as it clearly was operating stealthily over a major metropolitan area (albuquerque) in busy early Tuesday skies. Their were several other planes in the sky at the time so it was operating in traffic yet I doubt that the small aircraft operator even saw it. Neither of us had ever seen a ufo but we have now. There's a chance that we saw a top secret craft and an equal chance we saw an extraterrestrial craft. I'm leaning towards extraterrestrial because of the operating conditions at the time. It's doubtful that USAf would operate stealthily in traffic over abq not to mention the size and silence of the ship.It also traversed the sky from North to South in less than 10 seconds and we lost it quickly due to its color and dim lighting."],"files":["/var/www/straped/mufon/html2text/20457.html.txt","/var/www/straped/mufon/org/20457.html"],"Weather Factors":"None","Region":"New Mexico","Summary":"Walking my dog I saw a large boomerang shaped craft","Case Number":"20457","Source":"MUFON","City":"Albuquerque","Country":"United States","Date of the Event":"11/10/2009 05:10 UTC","Log Number":"US-11112009-0005","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Object Shape":"Boomerang","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around November 10th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.092081,+-106.644897(20457)&iwloc=A&hl=en\"> mufon case (20457) map </A>"}