{"Log Number":"","Sighting Duration":"00:00:59","files":["/var/www/straped/mufon/html2text/2045.html.txt","/var/www/straped/mufon/org/2045.html"],"Object Features":"Undisclosed","Date of the Event":"12/21/2002 07:09 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Windy","Summary":"Virginia Beach, VA. P.M. Sighting","Case Number":"2045","Tags":"City","City":"Virginia Beach","divs":["Sighting Details I was sitting on my front porch having a cigarette after dinner. I noticed an object above the trees that was not moving. I thought it was a plane but knew it couldnt be because of its reddish-orange color. I thought maybe it was the planet that is red we can see all the timeVenus but then it moved slightly below its position towards the ground and then it quickly flew off in a horizontal line out of sightflew over house tops and and then my view was blocked. During the event, I just watched in disbelief and couldnt move my feet. Then I came inside and told my fiance what I had just seen. I think I might have been in shock afterwords but am not sure. I am not a drinker nor do I partake in any kind of recreational drugs. I was a weather spotter for a county in Ohio and I am an Astronomy buff. So I know what I saw was not of the normal air traffic. The object was sphere-like and reddish-orange in color. As it moved slightly downward, it grew darker in color. A lighter orange to a darker orange as it moved down. Then as it moved off out of sight it stayed darker in colorreddish-orange. I lost sight of the object because the building I live in was in the way. I am on the second floor. I still have a hard time believing what I saw. Please help me understand what it could be. Maybe you can figure it out.M Tomasik"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.861926,+-75.971985(2045)&iwloc=A&hl=en\"> mufon case (2045) map </A>","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around December 21st 2002"],"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Region":"Virginia","Longitude":"-75.971985","Latitude":"36.861926","Country":"United States","Object Shape":"Sphere","Date Submitted":"12/21/2002 07:09 UTC"}