{"Source":"MUFON","Object Shape":"Boomerang, Teardrop, Triangle, Unknown","Viewing Distance":"101-500 Feet","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around November 10th 2009"],"Weather Factors":"Unknown","Object Features":"Unknown","Summary":"Cloudy object","Region":"Texas","Longitude":"-96.765133","Disposition":"Unknown","City":"Dallas","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20454.html.txt","/var/www/straped/mufon/org/20454.html"],"Latitude":"32.811045","Country":"United States","Object Flight Path":"Straight-line path","Log Number":"US-11112009-0002","Case Number":"20454","divs":["Sighting DetailsMoved so fast, too fast to be a bird or even a plane. Moved too quickly for this world as I was looking up towards the East at Orion while I had just stepped out for bedtime cigarette. In the late '90's I saw an accumulation of UFOs nearby but they were going East to West, with multitudes of yellow orbs hovering motionless and silent while the big ship which was boomerang shaped and with red lighting (not lights individually as in planes) raced overhead. I witnessed this with others in the area, but none of us reported. Didn't know about you! In other words, I've seen first hand accounts of UFO's. So tonight what I saw I can definitely say was not of this world. No way. No animal or bird could have done what I saw. No cloud. This being was enormously fast. If I had to guess, I'd say it was about 200 feet up. I used to fly in my youth so I do have some keen estimation faculties. It was cloudy or cloaked but was definitely there! And of course, unrealistically fast. No bird could have flown the distance I witnessed in the 8 seconds I witnessed the event over Orion. It could have been supernatural if not a UFO, but it was surely not of the world we know here on Earth. Sorry, no time for photo. It was truly remarkable!!!"],"Tags":"City","Date of the Event":"11/10/2009 10:44 UTC","Date Submitted":"11/11/2009 01:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.811045,+-96.765133(20454)&iwloc=A&hl=en\"> mufon case (20454) map </A>"}