{"City":"Longmont","Viewing Distance":"Unknown","Disposition":"IFO","Source":"MUFON","Tags":"City","Longitude":"-105.096848","divs":["Sighting DetailsDriving to Longmont from Boulder on the Diagonal Hwy. just after 6 p.m. tonight, I noticed to the west of Longmont a half-dozen or so extremely bright, flat objects stacked in a tight formation, one just above and the side of the next. The proximity of these objects to each other was alarming to see. None of them appeared to be moving; several were tilted at 20-30 degrees from the rest. They were just hanging there in a tight group, one above the other. About two minutes after I first noticed them, the lights all disappeared in the very same instant. They simply went out all at once, as if someone had thrown a switch. I've never seen anything like that. Didn't see FAA or other blinking lights on any of them, nor did any appear to ever turn, bank, dim, or move away - they remained in the same arrangement and distances from one another for the length of my sighting. Very strange, and more than a little alarming in that moment to see that kind of air traffic in such close formation in darkness. I'm sure many other must have witnessed this event, as it was during rush hour on a busy stretch of state highway."],"Log Number":"US-11102009-0026","map":"<A HREF = \"http://maps.google.com/maps?q=40.169547,+-105.096848(20450)&iwloc=A&hl=en\"> mufon case (20450) map </A>","Summary":"Six to eight bright, flat objects hovering and disappearing at once.","Object Flight Path":"Undisclosed","Case Number":"20450","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/20450.html.txt","/var/www/straped/mufon/org/20450.html"],"Latitude":"40.169547","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"11/10/2009 07:05 UTC","Country":"United States","trends":["There have been 30 other sightings in Longmont","There were 3 other sightings in Longmont on or around November 10th 2009"],"Region":"Colorado","Date Submitted":"11/10/2009 10:47 UTC","Object Shape":"Disc"}