{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.877959,+-110.984406(20456)&iwloc=A&hl=en\"> mufon case (20456) map </A>","trends":["There has been one other sighting in Green Valley","There were no other sightings in Green Valley on or around November 10th 2009","This sighting has never been favorited.",""],"Tags":"City","Date of the Event":"11/10/2009 11:15 UTC","Region":"Arizona","Weather Factors":"None","Source":"MUFON","Date Submitted":"11/11/2009 03:01 UTC","Longitude":"-110.984406","Object Features":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Case Number":"20456","Latitude":"31.877959","City":"Green Valley","files":["/var/www/straped/mufon/html2text/20456.html.txt","/var/www/straped/mufon/more/20456_submitter_file1__008.JPG","/var/www/straped/mufon/more/20456_submitter_file2__029.JPG","/var/www/straped/mufon/more/20456_submitter_file3__027.JPG","/var/www/straped/mufon/org/20456.html"],"Disposition":"Unknown","Log Number":"US-11112009-0004","Country":"United States","divs":["Sighting DetailsAt abut 11:15 my mom called me from her house about 8 miles north east of me in Sahuarita, AZ telling me about something that had suddenly appeared in the sky. I went out side to look and to my south east about 4 inches in the sky below the ORION constellation's \"belt\" I saw a very bright flashing light, initially it appeared to sparkle but once I got my camera out and zoomed in as far as I could, I was able to see that it had a shape to it, it appeared to be somewhat round but the lights were along a single line and I had the faint impression of a boomerang. I tried to take video but the camera i have doesn't zoom in nearly far enough to see anything other than a sparkling light in the sky. I took a few pictures and a video and watched it for about 45 minutes and it did not appear to move, nor did it move with the sky. I used Orion's belt and a light pole directly below the flashing light, as a reference as to it's possible movement, but it stayed exactly where it was for nearly 45 minutes, then it made a sudden move about 6 inches to the left and was stationary, then once again it moved very quickly in an upward directionabout 3-4 inches then again stayed stationary, and as of right now it has not moved (12:47am) again. I initally thought it was a plane, but it didn't move. Then I thought it could be a satellite, but again it wasnt moving, then I thought it was just some kind of air craft from the base, but again the long term lack of movement and then the sudden movement from one place to another and the appearance of the shape, and the colors of the lights, a bright red, blue and green. I called the Kitt Peak Observatory and they could not give me an answer as to what it could be, i told them where it was in the sky and they said that that was \"blank space\" no stars, no satellites not the ISS, nothing they could suggest that it could be. The entire time i was viewing the lights i was simply curious, it did not fit into the regular stars in the sky and i simply wanted to know what in the world it could be. I did take some photos, but they are not the best, I use a kodak easy share camera with 3x zoom so it's not meant for taking such long distance and detailed images."],"Summary":"Bright flashing lights red blue and green in the sky","Object Shape":"Boomerang, Flash, Sphere, Star-like, Other"}