{"Log Number":"US-11102009-0027","Summary":"looked up at the stars, saw 3 in a elonggatted triangle, at that they started moving together in same direction","City":"ironwood","Object Shape":"Star-like, Triangle","trends":["There have been 2 other sightings in ironwood","There were no other sightings in ironwood on or around September 30th 2004"],"Sighting Duration":"Undisclosed","Case Number":"20451","Latitude":"46.558864","Disposition":"Unknown","divs":["Sighting Details i was fishing on the black river near the 1st waterfall up from lake superior,U.P. mich., around 200 yards from falls, very loud water sounds, it was 11 or 12 pm, i looked up at all the stars i could see, it is a cut gorge river, so there is only so much sky to see,looking around the stars, i fixed on three stars in an elonggatted triangle,perfect in shape,looked like any other stars, but as soon as i fixed my eyes on them they started to move together in a west northwest direction towards tree line, i freeked and started screaming,hey, hey, goddamit, no that does not do that, pointing to them, and by now thinking that that or they, was an it, a ufo. i was tring to get my friends attention, to no avail.the next thought in my head, as the ufo was going out of my site in the tree line, was that the ufo was watching me until i saw it. it all took of 1 second to start moving once i saw it. total time as it slowly move to the tree line and out of my site was 15 seconds at most. and my dumbass friends did'nt belive me, that pissed me off. this was my second siting in my life."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.558864,+-90.110463(20451)&iwloc=A&hl=en\"> mufon case (20451) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path","Object Features":"None, Other, Unknown","Date of the Event":"09/30/2004 11:00 UTC","Longitude":"-90.110463","Weather Factors":"None","Date Submitted":"11/10/2009 11:02 UTC","Region":"Michigan","files":["/var/www/straped/mufon/html2text/20451.html.txt","/var/www/straped/mufon/org/20451.html"],"Tags":"City","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown"}