{"divs":["sighting detailsi was out walking my dog this morning between the hours of 10am and 12pm. around 11:25, i looked up in the sky and there were two star-like objects moving in sporadic patterns around each other. there were no clouds at all, just bright and blue. i took off my polarized sunglasses and they were almost impossible to see, so i put them back on. the quasi-circular patterns that they were moving in looked as though they moved from north to south. upon reaching the southern most point, they illuminated like a very bright star in the middle of the day. that only lasted a few seconds, then faded back to its regular luminance. we can assume they were reflecting sunlight. at one point, one of the two went very far away off in a west\\south west direction. then came back together after about 30 or 40 seconds. the whole event lasted (for me) about 3 or 4 minutes. during the final moments, they both headed exactly due north together. i can only imagine how high up in the atmosphere these objects were. they appeared to be moving rather slowly. however, given the distance, there was probably nothing slow about the rate at which they were traveling."],"Source":"MUFON","Object Flight Path":"Other","Log Number":"US-11112009-0014","Longitude":"-83.376322","Case Number":"20466","City":"Farmington","Weather Factors":"Unknown","Date of the Event":"11/11/2009 11:25 UTC","Sighting Duration":"Undisclosed","Region":"Michigan","Country":"United States","Latitude":"42.46448","files":["/var/www/straped/mufon/html2text/20466.html.txt","/var/www/straped/mufon/org/20466.html"],"trends":["There have been 2 other sightings in Farmington","There were no other sightings in Farmington on or around November 11th 2009"],"Viewing Distance":"Over One Mile","Object Features":"Unknown","Tags":"City","Disposition":"Unknown","Object Shape":"Star-like","Summary":"Two star-like objects moving slowly around each other","Date Submitted":"11/11/2009 11:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.46448,+-83.376322(20466)&iwloc=A&hl=en\"> mufon case (20466) map </A>"}