{"map":"<A HREF = \"http://maps.google.com/maps?q=42.460592,+-83.134648(20461)&iwloc=A&hl=en\"> mufon case (20461) map </A>","Case Number":"20461","City":"Ferndale","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Michigan","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","Summary":"4 white objects","Disposition":"Insufficient Data","Object Shape":"Star-like","trends":["There have been no other sightings in Ferndale","This sighting has never been favorited."],"Date of the Event":"01/10/2008 12:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/20461.html.txt","/var/www/straped/mufon/more/20461_submitter_file1__sighting.jpg","/var/www/straped/mufon/org/20461.html"],"Date Submitted":"11/11/2009 09:16 UTC","Log Number":"US-11112009-0009","Longitude":"-83.134648","Latitude":"42.460592","divs":["Sighting Details(all times and dates are approximate) It was around eleven o'clock at night. My girlfriend was first to see the phenomena, out her upstairs window looking to the west. She said it originally asppeared as 4 small white objects in a diamond pattern, with what seemed a star in the middle. Two of the objects moved to the right, slightly moving away from each other. I at this point observed the two objects, and their exhibited slight movement. THey stayed still for roughly ten seconds. THen the lower-placed object darted suddenly to the right, very quickly, and left our view. THe higher object shot upward and to the left, quickly disappearing from view. It's not much, but I figured i'd send it in. There were no flashing lights, such as an airplane might exhibited, and they went from being still to suddenly moving away in opposite directions with a speed that is contrary to what an airplane might perform. At the time I was listening to a radio program. I don't know why my girlfriend looked out the window, it was more or less spontaneous. For whatever reason it held her attention. I'm very interested in the UFO phenomenon and read up on the subject heavily. It was mildly excited by the sighting, as I, like most interested parties, have often longed for a personal observation."]}