{"Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/20464.html.txt","/var/www/straped/mufon/org/20464.html"],"Object Shape":"Sphere","Log Number":"US-11112009-0012","Country":"United States","Sighting Duration":"00:00:10","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.959509,+-82.412931(20464)&iwloc=A&hl=en\"> mufon case (20464) map </A>","Longitude":"-82.412931","City":"Jacksontown","Viewing Distance":"Unknown","Latitude":"39.959509","Date Submitted":"11/11/2009 11:00 UTC","Disposition":"IFO","Weather Factors":"None","Case Number":"20464","Region":"Ohio","Summary":"Strange Lights in the evening sky","Tags":"City","divs":["Sighting DetailsI was cleaning the flowers beds at home when I noticed a light in the sky. It appeared as if somebody turned on a light. It was about as bright as the planet was in the evening sky that night. No clouds. The moon was visible low in the eastern sky behind me that night. It occurred at 6:31 pm and only lasted a few seconds. It appeared and remained still for approx 3 seconds, then it proceeded to head in a north west direction at which time it pulsed two times rather brightly and then the light diminished to a very light red glow before it went away. There were no sounds and it was not an aircraft. There were numerous planes in the area that night and it did not look like any lights I have ever seen on any type of aircraft. All the aircraft in the area were following the same basic flight path of an east to west direct. This went north west when it did start to move. I doubt it was a meteor or something because when it first appeared it was not moving. The movement did not occur until a few seconds after it appeared. The entire object was only visible for approx 8-10 seconds. I waited and searched the night sky for about 20 minutes to see if it reappeared or any signs of lights in that direction and nothing. It appeared almost directly overhead of my location and slightly west. If I had to guess an altitude based on the aircraft in the area I would guess around 20-25,000 feet."],"Date of the Event":"11/03/2009 06:31 UTC","trends":["There have been no other sightings in Jacksontown","This sighting has never been favorited."],"Source":"MUFON"}