{"Sighting Duration":"Undisclosed","Date Submitted":"11/11/2009 01:16 UTC","City":"Eugene","map":"<A HREF = \"http://maps.google.com/maps?q=44.060569,+-123.078714(20468)&iwloc=A&hl=en\"> mufon case (20468) map </A>","Case Number":"20468","Tags":"City","Disposition":"IFO","Summary":"Disc(ish) shape ball of light that was green/blue VERY LARGE fast moving with a small tail of light.","Object Shape":"Unknown","divs":["sighting detailsnov. 10, 2009 7:00 pm: getting into my car to go to dinner w\\ friends. my son was in the seat behind me and my husband was locking our door and getting into passenger seat. he had his back to the event when it happened. my son did not see it because he was behind me. it happened very fast. my car was parked facing north\\northwest direction in the south hills of eugene, oregon( lane county) in our driveway. over the top of my house and between two large fir trees it came from the right side moving fast towards the left. travelling north or northwest. a huge ballish light that was blue green and somewhat sphere\\disc shaped. behind it was a orangish colored small tail. it was travelling very fast and was huge. i have never seen anything like it. i called the local news station immediately to report a meteor possibly? their meterologist said there was nothing in the sky. i you tubed videos today to see if it was a meteor. all the images in the you tube videos of meteors disinigrate as it hits the atmosphere. this did not happen with the object i saw. we watched an airplane fly around the sky right afterwards and it was tiny in comparison to what i saw. the airplane seemed to change directions from heading west to following the direction of the object. rather curious. the light ball travelled quickly in the clear sky from my viewpoint maybe 4 or 5 seconds due to trees blocking the view. it was one of the most amazing things i have ever seen. it was gigantic. it also seemed low in the sky. no sounds were heard."],"Source":"MUFON","Country":"United States","Log Number":"US-11112009-0016","Latitude":"44.060569","Longitude":"-123.078714","Date of the Event":"11/10/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/20468.html.txt","/var/www/straped/mufon/org/20468.html"],"Viewing Distance":"Unknown","Region":"Oregon","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around November 10th 2009"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Straight-line path"}