{"Weather Factors":"Unknown","Longitude":"-73.65013","Country":"United States","Disposition":"Unresolved","Date Submitted":"09/30/1964 09:00 UTC","Date of the Event":"09/30/1964 09:00 UTC","Case Number":"2046","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"","Region":"New York","Summary":"Sighted formation of lights","Sighting Duration":"00:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.704824,+-73.65013(2046)&iwloc=A&hl=en\"> mufon case (2046) map </A>","Latitude":"40.704824","Object Shape":"Unknown","divs":["Sighting DetailsEvent occured while I was taking trash out to curb at my home at night. Therewere no stars out, and clouds had a slight glow from ground lights. There wereno other weather effects. The night was cool, but not uncomfortable without ajacket.When I was about 5 meters from curb with the two cans, I looked directlyoverhead for no reason I can remember. I saw a formation of lights, the roundones in the center being about twice the width of my thumb at arm-length. Theouter lights were dimmer than the center three. They all were of about the samesize. They were aligned east-west. The spacing between them was about 34 to 1diameter of each light, and was constant for all of them. To the north and southwere two bands of light of the same intensity. the general formation was------.2B 2B .------1 2 3 4 5 6 7The . lights were very dim, and I was never very sure if they were there. the2B were discernable, but dimmer than the center three . All appeared to bethe same size, and were circular in shape. The diagram above is to indicatebrightness, not size.The two bands of light that paralleled the circular lights were about the samediameter, and fadded out beyond lights 3 5, and were gone beyond lights 2 6.The fading seemed to make the appear somewhat curved toward the circular lights.The diagram above is to indicate the fading, not thickness.The above observations lasted about 10 - 15 seconds.I had no reference to judge height, but the impression I had was it was notgreater than 150 meters.I had a sudden urge to finish taking out the trash, that in the few seconds thatthat would take, it would not disappear loss of mental and physical control.When I returned to where I had seen the lights, they were gone. The curb wasunder some trees, blocking view of the object. To me, this action seemsirrational mental impairment, as all I had to do was put down the cans tocontinue observing. I scanned the visable sky, and saw nothing unusual.Upon returning indoors to my family, my mother asked why it had taken me over 15minutes to take out the trash. To me, it had been less than five minutes. I haveno memor"],"Tags":"City","trends":["There have been 2 other sightings in West Hempstead","There were no other sightings in West Hempstead on or around September 30th 1964"],"Object Flight Path":"Stationary","Object Features":"Other","files":["/var/www/straped/mufon/html2text/2046.html.txt","/var/www/straped/mufon/org/2046.html"],"City":"West Hempstead"}