{"Date of the Event":"11/11/2009 06:15 UTC","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Log Number":"CA-11112009-0008","files":["/var/www/straped/mufon/html2text/20460.html.txt","/var/www/straped/mufon/org/20460.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.093389,+-79.084768(20460)&iwloc=A&hl=en\"> mufon case (20460) map </A>","divs":["Sighting Details I was on Stanley & Murray St by the new Casino along with other witnesses in the area watching it. The object was there from when I arrived around 6:15, watched for 30 minutes, rushed home to get camera, came back it was only there for 30 second more so I captured nothing on video. There were MANY witnesses looking up and staring and commenting, some screaming saying \" OMG what is that\" etc. I noticed at least 5 witnesses and talked briefly to a few people about it. It was almost STRAIGHT up in the sky as after the clouds went away a bit I noticed it was in the area of W Cassopia. It FLASHED when the Casino spot lights hit it, just like the previous youtube video's from the end of October of this year, but those video's had only 1 small light, this had 2 IDENTICAL lights and a longer one in between them. I could not make out anything when the spotlights were not hitting it as there was cloud cover and it was already night. It looked like it was just above the clouds, quite high, 1000 feet for sure, about 2 inches long﻿ at arms length. VERY bright, was in a straight line time facing NNW. The light was white with a tinge of blue, light itself was the straight like a bar bell with 2 lights on the end. IT had a smaller light on each end of the bar that were identical in shape. There was a light, then a small space then light. This composed the SMALL light at each end. Then there was the middle BAR light which was about 5x the length of the small end lights. Had a middle longer bar then the light like the video again in a straight line. Since it was there for about 30 minutes or more as I was watching it, I was hoping it might be there for a while longer, so I rushed home to get a camera and my Night Vision Monocular. When I got back, it was there for only about30 seconds more, I couldn't even set up the camera to take any video then it disappeared. I waited until after 9:20pm to see if it would come back but I didn't see it anymore. Just before 9pm, still looking in the area of the sky where it was using my Night Vision Monocular, I suddenly saw a DOT just like a small star moving in a straight line and immediately thought it was a Satellite as I have spent countless nights star gazing and see satellites every 5 minutes sometimes which is nothing unusual. This light however stopped going straight, slowed down smoothly, but quickly, and turned, started flying around that area with incredible speed and maneuverability, it's very difficult to describe the type of movement...it was FAST, reactive, but still smooth flying, not like a bug or bird or anything I've ever seen....keep in mind I've star gazed for decades, have owned numerous telescopes, so I'm familiar with what I can see out there, this was like nothing I've ever seen. This point light looked to be very high as it was in FOCUS with the stars, anything very close would be out of focus on my Night Vision as it's manual adjusted focus so it had to be quite distant. THis light then darted off in a straight line after the maneuvers, and the lights from the street and buildings flared up the Night Vision and I couldn't view it anymore as there were street lights everywhere. The whole time I was yelling out \"that's impossible\" etc, I couldn't contain myself."],"Region":"Ontario","Object Shape":"Cigar","Country":"Canada","Disposition":"Unresolved","Longitude":"-79.084768","Summary":"Bar shaped UFO hovering with detail and point light with amazing manuverability","Date Submitted":"11/11/2009 09:12 UTC","Object Features":"Other","Case Number":"20460","trends":["There have been 16 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around November 11th 2009"],"Latitude":"43.093389","Tags":"City","Weather Factors":"Unknown","City":"Niagara Falls"}