{"Case Number":"20469","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around November 10th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsAround 10 or 10:30 my friend called me hysterically claiming that he was watching ufo's in the sky and told me to hurry over to his dorm. I heard there was a meteor shower coming soon and thought he was just watching that. I get to the dorm and he rushes me to the window and as i look out i see nothing. As i am about to tell him such 2 red lights fly around each other and zoom off in opposite directions and a 3rd very bright white light appears out of nowhere. We continue to watch in awe cursing at what we are seeing. Next 2 bright lights appear and begin to move and a little later one becomes 2 small red lights and the other disappears. The red lights stay in the sky for a good 30 seconds and then disappear, in the mean time they are flying back-n-forth across the sky. The foothills and flatirons are in clear view from our windows and this morning we saw that the objects were too close to the mountains to be any type of aircraft (ie helicopters and planes). Also if they were some type of manmade aircraft, 2 red lights appear and get dimmer as if moving away and then an instant later one is gone the one more right suddenly is a bright light. Had this been an aircraft it would have had to do a complete 180 turn in a split second. 2 lights with red and white appear a fair length apart and then appear to rotate and we saw what looked like a cigar shape with red lights on the ends. The object couldn't have been smaller than 30 yards long. We rush outside and try to get a good view. Over the course before this we see what i described many times only with more appearances by the large bright light. The activity continues as we are outside but not as dramatically. For about 10 minutes there is no activity but then the large bright light comes on and stays on for a second, goes away for another second, then comes back for a second, then off, and repeats 2 more times. We see various red lights over the 20 minutes after the bright light stops and then my friend screams \"Abduct me!\" and all activity stops for about 15 minutes as we walk back up to his room. Then the lights come back and begin to fly back-n-forth yet again with very high strobe activity from small white lights to red every 5 blinks or so, only this time there appears to be a short beam of light coming from underneath, not like those abduction beams but lights. 3 of these appear and form a triangle shape and move around and the shape gets distorted like its moving in crazy directions. All activity stops for 3 minutes and then 2 of the red lights with beams appear a good 100 yards or more away from each other and fly at a large speed and collide and appear to become 1 and then disappear in almost an instant. At the EXACT moment, another large bright white light juts out of the darkness maybe 150 yards away from the collision point and disappears 4 seconds later. All activity ceases for 10-15 minutes and i head back to my room on the same floor. 10 minutes after sitting down i get another call that they are flying around like crazy and blinking like crazy and i run over to his room to see one of the objects with the beams fly to the left and disappear. Many people came into the room over the entire period of this and saw activity but threw it away as airplanes. A red light appears some minutes later and flies to the left and disappears and then reappears far on the right and continues heading left and then disappears again. I wait 15 more minutes and then again go back to my room, this is about 12 or 12:30 now. I told my friend to call me if anything dramatic happens again and i fall asleep at 4:30am with no call. In the morning i ask him if he saw anything else and he says he stayed up til about 2:30 watching various lights appear and reappear. After seeing the red lights moving i thought it was just a plane but then the agile movements began. Tears were in my eyes, i could not believe what i was seeing, i felt so very confused. Attached is a view from his window i took today. The objects stayed above the bottom of the mountains and below halfway into the sky. Also this morning a farmer in las animas county found one of his cattle mutilated, no blood, no tracks, no reproductive organs. Please provide some answers."],"Object Features":"Unknown","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/20469.html.txt","/var/www/straped/mufon/more/20469_submitter_file1__Photo316.jpg","/var/www/straped/mufon/org/20469.html"],"Object Shape":"Cigar, Circle, Disc, Fireball, Flash, Star-like, Triangle","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=40.020086,+-105.261576(20469)&iwloc=A&hl=en\"> mufon case (20469) map </A>","Log Number":"US-11112009-0017","Weather Factors":"None","Longitude":"-105.261576","Latitude":"40.020086","Sighting Duration":"Undisclosed","Region":"Colorado","Date of the Event":"11/10/2009 10:00 UTC","Source":"MUFON","Country":"United States","Date Submitted":"11/11/2009 03:20 UTC","City":"Boulder","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"Bright lights (white and red) fly just over the mountain edge."}