{"Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"CA-11112009-0020","trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around November 10th 2009"],"Latitude":"42.297906","Source":"MUFON","Object Features":"None","Date Submitted":"11/11/2009 05:59 UTC","Case Number":"20472","City":"Windsor","Object Shape":"Boomerang","Date of the Event":"11/10/2009 11:45 UTC","Longitude":"-82.984005","Sighting Duration":"00:00:06","Summary":"4 separate aircraft, all boomerang, or flying wing shape. Luminous, glowing, over 100% of their surface. No typical aircraft lights of any kind.","divs":["Sighting DetailsI went out on my back porch to investigate the sound of animals fighting, like a cat or dog. I had been in my family room watching Letterman when I heard the noises. I looked around unsuccessfully for a few seconds, when something caught my eye flying overhead. For a fleeting second, I thought I may be seeing some Geese, and that would possibly explain the sound I was hearing, but within a second, I realized that what I was seeing were four separate aircraft of some kind. They were completely luminescent boomerang or flying wing vehicles, with no body, only wings. It looked for a second like they were very close to the ground, because of the way they were lit up, like they were catching reflected light from the street lights. I soon realized that they were much further up than that, maybe two or three hundred feet. What shook me was how fast they were going. I watched them go from one horizon, (at first sight) from the east, and disappear out of sight on the southwest horizon, in about six seconds. I would compare it to the time over this past summer when the space shuttle flew over our area. My wife and I waited up for it, after we saw it on the news. These vehicles that I saw last night, were going about that fast. They were completely, and absolutely silent. Three of them were in a tight formation, and the fourth one was flying slightly behind and to the left of the 3 in formation. I am a 58 year old Police Officer. I just retired early this year, after 30 years of service. I have seen just about everything that you could imagine, but I have never seen anything like those aircraft. They defied conventional wisdom, and are contrary to everything I thought I knew about aircraft. It takes a lot to shake me, but what I saw did just that. I didn't sleep a wink. I was completely sober, and wide awake during this sighting. I have never seen, or reported anything like this before. I will not report it locally, because I want to protect my reputation. Thanks for your website."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.297906,+-82.984005(20472)&iwloc=A&hl=en\"> mufon case (20472) map </A>","files":["/var/www/straped/mufon/html2text/20472.html.txt","/var/www/straped/mufon/org/20472.html"],"Object Flight Path":"Path with directional change","Region":"Ontario","Country":"Canada","Viewing Distance":"101-500 Feet"}