{"Weather Factors":"Light","Date Submitted":"11/11/2009 06:21 UTC","trends":[],"Object Features":"Dome, Louvres, Wings, Other","files":["/var/www/straped/mufon/html2text/20473.html.txt","/var/www/straped/mufon/org/20473.html"],"Source":"MUFON","Object Shape":"Circle, Disc, Star-like, Triangle, Other","Latitude":"35.524291","Region":"Tennessee","Country":"United States","Log Number":"US-11112009-0021","Summary":"Observed 4 crafts that remained stationary and several others that moved across the sky.","divs":["Sighting DetailsA friend and I were getting out of his truck on the street and walking across the yard to my house looking at the sky. It was a cool, clear night. We both immediately noticed what we thought to be either an unusually large bright star or a planet. We also saw other stars that appeared normal at the time and looked to be in a Big Dipper configeration. We focused our attention on the largest object, though, because it was so beautiful. After a couple of minutes we both noticed that it began to hover slightly and then saw a red light at the top that came on and was flashing. Then a green light at the bottom would flash. Then a bright white white light at the top would flash. I went inside to get binoculors. Over time, these lights would take turns flashing as in a pattern. Sometimes it returned to all white but would become larger and change shapes. Sometimes it would look like a triangle, sometimes like a long vertical rectangle, sometimes it even appeared to be a celestial being with a bright white head and open arms. My friend thought that it looked like a large quartz crystalline structure. At times a large dark red area would appear that looked like a door opening and closing. Everytime it rotated positions it changed the appearance of the overall craft. I then began to focus on the other brighter stars I could see with the binoculors. I was amazed to see that they were now not stars like I had first thought. They had the same basic configerations and colors as the largest craft, just smaller in size. There were four others like this and they were located in a triangle relative to the largest craft. It appeared that they were surrounding the city. They stayed stationary for the entire time I was watching them. After the first hour of watching, I noticed what I thought was a helicopter moving through the sky but it was too high up and made no sound. Under the binoculors I could see that it was just like the other crafts but all red. It moved across the sky and out of vision. Later, two small red crafts appeared and hovered next to each other about midway between the mothership and another stationary craft I previously mentioned. Same flashing lights and patterns, but all red. They moved on after about 30 minutes. Not long after that I saw what I thought was a plane due to a line of red lights in a vertical pattern (again, no sound), as on a wing span. But as it moved across the sky, it rotated and the lights looked like a \"greater than\" mathematical symbol. It rotated again and I could see that it was actually a disc-shaped flying saucer type craft. It moved rapidly around the sky then out of vision. Actual airplanes and helicopters were flying in the sky over this 2 hr. period, so I am very sure that the other objects I described were not normal aircraft."],"Longitude":"-86.571877","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Case Number":"20473","Date of the Event":"11/10/2009 07:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.524291,+-86.571877(20473)&iwloc=A&hl=en\"> mufon case (20473) map </A>"}