{"Country":"United Kingdom","Object Flight Path":"Undisclosed","Longitude":"-0.311324","Object Features":"Undisclosed","Date of the Event":"08/16/2009 08:30 UTC","Region":"","Viewing Distance":"Unknown","Summary":"Large orange light went out we could see large drey disc.","Case Number":"20470","map":"<A HREF = \"http://maps.google.com/maps?q=51.512381,+-0.311324(20470)&iwloc=A&hl=en\"> mufon case (20470) map </A>","Sighting Duration":"Undisclosed","City":"Reading","Disposition":"Unresolved","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20470.html.txt","/var/www/straped/mufon/more/20470_submitter_file1__img001.jpg","/var/www/straped/mufon/more/20470_submitter_file2__3rdJune2009(3).JPG","/var/www/straped/mufon/org/20470.html"],"Log Number":"GB-11112009-0018","Tags":"City","Latitude":"51.512381","Source":"MUFON","Object Shape":"Disc","divs":["sighting details my family & i had a sighting of two disc shaped objects on saturday 15th august. the time was between 8.30-9.00pm. it was dusk, well just turning dark. we had parked on the field just by the rowing club by the river in caversham (between what used to be called the holiday inn, not sure what it's called now, & rivermead lesuire center) - just off richfield avenue. we were getting out of our car, & were on our way to the fair, when our two boy's started shouting \"look there's a ufo\" \"look! what is that?. we looked up expected to see a plane, instead we saw a huge round orange light. within a few seconds the light went out & we could all see a dark grey disc, rotating as it moved. it was flying just below the clouds coming from the direction of london\\heathrow se. travelling on a straight path, heading in the direction of nettlebed(north). it travelled at the speed of a plane maybe slower. the rotation of the disc seemed to be distorting the air, around it. we watched it until it was almost out of sight, then our eldest son noticed another disc the same as the disc we had just observed, it followed on the same path as the first disc we watched for 3-4 minutes altogether. by that point are eye's were straining to focus as it was turning really dark. we were shocked to see these huge dark grey disc's overhead where we would usually see passenger jet's. files 2 & 3 are not connected to this sighting"],"trends":["There have been 48 other sightings in Reading","There were no other sightings in Reading on or around August 16th 2009","This sighting has never been favorited.",""],"Date Submitted":"11/11/2009 03:27 UTC"}