{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20478.html.txt","/var/www/straped/mufon/more/20478_submitter_file1__1108091032a.jpg","/var/www/straped/mufon/org/20478.html"],"Latitude":"38.88895","Tags":"City","Object Shape":"Cylinder, Other","Case Number":"20478","divs":["Sighting DetailsIt was Sunday, November 8th, 2009 and I was walking up to the US Marine Corps War Memorial in Arlington County, VA. I was approaching the memorial via the walkway leading up from the Southwest and looking up at the large flag on top of the statue. While examining the flag I noticed something dark in the sky just to the right of it. Shifting my attention to this new object, I saw a black shape like an upside down \"L\" hanging there in the sky. I stared at this object for several minutes wondering what the heck it could be, and as I watched the L-shape continued to bend at the joint until it was more of a wide V-shape. The object continued to change shape with the angle becoming more obtuse until it was nearly a straight line. Simultaneously it seemed to be drifing towards the Southeast, roughly following the path of the Potomac River below it. I had absolutely no idea what this object could be, as it was clearly visible and yet resembled no aircraft or balloon I had ever seen. The weather was very clear and sunny; not a cloud in the sky. The object appeared to be higher than a nearby office building of 20-30 stories, and I estimate it was probably over 500 feet in the air. Its exterior reflected the sunlight and appeared bright white as it caught the light along one edge. It looked like it could have been a balloon of some kind, since it was long and flexible, but it was cylindrical and probably over 20 feet long and easily more than a foot thick. The \"skin\" of the object was black and shiny, almost like a garbage bag or that corrugated plastic drainage conduit you sometimes see in gardens or farms. It struck me that it looked as if someone had inflated a giant balloon in order to tie it into a dog or other funny shape but lost control of it before doing so, leaving a giant tube flying through the sky. It was moving lazily and without apparent control, as if it was drifting in the wind. There being over a dozen other people at the memorial at this time, I said to a man standing near me, \"Sir, I'm not seeing things am I? Do you see what I see up there? What is that thing?\" He followed my gaze and immediately noticed what I was talking about, remarking, \"Oh, yeah. I see it. What the heck is that thing?\" He then walked over to his family who were admiring the memorial and directed their attention to it as well. Over the next few minutes they discussed what it could be, with a boy of about 10 years suggesting that it might be a hang glider. Meanwhile, I called my girlfriend who was at home and asked her to go outside and try and photograph the object, as it appeared to be floating in roughly the direction of our home (southeast, towards the Pentagon and Crystal City.) She tried to do this, but was unable to locate the object in the sky. I continued to watch the object as it drifted Southeast and passed into the area of sky that the rising sun was occupying that morning. Before I lost sight of it in the sun's glare I tried to photograph it with a cell-phone camera, but upon examining the photo on my computer there was too much sun-glare to see anything. I'll attach the photo anyway just in case someone else wants to take a look. The object was visible to the naked eye just to the left of the sun when the photo was taken. If anyone else saw this object I hope they post their own story, as this was during the daytime on a Sunday over our nation's capital, so I can't have been the only one who noticed this."],"Object Features":"None","Date Submitted":"11/11/2009 09:45 UTC","Source":"MUFON","Country":"United States","Summary":"Odd Floating Tube","Log Number":"US-11112009-0026","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/08/2009 10:05 UTC","Region":"Virginia","Longitude":"-77.0971","Weather Factors":"Light","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=38.88895,+-77.0971(20478)&iwloc=A&hl=en\"> mufon case (20478) map </A>","City":"Arlington","trends":["There have been 7 other sightings in Arlington","There were no other sightings in Arlington on or around November 8th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path"}