{"divs":["Sighting Detailsrecent one, i once again felt as if my body and soul(being form) was being seperated from each. giving me a feeling of each part of myself going each the opposite direction. believe it is sort of a scan devise that must divide any physical particals.i firmly feel it is part of an under ground base. which is not of our regular military. due to other gained personal information. along with our local military base interception of its appearance; possible seen on its radar. belive this odd unmarked craft shot away to where there was no further agression from that interception of our military. for our military plane( jet) returned to area and flew back towards its base direction. i have also been, witness and or taken; with black silent helicopters. which hovered directly over my vechile. I get these weird and odd feelings when these crafts appear. I have been abducted since childhood. have way more information . if interested. no need to say i am scared, but willing to help. last time i tried to contact you---computer died. also have information about seeing alien being with 2 exact twin young male humans in its possion,that it had total mind control over them. this took place at a near-by restaurant.incident took place about three years ago."],"Longitude":"-88.778338","files":["/var/www/straped/mufon/html2text/20475.html.txt","/var/www/straped/mufon/org/20475.html"],"Viewing Distance":"21-100 Feet","Tags":"City","Log Number":"US-11112009-0023","Summary":"Small UFO (12ft wide, 4ft high)flew slowly past mobile home at tree top height.","Date Submitted":"11/11/2009 09:07 UTC","Country":"United States","Object Shape":"Triangle","Case Number":"20475","Region":"Wisconsin","Latitude":"43.78809","Object Features":"None","City":"Adams - 1.5mi. north","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"11/11/2009 11:30 UTC","trends":["There have been no other sightings in Adams - 1.5mi. north","This sighting has never been favorited."],"Disposition":"Unknown","Weather Factors":"None","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.78809,+-88.778338(20475)&iwloc=A&hl=en\"> mufon case (20475) map </A>"}