{"divs":["Sighting DetailsWell, the sound of choppers has me at my window today.. I noticed that the \"RED\" strobe or glow they produce looks strikingly similar to the \"REDCRAFT\" I record. Today these choppers are acting very strange as you can see.. Notice the strobes or lights.. I think they are really just white & red orbs that pulsate that plasma glow, giving the illusion of a helicopter light. I'm shooting from my house and they are hovering over Central Park.. I usually run to the park to film but, I'm alone and my wife is to scared now to join me. These 3 BLACK (UFO) CHOPPERS have been flying around just like you see.. Today they came our very early, like 5pm. As I zoom in and at times I look at the \"CHOPPERS\" with binoculars, I can't seem to see the figure.. Just the 2 bright lights. Nothing attached. Other times, you notice the figure of a helicopter... Notice that these birds are not making any noise.. Its incredible.. I really think we are being invaded by aliens.. These ORBS seem to maybe be the alien.. Or maybe they are inside the ORB.. The ORBS seem to change shape and color, mimicking anything I guess.. I know what a helicopter should look like and the size, and the blackbirds you see are not normal size choppers.. They are huge, almost double the size, about the size of a huge city bus. This is getting crazy. See how they dance and sit, showing off I guess. One even swings by my window I guess to get a look at me.. Did you see how near it got to my window............. WOWWWWWWWWWW"],"trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around November 12th 2009","This sighting has never been favorited.",""],"Date of the Event":"11/12/2009 12:00 UTC","Object Flight Path":"Undisclosed","Region":"New York","Case Number":"20485","Summary":"BLACK (UFO) CHOPPERS.. Orbs/UFOs mimicking Helicopters.. nyc 111209","map":"<A HREF = \"http://maps.google.com/maps?q=40.786904,+-73.95949(20485)&iwloc=A&hl=en\"> mufon case (20485) map </A>","Date Submitted":"11/12/2009 06:48 UTC","City":"New York","Log Number":"US-11122009-0007","Weather Factors":"Unknown","Country":"United States","Object Features":"Undisclosed","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/20485.html.txt","/var/www/straped/mufon/org/20485.html"],"Longitude":"-73.95949","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Latitude":"40.786904","Disposition":"Unresolved","Sighting Duration":"Undisclosed"}