{"trends":["There have been 5 other sightings in Timmins","There were no other sightings in Timmins on or around November 11th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=48.485031,+-81.325575(20484)&iwloc=A&hl=en\"> mufon case (20484) map </A>","Case Number":"20484","Tags":"City","Region":"Ontario","Date Submitted":"11/12/2009 05:18 UTC","Source":"MUFON","divs":["Sighting DetailsOk, so me and my friend Jonny (actual name) were driving down riverside drive. We had pulled over to the parking lot of the baseball park right beside the matagami river. We had noticed some crazy chemtrails going on and wanted to watch. First there was one that started off NE to SW. Odd thing is the plan spreading the trail went off course. He turned almost right south. If you were to take your hand and stretch it out an arm lengths away, put out three fingers horizontally, you'd get were the plane changed course. A second plane came into the picture about 30 seconds after the first one disappeared. He was coming from SE to NW. He stopped spraying once he hit the first chemtrail. A third plane came into view following the same course as the first but maybe 50 miles NW of the first. It too changed course, the same way and at exactly the same point as the first. By now we had started driving again. We came around the bend by Pizza Hut and Jonny noticed a dark grey smoke trail following the second chemtrail but not changing course and staying straight. He pointed it out and I seen it as well. It was very odd and we arent sure of what to make of it. Also, while the planes were spreading there chemtrails, it was as if something was following them, breaking through the clouds. We could not see it, but the clouds were moving apart. It couldve have been a shadow of the chemtrail on the backround clouds. Not sure though. Let me know what you guys think. I've attached a Microsoft paint picture of what it looked like. Sorry no real pics. Thanks, Dave"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Other","Sighting Duration":"00:00:30","Disposition":"Unresolved","Date of the Event":"11/11/2009 11:02 UTC","Summary":"Chemtrails over timmins with other odd things around them.","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/20484.html.txt","/var/www/straped/mufon/more/20484_submitter_file1__chem.jpg","/var/www/straped/mufon/org/20484.html"],"City":"Timmins","Latitude":"48.485031","Log Number":"CA-11122009-0006","Country":"Canada","Longitude":"-81.325575"}