{"Weather Factors":"None","Date Submitted":"11/12/2009 10:11 UTC","Object Shape":"Circle, Star-like","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.600376,+-82.873575(20487)&iwloc=A&hl=en\"> mufon case (20487) map </A>","Case Number":"20487","Object Flight Path":"Hovering then path","Source":"MUFON","trends":["There have been 6 other sightings in Mt Clemens","There were no other sightings in Mt Clemens on or around November 12th 2009"],"Sighting Duration":"Undisclosed","Object Features":"None","Region":"Michigan","Tags":"City","Summary":"Glowing whitish orange lights hovering in sky","files":["/var/www/straped/mufon/html2text/20487.html.txt","/var/www/straped/mufon/org/20487.html"],"Latitude":"42.600376","City":"Mt Clemens","Longitude":"-82.873575","Date of the Event":"11/12/2009 06:15 UTC","divs":["sighting detailsi was coming into the house from my back yard when my brother josh saw a bright glowing orange \\white bright light in the sky like a star but it was low in the sky above the house tops in the distance to the south. it began to dim to the size of a pin point. still visible, it began to descend down then rise up and descend again repeatedly for 10 min until it disappeared. two minutes later two more of the same objects rose from the house tops in the distance. one stayed in the same spot the original object was at. the second flew about the same speed as a military jet heading west when it disappeared below the trees. the object that remained made the same motions the original one made. it suddenly glowed brightly then disappeared. at 7:30pm a jet took off from selfridge ang that is 3mi south of us and headed west in the direction the light that moved to the west as described above. no other aircraft flew in the airspace until 8:03pm when the same looking jet came back. i thought it could have been a small hot air balloon but it didnt explain how the one moved real fast in the west direction. i was not scared, but puzzled. they did not make any noise or sounds."],"Disposition":"Insufficient Data","Country":"United States","Log Number":"US-11122009-0009"}