{"Region":"New Hampshire","City":"Hinsdale","Source":"MUFON","trends":["There has been one other sighting in Hinsdale","There were no other sightings in Hinsdale on or around August 6th 1954"],"Weather Factors":"Lightning, Light","Tags":"City","Case Number":"2048","Object Shape":"Unknown","Date Submitted":"08/06/1954 10:00 UTC","Latitude":"42.786206","Date of the Event":"08/06/1954 10:00 UTC","Disposition":"Hoax","Country":"United States","Sighting Duration":"01:59:00","Object Features":"Undisclosed","Log Number":"","Summary":"Possible encounter in 1954-56","files":["/var/www/straped/mufon/html2text/2048.html.txt","/var/www/straped/mufon/org/2048.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.786206,+-72.486509(2048)&iwloc=A&hl=en\"> mufon case (2048) map </A>","divs":["Sighting DetailsI was reading the Allagash Abductions and noted that in the 1970s, there werereported UFO landings near the Brattleboro Vermont area. In 1954 or 1955, mycousin and I had a frightning experience which we thought was quite natural.I was spending the summer on my relatives farm in Hinsdale, New Hampshire, whichis just across the Connecticut river from Brattleboro, Vt. We went into thewoods on the farm to repair a broken cow fence. While there near the fence, anelectrical storm came up. We saw a bright Flash of light and I was knockedunconscious for several minutes. When I came to, I was sitting against a tree,paralyzed but recovering OK. It seemed like when your foot falls asleep, exceptit was my whole body. My cousin Eddy was running around literaly bouncing offtrees. We assumed that we had been struck by lightning.My question is, were there any UFO sightings in the Brattleboro VT. area between1954 and 1956 In the book I read were pictures of marks the men had recieved onthier legs called chop marks. I have these marks which appeared after aninfection on my right chin area two years ago. After the scabs fell off, theyleft those small gouges in my leg This is not a UFO sighting report, just aniquiry Thank you Kevin P. Moran-torrguy@aol.com"],"Longitude":"-72.486509","Viewing Distance":"Unknown","Object Flight Path":"Unknown"}