{"Viewing Distance":"Unknown","City":"Tampa","Latitude":"27.952135","Summary":"Bulged tear drop shaped flying object seen by reflection of ground light","Log Number":"US-11122009-0010","Region":"Florida","Date Submitted":"11/12/2009 10:52 UTC","Object Shape":"Blimp, Teardrop","Sighting Duration":"00:00:20","Source":"MUFON","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","divs":["Sighting DetailsWalking to a friend's dorm on USF campus I looked up to see what constellations I could spot. It was always difficult to spot the dimmer ones due to a considerable amount of light pollution. The few clouds around were a light orange color due reflecting from the ground. As I was looking at Andromeda I noticed something moving southward through the sky. It was what appeared to be an object about the same size (visually) as a low flying helicopter and was moving at a similar speed. It was emitting no lights and was making no sound. What I saw appeared the reflections of the ridges of an object. It appeared to be tear shaped object with bulges. I saw an outline of several curves, the largest of which was at the front (in the direction on motion). It appeared slightly larger than a semi sphere (based on the size of the rim I saw). The bulges gave it the appearance of multiple toruses on their side which got progressively smaller towards the back. The object also had what appeared to be a rod of some sort under the head pointing forward. The image was dim and seemed as if it was only visible because of reflection of ground sources of light. It was a significantly darker shade of orange than the clouds in the sky. It was also much less defined in shape than the clouds. The edges of the object were not crisp but fuzzy. I stood there watching the object and I thought it was a trick of my eye- an after image perhaps. I looked away to see if I would still see it in the center of my vision (to check if it just was an illusion), but it wasn't where I looked. I turned my head back and it was still there but it had continued moving and was nearing a high cloud. I watched it wondering if it would block out the cloud so I could see a better outline of the object, but instead of flying below the cloud it disappeared behind it."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=27.952135,+-82.448078(20488)&iwloc=A&hl=en\"> mufon case (20488) map </A>","files":["/var/www/straped/mufon/html2text/20488.html.txt","/var/www/straped/mufon/org/20488.html"],"Country":"United States","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around November 12th 2009"],"Object Features":"Unknown","Longitude":"-82.448078","Case Number":"20488","Disposition":"Insufficient Data","Date of the Event":"11/12/2009 08:30 UTC"}