{"Country":"United States","Object Flight Path":"Stationary,Hovering then path","trends":["There have been 13 other sightings in Canton","There were no other sightings in Canton on or around November 12th 2009"],"Sighting Duration":"Undisclosed","Case Number":"20491","Object Features":"None","Longitude":"-81.374147","files":["/var/www/straped/mufon/html2text/20491.html.txt","/var/www/straped/mufon/org/20491.html"],"Log Number":"US-11132009-0003","Latitude":"40.807937","Source":"MUFON","Object Shape":"Triangle","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date Submitted":"11/13/2009 01:20 UTC","Weather Factors":"None","Date of the Event":"11/12/2009 06:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.807937,+-81.374147(20491)&iwloc=A&hl=en\"> mufon case (20491) map </A>","Region":"Ohio","Summary":"I saw a hovering traingle shaped craft with yellow and orange lights with no sound just sitting there.","City":"Canton","divs":["Sighting DetailsI was coming from a client's house off of Strausser and turned south onto Frank Rd. I looked up and I saw what I first thought was an airplane because we are close to Akron Canton Airport and I see many low flying air planes on that street. I usually hear a loud sound when it is a plane and I looked up and noticed I didn't see the usual red blinking light underneath the craft when it is an airplane. I kept looking at the craft and noticed it was not moving. I started to wonder, \"Why is it not moving? If it was a plane it would be moving!\" I got a chill up my spine when I realized I was looking at something I have never seen before something I couldn't explain and possibly something not from this world. It was black or misty grey in color. It had one yellow light on the one right corner and one orange light on the other left corner, which blinked on and off at different intervals back and forth. The tip of the craft was pointing towards the northeast but more toward the east. It was just sitting there and there were other cars driving on the road. There was no sound or noise like a plane and no wind or trees blowing like a helicopter just silence. I was wondering, \"Don't they see that!?\" I immediately turned off at the next side street to the right and pulled over to get a better look. I looked out of my right window and it immediatedly turned all the way north and took off as if going toward the airport. I said out loud, \"You saw me looking at you!\" I just sat there for a minute and then left."]}