{"Object Shape":"Boomerang, Sphere, Triangle","Weather Factors":"Unknown","Date of the Event":"11/12/2009 06:05 UTC","Summary":"Watched goup of UFOs manuver for an hour and a half.","Region":"Illinois","Longitude":"-87.741711","Object Features":"Unknown","Case Number":"20499","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","City":"Monee","Latitude":"41.420034","trends":["There has been one other sighting in Monee","There were no other sightings in Monee on or around November 12th 2009"],"Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/20499.html.txt","/var/www/straped/mufon/org/20499.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.420034,+-87.741711(20499)&iwloc=A&hl=en\"> mufon case (20499) map </A>","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Disposition":"Unknown","divs":["Sighting DetailsI was working out in the back yard when I noticed 5 bright lights in a group off due east and about 5 degrees to the north. The lights were visible through a break in the tree line and as I looked closer I could see more off to both sides of the break. I could see at least 9 or 10 lights that appeared to be round and white with a slight bluish hue. They were not moving in a linear fashion as does the air traffic around here but most appeared to be motionless but for 2 or 3 that moved around the others. At this point I wanted a closer look and ran inside for about 20 seconds and grabbed a pair of binoculars. I also called my wife who was in our house and told her to come quick with the video camera. As I started to watch with the binoculars the group arranged itself into v shape or boomerang as above. It remained this way for a minute or two and then the lights dimmed as if on a dimmer switch and became less orb like and more like smaller dots of light and began to disassemble itself into groups.One group of 3 appeared to rotate in place for several minutes while the others began to move off in a north or northwest direction another to the east and another to the south east all moving away from my position. My wife had arrived with the video camera but as I am not very familiar with the functions could not get the night shot function on the camera to work. With the last light disappearing my wife and I got in the car and drove east for about 5 miles where we could see three groups again one to the north one northeast and one southeast after another five miles or so the groups began to move away from us faster than I wanted to drive so we stopped and watched the last group drift of to the southeast and headed back to our house. When we were about 2 miles from the house and heading due west I could see another group of 3 lights off the west of our house.This group hardly moved from where it was at and I watched it for another 20 minutes before heading into the house for supper.There was no sound associated with these lights and except for the earlier brilliance remained constant (did not blink like aircraft navigation lights)"],"Tags":"City","Date Submitted":"11/13/2009 08:38 UTC","Log Number":"US-11132009-0011"}