{"Case Number":"20492","Source":"MUFON","Date Submitted":"11/13/2009 05:37 UTC","Longitude":"-0.124755","Date of the Event":"08/06/2008 09:11 UTC","Summary":"Part 2 - Sighting 06/08/08 - V Shaped Object","divs":["Sighting DetailsI was alerted by two boy's who live near by. They had told me that they were going home, somthing had scared them. They could not tell me exactly what had frightened them, execpt there was something in the sky at the end of our road. They said there was a light that seemed to be following them. They felt, they had to go home & they did not feel safe. I walked to the end of my road with my camera & looked for my-self. The only thing I could see were two small clusters of clouds I watched them as they travelled over towards my house. I could not really make out what they were if anything at all they drifted higher & were getting fainter. When I arrived home I put my camera on a tripod & took three photographs one after another I did not see the line of lights that move down the sky until I viewed the photos on my computer. Through the evening I noticed & photographed some odd cloud formations. The photograph files were taken at: 21.11 & 21.12 I am not sure what they are. Camera I used was a Nikon D60 on Auto setting."],"files":["/var/www/straped/mufon/html2text/20492.html.txt","/var/www/straped/mufon/more/20492_submitter_file1__LightsNo.1(2).JPG","/var/www/straped/mufon/org/20492.html"],"Sighting Duration":"Undisclosed","Region":"England","Country":"United Kingdom","Object Shape":"Other","Object Features":"Undisclosed","City":"London","Object Flight Path":"Undisclosed","trends":["There have been 91 other sightings in London","There were 2 other sightings in London on or around August 6th 2008","This sighting has never been favorited.",""],"Log Number":"GB-11132009-0004","Disposition":"Unresolved","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Latitude":"51.517599","map":"<A HREF = \"http://maps.google.com/maps?q=51.517599,+-0.124755(20492)&iwloc=A&hl=en\"> mufon case (20492) map </A>"}