{"Disposition":"Unknown","Case Number":"20490","files":["/var/www/straped/mufon/html2text/20490.html.txt","/var/www/straped/mufon/org/20490.html"],"Region":"Missouri","Summary":"a ball of pure bright white floating","Log Number":"US-11132009-0002","Object Features":"None","Source":"MUFON","City":"Merriam Woods","Viewing Distance":"20 Feet or Less","Tags":"City","divs":["Sighting DetailsLast Saturday night at around 10:30pm I was sitting out on my front porch. It was up to 85 degrees that day and the house was still warm so I went out to the porch for a breather. The best way to describe what I seen was a ball of pure bright white pass over the roof of my home, float over our driveway and just a couple of feet over the roof of our neighbor's home across the road and then it completely disappeared. I was waiting to hear a crash or something but there was nothing. You need to remember we live in a wooded area means lots of trees. How this ball of light managed to avoid trees just baffles me!! I ran back into the house and woke my husband up and tried explaining what just happened. He said it was probably a meteor. I got back into bed and laid there contimplating all of this and I am pretty sure it was not a meteor. If it was, wouldn't there have been some reddish orange from the heat? When it hit the ground wouldn't I have heard that or felt that? By my best calculations I would say the ball was about 2 feet more or less and being completely round. No sound at all...just a very bright ball of white light floating. 1. This happened on Saturday, Nov. 7th at around 10:30pm. 2. No storms, no winds, a beautiful clear night. 3. Sitting on the front porch enjoying the evening when a perfectly round glowing white ball drifted approximately 15-18 feet above the ground. It had come over the roof of our home from behind and then it came into view floating completely over our long driveway moving in a straight path crossing the road and almost hit my neighbors house roof. 4. Once it cleared their roof it vanished. I mean just vanished!! 5. The best way to describe this ball was perfectly round illuminating a VERY bright white light. It was moving at approx. 3-5 mph. Slow enough where I was able to watch it and it's movements. 6. The next morning I took my camera and was going to walk the path and see if I could find anything behind my neighbors home, the trees and the ground. 7. I knocked on my neighbors back door and talked with both the wife and husband. This is where it gets interesting. The husband told me that about a month ago he was sitting in his front living room with his blinds closed when he seen a round bright light coming into his living room through the living room window. He then said that the \"ball\" of light kept moving throughout his home. He got up and followed the light until he reached the back of the house laundry room and it disappeared. He thought it was someone with a bright flashlight scoping out his house. He went outside and started looking for this person. He found nothing. This has happened a total of 4 times that he has seen this \"light\". His wife seemed upset that he didn't tell her about this, but he said, \"I thought I did tell you\". He said he was happy to hear that he was not the only person seeing this and that I actually witnessed the actual object that was causing what he had been seeing. I asked permission to walk behind their home and look around. They both said...Of Course and keep us up to date. 8. As I walked behind their home I noticed too many trees (large) that would have been very hard to maneuver around. I did not see any burnt marks or damage on the ground or on the tree trunks. I continued walking down the road looking for anything. I found nothing. 9. I contacted our Police Dept. to find out if they received any phone calls of other's seeing this. Our Chief Of Police said I was the only call. I did ask him that while on duty if he has ever seen anything like this and he told me no....I was the first to report this. 10. What is also interesting is that there is a cattle farm 2 roads behind our home and that is where it had to have come from. I checked out \"lightning balls\" and looking at pictures, it wasn't even close to what those look like. There was no \"tail\" wind or sound. Since this caught me off guard I didn't have a camera (banging her head) where I could photo it. I now have my camera on the front porch and I have been going out there from 10:00 pm to 11ish hoping to see it again. The chances of this sound good since my neighbor has seen the light 4 times. OK... Deep Breath....This Is Still Baffling Me"],"Object Shape":"Circle","Weather Factors":"None","Object Flight Path":"Hovering then path","Latitude":"36.71395","Longitude":"-93.161847","map":"<A HREF = \"http://maps.google.com/maps?q=36.71395,+-93.161847(20490)&iwloc=A&hl=en\"> mufon case (20490) map </A>","Date Submitted":"11/13/2009 12:54 UTC","Date of the Event":"11/07/2009 10:30 UTC","Country":"United States","Sighting Duration":"00:10:00","trends":["There have been no other sightings in Merriam Woods","This sighting has never been favorited."]}