{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20503.html.txt","/var/www/straped/mufon/org/20503.html"],"Source":"MUFON","Case Number":"20503","Object Features":"None","Object Shape":"Flash, Triangle","Tags":"City","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around November 13th 2009"],"Longitude":"-84.51046","Date Submitted":"11/14/2009 10:05 UTC","Region":"Ohio","divs":["sighting detailsdriving down beechmont ave in on the east side of cincinnati, heading west toward five mile rd from withamsville, i observed an object that looked like it was re-entering space debris breaking up as it came down. that object split, and became four very bright yellow\\white balls of light that formed a triangular shape, and hovered, rotating very slowly in a clockwise direction some distance to the west north west of where my friend and i were driving (i was the passenger). i did not perceive that the object(s) were descending, but remaining at a constant altitude, though they were low to the horizon from my vantage point, as they were at some miles distant. the road went through some low areas and the lights became obscured by trees and buildings, and once we reached a hight point in the road again, the lights were gone. i observed these lights for a full 15 minutes as we drove from withamsville to the outback at beechmont and five mile, my friend and i trying to figure out what they were. there was nothing on the news about it, and having been a student pilot and being around airplanes, it didn't behave like a conventional aircraft, fixed wing or rotary. i've never seen anything like this, and i have never really believed that ufo's or extraterrestrials (if this is what it is, i'm not saying that) were real, but its made me think."],"City":"Cincinnati","Disposition":"IFO","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.111548,+-84.51046(20503)&iwloc=A&hl=en\"> mufon case (20503) map </A>","Log Number":"US-11142009-0003","Summary":"4 lights shaped like a triangle hover over east side of Cincinnati for 15 minutes.","Latitude":"39.111548","Viewing Distance":"Unknown","Date of the Event":"11/13/2009 07:35 UTC"}