{"Object Shape":"Disc","Case Number":"20505","trends":["There has been one other sighting in Sullivan's Island","There were no other sightings in Sullivan's Island on or around December 6th 1980"],"City":"Sullivan's Island","Disposition":"Insufficient Data","Latitude":"32.763333","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Longitude":"-79.837778","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-11142009-0005","Date Submitted":"11/14/2009 11:23 UTC","Date of the Event":"12/06/1980 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.763333,+-79.837778(20505)&iwloc=A&hl=en\"> mufon case (20505) map </A>","files":["/var/www/straped/mufon/html2text/20505.html.txt","/var/www/straped/mufon/org/20505.html"],"divs":["Sighting DetailsMy visiting girlfriend and I decided to take a late night walk on the beach. We parked the car and proceeded down a path towards the beach where the brush was grown up and formed a tunnel about 10 feet long to walk through before opening onto the dunes. Upon exiting the tunnel the dunes, beach and ocean become a vast expanse of visibility. As we walk towards the ocean we notice how still and quiet everything was. The sky was perfectly clear and the ocean was motionless allowing the reflection of the stars to be clearly seen on the reflection of the waters surface. A few ships lights could be observed on the horizon either coming into or leaving Charleston harbor though they didn't appear to be moving. We both sensed an uneasy feeling at the extreme stillness of the night and the ocean and were ready to go back home when we noticed what seemed to be a very bright flickering star very low in the sky over one of the ships in the distance. While we were observing it wondering if it was a planet or what, it suddenly moved left to right from hovering over one ship to hovering over another one some distance away from the first. The movement was almost instant and the distance was finger tip to thumb tip at arms length on the horizon and 3 fingers at arms length off the waters surface. The object hovered there for a few minutes then began to meander back and forth when a bright white light shown down to the water. At this point we assumed it must be a search helicopter as it seemed to be searching the waters off the coast. As it was doing this it also began to come closer and closer to the shore. As it did it became apparent that this was no helicopter. It slowly moved to within 100 yards of the shore hovering 50 ft above the water not creating so much as a ripple. The reflection in the water was perfect, even the stars could be seen reflecting their light. It stopped directly in front of us and sat hovering there a few minutes. It then moved to the right and sat hovering diagonally from us, still over the water for a few more minutes. It then moved again and hovered over the beach 100 yards south of us as if observing but keeping it's distance from us. It hovered 50 ft over the beach not creating any disturbance or noise. It was an incredibly bright saucer shaped object with colored lights all over it blinking in syncopated patterns that changed when the motion of the craft changed. It sat there for a couple minutes as we stood there in awe of what we were seeing. Suddenly it began to move again, this time directly in our direction at the same slow speed. At this point my blood ran cold as my girlfriend screamed and turned to run the other direction. I too turned and took a few steps running away from the craft when I turned my head back to get a look at where it was. It was not down the beach anymore but was hovering over one of the beach houses a couple hundred yards away cocked at a 45 degree angle. A ring of red lights was flashing around the perimeter of the object with all the other lights out. It sat hovering there for a few minutes before drifting off east over the island to be obscured by the houses. We sat on the beach waiting to see if it would come back. After a few minutes we observed 2 of these objects high in the sky flying towards the ocean in like a formation, one behind and below the other. As we watched them fly out over the ocean they both disappeared before flying out of visible range. Upon arriving home that evening we called around to see if anyone had reported these objects and found no reports. We chose to not report it at that time. I'm not sure why, probably extreme confusion mixed with a bit of fear. Or a bit of confusion mixed with extreme fear. Not sure which. It was a profound event which has changed my life in the 29 years since observing it. Knowing something trumps believing in something and this is scary knowledge which few people are ready to hear about. I've never seen a picture or video or description to match what we saw that night. Only in the general sense of being saucer shaped. I've been looking now for 29 years and this craft is still unique in appearance and behavior. I am trained in electromechanical engineering as well as being a certified lighting designer and an accomplished musician. I also have been a respected salesman in the electrical industry. I served in the Army 75- 78 and have a music degree. My musician skills are recognized by many around the world as extraordinary and I currently teach guitar for a living. I was honorably discharged from the service and graduated college Magna Cum Laude and Phi Beta Kappa. I'm known for my honesty and professionalism and this one very strange event."],"Object Features":"None","Summary":"Saucer shaped with bright lights flashing in sequential patterns viewed from 100 yards away.","Region":"South Carolina","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"101-500 Feet"}