{"Summary":"Black Blimp","Case Number":"20504","Weather Factors":"Does Not Apply","Object Shape":"Blimp, Cigar","divs":["sighting detailsafter driving from a state high school track meet with my 15 year old daughter from penn state, i was driving on germantown pike pass norristown heading towards whitemarsh high school with trees on both sides of the road \"we\" both saw this very small blimp\\cigar shaped object fly over about 500-1000ft(apprx). heading southwest(apprx.). since i was moving about 35mph we couldn't keep track of it as we drove it the trees covered it. i saw this same object near my home in june of 2008 near my home address over island ave and buist less than a mile from philadelphia internation airport. the object was about 500-1000ft above my car but i could only see it for a few seconds as i was entering traffic and it move southernly toward airport but not sure it stayed on that path but it was ver small blimp\\cigar shape and black and quite. i don't recall any lights at either sighting. i've was a flight operations coordinator in the us army aviation for 13 yrs working with flight plans, flight records and pilots. the first thing i felt was this was very very unusal as if it was either a ufo or a test flight of something that didn't make sense or to be in these areas. the object did move like a blimp in a straight line. no unusal movement."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.124977,+-75.333565(20504)&iwloc=A&hl=en\"> mufon case (20504) map </A>","City":"Norristown","Date Submitted":"11/14/2009 11:11 UTC","Latitude":"40.124977","Object Features":"None","Object Flight Path":"Straight-line path","Date of the Event":"01/06/2007 05:30 UTC","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-11142009-0004","Source":"MUFON","trends":["There have been 2 other sightings in Norristown","There were no other sightings in Norristown on or around January 6th 2007"],"Viewing Distance":"101-500 Feet","Disposition":"Insufficient Data","Tags":"City","files":["/var/www/straped/mufon/html2text/20504.html.txt","/var/www/straped/mufon/org/20504.html"],"Region":"Pennsylvania","Longitude":"-75.333565"}