{"Latitude":"33.524741","Disposition":"Unresolved","Longitude":"-86.79837","City":"Birmingham","Case Number":"20517","divs":["Sighting DetailsI took my dogs out for a walk approx. 10:30 pm. We live on top of a hill with a large woodland area close by. Shortly into the walk I noticed a bright orange star like object in the sky, I thought at first it could be a police helicopter because it was a low altitude, however I could not hear any rotors, no sound at all, also no flashing lights. The object's movements were strange it seemed to move slowly in random flight path. This object tracked out of range and behind a cloud. At this point I dismissed it as anything. Then another appeared. At this point I thought this is strange, I felt slightly scared, however at the same time excited at what I was witnessing. This light hovered directly in front of me for around five minutes, I could not believe what i was seeing. The dogs appeared scared so i took them back to my house, watching the object as i ran, it to faded into a cloud. I grabed a camera and went back to the area. When I got back to the area the objects had gone and the sky was clear, stars could be seen easily. At the time of witnessing these objects I noted several commercial airlines in this area at different altitudes."],"Sighting Duration":"00:14:00","Object Flight Path":"Other","Date of the Event":"11/14/2009 10:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"GB-11152009-0004","Country":"United States","Summary":"Two orange star like objects tracked across the sky.","Object Features":"Unknown","Tags":"City","trends":["There have been 48 other sightings in Birmingham","There was one other sighting in Birmingham on or around November 14th 2009"],"Region":"Alabama","files":["/var/www/straped/mufon/html2text/20517.html.txt","/var/www/straped/mufon/org/20517.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.524741,+-86.79837(20517)&iwloc=A&hl=en\"> mufon case (20517) map </A>","Date Submitted":"11/15/2009 09:10 UTC","Object Shape":"Star-like","Source":"MUFON","Weather Factors":"Unknown"}