{"divs":["Sighting DetailsThanks to YouTube, I came across several videos regarding the UFO sightings that occurred in the Hudson Valley. I had mostly thought that my sighting was an isolated incident so I kept the story to just close friends. Now that I know I am only among many who saw this craft, I feel its time to tell my story. Location: Lake Walton Road, Hopewell Jct, NY 12533 Activity: Me and two friends and their parents were shooting off some fireworks at my friends house. 4th of July was coming and we were testing some out to see how we would plan our fireworks show. These were all class C fireworks, nothing fancy. What happened: We were lighting off the small stuff for a while ( bottle rockets, cakes, some rockets) and everything was normal. My friend took out some of the \"grand finale\" items and we started to light them off. These are called mortars. Basically its a cardboard tube with shells that you insert in and then the fuse hangs off the side. These go the highest and look like mini versions of what you see on TV. On the second round, we started to hear a very low sounding humming noise. Directly in front of us, a series of lights shaped in an arc came close. We all immediately knew what this was. The craft was easily 1000 feet long, it covered the majority of Jefferson Park which is a development on the other side of Lake Walton Road. The development has 16 or 17 houses at its width. The craft was super low to the ground. Other than the lights, we couldn't make out any of its exact shape, but if I were to guess the object was a flattened out oval very wide at the length with little depth. The lights along the edge were all different colors. I mostly remember the reds, yellows and whites. The lights were evenly spaced from each other and had some flikering to them. The craft was 100% silent as it hovered there. My friends dad comepletely flipped out, and ran inside to get a camera while his wife was screaming at the top of her lungs. We lit off one more mortar to see what would happen and then heard a bang and the humming again. The craft slightly rotated on axis and in a whoosh it was gone. At this time the dad came out of the house with the camera and there was nothing there. Here is the odd part. And this is the part that scares the crap out of me. Nobody said a word and for the most part, I have no memory from this point forward. All I know is that i got on my bike and went home. I was soaking wet with sweat. When I came home, I was very late. I had a super strict father and I was amazed that my parents, who were downstairs watching tv said hello to me as if nothing was wrong. I said I was tired and went to bed. 100% amazed that I was not in trouble. We were lighting off the fireworks at 8PM and I think it was around 10:30PM or 11PM when I got home. I'm not sure. Nobody in our group ever talked about the event. About three years later I asked one of my friends about it and he said he didn't know what i was talking about. He was a tough guy who worked in a gas station. The point I want to make about this story is that I think the UFO was in the general area when we were lighting off the ground fireworks. It was only when we sent the huge mortar into the sky that the craft approached. As if it was examining the explosion. When they figured out it was just us, it took off. The speed at which the craft approached us and left is simply impossible. Something so large like that able to zap around at will without making much noise except the low humming noise is amazing. If anyone wants to contact me regarding this event please feel free. I am now 38 yrs old, I'm an executive in a large corporation and I would like to learn more about this event in my life."],"Weather Factors":"None","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.706441,+-73.91449(20518)&iwloc=A&hl=en\"> mufon case (20518) map </A>","trends":["There have been 14 other sightings in Poughkeepsie","There were no other sightings in Poughkeepsie on or around June 28th 1983"],"Region":"New York","Log Number":"US-11152009-0005","Object Flight Path":"Path then hovering","Date Submitted":"11/15/2009 09:44 UTC","Latitude":"41.706441","Object Features":"Undisclosed","Longitude":"-73.91449","City":"Poughkeepsie","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Disc, Oval","Summary":"Hudson Valley Large 1000ft Oval Disk First Hand Account","Tags":"City","files":["/var/www/straped/mufon/html2text/20518.html.txt","/var/www/straped/mufon/org/20518.html"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"20518","Source":"MUFON","Date of the Event":"06/28/1983 08:00 UTC"}