{"Latitude":"47.66012","Source":"MUFON","Log Number":"","Viewing Distance":"20 Feet or Less","Object Features":"Undisclosed","City":"Spokane","Disposition":"Insufficient Data","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Date Submitted":"05/16/1996 02:12 UTC","Date of the Event":"05/16/1996 02:12 UTC","divs":["Sighting DetailsThis experience was about 8 years ago, I have told the story many time to friensand relitives now I wish to share it with others.I was asleep in my bedroom when through my slumber I could see bright lights,blue, green, red, and clear, I immidiatly woke and thought maybe I was a caraccident on the street next to my home and this was fire, or police lights, Istarted to get up.. and then realized I was floating above my bed an the lightswere IN MY ROOM floating near the ceiling and inside these lights were humanlike faces. there was uncomfortable feeling though my whole body my insideswere like pulling out anpushing in at the same time. I couldnt move Then the orbs with faces began totalk to me in perfect english not to be afraid they meant no harm and wanted tosay goodbye to me and thank me for all the help I was to them over the years Idont remember helping, or having experience with them before. However they alllooked so familiar to me, they told me they would not be back to contact meagain, one of the intities offered me a chance to leave with them, but I wassingle parent with small child they understood this.I awoke the next morning very exhausted and feeling rather strange, I rememberedeverthing perfectly and thought holy sh-- that dream was so realLater that day, I was raking leaves in the back yard and my nieghbor lady calledme over the fence and said WAYNE how in the earth did you get those coloredballs of light to flty right in your kitchen window and float through your house She was awake reading at that time of the night, and noticed the orbs fly intomy window, it felt like someone knocked the wind out of me, I had that gutfeeling this WAS NOT a dream. Over the next couple of months I had memories ofbeing in a ship that took me to another planet and showed me and explained manywonderful and unusal things, example of totaly different style of sailing boat,different games, music and telepathy. If you would care to contact me feelfree, as I would share this in detail to those willing to listenb or take anypolygraph test.Thankyou for your interestWAYNE EVANS"],"files":["/var/www/straped/mufon/html2text/2051.html.txt","/var/www/straped/mufon/org/2051.html"],"Summary":"saw orbs of colored light with human features insi","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=47.66012,+-117.416687(2051)&iwloc=A&hl=en\"> mufon case (2051) map </A>","Country":"United States","Longitude":"-117.416687","Case Number":"2051","Region":"Washington","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around May 16th 1996"],"Tags":"City","Object Shape":"Sphere"}