{"Viewing Distance":"Unknown","divs":["Sighting DetailsI viewed the light while looking straight up into the sky looking at stars and other aircraft. I was at home at the time and walking to my car to go to the mall. I always look into the sky to identify aircraft, stars, satellites, planets and thought I was watching a satellite pass over at very high altitude. The \"glowing light object\" looked exactly like a satellite, but was traveling from South to North at satellite type speed, but maybe a little slower. I decided the \"object\" was a satellite, but then the \"object\" began to get brighter very slow (1 second interval), I thought it was still a satellite, but then it became dim got brighter at the same interval again. The \"object\" did this 3 times. The 3rd time the \"object\" was brighter and completely disappeared. Usually satellites travel completely across the sky in full view until they disappear across the horizon. The \"object\" traveled in a smooth straight line until it disappeared. During the observation, I felt it had an intelligent possibly telepathic presence as if \"the object\" noticed it was being perceived by observation before disappearing. I lost sight of the \"object\" when it disappeared. After the sighting, I continued my journey to the mall. The \"object\" could be a satellite spinning, I suppose, but I don't have the resources to check this hypothesis."],"Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.767743,+-79.01305(20513)&iwloc=A&hl=en\"> mufon case (20513) map </A>","City":"Undisclosed","Disposition":"IFO","trends":[],"Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-79.01305","Case Number":"20513","Sighting Duration":"Undisclosed","Date of the Event":"11/14/2009 06:10 UTC","Log Number":"US-11142009-0013","Latitude":"35.767743","Tags":"City","Weather Factors":"Unknown","Object Shape":"Star-like","Date Submitted":"11/14/2009 11:50 UTC","files":["/var/www/straped/mufon/html2text/20513.html.txt","/var/www/straped/mufon/org/20513.html"],"Summary":"High Altitude, Satellite Glow, Brightened 3 Times at 1 second intervals and disappeared.","Object Features":"None","Country":"United States"}