{"Date of the Event":"12/07/2002 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.347783,+-80.034459(2052)&iwloc=A&hl=en\"> mufon case (2052) map </A>","Disposition":"Unresolved","City":"Parry Sound","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in Parry Sound","There were no other sightings in Parry Sound on or around December 7th 2002"],"Date Submitted":"12/07/2002 10:30 UTC","Case Number":"2052","files":["/var/www/straped/mufon/html2text/2052.html.txt","/var/www/straped/mufon/org/2052.html"],"Source":"MUFON","Latitude":"45.347783","Object Flight Path":"Unknown","Longitude":"-80.034459","Object Features":"Appendage(s)","Object Shape":"Cylinder","Summary":"Silent illuminated object seen hovering in Ontario","Tags":"City","divs":["Sighting DetailsI was camping north east of Parry Sound on Nine Mile Lake. At the time I washanging a tarp above my tent in case the snow started coming down hard. AS I wastying on of the tarp corners to a tree I was looking up a bit when I had noticeda dimly lit object in the sky, fairly close to the horizon. It was moving slow,appearing to be getting closer to me. There was no sound emitted but I didnotice that as it moved closer my ears started to react like they do when youtravel up or down a large hill. Like they wanted to pop. As it moved closer myears started to ring a little but aside from that I could not hear any soundbeing emitted, just sound pressure. I was on a point that overlooked a goodportion of the lake. The object appeared to slow down and hover just above thetreeline across the lake. It appeared to be shaped like a cylinder with curvedwings on each side that had a curve to them. There were dim red lights on eachwing, solidly lit and three red lights in the center that were slightly brighterbut not by much. As the object came to hover it adjusted its angle slightly andleaned forward. It sat stationary for a short while and I was very intrigued byits presence. I noticed that my Coleman Flourescent lamp that I had hanging inthe tree was shimmering pulsing a little. I also noticed static on my radiowhich gradually increased as the object approached hovered. My hearing wassomewhat impaired as sounds were reduced and muffled since there was a pressure.I swallowed several times to try and get them to pop but they would not. Iturned my back on it momentarily to grab my handheld spotlight and then I shoneit on the surface which appeared to be grayish but somewhat reflective. I alsonoticed a thick protruding rod that looked like an antenna and anotherprotruding rod of the same thickness beside it but it had a sort of cage on theend of it that kind of looked like the end of a whisk. These two rods were inthe center of the object, behind the three red lights. After a short while theobject angled back up and slowly moved sideways down the treeline. I moved aheada little to watch it leave. Within moments the lights faded out and I could nolonger see it. The radio static gradually returned to normal as the object movedaway and the light had stopped acting up. My ears were still affect but after alittle bit of time had pas"],"Log Number":"","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Country":"Canada","Region":"Ontario"}