{"Country":"Portugal","Object Shape":"Blimp","Object Features":"Window(s), Other","Sighting Duration":"Undisclosed","Longitude":"-7.861663","Region":"Coimbra","City":"Oliveira do Hospital","divs":["Sighting DetailsI went to the window of my house and leaned out to look for my cat. It was dark at about 9.30pm. Immediately I saw something in the sky just above the tree line in an easterly direction. At first I thought what the hell is that, then I thought it might be a house on a mountain but I knew straight away that there are no mountains in that direction. As I watched facinated, I could make out 2 lights coming from what appeared to be large windows. The shape was curved on top with a flat bottom and rounded ends, the windows equally spaced either side of the centre. The object remained completely staionary and I guess it was about 1km away. At that distance it must have been atleast 100metres wide. After about 25 seconds the lights slowly faded, over about 5 seconds and it was gone. However while it was still visible the road outside my house seemed to be illuminated as if a car was shining it's headlights towards to object. As it faded the outline of the tops of the trees, near my house, became visible once again. I have no logical explanation for what I saw and really believe it was a craft of some kind."],"Latitude":"40.359716","Date Submitted":"11/15/2009 06:22 UTC","Source":"MUFON","Object Flight Path":"Stationary","trends":["There have been no other sightings in Oliveira do Hospital","This sighting has never been favorited."],"Date of the Event":"11/15/2009 09:25 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.359716,+-7.861663(20527)&iwloc=A&hl=en\"> mufon case (20527) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/20527.html.txt","/var/www/straped/mufon/org/20527.html"],"Disposition":"Unresolved","Case Number":"20527","Viewing Distance":"501 Feet - 1 Mile","Log Number":"PT-11152009-0014","Summary":"Object 1 km away, 2 lights, 100metres wide, above tree line, faded in 5 seconds"}