{"Sighting Duration":"Undisclosed","City":"Point Pleasant","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.137089","Tags":"City","Object Features":"Unknown","Source":"MUFON","Log Number":"US-11152009-0010","Object Flight Path":"Unknown","Disposition":"Insufficient Data","Region":"West Virginia","divs":["Sighting DetailsMy husband and I were visiting Point Pleasant, WV on Sept 19 - 20 for the 8th annual Mothman Festival. Along with activities such as a new documentary release of interviews related to Mothman and UFO sightings back in the 60s, lectures of related interest to the paranormal (including one by a MUFON rep), there were also scheduled hayrides through the abandoned US Army Ordnance Works, better known to the residents of Point Pleasant and Mothman enthusiasts everywhere as the infamous TNT Area, adjacent to the state's Farm Museum. I took pictures of the surrounding area as the haywagon looped around the long-abandoned structures in the TNT section and saw nothing unusual at the time, around 7 p.m. on Saturday. Upon my return home, I downloaded the pictures and was amazed to see orbs in many of the photos. One picture taken after the ride was of a two-story outhouse (I just had to have a close-up picture) that is part of the state Farm Museum's building collection. In the photo, I noticed for the first time an unusual small, bright light in the sky to the left of the outhouse. The light didn't seem like that of a planet or plane and I enlarged it out of curiosity. As I focused in on the photo of the light, there appeared to be three separate fuzzy lights within the larger light object, two over top of another one, and seemed to form a triangle. I tried enlarging it even more and it took on a more oval shape with light around the edges. I've had several people look at the pictures, including a professional commercial photographer, and all agree it doesn't look like anything they've ever seen."],"Country":"United States","Latitude":"38.844525","map":"<A HREF = \"http://maps.google.com/maps?q=38.844525,+-82.137089(20523)&iwloc=A&hl=en\"> mufon case (20523) map </A>","files":["/var/www/straped/mufon/html2text/20523.html.txt","/var/www/straped/mufon/more/20523_submitter_file1__UFOcomposite.jpg","/var/www/straped/mufon/org/20523.html"],"Weather Factors":"Unknown","Date of the Event":"09/19/2009 12:00 UTC","Object Shape":"Oval","Case Number":"20523","Summary":"2009 Mothman Festival - UFO Seen Over TNT Area","trends":["There has been one other sighting in Point Pleasant","There were no other sightings in Point Pleasant on or around September 19th 2009","This sighting has been favorited 1 time.",""],"Date Submitted":"11/15/2009 03:38 UTC"}