{"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-85.586229","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Tags":"City","Case Number":"20520","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsMy sighting occurred while standing on the patio behind my house, having a cigarette. My two dogs were outside with me, running around the backyard and my wife was in the garage nearby. It was nearing dusk, so while it was not yet dark, there were some stars visible in the sky. I was watching a plane pass overhead when something lower in the horizon and to the north caught my eye. What I then saw was five orange glowing spheres flying in a 45 degree formation with each other, traveling from west to east. Living along a plane route and being very familiar with seeing planes and helicopters flying over daily, I immediately knew that these were not planes, helicopters, or really anything I had ever seen before. It is very difficult to judge, but I would guess that the objects were flying at an approximate altitude of 1000 feet. The objects made no sound that I could discern, though the aforementioned plane's engines were still audible. The light source of the objects seemed to be emanating from the objects themselves (no body of a craft visible at all.) The objects traveled at a steady speed, flying slightly faster than a passing plane would be expected to. They stayed in a rigid 45 degree formation with each other with the exception of the \"center\" object falling slightly back for a short moment before falling back into formation, lending to the idea that these were five separate entities and not a single craft with five lights. I called to my wife to come quickly and see this, but by the time she got to where I was, the spheres had disappeared over the sight line of our house. The entire episode lasted no longer than 10-12 seconds. I would say the sighting gave me a feeling of \"calm excitement\" - I knew I was witnessing something quite out of the ordinary. But, given the short duration of the experience, coupled with the lack of any visible detail of the objects, it afterward did not feel like a \"mind blowing\" or life changing event. It was simply a highly interesting occurrence that, to me, lacks any sort of conventional explanation."],"City":"Kalamazoo","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.293077,+-85.586229(20520)&iwloc=A&hl=en\"> mufon case (20520) map </A>","Date Submitted":"11/15/2009 11:07 UTC","Disposition":"Insufficient Data","trends":["There have been 12 other sightings in Kalamazoo","There were no other sightings in Kalamazoo on or around November 1st 2009"],"Latitude":"42.293077","Log Number":"US-11152009-0007","Date of the Event":"11/01/2009 06:00 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/20520.html.txt","/var/www/straped/mufon/org/20520.html"],"Summary":"Five glowing orange spheres flying from west to east in a 45 degree formation","Region":"Michigan","Source":"MUFON"}