{"Viewing Distance":"Unknown","divs":["sighting detailsthis object flew into view behind my house in ne ohio on sept. 9 2009 while i was sitting out back at around 8:30 to 9 pm. from the ground with the naked eye i thought it was the lights of an airplane, but it stopped and stood still in one spot for at least a half hour. when i went back in the house after taking the photos, it was still hovering so i don't know exactly how long it was there. after about 10 minutes i grabbed my fuij digital camera and took a series of 8 photos a few seconds apart. i could not make out any shapes, only flickering lights, with the naked eye and the screen on the camera. it wasn't until i zoomed in on the object in photoshop that i could see the shapes of the object. the ufo was changing shapes as i took the photos. i would have taken more photos if i knew that this was what i would find when i zoomed in on it. i think that the colorization of the ufo is very similar to the those in some of the recent kumburgaz ufo videos. i have the original unzoomed photos, they are about 1 mb each, taken at about 3 megapixel resolution. unfortunately my camera was not set at full resolution or the photos would have been much better. you can view the full series of zoomed photos at my website at http:\\\\freshnuts.wordpress.com\\2009\\09\\13\\shape-shifting-ufo\\"],"Summary":"Shape shifting worm-like ufo","Object Shape":"Blimp, Boomerang, Cigar, Chevron, Cross, Diamond, Disc, Fireball, Oval, Saturn-like, Sphere, Square, Rectagular, Other, Unknown","City":"Akron","Disposition":"Unknown","Case Number":"20525","Country":"United States","Longitude":"-81.514865","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20525.html.txt","/var/www/straped/mufon/more/20525_submitter_file1__dscf0290-PS1.jpg","/var/www/straped/mufon/more/20525_submitter_file2__UFO-3.jpg","/var/www/straped/mufon/more/20525_submitter_file3__UFO-5.jpg","/var/www/straped/mufon/org/20525.html"],"Date Submitted":"11/15/2009 04:09 UTC","Object Features":"Window(s), Appendage(s), Unknown","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around September 9th 2009","This sighting has never been favorited.",""],"Tags":"City","Object Flight Path":"Path then hovering","Latitude":"41.091115","Log Number":"US-11152009-0012","Region":"Ohio","Date of the Event":"09/09/2009 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.091115,+-81.514865(20525)&iwloc=A&hl=en\"> mufon case (20525) map </A>","Sighting Duration":"01:00:00"}