{"Summary":"A black disc shape with red lights around the outer edge and one red light in the center.","Disposition":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-90.18113","Case Number":"20526","Date of the Event":"11/30/1988 12:00 UTC","Object Shape":"Disc","Latitude":"32.300877","Object Features":"None","Date Submitted":"11/15/2009 04:23 UTC","files":["/var/www/straped/mufon/html2text/20526.html.txt","/var/www/straped/mufon/org/20526.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.300877,+-90.18113(20526)&iwloc=A&hl=en\"> mufon case (20526) map </A>","Viewing Distance":"Unknown","Tags":"City","City":"Jackson","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was just starting to go to bed for school one night. I don't remember what year or month. I was lying in bed looking out my bedroom window and had just covered up when I saw something large with red lights outside. My first thought was of the U.F.O. I had seen several years prior. I knew this wasn't a common experience and was freaked out by now possibly seeing a second one. I once again ran out the back door and this time into the yard. What I saw was a black or darkened disc shaped object moving once again in a southeastern direction. It had one ring of red lights around the outer edge and one red light in the dead center of the underside. It was only the underside I could see of the craft. It was rotating and moving at a good speed. Visually it was about an inch and a half wide. The object made on sound. It passed behind the same trees in my backyard and I lost sight of it. I came back in and told my dad I'd seen another U.F.O. He seemed a bit less skeptical, but there wasn't much to be done. I went back to bed and hoped not to have nightmares. Other than that, I suffered no changes."],"Source":"MUFON","Country":"United States","Region":"Mississippi","trends":["There have been 9 other sightings in Jackson","There were no other sightings in Jackson on or around November 30th 1988"],"Log Number":"US-11152009-0013","Weather Factors":"None"}