{"Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was lying in bed and trying to unsuccessfully get to sleep sometime in September of 1986. It was a clear night and there was, if not a full moon, a nearly full one because the sky was very bright. I could see through the blinds out my window quite well. I saw something very large and bright in the sky with different colors moving. I jumped up ran to the back door and stood on the porch. It was, as close as I can describe, like someone had wadded several strands of Christmas tree lights together and made all the lights touch. There was no space between the lights but they were noticeably separate. I can't be sure of the distance from me, but it was passing above the trees with no sound. It's visual size was roughly two and a half inches from front to back. It did not rotate. I can't tell you it's speed, but in the patch of open sky in my back yard it was visible for about a minute from the time I saw it out the window till it left sight. It was traveling in a generally southeastern direction. I remember thinking that I was seeing a U.F.O. I didn't know if it was an alien space craft or something from the government, but being a child I hoped it was aliens. It passed behind more trees and I lost sight of it. My father came outside after it had passed and asked me why I was outside at that time of night. I told him I saw a U.F.O. and he said I'd probably dreamed it. I don't have waking dreams and I don't believe I would have seen it in the window and then AGAIN outside. Afterward I felt confused, excited and somewhat frightened by the experience. I guess everyone's read something about U.F.O.'s at some point in their life, but to actually see one was another matter. I became interested in the history of them afterward and read all the material I could find."],"Latitude":"32.304487","Object Shape":"Other","Date Submitted":"11/15/2009 04:00 UTC","Viewing Distance":"Unknown","Disposition":"Unknown","Country":"United States","Object Features":"None","Object Flight Path":"Straight-line path","Case Number":"20524","Log Number":"US-11152009-0011","Tags":"City","City":"Jackson","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=32.304487,+-90.18318(20524)&iwloc=A&hl=en\"> mufon case (20524) map </A>","trends":["There have been 9 other sightings in Jackson","There were no other sightings in Jackson on or around August 31st 1986"],"Date of the Event":"08/31/1986 12:00 UTC","Summary":"An amorphous mass of multi-colored lights with no real shape.","Longitude":"-90.18318","files":["/var/www/straped/mufon/html2text/20524.html.txt","/var/www/straped/mufon/org/20524.html"],"Weather Factors":"Unknown"}