{"Date of the Event":"08/01/2009 10:15 UTC","Object Shape":"Saturn-like, Sphere, Star-like","Case Number":"20536","Date Submitted":"11/16/2009 12:24 UTC","Region":"Pennsylvania","Viewing Distance":"Over One Mile","Latitude":"41.163298","Longitude":"-80.08601","Tags":"City","Disposition":"Unknown","divs":["sighting details i was driving north on pa interstate 79 at 70mph. the time was approx. 10:15 am. it was a partly sunny morning with blue sky and scattered cumulus clouds. since it was saturday, there was less traffic and i was able now and then to look up over the horizon. this area is one of flat farm land and rolling hills scattered small cities nearby. i was about 2 mi. s of interstate 80 and the clarion exit. i happened to glance above the distant treeline and saw a brilliant sphere at one clock position. it was probably about two or three miles away. i kept trying to watch it as i was driving and it seemed to be motionless. there were no shadows. it didn't pass through any clouds. this sphere was silver with what appeared to be some kind of short nubs on the side which may have been part of a ring around the middle. i couldn't tell but they were too short to be airplane type wings. there were no blinking lights. i was able to watch it for about 15\\20 sec. i lost track of it as i came up a rise in the highway and trees then obscured my view to the east. when i had another clear view i didn't see this object anywhere. i doubt it was a plane. i come from a family who owned private aircraft and who were in the field of aviation so i know a few things about planes. i didn't report this earlier in order to think about what i saw. although i have believed for many years in ufo's i haven't been looking for one ( even though i live in westmoreland co.! )"],"Object Flight Path":"Stationary","Country":"United States","trends":["There have been 5 other sightings in Grove City","There were no other sightings in Grove City on or around August 1st 2009"],"Log Number":"US-11162009-0003","Object Features":"Appendage(s)","Weather Factors":"None","City":"Grove City","Source":"MUFON","Sighting Duration":"00:00:20","map":"<A HREF = \"http://maps.google.com/maps?q=41.163298,+-80.08601(20536)&iwloc=A&hl=en\"> mufon case (20536) map </A>","files":["/var/www/straped/mufon/html2text/20536.html.txt","/var/www/straped/mufon/org/20536.html"],"Summary":"very brilliant hovering sphere which seemed to have band around middle"}