{"Log Number":"","Region":"Arizona","Disposition":"Unknown","Object Shape":"Blimp","files":["/var/www/straped/mufon/html2text/2053.html.txt","/var/www/straped/mufon/org/2053.html"],"Object Flight Path":"Other","divs":["Sighting DetailsI was seven years old and was playing in my backyard. My 3 year old brother wasalso outside, but was not with me. I heard a low buzzhumming which sounded oddto me because I have been around airplanesjets all my life and was not used tothat sound. I looked to the Northwest and saw what I thought was a blimp, but Ilooked closely and saw I was wrong. All I could do was stare at it in fear anddisbelief. I couldnt even think at the time. The object was shaped like asilver, metalic blimp with a moving ring on it. The ring had what appeared to bewindows that were emitting an orange glow. The object was flying like a duckwould walk, wobbling and unsteady.I was young at the time, so my only instictwas to grab my brother and run inside the house. I locked nyself in my parentsbedroom and felt a tiggling,numb sensation and fear still growing inside me.When I looked out the window carefully, and saw it was darker outside than aminute before, and that my dogs were acting strangely, like they had seen it aswell. When my parents noticed a change in my I told them, and they thought I wasnuts. My brother did not see it, so I had no proof. But ever since then, I havehad an interest in the Paranormal and have looked for more UFOs."],"trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around November 30th 1997"],"City":"Tucson","Weather Factors":"Windy","Source":"MUFON","Longitude":"-110.922779","Tags":"City","Date Submitted":"11/30/1997 12:00 UTC","Case Number":"2053","Date of the Event":"11/30/1997 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.228333,+-110.922779(2053)&iwloc=A&hl=en\"> mufon case (2053) map </A>","Sighting Duration":"00:00:59","Viewing Distance":"101-500 Feet","Object Features":"Window(s)","Latitude":"32.228333","Summary":"Saw Metalic Craft With Bright Orange Lights"}