{"Sighting Duration":"Undisclosed","Weather Factors":"None","trends":["There have been 21 other sightings in Greensburg","There was one other sighting in Greensburg on or around November 12th 2009","This sighting has never been favorited.",""],"City":"Greensburg","Summary":"Two seperate, Five-pointed star-shaped crafts cross Rt. 30 in broad daylight","divs":["Sighting DetailsI was on Rt. 30 WEST going into Greensburg, and around the intersection of Mountain View Inn, I noticed what appeared to be two birds seemingly \"fighting\" each other over the highway. As I drove closer, with traffic full on both sides of the highway, red lights drew my attention upwards to these \"birds\", which were spinning, rotating, and circling each other. As I passed directly under of the objects, I clearly made out a five-pointed star-shape from viewing underneath. Circular-ringed ridges were on the body, emanating from the center point of the craft outward. My very first reaction at this was that it was some sort of R.C. airplane, but then it dawned on me, these were extremely low in comparison with the tops of nearby trees. I pulled over in the middle of the road, next to the dividing barrier, and tried to film what I could. Trees are somewhat in the way in the film. 1 minute and 30 seconds of film shot, with only about 15 seconds of \"good\" footage of the crafts. The \"backs\" of these crafts had a giant red light, approx. 3 ft in heighth and 6 ft in length, with vertical rows of lights that would flash from side-to-side. As it flew away, the two crafts appeared to fly unsteady or unstable, wobbling and tilting from side-to-side as it flew off. It headed off first South, but then veered in a south-westernly direction, and I attempted to chase it by following road in that general direction, but I never caught another glimpse of them."],"Log Number":"US-11152009-0020","files":["/var/www/straped/mufon/html2text/20533.html.txt","/var/www/straped/mufon/org/20533.html"],"Object Flight Path":"Hovering then path","Country":"United States","Object Features":"Undisclosed","Viewing Distance":"21-100 Feet","Object Shape":"Star-like","Tags":"City","Date of the Event":"11/12/2009 04:40 UTC","Case Number":"20533","Latitude":"40.304138","Disposition":"IFO","Source":"MUFON","Date Submitted":"11/15/2009 11:13 UTC","Longitude":"-79.535249","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.304138,+-79.535249(20533)&iwloc=A&hl=en\"> mufon case (20533) map </A>"}