{"files":["/var/www/straped/mufon/html2text/20532.html.txt","/var/www/straped/mufon/org/20532.html"],"Region":"Iowa","Weather Factors":"None","Object Flight Path":"Straight-line path","divs":["sighting details my friend and i were \"observing\" with a 15cm(6\")newtonian telescope and large binoculars, looking at star clusters, \"m\" objects,and the like. my friend who was holding the 70mm binos pointed north with a sweep of his arm and raised the binocular to his eyes. i saw a large (but not bright) triangular shaped object passing overhead. he passed me the binos and i saw the object for about 10 more seconds, as it became fainter and disappeared into the northeast. i had the impression (through the binos)that the large object was made up of a number of smaller triangular objects. there was no sound of any kind,(such as you would expect to hear from migratory birds such as geese,or a formation of aircraft). my feeling was that the object (or objects) were only faintly illuminated by the lights of my small town.it had a dull gray quality. my friend and i were experienced amateur astronomers, with hundreds of hours of time spent at the eyepieces of our telescopes and binos. we were completely baffled by this unexpected sighting. lastly, i believe the object subtended about 1 and 1\\2 degrees,or about three times the apparent diameter of the moon."],"Object Shape":"Triangle","Summary":"large triangular object passed over my friend and me","Source":"MUFON","Date Submitted":"11/15/2009 11:02 UTC","Latitude":"42.508358","Disposition":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 8 other sightings in Dubuque","There were no other sightings in Dubuque on or around July 31st 1967"],"City":"Dubuque","map":"<A HREF = \"http://maps.google.com/maps?q=42.508358,+-90.657632(20532)&iwloc=A&hl=en\"> mufon case (20532) map </A>","Object Features":"Undisclosed","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/31/1967 10:00 UTC","Case Number":"20532","Tags":"City","Log Number":"US-11152009-0019","Longitude":"-90.657632"}