{"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/20534.html.txt","/var/www/straped/mufon/org/20534.html"],"Disposition":"Insufficient Data","trends":["There have been no other sightings in Newport","This sighting has never been favorited."],"Source":"MUFON","divs":["Sighting DetailsThis is not my first sighting in the same area. Both sightings were in the evening when it was dark, and the weather was cool. Both times I was driving home from Harrisburg, PA to Newport, PA on Interstate 322 West. On Friday evening November 13, 2009, I was driving home from Harrisburg, PA, toward Newport, PA on Route 322 West. I was between the Watts and Midway exits. Above the mountain prior to the Midway exit, I saw what I thought was the moon behind the clouds. Then, I noticed that there was more that one light. The size of the lights that I saw made me think that they might have come from people spotting for deer. I realized that it wasn't the moon nor hunters, when I saw five or six lights in a row. The lights were above the clouds, so they could not have been people spotting for deer. I liken the size of the lights to be the size of large spot-lights. They were not bright like spot-lights. The colors were pale blue, white, and pale red. There was a small dim light centered and behind the larger lights. This light was a very dim, pale blue. It appeared that the craft was travelling in the direction of the row of lights, as though that were the front of the craft. It seemed to be slow moving. I know that I am not an expert on UFO sightings, but I have seen my share of helicopters and airplanes. I grew up in close proximity to the former New Cumberlan Army Depot. My father was a rotor mechanic. I do not belive for one moment that what I saw was an airplane or a helicopter. Approximately six or seven years ago, I saw something in the sky at the same area. Instead of flying above the mountain, it was hovering above the edge of the Juniata river. I do not remember the month. It was when the weather was cool. There were no other cars around me, so I slowed down to between thirty-five and forty miles per hour, rolled down my windows, turned of my heater and radio to see if I could hear anything. I thought that it might be a helicopter looking for someone in the river. However; I realized that there was no search light. There were three, small, dim lights which made a triangular shape. The color of the lights were pale red, white and pale blue. The craft made no sound. It hovered in the same spot from the time I spotted it in the distance, and while I slowed down to observe it. I don't know what it did after I got scared and sped up as fast as I could to get away from it."],"Case Number":"20534","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/13/2009 06:25 UTC","Date Submitted":"11/16/2009 12:05 UTC","Country":"United States","Longitude":"-77.130537","Log Number":"US-11162009-0001","Object Features":"Unknown","Sighting Duration":"Undisclosed","Summary":"One side had 5 or 6 lights. About spotlight sized, but not that bright. There was one faded light to the center rear.","Object Shape":"Triangle","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.477861,+-77.130537(20534)&iwloc=A&hl=en\"> mufon case (20534) map </A>","Region":"Pennsylvania","City":"Newport","Latitude":"40.477861"}