{"Latitude":"53.480621","map":"<A HREF = \"http://maps.google.com/maps?q=53.480621,+-2.239176(20548)&iwloc=A&hl=en\"> mufon case (20548) map </A>","Object Shape":"Unknown","City":"Manchester","Region":"England","Disposition":"Unresolved","Tags":"City","Country":"United Kingdom","trends":["There have been 26 other sightings in Manchester","There were no other sightings in Manchester on or around November 1st 2009","This sighting has never been favorited.",""],"Longitude":"-2.239176","divs":["Sighting DetailsOn the 1st of November at approximately 7.40 pm We were driving back from the Matlock area in Derbyshire. It was an extremely clear night, I had strong intuition that I should keep my camera with me, I sadly ignored that intuition and stuffed it into the boot. A decision that I would later regret heartily. We had driven for about 15 minutes when I became aware of a very bright light in the sky. Planes fly overhead all the time and I guess this night was no different than any other, except to say that the plane I saw seemed odd, it moved too slowly, considering how low in the sky it was. Moreover it was extremely low in the sky, helecopter low. It was pitch black outside the car so I could not get a good look at the plane. what I can tell you though is that it's altitude stuck me as odd, as did its lights. it seemd to have one light in the middle and two constant lights on both flanks. It had a small blinking light underneath. As it flew low over Carsington water, I'd say it wouldn't have been more than 300 feet up at the very most. My real estimate would have been 100 feet. Now i'm not saying that this was an Alien spacecraft. Yet to me it was a UFO. UFO doesn't mean alien spacecraft that would be an ETV (Extra Terrestrial Vehicle). It was a UFO because it wasn't like any plane I have ever seen, it wasn't on a Flight path I have ever seen. It moved Slower than any commercial plane I have ever seen. What was it? I watched it fly over Carsington lake and then I lost sight of it for a few seconds, it was gone. Yet, I had a perfect view over the lake, as we climbed towards Kniveton near Ashbourne. Where did this low flying object go? I certainly felt unnerved. Rightly so. This part of Derbyshire, Matlock, Wirksworth, Bonsall is well known for its UFO reports, even more so lately. This year, 2009 has seen the highest incidence of UFO reports Worldwide since records began. My partner who was driving the car, doesn't really hold with UFO's. I think she'd have to see one to believe it. She tends to express the view that there is a rational explaination for this sort of sighting and that there is no pooint making a fuss. This is the view help by the majority of the population. If fact I believe it too, except that I have long had an interest in UFO's because of very unusual things I have seen for years now. On with the story. We drove on, I had now got a sneaking suspicion that we would see something else unusual. There seemed to be a lot of activity in the skies, but nothing quite as startling as what I had just seen. When we got to Uttoxeter, we were approaching the Mcdonalds roundabout when I became aware of a very large red light low in the sky. The red light seemed to be near to the Racecourse , it was at least 2 miles away though, so impossible to tell what it was, my partner also saw this. She looked a little spooked. I asked her to turn off toward the light but she declined and drove on towards Stoke on Trent. I couldn't help but feel that we had missed an opportunity to investigate. That said, having the family in the car probably wasn't the best UFO hunting opportunity. We drove on. Then things got really good. As we approached Stoke on Trent down the A50. We were at the Britannia stadium when I looked across to my right (uk drivers side) and saw a very bright white light right over stoke town. I asked my partner what the hell it was, again she looked spooked and, again turned away from it opting to drive down to Newcastle via the Handford roundabout, much to my frustration, I wanted to try to get a photograph of this light. It was so bright. As we left the Handford Roundabout the light became visible again. I pointedly asked her to look at it. It was a white light with tow smaller while lights on either side of it. As though on stalks or like spotlights. We could hear no Helecopter noise, even though my partner assured me that was what it was. As we drove along the A34 we were both looking at this light. It was definitely no more than 100 feet off the ground. Suddenly, and this is the best bit it changed colour from white to emerald green. Again, I alerted my partner to this, I said \"look at it, tell me it has changed colour and I'm not imagining it\". She confirmed that it had changed colour, the two small white sidelights seemed to have disappeared. At this point we were directly by the Tesco's at Trent Vale, and I could still see the object, I tried to get a photo. I took 2 and one caught a tiny bit of green glow...the image was very disappointing. We arrived home minutes late and I scanned around and then went out for a drive to see if I could see anything unusual, I couldn't. What we did see that night though was 3 objects that were unusual. For once I had another witness who saw at least 2 of these objects. I felt sure that this incident was so unusual I simply had to check it out. I called the Police that night to ask if the helecopter was up and flying in that region. they said they'd check and get back to me. No one got back. So I called again on Monday morning. I spoke with Staffordshire police and asked them to check. They, recorded the incident (Trent Vale) and ran checks to see if the helecopter was flying. They called back to say that they had no record of the Police helecopter flying that night. this still doesn't mean it was an ETV, but it rules out police helcopters. Other options could be military helecopters or the Air Ambulance. I called the Civil Aviation authority who told me that small aircraft do not have to register their flight plan with them. So I have thus drawn a blank. Whatever I saw looked weird to me. I'm keen to rule out check all conventional options. Yet I'd just like to say that what I saw in all three locations that night is consistent with current Ufo sightings across the country and the world. see my crude sketch of the objects. Ministry of Defense informed."],"Summary":"Low Objects across Derbyshire and Staffordshire","Object Flight Path":"Hovering then path,Path then hovering","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/16/2009 07:41 UTC","Weather Factors":"Windy","Case Number":"20548","Date of the Event":"11/01/2009 08:35 UTC","files":["/var/www/straped/mufon/html2text/20548.html.txt","/var/www/straped/mufon/more/20548_submitter_file1__DSC00538.JPG","/var/www/straped/mufon/more/20548_submitter_file2__Screenshot2009-11-06at10.22.47.png","/var/www/straped/mufon/org/20548.html"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"GB-11162009-0015","Source":"MUFON"}