{"Object Flight Path":"Stationary,Other","Object Features":"Patterned Surface","Longitude":"-121.892166","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsAt approximately 11:45 p.m., Sunday, November 15, my boyfriend and I were standing on our balcony near the eastern foothills of San Jose. I suddenly noticed an unusually bright object low on the horizon in the northeast. We both stared, captivated by its brightness and the way it appeared to change colors in various patterns of blue, red, green and yellow. It also emitted different colors of bright rays in a sequence of patterns (the rays would appear from the top, bottom, diagonally and from the sides). We both remarked how this was unlike anything we'd ever seemed before; not a star, helicopter, airplane, satellite, or missile. It was a very calming, but intense experience. We also discussed how it seemed intelligent. The patterns of light, colors and intensity seemed deliberate. It also hovered silently and slowly back and forth and up and down. After about 10 minutes, the intensity diminished and the color patterns seemed to fade. My boyfriend and I went back in the apartment, almost speechless and in awe over the experience. My boyfriend returned to the balcony 10 minutes later and said the object had faded, almost appearing like a small, barely detectable star high in the sky--instead low in the horizon. He also said that a plane appeared to be flying near where we first noticed the object. We both felt slightly disoriented and excited after the experience. We both described feeling as though the object was attempting to communicate through the light patters. My boyfriend seemed very at peace, while I felt a sense of anxiety all the rest of the evening."],"Disposition":"IFO","City":"San Jose","Date of the Event":"11/15/2009 11:45 UTC","Date Submitted":"11/16/2009 01:06 UTC","Case Number":"20542","Tags":"City","Source":"MUFON","Latitude":"37.346396","Log Number":"US-11162009-0009","Summary":"Extraordinarily bright object in northeastern sky flashed sequences of red, blue, green and yellow lights, both as rays extending from object and pulsations across object.","Region":"California","files":["/var/www/straped/mufon/html2text/20542.html.txt","/var/www/straped/mufon/org/20542.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.346396,+-121.892166(20542)&iwloc=A&hl=en\"> mufon case (20542) map </A>","Object Shape":"Diamond, Flash, Sphere, Star-like","Country":"United States","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around November 15th 2009"],"Weather Factors":"Unknown"}