{"Longitude":"-80.053375","Log Number":"","Case Number":"2054","Object Shape":"Oval","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around November 10th 2002"],"Date Submitted":"11/10/2002 10:55 UTC","Date of the Event":"11/10/2002 10:55 UTC","divs":["sighting details i was wondering if anyone else has had a sighting yesterday tuesday 11\\10\\02. i think i may have. it was about 10:45 or maybe even closer to 11pm. i was driving my car onto i-95 from okeechobee (in west palm beach). you have to drive up the ramp and then back down to get on 95. as i was approaching the top of the ramp, i saw lights out at the corner of my eyes to the left. i didnt pay attention to it (probably just thought an airplane or something). anyway, the lights were angled in the sky and as the turned again i looked up to the left and whoa!! it was a line of lights in a row (connected like this: ***********) a straight line of lights. thats all i could get a glimpse of. the lights then shut off suddenly. i slowed my car to a stop on the top of the ramp. looked out of my car and saw a dark object. no lights at all. i couldnt tell the shape because it all happend kind of fast. all i know is that the object was darker than the sky and it was moving. it was really moving fast, but when i got out to look more...........the thing was gone. i saw it moving southeast but only for a matter of seconds. i couldnt see it anymore...........like it vanished. i know this must sound pretty weird, but thats what i saw. the hole sighting was only about a minute or two if that. wish i payed more attention initially because i probably would have seen more. i was near the airport and i could see other planes in the sky, but this thing was definitely something else. strange. i even felt a little strange about it after. if i think about it now.........it almost seems as if i dont believe myself..........like i was daydreaming...............weird. please let me know if anyone else or if there was anything in the news that day about anything like i described. thanks. i have enclosed a drawing of what it sort of looked like using adobe photoshop. very similar to what i saw. but when the lights went out............im not really sure what it looked like............just like a dark black object."],"Source":"MUFON","Country":"United States","Region":"Florida","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.715342,+-80.053375(2054)&iwloc=A&hl=en\"> mufon case (2054) map </A>","City":"West Palm Beach","Sighting Duration":"00:00:59","Object Features":"Other","Object Flight Path":"Straight-line path","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/2054.html.txt","/var/www/straped/mufon/org/2054.html"],"Latitude":"26.715342","Summary":"I saw lights out of the corner of my eye, cigar sh","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}