{"Object Features":"Unknown","Weather Factors":"Unknown","Region":"Nevada","Sighting Duration":"00:05:00","Object Flight Path":"Stationary,Path with directional change","files":["/var/www/straped/mufon/html2text/20541.html.txt","/var/www/straped/mufon/org/20541.html"],"Country":"United States","Latitude":"39.253179","Tags":"City","Case Number":"20541","divs":["Sighting DetailsPlace of occurance: Duckwater Valley (Railroad Valley area) Date: July middle of the month, 1994. Time: approxmiately 9:00pm I lived on a ranch in Duckwater Valley; within the valley we have a housing area 3 miles away. That evening I went to visit a friend at one of the homes at the housing. Arriving there and I got out of the car, I happened to look up into the sky, the night was halfnoon or more because I can see our small hills close by and the distant mountains (White Pine Mountains). Then I saw a dark circlar object above me at a height of approximately less than 1,000 feet. Reason for the estimation, our sourrounding hill are from 500 t0 800 feet high and it was not much higher than those hills I estimated it to be 50 yards or so in diameter, no noise or light coming from it. Seems like it stood still for several minutes before it floated to the northeast direction to the main road that go to Eureka, Nevada (quater of a mile distant), from there it proceeded north going at a rate of about fifty miles an hour for three miles, turning west for half a mile nad south again for a mile, Seen like it was following the ranching and farming places. I went into my friends house and told them about it they didn't seen interested so we just talked, being late in the evening I went outside to go home and it was gone. Several months ago I heard that a couple saw a silver disk object one afternoon not to far in the distants from them; people have seen these object over the years where we live."],"Date Submitted":"11/16/2009 11:54 UTC","Log Number":"US-11162009-0008","City":"Ely","Source":"MUFON","Date of the Event":"07/20/1994 09:00 UTC","Summary":"Happened in Duckwater-Railroad Valley.","trends":["There have been 9 other sightings in Ely","There were no other sightings in Ely on or around July 20th 1994"],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.253179,+-114.88033(20541)&iwloc=A&hl=en\"> mufon case (20541) map </A>","Longitude":"-114.88033","Disposition":"Unknown","Object Shape":"Circle"}