{"files":["/var/www/straped/mufon/html2text/20559.html.txt","/var/www/straped/mufon/org/20559.html"],"Latitude":"22.894733","Object Flight Path":"Undisclosed","Date Submitted":"11/17/2009 01:14 UTC","Object Features":"Undisclosed","Tags":"City","Case Number":"20559","Country":"Mexico","Sighting Duration":"Undisclosed","Summary":"ufos in cabo san lucas skies","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"MX-11172009-0006","Region":"Baja California Sur","map":"<A HREF = \"http://maps.google.com/maps?q=22.894733,+-109.907407(20559)&iwloc=A&hl=en\"> mufon case (20559) map </A>","City":"Cabo San Lucas","Source":"MUFON","trends":["There have been 10 other sightings in Cabo San Lucas","There were no other sightings in Cabo San Lucas on or around November 16th 2009","This sighting has never been favorited.",""],"Date of the Event":"11/16/2009 11:30 UTC","divs":["Sighting Detailsfor the past 2 weeks i have been seeing alot of activity in the skies cabo san lucas mexico,the first time i saw something was 11 9 09 and it was completly by accident, it was a full moon here in cabo so i went out the front of my house to take a few shots of the night sky and the moon. i then took a photo and could not believe my eyes, in the photo there looked like a disc shaped object this i could not see with the naked eye, so i did it again and again and again, and the same things in the sky(every shot different but same objects) anyway i download the images to my computer and zoom in and to my amazement there were even more lights but more of a orb variety and alot of other ufo looking things, i can't tell you what they are but i have been filming them and i have alot of photo's to back up these claims, the ufo's were most active on the 11 15 09 2 days ago when they seem to act like stars and blend into the background on this night they made no effort to \"hide\" it would have been 2-3am in the morning when i witnessed this. they were alot lower than on other nights and moving across the sky at an amazing speed in groups of 2 some times more but the sky is different every night it is quite awesome but quite worrying all the same. with the disc shaped objects i zoomed in on my computer and it didn't acually look like a craft as such but some sort of window were faces were starring out at us and seeing what was going on i have seen faces in the clouds which unfortunatly have got pics of and another stabge thing with these dics was symbolism within the disc such as the stone mansions,i don't now what it is called but were the serpant is biting at its own tail. i hope someone can shead some light on what i am seeing."],"Disposition":"Unresolved","Object Shape":"Disc, Sphere, Star-like, Other","Longitude":"-109.907407"}