{"divs":["Sighting DetailsThe firey mass was highlighted by the dark colored dumbell shaped object that was tipping fastly as it seemed more like tumbling, as it fell extremely fast as it seemed to pull the fires upwards, as it fell down,and shortly after- out of sight. I was sitting at the Taco Bell parking lot, as I just ordered two chalupas, and I was parked facing Burger King,[facing westerly direction],when I noticed the firey object, that had a darker- interior shape like a dumbell, similarly to the ones I workout with, that was clearly visible from where I sat. The object fell fast as if it had been tossed abruptly- such as tipping over your dumbells' really fast with force- to repeat this action as to what I just witnessed. Since it faced aiming straight down while tumbling, and on fire red in color- and it had a dark mass-which smoked as it vanished out of sight. As my car digital time said at 5:43PM, and I had noted that was quite odd,I wondered if the police were coming, or if others like the fire department or something else might come. But none were evident. I drove over to the nearest area [which for me was Warm Springs Blvd], to see if any police,fire or other emergency vehicles arrived. None came, none were noted. Since it faced downwardly, as it fell tipping with its firey exterior,it seemed to smoke as it went out of sight. I would estimate that it fell between highway 880,and the nearby R&D buildings opposite of 880 facing the westerly skies of California. Gee, am I the only one whom saw this, and wondered if there is any data from -6 miles away-Moffet Field that might have seen something falling from the sky- was it a piece of meteor- or something else? Well, maybe it fell without hurting anything. That's good. If it fell on a rooftop or on a person's car, well he'd have to make a insurance claim on the object that fell from the sky. After witnessing this event, I figure'd that this may be the newest insurance claims that will have to be dealt with in the future- that if the meteors are being blown up or they disintegrate as they enter Earth's atmosphere, it's not so far fetched idea now. I decided I'm going to go and have a beer. Maybe I'll have two. I went to a Country Club, drank two Heinekens, watched a few programs and went home.[ I don't normally do this. So, I'm thinking why did this happen?I am going to tell my husband, and post it too.] I told my husband about this event, he said -do you think it will be on the news? I said I don't know, let's watch the news and find out. He asked me to give details about what I saw, so I did, and then I decided to post it here. Maybe someone else saw it too."],"Date of the Event":"11/11/2009 05:43 UTC","Disposition":"Hoax","Log Number":"US-11162009-0017","files":["/var/www/straped/mufon/html2text/20550.html.txt","/var/www/straped/mufon/org/20550.html"],"Summary":"Firey dumbell shape tipping end over end falling out of the sky in extremely fast fall in a few seconds observation","Object Shape":"Other","Object Flight Path":"Other","Latitude":"37.55605","City":"Fremont","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.55605,+-121.984322(20550)&iwloc=A&hl=en\"> mufon case (20550) map </A>","Object Features":"Undisclosed","Tags":"City","Weather Factors":"None","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around November 11th 2009"],"Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"11/16/2009 08:50 UTC","Case Number":"20550","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-121.984322","Region":"California"}