{"Summary":"1-2 Blinking lights revolving in circles","Latitude":"35.090821","Country":"United States","Disposition":"IFO","Tags":"City","Date of the Event":"11/16/2009 12:00 UTC","Log Number":"US-11172009-0011","map":"<A HREF = \"http://maps.google.com/maps?q=35.090821,+-106.643267(20563)&iwloc=A&hl=en\"> mufon case (20563) map </A>","Object Flight Path":"Path with directional change","Object Shape":"Unknown","Object Features":"Unknown","Region":"New Mexico","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"11/17/2009 05:40 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI was riding my bike home and a neighbor of mine stopped me, yelling \"Look!.There's something in the sky!\" I decided to stop. I gazed eastward toward the Sandia mountains and saw 2 white-colored slow-blinking lights going around in an eliptical shape. What was interesting to me was the fact that at first I saw 2 of them and then only one. Also the blinking frequency was steady except for random moments of pause. The lights would just stop blinking for some short span of time and then start up again. The man left down the street and I started to go home again still watching them as I rode my bike. About the the time I got home the 1 blinking light was no longer visible. About a couple of hours later as I was leaving home I saw the 1 blinking light moving in a circular motion again. I was with another individual who ALSO saw this light. And again it would blink at a constant frequency for a while and then cease blinking for a some short period to only start up again. I could see this same light for another 10 minutes as I made my way to school. That is the extent of my observation."],"files":["/var/www/straped/mufon/html2text/20563.html.txt","/var/www/straped/mufon/org/20563.html"],"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around November 16th 2009"],"Longitude":"-106.643267","Case Number":"20563","City":"Albuquerque"}