{"trends":["There has been one other sighting in Zebulon","There were no other sightings in Zebulon on or around December 22nd 2002"],"Object Shape":"Other","Date Submitted":"12/22/2002 07:25 UTC","Longitude":"-78.31472","Date of the Event":"12/22/2002 07:25 UTC","Summary":"round white light","Object Features":"Undisclosed","Case Number":"2056","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Log Number":"","City":"Zebulon","map":"<A HREF = \"http://maps.google.com/maps?q=35.824321,+-78.31472(2056)&iwloc=A&hl=en\"> mufon case (2056) map </A>","files":["/var/www/straped/mufon/html2text/2056.html.txt","/var/www/straped/mufon/org/2056.html"],"Sighting Duration":"00:00:59","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting Detailsturned the corner from the front of the house to go to the back of the house totake out the garbage. Was facing SE. Dont know what it was that made me lookup, I think I may have noticed the light. It was a perfect white circle, like abaseball and was illuminated. It moved as fast or faster than a meteor seen ina meteor shower. Ive never seen anything move that fast. I waited for a noisebecause I thought I would hear one if it had been an airplane, but there was nonoise. Im not good a judging height, but it was lower than a small airplanewould fly and seemed to be about the same height above the trees as they aretall I would guess the trees are appx. 30-40 feet tall. It really startled me. Ive never seen anything else like that. I was thinking it may be a meteorshower and looked up at the sky. The sky was perfectly clear and I could seelots of stars. I stood outside a few minutes to see if there were meteors, butdid not observe anything else. Please note that we do seem to be in some sortof flight pattern from the Seymour Johnson Air Force Base, but this was too lowand went way faster than anything Ive seen come to and from there. It went inan arc from above my head to appx. 40 degrees above the horizon and justdisappeared."],"Country":"United States","Latitude":"35.824321","Region":"North Carolina","Disposition":"IFO"}