{"Summary":"Extremely luminous slow moving object changing speed and direction quickly","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Shape":"Triangle","Date Submitted":"11/17/2009 11:03 UTC","Case Number":"20569","Source":"MUFON","Latitude":"40.577369","files":["/var/www/straped/mufon/html2text/20569.html.txt","/var/www/straped/mufon/more/20569_submitter_file1__Untitled.png","/var/www/straped/mufon/org/20569.html"],"trends":["There have been 6 other sightings in New Kensington","There were no other sightings in New Kensington on or around November 17th 2009","This sighting has never been favorited.",""],"Tags":"City","Longitude":"-79.76347","Object Flight Path":"Hovering then path","Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=40.577369,+-79.76347(20569)&iwloc=A&hl=en\"> mufon case (20569) map </A>","Disposition":"Insufficient Data","Region":"Pennsylvania","Object Features":"Undisclosed","City":"New Kensington","Country":"United States","Date of the Event":"11/17/2009 06:01 UTC","divs":["Sighting DetailsThe event occurred on Tuesday November 17, 2009 at exactly 6:01 PM in the New Kensington Pa area. I was in New Kensington at the bottom of Coxcomb hill. I was driving to pick up dinner when I noticed an extremely bright light in the distance hovering or moving extremely slow. I proceeded to try and move closer to the object and determine its location and what it was since I had never seen such a bright object in the sky. I was picking up dinner at the top of the hill, Coxcomb hill in New Kensington, so I decided to go to the top to gain a better vantage point. At first I had wondered if maybe the light was on a building or another structure since it was difficult to see the backdrop against the dark sky but I eventually noticed it was at least 1000 feet off the ground, if not several thousand. The object was in my sight the entire time. I proceeded to the top of the hill where I saw a disc shaped object glowing with a white light with a blueish tinge on the bottom in the center. Once towards the top of the hill the light from the object was bright enough and I close enough to see that it was triangular in shape and the light I was seeing was directly in the center of the object and was round in shape. It then started to move off, once it did 3 other lights appeared on the 3 corners of the object, not as bright as the light in the middle. It moved off heading in the direction of the Plum borough area and disappeared over the next hill top. SHortly after I noticed what appeared to be a helicopter moving in the same direction as the object had, I could not make any identification on the type of chopper it was but since choppers are not very common in the area and one was moving off in the same direction as the object very fast. The whole encounter only lasted a few minutes but it was the most unusual event of my life and I have never seen such an object before. The object did not resemble any traditional aircraft I had ever seen, it did not emit any sound, and it moved very slowly at first, or not at all it was difficult to tell since I was moving. However once at the top of the hill it was stationary and then moved off very quickly which to my knowledge is not possible with current aviation technology. The shape was also unusual as it was an exact triangle with lights on the tips and one amazingly bright light in the center, quite possible the brightest light I have ever seen in the sky. The center light was so bright it appeared to shine a beam to the ground faintly. The other thing that was unusual is the object had no traditional marker lights, and the 3 lights on the tips that appeared once the craft started moving off."],"Log Number":"US-11172009-0017","Sighting Duration":"00:04:00"}