{"Case Number":"20566","map":"<A HREF = \"http://maps.google.com/maps?q=36.917657,+-116.752806(20566)&iwloc=A&hl=en\"> mufon case (20566) map </A>","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Beatty","There were no other sightings in Beatty on or around June 30th 1953"],"Disposition":"Insufficient Data","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"06/30/1953 08:00 UTC","Longitude":"-116.752806","Latitude":"36.917657","Country":"United States","files":["/var/www/straped/mufon/html2text/20566.html.txt","/var/www/straped/mufon/org/20566.html"],"divs":["Sighting DetailsMy younger Sister and I were staying with our Father on the Trueba Ranch north of Beatty Nevada. When my Father left to go to work in Beatty, I took my twenty two single shot rifle and headed up the ridge to the northwest of the home he was renting. I walked up the ridge, and when I crested there was in the small canyon a white bright saucer shaped object hovering. I immediately layed down and observeved this large bright white object for what could have been up to five minutes. As I watched, the craft lifted off to my right, and in a matter of seconds was gone from my sight. I was scared and immediately ran back to the house to tell my sister what I had seen, she of course did not believe me, and no amount of my pleading my case helped. When my Father returned home, I got the same sceptical reaction from him, he eventually shrugged it off with the sun being in my eyes. So with the sceptism I received from my family, I did not want to be thought of as a nut, so I kept my story mostly to myself. I have asked my Sister if she remembers the incident, and she does. I later met a man who was very respected in his field of work, and I told him of my experience, he told me my story was similar to one his Mother told of a sighting she had in Montana. She also did not want to be branded as a nutcase, so she kept her story mostly to herself."],"Object Shape":"Oval","Summary":"As a twelve year old I was hunting rabbitts and came over a hill a there was the ufo.","Date Submitted":"11/17/2009 09:43 UTC","Object Features":"Dome","Region":"Nevada","Object Flight Path":"Hovering then path","Log Number":"US-11172009-0014","Tags":"City","City":"Beatty"}