{"Object Features":"None, Unknown","trends":["There have been 2 other sightings in Independence","There were no other sightings in Independence on or around November 17th 2009","This sighting has never been favorited.",""],"Date Submitted":"11/18/2009 03:59 UTC","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Region":"Oregon","Viewing Distance":"Unknown","Latitude":"44.85446","Log Number":"US-11182009-0004","Disposition":"Insufficient Data","Object Shape":"Other, Unknown","Summary":"I was Just curious to see what I would get","Tags":"City","Object Flight Path":"Path with directional change","divs":["Sighting DetailsAll this started when a good friend of mine who lives in Beaverton Oregon filmed a slow moving ball like object in the sky one day. His video has been sent in and is being investigated. So I was watching other videos on youtube when I noticed something very odd. Today was a somewhat nice day here in oregon so I decided to get my camera and just start filming the sky. After I downloaded the video to my computer and played it back I did not see anything, but when I slowed it down I saw the same teardrop like objects that are seen in other videos traveling from the sky to the earth, and from the earth to the sky. The video I have attached was taken on my back porch facing south east it was around 2:30 pm.When I started filming I saw nothing in the sky at first then towards the end of the video a bird did fly by. After I slowed down the video I first thought what I was seeing was just glitches of some sort, but when I paused and played the video I could see the teardrop like objects. I am really amazed of what I cought on video. I am still excited about it. next spring and summer I plan on doing more filming of the skies."],"files":["/var/www/straped/mufon/html2text/20576.html.txt","/var/www/straped/mufon/org/20576.html"],"Case Number":"20576","map":"<A HREF = \"http://maps.google.com/maps?q=44.85446,+-123.178566(20576)&iwloc=A&hl=en\"> mufon case (20576) map </A>","Longitude":"-123.178566","Date of the Event":"11/17/2009 02:30 UTC","City":"Independence","Weather Factors":"Windy, Medium"}