{"Object Shape":"Diamond, Flash, Oval","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.47778,+-111.35915(20570)&iwloc=A&hl=en\"> mufon case (20570) map </A>","Longitude":"-111.35915","Sighting Duration":"00:10:00","trends":["There have been 5 other sightings in Great Falls","There were no other sightings in Great Falls on or around November 16th 2009"],"Latitude":"47.47778","City":"Great Falls","Summary":"a bright fluorescent orange light caught my eye south east of the rocky boy indian reservation","Tags":"City","Object Features":"Undisclosed","Log Number":"US-11172009-0018","divs":["Sighting DetailsMe and my mother were driving up on three mile road, going to visist my brother. I was looking out the window toward the south east, and noticed a bright floresent light in the sky. there was flash, then the light ended up 3 to 4 miles from where its origanal position. Then there was 3 more flashes, then 2 orange lights appeered, along with one bright light desening from the clouds. Then they started to do manuvers that any aircraft that I seen can do. This went on for about 7 minutes. One of the light seemed to desend to a hill. And then there was one big flash, next thing they were gone. Also on the next night November 17th, 2009. At 7:45pm. mst. my next door neighbor also reported the same lights above the same area from the previos night. Same lights same manovers. I'm from the Rocky Boy's Indian Reservation. And I never seen that sort of manuvers from any air craft around this area. In GreatFalls Mt. we have the Melstrom Air force Base. And i never seen or heard of there air craft doing them kind of manovers."],"Case Number":"20570","Weather Factors":"Unknown","Date Submitted":"11/17/2009 11:18 UTC","Region":"Montana","Date of the Event":"11/16/2009 07:30 UTC","files":["/var/www/straped/mufon/html2text/20570.html.txt","/var/www/straped/mufon/org/20570.html"],"Disposition":"Unknown"}