{"Country":"United States","Date Submitted":"11/18/2009 08:27 UTC","Object Features":"None","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"11/17/2009 06:05 UTC","trends":["There have been 4 other sightings in Littleton","There were no other sightings in Littleton on or around November 17th 2009"],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20578.html.txt","/var/www/straped/mufon/org/20578.html"],"City":"Littleton","Summary":"Two Orange Lights slowly blinking on and off and a \"fake plane\"","Source":"MUFON","Region":"New Hampshire","Longitude":"-71.767798","Latitude":"44.311062","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-11182009-0006","divs":["Sighting DetailsI was walking home from work last night when I noticed two very bright orange lights(much to large and bright to be a star) behind the building that I live in. These lights were side-by-side at maybe a 15 degree angle to each other. The light on the right started to dim and turn black then a couple of seconds later would appear to the left of the other light..then the one that was now on the right did exactly the same thing. It continued this pattern for maybe 30 seconds. I thought they were flares at first but they were not descending and the blinking on and off was too methodical. It was not twinkling. Anyway I ran upstairs to tell my boyfriend to look out the back porch but then it was gone.. I kept looking for a minute and I saw some plane lights. But this was much to close to the mountain to be a commercial plane and there was no sound. It was moving pretty slowly for a plane and the lights were not consistent like a plane. It was very twinkly red and white lights but dim like it was very far away. It moved to the west for a ways then the lights went to a solid dim white light..continuing on the same path then disappeared. I told my boyfriend about it while we were still on the porch..Just as I was explaining the plane thing we saw a very bright white light! (as big and bright as sirius looks sometimes) It flew right over our house crossing Main St. very quickly and the light just dimmed out before it went out of sight. All of this happened within five minutes or so of when I first noticed it. I just found out that my friend that was coming back to town from Lancaster had seen the same thing around 6:00 as well! She described seeing the orange lights blinking in the same fashion as well. If these were just flares or something I would love to know how a simple flare can change it's position after it dims out.."],"Object Shape":"Other, Unknown","Case Number":"20578","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.311062,+-71.767798(20578)&iwloc=A&hl=en\"> mufon case (20578) map </A>","Viewing Distance":"501 Feet - 1 Mile, Unknown"}