{"map":"<A HREF = \"http://maps.google.com/maps?q=34.557772,+-115.744441(20575)&iwloc=A&hl=en\"> mufon case (20575) map </A>","files":["/var/www/straped/mufon/html2text/20575.html.txt","/var/www/straped/mufon/org/20575.html"],"Source":"MUFON","Summary":"Object not seen. Lights scanning trailors in Amboy the night there were visitors viewing Leonids.","divs":["Sighting Detailsapproximately 1 am on the 14th after most of the viewers were sleeping, a device scanned the trailors at the Amboy compound. The sheriff awoke to the bright lights. One employee of Roy's Cafe saw the lights as he was awake and tried to awaken the person in the next trailor by yelling at him. The other employee did not wake up. So there are two witnesses, but about 20 people in 5th wheels were also scanned but did not awaken. One trailor was scanned for a lengthy time and rescanned a second time. The other reporting centers are not updating any longer it seems. So you guys get tagged. 1. this is reported to me by my son who is the sleeping emplyee in the report. I was here at home. 2. It was the lights that got the attention of the awake employee and the sheriff who never experiences such light out there. 3. No one really saw the object and were too fearful to even look. (can't blame them there!) 4. Beam of light scanned all trailors. 5. ? 6. Lights turned off. It was assumed that the vehicle (or light source) simply went upward. I don't want to discuss this with anyone but members from YOUR office."],"Object Shape":"Unknown","City":"Amboy","trends":["There has been one other sighting in Amboy","There were no other sightings in Amboy on or around November 14th 2009"],"Case Number":"20575","Region":"California","Tags":"City","Date of the Event":"11/14/2009 01:00 UTC","Log Number":"US-11182009-0003","Country":"United States","Latitude":"34.557772","Disposition":"Insufficient Data","Weather Factors":"Does Not Apply","Object Flight Path":"Other","Date Submitted":"11/18/2009 03:14 UTC","Sighting Duration":"00:10:00","Longitude":"-115.744441","Object Features":"Unknown","Viewing Distance":"20 Feet or Less"}