{"Latitude":"27.672897","Date of the Event":"11/30/2002 12:00 UTC","Disposition":"Unknown","Country":"United States","Case Number":"20577","Object Flight Path":"Undisclosed","Date Submitted":"11/18/2009 08:24 UTC","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","Region":"Florida","Longitude":"-81.514234","Object Shape":"Sphere","divs":["Sighting DetailsHello I run a website called www.mabusincarnate.com for over 7 years I have been discussing UFOs and the paranormal. I have never really talked to MUFON. But someone told me I should turn in my report to you guys. So here I am. I have seen UFOs for over 15 years. I believe for some odd reason I attract them and many witnesses agree. So I made my site above to find out information and gather data. I have interviewed William Birnes from UFO Hunters and many other folks there in our chat room. Plus we have a paranormal magazine called Continuum. I would love more info about MUFON. I would also be interested in interviewing one of your guys sometime for the website. Just wanted to say hi and turn this in Thank you. Jeffery Pritchett: Founder of Mabus Incarnate NEW UFO Sighting 621pm. Florida, Panhandle. With 2 Witnesses. Tonight I had a UFO sighting. Four Objects red and blinking oddly. They flew very close to each other. All 4 objects and then two flew away. Four sphere like objects moving insanely close to each other. Strangest sighting I have had since my first sightings many years ago. I need a video camera and do not know anything about them. What kind of video camera would pick up UFOs in the sky? I friggin need one and the right one like really soon. Contact me please if you know about video equipment or speak here. It must be able to pick up aerial phenomena. I have no doubt of what I saw with witnesses. Just need to get it on film. I don't have much cash so just gathering data. I haven't had a sighting this odd in many moons..But have definitely seen similar things in my past."],"Log Number":"US-11182009-0005","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/20577.html.txt","/var/www/straped/mufon/org/20577.html"],"Summary":"UFO sighting 621pm. Florida panhandle. With 2 witnesses.","map":"<A HREF = \"http://maps.google.com/maps?q=27.672897,+-81.514234(20577)&iwloc=A&hl=en\"> mufon case (20577) map </A>","trends":[],"Object Features":"Undisclosed"}