{"map":"<A HREF = \"http://maps.google.com/maps?q=39.166808,+-119.759093(20574)&iwloc=A&hl=en\"> mufon case (20574) map </A>","Weather Factors":"Unknown","Date of the Event":"09/30/1978 12:00 UTC","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20574.html.txt","/var/www/straped/mufon/org/20574.html"],"Latitude":"39.166808","Log Number":"US-11182009-0002","Source":"MUFON","Date Submitted":"11/18/2009 02:30 UTC","Summary":"big 300 yard saucer as a kid","Object Flight Path":"Undisclosed","City":"Carson City","Longitude":"-119.759093","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","divs":["Sighting Detailswhen I was 13 my brother and I were walking up the road to go feed a neighbors cat up the hill from us, he was in the hospital, when I noticed a very bright what apeared to be a star a great distance east from us, but it was brighter then any other star in the sky so it caught my eye. as I stared at it for a minute I noticed it was moving ever so slightly, so I said to my brother hay do you see that bright star its moving we stoped and stared at it for a minute and he said bullshit so we kept walking but for some reason I kept looking back to it and noticed it WAS moving so I said to him NO stop for a minute it is moving so we both stoped and started looking at it, I said to him it is moving isn't it, then it went from 12 oclock to about 9 oclock in under 2 seconds stoped went straight up for a long way stoped returned to its starting point and started heading to us from the distance this thing was from us I would say it went 150 miles in under 2 seconds 3 times and now it was heading our way I asked him what is that a helicopter he said I dont think a helicopter can go that fast so there we were standing and staring at this light trying to figure out what it was ruling out anything we knew of that could move like this thing just did. this is where the story goes off the deep end as it got closer we noticed not only the color but the size of this craft it was huge like 3 football fields big as it got streaght overhead it stoped and there we were staring up at the bigest thing I have ever seen in the sky it made no sound at all it stoped for about 20 seconds then continued over the mountain north west of us over virginia city we told our folks and big supprise they didnt beleive us I have only told a handfull of close friends over the years 30yrs to be exact and my brother and I talk about it from time to time I did talk to a guy about it ounce that told me he saw it to but he was drunk leaning against a poll in vc and didnt beleive what he had just seen funny it was about the same time I think he saw it go over him after we did or he could have just been jerking my chane. Eather way I know I saw what I saw nothing will change that. and what we saw I couldnt tell you but what I do know is I havent seen anything like it sense. well somthing kind of like it but I didnt see the craft just a light dooing somthing sim and not for as long. last year."],"trends":["There have been 9 other sightings in Carson City","There were no other sightings in Carson City on or around September 30th 1978"],"Object Shape":"Circle","Region":"Nevada","Case Number":"20574","Object Features":"Undisclosed","Tags":"City"}