{"Latitude":"46.49948","divs":["sighting detailsat 6:15 p.m. i went to look out of my apartment window, i noticed a slow moving set of lights heading in a westerly direction, as my large picture window faces north west. the cloud cover was heavy and low, with a ceiling of about 500 ft. what i saw was a disc shaped craft that i gauged to be about 100 ft. across. it had pulsing blue, red,yellow and white lights spaced around its' perimeter. it was definetely not an airplane as i live only 4 kilometers from the airport, wich is to the east of me. i have seen 100s of planes of numerous types flying at all times during the day and night and their running lights and landing lights are nothing like what i saw on this disc. airplane lights flash, not throb. the disc was flying about 150 ft. below cloud cover, so it was comparatively low compared to the airplanes that fly in the area. it also was too large for any plane that could use our small airport. it was travelling westward, in the opposite direction of the airport and was over the feild across the road from where i live. it was about 1 to 1 1\\2 kilometers away from me, which is why i was fairly sure of its' size. it continued on at the same slow speed and direction for about 2 minutes, it then rose up into the low cloud cover. it appeared to stop, hidden by the clouds, but the throbbing lights could be seen somewhat muted by the cloud cover. it stayed for about 3 minutes, then just dissappeared. the light did not move away, but just disappeared. i watched the area for another few minutes, but saw nothing else."],"Viewing Distance":"Over One Mile","Log Number":"CA-11182009-0012","map":"<A HREF = \"http://maps.google.com/maps?q=46.49948,+-81.00356(20584)&iwloc=A&hl=en\"> mufon case (20584) map </A>","Date Submitted":"11/18/2009 02:32 UTC","Case Number":"20584","Longitude":"-81.00356","Sighting Duration":"Undisclosed","Date of the Event":"11/16/2009 06:15 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/20584.html.txt","/var/www/straped/mufon/org/20584.html"],"Region":"Ontario","City":"Greater Sudbury","Summary":"round disk with lights","Source":"MUFON","Object Flight Path":"Path then hovering","Object Shape":"Disc","Tags":"City","Country":"Canada","Object Features":"Unknown","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Greater Sudbury","There were no other sightings in Greater Sudbury on or around November 16th 2009"]}