{"Tags":"City","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around October 31st 2009"],"Object Flight Path":"Undisclosed","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.503545,+-81.691599(20580)&iwloc=A&hl=en\"> mufon case (20580) map </A>","Date Submitted":"11/18/2009 09:20 UTC","divs":["Sighting DetailsAt 1 am November 1, 2009 a lady called to tell me she saw a red orange object around Bellaire Rd. Last week another lady from Berea called to tell me the same thing. The object was seen on Halloween around 9pm. The second lady said it was a drone and was according to her son near a Hopkins runway . The teenager saw a rotor and a tail. The woman concluded it was no a RC. I am not sure about that one at all. I asked her the size she said the light looked like a cm. There was no noise. Her son is into drones and was taking an enrichment type class at OSU which included drones. So, basically, these people are plugged into the subject. The second lady also told me she saw the Bellaire woman's posting on a UFO site and contacted her. These locations are not too far apart from each other, Bellaire and Berea. Whatever these two women saw, and with the rotor and tail information and size, it could be an RC, neither woman would divulge who they were or their phone numbers or where they lived other than a general location. So whatever, I feel reporting it as an obligation, but am not delving into this with no further ability to contact these people. One woman said her husband was middle eastern and was a realtor. The other said her husband works for NASA and would not be happy that she was talking with me. This is completed as far as I'm concerned."],"Weather Factors":"Unknown","Summary":"Two phone calls regarding red orange object in Berea and then in Bellaire Rd. area","files":["/var/www/straped/mufon/html2text/20580.html.txt","/var/www/straped/mufon/org/20580.html"],"Date of the Event":"10/31/2009 12:00 UTC","City":"Cleveland","Longitude":"-81.691599","Latitude":"41.503545","Object Features":"Undisclosed","Log Number":"US-11182009-0008","Disposition":"IFO","Sighting Duration":"Undisclosed","Region":"Ohio","Case Number":"20580","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States"}