{"Weather Factors":"None","Object Features":"Unknown","Date Submitted":"11/18/2009 02:29 UTC","Date of the Event":"11/15/2009 09:30 UTC","Source":"MUFON","Region":"Ohio","files":["/var/www/straped/mufon/html2text/20583.html.txt","/var/www/straped/mufon/more/20583_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/20583_submitter_file2__ufo2.jpg","/var/www/straped/mufon/org/20583.html"],"Longitude":"-81.377247","Sighting Duration":"Undisclosed","divs":["sighting detailson 11\\15\\09 at approx 9:30pm i was in my bedroom watching tv and noticed a loud noise and saw some bright lights in my back yard. i initially thought it was a low flying airplane. i thought to myself, \"it can't be an aitplane because they can't fly that low nor do they have that many lights on the bottom nor can they navigate turns so quickly. i went to my bedroom window and looked outside. i saw a long more like a flat oval craft flying low turning on it's side over my trees in my back yard. it had approx 12 lights in double rows around the bottom. there was a small red blinking light in the middle of the bottom. the object flew pretty quickly over my house. i ran to my other window facing the side\\front of my house. i saw it turn quickly and flew over my neighbor's house.it then flew off quickly toward the north. i thought in my head,\"oh no...not again!!\" as i had just seen one on 11\\12\\09. i got in my bed and closed my eyes."],"Country":"United States","Case Number":"20583","map":"<A HREF = \"http://maps.google.com/maps?q=40.805157,+-81.377247(20583)&iwloc=A&hl=en\"> mufon case (20583) map </A>","Summary":"I saw an oval shaped craft with 12 bright lights fly low over my house","Disposition":"IFO","City":"Canton","Log Number":"US-11182009-0011","Latitude":"40.805157","Object Flight Path":"Path with directional change","Object Shape":"Oval","Tags":"City","trends":["There have been 13 other sightings in Canton","There was one other sighting in Canton on or around November 15th 2009","This sighting has never been favorited.",""],"Viewing Distance":"21-100 Feet"}