{"Object Flight Path":"Stationary,Straight-line path","City":"Philadelphia","Object Features":"None","divs":["Sighting DetailsI was driving home and pulled up to my street. I have a nice sky view to the left and noticed how clear a night it was. Saw a very, very bright star. I assumed it was a star but knew it was too low and bright. This was at around 7:45 PM Eastern Standard Time. I went into my house and grabbed a pair of binoculars. Told my wife and she too thought it was bright for a star. Binoculars were not that powerful but I could see it was a continuous bright white light with a touch of red on the bottom. It was a contant brightness, nothing like a star or plane light. I came back out about 40 minutes later and I noticed it moved, not far at all but enough to prove it was not a stationary object. Then I watched many planes fly by the object. It certainly was no plane, star, meteor(although last night there was a meteor shower)At that point I continued to watch and called my brother since I knew he would have a good view where he lives, about 3 miles from me. We both watched it for about an hour and it definately drifted farther into the sky but still incredibly bright. We watched many airplanes fly by it. I drove to his house and watched it as much as I could incase it disappeared. Watched it together from his rear yard which is much higher area than my house. We had an incredible view. At about 10:00 PM we decided to drive to a local store and purchase a telescope with hopes of getting a close up view. We didn't want to leave. As we drove towards the store area, we noticed it disappeared around 10:30. Unfortunately, we were obstructed and did not see how it left but it was gone. I was crushed when we looked up and it was gone! From the time I first noticed it moved and it couldn't be a star I was amazed. I knew it was something out of the ordinary and was so upset we did not get a telescope in time. Plese let me know if others reported this. I know for sure that many planes in the area that night flew by. Those pilots had a great view."],"Case Number":"20586","Summary":"Very low star, not twinkling, moved slowly over a period of a few hours.","Region":"Pennsylvania","Log Number":"US-11182009-0014","Latitude":"39.955685","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20586.html.txt","/var/www/straped/mufon/org/20586.html"],"Date of the Event":"11/17/2009 12:00 UTC","Date Submitted":"11/18/2009 02:46 UTC","Sighting Duration":"Undisclosed","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.955685,+-75.158309(20586)&iwloc=A&hl=en\"> mufon case (20586) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around November 17th 2009"],"Tags":"City","Country":"United States","Disposition":"IFO","Longitude":"-75.158309"}