{"Weather Factors":"Unknown","Source":"MUFON","divs":["sighting detailson november 18, 2009 @ 1:19 am; saw a flying object to the east of the home hovering over a horse pasture after hearing some noises. object was observed for a short time before i contacted my roommate who is a dispatcher for the local sheriff's office. officer was dispatched to the location. as officer was en route, the craft continued to hover over the pasture area, occasionally coming towards the house and exhibiting erratic\\quick movements. size\\shape of the object is unknown but has multiple lights on the top\\sides\\bottom of craft. shortly before the officer arrived on scene, the craft approached the house again and the dogs became excited and started to bark continuously. (can be heard on recored phone call) as the officer was arriving on scene, the craft took of quickly heading straight up flashing red\\blue. the night was cold (32*) with low humidity and no moon providing very clear visibility with lots of stars. upon checking, a similar complaint was filed in july of 2008 in the same area."],"Country":"United States","Summary":"Flying object approached house/ multi color lights/ no sound","Disposition":"Insufficient Data","Case Number":"20589","Log Number":"US-11182009-0017","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"11/18/2009 03:04 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20589.html.txt","/var/www/straped/mufon/more/20589_submitter_file2__Location1.jpg","/var/www/straped/mufon/more/20589_submitter_file3__Location2.jpg","/var/www/straped/mufon/org/20589.html"],"trends":["There have been 5 other sightings in Waupaca","There was one other sighting in Waupaca on or around November 18th 2009","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Region":"Wisconsin","City":"Waupaca","map":"<A HREF = \"http://maps.google.com/maps?q=44.360625,+-89.080476(20589)&iwloc=A&hl=en\"> mufon case (20589) map </A>","Longitude":"-89.080476","Object Flight Path":"Undisclosed","Latitude":"44.360625","Object Shape":"Unknown","Date of the Event":"11/18/2009 01:19 UTC"}