{"Tags":"City","Object Features":"Undisclosed","Summary":"Small dot extremely far off but motion was zigzag unlike any aircraft","Date Submitted":"11/18/2009 05:20 UTC","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"20591","Longitude":"-82.317636","Log Number":"US-11182009-0019","Object Flight Path":"Undisclosed","City":"Gainesville","files":["/var/www/straped/mufon/html2text/20591.html.txt","/var/www/straped/mufon/org/20591.html"],"Country":"United States","Viewing Distance":"Unknown","Date of the Event":"11/17/2009 12:00 UTC","Disposition":"IFO","Object Shape":"Circle, Disc, Star-like, Unknown","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=29.660634,+-82.317636(20591)&iwloc=A&hl=en\"> mufon case (20591) map </A>","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around November 17th 2009"],"divs":["sighting detailsit was the day of the leonid meteor shower. i was out with my wife in the middle of a playground around 4-5 am star gazing and watching out for meteors. there were other star gazers too. i was looking at a particular star formation\\constellation when i noticed one of the 'stars' moving. it was really far off, like a dim star, so it was difficult to point out to my wife. it kept moving in a straight line from west to east across the sky. i was excited because i thought it was a ufo! my wife completely believes in ufos but she reasoned that it might have been a satellite as they are sometimes visible to the naked eye. i was somewhat convinced. however, after a while i noticed another 'star' moving in a similar fashion, this time from south to north. now this one was not moving in a straight line, it was moving in a somewhat zigzag and erratic motion but generally from south to north. now this could not be a satellite as it wasn't moving straight. the distance was too great to have been a plane and why would a plane or satellite move in a zigzag pattern? after sometime it faded away and i lost sight of it. though we would love to see a real ufo up close, i really hope what i saw was a ufo!"],"Latitude":"29.660634"}