{"map":"<A HREF = \"http://maps.google.com/maps?q=40.032943,+-124.06048(20597)&iwloc=A&hl=en\"> mufon case (20597) map </A>","Object Flight Path":"Straight-line path","Weather Factors":"Light","files":["/var/www/straped/mufon/html2text/20597.html.txt","/var/www/straped/mufon/org/20597.html"],"City":"Shelter Cove","Date Submitted":"11/18/2009 10:02 UTC","Tags":"City","Region":"California","Case Number":"20597","trends":["There have been 3 other sightings in Shelter Cove","There were no other sightings in Shelter Cove on or around July 14th 2009"],"Object Features":"None","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Sphere","Longitude":"-124.06048","Source":"MUFON","Log Number":"US-11182009-0025","Sighting Duration":"Undisclosed","divs":["Sighting DetailsFour friends and I were sitting on the beach in a sort of enclave next to a cliff watching a very beautiful sunset. As we looked out at the sun dipping below the horizon we all noticed what looked like to be an ordinary plane from a distance. We thought that because the way it was flying steady and linear, but what kept my interest was how low the reddish orange glowing object was flying. It wasn't very big it was about pea sized from my perspective. It maintained it's path and we all could hear no audible noise. My friends didn't take it seriously as a \"unidentified flying object\" at first until they realized that if it was a plane we would have heard it from since it was so close. It was difficult to judge how close the object was and plus I'm bad at estimating measurements. It was about 350-400 yards away, about 200-300 feet above the treeline. It was traveling at about 25-30 miles and hour and it traveled from west to east and it went out of our sight over the hills. So once my friend Ray could no longer deny it being a UFO he pulled out his cellphone and took a video of it. Since I have filed this report I have not been able to get a hold of Ray through his phone(Probably didn't pay his bill) so I'll have to go visit him personally to try to retrieve the cell phone footage."],"Latitude":"40.032943","Date of the Event":"07/14/2009 12:00 UTC","Summary":"Saw low flying red orb on a lost coast beach near the border of Mendocino and Humboldt.","Disposition":"Insufficient Data","Country":"United States"}