{"Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Shape":"Diamond","Country":"United States","Source":"MUFON","Date of the Event":"11/18/2009 06:38 UTC","files":["/var/www/straped/mufon/html2text/20592.html.txt","/var/www/straped/mufon/org/20592.html"],"divs":["Sighting DetailsI am 26 years old and have never seen anything in the sky like this before. I was completely sober, with no drugs or alcohol in my system at all. I seek no fame from this event, the only thing I ask is to please be told if anyone else reports anything similar to this event around my area, so I know I'm not crazy. I was on my way home from work (I ride bicycle), and I happened to glance to the left and in the sky I saw 3 bright orange lights appear. It's hard to explain. One second they weren't there, and the next, they were. Large and round in shape, they appeared all at once in the sky and lasted for roughly 3-5 seconds before disappearing, one at a time. I stopped my bike and thought that it must have been fireworks or something. And then, about 3 minutes later, it happened again. Bright round orange lights, appearing in a semi-circle pattern in the sky. After 4 seconds or so they disappear, always one dimming then the next, and finally the last. I then took my cell phone out and the next time they appeared, roughly 4 minutes later, I took a video clip. I caught the tail end of their act, only about a second worth of footage. But you can clearly see something there, and then fading out. They appeared about 4 times at the location where I was at, then I got on my bike and continued home. After riding no more than 3 or 4 minutes I saw them again, this time at a different spot in the sky. That is when I knew this was no balloon or fireworks or something. This was something else. I am completely shaken, right down to my core, about everything I have learned about science and whether we are alone in the universe. I swear on my sons life, this is not an attention seeking email. I just want to know that what I saw was real. Please, just let me know if this sounds crazy to you. Thank you for taking the time to read my letter."],"Region":"Pennsylvania","Disposition":"Insufficient Data","trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around November 18th 2009"],"Summary":"The UFO that I saw was shaped like a semi-circle. 3 bright orange lights.","Longitude":"-76.882878","City":"Harrisburg","Object Flight Path":"Stationary","Case Number":"20592","Log Number":"US-11182009-0020","map":"<A HREF = \"http://maps.google.com/maps?q=40.278,+-76.882878(20592)&iwloc=A&hl=en\"> mufon case (20592) map </A>","Latitude":"40.278","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"11/18/2009 09:05 UTC"}