{"Sighting Duration":"Undisclosed","City":"Dublin","Source":"MUFON","Summary":"Saw bright lights in sky that caught my attention.","Case Number":"20598","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/20598.html.txt","/var/www/straped/mufon/org/20598.html"],"Longitude":"-98.334798","Viewing Distance":"Unknown","Object Shape":"Other","Date Submitted":"11/19/2009 12:23 UTC","divs":["Sighting DetailsI was driving home from my in-laws house who live in the Greens creek area between Stephenville and Dublin but more near Dublin with my four year old and 12 week old in the car with me. It was not long after I turned off of County Road 242 which I had been heading north, on to another county road, I believe it is County Road 381 heading south east. It was not long after I turned onto County Road 381 that I noticed two bright lights in the sky. Out of the view from my windshield the light to my left was slightly higher. My initial reaction was that they were planets, they were orangish in color and they were larger than star. I slowed down and leaned forward in my seat to investigate what I was seeing. I soon realize they were far too large to be planets almost as soon as I came to this realization another light appeared above and to the left of the light on my right and then another light appeared above the new light and to its left forming a straight line at about a 45-60 degree angle. The lights were stationary in the sky never moving. As the new lights appeared I started freaking out. As you well know UFO sightings are prevelant in our area and I could not believe that I could be possilby witnessing it for myself. Probalby second after the new lights appeared they faded beginning with the first light on my left and then they were all completly gone. Once the lights on the left started to show up I did not pay as much attention to the light on the far right. I do not believe it changed but do not recall when for sure it faded although I know it was within seconds of the other lights. In all the event took place in probably less than 2 minutes. The thought of the UFO sightings did not occured to me as the third and fourth light appeared but it was really the manner that the lights faded that convienced me that I had just witnessed something strange. I was very excited and shocked about what I had just seen and got on the phone to share it with my husband immediatly. My outgoing call to him was at 7:44 P.M. Therefore I approximate the sighting took place at 7:42 P.M. I just recieved word via Facebook that a friend of mine also witnessed lights in the sky this evening although I do not know the specifics of their sighting."],"Disposition":"Unknown","Tags":"City","Object Features":"Undisclosed","Latitude":"32.094173","Region":"Texas","trends":["There have been 40 other sightings in Dublin","There were 2 other sightings in Dublin on or around November 18th 2009"],"Country":"United States","Date of the Event":"11/18/2009 07:42 UTC","Weather Factors":"None","Log Number":"US-11192009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=32.094173,+-98.334798(20598)&iwloc=A&hl=en\"> mufon case (20598) map </A>"}