{"Disposition":"IFO","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Date of the Event":"11/16/2009 11:12 UTC","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=30.062361,+-83.169668(20605)&iwloc=A&hl=en\"> mufon case (20605) map </A>","trends":["There have been 17 other sightings in Mayo","There was one other sighting in Mayo on or around November 16th 2009"],"Weather Factors":"None","Source":"MUFON","Latitude":"30.062361","Object Features":"Unknown","Tags":"City","Country":"United States","Summary":"On November 16 , 17, 18 I heard sonic booms. to the west of me over the Gulf region.","divs":["Sighting DetailsOn November 16th 09 I heard sonic booms at approximately 11AM about 2-3 minutes in duration. there were about 3-4. On Novemver 17,09 at 12:10 exactly there was another series of somic booms. This time it was loud enough or close enough it upset my two pups.They began to bark uncontrolably. It took me a minute or two to get them undercontrol again. On November 18th,09 there were more somic boombs at approximately 5:10PM. I have heard these somic boombs before and wondered if it were jets returning to MacDill AFB in Tampa or to the Pencicola AFB On the Panhandle of Fla.The sonic booms came from the west of me over the Gulf area. But never 3 days in a row. I was not scared, just a little up set on the 17th of November that the booms upset my pups. They were in their beds when they heard the booms, and were alarmed. They have never alerted to things like this before.. Only to some one comming to the door or something in the yard at night.(deer, wild critters that come into the yard at night)I was in the livingroom kitchen area prepairing meals when I heard the booms.I can hear comercial jets go over and have heard sonic booms before, but never 3 days in a row.From the Gulf to the west of me. ( I live 20 miles from the Gulf.)It made me a little anxious to think that the booms would upset my two pups so. It took me a minute or two to get them calmed down. As I think back now my two cats were affected by the actions of my two dogs as well. they became aggitated as well."],"files":["/var/www/straped/mufon/html2text/20605.html.txt","/var/www/straped/mufon/org/20605.html"],"Date Submitted":"11/19/2009 06:51 UTC","Log Number":"US-11192009-0008","Longitude":"-83.169668","City":"Mayo","Case Number":"20605","Object Shape":"Unknown"}