{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/20604.html.txt","/var/www/straped/mufon/org/20604.html"],"Tags":"City","Case Number":"20604","Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in Mayo","There was one other sighting in Mayo on or around November 16th 2009"],"Latitude":"30.054521","Longitude":"-83.167438","Date Submitted":"11/19/2009 05:54 UTC","Weather Factors":"Unknown","Date of the Event":"11/16/2009 11:03 UTC","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.054521,+-83.167438(20604)&iwloc=A&hl=en\"> mufon case (20604) map </A>","Object Flight Path":"Path with directional change","Region":"Florida","City":"Mayo","divs":["Sighting DetailsStarting on Nov 16- Nov 18 I have heard sonic booms. ON the 16th at 11AM there was 3-4 sonic booms, approximately in a three minute duration.Nov. 17-09 between 12:10 and 12:12 there were several sonic booms even my dogs were upset by this episode. They began to bark uncontrolably. On Nov.18 at 5:10 there were more sonic booms. I have lived on the Space Coast most of my life and I know what a sonic boom is. I have heard it when the shuddle comes home and when some of the Jets return to Patricks AFB at Melbourn Fl. These sonic booms could have been jets going to MacDill in Tampa Or to Pencicola AFB in the Pan H of Handle. I have heard these same sonic booms on several occaasions previously to this but never so frequently.(three days in a row) I have also seen the Ramjet contrails in my vacinity, on several occasions. (smoke on a rope)???? On Sat. Oct. 25 after a rainy day the clouds were finally clearing, only a few dark clouds over the Gulf about 7:30 I was out with my pups for a break. there was a dark black cloud over the Gulf area like a sideways Y (the two arms pointins south) there was a small flash that caught my eye. There seemed to be a bright ORB (Yellowish Gold in color could have been feflecting the sun as it was nearly sunset)skimming along the bottom side of the cloud doing what I would call a figure 8 among the clouds edge.. it only lasted a few seconds.The ORB did about 3 of its loops and was gone. Just long enough to catch your attention but short enough to make you wonder if you really saw anything.I was curious about both events. I was not afraid, but the sonic booms did upset my dogs, they also heard it. and they normally do not bark unless some one or some thing is outside the house in the yard.They allert to the deer and other night critters that visit out yard but this time it was different."],"Object Features":"None","Object Shape":"Sphere, Unknown","Viewing Distance":"Over One Mile","Log Number":"US-11192009-0007","Summary":"starting on Nov. 16-17-!8- I have heard a sonic boom to the west of me, over the Gulf area."}