{"Latitude":"27.504672","Region":"Florida","Disposition":"Unknown","Date Submitted":"11/19/2009 06:35 UTC","Country":"United States","Object Features":"Unknown","Longitude":"-81.438907","Viewing Distance":"Unknown","divs":["Sighting DetailsThis is the second occurance at our home. The first event i was sitting in my recliner watching tv when i looked outside because i saw a bright light. I went outside and saw six bright star-like stationary objects. No sound and not moving. I called my wife out to look and when she got there the lights had dimmed and then started blinking very fast. They hovered above us for about 30 seconds again blinking very fast. Suddenly they just moved away very fast, again no sound. Below is the way it looked to us. * * * * * * * The second occurance just happened last night. I was sitting again in my recliner watching TV when i saw another bright light. I went outside and saw 3 bright star-like stationary objects - i hurriedly called my wife out again to look and as she came out she did happen to see the bright light but it dimmed. We ran to our dock, we live on a lake, to see clearer and there were a lot of stars out but these three lights were moving with no sound. We did see a few aircraft moving in the area but we could tell what they were with the sound but these other objects were definitely unidentifiable. As we watched they just moved away but traveled together. We were estatic to see these unidentifiable objects because up until this time we just did not really believe they existed. Now we know they do. They may not be aliens but they were certainly UFO's. I had my cell phone but was unable to get any pictures fast enough. I need to purchase a better camera when these events occur. * * This is the way it looked on second occurance. *"],"Tags":"City","Summary":"Two occurances where we saw star-like objects hovering overhead - no sound.","Object Flight Path":"Hovering then path","Log Number":"US-11192009-0014","files":["/var/www/straped/mufon/html2text/20612.html.txt","/var/www/straped/mufon/org/20612.html"],"City":"Sebring","Source":"MUFON","trends":["There have been 6 other sightings in Sebring","There were no other sightings in Sebring on or around November 18th 2009"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=27.504672,+-81.438907(20612)&iwloc=A&hl=en\"> mufon case (20612) map </A>","Date of the Event":"11/18/2009 08:05 UTC","Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","Case Number":"20612"}