{"files":["/var/www/straped/mufon/html2text/2061.html.txt","/var/www/straped/mufon/org/2061.html"],"divs":["Sighting DetailsI was in Springfield, Ill. with my mother and brother to go to the Ill. StateFair in 1952. We were staying with my Aunt. Her sisters husband Harry Liebermanfrom Chicago and I were out in the yard with a clear view of the sky. We were at211 W. Jackson St. which was about 2 or 3 block from the Ill. State Capitol,where my Aunt was the assistant sec. to the govenor of the state.I just happen to look up an toward the capitol bldg. when I saw a blueish greenlight slowly moving over and above the capitol bldg., when I pointed to it HarryLieberman also saw it. There was no sound, the round basketball looking lightmove from the NE to the SE over the top of the capitol bldg. It was dark and thetime was around 800 to 830 PM. The next day my Aunt looked in the Springfieldpaper an the article said, Strange Light Spotted around, I think, Lake Lehlandor one of the lake very close to Springfield. You should be able to get thearticle if they still have it from the newspaper. I am 61 years old, collegeeducated, picked to serve on a school board in a town of 7,500 people. The is atrue statement to the best of my knowledge base on what I saw with my own eyesand what Harry saw with his. Harry died several years ago. The bldg. that westay in was moved several years ago for the capitol to expand, I think. Thenews paper article might still exist.Ron Medler"],"Disposition":"Unknown","Viewing Distance":"Unknown","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around August 15th 1952"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.781721,+-89.650148(2061)&iwloc=A&hl=en\"> mufon case (2061) map </A>","Country":"United States","Weather Factors":"None, Unknown","Longitude":"-89.650148","Source":"MUFON","Date Submitted":"08/15/1952 08:24 UTC","Region":"Illinois","Tags":"City","Object Features":"Undisclosed","Log Number":"","Summary":"Springfield, Il in the last of July or the first","Sighting Duration":"00:01:00","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Date of the Event":"08/15/1952 08:24 UTC","City":"Springfield","Latitude":"39.781721","Case Number":"2061"}