{"map":"<A HREF = \"http://maps.google.com/maps?q=45.398697,+-72.722116(20615)&iwloc=A&hl=en\"> mufon case (20615) map </A>","Sighting Duration":"00:00:10","files":["/var/www/straped/mufon/html2text/20615.html.txt","/var/www/straped/mufon/org/20615.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","City":"Granby","Summary":"Slow moving fireball in quiet neighbourhood","Log Number":"CA-11192009-0017","Date of the Event":"05/31/1966 12:00 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Region":"Quebec","Object Shape":"Fireball","Date Submitted":"11/19/2009 08:40 UTC","trends":["There have been no other sightings in Granby","This sighting has never been favorited."],"Disposition":"Unresolved","Tags":"City","Latitude":"45.398697","Object Features":"None","Longitude":"-72.722116","divs":["Sighting DetailsI was walking on the sidewalk in my neighbourhood which was very quiet at the time in the city of Granby in the province of Quebec and came to the street corner close to my home. At that moment, the corner of my left eye caught attention of an object in the sky coming in my direction. I estimate it was about 300-500 feet in the air or 5-7 average trees in comparable elevation. The object, a fireball, was traveling slowly, perfectly horizontally and without a noticeable trail of smoke. There was no smell of burning. There was no sound at all coming from it. In consideration of its elevation, I approximate the size as about 75-100 feet in diameter, or about the size of a small house. What was disquieting about it was its slow speed and its size. From my available perspective, it took maybe 6 to 8 seconds to travel the distance from when I first noticed it to when it disappeared. I estimate this distance to be 1500 feet calculated with the help of about 20 houses on the street from my left to my right of the street corner. It disappeared then out of my sight above the houses to my far right. Astonishment was my reaction and I went back home. I always thought it would have been a meteor of some kind and I expected something out of the news or newspapers the next day but nothing noticed was ever mentioned about it. In view of its size, I always thought that if it touched ground somewhere, it would have done some damage and thus reported."],"Case Number":"20615","Country":"Canada"}