{"Object Features":"Unknown","Case Number":"20619","trends":["There have been 3 other sightings in Laytonville","There were no other sightings in Laytonville on or around July 15th 2009"],"Log Number":"US-11192009-0021","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"11/19/2009 11:59 UTC","Summary":"Reddish orange orb seen by 5 on southern Humboldt's Lost Coast","divs":["Sighting DetailsI was standing on a cove on the beach with four friends next to a cliff. We were watching the sunset. The sun had just dipped down under the horizon when we saw in the same western direction a unwavering reddish light in the distance heading in a linear path almost towards us. We all thought it to be an airplane when we first saw it, but the closer it got the more we all agreed that we didn't know what it was. Our popular reaction to it was \"WOW! What is that?\" It's approach was slow and low which was a factor in helping us determine it was not a plane. and it stayed that way even as it passed 300-400 yards ahead of us. It was about 400-500 feet in the air. The object was heading eastbound at about 35-40 mph. The object just kept going until it was out of view behind the eastern hills. I will be going around and getting the other witnesses testimonies soon. My friend Ray who was a skeptic till the object damn near came right in front of us, pulled out his cell phone and recorded 15 seconds of the orb. I will be working on obtaining this footage and attaching it to this case for all to see."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.696002,+-123.478694(20619)&iwloc=A&hl=en\"> mufon case (20619) map </A>","Region":"California","Longitude":"-123.478694","files":["/var/www/straped/mufon/html2text/20619.html.txt","/var/www/straped/mufon/org/20619.html"],"Date of the Event":"07/15/2009 08:00 UTC","Latitude":"39.696002","City":"Laytonville","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Weather Factors":"None","Disposition":"Unknown"}