{"Longitude":"-122.383015","Country":"United States","Date Submitted":"11/20/2009 11:25 UTC","Disposition":"Hoax","Date of the Event":"05/17/1970 01:26 UTC","Weather Factors":"None","Case Number":"20623","Viewing Distance":"101-500 Feet","City":"pescadero","Object Flight Path":"Path then hovering","trends":["There has been one other sighting in pescadero","There were no other sightings in pescadero on or around May 17th 1970"],"Summary":"came from pescadero beach ocean to1200' towards us and responded to SOS signal","divs":["Sighting Detailsan amber ball of light rose from the ocean at pescadero beach and came toward (15 miles)us to skyline blvd (1000') where one can see the ocean and bay area in Palo Alto county. I was very large when it stopped in front of us (1200'from sea level and 200' from us)I jumped out and was waving to it (no sound the whole time, stopped or moving) We had a Toyota Landcruiser with an external movable spot light. I used it to direct the beam to the amber ball of light that was stationary. And used a SOS code from the spot light. Then the object moved smoothly to the left, then to the right, then diagonally both ways as if it was responding to the SOS signal sent by me. I repeated that code about 10 times, and it responded to that code repeatedly. The communication lasted over 20 minutes, the in less of a second left a com trail and disappeared in space with no sound. The second siting nights later as we were traveling to home on HWY 9 from Skyline Blvd, the same type of amber ball of light was traveling between the mountains but looked like it was in trouble spuing molten flames as it irratically moving up and down with little control then disappeared behind the moutains. The third siting nights later on skyline blvd where one can see the entire bay area and ocean at the same time, there was a grid network of perfically clear com trails over the entire bay area only about 850' above sea level (and we were about 1000') They were about 10 to 20 mile squares and did not dissapate like normal com trails from a jet or other sources. Turned off of Hwy 9 to go home and lost site. We never saw anything that strange before or after and we traveled that route for ove 25 years at that same time (commuting from swing shift) I called the San Jose news and talked to Betty Barnical to ask if anything had been reported. First she discibed the same amber ball of light around that same time, but it was only seen in Pheonix, Ar."],"Region":"California","files":["/var/www/straped/mufon/html2text/20623.html.txt","/var/www/straped/mufon/org/20623.html"],"Latitude":"37.255164","map":"<A HREF = \"http://maps.google.com/maps?q=37.255164,+-122.383015(20623)&iwloc=A&hl=en\"> mufon case (20623) map </A>","Object Features":"None","Tags":"City","Log Number":"US-11202009-0003","Sighting Duration":"00:25:28","Source":"MUFON","Object Shape":"Fireball, Sphere"}