{"Longitude":"-2.502351","Object Shape":"Circle, Disc","Date of the Event":"11/20/2009 05:15 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Latitude":"51.461677","Log Number":"AU-11202009-0001","Country":"United Kingdom","trends":["There have been no other sightings in Kingswood","This sighting has never been favorited."],"Region":"England","Object Features":"Undisclosed","Case Number":"20620","divs":["Sighting Detailsi was at my university with a Muslim friend of mine (im an Australian thats very much into my philosophy). we were discussing our ideas of the universe and our interpretations of what we thought god was (i am an atheist, Buddhist, philosopher). while sitting on the porch my friend had his back to the sky while i could see the full sky. while he was talking about his idea of what happened i started to talk and reply to what he had said when all of a sudden i noticed something shooting from left to right in the sky. the object was; - Parallel to the earth in its movement. - Had no flashing lights (like on a plane). - Its movement was incredibly fast. - It was far too close to the earth (maybe kilometers, its hard to tell with size and distance)to be a meteor and had too much of a round solid shape. - There was a light like energy following in its trail and what i found interesting is how the light trail dissipated just as quickly as the object moved. it appeared and was moving very quickly for about 3 seconds then it was out of my view. my reaction at first was awe. when i don't know how to react to something sometimes i just laugh at it so i had a few giggles at it. i just kept looking in that direction at where it was and tried to get my head around it and think of a reason behind what it may have been. my friend asked what just happened and i wasn't sure what to say from whether he'd believe me or not. i decided to tell him and i about 10 seconds after it happened i jumped up and ran to a place were i could see the distance and maybe get another little glimpse. for the speed it was moving it was very unlikely that i would see it so it was gone and we spoke about it and i came home to study objects the fly in the sky that may have been similar(like with the trail of light) and i couldn't find anything to match it so that led me here. at first i thought it would have been a plane but it was far to quick and i could see the definitive shape of a disc."],"City":"Kingswood","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.461677,+-2.502351(20620)&iwloc=A&hl=en\"> mufon case (20620) map </A>","Summary":"i was sitting with a friend the sun had just started rising. i saw a ufo pass quickly infront of me.","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/20620.html.txt","/var/www/straped/mufon/more/20620_submitter_file1__IMG_0385.jpg","/var/www/straped/mufon/more/20620_submitter_file2__IMG_0387.jpg","/var/www/straped/mufon/org/20620.html"],"Object Flight Path":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"11/20/2009 04:42 UTC"}