{"Viewing Distance":"20 Feet or Less","City":"Mayo","divs":["Sighting Details At8:15 8:30 I was watching Tv in my living room by one of the windows. in my easychair. I senced ,felt someone,something watching me.I looked to my right and there was an individual in a gray suit standing outside my window watching me. They were only there for a second or two if that long. They had to be over 7' tall. (I measured this morning).I had been discussing this feeling with someone just yeaterday, of sencing that someone was comming. de'-ja'-vu'.I was watching TV. I just had a sence that there was someone watching me and turned to look, and there they were. I Knew it was not a person.But someone or something else entirely. The individual fled the instand it knew I had noticed it.So I only got a fleeting glempse of it. But I saw that it was dressed in gray and had a large head, (the eyes I am not sure of.) I was not affraid I felt calm,almost protected( again). As I have not been able to go out and watch the stars for nearly two weeks. I had been out earlier at about 7:30 8:00 PM.the sky was clear lots of stars cool and crisp no dust or smog.No traffic of any kind.So it could not have been a reflection of any kind. And not a reflection from my TV either."],"files":["/var/www/straped/mufon/html2text/20636.html.txt","/var/www/straped/mufon/org/20636.html"],"Country":"United States","Case Number":"20636","Weather Factors":"Does Not Apply","Longitude":"-83.167268","Tags":"City","Source":"MUFON","Summary":"watching TV when I senced someone something outside my window.","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Date Submitted":"11/21/2009 10:06 UTC","Disposition":"Unknown","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around November 20th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.058281,+-83.167268(20636)&iwloc=A&hl=en\"> mufon case (20636) map </A>","Log Number":"US-11212009-0006","Date of the Event":"11/20/2009 08:30 UTC","Object Features":"None","Object Shape":"Unknown","Region":"Florida","Latitude":"30.058281"}