{"files":["/var/www/straped/mufon/html2text/20632.html.txt","/var/www/straped/mufon/org/20632.html"],"Source":"MUFON","Sighting Duration":"00:00:15","Log Number":"US-11212009-0002","Object Shape":"Circle, Disc","Weather Factors":"None","Object Features":"None","Date Submitted":"11/21/2009 12:58 UTC","Viewing Distance":"101-500 Feet","Case Number":"20632","Longitude":"-121.007739","City":"Nevada City","map":"<A HREF = \"http://maps.google.com/maps?q=39.266251,+-121.007739(20632)&iwloc=A&hl=en\"> mufon case (20632) map </A>","Date of the Event":"10/23/2009 08:20 UTC","Region":"California","trends":["There have been 6 other sightings in Nevada City","There were no other sightings in Nevada City on or around October 23rd 2009"],"Summary":"White disc-had light of it's own","Country":"United States","Disposition":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI live quite a way from town so it is very dark where I live. I was taking a ride (on our dirt road) to get past the thick pines and oaks so I could see the stars and perhaps some \"shooting\" stars. The night was very clear and cold. I was driving about 15 MPH looking up at the sky out my windshield when a light to my left caught my eye. Looking out my (driver's) side window I caught sight of a round light going faster than I -comming from behind me on my left just above the tree line-it was angled downwards. I saw it between some if the trees and then it went behind the trees and the mountain to my left. My first thought was that thing is going to \"go down\"-meaning hit the ground-but then my brain finally caught up to the event and I almost felt sick to my stomache. It had a light of it's own-no \"sparkle\" like a star. More like a flat kitchen light with a lense-a perfect cirlce of opaque light. There was no tail, no streaks, no sparkle. It must have been huge-It came from higher up but dipped below the tree line-instead of looking the size of a speck like a star or an earing stud like a planet-this filled my vision like a baseball just outside my window would.The area it went over is BLM property-so it was not a house-and it just wasn't that kind of light. I stopped the car for a moment-trying to see if there was any kind of fireball-I saw none. I was shaking, but took off toward the area it went to see if I could see it again-The road ran out-and it is all wilderness and a River gully-I never saw any hint of it again. I went up to a higher spot but saw nothing. I still can't quite grasp what I saw. I know I saw it-just can't get my brain around it because there is no explanation for that kind of a light behaving in that way. The only \"earthly\" explanation would be that Beal AFB is about 45 miles away-and they perhaps were testing something not meant to be seen. It was no airplane headlights and not a meteor. I've seen planty of both. Thanks for listening-had to tell someone- L. Glass"],"Latitude":"39.266251"}