{"Case Number":"20635","Source":"MUFON","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around July 20th 1976"],"Summary":"i watched a huge craft cross gretna, in plain sight.","map":"<A HREF = \"http://maps.google.com/maps?q=29.952566,+-90.064932(20635)&iwloc=A&hl=en\"> mufon case (20635) map </A>","Date Submitted":"11/21/2009 09:57 UTC","Object Features":"Undisclosed","Disposition":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsMy fiance and I were in bed, and I had awakened but she was sleeping. We had a 6x4 picture window in our bedroom, and I was lying on my side looking at the low-lying fog, or clouds from the mississippi river. The wind was blowing south-westerly, just enough to move the fog, and the city lights were making all this visable. Our house was in a very highly populated area of town. I just happened to notice something moving very slowly, in the opposite direction beneath the clouds. Thats why it caught my eye. The clouds or fog was very low, and this craft was below the clouds. I'd judge it to have been maybe 500 feet off the ground. It had no lights showing, and it's speed had to have been no more that 15 or 20 mph. Once I saw it, I became fully awake and aware. It was awesome, in the truest sense of the word. It was huge, and there was no sound. It actually was more of a bat-wing shape, than a triangle, although it was triangular. What was so spectacular, was the size of the thing, and how slow it was moving, and it just defied everything I knew about gravity, aircraft, and my whole personal version of reality. I awakened my girlfriend, and pointed it out to her, and she tried to see it for a minute, and with me describing exactly where it was, and how it looked, she never did see it. That tells you that it wasn't as easy to see, as I thought it was. Its just mind-boggling, honestly; so big, and so slow, and so quiet, but seeing it changed my life. New Orleans was right accross the river from where we were, and I remember thinking, if it didn't gain some altitude, its going to hit some buildings over there; and it was headed right for downtown new orleans. I said I saw it for four minutes, but it might have been seven or eight. It took a long time to pass from view of my picture-window. But once I saw it, I never took my eyes off it, until it was out of view. It was at least 500 ft. from tip to tip, and nose to rear, at least 3, or 4 hundred. It never altered speed nor changed course, as long as I saw it. The, perhaps most amazing thing about this, is that in a big city like new orleans, apparently no one but me even saw the ship. Also, I wasn't drugging, or drinking, and I do not hallucinate, or make up stories; I know what I saw, and I do wish I knew what it was."],"files":["/var/www/straped/mufon/html2text/20635.html.txt","/var/www/straped/mufon/org/20635.html"],"Sighting Duration":"Undisclosed","Log Number":"US-11212009-0005","City":"New Orleans","Viewing Distance":"Unknown","Country":"United States","Latitude":"29.952566","Tags":"City","Object Flight Path":"Undisclosed","Date of the Event":"07/20/1976 02:15 UTC","Longitude":"-90.064932","Region":"Louisiana","Object Shape":"Triangle"}