{"Sighting Duration":"Undisclosed","Summary":"Two oval, silvery objects, large, and hovering. No lights or identifying marks.","Log Number":"US-11212009-0003","Region":"Texas","Disposition":"Unknown","trends":["There have been 4 other sightings in Schertz","There were no other sightings in Schertz on or around January 6th 1995"],"Country":"United States","Object Flight Path":"Hovering then path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.556704,+-98.263214(20633)&iwloc=A&hl=en\"> mufon case (20633) map </A>","Weather Factors":"None","Case Number":"20633","Object Shape":"Oval, Sphere","Date Submitted":"11/21/2009 04:24 UTC","divs":["Sighting DetailsMy mother was driving me to pick up my paycheck. We'd just left my apartment on Schertz Parkway in Schertz, Texas and were heading west to I35. I was leaning my head on the passenger window when I noticed the reflection of something in the glass out of the corner of my eye. I turned to look right expecting to see some F-15's flying towards Randolph Air Force Base since it's one town over. Instead, I saw two, huge, hovering silvery things, for lack of a better word. They were oval in shape, grayish-silver, reflective but like a brushed nickel. No identifying marks, windows, or lights were on these craft. I shouted at my mom to look. She turned and looked and said \"What the hell is that?\" I begged her to pull over or turn around. At first, she didn't want to. Then she U-turned and we came back around to the same spot. I looked out the window over the cow fields (there are homes there now) on the corner of Schertz Parkway and Live Oak Road. Their was absolutely no sound coming from these things and they seemed to be hovering very low, not even perceptibly moving. The one on the left suddenly shot straight up and was gone in the blink of an eye. The one on the right, hovered off backwards away from us, slightly behind a treeline, then it too, shot straight up and was gone. It was incredible. I couldn't believe what I'd just seen in broad daylight, at noonish, no less. There were no clouds in the sky that day. We never reported this to anyone because mom thought people would think we were crazy. I pointed out that we both saw it, not just one of us. The funny thing is, she swears we got out of the car and walked to the fenceline, but I don't remember ever getting out of the car. I would remember something like that since I have a physical handicap that required her help to get out of her low vehicle. That's the only discrepancy in both our stories. I lived far too close to where this occured, nearly across the street! I spent the next year scared every night when I went to bed. I don't know if the air force base caught anything on radar, but I did notice increased air traffic over Schertz that afternoon. Perhaps they have a file. There were about two to three other vehicles driving by at the time. Maybe someone else reported a sighting, but we were the only ones to pull over and look."],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20633.html.txt","/var/www/straped/mufon/org/20633.html"],"Object Features":"None","City":"Schertz","Latitude":"29.556704","Date of the Event":"01/06/1995 12:00 UTC","Longitude":"-98.263214"}