{"Region":"Missouri","Longitude":"-90.193964","Disposition":"Hoax","Weather Factors":"Unknown","Sighting Duration":"00:00:03","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path,Unknown","Summary":"On back porch, dark, took pic of contrail and this object showed up when I downloaded pic","Country":"United States","Log Number":"US-11212009-0010","divs":["Sighting DetailsI was taking pictures from my back porch about 8 p.m. It was dark as it was late Oct. - Beginning of Nov. I took several pics. The 2 I am sending you are the only ones that have something on them that I would like your opinion on. The first pic was taken because I saw a contrail coming toward the house. I thought it was odd to see one when it was dark and I was trying to get a pic of what was making it. When I looked at the pic on my computer this other image showed up. It's odd, and I didn't see it when I took the picture. The second pic was also taken off my back porch when it was dark out. I had been getting some bad reception from my satelite on the roof and went out to see if something (planes) was causing it. I decided to take some pictures of the night sky, as I am always trying to get a pic of a UFO. I really don't know what these two images are, but maybe you can explain them to me. Also, during the early summer 2009 (April - May) off of the same back deck one morning, I looked out and saw a black triangular shape object moving just behind the top of the tree line the next street over. I didn't have my glasses on and ran to get them, but by the time I got back it was too far away for me to make out. Thanks for your time. I will wait to hear what you think the images are. Oh, and you will have to enlarge them somewhat in order to see the images."],"Object Features":"None","files":["/var/www/straped/mufon/html2text/20640.html.txt","/var/www/straped/mufon/more/20640_submitter_file1__Nov3nightpics013.jpg","/var/www/straped/mufon/more/20640_submitter_file2__Fall2009002.jpg","/var/www/straped/mufon/org/20640.html"],"Latitude":"38.631542","Source":"MUFON","Date Submitted":"11/21/2009 01:42 UTC","Tags":"City","Date of the Event":"11/03/2009 12:00 UTC","Object Shape":"Triangle, Other","City":"St Louis","Case Number":"20640","map":"<A HREF = \"http://maps.google.com/maps?q=38.631542,+-90.193964(20640)&iwloc=A&hl=en\"> mufon case (20640) map </A>","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around November 3rd 2009","This sighting has never been favorited.",""]}