{"Object Features":"Other","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIT was approximately thirty four years ago, I was 18 years old. We live at 3902 Wewoka ave. I was sitting on the porch, and alot people were in the house watching a big boxing fight on TV, I think (ALI & FRAZIER). I saw these three (3) round disc slowly coming over the top of the houses, so I got off the porch and stood right in the middle of the street to see it closer, I was RIGHT under the disc. IT was 3 of them in a V formation. the one I stood under was seem to be leading the other 2 disc. While was standing under the main disc, it had green,blue,yellow lights going around the bottom of it and it had a brite red light in front of it. there was not a sound at all, and there I was right under this disc. The O'Conner mother,(family who live next door) had call the weather buero and they told her it was a GOOD YEAR BLIMP. But it was not. I know what I saw and what I did'nt hear.Than the main disc slowly hoover in south direction along with the other 2 disc (on each side of the main disc)and it speed off so quick, it was gone. The next day when my brothers went to school (Pleasure Ridge Park), kids came to school and was talking about that they too had seen a UFO. Another time I was in Sacramento, Ca. in 1986, and I was sleep in my bed, when I heard a electral humming. All I remember was that the humming was calling me some how. The only thing I recall is that I was following the sound and I was moving in slow motion and I turn around and saw myself still lying in the bed sleep. But the sound is talking to me to come, so I keep walking toward the bedroom window and when I look out the window, there it was again a round disc. How do one go and get help to find out what happen to me."],"Latitude":"38.145348","Region":"Kentucky","Longitude":"-85.858297","files":["/var/www/straped/mufon/html2text/20644.html.txt","/var/www/straped/mufon/org/20644.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.145348,+-85.858297(20644)&iwloc=A&hl=en\"> mufon case (20644) map </A>","Viewing Distance":"21-100 Feet","Case Number":"20644","Date of the Event":"09/30/1975 12:00 UTC","Summary":"It was (3) round disc shape, one disc that lead the other two, one on each side of the large disc.","Log Number":"US-11212009-0014","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around September 30th 1975"],"Country":"United States","Weather Factors":"Does Not Apply","City":"Louisville","Object Shape":"Circle","Disposition":"Unknown","Source":"MUFON","Tags":"City","Date Submitted":"11/21/2009 08:01 UTC"}