{"Viewing Distance":"Unknown","trends":["There have been 8 other sightings in New Castle","There were no other sightings in New Castle on or around November 21st 2009"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Region":"Pennsylvania","Tags":"City","Date of the Event":"11/21/2009 12:00 UTC","Date Submitted":"11/21/2009 07:48 UTC","Log Number":"US-11212009-0013","Longitude":"-80.337569","divs":["sighting detailsi went to look out my living room window around 6:59 pm and noticed a single sphere of brilliant orange\\yellow light in the sky behind a tree in the side yard. it caught my eye because i thought it was possibly a helicopter or plane, our home over looks the city to be exact. the object moved swift at first but then slowed and seemed to stay in its position. all of a sudden another brilliant source of light caught my attention, it was another sphere arriving from the exact location of the first only it flared and was very bright once it appeared. it drifted up near the first object and then another appeared from the same location. i thought it was all i'd see until out in the distance another sphere. this one glowed even brighter it too followed the exact path as the other three. they seemed to be waiting for each other at times. for each would hover until the next appeared and then move higher into the sky. i was totally shocked to witness these objects continue to appear as they did. my parents were also shocked as they were witness to the event. even a neighbor stood in his lawn watching the spheres. we finally lost sight of the formation as they flew into heavy cloud cover. after i saw them i continued to watch out my window hoping more would appear. i'd never seen anything like that so near a well lit city before."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.007242,+-80.337569(20643)&iwloc=A&hl=en\"> mufon case (20643) map </A>","Latitude":"41.007242","Summary":"Four Yellow Orange Spheres of Bright Light in formation.","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20643.html.txt","/var/www/straped/mufon/org/20643.html"],"Object Features":"Unknown","Case Number":"20643","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Object Shape":"Circle, Sphere","Disposition":"Unknown","City":"New Castle"}