{"Summary":"Triangular shaped object stops suddenly above my car on small stretch of highway.","map":"<A HREF = \"http://maps.google.com/maps?q=37.655349,+-91.534581(20646)&iwloc=A&hl=en\"> mufon case (20646) map </A>","trends":["There have been 11 other sightings in Salem","There was one other sighting in Salem on or around November 22nd 1991"],"Country":"United States","divs":["Sighting DetailsMy cousin and I were traveling east on highway H, when we topped over a hill and noticed an airplane-sized object traveling southward bound, in our direction. Upon first glance, my cousin thought that it was a small prop plane that had run out of fuel and was getting ready to crash. I brought the car we were in, up to about 70 mph to meet with the object to get a better look at it as it passed overhead. As we got closer to it, we noticed that it did not have the same kind of light formation that regular airplanes have. Then suddenly it came to a coplete stop above the road we were on as if it were waiting on us to get closer. I slammed on the brakes and the car slid to a stop almost directly under the object. My drivers side window of my car was down about 5 inches and I still could not hear any trace of sound coming from the craft. In absolute disbelief, we looked up at it only to make out the faint triangular shaped pattern, hidden by the intense glow coming from the three powerful lights that was on the underbelly of the craft. After having set motionless above us for what seemed to be about 3 to 4 minutes, the object moved slowly across the road continueing along its path until it got past the electrical lines on the side of the road. It then stopped again and commenced to turn on its side and lower itself down to the ground. My cousin urged me to take off and leave it, but I could not move out of curiousity. The object was so bright that it lit up the forest that was on the right hand side of the craft. Stopping just 5 feet from the ground, the craft then took off at a high rate of speed and flew off out of sight. I have traveled this road many times since that night in both day and night and have never seen anything like it before or sinse. It has forever changed my life and there is never a moment that I do not think about it. Off of what I saw that night, if that was one of our own government aircraft, there is no dought in my mind that we have already been to Mars and back!"],"Tags":"City","Case Number":"20646","City":"Salem","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20646.html.txt","/var/www/straped/mufon/org/20646.html"],"Sighting Duration":"00:04:00","Date Submitted":"11/21/2009 09:33 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"11/22/1991 10:15 UTC","Source":"MUFON","Latitude":"37.655349","Disposition":"Unknown","Log Number":"US-11212009-0016","Object Shape":"Triangle","Longitude":"-91.534581","Region":"Missouri"}