{"map":"<A HREF = \"http://maps.google.com/maps?q=42.32938,+-72.633601(20641)&iwloc=A&hl=en\"> mufon case (20641) map </A>","Longitude":"-72.633601","Case Number":"20641","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 9 other sightings in Northampton","There were no other sightings in Northampton on or around October 19th 2009"],"Viewing Distance":"Unknown","Region":"Massachusetts","Summary":"Large, loud, low, dark triangle shape with white lights at each corner.","Date of the Event":"10/19/2009 11:30 UTC","Tags":"City","Object Shape":"Triangle","Date Submitted":"11/21/2009 07:02 UTC","files":["/var/www/straped/mufon/html2text/20641.html.txt","/var/www/straped/mufon/org/20641.html"],"Latitude":"42.32938","Sighting Duration":"00:03:00","divs":["Sighting DetailsI was at my computer almost ready to go to bed at about 11:30 pm when I heard what I thought was a REALLY low flying plane nearby. I stopped for a moment and thought to myself that it was way too late to be hearing anything that large, low, and loud fly by. I went back to my email. About two minutes after the sound was gone, I heard the same sound again but louder . . . it was louder than any plane I have ever heard. Now, I live in a very, very small New England town and I know that there are noise ordinances and laws and such and that there is no way anything is \"allowed\" to fly that low through the neighborhood even in the daytime. Curious, I went outside thinking I was going to see a plane crashing to the ground nearby but instead this huge, dark, triangle shaped thing was low in the sky. It was at least 200 feet across each side. There were 1 - 2 bright, round, white lights at each corner. I think one or two of them may have been blinking. The scary part was the sound . . . it was soooo loud I was surprised that the whole town didn't wake up!! It was flying slowly by, between 500 - 1000 feet off of the ground. After about 2 minutes it was gone."],"Log Number":"US-11212009-0011","Country":"United States","Disposition":"Unknown","City":"Northampton"}