{"divs":["Sighting DetailsI was sitting outside in my yard. I turned to look behind me and saw around 6 glowing orange sphere shaped objects traveling in the sky south to southwest toward me. I immediately called my sister across the street telling her to get outside quickly. I went into the street to get a clearer view. There still appeared to be 6 or so of them. When my sister got outside, I was in the process of calling my son to come outside also. It appeared that the 6 were about to pass by before I could get others outside to view them. Then, I saw more coming in the distance from the same direction as the first few. My son and sister came out and witnessed them flying over as well. It became a steady stream of these. I called my mother who lives next to me to come out. She came out and witnessed them. I called the police to ask if anyone could tell me what these things were. The dispatcher said \"No, but I have an officer enroute\". The officer arrived and told me he was watching this stream of objects from another area of our city and could see them miles away. He couldn't tell what they were either. We called the local airport and were told they had nothing on these things. As we watched them coming toward us, they were bright orange. As they started to pass over and move away from us, the light would dim until it went out like the light may have been on one side and as it moved past there was no light on the back. I spotlighted them, and got no reaction from them. But, the spotlight still didn't show what the thing was other than the orange glowing light. We watched the stream until the last one came over and disappeared. We still don't have any idea what they were. No one had a camera that could pick them up. It was a crystal clear sky at the time."],"files":["/var/www/straped/mufon/html2text/20651.html.txt","/var/www/straped/mufon/org/20651.html"],"Tags":"City","Disposition":"IFO","Summary":"stream of orange glowing spheres traveling south/southwest, low altitude, silent. Probably between 100 to 200 spheres","City":"Undisclosed","Object Features":"Undisclosed","Region":"Texas","Log Number":"US-11222009-0001","Case Number":"20651","Object Shape":"Sphere","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-99.899143","Weather Factors":"None, Does Not Apply","Latitude":"31.972969","Date Submitted":"11/22/2009 01:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.972969,+-99.899143(20651)&iwloc=A&hl=en\"> mufon case (20651) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"11/21/2009 09:10 UTC","Object Flight Path":"Undisclosed","trends":[]}