{"Date of the Event":"11/22/2009 12:00 UTC","divs":["Sighting DetailsI live in Forney TX,a small rural area located appromixately 20 miles outside of Dallas, TX. I was arriving home at appromimately 2:15 am. I noticed a large bright light in the sky when I turned on the street to go to my house, it was blocked by trees at the time so I thought it was a star. Upon entering my driveway the light started to change shapes with several lights appearing on the bottom and sides of the object then changed back to a round bright white light. The object then started to move slightly up and down. It then started to fly. It flew directly over my house. It was pretty high in the sky but very visible to the naked eye. It was huge shaped in the form of a triangle with green and either blue or purple horizonatal and vertical lights underneath it. It also looked as if something was spinning underneath it. I had my music up in my car so I turned it down and heard a humming or buzzing noise from the object. I watched the object until I could no longer see it as it dissappeared in the sky. I've seen this light before, in the same area of the sky. but thought it was just a beautiful bright star. I was in such awe and disbelief as the object was moving over my house that I didn't even think to videorecord it with my camera phone. I even called one of the local news stations to inquire if anyone else had reported seeing an object. I am still in total belief at what I wittnessed this morning."],"Country":"United States","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around November 22nd 2009"],"Case Number":"20658","City":"Dallas","Tags":"City","Date Submitted":"11/22/2009 05:20 UTC","Disposition":"Unknown","Log Number":"US-11222009-0008","Region":"Texas","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.809745,+-96.760703(20658)&iwloc=A&hl=en\"> mufon case (20658) map </A>","Latitude":"32.809745","Longitude":"-96.760703","Viewing Distance":"Unknown","Object Shape":"Triangle","Source":"MUFON","Summary":"first appeared as bright white light then changed shapes with several lights appearing on the sides and bottom of the object.","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/20658.html.txt","/var/www/straped/mufon/org/20658.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed"}