{"Log Number":"US-11222009-0009","trends":["There have been 4 other sightings in Anderson","There were no other sightings in Anderson on or around August 25th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.512379,+-82.647483(20659)&iwloc=A&hl=en\"> mufon case (20659) map </A>","City":"Anderson","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsIt was about 5:40pm August 25,2009. I was on a 15 minute break at work. As I was drinking my coffee I felt as something was coming toward me from the right, I looked to my right but nothing and then I just looked up and there it was, it looked to be 80 to 100' long and about 15 to 20' in diameter. It seemed to be glideing not flying. No noise,no windows and no wings, also no sign of any landing gear. I watched it until it went in a cloud. I thought WOW what did I just see and looked back to the right to see where it come from and there it was a second one. I watched it follow the exact same path as the first one until it also disapeared into the cloud. My first thought was some kind of weather balloons, but no these were a piloted craft of some kind and following a flight path of some sort. They were battle ship grey in color and as soon as they entered that cloud thet were invisible. I thought maybe they forgot to turn on their cloud machines.My thought the was I just saw two UFO's and who's going to beleive me."],"Object Features":"None","Source":"MUFON","Disposition":"Unknown","Summary":"I looked up and there they were, two of them about the size of two Greyhound buses put together.","Date of the Event":"08/25/2009 05:40 UTC","Latitude":"34.512379","Tags":"City","Sighting Duration":"00:05:00","Weather Factors":"None","Object Flight Path":"Path with directional change","Case Number":"20659","Object Shape":"Cylinder","Longitude":"-82.647483","Date Submitted":"11/22/2009 05:56 UTC","files":["/var/www/straped/mufon/html2text/20659.html.txt","/var/www/straped/mufon/org/20659.html"],"Region":"South Carolina"}