{"City":"Oklahoma City","files":["/var/www/straped/mufon/html2text/2065.html.txt","/var/www/straped/mufon/org/2065.html"],"Sighting Duration":"00:30:00","divs":["Sighting DetailsI walked outside on the patio with our dogs and I sat in one of the chairs tosmoke. It was a beautiful, cool and calm dayNew Years Day and I looked up to seehow clear the whole sky was. Nearly straight above I saw some white objects andat first thought they were seagulls since I had seen a flock the previous week.But they looked more like lights and there were 3 forming a perfect triangle andone directly below them. I could not see any wing movement, just a steadywhite.They seemed to be very high, higher than most planes I have seen here. Iwatched them for a moment and the 3 moved slowly into an elongated trianglewhile the 4th remained the same distance below. I called a friend on the phonebut she didnt see them she looked up. She lives about 40 blocks south and 1.5miles east My friend inside came out and I had to point them out to her. She sawthem and said they were birds. By this time the 3 had formed a perfect verticalline with the 4th one still the same distance from then. They had moved towardsthe east. The 3 once again moved into a perfect triangle, then an elongated oneand a straight veritcal line with the 4th one moving at the same speed with themto the east. They began to fade and then I couldnt see any of them. I saw twoplanes during this time about 15 minutes but I dont recall anything more thanthey were at a much lower altitude, one traveling NW to SE and one E to W. Ialso saw a few birds at about 300 feet."],"Date of the Event":"01/01/2001 12:00 UTC","Longitude":"-97.511938","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.47315,+-97.511938(2065)&iwloc=A&hl=en\"> mufon case (2065) map </A>","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unknown","Date Submitted":"01/01/0001 01:30 UTC","Case Number":"2065","Object Shape":"Undisclosed","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Region":"Oklahoma","Log Number":"","Latitude":"35.47315","Summary":"white lights in clear daylight","Viewing Distance":"Over One Mile","Country":"United States","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around January 1st 2001"]}