{"Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20652.html.txt","/var/www/straped/mufon/org/20652.html"],"Sighting Duration":"00:00:05","Weather Factors":"Unknown","Object Features":"Unknown","Viewing Distance":"Over One Mile","Country":"United States","Summary":"multiple lights in V formation moving west","Region":"Wyoming","Object Shape":"Chevron","City":"Powell","trends":["There have been 5 other sightings in Powell","There were no other sightings in Powell on or around November 22nd 2009"],"Latitude":"44.753841","Disposition":"Unresolved","Log Number":"US-11222009-0002","Longitude":"-108.757352","divs":["Sighting DetailsI was out side smoking a cigarette facing east when at 1:29 AM i noticed movement to my left so i turned in that direction and seen a group of white lights in a perfect \"V\" pattern moveing due west at a high rate of speed. there was no sound at all and the lights moved as if attached to a solid object. the sighting lasted only 3 to 5 seconds. i lost sight of them when they passed behind a nearby tree. the altitude it was at was close to where comercial airliners are normaly at. i would estimate that the object was 2-3 times the size of a 747 airliner but that is only if my altitude estimate is correct it could of been higher. i have no idea what it was. ive never seen anything like this before. the lights were a perfect formation. they moved like they were conected to a fixed object. you could see the stars in between the lights as it passed through the sky. its a perfectly clear night. there was one light that seemed to bounce between the other lights twords the front or point of the formation at kind of a medium speed. i know what planes look like especialy military aircraft and i have no idea what this was. ive never seen anything move that fast through the sky before at that altitude except for meteors."],"Date of the Event":"11/22/2009 01:29 UTC","Case Number":"20652","map":"<A HREF = \"http://maps.google.com/maps?q=44.753841,+-108.757352(20652)&iwloc=A&hl=en\"> mufon case (20652) map </A>","Tags":"City","Date Submitted":"11/22/2009 04:55 UTC"}