{"Latitude":"46.513889","Disposition":"Unknown","Object Shape":"Diamond","Weather Factors":"Does Not Apply","Tags":"City","Viewing Distance":"Unknown","Longitude":"-87.963333","Date Submitted":"11/22/2009 07:29 UTC","divs":["Sighting DetailsWe were north of Champion Michigan (zip 49814) from Approx Nov 10 to Nov 20, and in the early sky to the SE and left of Orions Belt what appeared to be the Constellation Pleiades (not sure) but left of Orions Belt for sure, and low in the night sky after dark. The backwards shaped 7 (might have been Pleiades) seemed to blink down from top to bottom, when looking through a pair of good binoculars, there was 4 faint stars above it, that would flash and the entire inside shape of the diamond would fill in as if it were all lit up and filled in. As the night sky continued, the object rotated up with the rest of the stars and constellations until around 11 - 12 pm, it would be very high in the sky. We were looking East South East at the time of the initial viewing on the 10th or so. It was there every night, except on the cloudy nights. The cabin is very remote, and there is little if any light pollution so the stars are very visible to the naked eye. This object had no regular pattern to its appearance (the diamond), and didnt appear at specific intervals, only random. It appeared to be a diamond above the backwards 7 (maybe Pleiades). We looked at it for over an hour total on several different occasions. We have been going there for over 20 years, and never seen this \"Diamond Shaped Object\" appear ever before. What is it, and what did we see? Sorry, we have no pictures or video of it."],"Date of the Event":"11/10/2009 10:00 UTC","Object Flight Path":"Stationary","Source":"MUFON","Country":"United States","Log Number":"US-11222009-0016","map":"<A HREF = \"http://maps.google.com/maps?q=46.513889,+-87.963333(20666)&iwloc=A&hl=en\"> mufon case (20666) map </A>","files":["/var/www/straped/mufon/html2text/20666.html.txt","/var/www/straped/mufon/org/20666.html"],"City":"Champion","Case Number":"20666","Region":"Michigan","Sighting Duration":"Undisclosed","Summary":"Diamond Shaped Flashing Light above Pleiades (near) Orions Belt","Object Features":"Unknown","trends":["There have been no other sightings in Champion","This sighting has never been favorited."]}