{"Longitude":"-89.087046","Weather Factors":"Unknown","City":"Gulfport","Log Number":"","Country":"United States","Source":"MUFON","Disposition":"Unknown","Tags":"City","Case Number":"2066","Date Submitted":"01/03/2002 08:00 UTC","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Sighting Duration":"00:05:00","Date of the Event":"01/03/2002 08:00 UTC","Summary":"possible ufo sighting","files":["/var/www/straped/mufon/html2text/2066.html.txt","/var/www/straped/mufon/org/2066.html"],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 8 other sightings in Gulfport","There were no other sightings in Gulfport on or around January 3rd 2002"],"Latitude":"30.37181","Region":"Mississippi","divs":["Sighting DetailsWhen i first saw the object, i was waiting at a bus stop. I was at Wal-Mart, which is next to the airport, so i was watching a plane i thought. It was silver, metallic and the morning sun was reflecting from it. I kept watching it, because i was looking for the wings, i couldnt see them i thought because of the angle of the plane . I watched it for about 5 minutes. I never saw the wings, it wasnt far away , i never heard any plane sounds, i also didnt see anyother aircraft during this time period. It appeared to be floating in a NE direction. I lost sight of it. I was just thinking about it and trying to figure out this puzzle. No sound, no wings, Heading in the direction of my home. After i realized i had seen a ufo pretty sure i got excited and scared. I have seen 5 other ufos, many years ago. They were all at night. This was in broad daylight. My 14 year old son saw an alien in his bedroom last summer. He screamed and was scared to death for months to go to sleep. I had to start praying for him every night to not be scared or see anything else.He said he could see through it. It went out of sight. I felt like it was watching me and going to my house. Afterward, i just couldnt believe it happened. I kept saying to myself I just saw a da ufo. I told some people on the bus about it, someone said, Thats a rod. I just cant get over it, or believe it that it really happened, and wonder what it means, to my life, my sons, or the people in this area. Anna Davis"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.37181,+-89.087046(2066)&iwloc=A&hl=en\"> mufon case (2066) map </A>","Object Shape":"Cylinder"}