{"Summary":"4 amber lights traveling at high speed, East to West","Sighting Duration":"Undisclosed","Date Submitted":"11/22/2009 06:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.395856,+-98.969884(20660)&iwloc=A&hl=en\"> mufon case (20660) map </A>","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/20660.html.txt","/var/www/straped/mufon/more/20660_submitter_file1__11-18-09.jpg","/var/www/straped/mufon/more/20660_submitter_file2__11-18-09-map.jpg","/var/www/straped/mufon/org/20660.html"],"Case Number":"20660","Date of the Event":"11/18/2009 08:05 UTC","trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around November 18th 2009","This sighting has never been favorited.",""],"Log Number":"US-11222009-0010","Weather Factors":"None, Does Not Apply","Disposition":"Unknown","City":"Cisco","Object Features":"Unknown","Longitude":"-98.969884","Latitude":"32.395856","divs":["sighting detailsi was requested to report this sighting, by a local mufon field investigator (teresa turner). 11\\18\\09 20:05 - i was at my home, which is east of breckenridge. i noticed what i thought was a commercial jet flying east to west in same flight path as an earlier plane but noticed the lights did not disappear (flash), like navigational lights. these lights pulsed in sequence. i got my binoculars and saw 4 amber (orange\\white) colored lights in a row, with what appeared to be a smaller light on the bottom of the object near the leading end. the smaller light would flash red, then white. as brightly lit as the object was, i still could not make out a fuselage, tail, or wings. if it were a commercial or military jet, i should seen an outline and would have heard the sound of jet engines, however, there was complete silence. if it had been a helicopter, i doubt i would have heard it(too high, too far away), and at that distance i would have barely seen it, if at all. i ruled out jet aircraft and helicopter. the object appeared to be at an altitude of about 10,000 feet and perhaps 20 miles from my location by my estimate, it was traveling in the vicinity of i-20, heading west. when i first saw the object, it was in the direction of morgan mill, tx, which is to my se. at it's closest, the object was probably slightly north of cisco, tx. i lost sight of object when it simply disappeared in the direction of baird, tx. observation lasted approx. 2 minutes. what this object was, i don't know. for me, it remains 'unidentified'. i have included a depiction of what i saw, along with a map showing flight path of object."],"Region":"Texas","Object Shape":"Sphere, Other","Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile"}