{"divs":["sighting details i filed my last report nov 18,2009. that same night i was tucking my son into bed and looked out his window, which overlooks the connecticut river and mnt. behind it, and saw two bright white lights that were alternating. they were spaced about 6in apart from my point of view. it seemed like they were just hovering over the trees. there was no sound. they then started to move very slowly towards the mountain. as it got further away the two lights went from a horizontal position to vertical before it went out of sight(or just turned off the lights) my son (7yrs old) was very excited to have seen his first ufo. the next one i saw was last night (11\\21\\2009) i only saw it for a brief second while at work. my coworkers and i were outside of the shop that we work at on littleton's main st. our store is facing the connecticut river to the south. it was around 5:00pm when my friend says \"hey what's that?\" we look up and there is a very bright object streaking across the sky just above the building(it was only 1 story high) in front of us. it was very bright and it had a tail that squiggled like a tadpole. the latest experience happened just now at 5:30pm. i was on the porch with my boyfriend when this star-like light came into our line of vision. very slowly it moved from west to east. we thought it was a plane but it didn't blink the lights on and off..and it did not have any red lights. the lights stayed constant until it was out of view..this last sighting makes the fourth i have seen in less than a week. i would be interested to know why there has been such an increase in activity..i will be keeping my camera on me so the next time i see one i can get some evidence."],"Country":"United States","Summary":"I have seen 3 different ufo's since I filed my last report about the glowing orange lights.","Disposition":"IFO","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Case Number":"20661","files":["/var/www/straped/mufon/html2text/20661.html.txt","/var/www/straped/mufon/org/20661.html"],"Region":"New Hampshire","Date Submitted":"11/22/2009 06:01 UTC","Date of the Event":"11/22/2009 05:30 UTC","Log Number":"US-11222009-0010","Viewing Distance":"Unknown","Latitude":"44.316072","map":"<A HREF = \"http://maps.google.com/maps?q=44.316072,+-71.763578(20661)&iwloc=A&hl=en\"> mufon case (20661) map </A>","Object Shape":"Fireball, Star-like, Other, Unknown","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Littleton","There was one other sighting in Littleton on or around November 22nd 2009"],"Longitude":"-71.763578","Source":"MUFON","City":"Littleton"}