{"map":"<A HREF = \"http://maps.google.com/maps?q=25.790399,+-80.221769(20663)&iwloc=A&hl=en\"> mufon case (20663) map </A>","Region":"Florida","Tags":"City","Object Shape":"Flash","Latitude":"25.790399","Disposition":"Insufficient Data","Longitude":"-80.221769","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Case Number":"20663","Date of the Event":"11/19/2009 06:40 UTC","Log Number":"US-11222009-0013","Date Submitted":"11/22/2009 06:14 UTC","Source":"MUFON","divs":["Sighting DetailsNovember 19, 2009 at about 6:40pm I steped out my front door and happened to look up and there they were. It was a clear night and all the stars were visible. Up in the western sky, towards the everglades it appeared that some of \"the stars\" were flashing on and off. When I realized they were all moving together heading north- I realized these were not stars. They were flashing on and off sporatically- almost like camera flashes (that bright and that quickly). I'd say there were over 15 of them flying together in close proximity. It was difficult to count them since they were not visible to the naked eye when they were not flashing . I was able to catch an outline of a couple of them- they seemed to be oval shaped and like a dark grey or gunmetal color. They may have been round and just seemed oval from the my angle. I quickly called my husband and the rest of my family to whitness the event. We were all in awe. We could see commercial planes in the area flying below them, which means they were pretty high up. They were traveling faster than the planes were as well. We wached them until they were out of view, we lost sight of them as they headed north. It was really beautiful, they put on quite a show. It looked like a cluster of glitter in the night sky. They wanted to be seen. For days I've been watching the news and looking through websites and I haven't found anything reports on this sighting- which I find strange. Anyone who would of been driving on Tamiami Trail or even in the Everglades area would of seen it. I hope others come forward as well."],"files":["/var/www/straped/mufon/html2text/20663.html.txt","/var/www/straped/mufon/org/20663.html"],"trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around November 19th 2009"],"City":"Miami","Sighting Duration":"Undisclosed","Summary":"15+ fleet of white/orange flashing ufo's flying in the western skies heading north.","Country":"United States","Weather Factors":"Unknown","Object Features":"Undisclosed"}