{"Log Number":"US-11232009-0006","files":["/var/www/straped/mufon/html2text/20676.html.txt","/var/www/straped/mufon/org/20676.html"],"City":"Rumney","Date of the Event":"11/21/2009 12:00 UTC","Region":"New Hampshire","Weather Factors":"None","Object Shape":"Sphere","trends":["There have been no other sightings in Rumney","This sighting has never been favorited."],"Longitude":"-71.812581","Latitude":"43.805349","Date Submitted":"11/23/2009 10:36 UTC","Country":"United States","divs":["sighting detailstraveling south on stinson lake rd. towards rte. 25, i had just crossed over the bridge that crossed the baker river, traveling at about 25 mph, the sky was dark, except for the sliver of the moon that night, which was directly in front of me, i noticed, to the west a light traveling towards the east (my left to the right). it was much larger than a planet, star, or satellite. it was about the size of my thumbnail at arms length. the light was bright and non-diffuse. at first i thought it must be a plane or other craft, but it was too low. it was descending at about a 20 degree angle. i could just make out the horizon of the nearby mountains. the light was just above that line. the, before it reached that line it simply blinked out. i saw no trail\\tail to the light. i could hear no sound, but i was int he vehicle, so it is unlikely i would have heard much anyway. based on its angle of descent it seemed to be landing. there is no landing area in that direction. the airport is miles in the opposite direction. after it disappeared i drove on a bit more, and pulled into the drive of the stinson mountain grill, and parked. i got out and looked about the sky for a few minutes. i saw nothing else. i wen in the restaurant and asked if other had seen anything unusual, and none had. it may well have a mundane explanation, but what i saw was not easily classified."],"Viewing Distance":"Over One Mile","Sighting Duration":"00:00:10","Case Number":"20676","Tags":"City","Object Features":"Undisclosed","Summary":"Bright descending light spotted over Rumney, NH suddenly dissapears","Object Flight Path":"Straight-line path","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.805349,+-71.812581(20676)&iwloc=A&hl=en\"> mufon case (20676) map </A>","Source":"MUFON"}