{"Region":"Baja California Sur","Case Number":"20673","Object Flight Path":"Undisclosed","Date of the Event":"11/22/2009 07:00 UTC","files":["/var/www/straped/mufon/html2text/20673.html.txt","/var/www/straped/mufon/more/20673_submitter_file1__triangles066.jpg","/var/www/straped/mufon/more/20673_submitter_file2__triangles067.jpg","/var/www/straped/mufon/more/20673_submitter_file3__triangles035.jpg","/var/www/straped/mufon/org/20673.html"],"Latitude":"22.894103","map":"<A HREF = \"http://maps.google.com/maps?q=22.894103,+-109.912097(20673)&iwloc=A&hl=en\"> mufon case (20673) map </A>","Object Shape":"Disc, Sphere, Star-like, Teardrop, Triangle","Disposition":"Unresolved","Viewing Distance":"Unknown","trends":["There have been 10 other sightings in Cabo San Lucas","There were no other sightings in Cabo San Lucas on or around November 22nd 2009","This sighting has never been favorited.",""],"Tags":"City","Source":"MUFON","City":"Cabo San Lucas","Summary":"large strange triangles in the sky","Weather Factors":"Unknown","Country":"Mexico","Object Features":"None, Unknown","Sighting Duration":"04:00:00","Date Submitted":"11/23/2009 05:22 UTC","divs":["Sighting DetailsOk i reported the other day seeing strange orbs in cabo's skiesbut to do i was cleaning the car and i noticed the same lights as that are allways coming back but to my suprise there seem to be alot more bright ones than usually so i got my camera and started take shots in the sky to see what they were it dawned upon me that the orbs look to be part of a bigger craft cloaking itself to appear invisible but i could see them slightly rotating in a fixed position the photos agree with what i was thinking as i took numbers a pics in defferent places in the sky,and everytime until the cloud cover blocked my view the objects were there. There were a few other things that caught my eye while looking at these pics as there seemed to be something scared out from in the palm tree as i took the shot,whem i took the photos my camera was set on long shutter 15secs and i would set it down on something so it wouldn't move at all not even when i touch the button as i also put timer on it took three pics at a time. so look at the palm tree on the left and when you put the sequence together you will see something don't now what, the first thing i notice was a leave move on the top and the rest didn't, the next was in the second of three pics you see faintly a round object and back towards the tree is it leaving from under one of the upper leaves and i notices the leaf looked pushed back but not like it would have been done by wind. so it's a bit worrying to see but i just want to now if there has been any sittings like this anywhere or other pics around or video fotage will have more photos on youtube soon,"],"Longitude":"-109.912097","Log Number":"MX-11232009-0003"}