{"Object Features":"None","Country":"United States","trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around October 23rd 2009"],"Date of the Event":"10/23/2009 08:30 UTC","Latitude":"34.541704","files":["/var/www/straped/mufon/html2text/20677.html.txt","/var/www/straped/mufon/org/20677.html"],"Summary":"fire ball over prescott","map":"<A HREF = \"http://maps.google.com/maps?q=34.541704,+-112.466812(20677)&iwloc=A&hl=en\"> mufon case (20677) map </A>","Longitude":"-112.466812","City":"Prescott","Source":"MUFON","Date Submitted":"11/23/2009 11:11 UTC","Sighting Duration":"Undisclosed","divs":["sighting details i will never look at the sky the same. i was sitting on my deck facing southeast when a briteness caught my attention. there it was half as big as the full moon that nite orangish fireball with orange\\purple tail. tall wasnt very long. object was silent although when i descibe it i wana make a wishing noise. i would at first think asteroid or shooting star but it seemed so close that i would think it would crash to earth if so. i thought it was going to crash as it traveled northeast it seemed to be dropping in altitude. so i jumped up and ran to edge of my deck to see the impact but object just went over horison.it lit the sky up as if it was magnezium burning.it seemed to be moving slower then any kind of meteor or asteroid would who knows.i just know i never seen anything like it some of the other reports seem to be the same object. it never stopped moving while i watched and traveled the whole lenth of sky.as it passed over the mountains in northeast it lit them up not like it shined a lite on them but the same light that caught my attention.wow just cant get it out of my head.thanks maybe soon we will know."],"Object Flight Path":"Other","Viewing Distance":"501 Feet - 1 Mile, Unknown","Weather Factors":"None","Object Shape":"Fireball, Sphere","Case Number":"20677","Tags":"City","Log Number":"US-11232009-0007","Region":"Arizona","Disposition":"Unknown"}