{"Source":"MUFON","Weather Factors":"Unknown","Case Number":"20674","Region":"Pennsylvania","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.339758,+-75.918485(20674)&iwloc=A&hl=en\"> mufon case (20674) map </A>","Longitude":"-75.918485","Tags":"City","Object Features":"Unknown","Date of the Event":"05/30/2008 01:22 UTC","Summary":"Helicopters ? - Although we could not see the out-line.","Object Shape":"Unknown","Disposition":"Unresolved","divs":["sighting detailsin 2008 between may - september 2008, almost every night i would hear a helicopter above caversham\\reading. prior to this video i had taken a photo of one of the helicopters & was shocked by what i saw. on the night i recorded this video on my camera phone i heard one & saw only one set of lights. please rotate footage once to the right. the two orange lights are street lamps. i have been unable to edit or cut this footage & i would say only the first half is of relevance. file 2: date taken: 27th may 2008 time: 1.38 am file 2: is of a photo again of one of the helicopters it was taken from inside my living room & it was literally hovering above my garden. my nieghbour was with me & we turned the light off so to observe what this was. as in the video & photo i call them helicopters because they sounded like helicopters sometimes broken helicopters but i\\we were unable to see any outline of what i\\we could hear, except for in the photo i mentioned first."],"Sighting Duration":"Undisclosed","Date Submitted":"11/23/2009 06:43 UTC","Country":"United States","Log Number":"GB-11232009-0004","files":["/var/www/straped/mufon/html2text/20674.html.txt","/var/www/straped/mufon/more/20674_submitter_file2__june023.JPG","/var/www/straped/mufon/more/20674_submitter_file3__june024.JPG","/var/www/straped/mufon/org/20674.html"],"trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around May 30th 2008","This sighting has never been favorited.",""],"City":"Reading","Latitude":"40.339758","Viewing Distance":"21-100 Feet"}