{"Summary":"Watched 5 Objects travel West to East, about 30 sec intervals only one was leaving a trail","Log Number":"US-11232009-0019","Object Features":"Undisclosed","Viewing Distance":"Unknown","Latitude":"30.228945","City":"Lake Charles","Sighting Duration":"Undisclosed","Longitude":"-93.215006","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around August 14th 2009","This sighting has never been favorited.",""],"Date Submitted":"11/23/2009 11:24 UTC","files":["/var/www/straped/mufon/html2text/20689.html.txt","/var/www/straped/mufon/more/20689_submitter_file1__objectsmoking.jpg","/var/www/straped/mufon/more/20689_submitter_file2__Object1.jpg","/var/www/straped/mufon/more/20689_submitter_file3__object2.jpg","/var/www/straped/mufon/org/20689.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.228945,+-93.215006(20689)&iwloc=A&hl=en\"> mufon case (20689) map </A>","Date of the Event":"08/14/2009 05:15 UTC","divs":["Sighting DetailsIn late August around the 15th I think, I was setting up my telescope around 5 or 5:30 Pm I was looking south just about dusk, waiting for my 3 guide stars to appear when I saw bright object in the southwestern sky, thinking it was the first of my guide stars to appear I watch and looked for the others when I turned back it had it had moved. As it got closer I saw it turn into a red object in the sky with no vapor trail. I didn't think much of this because, I am in the flight path of most commercial air traffic. At first I believed the reflection of the setting sun was reflecting off the shell of the normal air traffic. A few secs later I saw another one just like the first, so I started to watch them as they passed.Same altitude equal distance apart, same shape, same color, same speed. A few secs later another one came in to view except this one was leaving a vapor trail, So I went and Grabbed my Camera and took some Shots; unfortunately, I can work a telescope but could not figure out how to use the video option of the camera. Five object passed at the same speed, same distance, same altitude, same shape and color. From the southwestern sky to the southeast and faded out. Only the one had the vapor trail. I could not get pictures of them in the same shot because they were just out of sight of the wide angle. I don't remember the zoom I used. I see the air traffic everyday and to me this seemed out of the ordinary for the normal air traffic."],"Region":"Louisiana","Object Shape":"Unknown","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Case Number":"20689","Object Flight Path":"Undisclosed"}