{"Weather Factors":"Windy, Light","divs":["Sighting DetailsAfter setting up my Astronomy Equipment and Focusing the Planetary camera on the upper left I started Started Imaging the Moon at 10mm zoom. The Camera produces the same as a 10 mm eyepiece. Using a Celestron 8xi Telescope with Celestron nextimager planetary camera. At 37secs into the footage, an object traveling from the Right side of the screen to the Left. It seemed to follow the curvature of the moon, but in the scope it would have been horizontally reversed. I caught only 10 frames of the object and it took only 1 sec to cross the screen. I tried enhancing the image to see more of what the object was, but the best I could get was to see moon surface detail underneath the object which lead me to believe that this is a shadow of an object. The closes thing I could figure to the object identy was the Luner Recon Probe, but could not confirm nor deny this."],"Object Features":"Appendage(s)","Summary":"While inmaging the Moon, an Object crossed my field of view at a high rate of Speed","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around July 12th 2009","This sighting has never been favorited.",""],"Date Submitted":"11/23/2009 10:19 UTC","Date of the Event":"07/12/2009 12:00 UTC","Tags":"City","City":"Lake Charles","Latitude":"30.232745","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=30.232745,+-93.214846(20686)&iwloc=A&hl=en\"> mufon case (20686) map </A>","Disposition":"IFO","Object Flight Path":"Straight-line path","Source":"MUFON","Country":"United States","Log Number":"US-11232009-0016","files":["/var/www/straped/mufon/html2text/20686.html.txt","/var/www/straped/mufon/more/20686_submitter_file1__Moon3_1__0001.jpg","/var/www/straped/mufon/more/20686_submitter_file2__Moon3_1__0002.jpg","/var/www/straped/mufon/more/20686_submitter_file3__Moon3_1__0003.jpg","/var/www/straped/mufon/org/20686.html"],"Case Number":"20686","Longitude":"-93.214846","Region":"Louisiana","Object Shape":"Unknown","Sighting Duration":"Undisclosed"}