{"Case Number":"20681","trends":["There have been 2 other sightings in Long Island","There were no other sightings in Long Island on or around October 28th 2009"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.797832,+-73.12796(20681)&iwloc=A&hl=en\"> mufon case (20681) map </A>","Date of the Event":"10/28/2009 07:00 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/20681.html.txt","/var/www/straped/mufon/org/20681.html"],"Source":"MUFON","Object Features":"Undisclosed","Latitude":"40.797832","Weather Factors":"None","Log Number":"US-11232009-0011","Country":"United States","Object Shape":"Other","Longitude":"-73.12796","City":"Long Island","divs":["Sighting DetailsThis report is being filed by a MUFON investigator for the witness with his approval to get the information in to the CMS data base. Briefly, the witness and his wife were sitting outside between 6:30 and 7:00 pm just prior to Halloween he believes. He lives on Long Island and was in the military and easily recognizes commercial airlines and airborne objects of all kinds. They spotted an orange pulsing object 10 to 15 miles away up in the sky and watched a commercial plane pass it. The witnesses then watched as this jet did \"a 360 and turned back towards the airport\". The orange object disappeared. Twenty minutes later he spotted it again over near the sound (water) but still as high in the air as the plane had been prior. The airport is 25 miles away, there are no military bases nearby where he feels the government could be testing new crafts. This second sighting was the same orange pulsing object. It moved South to North finally getting smaller and smaller until it was gone. If his arm was held out in front of him and hand open, he could cover up the object. That is all he could think of to tell over the phone at this time."],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Region":"New York","Date Submitted":"11/23/2009 04:54 UTC","Disposition":"IFO","Summary":"Orange pill box shaped object."}