{"files":["/var/www/straped/mufon/html2text/20697.html.txt","/var/www/straped/mufon/org/20697.html"],"divs":["Sighting DetailsBetween 8:00 and 8:10 I was at my house putting up christmas lights when I saw what I thought to be geese flying in a V shape. Realizing it was dark and the geese would have to be glowing I realized it was about fifty lights compact relatively close together in a large V shape. They were rather dim and white but with a slight light green tint to them. They did not blink or strobe but seemed as if they had free will to move as they please while still staying in a V position, much like a bird. I heard no noise whatsoever and it was up about where you would see birds flying. I realized after about ten seconds that what I was seeing was extraordinary. The lights went over my head and I watched it disappear into the horizon. As it went away the shape looked like a strait line as a V would look from the back but and more of a hook on the left side. I don't know how fast it was going, it wasn't going too fast but fast enough that between the time I saw it and it moving into the horizon I would say it took between a minute and a minute and a half. It kept steady pace and did not seem to drop or rise in elevation. I do not claim to have seen a ship or saucer for I saw no metal or frame. All I claim to have seen was lights but as close as it was I should have seen a frame. I was actually not scared but quite excited about what happened. I have never seen a UFO before and would say I am a \"open-minded skeptic\", but what I saw was NOT an airplane, at least not as we know it. It was the weirdest thing I have ever seen. I have searched for other videos or pics or descriptions and haven't seen one quite like this...it was up VERY close and VERY surreal. It felt like I could reach out and touch it."],"Case Number":"20697","Date Submitted":"11/24/2009 05:13 UTC","City":"Lakewood","Source":"MUFON","Summary":"About 50 lights shaped in a slow moving V flying at low altitude.","Region":"Colorado","Date of the Event":"11/22/2009 08:05 UTC","Weather Factors":"Unknown","Latitude":"39.7076","trends":["There have been 39 other sightings in Lakewood","There was one other sighting in Lakewood on or around November 22nd 2009","This sighting has never been favorited.",""],"Tags":"City","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.7076,+-105.072653(20697)&iwloc=A&hl=en\"> mufon case (20697) map </A>","Object Shape":"Other","Country":"United States","Viewing Distance":"20 Feet or Less","Log Number":"US-11242009-0007","Sighting Duration":"00:01:30","Disposition":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","Longitude":"-105.072653"}