{"Weather Factors":"None","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around November 24th 2009"],"Object Features":"Unknown","Disposition":"IFO","Country":"United States","Date Submitted":"11/24/2009 09:10 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Object Shape":"Star-like","divs":["Sighting DetailsI work on the 14th floor of the CNN building in Hollywood. I was getting some water from the fountain when I noticed a bright seemingly stationary object in the western sky, possibly above the ocean. I began to observe the object because I've worked here for a year and have never seen planes in that portion of the sky. One would think that there would be a flight path leading into Los Angeles Int'l there but I truly have never observed planes flying in from that direction. Plus, this object was too high to be a plane on approach (I'd estimate several thousand feet) and there was something about this light that didn't indicate 'airplane' to me. It was just too bright. Shortly after another object appeared to the right of the first. While the initial object was remaining still this one appeared to be moving slowly to the right. Both objects then grew intensely bright before quickly fading out of view. After about 5 minutes the stationary object reappeared in the same location. It sat there again for a few minutes, grew very bright and then quickly faded away. This repeated numerous times over the course of about 45 minutes. The second object wouldn't always appear but when it did it was always in a different portion of the sky. Sometimes it appeared to traverse a great distance in a very short period of time. Twice the objects appeared right next to each other while another time one was above the other and sometimes when only one was visible the other would fade into view as the other faded out. I have been a UFO enthusiast for the majority of my life and have never seen anything I truly believed to be worthy of a UFO claim. Watching these objects I felt completely ecstatic and excited. I should also mention that about a dozen other people I work with observed them too. Something I find fascinating is that they appeared in the portion of the sky where I believe the infamous objects did in 1942 during 'The Battle of Los Angeles'. Also that they seemed to be over the water and near Catalina island which I've read is a USO & UFO hot spot. Anyways, I just wanted to share and hope I'm not the only one! - Zack Whitford P.S. I see someone reported seeing a bright disc in the sky not far from where I am on Nov. 22, two nights ago."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.057054,+-118.234825(20699)&iwloc=A&hl=en\"> mufon case (20699) map </A>","Source":"MUFON","Log Number":"US-11242009-0009","Case Number":"20699","Region":"California","Latitude":"34.057054","files":["/var/www/straped/mufon/html2text/20699.html.txt","/var/www/straped/mufon/org/20699.html"],"City":"Los Angeles","Longitude":"-118.234825","Date of the Event":"11/24/2009 05:00 UTC","Sighting Duration":"Undisclosed","Summary":"Two bright objects, one stationary and one appearing in different spots, appeared intermittently in the western sky.","Viewing Distance":"Over One Mile"}