{"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Summary":"round object, orange in color, with short black protrusions, port and starboard","Longitude":"-94.326066","divs":["Sighting DetailsSome friends and I were at the local airport to observe the shuttle Discovery fly over, on approach to KSC (a rare occurance). We missed the shuttle sighting, though we heard the double sonic booms. We had been seeing commercial airliners fly over all morning (we are near the Butler VOR, and most were leaving contrails and we could hear the jet engines. But about 11:50, I was looking straight UP from the airport grounds, and observed a small orange object with what appeared to be small black protuberances on the port, and starboard sides. It was traveling about twice as fast as a jetliner (from my perspcective), with no noise or contrail. Its apparent size compared to the jets that had been flying over, IF it was at 35,000 feet would have had to be somewhere between 20 and 30' across. It's direction of travel was NW, with no deviation. It was small enough, that I didnt want to take my eyes off of it for fear of losing sight of it, even though I had a video camera on me, I would have had to adjust things to get it in the field of view. Kind of made me mad. My friends with me did not see it, (since it was so small), and because of the NW trajectory, would have been unlikely to be a satelite - most go west to east in some manner. It disapeard in the distance to the Northwest at an elevation of about 45degrees. The protuberances were too small to be wings, so that is a mystery. I had made notes, but misplaced them, and I had forgotten the exact date, till I went to www.spaceflightnow.com to research it... I and my friends are licenced private pilots with various ratings, and I am a self-employed business owner. My overall reaction was - wow - and I was trying to get my friends to get a look at it. It would be nice to have had corroboration."],"Date Submitted":"11/24/2009 10:45 UTC","files":["/var/www/straped/mufon/html2text/20703.html.txt","/var/www/straped/mufon/org/20703.html"],"City":"Butler","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.266185,+-94.326066(20703)&iwloc=A&hl=en\"> mufon case (20703) map </A>","Region":"Missouri","Object Shape":"Circle","Sighting Duration":"00:02:00","Disposition":"Unknown","Latitude":"38.266185","Case Number":"20703","Log Number":"US-11242009-0013","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Date of the Event":"11/07/2007 11:50 UTC","trends":["There have been 3 other sightings in Butler","There were no other sightings in Butler on or around November 7th 2007"]}