{"Date of the Event":"11/24/2009 07:40 UTC","Log Number":"US-11252009-0004","Disposition":"Unknown","Longitude":"-97.013348","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.959129,+-97.013348(20709)&iwloc=A&hl=en\"> mufon case (20709) map </A>","trends":["There have been 2 other sightings in Coppell","There were no other sightings in Coppell on or around November 24th 2009"],"files":["/var/www/straped/mufon/html2text/20709.html.txt","/var/www/straped/mufon/org/20709.html"],"Country":"United States","Object Shape":"Unknown","Summary":"Diagonal formation of lights in the night sky very close together","Case Number":"20709","City":"Coppell","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on my way to work on Tuesday night the twenty forth of November and I was watching the sky as I normally do and it seemed there was much activity this night due to all of the airplanes and normal aircraft I see. I saw at one point a flashing light which did not strike me as an airplane but it was moving spasmodic and moving in very close to what was pretty clear to be an airplane and it seemed that they were so close that they almost ran into each other and one split second I thought they had hit and then it was all ok and they were on their way in opposite directions. I kept watching the sky and as I drew nearer to work I work very near the DFW airport and always see aircraft which I know to be airplanes but tonight there were strange lights in the sky more like spheres, there were about 6 of them flying in and out close to each other and then out again and as I drew near my exit they formed a diagonal line and just hoovered there not moving while other airplanes were flying all around them. I am so surprised that nothing has been reported on TV because these were not your usual aircraft in these skies.. I wanted to stop and take pictures but I do not have a great camera on my phone and could not get a view on them so I drove on thinking I would see them when I got to work but when I got to work I could not see for the trees so I was not sure if they left or what they did. Next time I will be late to work and I plan on buying a really good camera because lately I have seen several sightings in this area... Who knows maybe someone else will speak up on this I know they had to see them however I think because of the abundant aircraft in these parts no one really pays attention to the lights in the sky.."],"Source":"MUFON","Object Features":"Undisclosed","Latitude":"32.959129","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Region":"Texas","Weather Factors":"Unknown","Date Submitted":"11/25/2009 02:59 UTC"}