{"Latitude":"33.20403","Disposition":"Unknown","Sighting Duration":"Undisclosed","Summary":"Cigar Shaped UFO flying east to west over Camp Pendelton","Country":"United States","Log Number":"US-11252009-0010","files":["/var/www/straped/mufon/html2text/20716.html.txt","/var/www/straped/mufon/org/20716.html"],"Tags":"City","Date of the Event":"11/24/2009 02:00 UTC","Case Number":"20716","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around November 24th 2009"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.20403,+-117.376273(20716)&iwloc=A&hl=en\"> mufon case (20716) map </A>","Longitude":"-117.376273","Source":"MUFON","Region":"California","Weather Factors":"Unknown","City":"Oceanside","Date Submitted":"11/25/2009 05:19 UTC","divs":["Sighting DetailsI went out for my afternoon walk. When I got back I was looking up toward the North at Camp Pendelton from Carlsbad. Our subdivision sits high and affords a good view. I thought first I was seeing one of those chemtrail planes we see a lot of. But this was shiny silver, and it had no wings and no tail and no contrail. It was traveling about like a jet liner but in an odd path as that is protected military airspace. You can get shot down for flying over that area. Marine Harriers and helicopters frequent that area. Air traffic in and out of San Diego either comes along the coast over the pacific from Los Angeles, or from the east side of San Diego county over the Salton Sea. It went along at a casual speed and just continued straight out to the Pacific Ocean, which is a very strange flight path. It was at an altitude about like the planes that are about to land, but it was not in an landing angle or trajectory and it had no wings. I estimate its altitude to have been 10-15 thousand feet. It was a very bright clear sunny day yesterday. I would guess its angle to be roughly in a straight line from Fall Brook or Lake Elsinore and over Camp Pendleton. I lost sight of it as went out over the Pacific Ocean. I thought I might be spooked by a UFO. I just found it rather curious and interesting to watch. It didn't seem the least bit concerned about who saw it. I've never seen one before, and certainly didn't expect to see a cigar shaped one. I did not have a camera with me."],"Object Features":"None","Object Shape":"Cigar","Object Flight Path":"Straight-line path"}