{"Source":"MUFON","Weather Factors":"Unknown","Longitude":"-75.192476","map":"<A HREF = \"http://maps.google.com/maps?q=39.950441,+-75.192476(20719)&iwloc=A&hl=en\"> mufon case (20719) map </A>","Date of the Event":"11/25/2009 06:15 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20719.html.txt","/var/www/straped/mufon/org/20719.html"],"Disposition":"IFO","Summary":"Two bright star like lights","Log Number":"US-11252009-0013","Object Features":"Undisclosed","divs":["Sighting DetailsLeft my garage after parking my car. Started down my backyard towards my house and looked up. There was a bright half moon in the sky and what I assumed were stars or planets around it. I stopped to look up as I often do when I noticed one of the two bright \"stars\" to the left of the moon seemed to be moving. My first thought was it must be a satellite. Then I noticed that another of what I took to be a \"star\" also seemed to be moving. That's when I noticed that these two moving lights looked as though they were moving on an axis. The one following the other. They looked as though they must have been attached to some invisible structure. It then struck me that if that were the case, this flying invisible what-ever-it-was must have been HUGE. It was also totally silent. I then started fumbling for my cell phone camera, but by the time I got it out the lights had drifted away to the south east and were almost invisible. I watched as they faded silently away in the direction of some clouds off to the southwest. Then they were gone. I then noticed what I took to be a conventional aircraft with a flashing light passing across the sky from west to east. There was nothing unusual about this light, so I just continued on my way into my house. The object moved slowly and silently from almost directly over my head and off to the southeast. I could not actually see anything attaching the two lights together, but, as I said, they moved as though they were both part of one large unit, that was hidden by the darkness."],"trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around November 25th 2009"],"Tags":"City","Country":"United States","Latitude":"39.950441","Region":"Pennsylvania","Case Number":"20719","Sighting Duration":"00:03:00","Object Shape":"Star-like","Date Submitted":"11/25/2009 07:17 UTC","City":"Philadelphia"}