{"Object Flight Path":"Path with directional change","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-11252009-0009","Region":"California","Latitude":"39.307674","Object Shape":"Chevron","divs":["Sighting DetailsWe live in a very remote area of California called the Lost Coast. When my husband got home from town around 8:30 pm, I went outside to greet him. At that point, I noticed two blinking craft (red, blue and white at this point) at about 40 degrees above the horizon. They were moving slowly south. There was a distant jet engine noise at that point and we were about to dismiss it as unusual proximity for two aircraft--maybe a military maneuver. However, at that point we noticed a third very dim light moving south just above the ridge line. When that plane had moved out of sight, the jet sound vanished but the lights suddenly intensified and became a very bright gold and stopped blinking. At this point for a moment they looked to me like the classic saucer-shape with the bubble on the center, though they were too far away for this shape to be seen clearly throughout the sighting. They turned back north and followed approximately the same flight path that they had flown to the south, one behind the other. They started blinking again and at this point my husband noticed a green blinking light on the right side of each craft. I ran inside to get my camera just in case they came close enough to film, which they never really did. We both grabbed binoculars and tracked the lights north and south along the same flight path for the next 5 + minutes. They were repeating some sort of maneuver and synchronizing their flight paths. There appeared to be at least a dozen lights of various sizes on each craft, sometimes blinking, sometimes solid, color varying from gold to blue and red to green. When they were blinking I thought they looked like they were in a v-shape (though it was hard to tell through my jumpy binocs). They were so bright and glittering, that as we watched them move silently through the sky we began to feel that these were UFO's. At one point the craft on the left had what appeared to be a central bright light that blinked like a regular aircraft light, but then the light blinked much faster, then became solid, then intensified in brightness to a very bright golden white light. At times there were so many lights visible on each craft that they seemed to glitter. We noted that the lights were not arrayed in a way that would indicate horizontal wings perpendicular to a fuselage, but rather a more 'three dimensional' and complex shape to the craft. After several minutes of observing these two craft, a very large conventional aircraft (that clearly made the sound of jet engines) with a blinking red light on each wingtip moved in swiftly from the south and flew directly over us at medium altitude. The aircraft had a very wide wingspan. It banked to the west in the direction of the two craft that at this point were in the northern part of their flight path. The lights on the two craft dimmed and began to move back south. The conventional craft followed at a distance, not really in hot pursuit but maintaining an observational distance. It was apparent that whatever the two UFO craft had been doing was interrupted by the arrival of the conventional aircraft. All three craft went to the south and out of our field of view. To recap, the only time we heard any aircraft noise was at the beginning of the observation (when there was what appeared to be a large commercial craft following a fairly standard path that we have often observed such craft to fly) and at the end, when the large craft moved in to observe what were obviously objects of interest. The rest of the time, we watched the two craft moving in utter silence."],"Date of the Event":"11/24/2009 08:30 UTC","Summary":"Two distant craft with multiple lights flying in formation, doing maneuvers, large conventional craft arrives and they leave area.","City":"Mendocino","Case Number":"20715","Weather Factors":"None","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.307674,+-123.799459(20715)&iwloc=A&hl=en\"> mufon case (20715) map </A>","Date Submitted":"11/25/2009 04:00 UTC","Country":"United States","Longitude":"-123.799459","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20715.html.txt","/var/www/straped/mufon/org/20715.html"],"trends":["There has been one other sighting in Mendocino","There were no other sightings in Mendocino on or around November 24th 2009"],"Object Features":"Unknown"}