{"Object Flight Path":"Path with directional change","Longitude":"-93.130136","Viewing Distance":"501 Feet - 1 Mile","Region":"Arkansas","files":["/var/www/straped/mufon/html2text/20726.html.txt","/var/www/straped/mufon/org/20726.html"],"Object Shape":"Triangle","City":"Russellville","Date of the Event":"11/25/2009 06:31 UTC","Disposition":"Insufficient Data","Summary":"Triangular object (slightly tilted) - multi-colored prism like lightson all corners passed approximately half-mile to a mile in front of us perpendiculary, then made graceful arc back behind tree line","trends":["There have been 3 other sightings in Russellville","There were no other sightings in Russellville on or around November 25th 2009"],"Object Features":"None, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.288077,+-93.130136(20726)&iwloc=A&hl=en\"> mufon case (20726) map </A>","divs":["Sighting Details My daughters (6 years and 4 years) and I were driving on Interstate 40 West (mile marker 84) headed into Russellville when in front of us, maybe a half-mile to a mile, was a triangular shaped object slowly passing over the interstate. I do not remember it coming into view quickly especially since it seemed to be moving so slowly, only that it appeared and my daughters and I all noticed even as I was yelling for them to look. There was a radiant multi-colored prism like light at each of the corners, and a small flashing red light in between the two rear lights. The lights definitely were not those of any aircraft, as they were almost ball like and the rays or the light source itself seemed to have a glowing life or activity about them. The object appeared to be slightly tilted at about 20 degrees but at the moment was not turning, only drifting directly across us. My youngest daughter immediately upon seeing the object asked, \"what is that daddy?\" to which my oldest immediately responded, \"a spaceship!\" I go to grab my phone and notice the craft begin to arc in a horshoe, a slow deliberate curve away. I pull our vehicle over onto the shoulder of the interstate, against the wishes of my oldest daughter, and check my mirrors and wait for a semi to pass to get out. When I look back, it is further away and when I get my cell phone up to snap, it is gone behind the tree line. It didnt zoom away but definitely seemed to speed up somewhat, although its lights never turned from the original direction they were facing, even when pulling the arc away behind the tree line. My heart was pounding, it was so real and intense and obviously not an airplane, or aircraft as we would think of them. I got back in the blazer and we sped to pass the tree line and view the sky openly. When we broke past the curve and saw the sky wide open there was nothing that could explain what we just saw, and upon it seeming to disappear, my daughter inquisitively asked, \"daddy, was it an alien spaceship?\" I hope this helps with anything, and if you need anything else please e-mail me at dyliho@yahoo.com Sincerely, Matthew Dylan Foster"],"Date Submitted":"11/25/2009 10:31 UTC","Tags":"City","Case Number":"20726","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Latitude":"35.288077","Log Number":"US-11252009-0020"}