{"Source":"MUFON","Object Flight Path":"Path with directional change","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around November 25th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.977599,+-87.56606(20723)&iwloc=A&hl=en\"> mufon case (20723) map </A>","Log Number":"US-11252009-0017","Region":"Indiana","Object Shape":"Unknown","Date Submitted":"11/25/2009 08:17 UTC","Latitude":"37.977599","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Disposition":"Unknown","Date of the Event":"11/25/2009 05:20 UTC","divs":["Sighting DetailsFrom my backyard as I approached my shed I looked up and I noticed two bright lights in the sky that were NE part of the sky, moving very slowly-slower than a fixed wing aircraft, no noise -jet or prop was heard. I ran into the house to get a pair of9 x 63 binoculars and I called for my wife to come outside. When I came back outside I was looking for the red, green and white flashing lights that should be on the wings and fuselage. None were visible using the binoculars. No other lights were visible. The objects looked just like 2 extremely bright lights. My wife then looked at them through the binoculars. I asked her if she saw any red, green or other flashing lights. She did not. The objects started to swing to the east and one moved either higher or farther away. Then both either moved behind a cloud bank or just flat disappeared. To size the objects- I know the star constellations that appear around our house at night. The size of these objects would be about half the size of an eraser from a #2 pencil compared to a star in the sky. I went back inside and called 911 and reported it. Commercial aircraft also observed at 35000 ft way above both objects."],"Summary":"Saw 2 brught lights moving slowly south then east","Longitude":"-87.56606","City":"Evansville","Object Features":"Unknown","Case Number":"20723","files":["/var/www/straped/mufon/html2text/20723.html.txt","/var/www/straped/mufon/org/20723.html"],"Tags":"City"}