{"Region":"Pennsylvania","Log Number":"US-11262009-0001","Disposition":"IFO","trends":["There have been 21 other sightings in Greensburg","There was one other sighting in Greensburg on or around November 12th 2009","This sighting has never been favorited.",""],"Object Shape":"Star-like","Object Features":"Patterned Surface","Viewing Distance":"20 Feet or Less, 101-500 Feet","Longitude":"-79.533719","Country":"United States","Latitude":"40.306668","divs":["Sighting DetailsSUBMITTED AGAIN BECAUSE RICH SANDER OF MUFON NEVER INVESTIGATED! THEY NEVER 'STABILIZED' THE VIDEO, THEY NEVER ANALYZED THE VIDEO! I HAD TO DO THAT! UPDATES: -STABILIZED VIDEO WHICH MUFON WASN'T ABLE TO DO -ISOLATED STILL SHOTS (MUFON AGAIN WAS UNABLE TO DO THIS.. DIDN'T HAVE THE RIGHT \"SOFTWARE\" OR EQUIPMENT! SHOWS HOW SCIENTIFIC THEIR \"RESEARCH\" REALLY IS) -TRACED OUTLINES WHERE YOU CAN CLEARLY SEE FIVE-POINTS.. BRIGHT RED STROBING LIGHTS, AND NO BLADES OR PROPELLORS! -MADE A NARRATION VIDEO WHERE YOU CAN SEE SURROUNDING AREAS AND DRAWLING RENDITION OF CRAFT Nov. 12th, 2009 - Original Mufon Case #20533 I was on Rt. 30 WEST going into Greensburg, and while waiting at the intersection by Mountain View Inn, I noticed what appeared to be two birds \"fighting\" each other, or in some kind of squabble, over the highway up ahead. As I drove closer, red blinking lights drew my attention upwards to these \"birds\", which were spinning, rotating, and circling each other. I then drove directly under the objects, and I clearly see that the craft was a five-pointed star-shape when viewed from underneath. Circular-ringed ridges were on the body, emanating from a center dome in the middlr of the craft outward. My very first reaction seeing this was that these were some sort of R.C. airplane, but then it dawned on me that these had flown extremely low in comparison with the tops of nearby trees. I pulled over in the middle of the road next to the dividing barrier, and tried to film what I could as they flew away. Trees and powerlines are somewhat in the way in the film. 1 minute and 30 seconds of film shot, with only about 15 seconds of \"good\" footage of the crafts. The \"backs\" of these crafts had a giant red light fixture, approx. 3 ft in heighth and 6 ft in length, with vertical rows of lights that would flash from side-to-side. As it flew away, the two crafts appeared to fly slightly unstable, wobbling and tilting side-to-side as it flew off. It headed off first South, but then veered in a south-westernly direction, and I attempted to chase it by following road in that general direction, but I never was able to catch another glimpse of them."],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date of the Event":"11/12/2009 04:40 UTC","Summary":"Two seperate \"star-shaped\" objects fly across Rt. 30 in broad daylight!","Tags":"City","Case Number":"20729","Date Submitted":"11/26/2009 12:18 UTC","Source":"MUFON","Weather Factors":"Unknown","City":"Greensburg","files":["/var/www/straped/mufon/html2text/20729.html.txt","/var/www/straped/mufon/more/20729_submitter_file2__ufo_shapes2.jpg","/var/www/straped/mufon/org/20729.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.306668,+-79.533719(20729)&iwloc=A&hl=en\"> mufon case (20729) map </A>"}