{"Tags":"City","Object Shape":"Triangle","Viewing Distance":"Unknown","Case Number":"20734","files":["/var/www/straped/mufon/html2text/20734.html.txt","/var/www/straped/mufon/org/20734.html"],"Date Submitted":"11/26/2009 01:41 UTC","Weather Factors":"Unknown","Region":"Pennsylvania","Longitude":"-76.298934","Summary":"Green triangle","Object Flight Path":"Undisclosed","trends":["There have been 22 other sightings in Lancaster","There were no other sightings in Lancaster on or around July 4th 1999"],"Object Features":"Undisclosed","Log Number":"US-11262009-0006","City":"Lancaster","Latitude":"40.041096","Source":"MUFON","divs":["Sighting DetailsI was at my brother-n-laws house in the country part by millersville collage. Just short of the Susquhanna river. Which surrounds that era. It was the 4th of July 1999.10:15pm after all the fire works were done I noticed what I thought at the time was a stealth fighter, and I thought damn thats pretty low coming from my 10:00 veiw. His yard was pretty large with no fenching at all conjoined to the other yards in the back of his house. I was standing in the middle of the yard alone, cant remember why since I was wit my ex wife and two sons. But they were about 40 ft in back of me has she took pictures on the cam of her family. She is not sure if she caught it on film because she thought nothing of it at the time but she might have, I have talk to her two days ago ask her to check and see. Anyhow I could see it flying slowly erraticly and has it got to my 12:00 it flipped in circles 5 times and changed shapes into a triangle Green in color at times it looked like it had 3 triangle shaped wings into a complete flat triangle, the best veiw I saw was as if it was on its side and a window appeared with 3 nordic looking men in white with blonde hair staring at us as if we were mere cattle. I could see them from the belly up, not sure if they were standing or sitting. They had no apparattus on at all. I never took my eyes off it until it was gone from sight. the main light source was green which lit the craft up sorta lime green, there was a blue and white light also. I heard stories about how ufos make no noise, but this did and it was not loud but it was noticeable.The houses or ground did not shake at all. I am a Army vet so I know what jets can do even a plane at 20,000 ft you hear it quite well, I have had air shows fly over and shake the house alot. even one jet. but this whizzing and whooshing sound was unique. I clocked the speed at about 45 to 50 MPH. perhaps even less. Most people dont get to see craft that close and distinct, I even saw the molding around the windows. I was not blinded by the lights at all, skies were clear starry and it was about 2,000 to 3,000 ft in front of me if I were to walk under it. My son ran to me across the yard and said DAD! was that a ufo? and I said I don't know WTF that was but it aint ours. What gets me is everyone saw it there and there was like almost a hundred people, but young. and They were partying pretty hard and playing games so I guess to them it seemed like nothing. I talked about it for awhile with my kids and my wife but let it black out after awhile. But that image stayed with me and grew over time, and now I live in Canada where Its been bothering me so much and details are getting stronger, I cant get the one guy in the middle staring at me as if he could see me like a calf in the field alone. Its damn near huanting. Lately I have been thinking about getting hypnotised but people say it's a waste of time. I wonder. I also think about the time or if it has anything to do with the time I was working the night shift, 11:00 to 7:00 am left for work and when I approached the steel bridge as always I noticed a small white light which I thought was a reflection from the one street light and the end of the road, but it was not. It was like a probe the size of to beach balls round and all white. as it flew by my windsheild I pulled off to the side of the road but it went down into the wooded trees and so I dared not venture and headed for work. I was not going to say anything to no one, but my boss said with one of my fellow wotkers there that I was 2 hrs late. I leave everyday at the same time and Im never late. But I too let this pass because this never even became a after thought because I have had no nightmares or thoughts about it. I think I would know if I was abducted. the only thing that bothers me is where did the time go and how was I late that day. Its only a 20 minute drive and I left at 10:15 as always."],"Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"07/04/1999 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.041096,+-76.298934(20734)&iwloc=A&hl=en\"> mufon case (20734) map </A>","Disposition":"Unknown"}