{"map":"<A HREF = \"http://maps.google.com/maps?q=40.751212,+-73.903649(20731)&iwloc=A&hl=en\"> mufon case (20731) map </A>","Object Shape":"Fireball, Teardrop, Other","Case Number":"20731","Tags":"City","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 21st 2009"],"files":["/var/www/straped/mufon/html2text/20731.html.txt","/var/www/straped/mufon/org/20731.html"],"Longitude":"-73.903649","Viewing Distance":"Over One Mile","Object Features":"Unknown","City":"New York","Log Number":"US-11262009-0003","Date Submitted":"11/26/2009 02:08 UTC","Weather Factors":"Unknown","Summary":"Low-flying object with blue/orange-like tail of fire moved east-to-west for 10 seconds then simply vanished","Disposition":"Unresolved","Date of the Event":"11/21/2009 05:50 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Object Flight Path":"Straight-line path","divs":["sighting detailsat 5:50pm on saturday, november 21, 2009 in woodside, queens, nyc, i was sitting in my car at a stop light facing north at the intersection of northern blvd. and 49th st., exiting the roof parking lot of the stop & shop shopping plaza. absentmindedly, a moving object in the low horizon of the northeast sky caught my attention. i initially assumed it was another plane leaving laguardia airport but it seemed a bit larger than typical planes. it was moving at normal speed but i was shocked to see it had a tail of blue\\orange fire - making it seem like a horizontal tear drop. my stomach dropped and my gut reaction was: oh no - that's a plane on fire! i followed its path for the next 5-6 seconds until it was due north of my position and it simply vanished! i was stunned and looked around to see if anyone else had seen it - pedestrians or people in cars. no one seemed to have seen it. i immediately wondered if i had seen a meteor or something. i checked the news (online\\print) over the next few days but could not find any mention of the sighting. just thought i would post it here, as i hope to find a possible explanation. i definitely saw something!"],"Latitude":"40.751212","Region":"New York"}