{"Object Flight Path":"Stationary,Other","trends":["There have been 16 other sightings in Niagara Falls","There was one other sighting in Niagara Falls on or around November 23rd 2009","This sighting has never been favorited.",""],"Longitude":"-79.077908","Date Submitted":"11/26/2009 01:37 UTC","Object Shape":"Cigar, Disc, Triangle, Other","Log Number":"CA-11262009-0006","Viewing Distance":"Over One Mile","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.097899,+-79.077908(20735)&iwloc=A&hl=en\"> mufon case (20735) map </A>","Object Features":"Patterned Surface, Unknown","Summary":"THIRD SIGHTING, Bar shaped ufo's, this time, Triangles and Large Disc shape as well","Sighting Duration":"04:00:00","City":"Niagara Falls","Country":"Canada","Region":"Ontario","files":["/var/www/straped/mufon/html2text/20735.html.txt","/var/www/straped/mufon/more/20735_submitter_file2__100_0318.JPG","/var/www/straped/mufon/more/20735_submitter_file3__100_0321.JPG","/var/www/straped/mufon/org/20735.html"],"divs":["sighting detailsmy most spectacular viewing of multiple objects over the niagara falls was november 23rd at 5:55pm when they faded slowly into view. the first time was nov 10th, second time nov 15th and this time november 23rd 2009. this signting lasted 4 hours this time after it faded in and out a few times, and had 1 amazing climax around 7pm with multiple objects of different shapes appearing as pictured! objects included the original 3 bar shaped objects, a couple triangles smaller sized, fainter bars and 1 giant either disc or triangular craft with a blueish\\purple light in the center. these objects were stationary, like rocks, hovering silently, except for when i saw the 3 pars object come down rotating slightly. as the other times, there were 2 main amber glowing orbs and a blue flashing cylinder about 2\\3 up between the 2 orbs. this object has been the exact same shape every time. on the 10th i saw it rise slowly over a 15 minute period, straight up and disappear, then become a dot, zip around with incredible maneuverability and then zip incredibly fast in a se direction toward buffalo. but my 23rd sighting, was too cloudy to see anything like that. this was spectacular, a number of people and i were in contact over the phone from the casino, and a friend of mine arrived to be awe struck by the sighting."],"Case Number":"20735","Date of the Event":"11/23/2009 05:55 UTC","Source":"MUFON","Latitude":"43.097899","Disposition":"Unresolved"}