{"Object Shape":"Teardrop","Country":"Canada","Tags":"City","Date Submitted":"11/26/2009 06:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.660966,+-79.377634(20739)&iwloc=A&hl=en\"> mufon case (20739) map </A>","files":["/var/www/straped/mufon/html2text/20739.html.txt","/var/www/straped/mufon/org/20739.html"],"Region":"Ontario","Log Number":"CA-11262009-0011","Sighting Duration":"Undisclosed","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around April 20th 1994"],"Source":"MUFON","Summary":"Looked like flickering candle flames.Orangish and red.Dances and flickered beautifully","Longitude":"-79.377634","Object Features":"Unknown","Date of the Event":"04/20/1994 06:35 UTC","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Disposition":"Unresolved","divs":["Sighting Details I was heading south on hiway 400 from Woodbridge to Toronto for a hockey game in the city of Etobickoe.Along the highway before the Finch exit cars had pulled off the hiway along the shoulder.People were out of their cars and pointing to the horizon westward. Intrigued i looked to see what people were staring at. Looking westward toward the horizon i saw the flickering candle flames.(What i call it)It was so beautiful.So i also pulled off the hiway.I got out of my car and just enjoyed being mesmerized by the sight. 7 candle like flames perfectly equidistant from each other at staggered altitudes. They looked like aircraft lined for final approach for landing. As a commercial pilot i know they were not Airliners. Although they were north of Pearson International Airport. I stayed for ten minutes and asked some people wittnessing the sighting what they thought.No one answered me.It was so stunning.The candles in the sky stayed frozen at their altitudes stationary without any movemement.They simply flickered.Dancing on the spot if you will. I was late for my hockey game so i decided to rush off to my car.(I feel so dumb now for lacking perspective,i should have stayed longer). As i looked down to find my keys to start my car i heard a big gasp from the crowd along the hiway shoulder. I looked west and the candles were gone. But i then looked up above me and saw perfectly cylindrical clouds. They were uniformed and lined up side by side.It was as if huge pipelines had been laid side by side in the sky.I didnt see the cloud formation being created.Just the completion of it. It to this day it was the most stunning and beautiful thing i have ever witnessed.No fear. Just beauty and wonder at what i had been lucky enough to see."],"Viewing Distance":"Over One Mile","City":"Toronto","Case Number":"20739","Latitude":"43.660966"}