{"Summary":"saw orange sphere in air after fireworks.","Longitude":"-75.96549","Tags":"City","trends":["There have been no other sightings in Shillington","This sighting has never been favorited."],"divs":["Sighting Detailson july 4th 09 in shillington, berks county at about 10 pm at night or about 10 minutes after the fireworks show ended, my friend pointed out a strange orange sphere shaped object in the sky about 100-120feet in the air, many people were looking at it after a minute. it was a perfect sphere, not too high up, at a constant slow-ish speed, moving from the opposite direction of the fireworks display. i fiugre it was the size of an average size excersize ball. it appeared to be full of or made fire. it wasnt the light of a plane or anything. made no noise. did not take any turns or change any speed. im not sure if it was rotating or not. at first i thought it was a firework, but it was too big to be an ember or ash, and it didnt go out. it went in a perfectly straight line west to east ( not sure of the EXACT directs but it went from my left to my right) We watched it for about 5 minutes until we were unable to see it anymore, it was too far away and behind buildings. i was very interested in the object and watched it the entire time i saw. my group of friends were all too much in awe to think to get out their phones and take a picture or video. im not sure if anyone else in the crowd took a video"],"Object Flight Path":"Undisclosed","Sighting Duration":"00:05:30","Case Number":"20738","Date of the Event":"07/04/2009 10:15 UTC","Object Features":"Undisclosed","City":"Shillington","Log Number":"US-11262009-0009","Object Shape":"Sphere","Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.30787,+-75.96549(20738)&iwloc=A&hl=en\"> mufon case (20738) map </A>","Country":"United States","Disposition":"Unknown","Date Submitted":"11/26/2009 04:41 UTC","Source":"MUFON","Latitude":"40.30787","files":["/var/www/straped/mufon/html2text/20738.html.txt","/var/www/straped/mufon/org/20738.html"]}