{"Case Number":"20732","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Star-like","Latitude":"39.416479","Weather Factors":"Unknown","Date Submitted":"11/26/2009 03:41 UTC","Object Features":"None","Summary":"Two Red-Orange Dots, Medium Brightness, Followed By Chase Plane.","trends":["There have been 16 other sightings in Frederick","There were no other sightings in Frederick on or around November 6th 2009"],"Disposition":"Unknown","City":"Frederick","map":"<A HREF = \"http://maps.google.com/maps?q=39.416479,+-77.401631(20732)&iwloc=A&hl=en\"> mufon case (20732) map </A>","Object Flight Path":"Straight-line path","Longitude":"-77.401631","Date of the Event":"11/06/2009 09:30 UTC","Country":"United States","divs":["sighting detailsi live in frederick, maryland, a small city in western maryland about an hour away from both washington d.c. and baltimore. on the night of friday november 6th, 2009, my family and i were crossing a friends' darkened back yard on the way to our car parked in the alley behind their house. we were on east 5th street, in downtown frederick. i heard the sound of a \"military\" jet engine up in the sky. it sounded like a single f-16. i searched the sky for it. i found the plane; every strobe and beacon was lit up on it. it was chasing a pair of red-orange \"dots\". the dots were not particularly very bright. they appeared \"flat\". they did not twinkle. they remained consistent in both brightness (intensity), size and color. one dot followed the other, horizontally. the dots were headed in a southerly direction, the \"f-16\" appeared to be keeping pace, but was unable to close on the two dots. they were just west and above of my location, (initially) about 60-70 degrees up from the horizon. distance and altitude unknown\\ unascertainable. i watched until the view became obstructed by neighboring structures to the south-west. the whole thing lasted about two minutes. the skies were clear, and dark blue. stars were visible. i don't remember moon phase, but it may have been low, to the east. this area of the country has many busy air corridors, as well as many restricted air-spaces. civilian aircraft are often escorted away from these areas by military jets. the local ang sqaudrons fly the f-16 \"viper\". at first, i thought a civilian airplane had wandered over camp david, the presidential retreat located nearby, and had triggered a persuit. it was when i noticed the speed at which these objects were flying that i decided this was no ordinary interception. i've seen a pair of f-16s struggling to remain in the air as they had escorted a slow, prop driven civilian aircraft in the past. they had to fly in large circles around the much slower offending aircraft to keep their speed up, or they will stall out of the sky. the interceptor plane on this night was keeping up with the fast moving dots. i don't know if the f-16 was in \"burner\"- i did not see a bright exhaust cone. the rumble in the sky came from the f-16 only. shortly after i lost view of the persuit, the chase plane must have throttled back, because the rumble dropped off dramatically. i'm aware there may be several explanations to what i saw. the \"dots\" may have been just another jet with its beacons off, etc...but..... i want to believe!"],"Region":"Maryland","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20732.html.txt","/var/www/straped/mufon/org/20732.html"],"Tags":"City","Sighting Duration":"00:02:30","Log Number":"US-11262009-0004"}