{"Summary":"my sighting in edmond oklahoma","Object Features":"Other","Object Shape":"Disc","Case Number":"2073","Viewing Distance":"101-500 Feet","Longitude":"-97.478095","Date Submitted":"11/30/1995 12:00 UTC","Date of the Event":"11/30/1995 12:00 UTC","divs":["Sighting DetailsI was just leaving my girlfriends house in a suburban neighborhood in my hometown. I was getting onto my motorcycle getting ready to start it. I looked upfrom the instrument panel momentarily and saw it. i was at the top of a hill soit was at eye level. I was not sure what it was. I just stared at it as it sovery silently hovered there. then it tilted forward about 90 degrees and then iheard an almost mechanical sound as it tilted and also a light or beam of somesort was focused on a fixed spot on the ground. after tilting it became silentonce more and hovered with its lightbeam still shining. then it tilted back 90degrees to its origional position once again making a similar but not the samesound as before and the light was turned off. it hovered there for about 15 moreseconds. then suddenly I saw the fastest moving object i have ever seen in mylife shoot directly upwards with instantanious velocity. during this there was asound of rushing of wind that kind of whistled like a firework. Well the wholetime there was a woman next door working in her yard who had obviously seen theobject too, we where approxomatley 8 feet from each other. we looked at eachother with that blank shocked look on our faces. then she said, It was probablya helicopter. I replied, Yeah probably a helicopter, I then started mymotorcycle and went home."],"Log Number":"","City":"Edmond","files":["/var/www/straped/mufon/html2text/2073.html.txt","/var/www/straped/mufon/org/2073.html"],"Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.652832,+-97.478095(2073)&iwloc=A&hl=en\"> mufon case (2073) map </A>","Country":"United States","trends":["There have been 16 other sightings in Edmond","There were no other sightings in Edmond on or around November 30th 1995"],"Weather Factors":"Unknown","Latitude":"35.652832","Disposition":"Unknown","Object Flight Path":"Stationary,Other,Unknown","Tags":"City","Source":"MUFON","Region":"Oklahoma"}