{"Case Number":"20745","Latitude":"40.698589","files":["/var/www/straped/mufon/html2text/20745.html.txt","/var/www/straped/mufon/more/20745_submitter_file1__20091124(4).JPG","/var/www/straped/mufon/org/20745.html"],"Date of the Event":"11/24/2009 07:48 UTC","Tags":"City","Viewing Distance":"Unknown","Country":"United States","Object Features":"Undisclosed","Date Submitted":"11/26/2009 08:33 UTC","trends":["There have been 7 other sightings in Peoria","There were no other sightings in Peoria on or around November 24th 2009","This sighting has never been favorited.",""],"Log Number":"US-11262009-0017","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=40.698589,+-89.580946(20745)&iwloc=A&hl=en\"> mufon case (20745) map </A>","City":"Peoria","Object Shape":"Disc","Weather Factors":"Unknown","Longitude":"-89.580946","Summary":"Oval disc with two round lights under shown above quite close and long time.","divs":["Sighting DetailsI was driving SW Washington Street in Peoria, IL. I saw it while I was slowly driving 800m from Mc Arthur Highway till I reach State Street. First, I found a plane looking thing flying above in front of me through my car window. I started thinking weird and looked at it again because it had different looking from the plane, had round two lights in front and back of its underneath. I kept on driving, slowed down and looked at it again and found out that it did not have wings and it was flat like a disc!! I could ot believe that I am looking at a UFO and I kept on driving and looking at it. It was flying slowly from my left to right. I thought it was gone but it stopped there and stayed above my front right sky for a while! I wanted to take a photo but I couldn't beause I was driving. It seemed like totally free from gravity. I found some spot to park and then it moved quickly zigzag, and then flew to my left front sky, and it disappeared. After that, 3minutes later a helicopter came, made a loud noise even it was higher than that UFO. UFO did not make any sound at all. It was oval, tatolly flat. Black bottom with two yellow lights with some red line, one in front and one at back but I cannot tell which is front because it moved any ways."]}