{"Summary":"we saw a bommerang shaped ship hover than leave si","Tags":"City","Date of the Event":"01/10/0001 06:40 UTC","files":["/var/www/straped/mufon/html2text/2074.html.txt","/var/www/straped/mufon/org/2074.html"],"Latitude":"44.934235","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Object Shape":"Boomerang","Log Number":"","Longitude":"-68.645309","Region":"Maine","City":"Old Town","Date Submitted":"01/10/0001 06:40 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.934235,+-68.645309(2074)&iwloc=A&hl=en\"> mufon case (2074) map </A>","Disposition":"Unknown","Sighting Duration":"00:05:00","trends":["There have been 2 other sightings in Old Town","There were no other sightings in Old Town on or around January 8th 0001"],"Country":"United States","Object Features":"Other","divs":["Sighting Detailsi have always ben extreamly sceptical about everything but after tonight i cannot overlook how evedent it is that tair are ufos out thair. wether govermentexperiment ships or extre tarestrials. me and my girl friend wer driving downthe road when i knoticed 3 lights brighter thain car lights in the sky. ipointed them out to her and she wondered what they wer becouse thair wer notowers in that town that would explain for the lights. we pulled over in frontof this big catholic church and it was a boomerang shaped ship hovering over thechurch. it had 3 lights on it one at each end of it and one on the tip of the v.the ship took off as soon as we pulled over and headid in the direction we hadcome. it traveled very slowly at first and gradually speedid up. we triedfollowing it but it eventually got so fast that it was gone in a short wile. theship traveled in the direction that its v shapet point was pointing and thairwas no body. like just the wings of a plain. it was only aobut 200 yards abovethe ground and never got any higher as far as we could see. we could both makeout its shape and 2 other lights that blinked withch wer mutch smaller and werread and blue. the reason we are shure it was a ufo or a govermential thing isbecouse it made absolutly no sound at all. wile it hovered and as it took off itwas compleatly quiet. this was real and if amyone has seen anything like it iwould love to hear about it. my aim sn is oooadamstadeooo"],"Source":"MUFON","Case Number":"2074"}