{"Sighting Duration":"00:05:00","City":"Bradley","Disposition":"Insufficient Data","Summary":"looked like fire in the sky","Region":"Illinois","divs":["Sighting DetailsThis is not a joke. My girlfriend was driving us to the movies lastnight on november 25 2009. We were west bound on 4000 a few miles or so from route 50 in bradly,Il. We were on our way to see the fourth kind and thats why I said this aint a joke. Any way as we travled down 4000 directed west she pointed out to me in the north west sky what appeared to be fire. The blaze appeared to be out of control burning high into the sky for the distance we saw it from. A tree line momentarly obstructed our view but then we saw it again and as we drew closer the flames only appeared to be lights verticle lights with a strange redish orange glow inside them that also illuminated around them. At this point we were just talking how we no longer see a fire just this stack of lights and we only travled a few miles from our first view and it was directly north of us at this point. There were lights on the ground but I thought it was a small subdividion or something. I could night specifically describe any real structures to you because it was very dark and cloudy last night. Well at this point we were pulling into the movie theater lot. We just decided to see the movie still wondering what we just saw. When we left the movie we noticed there really isn't any houses in that field or tall building with lights or anything at all. There is a wal-mart and other stores to the left but we were not looking in the that direction. I went by there again today in the light and the field is a gulf course and then farm no houses or barns for miles nothing that could have made flames that high if they were flames but by judging the color of that stack of lights that was verticle maybe in a distance could have appeared to be fire in the sky? Me and my girlfriend were in the car again today and agree there is nothing in that area that could explain what we saw. I asked her if she saw the movie fire in the sky because I did not see it yet! I said did anything appear as fire in that movie and she told me only at a distance because of the color of the lights on the ufo in that movie but you wouldn't be able to convince me or her we didin't see a sighting."],"Tags":"City","Object Shape":"Other","Weather Factors":"Windy, Fog, Rain","Object Features":"Unknown","Country":"United States","Source":"MUFON","Date of the Event":"11/25/2009 09:35 UTC","trends":["There has been one other sighting in Bradley","There were no other sightings in Bradley on or around November 25th 2009"],"files":["/var/www/straped/mufon/html2text/20742.html.txt","/var/www/straped/mufon/org/20742.html"],"Latitude":"41.141977","map":"<A HREF = \"http://maps.google.com/maps?q=41.141977,+-87.861154(20742)&iwloc=A&hl=en\"> mufon case (20742) map </A>","Case Number":"20742","Longitude":"-87.861154","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Unknown","Log Number":"US-11262009-0014","Date Submitted":"11/26/2009 07:20 UTC"}