{"Log Number":"US-11262009-0015","files":["/var/www/straped/mufon/html2text/20743.html.txt","/var/www/straped/mufon/org/20743.html"],"Date of the Event":"11/26/2009 06:20 UTC","Weather Factors":"Does Not Apply","Country":"United States","Tags":"City","Latitude":"40.75877","Case Number":"20743","Object Shape":"Star-like","Longitude":"-95.375603","Summary":"Two star-like lights moving together from N. W. to S. E.","trends":["There have been 4 other sightings in Shenandoah","There were no other sightings in Shenandoah on or around November 26th 2009"],"Viewing Distance":"Unknown","City":"Shenandoah","Date Submitted":"11/26/2009 07:55 UTC","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=40.75877,+-95.375603(20743)&iwloc=A&hl=en\"> mufon case (20743) map </A>","divs":["Sighting DetailsOn Thanksgiving night a little after 6 p.m,I took the garbarge out and noticed how clear the sky was, a half-moon and a few stars. Going back to the house I looked straight up and noticed two stars, or what I thought were stars. But as I watched more closely it was obvious they were moving to the Southeast. I went in the house and told my wife to go see the lights while I grabbed the video camera. I would guess their altitude to be about 2000 to 5000 ft., although there was nothing to compare the lights with to judge a more correct distance. There was quite a lot of distance between both objects. The lead light was much brighter than the one following. Since it was dark we couldn't tell if there was anything connecting them. The lights were a solid white & not blinking. The sighting lasted about two minutes. Since this sighting I've looked at other Mufon reports and found several reporting the same type thing, only a day earlier and traveling in different directions. The video isn't good enough (too shaky) to put online but very similar to descriptions given in Mufon reports 20718, 20719 and 20720."],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Object Features":"None","Disposition":"IFO","Source":"MUFON"}