{"Region":"Pennsylvania","Tags":"City","Log Number":"US-11262009-0019","Date of the Event":"11/26/2009 09:30 UTC","Object Features":"Unknown","Case Number":"20747","City":"West Chester","map":"<A HREF = \"http://maps.google.com/maps?q=39.962154,+-75.601018(20747)&iwloc=A&hl=en\"> mufon case (20747) map </A>","Longitude":"-75.601018","Date Submitted":"11/26/2009 10:45 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/20747.html.txt","/var/www/straped/mufon/org/20747.html"],"Object Flight Path":"Straight-line path","Summary":"12 to 14 objects with red lights making no sound traveled east to west.","Disposition":"Unknown","Latitude":"39.962154","Object Shape":"Circle, Triangle, Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 10 other sightings in West Chester","There were no other sightings in West Chester on or around November 26th 2009"],"Source":"MUFON","divs":["Sighting DetailsMy wife and I were walking our dog on the 100 block of Price Street in West Chester when we noticed something overhead in the dark sky glowing red with no blinking of lights and not making a sound. We asked each other, what's that, and then another one quickly followed then another and another and another until there were 10 in formation. They floated over head and up into a dark sky up ahead behind clouds that were illuminated by the moon. After that we were in awe, wondering what we just saw with our eyes glued to sky in amazement. We finally started moving up the block on our walk when coming from the same direction, another one floated towards us and then another and then two more which seemed to be more propelled and moving faster. We were oohing and ahhing and feeling like we should knock on someone's door to come out and see this. But it happened so fast and we were unable to take our eyes off them until they veered upwards towards the clouds and the moon and disappeared out of site. Again we just stood there trying to imagine if these were hot air balloons, sattelites, GPS, Google Earth cameras or what. We started moving down the block when our dog saw one of his friends who was on his porch with his humans who were saying good bye to each other after a Thanksgiving dinner together. We told the group about what we just saw and lo and behold to validate the story, over the top of her house, another one floated overhead. All of them were the same. Silent, red lights, surrounded by a lighter white ring not further than 1500-3000 feet, no sound, no blinking like aircraft. We thought maybe they were balloons but why would anyone fly balloons at night and that many of them all lit up. I work in the aerospace industry. It was not an aircraft. It could have been a balloon but why at night, why glowing red, why a couple of them seemed to travel faster than the others like it was propelled by something."]}