{"Date of the Event":"11/26/2009 06:15 UTC","trends":["There have been 6 other sightings in Anoka","There were no other sightings in Anoka on or around November 26th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Summary":"three amber color lights in a triangular formation hovering over the Mississippi river in Anoka, MN","Weather Factors":"Unknown","Sighting Duration":"00:10:00","Viewing Distance":"101-500 Feet","Object Features":"None, Unknown","Latitude":"45.200103","Date Submitted":"11/27/2009 10:39 UTC","Region":"Minnesota","Disposition":"Unknown","City":"Anoka","Source":"MUFON","Country":"United States","Case Number":"20755","Longitude":"-93.377476","Object Shape":"Triangle, Unknown","files":["/var/www/straped/mufon/html2text/20755.html.txt","/var/www/straped/mufon/more/20755_submitter_file1__IMG_1252.JPG","/var/www/straped/mufon/org/20755.html"],"Log Number":"US-11272009-0005","Tags":"City","divs":["Sighting DetailsMy father-in-law and I were headed north on 169, coming from Crystal, MN. going to Andover, MN. Right as we crossed the bridge over the Mississippi River in Anoka, my father-in-law looked out the right passenger side window and noticed what he thought were a few helicopters. I looked over but had to be careful because I was driving, there were three amber lights hovering in a triangular formation. As we looked closer, we noticed this triangle slowly rotating and ascending slightly. The longer we watched, the more we realized these weren't helicopters so we decided to pull off into a side road to get a closer look. As we got out of the car, the bottom two lights descended behind a building, that's when I took out my iPhone and took a picture (see attached). It's not a very impressive photo but it may give things a little context. A couple minutes later, the visible light began ascending, flickering and then slowly faded until it was gone. I've been wondering if they were flares but flares don't maintain a triangular formation, and hover and ascend. It was extremely surreal when we were looking at these lights, it all happened so quickly. Only after the fact, the reality began to set in. I honestly can think of any natural or man-made explanation for what we saw. I'm open to any honest attempts to try and explain what these were."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.200103,+-93.377476(20755)&iwloc=A&hl=en\"> mufon case (20755) map </A>"}