{"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-77.478442","files":["/var/www/straped/mufon/html2text/20758.html.txt","/var/www/straped/mufon/org/20758.html"],"Object Features":"Undisclosed","Sighting Duration":"00:05:00","Disposition":"Unknown","trends":["There have been 11 other sightings in Ashburn","There were no other sightings in Ashburn on or around November 17th 2009"],"Log Number":"US-11272009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=39.048917,+-77.478442(20758)&iwloc=A&hl=en\"> mufon case (20758) map </A>","Region":"Virginia","Latitude":"39.048917","Source":"MUFON","Object Shape":"Diamond","Summary":"Spotted a diamond shaped UFO with a single row of lights.","Case Number":"20758","Tags":"City","Viewing Distance":"Unknown","City":"Ashburn","divs":["sighting detailson 11\\17\\2009 i was traveling home from work around 10:30 pm. i was traveling west on a double lane road which had the typical late night traffic. a car flashed his high beams at me and i automatically assumed, \"ok a police officer is up ahead.\" as i traveled down the road further, i saw a light up in the sky. at this point, i was about a mile to two miles away from this light. initially, i thought it was a helicopter because there was a light that kept flashing around (similar to a spot light on the front of a helicopter). the road i was traveling on turned into a single lane road and was much more rural at this point. i was only about half a mile away from whatever was in the sky, when i came to the conclusion there was no way it was a helicopter. i came to a complete stop, rolled down my windows, turned off the radio, and observed. at this point it became even more evident that my sighting was not a helicopter, small plane, weather balloon, or anything like that. while i was stopped this object passed me going no more than 10 miles per hour about one hundred feet to my left over an open field and no more than two hundred feet above the ground. it had one row of lights that illuminated from front to back one at a time. in addition to it being dark out, the sky was filled with clouds, so i i could not use the moon's light as an aid to figure out the definite shape of the craft. from what i gathered by the illumination of the light, it was a diamond shaped object. i watched for another twenty seconds while it seemed to float across the air. i started to drive off again when two more cars came behind me. i looked in my rear-view mirror to see their reactions. they as well, had come to a complete stop to observe."],"Date of the Event":"11/17/2009 10:30 UTC","Date Submitted":"11/27/2009 12:01 UTC","Country":"United States"}