{"Case Number":"20750","Country":"United States","trends":["There have been no other sightings in Bucyrus","This sighting has never been favorited."],"divs":["Sighting DetailsI was fishing at night when I saw 4 lights low in the sky. From right to left there were 2 bright white round lights then an reddish orange light and then another white light. My first impression was the 2 white lights were square and radiating out making them look round and appeared to be on the backside of something. The reddish orange light had straight sides and round at the bottom and was going on and off. The other white light also had straight sides and a round bottom. It also came on and off and was very bright. The lights moved slowly from right to left in front of me and appeared to be moving away from me. There was no sound that I could hear till it got directly in front of me. It was a very deep hum. Once it was a little past my center line I couldn't hear the hum anymore. Also the white light the was going on and off, reflected off the water. The light must have been very bright because the edges of the reflection were straight in the water. As the lights moved across in front of me all 4 lights now appeared to be in a straight line. Also I didn't see what the lights were attached to. As the the lights moved away from me I went back to fishing. All I can say is if the 2 round white lights were landing lights, then it was flying backwards."],"Weather Factors":"Unknown","Region":"Ohio","Disposition":"Insufficient Data","Summary":"2 white lights, 1 reddish orange light, 1 different white light.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20750.html.txt","/var/www/straped/mufon/org/20750.html"],"Date Submitted":"11/26/2009 11:49 UTC","Log Number":"US-11262009-0022","map":"<A HREF = \"http://maps.google.com/maps?q=40.808391,+-82.975465(20750)&iwloc=A&hl=en\"> mufon case (20750) map </A>","Longitude":"-82.975465","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Unknown","City":"Bucyrus","Object Features":"Undisclosed","Latitude":"40.808391","Object Flight Path":"Straight-line path","Date of the Event":"09/01/2009 12:00 UTC","Viewing Distance":"Unknown"}