{"Date of the Event":"09/25/2009 10:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","City":"Eugene","Longitude":"-123.078104","Sighting Duration":"Undisclosed","Latitude":"44.061689","files":["/var/www/straped/mufon/html2text/20765.html.txt","/var/www/straped/mufon/org/20765.html"],"Source":"MUFON","Object Shape":"Flash, Unknown","Region":"Oregon","Date Submitted":"11/27/2009 11:04 UTC","divs":["Sighting DetailsI am able to remember most of what happened a month and a half ago clearly without hypnotherapy(but because of the events that took place I can see how it could be useful: for bringing back memories). In the beginning of this event I was wearing a quartz necklace with a dragon given to me by my brother. It was explained to me that there is an eternal everlasting soul, and that god was becomming very angry with me and other people because of the lack of affection(the mood control was actually explained to me this day). That night a star or an object shot some thing blue down in to our yard two or three feet in front of our house. This blue light didn't move or disturb the ground at all when it hit. This event was followed by me getting on facebook.com to send a friend a message, but then I started hearing chanting. The chanting started a time in my life I'll never forget, because either I had completely lost my mind, or there were some very strong forces at work. The force chanted some ones name over and over, and they changed that someones name totally around the next morning on facebook.com. The forces claimed that they were very strong witches, and that they had the ability to control peoples moods. Not only that, but they aren't just saying things in songs. My mom and I came to a self-diagnoses of either schizophrenia, or narcelepsy (a sleep problem in which you see two kinds of hallucinations hypnogogic and some other sort). I had been taking supplements DHEA, pregnenolone, creatine, pantothenic acid, piracetam and royal jelly while the climax of these events took place. I wanted everything that was happening to stop, and I hoped it was happening, because the supplements I was taking, and that it would slowly fade with time. The television shows started getting weird, and by weird I mean I could remember them except the memories were new, and I could remember other memories, but it was as if they had been supressed, or that I had forgotten them, but all of a sudden they were there. Two years before this all had started happening I was heavy in to marijuana, and I had experimented with ayahuasca and psilosybin mushrooms. But during this whole event I had not taken any drugs or alcohol. In fact I had not taken any thing for about 2 years. Leading to this event I had performed meditation rituals in which i lined different stones according to my Chakra centers. After I had lined all the stones up according the the centers I had a very realistic dream that some force was holding me down just along the left side of our house. The dream was so real that I screamed for someone to help me up. Now I'll snap you back to the actual event with me. Some morning after the chanting I woke up and saw snakes crawling around a figure like medusa, a blue mist of some kind shadowed in my eyes when the image(or hallucination) left me. The force claimed to be Lucifer Star of the Morning, and explained to me that he or (s)he had been around an AEON! Aliens, Demons, or angels? Schizophrenia or conspiracy? Mind Control or paranoia? You be the judge...."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.061689,+-123.078104(20765)&iwloc=A&hl=en\"> mufon case (20765) map </A>","Log Number":"US-11272009-0015","trends":["There have been 68 other sightings in Eugene","There was one other sighting in Eugene on or around September 25th 2009"],"Viewing Distance":"Unknown","Country":"United States","Case Number":"20765","Summary":"Amazing","Disposition":"Insufficient Data","Tags":"City"}