{"files":["/var/www/straped/mufon/html2text/20767.html.txt","/var/www/straped/mufon/more/20767_submitter_file1__Christmas03-1011copy.JPG","/var/www/straped/mufon/org/20767.html"],"Date Submitted":"11/28/2009 12:16 UTC","divs":["Sighting DetailsLooking at reflection of other room, walked right in front of me, did not open door, maybe 2 feet tall, wearing a black cloak with some device on face. The reflection was from a Mitsubishi rear projection TV screen, there was an interview of a football announcer on and the side was yellowed-out with the very side, left, blank. It was very light in the room, and it was very clear and well defined. It seemed to be headed to my computer, but when I got up and looked it was either gone or I couldn't see it. I was doing my kids homework with him at the time. I take no drugs, prescriptions, don't drink, wasn't sleepy. I think it is a violation but have absolutely no recourse against something I can't identify. I think it fits the description of one of the little greys, but cloaked. Again, it seemed like a small kid's gait and was wearing a black cloak with something on the face. I felt nothing. It passed my field of vision in about 2-3 feet, in other words, I saw it walk about 2-3 feet. There was a window behind it-with the shades open. It was very clearly defined. The photo below is from '03, but gives a good idea of how easy it was to see. It was more normal than the sketch but I'm not gonna spend too much time on it."],"Region":"Nevada","Longitude":"-114.980491","Sighting Duration":"00:00:02","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=36.043805,+-114.980491(20767)&iwloc=A&hl=en\"> mufon case (20767) map </A>","Object Flight Path":"Undisclosed","Tags":"City","Country":"United States","Object Shape":"Other","Source":"MUFON","Summary":"Child figure in my house","Object Features":"Undisclosed","Date of the Event":"08/15/2009 03:30 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-11282009-0002","Case Number":"20767","Latitude":"36.043805","City":"Henderson","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around August 15th 2009","This sighting has never been favorited.",""]}