{"files":["/var/www/straped/mufon/html2text/20769.html.txt","/var/www/straped/mufon/org/20769.html"],"Summary":"Star-like object moving in a zig zag pattern","map":"<A HREF = \"http://maps.google.com/maps?q=30.301796,+-82.97672(20769)&iwloc=A&hl=en\"> mufon case (20769) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Florida","Log Number":"US-11282009-0004","Source":"MUFON","Longitude":"-82.97672","divs":["Sighting DetailsMid-August, 2009. Live Oak, FL I was at home watching TV around 10PM when I went outside for a smoke. It was a very clear night and I was looking up at the stars towards the North West. I noticed an object moving in a roughly South East direction in a straight line. It looked very similar to a dimly lit star. There were no noticeable lights (steady or flashing), what little light coming from it appeared to be reflected light. At first I thought I was watching the ISS going overhead. I have seen the ISS before and this object looked very much like it. I figured I was either watching the ISS or a satellite passing by, Cool. I watched it for maybe half a minute when it suddenly made a sharp, right angle turn towards the South West (almost directly away from me). I thought to myself \"what the ???\". It continued in a straight line towards the South West for about a half a minute. Then it made another right angle turn back towards the South East. The object continued this pattern making several right angle turns every 30 seconds or so, back and fourth, zig zagging like a staircase across the sky. Eventually it moved beyond the tree line to my South East. The object probably took less than few minutes to cross the sky (my field of view). I remember thinking \"Geez, I forgot to smoke my smoke\". My wife was asleep at the time but I told her about it in the morning. She just rolled her eyes and made some comment about me being a geek. I didn't bother to mention it to anyone after that. Now it's been bugging me for months, I cannot figure out what the object could have been. I'd really like to know if it was something man-made or not. I do not know of anything that makes right angle turns like that. Has anyone else seen this object or something similar? What the heck was it? -- Roger"],"Object Features":"Unknown","Disposition":"Unknown","Viewing Distance":"Unknown","Object Shape":"Star-like","Country":"United States","City":"Live Oak","Object Flight Path":"Path with directional change","Date Submitted":"11/28/2009 08:28 UTC","Date of the Event":"07/31/2009 12:00 UTC","trends":["There have been 3 other sightings in Live Oak","There were no other sightings in Live Oak on or around July 31st 2009"],"Case Number":"20769","Latitude":"30.301796","Tags":"City"}