{"Object Features":"Unknown","Date of the Event":"11/27/2009 07:30 UTC","Object Shape":"Fireball, Flash, Teardrop","Source":"MUFON","City":"Richmond","divs":["sighting detailsmy wife, janet, and i were driving in our saturn car after dark on friday, the day after thanksgiving, when my wife excitedly said \"do you see that?\" while pointing at an object in the night sky. i looked and saw the strange object too. my wife, who saw the object longer and had a better vantage point, described the object as a green tear-drop with a whitish tail, sort of like a comet but not a comet as it was about the size of one or two houses and was descending rather slowly at maybe a 45-degree angle over some trees and a residential neighborhood that was behind some businesses. during our viewing, the mysterious green object made no sound. we watched for about 4-5 seconds as the object slowly came down and disappeared. my wife is a bit of a skeptic and not into ufos like i am, but even she was extremely excited, perplexed, and agreed that it was a ufo. it was not the right shape, color, and moving too \"intelligently\" and slow to be a natural object, helicopter, or plane. it was moving too fast to be a balloon, and the latter do not have luminous tails, and it definitely was not a flare or swamp gas. we both agreed that it was a ufo, probable et craft of some sort. this realization left my wife not upset but a bit shaken. we were about to turn left onto hull street (rt. 360), near the waffle house restaurant (speeks dr). moments after the sighting, we saw a man working the drive-through window at a nearby hardee's restaurant (10210 hull st.) who was leaning\\straining\\looking out the window. it was obvious that he saw the mysterious green ufo that we saw and was trying to see more. my wife and i decided to check out the residential neighborhood behind the waffle house where we thought that the object may have come down, and as we drove down the streets, we saw some residents in the streets who were looking up, pointing, talking, and must have seen what we saw and also were curious. it's possible that we may have midjudged the distance of the object, and it may have come down (landed?) a bit farther north, maybe not in the exact neighborhood where we were looking, but it was obvious that some other people probably saw the green ufo too! after getting home, i went outside, even though the temperature was dropping into the 30s, and scanned the night sky for ufos, but all i could see were the stars and perhaps a planet. i also called my friend, jeff, who is heavily into ufos, and told him about my sighting. i feel very lucky to have seen this green comet-like tear-drop ufo. i saw a cylindrical ufo with lights up close and personal in rural powhatan county, va many years before, so getting to see a second ufo in the city was not something that i was expecting and icing on my cake. i personally believe that we are in what some call \"the end time.\""],"Disposition":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-77.428778","Summary":"Husband, Wife, & Others Saw Green Tear-Drop-Shaped UFO with Whitish Tail Descend Slowly Over Trees & Residential Neighborhood the Day After Thanksgiving","Date Submitted":"11/28/2009 03:27 UTC","files":["/var/www/straped/mufon/html2text/20768.html.txt","/var/www/straped/mufon/org/20768.html"],"Country":"United States","trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around November 27th 2009"],"Latitude":"37.545965","Case Number":"20768","Log Number":"US-11282009-0003","Region":"Virginia","Weather Factors":"Unknown","Sighting Duration":"00:00:05","map":"<A HREF = \"http://maps.google.com/maps?q=37.545965,+-77.428778(20768)&iwloc=A&hl=en\"> mufon case (20768) map </A>","Viewing Distance":"Unknown","Tags":"City"}