{"Tags":"City","Object Shape":"Unknown","Region":"Kentucky","Object Flight Path":"Straight-line path","City":"Louisville","Case Number":"2077","Date Submitted":"11/27/2002 07:30 UTC","Latitude":"38.260455","Country":"United States","Summary":"odd crafts of louisville","map":"<A HREF = \"http://maps.google.com/maps?q=38.260455,+-85.756756(2077)&iwloc=A&hl=en\"> mufon case (2077) map </A>","Log Number":"","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around November 27th 2002"],"Source":"MUFON","divs":["Sighting DetailsLousiville, KentuckyMy fiance and I were driving north on Hwy 65 south of Louisville, Ky at about7:30 pm on our way to Ohio. The sky was dark but relatively clear. I wasdriving and noticed two winged objects about half a mile to one mile distant, heading easterly from the west side of 65. I wouldnt have thought anythingexcept for the excessive number of collision lights on each craft, at least 10lights were observed.This would disclude the crafts from being any known civilian or military craftas they generally have one to three lights, no more as it is redundant andconfusing to air controllers in towers to see that many lights approaching theirairspace.I could discern no true shape, as I was driving and I was, at first, thinkingthey were cargo ships from the military heading for a landing. What threw meoff were the number of lights, and the fact that I dont recall any military orcivilian air fields in that vicinity, about 20 min south of Louisville. Therewere two craft in formation, one directly behind the other, and they were quitelow, as if on approach.I did not stop, I did not see if they crossed the highway, and have no idea whatthey may have been. Having been in the marine corps air wing, I am stillfamiliar with military and civilian aircraft, and my instinct is that these wereneither."],"Disposition":"Unknown","Longitude":"-85.756756","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:05:00","Date of the Event":"11/27/2002 07:30 UTC","files":["/var/www/straped/mufon/html2text/2077.html.txt","/var/www/straped/mufon/org/2077.html"],"Object Features":"Wings","Weather Factors":"Unknown"}