{"Country":"United States","Log Number":"US-11282009-0008","Disposition":"Insufficient Data","Latitude":"27.666307","Longitude":"-81.513484","City":"Pensacola (Ferry Pass Are","divs":["Sighting DetailsAround 5:45p on Friday Nov 6th, my husband & I were leaving work to head home. As we were about to get into our vehicle, I had had the notion to quadruple-check the back doors (my husband & I have OCD when it comes to locking doors, which is a good habit!). While my husband was loading himself & our dog into our vehicle, I jogged to the back of the building. After everything checked out OK, I jogged back to the front side of the building & stopped dead in my tracks when I noticed 3 red lights. At first I thought, \"what a weird plane\", but as my brain slowly processed what I was seeing, I noticed this was no plane at all. This object did not make the slightest sound. As I looked at the 3 red lights, I noticed the shape of an equilateral triangle. The bottom 2 lights would stobe together & the top light would stobe at the same rate but at a slightly different time. The lights would always be on but flash at different times, almost as if they were dimming lights? As I was fixated on this object, I noticed the top light was moving down & to the left while the 2 bottom lights stayed at the same fixed distance. Finally my brain kicked into motion & I ran as fast as I could to get my husband. He then ran to the back with me and was astounded by what we saw. There were no lights other than the 3 red lights. Whatever unseen hard object that was bordered by the lights seemed to be rotating slowly, as if the \"foward\" point were moving counterclockise from west to north. After it completed this 90 degree rotation, it began to slowly and silently move to the north horizon. It was hard to gauge the overall size of the object. We would guess that it was approx 300 ft wide. The size was very hard to guage especially because of the unknown altitude and lack of comparable structures.. If it was as low as we thought, it should have made SOME kind of sound. If was a \"plane\" at such a high altitutde that it wouldn't make any sound then the craft would have to be thousands of feet wide. We watched the triangle for no more than a minute and proceeded to get in the car and attempt to follow it as it headed north. Thanks to our towns pointless infrastructure, we we stopped at a red light for way too long and by the time we were able to follow the direction of what we saw, we had lost sight of the craft. We live & work in the flight paths of a regional airport & we are surrounded by miltary bases in almost every cardinal direction. We are extremely familiar with civilian, commercial, and military planes, and are certain this did not belong to any above categories. If this was a secret aircraft, it flew very conspicuously over a high-density population area, with 3 attention getting wierd red strobes. We had even considered if it was 3 separate aircraft, but the precision and uniformity of distance, movement, and complete silence eliminated that as a possibility. We were very excited and somewhat nervous seeing this so close up, but were ultimately disappointed in missing closer details, like what the stucture looked like or where it was going."],"Date of the Event":"11/06/2009 05:45 UTC","Object Flight Path":"Undisclosed","Region":"Florida","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"20773","Date Submitted":"11/28/2009 03:46 UTC","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.666307,+-81.513484(20773)&iwloc=A&hl=en\"> mufon case (20773) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20773.html.txt","/var/www/straped/mufon/org/20773.html"],"Object Shape":"Triangle","trends":["There have been no other sightings in Pensacola (Ferry Pass Are","This sighting has never been favorited."],"Summary":"Three red lights in a triangular formation, passing almost overhead"}