{"Object Flight Path":"Stationary,Straight-line path","Object Features":"None","Disposition":"Unresolved","Date of the Event":"11/27/2009 03:53 UTC","Sighting Duration":"Undisclosed","Summary":"metal sphere flying through the air, making a line, chased by 3-4 jets, stood on the air, disappeared through the air","Latitude":"41.927418","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.927418,+-89.067287(20774)&iwloc=A&hl=en\"> mufon case (20774) map </A>","Object Shape":"Sphere","Date Submitted":"11/28/2009 04:24 UTC","trends":["There have been 2 other sightings in Rochelle","There were no other sightings in Rochelle on or around November 27th 2009","This sighting has never been favorited.",""],"Longitude":"-89.067287","Region":"Illinois","divs":["Sighting DetailsI saw a UFO on 24th nov, 2009 in Peoria, IL. So I was looking at sky hoping to see one more UFO. I was in the car, back seat on a highway. When I looked at the sky, I saw a white line, as if someone drew it with a ruler. I thought a bit weird. Few minutes later when I was heading south, I looked up again and found that line closer, with no shape of plane in front of that line. And the line was moving forward! I felt so weird and I took a photo, it was very hard to take one because the car was moving so fast on the highway. Anyway when I looked the photo I took, I found that it is a sphere! I saw few more flying objects behind the sphere and in front of the sphere which seemed like chasing the sphere from back and front. When I took those photos, they came out just like jets. But the sphere was sphere in my photo again and again. It was a very shiny sphere, moving fast like the speed of a jet, but the difference was that it didn't make engine smoke. The jets were making engine smokes, which spreads to air after some time, but the sphere made a line, which caused by friction of the air because it was flying so fast. That's why the line seemed so weird, like pen drawn line and made me look at it. Suddenly the sphere disappeared and after few minutes, and the two jets one chasing from behind and one coming from front, crossed each other, quite close each other. Then, the metal sphere appeared on the sky near where it was disappeared, little bigger size, maybe closer to me. It looked very clearly like a shiny metal sphere with no legs, wings, windows nothing. It stood there for 2 or 3 seconds, not moving at all and then slowly disappeared its shape, as if it melted in to the air. First photo is a close view of the flying sphere. Second photo is a photo of jet which was coming towards the sphere, you can see the difference of shape and the line they are making. Third photo is taken while the sphere was disappearing. Fourth is another photo of sphere flying, Last one is same as third one. It was very hard to take a photo, camera could not focus the small thing in the sky."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Windy, Light","Log Number":"US-11282009-0009","Country":"United States","Tags":"City","Case Number":"20774","files":["/var/www/straped/mufon/html2text/20774.html.txt","/var/www/straped/mufon/more/20774_submitter_file1__20091128160052_47930262.jpg","/var/www/straped/mufon/org/20774.html"],"City":"Rochelle"}