{"Log Number":"US-11282009-0007","trends":["There have been 12 other sightings in Anderson","There were no other sightings in Anderson on or around February 28th 2005"],"City":"Anderson","Summary":"Video footage taken while in a single engine airplane.","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/20772.html.txt","/var/www/straped/mufon/org/20772.html"],"divs":["Sighting DetailsWhile on a short flight over the city of Anderson and the surronding area, we inadvertantly captured \"something\" on video. No one in the plane saw it at the time. Here is what happened. First of all, I am not a pilot, but I was at the controls at the time( front right seat). The pilot was to my left letting me do the flying, reason being I told him that I was thinking of getting my license, so he let me see what it was like. My oldest brother(now deceased) was sitting behind the pilot, and my son was sitting behind me. My brother was using my camera, not really looking thru the lens, but just kind of pointing it. After the flight, I went home and veiwed the tape with my wife and kids. In the tape, we were south of Anderson around interstate 69, when my brother pointed the camera out his window, and it happened kind of fast, but what you can see is a silver ball shaped object come up toward the plane from behind, then it would fall back out of frame. Then a few seconds later it came back in the shot for a few more seconds then it did what looked like a barrel roll down and to the left. I don't know what it was, but I would like for someone with a little more knowlegde to take a look at it. If anyone at MUFON is interested in taking a look, you can contact me at the Email address above. I do ask that I remain anonymous please. Thank you."],"Case Number":"20772","Weather Factors":"None","Source":"MUFON","Date Submitted":"11/28/2009 01:03 UTC","Disposition":"Insufficient Data","Object Features":"None","Longitude":"-85.673074","Object Shape":"Sphere","Tags":"City","Country":"United States","Latitude":"40.11431","Sighting Duration":"Undisclosed","Date of the Event":"02/28/2005 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.11431,+-85.673074(20772)&iwloc=A&hl=en\"> mufon case (20772) map </A>","Object Flight Path":"Path with directional change","Region":"Indiana"}