{"map":"<A HREF = \"http://maps.google.com/maps?q=41.578967,+-87.780164(20778)&iwloc=A&hl=en\"> mufon case (20778) map </A>","City":"Tinley Park","Country":"United States","Tags":"City","Case Number":"20778","Log Number":"US-11282009-0013","divs":["Sighting DetailsHere is something that I had hoped that I would never see ever again. On August 21, 2004 my fmaily and I saw these lights over the sky, and we did not get footage. We did report this when we saw it last time. Last year the history channel did a special on Tinley and these lights called UFO hunters, tinley park, IL. Well the same thing happened again tonight. My parents were in Matteson, IL and they called me to tell me that the lights were back. I looked outside SouthEast towards downtown Tinley Park, and they were back. They were in a line again like last time, however this time they were a LOT MORE BRIGHT! THis time they were giant and whitish goldish in color. They were at least ten times the size that they were last time we saw them. They did the same thing as last time. THey changed shapes and formations from a line, to a triangle, then spread out and dissapeared. One came back by itself like last time, and then faded out. THIS IS EXACTLY WHAT I SAW 5 YEARS AGO! I am so amazed, and freaked out. WHAT ARE THESE LIGHTS!!!!!!!!!!!!!????!?!?!?!???"],"files":["/var/www/straped/mufon/html2text/20778.html.txt","/var/www/straped/mufon/org/20778.html"],"Sighting Duration":"Undisclosed","Region":"Illinois","Object Flight Path":"Undisclosed","Date of the Event":"11/28/2009 06:40 UTC","Latitude":"41.578967","Date Submitted":"11/28/2009 08:48 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Diamond","Summary":"Very bright lights changing formation over Tinley Park","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around November 28th 2009","This sighting has never been favorited.",""],"Disposition":"Unresolved","Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-87.780164"}