{"files":["/var/www/straped/mufon/html2text/20781.html.txt","/var/www/straped/mufon/org/20781.html"],"Region":"Texas","Summary":"White, rectangular object, no contrail and no sound","Viewing Distance":"Over One Mile","divs":["Sighting Details I read the sightings on this website daily and now have one of my own to post. Because I was curious to see if anyone else would post a similar sighting, I waited until now to post mine. Well, someone from Texas did post a sighting that matches mine exactly, other than the date and time of day are different. My sighting is identical to the one observed November 12 in Texas. Mine, however, occurred on November 25 between 1:50 PM and 2:00 PM on the northwest side of San Antonio. I was out on my apartment patio and just happened to look up into the clear blue sky. I soon saw an object that I first thought was an aircraft of some kind. Since we have two air force bases and one army base, plus civilian airports, seeing something in the sky is a common occurrence. Immediately, though, I knew there was something different about this object. As I stared at it, I could tell that it was white and rectangular, with no wings. There was also no contrail behind this \"craft\", and it was heading from a northwest to a southeast direction seamlessly. In other words, it was travelling smoothly through the air. At a couple of points during its journey that I saw, it appeared to be reflecting light off of it, or perhaps it was emitting something that gave that appearance. There also appeared to be some device attached to its top that resembled a radar dish. It also seemed to disappear, then reappear while I was watching it. Finally, as I was trying to retrieve my binoculars, it completely disappeared past some buildings and trees. I knew I had seen something I could not explain, and it was very exciting."],"Date Submitted":"11/28/2009 10:45 UTC","Disposition":"Unknown","Log Number":"US-11282009-0016","City":"San Antonio","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around November 25th 2009"],"Object Features":"Appendage(s)","Country":"United States","Case Number":"20781","Longitude":"-98.485788","Object Shape":"Square, Rectagular","Sighting Duration":"Undisclosed","Latitude":"29.433062","Object Flight Path":"Straight-line path","Weather Factors":"None, Does Not Apply","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.433062,+-98.485788(20781)&iwloc=A&hl=en\"> mufon case (20781) map </A>","Tags":"City","Date of the Event":"11/25/2009 01:55 UTC"}