{"map":"<A HREF = \"http://maps.google.com/maps?q=41.719091,+44.800738(20786)&iwloc=A&hl=en\"> mufon case (20786) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"11/07/2009 09:30 UTC","Longitude":"44.800738","Object Flight Path":"Undisclosed","Object Shape":"Circle, Disc, Flash","files":["/var/www/straped/mufon/html2text/20786.html.txt","/var/www/straped/mufon/org/20786.html"],"divs":["Sighting DetailsWhile visiting Georgia (Not U.S. but Easter Europe or Caucasus as you wish)for business on november the 7th 2009 me and my locas friend went to Tbilisi suburbs for sighteeing (place called Ckneti I guess) and on our way back to the capital, it was already dark, we saw a big glowing object jumpping east-west and viceversa with a tremendous speed... glowing and flashing very rarely though... we saw it for a minute or so, then after a corckscrew corner on our way we lost it behind a mountain. there were two cars stopped on the edge of the street with the drivers watching the object as well. In my opinion the subject was only 300 or 400 meters in the sky maybe 20 meters of diameter. object was as big as a full moon and moving almost like a nonsolid object. we did not hear a sound even though we passed very slowly and I opened the front window. I saw a lot of things in the sky but this one was something special almost like giving you an awareness thet it was not a plane or something else. difficult to explain... can only feel it. Once got back to Italy I documented myself finding your site. so, wanted to share."],"Case Number":"20786","Latitude":"41.719091","Date Submitted":"11/29/2009 08:48 UTC","Summary":"Glowing object jumping in the sky seen near Tbilisi, Georgia","Weather Factors":"Unknown","Log Number":"GE-11292009-0003","Country":"Georgia","trends":["There have been 2 other sightings in Tbilisi","There were no other sightings in Tbilisi on or around November 7th 2009"],"Tags":"City","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Unknown","City":"Tbilisi","Object Features":"Undisclosed","Region":"Tbilisi"}