{"Summary":"3 orange lights flying in triangle formation","Object Shape":"Circle, Star-like, Triangle","Tags":"City","Longitude":"-118.210601","Weather Factors":"Unknown","Region":"California","divs":["Sighting DetailsI was getting home from having coffee with some relatives. I live in Compton California, it was around 2:00 AM,, I stepped out of their car and looked at the sky as is was a very clear tonight and I want to take a look at the stars,, I then looked to my right which is west, and I saw 3 dim orange lights flying in triangle formation flying west to east in a straight direction. I thought it was a plane initially but I looked for flashing lights and didn't see anything,,, it was moving pretty fast so then I thought it could be a military plane,, but when it flew directly over me I couldn't see anything but the 3 dim orange lights,, I yelled at my cousin to take a look at it as well and he was equally surprised at what we were seeing,,, then as it flew east I saw the light on the left of the triangle pull forward and the light that was initially in front pull behind it, then the light on right looked like it merged with the trailing light,, at that point the just disappeared into the sky. I don't know what that was I am hoping someone can tell me it was a military plane,, I don't believe in aliens,, I've tried blogging at news sites,, I just want to know if someone other than my cousin and I saw anything tonight,, it is by far the wildest thing I have ever seen,, I'm actually a bit scared,, and don't know who to talk to about it,,, Unfortunately we have no pictures or video,, the whole thing lasted about 15 seconds and I didn't even think about taking my iphone out,, I don't think it would have worked anyway as the lights were dimmer that the stars."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.898229,+-118.210601(20785)&iwloc=A&hl=en\"> mufon case (20785) map </A>","Sighting Duration":"00:00:15","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20785.html.txt","/var/www/straped/mufon/org/20785.html"],"Object Flight Path":"Straight-line path","Date Submitted":"11/29/2009 06:11 UTC","trends":["There have been 4 other sightings in Compton","There were no other sightings in Compton on or around November 29th 2009"],"Country":"United States","Case Number":"20785","Latitude":"33.898229","Disposition":"IFO","Object Features":"None","Date of the Event":"11/29/2009 02:08 UTC","Log Number":"US-11292009-0002","City":"Compton"}