{"Case Number":"20797","Object Features":"Unknown","City":"Norwalk","Summary":"Flying object disappears","Date Submitted":"11/29/2009 07:37 UTC","Longitude":"-73.401997","Disposition":"IFO","Object Shape":"Star-like","Log Number":"US-11292009-0014","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown","divs":["Sighting DetailsI was outside in my backyard smoking a cigarette. It wasn't dark yet as it was only about 5 in the afternoon. I saw a light moving low in the sky. I thought it was a plane at first and watched it as it moved along. I thought it was a little strange that I could see the light of the plane very clearly but not the fuselage or anything else. I also discounted this to distance. I then thought that for the distance is was moving a bit faster than it should since we have a lot of air traffic around us. I continued to watch it then moved behind a tree obstructing my view as I stood stationary. I expected the object to keep on its course and be visible as it moved passed the tree. The object never be came visable again. I was confused and moved to see if it had stopped at that spot or changed course but I never saw it again. It was too high to drop below the tree line. I live on the back of a hill and was looking towards flats and the tree it disappeared behind was only 10 feet from me. There we no clouds and no stars out yet. I felt so confused and stood outside for another 10 minutes trying to figure it out."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.119187,+-73.401997(20797)&iwloc=A&hl=en\"> mufon case (20797) map </A>","Latitude":"41.119187","Date of the Event":"11/29/2009 05:06 UTC","Object Flight Path":"Straight-line path","Tags":"City","files":["/var/www/straped/mufon/html2text/20797.html.txt","/var/www/straped/mufon/org/20797.html"],"Region":"Connecticut","Source":"MUFON","trends":["There have been 7 other sightings in Norwalk","There were no other sightings in Norwalk on or around November 29th 2009"],"Sighting Duration":"Undisclosed"}