{"Region":"Indiana","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.057267","Weather Factors":"None","Object Features":"None","Longitude":"-85.537197","Log Number":"US-11292009-0008","files":["/var/www/straped/mufon/html2text/20791.html.txt","/var/www/straped/mufon/more/20791_submitter_file1__SilverSphere.jpg","/var/www/straped/mufon/org/20791.html"],"City":"Middletown","Date Submitted":"11/29/2009 12:54 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.057267,+-85.537197(20791)&iwloc=A&hl=en\"> mufon case (20791) map </A>","Country":"United States","Tags":"City","trends":["There have been no other sightings in Middletown","This sighting has never been favorited."],"Case Number":"20791","Summary":"Silver sphere over Middletown IN","Date of the Event":"06/10/2005 04:30 UTC","Object Shape":"Sphere","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn June 10,2005 at 4:30 in the afternoon I was installing vinyl siding on a garage on 10th Street in Middletown,Indiana a few miles east of Anderson. As I was cutting a piece of j-channel, out of the corner of my eye I saw a flash in the sky nearly overhead at about a 75 or 80 degree angle to the west.It was sunny with a few clouds so I assumed it was just the sun reflecting off an airplane as it passed. When I looked up at where the flash had been there was a silver metallic looking sphere moving south at about the speed of a small airplane. I have never seen anything like it in the sky before, and I've been doing roofing and siding for 19 years so I look at the sky much more than average. I kept my eyes on it as it flew directly south for about ten seconds until it entered a small ball shaped cloud. The cloud was small enough that the sphere should have come out the other side in three to four seconds, but it never came back out in over ten minutes that I stared at the cloud. All the clouds including the one the sphere entered were all drifting directly to the east, so the sphere wasn't moving with the wind like a balloon would. From the size of the sphere being at cloud level I would guess it's size to be between fifteen and twenty-five feet. It appeared to be made of brushed stainless steel and had no markings of any kind on it. Since that day four and a half years ago I've tried to find some example of what I saw on the internet but the only thing that looks like it is the pictures and videos of silver spheres shown on UFO websites. I included a picture I found on the internet of what it looked like and I've kept a camera and binoculars with me ever since in the hope of seeing one again."],"Source":"MUFON"}