{"Object Flight Path":"Stationary","Case Number":"20798","Country":"United States","Tags":"City","trends":["There have been no other sightings in Somerset","This sighting has never been favorited."],"Date of the Event":"11/29/2009 05:15 UTC","Date Submitted":"11/29/2009 10:41 UTC","Source":"MUFON","Disposition":"Unknown","Longitude":"-79.078083","files":["/var/www/straped/mufon/html2text/20798.html.txt","/var/www/straped/mufon/org/20798.html"],"Viewing Distance":"Unknown","Summary":"huge saucer shaped in the middle of the sky","Object Shape":"Disc","Object Features":"Undisclosed","City":"Somerset","Region":"Pennsylvania","Latitude":"40.008411","Log Number":"US-11292009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=40.008411,+-79.078083(20798)&iwloc=A&hl=en\"> mufon case (20798) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving home from OH on I-70, there was a huge traffic jam and we were moving between 5-20mph for many miles starting around mile marker 103. Traffic started to get lighter around mile marker 130 but then it started to be stop and go again around mile marker 140. As I rounded the bend I noticed in the sky a huge saucer shaped object. I didn't want to believe that it could be a UFO and tried to see if it was a cloud but it could not have been a cloud. All the clouds in the sky were a feathery, thin sort of cloud (Cirrus). This object in the sky was very solid. There were no cumulus clouds. And the shape of this object was defined and sharp, no bumps like what cumulus clouds look like. I noticed a lot of people pulled over in the emergency pull over areas and I tried to get my vehicle to one of those to get my camera out of my trunk but the traffic was so bad. By the time I was able to get to an emergency pull over, the object was half way hidden by trees and when I was in park, the object was completely hidden by trees. I started driving towards darker skies and lost sight of the object."]}