{"Source":"MUFON","Longitude":"-74.070218","Date of the Event":"07/07/1994 12:00 UTC","divs":["sighting detailsas a college professor for 29 years i testify that what i say is true. in 1994 i saw 3 gigantic triangular shaped ufo's,each the size of a football field at the meadowlands racetrack new jersey. it was the middle of the afternoon. my husband a doctor was in the barn with his horses. he was showing a former student who had kept in touch with me the horses. i was outside rollerblading. it was aclear blue sky,not a cloud in it, when suddenly i looked up to sae a small triangle slowly emerge as if coming through a screen which was the sky.i thought maybe it was some sort of stange new plane,but it was gigantic.then another wing appeared,thenstill another wing was evident untill there finally appeared three giant fully formed triangular shaped ufo's in formation.once they were completely apparent& motionless,hovering above me for about 1-2minutes from about over twice as high as the empire state building, they all turned as if in formation untill they were only pencil thin,then right in front of me they dissappeared.i was shaking in my rollerblades. i couldn't believe what i just saw.it has been 15 years & it is as fresh in my mind as when i had first seen it & has haunted me since. i've seen the bottom of many planes but nothing comes close to one speck of the size of one of these crafts.there was not a sound in the sky.they had a light at each of the corners of the crafts.i don't know why i did not realize i could report this to someone.i guess i was busy & a little scared.in 1996 i saw an episode on \"sightings\" tv show where a 5 year old boy had drawn these triangular shaped ufo's sighted in belgium where they had a cluster of them seen by many people.i always thought ufo's were round & had never heard of a triangular ufo untill this program. i knew i wasn't alone. the other strange thing i only heard a few years ago;i caught the tail end of a comedians act on tv.the last thing he said was;\"like the ufo's at the meadowlands!\"then i knew others had to have seen it, although i didn't see anyone close by me.i would be glad to draw exactly what i saw for you if you are interested as i teach art.i don't know how to send w\\email.i know it was a long time ago,but i feel that something will happen in2012,which is so close suddenly.there is so little time left.people haveto be told.i've told many of my students of course they think i'm crazy. i don't drink or do drugs. i've also became an ordained minister 3 years ago,& will swear on a stack of bibles that this testimony is god's honest truth! i hope you will contact me, if it's at all helpfull."],"Object Shape":"Triangle","City":"East Rutherford","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/20790.html.txt","/var/www/straped/mufon/org/20790.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"New Jersey","Log Number":"US-11292009-0007","Object Flight Path":"Undisclosed","Date Submitted":"11/29/2009 12:34 UTC","Viewing Distance":"Unknown","Summary":"Saw 3 gigantic triangular shape UFOs, slate grey/light at each corner. Each size of footballfield. they appeared out of blue cloudless sky -then dissappeared.","Latitude":"40.817288","trends":["There have been 2 other sightings in East Rutherford","There were no other sightings in East Rutherford on or around July 7th 1994"],"Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.817288,+-74.070218(20790)&iwloc=A&hl=en\"> mufon case (20790) map </A>","Case Number":"20790"}