{"trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around November 30th 2009"],"Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20796.html.txt","/var/www/straped/mufon/org/20796.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.111318,+-84.50554(20796)&iwloc=A&hl=en\"> mufon case (20796) map </A>","Weather Factors":"None","Region":"Ohio","Object Flight Path":"Straight-line path","divs":["Sighting DetailsAround 6 pm this evening I was driving down state route 22-3 (montgomery rd) toward Landen when I saw two large, bright lights in the sky. They immediately caught my attention. As I drove I got closer to the object and I pulled into the Mcdonalds parking lot to observe it. I am unaware of the altitude of the object because I'm not familiar with the normal altitudes aircraft fly at. Therefore, I went by my knowledge of just seeing planes in the sky on a daily basis and determined that it was lower than a plane would normally be. However, I cant say for sure, the object was so large it seemed that it must have been very low or it could have been higher than that but my perception was thrown off by the size of it, I do not know. Anyway, I sat in the Mcdonalds parking lot just watching the object move toward my direction, I thought it was stationary from afar but after observing it for several minutes I realized it was moving very slow. Eventually it passed over my location and I observed it to be a large black triangle. There were three lights, one in each corner. The light on the point of the triangle was dimmer in comparison to the other lights. I couldn't determine the color of the craft as it passed overhead, all I could see were the large lights. There were no flashing lights at all on the craft. I rolled my windows down as the craft passed very close to my location and I heard absolutely no sound, not like you normally would hear with an airplane. I watched this object until it was completely out of my view. I am truly puzzled by what I witnessed."],"Latitude":"39.111318","Date Submitted":"11/29/2009 07:07 UTC","Object Shape":"Triangle","Object Features":"None","Log Number":"US-11292009-0013","Source":"MUFON","Date of the Event":"11/30/2009 12:00 UTC","City":"Cincinnati","Longitude":"-84.50554","Case Number":"20796","Summary":"Large triangular object sighted on route 22-3","Tags":"City","Country":"United States","Viewing Distance":"Unknown"}