{"Sighting Duration":"Undisclosed","City":"New York","Tags":"City","Object Flight Path":"Path with directional change","divs":["Sighting DetailsMy friend wanted to go on to the roof, of his apartment building on the corner of 10th street & 1st avenue in the east village of New York City, to see the stars and planets. It was a clear night. He was pointing out orion's belt, sirius dog stars many constellations and the planets mars & saturn. He said if we stare in this sectio, which i think was north east, we might be able to see a shooting star. We stared for a many minutes until he said look whats that? Then to the right, which i think was east of us was a black triangular craft hovering low and moving slowly away from us. All 3 of us saw it. Then it turned behind a taller building across the street. We walked towards the other end of the roof to see if it would come back around. But I was very cold and scared and told them we should go inside. I would not have believed this If they hadnt seen it too. If anyone told me they saw it I would think they were crazy but all 3 of us DID see it! I feel it is my duty to report this event to mufon and that everyone should know that this really did happen. On Saturday November 28th 2009 Myself and 2 of my friends saw a silent slow moving black triangular ufo over new york city."],"Date Submitted":"11/30/2009 01:10 UTC","Object Shape":"Triangle","Log Number":"US-11302009-0004","Summary":"Myself and 2 of my friends saw a black triangular UFO over New York City.","Viewing Distance":"Unknown","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around November 28th 2009"],"Region":"New York","Object Features":"Undisclosed","Date of the Event":"11/28/2009 11:15 UTC","Source":"MUFON","Weather Factors":"Windy, Medium","Case Number":"20802","files":["/var/www/straped/mufon/html2text/20802.html.txt","/var/www/straped/mufon/org/20802.html"],"Country":"United States","Latitude":"40.718703","Disposition":"Insufficient Data","Longitude":"-74.001443","map":"<A HREF = \"http://maps.google.com/maps?q=40.718703,+-74.001443(20802)&iwloc=A&hl=en\"> mufon case (20802) map </A>"}