{"Country":"United States","Object Flight Path":"Undisclosed","Longitude":"-104.978403","Date Submitted":"11/30/2009 12:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.740974,+-104.978403(20800)&iwloc=A&hl=en\"> mufon case (20800) map </A>","Disposition":"IFO","Object Shape":"Star-like","Viewing Distance":"Unknown","Log Number":"US-11302009-0002","Date of the Event":"11/29/2009 09:10 UTC","Weather Factors":"Unknown","City":"Denver","files":["/var/www/straped/mufon/html2text/20800.html.txt","/var/www/straped/mufon/org/20800.html"],"Region":"Colorado","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around November 29th 2009"],"Latitude":"39.740974","Summary":"Blinking orange star that moved from east to west, stops then moves again.","Source":"MUFON","Tags":"City","Case Number":"20800","divs":["Sighting DetailsI was at my friends house on 8th and Cherry in East Denver, we had just finished decorating a christmas tree. I looked at the clock because I had to leave pretty soon - it was about 8:40 pm when I went out there. I thought, at 9:00 pm I have to go. I was looking towards the east and I saw what I thought must have been a satellite because it moved like that in a straight line and it was clearly very far away. It was just a very bright dot. I saw it move up the horizon,until it got nearly parallel with Oriens' Belt then it stopped! I thought that was odd, but then it moved to the south a little bit and then to the north a little bit and then up and then back down (east and west). The movement was sporatic. It \"scooched along\" periodically in all four directions. I had my friends come outside and we all watched it zig zag (4 people between the ages of 10 and 50), it's really cold tonight so we went into get our jackets on and when we came back we couldn't find it again. When we went back in, the clock said 9:30 pm. It was no Phoenix lights but it was pretty darned exciting!"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed"}