{"City":"Birch Bay","divs":["sighting detailsfirst of all, my father an i watch the sky here 24\\7. we see amazing things but this is like none other. so, its about 8:25 p.m. and my dad was taking me and my best friend to wall-mart to pick up some shorts for basketball the next day, when on the way we spotted a huge, \"burning\" like orb that started to drop into the trees. at first we thought it was a fire so we so we rushed to it. when we got into the woods, we couldn't find it. so we drove sown the freeway some more, and it suddenly peeked back out of the trees. we decided to go to where it was and we watched it for 2 hours. these \"balls of fire\" sat there, dropped and then blinked out. after it blinked out, a little white orb would come out of the \"fireball\" and move to the left super quick, and then to the right. lite up and then turn into a \"fireball\" itself. this went on for 3 hours. so, we sped home got our telescope (which we didn't have at the time) and sped back to find them gone. we sat there for 10 more minutes to watch many moving white orbs fly around the sky. i hope our town and community recognize the significance of these sightings. after the fact, we were skeptical that it was a ufo, but here a ufo crashed many years ago, so i know for a fact this sigting was not a \"weather balloon, ball ligtning, blimp, flare, and other such.\" if it was a flare, it is unlike any flare i have seen before."],"map":"<A HREF = \"http://maps.google.com/maps?q=48.917888,+-122.744622(20805)&iwloc=A&hl=en\"> mufon case (20805) map </A>","Tags":"City","Source":"MUFON","Object Shape":"Circle, Fireball, Other","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Log Number":"US-11302009-0007","Date of the Event":"11/29/2009 09:08 UTC","Summary":"10-20 Hovering Fireballs over the bay","trends":["There has been one other sighting in Birch Bay","There were no other sightings in Birch Bay on or around November 29th 2009"],"files":["/var/www/straped/mufon/html2text/20805.html.txt","/var/www/straped/mufon/org/20805.html"],"Object Features":"Unknown","Longitude":"-122.744622","Weather Factors":"Unknown","Latitude":"48.917888","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Region":"Washington","Disposition":"Unknown","Case Number":"20805","Date Submitted":"11/30/2009 03:28 UTC","Sighting Duration":"03:00:00"}