{"Weather Factors":"Unknown","Latitude":"40.060024","Disposition":"Unknown","Date of the Event":"07/31/1975 12:00 UTC","City":"Bridgewater Twp/ Martinsv","Country":"United States","Date Submitted":"11/30/2009 12:15 UTC","divs":["Sighting DetailsMy 2 friends and I were driving west on Washington Valley Rd. We came to an open area where a new rd came down a hill to a stop. At that intersection, we saw an oval flat blimp-like object, enormous, larger than a football field. It emitted a low frequency pulsing vibration. We all got out of the car and stood behind it to look at this object. It was rimmed in weird lights(now I would call them LED-like) and we could feel it. We instinctively grabbed each other's hands, suddenly overcome with fright. All at once in a flash the thing took off heading east out over the valley towards Bound Brook. We jumped back into the car and pulled a u-turn, determined to follow it. We drove a long way along the valley rd until it quickly became a speck in the sky. We went to the Warrenville Police office to report our experience. The officers made jokes about little green men, but we made them write down what we saw.. We then drove home where I told my mother the reason why I was so very late (my curfew was midnight) She was a scientist and a science teacher, but she believed us. Wr were all over wrought with fear, and that night rather than sleeping in my upstairs bed, I crept downstairs and slept on the floor of my parents bedroom. I have never been as frightened as I was that night 33 years ago. The next day, she found out somehow where to get a form for us to fill out to make a formal report of our sighting to the US Gov't. We did so, and she mailed it off. Later we found out that our neighbor had seen this thing at the bottom of the street in the same place we had, and that another friend had seen it streak through the sky over the John's Manville factory in Manville NJ that same night."],"Object Features":"Dome","Tags":"City","Object Flight Path":"Hovering then path","Log Number":"US-11302009-0009","Object Shape":"Blimp, Oval","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.060024,+-74.399151(20807)&iwloc=A&hl=en\"> mufon case (20807) map </A>","Viewing Distance":"101-500 Feet","trends":["there have been no other sightings in bridgewater twp\\ martinsv","This sighting has never been favorited."],"Case Number":"20807","files":["/var/www/straped/mufon/html2text/20807.html.txt","/var/www/straped/mufon/org/20807.html"],"Summary":"Object seen low in sky by 3 witnesses","Region":"New Jersey","Longitude":"-74.399151","Source":"MUFON"}