{"Longitude":"3.898508","divs":["sighting detailsi'm a 33 year old male, well traveled, french nationality. 29th of november 2009 at exactly 22:09\\10:09pm belgium border with france. little town called evregnies. i'm constantly looking out our bay windows (south-west) on the first floor where my wife and i do most of our work, so i know the difference between helicopters, planes and sometimes hot air balloons. i walked in the room with the lights off and out the window was this bright golden star hovering around the tree line, brigther than the street light. i picked up my binoculars (that are right next to the windows) and took a closer look, no red or green position lights. so i thought of a plane with it's landing headlights on coming straight for me or turning. but that thought only lasted a millisecond, as the movement was erratic and the glow was stronger then a star or headlights even dead on. i didn't want to disturb my wife working in the next room, but this was it, i knew it. so i called her in, she has 20\\20 eyes and can almost see at night, she's lived here all her life and after staring at it \"closely\" for a few moments just said :\" looks like you got one\".i was already snapping these. but like all true u.f.o sightings, my camera was set to 5 mega pixels instead of 10 !!!! (it's a fujifilm finepixz) the object slowly moved beneath the tree line (which is 100 meters (300 feet) away, south-west)and floated slightly north\\north-west to finally disappear from sight over the town of wattrelos due to neighboring houses and trees. i kept a look out in that direction and then the rest of the sky for a further 15 min without any luck. i blew-up,lightened\\contrast, and use the density(-) tool in photo editing software and was blown away by the \"structure\" that just forms (i didn't \"insist\" on any particular part of the image nor did i favor any forms to bring out this structure, thus the original dark unedited image 001) , like 3 port holes with light on one side and a grill in the back with symmetry. i added the originals, the zoomed in and lightened ones and even the wobbly one, i have more but just blurry dots. on the \"lightened\" photos you can see the tree line and the trees are about 20 meters high (65 feet). the backdrop is lighter due to lights from the town of wattrelos, about half a kilometer behind the house starts the belgium highway, the only one in the world to be completely lit up at night, orange. but what we saw was golden copper, no flashing colored lights, it looked like it was changing shape or morphing, pulsating in form i could say.i've traveled all my life in planes and my parents were in the airline business, i know what we saw was not a plane. it's movements were, like i said erratic, yet smooth; like if you were always falling but just never did. i felt like one would when seeing a wild animal in the brush, amazed, flabbergasted and i must admit a bit frightened. it on the other hand looked like it was looking for a place to park or sightseeing. i still have a little tingle in my chest."],"Date Submitted":"11/30/2009 01:00 UTC","Country":"Belgium","Case Number":"20808","files":["/var/www/straped/mufon/html2text/20808.html.txt","/var/www/straped/mufon/org/20808.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=50.82827,+3.898508(20808)&iwloc=A&hl=en\"> mufon case (20808) map </A>","Source":"MUFON","City":"Watreloos","Log Number":"BE-11302009-0010","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Cigar, Egg, Fireball, Oval, Sphere, Star-like, Unknown","Object Features":"Window(s), Other","Weather Factors":"Unknown","Region":"Flemish Region","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"50.82827","trends":["There have been no other sightings in Watreloos","This sighting has never been favorited."],"Disposition":"Unresolved","Summary":"Orange golden star like sphere, moving in a perculiar manner over the tree line.","Viewing Distance":"Over One Mile","Date of the Event":"11/29/2009 10:09 UTC"}