{"Summary":"Looking at tha night sky, saw three stars, after 30 seconds, one began to start moving slowly then very rapidly","City":"Undisclosed","Object Features":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsI got out of bed to get a drink of water, then opened the window to let in some cool evening air. I noticed what a beautiful, clear night it was and how well you could see the stars in the sky. Looking across the night sky ,I saw three stars in a perfect line perhaps two fingers between each and wondered as to what constellation I might be obvserving. The three stars were all stationary for at least 30 seconds. At that point the center of the three stars seemed to start moveing. At first very slowly (at this point I began to wonder was it actually moving or was it my immagination?) After three or four more seconds of watching it, not totally sure if it was moving or not, it began to speed up.Eventually to about 4 times faster than any of the commercial jets that fly over our home. I watched it move in a straight line across the sky. I ran to the other side of the house to keep watching but it had allready distanced itself from view. I have no idea what I saw, but I felt kind of lucky in a way to have seen something so interesting. I cant stop thinking about what it could have been. Each time I think about what I saw that night, a warm smile appears upon my face. I truely believe that I saw something very special. I have seen meteorites,comets,cloud punches,and many other oddities in the sky, but truly this was the most amazing thing that I have ever seen. If you think thier is a simple explanation of what I might have seen, please let me know. The truth of what I saw is all I seek. I have allways had an open mind about the possibilties that are out there. My father was in the Air Force in England in WW2 and saw or heard some amazing things which he \"hinted\" to me about, but said he could not tell me any more when I questioned him on it. I found out later in life that he was describing what they call \"foo fighters\" and such. One night, while dad and I looked up at a beautiful night sky, he asked me if I thought that there was intelligent life up there. Without hesitating I responded \"absolutely\". He asked why I thought that. I told him \"Well there isnt any down here, there has got to be some somewhere\". He grinned and shook his head in agreement. I think he might have allready known it. As much as I am a dreamer and a romantic, I still have an extremely analytical mind. I question everything and everyone, incuding myself on occasion. My heroes growing up were Davinci and Giordono Bruno; because they told the truth at whatever the cost! Please continue your wonderful work, and thank you very much for your time. Terry"],"Latitude":"40.641255","Source":"MUFON","Region":"Illinois","Date of the Event":"11/29/2009 12:00 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=40.641255,+-89.394278(20818)&iwloc=A&hl=en\"> mufon case (20818) map </A>","files":["/var/www/straped/mufon/html2text/20818.html.txt","/var/www/straped/mufon/org/20818.html"],"Object Shape":"Star-like","Object Flight Path":"Hovering then path","Case Number":"20818","Date Submitted":"11/30/2009 10:27 UTC","Log Number":"US-11302009-0020","Sighting Duration":"Undisclosed","Longitude":"-89.394278","Country":"United States"}