{"trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around November 29th 2009","This sighting has never been favorited.",""],"Case Number":"20811","Source":"MUFON","Country":"United States","Object Flight Path":"Hovering then path","Longitude":"-93.259546","Region":"Minnesota","Latitude":"44.989665","Date Submitted":"11/30/2009 03:36 UTC","Tags":"City","Summary":"circling light balls and gold orb lights","Disposition":"Unknown","Log Number":"US-11302009-0013","Sighting Duration":"00:20:00","Weather Factors":"Unknown","divs":["Sighting DetailsI went out on my deck,which overlooks 1+ acres of woods in sunurb of Burnsville,off Burnsville Pkwy and Cty Rd 5 at about midnight. Between the treetops and above, clear sky view,I spotted 2 large orbs of white light, rapidly circling eachother in a large circle, about the size of a football field.The sky was completely covered by dense clouds and the light circles were quite visible.They never waivered from their distance from eachother, but did move sideways from time to time.It resembled a planet with an orbiting planet....not an irregular path. I watched for several minutes and then started to take photographs with my digital camera and flash.I could see nothing in the view window after they were taken,but kept shooting. Suddenly, several gold orbs or lights appeared in an arc shape,appearing to flash or move.Then the clouds completely went away,revealing a totally clear sky with lots of stars. In an instant, the lights just vanished. One of the photos I have sent has been lightened and set to very high contrast, to show the area was above the treetops. No city lights, just sky. At first, I thought it might be advertising beams shooting into the air, but it started at midnight and there were no beams back to earth. I called the police and they had no reports and no knowledge of any promotional beamed lighting in the area. I thought it might be northern lights or lightening,but it had a very set and regular pattern path. The gold lights were not visible to the naked eye when there was cloud cover,but the early photos showed them."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/20811.html.txt","/var/www/straped/mufon/more/20811_submitter_file1__IMG_01691.jpg","/var/www/straped/mufon/more/20811_submitter_file2__pix1.jpg","/var/www/straped/mufon/more/20811_submitter_file3__lights_contrast.jpg","/var/www/straped/mufon/org/20811.html"],"Viewing Distance":"101-500 Feet","City":"Minneapolis","Date of the Event":"11/29/2009 11:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.989665,+-93.259546(20811)&iwloc=A&hl=en\"> mufon case (20811) map </A>","Object Shape":"Boomerang, Circle"}