{"Longitude":"-117.324282","Date of the Event":"11/30/2009 01:25 UTC","City":"Lake Elsinore","Object Features":"Unknown","Viewing Distance":"Unknown","Region":"California","Latitude":"33.672217","Weather Factors":"Windy, Medium","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20814.html.txt","/var/www/straped/mufon/org/20814.html"],"trends":["There have been 12 other sightings in Lake Elsinore","There were no other sightings in Lake Elsinore on or around November 30th 2009"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.672217,+-117.324282(20814)&iwloc=A&hl=en\"> mufon case (20814) map </A>","Country":"United States","divs":["sighting detailsi was driving home from the town of lake elsinore. turned up country club drive from lakeshore drive toward eastern hills. we have a lot of air traffic here because of near-by airport\\sky-diving, hang-gliding, balloonists, private planes, military planes and copters etc., activities so, i'm very aware of what's in our sky. looked up and noticed bright silvery, shiny oval quite a distance up and high in sky. i slowed down and stopped to have a better look because object was not typically shaped. no wings, no tail, no sound. was not the usual \"sky stuff\" we see here. watched object for a few seconds as it sharply bobbed up and down while steadily moving toward the south-east. i turned away briefly, looked back and it had completely disappeared. eastern sky view is open to view planes for a long way out but there was no hint of the silver object. i continued on toward my home thinking.. \"i believe i just saw a ufo\". parked car approximately one minute later. went out back to search sky some more for object. found nothing as i viewed the entire eastern sky. object had been traveling silently toward the south-east. almost looked like who ever was piloting the object was moving it up and down as they flew along. what i mean is, a plane just moves along in a straight line. this object sort of \"played\" as it flew."],"Sighting Duration":"Undisclosed","Log Number":"US-11302009-0016","Object Shape":"Oval","Summary":"Saw shiny silvery object in eastern sky","Disposition":"IFO","Case Number":"20814","Object Flight Path":"Path then hovering","Date Submitted":"11/30/2009 05:33 UTC"}