{"Source":"MUFON","Object Shape":"Sphere","divs":["Sighting DetailsI was on the telephone at my home in West Liberty, Ky. It was a warm summernight and I could hear all of the crickets chirping in the small valley in whichI lived. I was sitting on my bed looking out through my window as I noticed aglow entering our valley. It approached from straight across my window ourhouse was halfway up the other hill which made up the valley. I watched itslowly descend to around 20 ft. from the ground. There was no noise eminatingfrom the object. I could still hear the crickets chirp. I told the otherperson I was on the phone with that I thought I was witnessing a UFO... Onething I did notice... no acceleration, no deceleration... it just stopped as ifI hit pause on a VCR tape. Then it hovered for around 10 seconds and shot downthe valley southward again with no noise, no acceleration... just still toincredible speed in a nanosecond. The object was a slightly flattened sphereabout 15-20 ft. in diameter. It was a cyan color or sky blue with a constantaura surrounding it. There was no other detail to it.The other witness to this event I met at school the next day. I didnt tellanyone except my family they all didnt believe me of course... I just happenedto run into him as he was telling this tale about an object he had seenstreaking across the sky at about the same time I experienced it. He describedit in detail as exactly what I saw. All of this BEFORE I mentioned a word toanyone there. This is my story. I have not seen one since and did not believeuntil this sighting. I am not saying its extraterrestrial... its justunidentified. Nothing Ive ever seen in aviation to this day."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.921476,+-83.259622(2082)&iwloc=A&hl=en\"> mufon case (2082) map </A>","Date of the Event":"05/31/1992 09:00 UTC","Latitude":"37.921476","Object Flight Path":"Unknown","Region":"Kentucky","Country":"United States","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Weather Factors":"Unknown","Case Number":"2082","City":"West Liberty","Longitude":"-83.259622","Disposition":"Unknown","Tags":"City","Date Submitted":"05/31/1992 09:00 UTC","trends":["There have been 2 other sightings in West Liberty","There were no other sightings in West Liberty on or around May 31st 1992"],"Sighting Duration":"00:00:59","Log Number":"","Summary":"Witnessed a glowing compressed spherical object ho","files":["/var/www/straped/mufon/html2text/2082.html.txt","/var/www/straped/mufon/org/2082.html"]}