{"Disposition":"Unresolved","Latitude":"22.897633","Viewing Distance":"Unknown","Date of the Event":"11/29/2009 11:12 UTC","Object Features":"Undisclosed","Case Number":"20825","Longitude":"-109.909077","Object Flight Path":"Undisclosed","Object Shape":"Boomerang, Unknown","trends":["There have been 10 other sightings in Cabo San Lucas","There were no other sightings in Cabo San Lucas on or around November 29th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/20825.html.txt","/var/www/straped/mufon/more/20825_submitter_file1__wierdshitintheskycabosanlucas29112009002.jpg","/var/www/straped/mufon/more/20825_submitter_file2__wierdshitintheskycabosanlucas29112009154.jpg","/var/www/straped/mufon/more/20825_submitter_file2__wierdshitintheskycabosanlucas29112009154.jpg.jpg","/var/www/straped/mufon/more/20825_submitter_file2__wierdshitintheskycabosanlucas29112009154.jpg_edge.jpg","/var/www/straped/mufon/more/20825_submitter_file3__wierdshitintheskycabosanlucas29112009204.jpg","/var/www/straped/mufon/org/20825.html"],"Tags":"City","Summary":"strange faces and shadows moving around the sky in the clouds","Country":"Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=22.897633,+-109.909077(20825)&iwloc=A&hl=en\"> mufon case (20825) map </A>","Date Submitted":"12/01/2009 08:12 UTC","divs":["Sighting Detailsi reported a orb a few weeks back now and this has not stoped in anyway every night for the past 3 weeks i am able to witness with my own eyes that cloaked craft are flying day or night if you now what to look for you will see them, which is sort of a heat haz moving, sometimes fast and sometimes slow. the problem is that for the past week it is a nice day only a cloud here or there but as it gets closer to night fall the clouds roll in from the pacific side of the baja so i started taking photos of these and to my amazement some of them had a face looking back down and the way they move in the sky they seem to stop and start pivot on there own axis and just don't perform naturally in my experience as i am a sailer and have done many ocean miles and the weather is the most important part of any safe trip and clouds tell you alot. so as it get dark the lights start appearing roughly in the same position, i am no stars man but shouldn't the stars be in the same position in relation to the moon round abouts? correct me if im wrong please. but the next thing is like a haz will come over the whole of cabo sky, what i meen is that it looks like the night sky but not a star insight not 1. then you star seeing massive shadows move through the sky some are the same some are quite different and even when they are pasing overhead it is like a gap in the clouds but nothing there stars nothing only the moon is ever visiable. i have hundreds of photos and a few videos of this. thanks for your time mufon ben taylor"],"Region":"Baja California Sur","Sighting Duration":"12:00:00","City":"Cabo San Lucas","Log Number":"MX-12012009-0006","Source":"MUFON","Weather Factors":"Unknown"}