{"Weather Factors":"Unknown","Date Submitted":"12/01/2009 02:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.063084,+-74.403001(20821)&iwloc=A&hl=en\"> mufon case (20821) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Object Features":"None","Summary":"Big, super-bright white light sends a beam downwards in an enveloping mist","Date of the Event":"09/19/2009 12:00 UTC","Case Number":"20821","files":["/var/www/straped/mufon/html2text/20821.html.txt","/var/www/straped/mufon/org/20821.html"],"Disposition":"IFO","Source":"MUFON","Log Number":"US-12012009-0002","trends":[],"Tags":"City","Object Flight Path":"Stationary","Longitude":"-74.403001","Object Shape":"Cone","Latitude":"40.063084","Region":"New Jersey","Country":"United States","City":"Undisclosed","divs":["Sighting DetailsI have not been able to dismiss or forget this event--it keeps replaying in my head. Finally, some two months later, I visited this website to determine whether anyone else had reported something akin to it. I was shocked to see how many people indeed reported having seen someting very similar to what I saw on the evening on 9.19.09 in the sky over central NJ. I had been debating with myself and trying to dismiss or rationally explain away what I saw, yet nothing seemed to make sense. Now that I realize I wasn't the only one seeing strange things I will share what I saw that night, and yet still can't explain... It was sometime after dinner--I don't know exactly what time, but surely early evening. I was out on my second-story deck, entertaining a family of four who had come to visit. They all sat on the floor in a loose circle around me. I was also sitting on the deck floor with my back against the house wall, facing them. As I was speaking to my friends I could see the broad night sky over their heads. It was a spectacularly clear evening; I was enjoying the view. Suddenly I saw a very bright, white light in the south-eastern quadrant of the sky. It was approximately at a 45 degree angle in the arc between ground and zenith. I felt perplexed, for though I had been continuously viewing the sky while speaking, I had not noticed this light gradually enter my field of vision, as a plane would have done. I dismissed this as being due to distraction, but it still didn't seem right. That bright spotlight seemed to have simply appeared out of nowhere. Being a former small-plane sport pilot, and avid plane spotter, I presumed it was an airliner flying below cruising altitude, perhaps heading into Newark Liberty International Airport, which is a 30 min. drive north of here on US Rt. 1. I thought that it was now coincidentally turning its landing lights into my line of sight. A plane coming at you in this fashion often seems to hang still in the sky for a some seconds, so I made no bones about the fact that it seemed to be stationary. Then I thought it might be a helicopter hovering in place, though had that been the case I should have been able to also hear its rotors. Yet there was no sound whatsoever coming from it. My friends were not aware of what was happening in the sky behind them. Suddenly the light flared intensely. At that very moment it also generated a very bright, long, inverted-V shaped beam down towards the ground. What I first thought was a white cloud simultaneously materialized out of thin air and enshrouded this beam of light, which in turn brightly illuminated the swirling \"cloud.\" At that moment I interrupted myself and cried out loud, as I pointed to it, \"Whoa! What the hell is that?!\" My four friends instantly turned their heads around and glanced up, but the railing obstructed their view. Anyway, the event was over. Seeing nothing, they said nothing, and turned right back to me. I shrugged my shoulders and sputtered something about a strange airplane light and went on talking. Still trying to dismiss this event as local air-traffic, I kept my eyes glued to the region in the sky where this had all just happened. The very local \"cloud\" of mist or smoke or whatnot lingered for many minutes afterwards, making me even more uncomfortable, as I could not explain any of this to myself. Had it drifted into view due to winds, why was it so still now? At the time there was no other speck of cloud or mist in the sky, nor had there been any before. In any case, this white \"cloud\" clearly had been almost wrapped around the light source and its beam in a very strange fashion. I am still baffled."]}