{"Latitude":"37.648089","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.648089,+-91.533931(20833)&iwloc=A&hl=en\"> mufon case (20833) map </A>","Date Submitted":"12/01/2009 09:20 UTC","Case Number":"20833","Country":"United States","Weather Factors":"Windy","Object Flight Path":"Hovering then path,Path with directional change","Log Number":"US-12012009-0014","City":"Salem","files":["/var/www/straped/mufon/html2text/20833.html.txt","/var/www/straped/mufon/org/20833.html"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Shape":"Fireball","Longitude":"-91.533931","Date of the Event":"12/01/2009 06:40 UTC","Source":"MUFON","Summary":"Huge orange fireball in western sky not a metorite","trends":["There have been 11 other sightings in Salem","There were no other sightings in Salem on or around December 1st 2009"],"divs":["Sighting DetailsMy family and I were traveling through cook station when I sighted a huge object with a blue and orange light. As we traveled down YY hwy towards hwy 68 .I caught sight of the object it quickly disappeared. Oddly enough when I saw it I thought it was a huge helicopeter landing at the animal adventure ranch. I made a note of the time which was 6:40 cst. We traveled on and made it to FF hwy and went westerly. It was in the western sky when i saw it again. but this time it was a huge fireball. I kept losing sight of it as it was traveling and I was traveling around curves and trees were blocking me. The last time I saw the object it was 7:03 I saw it a total of four different times. Two times it looked to be on fire and thrusting towards salem. When I saw them for the third time It was like a big object in the sky on fire. At one point the fire ball seemed to be half the size of the moon. It was huge. I lost sight of the object when we turned right on Hwy 72 towards Rolla, and the Fireball was presumed to go the other direction. It appeared to be flying at the altitude of low flying helicopters. In fact this looked almost exactly like something I saw in 2002 that was reported here, except that object was lime green, and this fireball was orange. The object seem to be going faster then us, and it was far ahead. It seem to appear and disppear into different areas of the sky at a quick pace. It was hard to keep track of it. When my husband saw it he said he thought he saw three different object and that it was like fire in the sky. He didn't own up to seeing it until we got home. I was excited when I saw it again. It made me feel a little bit better, as I was having extreme stomach pains before we sighted the object, it was if though the excitement made me forget that I was having stomach craps. I was on the edge of the car seat trying to find it every time I lost sight of it. When we turned the other way I was sad that I didn't get to track it more. 180 Description: Orange fireball thrusting across rural missouri inbetween cook station and Salem."],"Disposition":"Unknown","Tags":"City","Region":"Missouri"}