{"Weather Factors":"None, Does Not Apply","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","Case Number":"20837","Latitude":"38.086425","map":"<A HREF = \"http://maps.google.com/maps?q=38.086425,+-92.486847(20837)&iwloc=A&hl=en\"> mufon case (20837) map </A>","Date of the Event":"11/30/2009 06:40 UTC","trends":["There have been no other sightings in Brumley","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/20837.html.txt","/var/www/straped/mufon/org/20837.html"],"Disposition":"Unknown","divs":["Sighting Detailsat 6:40 pm cst 11-30-09 myself and a friend were traveling in a southerly direction when we saw 4 or 5 lights that appeared to be on the same object, these lights were only lit up for a few seconds and would go out one by one fairly fast. This object appeared seemingly from nowhere. The lights were only visible twice and the object moved between the first time the lights were on and the second. This object had no running lights on whatsoever, once it was not lit up we did not see it again. Now on the very next night we were going to Binks store on U Hwy. the same place we were headed the first night, this time we saw the same lights when we pulled onto Hwy 42 from Hawken cemetery road where we live. The lights were the same, they would appear from nowhere and stay on for 5 to 7 seconds and go out with no running lights at all. this was on 12-1-09 at 6:50 pm cst. We got down the road about 3 minutes later in nearly the same place we saw them on the first night and saw them again. This time we saw two objects with the same light configuration. The lights would stay lit for 5 to 7 seconds again and just go out. These lights or burners were fairly bright but not so bright as to light up the sky. I do live about 40 miles from Ft. Lenard Wood but I have never seen lights that looked anything like this before and I am 52 years old. One more thing when we got to the store that was only about a mile from where we saw this object, I asked two people that I know if they saw anything when they were coming down the road and they saw the same lights. They were coming from the other direction on U Hwy. On the second night we saw them we pulled into the store parking lot and there were 3 people in the parking lot, I asked if they saw anything, one guy answered no but the people he was talking to said hey we saw em and the description was the same as what we saw both nights."],"Source":"MUFON","Longitude":"-92.486847","Object Shape":"Unknown","City":"Brumley","Object Features":"Unknown","Date Submitted":"12/02/2009 03:04 UTC","Sighting Duration":"Undisclosed","Region":"Missouri","Summary":"several lights in formation or on same object","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12022009-0003"}