{"Longitude":"-105.928899","map":"<A HREF = \"http://maps.google.com/maps?q=35.696235,+-105.928899(20836)&iwloc=A&hl=en\"> mufon case (20836) map </A>","divs":["Sighting DetailsI was not present for this incident. I agreed to post this in an effort to get somebody to follow up with the actual witnesses. There were my wife, my son's girlfriend, two next-door neighbors, and a third neighbor from about three doors down. According to my understanding of the incident, my wife and son's girlfriend were having a lengthy discussion running into the wee hours. At approximately 2:30 am early Wednesday morning (possibly Tuesday last--I myself am sketchy on this because I work graveyard hours and was not present), their conversation was interrupted by a loud hum and vibration overhead, a feeling of electricity \"all the way through my heart\" said my wife, and a blinding bright light through our back door at the kitchen. My next door neighbors reported immediately afterward as they compared notes on the incident with my family members that their storage shed in their back yard was levitated at least four inches off the ground. Two days later, the neighbor from three doors down at our apartment complex happened to be visiting when mention was made of the incident casually, and he reacted strongly on the spot, apparently surprised that someone else had had an encounter. I can attest to the credibility of the people involved. I feel their story has some merit. I wonder how many other people in our vicinity might have witnessed something similar and decided to let it go given the hour and the baffling nature of the experience. I feel some follow-up is warranted, and I am curious to know whether anyone else in our area reported anything similar of late. I thank you."],"trends":["There have been 20 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around November 25th 2009"],"Country":"United States","Date Submitted":"12/02/2009 04:26 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/20836.html.txt","/var/www/straped/mufon/org/20836.html"],"Source":"MUFON","Summary":"Vibration, Bright Light, Feeling of Electricity Through Body, Paralysis","Object Features":"Undisclosed","Date of the Event":"11/25/2009 12:00 UTC","Object Flight Path":"Undisclosed","Log Number":"US-12022009-0002","Disposition":"Unknown","Case Number":"20836","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Fireball, Flash, Star-like, Unknown","City":"Santa Fe","Latitude":"35.696235","Region":"New Mexico"}