{"Case Number":"20849","Summary":"Star like figure slow drifting then radical decline and flight both horizontal, vertical and diagonal at high speed","map":"<A HREF = \"http://maps.google.com/maps?q=-33.869611,+151.21295(20849)&iwloc=A&hl=en\"> mufon case (20849) map </A>","Latitude":"-33.869611","Longitude":"151.21295","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"New South Wales","divs":["Sighting DetailsI was looking amongst the stars as i sometimes do interested in space, unconciously my mother sais to me \"oh look that might be a shooting star\" at this point; slowly a star like figure stands out from the millions of other stars as it starts to move the opposite direction of our orbit at the time and it just seemed odd to me at the time so i continously watched it entreeged this went on for roughly 15-20 seconds. then! it almost like fell like a coin falling with gravity it declined a few centimetres to approximately say, that is from my eye sight calculation as clearly this figure is out of our atmosphere. after falling for exactly 2 seconds it diagonaly took on a drematic incline to the left moving up for about 1 second and the next it shot off! at a speed i have never thought possible in that type of atmosphere and was then gone i could not follow it, almost like it vanished? my feelings i suppose were surreal i didnt believe what i saw, as i understand the mechanics of our atmosphere quiet well enough to say nothing i have ever heard of or seen to be real can move at those angles or better yet that fast or better yet again looking like a star meaning its that bloody far away i was stunned at this point but sort of forgot it and thought whats the point in worrying i didnt catch it on tape or anything and probbly if i was to report it theyd give me some crappy gross over speech about how it wasnt what i thought untill i saw this site and thought i may aswell report the siting and maybe if i hear back from these people they might shed a little light in my direction about UFO's and Anomalies as thats what interests me the most about life in a galaxy as many think is only occupied by us, how ignorent."],"Country":"Australia","Date Submitted":"12/03/2009 09:07 UTC","Object Shape":"Sphere, Star-like","Object Flight Path":"Path with directional change","Tags":"City","Log Number":"AU-12032009-0006","Viewing Distance":"Unknown","City":"Sydney","Object Features":"Unknown","Weather Factors":"Unknown","trends":["There have been 17 other sightings in Sydney","There were no other sightings in Sydney on or around"],"files":["/var/www/straped/mufon/html2text/20849.html.txt","/var/www/straped/mufon/org/20849.html"],"Disposition":"Unresolved","Date of the Event":"Unknown"}