{"Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","Case Number":"20841","Object Flight Path":"Undisclosed","Latitude":"46.880486","Longitude":"-113.991208","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Country":"United States","Summary":"Not applicable.","Log Number":"US-12022009-0007","Date Submitted":"12/02/2009 10:18 UTC","files":["/var/www/straped/mufon/html2text/20841.html.txt","/var/www/straped/mufon/org/20841.html"],"trends":["There have been 5 other sightings in Missoula","There were no other sightings in Missoula on or around October 7th 1984"],"Source":"MUFON","Region":"Montana","Object Shape":"Circle","Date of the Event":"10/07/1984 12:00 UTC","City":"Missoula","map":"<A HREF = \"http://maps.google.com/maps?q=46.880486,+-113.991208(20841)&iwloc=A&hl=en\"> mufon case (20841) map </A>","Object Features":"Undisclosed","divs":["Sighting Details When I was living in Thompson Falls, Montana, around 1984; there was a white spherical craft that flew out of the mouth of Squaw Creek Canyon. I observed the craft flying out of the canyon in October, several years in a row. I observed different modes of operation in regard to the propulsion system, or energy field surrounding the craft. When it first began to ascend out of the canyon, a very dense, orange energy field surrounded the craft, obscuring the surface of the craft. When it began to descend, the energy field diminished, and the white spherical surface of the craft became visible. When it descended, as if to land, the energy field shut off entirely, and the craft became invisible. Stealth? In any event, this could be a valuable clue to the workings of the propulsion system. It could further be described as a hysteresis effect from the propulsion system. I discovered a picture on the Internet, which shows this effect. The first image (labeled a), is a computer generated image, which depicts the appearance of the craft when the surface is visible. Image b depicts the above described effect. It looks exactly like what I observed. The image from the Internet is of spheres, which according to eye witness accounts, ascended out of the ocean. That in itself is interesting. The same type of craft I observed flying out of a canyon in Montana, was also observed flying out of the ocean. Very strange! Perhaps image b represents the mode of operation in the startup mode. When the system first energizes, a dense energy field is produced, then levels off. Sincerely, Darryl Broome 0mega@Blackfoot.net"]}