{"Log Number":"US-12022009-0006","Latitude":"39.649879","Case Number":"20840","Source":"MUFON","trends":["There have been 11 other sightings in Connersville","There were no other sightings in Connersville on or around November 27th 2009"],"Disposition":"Unknown","Tags":"City","Object Features":"Unknown","Date Submitted":"12/02/2009 09:31 UTC","Date of the Event":"11/27/2009 06:00 UTC","City":"Connersville","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.649879,+-85.137165(20840)&iwloc=A&hl=en\"> mufon case (20840) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThe night after Thanksgiving, I looked out my back patio door and noticed a trapazoid of lights, which were very bright and sparkling. There were originally 5 lights, but morphed into 4. I asked both my husband and daughter to look at them and they thought it odd. My daughter is a college professor and I have a degree in Earth and Space Science. She is a Geologist. Behind my house is a farm and behind that is Franklin County, Brookville, Indiana. There are three street lights and two cell phone towers. What I saw was a trapazoid of very bright lights, moving imperceptibly slow. It lasted for quite awhile. It moved from SE to NW towards Richmond. It would have gone most probably over Brookville Lake and the Connersville area. At my age, I have seen many unexplainable things in the sky, including a sphere on Long Island, NY, where I am originally from. Both were very odd and I, for one, felt compelled to watch it. It started as 5 lights and looked like the lower half of Orion. It then either turned, or something else occurred, because one of the lights went out and there were four. The question is asked what made me notice it: something or someone, told me to look outside. I had no real reaction to it, except curiosity. As I type this, I am able to turn around to see if it is back. The question of how I lost sight, is that I was busy making dinner and had to go back to what I was doing. It was there, however, all during dinner, which was about between 6 and 7 pm EST."],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Region":"Indiana","Longitude":"-85.137165","files":["/var/www/straped/mufon/html2text/20840.html.txt","/var/www/straped/mufon/org/20840.html"],"Summary":"Trapazoidal shape.","Object Shape":"Other, Unknown","Object Flight Path":"Other"}