{"Region":"Florida","Sighting Duration":"00:10:00","Disposition":"Hoax","divs":["Sighting DetailsGreetings everyone. I'm Heidi and I am 16 years old. I apologize for my english. Since very young I always loved Aliens but at my 8 I forgot about them and about the subject. After this kinda UFO sight I've been VERY obsessed with UFO's, Aliens and everything related to it, I remember everything clearly so here it is. I lived in Lake Buena Vista, close to Disney I think. It was another boring night, clear sky, warm outside, I was at the laptop, my brother and my aunt were at a local store and my mother was at my side watching TV. Suddenly she receives a call from my brother, I heard him yelling at her but I didn't knew why, I noticed her nervous, she quickly standed up and ran outside the apartment. \"What's wrong?\" I asked myself, but I thought there was a fire outside or something stupid so I kept chatting. A couple of minutes later I went to my bedroom to grab my iPod charger, I stopped abruptly because I had a feeling to get closer to the window and look outside, I did but didn't saw anything, except something on top of the forest at my left side. \"What the hell is that?\" I couldn't see anything since everything outside was dark, but had the feeling there was something in there and it was watching me. I got scared so I went back to the living room but it was the same thing since the balcony of the living room is facing the lake with the forest. -To make things clear, imagine a line of aparments of 3 floors each, a path with a small space of grass, then a lake and behind the lake a forest with no entrance to it.- 5 to 10 Minutes later or so the three of them came back, talking loud in excitement, I asked them what in the world happened. \"There was a UFO outside!\" My aunt answered. \"It was like disc-shaped, I'm not sure! But below of it had a very but very bright white light with a red light spinning, the two lights were spinning below that thing very fast, after a while it slowly moved to the north, it made odd moves like a slight up and down then we couldn't see it anymore because of the trees, it was amazing!\" My bro said very excited. He also took a picture but it looked like a star so he deleted it. Now that I'm writing this, if the UFO was located at the north-east area and moved to the north, where I was looking was at the south, what could it have been?"],"Tags":"City","City":"Lake Buena Vista","Case Number":"20855","Longitude":"-81.538684","Date of the Event":"06/19/2009 08:10 UTC","Date Submitted":"12/03/2009 02:41 UTC","files":["/var/www/straped/mufon/html2text/20855.html.txt","/var/www/straped/mufon/org/20855.html"],"Object Shape":"Disc","Latitude":"28.393619","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.393619,+-81.538684(20855)&iwloc=A&hl=en\"> mufon case (20855) map </A>","trends":["There has been one other sighting in Lake Buena Vista","There were no other sightings in Lake Buena Vista on or around June 19th 2009"],"Log Number":"US-12032009-0012","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Summary":"It wasn't a weather balloon or chinese lantern."}