{"Log Number":"US-12032009-0013","Object Shape":"Unknown","Case Number":"20856","Source":"MUFON","Longitude":"-98.488388","Latitude":"29.427122","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around November 30th 1967"],"Summary":"In-Person Contact with Alien Entity with Short Message","Object Flight Path":"Undisclosed","Date of the Event":"11/30/1967 12:00 UTC","files":["/var/www/straped/mufon/html2text/20856.html.txt","/var/www/straped/mufon/org/20856.html"],"Region":"Texas","City":"San Antonio","Tags":"City","Country":"United States","Sighting Duration":"00:10:00","Date Submitted":"12/03/2009 03:49 UTC","divs":["sighting detailsthis report is made on 12\\03\\2009 from a telephone conversation of alleged activity of an \"alien\" being by a mr. jerry faglie. on or about 2-3 pm on an undisclosed date in the year 1968 mr jerry faglie had a singular encounter with an unidentified person. this person entered mr. faglie's home and within the same room said one word to mr. faglie by a method described as telepathic communication. the one word which was repeated by the unknown entity several times was \"watch out.\" there was then a time loss by mr. faglie and intermittent memory loss til about 19:30 that afternoon. the unknown person did not make physical contact. there was not any physical marks to mr. faglie's body. no other lastig effects. the unknown person immediately left after inparting the one word several times. no ufo or any land or flying object was noted at the site. the entity was apparently adult size (unknown specifics) wearing a human type rimmed hat and what appeared to be a \"trench coat\". the feet were not obvious. the hands from bi-lateral arms were in the pockets of the coat. the head was visual identical to the large gray type species head with the large almond eyes. no mouth was visual. no other anatomical parts were noted at the site. mr. jerry faglie was the only contact and witness to this event. his age at the time was about 21. he denies drugs, alcohol or any other substance or situation to cause a change of reality from normal life. mr. faglie only recalls the event if reminded about \"aliens\" by the news or on television. mr. faglie is an artist and does note that he both consciously and unconciously paints to various sizes of \"aliens\" into his paintings. no purchaser of his art work has ever said anything unusual about this painted appearance. they appear both singularly and in groups in some paintings. mr. faglie at this time seems alert and oriented and not particularly disturbed by the events but rather a curiosity about them. he has reported other far distance visual events from the 1950s previously to the mufon national hq according to him. these 1950 especially 1953 events are easily confirmed by historial reports."],"Weather Factors":"None, Does Not Apply","Disposition":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.427122,+-98.488388(20856)&iwloc=A&hl=en\"> mufon case (20856) map </A>","Viewing Distance":"Unknown"}