{"divs":["sighting detailsthis is all true, this happened in 1952 i was 12 years old and this was long before i had ever heard of a ufo. i was on lunch break and standing in the play ground where ther was one tree it was in the fall and there were no leaves on it. as a little kid i was just looking at the sky and this tree, when here came this cylinder shaped thing passing from the north,it was going really,really slow no sound at all it was a dull gray about 20ft across and about 200ft long, it was rounded a bit on the front and flat in the back about a 1\\3 of the way back from the front around the circumference there were what appeared to me as good sized rivits [remmber i was only 12 and thats all i could relate them to]. this thing was only like 400ft in the air as it passed right over my head!. i watched it going south and little bit to the east until it came to some small hills and disapeared. this was in de norte colorado which is in the san luis valley. here is my 2nd siteing: my mom and i were going through north new mexico going east to texas,there again it was in 1952 but this was in the summer and we were on a long straight stretch of 2 lane highway and it being hot out there were these heat ripples comeing up from the highway, we were in a 1939 plymouth sedan and me being so little i was sitting way forward in the seat holding on to the dash, when out of these heat ripples there was what looked like a big dark line that was a little wider than the highway comeing straight at us it was really going fast and just before it hit us head on! it shot straight up, my mom hit the brakes hard and she pulled off of the road we sat there for a long bit of time before she could drive again. our car had what they called a viser over the top part of the windshield and with me up to the dash i could look up through the gap between the car and the viser. and what i saw was a disk [now i know it was a flying saucer] shooting straight up it was dull gray and the bottom or under side looked just like the bottom of one of my mom's metal pie pans. there was no sound to speak of, no flashing lights, and it was as clear as clear can be, but at this time we had never ever heard of a flying saucer. everything i have told you is 100% true!"],"trends":["There have been no other sightings in Del Norte","This sighting has never been favorited."],"Object Features":"Patterned Surface","Object Shape":"Cylinder, Disc","Disposition":"Unknown","Longitude":"-106.353368","Weather Factors":"None","Date Submitted":"12/03/2009 02:04 UTC","Log Number":"US-12032009-0010","City":"Del Norte","Region":"Colorado","Viewing Distance":"101-500 Feet","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20853.html.txt","/var/www/straped/mufon/org/20853.html"],"Object Flight Path":"Straight-line path,Other","Latitude":"37.678892","Summary":"As stated below I had two sightings one in Colorado one in New Mexico","Date of the Event":"02/29/1952 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.678892,+-106.353368(20853)&iwloc=A&hl=en\"> mufon case (20853) map </A>","Case Number":"20853","Country":"United States","Source":"MUFON"}