{"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There has been one other sighting in Kapaa","There were no other sightings in Kapaa on or around December 2nd 2009"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Summary":"inbetween full moon and ocean horizon, due east, bright orange small squares that seemed to stack out from each other, coming from to different directions heading towards each other then dissapearing","Case Number":"20854","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20854.html.txt","/var/www/straped/mufon/org/20854.html"],"Latitude":"22.093039","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"12/02/2009 12:00 UTC","divs":["Sighting Detailswe were having a fire on kealia beach, the full moon had just risen, had been up for maybe 45min-1hr. Orion was huge and to the right of the moon. Off to the left of orionns head star, i saw a bright light for just a second then it dissapeared, i thought what was that? then dismissed it. A few minutes later , I looked again and there was another bight light with a smaller one right next to it, the small one dissapeared and then so did the other one. ( it was the size of a large star so I just thought maybe it was a cloud), however, it was a perfectly rare clear horizon. Then, a few minutes later I looked up again and suddenly the light I had seen befor appeared, plus to the left of them, just under the moon and above the horizon, multple very bright orange lights that looked kind of like small square stars came from the left and the right towards each other almost as if they were stacking out form each other like stairs only horizontally. They lingered long enough for me to call out OMG look at the lights and we all sat there in amazement for at least thirty seconds as this occured before they all just vanished. It was very exciting and none of us had ever seen anything like it before. There was at least 7 adults and 5 children that witnessed this. Sorry to not have an image."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=22.093039,+-159.335092(20854)&iwloc=A&hl=en\"> mufon case (20854) map </A>","City":"Kapaa","Date Submitted":"12/03/2009 02:24 UTC","Object Shape":"Square, Rectagular","Log Number":"US-12032009-0011","Region":"Hawaii","Longitude":"-159.335092","Tags":"City"}