{"Date of the Event":"05/15/1995 07:15 UTC","Summary":"ufo sighting/abduction","trends":["There have been no other sightings in Harveys Lake","This sighting has never been favorited."],"Latitude":"41.363333","Disposition":"Unknown","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.363333,+-76.043889(20850)&iwloc=A&hl=en\"> mufon case (20850) map </A>","Date Submitted":"12/03/2009 10:25 UTC","Object Features":"Other","Log Number":"US-12032009-0007","Case Number":"20850","City":"Harveys Lake","files":["/var/www/straped/mufon/html2text/20850.html.txt","/var/www/straped/mufon/org/20850.html"],"Object Flight Path":"Hovering then path","Object Shape":"Other","Sighting Duration":"00:20:00","Viewing Distance":"101-500 Feet","Source":"MUFON","divs":["Sighting DetailsIt was a beautiful early morning ( 6 am.) a friend and I went fishing at a Lake a 25 minute drive from home. So we went to a a big rock across from a Park ( you can see the (old rickety roller coaster ) around a quarter mile across. There is a patch of hill than a stone patio next to dock we have permission to fish from. we decided to setup on the patio. As we fished you could see the street light across the way by the park. So we fished and some time later around a hour or two I noticed that the light didn't go out and seemed a little closer. I thought nothing of it and fished some more. Then I noticed it closer than BAM.......... I looked up in the sky and saw a Black object hoovering oh so slow above us moving toward our back. It looked like no UFOs I saw in books and other source before. The shape was like a small triangle in front with another bigger triangle behind it. I have a attachment drawing it was all black. AS I ran to the road that circumferences the lake the craft went slowly out of sight. When I ran back to Steve he looked bewildered , I said; hey man did you see that and he just keep fishing with a sort of nod. O asked him what time it was he said 10:30 am.. A hour or two disappeared !! It sort of freaked me out and excited me at the same time. Again Steve would not talked about the incident and that was that."],"Region":"Pennsylvania","Country":"United States","Longitude":"-76.043889"}