{"Case Number":"20868","map":"<A HREF = \"http://maps.google.com/maps?q=-36.84508,+174.769482(20868)&iwloc=A&hl=en\"> mufon case (20868) map </A>","trends":["There have been 51 other sightings in Auckland","There were no other sightings in Auckland on or around June 15th 2009"],"divs":["Sighting Details1.Driving a bus. 2.Lights in sky. 3.An aeroplane. 4.I first noticed two green lights in the sky which must have been a couple or so kilometers distant. The sky was dark and it had been raining recently but visibility was good. The lights were travelling from right to left at first but then the object turned towards the shopping mall where I had stopped to pick up passengers. It flew on a gently descending course until it flew into an area where it was lit up from underneath by lights in the shopping mall carpark when it became apparent that this was no aeroplane. It was somewhat larger than the bus I was driving. It had two green lights on it's left hand side, two red lights on it's right hand side, one of which was flashing, and a very bright white light on the front. It was an isosceles triangle in shape and black in colour. I couldn't make out any structures that may have been on top. I couldn't make out any means of propulsion. At it's closest it would have been much less than a hundred meters from me. I could hear no sound from it although there was some traffic nearby and the noise of my bus as well. It's speed would have been that of a small aeroplane. There were no visible windows on it. Other people must have seen it but I have seen no other reports. I didn't talk to any of the passengers about it. The name of the shopping mall is St. Lukes shopping mall and is in the Mt. Albert area of Auckland. I was in Morningside Drive facing towards Mt. Albert itself. The triangle flew paralell with Morningside Drive coming from the direction of Blockhouse Bay and heading in the direction of Grey Lynn or Western Springs. 5.I feel embarrassed admitting that I've seen this thing. During the sighting I felt surprised. 6.The object flew past the area of view from my windscreen."],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Region":"Auckland","files":["/var/www/straped/mufon/html2text/20868.html.txt","/var/www/straped/mufon/org/20868.html"],"Date of the Event":"06/15/2009 06:45 UTC","City":"Auckland","Object Features":"None","Tags":"City","Longitude":"174.769482","Object Flight Path":"Path with directional change","Country":"New Zealand","Date Submitted":"12/04/2009 01:26 UTC","Object Shape":"Triangle","Summary":"Black triangle flyby","Weather Factors":"Unknown","Latitude":"-36.84508","Source":"MUFON","Log Number":"NZ-12042009-0002"}