{"trends":["There have been 13 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around December 3rd 2009"],"Date Submitted":"12/03/2009 08:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.740401,+-88.537537(20863)&iwloc=A&hl=en\"> mufon case (20863) map </A>","files":["/var/www/straped/mufon/html2text/20863.html.txt","/var/www/straped/mufon/org/20863.html"],"divs":["Sighting Detailsapproximately 5:15 p.m. I was helping my boyfriend tow our van back to our house when I happened to glance up in the sky and a very bright rapidly blinking light with no steady blink whatsoever appeared right in front of me. It happened right at a moment that required intense concentration which made it very frustrating...as I was continuing to pay attention to the job at hand...I glanced again to the sky and another frantically blinking light appears about the same space in the sky where the first one appeared. The first blinking light was already on the other side of the sky. I took a deep breath and continued on. Once we got home, I got out of the van and looked up in the sky again and I counted 5 similar blinking lights just appear out of nowhere...they all flew in closer together and made a perfect triangle when another light appeared right beside it...then the whole formation just dropped in the sky behind a tree line. I wish I had a video camera to record this and show it to the world. My boyfriend and I as well as coworkers and friends have all witnessed numerous sightings this past year. All of them have been reported on this sight. If anyone else saw anything unusual in the skies tonight in the southern Illinois, Harrisburg to be exact...please report what you saw, there is no shame in the truth my friends."],"Latitude":"37.740401","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Region":"Illinois","Summary":"multiple blinking lights appear out of nowhere during time of stress","City":"Harrisburg","Source":"MUFON","Object Shape":"Star-like, Unknown","Log Number":"US-12032009-0020","Case Number":"20863","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Undisclosed","Date of the Event":"12/03/2009 05:15 UTC","Tags":"City","Weather Factors":"Unknown","Longitude":"-88.537537"}