{"Source":"MUFON","Object Flight Path":"Path then hovering","Log Number":"US-12042009-0001","Weather Factors":"None","Object Features":"Undisclosed","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around November 23rd 2009"],"City":"Cincinnati","Sighting Duration":"Undisclosed","Case Number":"20867","map":"<A HREF = \"http://maps.google.com/maps?q=39.109218,+-84.50574(20867)&iwloc=A&hl=en\"> mufon case (20867) map </A>","Tags":"City","Country":"United States","Disposition":"Unknown","Object Shape":"Triangle","Region":"Ohio","Date Submitted":"12/04/2009 12:03 UTC","files":["/var/www/straped/mufon/html2text/20867.html.txt","/var/www/straped/mufon/org/20867.html"],"Date of the Event":"11/23/2009 01:30 UTC","Longitude":"-84.50574","Summary":"Triangular shaped aircraft hovered above me for almost 5 minutes. It was at just above tree top level as far as I can tell.","Viewing Distance":"Unknown","divs":["Sighting Details As soon as I had made a left turn onto one of the back roads heading home from work, I immediately noticed two bright lights hovering over my neighborhood in the distance. It was approximately 1:30 a.m. on November 23, 2009. The reason these lights caught my attention is because after living in this area for over 30 years I know every shadow, every light, which lights are street lights, and which lights belong to the homes there. I am very much aware of my surroundings, and I know what belongs and what doesn't. These lights didn't belong. As soon as I noticed these lights, they started moving across toward the east toward the road I was on. The lights originally started out south west of me. They were just below the tree line of a wooded ridge situated ahead. That ridge is approximately 80 to 100 ft. high so this thing was fairly low. When these lights were directly up ahead of me, I remember thinking this can't be a ufo, and with that thought, all of a sudden a craft appeared above me as if to show me that they were there. The entire bottom of the thing was lit up, and I could see the original set of lights on the craft, but I don't remember seeing these lights fly toward me. The nose of the craft was pointed north. As I stared up at this thing through my windshield in disbelief, I had a feeling that I had seen it before but couldn't remember when or where. As it hovered at just above tree top level above me, I continued driving although I did slow down a bit. I was dividing my attention between the craft and the road, the whole time trying to figure out what it was. I remember thinking that the shape reminded me of one of our stealth fighter planes, but it could not have been. First, why would it be flying in our neighborhood that low, and second, I don't think it would have been that well lit up. I don't remember hearing any sound, and as I made my way to the first street on the right, I noticed that this craft was staying with me. It was as if it were watching me. After making my turn, I had to lean forward to get a good view of the craft and noticed that it seemed to be higher up in the sky than before, and it's nose was pointed east. I didn't see it change direction as I had to divide my attention between this craft and my driving. A few seconds later the craft disappeared. I didn't see it leave, and I couldn't see any sign of it in the sky. No lights. Nothing. I have searched the internet trying to find something that would at least come close to matching what I saw. The closest thing I can find is the stealth fighter F-117 Nighthawk, but the similarities are in shape only with still a few differences. It was triangular, and the back end was curved inward, and I don't remember seeing anything that would indicate tail wings. I was looking up at it so all I saw was the bottom of the craft. The two lights I saw originally were situated toward the front end of the craft and were inside a dark oval shape that looked like it was recessed. There were other details like lines and how they were placed is a little fuzzy in my memory, and for the exception of those lines and that oval shape, the entire bottom was brightly lit. I can't recall our military having anything that can hover like that, or disappear the way this thing did, and I would think that it would have been too dangerous for any aircraft to be flying in as low as this one did. I have not reported this to the police. I didn't think they would believe me, but I have told my co-workers and family members. One of my co-workers told me that she has a neighbor she teases a lot because she claims she sees ufos in this area almost on a daily basis around 5:00 a.m. So, it seems that our area might possibly be a hot bed for ufo activity, and I've never noticed it before."],"Latitude":"39.109218"}