{"files":["/var/www/straped/mufon/html2text/20865.html.txt","/var/www/straped/mufon/org/20865.html"],"Summary":"Two large light orbs approx 15deg apart hovering over coastline then moving south along coast.","Log Number":"US-12032009-0022","Date Submitted":"12/03/2009 11:05 UTC","Region":"Maine","map":"<A HREF = \"http://maps.google.com/maps?q=44.690285,+-68.812892(20865)&iwloc=A&hl=en\"> mufon case (20865) map </A>","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Other","Country":"United States","trends":["There have been 2 other sightings in Orrington","There were no other sightings in Orrington on or around November 30th 2009"],"Sighting Duration":"Undisclosed","Case Number":"20865","divs":["Sighting DetailsAt approx 730 pm my wife and I were driving north on I 295 at Cumberland area (Freeport side of the Exit). I looked to the northeast and observed two large lighted orbs at approx 30 deg above the horizon and 15 deg apart, hovering (not moving). I pulled over to watch them for about 30 minutes. They stayed hovering for about ten minutes in a position I esitmate to be somewhere south of Brunswick, Maine, near Freeport. After about ten minutes, the lights began to move south south east, following the coastline. This is the same route that I have taken in light aircraft when taking trips to Portland and points south (nice daytime views of the coastline). When the lights moved it was very very slow. Not knowing the distance away I am not able to est. the speed but guessing I would say 20 or so knots if they were over the coastline and not farther out to sea. I used a pair of field glasses and could multiple white lights making up each of the orbs. ( * * * ) They looked like a grouping of three lights. At no time did they change color or blink, instead just staying at the same intensity. After 30 minutes they were still \"ahead\" of us, still not 90 deg off our right side of the car. I then pulled away northbound and was able to view them for only a couple of minutes more, still traveling south south east along the coast disappearing around Yarmouth area. I have over 1200 hours in various light aircraft, 80% of it in Maine and New England. If I were asked, these lights did not act as any (known to me) typical aircraft, civilian or military. There were no strobe lights, no red or green position lights (red on the port or left side and green on the right or starboard side). There is a Naval Air Station located outside of Brunswick, Maine, BNS, but most if not all of the aircraft stationed there have been transfered due to it's closing next year. The lights reminded me of three \"landing\" lights in line. I was never close enough to be able to tell any shape, just in line ( * * * )."],"City":"Orrington","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"44.690285","Object Features":"Unknown","Disposition":"Unknown","Date of the Event":"11/30/2009 07:30 UTC","Weather Factors":"Unknown","Longitude":"-68.812892","Source":"MUFON"}