{"Weather Factors":"Unknown","Source":"MUFON","City":"Santa Clara","Disposition":"Unknown","divs":["sighting detailswalked outside my house to leave and pick up my wife. i saw an orange light in the sky that was a color i'd never seen in the sky before. it was about the size of venus in the evening winter sky when i first saw it. it was moving zig-zag slowly toward me, south-westerly direction, the zig-zags less than a few degrees in width from my view. i watched it meander closer and closer for about 3 minutes. as it got closer it was getting larger and based on trajectory and size increase i'd guess it was at 5,000-10,000 feet altitude. at a certain point it stopped, maybe 5 miles ne of my house (in santa clara, ca); at this time it was about 2-1\\2 times the size of venus and about as bright - still a unique orange color. the single light seemed to become two suddenly then three very small spheres dropped at free-fall speed from the object then slowed falling rate after 1 to 1.5 seconds (1\\3rd the distance to the ground). the three spheres were tiny from my perspective and the same color as the object\\lights. the spheres appeared to slow and then were not visible. it was slightly foggy so i'm unsure if the spheres went purposefully invisible or simply went out of sight to me. **** in the last two weeks my wife and i have seen several ufos; myself seeing 4 seperate events in the santa clara area. the first event maybe 2 weeks prior was two lights performing non-typical maneuvers at very high altitude around midnight. the other was a small metalic sphere about 2x the size of venus, in broad daylight. the main event described here is the only one reported to mufon."],"Date of the Event":"12/04/2009 07:25 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.360898,+-121.953436(20879)&iwloc=A&hl=en\"> mufon case (20879) map </A>","Object Features":"Undisclosed","Longitude":"-121.953436","files":["/var/www/straped/mufon/html2text/20879.html.txt","/var/www/straped/mufon/org/20879.html"],"trends":["There have been 12 other sightings in Santa Clara","There were no other sightings in Santa Clara on or around December 4th 2009"],"Country":"United States","Summary":"Orange light about 3 times the size of Venus; 3 small spheres released","Latitude":"37.360898","Case Number":"20879","Tags":"City","Object Shape":"Unknown","Object Flight Path":"Undisclosed","Region":"California","Log Number":"US-12042009-0013","Date Submitted":"12/04/2009 11:33 UTC"}