{"Tags":"City","Date Submitted":"12/04/2009 02:31 UTC","Country":"United States","Source":"MUFON","Log Number":"US-12042009-0004","Weather Factors":"Unknown","Case Number":"20870","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy girlfriend and I were driving a Budget Rental truck and towing her car because we were moving from Phoenix, AZ back to our hometown of Seattle, WA. We left Phoenix around 1pm in the afternoon and arrived in Las Vegas around 6:30pm and continued to head north via Highway 93. We were about 50-75 miles south of Ely and it was around 11pm or so on December 2nd. Both at how middle of nowhere we really were as there were absolutely no lights from buildings and only saw a passing car every twenty to thirty minutes or so. I remember we were just kind of lightly talking about how much we looked forward to getting to Seattle and how few stars we actually could see that particular night because of the full moon that was in the sky that night. It was during that conversation that we noticed to the NE of us over above the Mountain range to the east of us we saw a VERY bright redish white light that just appeared above the mountain range. We both saw it and it took a few seconds to register in my head that what we were seeing was not something normal. I asked her if she saw the light and she responded \"what the hell is that.\" Then the light literally disappeared and immediately reappeared to the right of where it originally was and was visible for a few seconds and then vanished and reappeared a third time in a spot higher above where it was the first two times then disappeared after only being visible for a few seconds. We both had the EXACT same reaction, both of our bodies were completely covered in goosebumps and the hairs on the back of our necks were sticking up. It was probably no more than 10 miles away and it was very obvious that what we saw was either human technology that is FAR beyond anything we are aware is out there, or something that truly cannot be explained. It honestly scared the hell out of both of us and we called our parents and they googled what we saw and realized we are not the only ones with a very similar story. I have NEVER been someone that took anyone's claims of seeing a UFO or anything like that seriously, pretty much always thought they were lying or insane, but after experiencing this and having someone in the car with me seeing it with me has completely changed my attitude on what might be out there. Truly amazing experience I won't forget."],"Object Shape":"Circle, Fireball, Flash","Viewing Distance":"Unknown","Region":"Nevada","trends":["There have been 9 other sightings in Ely","There were no other sightings in Ely on or around December 2nd 2009"],"files":["/var/www/straped/mufon/html2text/20870.html.txt","/var/www/straped/mufon/org/20870.html"],"Date of the Event":"12/02/2009 12:00 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Summary":"Bright red light appeared above Mts to East. Reappeared three seperate times immediately right after each other in three different spots.","Latitude":"39.249799","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.249799,+-114.887(20870)&iwloc=A&hl=en\"> mufon case (20870) map </A>","City":"Ely","Longitude":"-114.887"}