{"Viewing Distance":"Unknown","Summary":"Cigar shaped UFO, 1 red light, 2 green lights, did not blink, moving relatively slow.","Tags":"City","Disposition":"Unknown","Object Shape":"Cigar","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Latitude":"39.272708","divs":["sighting detailsit was about 9:53 pm and i was on my way in a carpool to my friends house. we were close to a store(giant, namely) and then it came from all the way in front of us and slowly came into view(we were at a red light). it was flying very low for an aircraft(about 2000 feet up). that was the first sighting, and the closest. i saw in detail(though i was wearing my not so powerful glasses) that there 2 cigar shaped bodies, with a bridge? connecting them both. at first, i only saw the 1 red light and 2 green lights emmited from the ufo as it was still on the horizon. it was dark, but there were streetlights. first, i though it was a bunch of junkies with colored lights. i just did some research and learned that red and green are legal lights, stated in this: http:\\\\periheliondesign.com\\downloads\\redandgreenledpositionlights.pdf . i was with 3 other people including the driver. we all saw it, though the driver was too busy concentrating on the road. the first time i saw it, i realized that i could take a picture with my cellphone. turns out, for some reason, it was broken(there was light, but just a black, empty screen). i have waited all my life for this, looking out the car windows, and the time has finally come. i was too stunned at first to open the window and start pointing. i was searching this whole day for more imformation on this cigar ufo. after the first sighting, the ufo dissapeared. it came into view again just above some trees in the horizon, and it was moving toward us, but i knew i shouldnt tell the driver to stop, and we drove in front of it and i never saw it again... i looked out the car window, stood outside, but stilll not trace. my friends and i were joking about politics and stuff, and i was the first to see it. i first noticed it just by chance, by looking out the window. my friend didnt tak it seriously, claiming that it was a disformed stoplight in the sky. well, i was the only one who took it seriously and tried to look at it the whole time. i did not feel any time laspes, radio interfereence, just my cell phone randomly breaking. the ufo moved in a straight line at a constant speed, and becuase it was pretty close, i dont think it was going that fast, mabye like 80 mph? i saw it in like 20 second intervals. i felt really disappoointed afterwards, since i hate ufo misteries..."],"Region":"Maryland","files":["/var/www/straped/mufon/html2text/20882.html.txt","/var/www/straped/mufon/org/20882.html"],"Log Number":"US-12052009-0003","Case Number":"20882","City":"Ellicott City","trends":["There have been 10 other sightings in Ellicott City","There were no other sightings in Ellicott City on or around December 4th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.272708,+-76.789887(20882)&iwloc=A&hl=en\"> mufon case (20882) map </A>","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"12/05/2009 10:51 UTC","Date of the Event":"12/04/2009 09:53 UTC","Longitude":"-76.789887"}