{"files":["/var/www/straped/mufon/html2text/20887.html.txt","/var/www/straped/mufon/org/20887.html"],"Disposition":"Unknown","Date of the Event":"04/15/2008 12:00 UTC","Latitude":"37.27765","Object Shape":"Oval","Log Number":"US-12052009-0008","Object Features":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-79.937647","Sighting Duration":"Undisclosed","Case Number":"20887","Country":"United States","Date Submitted":"12/05/2009 09:12 UTC","Viewing Distance":"Unknown","Summary":"4 oval shaped objects all different colors hovering at a telephone pole transformer","City":"Roanoke","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.27765,+-79.937647(20887)&iwloc=A&hl=en\"> mufon case (20887) map </A>","divs":["Sighting Details I had just left my mother-in-laws home going back to my home when I had driven about a block I came to a stop at a stop sign and something caught my attention. It was raining just a little, more of a sprinkling mist. At the top of a telephone there were 4 oval objects all different colors. It looked as though they were joind together side to side. The front one looked as though it was feeding off of the transformer. I thought to myself am I going crazy I wiped my eyes and shook my head but they were still there. I felt very scared at that moment not know what or if it could harm me in any way. I reached down for my cell phone hoping to take a picture but I had left it at home. I sat there for about 90 seconds before it started moving away from the transformer. It moved very slow at first and then it went down the line so fast and it was gone. I waited 3 days before I told my wife and to this day I have only told a few people because I can't explain it. I have a degree in Criminology and I am no idiot. I would like for someone explain to me what it was I saw. The reason I am writing you is because I can't get it off my mind after all this time."],"Region":"Virginia","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around April 15th 2008"]}