{"Object Flight Path":"Straight-line path","Case Number":"20894","Region":"Vermont","Date of the Event":"11/22/2009 12:00 UTC","Longitude":"-72.188701","divs":["sighting details11-22-09 at 6-7pm in vermont: i-91 runs (roughly) north and south along the connecticut river (n->s) between vermont and new hampshire.. rt.113, runs west over i-91 at exit 14, about 1\\2 between the top and bottom of vermont. perfectly clear night. lots of stars. great, unseasonably warm weather -- not even a light jacket! first, driving n on 91 between exits 13 and 14: behind the trees; a low line of lights. i think: \"towers\" - no, not towers. \"plane\" - no, too low and not moving fast enough. huh. we are discussing the new tv show \"v\". i am listening to the kids, and watching these lights, trying to figure out what is causing them.... wonder what that is... then --- it disappears. totally gone. i say out loud to my kids: \"that's just not right!!\" obviously, light \"disappearing is not \"normal\". my two children, young teens, both saw the lights and agreed; just not normal for them to disappear like that..... . drove along, thinking about this.... and the road turns a bit, and there they are - again....a perfect line of lights -- just appears again.... this time in full view over the highway. 3 to 4 cars had pulled over to watch. it was 4 white lights in a line; perfect, equi-distanace from each other, traveling slowly, and close to us \\ although, i wasn't worried about anything \"bad\" happening. the last light (right side -goes off -- gone. the first, farthest left light, shoots out a light to the left; which stops, equi-distance from the other ones; keeping the perfect formation. then, another farthest right light disappears. just gone. the farthest left light shoots another light out to the left; creating the same line of a perfect 4 lights - all equi-distant from each other; all moving slowly to the left (west)... keeps doing like this.. while we are trying to figure out what's doing this??? then, gone. just gone. we pulled behind another family to compare notes. they didn't see it \"take off\" either. \"just gone!\" bizz-aarrrr!!! very fascinating. wish we could see it again. still wondering. lots of people saw this..."],"Latitude":"43.811736","Object Features":"Unknown","Tags":"City","Date Submitted":"12/06/2009 01:08 UTC","Weather Factors":"None","Source":"MUFON","Object Shape":"Cigar, Other","Log Number":"US-12062009-0001","Country":"United States","Sighting Duration":"00:03:00","City":"Thetford","trends":["There has been one other sighting in Thetford","There were no other sightings in Thetford on or around November 22nd 2009"],"Summary":"First, low line of lights behind trees. Disappears.Totally gone. Obviously not \"normal\". Then, line of lights appears again....","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20894.html.txt","/var/www/straped/mufon/org/20894.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.811736,+-72.188701(20894)&iwloc=A&hl=en\"> mufon case (20894) map </A>"}