{"Region":"Pennsylvania","Summary":"2 Black Boomerangs w/ dim lights LOW FLYING SILENT ALMOST INVISIBLE!","Viewing Distance":"101-500 Feet","City":"Carlisle","Source":"MUFON","Object Shape":"Boomerang, Chevron, Other, Unknown","Country":"United States","Longitude":"-77.18631","trends":["There have been 6 other sightings in Carlisle","There were no other sightings in Carlisle on or around December 5th 2009"],"files":["/var/www/straped/mufon/html2text/20897.html.txt","/var/www/straped/mufon/org/20897.html"],"Sighting Duration":"00:00:15","divs":["sighting detailsi was outside having a look at the stars with my binoculars while visiting carlisle, pa. at approximately 9:30 pm. sky was completely clear, moon was 3\\4 full and there was very little unnatural light in this area, which made it a particularly good spot for sky watching as opposed to my home in the city. after spotting a very bright star through my binocs, i brought them down from my face to view the star\\planet with my naked eye when i see (2) black \"boomerang\" or \"chevron like\" crafts (the size of 2 stealth bomber jets each) flying extremely low, side by side (but 1 was slightly behind the other in formation).they each had 1 very dim, round, greenish\\yellow light on each wing tip (so 2 total lights per craft that blended in with the stars in the night sky so well). they were moving almost as if they were gliding through the sky, but at extreme speed. so fast in fact, that before i could bring my binoculars up to my face to see better details, they had zipped over our house and over the neighborhood, out of sight! these 2 objects were completely silent and produced zero vibration, which was shocking due to how low they were flying. had i not been looking up in the sky at that very moment and seen them, i would've had no idea they were even there. that's how \"stealth\" these objects were! they were all black in color and didn't have a body or passenger\\pilot cabin area at all (almost drone like). i described these objects as \"boomerang\", or \"chevron like\", but in reality they were a unique shape that i had not seen before, but those words would describe these crafts best. i have seen many planes fly over my home and my families over the years and living close to west point, ny and growing up here in pa by the army war barracks, also visiting military air bases all over the country to visit friends in the past, but i've never seen anything like this! the basic physics of these crafts did not fit in with our current technology (even \"secret ops\" that have been leaked to the public)just because of the height in which they were flying (very low) and their size, to cause no sound or vibration whatsoever was the most amazing thing about the whole sighting! you expect to hear or feel something (even a breeze??) when 2 objects the size of 2 stealth bombers each, fly over the roof of your house that low! it's a mystery! this was my first real sighting where i was able to see the crafts up close and personal to give a description. i went outside several more times over the night, through 5am and never saw anything else like what i had seen earlier. thanks:)"],"Disposition":"Unknown","Weather Factors":"None","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.20846,+-77.18631(20897)&iwloc=A&hl=en\"> mufon case (20897) map </A>","Object Features":"None","Case Number":"20897","Date Submitted":"12/06/2009 12:35 UTC","Date of the Event":"12/05/2009 09:30 UTC","Tags":"City","Latitude":"40.20846","Log Number":"US-12062009-0004"}