{"files":["/var/www/straped/mufon/html2text/20890.html.txt","/var/www/straped/mufon/more/20890_submitter_file2__stealthdrone.jpg","/var/www/straped/mufon/org/20890.html"],"Disposition":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.108368,+-84.51086(20890)&iwloc=A&hl=en\"> mufon case (20890) map </A>","Case Number":"20890","Longitude":"-84.51086","Object Shape":"Other","Summary":"Stealth Drone","Region":"Ohio","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsI was near the I-75 and I-475 exchange in Cincinnati, OH and it was almost completely dark and I was observing a strange shape in a cloud that I had noticed earlier in the day and was trying to photograph it but it was too dark to get a clear shot. I switched to video mode at the end to capture the essence of the enviornment I was in. At the time I could not clearly see the object floating in the foreground however I could tell there was something there. It was only after reviewing the short video that I could see the object and by then it was completely dark and I lost sight of it. My first impression after seeing the video was that it was a nearly transparent winged object like a dragonfly drone that was completely silent. It was the same shape as the hole in the cloud that I had been trying to photograh and it's possible it could have been some type of holographic image being projected from or connected to the cloud. It's easiest the see the object with the video size in Media Player set to 50%."],"Viewing Distance":"Unknown","Latitude":"39.108368","Source":"MUFON","City":"Cincinnati","Country":"United States","Weather Factors":"Unknown","Date Submitted":"12/05/2009 10:01 UTC","Date of the Event":"08/02/2009 12:00 UTC","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around August 2nd 2009","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Log Number":"US-12052009-0011"}