{"Summary":"UFO found in photo in airspace above Asherton, Texas","Weather Factors":"Unknown","Region":"Texas","City":"Asherton","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=28.443599,+-99.75894(20896)&iwloc=A&hl=en\"> mufon case (20896) map </A>","Longitude":"-99.75894","Object Flight Path":"Unknown","Latitude":"28.443599","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20896.html.txt","/var/www/straped/mufon/more/20896_submitter_file1__IMG_5915.JPG","/var/www/straped/mufon/more/20896_submitter_file2__IMG_5916.JPG","/var/www/straped/mufon/org/20896.html"],"Country":"United States","Log Number":"US-12062009-0003","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Asherton","This sighting has never been favorited."],"Tags":"City","Object Features":"Unknown","Case Number":"20896","divs":["Sighting DetailsIn October, while going over some photos that I had taken back in July, I found a strange object above a tree in the photo. I took two pictures within one half second from each other of the sky which contained the top of a tree and some clouds in the back ground. The photos were taken with a Canon XS DSLR at an F-stop of 5.6, using 70-300mm zoom lens. Weather conditions were typical of a South Texas afternoon in July. I was taking random test shots of the area to include the nice looking clouds, tree tops and my kids. The first photo attached does not contain anything. The second photo contains a small spect above the tree towards the middle. After zooming in, I noticed that it looks saucer shape but could not identify the object. The reason I beleive it is strange is because the object does not appear in the first photo, which was taken about half a second before the second photo. Keep in mind that it took me about four months to find it as I did not realize what I had captured until the day I was tranferring photos to my hard drive. The loaction is Asherton, Texas, which is about 150 miles southwest of San Antonio, Texas and 8 miles south of Carrizo Springs, Texas. The direction of the camera shot is in a southeast direction. I have enclosed gps coordinates. GPS: 28.456298 -99.758327"],"Date of the Event":"07/16/2009 06:19 UTC","Sighting Duration":"Undisclosed","Date Submitted":"12/06/2009 12:11 UTC","Object Shape":"Blimp, Disc, Oval"}