{"Disposition":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/20906.html.txt","/var/www/straped/mufon/org/20906.html"],"Weather Factors":"None","Viewing Distance":"Unknown","Longitude":"-86.573817","Date of the Event":"12/06/2009 07:45 UTC","Source":"MUFON","City":"Undisclosed","Region":"Tennessee","Case Number":"20906","Object Features":"Undisclosed","Object Shape":"Unknown","Log Number":"US-12062009-0013","trends":[],"Latitude":"35.519431","Sighting Duration":"00:00:20","Summary":"Strange lights seen hovering above mountain range beside of Interstate 81 in Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.519431,+-86.573817(20906)&iwloc=A&hl=en\"> mufon case (20906) map </A>","Country":"United States","Tags":"City","Date Submitted":"12/06/2009 11:43 UTC","divs":["Sighting DetailsI saw my third UFO today! I was driving on interstate 81 South, on the way home from a concert at about 7:45 PM (it was dark outside), and I looked to my left from the passenger seat at a mountain range, and saw two lighted objects. The first had one flashing red light on it, and was without a doubt a cell phone tower. But then, slightly to the right and a little higher up (too high to be a type of radio tower of any kind), I saw something wierd. There was what seemed to be an airborne object, with about five or six visible, non-flashing white lights on it. It was very far away, but I believe The lights formed a circle, like a disc shape. I can't be certain. But it was just hovering there for awhile. I thought at first it was a helicopter but it had no flashing lights, and most helicopters would not hover for as long as I saw this hover. I was able to shoot a 20 second video with my digital camera, but it is very poor quality. I will try to post it in the future anyway. I watched it stay there for about 20 seconds, and it disappeared behind the mountain since we were driving and the mountain came between us and it. My father also witnessed it, and could not identify it either. After we passed the mountain, I looked back and saw it for a fraction of a second longer before I lost sight of it totally because of the mountains. I travel that section of interstate 81 several times every week, so I will return to that spot later in the daylight and check for any kind of radio towers that I could have mistaken for a UFO. Thanks for taking time to read my report."]}