{"Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/20909.html.txt","/var/www/straped/mufon/org/20909.html"],"City":"Charlotte","Region":"North Carolina","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"35.231977","divs":["Sighting Detailswent outside to smoke a cig, looked up because it had started to clear up removing some clouds. When I looked up I saw what looked like a neat looking constellation in the shape of a tryangle. Just as I was about to go back inside one of the \"stars\" started to move, it appeared to me that it was coming closer to earth instead of moving left or right. I wanted to see where it would end up going, so I waited a little bit longer. It suddenly started to move the side where the clouded where, and I was thinking great now I can't even see it. Again, right when I started to head back once again the \"star\" came out of the clouds and was idle... at this point I thought I was just seeing things. Right then the other two \"stars\" shot the other way going away from the first \"star\" that moved. Needless to say my mouth dropped. The first \"star\" then went backwards threw the clouds and then shot out to the other two who then spilt up and started going in and out of clouds, almost in a playful like way. I watched for a good 1.5 hours and they just kept moving back and forth. At one point the first \"star\" almost looked like it was going to hit one of the other ones but didn't then all three just disappear. Sorry I used to \"star\" as a way to describe it but that is what they looked like, but obviously didn't act like... WOW! I will never again question or laugh at UFO sightings. This is one of the coolest things I have ever seen."],"Object Shape":"Star-like","Object Features":"Undisclosed","Case Number":"20909","Object Flight Path":"Undisclosed","Summary":"three objects were moving and going in and out of clouds.","Log Number":"US-12072009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=35.231977,+-80.836427(20909)&iwloc=A&hl=en\"> mufon case (20909) map </A>","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around December 7th 2009"],"Longitude":"-80.836427","Disposition":"Hoax","Sighting Duration":"01:00:00","Date of the Event":"12/07/2009 02:30 UTC","Weather Factors":"Unknown","Date Submitted":"12/07/2009 05:40 UTC"}