{"Object Flight Path":"Undisclosed","Case Number":"20900","Object Features":"Undisclosed","Country":"United States","Longitude":"-86.088599","map":"<A HREF = \"http://maps.google.com/maps?q=35.481743,+-86.088599(20900)&iwloc=A&hl=en\"> mufon case (20900) map </A>","Date of the Event":"12/05/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/20900.html.txt","/var/www/straped/mufon/org/20900.html"],"Region":"Tennessee","Sighting Duration":"00:10:00","Summary":"Stars forming several triangles and patterns then disappearing. Some were flashing red the others just looked like normal stars.","trends":["There have been 7 other sightings in Manchester","There were no other sightings in Manchester on or around December 5th 2009"],"Log Number":"US-12062009-0007","Disposition":"Insufficient Data","Date Submitted":"12/06/2009 04:33 UTC","Object Shape":"Flash, Star-like, Triangle","Tags":"City","Latitude":"35.481743","Source":"MUFON","divs":["Sighting DetailsA friend called me and told what he was seeing and the area it was happening so I went driving to that area of town. It's very dark out and very clear skies so we can see well. Start noticing these triangles forming some huge some small but several of them.They look exactly like stars besides a few which were flashing red.these triangles would start connecting and then reassemble into larger or smaller shapes. At the base of some of them were the red flashing lights that would stay stationary for a minute or two then they would fly in different directions with strange flight patterns.These red lights would then connect to other triangles then be stationary again for a while.This went on for ten to fifteen minutes then simply stopped.This was on Dec.5,2009 around 10:00 p.m. Up to seven days prior the same things had been sees by other people but this was the night that I had seen them for myself.It was very exciting and so real that I still can't calm down about it so I contacted you guys and maybe we can all make some sense of it."],"Viewing Distance":"Unknown","City":"Manchester","Weather Factors":"Unknown"}