{"Summary":"This is my UFO Sighting","Tags":"City","Object Shape":"Triangle, Other","Object Features":"Other","Log Number":"US-12062009-0008","Case Number":"20901","Longitude":"-87.031098","Latitude":"30.641575","Sighting Duration":"Undisclosed","Date Submitted":"12/06/2009 04:55 UTC","divs":["sighting details my first ufo sighting was at age 10 when i lived in portland maine. there were 4 other people that saw the ufo when i did. there was a group of us kids out playing hide and seek during the summer of 1982. a object with 4 inverted triangles appeared just above the tree line.the object appeared to have made some kind of banking\\rolling type move at first sight. the object was as big as a house. the four triangles were rotating clockwise, and were outlined with dull red lights.the surface was black with lots of mechanical looking devices all over it. upon further inspection the object or objects appeared to be elongated prisms, each about as long as a yacht. the objects appeared to be in some type of formation.i'm not sure if they were attached to each other, but it did move as one vehicle. they hovered there for about 5 minutes not making any sound at all. the group of kids i was with started yelling\"oh my god, it's a ufo.\" we all got on are bikes, when the object began to move south at a slow crawl, and followed it as far as our tiny legs could pedal. it was the most incredible experience i have ever had in my entire life. i will never forget it. we went back to the same spot where we first saw the ufo, and there was a black helicopter flying low with search lights. they seemed to be looking for something or someone.it's been 28 years ago since i have been in contact with the other witnesses."],"Source":"MUFON","Date of the Event":"06/20/1982 04:17 UTC","Country":"United States","Disposition":"Unknown","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/20901.html.txt","/var/www/straped/mufon/org/20901.html"],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=30.641575,+-87.031098(20901)&iwloc=A&hl=en\"> mufon case (20901) map </A>","City":"Milton","Region":"Florida","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Milton","There were no other sightings in Milton on or around June 20th 1982"]}