{"Viewing Distance":"Unknown","Date Submitted":"12/07/2009 09:44 UTC","Object Features":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.2777,+-119.227175(20907)&iwloc=A&hl=en\"> mufon case (20907) map </A>","Case Number":"20907","Latitude":"34.2777","Disposition":"Insufficient Data","trends":["There have been 17 other sightings in Ventura","There were no other sightings in Ventura on or around May 31st 1971"],"divs":["Sighting DetailsI was going to Sawyer college in Ventura. My sister and brother in law whoi was driving, came and picked me up. I sat in the back seat. It was dark out. We took an old shortcut to Santa Paula where my sisters house was, called Foothill Road. I was just thinking about college, and holding my books in the back seat, when we got to the peak of a hill, when I looked out of the window, and say what was very bright, hovering in the sky. It was not too far away from us. I said nothing, and as I stared at the object, I could see what appeared to me, as my eyes adjusted, 8 to 11 spots of very strong light around what looked to be a craft, covered in fog like substance. My sister then looked out the window, and saw the same thing. I was a little scared but curious more. You could see the lights of Ventura off in the distance. I wanted my brother in law to stop, but he kept on driving, so I looked at the craft until it was out of sight. Later when I moved back to Massachusetts where I was from, I was in an emergency room of a hospital, for what I don't remember, but there was this movie on UFO's on the TV> I wrote down all I could about it, and later found out where I could order it. It was not on sale to the public, when I ordered it. It was called UFO's are Real! I paid sixty dollars for it. When I started the film, video, I saw what was filmed at the islands of of Ventura about forty miles out, where there was this UFO flying at slow speed over them. It was taken by a fisherman, who was out there at there time. There was this one time Air Force Leutenant, who used to see them when flying in aircraft for the Air Force. They used to film them. One such film was a number of UFO's on the ice, while flying over Alaska. I was also interviewed from somebody from the airforce, who told me t6hat he believed what I saw was a real UFO. Everytime something was on TV about UFO's I would video tape it, or if I saw a bood on them, I would buy it. I know what I saw, and it was real. I'll even take a polygraph if needed to let people know it was real. Yes, UFO's exist!!! I don't care what anybody says. I don't care if the government is covering up there sightings. Lucky for us they are not hostile. Jesse Garon."],"City":"Ventura","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/20907.html.txt","/var/www/straped/mufon/org/20907.html"],"Longitude":"-119.227175","Object Shape":"Disc","Country":"United States","Date of the Event":"05/31/1971 12:00 UTC","Log Number":"US-12072009-0001","Sighting Duration":"Undisclosed","Summary":"Coming back home from college when we spotted the UFO.","Weather Factors":"Unknown","Region":"California","Source":"MUFON"}