{"Case Number":"20905","Longitude":"-117.289942","Disposition":"Insufficient Data","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Region":"California","Viewing Distance":"Unknown","Date Submitted":"12/06/2009 09:34 UTC","Summary":"slwo moving craft with blinking red light on top & bottom \"appeared\" over beach instantly, then moved like a blimp.","Object Features":"Undisclosed","divs":["Sighting DetailsThe craft appeared over the beach in the west suddenly our of nowhere. It appeared as a lighted triangle with a round outline within the triangle - similar to the hindu sign of a circle in a trianble. It had white blinking light showing on the top east side and 2 very bright red blinkers on top west side and bottom. The craft was at position angle 1-2, from my position heading south, the craft moved just faster than I could run, approx est speed 20 mph heading south. The major oddity was I was running south for 15 minutes prior to this object \"appearing\". At the blimp speed it would have to come across the ocean which was well light being 3rd night after full moon and tide was way out. The water was clear and stars were visible. I blinked and the thing appeared. I thought it was the moon with a plane crossing its path for a minute, but then thought - wait a minute, where the heck did the moon come from all the sudden. I watched it and put it together that it was a single craft moving south directly off shore, maybe right over the shoreline. Flagged a witness who confirnmed he saw the craft too, but it was some distance. Blimps can not appear as this, so it was either stealth and turned on the ilghts, or zoomed into position and quickly! Warning zeitgesiters - the shaman can see!"],"Object Flight Path":"Undisclosed","trends":["There have been 13 other sightings in Encinitas","There were no other sightings in Encinitas on or around December 6th 2009"],"Log Number":"US-12062009-0012","Latitude":"33.039307","Object Shape":"Triangle","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.039307,+-117.289942(20905)&iwloc=A&hl=en\"> mufon case (20905) map </A>","City":"Encinitas","Date of the Event":"12/06/2009 05:38 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/20905.html.txt","/var/www/straped/mufon/org/20905.html"]}