{"files":["/var/www/straped/mufon/html2text/20916.html.txt","/var/www/straped/mufon/org/20916.html"],"Log Number":"US-12082009-0002","Disposition":"IFO","Object Shape":"Circle, Star-like, Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.419263,+-72.015118(20916)&iwloc=A&hl=en\"> mufon case (20916) map </A>","Case Number":"20916","Date of the Event":"11/17/2009 07:05 UTC","Country":"United States","Region":"Vermont","Latitude":"44.419263","Viewing Distance":"Unknown","Date Submitted":"12/08/2009 07:24 UTC","divs":["Sighting DetailsThis is regarding MUFON Case # 20894 which took place in Vermont along rt. 91. I'm pretty sure I saw the same thing that the witness describes, but 5 days earlier. The difference is I give you a Identified Fly Object report, I think I know what I (and the other witness) saw. I was driving southbound on Rt. 91 and was nearing Wells River, Vt when I saw a line of lights in the sky. They were drifting slowly from East to West and remained in a straight horizontal line. Now let me make this clear, I've been researching UFO's my whole life, and I've seen some strange things, but this was really weird. The lights were clearly there, they could be nothing else (no lights reflected into the sky, and so on). I continued going through the list of possibly causes and not finding anything, and meanwhile the lights were drifting slowly. Every ten seconds or so, a new light would appear on the West end of the line, and a light at the East end of the line would disappear completely. Then I came to a conclusion, and I believe to it be correct. I think that that these lights (and possibly the others witnessed in the same area of Vermont) were nothing more than military flares shot from an aircraft (a la Pheonix Lights except they didn't last that long). They did indeed appear, just as the witness in case 20894 says, to be drifting and a new one would appear on one end of the line and at the other end one would disappear. They drifted slowly, presumably on the wind. Why the military was dropping flares, I couldn't say. Thank you for your time, and consideration."],"Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in St Johnsbury","This sighting has never been favorited."],"Longitude":"-72.015118","Sighting Duration":"Undisclosed","City":"St Johnsbury","Summary":"Several lights in a line over the highway.","Tags":"City"}