{"Date of the Event":"12/03/2009 05:30 UTC","Object Features":"Unknown","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Summary":"Very bright object with bright white lights","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around December 3rd 2009"],"Weather Factors":"Unknown","Tags":"City","Log Number":"US-12072009-0006","Case Number":"20912","Country":"United States","Longitude":"-121.4846","Date Submitted":"12/07/2009 07:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.584682,+-121.4846(20912)&iwloc=A&hl=en\"> mufon case (20912) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/20912.html.txt","/var/www/straped/mufon/org/20912.html"],"divs":["Sighting DetailsMy mother and a friend were driving south on I-5 from Oregon to Sacramento, CA. We were about 20 miles north of the Sacramento airport when I looked ahead in the darkness to see a very bright light floating ahead of me in the distance. At first I thought maybe it was a light on a hill or mountain, but there was no mountain or hill in that direction. I then thought it was a large antenna with a light on top to do with the airport, but as we got closer, it was obvious that there was nothing attached to the bottom. As we got closer, the object seemed to go from an unusual shape (Like the shape of a \"P\") to a triangle. As the Interstate turned, eventually the object got brighter as we got closer and it ended up being on my right hand side. At one point, I thought it was a plane beginning it's desent into the airport, but I soon realized that it had stayed in one place the entire time. Since I was driving, I really couldn't look at it for long periods of time. As I looked to my right, the object was very low with a lot of bright white lights and a shiny metalic color on the side and one blinking red light. As we past the object, it began to quickly move from west to east across the interstate over us. I looked in my rearview mirror about 15 seconds later and it was nowhere to be seen."],"Latitude":"38.584682","Disposition":"Unknown","City":"Sacramento","Object Shape":"Triangle","Viewing Distance":"Over 1 Mile, Unknown","Region":"California"}