{"divs":["Sighting DetailsMy wife and I were driving north on Vermillion trail (highway 4) from Duluth MN to our home in Gilbert MN It was after sunset but the sky was not yet totally dark. somewhere slightly north of the Whiteface Reservoir we noticed the 3 orange orbs in the sky to the north east. They were orange but at times looked like they were on fire the orange color was streaked and moving we had no Idea what they were. much to large to be radio tower lights. They were moving around each other but staying in roughly the same area in the sky sometimes one would become smaller and dimmer until it disappeared. then it would come back. all 3 exhibited this behavior. we saw them for roughly 10 minutes. during all this we had continued driving slowly. and I thought it odd that we didn't drive past them so they may have been moving with my car because they did stay in the same area of the sky. the size of them was quite large. not as large a a full moon but I had the sense that they were quite close. I had no fear and and felt quite calm and fascenated by this show in the sky and was dissapointed when they all 3 winked out and were gone. My wife and I compared notes and we both saw the same thing and the calm feeling. i have since been on this road at similar time of the evening hoping to see them again but no luck."],"trends":["There have been no other sightings in Markam whiteface lake","This sighting has never been favorited."],"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"47.273264","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Object Features":"None","Log Number":"US-12082009-0003","files":["/var/www/straped/mufon/html2text/20917.html.txt","/var/www/straped/mufon/org/20917.html"],"Object Shape":"Sphere","City":"Markam whiteface lake","Date Submitted":"12/08/2009 10:14 UTC","Tags":"City","Weather Factors":"None","Country":"United States","Summary":"3 Orange Orbs large in the sky moving and fading in and out","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=47.273264,+-92.220183(20917)&iwloc=A&hl=en\"> mufon case (20917) map </A>","Object Flight Path":"Straight-line path","Date of the Event":"05/15/2009 08:00 UTC","Longitude":"-92.220183","Case Number":"20917"}