{"files":["/var/www/straped/mufon/html2text/20923.html.txt","/var/www/straped/mufon/more/20923_submitter_file1__Picture100.jpg","/var/www/straped/mufon/more/20923_submitter_file2__Picture101.jpg","/var/www/straped/mufon/more/20923_submitter_file3__Picture104.jpg","/var/www/straped/mufon/org/20923.html"],"Log Number":"CA-12082009-0009","trends":["There have been 3 other sightings in Mission","There were no other sightings in Mission on or around November 5th 2008","This sighting has never been favorited.",""],"Disposition":"Unresolved","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Saturn-like","Date Submitted":"12/08/2009 08:35 UTC","Summary":"was seen in the west skys for weeks took pics on a clear nite with kodak easyshare cam","Source":"MUFON","Object Flight Path":"Stationary","Object Features":"Undisclosed","Case Number":"20923","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=49.133714,+-122.311288(20923)&iwloc=A&hl=en\"> mufon case (20923) map </A>","Latitude":"49.133714","Region":"British Columbia","Sighting Duration":"Undisclosed","Weather Factors":"None","Date of the Event":"11/05/2008 01:11 UTC","Longitude":"-122.311288","divs":["Sighting DetailsFor weeks i pointed out this light in the sky to friends and co-workers ...some said it was the ISS,or satellite. i didn't think it was,it wasn't like any star or satellite i have ever seen, it just seemed real close to the earth like it was in the atmosphere not in orbit, over a few days it seemed to get closer to the earth or to my posision so i decided to see if i could get a zoom shot of it, i took 11 pics 7 of them are out of focus or blurred from shaking but still have some value, 4 of them are clear showing the object and the moon, i took the pics facing west toward vancover from mission bc on a upward angle of about40-50 deg. it stayed in the nite sky for about three weeks until i looked up one nite and it was gone ,to the naked eye it just looked like a very bright white lite with a faint pulse to it , it wasn't till about 6 months later i uploaded the pics from the camera to my computer and had a look at them [ hadn't looked at them due to my fathers death in early dec. that year] when i noticed it had a \"saturn\" like shape to it. then it wasn't till i seen some similar pics on utube i went back to my pics and compared them to ones on utube, it looks exactly like the one from apollo 16 \"we have a boggy at 10 o'clock\" video i was shocked at the similarities which led me to doing this report, my only goal with this report is to share what i seen and get a answer as to what it was ? thanks for taking a look at them and if you would like the out of focus ones i gladly send u them if you request them and if you know what it was i would love to know?"],"City":"Mission"}