{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.483393,+-86.087199(20929)&iwloc=A&hl=en\"> mufon case (20929) map </A>","Source":"MUFON","Date of the Event":"11/29/2009 07:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-86.087199","Weather Factors":"None","Tags":"City","Object Flight Path":"Other","Log Number":"US-12092009-0002","Object Shape":"Diamond, Triangle, Other","Summary":"The single most miraculous thing that I have ever witnessed","files":["/var/www/straped/mufon/html2text/20929.html.txt","/var/www/straped/mufon/org/20929.html"],"City":"Manchester","Region":"Tennessee","Country":"United States","Disposition":"Unknown","Date Submitted":"12/09/2009 11:48 UTC","Case Number":"20929","divs":["Sighting DetailsMyself and 2 friends were out riding around on some back roads here in Manchester. We are coming up on their house when I notice a \"star\" move. I pull into one of his neighbors driveways and cut off my headlights. Being as this isn't the first time Ive ever seen weird things in the sky I immediately hang myself out the window to get a panorama of the clear night sky. We start watching all the stars more closely and pretty soon they are all switching positions and forming constellations (there were 2 Orions, 2 big dippers) then they fall out of those shapes and start taking the triangle and diamond shapes I'm familiar with. We watched in awe for the next hour while the ENTIRE sky filled up with these unfathomably large crafts. At some point in all this a craft became upright and was in the shape of a pyramid, with a smaller inverted pyramid at the bottom. All during this time there were single \"stars\" (individually manned crafts)moving in all parts of the sky. We drive around and get a different angle on the huge pyramid and we see these single \"stars\" coming out of ports on the inclines of the craft (we can see recessed lights in the ports). We drove around all night getting different vantage points, on multiple occasions they responded to being \"bright lighted\", they would actually flash back."],"trends":["There have been 7 other sightings in Manchester","There were no other sightings in Manchester on or around November 29th 2009"],"Latitude":"35.483393","Object Features":"Undisclosed"}