{"Log Number":"US-12092009-0001","City":"Woodburn","Object Features":"Undisclosed","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=45.148351,+-122.853162(20928)&iwloc=A&hl=en\"> mufon case (20928) map </A>","Source":"MUFON","Longitude":"-122.853162","Country":"United States","files":["/var/www/straped/mufon/html2text/20928.html.txt","/var/www/straped/mufon/org/20928.html"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Date Submitted":"12/09/2009 01:22 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Tags":"City","Summary":"Three bright white lights one small red one. Stream line exterior.","Region":"Oregon","trends":["There have been 5 other sightings in Woodburn","There was one other sighting in Woodburn on or around August 12th 2009"],"Date of the Event":"08/12/2009 08:30 UTC","Case Number":"20928","divs":["Sighting DetailsI was driving north on I5 about 8:30 pm on August 12 2009. I was almost to Brooks Ore. when I saw a really bright light, not blinking, heading south, parallel to I5. It looked like it was over the Pilot fueling station in Brooks Ore. The reason it caught my attention, was because of how low the object was flying above the ground. So, I figured it was a helicopter flying at a low altitude to inspect, or look at something. As I got closer, it flew over I5 and it was further away than I thought. As it flew over I5 I got a look at the bottom and saw three bright white lights in a triangle formation, with a small non blinking red light somewhere on the bottom. After flying over the interstate, the object hovered behind some thin trees at the Norpac cannery in what I think is a cabbage patch. From the side it looked like a Jet with no wings. I was baffled. I know for sure that there was no propeller. I passed the object at the Norpac plant on I5, it was approx. 90-110 feet above the ground and going maybe 20-30 MPH. I got a pretty good look at it. It was dusk, but I could see that it did not have any wings or propeller, and no blinking lights. It looked like it was matte silver or gray. I remember seeing a car pulled over on the side of the interstate. I dont know if it was related. I told a couple of close friends and family, and they all thought I was seeing a helicopter or a small plane. I drive that section of freeway alot, and commuted to Woodburn Ore. from Salem Ore. for a year on graveyard shift. It took along time to say or tell anybody about it, because of ridicule. I still think about this event almost everyday. What ever this craft was, man made or not, Ive never seen anything like it before."],"Latitude":"45.148351"}