{"Sighting Duration":"00:10:00","Longitude":"-0.20966","Object Shape":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=51.096196,+-0.20966(2092)&iwloc=A&hl=en\"> mufon case (2092) map </A>","divs":["Sighting DetailsI was at home sitting down when three bright lights caught my eye out of thewindow.They looked like very bright stars.As they got closer they got bigger asthey got bigger they became clearer.They got very close to the house I ran outside the frount. There was three very large ufos.They just stoped above thetrees across the road.All three were round with a dome on top.The windows weresquare and went right around.It was very bright inside and I could not see anything in the windows.Then one went straight ahead.The other went to the right.The other one stayed right where it was.I dont know how long it lasted for. Assoon as the other two went they were back.They took up the same position and allthree left as they came.It was if someone pushed reverse.I was not frightend Ieven waved.When they left I sat down I felt very calm. I have only told myFamily this. As far as I know I was the only one who saw this which I find hardto beleave.There was no sound at all.I live near Gatwick Airport and worked atthe airpoot so I know what a plane looks like.They were not aircraft.I cant putthe latitude or longitude as i dont know how sorry.It was dark and there was noclouds in the sky.This happened a long time ago and I can still see them as ifit was yesterday. had to put CA as it would not send take no notice"],"Country":"United Kingdom","Viewing Distance":"21-100 Feet","Summary":"three large ufos","Latitude":"51.096196","Weather Factors":"Unknown","Tags":"City","Date Submitted":"11/30/1977 09:00 UTC","Region":"England","Case Number":"2092","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2092.html.txt","/var/www/straped/mufon/org/2092.html"],"Object Features":"Dome, Window(s)","City":"Crawley","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in Crawley","There were no other sightings in Crawley on or around November 30th 1977"],"Log Number":"","Date of the Event":"11/30/1977 09:00 UTC"}