{"Country":"United States","Date of the Event":"12/07/2009 12:00 UTC","Longitude":"-81.538985","Latitude":"35.91402","City":"Lenoir","Object Shape":"Sphere","Log Number":"US-12092009-0003","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["Sighting DetailsI have seen these two orangish-yellow orbs over Lenoir, NC, three times over the past few weeks. The first time was in the car with my grandfather. He saw them too. It was strange, but I didn't think too much about them. The second time was on November 28. I was in the car with my sister and her husband. A few hours later I saw a helicopter heading in the same direction where we saw them last. The last time was on December 7, which was the strangest sighting. I was with my sister, and we went outside with her dog and saw one of the orbs moving very quickly across the sky. Then we watched it disappear, and reappear again a little farther away. All three nights were clear, and they all happened around the same time, approximately 8pm. A little while later we went back outside and saw another orb in the same spot, but it didn't move, and we could see the other one across this big field. The one that didn't move did the disappear, reappear thing too. Either these orbs are pretty close or pretty big. We couldn't hear anything unusual though. Another strange thing we saw on that same night of December 7 was a red light that flickered. It was in the same part of the sky as the unmoving orb. It moved back and forth in a swaying motion, and then it too disappeared. My sister has saw a red light moving quickly across the sky in the same area too, and she heard a helicopter shortly after. It's all been in the same area at the same time, except for on November 25, we saw something during the day, but in the exact same spot. Four children also witnessed it with us. It was faint, kind of grayish in color. It didn't appear to be round, and we also watched this one vanish. There was a helicopter closeby. Also, for about a year, there's been this bright, star-like object that we can't explain. It almost looks like a planet but we don't know if that's a possibility. Plus, for about the same amount of time, we've been seeing these little, blinking lights pop up all over the sky. They look triangular, with a white light on the top point and two red lights for the base points. They don't move, so they can't be planes and I don't think they could be satellites. It's all just strange and kind of discomforting because I've lived here my whole life and never seen anything like any of it before. I'm very interested in this kind of thing, but I find this almost frightening. We were shaking when we saw the orange orbs vanish right in front of us. This is such a small, rural town. The closest airport is half an hour away and there aren't any military bases nearby. The objects were mostly in the northwest, and if they moved they were headed southeast. I'm just not sure what to think of it..."],"Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Region":"North Carolina","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.91402,+-81.538985(20930)&iwloc=A&hl=en\"> mufon case (20930) map </A>","Case Number":"20930","Date Submitted":"12/09/2009 04:16 UTC","Weather Factors":"None","Sighting Duration":"Undisclosed","Summary":"Two yellow- orange orbs over Lenoir, NC. Seen three different nights. One always moves and the other doesn't. They disappear and reappear.","files":["/var/www/straped/mufon/html2text/20930.html.txt","/var/www/straped/mufon/org/20930.html"],"Disposition":"Unknown","trends":["There have been 6 other sightings in Lenoir","There were no other sightings in Lenoir on or around December 7th 2009"]}