{"City":"Durham","files":["/var/www/straped/mufon/html2text/20936.html.txt","/var/www/straped/mufon/more/20936_submitter_file1__Frame1.jpeg","/var/www/straped/mufon/more/20936_submitter_file2__Frame2.jpeg","/var/www/straped/mufon/org/20936.html"],"Object Features":"Patterned Surface","Latitude":"35.998763","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.998763,+-78.896709(20936)&iwloc=A&hl=en\"> mufon case (20936) map </A>","Object Flight Path":"Stationary,Path then hovering","Summary":"Moving objects were hovering near a chemtrail","Object Shape":"Circle, Disc, Triangle","Region":"North Carolina","Weather Factors":"None","Source":"MUFON","Date Submitted":"12/10/2009 01:28 UTC","Case Number":"20936","Date of the Event":"12/06/2009 10:24 UTC","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around December 6th 2009","This sighting has never been favorited.",""],"Tags":"City","Disposition":"IFO","Sighting Duration":"00:07:00","Log Number":"US-12102009-0002","divs":["Sighting DetailsI was driving to church, for Sunday morning service. I was driving south on US Highway 15-501. There were a few chemtrails in the sky. The weather was great, and the sun was out, so I decided to pull over to the shoulder of the highway, and my judgement was I had good angle to take pictures of chemtrails. The clock in my car read as 10:21am. I pulled off the highway at about 1000-1500 feet past the Morreene Road overpass. The traffic was light, but I put my hazard lights on- anyway. The only access that I had to a digital camera was my cellular phone, and I removed the phone from my purse and activated the camera function. My cellular phone was manufactured by Sanyo, Model Number SCP5500KIT, registered for service with Sprint Communications. As my car was facing the south,and the direct path of the sun, I focused my lens on a chemtrail in the Eastern portion of the sky. On my LCD, I immediately noticed circular objects moving around on the screen, particularly one surrounded by pink light. I knew instantly, that these were probably spacecraft, so I snapped my camera shutter a few times as quickly as I could. I viewed these pictures several times. After about a minute or so, I got back into my car. I looked directly ahead, into my windshield. I noticed another airplane leading off with another chemtrail. When I activated the camera function on my cellular phone again, and focused the lens through my windshield, I notice another round-shaped object,which was surrounded by pink light, and was moving across my LCD screen. I jumped out of my car, because I wanted to video the bigger object. The video that I recorded was 20 seconds long, and appears to show a UFO emitting some sort of energy charge to a chemtrail,which is displayed as a white horizontal line across the middle of the screen. A bit of pink light appears in the upper left corner, but was obstructed. After what I had seen already, it never occurred to me keep taking pictures and videos."],"Longitude":"-78.896709"}