{"map":"<A HREF = \"http://maps.google.com/maps?q=41.886554,+-87.626928(20939)&iwloc=A&hl=en\"> mufon case (20939) map </A>","Source":"MUFON","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around July 10th 2008"],"Country":"United States","Object Flight Path":"Hovering then path","Region":"Illinois","Weather Factors":"Unknown","Date Submitted":"12/10/2009 11:52 UTC","Latitude":"41.886554","Disposition":"Insufficient Data","divs":["Sighting DetailsJune 30,2008 my father died in Mississippi. My mother came to Chicago after the funeral. She went to stay with my sister in Harvey,IL. I left my house to go her. I'm driving down the street getting ready to get on the expressway when something caught my attention. At the time I thought that it was a blimp, because it was the time of taste of Chicago in Downtown Chicago.It was a very clear day with regards to weather.I looked at the object and I first thought that it was a blimp. But then I thought, blimps don't fly that high. then I said it was a helicopter, helicopters don't fly that high. I said it's an airplane, but it wasn't moving. I noticed that was a silver object. At the blink of an eye, this thing dropped, I don't know how many feet, but I could really see it clearly. It was disc shaped, it looked as though it was very hot because I could see the heat coming from it.I could see spinning counterclockwise. Slowly it went away from me and over the horizon behing a tree line. At the time that I saw this object I was trying to get my camera from behing the seat of my truck.I couldn't get my camera. after everything was over I had remembered that my cellphone has a camera on it. When I made over my sisters house I grabbed the phonebook ane looked up the number to Channel 5 news. I called them and told them what I had just seen, but they told me that noone else had reported it. I told my mother about it and she told me that in her life she's seen many U.F.O.'s.Istill can't believe what I saw but I saw, but I saw it. I told the guys on the job about it and they told me to go take a drug test, they thought I was crazy.I've been a Chicago Fireman for 21 years, I'm still on the job. I thought that I had seen it all, but I guess that I haven't."],"Tags":"City","Longitude":"-87.626928","Date of the Event":"07/10/2008 01:45 UTC","Sighting Duration":"00:04:00","Object Features":"None","Object Shape":"Disc","Log Number":"US-12102009-0005","Summary":"Saw a UFO as clear as day approxiamately July 10, 2008.","files":["/var/www/straped/mufon/html2text/20939.html.txt","/var/www/straped/mufon/org/20939.html"],"City":"Chicago","Viewing Distance":"501 Feet - 1 Mile","Case Number":"20939"}