{"City":"Niagara Falls","map":"<A HREF = \"http://maps.google.com/maps?q=43.094789,+-79.078018(20931)&iwloc=A&hl=en\"> mufon case (20931) map </A>","Object Shape":"Cigar","Object Flight Path":"Undisclosed","Region":"Ontario","Log Number":"CA-12092009-0004","Longitude":"-79.078018","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20931.html.txt","/var/www/straped/mufon/org/20931.html"],"Country":"Canada","Disposition":"Unresolved","Latitude":"43.094789","Weather Factors":"Unknown","Date of the Event":"11/23/2009 07:30 UTC","Tags":"City","Case Number":"20931","Source":"MUFON","divs":["sighting detailson the evening of november 23\\2009 i watched 2 giant, long 'cigar' shape vessels hovering dead steady high up in the sky. i had to look straight up to see them. i stood for 2 hours in the parking lot watching them. they were at very high altitude, much higher than cloud level but at times would get brighter and larger then fade back at other moments. my best guess is these craft are at least the size of a football field each. they appeared blurred out (cloaked) but the pale glow made them noticeable. we have rotating spotlights in the falls here, and when the light would pass over and graze the one ship, it reflected back a very bright icy-blue flash much stronger than the spotlight. a distinct formation was noticeable. they stayed at fixed angles to one another, if you could think of the marks of a clock, they were roughly 12 o'clock and 2 o'clock respectively. please contact me with any questions! i just hope all of these witnesses with all these photos and videos are taken seriously because quite frankly i just want to know whats going on in our sky. youtube is where most video and photos of sightings are being posted, i encourage you to investigate this. thankyou so much! louis ps the sightings have been going on since october and are still being seen on various days!"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"12/09/2009 04:19 UTC","Summary":"2 hour sighting of 2 cloaked massive glowing vessels","trends":["There have been 16 other sightings in Niagara Falls","There was one other sighting in Niagara Falls on or around November 23rd 2009"]}