{"Sighting Duration":"00:04:00","divs":["Sighting DetailsLet me start by saying my whole life I have lived by military or civillan airfields. I was in the military myself and I am presently working as an air traffic controller, a postion I ve worked at for 20+ years.I am a trained observer. In 1980 or 1981 a \"news flash\" reported \"UFO's over Ranch Cordova\" on the 10 PM News. I ran outside and as I was running out the door told my mother. My mother came out with me. We lived at 2717 BARBERA Way, right next to the CORDOVA LANES bowling alley. We ran over to the entrance to the strip mall, next to the diner. I started looking around. I looked toward the SE (toward the Rancho Seco nuclear plant and Mather AFB)and saw a formation of 3 lights coming toward us in a triangle formation at about 1000 ft. The object flew directly over us. It emmitted no sound and the object was solid. The appox size was about 40 ft at its biggest point. It appeared to have 4 \"bluish lights\" in the rear, possibly an engine. My mother and I observed the aircraft until it dissappeared over the trees to the NW. Approx speed was about 150 mph.The Sacramento Bee ran a front page story on this the next day, which included a map with the flight path. If anyone knows the exact date I would really appricaite this as I cannot remeber if it was in 1980 or 1981. The flight path took the craft over MATHER AFB, Rancho Seco, MCcellan AFB, and Beale AFB. Thank you for any futher information"],"Date Submitted":"12/10/2009 02:26 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","Case Number":"20942","map":"<A HREF = \"http://maps.google.com/maps?q=38.593222,+-121.295928(20942)&iwloc=A&hl=en\"> mufon case (20942) map </A>","Latitude":"38.593222","trends":["There have been 18 other sightings in Rancho Cordova","There were no other sightings in Rancho Cordova on or around November 30th 1979"],"Date of the Event":"11/30/1979 10:10 UTC","Log Number":"US-12102009-0008","Summary":"UFO's reported over Ranch Cordova on 10 PM News.","Tags":"City","Disposition":"Unknown","City":"Rancho Cordova","Object Features":"Undisclosed","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Country":"United States","Region":"California","Longitude":"-121.295928","files":["/var/www/straped/mufon/html2text/20942.html.txt","/var/www/straped/mufon/org/20942.html"]}