{"Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"orange dot or star with many rays coming from it","Sighting Duration":"Undisclosed","Region":"Colorado","Date Submitted":"12/10/2009 03:15 UTC","Case Number":"20944","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.938624,+-107.806095(20944)&iwloc=A&hl=en\"> mufon case (20944) map </A>","divs":["Sighting DetailsI was sitting in my living room and saw through a south facing window, fireworks going off.An orange star flew up to the fire works and stopped. The fire works were about 50 feet off the ground and the orange star looked like a plane or sattelite moving through the air at first but it came closer and it looked odd. I could not focus on the star-lite ,and rubbed my eyes, but it was still hard to focus on the light it was orange and had many many rays coming from it. The fireworks burned out and the orange star came in closer to town. The orange star came up to town from the ski mountain ssw to the north and sat for about 10 seconds,it the moved to tne east and sat and then moved to the west-about 200 feet between movements. I scrambled for the camera but was unable to find it and ran outside to continue viewing the object. There was no sound, it was close to town,about 500 feet off the ground to the south.It moved east to west very slowly a few times and then flew in a blink of an eye to the south into sky until I could not see it anymore. The whloe viewing lasted about one minute,I was glad to see it when I got outside, the glass, nor my eyes were playing tricks on me ,the orange star had many rays coming from it .The stars around it looked flat in comparison the the light coming from the orange star.It looked bigger than a star or planet but not too much larger and could move very fast with no sound."],"Object Features":"None","files":["/var/www/straped/mufon/html2text/20944.html.txt","/var/www/straped/mufon/org/20944.html"],"Log Number":"US-12102009-0010","City":"Telluride","Latitude":"37.938624","Disposition":"Insufficient Data","Date of the Event":"07/02/2009 10:15 UTC","Object Shape":"Star-like","Longitude":"-107.806095","trends":["There have been 2 other sightings in Telluride","There was one other sighting in Telluride on or around July 2nd 2009"]}