{"Source":"MUFON","Country":"United States","Case Number":"20954","map":"<A HREF = \"http://maps.google.com/maps?q=40.756163,+-86.067671(20954)&iwloc=A&hl=en\"> mufon case (20954) map </A>","Tags":"City","Longitude":"-86.067671","Region":"Indiana","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Summary":"Thought was aircraft with landing lights till 90 degree turn/high speed exit.","Viewing Distance":"Over One Mile","City":"Peru","divs":["Sighting DetailsTraveling north bound on Hwy31 just north of Hwy24 came up over hill and noticed an aircraft in my direct line of sight through the windshield travelling from west to east approximately 20 to 30 miles away and at a 30 to 35 degree elevation from my veiwpoint. At first thought it was an aircraft with landing lights on. Observed craft for approx. 10 seconds as it flew straight w to e (approx. 5-6 inches relative)then it took a 90 degree turn straight up and flared like a shooting star (approx. 2-3 inches also relative) before a final brighter burst and then disappeared. Called my fiance immediately following the event and told her of it. Hair on the back of my neck stood up during the observation. Sky was crystal clear. Sun had set with little or no dusk light. temperature was @10 derees with a wind chill of 0 to -5 Degrees. Visibility was excellent. Could see other aircraft easily. 10 to 15 min after event observed 3 military aircraft in diamond formation flying in same part of sky. I am a military vet and lived on a Naval air base for over two years. I consider myself to be an educated aircraft observer. I have never seen a craft maneuver such as this nor create lights or light streaks such as this craft did."],"Log Number":"US-12112009-0002","Date of the Event":"12/10/2009 06:10 UTC","trends":["There have been 19 other sightings in Peru","There were no other sightings in Peru on or around December 10th 2009"],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/20954.html.txt","/var/www/straped/mufon/org/20954.html"],"Object Features":"None","Object Shape":"Fireball, Flash, Sphere","Date Submitted":"12/11/2009 09:33 UTC","Disposition":"Insufficient Data","Latitude":"40.756163"}