{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/20955.html.txt","/var/www/straped/mufon/org/20955.html"],"Region":"Florida","Latitude":"30.060481","trends":["There have been 17 other sightings in Mayo","There was one other sighting in Mayo on or around December 8th 2009"],"Date of the Event":"12/08/2009 02:33 UTC","Log Number":"US-12112009-0003","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Does Not Apply","divs":["Sighting DetailsI was watching tv. It was gray cloudy day,something told me to look out of the window. when I did I saw a space craft hovering about 1000to2000 feet to the north west of my house at a 80 degree angle above the tree tops maybe a 500 to qa 1000 feet or so.( I'm realy not at guessing distances this is an approximation.) It was a circle in a circle with 15 to 20 ( or more)smaller circles inside the two rings with lines, stripes that seperated each circle. It almost blended into the stealy gray clouds. But It was there long enough for me to see. I did not report it right away because I felt did I see it or did I not see it. My pets did not allert to anything they just slept through it. But since then they have become more aggitated,and allert to things that are not there. I have had several encounters lately and I am beginning to worry. (1) I was sitting in my living room. (2)some thing just told me to look out the window. (3)I was very curious why It had decided to show its self to me. (4)the craft was a circle ina circle with 15to 20 round circles(or more) with lines seperating each of the circles. It was almost the same color as the clouds which was a stealy gray color, the clouds were smooth so it was not an anominaly in the clouds. (5) I was calm, and almost could not believe what I was seeing. It was there only a brief moment, as if it wanted me to know that they were there watching me. (6)the craft was there and then it was just gone. Nomovement nothing it was just gone.."],"Country":"United States","Object Flight Path":"Stationary","Longitude":"-83.166728","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Circle","Summary":"Watching tv and out of my window in the clouds I saw a circular space craft.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.060481,+-83.166728(20955)&iwloc=A&hl=en\"> mufon case (20955) map </A>","Object Features":"Patterned Surface","Date Submitted":"12/11/2009 09:56 UTC","Case Number":"20955","City":"Mayo"}