{"Region":"California","Longitude":"-121.981662","Viewing Distance":"Unknown","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around December 10th 2009"],"City":"Fremont","Object Shape":"Flash","Country":"United States","divs":["Sighting DetailsGood day: I have been searching the internet in vane today looking for any reports on what I saw last night driving home from work. I left work at around midnight Dec. 9, 2009 travelling northbound on 880 in Fremont California Near the Mowry exit, I saw an extremely bright light in the sky. It lasted for about 1.5 seconds but, it lit up the sky as if a picture were being taken. This is so hard to explain; but I could see a pin-light from where it emanated and it seemed to be coming from the ground and fanning out to light the sky and all that was around me. The light was like a welding arch; but it lit up the sky and as far as I could see on either side of my car. As well, it seemed to be miles north of me but absolutely visible. I turned off my radio and cracked a window to listen for any noise, like a crash or something, and there was only the road noise. Approx. 15 seconds later, the light appeared again only this time I had my radio already off and my window down. Again it lasted about 1.5 seconds, lit up the sky and everything around me with a white light resembling a welding arch, and again there was no sound. Any news on this would be greatly appreciated."],"files":["/var/www/straped/mufon/html2text/20951.html.txt","/var/www/straped/mufon/org/20951.html"],"Log Number":"US-12102009-0017","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.55189,+-121.981662(20951)&iwloc=A&hl=en\"> mufon case (20951) map </A>","Date Submitted":"12/10/2009 11:27 UTC","Case Number":"20951","Date of the Event":"12/10/2009 01:10 UTC","Tags":"City","Weather Factors":"None, Rain, Light","Summary":"NB on hwy. 880 near Mowry exit - very bright light lit sky twice for about 1.5 seconds each","Disposition":"IFO","Latitude":"37.55189","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed"}