{"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Weather Factors":"None","Case Number":"20959","Tags":"City","Disposition":"Unknown","Date Submitted":"12/11/2009 05:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.920309,+-85.448537(20959)&iwloc=A&hl=en\"> mufon case (20959) map </A>","Country":"United States","Summary":"Strange lights and objects.","Region":"Michigan","Longitude":"-85.448537","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20959.html.txt","/var/www/straped/mufon/org/20959.html"],"Latitude":"41.920309","City":"Nottawa","Source":"MUFON","divs":["Sighting DetailsIt was a warm evening and the sun had just about set. I was sitting on the edge of a small lake when I noticed some lights to the right of me coming from the trunk of a tree and then floating around in the tree tops. These lights were small like the size of a lime as they went up into the tree they either disappeared or become larger to the size of a grapefruit. This went on for a while. Then one of these lights started to cross over the lake as it made its way across the lake it looked like an elongated tube. It looked like a tube of lipstick in its shape. It had a slight rounded almost oval head. It also had what looked like 2 appendages pointing down. These objects never had any flashing lights, blinking or Faa lights. There was no noise. The lights in the trees were a dirty yellow color. The object crossing the lake was also a dirty yellow color with a muted hue of red at the top and had almost a silver mist around it. Then I saw a huge yellow light come from over the farmers field it verred coming towards me on the bank of the lake. I called my friend to come out.The light stopped over our heads and it was just above the tree top when it turned into 2 lights. Again, there was no flashing, blinking, Faa lights or nosie. This time it kind of looked like it was attached to something but we could not see. Then in an instant the 2 lights went out over us and nothing could be seen except for a tiny red light that could only be seen with the binoculars. My friend left me and I continued to watch. Then I see what looks like a small ball of light fly from the ground next to the tree where I was seeing these lights. It flew out right over the lake only to be followed by 2 lights behind it that were in a perfect triangle formation. These ligts all looked the same. They had a small red head and a dirty yellow body. Again no blinking, flashing, Faa lights or noise. They flew out and then disappeared. There were more of the small dirty yellow spheres either coming from the tree or going over the farmers field. More lipstick tubes of light also seen going over the lake. All these lights were so very low just a couple hundred feet. It was starting to get cold and I was having no luck with getting any cameras to work. It was so dark out but it was a beautiful star filled night. Then just about when I was ready to go inside I see a commerical airliner fly over my head. I was happy to see something familiar. Then just as I turned the other way from the plane I see this red ball of light flying very fast towards the commerical airliner. I could not belive it. This ball was a blood red light was the size of a grapefriut. This ball of light was right behind the tail of the airplane and I thought it was going to crash into it. I was so scared. Then the light goes to the top of the cockpit of the plane to what literally looked like it was going to sit on top of it. Then it went to the left of the wing and thats when I ran inside. During the time of when things started happening that night all the dogs around the lake started barking for a good 5 minutes straight. This happened at least 3 times when I was out there and it was very loud to where we made a comment about it. Also, a dog from a couple houses down jumped into the lake and started swimming towards were I was on the edge of the lake. This was out of the ordianary."],"Object Shape":"Cylinder, Sphere, Star-like, Unknown","Date of the Event":"11/07/2009 06:00 UTC","trends":["There has been one other sighting in Nottawa","There were no other sightings in Nottawa on or around November 7th 2009"],"Object Features":"Appendage(s), Other","Viewing Distance":"21-100 Feet","Log Number":"US-12112009-0008"}