{"Longitude":"-120.496299","Latitude":"46.603471","Country":"United States","divs":["Sighting DetailsWhile stargazing from the relaxing seat of the hot tub in western portion of the city I spotted a fairly common looking star high in the western sky. My recollection was that it couldn't have been further west from Yakima than the Divide Ridge area and appeared to be somewhat nearer, say over the Tampico area, maybe 15-20 miles. The star wasn't extraordinary except that it began to move in a moderately quick pace towards the north, then appeared to change direction and gain elevation until it disappeared from eyesight. I had seen more dramatic UFO activity many years ago, but this gave me an odd, somehow uneasy, but also invigorating feeling. Basically kind of a rush, but with some apprehension as well. A few moments, maybe twenty seconds or so afterwards a \"star\" from the same area in the sky performed nearly the same thing. The paths weren't identical, but nearly so. There were no trails, tracers, flashing lights, or noises and the objects appeared to be accelerating as they rose out of eyesight. The paths and motion were extremely smooth, no fluctuation like a small, slower craft typically shows."],"Summary":"Suddenly animated stars","Date of the Event":"09/01/2009 01:00 UTC","files":["/var/www/straped/mufon/html2text/20969.html.txt","/var/www/straped/mufon/org/20969.html"],"Object Shape":"Star-like","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.603471,+-120.496299(20969)&iwloc=A&hl=en\"> mufon case (20969) map </A>","Case Number":"20969","Date Submitted":"12/12/2009 05:07 UTC","Disposition":"Insufficient Data","Log Number":"US-12122009-0004","City":"Yakima","trends":["There have been 15 other sightings in Yakima","There was one other sighting in Yakima on or around September 1st 2009"],"Region":"Washington","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Object Features":"None","Object Flight Path":"Hovering then path,Path with directional change"}