{"trends":["There have been 4 other sightings in Carol Stream","There were no other sightings in Carol Stream on or around December 11th 2009","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Region":"Illinois","Weather Factors":"None","Disposition":"IFO","City":"Carol Stream","Date Submitted":"12/11/2009 09:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.913909,+-88.130243(20962)&iwloc=A&hl=en\"> mufon case (20962) map </A>","Object Features":"Unknown","Log Number":"US-12112009-0011","Object Flight Path":"Path with directional change","divs":["Sighting DetailsIt was 5:00 p.m. on Dec. 11, 2009. I had just let my dogs out the back door of the house which faces west. I looked up to see an object emitting a pink colored trail slowly heading west over my neighbor's house. I grabbed my camera, but by the time I got back it was gone. I held on to the camera while I brought the dogs in and when I looked up it was flying in a downward motion rather swiftly this time over the houses and closer to the ground heading south. This time I was able to catch a few seconds of it on film before it disappeared. I tried to get a steadier motion by leaning against the door jams, but it moved too fast and by the time I steadied the camera it was gone. This took only two minutes or so from the first sighting to when I caught it coming back over the house. When I first saw it it was heading slowly west in a straight line. The second time it was heading south and downward as you can see in the film. I see a lot of planes in this area as we are close to DuPage Air Port but I've never seen anything like this, esp. with a pink vapor trail. It appeared to have turned around at some point after disappearing to the west and came back over the houses."],"Tags":"City","files":["/var/www/straped/mufon/html2text/20962.html.txt","/var/www/straped/mufon/org/20962.html"],"Latitude":"41.913909","Date of the Event":"12/11/2009 12:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Summary":"I saw a pink vapor trail across the sky which drew my attention.","Case Number":"20962","Longitude":"-88.130243","Country":"United States"}