{"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Latitude":"44.209309","Longitude":"-77.375242","Date Submitted":"12/11/2009 05:39 UTC","divs":["sighting details to whom it may concerne at mufon, is mufon now hiding the truth from the public? it seems i have had reports from people that mufon is now sending investigators around the web to site like youtube and making reports against the posters of any videos that have come in on a mufon report. this has not happened to myself, but it was brought to my attention, and after i investigated the claims, it became clear that they were true. they are getting yanked due to copyright infringement claims by mufon and a mufon investigator. why? this is a mistake on mufon's part. the sharing of information is paramount in the ufology community.not only does it get the information out there to the people, it also may pass the eyes of someone that could shed some light on the sighting and have answers that normally would not come to light.this proprietary move on mufon's part is bold and a step into a dark and unwanted direction. could mufon have lost its vision of providing the truth about the possibility of extraterrestrial life and vehicles that are visiting our planet? this move is now putting mufon in the realm of those that hold tight to the cover ups and lies that have been perpetrated against humanity. could mufon have become what they once despised? is money more important than the truth now? is mufon now answering to a higher power and is now under their thumb? is mufon now part and parcel of the cover up and lies? any serious ufologist will agree that any suppressed information in a public forum like mufon is can be viewed as selling out to the wrong side of the playing field. this for myself is a sad day for ufology and is a step in the wrong direction. this has made me lose some respect for the organization as a whole. i realize it is does not reflect everyone but mainly the policy makers. for my purposes i will be copying this post and putting it up on my sites i visit so to ensure that if this gets deleted at least there will be a record of it. just in case more censorship is decided on against this letter of disapproval. thank you for you time slushpup slsuhpup@hotmail.com http:\\\\slushpup62.blogspot.com\\ http:\\\\en.justin.tv\\s\\rosut8e\\slushpup"],"trends":["There have been 5 other sightings in Belleville","There were no other sightings in Belleville on or around December 11th 2009"],"Object Shape":"Other","Case Number":"20960","Summary":"Why is MUFON trying to hide the truth? Now Part of the lie?","Log Number":"CA-12112009-0009","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Belleville","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.209309,+-77.375242(20960)&iwloc=A&hl=en\"> mufon case (20960) map </A>","files":["/var/www/straped/mufon/html2text/20960.html.txt","/var/www/straped/mufon/org/20960.html"],"Object Flight Path":"Undisclosed","Disposition":"Unresolved","Region":"Ontario","Date of the Event":"12/11/2009 12:00 UTC","Country":"Canada","Tags":"City"}