{"Source":"MUFON","Object Features":"Unknown","Sighting Duration":"00:03:00","Country":"United States","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=25.44789,+-80.479224(20970)&iwloc=A&hl=en\"> mufon case (20970) map </A>","Log Number":"US-12122009-0005","Latitude":"25.44789","divs":["Sighting DetailsI went fishing off a bridge in the upper keys with a friend. We decided to leave the fishing spot to return home- around 2:00AM. We took US1 (18 mile stretch) to get back to the mainland. Once we were towards the end of the stretch a few miles from reaching Florida City(Driving North), I looked to the East out into the darkness and thought to myself; \"Hey out there is where that empty military building is- the one that I had the paperwork that Sheri gave me and I gave to MM.\" Then suddenly, I saw an enormous glow of blue-green light appear from a domed object on the ground just above the surface behind the tree line- about half a mile into the darkness. It was spectacular! It lit up a large amount of our Eastern visible sky. The light seemed artificial sort of like a welders flickery glow, but on a huge scale! I would say the dome itself was at least 100ft wide and a transparent light green color. The Blue-Green light- that emanated from the dome- spread up into the sky making a cone shape above the dome- with a width of over half a mile. It was so large that it frightened us. I had my video camera in the back seat but the battery was dead. I forgot to charge it before leaving my house! Anyway, the the whole event reminded me of what a transformer does when it blows up in the distance, but on a giant scale- lasting much longer- and was more consistent. Plus, the brilliant Blue-Green color was unforgettable. Unfortunately, we were the only car on the road at that time. Alexander Lugones Mufon F.I."],"City":"Florida City","files":["/var/www/straped/mufon/html2text/20970.html.txt","/var/www/straped/mufon/org/20970.html"],"Object Flight Path":"Other","Tags":"City","Longitude":"-80.479224","trends":["There have been no other sightings in Florida City","This sighting has never been favorited."],"Date of the Event":"12/11/2009 02:23 UTC","Region":"Florida","Object Shape":"Cone, Other","Weather Factors":"Unknown","Case Number":"20970","Disposition":"IFO","Date Submitted":"12/12/2009 09:10 UTC","Summary":"Large tranparent dome emenating cone of light into sky."}