{"Object Flight Path":"Hovering then path","Object Shape":"Triangle","Region":"Pennsylvania","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around December 10th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Country":"United States","Object Features":"Unknown","Date Submitted":"12/12/2009 05:37 UTC","City":"Pittsburgh","files":["/var/www/straped/mufon/html2text/20976.html.txt","/var/www/straped/mufon/more/20976_submitter_file1__ufosketch.jpg","/var/www/straped/mufon/org/20976.html"],"Date of the Event":"12/10/2009 10:00 UTC","divs":["sighting detailsi was driving home w\\ my girl friend comming down butler st. towards pittsburgh. it was aprox. 9:50pm thurs dec 10th 2009. saw a large triangular \"plane\" in the sky. it appeared to be about a 1000 feet or so above the \"strip district \" area of the city w\\ was about a mile ahead of me. i am pretty familiar w\\ ufo descriptions,..and don't feel that it was \"alien\" it however appeared to not act of look like a plane that i have ever seen. as soon as i saw it it seemed wierd. the lights on it were very odd,....and it seemed to hover almost hang above the city. it looked as is it was moving way to slow for it's size. all the lights on it were white. and it seemed to illuminate the sky in front of it as if it had headlights comming from the top. from were i stood when i got out of the car it was about as large a a quarter in the sky,..and my view was then blocked by a building . i saw it come out from behind the building but it's flight was so low it was blocked then again by another building,.. i saw nothing of it after. i'm aware that it could be a military plane. everything i've ever seen on tr-3b however left me to believe that it was not that. i will include a sketch. it was dark however and the plane seemed to be the same color as the sky. the lights were very bright. i am an artist and have a very good visual memory,... i could tell you what it was i saw if i saw a picture of it"],"Tags":"City","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Latitude":"40.443185","Summary":"Plane hovering above city.","Case Number":"20976","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.443185,+-79.991766(20976)&iwloc=A&hl=en\"> mufon case (20976) map </A>","Log Number":"US-12122009-0011","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-79.991766"}