{"trends":["There have been 16 other sightings in Daly City","There were no other sightings in Daly City on or around December 12th 2009","This sighting has never been favorited.",""],"Case Number":"20983","divs":["Sighting DetailsI left a friends house in Montara, got on Highway 92 and then got on Highway 280, i was driving for about 5 miles towards San Jose when i noticed on the rightside of windshield, upper, in the clouds a two lights that appeard to be hovering in and out of clouds, As i passed the lights i saw and they went out of my view, i got off 280 with the next turn off to investigate what i saw. I turned into a vacant parking lot but spotted the lights in the sky before i parked, I parked my vehicle, got outside my vehicle and looked up and there it was, It was 3 white lites in a triangular shape hovering at cloud level, As i looked through my binoculars, i could clearly see the lites were attached to some kind of aircraft, there was no sound, the object was very dark, i say the size of it was about the size of 4 to 5 regular 3 bedroom homes put together. I observed this object hover in the same area for about 30 minutes, i took a few pictures with this old pentax digital camera and only one pic came out that you can see something, i developed the picture at a camera store and its hard to describe what the camera picked up, but its something i have never seen in my life before, the camera picked up what my binoculars couldnt and its one weird looking thing. After about 20 minutes i got very uncomfortable cause i felt the aircraft was getting closer to me and got back in my car and sat there for about 10 more minutes and decided to quit watching this thing while i was ahead. As I got back on freeway, i felt a little confused as to why i got to see what i saw and got confused to the point that it took me probably a extra 10-15 minutes to get home because i missed a couple of turnoffs on the way home. The whole ordeal had me rattled pretty good. I dont think my heart slowed down beating till after a few hours after this event.I am a big follower of the NASA Space program and have always been skeptical of Alien existance and visits, but after last nite, I am 100% convinced with no doubt whatsoever that there is life elsewhere and that life is visiting earth."],"files":["/var/www/straped/mufon/html2text/20983.html.txt","/var/www/straped/mufon/more/20983_submitter_file1__IMGP2017.JPG","/var/www/straped/mufon/org/20983.html"],"Summary":"hovering aircraft over the hills off 280 near Daly City","Tags":"City","Sighting Duration":"00:30:00","Source":"MUFON","Object Features":"None","Date of the Event":"12/12/2009 07:15 UTC","Weather Factors":"None","Latitude":"37.696044","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Triangle","City":"Daly City","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=37.696044,+-122.463098(20983)&iwloc=A&hl=en\"> mufon case (20983) map </A>","Disposition":"IFO","Date Submitted":"12/14/2009 02:37 UTC","Log Number":"US-12142009-0001","Region":"California","Longitude":"-122.463098"}