{"Object Shape":"Circle, Star-like, Other","Date Submitted":"12/13/2009 04:52 UTC","files":["/var/www/straped/mufon/html2text/20981.html.txt","/var/www/straped/mufon/org/20981.html"],"divs":["Sighting Details It was june of 94, 9:OO PM. I had just put my kids to bed and went out on my front pourch for a smoke. I was watching the planes come in to land at McCarran airport. The landing pattern was over my house. There were 6 or 7 planes in line to land. The last one was far brighter than the rest. I thought I was just seeing the landing lights at a more straight on angle. As the rest of the planes flew by, the last one stayed just as far out as when I had first seen it. I remember thinking \"it would be cool to see a ufo\", and upon blinking my eyes, the thing made about a thirty mile jump toward me, I didn't believe what I saw. Then I blinked again and it was only about a mile away. (As it made the jumps, I felt a wave or something pass through me. It was very strange.) At this point, it slowed down, and flew right over my head. It was disc shaped, flying at probably, 1500 to 2000 feet. It had Two rings of lights around it.One ring around the outside, and one ring closer to the middle. It seemed to be flying in a cloud or mist, and no great details could be seen. It was absolutely silent. When I realised what I was looking at, I ran for my car, to retrive a small telescope from the glove box. Apon reaching my car, I turned to get a fix on the object, only to find it was gone. I scaned the sky in every direction to see if I could see it, but it was gone. I was totally astonished at what I had just wittnesed. I felt as though it had read my thoughts, and decided to give me my wish.( wanting to see a ufo.) Since then I have seen some other things in the skys over Vegas but nothing as close up. I am curious if anybody else has seen this or something like it?"],"City":"Henderson","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"00:07:01","map":"<A HREF = \"http://maps.google.com/maps?q=36.046425,+-114.973591(20981)&iwloc=A&hl=en\"> mufon case (20981) map </A>","Object Flight Path":"Path with directional change","Longitude":"-114.973591","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","Latitude":"36.046425","Case Number":"20981","Tags":"City","Country":"United States","Log Number":"US-12132009-0003","Region":"Nevada","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around June 10th 1994"],"Summary":"it came at me from the n.w. made 2 long distance jumps then slowed down as it flew directly over me.","Source":"MUFON","Date of the Event":"06/10/1994 09:00 UTC"}