{"files":["/var/www/straped/mufon/html2text/20982.html.txt","/var/www/straped/mufon/org/20982.html"],"Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was 12:49 right after noon, today, Sunday Dec 13, I got in my Car and proceeded to pull out of the Apartment complex, when I noticed a Gleaming Passenger jet, flying where i normally see them. My attention was drawn to an object that looked like it was just sitting there. Amongst the Clouds. I maintained my view of this strange Cigar shaped thing, it was reflective and had what appeared to be three or more, large Dark, circular shapes on the side of it. That is what caused me to look harder at it. the altitude was in amongst the Clouds, which i afterwards, quickly confirmed through Doppler to be 15,000ft. I had the advantage of comparing it instantly to the passing Jet. I couldnt see the windows on the Jet at that altitude, but this thing, had distinguishable dark round objects or marks on its side. The size of it at what i guess was its altitude, made it larger than the passenger Jet. My question is: are there Radar records available for 12:49pm 13 Dec 09? I mean, something this large was seen and it looked rather close to the Passenger Jet that was heading North, I was viewing this looking to the east. Again its altitude was High, It simply vanished before my eyes! I think I saw it for all of about 2 minutes maybe. I dont believe it ever moved, as my vantage point afforded me the ability to remain still. It was clear and not blurry or obscured, the skies were beautiful today, , Cloudy, but this thing stood out! I dont get that. I never took my eyes off of it. And it appeared to just vanish? That makes no sense to me either. Can someone tell me what the Hell this was? I enjoy skywatching and am familiar with the Planes that fly around South Florida. This didnt look like it moved. I've ruled out just about everything except a Balloon or kite, but the altitude would mean it was massive. I wonder if the Plane saw anything? thanks for any response. Sincerely Kevin Maurer"],"Case Number":"20982","Summary":"reflective Cigar Shape with large circulars on the side","Longitude":"-80.268044","Weather Factors":"None","Source":"MUFON","Date of the Event":"12/13/2009 12:49 UTC","Log Number":"US-12132009-0004","trends":["There have been 18 other sightings in Coral Springs","There were no other sightings in Coral Springs on or around December 13th 2009"],"Disposition":"Unknown","Object Shape":"Cigar","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date Submitted":"12/13/2009 09:29 UTC","Object Flight Path":"Stationary","Latitude":"26.273312","map":"<A HREF = \"http://maps.google.com/maps?q=26.273312,+-80.268044(20982)&iwloc=A&hl=en\"> mufon case (20982) map </A>","City":"Coral Springs","Object Features":"Appendage(s), Other","Region":"Florida"}