{"Date of the Event":"12/13/2009 11:38 UTC","Date Submitted":"12/14/2009 05:14 UTC","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=32.735249,+-97.31288(20984)&iwloc=A&hl=en\"> mufon case (20984) map </A>","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around December 13th 2009"],"Object Shape":"Triangle, Unknown","Weather Factors":"Windy, Fog, Medium","Case Number":"20984","divs":["Sighting DetailsI had just driven home when I decided to look up at the sky. Directly above I saw two lights right next to eachother. I had at first thought it was a reflection from truck headlights on my window. Soon I realised it was somthing else. I slowly told my friend to look up. She soon saw this too and we got out of the car to examine it. We watched the strange object hovering above for about two minutes. It was moving south from here at a very slow speed, gently rising as it did. At one point it shifted to the right and seemed as if it was about to turn around. It then dissapeared into the clouds. I only saw two lights, though I believe it was traingle shaped. Another point that may or may not be related is the clouds at the time. At 11:00pm the sky was clear, at 11:20 the sky was having very odd clouds that moved very fast towards the north from south. As soon as the craft disapeared the clouds lasted about an hour and then also vanished. For the rest of the night I stood outside waiting to see if the object would return. I was very proud to see this because it was the first time I had seen a UFO so close for over a minute. Also, tonight was the meteor shower, so even though the UFO never returned, I got a nice veiw of some of the meteors. I urge the people of Fort Worth to report any sightings that might help us get closer to understanding the true nature of these UFOs. Anonymous"],"Longitude":"-97.31288","files":["/var/www/straped/mufon/html2text/20984.html.txt","/var/www/straped/mufon/org/20984.html"],"Disposition":"Hoax","Region":"Texas","City":"Fort Worth","Tags":"City","Source":"MUFON","Log Number":"US-12142009-0002","Latitude":"32.735249","Country":"United States","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Sighting Duration":"00:02:00","Summary":"Two Dim Lights hovering after the appearance of strange clouds."}