{"Case Number":"20994","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around December 14th 2009"],"divs":["sighting detailswhile driving to work about 5:31am december 14th 2009 after crossing the verazanno narrows bridge from staten island new york to brooklyn to the belt pwky on the ramp that enters the belt pwky from the bridge near the end of the ramp about 500 feet or less from the belt pwky heading towards coney island i clearly saw a white object, round and with a small tail heading toward's coney island, also, parrallel to the roadway and between the roadway and the water, (bay area) about 30 degree's above the horizon and about 1000 yards or less from my position while driving. my speed was about 35 mph to 45 mph , duration was about 5 to 10 seconds. object was about the size of my thumb or slightly larger. personnal information: i am bernard mendez mufon f.i. #1038 request you forward the mufon cms case number ,a.s.a.p. and i would like to a ammend this report and also put a drawing in the record, but due to me busy schedule ,this will take time. so who ever is assigned this investigation please send me a e-mail and\\or give me call."],"Object Shape":"Cone, Flash, Teardrop, Other, Unknown","Log Number":"US-12152009-0001","Longitude":"-74.004553","Latitude":"40.717003","Date Submitted":"12/15/2009 02:02 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","City":"New York","Country":"United States","Region":"New York","Source":"MUFON","Summary":"White Flare or orb with a tail possible metor like flare out.","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/20994.html.txt","/var/www/straped/mufon/org/20994.html"],"Sighting Duration":"00:00:05","Date of the Event":"12/14/2009 05:31 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.717003,+-74.004553(20994)&iwloc=A&hl=en\"> mufon case (20994) map </A>"}