{"Tags":"City","Date of the Event":"01/31/1997 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=25.093665,+-80.44398(20993)&iwloc=A&hl=en\"> mufon case (20993) map </A>","Longitude":"-80.44398","Source":"MUFON","Viewing Distance":"101-500 Feet","Latitude":"25.093665","divs":["Sighting DetailsFirst I am a pilot and have built and flown a few of my own planes and understand stall speed and what it takes to be airborne. This craft was in the hovering mode, and going aprox, 35 mph. Altitude could be judged, as it was slightly north and we had the old tower the adjoins the harbor where we were anchored to measure by. The event started when I came on deck to a completely dark sky other than city lights which were to our east. I was doing what all sailors do in the night, making patterns in the water. As I looked up towards the east as we were anchored on the FL. bay side, I noted an angled reflection which at first reminded me of geese coming towards the city. I decided right away that this was not a good definition of what I was seeing and realized that something was up there, coming our way. I called down to my wife to get the binoculars and we both took turns watching the object, or at least what we could see of it. What we could see was only the angled leading edge facing us and that was only because city light somewhat reflected off the surface which was matt gray and not very reflective. All of the lower surface was completely stealth and was invisible. It was only about 1200 feet up and so blanked out a large section of the sky. If I were to hold up a three foot yard stick at arms length, it would have been larger than that, it was massive. The leading edge was rounded and would have been 20 ft. or more high. If you extrapolate what we could see and then carry the shape out, it would have been triangular in shape, but in the stealth mode. Perhaps our military in this case. We kept track of it for several minutes after this and it moved over the tower and over our harbor and into Fl. bay. As soon as the city lights no longer could reflect, it became invisible, yet it blanked out the stars for a while and then we no longer could follow the movement. No sound was heard, but then there is a constant sound from Key Largo which never seems to sleep. This type of craft has been seen about fl. by others as well as other states."],"files":["/var/www/straped/mufon/html2text/20993.html.txt","/var/www/straped/mufon/org/20993.html"],"Date Submitted":"12/14/2009 10:04 UTC","City":"Key Largo","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path","trends":["There have been 4 other sightings in Key Largo","There were no other sightings in Key Largo on or around January 31st 1997"],"Region":"Florida","Country":"United States","Log Number":"US-12142009-0011","Object Shape":"Triangle","Disposition":"Unknown","Summary":"Very large, wedge shaped craft over Key Largo, to Fl. Bay.","Object Features":"None","Case Number":"20993","Weather Factors":"None"}