{"Date Submitted":"12/14/2009 06:17 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/20991.html.txt","/var/www/straped/mufon/org/20991.html"],"Case Number":"20991","Object Shape":"Oval","City":"Oakdale","map":"<A HREF = \"http://maps.google.com/maps?q=37.768145,+-120.838724(20991)&iwloc=A&hl=en\"> mufon case (20991) map </A>","Date of the Event":"11/14/2009 02:00 UTC","Longitude":"-120.838724","trends":["There have been 7 other sightings in Oakdale","There were no other sightings in Oakdale on or around November 14th 2009"],"Disposition":"Unknown","Tags":"City","Summary":"saw a silvery, object w/o wings or tail, no sound, in the sky","Latitude":"37.768145","Object Features":"Patterned Surface","Country":"United States","Weather Factors":"None","Object Flight Path":"Stationary","Log Number":"US-12142009-0009","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["Sighting DetailsAt approximently 1400-1500 hrs, my wife and I were driving in Oakdale, Ca., to her sisters. We stopped at a stop sign and I noticed something up in the air. When I looked up at it I first thought it was a plane but then noticed no wings, no tail, no sound, no movement. I told my wife to look up at the sky and pointed in the direction of the object I had seen, but it had already vanished. This was all done in approx. 2-3 seconds, for as I made my turn it just disappeared. I looked at it for the 2-3 seconds while stopped, but as I looked to make the turn, it vanished. I am reporting this because of another article, 11-30-09 in California, that gave the very same discription of what I saw. I was very excited at first, but when I tried to tell some one they just looked at me with eyes glazed over. I am not sure if this is where I can ask about \"Missing Time\"? I had an expierence when I was 8 or 9, where I was in my nieghbor's backyard. He was called into the house, for something I can't recall, and I was sitting in the swing set. I was looking up and the sky and thinking that the clouds and blue sky were really nice with the sunshine of late spring early summer of '58 or '59. I remember looking up at the sky and thinking, \"Wow, that is really neat!\" This was early afternoon. The next thing I remember is standing outside my house, in the flower bed, looking into our living room, with the sun going down and wondering how I got there and why was it getting dark! When I told my mother about it, she thought I had imagined it. Nightmares and uneasiness about strange and wierd things have been going on for 50 years now and I would really like to know what happened to me. Please, can you help?"],"Region":"California"}