{"map":"<A HREF = \"http://maps.google.com/maps?q=31.122939,+-97.721776(21000)&iwloc=A&hl=en\"> mufon case (21000) map </A>","Object Flight Path":"Stationary","Country":"United States","City":"Killeen","Date Submitted":"12/15/2009 02:33 UTC","Region":"Texas","trends":["There have been 16 other sightings in Killeen","There were no other sightings in Killeen on or around December 5th 2009"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-97.721776","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21000.html.txt","/var/www/straped/mufon/org/21000.html"],"Case Number":"21000","Disposition":"Hoax","Date of the Event":"12/05/2009 12:00 UTC","Object Features":"None","Summary":"Saw UFO land and occupants come out","Object Shape":"Disc","Log Number":"US-12152009-0007","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was outside letting my dog take a leak and a couple of fields over (I live in the country) a silver disc with a glow (no other lights) landed. Well, it did not touch the ground, it hovered just above the ground. A platform lowered beneath the UFO and 3 beings walked out. They did not look like typical grays we all see. They walked like humans but were smaller. They were too far away to see any details, but it was obvious they were not your typical gray. My dog was going nuts and wanted to run towards them, but I grabbed his collar and put on the leash. Since it was late and I was just letting the dog take a leak, I did not have a camera or my phone on me. Once I got the dog under control, I ran - fast - back to the house to grab a phone or camera (whatever I could get my hands on first). By the time I got back outside, there was nothing in the field. Nothing! It was completely gone. I had my dog with me still and let him off the leash. He didnt even sense anything anymore. Has anyone else encountered this? I am a professional employeed person. I do not do drugs, dont smoke and only drink for special occasions. I have never had mental issues and I have never believed in UFOs. Never. But I know what I saw. I called a friend of mine the next day who believes in this stuff because I knew he would not ridicule me. Nobody else in my family knows of this, I fear their reaction. He told me to come to this site and post my story. Here it is."],"Tags":"City","Latitude":"31.122939"}