{"Summary":"Disk shaped craft with lots of lights flying very slow almost appeared to hover at times of my subdivision","divs":["Sighting DetailsI am writing to tell you what my wife and I experienced on the night of 12-10-09 in Spring Hill,TN. Brief account: It was 10:00pm on 12-10-09 a clear cold night about 18 degrees. I walked outside to retrieve something from my work truck that was parked outside. Something caught my attention out of the corner of my eye and I looked to the right and up in the sky almost overhead was this \"object\" it appeared to be disk shaped,it had several yellowish white lights around it and 1 reddish colored light on top of it. The object moved very,very slow almost appeared to hover at times and the strange thing was it made absolutely no sound.When I say it was silent I mean the light breeze blowing past my ears made more noise than this thing did! After watching this \"object\" for approximately 3 minutes in my driveway I ran inside the house and yelled to my wife to come outside QUICK! I think there is a UFO hovering outside. My wife then ran outside and stood on the front steps and the both of us watched this object for another minute or so when my wife told me to run in the house and get the camera. I ran inside got my camera out of my camera bag and ran back outside. I turned the camera on to the automatic setting and proceeded to try and get pictures. Unfortunately, my hands were shaking so bad I couldn't get the camera to focus on the \"object\". My wife, who appeared to be in shock said I'm going in and looking at it from the upstairs window.The \"object\" moved from South to North then made a turn to the West After about 1-2 minutes the \"object\" then made a slight turn and moved to the North(very,very slowly) toward the town center,where I lost sight of it. I ran into the house called 911 and told the dispatcher that I didn't have an emergency but needed to talk to someone at the Spring Hill Police Department. The lady explained that she was the Spring Hill Police Department. I began to tell her what my wife and I saw at approximately 10:00pm moving over my house in the Golf View Estates Subdivision and needed to know if anyone else was calling in to report seeing a strange object in the sky. The dispatcher told me that she hadn't received any calls but would notify her officers and have them take a look. I went back outside to see if this \"object\" possibly came back when I saw a police car coming down my street. I noticed it was my neighbor who lived across the street I went over to talk to him about what my wife and I saw about 30 minutes ago hovering over the street. He looked at me like I was crazy or at the very least had been drinking. I assured him that I hadn't been drinking and don't do drugs and when I went to show him what direction it came from I said \"There it is\" and We both then witnessed this object (Altitude was higher) about 800-1000'. My neighbor looked at me and said what is that? I said I was hoping you could tell me. He said it looks like it could be a military drone as he was an Iraq veteran and seen them before. I said a drone? He said yeah, when they fly they make virtually no sound. He also stated that the \"object\" seemed awful big and was moving to slow to be a drone but was the only explanation he had. The object then moved off in a westerly direction and appeared to flip up onto it's side as to expose the top of it and accelerated at a high rate of speed and was gone. When I say accelerated I mean if you would have blinked you would have thought it vanished! My neighbor then said I'll be damned and walked into his house without saying another word. I went home and called my brother who lives in New York and told him what was going on. My brother gave me a phone number to The NUFORC and I called the hotline number and talked to a gentleman who then took my report. The gentleman asked me to call my local news and ask if anyone else saw this \"object\". I did call Channel 2 News and talked to a man named \"Jim\" who told me that he hadn't heard of anything but would call me back if he did. I haven't received a call from him. On Saturday 12-12-09 at 12:30pm I went to the Spring Hill Police station and talked with the lady at the front desk who said she did remember hearing about my call and said that no one else called to report seeing anything. I left the station embarrassed and clueless as to why no one else called to report seeing this \"object\" It was huge,disk shaped and had lots of lights on it, flew silently and at times appeared to hover over my subdivision....and nobody else saw it? I am hoping that maybe you have had other similar reports and know what this thing was. Was it military? or was it alien? I know what it wasn't, it wasn't an airplane,helicopter,blimp,swamp gas or balloon boy. Please help me...I realize that without video or pictures I'm just another story but would still like to know what we saw on the night of 12-10-09 at 10:00pm. I am puzzled to say the least and have never seen anything like this in my 37 years of life."],"Object Shape":"Disc","Date of the Event":"12/10/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/21006.html.txt","/var/www/straped/mufon/more/21006_submitter_file1__2009_1214UFOsketch0003copy.jpg","/var/www/straped/mufon/org/21006.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"21006","Tags":"City","trends":["There have been 4 other sightings in Spring Hill","There was one other sighting in Spring Hill on or around December 10th 2009","This sighting has never been favorited.",""],"Region":"Tennessee","Weather Factors":"Unknown","Log Number":"US-12152009-0013","Latitude":"35.760239","Viewing Distance":"Unknown","Object Features":"Undisclosed","Disposition":"Unknown","City":"Spring Hill","Longitude":"-86.921912","map":"<A HREF = \"http://maps.google.com/maps?q=35.760239,+-86.921912(21006)&iwloc=A&hl=en\"> mufon case (21006) map </A>","Date Submitted":"12/15/2009 09:53 UTC","Country":"United States","Source":"MUFON"}