{"Longitude":"-97.14667","Sighting Duration":"00:05:00","trends":["There have been 16 other sightings in Waco","There were no other sightings in Waco on or around July 31st 1973"],"Source":"MUFON","Case Number":"2100","Weather Factors":"Unknown","divs":["Sighting DetailsI was around 10 yrs. old during the most significant event, but I believe therewere others. I dont remember seeing a spacecraft. I saw the enities only. Hereis my story of the most significant event that I have conscious awareness of. Islowly opened my bedroom door to peer out and investigate the dynamics of mysituation. I was well rehearsed in the exact characteristics of every bedroomdoor I ever lived in due to my daytime practices opening and reopening of thedoor for a reason unknown to me. My bedroom was in the middle of the hallwaywith the bathroom diagonally across the hall. My parents and brothers room wasto my right and further down the hall with the living room and subsequently thekitchen being to my left. I could turn on the kitchen light without anyonenoticing I was there because the light from my bedroom was just strong enough toilluminate the way without alerting any one of importance to blowing my cover.Simple enough right Wrong I quickly moved down the carpeted hallway and passed asmall front door foyer to my left. The hallway opened up into a huge sunkenliving room requiring me to step down walk a few steps and step back up to myleft and into the dining room and kitchen combination. The light switch was justto the right on the wall as you step up into the dining room. I was reaching forthe light switch when I saw it. A bright green hazy glow in the corner of theroom. I focused my terror filled eyes on it and I saw what appeared to be askull like thing floating in the air. The dining room table was directly infront of it and I think I saw the slim body portions behind the table."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.549333,+-97.14667(2100)&iwloc=A&hl=en\"> mufon case (2100) map </A>","Latitude":"31.549333","Summary":"I was abducted I believe to be many times as a chi","Disposition":"Unknown","Object Features":"Undisclosed","Date of the Event":"07/31/1973 12:00 UTC","files":["/var/www/straped/mufon/html2text/2100.html.txt","/var/www/straped/mufon/org/2100.html"],"Object Shape":"Unknown","Tags":"City","Object Flight Path":"Unknown","City":"Waco","Date Submitted":"07/31/1973 12:00 UTC","Log Number":"","Viewing Distance":"Unknown","Region":"Texas"}