{"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/21019.html.txt","/var/www/straped/mufon/org/21019.html"],"Summary":"Streek of lights across the sky","Weather Factors":"Unknown","Date Submitted":"12/16/2009 05:33 UTC","Tags":"City","Log Number":"US-12162009-0010","Disposition":"Unknown","divs":["Sighting DetailsA Doctor that I work with at local hospital reported this case to me... He reports that he was East-bound on Interstate 40 near Weatherford, OK near dark, That would have been about 8 P.M. at that time. He stated this incident happened about 6 weeks ago but he is just now wanting to come forward and report it to someone. He reported seeing a bright white streak of light that he said reminded him of the Shuttle debris footage. He saw pieces of the object fall off and away from the object. He described seeing the object for what he described as \"5 degrees across the sky\" going from the South to the North. He reported that it took about 5 minutes for the object to cross the sky, also, he reported people parking along the interstate and getting out of their cars -looking at this object. He wanted to know if anyone else had seen this object, and asked me to check. What I found unusual was the movement he reported. I had asked him to describe the movement of the object and he described the streak to go in \"spurts\" moving a bit and then stopping. He said he had never seen a object do that in the sky before. He is a professional physician that I've personally known and worked with for over 19 years. I believe he saw something. He did not want to report this further than to report it to MUFON. I am relaying his report. Thanks! Jim Hickman MUFON Research Specialist"],"Longitude":"-98.707574","Date of the Event":"11/01/2009 12:00 UTC","Latitude":"35.526163","Country":"United States","City":"Weatherford","Object Shape":"Fireball","Object Flight Path":"Hovering then path,Path then hovering","Object Features":"None","Source":"MUFON","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.526163,+-98.707574(21019)&iwloc=A&hl=en\"> mufon case (21019) map </A>","Case Number":"21019","trends":["There has been one other sighting in Weatherford","There were no other sightings in Weatherford on or around November 1st 2009"]}