{"divs":["Sighting DetailsMy friend picked me up from the airport and i was telling him about aliens and ufos because i have been researching them lately. We got back to his house and our other friend came over to visit. My buddy who picked me up mentioned to us that there was two bright lights off in the distance up in the sky that he has never seen before out the same window he looks out every night. We didnt even really pay attention to him to come and have a look. About half and hour passed by and he mentioned it to us again that the lights were still there in the same spot and we went to have a look out the window, we saw two sphere bright orange orb shaped objects up in the sky, it looking like fire burning off in the distance but it was clearly above the ground level up in the sky. I got really excited and told them ive seen the orange orb type ufo on you tube and that we witnessed a real ufo or something unexplainable. It felt really erry a weird feeling of belief. My buddy who first saw them went to get some binoculars and a camera. So it was me and my other friend looking out the window then out of no where one of the orange orbs just vanished, it was gone, just disappeared. It tripped us right out. So we went outside to look from another view, and i was yelling at my other friend to hurry up with the camera. We went outside and it was just us two who saw the first one vanish. I kid u not as soon as my buddy came outside with the camera the other orange orb vanished and dissapeared like the other one did. The objects did not move they were just sitting in the same position until they vanished. Me or him have not seen anything else in that same area out the window since. After it happened i called one of my friends and was telling him about it and he said that a few months earlier around the same area my friend lives that he and a few others saw a similar sighting like that i described."],"Latitude":"49.22255","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Two orange orbs looked as if on fire up in the sky in the distance!","Region":"British Columbia","City":"Maple Ridge","Viewing Distance":"Unknown","Case Number":"21014","Date of the Event":"11/29/2009 09:30 UTC","Object Shape":"Fireball, Sphere","Date Submitted":"12/16/2009 04:39 UTC","Disposition":"Unresolved","trends":["There have been 6 other sightings in Maple Ridge","There were no other sightings in Maple Ridge on or around November 29th 2009"],"Tags":"City","Longitude":"-122.593329","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Country":"Canada","Log Number":"CA-12162009-0005","files":["/var/www/straped/mufon/html2text/21014.html.txt","/var/www/straped/mufon/org/21014.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=49.22255,+-122.593329(21014)&iwloc=A&hl=en\"> mufon case (21014) map </A>"}