{"Sighting Duration":"00:01:00","Viewing Distance":"Unknown","Object Shape":"Triangle","Weather Factors":"Unknown","Case Number":"21010","Object Flight Path":"Other","Date of the Event":"12/15/2009 04:49 UTC","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 15th 2009"],"City":"Las Vegas","Source":"MUFON","Date Submitted":"12/16/2009 02:23 UTC","Log Number":"US-12162009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=36.116646,+-115.170656(21010)&iwloc=A&hl=en\"> mufon case (21010) map </A>","files":["/var/www/straped/mufon/html2text/21010.html.txt","/var/www/straped/mufon/org/21010.html"],"Country":"United States","Object Features":"Unknown","Longitude":"-115.170656","Tags":"City","Disposition":"Unknown","Latitude":"36.116646","Summary":"On December 15, 2009 at 4:49pm I saw a triangle shaped UFO flying over Las Vegas.","Region":"Nevada","divs":["Sighting Details On December 15, 2009 at 4:49pm I saw a large triangular UFO flying over Las Vegas. I was driving north on Hualapi Rd. While stopped at the traffic light on Hualapi and Alta Dr. I saw what looked like a \"flying saucer\" with revolving lights in the distance over the mountains to the northwest of my car. Almost immediately it was close enough to see that it was triangular in shape with flashing lights. As it descended I believe that the lights stopped flashing and it looked exactly like the often broadcast video of the \"Phoenix Lights\" except that it was not completely dark outside yet here like it was in Phoenix when that video was taken. I have heard that the \"Phoenix Lights\" was caused by military flairs, so I was looking for smoke coming from the lights and there was none. I also noticed that it was no longer descending and just hovering so I ruled out flairs. This entire part of the sighting from the time I first noticed it until I concluded that it was just hovering took probably no more than 20 seconds, if that. And then \"poof\" it was gone. The traffic light changed, I continued north on Hualapai and there it was again outside my driver's side window, but only for a second and then \"poof\" it was once again ahead of my car but a bit farther east than the first time I saw it. I pulled my car over to the right lane, stopped, put on my hazard lights, grabbed my I-phone and tried to take a picture of it. It vanished once again right as I clicked the camera and I only got the fading of the last light and you have to look really hard to even see that. Immediately, it was far away in the northwest sky, much lower than my first sighting. I decided to chase it down to get a good photo of it. I had to look down to turn off my hazard lights and when I looked back up at where it had been it was gone. I drove up to the highest place I could think of with a good view of the city and waited about a half hour but I never saw it again."]}