{"Sighting Duration":"00:00:20","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around December 12th 2009"],"Object Shape":"Boomerang, Triangle","files":["/var/www/straped/mufon/html2text/21016.html.txt","/var/www/straped/mufon/org/21016.html"],"Disposition":"Unresolved","Source":"MUFON","Tags":"City","Latitude":"40.758557","Region":"New York","Summary":"Collective White Stationary \"Balls\" During Daytime Hours","Object Features":"Unknown","City":"New York","Date Submitted":"12/16/2009 08:16 UTC","Object Flight Path":"Stationary","Longitude":"-73.765437","divs":["Sighting DetailsOn Saturday, December 12th at around 9:30am I was outside on my back porch in Bayside, Queens. My back porch faces north. I was a crisp beautiful morning, blue skies and not a cloud to be seen. At this time I was on a cordless phone speaking to my friend. While talking I looked to the north east and saw about 12-15 individual \"white balls\" in the shape of a triangle. I did not get the sense it was one object. They did not move, they were stationary. I told my friend on the phone \"I have to put the phone down\". I had a pair of binoculars on the porch. As I grabbed them I kept my eye fixed on the triangle shape. The objects started to fade and then finally disappeared. About 5 seconds after they disappeared, the faded back into view but this time the \"white balls\" were shaped like a boomerang. The binoculars were already in my hand from my first attempt to look at them. I put them to my face and looked...I saw nothing..pulled the binocular away from my face...the objects were gone. Again both shapes were stationary between fades. The whole experience lasted maybe 15-20 seconds. It was a very strange experience I am curious if anything else was reported in the area as well."],"Weather Factors":"Windy","Log Number":"US-12162009-0007","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.758557,+-73.765437(21016)&iwloc=A&hl=en\"> mufon case (21016) map </A>","Viewing Distance":"Over One Mile","Date of the Event":"12/12/2009 09:30 UTC","Case Number":"21016"}