{"Disposition":"Insufficient Data","Longitude":"-73.551516","Weather Factors":"Unknown","Sighting Duration":"00:00:59","Source":"MUFON","Log Number":"","divs":["Sighting DetailsI was riding my bicycle home from a friends house. The sun had just dippedbelow the horizon. The sky was lit but not bright. It was completely clear Iwasnt wearing a jacket L.I.,N.Y. - also year above may be not be perfect.My eye was caught by what I believed to be a shooting star. As I watched it Iwaited for it to burn out. It left what I believed to be a vapor trail behinditwhat I understand to be the phenomenon that accounts for the fine line cloud ajet plane leaves in its path.After travelling a relatively short distance accross the sky, the fire ball madea perfect 90 degree turn without changing its speed or banking the curve. To mysuprise it continued on this path about 3 times 3 90 degree angles travellingthe same distances before each turn.The vapor trail left behind described the impossible trajectory of its pathperfectly. I sped home on my bicycle as qickly as possible to show someone athome what it left behind. Unfortunately as I was pedelling, I was watching thetrail become gradually wind blown. By the time I got home there was nothingleft to shock anyone.The object appeared and dissappeared instantaneously. Not suprising if not forthe impossible trajectory it took during the approximately 15 seconds of visualmovement across the sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.66288,+-73.551516(2102)&iwloc=A&hl=en\"> mufon case (2102) map </A>","files":["/var/www/straped/mufon/html2text/2102.html.txt","/var/www/straped/mufon/org/2102.html"],"trends":["There has been one other sighting in Merrick","There were no other sightings in Merrick on or around November 30th 1971"],"City":"Merrick","Viewing Distance":"Over One Mile","Tags":"City","Latitude":"40.66288","Region":"New York","Country":"United States","Object Shape":"Sphere","Case Number":"2102","Object Flight Path":"Unknown","Date of the Event":"11/30/1971 06:00 UTC","Date Submitted":"11/30/1971 06:00 UTC","Object Features":"Other","Summary":"Ball of fire light travelling at 90 degree angles"}