{"divs":["Sighting DetailsI was returning home from class at about 10:30 PM. I was drving east on HWY 70 west of Madill. Approximately halfway between Ardmore and Madill I noticed a white and red ball of light north of the HWY. The object was 75% white from bottom to top. The top of the object was a red light. I could see not no physical structure, only light. The object was traveling east. I watched the light for approx. 30 seconds before the light dimmed to black. The ligh did not flash out but appeared to collapse into its center. It was not my impression that the lights were that of a conventional plane or helicopter. As I continued driving I looked for the object. About 5 minutes later the light appeared again. It lit slowly and appeared to still be traveling east. Its position was about the same as it was to my car when I first saw the light. This time the light was on for only a few seconds and again collapsed into its center. It came back on only seconds later and remained lit for about a minute. The light again \"collapsed\" and did not return for about 10 minutes. At this time I was beginning to enter madill city limits when the object again lit. This time the object was well east of my position and seemed to be hovering. As I entered Madill I lost sight of the light and did not see it again. When I arrived home I asked my wife to join me to return to where I had last seen the light. When we returned the light was gone and low clouds had rolled in."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.090375,+-96.771669(21025)&iwloc=A&hl=en\"> mufon case (21025) map </A>","Viewing Distance":"Unknown","trends":["There has been one other sighting in Madill","There were no other sightings in Madill on or around December 1st 2009"],"Latitude":"34.090375","Region":"Oklahoma","Log Number":"US-12162009-0016","Date of the Event":"12/01/2009 10:30 UTC","Summary":"White(top) and red(bottom) star like object. Object traveled east and would light, not blink or flash, and would go dark.","Object Shape":"Circle, Sphere, Star-like","Object Features":"None","Case Number":"21025","Longitude":"-96.771669","files":["/var/www/straped/mufon/html2text/21025.html.txt","/var/www/straped/mufon/org/21025.html"],"City":"Madill","Country":"United States","Sighting Duration":"00:20:00","Weather Factors":"Windy","Disposition":"Unknown","Tags":"City","Object Flight Path":"Path then hovering","Source":"MUFON","Date Submitted":"12/16/2009 11:18 UTC"}