{"Sighting Duration":"00:01:00","Object Shape":"Cigar, Sphere, Star-like","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 2 other sightings in Kanab","There were no other sightings in Kanab on or around December 10th 2009"],"files":["/var/www/straped/mufon/html2text/21022.html.txt","/var/www/straped/mufon/org/21022.html"],"Date of the Event":"12/10/2009 08:30 UTC","Region":"Utah","Source":"MUFON","Log Number":"US-12162009-0013","Longitude":"-112.526314","Date Submitted":"12/16/2009 08:27 UTC","Latitude":"37.047486","divs":["Sighting DetailsUpon traveling East on Hwy 89 in Southern Utah, I noticed what looked like a \"shooting star\" traveling from North to South, what made it stand out to me was that it traveled the entire distance of the sky or horizon. A few moments later another object or \"sphere\" the same as the first came out of the Northern sky traveling South, but this object stopped in the Southern sky and a few moments later two more objects traveling together stayed on the same path as the first. The object that was \"stopped\" now started to travel back North, then a very large and I hate to say it but \"cigar\" shaped object appeared in the North and was also traveling South. The second object that was now traveling North joined up with the large one for a moment and then it took off like a shot back on the Southern path like the others. The large object stayed on it's same course. The large \"Cigar\" or \"Cyliner\" put off a \"glow\" more than a distinct light or group of lights. A semi truck that was traveling in front of me stopped in the middle of the road and the driver got out and came running back to ask if I had just seen the objects in the sky? He was quite excited as was I. It was quite a sight to see to say the least. I have asked around in the area to see if anybody else had seen the \"lights\" or \"objects\" but no other reports have come up yet. I hope to find some other people that may have seen the objects. Maybe they saw them from a different angle and have a better discription of what they may have been. The speed of these objects was amazing..."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.047486,+-112.526314(21022)&iwloc=A&hl=en\"> mufon case (21022) map </A>","Viewing Distance":"Unknown","Summary":"A group of lights / objects in the night sky over Southern Utah.","Object Features":"None, Unknown","City":"Kanab","Tags":"City","Disposition":"Unknown","Weather Factors":"None","Case Number":"21022"}