{"Source":"MUFON","City":"Panama City Beach","Region":"Florida","Summary":"Two black triangles over the Gulf of Mexico","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Date Submitted":"12/16/2009 07:24 UTC","files":["/var/www/straped/mufon/html2text/21021.html.txt","/var/www/straped/mufon/org/21021.html"],"Log Number":"US-12162009-0012","Object Shape":"Triangle","Longitude":"-85.798628","trends":["There have been 12 other sightings in Panama City Beach","There were no other sightings in Panama City Beach on or around August 11th 2000"],"Viewing Distance":"Unknown","Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.182261,+-85.798628(21021)&iwloc=A&hl=en\"> mufon case (21021) map </A>","Weather Factors":"Unknown","divs":["sighting detailsim a storm chaser in panama city beach, florida. on 8\\11\\2000 offshore lightning was seen so i desided to go down to the beach and film the lightning. while filming the offshore thunderstorms i noticed two objects to the east of me. the city lights would light them up just enough for me to notice them. i zoomed in with the camcorder and was amazed to see two black triangles with no lights. one doing impossible moves, such as, full circles, shooting back and forth up and down, moving at slow speed then darting fast and stop in mid flight and one that stayed stationary. moving one did two circles besides the stationary craft then overlapped the object completing the circle now hovering level with the stationary one. then it moves from right to left slowy and rubs the bottom of the second craft and slowly moves down and away until lightning lights them up. the moves were incrediable! hovering stationary and gracefully moving up down, left, right, doing circles without having to turn around! it was like there was no front cause it moved in all directions. the whole time one object would remain stationary not moving at all but the second one did all the crazy stuff. throughout the time the moving craft always returned to the stationary craft. they did this for about 15mins and i lost sight of them in the darkness. nothing, no plane, kites, birds, remote control air craft can stop in mid flight, back up and hover then dart away. nothing. video is at http:\\\\www.youtube.com\\watch?v=58m8uad7j5k"],"Tags":"City","Case Number":"21021","Date of the Event":"08/11/2000 03:20 UTC","Latitude":"30.182261","Sighting Duration":"00:15:00","Disposition":"Unknown"}