{"Summary":"Huge Object with 3 Blinking Lights","Viewing Distance":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsI was driving home from work around 6:15PM and just before I got to my street, I saw what I at first thought were airplanes, flying in a row. As I continued to look, I realized they were pretty close together to be airplanes. Then I slowed down and realized all 3 lights were moving together. I pulled over so to get a better look and to eliminate my moving as a factor. I rolled down my window and was surprised to see that the 3 blinking lights were definitely moving together and realized that if they were on one object, it would be a huge object. The lights seemed to blink in a series (1,2,3) It was also smoothly moving with no sound. I watched it for about 3 minutes, then drove quickly down and yelled to my husband to get in the car. We then drove back up to where it had been and I could still see it, but it was moving to the west. We followed it for about 10 minutes out on the county road and he agreed, it was huge and unlike anything he had ever seen. He was in the military and has a good background for identifying aircraft. Also, when I saw it originally the 3 lights were in a horizontal row, but a few minutes later when my husband was with me, the 3 lights were still in a row but more at a 45 degree angle to the ground as if turning. There was also no vapor trail or heat signature, and it was a very cold evening. I believe this is the same oject that was reported by a couple in O'Fallon, MO last night at 6PM."],"trends":["There have been 2 other sightings in Robertsville","There were no other sightings in Robertsville on or around December 15th 2009"],"Date of the Event":"12/15/2009 06:15 UTC","files":["/var/www/straped/mufon/html2text/21023.html.txt","/var/www/straped/mufon/org/21023.html"],"Object Shape":"Unknown","City":"Robertsville","Object Flight Path":"Path with directional change","Country":"United States","Log Number":"US-12162009-0014","Tags":"City","Case Number":"21023","Longitude":"-90.814022","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unknown","Region":"Missouri","Latitude":"38.414775","map":"<A HREF = \"http://maps.google.com/maps?q=38.414775,+-90.814022(21023)&iwloc=A&hl=en\"> mufon case (21023) map </A>","Date Submitted":"12/16/2009 08:39 UTC","Weather Factors":"Unknown"}