{"trends":["There have been 5 other sightings in Matteson","There were no other sightings in Matteson on or around December 15th 2009","This sighting has never been favorited.",""],"Log Number":"US-12162009-0011","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Date of the Event":"12/15/2009 06:30 UTC","files":["/var/www/straped/mufon/html2text/21020.html.txt","/var/www/straped/mufon/more/21020_submitter_file1__unknown1.jpg","/var/www/straped/mufon/org/21020.html"],"Latitude":"41.507024","City":"Matteson","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.507024,+-87.708282(21020)&iwloc=A&hl=en\"> mufon case (21020) map </A>","divs":["Sighting DetailsTraveling east on U.S. rt.30 I noticed 3 lights in a stretched triangle shape due east from my position at the intersection of rt.30 and Wolf Road in Mokena, IL. After seeing them I asked my brother, who was traveling with me, If he had any idea what they were. As we are both very usedto the presence of commercial aircraft, as these lights had NOTHING in common with commercial aircraft, we ruled that possibility out. The lights seemed to be stationary as related to distance from my self,(approximately 8 miles?) but their positions did change quite a bit. As I traveled east along RT.30 at approximately 40mph I was unable to get closer to them. I assume they were travelling about the same rate of speed as myself. The lights were VERY low in the sky, sometimes below the tree line, but mostly just above the tree line. The lights were continuously flashing the colors of white, yellow, gold, and occasionally red. At times the flashing was in unison. About one mile east of US Rt45(LaGrange rd.) I dropped my brother of at his house. We spent about 5-7 minuites inside. When returning to the outside, we noticed the lights were still there. At that point I decided to try following them further, hoping for a better vantage point. When I got roughly half a mile from Harlem AVE., I noticed a fourth light moving toward the others. When I reached Harlem AVE. the fourth light had merged with one of the original three. I thought it would go past, but it never did. It just merged. To say the lights were in a triangular shape would be accurate, however the triangle shape was constantly changing. The motions were almost fluid like. At the intersection of US.30 and Ridgeland AVE. (now in Cook county) I stopped to take a photograph with my cell phone. I took a single photo, but I don't think it turned out well. I have attached the photo. the lights are barely visible in the white box"],"Object Features":"Unknown","Region":"Illinois","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Object Shape":"Square, Rectagular, Triangle","Longitude":"-87.708282","Tags":"City","Source":"MUFON","Case Number":"21020","Summary":"Lights from 2004 Tinley Park sighting seem to have re-appeared","Date Submitted":"12/16/2009 07:21 UTC"}