{"files":["/var/www/straped/mufon/html2text/21034.html.txt","/var/www/straped/mufon/org/21034.html"],"trends":["There have been 4 other sightings in Port Arthur","There were no other sightings in Port Arthur on or around September 29th 2008"],"Date Submitted":"12/17/2009 03:24 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Path then hovering","Summary":"Metalic disk shape red glowing lights around it","Case Number":"21034","Disposition":"Unknown","Weather Factors":"Unknown","Date of the Event":"09/29/2008 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.89489,+-93.931447(21034)&iwloc=A&hl=en\"> mufon case (21034) map </A>","Viewing Distance":"101-500 Feet","Longitude":"-93.931447","Region":"Texas","Log Number":"US-12172009-0008","Country":"United States","Latitude":"29.89489","divs":["Sighting DetailsMy dad and I were on are way back from his friends house it was around 10:00 at night and it was last year 2008 after hurricane Ike hit us and my dad was driving down highway 73 and I was in my own little world looking out the window at the night sky. Thinking about random stuff and as I was looking out the window I saw something flying slow towards me. In my mind im like what in the world and I was thinking ok no this cant be happening right now. I asked my dad what is that? He said oh its nothing its just a blimp and I told him no its not. It was coming from North of us right when my dad stoped at the stop sign it stoped. My dad and I were frozed and amaze at what we are seeing. While we were looking at it. It was round and flat and it remind me of this ride that I really love called Gravitron that had red lights all around it and they were not blinking or anything it didnt even make a sound. While we were still looking at it and in my mind im thinking I dont believe what im seeing there is no way that this thing that im seeing is a UFO no way! As we are still looking at and im thinking those thoughts in my mind it started to tilt towards us and I thought it wanted to land or something. I kinda wanted to go out and look at it but I was to amaze by it. I also didnt think about taking a picture of it I was thinking that it might not have shown in the picture if I did or it might have took off. My dad started to leave and he asked me to look back and see if I could still see it and I told him I could he asked me what is it doing now and I told him it is still tilting. We were the only ones out there and we were not post to be out there at that time it was past curfew of the hurricane. When we were on are way back we saw a cop and he didnt do nothing just shine is flash light at us. For about three nights my dad would wait outside to see if he would see it again. I thought my dad was crazy for doing that and I didnt want to tell anyone because I knew people wouldnt believe me. The only person I told was my best friend Ashley she said thats what I get for not believeing in UFO's and the other person I told was my teacher. She probably thought I was crazy."],"Source":"MUFON","Object Shape":"Disc","City":"Port Arthur"}