{"Viewing Distance":"21-100 Feet","Tags":"City","Weather Factors":"Unknown","Summary":"Extra Terrestrials in my neighbor's yard","Date Submitted":"12/17/2009 06:56 UTC","Source":"MUFON","Object Shape":"Other","Log Number":"US-12172009-0006","Case Number":"21032","Object Flight Path":"Unknown","divs":["Sighting DetailsFirst what happened is I woke up because i heard a boom from outside. I was scared out of sleep. i sit up, and I see a white figure in my neighbor's yard. I figure it must be a light, and i try to fall asleep again. It does't work. I think about what it could be, and I sumrised an extra terrestrial. For 30 minutes i was scared like hell to even get up, so i checked my cell phone which was on the table next to me to check the time. it was exactly 6:02. the event has gone from about 5:30 to now, for i currently see the objects while writing the report. i sit up, and i see the figures closer now, so i can make out what they are. Bodies. Paper white bodies in the distance. i stare at the figures longer. I see the figures blink their \"heads\" on and off, with no particular pattern, as if speaking to one another. Then i see a third one come in. The order of the objects in the window is this fom me: Orange figure far left, short figure middle, a slightly bigger figure to the far right. This orange figure is about twice the size of the other two, and is orange. I heard a great roam from the sky, like the cry of a low wailing engine. I figure it could be their vessel's engine, but i cannot see any crafts. I get up a little bit later to look out the window. I saw them oh so clearly. I saw bodies, two arms, two legs, heads, and on one of them i saw a seperate light coming from the one on the far right. It is square. it seems like a map. they blink their \"heads\" once again as if in conversation, and i turn on my computer to write this report. I am but 15, so i am scared shitless, shaking more than i ever have in my entire life, pardon my french. I talk to my friend and she says she wishes to see the figures as well, while i do have a webcam, it is too late. I look out one last time, and they vanish. I heard another engine sound, loud and clear, and then nothing. Only the wind remains now."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.575775,+-72.502625(21032)&iwloc=A&hl=en\"> mufon case (21032) map </A>","trends":["There have been no other sightings in East Hampton","This sighting has never been favorited."],"Longitude":"-72.502625","files":["/var/www/straped/mufon/html2text/21032.html.txt","/var/www/straped/mufon/org/21032.html"],"Object Features":"Undisclosed","Disposition":"Hoax","Country":"United States","Region":"Connecticut","City":"East Hampton","Sighting Duration":"Undisclosed","Date of the Event":"12/17/2009 12:00 UTC","Latitude":"41.575775"}