{"Source":"MUFON","Disposition":"Unknown","Weather Factors":"None","trends":["There has been one other sighting in Davenport","There were no other sightings in Davenport on or around January 9th 2003"],"Date of the Event":"01/09/2003 08:00 UTC","Tags":"City","Object Shape":"Sphere","Log Number":"","Summary":"witnessed a spherical object with muliple colored","divs":["Sighting DetailsI was at my residence south of Davenport, WA. At approx 1930hrs my nephew calledand said there was a strange object in the sky near my home. Rick and I walkedoutside my garage and looked in the general direction my nephew said he sawobject. We spotted the object, which initially we thought was an airplane,however it never moved not up or down or left to right not in the slightest. Wedecided to take the binoculars and drive up into my field for a better look. Youcould not see the main structure of the craft, but the lights were quitebrilliant white then red then blue-violet, continuous, and I repeat it nevermoved a bit. We watched for half an hour got bored and returned to the house. Ishowed it to my wife, daughter and son. Rick went home claiming it had to be aplanet, but it was not there on following eves. My son continued to monitor itthrough our living room window until about 10pm., then we all turned in for thenight. My nephew said he and his friend observed 2 objects, the one which I havedescribed plus another which he said appeared the same as this one. The lightson the object appeared to rotate in a circular motion as if positioned eitherabove or below the object, however I could not discern the shape or color of theobject, since the lights appeared to travel in a circular motion, I probablyassume a spherical shape."],"Date Submitted":"01/09/2003 08:00 UTC","Longitude":"-118.149973","map":"<A HREF = \"http://maps.google.com/maps?q=47.654046,+-118.149973(2103)&iwloc=A&hl=en\"> mufon case (2103) map </A>","Country":"United States","Object Features":"Other","Sighting Duration":"01:59:00","Latitude":"47.654046","Region":"Washington","files":["/var/www/straped/mufon/html2text/2103.html.txt","/var/www/straped/mufon/org/2103.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Case Number":"2103","City":"Davenport"}