{"Case Number":"21038","Country":"United States","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Longitude":"-119.011742","Tags":"City","Date Submitted":"12/17/2009 09:42 UTC","Disposition":"IFO","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21038.html.txt","/var/www/straped/mufon/org/21038.html"],"City":"Bakersfield","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-12172009-0012","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around October 23rd 2009"],"Latitude":"35.382932","Summary":"golden, shaped like a planet, no flicker","Object Shape":"Star-like","Date of the Event":"10/23/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.382932,+-119.011742(21038)&iwloc=A&hl=en\"> mufon case (21038) map </A>","Region":"California","Object Features":"Undisclosed","divs":["Sighting DetailsI was sitting outside the back yard and the sun was down and dark outside, I was talking with my daughter on the phone and sitting in a chair that was facing N.N.W. and from the south moving towards the North, North, West the golden star-like object moved at a single, slow speed, there was no sound, no exhaust. Moving North, North, West from my approximation where I was sitting down it seemed as though it was just four houses to the west of me and just above the tree line. It's direction never changed course, I told my husband to come see without taking my eyes off of it and he said \"well, that is weird never seen anything like that before\" and as it moved in it's one direction we watched and it went a distance and disappeared into the atmosphere as though a door opened in the air that was not visible and the star like ship went inside and was gone. This is the fourth star like ufo that I have sighted in one year. I was not afraid at all, was very peaceful and when I have mentioned it to others they seem to not want to hear about it again. I am sorry that I have not photo's but my memory serves me well."]}