{"Disposition":"Insufficient Data","Region":"California","files":["/var/www/straped/mufon/html2text/21030.html.txt","/var/www/straped/mufon/org/21030.html"],"Summary":"Just happening to stop looking for UFOs in the 'hood and off the radio!","map":"<A HREF = \"http://maps.google.com/maps?q=32.803773,+-116.959857(21030)&iwloc=A&hl=en\"> mufon case (21030) map </A>","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Country":"United States","Longitude":"-116.959857","divs":["sighting detailsi remember listening to the art bell coast to coast show off the radio. there were reports of a ufo traveling from southern california to the pacific northwest a week or two ago. so i did my share to looking up because if you keep looking, you will see something. outside of my patio i shared with my friends, i was the only one standing outside in the dark i first noticed the ufo as a flashlight darting across the night sky. i didn't know what i just saw at the time. i thought it some f-18 or f-14 'cuz due west is san diego and pacific navy fleet or maybe aurora. right in front at the high school(my apartments were right next to it) it appeared. but i did remember the flash(ufo) folded something before me. as if space\\time folded! it was a ufo! gigantic triangle with two lights in front above one other. one white light and the other light green(i think). it was very quiet! no sound, no one else but me outside too! i wanted to tell my friends right away but i didn't want to miss out on what was happening here. slowly, it drifted due east from the el cajon h.s. and over the other rows of apartments (headed to ufo college, i wondered). drifting w\\o no sound or cars or people but me, i estimated length to be no less 100 feet long and maybe 40 feet from wing to wing at the ufos' greatest radius. when the ufo started over the street, continuing to drift due east, i saw three exhaust ports in the rear. no emanations of exhaust coming out. so, the ports weren't being used. the bigger exhaust port in the middle. just as soon as i saw this ufo, it was gone in what i believe to be 30 seconds. the distance i was to this thing was maybe only a parking lot away. i was on the second row of apartments from it between us a long parking lot."],"City":"El Cajon","Sighting Duration":"Undisclosed","Latitude":"32.803773","Source":"MUFON","Viewing Distance":"Unknown","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around April 10th 2003"],"Object Shape":"Triangle","Log Number":"US-12172009-0004","Date Submitted":"12/17/2009 02:20 UTC","Weather Factors":"None","Date of the Event":"04/10/2003 12:00 UTC","Case Number":"21030"}