{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.756389,+-81.571389(21039)&iwloc=A&hl=en\"> mufon case (21039) map </A>","Weather Factors":"Unknown","Tags":"City","Case Number":"21039","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in St Marys","There were no other sightings in St Marys on or around October 19th 2009"],"Date Submitted":"12/18/2009 09:24 UTC","City":"St Marys","Date of the Event":"10/19/2009 09:00 UTC","Object Flight Path":"Undisclosed","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/21039.html.txt","/var/www/straped/mufon/org/21039.html"],"divs":["sighting detailsi was taking out the trash when i noticed a very bright white object that was very high and moving quickly in a southerly direction. after a 40 seconds it went straight up right before the bright southern star. there is a cluster of many stars just before that star. this is where it went up out of sight in about 2 seconds. it was silent, circular and fast. there was serveral jets flying at the same time heading north out of florida like normal and i could see there flashing beacon lights. this object was slightly higher than the jets but, moving faster and as bright as a star. i've been an r\\c pilot for 25 years and familiar with many jets and their movements. this was not like them and had no becon. i have not seen it again, but will keep looking. i noticed it because it was like moving and brighter than a planet. i immediately realized it was not an airplane or blimp and when it stopped and went straight out into space in 2 seconds i was sold. i could hear the near by jets and see their lights. this ufo had no sound, after trail and no becon light. it accelrated way to fast stright up out of sight. it didn't go up then parallel, but stright up out of sight. i didn't bother trying to get my camera, because i new it would be gone. i just watched it. i can provdie a sketch, but don't have time right now."],"Log Number":"US-12182009-0001","Object Features":"Undisclosed","Sighting Duration":"00:05:00","Region":"Georgia","Longitude":"-81.571389","Latitude":"30.756389","Summary":"circular bright object moving silently south, very high but larger than a planet. When it stopped and started getting smaller and dimmer (was moving straight up) until it was gone.","Disposition":"Insufficient Data"}