{"Date Submitted":"12/18/2009 04:52 UTC","Log Number":"US-12182009-0010","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around December 17th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.722533,+-74.003853(21048)&iwloc=A&hl=en\"> mufon case (21048) map </A>","Tags":"City","Summary":"2 GLOWING ORBS TURN TO 4 THAN 2 AGAIN THAN A TRIANGLE","Date of the Event":"12/17/2009 10:30 UTC","Sighting Duration":"Undisclosed","Region":"New York","City":"New York","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/21048.html.txt","/var/www/straped/mufon/org/21048.html"],"divs":["Sighting DetailsHey my name is Justin and i live in Oceanside NY . Last night (12-17)at 1030 my friend and I were driving homefrom taco bell and i noticed a very bright light to my south and it wasn't moving.I waited for us to get a lil closer so i could line it up with a tree and really make sure it wasnt moving, it wasnt. My house is only a few blocks from there and my freind pulled off the main road. So I asked him if he would get back on the main road. We got stuck at a light for a while and I thought it would be gone. But as soon as we got back on the main road he saw it as well. It was two glowing balls of light. We drove more to the south and saw two huge glowing balls of light to the east between the dump and Pete's clam bar. Out of no where these two balls became four lights, these lights couldn't have been more than half a mile from us. So we made a left and went east for a block and it was right in front of us. I jumped out of the car to try and video it but as soon as we got there it was two balls again.Then a dim third light illuminated on the front and it formed a triangle and slowly started to move to the west right towards NYC. I lost sight of it as it went over the horizon line. It made a weird pulsing sound that sounded like a plane, but a pulsing sounding, almost as if the plane couldn't get the engines started but this object (or objects) was having no problem moving. It definitely wasn't moving as fast as a plane either when it started to move. Also we could def see the water behind it when it was just two or 4 orbs but when it started to move you could see i ship or object in the sky. I have a video of it once it was a flying object moving but its a cell phone cam and it sucks, but if you guys want to analyze this tape ill def send it to you but like I said its a really bad quality. Again I live right near JFK and know exactly what a plane looks like and there is no way these balls or the thing it became was a plane."],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Disposition":"Insufficient Data","Source":"MUFON","Case Number":"21048","Longitude":"-74.003853","Latitude":"40.722533","Object Shape":"Circle, Fireball, Oval, Sphere, Star-like, Triangle"}