{"Date Submitted":"12/18/2009 06:17 UTC","trends":["There have been 6 other sightings in Algonquin","There were no other sightings in Algonquin on or around December 12th 2009"],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/21049.html.txt","/var/www/straped/mufon/org/21049.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.1705,+-88.287309(21049)&iwloc=A&hl=en\"> mufon case (21049) map </A>","Case Number":"21049","Date of the Event":"12/12/2009 12:00 UTC","Disposition":"Hoax","Region":"Illinois","Summary":"Large Lighted Disc/Triangle Over Fox River","Sighting Duration":"00:04:00","Latitude":"42.1705","Viewing Distance":"21-100 Feet","Object Features":"Undisclosed","Log Number":"US-12182009-0011","divs":["Sighting DetailsMy 13 year old son attended a sleepover at a friends. The house is situated on the bluffs overlooking the Fox River in Algonquin, on the east side. At approximately 3 a.m. my son, and another of the boys were up watching movies, but getting ready for sleep when they glanced out the large window in the room in which they were sleeping. That window faces west, over the river. Both my son, and the other boy, reported to me the next morning that they had seen a massive, lighted shape slowly floating north over the Fox River. It went north, then reappeared slowly returned going south, until it disappeared from their view, a few minutes afterward it was seen heading north again. They could not estimate the height, but it was over the trees. They said it had a bright white light in front, and some smaller white lights toward the year. The shape was blimp but flared in back, like a triangle. They could hear no sound. It blended in to the night sky but near each light you could see a silvery patch. they could tell the size as it blocked out the stars. It did not move quickly, just slowly, almost like a powered blimp would, but they are certain it was not a blimp or balloon, the latter very common around here. My son as an adamant non-believer in any type of phenomenon like this, and said it was the most frightening thing he ever encountered."],"Country":"United States","Object Shape":"Oval, Triangle","Source":"MUFON","Longitude":"-88.287309","Tags":"City","Object Flight Path":"Straight-line path","City":"Algonquin"}