{"City":"Mackay","trends":["There has been one other sighting in Mackay","There was one other sighting in Mackay on or around December 17th 2009"],"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/21040.html.txt","/var/www/straped/mufon/org/21040.html"],"Object Shape":"Star-like","Viewing Distance":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=43.91463,+-113.613355(21040)&iwloc=A&hl=en\"> mufon case (21040) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Region":"Idaho","Weather Factors":"Unknown","Tags":"City","Case Number":"21040","Date Submitted":"12/18/2009 10:54 UTC","Log Number":"US-12182009-0002","Date of the Event":"12/17/2009 09:15 UTC","divs":["Sighting DetailsNear the constellation of Orion. If you looked at the two start that form orion' pointsof his shoulders and drew a line straight down to the horizon you would see a fairly bright star. Last night around 9:15 I went outside to do a chore. Looked up and saw a very bright light above the horizon that was flashing a Blue, red, then white light at the point of the star I noted above. At first I thought it was a helicopter and the light seemed close as it was so big but there was no sound. Then I saw what appeared to be a common airplane fly under it that I could not hear either so I started to think this light was further away than I thought. It kept flashing, flashing but did not appear to move in relation to the other stars. It was the brightest thing in all sky and it kinda seemed like there was a christmas light show going on with this light. I watched for at least 45 minutes outside. Called my husband out and he saw it too. What I considered green he called blue. Maybe it was a teal color. The colors were very distinct. Flashing Flashing, one afer the other. My husband is more of a sky watcher than me and he said he'd never seen anything like it. Eventually it seemed to settle down and was only flashing colors intermittantly and its size and brighness was diminishing. By 10:40 it looked like any other star in the sky. It never moved away, a did move along with the other stars in the sky, In other words, it was not stationary. it moves as though it was a star progressing through the heavens on its usual night time course. I did not feel any particular emotion except wonderment and some excitment as I had seen ships a very long time ago and I was hoping for more of a show but it didn't happen."],"Longitude":"-113.613355","Latitude":"43.91463","Summary":"Flashing Green/Blue,, Red, White Light"}