{"Sighting Duration":"Undisclosed","Date Submitted":"12/18/2009 04:11 UTC","Object Features":"Undisclosed","Tags":"City","Latitude":"40.720693","Disposition":"Insufficient Data","trends":["There have been 579 other sightings in New York","There were 3 other sightings in New York on or around December 17th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/21046.html.txt","/var/www/straped/mufon/org/21046.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Summary":"2 GLOWING ORBS TURN TO 4 THAN 2 AGAIN THAN A TRIANGLE.","Source":"MUFON","Object Shape":"Circle, Fireball, Sphere, Triangle","Country":"United States","City":"New York","Date of the Event":"12/17/2009 10:30 UTC","Longitude":"-74.002923","map":"<A HREF = \"http://maps.google.com/maps?q=40.720693,+-74.002923(21046)&iwloc=A&hl=en\"> mufon case (21046) map </A>","Case Number":"21046","Log Number":"US-12182009-0008","divs":["Sighting DetailsHey my name is Justin and i live in Oceanside NY . Last night (12-17) my friend and I were driving home from taco bell around 1020 and i noticed a very bright light to my south and it wasn't moving. I knew it wasn't moving because when we passed Nathans I lined the lights up with a tree and it wasn''t moving at all,. I couldn't stop starring at it. Then my friend turned on the block to get to my house and I asked him if he would please go back on the main road. He asked me why and I told him because I thought I saw a bright light in the sky. So we got back onto the main road and as soon as we turned south he saw it as well.At this point I called my girl friend and asked her to go outside because it looked like it was directly to her south. She didn't see any thing. So we began to drive more to the south and we both saw two huge glowing balls of light to the east between the dump and Pete's clam bar. Out of no where these two balls became four orbs, these lights couldn't have been more than half a mile from us. So we made a left and went east for a block and it was right in front of us. I jumped out of the car to try and video it but as soon as we got there it was two balls again.Then a dim third light illuminated on the front and it formed a triangle and slowly started to move to the west right towards NYC.We lost it as it hit the horizon line. It made a weird pulsing sound that sounded like a plane but not as loud.It sounded like a pulsing almost as if the plane couldn't get the engines started but this object was having no problem moving. It definitely wasn't moving as fast as a plane either when it started to move. I have a video of it once it was a flying object moving ,but its a cell phone cam and it sucks, but if you guys want to analyze this tape ill def send it to you but like I said its a really bad quality(I cant figure out how to save the file of this video. So I can email it to u as well if you like). Again I live right near JFK and know exactly what a plane looks like and there is no way these balls or the thing it became was a plane."],"Region":"New York"}