{"Weather Factors":"Unknown","Case Number":"21045","Latitude":"20.759167","files":["/var/www/straped/mufon/html2text/21045.html.txt","/var/www/straped/mufon/org/21045.html"],"Sighting Duration":"Undisclosed","Date Submitted":"12/18/2009 03:26 UTC","Object Flight Path":"Undisclosed","Longitude":"-156.457222","Log Number":"US-12182009-0007","trends":["There have been 2 other sightings in Kihei","There were no other sightings in Kihei on or around October 10th 2008"],"Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Object Shape":"Other","Region":"Hawaii","City":"Kihei","map":"<A HREF = \"http://maps.google.com/maps?q=20.759167,+-156.457222(21045)&iwloc=A&hl=en\"> mufon case (21045) map </A>","divs":["sighting detailsi had gone outside with my video camera at night. i saw nothing at the time but later, after viewing my video, i saw and heard something that flashed quickly on my screen. i freeze framed it and what i saw i couldn't explain. these orbs sort of flashed down and then reversed directions. there were two clusters of about six or so, both in semi-circle formations. the orbs glow red, orange and yellow, as you can see on this photo i've posted on myspace http:\\\\viewmorepics.myspace.com\\index.cfm?fuseaction=viewimage&friendid=255911914&albumid=919638&imageid=12286337 here is a shortened clip that i made by revideo taping that segment. http:\\\\www.youtube.com\\watch?v=rfjsw569ksa i would guess them to have only been about 10 feet away from me, so they were rather small in comparison to the ufp's of similar descriptions. i would also like to add that when i moved the photo on the orbs on \"my documents\" a strange thing also happened. the black around these orbs turned white. i don't understand how that could have happened either. here's the link. http:\\\\www.youtube.com\\watch?v=u1mxorj_8iq"],"Tags":"City","Date of the Event":"10/10/2008 12:00 UTC","Object Features":"Undisclosed","Summary":"Two clusters of orbs appeared on video taken outside my home, in close range. They then jump back the opposite direction, making a clicking sound as they do.","Disposition":"Insufficient Data"}