{"divs":["Sighting DetailsI was stepping out the door on my to the car, I was going to go to my grandmother's, when I routinely looked up to observe the sky, not expecting to see antything. But I saw something up there. I couldn't exactly tell, but at the time I'd thought it was long, but as it slowly crept forth I realized it was more like a circle. My first thought was that it was a blimp, only no blimps ever glide over our small town- never. I stood and looked for a few minutes, and it stayed put almost the whole time. When it moved slowly I called my mother out of the car, and we called my grandmother. We saw several, 4+, strange lights in the sky. We stood there watching them for a while, and once they started to move more quickly we decided to follow them in our car. The whole time, both when we were outside and in the car, my heart was beating out of my chest, and I felt unsafe. For a while we followed just one, but then I noticed three, then four, then five. I can't remember how many, exactly, that I saw, but we were looking at different ones, all of them either speeding extremely fast or hovering in one spot. Soon we reached thick woods, and some slipped out of sight. We drove around slowly for a while trying to relocate the brightest one. We finally found it again, only this time it turned around, and it headed straight back towrads our house. We followed it, then it went over some other roads, and dispaeered behind trees again. We saw another one fade into view, and we followed it for a while. As we came to a fork in the road, it moved beyond our reach. We watched it go for a while, its lights still visible farther away than would be an airplane's. It zig-zagged and did twists for while then slipped behind some cloud cover. Moving onto the by-pass I finally saw the biggest one again. It was headed out beind us somewhere. I followed it all the way into town with my eyes until we hit the street lights, and I couldn't see it anymore. When we arrived at my grandmother's house, I couldn't even walk straight for my excitement and a bit of shock. All the while I couldn't believe that my routine gaze into the sky had brought on such excitement. My mind raced. All of a sudden it felt as if I was wrong. Like my sureness and certainty had all been naive. But, I remebered how I felt and what I'd seen at the time of my sighting, and that somewhat kept me believing my own eyes. Although this had not been my first sighting, it felt like seeing it for the first time as it seems, every time afterwards, that I was totally mistaken."],"Tags":"City","Object Features":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"12/18/2009 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.925575,+-93.280626(21052)&iwloc=A&hl=en\"> mufon case (21052) map </A>","Case Number":"21052","Sighting Duration":"Undisclosed","Longitude":"-93.280626","Date Submitted":"12/18/2009 09:59 UTC","Source":"MUFON","Disposition":"Unknown","City":"Rosepine","files":["/var/www/straped/mufon/html2text/21052.html.txt","/var/www/straped/mufon/org/21052.html"],"Latitude":"30.925575","Object Flight Path":"Undisclosed","Country":"United States","Summary":"red-and-white strobe lights, bright lights, moved quickly, slowly, and hovered at times.","trends":["There have been 2 other sightings in Rosepine","There were no other sightings in Rosepine on or around December 18th 2009"],"Region":"Louisiana","Log Number":"US-12182009-0014","Object Shape":"Circle, Flash"}