{"Case Number":"2105","trends":["There has been one other sighting in Mullumbimby","There were no other sightings in Mullumbimby on or around January 30th 2003"],"map":"<A HREF = \"http://maps.google.com/maps?q=-28.553385,+153.499582(2105)&iwloc=A&hl=en\"> mufon case (2105) map </A>","Object Shape":"Undisclosed","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI wasstanding on the street in front of our house having a cigarette just before9pm, looking at the sky which was particularly clear at the time, I often watchfor satellites passing over,which is what I first thought the object was.It was like a satellite in appearance, a moving star-like point of light.I first spotted it approximately 20 degrees above the southern horizon and itmoved in a straight line overhead. I lost sight of it approximately 10 degreesabove the northern horizon. What struck me as unusual about it was thetremendous speed it was travelling at. I would estimate it was at an orbitalheight, yet it took only 10-15 seconds to transit, compared to 10-15 minutes for the satellites I often see go over. It was silent and the light was constantwith no flashing nav. lights of any kind. I checked heavens above.com forsatellites passing over at that time but there were none transitting withinthose times. Although there was nothing overly spectacular about this sighting Iwas highly impressed by the speed the object was travelling at."],"Date of the Event":"01/30/2003 08:56 UTC","Sighting Duration":"00:00:59","Log Number":"","City":"Mullumbimby","Latitude":"-28.553385","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2105.html.txt","/var/www/straped/mufon/org/2105.html"],"Viewing Distance":"Over One Mile","Disposition":"Unresolved","Country":"Australia","Longitude":"153.499582","Date Submitted":"01/30/2003 08:56 UTC","Weather Factors":"Unknown","Tags":"City","Summary":"Object transiting over Mullumbimby NSW Australia.","Region":"New South Wales"}