{"Log Number":"ES-12202009-0006","Object Flight Path":"Straight-line path,Unknown","Country":"Spain","Viewing Distance":"21-100 Feet","Latitude":"36.727228","map":"<A HREF = \"http://maps.google.com/maps?q=36.727228,+-4.417476(21067)&iwloc=A&hl=en\"> mufon case (21067) map </A>","trends":["There have been 3 other sightings in Malaga","There were no other sightings in Malaga on or around November 30th 1957","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Features":"Patterned Surface, Insignia","Disposition":"Unresolved","Date of the Event":"11/30/1957 04:00 UTC","Region":"Andalucía","City":"Malaga","Summary":"Photographed by my father 1958. Print found recently","Case Number":"21067","divs":["sighting detailsthe print was found and a scan made 12\\5\\09. my father never mentioned seeing the object but when we returned to the states in 1959, i remember him being a friend of roger early who was somehow connected with project blue book. i believe the neg may have been given to early. i do know that from living in torremolinos, kids back then did not play with kites, model planes or paper planes. all the kids on the beach were poor fishermen's kids. my father used a nikon rangefinder camera, plus-x film and was shooting the fishing boat to use as a subject in one of his paintings. he was a famous painter (google: ben stahl). the exposure seems to be f8 or 16 @ 1\\250 or 1\\125 because of the frozen action of the waves in the photograph and the depth of field. it's not a blur of a bird, tear on the neg or delamination on the print. the print has a fold (visable on the picture across the horrizon). the surface of the original print is clean. i used \"unsharp mask\" in photoshop to bring the scan in better focus. this produced marking on the body of the object. note the shadows on the object are consistant with shadows on the man behind the boat. the man is shielding his eyes and looking at something down the beach, in the sky or out at sea and not at the object overhead. perhaps there were two objects? the object in the photogeaph has an odd perspective as it looks far away yet close over the shore line. also, note the disturbance in the air at both ends of the object. it also cannot be something on the lens as this would be totally blown out of focus. i've searched other photographs and have failed to see any other object with the same shape. bruce maccabee saw the image and could not come up with an answer as to what it could be. nothing in a camera, especially a slr, can produce such an effect. if something was thrown in front of the camera it would not have produced the \"air disturbance\" as shown - these are not developing streaks either. please let me know what you think. regards, david stahl"],"Date Submitted":"12/20/2009 12:35 UTC","Source":"MUFON","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/21067.html.txt","/var/www/straped/mufon/more/21067_submitter_file1__ufocolorfromoriginalprint.jpg","/var/www/straped/mufon/more/21067_submitter_file2__UFOSpain1958close-up.jpg","/var/www/straped/mufon/more/21067_submitter_file3__ufo6.jpg","/var/www/straped/mufon/org/21067.html"],"Weather Factors":"Unknown","Longitude":"-4.417476","Tags":"City"}