{"Disposition":"Unknown","Summary":"round sun-like object behind clouds that emitted a short, beam of light","Case Number":"21060","Weather Factors":"Windy","Object Features":"None","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"12/19/2009 07:55 UTC","Longitude":"-95.613045","Date of the Event":"12/18/2009 03:05 UTC","Source":"MUFON","Log Number":"US-12192009-0008","divs":["Sighting DetailsI was in my car, changing lanes to make a u-turn when I noticed a lady, standing outside her car in a parking lot looking up to the sky. She held up hand up to her face to shield her eyes. I looked to see what she was looking at. I looked in the sky to see what looked like the sun on a very cloudy day. I could see the round, whitish shape as if it were peeking out from behind a cloud. The shape was distinctly round and stationary, the view of it appeared cloudish. It was not bright like the sun, just white. Immediately to the left of the object (where the cloud and object met) was an orangish glow. On the opposite side of the round object, it appeared as if a broad beam of sunlight was radiating from the object. The beam did not extend that far away from the object, but it did not look like any other sunbeam I had ever seen because it was a white color and much wider that a \"beam\" of light. It shone out for a ways and then stopped At first I thought \"the second coming was at hand\", but the beam of light did not extend down to earth. I just thought it was the sun and then I realized that the sun was shining brightly to the far left of this object. I continued to look to figure out what it was, but was extremely confused at seeing what looked like two \"suns\" in the sky. I was sitting in traffic to look at it and kept looking around to see if anyone else was looking at it, but saw no other heads turned. Just the lady in the parking lot, the occupants of her car, and I were observing this strange event in the sky from what I could tell. I'm hoping someone else saw the same thing. Then the traffic began to move and as I moved farther up the line, I looked back at the sky and it was gone. It was a very bizarre sighting in the sky. I have no idea what it was, but would like to. I was mesmerized by it trying to figure out what it might be. I don't know, but I will be listening to the news for any other sightings of it."],"Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/21060.html.txt","/var/www/straped/mufon/org/21060.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.098632,+-95.613045(21060)&iwloc=A&hl=en\"> mufon case (21060) map </A>","City":"Tomball","Latitude":"30.098632","Tags":"City","Country":"United States","Region":"Texas","Object Flight Path":"Stationary","trends":["There have been 8 other sightings in Tomball","There were no other sightings in Tomball on or around December 18th 2009"]}