{"Region":"Arizona","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Case Number":"21068","map":"<A HREF = \"http://maps.google.com/maps?q=33.457757,+-112.070667(21068)&iwloc=A&hl=en\"> mufon case (21068) map </A>","Date Submitted":"12/20/2009 04:21 UTC","Summary":"TWO MIB CONFISCATE CLOSE-UP OF UFO PHOTO AND THREATEN LIVES","Sighting Duration":"Undisclosed","Log Number":"US-12202009-0007","Object Features":"Undisclosed","Longitude":"-112.070667","divs":["sighting detailsaround 1989 i was working at a restaurant in scottsdale, az. i was speaking with a customer and somehow we were on the subject of life on other planets. i recall saying something to the effect of \"the odds are that there has to be life on other planets, due to the vast number of planets\". another customer overheard me say this and said \"do you really believe that\"? i said \"yes, i do\". he said \"next time i come in, i am going to show you something\". he had a serious demeanor as he said this. i had no idea what to expect. a few days later he came in and had a brief case with him. this brief case was totally dedicated to this ufo encounter he had experienced. he showed me a map of arizona, where he had outlined the area that he had encountered a ufo in. it was the roosevelt lake area, north of phoenix. he then pulled out a polaroid photo he had taken. i stared at that photo for 20 minutes. it is the most realistic photo of a ufo i have ever seen. and it was very close up. the photo was taken from about 50 ft. away. it was taken at night and the only light source was from the ufo itself! it was so apparent that i didn't even ask if he had used a flash. i was obvious he had not, so i just said, unassumingly, \"why didn't you use a flash\"? his eyes got huge, and he said \"are you kidding! they would have seen me\". the reason you could tell the light was emanating from the craft was because the foliage to the left on the image was illuminated from behind. the foliage was in front of the craft, from the vantage point of the camera. the leaves were black, not green, as would be expected if the light source were from the camera. you could see only the outline of the foliage, not detail, as one would see from a camera flash. the craft was the classic disc-shaped kind. it was gray and metallic looking. the lower portion of the craft was concealed, due to a cliff overhang that it was hovering behind. i would gauge the craft to be about 60 ft. from side to side. the craft was about 50-60 ft. away from the camera-taker. the most fascinating part on the craft was the light on it. there was an orb, about the size of a basketball, that was circling the middle, most wide part of the craft. the orb was pure white in color, with not a tinge of yellow or blue. the reason you could tell the orb was circling the craft was due to the fact that the camera had captured a tail trailing the orb, as would a tail on a comet. so i tell they guy, after freaking out on the amazing authenticity of his photo, that he has to show this to someone. he said \"i plan to. there is a professor\\ufologist at asu that is interested in this\". so i see the guy several days later and he said he had taken the photo to the asu (arizona state university) guy. he said the asu professor also said it was the best ufo photo he had ever seen. i see the guy several days later, again, and ask him what the asu professor guy is doing with the photo and such. he starts acting really weird. he wouldn't answer me. i asked him again. his demeanor was that he was pissed off. he said to me \"i'm not allowed to talk about it\". i said \"what? what do you mean?\" he said \"i'm not allowed to talk about it\". he is really agitated. i can't resist, so i said \"oh come on\". he said \"i'm not allowed to talk about it. two men from the government showed up at my door and said i am not allowed to mention this again, or i will diappear. they took the photo from the asu professor and threatened him as well\". since then i have read much info on ufo phenomena. interestingly, much of what i have read about mib, is that they appear at someone's door, as a pair of two men, to threaten the experiencer. mind you, his experience was long before mib, the movie, came out, and mib became part of general consciousness. i had never heard of mib at this point. the internet had not taken off yet, so he didn't research the mib phenomena to add credence to his story. he didn't need to anyway, with that photo! it now makes sense to me that these government guys take only the good photos, and leave the junk out there. thus when the genereal public views the photos, they assume the whole phenomena is people's imaginations, or pranks. they purposely allow the crappy photos to prevail. if anyone knows who the asu professor may have been, could you please contact a mufon representative. i cannot imagine there were many asu professors\\ufologists at the time."],"Date of the Event":"02/15/1988 09:00 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/21068.html.txt","/var/www/straped/mufon/org/21068.html"],"Object Shape":"Disc","City":"Phoenix","Disposition":"Insufficient Data","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around February 15th 1988"],"Object Flight Path":"Undisclosed","Latitude":"33.457757"}