{"divs":["Sighting DetailsOn the night of Nov. 22, 2009, I had a most bizzare dream of being in a place and going outside and telepathically being told to lay down on the ground and look up. As I did, A large square shaped sort of opened up the sky, a sort of portal I suppose. At that time I saw inside of the openeing two discs which counter rotated and passed through each other. They came to a point where they would reverse course and repeat. I saw some stars in the background of this opening but they were of a different resolution than the others that were not in the opening in the dark sky. Immediately thereafter, a large spiral formed inside of the \"portal\" and another smaller spiral came from the center of this larger one and came to just above where I was laying on the ground. The reason I am reporting this is because on the early morning of December 9, 2009 there was a similar sighting over Norway that was said to be a Russian Bulava rocket launch which had failed creating the two spirals. When I saw this, I was intrigued and actually quite stunned because, it was basically, a reverse of what I had dreamed. I felt it was a strange synchronicity of sorts. In my dream there was the \"opening\" in the sky first followed by the large spiral and then the smaller spiral. In Norway, it was reported in reverse. It was first the small blue spiral, then the large spiral, then the black hole looking image as the spiral dissipated. Not a conventional sighting, but something strange has happened and I feel it is beyond statistical probability to be a coincidence. I was so taken by my dream, that I entered the details into my dream journal immediately upon waking. When the Norway event occurred I called my father right away to tell him about the spiral in Norway and then to read my description from my dream journal. Additionally, and unrelated, my two daughters witnessed twice int the same morning, roughly one week ago, a definite ufo which my daughter snapped a nice photo of with her iphone. I will ask her to submit it and fill out a report. I just happened to stumble onto this site from Google and felt compelled to report my incident. Although not a conventional \"sighting\", I felt it had a definite connection to extraworldly phenomena. Kindly, Joe"],"Log Number":"US-12202009-0003","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"Dreamed on night of 11/22/09 of a spiral in the night sky with a spiral coming out of it.","Disposition":"IFO","Date Submitted":"12/20/2009 02:34 UTC","Longitude":"-84.369659","Region":"Kentucky","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.786457,+-84.369659(21064)&iwloc=A&hl=en\"> mufon case (21064) map </A>","Weather Factors":"Unknown","trends":["There have been no other sightings in Butler","This sighting has never been favorited."],"Tags":"City","Object Flight Path":"Undisclosed","City":"Butler","Latitude":"38.786457","Object Shape":"Other","Date of the Event":"11/22/2009 12:00 UTC","Case Number":"21064","files":["/var/www/straped/mufon/html2text/21064.html.txt","/var/www/straped/mufon/org/21064.html"],"Viewing Distance":"Unknown"}