{"Object Flight Path":"Stationary,Hovering then path","Tags":"City","Source":"MUFON","City":"Pekin","files":["/var/www/straped/mufon/html2text/21076.html.txt","/var/www/straped/mufon/more/21076_submitter_file1__ufodrawing.jpg","/var/www/straped/mufon/org/21076.html"],"trends":["There have been 7 other sightings in Pekin","There were no other sightings in Pekin on or around June 11th 2003","This sighting has never been favorited.",""],"Latitude":"40.571039","Disposition":"Unresolved","Object Shape":"Square, Rectagular","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.571039,+-89.633298(21076)&iwloc=A&hl=en\"> mufon case (21076) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsMy daughter and I were walking across a field to get to Aldi's in Pekin IL, it was around in June 2003 close to the middle of the month, at the end of the field you had to walk through some woods to get to the store, we were talking about random things and then she asked me if flying cars are real. I had told her that they were not, and she proceded to ask me then what was in the sky. What she had pointed to was a a box like shape with several bumps on the bottom, it was dark grey but it reflected light off of it. The top part of this thing was rectangular with sloping sides. I grabbed her and ran to the tractor tires over by the woods and we sat there watching this thing, NOT MOVE AT ALL! It seemed like we sat there over by the trees for a while and then it raced away, much faster than a normal aircraft, so it went from not moving at all to zooming away. I don't know if anyone can judge how big it was but I can estimate it was about two or three inches across in the sky from where we were standing. There were several people that saw this thing over at the Pekin Housings, I don't know if any police were called. But I just sat over by the woods when we saw this thing, I was afraid that it was going to come out of the sky. I just normally don't talk about it because people think I'm crazy when my daughter mentions it to her friends and I have to tell the whole story, I'm glad that there are sites like this. Did anyone else see this ufo in Illinois around 2003?"],"Summary":"box like UFO in Illinois 2003","Sighting Duration":"Undisclosed","Date Submitted":"12/21/2009 07:53 UTC","Object Features":"Other","Case Number":"21076","Region":"Illinois","Longitude":"-89.633298","Date of the Event":"06/11/2003 12:00 UTC","Viewing Distance":"Unknown","Log Number":"US-12212009-0004"}