{"Log Number":"CA-12202009-0010","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting Details I and my wife had gone for a walk in a park near empress st. (Green Hill). It was around 3 45 pm the sky was clear and blue. We were walking down the hill on a path (north side) towards the parking area at the foot of the hill near the maintenance yard. I looked up and noticed there were what seemed to be four spheres flying into one another (cross formation) but disappearing and then re-appearing outside the center. They traveled very fast and as one entered the center from one side the other exited it from the other side....kind of forming an equal sided double cross. I am not sure but I think we watched them do this for at least 5 min or more. Then they headed south west... one following the other. By this time I counted the spheres and I came up with 6 of them while my wife only counted four. They seemed to disappear or sort of merge with the sky. We tried to figure out what we had just seen but we could not explain the fast movement and disappearing act or the pattern they were making. They were really high in the sky, I think there were other witnesses because some other people near by were pointing to the sky in the same direction where we were seeing them. The spheres appeared bright as if the metal was being illuminated by the suns reflection but I think the spheres were emitting their own light. The spheres kept on going south west and we didn't really see them go off into the distance they just kind of disappeared."],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"21071","Date Submitted":"12/20/2009 06:59 UTC","Latitude":"49.905404","Longitude":"-97.128354","trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around May 31st 2006"],"Object Shape":"Disc, Egg, Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=49.905404,+-97.128354(21071)&iwloc=A&hl=en\"> mufon case (21071) map </A>","Region":"Manitoba","Date of the Event":"05/31/2006 03:45 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Winnipeg","Disposition":"Unresolved","Country":"Canada","files":["/var/www/straped/mufon/html2text/21071.html.txt","/var/www/straped/mufon/org/21071.html"],"Summary":"4-6 metalic spheres flying in pattern then heading south west in formation"}