{"City":"Winchester","Object Shape":"Triangle","Country":"United States","Case Number":"21072","files":["/var/www/straped/mufon/html2text/21072.html.txt","/var/www/straped/mufon/org/21072.html"],"Date Submitted":"12/20/2009 10:38 UTC","Object Features":"Unknown","Disposition":"Unknown","Date of the Event":"10/15/2008 07:18 UTC","divs":["sighting detailstriangular craft - winchester tn at approx 19:18 , my husband and i were sitting outside on our deck in the back yard talking when all of a sudden we were interrupted by what my husband was seeing. he questioning me and pointing upward in the sky asked.. \"what in the world is that?\" i looked up to see a triangular craft flying overhead it had five huge whitish lights on it. it was traveling in a se direction at a very high rate of speed at a pretty low elevation. i witnessed this event approx 5 seconds before the trees obscured my view. he recalls that there were also two very small lights, one on each side of the huge 5 round lights. the lights on this craft were a constant\\ non-blinking, a pure intense white but not beaming strongly as in lighting up our surroundings or anything - but kind of like a bright white dome light in a car. it was silent traveling se. this sighting location was close to dinah shore blvd. did a follow up the next day by phoning a couple of our local police departments and radio station but no one had heard a word or seen a thing. during my questioning, i did hear an interesting statement. i was told by someone that he had only heard of one strange case of lights was the summer before. an object the size of a 747 hovering had been seen hovering over the tims ford lake. thought that an interesting tidbit! just amazed at what we saw! we were stunned! for some reason we did not even try to move after it got out of our sight to try to see it further. i even questioned myself as to why i was still sitting there. got up, then went running around\\ towards the fence to try to get a view between the trees but we knew it was already gone - it was that fast! silent leaving no disturbance... smoooth swift flight path. huge! found out later it was on the night of a harvest moon. gives me the creeps not knowing what it was. i am hoping this is one of our new military stealths. we do have an installation pretty near here."],"Tags":"City","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Winchester","There were no other sightings in Winchester on or around October 15th 2008"],"Object Flight Path":"Straight-line path","Latitude":"35.194986","Longitude":"-86.105987","Log Number":"US-12202009-0011","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.194986,+-86.105987(21072)&iwloc=A&hl=en\"> mufon case (21072) map </A>","Viewing Distance":"Unknown","Region":"Tennessee","Summary":"Huge Triangular Craft with 5 big round white lights - low flying and silent over 2 witnesses"}