{"Latitude":"43.483152","Tags":"City","City":"Biarritz","Region":"Aquitaine","trends":["There have been no other sightings in Biarritz","This sighting has been favorited 1 time."],"Object Features":"Unknown","Country":"France","Log Number":"FR-12212009-0002","Disposition":"Unresolved","Longitude":"-1.558626","Date Submitted":"12/21/2009 02:31 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.483152,+-1.558626(21074)&iwloc=A&hl=en\"> mufon case (21074) map </A>","Summary":"Orange light ascending vertically at speed","Date of the Event":"12/21/2009 12:00 UTC","Case Number":"21074","files":["/var/www/straped/mufon/html2text/21074.html.txt","/var/www/straped/mufon/org/21074.html"],"divs":["Sighting DetailsI was woken up this morning at approximately 7.30 by a child, and as I turned over in bed I looked out the window - there was a bright light coming through it. The window faces west, towards Biarritz (about (25 miles away). I realised I was looking at a very bright star, possibly the brightest star I have ever seen. Then as I sat up (as I had never seen a star there before) I thought the object consisted of two very bright steady orange lights together. I then assumed it was a plane taking off eastwards (towards me) from Biarritz airport (though I have never seen this before either). The lights (or object) rose very slowly, and I assumed that it was indeed a plane, coming towards me after take-off. Slowly the lights started to move vertically upwards, and as they did so became fainter. Within 10 seconds it had covered about 20 degrees of sky. Within another 20 seconds it had covered another 30, all the while growing fainter, indicating that it was moving further away - indeed, the lights or object diminished in size rapidly. Within another 10 seconds it was gone in what I assume was cloud, though it was too dark to see if that was the case. There was no rooster tail or trail, and no noise (though the window was closed. There were no flashing lights, or other colours in the object. Did someone execute a missile launch in the Bay of Biscay this morning - that is almost the only scenario I can see replicating these conditions ? I am assuming it was a natural phenomena, and apart from a great sense of wonder and curiosity I have no other feelings. My over-riding impression was that this was an object at great speed. As it ascended I had the impression it curved slightly to the left (southwestwards). I have never seen a meteor or a piece of space debris move that fast or as shine as brightly."],"Weather Factors":"Unknown","Object Shape":"Other","Viewing Distance":"Unknown","Source":"MUFON"}