{"Weather Factors":"Lightning, Rain, Hail, Heavy, Light","Tags":"City","Date Submitted":"12/20/2009 05:46 UTC","Log Number":"US-12202009-0009","Object Flight Path":"Path with directional change","Case Number":"21070","City":"Jacksonville","divs":["Sighting DetailsI have to begin by saying that I have never believed in aliens or UFO's until now. About two weeks ago, my daughter and I were coming home around 6pm on a Thursday evening. It had rained heavily all day and visibility was extremely poor. While driving along a local road, the rain became so bad that many motorists pulled to the side of the road. As we crept along behind the cars in front of us, large pieces of hail began to fall from the sky. Suddenly out of no where, the rain and hail ceased and the sky appeared to open up right before our eyes. The clouds, rain and all just stopped. The cars in front of us and around us all stopped and the radio in my car turned off. As the sky opened up, a huge bright blue light flashed in the sky before us, then the sky nearly appeared to flip over or what in hind site appeared that the bright blue object was crossing from one dimension to the next. After we saw the first large blue light illuminate the sky, a smaller blue light followed and it disappeared. Immediately following, the rain and hail returned. My daughter and I were very frightened and hurried home. I have never experienced anything such as this in my entire life. I have always thought that people who said they saw aliens or were abducted, were a bunch of lunatics but now I just don't know. I told the story to my husband and he suggested that I write in to you as he listens to your show nightly. I have always laughed about this in the past, but now who's laughing? Miriam"],"Object Features":"Unknown","Viewing Distance":"101-500 Feet","Country":"United States","Latitude":"30.335024","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.335024,+-81.652741(21070)&iwloc=A&hl=en\"> mufon case (21070) map </A>","Region":"Florida","Sighting Duration":"Undisclosed","Longitude":"-81.652741","Date of the Event":"05/16/2007 06:15 UTC","Disposition":"Unknown","Object Shape":"Flash, Oval","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around May 16th 2007"],"files":["/var/www/straped/mufon/html2text/21070.html.txt","/var/www/straped/mufon/org/21070.html"],"Summary":"UFO/Dimensional sighting the the Sky"}