{"Viewing Distance":"Unknown","Longitude":"-71.585019","Date Submitted":"12/21/2009 04:14 UTC","Date of the Event":"06/18/1993 08:45 UTC","trends":["There have been no other sightings in New Shoreham","This sighting has never been favorited."],"Case Number":"21080","divs":["Sighting DetailsTime loss and multiple objects seen on Island of coast of Rhode Island, USA. I was doing seasonal work on an Island, approximately 14 miles off the R.I. coast, called Block Island. The house I lived in was on a hill with its front porch facing South. The house, called Langdon House, was leased by my employers for we, the hotel and kitchen staff. That evening there were only three of us home out of 13 other housemates. I, on the first floor, and two women on the second floor. At 8:45pm (eastern) I left my room, and to this day I don't know why I felt compelled to do so, grabbed a pair of binoculars and went out and sat on the front porch, facing south. It was mid to late June and still pretty light out. I remember this like I remember my own name. Due south was a light, midway from the horizon line, that seemed to be pulsating and changing colors. At first I thought it was a planet or a star, but when I peered through the binoculars the light looked too close, and its colors too distinct. Red, blue, green and white. I watched it for some time with binoculars. In fact I thought \"oh my god, this can't be what I think it is,\" when I heard a buzzing or a humming. I, still seated on the front porch, turned to my right and saw an object moving very slowly and seeming to hover at about 100 feet. It was vaguely triangular because it looked hazy, like orange translucence. But it gets even stranger. In the moment that it took to turn my head to the right, the evening light blackened and I could see no stars. Just the light in front of me facing south pulsing, changing colors and the object moving round my to my right. Right then and there I decided that I was not going to be the only nut witnessing this and ran into the house and up the stairs, where I found two female coworkers and housemates. I blabbered something about lights, my words travelling 80 mph. They followed me outside. When the three of us got back outside, we walked around the right side of the house where there is a driveway and a small side yard. The west side of the house. The island has virtually no street lights. There are no traffic lights. It is 7 miles long and three miles wide. Outside it was dark. There were multiple objects, all orange and hazy looking. They were everywhere. Hovering, bouncing. I also noticed that there was a light pulsating just like the first light I saw, only Due north. The three of us saw at least a dozen odd shapes performing many different feats. During this not one person walked past our house. Not one car drove past. Not one airplane flew overhead. This was strange because the Langdon House is on one of the ONLY main roads on the island. Less than a mile, SW, away is the Block Island Airport. The only way on or off the island is air or sea. It was a weekend and its usually a busy airport. The event ended at 9:15pm (eastern) according to my watch that evening and according to a clock radio in the room my companions shared on the second floor. Being keyed up by this nerve racking experience, the three of us walked less than a quarter mile down the hill to a local tavern, the Yellow Kittens. We left the house within fifteen mins if I recall correctly, after the event ended. When we got to the Yellow Kittens tavern the clock on the wall read 10:45pm. My wrist watch read 9:30pm."],"files":["/var/www/straped/mufon/html2text/21080.html.txt","/var/www/straped/mufon/org/21080.html"],"Log Number":"US-12212009-0008","Region":"Rhode Island","Weather Factors":"Unknown","Summary":"Pulsting Lights; one North one South followed by many other objects","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.173545,+-71.585019(21080)&iwloc=A&hl=en\"> mufon case (21080) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Latitude":"41.173545","Country":"United States","City":"New Shoreham","Object Shape":"Sphere, Triangle"}