{"Viewing Distance":"Unknown","Summary":"2 elliptical lights, one white and one golden/orange, white above the other, low to ground","Sighting Duration":"Undisclosed","Case Number":"21088","Weather Factors":"Unknown","trends":["There have been no other sightings in Narvon","This sighting has never been favorited."],"Object Shape":"Oval","Object Flight Path":"Undisclosed","Latitude":"40.102876","Date of the Event":"12/17/2009 06:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.102876,+-75.977722(21088)&iwloc=A&hl=en\"> mufon case (21088) map </A>","Country":"United States","Disposition":"Unknown","Source":"MUFON","Tags":"City","City":"Narvon","Object Features":"Undisclosed","Date Submitted":"12/22/2009 01:44 UTC","Region":"Pennsylvania","divs":["Sighting DetailsAs I was driving home from Morgantown, I was turning right onto 625 at 6:51pm and I saw 2 elliptical lights significantly larger than stars and really low to the ground. They got my attention because they were low and really big and did not resemble a star in any way. Their shapes were not like stars and the second object's color was not that of a star either. They were really bright and a bit distracting. They seemed to be stationary and located just beyond the church across the street's steeple. (I do not know the name of the church) I turned left and continued to look at these objects and they seemed not to move, for 3 minutes I continued looking and when I turned to look back, they had disappeared. The objects were, like I said, elliptical (oval) and they were 2 different colors. The oval on top was a bright white and the second was a golden orange color underneath. I would consider myself a skeptic, so I decided not to do anything about it until I went back around the same time at a later date. I called my boyfriend just after I looked and saw the 2 objects had disappeared and he told me to report it right away, but like I said, I'm skeptical so I wrote down the details on my phone in case what I saw was not there when I returned. The next evening I returned at 6:50pm and saw nothing, so I went back on Sunday evening and again-nothing. I thought maybe it was a satellite but there were 2 objects of different colors, a significant distance between them, and were fairly low to the ground. Not as low as a house, but a lot lower than an airplane. I tried to take a picture at the stop sign, but the camera on my phone isn't the greatest and didn't capture the lights."],"files":["/var/www/straped/mufon/html2text/21088.html.txt","/var/www/straped/mufon/org/21088.html"],"Longitude":"-75.977722","Log Number":"US-12222009-0004"}