{"Disposition":"Unknown","Date Submitted":"12/22/2009 10:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.710145,+-121.278611(21090)&iwloc=A&hl=en\"> mufon case (21090) map </A>","Date of the Event":"10/27/2009 08:20 UTC","trends":["There have been 9 other sightings in Citrus Heights","There were no other sightings in Citrus Heights on or around October 27th 2009","This sighting has never been favorited.",""],"Object Features":"Unknown","Object Shape":"Triangle, Unknown","Viewing Distance":"101-500 Feet","Case Number":"21090","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Region":"California","Longitude":"-121.278611","Country":"United States","Object Flight Path":"Straight-line path","Log Number":"US-12222009-0006","Summary":"Bright white light with red center as it came closer.","Sighting Duration":"Undisclosed","City":"Citrus Heights","Latitude":"38.710145","files":["/var/www/straped/mufon/html2text/21090.html.txt","/var/www/straped/mufon/more/21090_submitter_file1__ENTIREFOLDER017.JPG","/var/www/straped/mufon/more/21090_submitter_file2__ENTIREFOLDER016.JPG","/var/www/straped/mufon/more/21090_submitter_file3__ENTIREFOLDER015.JPG","/var/www/straped/mufon/org/21090.html"],"divs":["Sighting DetailsMy wife and I were watching television and she looked out the patio sliding glass door to the north and saw a large light. She asked me what it was and without looking I said \"it's a ufo\". My wife became very excited and said \"no you need to look at this\" so I did. We both went out on the patio and looked up at about a 20 degree angle and enountered a bright white light with a red hue in the middle. I told the wife to get the camera and after going through a couple of different rooms she came outside with our sony digital camera. By then the lights were very close and very low and not one light but ten lights. There were six white on top in a horizontal row with four red below and six white on the third row all horizontal and evenly spaced. We could hear a faint mechanical sound as it passed over our heads about 75 to 100 yards above us at a slow rate of speed. I took three pictures as the lights passed but each one showed only two faintly white lights apart from each other in all three photos. I am not very good with a computer or digital cameras so since we had little to no proof we did not tell anyone other than our immediate family and friends. I showed the pictures to the family and they laughed but still believed we saw someting. The other day I was showing the pictures to one of my sons friends and he asked me to brighten the picture and when I did several more lights came into the picture. The immage still is not what we actually witnessed so I have no answer for what is there. The object passed over us from north to south very slowly and very low and the lights were very large with a span of over 300 feet. We could not see the outline of anything else but we could hear a faint mechanical sound. Please zoom in and brighten these pictures and let me know what you think. Thanks"]}