{"Tags":"City","Latitude":"44.771907","Case Number":"21091","Disposition":"IFO","Region":"Michigan","Date of the Event":"11/27/2009 05:40 UTC","Summary":"Noticed Lights and shape in 3 of my photos when uploading them the next day.","Object Features":"Other","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21091.html.txt","/var/www/straped/mufon/more/21091_submitter_file1__DSC_2034.JPG","/var/www/straped/mufon/more/21091_submitter_file2__DSC_2035.JPG","/var/www/straped/mufon/more/21091_submitter_file3__DSC_2061-1.JPG","/var/www/straped/mufon/org/21091.html"],"Longitude":"-85.615972","divs":["sighting detailsi went to town to see the lighting of the christmas tree on november 27th, 2009. i got a new 2.8 lens and wanted to take some photos in a low light setting. i shot about 100 photos that evening from about 5:00 p.m. to around 8:00 p.m. the next day when i was uploading them to my computer i noticed some lights in the sky of one of them. when i zoomed in i saw a shape with the lights that intrested me, and that i didn't know what it was. i begain to look through my other photos and i found simular lights and shapes in 2 other photos. all 3 photos with the lights and shapes in question in the sky were while i was standing on front street facing west. i had taken 4 photos that evening from that same area, facing west, and those same lights are in 3 of them. (i did not find these lights, or anything like them in any of my other photos i took any place else that night.) of the 4 i took facing west, the photo they were not in was the first one i took, about 5:00 p.m. the first two where they were was taken about 5:40 p.m. by the clock in one of the photos. the third one that the lights were in was taken about 6:00- 6:15 p.m. i really know nothing more about these. i took them to tv 7\\4 to see if anyone there was intrested and mark shelette contacted me a few days later and told me to file a report with you."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.771907,+-85.615972(21091)&iwloc=A&hl=en\"> mufon case (21091) map </A>","Object Flight Path":"Stationary","City":"Traverse City","Date Submitted":"12/23/2009 12:35 UTC","Object Shape":"Other","Sighting Duration":"00:30:00","Weather Factors":"Unknown","trends":["There have been 13 other sightings in Traverse City","There were no other sightings in Traverse City on or around November 27th 2009","This sighting has never been favorited.",""],"Log Number":"US-12232009-0001","Viewing Distance":"Unknown"}