{"Country":"United States","Longitude":"-121.997261","Weather Factors":"Unknown","Tags":"City","Latitude":"37.831393","Date of the Event":"12/22/2009 10:30 UTC","divs":["sighting detailsi was walking my dogs late on 12\\22\\09 south on camino tassahara to a middle school. we had just started back toward home (north) and i noticed a very bright orange sphere, appx. 10 feet dia., above me to my left. it was flying slowly at about 200 feet. the speed was no more than 50 mph but stayed at that rate of speed throughout. there were no other colors (no red and green to indicate wings). it was traveling west. i took off with the dogs down a side street to follow it and watched it in decent until a house blocked further view. it was no more than 1\\4 mile from me and made no sound at all. after it was out of view, i stayed a few minutes longer to see if it changed its direction and would come back into view. it didn't. i started back toward camino tassahara to resume my walk. shortly after turning around, i heard a car come up behind me at a fast pace, then pull over and stop about 100 feet back. i continued about 300 yards more before turning left on camino tassahara. the car with headlights on was still sitting there when i turned. i left on my walk at 9pm, and arrived home at 11pm. i lost an hour as this particular 3.5 mile walk, which i regularly do, generally takes us a little less than an hour. i have since checked google earth and there is nothing in the area of decent, just a very large undeveloped area. the following night, a helicopter was circling the area. the object in no way resembled a helicopter."],"Date Submitted":"12/23/2009 05:59 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12232009-0008","Summary":"Orange sphere traveling slowly, west low over houses; time lost","Sighting Duration":"Undisclosed","Case Number":"21098","Object Shape":"Sphere","City":"Danville","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/21098.html.txt","/var/www/straped/mufon/org/21098.html"],"Region":"California","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.831393,+-121.997261(21098)&iwloc=A&hl=en\"> mufon case (21098) map </A>","trends":["There have been 3 other sightings in Danville","There were no other sightings in Danville on or around December 22nd 2009"],"Disposition":"Unknown","Object Flight Path":"Straight-line path"}