{"files":["/var/www/straped/mufon/html2text/21092.html.txt","/var/www/straped/mufon/org/21092.html"],"City":"Valparaiso","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.477975,+-87.053031(21092)&iwloc=A&hl=en\"> mufon case (21092) map </A>","Longitude":"-87.053031","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Triangle","divs":["Sighting DetailsI was on my way back to Valparaiso, from work, at approximately 7:00 p.m. The road I was on, Meridian, is not well lit, and I could see planes and stars in the sky. I noticed a very large object from afar, that looked like lights on a big plane. However, as I continued my drive south, then turned east onto 700, I noticed that it was fairly close to rooftops,(perhaps 40-60 feet above) and was not moving! I slowed down as much as I could with traffic coming behind me, so I could look at this object. I thought certainly it was an airplane or a helicopter. However, it was not moving, had lights like a plane, that were white and red, but not blinking as airplane lights would be, and when I rolled down my car window, there was no sound. Also, it appeared to be triangular in shape, and perhaps 30-40 feet across. It is hard to judge size due to it being dark outside, and I was in a moving car. I had seen airplanes farther away, which I could tell were planes, because they were moving. As this area is in the flight pattern to the east of Chicago, I thought this had to be an airplane. I couldn't possibly be seeing a UFO. I didn't tell anyone of this sighting, as I was certain it had to be an airplane. But I still could not reconcile in my mind, why it was not moving! I wish I had stopped and gotten out of my car, but I told myself it had to be an airplane. What made me post this story, was seeing the pictures on MUFON, that were submitted on 12-22, by someone in CA, from a sighting in October. When I opened up the first picture tonight, I said to myself, that is what I saw!!!! I have never seen anything like this before. I was not scared at all, just perplexed. The object did not move, but I lost sight of it because I kept driving away from it."],"Region":"Indiana","Latitude":"41.477975","trends":["There have been 9 other sightings in Valparaiso","There were no other sightings in Valparaiso on or around December 15th 2009"],"Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"12/23/2009 12:37 UTC","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Date of the Event":"12/15/2009 06:30 UTC","Disposition":"Unknown","Summary":"Thought it was an airplane, but it wasn't moving. Was motionless in the sky.","Log Number":"US-12232009-0002","Case Number":"21092","Country":"United States"}