{"Weather Factors":"None","Date of the Event":"12/24/2009 11:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.501825,+-81.694219(21104)&iwloc=A&hl=en\"> mufon case (21104) map </A>","Object Shape":"Star-like","Disposition":"Unknown","Object Features":"None","Summary":"appeared to be a self illuminating light moving rapidly and leaving a light tail","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21104.html.txt","/var/www/straped/mufon/org/21104.html"],"Country":"United States","Viewing Distance":"Over One Mile","Region":"Ohio","Longitude":"-81.694219","Log Number":"US-12242009-0001","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around December 24th 2009"],"divs":["Sighting DetailsAt approximately 0015 hours I witnessed an orange light travelling below 30,000 feet moving at what I believe to be a higher rate of speed than mach 1. I did not hear a sonic boom. I did see a light trail following behind the object. The light of the object was orange (as was the light trail). The light source appeared to be self contained, (like a light from a man made aircraft) unlike a chemical reaction to heat or incendiary light source, as is common with a \"shooting star.\" The light trail was very faint and was large, but difficult to estimate the length of...but I would say that it was about three fingers wide at arms length...again below 30,000 feet and probably below 20,000 feet judging on it's brightness. The object was moving from the SW to the NE. The angle of this movement across a map from the directions listed was approximately; moving towards the East at about 35 to 40 degrees; moving from the West from about 215 to 220 degrees. I lost view of the craft, or \"light\" after about 8 seconds, as it passed below the tree line of my view."],"Sighting Duration":"Undisclosed","Tags":"City","Latitude":"41.501825","Case Number":"21104","City":"Cleveland","Date Submitted":"12/24/2009 01:40 UTC","Object Flight Path":"Straight-line path"}