{"Region":"Maryland","Object Shape":"Circle, Fireball, Oval, Sphere, Star-like","trends":["There has been one other sighting in Lutherville-Timonium","There were no other sightings in Lutherville-Timonium on or around December 24th 2009"],"Summary":"It was a bright white light in the sky that looked to be pulsating and spinning.","Latitude":"39.443689","Object Flight Path":"Stationary","Object Features":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Case Number":"21105","Date of the Event":"12/24/2009 09:43 UTC","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21105.html.txt","/var/www/straped/mufon/org/21105.html"],"Weather Factors":"Unknown","Log Number":"US-12242009-0002","Country":"United States","divs":["Sighting Details1. Where were you and what were you doing at the time? I was driving to work in the morning going down I-83 towards Baltimore at approximately the Timonium exit. Off to my left sorta low in the sky was the object. 2. What made you first notice the object? It was bright and I was adjusting my visor because of the sun and noticed the object. IT WAS NOT THE SUN. This was much smaller. A small bright dot in the sky. 3. What did you think the object was when you first noticed it? When I saw this object I thought right away it might be a UFO becuase it was different from anything else I have ever seen. 4.) Describe the object and its actions and motions. It was a bright white light in the sky that looked to be pulsating and spinning. It seemed to be maintining its position in the sky. 5.) Describe your feelings, reactions and actions, during and after sighting the object. I was very interested in the object because it was so different. It looked like it was on fire and spinning. The light was very bright. 6. How did you lose sight of the object? The road sloped down hill and I was unable to see the object."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.443689,+-76.603888(21105)&iwloc=A&hl=en\"> mufon case (21105) map </A>","City":"Lutherville-Timonium","Tags":"City","Longitude":"-76.603888","Date Submitted":"12/24/2009 10:53 UTC"}