{"Longitude":"-84.551892","Weather Factors":"None, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.480056,+-84.551892(21107)&iwloc=A&hl=en\"> mufon case (21107) map </A>","Date of the Event":"12/14/2009 07:30 UTC","Sighting Duration":"Undisclosed","City":"Seven Mile","Viewing Distance":"Over One Mile","Log Number":"US-12242009-0004","Source":"MUFON","Object Features":"Unknown","divs":["Sighting DetailsI was in my Kitchen looking South out the window, when I saw these really bright, flashing lights hovering in the sky. There were about 3 or 4 individual objects, each hovering and rotating around a central object, which was the brightest of them all. The lights on the object flashed orange, blue, green, and red on each object, and the back of the objects were two, very bright circular lights. Each object would travel away from the central object left or right, then return to the central object and rotate, and repeat the action for about 30 minutes. I called my dad over to look at it, and he said he had no idea what it could be. My dad is a big aircraft lover, so his confusion as to what it could be shocked me. Other planes passed it like it wasn't even there. I was shocked and confused when I saw the objects and i was also somewhat frightened. This was the 5th time I've seen the objects. The objects all left to the east after about 30 minutes. The objects only appear on very clear, cool nights between about 7 and 8 PM."],"Object Shape":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21107.html.txt","/var/www/straped/mufon/more/21107_submitter_file1__150117.jpg","/var/www/straped/mufon/org/21107.html"],"Case Number":"21107","Region":"Ohio","Summary":"about 4 extremely bright unknown objects hovering in the sky","Latitude":"39.480056","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Country":"United States","trends":["There have been no other sightings in Seven Mile","This sighting has never been favorited."],"Tags":"City","Date Submitted":"12/24/2009 03:02 UTC"}