{"City":"Norman","Date of the Event":"11/30/1982 12:00 UTC","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.228437,+-97.435758(2110)&iwloc=A&hl=en\"> mufon case (2110) map </A>","divs":["Sighting Details1. I had just picked up a girl for a date at her house on Berry Road. We headedsouth on Berry Road several blocks until we came to the t-intersection withImhoff Road.2. I turned left east onto Imhoff. In the process of turning I caught a glimpseof a flaming object in the sky traveling level from east to west.3. I first thought that it was an airplane on fire.4. I pulled the car over to the side of the road and got out and moved to theleft front of my vehicle always facing south toward the object. For some reasonI expected my date to get out of the car too but she didnt and yet I dontremember any visual of her sitting in the car with this periphreal glance. I wasaware of no other traffic or people either at this suburban intersection.The object, rumbling through the air breathing fire-appeared to be a hugevolcanic-like rock flying level...only the action of the flaming object didntseem to obey the laws of physics as to motion and fire breathingaction-waextravagant extravagent camouflage or what. The object is moving to myright and yet the fire coming out of a hole in the rock shoots straight towardme even thoughitselfobject tself was moving at a steady speed perpendicular tome. This is the strangest thing and it didnt seem to make sense at the time andI couldnt take my eyes off from it. How could this huge flaming rock in the skybehave like thisEven more strange was my reaction to get back into the car and drive off andcontinue the date we went to a movie or something timely without reporting orever even discussing what we saw to each other or anybody else....as if it neverhappened-definitely not like me now or any other time in my life under normalsituations, let alone the moment of a life-time. I drove off in the oppositedirection never pursuing or following up on the incident-other than noting anarticle in a local newspaper later on a similar siting near the east coast ofthe US...Pennsylvania, Vermont or New Hampshire maybe.5. The object continued below the cloud ceiling as if flying undercontrol....the low rumbling sound emitted was not a jet whine or pistondriven-it did give the impression of the sound of a large object in motion butdidnt leave a wake or a jet wash....I watched it as it headed toward the westernhorizon-it"],"Object Features":"Other","Tags":"City","Case Number":"2110","Log Number":"","trends":["There have been 22 other sightings in Norman","There were no other sightings in Norman on or around November 30th 1982"],"files":["/var/www/straped/mufon/html2text/2110.html.txt","/var/www/straped/mufon/org/2110.html"],"Object Flight Path":"Straight-line path","Summary":"Encounter with a Flaming Flying RockBoulder","Object Shape":"Other","Disposition":"Insufficient Data","Weather Factors":"Unknown","Latitude":"35.228437","Sighting Duration":"00:05:00","Viewing Distance":"101-500 Feet","Longitude":"-97.435758","Date Submitted":"11/30/1982 12:00 UTC","Source":"MUFON","Country":"United States"}