{"City":"Crestview","Longitude":"-86.568098","Weather Factors":"Does Not Apply","Date Submitted":"12/23/2009 07:36 UTC","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=30.768373,+-86.568098(21101)&iwloc=A&hl=en\"> mufon case (21101) map </A>","Region":"Florida","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21101.html.txt","/var/www/straped/mufon/org/21101.html"],"divs":["Sighting DetailsI was traveling west on highway 90, at forty miles an hour, inside the city limits of Crestview. I had just passed the city park when something to the north at an angle of 30 degrees above me, and at four or five hundred feet, caught my eye. The sky was clear, the temperature was about 60 degrees. The object was black, appeared to be round, and I had the impression that it was very heavy. I thought at first that I was seeing two aircraft in close flight, then I realized this was not the case. I would guess the size of the thing was at least 25 to 30 feet across. There were many protrusions around the base. I know this sounds nuts, but my next thought was of some kind of device out of science fiction, with all those protrubances and convolutions around its side. Sticking straight up from its top surface, at least 30 feet, was a forest of shapes, one at the outer edge looked like half of an aircraft wing with a small fuel pod on the end. Its flight path was northwest and straight and level. After a few seconds it passed beyond some trees and I attempted to turn on a side street and follow, but it quickly went out of sight. It was not moving fast. Perhaps at the speed of a light plane. There was absolutly no sound. There were no reports, as far as I know, of anyone else seeing the thing. I was calmly excited. I didn't have any strange sensations and don't have a desire to put tin foil on my head. I believe myself to be of average levelheadness and not prone to seeing the Virgin Mary in the cornbread. As so many others have stated:'I know what I saw!'"],"Disposition":"Unknown","Date of the Event":"12/22/2009 03:30 UTC","Case Number":"21101","Object Shape":"Circle, Disc","Tags":"City","Summary":"Very black, thick round object with vertical devices with one in particular higher than the others.","trends":["There have been 6 other sightings in Crestview","There were no other sightings in Crestview on or around December 22nd 2009"],"Object Flight Path":"Straight-line path","Log Number":"US-12232009-0011","Object Features":"Patterned Surface, Appendage(s)","Country":"United States","Latitude":"30.768373","Sighting Duration":"00:00:05"}