{"files":["/var/www/straped/mufon/html2text/21113.html.txt","/var/www/straped/mufon/org/21113.html"],"trends":["There has been one other sighting in Happy Valley","There were no other sightings in Happy Valley on or around January 20th 1967"],"divs":["sighting detailsi was outside, going from one barracks to another, at goose air base, newfoundland\\labrador\\canada. it was completely dark. the temperature outside was 20 degrees below zero. out of the corner of my eye, something in the sky caught my eye. there was this object going from nw to se, very high and very large, and the best way i can describe it is like looking at a basketball, tumbling and wobbling through the air, with a dozen holes in it, and smoke coming out of every hole. behind it, stretching about half-way to the horizon, was a luminous trail, which disappeared slowly as the object traveled across the sky. there was absolutely no sound. i stood there watching this object for as long as could stand it in that intense cold, about twenty minutes, before going inside. i saw only one other person outside during this observation, and i said, \"do you see that?\" he answered, \"yes, i do, but i don't want to.\" there was no report of this object the next day, and no one has ever offered me an explanation as to what it was. the sky was clear, and stars could be seen. when i went inside, the object was still in the sky and still moving across it. there were no lights on the object."],"Source":"MUFON","Weather Factors":"None","Case Number":"21113","City":"Happy Valley","Object Flight Path":"Straight-line path","Object Features":"None","Log Number":"CA-12242009-0010","Date Submitted":"12/24/2009 11:04 UTC","Region":"Newfoundland and Lab","Longitude":"-56.324261","Latitude":"48.615046","Country":"Canada","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=48.615046,+-56.324261(21113)&iwloc=A&hl=en\"> mufon case (21113) map </A>","Tags":"City","Disposition":"Unresolved","Summary":"Observed an object going through the air, emitting smoke, and tumbling.","Object Shape":"Circle, Sphere","Date of the Event":"01/20/1967 07:00 UTC","Viewing Distance":"Over One Mile"}