{"Case Number":"21114","Object Flight Path":"Straight-line path","Object Shape":"Teardrop","Source":"MUFON","Latitude":"39.518348","map":"<A HREF = \"http://maps.google.com/maps?q=39.518348,+-84.396636(21114)&iwloc=A&hl=en\"> mufon case (21114) map </A>","Date Submitted":"12/24/2009 11:27 UTC","trends":["There have been 13 other sightings in Middletown","There were no other sightings in Middletown on or around October 27th 2009"],"Weather Factors":"None","Longitude":"-84.396636","Log Number":"US-12242009-0011","Region":"Ohio","Object Features":"None","Sighting Duration":"Undisclosed","City":"Middletown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/27/2009 03:00 UTC","Summary":"Strange pyschic event. Afterward looked outside saw wobbly Teardrop UFO up 200 ft. in sky slowly heading straight for me.","files":["/var/www/straped/mufon/html2text/21114.html.txt","/var/www/straped/mufon/org/21114.html"],"divs":["Sighting DetailsAfter extremely deep meditation I went into my bathroom to look at my eyes in the mirror. Looking out the bathroom window I saw a Teardrop UFO with red and white strobe lights. This UFO was about 200 ft in the sky moving slowly towards my position along N. Verity Pkwy. The UFO appeared to be wobbly. I felt a psychic connection and at first felt confronted. I mentally challenged the UFO that if it came to cause me harm than may it crash. When it didn't crash I felt at peace. I reasoned that the slowness and wobbly motion of the UFO was meant to be non-threatening. I watched for a couple minutes then went back to bed. The night before during meditation I convinced myself that I disrupted the strange electronic hum that was interfering in my extremely deep meditation. This hum was strangly hypnotic with its cyclic nature. I concentrated on this hum and \"introduced\" random energy into the cycle making it unstable. Afterward I noticed all the lights on the towers around had an erratic nature to their strobing cycle. Perhaps the power disruption attracted this UFO to my position the following night."],"Country":"United States","Disposition":"Unknown"}