{"Date of the Event":"01/31/2003 03:05 UTC","divs":["Sighting DetailsBeing on the third floor balcony of my house at about 1505pm, I was taking testphotographs with my new polarizing filter since the lighting conditions werevery pleasant. Aiming at the Eastern horizon of a small mountain Imitos that isa few miles from my house, I noticed a bright silvery object gliding through theeyepiece frame. At first, I assumed it was an airplane, though midway throughthe eyepiece frame it started making loops and circles. Intrigued by this, I putthe camera down and looked to see what it was. To my surprise I could seenothing with my bare eyes. Picking back up the camera and adjusting the linearpolarizer to the point where the sky seemed darkest I was again able to clearlysee it. This was not due to the zoom of my lens since it has a maximum of 70mmzoom, very close to the human eye equivalent of 50mm and seemed to be solely dueto the polarizing filter, since by turning the polarization plane away from thedarkest sky point the object disappeared. I repeatedly tried to see the objectwith my bare eyes by marking its position while seeing it through the polarizerthough was unable to do so with the exception of one instance where I think Isaw a faint gleam where the object should have been. This was very surprising tome since it was very vivid through the camera.Quite intrigued, I took pictures while it swirled in the sky. At that point Iwas rationalizing that it maybe was a large remote control model plane orcopter, though some things still didnt fitit seemed to be flying higher than I would expect it to and it was veryreflective, no hint of color paint, to mention my first observations.Unfortunately, because I could only see it through my camera I was unable toassess its distance and, thus, size. Beside these facts, such items remote modelplanes are very scarce and luxurious in this part of the world.After about 5 minutes of observation I was surprised seeing four more of theseobjects couldnt discern any differences between the five entering the view paneof my camera when they started an elegant skydanceeach one orbiting each other weaving in and out of an imaginary sphere. Somewould occasionally stroll off upwards or towards the South and come back again.After about 3 minutes of this they dispersed to the South and what seemed frommy viewpoint as up and were too far for me to observe, something made harder bythe fact that they were going closer to the sun so the polarizer had no effectat that angle.At some point during this encounter,"],"Disposition":"Unknown","Viewing Distance":"Unknown","Case Number":"2112","Country":"United States","Latitude":"36.183018","Date Submitted":"01/31/2003 03:05 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.183018,+-96.319947(2112)&iwloc=A&hl=en\"> mufon case (2112) map </A>","Region":"Oklahoma","Sighting Duration":"00:10:00","Weather Factors":"Unknown","Object Flight Path":"Unknown","Object Shape":"Cylinder","Summary":"5 Silvery Objects Seen Through Polarizing Filter","Longitude":"-96.319947","City":"Cleveland","Log Number":"","files":["/var/www/straped/mufon/html2text/2112.html.txt","/var/www/straped/mufon/org/2112.html"],"Source":"MUFON","trends":["There have been no other sightings in Cleveland","This sighting has never been favorited."],"Tags":"City"}