{"Object Shape":"Sphere, Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=36.782531,+-119.408612(21120)&iwloc=A&hl=en\"> mufon case (21120) map </A>","Latitude":"36.782531","Region":"California","Disposition":"Insufficient Data","City":"Seaside (Ireland)","Longitude":"-119.408612","Object Flight Path":"Stationary,Hovering then path,Path with directional change","divs":["Sighting Detailsmy name is mike williams i am an american living in ireland and as i was driving to a gig in a village called redcastle ( im a professional musician) i noticed these lights, at first i thought they were road lights but as i approached they were in a triangle shape formation i noticed they were too high off the ground to be road lights. i stop the car get out and looked up at them there was no sound nothing no animals nothin, i get my phone out and call my buddy frank up as i couldnt believe what i was seeing, as im telling frank whats going on 2 of em decide to slowly bank to the right up and out over the river foyle very slowly the cloud cover was kinda low and they just went up over the river and then up thru the clouds and got dimmer as they did so, now they didnt move until i got my phone out talking to frank the 3rd one just sat there as im explaining to frank it decide to do the same thing but in the opposite direction to the left, they had this round cut off teardrop shape and had the color of flame no sound came from these things nothin. all of em ascended up and over the river going to the opposite side but up thru the clouds and out of sight. i got the distinct impression that as i was watching them they was watching me! if they had been on the ground they would be fairly big things, i havent seen these things since but have noticed strange colored twinkling lights that look like stars but are too low in the night sky to be stars . i have a radio show and mentioned it over the air but nobody called in to say they seen anything on that night, thats what happened and i seen these things im am not tripping it happened. thanks for your time mike williams ps. im will use my address in california as it wont accept the info for state field and i am tired of rewriting this thing ;-) my address where this took place is: 3 pound st business park carndonagh Co. Donegal Ireland the time 9:10pm gmt ireland (dublin) 30th of august 2009 this is where i live my phone is: 353-86-052-4633"],"Case Number":"21120","Country":"United States","Date Submitted":"12/25/2009 12:57 UTC","Log Number":"US-12252009-0006","Tags":"City","Summary":"3 flame colored teardropped shaped objects over the foyle river in inishowen donegal ireland","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Date of the Event":"08/30/2009 09:10 UTC","trends":["There have been no other sightings in Seaside (Ireland)","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/21120.html.txt","/var/www/straped/mufon/org/21120.html"],"Source":"MUFON","Weather Factors":"None"}