{"Disposition":"IFO","Longitude":"-117.201406","Object Shape":"Oval","Source":"MUFON","trends":["There have been 10 other sightings in Redlands","There were no other sightings in Redlands on or around July 15th 2008"],"Region":"California","files":["/var/www/straped/mufon/html2text/21125.html.txt","/var/www/straped/mufon/org/21125.html"],"Log Number":"US-12252009-0010","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.068798,+-117.201406(21125)&iwloc=A&hl=en\"> mufon case (21125) map </A>","divs":["Sighting DetailsThe following is TRUE. I love helicopters and one day July of 2008 about 2:00 pm. I heard a helicopter coming so I ran to my window to watch it fly by. After it flew by I saw a very bright light high in the sky just hovering there. I watched it moving very very slowly towards me for about 45 minutes, as it moved just above my window I saw two round disk one right behind the other. Two days later looking out my window hoping to see it again I saw hovering only about 14 feet off the ground and only about 50 feet away from me something that looked like a prob. This was absolutly amazing, I was like oh my God what is that? This also was in the middle of the day. It was round the color of aluminum foil and it had only one wing on the top of it, it was about 4 feet round. It was just hovering there looking at me for about 15 seconds and then it just took off to the right until I couldn't see it any more under its own power. There was no propeller. I could not believe what I was seeing. Then again two days later, I was sleeping. I never sleep on my back, but woke up in the middle of the night on my back with my right arm and left leg completly num. I had absolutly no feeling in them at all. It took me 5 minutes to get my moter functions back and to my surprise my left ear drum was in alot of pain. After a few day the pain in my ear goes away and I start having severe headaches. The headaches lasted for 4 days and then just went away. Keep in mind I never ever get bad headaches. Remember when I woke up on my back and my ear drum was hurting? well the pain in my ear drum came back and I started hearing a tinging sound in my left ear that would last from a minute to a minute and a half. They would come and go all though out the day. This lasted for about 8 months. Today I still hear the tinging sound but its not as often. To this day I feel that I have a alian inplant in my left ear."],"Latitude":"34.068798","Summary":"I saw a round object hovering at about 4000 feet moving very slowly towards me.","Sighting Duration":"00:45:00","Date of the Event":"07/15/2008 02:45 UTC","Viewing Distance":"20 Feet or Less","Object Flight Path":"Hovering then path","Country":"United States","Weather Factors":"Unknown","City":"Redlands","Date Submitted":"12/25/2009 03:17 UTC","Object Features":"Other","Case Number":"21125"}