{"Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Hoax","Date of the Event":"10/31/1993 08:32 UTC","City":"Capitola","Object Shape":"Fireball, Sphere, Star-like","Case Number":"21123","Region":"California","Log Number":"US-12252009-0009","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"12/25/2009 02:36 UTC","divs":["Sighting DetailsIt was Halloween and me and four friends we on the roof looking at the stars and throwing down candy to the kinds that came by. We were on 38th street and east cliff Dr. We were right on the Monterey Bay and could see the ocean from the roof. I looked into the sky and what looked like the space shuttle re interring the atmosphere was anything but that. It came in at an odd angle and as it became clearer to the naked eye, small clumps of fire or debris starting coming off the edges. In direction it made a arch on entry and came even closer to us. On this night in Santa Cruz CA it was a perfectly clear and still night. The only thing you could see in the sky was one lone cloud hovering over the middle of the Monterey Bay. It was a small cloud and as this UFO came closer to us and you were able to see the refined edges, it entered this cloud. When it entered the cloud the red and yellow fire color you could see no longer. We all stood in amazement asking ourselves what this could possibly be. About one minute passed and as we looked on this object moved out of the cloud, resembling a star like presence, round, soft, circular, but moving to the west over the ocean. A steady pace, if I were to guess at about 200 or 300 miles per hour. It was almost as if it used the cloud to cool off if that makes any sense. It kept moving to the west until we could not see it any more. I would have said it was a plane, or some other kind of military craft, but there were no blinking safety lights, and so sound."],"files":["/var/www/straped/mufon/html2text/21123.html.txt","/var/www/straped/mufon/org/21123.html"],"Country":"United States","Object Features":"Undisclosed","Longitude":"-121.948783","map":"<A HREF = \"http://maps.google.com/maps?q=36.978708,+-121.948783(21123)&iwloc=A&hl=en\"> mufon case (21123) map </A>","Summary":"Fireball upon entry, soft star like glow after exiting cloud","trends":["There have been 2 other sightings in Capitola","There were no other sightings in Capitola on or around October 31st 1993"],"Tags":"City","Latitude":"36.978708","Weather Factors":"Unknown"}