{"Latitude":"48.519854","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"21128","Log Number":"US-12252009-0013","trends":["There have been 6 other sightings in Anacortes","There was one other sighting in Anacortes on or around December 24th 2009"],"Region":"Washington","Object Shape":"Bullet, Missile, Flash, Star-like, Other","Source":"MUFON","Date Submitted":"12/25/2009 03:39 UTC","Country":"United States","Weather Factors":"Unknown","Tags":"City","Summary":"Flare like, flashed in and out of woods, comet looking at trajectory","City":"Anacortes","Disposition":"Insufficient Data","divs":["Sighting DetailsI was sitting at a local lake in Anacortes,Washington called Heart Lake. I was sitting in the driver seat of my car with two of my friends talking about new holidays and enjoying ourselves when me and my passenger and close mate noticed a flare like light with a very red,orange, and yellow array fading in and out, about no more then twenty feet in front of us, just across this small gap within the lake and no higher then right above eyes height if not even. The feeling was almost as if you couldn't move, all of us in the car noticed this and were very open with each other the whole time as we noticed the object just moving throughout the trees in complete darkness slowly getting really bright then dimming but staying in the same area almost coming forward and backward. The feeling of fear was something my friends and I had never felt before, and all of us being skeptics but open minded, this was an new experience. I open the door to my car that was the most it felt I could do, my two buddies were just fixated on the thing, I got my leg and head out and can not explain the gravitational feeling just abnormally strong and different from anything I have ever felt. The craft was smaller as I got a better look, Then as if the feeling got like I and the object were too close and the thing noticed and shot straight up into the sky and disappeared. The object appeared as a comet and actually nocked me enough to get me to sit down, back in the car. If you have read this the strangest part is my friends can barely recall what happen, no drugs or alcohol were involved, both of my friends had filmed the craft but all are cellphones were erased literally all the pictures and vid on my phone were gone.If you read this and have are interested in this subject I have been very interested in learning more about what happen and how I can recall this and my buddies cant. You may email me if you are interested about this story or if you have anymore questions about this event. Thank you, Garrett Bollaert"],"Object Features":"Undisclosed","Date of the Event":"12/24/2009 12:00 UTC","Longitude":"-122.610912","map":"<A HREF = \"http://maps.google.com/maps?q=48.519854,+-122.610912(21128)&iwloc=A&hl=en\"> mufon case (21128) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/21128.html.txt","/var/www/straped/mufon/org/21128.html"]}