{"trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around January 31st 2003"],"Summary":"Balls of light over downtown Albany, NY","Case Number":"2113","Disposition":"Insufficient Data","Country":"United States","Latitude":"42.652579","Object Shape":"Sphere","Tags":"City","City":"Albany","map":"<A HREF = \"http://maps.google.com/maps?q=42.652579,+-73.756232(2113)&iwloc=A&hl=en\"> mufon case (2113) map </A>","files":["/var/www/straped/mufon/html2text/2113.html.txt","/var/www/straped/mufon/org/2113.html"],"Longitude":"-73.756232","Object Features":"Undisclosed","Date Submitted":"01/31/2003 07:00 UTC","Date of the Event":"01/31/2003 07:00 UTC","Log Number":"","Source":"MUFON","Weather Factors":"Rain, Snow","divs":["Sighting DetailsI did not witness this event, but the witnesses I spoke to are highly credible,yet would not bother to report this. This happened over a densley populated areaso I am sure others saw it. Over downtown Albany, NY balls of light werereported moving at angles twoard the sky. The balls varied in color from whitishto yellow and orangish hues. They moved upwars like bottle rockets quickly butwithout sound and some appeared to be very close within 50 feet while othersappeared to be on the distant horizen. They all appeared looking south out of awindow in the direction of the capital building, downtown and over the hudsonriver. These balls appeared once ever 3-10 seconds and continued for a longtime. Witnesses used to live in area where nothern lights occured and says theyare entierly different, also ruled out fireworks becuase there was no sound,they varried in distance over miles, they did not act or explode like fireworksand came from different directions but all basically moved upwards. the upwardsdirection also rules out meteors-as well as the fact that they occured with morefrequency than historic meteor showers and appeared to be much much closer."],"Sighting Duration":"00:30:00","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Region":"New York"}