{"Object Shape":"Disc","Object Flight Path":"Undisclosed","Tags":"City","Case Number":"21131","Sighting Duration":"Undisclosed","Region":"Minnesota","trends":["There have been no other sightings in Newfolden","This sighting has never been favorited."],"Date of the Event":"07/20/1985 11:15 UTC","divs":["Sighting DetailsOn the way home from a softball game my father was playing in at a near by town my brother mother and I drove into our driveway where my father was standing outside looking and pointing in the air. When we got out of the car my father said look up there. When we did we say a disc flying around above our house. It had red blue and white lights and flying very slow. Too slow to be a plane to maintain flight. There was a humming sound coming from the object. I felt surprised and excited to see such a thing as would any kid would be. I was about ten or eleven years old at the time and it felt special. There was no fear in me or my brother. My parents however was a different story. As with most parents they were thinking about our saftey. The object flew away over the river and trees in our back yard. At that point we all jumped in the car to follow it. As we crossed the bridge and rose over a small hill to a 2 mile straight away we saw the object hovering over three large steel grain bins. It stayed there for about five minutes. During that time the humming noise could be heard as my brother and I rolled down our windows and started to wave and say hi to the object. My mother was not pleased and told us to roll up our windows. A few minutes later the object began to move toward us slowly and lowered it's altitudeand passed right over our car. It was about ten feet over our car as it passed. We turned aroud and the object took off at a high rate of speed and climbing. It was then that we say two more objects of the same nature off further in the sky. Until they dissapeared in the night. My mother contacted the local airforce base and asked if they were test flying of course they sad no. I will never forget it as long as I live. I don't believe there was any lost time during the incident."],"Disposition":"Unknown","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=48.355529,+-96.330037(21131)&iwloc=A&hl=en\"> mufon case (21131) map </A>","files":["/var/www/straped/mufon/html2text/21131.html.txt","/var/www/straped/mufon/org/21131.html"],"Weather Factors":"Unknown","Latitude":"48.355529","City":"Newfolden","Date Submitted":"12/25/2009 05:44 UTC","Summary":"3 disc shaped objects with red blue and white lights hovering and flying.","Viewing Distance":"Unknown","Log Number":"US-12252009-0017","Country":"United States","Longitude":"-96.330037"}