{"Viewing Distance":"101-500 Feet","Case Number":"21135","Country":"United States","Disposition":"Unknown","Date of the Event":"03/31/1997 01:50 UTC","divs":["Sighting DetailsIn the early morning hours following easter we were returning from a family event in western Ma. the evening was calm but there were low In the early morning hours following Easter we were returning from a family event in western Ma. the evening was calm but there were low clouds. As we turned on to our street we noticed lights, like the headlights of a small plane in the sky towards the end of our street where our home was located ( my x partner still lives there) as we drove further down the street we both commented that we thought it was very low, and did not look like it was moving. As we approached the corner where our house was located we could see the craft in the sky above our home. My partner refused to get out of the car, but I got out and looked up at the craft, it was hovering only about 150 to 200 feet above me, the metal was like a shiny silver, but smooth with no hard edges, it was making a loud swooshing sound like air being forced through a small hole, I looked around to see if any neighbors were observing but all was quiet. It then slowly began to tilt to one side I could see more of its shape and size, it was maybe only about 40 feet long and 15 to 20 feet wide, with a solid strip of lights at its rear, I also noticed what looked like a protrusion on its top more to the front but that also looked solid and smooth, it slowly moved upwards with no change in its sound, then like a streak of lighting disappeared. I called the Naval air station in Brunswick Maine the next day, and asked if any military craft was present in my area, they said no. I also thought it was a strange story to tell for it was just a few days before that a group of people committed mass suicide in CA. waiting to be taken away by a UFO during the Hal bop comet."],"files":["/var/www/straped/mufon/html2text/21135.html.txt","/var/www/straped/mufon/org/21135.html"],"Date Submitted":"12/25/2009 06:50 UTC","Tags":"City","Summary":"First saw the lihtgs of what we thought was a low flying plane, then noticed it was not moving.","Source":"MUFON","Object Shape":"Triangle","Object Features":"Dome","Sighting Duration":"Undisclosed","Log Number":"US-12252009-0021","Latitude":"43.670191","City":"Portland","Longitude":"-70.246186","Region":"Maine","trends":["There have been 17 other sightings in Portland","There were no other sightings in Portland on or around March 31st 1997"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=43.670191,+-70.246186(21135)&iwloc=A&hl=en\"> mufon case (21135) map </A>"}