{"Latitude":"32.133823","Longitude":"-111.216928","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.133823,+-111.216928(21139)&iwloc=A&hl=en\"> mufon case (21139) map </A>","City":"Tucson","Weather Factors":"None","Date Submitted":"12/25/2009 11:30 UTC","Object Features":"Dome","Region":"Arizona","Sighting Duration":"Undisclosed","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 2nd 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Log Number":"US-12252009-0025","Object Shape":"Disc","Object Flight Path":"Stationary","Country":"United States","Source":"MUFON","Summary":"Metalic disc sighted over alter valley sept 2009","divs":["Sighting DetailsI live in alter valley and ride a KLR 650 (a street legal dirt bike) so I ride alot on dirt roads and trails. I had been riding around and found a dead cow. I didnt see any obvious trauma or signs of disease. (I grew up on a cattle ranch in Wyoming) After inspecting the carcass and not being able to determine anything I continued on. I rode to the top of a hill ( #1) and took some photos, came back down to continue on. Within 2 minutes my bike died. I tried to start it and couldnt. I got of my bike to take a look and as I removed my helmet a silver glint in the sky caught my eye. I grabbed my camera and was only able to take one photo before it disappeared.It was completely stationary and I observed it for aprox 30 to 60 seconds. If I had to guess at an altitude I would say several thousand feet. It was South West of me and looked to be over Sasabe road south of three points. I heard no noise at all. I stood there for a minute just going over things in my head and then remembered that I was stranded. I tried to start my bike and it fired right up. the hill #1 lat=32.1404840446, lon=-111.290579283 position observed from lat=32.1348177236, lon=-111.2807"],"files":["/var/www/straped/mufon/html2text/21139.html.txt","/var/www/straped/mufon/more/21139_submitter_file1__SANY0611.JPG","/var/www/straped/mufon/org/21139.html"],"Date of the Event":"09/02/2009 11:48 UTC","Tags":"City","Case Number":"21139"}