{"Date Submitted":"12/26/2009 12:10 UTC","Disposition":"Unknown","trends":["There has been one other sighting in Whittemore","There were no other sightings in Whittemore on or around January 5th 1975"],"Source":"MUFON","divs":["Sighting DetailsMy friend and I observed what appeared to be a crop dusting plane flying in the distance at maybe 2 miles away. I said to my passenger why would that plane be flying in the dark like that? The blinking lights moved erradically from side to side at a high rate of speed. As we aproached it came within 100 yards of us traveling West on HWY 18 and stopped out in the field at about 100' in the air. We stopped on the side of the highway almost in shock and watched it for about 3-5 minutes. Thinking it could have been a helicopter I turned the car engine off to listen. It seemed to just hover in place and made no noise at all. After several minutes it started to move slowly away from us and accelerated to a high rate of speed in seconds moving out of sight to the SW in virtually seconds. We couldn't see any detail although it was certainly close enough, but it looked to be a light cigar shaped glowing haze with 5 blinking lights. 3-5 minutes sitting on the side of the road that close with something so weird was an experience I'll never forget. I would estimate the size to be maybe 150' wide and 50' high. This was the first of 3 I have seen, (1975, 1976, and 1994) and my son witnessed one just a year ago in 2008. All different."],"files":["/var/www/straped/mufon/html2text/21140.html.txt","/var/www/straped/mufon/org/21140.html"],"Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.063056,+-94.422778(21140)&iwloc=A&hl=en\"> mufon case (21140) map </A>","Object Features":"Other","Tags":"City","City":"Whittemore","Object Shape":"Cigar","Region":"Iowa","Latitude":"43.063056","Case Number":"21140","Sighting Duration":"Undisclosed","Summary":"Yellow light source with blinking lights on the side top and bottom 5","Longitude":"-94.422778","Log Number":"US-12262009-0001","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet","Date of the Event":"01/05/1975 07:00 UTC"}