{"Object Flight Path":"Straight-line path","Object Shape":"Cigar","City":"Smithtown","Case Number":"21149","Weather Factors":"Unknown","Summary":"Saw grey metallic missle without airfoils or aerodynamic surfaces travelling Northeast to Southwest.at high speed.","Country":"United States","Sighting Duration":"00:00:08","map":"<A HREF = \"http://maps.google.com/maps?q=40.863741,+-73.194759(21149)&iwloc=A&hl=en\"> mufon case (21149) map </A>","Region":"New York","Tags":"City","files":["/var/www/straped/mufon/html2text/21149.html.txt","/var/www/straped/mufon/org/21149.html"],"Log Number":"US-12262009-0010","Source":"MUFON","Latitude":"40.863741","Viewing Distance":"21-100 Feet","Date Submitted":"12/26/2009 02:01 UTC","Object Features":"Undisclosed","Disposition":"Insufficient Data","trends":["There have been 5 other sightings in Smithtown","There were no other sightings in Smithtown on or around June 14th 1958"],"divs":["Sighting DetailsI was the Southeast corner of my brother's house on foot and noticed a fast moving object from the Northeast toward the Southwest. I followed it from its emergence at the tree line approximately 8 degrees above the horizon, on this course until it dissappeared in the Southwest at the tree line which was approximately 15 degrees above the horizon. This was the summer of 1958. My first reaction (probably in miliseconds) was that a missle test had gone awry, and I was seeing a \"loose missle\". But then I waited for the sound of a rocket motor or some kind of propulsion method and there was none. Just silence. There was no contrail either. But what really stood out in my mind was the lack of airfoils of any kind or size. I thought it might be an airplane in a slight bank so that I was seeing it wing-on. But then there was no vertical stabilizer or rudder of any kind. During the entire 8 seconds I observed the flight of this craft I noted that it did not seem to be on a crash course with the ground. I had earned my wings in the G.O.C. (Ground Observer Corps) and had a manual furnished by the Air Force which identified by 3-views and sometimes pictures, every known aircraft flying at the time. My station was 12 echo, an enclosed structure on the roof of the High School Building in Smithtown, Long Island, New York. We had a direct telephone link to what was then Mitchell Field at Roosevelt, Long Island near Hempstead. I put in 12 to 16 hours per week and we had to identify every sighting of anything in the sky such as location in relation to 12 echo, altitude, direction of flight path, approximate speed, any delay in the speed of reporting, number of motors or propulsion means, date and time, etc. I felt I knew the manual pretty thoroughly. I also knew of our latest missles such as the Snark, Bomark, Nike, and later, the Nike Zeus, etc. I guess what I'm saying is that I was not a stranger to being critically detailed in knowing what was in the sky at any given time. But I had never seen anything like what I observed on that June afternoon. It may be of interest to note that I did not think I had observed a UFO for a number of years after this event. I just had to live with an experience for which I had no explaination. On Long Island at the time we had Grumman Aviation and Republic, also Sperry Gyroscope, and other defense companies, some of which were getting into jet aircraft and we experienced several crashes. As a 1st. Lt. in the Smithtown Squadron of Civil Air Patrol I had been on a number of SARCAPs (Search And Rescue Civil Air Patrol)involving some of these test flight accidents. I lost sight of the object as its flight path crossed over the tree line. It was cigar shaped, grey metallic, following a straight course, and was definitely NOT a meteor. I have never reported this to anyone but friends because I didn't think it would be of interest to anyone. However, recently I have seen some of the T.V. programs related to MUFON and I thought I would make the above report to see if it is of any interest to you. Anyway, keep up your good work."],"Longitude":"-73.194759","Date of the Event":"06/14/1958 03:15 UTC"}