{"Region":"Colorado","Date Submitted":"12/17/2002 01:00 UTC","Longitude":"-104.817683","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around December 17th 2002"],"Date of the Event":"12/17/2002 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.843412,+-104.817683(2114)&iwloc=A&hl=en\"> mufon case (2114) map </A>","divs":["Sighting DetailsI went outside behind our store for a smoke break. I looked up to admire thebeautiful sky, and observed a silvery disc hovering at an estimated 5002B feet. I was looking northwest, over the tall trees behind our building. Myinitial reaction was wow, theres another one, and its hovering over the AirForce Academy This was the second time in 3 years that I had observed the verysame type of object.My second thought was maybe its a weather balloon I then went inside our storeand asked one of my co-workers, Hey, ya wanna see a UFO After a few minutes ofyoure high, my co-worker came out to see for himself. The object was stillthere, in the same position, and it had not moved. After 5 or so more minutes ofgawking, we went back inside. Just to make sure that it wasnt a star, a balloonor something else, I went back outside about 10 minutes later and the object wasgone.Now, I say that this is the second time, as a few years earlier, during anothersmoke break at our old store some 5 miles south, I saw an identical object. Itwas during a summer rain, it had just started to sprinkle. I had anotherco-worker with me then. He was the one that said, Whats that, a UFO I thenlooked up and concurred.My past history with these sorts of things has a long history. I can remembernocturnal visitors as far back as 1965, when my family was stationed at FtHuachuca, AZ. From conversations with Arizona natives since then, they assuredme that Theres some mighty strange things happening out that way.Between these recent sightings and 1965, the most memorable close-up sightingwas during a junior high school camping trip out in Lost Park, Colorado. I musthave been about 14 at the time. The most memorable thing was that as anear-field sighting, it was crystal clear. It was a classic saucer, no domes, nolights, just glowing. I turned to my tent-mate and said do you see what I see Hereplied, Yeah, I do. Is that proof enoughI must emphasize that Ive been a long-time student of the phenomenon, and untilnow, have had no real reason to report any of these sightings for fear ofridicule. My observations are, in my opinion, as objective as I can make them tobe. Im not prone to sensationalism, and have again in my opinion a healthyattitude and a keen eye for hoaxes and mis-identifications. My only question iswithin a 50 mile radius, we have Peterson AFB, Schriever AFB, NORAD, the USAFAand Fort Carson, and they cant see these thingsId really like some help in figuring this out. If anything, these"],"files":["/var/www/straped/mufon/html2text/2114.html.txt","/var/www/straped/mufon/org/2114.html"],"Summary":"Sightings over Colorado Springs, Colorado","Weather Factors":"Unknown","Case Number":"2114","Object Features":"Undisclosed","Object Shape":"Unknown","Country":"United States","Tags":"City","Source":"MUFON","Sighting Duration":"00:30:00","Latitude":"38.843412","Log Number":"","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary","City":"Colorado Springs"}