{"Sighting Duration":"Undisclosed","Latitude":"51.262551","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/21143.html.txt","/var/www/straped/mufon/org/21143.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsMy sister and I were outside smoking cigarettes after Christmas dinner. (we eat it late!) It was quite a clear and starry night. My sister pointed something out in the sky behind me. I turned to look and saw a fairly bright orange light at what looked to me like a pretty high altitude - I would guess above 50,000 feet. It was moving extremely fast - too fast for any normal plane at such an altitude and it passed over our heads and away ino the distance within probably 20 to 30 seconds. It appeared to pulsate as it flew, but I think that was down to odd wisps of clouds here and there partly obscuring it. My sister thought it was a meteorite which it could have been, but I ruled that theory out due to it not appearing to have an angle of descent or burning up. I said I thought it was some sort of secret high speed plane flying out at around mach 7 or 8. As it faded into the distance, I pointed out to my sister that I could hear a faint engine noise from it, but she said she couldn't hear it. The next morning, I checked Google news for a any sightings, but there didn't appear to be any reports. So to sum up - I think I saw a secret plane and that someone thought that Christmas day night would be a great time for flying it as they would have little chance of being seen due to people celebrating Christmas."],"Tags":"City","Summary":"High altitude orange light moving extremely fast","Region":"England","Longitude":"-1.093609","Log Number":"GB-12262009-0004","Source":"MUFON","Date of the Event":"12/25/2009 09:30 UTC","Country":"United Kingdom","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.262551,+-1.093609(21143)&iwloc=A&hl=en\"> mufon case (21143) map </A>","Disposition":"IFO","trends":["There has been one other sighting in Basingstoke","There were no other sightings in Basingstoke on or around December 25th 2009"],"Date Submitted":"12/26/2009 06:31 UTC","City":"Basingstoke","Case Number":"21143","Object Features":"Unknown","Object Shape":"Fireball, Other, Unknown"}