{"Case Number":"21152","Tags":"City","trends":["There has been one other sighting in Filey","There were no other sightings in Filey on or around December 25th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsSaw first two orange orbs, outside of work place in the heart of Filey, moving at high speed towards the sea direction. Witnessed it with my Boss and his wife whilst having a cig outside. Was previously phoned by a friend to look out for them as he and his dad saw them on there way home from work. The two objects disapeared but one first changed direction and shot up into the sky. Second event a few hours later at my familys christmas party, again outside in the garden having a cig. This time my brother in-law and his daughter watched as 7-9 objects again moved fast through the sky, heading towards the sea. These did not dissapear but rather moved out of view behind the tops of houses. Apprently earlier someone had set of three chinese lanterns in a near by village. Its possible I suppose but there were no flickering lights and they were moving dam fast and in a sort of formation. Also I have just heard something about the US airforce testing flares or something last night? In Filey? I used to be in the Army and boy, flares have really come on leaps and bounds since then! In my humble opinion they were not flares or lanterns. I have also seen a few months back two white orbs, as bright as venus but again moving at some speed, they to dissapeared. I tried to take a picture of one last night and just caught it, but it is not prove positive regretably. I would like to know who many other people withnessed these objects last night because it was spooky!"],"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/21152.html.txt","/var/www/straped/mufon/more/21152_submitter_file1__Photo-0005.jpg","/var/www/straped/mufon/org/21152.html"],"Object Features":"None","Object Flight Path":"Straight-line path,Path with directional change","Region":"England","City":"Filey","Log Number":"GB-12262009-0013","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=54.210076,+-0.290594(21152)&iwloc=A&hl=en\"> mufon case (21152) map </A>","Summary":"Two bright orange spheres, star like, moving fast. Later 7 to 9 of them","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"54.210076","Object Shape":"Circle, Sphere, Star-like","Disposition":"Unresolved","Date of the Event":"12/25/2009 12:00 UTC","Weather Factors":"Unknown","Longitude":"-0.290594","Date Submitted":"12/26/2009 03:42 UTC"}