{"Latitude":"37.699546","Region":"Kansas","Summary":"observed object traveling south west photographed.","Date Submitted":"12/26/2009 02:08 UTC","Object Flight Path":"Straight-line path,Path then hovering","Date of the Event":"06/21/2009 05:30 UTC","Object Features":"None","City":"Wichita","files":["/var/www/straped/mufon/html2text/21150.html.txt","/var/www/straped/mufon/more/21150_submitter_file1__UFO001.JPG","/var/www/straped/mufon/more/21150_submitter_file2__UFO002.JPG","/var/www/straped/mufon/more/21150_submitter_file3__UFO003.JPG","/var/www/straped/mufon/org/21150.html"],"Source":"MUFON","Viewing Distance":"Over One Mile","Country":"United States","Longitude":"-97.328555","divs":["Sighting DetailsWhile sitting at our patio table with my wife Tish and grandson Logan, I was looking to the North east at the cloud formation when I saw something flashing against the large cloud in the background. I watched for about a minute, then told the others who had their backs to it, they turned to observe the object also, I then decided to go to the basement and get my bionaculars with built in camera. When I returned I saw that the object had moved to the southwest of us and just to the north of McConnell AFB. Which is to our south. We were thinking it might have to do with the military, I talked with a confidental source from the base and was told there was no military action they knew takeing place. Even with the optical aid I could see no definition to the object it was just smooth and round, I then remembered to photograph it. I felt that the object must be powered because it was traveling into the wind. At least the wind on the ground was from that direction. The object seemed to stay in that spot for about 5min then went up into a cloud formation and dissapeared. We watched until the cloud passed and there was nothing. Even useing the bionaculars I could not locate it. I told my wife I found that odd because it was about the same time frame in 1958 that my mother father and I saw a similar object just about fifty feet from our house which traveled west then abruptly changed directions went over our house and dissapeard into the distance. That object pulsated with light and was about 75 feet in diameter."],"Case Number":"21150","Tags":"City","trends":["There have been 39 other sightings in Wichita","There were no other sightings in Wichita on or around June 21st 2009","This sighting has never been favorited.",""],"Object Shape":"Sphere","Log Number":"US-12262009-0011","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.699546,+-97.328555(21150)&iwloc=A&hl=en\"> mufon case (21150) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}