{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Case Number":"21166","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"05/31/2001 12:00 UTC","Tags":"City","Region":"Nebraska","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around May 31st 2001","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.813802,+-96.674489(21166)&iwloc=A&hl=en\"> mufon case (21166) map </A>","divs":["sighting detailsi was at home 4306 lake street, omaha nebraska fron yard, i notice them because they told me to turn arond and flim, i new what it was because i had talk to them befor hand and set it up for then to come, it was our pick up ship. interesting part was some one shot at it several times! i took my eye it for a second and it was gone! i have been doing this for 12 years, this was our third visit! one: our space war battle video: http:\\\\www.ireport.com\\docs\\doc-308500 this is the documentation every one world wide wanted. two: the team captain's t 9 last majestic 12 orders to the world http:\\\\www.ireport.com\\docs\\doc-156975 three: our abduction not from but in our car documentation. our information is now on cnn.com we are both cnn.com ireporter team captain. four:written by twintalker on jul-14-09 4:09am from: ireport.com the team captain cnn.com\\ ireports. cnn.com\\ ireporter team captain, t. c. assistance charlene j. the oracle! reporting. in a message dated 7\\9\\2009 1:20:12 p.m. central daylight time, exopolitics@yahoo.com writes: t.c. is there something you would like to share with me? mahalo michael salla, ph.d. exopolitics institute p.o. box 2199 kealakekua, hi 96750 usa tel\\fax: +1 808 323 3400 http:\\\\www.exopoliticsinstitute.org http:\\\\www.zimbio.com\\exopolitics\\articles\\pfu0o-h5xt-\\dr+michael+salla+expolitics+specialist+ufo?afc889c8 we have four pictures of real alien's we visited with. about sixty pictures we are negotiation with the present administration for more, they want to give it out, but it seem's know one is listning, the real alien disclosure. on that space war video can you tell me how many shot's were fired? in short the majestic 12 gave us the final relest documentation of alien disclosureto the world! since know one was listning we turn them in to team captain cd's the question we are asking mufon headquaters is here.. the original, team captain's last majestic 12 orders to be given to the world. secret government, alphabet soup boy's and girl's, majestic 12, disclosure , aliens,... our first story http:\\\\www.ireport.com\\docs\\doc-156975 cnn.com i reporter link http:\\\\www.ireport.com\\people\\teamcaptain?view=overview&watchobjecttype= our web page: www.lekinser-x.org your comment and reply for disclosure is requested, mufon for or against real disclosure? note: we are both writers and cnn reporters! t. c"],"files":["/var/www/straped/mufon/html2text/21166.html.txt","/var/www/straped/mufon/more/21166_submitter_file2__ROSWELLMEXCIO181.JPG","/var/www/straped/mufon/org/21166.html"],"Viewing Distance":"Over One Mile","Weather Factors":"None","Summary":"Alien Space war Battle over my House, Video!","Object Features":"Dome, Unknown","Latitude":"40.813802","City":"Lincoln","Date Submitted":"12/26/2009 08:34 UTC","Object Shape":"Boomerang, Circle, Cylinder, Disc, Flash, Oval, Sphere, Square, Rectagular","Country":"United States","Log Number":"US-12262009-0025","Longitude":"-96.674489","Sighting Duration":"Undisclosed"}