{"Latitude":"34.983131","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=34.983131,+-85.286068(21163)&iwloc=A&hl=en\"> mufon case (21163) map </A>","files":["/var/www/straped/mufon/html2text/21163.html.txt","/var/www/straped/mufon/org/21163.html"],"Date Submitted":"12/26/2009 07:31 UTC","divs":["Sighting Detailsit was early fall of 97. Me an my wife an our daughter were leaving family home. Lookout Valley GA.heding home to ringold GA. When i got hwy196 red light I saw bright light above the ridge.I told my wife to look .Her aplie was o thats lights from ball feild .Was agood answer but the lights were the wrong side.As i crossed hwy began to tell her to shut up.As we drove uo the ridge i began turn off everthing.I pulled over in the middle of hwy.I was in shock at size of it,i had my head out the window looking up.No sound was made.Ithad a beam of light coming from the bottom that lightup 3 or 4 tree tops.Nothing moved not a sound was made.This was a mind blowing moment of my life,My life has changed forever.Did not say anything to anyone for a week.I expected to see something on the News for this is a small towne.Nothing was mentioned about this at all.The follwing weekend i was at family's home when i could not hold it in no longer.I began to tell my brothering law what i had seen the weekend before.Before i could finish he explained everthing i was going to tell him he had saw 3 nights later over same ridge.That blowed my mind that he saw the same thing.The only way i can explain what i saw just unbelevable.Something out of starwars."],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"as large as a football feild hovering over a ridge 150 yards above my car","Log Number":"US-12262009-0022","Viewing Distance":"101-500 Feet","City":"Rossville","Date of the Event":"09/20/1997 11:00 UTC","trends":["There has been one other sighting in Rossville","There were no other sightings in Rossville on or around September 20th 1997"],"Country":"United States","Case Number":"21163","Region":"Georgia","Source":"MUFON","Weather Factors":"None","Tags":"City","Longitude":"-85.286068","Disposition":"Insufficient Data","Object Shape":"Triangle"}