{"Weather Factors":"Unknown","Tags":"City","Date Submitted":"12/26/2009 08:22 UTC","Latitude":"42.54943","Country":"United States","divs":["Sighting DetailsI was leaving Kensington Metro Park and as I was about to turn I noticed two cars pulled over with the people standing outside of it looking skywards. As I was making my turn I glanced up to see what they were looking at and seen a gray metallic shaped UFO sitting stationary in the sky about the same altitude as the jets do when they make there approach to Pontiac Oakland Airport. I wheeled back around and immediately got out of my car and started to stare at it for about three minutes not beleiving my eyes. There is no doubt in my mind it was a UFO. It was not a ballon or a plane or a helecopter. It did not move up, down or sideways. It remained moitionless for about 3 minutes and then started to go up at a slow rate. I had my camera with me because I always go to the Park to photograph wildlife pictures. I snapped off 4 pictures. I have told a few relitives and others about this and they act if I am nuts. I have the 4 pictures to prove it. The UFO in the pictures appear smaller than what I remember it to look like in size. Look at the enclosed pictures but do zoom in on them and see for yourself. I stared at this thing thinking that there probably was some kind of intelligent life onboard and here I am staring at it. After about 6-7 minutes, it gained altitude and got smaller so I went home in a hurry to get these oictures on my computer to show to people."],"Object Features":"Dome, Appendage(s)","Region":"Michigan","City":"Milford Township","map":"<A HREF = \"http://maps.google.com/maps?q=42.54943,+-83.613557(21165)&iwloc=A&hl=en\"> mufon case (21165) map </A>","Date of the Event":"12/20/2009 01:42 UTC","Object Shape":"Square, Rectagular, Other","Summary":"It was stationary up in the sky for about 3 minutes and then it started to go higher up","Disposition":"Unknown","Case Number":"21165","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Other","Source":"MUFON","Longitude":"-83.613557","files":["/var/www/straped/mufon/html2text/21165.html.txt","/var/www/straped/mufon/more/21165_submitter_file1__PC200013.JPG","/var/www/straped/mufon/more/21165_submitter_file2__PC200014.JPG","/var/www/straped/mufon/more/21165_submitter_file3__PC200016.JPG","/var/www/straped/mufon/org/21165.html"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12262009-0024","trends":["There have been 4 other sightings in Milford Township","There were no other sightings in Milford Township on or around December 20th 2009","This sighting has never been favorited.",""]}