{"City":"Undisclosed","Region":"Maryland","Date of the Event":"05/10/2002 12:00 UTC","Summary":"the object had lights all across the front, and a portal on bottom with blue light.","map":"<A HREF = \"http://maps.google.com/maps?q=39.053335,+-76.632581(21164)&iwloc=A&hl=en\"> mufon case (21164) map </A>","Case Number":"21164","Object Shape":"Square, Rectagular","divs":["Sighting DetailsI along with my two friends were driving to the store,(I was the driver, Coop was a passenger sitting behind me, and Fee was the front seat passenger) when my friend Coop tapped me on the shoulder, and said,\" Hump what is that ?!\". I looked and I replied, \"Man that's just a plane.\" Coop again pleaded, \"NO, man that's no plane, what is it?\" I looked again, this time slowing down in the car to get a better look. That's when I noticed that it was not a plane at all. I saw an object that had white lights going all the way across the front of it. At this time we all became very excited. We arrived at the 7-11, located on Sherwood Rd., in Baltimore city, and we continued to observe the object, as it was descending towards us. I was so intrigued about this strange object, that I almost ran straight into the 7-11 building itself. I threw the car into park, and we all got out of the car and left the doors opened, because we were so excited. As we exited the car, we had noticed the object had spun around as to fly in another direction, as it did this, the object flew directly over top of us. This object was black(matte)in color, rectangled shaped, no markings on it or any noticeable markings of any kind. It was also very large and had what looked like a door on the bottom, with a bright blue light emminating from it. As the object passed over us, I had noticed that there was no sound of any kind coming from it, and that it had no exhaust or engines in the back of it. We all watched as the object slowly disappeared over several houses in the area. The strange thing about this event is that I don't know why it seemed that we were the only ones to have witnessed this event on this particular night, and the fact that my passenger Fee didn't believe in UFOs until this strange event had happened to us. To this day I can't get that night out of my mind, because I know in my heart that the object we saw was from another planet. I know it was not a govermental experiment because if the government has been hiding the truth all of these years, they would not subject citizens of this country with aircraft that could create mass hysteria!!"],"files":["/var/www/straped/mufon/html2text/21164.html.txt","/var/www/straped/mufon/org/21164.html"],"Log Number":"US-12262009-0023","Latitude":"39.053335","trends":[],"Country":"United States","Date Submitted":"12/26/2009 08:10 UTC","Longitude":"-76.632581","Object Features":"None, Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Weather Factors":"None","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change"}