{"files":["/var/www/straped/mufon/html2text/21168.html.txt","/var/www/straped/mufon/more/21168_submitter_file1__MarkedToes0809.jpg","/var/www/straped/mufon/org/21168.html"],"Log Number":"US-12262009-0027","Tags":"City","Longitude":"-151.738137","Date Submitted":"12/26/2009 09:03 UTC","Case Number":"21168","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Happy Valley","This sighting has never been favorited."],"Date of the Event":"08/15/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=59.935174,+-151.738137(21168)&iwloc=A&hl=en\"> mufon case (21168) map </A>","Region":"Alaska","City":"Happy Valley","Summary":"One mark on each big toe, Two of us.","Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Undisclosed","Latitude":"59.935174","Source":"MUFON","Object Shape":"Unknown","divs":["Sighting Details14 August 2009 Myself and a hunting partner drove up the Dalton highway to hunt caribou. We hiked in 2.5 miles off the Dalton highway close to Happy Valley, we hiked in on the west side of the road. We each broght one man tents and stayed out three nights, shooting two caribou each. On the four day we started out with the first load, when we made it to the truck my toes and part of my foot was numb, both feet were like that. I told my hunting partner I've never had my toes go numb before and he said his toes and feet where the same way. We both just put on a spare set of boots we brought ate and crashed out. When we got the last of the caribou out and headed home not thinking much about it. At home I noticed that on each of my big toes I had a small red mark as in the photo. Today my big toe and the one next to it are mumb the rest of the foot is normal. My hunting partner has the same marks on his toes and his big toe and next one are numb too. Tell you the truth I have no idea what happened. Are boots were two different kinds and good boots. We just woke up and our feet where half numb and when we got home we found red marks on our big toes, all four marks are in the same place on each toe. We saw no one on the hunt. I watch the UFO hunters each week and figured this maybe an encounter. I'm at a lost to what happen just figured you guys might like to record the event."],"Country":"United States","Sighting Duration":"Undisclosed"}