{"Sighting Duration":"Undisclosed","Longitude":"-104.812343","Disposition":"Unknown","City":"Colorado Springs","Case Number":"21171","Weather Factors":"None, Does Not Apply","Region":"Colorado","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/21171.html.txt","/var/www/straped/mufon/org/21171.html"],"Source":"MUFON","Date Submitted":"12/26/2009 09:42 UTC","Latitude":"38.839172","divs":["Sighting DetailsWhile sitting in a dentist office I saw the objects through the large windows of the waiting room. I was sitting, looking out through the windows, when I saw it above the building across the parking lot in front of me. I initially thought it was a stacked group of 2 or 3 parachutes, but I thought it was odd that they were parachuting at that location. The location is just east of the Air Force academy which has a lot of parachute operations, but nowhere near where I saw this object. After looking at it a few seconds, trying to process what I was seeing, I notice it wasn't coming down, but was moving horizontally and that it actually didn't exactly look like linked parachutes. I then started thinking \"what the heck is that?\". It went behind a raised part of the roof of the building, moving from right to left. I started watching the other side of the raised section to see if it would emerge on the same trajectory, when approximately 5 white lights emerged in an arc shape, moving right to left at about the same speed as the first object. As the arc of 5 or so lights moved left the arc was expanding very slowly, it appeared that they were climbing and moving directly away from me. Also, while the arc of lights was expanding, two more objects (lights) appeared and did the same as the arc of lights. They were moving so slowly that they appeared to be almost hovering, but they were getting smaller and smaller, which made me think they were moving away. I think the total duration of viewing was about 5 minutes. I was watching them slowly get smaller, or dimmer, when we were called in to see the dentist. Later that day I flew out of the Air Force academy's aeroclub working on my Single Engine Land Airplane rating, into the same area that I saw the objects. I have 5900 hours of helicopter time, and have never before seen anything that I couldn't explain. The whole time I was watching this object however, I was trying to figure out what I was seeing, but couldn't come up with anything that could explain this. At the aeroclub I checked Notices to Airmen (NOTAMS) to see if any kind of unusual operations were happening that day, but no one knew anything. The area is also in the northern part of the Colorado Springs airport Class C airspace. I never check with approach control though, to see if they saw anything."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.839172,+-104.812343(21171)&iwloc=A&hl=en\"> mufon case (21171) map </A>","Summary":"Object(s) seen during daytime, initially parachute shaped, after passing behind a building appeared to become an arc of lights.","Object Flight Path":"Path with directional change","Country":"United States","Object Shape":"Other","Object Features":"Other","Date of the Event":"10/03/2009 09:00 UTC","Log Number":"US-12262009-0030","Tags":"City","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around October 3rd 2009"]}