{"Summary":"5 to 6 orange balls of light","Sighting Duration":"Undisclosed","City":"Austin","Log Number":"US-12262009-0033","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.272093,+-97.739431(21174)&iwloc=A&hl=en\"> mufon case (21174) map </A>","Region":"Texas","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"12/26/2009 10:21 UTC","Object Shape":"Sphere","Date of the Event":"12/19/2009 10:45 UTC","divs":["Sighting DetailsMy wife and I were leaving from a Christmas party in South Austin. We were driving north,north west on Slaughter Lane just east of the Mopac 1 Expressway. As I was driving I noticed 5 to 6 what appeared to be large orange stars. They were in the formation of the big dipper and they appeared to be many miles ahead of us maybe 10+, but I couldn't be sure. I immediately asked my wife if she saw them and if they were planes or something else, but she said she had also been watching them, but just thought they were planes or something. As I watched them I new they weren't stars because they were to big and very orange in color and they weren't moving and just stationary. I told my wife I had to stop to look and I was on a pretty busy street so I sped up and turned into a residential neighborhood. I quickly got out of the car and as we pulled into the neighborhood they had moved and were directly above us. By the time I got out of the car 2-3 of them were gone. The other three had moved closer together next to another one that did not ever move (the 4h). 2 of them then started to move in different directions and slowly faded away. When there were two left a car pulled up with a family of 5 and asked me if I new what I was looking at because they had been watching it from their home and they didn't know what they were. I told them I didn't know what they were, but they definitely weren't stars, a plane or a helicopter. I then remembered that I had a video and digital camera in my car and ran to get it ,but the digital wouldn't take the photo because it couldn't focus. At this point one of the other lights begin to move and it then slowly fades away while the one single light remained motionless in the air. I then told my wife to run and get the video camera and right as i turned the camera on the last orange ball of light disappeared in a quick fade. It was pretty exciting to see this and I'm not sure what it was, but it had to be some type of secret military thing or a true UFO or UFOs. Feel free to contact me if you have any questions. I have to say, I was very disappointed that I didn't get any of this on video, but it was very exciting to see it. I felt like I was in some ufo movie or something."],"Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21174.html.txt","/var/www/straped/mufon/org/21174.html"],"trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around December 19th 2009"],"Case Number":"21174","Object Features":"Undisclosed","Country":"United States","Latitude":"30.272093","Longitude":"-97.739431"}