{"Longitude":"-97.620004","trends":["There have been 2 other sightings in Pflugerville","There were no other sightings in Pflugerville on or around November 30th 1992"],"Latitude":"30.43937","Case Number":"2117","Date Submitted":"11/30/1992 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.43937,+-97.620004(2117)&iwloc=A&hl=en\"> mufon case (2117) map </A>","City":"Pflugerville","Object Features":"Other","files":["/var/www/straped/mufon/html2text/2117.html.txt","/var/www/straped/mufon/org/2117.html"],"Weather Factors":"Fog","Country":"United States","Summary":"I saw oscillating lights indicating a circular for","divs":["Sighting DetailsI feel silly waiting so long to report this, as I am a curious kind of person. Iam also not exactly sure on the year, it could have been 1994. But I wasstanding in the HEB parking lot at I-35 and Wells Branch Pkwy. I was thereearlier than usual waiting for the Capital Metro bus. I lived in Round Rock atthe time and rode the bus in to my government clerk job with the USDA in Austin,TX. It must have been winter because I was cold with my coat on and it wasfoggy. That spot in the parking lot is now where the fuel island is, but at thattime that HEB did not have a fuel island. I was leaning against my car facingNorth. Heard a small jet sound on my right. Turned to look and saw and objectlifting almost straight up. The object had oscillating lights flashing insequence indicating a circular structure. I could not see the craft in part dueto the fog, but oddly because it seemed shrouded in a haze of its own. At thetime I saw it, I noticed its ascent was so straight up, that it appeared to havelifted off from almost behind the store. There is a little house there, but Inever had the nerve to go to that house and ask if they knew of anything likethis. I rationalized since then that there is a small airport very nearby. Butit went straight up like a helicopter, made the sound of a jet, lifted veryslowly. What bothers me the most is my numb reaction to the whole thing Ithappened about 10 years ago, yet facing this and accepting this as a realitymakes me nervous and I dont know why. I try to laugh it off and tell myself thateven aliens like to shop at HEB. I have only told my husband about this a fewtimes, he is very supportive but doesnt know what to make of it either. I know Iam not crazy. I dont mind talking to you people about this. But please keep mesafe from having my personal life disrupted. Thank you."],"Tags":"City","Sighting Duration":"00:00:59","Region":"Texas","Log Number":"","Source":"MUFON","Disposition":"Unknown","Viewing Distance":"21-100 Feet","Object Shape":"Sphere","Date of the Event":"11/30/1992 12:00 UTC","Object Flight Path":"Unknown"}