{"Log Number":"","files":["/var/www/straped/mufon/html2text/2118.html.txt","/var/www/straped/mufon/org/2118.html"],"Country":"United States","Case Number":"2118","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around January 16th 2003"],"Object Shape":"Triangle","Tags":"City","Longitude":"-85.131171","divs":["Sighting DetailsI was coming home after class in Angola I noticed what appeared to be a helicopter in my neighborhood as I was getting near home. It was projecting a search light in a neighborhood just off of Scott road near the end of Shingle Oak Pointe. The craft had three white lights near each flattened point and one in the middle. I thought it might be some kind of helicopter because it had red lights as well. I like helicopters I will alway drive close to see one if I can. As I got closer it started to move toward the intersection of Scott and 14 it stopped about half way over the Do It Best store and started moving slowly north the bright center light was dimmer at this point then it moved toward the direction of the Fort Wayne international airport it was traveling about fifty miles per hour and I could only follow at about thirty five MPH I cannot afford any type of speeding ticket. I followed it about 1.75 miles. It flew overCopperhill addition and I lost sight of it and went home. Of course my wife thought I was nuts and I did not think much about it till I saw a picture of the same type of craft on the History channel Saturday Feb 1 when they where talking about this type of craft that was flying around France. I think the show was called UFO Hot Spots. I have only seen two other UFOs in my life and one was reported to be a very large asteroid that broke up over Indiana when I was in high school. I would estimate it flew about 150 feet above the ground to 220 feet and was maybe 28 to thirty 35 feet between lights. I only saw a very very dim outline that may have been an illusion of the crafts true shape. I heard no sound minus the rain and my car. I saw no indication of lights dimming in houses or any means of thrust for this craft. I know that this craft looked very much like the triangle shaped craft on TV. I get out of school anywhere from 900 to1000. I am pretty sure it was very close to 1100 when I saw it but it may have been as early as 1030 PM."],"Source":"MUFON","Object Flight Path":"Straight-line path","Weather Factors":"Rain","Date of the Event":"01/16/2003 10:00 UTC","Summary":"Triangle Scott Rd and Hwy 14","Region":"Indiana","Viewing Distance":"101-500 Feet","City":"Fort Wayne","Sighting Duration":"00:05:00","Object Features":"Unknown","Date Submitted":"01/16/2003 10:00 UTC","Latitude":"41.084693","map":"<A HREF = \"http://maps.google.com/maps?q=41.084693,+-85.131171(2118)&iwloc=A&hl=en\"> mufon case (2118) map </A>","Disposition":"Unknown"}