{"Object Features":"Unknown","divs":["Sighting Detailshello, my name is Van and have presently resided in Co.springs Co. with my wife Chris and son Van jr. for going on 6 years now My sighting happened around 10 years ago.Now i want to tell what we saw one night while fishing with my friend and high school buddy Bill.At that time we had been residing in Fairfield Ca.,(less that 3 miles from Travis A.F.B.)for around 30 years. I had been fishing these waters since i was a kid. Bill and I had been fishing buddy's for about 5 years fishing the Montazuma sloughs both days and nights frequently.The boat was Bill's and always ran faithfully.One night around 10:00 p.m. we attemped to relocate to another spot but the boat would not start...we thought it was the battery(Die-Hard out of my 351 Bronco) the battery didn't even have one charge for Bill's 50 H.P. outboard. I looked up and noticed what seemed to be a aircraft flying at a altitude of about maybe 50 60 thousand feet but really moving. I ask Bill what is that as Bill and I observed the aircraft bank right at ninety degrees then not 2 seconds into the banking manuver come to a full stop,at the same instance backed up just in time for what appeared to be a shooting star then accelerating into nowhere at the blink of an eye. At this time Bill and I heard a thunderous splash very close to the boat, it sounded like a truck hitting the water from a 1,000 feet up. Bill attempted to start the boat,It started right away he grabbed his Tarus 38 and I grabbed my .45 and we went home. I told my family about and let it go soon after. Well about 2 years later I was watching a ufo special on the history channel, and SAW MY SIGHTING!!! The Veiw was was from one of the space shuttles and the person narrating stated that the military had attempted to shoot high altitude rockets(the shooting star that went by when it stopped and backed up).Well I believe that I know where it might have been shot down on public waters. say within 300 yards from where something hit the water at an incredible speed.............. We never saw the second craft,The ufo special showed two(2)craft and two(2) missile,s.We did,nt see any falling objects,but whatever hit the water did so at an incredible speed making it the loudest thing i have ever heard hitting the waters where we were fishing.The waters we were fishing in was between 10-15 feet deep But within 300 yards from where we were fishing the water depth drops off to approx. 324 feet,Thats where i beleive the object hit.This area is very secluded there are no roads,no public buildings,and the only access is by boat.What we saw was not a military craft."],"Latitude":"38.358267","Case Number":"21186","trends":["There have been 10 other sightings in Vacaville","There were no other sightings in Vacaville on or around September 15th 2000"],"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Path then hovering,Other","Disposition":"Insufficient Data","Sighting Duration":"00:03:00","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21186.html.txt","/var/www/straped/mufon/org/21186.html"],"Tags":"City","City":"Vacaville","Region":"California","Longitude":"-121.982904","Object Shape":"Star-like","Weather Factors":"Unknown","Country":"United States","Log Number":"US-12272009-0010","Date Submitted":"12/27/2009 12:58 UTC","Summary":"high altitude craft, Starlike,No visible characteristics","Date of the Event":"09/15/2000 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.358267,+-121.982904(21186)&iwloc=A&hl=en\"> mufon case (21186) map </A>"}