{"Date Submitted":"12/27/2009 01:30 UTC","Case Number":"21188","Region":"Massachusetts","Summary":"Unknown encounter with an unexplainable entity(ies)","trends":["There have been 17 other sightings in Cambridge","There were no other sightings in Cambridge on or around September 3rd 1988"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-71.108653","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/21188.html.txt","/var/www/straped/mufon/org/21188.html"],"divs":["Sighting DetailsThis is a very undramatic report, actually quite boring due to the lack of information avaliable, the only reason why I am explaining this is because I feel there must be many more people who have had the same encounter and are puzzled by it. The exact date of the encounter is unknown and the duration of the event is unknown. During the 80s and early 90s I was in the British Army in an Armoured recce, Tank Regiment. Some time in the 80s I know that I was sitting in the troop rest room adjacant to the tank hangar, I wan't alone there were at least 3 other troop members in the room. I was sat in an old armchair, my first recollection is that we had all seen something very, very unusual to say the least. An event had just taken place in the rest room involving other (lets say beings) and that is all I know. We were all still sat around staring at each other in disbeleif when one of the others said 'you know that none of us are going to remember any of this'. Told you it is boring and uneventful. All I know is that something happened that day, we were all highly trained professional soldiers and not the sort of people who were inclined to panic or hallucinate, not excitable people. I don't know if any of the others have recollections of what happened or even know if they still remember that something took place, none of us ever mentioned the event again. Becuase as I say there was only an extremely vague memory that something actually took place so nothing really to talk about. I expect that most people who actually do encounter something suffer from memory loss and so a large percentage of encounters must go unreported as there is nothing to report. I cannot say if this encounter were extraterrestial or paranormal etc... just something extremely out of the ordinary. I just hope that one day I can remember what it was we saw that day, as I am an extremely sceptial person and immediately assume there is a rational and logical explaination for everything, but I also know that this event wasn't a figment of my imagination."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.37494,+-71.108653(21188)&iwloc=A&hl=en\"> mufon case (21188) map </A>","Object Shape":"Unknown","Viewing Distance":"Unknown","Log Number":"GB-12272009-0012","City":"Cambridge","Object Flight Path":"Undisclosed","Latitude":"42.37494","Country":"United States","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Date of the Event":"09/03/1988 02:00 UTC"}