{"Viewing Distance":"Over One Mile","Log Number":"US-12272009-0009","Tags":"City","Date Submitted":"12/27/2009 09:28 UTC","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/21185.html.txt","/var/www/straped/mufon/more/21185_submitter_file2__2O6I2322.JPG","/var/www/straped/mufon/org/21185.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.434231,+-80.666199(21185)&iwloc=A&hl=en\"> mufon case (21185) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Beaufort","There were no other sightings in Beaufort on or around November 23rd 2008","This sighting has never been favorited.",""],"Longitude":"-80.666199","Country":"United States","Case Number":"21185","Sighting Duration":"00:00:15","Summary":"WHITE CIGAR SHAPE AT 45 DEGREES AGAINST BLUE SKY - SIZE AND DISTANCE UNKNOWN","Disposition":"IFO","Date of the Event":"11/23/2008 02:01 UTC","Weather Factors":"None","City":"Beaufort","divs":["sighting detailsi was taking snapshots of old sheldon church between gardens corner and yemassee sc, near beaufort sc around 2pm and blue sky. i made 4 similar photos within one minute. the camera was a 21 megapixel canon mark iii 1ds digital camera \\ 17-40mm canon l series professional wide angle zoom lens. all photos were taken at the camera's high resolution setting. i do not recall seeing the unusual white cigar or disc shape when making the photos. i may have seen it but did not actually take note of it at that time. i did see the white shape while reviewing the photos later in the day. only one of the four photos in the series, labeled 206i2322.jpg, showed the unusual white shape. the photo which included the white shape was taken at 1\\250 sec. the white shape was cigar or disc like, distance and size unknown, but was certainly up in the sky beyond the tree line, and oriented at 45 degrees. the other three photos, while varying somewhat in focal length and with smaller framed areas, did not show the same white shape. in close examination the upper end of the white shape seems to be more pointed than the lower end. when zooming in to maximum there is a very small circle on the top edge near the upper end which i take to be a spec of dust on the camera's sensor. when i first began to notice the white shape in the photo, it did not seem to be like any cloud i have ever seen. one of my first thoughts was that it could be a ufo with some kind of invisibility camouflage. it has also occurred to me that the object could have been moving so fast that i could not have seen it but at 1\\250 of a second shutter speed my camera could record it."],"Latitude":"32.434231","Object Shape":"Cigar, Disc","Region":"South Carolina"}