{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21182.html.txt","/var/www/straped/mufon/org/21182.html"],"Latitude":"42.784756","divs":["Sighting DetailsI was heading home from college in Grand Rapids, Michigan to Jackson, Michigan which was where my parents house was at the time to get my car fixed by a mechanic there in town the next day. I was driving by myself, but the cool thing about this event is that my good friend and witness was directly behind me as to give me a ride back home the next day after dropping my car off to be fixed. It was approximately 11 p.m. and as I was heading east near the Lake Odessa exit on I-96 I saw a yellowish looking light sitting right in the middle of the highway. At first sight it was approximately 1 mile ahead of my car. It was not an overpowering type of light, but was as mentioned a yellowish type of light. I figured it had to be a helicopter hovering very close or even parked on my side of the highway (I-96 is a two lane highway with a median between east and west bound). As I got closer, this light did not move and I remember saying to myself if I keep my 65 mph pace, I am going to run right into this light! I started to decrease my speed as I was now less than 400 feet from this now becoming a distinguishable object. It proceeded to hover off to the right side of the road at a still very low height. As I was now right below this now visable triangle shaped object, it had a series of blue lights around the triangle shape of the object. The actual size of the object approximately filled the two lane highway by the way. My speed at this time was no more than 45 mph as the object hovered to the right of my car. It continued to head to a line of trees that lined a farmer's field near the highway. There was no noise coming from the object at all. The significance of this story is that my buddy traveling behind me witnessed this whole thing and can attest to this event as well. Another neat fact of this event is that the closest car heading west across the median slowed down quite a bit as I assume they were observing this object as well. I am just amazed how close I was to this triangle shaped UFO. It is like it wanted to see how close it could get to my car without having to make me stop from literally running right into it. To make this even more descriptive of how close I was, if I had a rock at the closet distance to this object and would have proceeded to stop and get out of my car, I likely could have bounced it right off it with a full out throw. As I proceeded to drive away I continued to observe where the UFO was headed. It now trailed my car as it also continued to make its climb higher into the night sky. I stopped at the first possible rest area and as I got out of my car to talk to my friend about it. I didn't even have to say a word to him as we approached each other and I could tell he observed the whole event as well. To this day we occasionally mention this event as it was such a surreal thing to have witnessed. Of course I wish I had been able to capture a photo or video since the close distance I was to this object was incredible. I would have loved to talk to the car that saw this object as it was heading west. They had to be in awe of not only seeing this take place, but to witness from thier angle of how close I was to this UFO. I have always wanted to document this event, so glad to come across this format."],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","City":"Lake Odessa","Summary":"Traveling east on I-96 and literally was driving into a light sitting on my side of the Interstate","Source":"MUFON","Tags":"City","trends":["There have been 3 other sightings in Lake Odessa","There were no other sightings in Lake Odessa on or around May 21st 1996"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.784756,+-85.138337(21182)&iwloc=A&hl=en\"> mufon case (21182) map </A>","Object Shape":"Triangle","Log Number":"US-12272009-0006","Weather Factors":"Unknown","Date Submitted":"12/27/2009 05:44 UTC","Region":"Michigan","Case Number":"21182","Object Features":"Undisclosed","Longitude":"-85.138337","Date of the Event":"05/21/1996 12:00 UTC","Sighting Duration":"Undisclosed","Country":"United States"}