{"Region":"Louisiana","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.466403,+-91.13356(21183)&iwloc=A&hl=en\"> mufon case (21183) map </A>","Viewing Distance":"501 Feet - 1 Mile","Latitude":"30.466403","Tags":"City","Weather Factors":"Unknown","trends":["There have been 27 other sightings in Baton Rouge","There were no other sightings in Baton Rouge on or around July 26th 2008"],"Case Number":"21183","Object Shape":"Cylinder","Disposition":"Insufficient Data","Country":"United States","files":["/var/www/straped/mufon/html2text/21183.html.txt","/var/www/straped/mufon/org/21183.html"],"Date of the Event":"07/26/2008 12:00 UTC","City":"Baton Rouge","divs":["Sighting DetailsEarly evening, sun hasn't set, very few clouds; a friend and I were watching my 20 months old son play when I looked up and saw this brightly lit silvery thing slowy moving from west of the sky towards east-north-east. We were both sitting on swings facing south-west. I asked my friend to look up and see the thing. Both of us couldn't fathom what it could be. It made no sound, it was just gliding over and went behind us. Its shape was more like a hot-dog bun. As it moved toward north-east we kept looking at it and then the light was still visible from back side as well, it seemed the it was one continuous light surrounding it. It went out of sight because of buildings. I know it wasn't any blimp or ballon since blimps don't look silvery or have one long continuous lights surrounding it or a ballon which doesn't move steadily. I just didn't know what it was and it to be a UFO. I came home and told my husband and few other friends and as usual he thought I had seen something else. I even asked the friend who witnessed the incident to descrive the thing."],"Object Features":"Other","Log Number":"US-12272009-0007","Longitude":"-91.13356","Date Submitted":"12/27/2009 06:15 UTC","Object Flight Path":"Path with directional change","Summary":"Early evening, sun hasn't set, very few clouds; I looked up and saw this brightly lit thing slowy moving from south-west of the sky towards east-north-east."}