{"Log Number":"US-12272009-0017","files":["/var/www/straped/mufon/html2text/21193.html.txt","/var/www/straped/mufon/org/21193.html"],"Date Submitted":"12/27/2009 03:37 UTC","Disposition":"Unknown","divs":["sighting detailsi was putting a bag into my garbage can in my front yard. it was a very clear warm night so i was looking up at all the stars and i looked towards west, i saw some dim light moving but looked away and then back again. the yellowish blurry light was now about 1 mile away and i thought it was a plane and i started to watch it carefully but since i noticed only yellowish lights it couldn't be a plane and it was moving west (wnw) to east (ese). also it was around 1000 to 1500 feet up and then i noticed two separated yellowish\\orange blurry illuminated areas and thought about maybe a helicopter. when it was around 600 feet away, i could see two separate groups of 4 yellowish\\orange lights bobbing\\wiggling around opaque blob with 2 yellowish\\orange lights in the rear of the roundish blob. i then realised this wasn't any helicopter and felt creepy and thought about going back inside but i decided to watch. it was moving silently at about 40 miles an hour just alittle farther then my across the street neighbors backyards. i could see clearly an opaque roundish object maybe 40-60 feet wide and 40-50 long with two separate groups of 4 yellowish\\orange lights bobbing\\wiggling around and 2 wiggling lights in the rear. i watched for the next minute or two moving steadly, silently, towards to south east, until it was to far to see amoung the city lights."],"Latitude":"30.578806","Case Number":"21193","Longitude":"-97.853069","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=30.578806,+-97.853069(21193)&iwloc=A&hl=en\"> mufon case (21193) map </A>","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Date of the Event":"11/10/2009 10:35 UTC","trends":["There have been 5 other sightings in Leander","There were no other sightings in Leander on or around November 10th 2009"],"Country":"United States","Summary":"Round Jelly/blob 10 orange/yellowish round lights wobbling around silent steady speed","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Oval, Other","Object Features":"None","Source":"MUFON","City":"Leander","Region":"Texas"}