{"Longitude":"-121.941537","Summary":"Two submarine air born. One F-117 air born. 75 ft in air. No engines. All not of this world. Enter through a worm hole. We saw this.","files":["/var/www/straped/mufon/html2text/21197.html.txt","/var/www/straped/mufon/org/21197.html"],"Tags":"City","divs":["Sighting DetailsMy son and I were in the back yard of our rental home in Campbell Ca.95008 Olympia avenue October 2000 approximately 12:30 am. We had a fire pit with a fire ouy in the back yard. My son Jace said to me dad look up. As I did I noticed that just at the top of the tree the sky was blocked above us. A flesh colored object above us blocked the night sky. The texture of the base of the object looked like powder coating or a orange skin. The bottom also was channeled. The object moved forward towards the front yard. We ran through the house yelling to my wife to wake up a ufo was over the house. My son and I stopped at the front of the side walk and street. My son was under the front and I about five feet to the right of the front facing NE. The sub shaped ufo moved forward again slowly at about three miles an hour. This unit continued another 100 foot. The front the started to enter through a worm hole. As The front of the ship drove into and not out of the other side until we watched the tail end disappear into nothingness. At the very moment the ship diapered we looked to the right into the air just above another house an we see the same version of the first sub only a side view. Wow !!!. Just sitting in the air. I had a perfect view of the entire ufo. The The front shaped like the submarine in the sci fi show Sea-view. A tail section flush with the rear and wings about three to four feet long and no tip. Within three minutes out of thin air a worm hole. I observed a f-117 fighter appear angle 90 degrees just below the red wood tree line. I thought we would be killed by the crash. The fighter just had enough room to clear the exiting of the worm hole before crashing into the sub ufo. The F-117 did a 90 degree turn and angled out just above the sub. The sub then moved forward eight to Ten feet then stopped. The F-117 did the same. Then they both moved at the same rate of speed three to five moles an hour to across the street NW. just above Dan and Georgies house. They stopped above the house together. Next the air in a 50x60 foot area in front of the crafts started to look like wavy radiant heat and they both faded away at the same moment. I told Dan the next day he laughed. Also his neighbor the astronomer he laughed. I love the history channel. I have wanted to document this story for ten years. Everyone says do not tell this story."],"Country":"United States","Log Number":"US-12272009-0021","Latitude":"37.291565","Weather Factors":"Unknown","City":"Campbell","map":"<A HREF = \"http://maps.google.com/maps?q=37.291565,+-121.941537(21197)&iwloc=A&hl=en\"> mufon case (21197) map </A>","Object Shape":"Other","Date of the Event":"09/30/2000 12:00 UTC","Object Features":"Patterned Surface, Appendage(s), Louvres, Wings, Other","Case Number":"21197","Source":"MUFON","Region":"California","Disposition":"Hoax","Date Submitted":"12/27/2009 09:07 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been 7 other sightings in Campbell","There were no other sightings in Campbell on or around September 30th 2000"],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet"}