{"Disposition":"Insufficient Data","trends":["There have been 9 other sightings in Vineland","There were no other sightings in Vineland on or around January 18th 2009"],"Log Number":"US-12272009-0016","Object Flight Path":"Undisclosed","Region":"New Jersey","Latitude":"39.493927","Date of the Event":"01/18/2009 03:19 UTC","Date Submitted":"12/27/2009 03:30 UTC","Longitude":"-75.020251","files":["/var/www/straped/mufon/html2text/21192.html.txt","/var/www/straped/mufon/org/21192.html"],"Summary":"Triangle, indented at back sort of like boomerang shape, but not as much.","Viewing Distance":"Unknown","Object Shape":"Triangle","divs":["Sighting Details I had fallen asleep in the family room while watching TV in the recliner chair. I was awakened by a bright light shinning in the family room from the sliding glass doors. (there are no curtains on this door). At first I thought I was seeing a full moon, but it seemed to be moving very slowly. I got up and went over to the door and saw that it was a bright light that was moving very slowly toward my house. As it got closer I could see Blue lights on both sides of the large white light. The blue lights were several rows of lights, top to bottom, which made a rectangular shape of lights on each side of the big round light. I stepped out on the deck as this object passed over my head. It was very large, flying very slowly and making a very small humming sound. Not the sound you hear from airplanes. I was spellbound by the blue lights. I was raised in Wichita Kansas, which is The Air Capital, and I have never seen a plane with all blue lights!!! I went to the front door and looked at the flying object as it passed over and could see that the body of the object was dark gray in color (or appeared to be) It also appeared to be triangle in shape with the bright light at the point in front. The back of the object seemed to indent toward the middle a little. Not exactly boomerang, still with triangle look. The next day I heard on CBS news TV station that several people in the western states had reported seeing a blue light streak across the skies. They were told that they had seen a comet streaking across the sky. It was also reported in the news that people in New Jersey had seen something in the sky, but they were told it was weather balloons. The object was flying towards the Atlantic Ocean or bay. I live 30 minutes from the Atlantic Ocean and 20 minutes from the bay. I saw a similar object 38 years ago at 5:30 pm on my way home from work. It was shaped the same and made the same low engine noise, but I did not see the blue lights that time. I saw square lights all around the object in white. They looked liked square windows. But It had the same big round light in the front at the point and the body was shaped the same. This object also moved very slowly. In the paper the next day it was reported that several people and reported seeing this object to the police department in Millville, NJ. I feel this was a UFO. I feel the first one was also a UFO. I did not try to take a picture, I was too interested in just looking at the object. No one believes you anyway, so why try to take a picture. I don't know what weather balloons look like, but I do know this was not a balloon. I know what I saw!!!"],"Tags":"City","City":"Vineland","Case Number":"21192","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.493927,+-75.020251(21192)&iwloc=A&hl=en\"> mufon case (21192) map </A>"}