{"Date of the Event":"06/19/1996 10:00 UTC","Object Flight Path":"Undisclosed","Disposition":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-12272009-0024","divs":["Sighting DetailsIt was my husband's birthday. We were visitng friends who lived in the downtown area,they were sitting on their front step facing South and we were sitting in lawn chairs facing North. Out of the corner of my eye something caught my attention. I glanced up at the same instance as my husband and we saw a huge black boomerang shaped object silently glided overhead going in a East to West direction, slighty to the North of our location. There were 5 white lights on the bottom of the craft. The lights were evenly spaced. The object was not shiny but dense. Neither my husband or I can approximate the distance between the object and our location. We had no other idea of what the object could have been other than a U.F.O. as it ws unlike anything we have ever seen before. we lost sight of the object in the treeline.The entire event lasted a matter of seconds. We were both in disbelief and didn't say anything to our hosts. Later we talked about it and both saw the exact same thing. Recently we watched a show that had a video and witness accounts that were identical to what we saw. We are hoping to find some answers as to what we witnessed."],"Date Submitted":"12/27/2009 11:05 UTC","trends":["There have been 24 other sightings in Grand Junction","There was one other sighting in Grand Junction on or around June 19th 1996"],"Country":"United States","files":["/var/www/straped/mufon/html2text/21200.html.txt","/var/www/straped/mufon/org/21200.html"],"Case Number":"21200","Sighting Duration":"Undisclosed","Summary":"Silent, black boomerang glides overhead.","Longitude":"-108.544349","Latitude":"39.06946","map":"<A HREF = \"http://maps.google.com/maps?q=39.06946,+-108.544349(21200)&iwloc=A&hl=en\"> mufon case (21200) map </A>","City":"Grand Junction","Object Shape":"Boomerang","Weather Factors":"Unknown","Region":"Colorado","Tags":"City"}