{"Weather Factors":"Unknown","Case Number":"21201","files":["/var/www/straped/mufon/html2text/21201.html.txt","/var/www/straped/mufon/org/21201.html"],"Summary":"continous and eventful sightings of UFO's at high altitudes doing training manevours around flashing buoys every single night since 2001","divs":["Sighting DetailsI have been noticing an amazing event for some time now. The first time I saw these craft(s) I thought we were being invaded! I was outside on a cold winter night and happend to look up to see if I could see a meter or satalite and saw the objects. The objects looked like a satalite moving thru the sky but with change in direction and speed then suddenly stopping a taking off again. The light of the craft gets brighter as it accelerates in speed. The speed is fast (horizon to horizon in 5 sec.). Estimated to be at 100 to 300 thousand feet in the air (way above conventional aircraft). The next thing I noticed is that there were more of them. One following the other in a crooked single line fashion from one end of the horizon to the other. They traveled a few seconds apart from each other. Each doing there oun thing. Some did circles in the sky and some look like they were lost up there. As years (yes. YEARS!) have gone by I kept seeing them. Not saying anything to anybody. They don't stop there daily routine training. Reason I say training is I believe that is what is going on up there. Upon watching these things almost daily (mostly at night) and on holidays and weekends , I noticed several strange things take place. There is a craft that seems to spit them out one right after another. Like tracers out of a gun. The have other craft that act like bouys to guide them on course and keep them in a type of airial track. These craft have a beacon flash. Any of the craft get lost, they flash a beacon. Some nights I see experienced pilots operating them doing fantastic displays of airial stunts circles sig saging direct reversal etc. and then the next night see pilots who have no idea how to run the thing. Formations of several can take place and they move across the sky like the blue angels. I have tried to capture film footage, but special equipment is needed. One night I tried to count the craft and stopped and gave up at 128. I think there are more than that, but if it is a course or track I may have counted them several times over. The course they travel is beyond the horizon to the east and they come form the north usually. Sometimes they have seperate courses. My house seems to be at the dividing line between the two courses. If anyone wants to see these things I live near Fort McCoy and Camp Douglas air force base. They are an amazing craft. I would like some closure on this issue. I don't speculate much but I feel someone is definatly hiding something from the public. I'm pretty confident we are not being invaded. At least by what I am seeing. One more thing. I have almost perfect eyesight and have had a doctor check my eyes several times over with no problems and I know that what I see is real and I see the UFO's every single night I look up. Back in 2008 Football season I went to see the packers play a Lambough Field in Green Bay. I stayed a hotel about 40 minutes away from the statium and happend to look up and I saw them there too. To be keen on seeing these crafs is to stare at a constellation for a while (2-3 minutes) so to adjust your eyes to the darkness. stare at the dark part of the sky an soon you will see them come across the sky, note where they cross a star pattern and within a few seconds another will cross the same path. If you can see the space station cross the sky with your bare eye you can definatly see these things. They may be above your sky at night as well. For all I know, across the whole world. Some sighting I have read and know of sound similar to what I see. I have never seen these crafts up close. color is only white. the craft that spits them out I have only seen a couple of times and it appears to be a orange or red color much like a planet would be. I sometimes mistake them for a star (especially when they are not moving)."],"Longitude":"-90.811332","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Sighting Duration":"12:59:59","Source":"MUFON","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.951313,+-90.811332(21201)&iwloc=A&hl=en\"> mufon case (21201) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-12272009-0025","Date Submitted":"12/27/2009 11:48 UTC","City":"Sparta","Region":"Wisconsin","Object Shape":"Flash, Star-like","Disposition":"Unknown","Date of the Event":"12/27/2009 09:00 UTC","Latitude":"43.951313","trends":["There have been 2 other sightings in Sparta","There were no other sightings in Sparta on or around December 27th 2009"],"Country":"United States","Tags":"City"}