{"Longitude":"-95.36562","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around March 31st 2008"],"Weather Factors":"Unknown","Object Flight Path":"Stationary","Log Number":"US-12282009-0005","Viewing Distance":"101-500 Feet","Object Features":"Dome","Date of the Event":"03/31/2008 12:00 UTC","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Disk motionless, silent, brilliant sheen, size of a 2 engine plane, over a subdivision 15 minutes nw of houston on 290 for 10 minutes then dissapeared","map":"<A HREF = \"http://maps.google.com/maps?q=29.766073,+-95.36562(21206)&iwloc=A&hl=en\"> mufon case (21206) map </A>","Region":"Texas","City":"Houston","Tags":"City","Latitude":"29.766073","divs":["Sighting DetailsMy mom ( 90) and I were going to brenham tex. to see the bluebonnets and take pictures. Left Houston on 290 heading nw about 15 minutes out from houston. I was driving and off to left above a subdivision( around noon) I said to Mom ---Look at that plane. After a short time Mom said that's not a plane-it's not moving. I said it's probably flying directly toward us. After looking myself I realized it wasn't moving and had a brilliance( like a bright sun reflection) but more brilliant. As drove closer saw it was sort of disc shaped, silver grey in color, had a round like top, edges came to a point. About the size of a 2 engine plane. No sound totally motionless. Drove until it was directly to the left of car. Then it just blinked out. Vanished. If it flew-was too fast to see. I felt funny while watching this thing. Either just before it blinked out or just after I thought I will pull car over and take pictures. Mom had camera in lap and mine in the seat. So weird that we didn't think of that right away. Pulled car over. Got out of car with cameras but gone. Looked all over in sky and could not see any craft. Day was total sunshine. Possibly my daughter could remember the exact day as she also went to same place to take pictures of flowers. Just thought- the pictures we took of flowers should have the date. They are at my Mom's , so if needed I could get the date. My daughter took same route and never saw anything. Mom used to be the worlds greatest skeptic. Have no idea what it was. The event was very very strange."],"Source":"MUFON","Date Submitted":"12/28/2009 04:24 UTC","files":["/var/www/straped/mufon/html2text/21206.html.txt","/var/www/straped/mufon/org/21206.html"],"Disposition":"Unknown","Case Number":"21206","Object Shape":"Disc"}