{"Date Submitted":"12/28/2009 05:46 UTC","Object Shape":"Circle","Object Features":"None","divs":["Sighting DetailsMy husband and I lived on the Tonaho Odom Indian Reservation which is south of Casa Grande,Az. At the time I was working as a nurse at the federsl prison in Florence approx. an hours drive from home. I had worked late and was coming home at approx. 1 AM. About 5 miles after turning onto Indian 15 I went through a small canyon. Upon exiting the canyon I saw 10 circular lights in the east. They looked somewhat like the ball flares that are used by the military, but they manovered in a way that ball flares cannot. They zig-zaged , joined in a circle and moved like a snake. I stopped the car and got out to get a better view, and watched the manovers for approx 5 minutes. I then heard a \"whooshing \" sound and looked to my left. I then saw a red light scanning the desert floor around the mountain. I looked to my right and saw the shadow of what looked like a blackhawk helicopter coming around the mountain. It also had a red laser looking light scanning the desert. My husband is a former Marine and I know what a blackhawk looks like, I got into my car and went home. It was almost 3 AM when I arrived home which was about 2 hours longer than normal. I only stopped for about 5 minutes and I was only 20 minutes from home What Happened?"],"Weather Factors":"None","Summary":"10 circular objects","Latitude":"32.885702","Longitude":"-111.753452","Region":"Arizona","Viewing Distance":"Unknown","Case Number":"21207","Log Number":"US-12282009-0006","Date of the Event":"10/12/2002 01:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/21207.html.txt","/var/www/straped/mufon/org/21207.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.885702,+-111.753452(21207)&iwloc=A&hl=en\"> mufon case (21207) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Source":"MUFON","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around October 12th 2002"],"Tags":"City","City":"Casa Grande"}