{"Summary":"transparent triangle about a mile in length, one single/dim light in front.","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around October 30th 2009"],"Tags":"City","Sighting Duration":"00:03:00","Country":"United States","Latitude":"27.777926","City":"St Petersburg","divs":["Sighting Details I went out to my backyard to have a cigerette. I get alot of airplanes fron Tampa & Saint pete airport that fly over my house, they are normally very low and make noise.As I stood out back looking up the clouds, that were moving from west to east in large patch's.Comming from above the clouds from the north I saw a large triangle almost the same light gray color as the clouds. I watched it slowly change to the darkness of the sky.By the time it was directly over my house I would have never seen it unless I was looking directly at it. It was a giant triangle about a mile from tip to tip. It had a very dim light on the front. As it went over the stars the stars disapeered. I watched it as far as I could untell it disapeered over the clouds to the south. The time it took from north to south was about three min. very slow moving. I was so shocked on what I just saw, I went into the bedroom where my wife was asleep I woke her up and told her what I saw. I had goose bumps on my arms and my eyes were tearing slightly with excitement. I am 40 years old I have never been sure about UFO's, but finally I know. I know. I am sure what I saw. I know."],"Log Number":"US-12282009-0002","Region":"Florida","Date Submitted":"12/28/2009 02:22 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Date of the Event":"10/30/2009 02:30 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/21203.html.txt","/var/www/straped/mufon/org/21203.html"],"Case Number":"21203","map":"<A HREF = \"http://maps.google.com/maps?q=27.777926,+-82.63075(21203)&iwloc=A&hl=en\"> mufon case (21203) map </A>","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-82.63075","Source":"MUFON"}