{"Longitude":"-115.164406","Object Flight Path":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=36.120376,+-115.164406(21218)&iwloc=A&hl=en\"> mufon case (21218) map </A>","Viewing Distance":"Unknown","Object Features":"Undisclosed","divs":["sighting detailsat approx 4am i was a few blocks east of the las vegas strip on a security guard site. i was looking at the top dead center of the sky in hopes of seeing both meteors from the leonid showers and also watching for satelites passing over [they do that an hr before dawn] i saw a very bright meteor pass from s\\e to n\\w near the top of the sky but at the same time, unrelated to the meteor, i noticed an egg or football shaped object float from north to south. it was metallic and gold colored. i observed the strip casino lights reflecting off the bottom as it moved further south. i estimate it's size to be 3x that of an airliner and flying at about the same height but a faster speed. i watched very intently as i knew when it got to the south part of town there would be no more bright ground lights to illuminate it. there were no lights coming from the object and it was silent. i'm guessing it was a secret usaf vehicle being tested from area whatever down to the edwards afb. later on that morning i rememberd seeing a photo posted on the old art bell ufo pages of the \"las vegas ufo\" the poster had an aol address is all i remember. the photo was exactly what i saw but my sighting was of the object traveling not like a football end to end but sideways. the \"las vegas ufo\" photo was posted at around 97' and at the time i thought it was a fraud and was actually the sanyo blimp. but on the night i mentioned i saw it for real. that was my one and only ufo sighting in my entire life, 65 yrs at this writing."],"Date Submitted":"12/28/2009 01:45 UTC","City":"Las Vegas","Region":"Nevada","Sighting Duration":"Undisclosed","Case Number":"21218","Log Number":"US-12282009-0017","Date of the Event":"10/31/1999 12:00 UTC","Source":"MUFON","Summary":"Las Vegas UFO","Latitude":"36.120376","Country":"United States","Object Shape":"Egg","files":["/var/www/straped/mufon/html2text/21218.html.txt","/var/www/straped/mufon/org/21218.html"],"trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around October 31st 1999"]}