{"files":["/var/www/straped/mufon/html2text/21216.html.txt","/var/www/straped/mufon/org/21216.html"],"trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around July 21st 1985"],"City":"Prescott","Object Features":"Window(s), Insignia","Longitude":"-112.461052","Object Flight Path":"Stationary,Path then hovering","Region":"Arizona","divs":["Sighting DetailsON FRIDAY EVENING AT THE WALNUT CREEK HEADQUARTERS OF THE K-4 CATTLERANCH IN YAVAPAI COUNTY ARIZONA..APPROXIMATELY 74 MILES OUTSIDE OF PRESCOTT ARIZONA..AT THE BASE OF INDIAN HILL..WHILE WORKING ON CATTLE TRAILER AND WORK TRUCK IN MAINTENANCE BARN...I WAS CALLED OUTSIDE BY THREE RANCH HANDS AND THEIR FAMILIES AT ABOUT 9:00 PM IN THE EVENING ON JULY 21ST. 1985 -TO LOOK AT OBJECT MOVING AT SNAILS PACE OVER TOP OF MAIN HOUSE FROM THE EAST. THAT WAS OVER ONE HUNDRED YARDS LONG TRIANGLE SHAPED WITH THREE HUGE BRIGHT BLUE LIGHTS ON THE BOTTOM...WITH SMALLER PORT HOLE LIKE LIGHTS ALL THE WAY AROUND OBJECT. THE OBJECT MADE NO ACTUAL NOISE...AND CAME TO STANDSTILL RIGHT OVER MAIN RANCH HOUSE. THE CATTLE AND HORSES BECAME VERY QUIET..BUNCHING UP IN CORALS AND FIELDS..AS FAR FROM IT AS THEY COULD GET. PLUS, THE HERD DOGS-WHOM NORMALLY ALERT BY BARKING-MADE TRACKS TO HAY BARN AND BURIED THEMSELVES IN THE HUGE STACK OF HAY BAILS. I WENT TO MY HOME AND GOT MY WIFE AND OUR DAUGHTER TO SEE THIS WEIRD THING...WHILE I GATHERED MY FAMILY I RETRIEVED MY RIFLE AND PISTOL..ALONG WITH MY FELLOW RANCH HANDS..AND THEIR FAMILES...WE STOOD THERE LOOKING AT THIS THING...MY WIFE TOOK PICTURES WITH OUR CAMERA..WHILE OTHERS SNAPED PHOTO'S TOO! THEN WITHOUT EXCEPTION WE FOUND OURSELVES IN OUR HOMES..WAKING UP (WHAT WE THOUGHT WAS THE NEXT MORNING)...BUT, IT WASN'T...(IT WAS THREE DAYS LATER)-OUR BOSS (THE OWNER) PAID US OUT TACK AND WAGES THINKING IT ONE DATE. WHEN WE WENT TO TOWN...WE DISCOVERED IT WAS NOT THE DAY WE THOUGHT. AS WE GET PAID REGURLY ON A CERTAIN DATE AND BY APPROXIMATELY FROM 600.OO TO $800.00 DOLLARS OF GROCERIES..ALL AT ONE TIME...THE LOCAL STORE KEEPS CASH ON HAND TO CASH OUR CHECKS (AS BY THE TIME WE GET THERE THE BANKS ARE CLOSED.) HAVING TO TRAVEL OVER ROUGH MOUNTAIN ROADS TO END OF PAVEMENT (AS WE REFERED TO IT)..ABOUT 44 MILES OVER ROUGH WASH BOARDED...POT HOLED..DIRT ROADS..UNTIL YOU HIT ASPHALT OUTSIDE OF PRESCOTT. THE STORE EMPLOYEE'S HAD EXPECTED US TWO DAYS PRIOR..SHOWED US THAT DAYS NEWSPAPER...(AS WE JUST STARRED AT EACH OTHER IN DIS-BELIEF)...BUT, WE WEREN'T ALONE...WALNUT CREEK STATION HAS FOUR RANCH HEADQUARTERS LOCATED IN TINY VALLEY AND ONE FOREST SERVICE FIRE JUMP FIRE-FIGHTER'S FACILITY THERE. AT THE BASE OF INDIAN HILL SURROUNDED BY ENSCARPMENT LIKE VOLCANIC MESA'S. THE STORE EMPLOYEE OR NIGHT MANAGER TOLD US WE WERE PART OF A STREAM OF PEOPLE WHO WORKED IN WALNUT CREEK THAT SHOWED UP ON THE WRONG DAY TO BUY OUR MONTHLY STOCK OF FOOD...AND THE LOCAL FEED STORE REPORTED THE SAME STRANGE EVENT. AS DUSTY OLE COWBOYS AND THERE FAMILES CAME TO BUY TACK..CLOTHS..BOOTS..SHIRTS...BARB WIRE...ECT. SINCE THEN THE RANCH HANDS WIVES MOVED INTO TOWN HOUSES..PERNMANTLY BOLTING DOWN WINDOWS...PLACING DEAD BOLTS ON DOORS...EVEN INSIDE BATHROOM DOORS..BEDROOM DOORS..BUYING PISTOLS..AND BIGGER MEANER DOGS..(THEIR CHILDREN AFFRAID..AND THEM..AFTER FINDING STRANGE MARKS ON THE BOTTOM OF THE KID'S BACKS AND BY THE BELLY BUTTON ..INCLUDING THEMSELVES..THE MEN STRANGE MARKS NEAR THEIR KNEE'S. SOME OF THE MEN'S WIFE'S REFUSED EVER TOO RETURN MUCH LESS SPEND THE NIGHT IN WALNUT CREEK...EVER AGIN. YOU SHOULD NOTE: WE HAD RASH OF CATTLE MUTALATIONS..ABOUT SAME TIME..MAINLY PREGNANT COWS..THE CALF LAYING THERE STILL IN THE BIRTHIN' SACK..BUT, THE MOM CUT TO PIECES. THEIR REAR END JUST GONE..EYE'S..TONGUE..GUTS...JUST GONE. AND HARDLY ANY BLOOD. WHAT WAS REALLY STRANGE WE ALL SEEMED TO JUST FORGET ABOUT IT..NEVER DISCUSSING IT..UNTIL THE FLAP OVER PHOENIX..SAME KINDA' CRAFT..APPEARED OVER PRESCOTT..CHINO VALLEY..MAYER..HEADING NORTHWEST TOWARD WALNUT CREEK. SINCE THEN THEY'VE BEEN SEEN JUST ABOUT EVERY YEAR..AROUND THE 21ST. OF JULY..RAIN OR SHINE. OH YEAH- THE DIGITAL CAMERA'S DID NOT WORK -BUT -THE OLD INSTAMATIC'S PICKED UP BIG BLUR...SHAPED LIKE TRIANGLE..! THAT'S ABOUT IT..PERHAPS YOU CAN EXPLAIN HOW WE LOST THAT TIME."],"Weather Factors":"None","Date Submitted":"12/28/2009 12:31 UTC","Log Number":"US-12282009-0015","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.545324,+-112.461052(21216)&iwloc=A&hl=en\"> mufon case (21216) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Case Number":"21216","Object Shape":"Triangle","Source":"MUFON","Latitude":"34.545324","Date of the Event":"07/21/1985 09:00 UTC","Disposition":"Unknown","Summary":"TRIANGLE SHAPED UFO VISITED RANCH HEADQUARTERS","Tags":"City"}