{"Log Number":"US-12282009-0010","Date of the Event":"07/25/2005 02:04 UTC","Viewing Distance":"101-500 Feet","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around July 25th 2005"],"Object Features":"None","Latitude":"45.526732","Object Shape":"Triangle","Date Submitted":"12/28/2009 07:33 UTC","Case Number":"21211","Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.526732,+-122.669127(21211)&iwloc=A&hl=en\"> mufon case (21211) map </A>","Source":"MUFON","City":"Portland","Weather Factors":"None","divs":["Sighting DetailsMY SON AND I SAW A BLACK TRIANGLE IN SKY RIGHT ABOVE US. WE WERE IN OUR POOL BECAUSE IT WAS HOT AND WE COULDN'T SLEEP. MY SON, WHO WAS ABOUT 11 AT THE TIME SAID \"LOOK AT THAT MOM, WHAT IS THAT?\" HE TOLD ME TO LOOK UP AND WE SAW A VERY QUIET, NO NOISE AT ALL, TRIANGLE SHAPED OBJECT THAT BLOTTED OUT THE STARS. IT WAS REALLY LOW, I COULD SEE THE PINE TREE TOPS ABOVE IT WHEN IT WENT OVER. IT WAS MAYBE A HUNDRED OR TWO HUNDRED FEET ABOVE THE POWER LINES. THE OBJECT LOOKED AS IT WAS FLOWING LIKE FLAG MATERIAL IN THE WIND. IT IS HARD TO DESCRIBE. IT'S PATH WAS STRAIGHT AHEAD. IT MOVED PRETTY SLOW ABOUT 10 MILES AN HOUR. IT WENT RIGHT OVER OUR HOUSE. WHEN I MENTION THIS TO MY SON HE DOESN'T LIKE TO TALK ABOUT IT. I THINK IT REALLY SCARED HIM. IT IS NICE TO HEAR THAT MAYBE SOMEBODY ELSE HAS SEEN THIS. I THOUGHT MAYBE IT COULD HAVE BEEN A HANG GLIDER WHEN I THOUGHT ABOUT IT LATER, TRYING TO MAKE SENSE OF WHAT WE SAW, BUT WHO WOULD BE CRAZY ENOUGH TO HANG GLIDE OVER POWER LINES AT 2 IN THE MORNING? I DON'T REMEMBER HOW WE LOST SIGHT OF IT. I THINK IT JUST KEPT GOING THE DIRECTION IT WAS HEADED. I THINK WE WERE IN SHOCK. I DID DRW A PICTURE OF WHAT WE SAW THAT NIGHT TO REMEMBER. IF I FIND THE DRAWING I WILL SEND IT TO YOU."],"Summary":"MY SON AND I SAW A BLACK TRIANGLE IN SKY","Region":"Oregon","files":["/var/www/straped/mufon/html2text/21211.html.txt","/var/www/straped/mufon/org/21211.html"],"Tags":"City","Object Flight Path":"Straight-line path","Longitude":"-122.669127","Disposition":"Unknown"}