{"Region":"North Carolina","Longitude":"-81.532115","Date of the Event":"12/17/2009 08:45 UTC","Log Number":"US-12282009-0027","City":"Lenoir","Summary":"Low-flying craft with two side-by-side large turquoise lights and smaller blinking (alternating) red lights at front and back.","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.91585,+-81.532115(21228)&iwloc=A&hl=en\"> mufon case (21228) map </A>","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"12/28/2009 07:11 UTC","divs":["Sighting DetailsOn December 17, 2009, my sister and I spoke with a MUFON field investigator about our December 9 report file, mainly based on strange orange orbs we had sighted several times over past couple months. About an hour after getting on the phone with the investigator, appr. 8:45pm, we heard what sounded like a helicopter nearby, so we went on the front porch and looked to see the strangest craft we have seen out of all of our sightings. It appeared to be even lower than a skyscraper, and it was definitely within a mile from where we standing. There were two large turquoise lights side-by-side, and smaller red lights that alternated steady blinking at the front and back. All the lights appeared to be on the same plane, meaning they all were level. It moved slowly, and it was heading south to north. It was dark so we couldn't make out a shape, just the lights. Ever since, we haven't seen any other phenomenon, including the orange orbs, which is very strange because we were seeing the orbs almost every night. We have looked online and can find nothing about turquoise lights like these on typical aircraft, or even ufos. We absolutely want help explaining this because now we know for sure that this is something else."],"Source":"MUFON","Object Shape":"Unknown","Country":"United States","Case Number":"21228","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/21228.html.txt","/var/www/straped/mufon/org/21228.html"],"Latitude":"35.91585","Disposition":"Unknown","trends":["There have been 6 other sightings in Lenoir","There were no other sightings in Lenoir on or around December 17th 2009"]}