{"Longitude":"-122.079341","Latitude":"37.391242","files":["/var/www/straped/mufon/html2text/21226.html.txt","/var/www/straped/mufon/org/21226.html"],"Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","divs":["Sighting DetailsGoing eastbound, I noticed out left had window a grey object circular going toward moffet field SFO line. The bottom of the object had a textured surface similar to egg crate (It had many smaller inverse domes going around the circular grey shape). I found it facinating that I was watching this thing go over in broad daylight approx. 1,000-2,000 ft. off the ground going over a major highway. It was high enough up to be the same altitude as incoming 747 headed toward SFO on approach but had no wings that I could tell, though it was going the same speed of an incoming airliner. It 'floated' past and I was so astonished, I forgot to pull out the cellphone and grab a pic, plus trying to concentrate driving in morning traffic. When first noticed the object, My immididate reaction was this was extraterrestial. I know airplanes and this wasnt one. After sighting I thought I must have just somehow seen something either astonishing or was plain mistaken somehow. I didnt think anyone would believe me if I did report it anyway. I lost site of the object behind trees as the freeway dipped in elevation by a golf course."],"Date Submitted":"12/28/2009 06:16 UTC","Weather Factors":"Unknown","Case Number":"21226","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date of the Event":"12/21/2009 09:00 UTC","Region":"California","trends":["There have been 10 other sightings in Mountain View","There were no other sightings in Mountain View on or around December 21st 2009"],"Summary":"Traveling 237 eastbound past Moffett Field exit a cirular grey object overhead","Object Features":"Dome, Patterned Surface","Object Shape":"Circle, Disc, Oval","Disposition":"Unknown","Log Number":"US-12282009-0025","Tags":"City","City":"Mountain View","map":"<A HREF = \"http://maps.google.com/maps?q=37.391242,+-122.079341(21226)&iwloc=A&hl=en\"> mufon case (21226) map </A>"}