{"trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around December 25th 2009"],"Object Flight Path":"Straight-line path","Log Number":"US-12282009-0026","divs":["sighting details it was christmas night 2009 and i was on my front patio looking through my new telescope at the night sky. the street in front of our house runs straight into the beach, so i have a 100% view directly down the street. anyway, i was looking around and i happened to look toward the beach. i saw an orange light which i thought was a plane making a slow decent, but it took a really long time to get near the shore and it had no blinking lights. once it got between my house and santa catalina island, it made a banking turn and discharged 3 burning things, which all burned the entire way down to the ocean. when it turned, i happened to catch the slightest glimpse of it. it was silver like brushed aluminum, not shiny. it looked like a rounded, silver stealth bomber, or like the number 3. the orange glow was heat coming off of it. once the 3 items had been discharged, it took about 3 seconds for the craft to vanish towards the port of los angeles\\long beach. it was directly over the scattered off-shore oil-rig field. someone or some surveillance camera had to have seen it. earlier this year in january 2009 i had reported a similar sighting just south of here, in newport beach. in that case the craft was sitting still and emitting \"lots\" of burning debris in a similar fashion. i cannot believe that being this close to the beach, and so close to so many beach communities, that no one else saw either one of these incidents. thank you."],"Date Submitted":"12/28/2009 06:23 UTC","Tags":"City","Latitude":"33.669777","Weather Factors":"None","Summary":"A silver, rounded \"Stealth Bomber-like\" craft. Boomerang with an additional point in the middle, like yhe number 3.","Longitude":"-117.993066","Region":"California","Country":"United States","Case Number":"21227","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.669777,+-117.993066(21227)&iwloc=A&hl=en\"> mufon case (21227) map </A>","Date of the Event":"12/25/2009 11:45 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21227.html.txt","/var/www/straped/mufon/org/21227.html"],"Source":"MUFON","Object Shape":"Boomerang","Object Features":"Unknown","City":"Huntington Beach"}