{"Longitude":"-76.086034","Latitude":"43.644235","Source":"MUFON","City":"Sandy Creek","map":"<A HREF = \"http://maps.google.com/maps?q=43.644235,+-76.086034(21220)&iwloc=A&hl=en\"> mufon case (21220) map </A>","trends":["There have been no other sightings in Sandy Creek","This sighting has never been favorited."],"Summary":"3 nights before Pheonix lights in Upstate New York","Region":"New York","Case Number":"21220","Date of the Event":"09/30/1997 12:00 UTC","Date Submitted":"12/28/2009 03:39 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Other","Country":"United States","Object Flight Path":"Undisclosed","Log Number":"US-12282009-0019","files":["/var/www/straped/mufon/html2text/21220.html.txt","/var/www/straped/mufon/org/21220.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI run a paper route in northern oswego county, my boundry is lake ontario. I was heading east from the lake and noticed some very bright amber lights to my left up over a hill that was there, I didn't pay that much attention to it at first because it is a very rural area and I thought it was someone building a camp or something and had some really good lighting. I remember it was a very cloudy night after a rain with a really low cloud ceiling. I drove about a mile and a half and the lights started to go up in the sky. Needless to say I stopped my car and just watched, there were six lights in a rounded line really bright amber then they started moving all over the place. At first I thought it was one big thing and then I realized it was many things making many shapes in the sky. I then got a cold chill and headed for town because I got scared. I almost headed for home because I thought it was some kind of invasion but then the lights went back into it's original shape and took off for the sky way up high, because until then they were really low to the ground, probably not more than a few hundred feet. I decided to finish my route and looked up one more time to see this whatever it was being chased by some really fast jets. There was no sound. I listened to the news for a few days after that and I did here one report from a couple down in Mexico Point New york, which is just a few miles from were I was. Some of the other carriers saw it but we never tol anyone else because they all roll there eyes at you. So thats my story there are other things I have seen around that lake but people think Im nuts so I keep it to myself."],"Sighting Duration":"Undisclosed","Disposition":"Unknown"}