{"Date Submitted":"12/28/2009 05:15 UTC","Weather Factors":"Does Not Apply","Longitude":"-81.370526","Region":"Florida","Source":"MUFON","Disposition":"Insufficient Data","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsDriving home from evening college course which ended at 9PM. Traveling East on West Oak Ridge Road where Oak Ridge crosses Florida Turnpike. Because I was going up the approach of the bridge, I had a better than average view of the Eastern sky. What I saw was a string of multicolored lights traveling across the sky from SE to NW. They were not brilliant lights. More like an LED behind a frosted lens. I pulled to the roadside after passing over the bridge and got out to get a better look. The lights were by this time directly overhead. They were absolutely noiseless. The object had a cylindrical body but did not have a sharp outline. The outside edges appeared to be slightly blurred or fuzzy as might be observed if the object were behind frosted glass. They eventually disappeared to the NW. Duration of event: 3-4 minutes. Observation: West Oak Ridge Road is a busy four lane road. It was busy for the entire duration of this event yet no one seemed to notice it. Not surprising as most drivers will be looking at the road ahead and not up into the night sky. I have never reported this sighting as I didn't expect anyone to take it seriously. After seeing the picture of the same UFO on the Coast-to-Coast website I was prompted to submit this report as evidence to support the picture."],"Summary":"String of lights 100M+ long 300-500M altitude.speed <50Knots, silent on course 340 degrees","map":"<A HREF = \"http://maps.google.com/maps?q=28.540196,+-81.370526(21224)&iwloc=A&hl=en\"> mufon case (21224) map </A>","City":"Orlando","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around May 31st 1972"],"Object Features":"None","Country":"United States","Case Number":"21224","Object Flight Path":"Straight-line path","Object Shape":"Cylinder","Latitude":"28.540196","files":["/var/www/straped/mufon/html2text/21224.html.txt","/var/www/straped/mufon/org/21224.html"],"Date of the Event":"05/31/1972 09:00 UTC","Log Number":"US-12282009-0023"}