{"Date Submitted":"12/28/2009 03:51 UTC","Date of the Event":"11/30/2007 12:00 UTC","Tags":"City","Country":"United States","Object Flight Path":"Undisclosed","divs":["Sighting Details\"Narrative below was submitted by MUFON Dispatch for witness based on phone conversation with witness.\" Witness was in car driving, when she noticed she was running out of gas, so she parked the car. It was dark out and then she noticed over her shoulder a big white light not moving. She also noticed tow smaller red lights that were connected to the white light, blinking. She could see airplanes in the distance, but could hear no sound from this object. It continued to hover, then it started going up and down. The white light was going on and off, then it started to move. Telepathically, she asked to see the color green and she said she then saw a green light appear. She drove home and went into her bathroom and called her boyfriend and told him about the event. The next day, she saw an object that looked like a white balloon, but knew it wasn't a balloon because of the way it moved in a horse-shoe pattern. The object then turned a silver color. She said she received a telepathic communication that softly said, \"You forgot to tell him about the white light.\" Later, she called her boyfriend and asked his if she told him about the white light, and he responded that he didn't think she mentioned anything about a white light."],"Summary":"Big white light hovering with two smaller red lights attached to it.","Object Shape":"Unknown","Object Features":"Undisclosed","Case Number":"21221","City":"Los Angeles","Sighting Duration":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around November 30th 2007"],"Weather Factors":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.190234,+-118.374016(21221)&iwloc=A&hl=en\"> mufon case (21221) map </A>","Region":"California","Latitude":"34.190234","Viewing Distance":"Unknown","Log Number":"US-12282009-0020","files":["/var/www/straped/mufon/html2text/21221.html.txt","/var/www/straped/mufon/org/21221.html"],"Source":"MUFON","Longitude":"-118.374016"}