{"Date of the Event":"12/28/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.994092,+-90.241743(21232)&iwloc=A&hl=en\"> mufon case (21232) map </A>","City":"Kenner","Log Number":"US-12292009-0001","Sighting Duration":"Undisclosed","Summary":"saw 2 circle shaped objects - one large, one small close up - directly overhead was a small object that could not be made out clearly","files":["/var/www/straped/mufon/html2text/21232.html.txt","/var/www/straped/mufon/org/21232.html"],"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsAs I walked out my front door (looking to the north east) I noticed two very bright goldish lights behind a tree that is two blocks over. They were very bright and I never recalled seeing them before. As I walked on side of my house I kept thinking about what it could be. I was thinking maybe it is from the local playground, but I realized that the playground is about 3 blocks to the right. I walked back to the front of my house by the door and kept looking at them. They were very bright so I was thinking they looked like planets but they were too low in the horizon. I kept staring at them trying to make them out. Then, I could tell one was larger than the other. The larger light started slowly moving up. At first it was so slow it was like it wasn't moving. I live near the airport so I was thinking it could be a plane or helicopter but it wasn't moving like one. It was moving very slowly. As it started moving closer to me I could see it more clearly coming over the house across the street. I was totally fixated on it. It was like a circle with three large lights in the center and an outer edge of a few lights but a tranclucent looking circle edge extended past the lights. The lights now looked more off white in color. I did not know what I was seeing. I noticed the smaller one started to move as well taking the same path as the first one. I ran inside to get my camera, and my cousin came out of the house with me. By this time, the large one was gone. I pointed out the smaller one and he could see it clearly. It was moving more slowly than the first one. I tried to turn my camera on but my battery shut it off right away. I looked around for the large one but could not see but I did notice a red light moving oddly way up in the air. It was too small to make out. I am not sure about that one. The second object was now almost directly overhead moving to the west just like the larger one. My cousin tried to record it with his phone but we could not get the image to record. It was also shaped like the first but with only a single light in the center. It was about half the size of the first one. After it flew overhead, we could no longer see it because is started moving faster. Neither object made a sound at all. I am used to hearing planes and see them on a daily basis. This was not on the normal flight path and made no noise at all. I know it was not a plane or helicopter. It was moving like it was traveling more north west towards the lake after it passed my house away from the airport (it took like a curved path). I drew pictures but have not scanned them yet to upload. The large one was about the size of a large airplane and the small one half that size."],"Latitude":"29.994092","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Tags":"City","Region":"Louisiana","trends":["There have been 3 other sightings in Kenner","There were no other sightings in Kenner on or around December 28th 2009"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Longitude":"-90.241743","Date Submitted":"12/29/2009 12:52 UTC","Disposition":"Unknown","Country":"United States","Case Number":"21232","Object Shape":"Circle, Disc"}