{"Country":"United States","Region":"Nevada","Object Features":"None","Longitude":"-118.771283","files":["/var/www/straped/mufon/html2text/21236.html.txt","/var/www/straped/mufon/org/21236.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Log Number":"US-12292009-0005","Date of the Event":"08/07/2009 11:00 UTC","divs":["sighting detailswe were in our yard on lahontan dam rd in fallon nv late july-or early aug. the sky was dark and clear. at any given time of day or night one can lookout in the sky and see 3 fallon air station jets\\planes in the air over the fallon, silver springs, lake lahontan areas. they have red and white lights. that night i saw come over the mountains direcly behind our property, a huge glowing white craft flying parallel to the horizon rather than upward. i could see 3 navy planes rounding up to try to follow it but they were not fast enough and as the large craft kept going, it vanished but without actually flying too far away for me to see, it just plain vanished. this craft moved so fast it had a huge long \"trail\". the craft dwarfed the navy planes. like 3 mosquitoes chasing a large watermelon, so to speak. it was amazing to witness such a sight. of course the navy planes were still visible long after the craft disappeared. i was too awestruck for those few seconds to tell my husband to turn around and look--and then it was over."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.482102,+-118.771283(21236)&iwloc=A&hl=en\"> mufon case (21236) map </A>","trends":["There have been 4 other sightings in Fallon","There were no other sightings in Fallon on or around August 7th 2009","This sighting has never been favorited.",""],"Date Submitted":"12/29/2009 03:02 UTC","Case Number":"21236","Disposition":"IFO","Weather Factors":"None","Sighting Duration":"00:00:04","Latitude":"39.482102","Summary":"huge brightly illuminated disc being followed by 3 Fallon NV Naval Air Station fighter jets which then vanished without moving out of visible sight, but the navy planes were still clearly visible","Source":"MUFON","Object Shape":"Disc","City":"Fallon","Object Flight Path":"Straight-line path"}