{"Weather Factors":"Unknown","Longitude":"-80.062568","Object Features":"None","Source":"MUFON","trends":["There have been no other sightings in Lamar","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/21230.html.txt","/var/www/straped/mufon/org/21230.html"],"Region":"South Carolina","Date of the Event":"08/01/2007 10:15 UTC","Summary":"3 bright orange orbs spotted in the sky","City":"Lamar","Country":"United States","Viewing Distance":"Over One Mile","Case Number":"21230","Date Submitted":"12/28/2009 10:18 UTC","divs":["Sighting DetailsI am not sure on the exact date or time, it's been a few years since I saw this. i didn't know that MUFON existed for me to report the sighting to until I found out tonight. My Sighting: I'm a 30 year old white male. I work as a Network Administrator for a plywood company in Darlington, SC. My gf had adopted a yellow lab for me as a new-home gift to help celebrate our new home in Lamar, SC. I am originally from Maine and moved down here about 3.5 years ago. (side note...seen many unknown objects in the sky through-out my 16 years living up in northern Maine, about 15 miles south of Houlton on I-95 in Merrill, Maine...too many sighting up in the sky to account for). Anyways...being familiar with seeing objects in the sky, I am always looking 'up' during the nighttime if I am ever out side. One night some time in August of 2007, not sure on the exact date, I had taken my puppy outside to go pee. The time was between 10pm to 10:15pm. The sky was somewhat clear, but with a few clouds here and there. I had looked up in the sky, towards the East. I saw 1 bright orange orb at about 45 degrees South of me. The light was completely stationary. As I was looking at it, I noticed another bright orange orb...it had appeared to the right of the 1st orb, but back a ways from the other. As I was watching the orbs, I noticed they WERE moving but very very slowly. I stood watchign them for awhile, maybe 5 minutes, and I noticed they were fading out. I then lost visual of both orbs. About a couple minutes had passed and I noticed not 2, but now 3 orbs appeared WAY closer to me. The distance they traveled would have been equivalent to about 5 miles or so. They were now at about a 80 degree angle to me now. I was blown away at the distance they traveled in such a short time, again only about 2 minutes, as the 2 objects I had seen prior were going very very slow before. I continued to observe the 3 bright orange orbs for another couple minutes and then all 3 of the orbs disappeared by fading out 1 at a time. I have never seen anything like this before, or since. I have been living here for about 3 and a half years now. I did some research about a year ago, and around the same time frame in August of 2007, people had spotted similar bright orange orbs off the Coast of Myrtle Beach. Well, Myrtle Beach is directly EAST of my house. The same direction that I had seen my 3 bright orange orbs. Coincidence??"],"Object Flight Path":"Hovering then path","Log Number":"US-12282009-0029","Latitude":"34.168766","map":"<A HREF = \"http://maps.google.com/maps?q=34.168766,+-80.062568(21230)&iwloc=A&hl=en\"> mufon case (21230) map </A>","Tags":"City","Sighting Duration":"00:05:00","Object Shape":"Sphere","Disposition":"Unknown"}