{"trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around May 31st 2006","This sighting has never been favorited.",""],"Date Submitted":"12/29/2009 01:10 UTC","Country":"United States","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-86.154174","divs":["Sighting DetailsMy wife is a sensitive and communicates with orb engergies in our back yard that appears to be a vortex for the past ten years. She was taking morning flash shots with our camera at about 5:30 AM. She did not notice the craft when she took the pic. It was a few days later when I had just downloaded the pics to my computer and was reviewing the orbs she had caught and this picture image hit me like a brick. I could not comprehend it at first and finally with her viewing assistance we decided she had caught some craft in flight just above our tree line at our fence row. It is amazingly clear and when it is enlarged you can make out a canopy and the craft appears to be turning showing its underside and aerodynamics. This has been on Coast, on Kevin's Arizona show and interviewed my wife for two hours. No one can explain what she caught but the incredible energies continue to be here along with all kinds of mists and little light angels all night long. We have hundreds of such photos stored. But never another like this craft. You are welcome to take a quess. We would take a polygraph to show this is not a doctored photo or one made up on photoshop. View for yourself. More info is available upon request."],"files":["/var/www/straped/mufon/html2text/21233.html.txt","/var/www/straped/mufon/more/21233_submitter_file1__ufouprightenlarged.jpg","/var/www/straped/mufon/org/21233.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.773156,+-86.154174(21233)&iwloc=A&hl=en\"> mufon case (21233) map </A>","Tags":"City","Log Number":"US-12292009-0002","Weather Factors":"Unknown","City":"Indianapolis","Date of the Event":"05/31/2006 05:30 UTC","Viewing Distance":"101-500 Feet","Object Shape":"Other","Case Number":"21233","Source":"MUFON","Disposition":"IFO","Summary":"My wife caught this craft while taking pictures of our morning orbs.","Object Flight Path":"Unknown","Latitude":"39.773156","Region":"Indiana"}