{"Weather Factors":"None","trends":["There has been one other sighting in Sullivan's Island","There were no other sightings in Sullivan's Island on or around August 21st 2003"],"Viewing Distance":"Over One Mile","Object Shape":"Circle","Latitude":"32.766523","map":"<A HREF = \"http://maps.google.com/maps?q=32.766523,+-79.828858(21231)&iwloc=A&hl=en\"> mufon case (21231) map </A>","divs":["Sighting DetailsMy girlfriend and her husband had come down to Charleston, SC, to visit with his family but the girlfriend and I wanted to watch the Mars-rise from the beach on Sullivan's Island since hearing that this was the closest Mars would be to Earth for a long time. Mars rose up out of the water and that was very nice. My friend called her husband on her cell and I got distracted, playing with the sand. I looked up into the sky to check on Mars again (11 o'clock position, a little above the horizon) and saw, at about the 1 o'clock position and somewhat higher in the sky, a glowing ball of light. It started off white and then faded to yellow then orange and, like a dimmer switch, it faded to black. I looked at my friend who was still talking to her husband and she, who apparently had been watching this phenomenon already, flashed out the palm of one hand as if to say, \"What gives?\" She finally got off the phone and we watched a whole series of these lights pop on like when you snap on a light at home and the lights would start as a bright white and then dim to yellow, orange, dark orange then they would go out. We discussed what the lights could be: Flares? No, flares would have tails from their point of launch and these had no tails. Flares would also tend to drop--these didn't--and I would presume their light would last longer than the 5-10 seconds these lights lasted. We could not come up with an explanation. Sometimes two lights would appear simultaneously, or almost, and would be relatively close together. The activity of the lights moved more towards the 12 o'clock position and some remained at the 1 o'clock position and always about two hand-breadths above the horizon. We saw that there were others who were watching the lights from the Isle of Palms beach across the access to the Inland Waterway. Sometimes if two lights appeared, they would do a little \"dance.\" They would like joggle around a little but not touch each other. The entire show of lights snapping on and dimming went on for a good 15 minutes. Finally, two lights appeared and then the two split to make four lights and these four did a little dance. This was at the 11 o'clock position. Then, from over my left shoulder, two jets flying close together and high in the night sky, zoomed directly towards the part of the sky where the four dancing lights had just been. They were too fast to be private jets and it would be unlikely anyway that two private jets would be flying close together. I speculated at that time that the jets had likely come from the Air Force Base in Columbia, SC, about 120 miles to the west, the direction from they were coming. The light show ceased immediately upon the arrival of the jets. We hung around for a while to see if the lights would return and they did not. We did not see the jets come back, either. As far as my feelings, it was just kind of a head-scratcher, you know? I did not feel like anything was trying to communicate with me or anything like that; I was fairly emotion-less, yet interested. Neither of us were spazzing out or freaking out; we were like, \"Hmmm. How about that?\" Naturally, neither of us had a camera."],"Longitude":"-79.828858","Object Flight Path":"Stationary,Other","Sighting Duration":"Undisclosed","Summary":"Glowing balls of light","Region":"South Carolina","Object Features":"None","Case Number":"21231","Country":"United States","Date of the Event":"08/21/2003 09:15 UTC","Tags":"City","Log Number":"US-12282009-0030","Disposition":"Insufficient Data","Date Submitted":"12/28/2009 11:29 UTC","City":"Sullivan's Island","files":["/var/www/straped/mufon/html2text/21231.html.txt","/var/www/straped/mufon/org/21231.html"],"Source":"MUFON"}