{"Longitude":"-104.597467","Case Number":"21239","Log Number":"CA-12292009-0008","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Unknown","Date Submitted":"12/29/2009 07:26 UTC","files":["/var/www/straped/mufon/html2text/21239.html.txt","/var/www/straped/mufon/more/21239_submitter_file1__ufosketch.png","/var/www/straped/mufon/more/21239_submitter_file2__visitedsketch.png","/var/www/straped/mufon/org/21239.html"],"Latitude":"50.458472","divs":["Sighting DetailsWhat I am about to describe is the truth. The precursor to the UFO event began in June 2007 at 9:23 PM. I was living in the city with my mom and was on the computer. A message popped up from my instant messenger with the words, \"Agent...[censored]\" and \"BlackOperations\", stating that someone would like to add me. I stared at it for a minute and felt amazed. Thinking to myself, \"Could it be someone 'in the know' who would like to talk to me? What is 'black operations'?\". I eagerly accepted the add request and opened a conversation window. The avatar displayed an emblem of, \"U.S. Department of Defense\" with a black background. I said, \"Hello, Agent...[censored]?\" the mysterious person replied and a conversation began. The \"agent\" told me about how I'm \"key\" to an \"event\" in the \"future\" along with a few \"others\". Than the agent elaborated a bit about a person from the year 2036 by the name of, \"[censored]\" (not \"John Titor\") and that this person was part of a special operations unit with \"C204\" equipment the team uses. The agent first advised me to walk away from this time traveler because, I'd understand when the time comes. Later the agent asked if I met the traveler. I have not to this day. Being so confused and amazed at the same time, I wanted to ask a lot of questions and was told that is all the agent was able to say. So I knew a little about the Titor story and seeked others for information. A few days later after divulging what had happened, to \"Titor\" experts, the agent contacted me and said I couldn't be trusted. There was another. I felt I had lost an opportunity to be part of a \"top secret\" time travel agenda because, after running a quick search on the agents name, there appeared to be a real world person. But was I being deceived or cleverly entangled with fact and fiction? I do not remember when I had sleep paralysis before or after June. But I do remember that I had to make a promise to myself to remember that what I had seen in my dreams was before finding an article on an alien abduction case from Kansas of an artists sketch of proportional similarities. It was a grey entity with deep eyes and a vibrant garment on a dark and desolate landscape. I kept reminding myself that it was important to know that the entity was seen before I found a similar image. That it was somehow a credible description. But after finding the alien abduction story I couldn't read anything more about it because, \"EarthFiles\" website had a subscription fee. There's more about these dreams but moving on... Several months later, my mom and I had moved out of the city to my grandparents in a small community due to a bed bug infestation. It was winter. My first UFO sighting appeared January 18th 2008 at around 11:00 PM. I was watching T.V. and a red shimmering light reflected off the walls. I got up to the window and looked to see what it was. About a kilometer away, just across from the road leading into the small community, over the prairie fields, was a large hovering fireball moving north. It was flying low and looked as though it was melting light. I guess it was the way the light of the object moved or appeared... My mom was fortunately with me and witnessed the UFO. I wanted to take a picture of it but I intuitively calculated the insufficient time there was to get a camera. It would be gone. I pondered the idea of running out to it but felt it was not wise, especially for a first UFO sighting. It lasted in my view for a few minutes before dissapearing behind the row of houses. Sometime around the 18 or 19th one night on my way into the city, white sparks dashed straight down toward the ditch. It evaporated before hitting the ground. Now in the city, I looked to my left drivers windows to the intersection a block away and another stream of sparks fell down and evaporated just above the street lights. Later on my way out of the city, on a service road by some crop fields, another stream fell within close proximity and view. I signaled the lite traffic to see if others from behind saw it. I don't remember if any cars signaled while passing by... I turned around and went to see if there was any debris or fragments but couldn't find anything. June 2008 at around 2:00 AM, I was on the computer... An add request popped up in my new email and instant messenger. It was from the mysterious agent. I accepted it and a message soon after popped up, \"Your beind watched. I have left my organisation and I just want to warn you to be careful.\". Soon after, a white cargo van came by and I could almost see someone in it because, the interior light was on. Now shocked and scared, I got away from the window and couldn't move. The van drove around a few times, beaming a bright light at the window. No one was up to see what was happening. I heard a door slam from the van and it eventually left. I awakened my grandparents and they didn't take it seriously. Following that day, as the days turned into weeks, months, I found myself attached to the night sky because, star-like objects kept coming and going. Eventually... one night, a star-like 'spherical' object flew very close to me as it went over from above my grandparents... at about 50 feet... It was no plane... It was about a meter in diamter. It was a ball of white light... An orb... Than it started to illuminate into a bright gold color for awhile and returned to its 'natural' state of a star-like white orb. I felt at peace at the time because it was so quiet and it looked friendly somehow... I lost track of time for awhile and fell into depression. It was because of what was happening, continuously... Being confused and left without any support or answeres. Alone and unable to organize anyone or anything to obtain evidence or eye witnesses. Every night these star-like objects would than immedietely \"flash\" as soon as I stepped outside on some random time and night. It was time synchronized... Not only were these UFOs responding to my presense outside but whenever I look at the time, it comes up with 11:11, 22:22, 3:33, etc... I have got videos of digital and high definition recordings of these UFOs. In 2009 before moving back into the city, I had a very close encounter with a UFO passing over me and it was a blue orb.... At my new place one night, a star-like UFO came over. These UFOs continue to follow and be synchronized with my presense. But until recently, I don't bother to seek them out... They are there. It has also come to my attention that the mysterious organization has made contact with neighbors in that small community. The question remains, what were the neighbors told? Do they know about the UFO activity? The truth of UFO phenomena? UFO Footage Available Upon Request... Thank you for hearing me out."],"Date of the Event":"07/07/2009 10:00 UTC","Object Features":"Undisclosed","Object Shape":"Chevron, Fireball, Flash, Sphere, Star-like, Triangle, Other","Source":"MUFON","City":"Regina","Viewing Distance":"20 Feet or Less, 21-100 Feet, 501 Feet - 1 Mile, Over 1 Mile","Region":"Saskatchewan","Disposition":"Unresolved","Summary":"Covert organization contacts, informs of me of an impending event and later finds my location. Followed by year round, annual UFO encounters from 2008 to 2009.","trends":["There have been 10 other sightings in Regina","There were no other sightings in Regina on or around July 7th 2009","This sighting has never been favorited.",""],"Sighting Duration":"08:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=50.458472,+-104.597467(21239)&iwloc=A&hl=en\"> mufon case (21239) map </A>","Country":"Canada"}