{"Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21234.html.txt","/var/www/straped/mufon/org/21234.html"],"Latitude":"40.737152","Sighting Duration":"Undisclosed","Case Number":"21234","Region":"Nevada","Summary":"Light like a road flare but quite large. Multiple lights on and off but in different locations. On for about 3 sec. first night I seen them they were red about week or so later similar lights but orangeish-red.","Object Features":"Undisclosed","Disposition":"Insufficient Data","Longitude":"-114.03751","Tags":"City","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.737152,+-114.03751(21234)&iwloc=A&hl=en\"> mufon case (21234) map </A>","Viewing Distance":"Unknown","Log Number":"US-12292009-0003","City":"Wendover","divs":["sighting detailsi drive truck from slc ut. to carlin nv. nights going west on i-80 just about before dark about 25 miles from wendover i seen red lights come on and off. not moving when on but moved when on again. thay were south of wendover by blue lake or more south. they seemed quite large becouse of the distance they seemed to be. the event was for at least a min. also to the east there was somthing flighing in the cloud like a big plane i only seen it for abot 2 seconds. like it didnt want go out of the cloud it aslso was much lower in the sky than the lights. about week and 1\\2 later i saw simular lights but were orange. they were moving west and downward. they seemed like varybig flares that only lastes 2 to 3 sec. then went a distance then lit up again but not moving when lit. i noticed the lighs out my left window. i though it was army flares but i have never seen any that ackted like these. im allwas looking out i see metores most nighs and allwas looking for something i cant exsplane."],"Object Shape":"Fireball, Flash, Sphere","Date Submitted":"12/29/2009 02:31 UTC","Weather Factors":"Unknown","trends":["There have been no other sightings in Wendover","This sighting has never been favorited."],"Date of the Event":"12/10/2009 12:00 UTC"}