{"Summary":"Black triangle UFO moving low and slowly 6-7 lights mostly white one blinking red in the middle on the bottom.","files":["/var/www/straped/mufon/html2text/21246.html.txt","/var/www/straped/mufon/more/21246_submitter_file1__triangle_ufo.jpg","/var/www/straped/mufon/org/21246.html"],"Object Features":"Unknown","Date of the Event":"07/27/2008 09:15 UTC","Longitude":"-87.91938","Sighting Duration":"Undisclosed","Latitude":"42.97198","Source":"MUFON","Case Number":"21246","Region":"Wisconsin","Object Shape":"Triangle","City":"Milwaukee","Weather Factors":"Unknown","Country":"United States","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=42.97198,+-87.91938(21246)&iwloc=A&hl=en\"> mufon case (21246) map </A>","Date Submitted":"12/29/2009 02:59 UTC","Tags":"City","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was helping a friend and her mother carry some things out to their car at a friends house in Bayview (near Taylor and Russell streets) when I looked up in the sky and saw some lights. Initially I thought it was just lights, maybe late fireworks.. But as I watched them they seemed to have a shape, or lack of shape. It sort of looked like an airplane but there was no fuselage or tail. As it passed my line of view, about what seemed like 30-50 feet above the school (two or three stories) across the street from where I was standing, I could see the stars disappear as they were blocked by the border of the craft. It was triangular in shape. The craft had no color, it was like the absence of light. There were about 6-7 lights all around it one at each corner and maybe one midway along the three lines that make up the triangle; the brightest of which was in the front -(they were all white except the blinking red one on the bottom - which made me think it was a plane) - looking like a car headlight only way brighter. I could see a cone of light reflected off the moisture in the air as it passed. I remember thinking I've never seen a light that bright on any aircraft. It was probably going about 10-15mph, not very fast, very low. The friend I was with and her mother both saw it too, and said \"What IS that?!?\", I tried to calm them down by saying it was a plane but I knew it wasn't.. It had a quiet quiet low hum or whirr sound that it seemed to be making. I remember thinking if I was inside I never would have seen it, or heard it. As it passed us and went behind the trees (it was flying at about the tree line) I thought about chasing it but I had no idea how. I kept thinking there is no way that really just happened. The guy (controller) at the airport (Mitchell Int'l) said it was most likely a F-117a Nighthawk (commonly referred to as the \"Stealth Bomber\") but! he could not confirm as the US Military is not required to log their arrivals and departures from civilian airports. I know what a stealth bomber looks like and this was not that. I also called and totally weird-ed out the radio station (FM102.1) and probably half of Milwaukee (actually probably more like like half of SE Wisconsin) the next morning when I called to report what we saw, though. Of course, they just laughed at me."],"Object Flight Path":"Straight-line path","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around July 27th 2008","This sighting has been favorited 1 time.",""],"Log Number":"US-12292009-0015"}