{"Weather Factors":"Unknown","Date of the Event":"06/18/1964 09:00 UTC","Region":"California","Object Shape":"Disc","Object Flight Path":"Other","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.692376,+-121.370794(21248)&iwloc=A&hl=en\"> mufon case (21248) map </A>","Object Features":"Other","Source":"MUFON","City":"North Highlands","Date Submitted":"12/29/2009 03:52 UTC","divs":["Sighting DetailsAlien \"animal mutilation\" witnessed by my golfing buddy in 1964 at Mc Clellan air base in Sacramento. My friend has agreed to talk to you upon my request. He is Paul of the well a known famly. His brother is a majority owner of an NBA basketball franchise. He is 78 years old and lives here in Sacramento California. He is the only person I have ever heard that has witnessed animal mutilations by alien beings not the military! He saw 6 small midget like beings dressed in what he describes as uniforms? While he was waiting for his father from work at the base. He witnessed the disklike craft (18ft diam, 8 ft high)land at the north end of the base and settle down without landing pods or gear. It illumnated the area bright as day after landing. Shortly thereafter he witnessed a half dozen of these beings depart the craft for the better part of a half hr at a distance of approximately 50 yards. The midgets appeared to be working around the animals(cows)on the ground. He didnt know what to think about the incident until he read an article in the newspaper the next day regarding animal mutilations. Call me for his phone number..Better hurry as his health is failing. He is lucid and he remembers the incident as if it happened yesterday. He is credible and is the most honest truthful human I know. I think this is an important sighting as it debunks the theory about the military being responsible.... I too have witnessed a UFO while a teenager in Texas in 1964. It was much different than Paul's sighting. My sighting was similar to Jimmy Carter's sighting. I and 2 of my high shool chums saw a gigantic luminous \"Sphere\" (like the moon without craters)at nite on a lonely Texas road. This was not a machine or disk that engaged my car several times. There was no contact(did not check the time?) just appeared to be observing us. Then after several departures and returns over my car it dashed out of sight. It seemed like just a few minutes but who knows how much time passed as we did not check the time of the sighting too excited back then as teenagers!"],"Longitude":"-121.370794","Log Number":"US-12292009-0017","trends":["There have been 6 other sightings in North Highlands","There were no other sightings in North Highlands on or around June 18th 1964"],"Summary":"Historical - Close Encounter","Latitude":"38.692376","files":["/var/www/straped/mufon/html2text/21248.html.txt","/var/www/straped/mufon/org/21248.html"],"Viewing Distance":"101-500 Feet","Case Number":"21248","Disposition":"Unknown","Country":"United States"}