{"Region":"Florida","Source":"MUFON","Case Number":"21252","Longitude":"-82.037606","Object Shape":"Cigar","Country":"United States","City":"Punta Gorda","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"26.938224","Summary":"large, cigar shape, golden glow, north bound, slowly, disapearing","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/21252.html.txt","/var/www/straped/mufon/org/21252.html"],"Disposition":"Insufficient Data","Viewing Distance":"Unknown","Object Features":"Undisclosed","Log Number":"US-12292009-0021","Date of the Event":"12/29/2009 06:20 UTC","Date Submitted":"12/29/2009 06:51 UTC","trends":["There have been 10 other sightings in Punta Gorda","There were no other sightings in Punta Gorda on or around December 29th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.938224,+-82.037606(21252)&iwloc=A&hl=en\"> mufon case (21252) map </A>","divs":["Sighting DetailsI am relating what my wife and her friend saw tonight while walking. The object was high in the sky, well above a couple of airline airplanes they saw below the object. I asked how long it was, and they claimed that it was the length of a forefinger held at arms length. The large planes below it were about one half a finger length by comparison. The object they claimed had a strange golden glow all the way around it like a narrow oval. They wondered at the time why and how it could glow like it was. Kelly commented that they could not see any flashing lights which they thought was strange as well as the lack of wings. At the time they had two airplanes in sight at the same time. At first they thought it must be a star but the shape was wrong and it was traveling slowly north. While they were still watching it, it suddenly was gone. Had it been something in orbit of that size, they felt it would have faded to the north, but again they said it was way too big and elongated. Both girls came into the house a few minutes ago, really confused but excited at actually seeing something strange."]}