{"Region":"Ohio","City":"Boardman","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/21258.html.txt","/var/www/straped/mufon/more/21258_submitter_file1__002.JPG","/var/www/straped/mufon/org/21258.html"],"Latitude":"41.033726","map":"<A HREF = \"http://maps.google.com/maps?q=41.033726,+-80.659253(21258)&iwloc=A&hl=en\"> mufon case (21258) map </A>","Country":"United States","Sighting Duration":"00:04:07","Date of the Event":"12/29/2009 10:42 UTC","Date Submitted":"12/30/2009 12:37 UTC","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","trends":["There have been 5 other sightings in Boardman","There were no other sightings in Boardman on or around December 29th 2009","This sighting has never been favorited.",""],"Summary":"Very distant string of lights moving almost like a string being blown in the wind across the sky","Object Features":"Undisclosed","Log Number":"US-12302009-0001","Longitude":"-80.659253","Object Shape":"Other","Case Number":"21258","Source":"MUFON","divs":["Sighting DetailsWe had jsut come back from the movies, I went and saw Paranormal activity with a few friends. I stopped and got some beer on the way home but the puppy was barking as soon as we got in so i took her out to go poty, I notcied the sky was clear and out of the corner of my eye I saw what looked like a string of lights. It was moving almost like a flock of geese would, going from west to east. It looked like a bunch of very distant stars almost all being blown around together. I dont think there is really anything to compare its motion to. I'd like to say a string being blown in the wind but it would have to be a very light string. I Watched it for a minuet and yelled fo my fiance to come see but he did not come, so i went in to grab my digital camer which was sitting on the coffee table, I only took one picture and after seeing how dark the image was I gave up on the idea, it may have been because i didnt turn the flash off but by this time the objects were moving further away and i made one last attempt to call my faince out who did come when they were very distant. unfortunately he said he wasnt able to see the lights.Maybe I'm crazy but im very certain I saw this if you'd like I do have the picture without being edited what so ever and it is on a digital camera if that matters. I have the origional and I tried to make the image lighter...there were noclouds in the sky but it appears there are in the picture but im guessing that was only my breath. When i saw the objects they were in front of me, our puppy goes to the right in our flower bed to use the restroom, while watching her i noticed the objects and looked up. I would retype this but the website is deleating AS i type so I dont want to retype this whole thing... I got the link to this website after looking up possible explainations for what i saw."],"Weather Factors":"Unknown","Tags":"City"}