{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.712446,+-82.29894(2125)&iwloc=A&hl=en\"> mufon case (2125) map </A>","Latitude":"27.712446","Source":"MUFON","Country":"United States","Date Submitted":"01/31/2003 06:00 UTC","Log Number":"","City":"Wimauma","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/2125.html.txt","/var/www/straped/mufon/org/2125.html"],"Region":"Florida","Object Shape":"Sphere","Case Number":"2125","Longitude":"-82.29894","Summary":"Large Lime Green Irredescent Ball of Light","trends":["There have been no other sightings in Wimauma","This sighting has never been favorited."],"Sighting Duration":"00:00:59","Date of the Event":"01/31/2003 06:00 UTC","divs":["Sighting DetailsMy husband and I were driving on a country road, SR 674, on our way to Naples,atabout 600 am . It was still dark , and clear. We were looking straight ahead,then to my husbands left he saw an object about the size of a full moon,limegreen in color and slowly descending into the woods. He was shocked and saidlook at that, what is that I turned and looked also seeingit. The object was slowly descending into the woods and it glowed lime green,and resembled the moon in size and shape. By the time we saw it, it wasapproximately a few hundred feet above the tree tops. It descended and went downinto the woods. We were in shock, we watched it until it was out of our sight,it just descended into the woods.The event we witnessed lasted only forapproximately 30 seconds.We continued driving, never stopping, and did not turnthe car around to investigate, as we were in awe of the object and were in alocation all alone of a very dark country road. The object was very vived and inplain view, obstructed by nothing, until it went down into the woods. The woodswere dense, we did not see a glow or anything from the road, once the objectdecended into the woods. We would like to know if anything of this kind has beenseen by others...It was something we have no explanation for. It simple lookedlike a lime green irredescent full moon descending from the sky into thewoods....... Any reply would be appreciated. It frightens me that we have noidea what it was. Thanks....Kay Dease"],"Object Flight Path":"Straight-line path","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed"}