{"Longitude":"-90.322322","City":"Caraway","Latitude":"35.758132","trends":["There have been no other sightings in Caraway","This sighting has never been favorited."],"Object Flight Path":"Straight-line path,Other","Summary":"Sphere that flashed off and on about every second and moved closer when off","Tags":"City","Country":"United States","Region":"Arkansas","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Object Shape":"Sphere","Case Number":"21257","divs":["Sighting DetailsIt was early in the morning about 4am. My step-dad, step-brother, and I were all going dove hunting. We were in the truck and had made it about 5 minutes away from the house and was just starting to go around a sharp curve. There was also a car behind us that must have seen the same thing but i dunno. I noticed a flash of light out of the corner of my eye and thought it was the light on the large microwave tower that was in center of town about 3 miles away but i realized it was too bright to be that light so i looked in the direction it was coming from and saw a huge sphere of light about maybe half a mile away and about maybe 30 or 40 feet off the ground. The light was flashing slowly, maybe like off for a second then on for a second. When the light was on the object stood still and it was very bright, but if i'm remembering correctly it wasn't really emitting light. Like it was very bright when u looked at it but the ground and sky in all directons was not lit up, only the object itself. When the light was off the object moved closer, but u couldn't see anything at all. So i'd say the light flashed off and on maybe about ten times or so over about 20 sec each time moving closer to our truck. The last time the object came on it was right above our truck and then it was gone. Everyone in the car saw the same thing. I was very scared for a few weeks as were my step-dad and step-brother. A few weeks ago a friend of mine who did not know what i had saw told me that he also saw a large sphere light in the same field sometime in 2009. The one he saw did not flash or move but stood still about 30 or 40 feet off the ground. He was driving toward it and once he got close it dissapeared"],"Disposition":"Unknown","Source":"MUFON","Object Features":"None","Log Number":"US-12292009-0026","files":["/var/www/straped/mufon/html2text/21257.html.txt","/var/www/straped/mufon/org/21257.html"],"Date of the Event":"09/06/2000 04:48 UTC","Sighting Duration":"00:00:30","map":"<A HREF = \"http://maps.google.com/maps?q=35.758132,+-90.322322(21257)&iwloc=A&hl=en\"> mufon case (21257) map </A>","Date Submitted":"12/29/2009 11:01 UTC"}