{"Weather Factors":"None","Date of the Event":"12/28/0001 12:00 UTC","Log Number":"US-12292009-0023","Case Number":"21254","Region":"Florida","files":["/var/www/straped/mufon/html2text/21254.html.txt","/var/www/straped/mufon/org/21254.html"],"Object Shape":"Other","Object Flight Path":"Straight-line path","Longitude":"-80.225039","Disposition":"Unknown","Viewing Distance":"Over One Mile","divs":["sighting detailswitness was leaving a home in palmetto bay looking east. near the fence he stopped and saw and object going north to south. it had no red or green lights on it. his friend saw a red light on the object. it was long, thin, bright gold object which went by them n to s at approximately 1\\4 mile a light the light dimmed. the impression of the witness was that the light went off inside the object. then there appeared a skeletal frame similar to fish bones. something was running up the middle which was slightly brighter, like a fish without a head or tail. then it went completely dark. the object did not look pleasant to the witness. afterward the witness felt uncomfortable. the friend was in front of the house and saw a gold object similar to a bug horizontally with legs coming out of the top and bottom, but these could have been due to her poor eyesight. it was headed southeast for about 1 minute with no sound. there were no red and green lights. the object was shimmering. the light blinked off but she could still see the outline of the object for about 1\\4 of a minute.when it was not lit she saw one tiny red light on the front of the object. the whole sighting lasted about 60 seconds. her personal reaction was not to pay attention to the matter. the sighting made her feel \"creepy\". mary margaret zimmer, fl. asd, fi [note to dispatcher: no ground traces or paranormal phenomena at the time of the sighting. cat-1]"],"Object Features":"None","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"12/29/2009 09:21 UTC","Latitude":"25.792799","Source":"MUFON","City":"Miami","Summary":"Gold cigar-shaped object","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around December 26th 0001"],"map":"<A HREF = \"http://maps.google.com/maps?q=25.792799,+-80.225039(21254)&iwloc=A&hl=en\"> mufon case (21254) map </A>"}