{"Object Features":"Unknown","divs":["Sighting DetailsWhile preparing dinner I looked out my back window noticing off in the distance what I thought was an airplane initially. However, I then noticed that the object stayed pretty stationary for a couple of minutes and flashed very very rapidly. It flashed multiple colors (Red, Blue, White, Green & Yellow) faster than a fast strobe light. I then called my wife over to see if it looked odd to her too and to see if she saw the same thing. She confirmed that she did see it and that it was a strange sight. My wife turned away for a second and I then noticed that a small red light appeared next to the larger flashing object. The red light flashed on for between half a second to one second and then it turned off. There was about a duration of 5 to 7 seconds before the red light would flash again. The red light seemed to hover beside the larger flashing object, almost as if it were a craft all its own. After about 2 and half to 3 minutes of being stationary both crafts or light objects began to move slowly toward the North East. The rapid flashing of the larger object remained the same as did the slow red flash with the pause. The objects started at about 45 degrees above the horizon line to the north of Tempe, AZ before heading North East. I eventually lost the objects when a palm tree and obstructed my view and they eventually were so far off in the distance that they were hidden by mountain. This event lasted roughly 4 minutes. Typically when I look out my back window I see planes heading south, west or east toward Sky Harbor airport. This is why I first thought this object was a plane. It's actions and rapid blinking pattern was unlike anything I'd ever seen. I also noticed that the air traffic seemed to be pretty clear during the even but soon after it headed toward the North East air traffic seemed to pick up and was quite heavy. My wife asked if I thought it may be a helicopter but as we both watched it we realized that it certainly was not a helicopter. The red flashing light that appeared next to the quick flashing object wasn't there when I first noticed it. So I'm not sure if it came from the larger object or if it were hovering there without illuminating."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.43356,+-111.930215(21256)&iwloc=A&hl=en\"> mufon case (21256) map </A>","Tags":"City","Source":"MUFON","City":"Tempe","Case Number":"21256","Date Submitted":"12/29/2009 10:07 UTC","Longitude":"-111.930215","Summary":"Looking out the house back window I saw a rapidly flashing light with a red light slowly flashing beside it off in the distance.","Log Number":"US-12292009-0025","files":["/var/www/straped/mufon/html2text/21256.html.txt","/var/www/straped/mufon/org/21256.html"],"Sighting Duration":"00:04:00","Region":"Arizona","Weather Factors":"Unknown","Disposition":"Unknown","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around December 29th 2009"],"Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Shape":"Flash, Star-like, Other","Latitude":"33.43356","Viewing Distance":"Over One Mile","Date of the Event":"12/29/2009 06:12 UTC"}