{"Case Number":"21266","Date of the Event":"08/15/2009 08:00 UTC","Date Submitted":"12/30/2009 03:29 UTC","Source":"MUFON","Disposition":"Unresolved","Log Number":"CA-12302009-0009","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Features":"None, Other, Unknown","Tags":"City","Region":"Ontario","Longitude":"-78.85578","City":"Oshawa","map":"<A HREF = \"http://maps.google.com/maps?q=43.89316,+-78.85578(21266)&iwloc=A&hl=en\"> mufon case (21266) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/21266.html.txt","/var/www/straped/mufon/org/21266.html"],"Country":"Canada","divs":["Sighting Details My wife and I had taken our dog to a field, known as Ritson Fields, in the north end of Oshawa for a walk. Ritson Fields is a non lit set of fields consisting of three soccer fields and a baseball diamond. There are also two parking lots. One near the south soccer field and one near the baseball diamond which is also closer to the two more northern soccer fields. As we were finishing our walk with the dog and returning to our vehicle to return home, we lived in the north end of Oshawa at the time and have recently moved to Courtice, both my wife and I saw an object flying at a very high rate of speed between an opening in two large trees on the north side of the parking lot. The really weird thing is that our dog even sat down and looked directly at the object as well. What made us notice this was just the sheer speed and brightness of the object and at first we thought it was a fire work. The fact that we heard absolutely no sound led us to believe it was not a firework of any kind. Also the trajectory of the object made it impossible to be a fire work. Someone would have had to have been in the top of the tree to launch it in that direction and we were only approximately 50-70 feet from the trees. There was no one in the trees and again, we heard no sound. We looked at each other and then the dog and he was literally staring up where the object flew over. The strangest aspects of this sighting were the speed of the object, there was no real discernible color to it, it was just very bright, fast and multi-colored. Another very strange aspect was the trajectory. I have no military or ballistics experience but the only thing I could equate it to is missile like. Not the shape really, the shape was really just like a light with a tail trailing, but the action and trajectory. It was like it was hugging the earth and curving around with the shape of the earth. Other than that I really don't know how to explain it? I really can't say how high up it was, but it seemed to me that it would have had to have been within our atmosphere. As I stated earlier, we only saw this object for roughly 3 to 5 seconds and it was between an opening in between the two tallest trees on the north side of the parking lot. We lost site of it after it went behind the tree on the west side of the opening. As I stated earlier, it was headed in what seemed to be an almost due NW direction. It seemed to be traveling in a straight line at an incredible rate of speed. I could not even guess the speed but I have never seen anything travel this fast before. I can tell you that after my wife and I saw this and looked at the dog, we looked again at each other and she first said to me \"that was a UFO\". To which I replied, \"I know\". Funny thing is, if our dog could talk, I'm pretty sure he would have agreed with us. It was strange how he just sat down and looked up, just as we looked up. This is not the only time I believe I have seen a UFO or UFO's. I have had another experience driving home recently but I will complete another sighting report for that tonight. I know that some time has passed since the sighting has occurred, but my wife and I know what we saw and we know it was a real object. I had just never really known where to talk about it or think anyone would take us seriously. I am a believer in UFO's and alien life. It, to me, is impossible for there not to be other life out in our universe or other universes. My wife was not quite the believer that I am, but she is now. Thank-you for your time."],"Object Shape":"Bullet, Missile, Circle, Fireball, Star-like","Summary":"Object flew over in NW direction","trends":["There have been 12 other sightings in Oshawa","There were no other sightings in Oshawa on or around August 15th 2009"],"Latitude":"43.89316","Weather Factors":"Windy, Light","Sighting Duration":"Undisclosed"}