{"Country":"United States","Summary":"Not Meteorite had inteligent Flight Pattern","Source":"MUFON","Object Flight Path":"Unknown","City":"West Chester","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=39.346192,+-84.409238(2126)&iwloc=A&hl=en\"> mufon case (2126) map </A>","Object Shape":"Unknown","Sighting Duration":"00:00:59","Latitude":"39.346192","Date of the Event":"11/30/2001 09:30 UTC","Date Submitted":"11/30/2001 09:30 UTC","Region":"Ohio","Case Number":"2126","Viewing Distance":"Over One Mile","divs":["Sighting DetailsWe were driving back from my wifes parents house abot 930 at night on eithersnyder rd or Butler warren road in December of 2002 in butler county Ohio aroundwest chester or Cincinnati. She was following me with the kids in her car butdid not see this. I am still amazed she did not see it. Out of my driversidewindow while I was headed North off to the NW I saw what I thought at first wasa huge meteorite or shooting star but it had the appearance of sparks flying offof it and it itself was a huge ball of sparks it was traveling toward the earthwhen it look like it exploded quickly but there was no noise. It then reappearedand headed back upward again like a shooting star but headed up it was the samecolor as a spark that metal leaves on the ground at night or a firework with nocolor just burnt orange spark color. At about the time that it re-apearedanother of the same objects came from across the sky straight toward it. Theybegan to circle each other like they were chasing and playing in circles andother directions at a high rate of speed I am sure but at that distance it wassimilar to watching two dogs chasing each other. then they seemed either to haveburnt out or just disapeared. They left a spark trail but it was always shortWhat is strange is that the tail of what seemed like a commet originally wasshorter and fatter than what you would expect. they were like a fireball withsparks shooting or dripping off.It seemed like it was molten but yet crisper Iwas confused after I saw it when We stopped at the gas station I asked my wifeif she had saw it and she said no. She was wondering why i slowed down and waspulling off the side of the road. I saw something abnormal I am just not surewhat it was."],"Disposition":"Insufficient Data","Object Features":"Undisclosed","Longitude":"-84.409238","Tags":"City","files":["/var/www/straped/mufon/html2text/2126.html.txt","/var/www/straped/mufon/org/2126.html"],"Weather Factors":"Unknown","trends":["There have been 5 other sightings in West Chester","There were no other sightings in West Chester on or around November 30th 2001"]}