{"Disposition":"Unresolved","Log Number":"BR-12302009-0012","Region":"São Paulo","divs":["Sighting DetailsI was lying in my bed when i saw one red-orange light going more or less south to north, i dont gave it to much atencion becouse i thought that it was just a single little ballon (common in here). than the thing set on fire(still no surprise at all, these kind of ballon usualy burn it self on the air), but than i realize that the \"ballon\" was stopped whille burning. I stayed staring the thing for a few moment and realize that it war burning in a vary uniquely way. It was laying sparks and some sort of molten metal, some spark looked to go up insted of fall, so its not paper that was burning, so it was not a ballon. I stoped to stare to the thing and started to look for my telescope, when i looked to the sky again its was not one single light, but three. I was shocked and terrified, my fir stupid action was get my cel fone and call my cousin, he answered the phone, I reported what I was seeing, he tried to look out the window, but he did not saw anything, which I already provided, as the UFO seemed to be in low altitude, and he lives quite far from my house. I tried to call my grandmother that was sleeping in the other room, but she said nothing, and i was afraid that he couldnt see the thing, (she doesnt see quite well), moreover i was terrified and was trying to talk in low voice and not make sudden movements to avoid attracting attention. whille this, the ufo started to rotate, tham to move back to south, no noise, no nothing, but if anyone looked to the sky in that vary moment should perfectly see the thing. Than it got out off my sight. I closed the window and stayed awake till the next morning. I dont that have any substantial evidence of the event, becouse of it i try to dont speak about it with everyone. But my only intent is help in the study of the events. I want also to start to make researchs on my own, becouse i cant ignore these metter anymore. I tried also to make contact with institutions of ufology of Brasil, but it had no use. Is important to say that my neighborhood is quite active, and many other people recleme to had experiences of this kind."],"Sighting Duration":"Undisclosed","Object Features":"None","Longitude":"-46.630798","Tags":"City","City":"Sao Paulo","Object Shape":"Triangle","Case Number":"21269","Latitude":"-23.542683","trends":["There have been 13 other sightings in Sao Paulo","There were no other sightings in Sao Paulo on or around March 3rd 2009"],"Object Flight Path":"Hovering then path","Country":"Brazil","map":"<A HREF = \"http://maps.google.com/maps?q=-23.542683,+-46.630798(21269)&iwloc=A&hl=en\"> mufon case (21269) map </A>","Weather Factors":"None","Date of the Event":"03/03/2009 12:00 UTC","Summary":"first was one light (I thought it was a ballon) than it burned out for 1 or 2 min, than when a looked again and it became a triangle.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/21269.html.txt","/var/www/straped/mufon/org/21269.html"],"Source":"MUFON","Date Submitted":"12/30/2009 06:24 UTC"}