{"trends":["There have been 6 other sightings in Sharon","There were no other sightings in Sharon on or around December 23rd 2009"],"Tags":"City","City":"Sharon","Summary":"I saw this object three times in two different locations.","Country":"United States","Disposition":"Insufficient Data","Source":"MUFON","Object Features":"None","Object Shape":"Cigar","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"41.239362","Date Submitted":"12/30/2009 08:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.239362,+-80.484464(21270)&iwloc=A&hl=en\"> mufon case (21270) map </A>","Region":"Pennsylvania","Date of the Event":"12/23/2009 12:00 UTC","divs":["sighting detailsi was getting ready to get in my car with my wife. i saw it to north of our apartment. it was clearly visible. i did not know my wife had the camera in the car so i did not get a picture of it the first time. but approxitmaly 1 hour later my wife went into a business and i stayed in the car when i seen it again but this time i had the camera i took 3 pics. the object was white\\metallic and cigar shaped. i seen it aprox. 25 min. later when we went home, however i was not get that picture because it went behind a cloud and never came out the other side. i did get a picture of the cloud which was not that big. if it was a plane it would be visible after going through the cloud. another thing i noticed was it seem to be slower than an airplane. there was no sound any of the time i spotted it. as far as what i thought it was when i first saw it and each time i saw it was that it had no wings. it was like usaf drone. but as i seen it each time i got dumbfounded as to how low it seemed to be flying low. when i took the pictures when it was right over head. it seemed much closer live then it does on the on the photos. i tried to blow it up and it just makes it a little fuzzy, but you can tell it has no wings. when i saw it the first time it was going in one direction and the third time in the opposite direction like it was following a specific path. the first 2 pictures show the object going over top of us. the third picture is of the small cloud where it went behind and never reappears."],"Longitude":"-80.484464","files":["/var/www/straped/mufon/html2text/21270.html.txt","/var/www/straped/mufon/org/21270.html"],"Object Flight Path":"Straight-line path,Path then hovering","Log Number":"US-12302009-0013","Case Number":"21270","Viewing Distance":"501 Feet - 1 Mile"}