{"Date Submitted":"12/31/2009 02:03 UTC","Summary":"Very large turtle shell shaped objects at a low altitude flying silent and parallel of each other.","Longitude":"-114.315855","Log Number":"US-12312009-0003","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around June 30th 1996","This sighting has never been favorited.",""],"Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21274.html.txt","/var/www/straped/mufon/more/21274_submitter_file1__scan0001.jpg","/var/www/straped/mufon/org/21274.html"],"divs":["Sighting DetailsI think the wierdest part of this experience is the moment before noticing the objects which came west-to-east from California. All the stars in the sky started doing small cirles rotating back and forth like the sky was shaking. The objects appeared green from Lake Havasu City, Arizona looking back at Lake Havasu California. The objects appeared to gain altitude, momentarily conjoin together, and then break apart again flying parallel of each other and directly over the lake and the edge of the northern part of Lake Havasu City. It was a Friday night, so we could not have been the only three people to observe them in the night sky. The entire sighting lasted anywhere from 10-30 minutes. The objects were turtle shell shaped and had a green florescent glow about them on approach from California to Arizona. They were identical in markings, lights, shape, and large as 3 or 4 747's with NO SOUND coming from them. They both had three rows of three rectangular color-changing lights underneath. In the back was one rectangular white blinking light. The objects had what appeared to be rear exhaust systems, like I said, much similar to looking at a closed turtle shell. The objects were dark in color themselves, with a crude hard outer layer. No photographs of the incident were taken because we were all juveniles and not supposed to be out at that time of night unsupervised. We all had strange sensations of being watched at the time, and we all believed we experienced missing time, how much was never determined. Both objects continued flying parallel towards the east towards Phoenix until out of sight. I have posted this sighting in here before and do not know why I am having to post it again, but have no problem doing so. I have kept contact with one of my friends from that night in Lake Havasu and he always tells me he has NEVER seen anything like it again, and often forgets that it happened until he hears from me via telephone. Myself, since moving back to Alaska, I have had countless sightings, some on film and some on video......I will be donating more film and video to MUFON soon."],"Latitude":"34.493771","Date of the Event":"06/30/1996 12:00 UTC","Tags":"City","Object Features":"Other","Region":"Arizona","City":"Lake Havasu City","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"None","Case Number":"21274","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Straight-line path,Path with directional change,Unknown","Object Shape":"Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=34.493771,+-114.315855(21274)&iwloc=A&hl=en\"> mufon case (21274) map </A>"}