{"Tags":"City","trends":["There have been no other sightings in Francestown","This sighting has never been favorited."],"Date of the Event":"12/12/2009 06:05 UTC","files":["/var/www/straped/mufon/html2text/21280.html.txt","/var/www/straped/mufon/org/21280.html"],"divs":["Sighting DetailsI was driving at the eastern edge of Francestown, NH in a westerly direction on Dec. 12, 2009 and observed at approximately 6:05 PM a green spherical object descend at some distance away toward the earth's surface. It was dark out with high overcast, but the visibility was very clear to the cloud cover. The object was observed for about 3-5 seconds. I observed it travel from the top of the passenger-side front windshield to the left on a downward trajectory following a straight line toward the earth's surface at approximately a 30 degree angle. This suggested a generally northerly to a southerly direction of travel. It took the stated short amount of time for it to go behind the tree line. My windows were rolled up during the sighting. There was no sound during its flight and no sound of any crash. Nothing was reported on the news about any airplane crash that night or the following day. There is no airport in this general direction. The object appeared perfectly spherical and about the size of a green pea to a chick pea held at arms length. It was not possible to determine the size of the object or the distance to the object, since I had no points of reference. However, it was clearly below and in front of the cloud cover. The object was a luminous green colored sphere with the edges sharply delineated. The object's center appeared slightly less luminous and less green looking. It traveled faster than would an airplane and at a far steeper angle than would an airplane heading toward a landing on the ground. On this same road I have observed many airplanes, usually from my direct left, approaching Manchester airport (east of me by 15 miles and behind my direction of travel). This object was totally different than the multiple lights of commercial airplanes. It appeared significantly larger, moved faster and dove steeper than any aircraft. It also looked nothing like a meteor, which can have a greenish color. The meteors I have observed tend to have a 'streaky' appearance as they leave behind a trail of debris and high energy gas and are not perfectly spherical, as this object definitely was. In decades of watching the sky I have never before observed an object I could not identify as an airplane or helicopter or some natural phenomenon. This object definitely fits the unidentified category. It was unlike any kind of aircraft or natural phenomenon I have ever observed."],"Date Submitted":"12/31/2009 03:43 UTC","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Sphere","Case Number":"21280","Disposition":"Unknown","Log Number":"US-12312009-0009","City":"Francestown","Region":"New Hampshire","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Sighting Duration":"00:00:04","Weather Factors":"Unknown","Latitude":"42.987582","Summary":"Observed Green sphere descend at 30 degree downward angle toward earth","Country":"United States","Longitude":"-71.812577","map":"<A HREF = \"http://maps.google.com/maps?q=42.987582,+-71.812577(21280)&iwloc=A&hl=en\"> mufon case (21280) map </A>"}