{"Region":"England","Country":"United Kingdom","Summary":"i saw multiple moving object move across the sky most where a yellow green or orange colour pulsing","Weather Factors":"Unknown","trends":["There have been no other sightings in Scunthorpe","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","City":"Scunthorpe","Sighting Duration":"Undisclosed","Longitude":"-0.654413","Case Number":"21285","map":"<A HREF = \"http://maps.google.com/maps?q=53.588646,+-0.654413(21285)&iwloc=A&hl=en\"> mufon case (21285) map </A>","divs":["Sighting DetailsToday on the first of jan 2010 i saw multiple moving object move across the sky most where a yellow green or orange colour pulsing i was closing my window, that i could see moving some where far away like the size of a plane light but they where lower to the ground then what a plane flights at some looked like they where spinning some u could make out abit of a shape all the lights where different sizes i first saw them at 00:15 there where many then it many have been happening before that it is now 00:42 an every so often u can see them this is not the first time i have noticed them when i was walking home with my mates some time in augest we noticed 3 moving across the sky but thought nothing of it these thing are very stranged i tryed to to a vid on my phone what i have but its not that good u can see the lights and they are moving as i was taking one of the vids a noise started to come from my phone like what i can here though my headset on my computer when i send a text my phone was fully charged and then it just cut out this happened when i was filming on of the closer objects i the turned it on and it was full still i am not crazy i did see it so did my sister i wouldnt lie about this.i am now righting this when i first saw them i rembered i hade seen them before. i was feeling intrested wanting to know what they where i lost sight cause they moved.i have a vid but cant attach to this."],"Disposition":"Unresolved","Log Number":"GB-12312009-0014","Object Shape":"Other, Unknown","Tags":"City","Date Submitted":"12/31/2009 07:58 UTC","Latitude":"53.588646","Viewing Distance":"101-500 Feet","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21285.html.txt","/var/www/straped/mufon/org/21285.html"],"Date of the Event":"Unknown","Object Features":"Unknown"}