{"trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around December 29th 2009"],"Date of the Event":"12/29/2009 08:30 UTC","files":["/var/www/straped/mufon/html2text/21281.html.txt","/var/www/straped/mufon/org/21281.html"],"Viewing Distance":"Unknown","Country":"United States","Object Features":"Unknown","Date Submitted":"12/31/2009 04:36 UTC","Disposition":"IFO","Tags":"City","divs":["Sighting DetailsI went outside my house at around 8:30 am to smoke a cigarette. I was standing in my front driveway leaning on the back of my car and I leaned my head back to enjoy the morning sky when I saw a silver circular object going through the sky pretty fast. I first thought it would have had to be a helicopter based on the shape. I don't know heights that well but it would've been closer to a airplanes height in the sky then a helicopter. I looked at it for about 10 seconds and specifically looked for wings because I was like there is no way I'm seeing a real UFO right now, but I couldn't see wings on it and I couldn't see the rotors or a tail. It appeared to be spherical from the angle I was seeing it at. It was a shiny silver chrome color. It maintained a straight flight path. I was very surprised by it and pretty uneasy just for the fact that it was there. I know a lot about UFO's but I was still very surprised to see one. I quickly ran inside and showed my brother from his upstairs balcony but by now it was almost a dot and he saw it but couldn't make out any details."],"Object Flight Path":"Straight-line path","Longitude":"-117.391596","Region":"California","Weather Factors":"Unknown","Case Number":"21281","Sighting Duration":"00:01:00","Summary":"Silver circular object higher than a helicopter heading towards mountains","map":"<A HREF = \"http://maps.google.com/maps?q=33.954729,+-117.391596(21281)&iwloc=A&hl=en\"> mufon case (21281) map </A>","Source":"MUFON","Object Shape":"Circle, Disc, Sphere","City":"Riverside","Latitude":"33.954729","Log Number":"US-12312009-0010"}