{"Object Flight Path":"Undisclosed","Longitude":"-75.648468","City":"Kars","Case Number":"21290","Date Submitted":"01/01/2010 03:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.153124,+-75.648468(21290)&iwloc=A&hl=en\"> mufon case (21290) map </A>","Log Number":"CA-01012010-0001","Summary":"10 - 20 ? BALLS OF BRIGHT COLOURED LIGHTS THAT COULD STAY MOTIONALESS AND THEN BURST APART FROM EACH OTHER AT U.N.B.E.L.I.E.V.A.B.L.E. SPEED CREATING NUMEROUS RANDOM GEOMETRICAL FORMATIONS THAT WERE PERFECT IN UNISEN.","Object Features":"Undisclosed","trends":["There have been no other sightings in Kars","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Region":"Ontario","Object Shape":"Circle","Disposition":"Unresolved","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"45.153124","Tags":"City","Date of the Event":"11/02/1979 12:00 UTC","Source":"MUFON","divs":["sighting details i was temporarily staying at a friend's secluded old farmhouse (rented) south of ottawa, ontario (near or just off of hwy 416 well south of manotick, ont.) that night i was there by myself. from an upstairs bedroom window i watched a number of bright round\\ball-like lights making perfect formations, like a perfectly geometrical dance in the sky. they were like large stars that moved very strategically but in various random formations. i rubbed my eyes, having difficulty believing what i was seeing. i ruled out my imagination and even considered the possibility of some extraterrestrial event. they were almost hypnotic as they joined in formations and burst apart and form other formations. they moved so perfectly making perfect formations in the sky. they could dart so unbelievably fast in perfect unisen with one another. it was hard to believe what i was seeing, which was why i kept looking, turning away and then looking again. i watched for at least 15 maybe even 30 minutes and was feeling a little afraid which i tried as best i could to supress and ignore. i stopped looking out the window and layed down on the bed, but kept the lights on. i was feeling restless, but wanted to go to sleep real bad. the thoughts i had from \"light show\" made it real difficult. i tried shutting my eyes, but was still awake, so my eyes were mostly open. i was distressed by my inability to sleep. i soon started to hear a pulsating whoo whoo whoo sound that got closer and closer. it sounded sort of like a helicopter but not. as the sound became louder and louder my heart began to pound progressively fast with fear. the sound got so loud that it felt as though it was hovering right over my head, as if it was suspended right over the roof of the house. i was fully concious and could see, but my body became totally paralysed. the paralysis terrified me and my heart beat harder, way harder than i ever thought it could without bursting. i thought i was going to die from my heart beating so fast and hard. i think i prayed and begged in a think talk way, in fear that my life would end if this continued. i actually thought i was going to be abducted. i was still totally paralysed when i heard a voice amidst the loud pulsating whoo whoo whoo sound which was still hovering over the roof of the house that felt directly over my head in the bed that i was laying in. the (male sounding) voice was as if it spoke like through a mask or through radio waves?? the voice said, \"she's not ready yet\". this voice came just as i thought that the hard pounding of my heart was going explode and kill me. just as the voice spoke, i heard and felt the pulsating whoo whoo whoo sound start fading away within seconds. i was then able to move my body again. i think i went downstairs and battled with my fear all the way to day break. i don't think i spoke about it with anyone for a long time as i thought people would think i was crazy. as i became a little older, i spoke about it with very few people ...it was just too weird. (i am 52 years old now). i did not imagine any of this, i know i didn't. as this was a long time ago, my dates and times are only approximate. i remember that there was only a small amount of snow on the ground at the time. the incident occured just weeks before my near fatal car accident (december 2, 1979) of which i was found approx 7 hours later trapped under the passenger side dash inside my totally squished vehicle laying on one of the tires that pushed through the floor of the vehicle."],"files":["/var/www/straped/mufon/html2text/21290.html.txt","/var/www/straped/mufon/org/21290.html"],"Country":"Canada"}