{"Latitude":"32.776439","map":"<A HREF = \"http://maps.google.com/maps?q=32.776439,+-117.020484(21291)&iwloc=A&hl=en\"> mufon case (21291) map </A>","Object Shape":"Triangle","Date of the Event":"12/31/2009 11:08 UTC","Disposition":"Hoax","trends":["There have been 13 other sightings in La Mesa","There were no other sightings in La Mesa on or around December 31st 2009"],"Tags":"City","Object Features":"Unknown","Object Flight Path":"Path then hovering","Summary":"3 solid red lights about brightness of Sirius, in tight triangle then wavering, PERIODIC EVENT ON HOLIDAYS !","Country":"United States","Case Number":"21291","files":["/var/www/straped/mufon/html2text/21291.html.txt","/var/www/straped/mufon/org/21291.html"],"Longitude":"-117.020484","divs":["Sighting DetailsJust before midnight saw 3 solid red lights slowly rise then hold in stationary position in elongated triangle, held in this position for 5 minutes or so then faded....this occurred from apx 11:57 PM right across midnight into the new year. Saw one of these lights originate from the same place exactly one year ago at exactly the same time. Also saw one of these lights July 4th 2008. The difference this time around was there were 3 in formation. Looked through binoculars , just got bigger red lights, no shape other then the triangle position of the lights as described above. Further more, got a call from a friend of mine a couple of miles away who was seeing them as well, wanted to make me aware of them. Googled event and other people , many, have seen these lights before, July 4th this year and New Years last year{Same light I saw} My feeling is these are not extra terrestrial , but then again, likely not simple flares as they were STATIONARY and holding a tight formation...certainly very strange..tried to take picture but the limitations of my camera at night photographing distant , relative, small objects leaves a lot to be desired....Did I mention they were dead silent ?"],"Date Submitted":"01/01/2010 03:49 UTC","Weather Factors":"None","Source":"MUFON","Log Number":"US-01012010-0002","Viewing Distance":"Over One Mile","Region":"California","City":"La Mesa","Sighting Duration":"Undisclosed"}