{"Date of the Event":"08/05/1995 12:00 UTC","Source":"MUFON","Longitude":"-97.134844","files":["/var/www/straped/mufon/html2text/21298.html.txt","/var/www/straped/mufon/org/21298.html"],"Object Shape":"Saturn-like","Object Flight Path":"Undisclosed","Latitude":"49.909474","Tags":"City","Country":"Canada","Viewing Distance":"Unknown","Object Features":"Undisclosed","Disposition":"Unresolved","trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around August 5th 1995"],"Region":"Manitoba","Case Number":"21298","map":"<A HREF = \"http://maps.google.com/maps?q=49.909474,+-97.134844(21298)&iwloc=A&hl=en\"> mufon case (21298) map </A>","Log Number":"CA-01012010-0009","Weather Factors":"Unknown","Summary":"pewter gray color, three sections, three lights, non reflective , quite large, stationairy","Date Submitted":"01/01/2010 01:13 UTC","divs":["Sighting DetailsI was out at midnight driving with my ex who I despise. It was August 1995, a warm night, numerous small fast moving thunderstorms moving through the area. We decided to go driving in the country to see the lightning, I love tornadoes and storms. We were headed East 2 miles outside of Hartney, a mile over from my parents farm. There was a storm approaching from the North East. It was moving pretty quick so I slowed down to watch it approach and there was some pretty wicked looking lightning. I slowed the truck to a crawl as the storm went ahead of us and crossed over ahead in the sky. For some reason , I guess i was looking at the lightning, I looked up and over to the right, south, and right in front of this thunderhead there was this object in the sky. I saw it perfectly. The color was pewter, grey, it had a middle disc, one on top and one the same size on the bottom. I did not see any doors or windows. But what i did see were three lights. I must have watched it for a while because I had time to witness three lights and colors. The object was stationary and on the top portion of the craft a yellow light came on in the centre. It came on first, shone yellowish with the same intensity and went off. Then on the centre of the craft in the middle underneath where the other light had come on a second yellowish light came on and went off. Then on the bottom centre of the craft a beautiful purplish light came on, it increased in intensity brilliantly, and then went off. The thunderhead at this time had moved over where the craft was and it was gone. I tried to judge in my mind after how big it was and it must have been quite a size. Something after i thought of was that when the lightning was flashing around it , the craft did not reflect the lightning. The retard i was with did see it although he denies it now. There was no hair up on the arms, no fear, no dramatics but i saw what i saw and i will never forget it. We got out of the truck and walked around and never saw another thing that night."],"Sighting Duration":"Undisclosed","City":"Winnipeg"}