{"Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.824544,+-74.284592(2129)&iwloc=A&hl=en\"> mufon case (2129) map </A>","Date of the Event":"02/08/2003 03:05 UTC","Disposition":"Unknown","Longitude":"-74.284592","trends":["There have been no other sightings in Essex Fells","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/2129.html.txt","/var/www/straped/mufon/org/2129.html"],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"Observed dance of lights in NE sky 3pm EST NYC ar","Country":"United States","City":"Essex Fells","Object Features":"Undisclosed","Source":"MUFON","Case Number":"2129","Region":"New Jersey","Object Shape":"Undisclosed","Viewing Distance":"Over One Mile","Latitude":"40.824544","Tags":"City","Date Submitted":"02/08/2003 03:05 UTC","divs":["Sighting DetailsI was looking out the window, and noticed an airliner in the Newark airportlanding pattern NE sky from my perspective. My attention was drawn to twopoints of light that were apparently following the airliner but appeared to beat a much higher altitude. As I watched the points of light, I observed themcircling and disappearing, resuming straight motion, and circling each other ,and disappearing. A third light joined in the dance. All were fading in andout and displaying unusual changes in motion. I called to my son Christopher tocome and see if he saw what I was seeing. He did. We both watched as thepoints of light continued to circle each other, disappear, and reappear again inslightly different points in the sky. We both watched, and concurred what wewere seeing there are moving towards each other, there gone, there back, etc.... The objects appeared, brightned at times pulsing, and disappeared throughoutthe observation. One last point of light, appearing farther distant than theothers appeared, moved eastward and disappeared. The elapsed time was about 4minutes.AT first I thought what I was seeing was some refraction in the window I waslooking through, but after calling my son who had a slightly differentperspective and was seeing the same thing, I became more curious. I wanted toknow if anyone else had observed the same display. I suggested that we reportour sighting, and my son agreed wholeheartedly. Rather that call it in to ourpolice dept, I felt that MUFON could make the best use of our observation.Id really like to know if others observed the same display."],"Log Number":""}