{"map":"<A HREF = \"http://maps.google.com/maps?q=53.406754,+-2.158843(21294)&iwloc=A&hl=en\"> mufon case (21294) map </A>","Date of the Event":"01/01/2010 01:55 UTC","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"53.406754","Region":"England","Tags":"City","Longitude":"-2.158843","Case Number":"21294","Country":"United Kingdom","Object Shape":"Fireball","divs":["Sighting DetailsAt about 1:55 am this morning while driving home I saw 5 light in the sky ahead. It was a nearly clear night sky and very cold. The lights were the yellow colour of fire and flickering slightly. I stopped the car and we got out to watch. The lights moved steadily over our heads along the line of the flight path to our local airport. There was no noise. The second light then came to the side of the first light and overtook it. After passing overhead then entered light cloud and one by one faded and disappeared. Imediately after a 6th light appeared ahead along the same path and passed over in about 2 minutes. I got in the car and started up then noticed the seventh again from the same origion and travelling the same direction. We got out again and watched. After moving farely quickly overhead it seemed to virtually stop moving for about an minute then faded and disappeared. At no point was there any noise even though it was a very quiet night. There was a little light cloud at from 1500 to 3000 feet and the lights were below at this level. I am a doctor and UFO sceptic so I don't know what to make of these lights. We live on the airport flight path and are used to aircraft passing over. This was different. The light were far to close for aircraft and should not overtake if they were floating in the wind. They were travelling the same direction as the clouds but were catching up to them! then seemed to go through the clouds and slowly disappeared."],"Summary":"My wife and I witnessed 7 lights travelling in the sky above us.","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Stockport","This sighting has never been favorited."],"Weather Factors":"Unknown","City":"Stockport","Log Number":"GB-01012010-0005","Date Submitted":"01/01/2010 05:49 UTC","Object Features":"Undisclosed","Object Flight Path":"Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/21294.html.txt","/var/www/straped/mufon/org/21294.html"]}