{"Sighting Duration":"00:20:00","Summary":"3 lazer red objects in the northern sky. Clock position: 12-3 6","files":["/var/www/straped/mufon/html2text/21292.html.txt","/var/www/straped/mufon/org/21292.html"],"Object Shape":"Other","City":"Spring Valley","Disposition":"Hoax","Log Number":"US-01012010-0003","Latitude":"32.747174","Date Submitted":"01/01/2010 04:07 UTC","Longitude":"-116.991416","Weather Factors":"None","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.747174,+-116.991416(21292)&iwloc=A&hl=en\"> mufon case (21292) map </A>","divs":["Sighting DetailsI walked outside for the new years event and in the north sky I saw 3 lazer bright red lights. It is a full moon tonight and the lights were VERY BRIGHT vrs. the moon. The lights position to me were at 12-3-6 oclock at about a 45 degree from the ground up. The lights were drifting towards the west and moving very-very slowly. The 12 o-clock light started to dim and then dropped from its position in the sky, from 45 deg. to about 20 deg straight down in about 45 secounds time. of watching it. Then the light dimmed and went out of view behind houses. All the while its light emmission was still visible, faint and blinking. It took about 45 secounds for this event. The 3-6 position lights were still very bright in the sky about 45 deg. from the ground up. The 2 reamaining lights went dim and out about 20 min. from the start of the event. My first thought was was 3 flares. But 1 of the lights fell from the sky before going dim and the 2 others remained bright and high in the sky drifting towards the west while stll being 45 deg. above the horizon before dimming out of site. My wife took cell phone pitcures."],"Case Number":"21292","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"01/01/2010 12:00 UTC","Region":"California","Source":"MUFON","Tags":"City","trends":["There have been 4 other sightings in Spring Valley","There were no other sightings in Spring Valley on or around January 1st 2010"]}