{"Longitude":"-92.897724","City":"Cannon Falls","Sighting Duration":"00:01:00","divs":["Sighting DetailsI am not sure why I never reported this, but I will do so now. I believe it was around 1998 in the early fall, maybe September (might have even been 1999. I am judging this about the relative grade level I was in school at the time). I was driving with a friend from the Minneapolis-St. Paul area to Rochester, MN along Highway 52 with his step-father on a Sunday evening before dusk (maybe 5:30 - 7pm). It was not yet dark out, but it was not 100% light still. Objects outside could still be made out though very well. I was enjoying some peace and quiet on the car journey by looking out the window and thinking. Looking out the window of the car, I all of a sudden saw a fairly large dark triangular shape flying above the car. It was either black or dark gray in color (since it was dusk out, I couldn't tell you the exact color other than it was dark -- near black in color). If I had to guess where we were, we were probably between Cannon Falls and Hampton in Minnesota along Highway 52, driving South. The craft was flying west southwest (a small angle south of what is the West horizontal line), or at least that direction in relation to the heading we were going on the highway. Since Highway 52 is almost always South-North, I can only assume west southwest was the direction it was heading. If I had to guess at the altitude of the craft, I would say it was 150-250 feet above us. It made no noise and I know this because the radio in the car was not on at the time, and nobody was talking. Whatever noise it made was masked by the white noise of the car driving on the highway. I believe we were traveling at around 65 MPH. The craft was easily noticeable because of its size, how high it was above us, and how it made no noise. The craft was fairly large in size. I would guess the height (triangle wise -- geometry) was 300 feet and possibly larger. On each of the vertex of the triangle was a differently colored light. I remember one was red, another was green, and don't remember about the third and they were blinking slowly. The craft was seemingly gliding and was going no more than 100 to 150 miles per hour. I think also, not sure, but if memory serves me correctly the craft could have been very slowly rotating. After it was over us, I asked \"WHAT WAS THAT!?\" My friend, I believe, was a little scared and brought up something to divert attention away from what just happened. I am not sure if he saw it or just wanted some peace and quiet and to get home safely. I continued to watch the object until it vanished into the horizon and I couldn't make it out anymore (probably 45 to 60 seconds after it was above us). My feelings were one of awe, because I am an aviation enthusiast and had never seen anything like this before. Let me say this: I am an aircraft enthusiast (especially civil aviation) and can name the make and model of most aircraft flying 500-1000 feet altitude usually. I believe in UFOs and Aliens, however I am very skeptical of 90% of the footage I see because of what I know about aviation. What I saw this evening though was unlike anything I'd ever seen before. First of all, I've NEVER heard of an airplane that makes almost no noise. This was not a B-2 bomber either as a B-2 bomber (1) wouldn't be flying in this area, (2) B-2 bomber's shape is not 100% triangular like this objects was, and (3) This object was much, much larger than a B-2 bomber. The \"length\" of a B-2 bomber is only 70 feet and again, this objects was probably close to 300 feet. Also, the area we were traveling on I know very, very well. I grew up in Rochester, MN and have traveled that road at almost all times of the day probably 200 or more times in my life. Rochester is located around 50 miles south of where we were at the time of the sighting. To say I don't know the area I was in would be an understatement. First of all, the area where we were had no structures around it. It was farm land. Not many people live in the area. There is a small regional airport about 20 miles northwest of where my sighting was (Airlake Airport in Lakeville, MN). The craft I saw, however, was heading a little south. Even if that is the direction of approach of aircraft into this airport, I have a few problems with it. (1) Considering the size of this aircraft, there's no way it could have landed on this airport's only runway given this airport runway's length if it was a regular airplane. (2) We were 15 miles southeast of this airport and the craft was 150-250 feet high. I don't know of any planes that would land at a regional airport, 15 miles outside on approach at 150-250 feet in altitude. (3) I have never seen ANY aircraft in this area in my life at this altitude. The only aircraft I ever saw at this altitude was maybe a few years before, it was probably 2000 feet high and easily a small turbo prop such as a Cessna. The only aircraft in the area I ever see are close to Coates, MN which is 10 miles north of where we were because of a small regional airport in South St. Paul about 5-10 miles north of Coates. However, this is very rare and the only large aircraft I see are north of the South St. Paul airport and they are from the Minneapolis-St. Paul international airport, which is a good 25-30 miles northwest of my sighting. I know of no military bases in the direction of travel this craft was heading. The area it was tracing was one of very low population. The only \"city\" it would have intersected in its direction of travel would have been Mankato, MN which is a good 65-75 miles away. The area is literally farm country and not many towns exist in the area. Any of them which do are very small in size and population."],"trends":["There have been 3 other sightings in Cannon Falls","There were no other sightings in Cannon Falls on or around August 31st 1998"],"Log Number":"US-01012010-0018","Tags":"City","Latitude":"44.516791","Summary":"Black Triangle 150-250 Feet Above me","Source":"MUFON","Weather Factors":"None","Region":"Minnesota","Disposition":"Unknown","Object Shape":"Triangle","Case Number":"21307","Date of the Event":"08/31/1998 06:30 UTC","Object Features":"None","Country":"United States","Date Submitted":"01/01/2010 05:17 UTC","Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.516791,+-92.897724(21307)&iwloc=A&hl=en\"> mufon case (21307) map </A>","files":["/var/www/straped/mufon/html2text/21307.html.txt","/var/www/straped/mufon/org/21307.html"],"Viewing Distance":"Unknown"}