{"files":["/var/www/straped/mufon/html2text/21300.html.txt","/var/www/straped/mufon/org/21300.html"],"Latitude":"51.05248","Object Flight Path":"Stationary","Longitude":"-114.053622","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around July 15th 1969"],"Country":"Canada","Object Features":"Window(s)","Date of the Event":"07/15/1969 12:00 UTC","Summary":"Saw it in the sky and saw little lights comeing out of it","Date Submitted":"01/01/2010 01:53 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=51.05248,+-114.053622(21300)&iwloc=A&hl=en\"> mufon case (21300) map </A>","City":"Calgary","Weather Factors":"Unknown","divs":["Sighting DetailsA childhood friend and my self were in the back yead of my mom n dads place in Calgary, we wereplaying for a bit then we layed on the hill in the back yead to watch the stars, We saw a red thing in the shy miles away for us we could se air planes comeing in to land at the air port , but this was farther than the planes we watchedfo a long time 10 to 15 min. I went in side totell my folks about it, they were haveing a plarty,and a few gursts came out to lookat it too thought it was funny and every one went back in side my friend and I watch this for a long time after . the big red light was letting little lights come out .the red one just stayed where it was in the sky n movement.while the little lights came flying out of it.... it was there long after I walked my friend home I watched it a bit longer cant recallhow long but my folks called me in caouse it ewas too late for me to be out side....from my bed room window I couldnt see the redone but I couls still see the whte ones every so often..... I think it was still the next day when the TV and radio said there were UFO sightings around Alberta.. I tryed then to tell people I saw them but wea told I was just makeing it up.. there were some men I dont recall if they were army or police they came by and asked what I saw ..my friend and I told them and they said we were just makeing it up and not to carry on or there would be trouble .. I bel;ieveI was about 10 or so years old at the time . .. Last year in 2009 I talked it over with Stanton Friedman, whi after hearing my story said that I should let more know about it as for more people who had seen this would come foreword. I hope this helps in your studys. Also my auntsaw one land in her back yard this was checked out by police and other groups,it has been years sinse and the crop still wont grow in the place. I cant say all that happed there but she could tell you the hole story and she in one who thinks that this kinda stuff is garbage but now believes too. Bryan S."],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"CA-01012010-0011","Case Number":"21300","Region":"Alberta","Object Shape":"Oval","Disposition":"Unresolved"}