{"Object Flight Path":"Hovering then path,Path with directional change","trends":["There have been no other sightings in Winnsboro","This sighting has never been favorited."],"Country":"United States","Weather Factors":"Fog, Light","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was on my way to work as usual. When I came upon the stop sign, I saw a glimmer of light on my back glass. There were no cars around. So I didn't think nothing of it. As I pulled onto the next road, I noticed the light was still there. I stopped and got out the car to look and see if maybe there was something on the car. That's when I saw the object above me in the sky. It was diamond in shape and the lights were so beautiful and colorful. The lights were all on the outside and the exact same lights were inward torward the center of it(the same shape). I tried to take a picture of it on my cell phone, but it wouldn't show up on my phone. I got back in my car and continued down hwy 269. It was flying really low, and got out in front of me, so now I could see it as I was driving. It was almost like it was following me. I started flashing my headlights at it and it flashed back at me with lights so bright that I could hardly see. As headlights from another car was coming, the object shot off straight up so fast, it was gone in an instant. To tell you the truth, it was kind of scary. But at the same time, it was very cool. I, myself, am glad to see that there are others out there. And more communications with them would be great."],"Object Features":"None","Date Submitted":"01/01/2010 08:21 UTC","Latitude":"34.380701","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-01012010-0020","City":"Winnsboro","files":["/var/www/straped/mufon/html2text/21309.html.txt","/var/www/straped/mufon/org/21309.html"],"Tags":"City","Region":"South Carolina","Object Shape":"Diamond","Case Number":"21309","map":"<A HREF = \"http://maps.google.com/maps?q=34.380701,+-81.086478(21309)&iwloc=A&hl=en\"> mufon case (21309) map </A>","Summary":"Early morning scare","Longitude":"-81.086478","Date of the Event":"12/23/2009 06:17 UTC","Source":"MUFON"}