{"Date Submitted":"01/01/2010 02:40 UTC","Summary":"Red pulsating object; bright as compared to stars; moved past stary background","Country":"United States","Date of the Event":"12/31/2009 09:55 UTC","Longitude":"-97.928734","files":["/var/www/straped/mufon/html2text/21302.html.txt","/var/www/straped/mufon/more/21302_submitter_file1__2009.12.319_55PMUAPSighting.jpg","/var/www/straped/mufon/org/21302.html"],"divs":["Sighting DetailsWe were driving north on Lorraine avenue (approaching 43rd street). Approximate time was 9:55 (before 10:00PM when event was noticed to end). My wife was witness to this event. A very bright redish, pulsing star like object appeared to be moving south against the night sky (clear, stary night). Was traveling north in the car when noticed on my left (West) at about 20 to 25 degrees above horizon. Stopped the car to make a better observation. When I stopped the object stopped moving and remainded stationary against the backdrop of other stars (this was for about 3 minutes while sitting stationary on the open road). I rolled down the window and noticed no audible sound (e.g. there were no aircraft engine noises or otherwise in the area). I felt a bit silly about it and resumed to accelerate my car to continue my travel northward on Lorraine. Object immediately began to move South bound again. After which, I slowed my car to make a 2nd observation. At which point the object appeard to slow to a stop again as well. It was at this time that things started to get a little more interesting for us (about 30 seconds or so). The object slowly resumed an accelerated pace South bound again then reduced brightness after which it abruptly changed course upward at a 45 degree angle -- all within a fraction of a second and with brightness continuing to fade -- all within 5 seconds and became no longer observable. I observed the time was 10:00PM at the end of the event. I am a 47 year old engineer and this was my first observation of any strange arial phenomena."],"Object Flight Path":"Hovering then path,Path with directional change","Log Number":"US-01012010-0013","Latitude":"38.067744","Object Features":"None","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"None, Does Not Apply","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.067744,+-97.928734(21302)&iwloc=A&hl=en\"> mufon case (21302) map </A>","Object Shape":"Sphere, Star-like","trends":["There have been 4 other sightings in Hutchinson","There were no other sightings in Hutchinson on or around December 31st 2009","This sighting has never been favorited.",""],"Sighting Duration":"00:05:00","City":"Hutchinson","Region":"Kansas","Case Number":"21302","Disposition":"Unknown"}