{"Date of the Event":"01/01/2010 12:00 UTC","Tags":"City","Summary":"yellow/orange lights in triangular pattern","Case Number":"21305","Object Features":"Unknown","Object Flight Path":"Hovering then path","Longitude":"-90.546234","Region":"Missouri","files":["/var/www/straped/mufon/html2text/21305.html.txt","/var/www/straped/mufon/org/21305.html"],"Viewing Distance":"Unknown","Latitude":"38.595053","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.595053,+-90.546234(21305)&iwloc=A&hl=en\"> mufon case (21305) map </A>","Country":"United States","City":"Ballwin","Disposition":"Unknown","Date Submitted":"01/01/2010 03:53 UTC","Weather Factors":"Unknown","divs":["sighting details had waited for new years eve to sound off- fire works gun shot ect. headed off to work was traveling north bound on new ballwin rd- when noticed bright yellowish orange strobing star in the sky- rapidly qued in on color and slow movement of the \"star\" eastward, as my driving position changed i noticed a triangular arrrangement of 3 lights and its uniform motion eastward bound- i was looking to identify the position of these lights as an object. i looked at the radio clock for a time. a giant triangle but really could not verify that. then i found another yellowish orange light to the west in the same line as the base line of the triangle.following slightly behind the traingular formation. i got my cell phone out and tried to snap some pics. i was concerned about burning out the image- with the cars interior lights so i manuvered the car and turned off the lights- had traffic and by the time i was ready the object were gone. tooo short i hope some one else has seen the lights- perhaps lamber airport area?? when the yellow orangelight blendsy the become \"lazor\" coloered red\\orange- i was quite hopeful of seeing a huge triangular ship like others have reported but could not distinguish any physical connection between the moving lights ill try to et some help to get the pic form my cell camera"],"trends":["There have been 4 other sightings in Ballwin","There were no other sightings in Ballwin on or around January 1st 2010"],"Object Shape":"Star-like, Triangle","Source":"MUFON","Log Number":"US-01012010-0016"}