{"Object Shape":"Sphere","Case Number":"21308","Sighting Duration":"00:00:01","Summary":"Tiny Greyish Metallic Spheres May Have Come Through My Wall Again..","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"California","Object Features":"Undisclosed","City":"Santa Monica","Country":"United States","Date of the Event":"12/26/2009 12:00 UTC","Log Number":"US-01012010-0019","files":["/var/www/straped/mufon/html2text/21308.html.txt","/var/www/straped/mufon/more/21308_submitter_file1__UFOPics1.1.10001.jpg","/var/www/straped/mufon/more/21308_submitter_file2__UFOPics1.1.10002.jpg","/var/www/straped/mufon/more/21308_submitter_file3__UFOPics1.1.10003.jpg","/var/www/straped/mufon/org/21308.html"],"trends":["There have been 20 other sightings in Santa Monica","There were no other sightings in Santa Monica on or around December 26th 2009","This sighting has never been favorited.",""],"Tags":"City","Viewing Distance":"20 Feet or Less","Latitude":"34.025544","Disposition":"IFO","Date Submitted":"01/01/2010 05:21 UTC","divs":["sighting detailsto understand what happened at like 2:30 am on i believe late friday night or early saturday morning u have to understand what happened to me in 1989. i was renting a 2 bedroom condo in north dallas. i had a roommate, carole. also who stayed in the bedroom directly across the living room area from my bedroom. i was walking out of my bedroom around like 1 pm and i turned my eyes to the right as i was going through the doorway and i hear this \" pop \" sound and i see three tiny(maybe like 3 or 4 inches in diamater) greyish-metallic spheres fly right through the wall !!!!....i have like 21\\10 vision up close and i was maybe like 2 feet away so i could see them so clearly. they were also flying in an elliptical pattern and i could see that the \" popping \" sound was them literally expanding and contracting the wall as they went through it !!..i could even see that \" doppler effect \" colors kind of pooling on the surface of the spheres..my roommate carole was coming out of her room too ans saw something but she was like over 10 ft away at least....i only saw them for less than a second and they were gone so they must have been going very fast...ok now fast forward to the present. i was in my bathroom and brushing my teeth...after taking a shower....and i hear that \" pop \" sound again coming from the other room in the living room area which i have converted to my bedroom too and the bedroom i use as like a storage area kind of and that's where the barhroom is....so, anyway that night or the next night(i am not sure) i was walking out of my bathroom into my living room\\bedroom area and i see these two perfect symmetrical cirles on my carpet in front of my bed !!!...they look like \" crop circles \" and one even has what looks like a star map inside it and they are very close to the same diameter of the spheres i saw in 1989 !!!..i wasn't going to report it then i remembered that crop circles can have radiation left behind and i am wondering if these are emitting some kind of toxic radiation.....could u plesse come and use a geiger counter to check them out.......i have enclosed photos thanks cici leah campbell"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.025544,+-118.485401(21308)&iwloc=A&hl=en\"> mufon case (21308) map </A>","Longitude":"-118.485401","Source":"MUFON"}