{"Latitude":"29.035239","Tags":"City","Disposition":"IFO","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Straight-line path","Date of the Event":"06/30/1993 01:30 UTC","files":["/var/www/straped/mufon/html2text/21319.html.txt","/var/www/straped/mufon/org/21319.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.035239,+-80.923798(21319)&iwloc=A&hl=en\"> mufon case (21319) map </A>","Summary":"while on my way over to the beach side at New Snyrna I spotted a cloud that was like none I have ever seen before or since.","divs":["Sighting DetailsI was on the new Bridge on the South Causewas Heading East towards the beach side,( the bridge is very high about 200 - 300 feet above the Intercoastal waterway ) I was on the upward climb towards the top of the bridge when I noticed the cloud. The cloud appeared to be between 500 and 1000 feet up in the air. (from the bottom of the cloud. I saw no aircraft in the air at the time.) It appeared to be at least a mile or more in lingth and was headed towards the inlet between New Smyrna Beach and Port Orange Fl. It was long and rectangular, which was sloaped towards the top,the top appeared to be flat in my openion, and tenderals of what I can only discribe as (smoke) or clouds that seemed to be reabsorbed by the cloud. The tendrals were being pulled back up into the cloud itself. It appeared to be wavy, gray and dark lines of clouds all going in one direction the whole lingth of the cloud. I have never seen a cloud like it before or since. I first noticed the cloud when I started up the incline of the bridge.It literally filled my view through the windshield of my van. You could not miss it. At first I thought It was just a cloud but when I got further up the ramp at the top of the bridge you could see the whole cloud and could not but wonder why it appeared as it did. The cloud appeared to be traveling in a north northeast direction and you could not miss it.Discribe my feelings-- I was astonished, and had a very uneasy feeling. I was in a hurry for an appointment, and could not stop to obsurve the cloud. And I am not sure I really wanted to stop and watch it anyway. It was rather scary. I just continued on down the other side of the bridge and to my appointment. It was almost as if something did not want me to stop anyway. There was lots of traffic that day but I think I only saw one vhecial on the east side of the bridge (headed west) that appeared to be stopped to watch the cloud."],"trends":["There have been 9 other sightings in New Smyrna Beach","There were no other sightings in New Smyrna Beach on or around June 30th 1993"],"Object Shape":"Blimp, Bullet, Missile, Cigar, Cylinder, Square, Rectagular","Date Submitted":"01/02/2010 10:20 UTC","Region":"Florida","Object Features":"Patterned Surface, Other","Longitude":"-80.923798","Weather Factors":"Does Not Apply","City":"New Smyrna Beach","Log Number":"US-01022010-0004","Case Number":"21319","Country":"United States"}