{"Latitude":"39.526772","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/21312.html.txt","/var/www/straped/mufon/org/21312.html"],"Object Features":"None","Viewing Distance":"101-500 Feet","Log Number":"US-01012010-0023","Object Shape":"Circle","Sighting Duration":"Undisclosed","Date Submitted":"01/01/2010 09:59 UTC","Tags":"City","City":"Brazil","divs":["Sighting Details I was east bound on US 40 between Terre Haute and Brazil late at night. I was with my girl friend at the time. It was a very clear bright cloudless night, one of those where you could see very well without lights. We were just passing the Wagon Wheel resturaunt when I noticed a stopped car up ahead across the divided highway. I think it was a station wagon. The driver was outside the car standing in the road facing south. As I said it was a VERY bright night. I slowed down and wondered aloud what was he doing and what was he looking at. I looked up and out of the windshield and saw nothing, but when I looked south out of the passenger window I saw a circle in the sky.I stopped the car a block or so west of the other car and got out myself and stood in the road beside my car and looked at the circle. When first seen it was about 30 degrees above the horizon and almost straight south. It was moving north by north east at a steady pace. As it got closer I could see a ring of white cloud that seemed to have a dark ring inside the vapor. The vapor seemed to rise from the bottom of the ring and move around the structure along a vertical axis. None of it trailed away, but it did look to move. The object passed overhead at a slight angle to the east of me and moved off to the north. It moved from horizon to horizon in a minute or two at most. My girl friend was scared and screaming for me to get in the car and leave. I made no attempt to contact the other observer. Several years later the other fellow wrote down his sighting for a local newspaper artical on UFO sightings. At the time I was a 23 year old Vietnam veteran who had just finished a tour with the Army Air Defense Command at a missle site in Florida."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.526772,+-87.116815(21312)&iwloc=A&hl=en\"> mufon case (21312) map </A>","Date of the Event":"08/21/1975 10:00 UTC","trends":["There have been 7 other sightings in Brazil","There were no other sightings in Brazil on or around August 21st 1975"],"Country":"United States","Case Number":"21312","Weather Factors":"None, Light","Region":"Indiana","Longitude":"-87.116815","Summary":"A quick moving smoke ring","Source":"MUFON","Object Flight Path":"Straight-line path"}