{"map":"<A HREF = \"http://maps.google.com/maps?q=38.630102,+-90.196504(2131)&iwloc=A&hl=en\"> mufon case (2131) map </A>","Object Features":"Dome, Window(s)","Tags":"City","Object Shape":"Unknown","Object Flight Path":"Stationary,Unknown","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around July 12th 1974"],"City":"St Louis","Source":"MUFON","Latitude":"38.630102","Region":"Missouri","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/2131.html.txt","/var/www/straped/mufon/org/2131.html"],"Weather Factors":"Unknown","Longitude":"-90.196504","Country":"United States","Summary":"This was no light in the sky.","Date of the Event":"07/12/1974 08:40 UTC","Sighting Duration":"00:10:00","Viewing Distance":"21-100 Feet","Log Number":"","divs":["Sighting DetailsIt was a summer evening in St.Louis City. We did not have airconditioning. I wasstaying with my sister Linda,s and brotherinlaw Pat at there second floorflat.The building was one of those older building that had windows that camewithin 36 from the floor. My bed I was laying on, came even with window.I layedther with one of arms hanging out the window hoping to catch a cool brease onthat 100 degree day.All of sudden this ship slowly moved into my line of vision.I could not believe my eyes, In broad day light.The sun was starting set andstrarted to shadow some parts of the ground, But not this ship. It took on thatMissouri summer sunset orangeish glow that it was reflecting. I screamed for mysister a brother-in-law to get in here, Your not going to beleive me ,just getin here.My sister came into the room and looked out the window and looked overat me,but i refused to take my eyes off it.She colapsed in the coner resitingthe lords prayer.Pat started hitting himself in the face.Saying Im notdreaming.I said dont take youre eyes off it.It just hovered there for a least 10min.While Pat whent to look for his camera,the ship left in nothing but trail tothe north. It kind of reminded me of the mother ship on Battlestar Galactica,Itwas of wedge triangular shape.But the most strangist part was that we could seethe ship plan"],"Date Submitted":"07/12/1974 08:40 UTC","Case Number":"2131"}