{"Date of the Event":"01/01/2010 08:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Glasgow","Object Shape":"Fireball","Object Features":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Summary":"Orange balls of fire with airplanes chasing afterward's","trends":["There have been 22 other sightings in Glasgow","There were no other sightings in Glasgow on or around January 1st 2010"],"divs":["Sighting Detailsi was sitting watching tv and seen 2 orange lights in the distance as i have my blinds slightly opened. they looked strange and was alerted immediately my partner also bounced out his seat and we both gazed in amazement and could not figure out what they were. there were two lights orange in colour moving away from the hose at an angle. then i was immediately alerted as two round balls of fire floated over the building, a guesstimate they were 500 - 1000ft in the air they moved off quickly and then the two of them looked as if they merged into 1 then disappeared. then in the distance which i caught on video for about 23secs came in from the west direction and was moving erratically in a side ward motion. It quickly disappeared. wee stood and looked out the window for another 10 mins when 3 aeroplanes... Definitely aeroplanes as i could tell with the flashing lights on the wings flew at speed to where i seen the last object...this is the bit that has really startled me...what were the planes looking for ? Pretty freaked out about this now as i have never seen anything of the likes before."],"files":["/var/www/straped/mufon/html2text/21313.html.txt","/var/www/straped/mufon/org/21313.html"],"Latitude":"55.866827","Tags":"City","Case Number":"21313","map":"<A HREF = \"http://maps.google.com/maps?q=55.866827,+-4.245766(21313)&iwloc=A&hl=en\"> mufon case (21313) map </A>","Source":"MUFON","Date Submitted":"01/01/2010 10:47 UTC","Log Number":"GB-01012010-0024","Region":"Scotland","Longitude":"-4.245766","Country":"United Kingdom","Viewing Distance":"Unknown"}