{"Object Features":"Undisclosed","City":"Spring Hill","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/21321.html.txt","/var/www/straped/mufon/org/21321.html"],"Summary":"It looked like it was on fire. Definately a disc very large and extremely fast.","Disposition":"Insufficient Data","Date of the Event":"12/31/2009 09:15 UTC","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Log Number":"US-01022010-0006","Longitude":"-86.921012","Case Number":"21321","Date Submitted":"01/02/2010 01:58 UTC","Latitude":"35.756029","Object Shape":"Disc, Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=35.756029,+-86.921012(21321)&iwloc=A&hl=en\"> mufon case (21321) map </A>","Tags":"City","Country":"United States","Region":"Tennessee","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMy family and I were watching fireworks from my wifes and my bedroom window. A few minutes went by when we saw what looked like an airplane coming from the east at an incredible speed. As it got closer it stoped on a dime and hovered in the air maybe one mile from our house. From the looks of it it was disc shaped with lights going all around it. They didnt look at all normal, the entire ship...or object looked to be on fire. After hovering for what seemed two or three seconds it shot to the nort then stopped on a dime while it hovered again. Five seconds went by then at light speeds it vanished. Three seconds went by then another one came and did the exact same thing the one before did then vanished. After that one left three seconds later we saw the exact thing happed again. I know this all sounds crazy but it happened. My wife got curious and got online and typed in ufo sightings..springhill. The 10th of this month a neighbor of ours sighted the exact same thing. If anybody can explain what this is and why this keeps happening in my neighbor, id appreciate it."],"trends":["There have been 4 other sightings in Spring Hill","There were no other sightings in Spring Hill on or around December 31st 2009"]}