{"Date Submitted":"09/16/1994 10:15 UTC","Date of the Event":"09/16/1994 10:15 UTC","Object Flight Path":"Path with directional change","Disposition":"Unresolved","divs":["Sighting Detailsellen and i were driving south from wilkenson past carbonado returning from thestore going back to camp where our friend dave yasutake was waiting at camp. Inoticed a light off to my right up on the hill following up it seemed to keeppace with us. I thought it was strange because a car or motor bike would bebouncing and the light looked different like as big as a house. i then changfeddirection as we came to a turn and tree over hage ahgaed in the road. theobject stated down the hill at us and went dark and lights beamed down below it.I said do you see what i see, because i dont believe it ellen said yes.i just held on tight to the steering wheel the whole time. the object came donthe hill and into the road and as it reached the road the edge of it split openand the light beams below it went out and the edge open up to mak the objectglow all over it was in the road now and i could hit it with a rock it was soclose. then the object raised up slightly and the top dome area glowed morewhite than the under side which was glowing a orange-yellow with a red tingelikie a toy laser does on your hand. the way it stopped was starteling becuse itdidnt wiggle or wobble it just stopped perfectly and precisely.i tried communication by switching my headlight to parking lights and then downto off and then parking. and back to headlights. it didnt do any thing for sometime and we just kept staring at it.a sudden flash starteled me with no sound and the light source dimmed like afloadlight when turned off then my eyes slowly cleared and looked to seedarkness. the craft has gone.we looked at eachother and discussed breifly to eachother what did you seeabout a minuite later a dark orange light appeared on the ridge across theriver, it was slightly trasparent."],"Country":"United States","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/2132.html.txt","/var/www/straped/mufon/org/2132.html"],"Sighting Duration":"00:10:00","Latitude":"38.901682","Log Number":"","Viewing Distance":"21-100 Feet","Region":"Washington","Tags":"City","City":"Washington","Case Number":"2132","map":"<A HREF = \"http://maps.google.com/maps?q=38.901682,+-77.032956(2132)&iwloc=A&hl=en\"> mufon case (2132) map </A>","Weather Factors":"Unknown","Summary":"carbon river sighting on the road","Object Shape":"Unknown","Source":"MUFON","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around September 16th 1994"],"Longitude":"-77.032956"}