{"Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/21329.html.txt","/var/www/straped/mufon/org/21329.html"],"Longitude":"-119.811633","Log Number":"US-01022010-0014","Object Features":"Undisclosed","Latitude":"39.534163","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsMy husband, my mom, my youngest child and I were traveling East bound on I 80 just outside of Mustang when I first noticed a steady stream of red lights travel right in front of our vehicle. At first it almost resembeled sets of vehicle tail lights but I knew that that was not possible because vehicles do not travel in that direction on that part of the highway and the object was flying extremely fast. I was the first to notice it and got the attention of the others just in time to see the tail end of it. I immediately began looking for answers as to what it was but there was no explanation. We were still in shock when it happened again in the same direction (South heading North). This time all of us saw it very clearly but still are completely unaware of anyhing that this could be other than a UFO. The experience of the sighting was amazing. People will continue to be skeptical about this life form until something like this happens to them. I admit, I had my doubts, until tonight. There is not a question in my mind about what I saw. I saw a UFO."],"Country":"United States","Date Submitted":"01/02/2010 11:12 UTC","Date of the Event":"01/02/2010 12:00 UTC","Object Flight Path":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.534163,+-119.811633(21329)&iwloc=A&hl=en\"> mufon case (21329) map </A>","Case Number":"21329","Tags":"City","City":"Reno","Disposition":"Hoax","Region":"Nevada","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around January 2nd 2010"],"Summary":"Steady stream of synchronized red lights flew directly in front of my vehicle and continued to travel contouring the mountains.","Weather Factors":"Unknown"}