{"Log Number":"US-01022010-0009","files":["/var/www/straped/mufon/html2text/21324.html.txt","/var/www/straped/mufon/org/21324.html"],"divs":["Sighting DetailsI saw a triangle flashing multicolored object that appeared suddenly in the northeastern clear sky over Lake Erie on 12-26-09 at approx. 9 pm. Hovered silently then moved slowly over the lake heading west. Stopped again over head and vanished. This occured while I was laying on our boat pier the night after Christmas watching the stars on a super clear calm night. I was talking to a friend on the phone who later helped me recall the details I described to him and the length of time it took place. I remember nervously joking on the phone with him as it was happening that I was all alone in an isolated place and what if they just decided to \"beam me up\", that was when it slowed to a stop for the second time directly over head paused for a second or two and then vanished. I made a half joking comment to him about wondering if they were listening in to our phone conversation before taking off. It lasted only a few min. but the occurrence was so amazing because there was almost no wind blowing on the beach and the lake was super calm, yet the object did not have any sound like the rest of the planes that I was watching that night flying over the lake. There was a lot of air traffic in the sky being the day after Christmas and this was coming from an odd angle and in the opposite direction of the other planes. Also it did not continually move at times or have the right color lights or right blinking sequence of lights like a regular aircraft. Plus the shape was a triangle with no apparent row of lights along the widest bottom part. It looked flat black and was solid so as to block out any stars it passes over. I was lying very still for over 15 mins. On the pier just enjoying the beautiful clear night's sky before it first caught my attention in the corner of my eye. I just continued to lay there in amazment while describing it to my friend on the phone. He told me to take a picture but I figured that by the time I brought up the app on my iPhone it would be gone and I figured the phone wouldn't get a decent picture in the middle of the black night sky with no flash. Plus I was kind of shocked and could only watch and tell my friend what I was seeing I might have tried if I had my regular digital camera with me but it all seemed to happen so fast, I just couldn't take my eyes off of it while it was happening. It was so distinct, I'm sure I wasn't the only person to see such a strange sighting over the lake. I don't know if this had anything to do with anything, but right after it disapeared, clouds rolled in and a dense blanket of fog rolled onto shore from the north off the lake. The temp dropped sharply with the fog appearance and the rolling cloud cover although it had been crystal clear for the 3 hours I had spent there."],"Disposition":"Unknown","trends":["There have been 9 other sightings in Euclid","There were no other sightings in Euclid on or around December 26th 2009"],"Sighting Duration":"00:01:30","Case Number":"21324","Summary":"Appeared over lake hovered moved slowly hovered then disapeared in a blink of an eye","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Object Shape":"Triangle","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Ohio","Longitude":"-81.522097","Country":"United States","City":"Euclid","Object Features":"Unknown","Date of the Event":"12/26/2009 09:00 UTC","Source":"MUFON","Weather Factors":"None","Date Submitted":"01/02/2010 05:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.602335,+-81.522097(21324)&iwloc=A&hl=en\"> mufon case (21324) map </A>","Latitude":"41.602335"}