{"Weather Factors":"None, Does Not Apply","Latitude":"47.255707","Object Flight Path":"Stationary,Path then hovering","Log Number":"US-01022010-0008","Case Number":"21323","Source":"MUFON","divs":["Sighting DetailsI WAS ON MY WAY TO PICK UP SOME FRIENDS FROM PURDY AROUND 6PM AND SOMETHING MADE ME LOOK AT THE SKY, THEN DO A DOUBLE TAKE. THE NEXT DAY I REMEMBER I SAW A QUICK FLASH OF A BIG SHIP IN THE SKY AND IT DISAPPEARED, BUT AT THE TIME I DONT REMEMBER SEEING ANYTHING. ON OUR WAY BACK ACROSS THE NARROWS BRIDGE, I NOTICED A SMALL LIGHT, ABOUT STAR SIZE, WAS FOLLOWING US. AT FIRST I THOUGHT IT COULD HAVE BEEN A SATELLITE OR A PLANE. WE DROVE TO THE NEAREST PUBLIC LIBRARY AND PARKED, AND NOTICED THAT THE LIGHT WAS STILL FOLLOWING US. THIS MADE US KIND OF CONCERNED AND CURIOUS, SO WE FOLLOWED IT TO THE TACOMA WATERFRONT. ACROSS THE WATER, JUST ABOVE THE HORIZON, WAS A BRIGHT LIGHT, PULSATING DIFFERENT COLORS, AND HOVERING FOR 30 MIN ABOUT....THEN, ALL OF THE SUDDEN, THERE WAS A SECOND LIGHT THAT APPEARED NEXT TO IT, PULSATING THE SAME COLORS, AT THE SAME RATE. NOW I KNOW THAT THERE IS AN AIRPORT AROUND THE SAME AREA, BUT I KNOW PLANES DONT JUST HOVER. WE WATCHED IT FOR OVER AN HOUR, AND THEY WOULD GO AWAY FROM EACH OTHER, THEN WOULD COME CLOSER. MY FRIENDS AT THE TIME (I DONT TALK TO THEM ANYMORE FOR OTHER REASONS) WANTED TO GO HOME SO I TOOK THEM HOME AND CAME BACK AND THE LIGHTS WERE STILL THERE. THEN I NOTICED THAT THERE WERE LITTLE WHITE FLASHING LIGHTS COMING OUT OF THEM, LIKE LITTLE WHITE STROBE LIGHTS. THEN THE LIGHT THAT APPEARED, KINDA FLICKERED OUT, AND DISAPPEARED. SOON AFTER THE OTHER LIGHT DID THE SAME IT WAS LATE SO I DECIDED TO GO HOME. I DID HAVE THIS ON TAPE, BUT IT WAS LATER DESTROYED BECAUSE OTHER THINGS WERE ON THE TAPE THAT PEOPLE DIDNT LIKE. AFTER SEEING THIS, I KNEW FOR SURE WHAT I SAW WASNT CONVENTIONAL AIRCRAFT. I'VE SEEN OTHER THINGS LIKE THIS BEFORE, AND IM SURE IT WONT BE THE LAST. I KNOW MAURY ISLAND IS SOMEWHERE AROUND THERE AS WELL"],"Viewing Distance":"Over One Mile","Date Submitted":"01/02/2010 03:15 UTC","Sighting Duration":"02:00:00","Summary":"STRANGE LIGHTS SHOOTING OUT OTHER LIGHTS","Longitude":"-122.442661","City":"Tacoma","files":["/var/www/straped/mufon/html2text/21323.html.txt","/var/www/straped/mufon/org/21323.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.255707,+-122.442661(21323)&iwloc=A&hl=en\"> mufon case (21323) map </A>","Object Features":"None","Date of the Event":"06/01/2005 10:00 UTC","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around June 1st 2005"],"Disposition":"Insufficient Data","Country":"United States","Object Shape":"Star-like, Other, Unknown","Region":"Washington"}