{"Object Features":"None","Date Submitted":"01/02/2010 02:00 UTC","Latitude":"35.763883","Viewing Distance":"Unknown","Weather Factors":"Does Not Apply","Case Number":"21322","Country":"United States","Object Shape":"Other, Unknown","Longitude":"-79.01325","Region":"North Carolina","Sighting Duration":"00:08:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.763883,+-79.01325(21322)&iwloc=A&hl=en\"> mufon case (21322) map </A>","files":["/var/www/straped/mufon/html2text/21322.html.txt","/var/www/straped/mufon/org/21322.html"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was flying from Tampa, Fl to Pgh,PA Our Flight took off at 620pm. About an hour into the flight my 18 mo. old started flipping out...so my husband got up and started to walk her in the aisle. Out of embarrassment I started to stare out of the window. I noticed a series of orange lights that were pulsating in a sequence. At 1st I thought it was Christmas lights or an airport. It started in a foresty area and at 1st I thought it was much smaller than it was. But the lights started to go over highways and malls and then I realized that the size of the lights were about the size of a car. There were five of them and they stayed in the same formation. I guess the craft was invisible because I didn't see anything but lights. Every once in a while in addition to the five lights I would see a line of lights that kinda looked like this .................. It almost looked like as it was skimming over the ground that it was like a surge of energy would brighten up as it traveled. I watched this go on for about 10 minutes. It traveled parallel to the flight path but was nearly on the ground and I was however high up commercial airplanes fly. It wasn't scary, i'm not scared now. I'm not even sure it was anything. The only reason why I am reporting this is because I mentioned this to my friend who I just left in Florida that we got in okay told her about it and she told me to report it. Several times I looked away from the lights and told my husband what I saw seeing and he thought I was crazy. But every time I looked back I could see it again. It went away simply with no warning just the lights stopped pulsating and I guess it was gone. (note in the about when I mention where this happened...I don't know where exactly this happened but in order for me to report anything, I had to put something in there but I have no clue where it was. I am just estimating)"],"Disposition":"Unknown","Tags":"City","Date of the Event":"01/01/2010 07:31 UTC","City":"not known","Log Number":"US-01022010-0007","Source":"MUFON","trends":["There have been no other sightings in not known","This sighting has never been favorited."],"Summary":"while in an airplane I saw orange lights with invisible craft skimmimg above ground"}