{"files":["/var/www/straped/mufon/html2text/21335.html.txt","/var/www/straped/mufon/org/21335.html"],"Latitude":"38.258065","Disposition":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.258065,+-85.748536(21335)&iwloc=A&hl=en\"> mufon case (21335) map </A>","Country":"United States","Summary":"Large sphere traveling alongside plane approximately 200 feet from wing of plane.","Tags":"City","Case Number":"21335","Source":"MUFON","divs":["Sighting DetailsI was traveling via expressjet from Houston IAH to Louisville Kentucky for business. Facing the plane, I sat on the right side of the plane just ahead of the wing next to the window. Once we reached cruising altitude, I started reading a book.I became increasingly bored and looked outside my window. I noticed a sphere about the size of a compact car approximately 200 feet off the wing of the plane. It was dull in color. An unpolished metal nearly exact in the image of a VERY large ball bearing, it was perfect in it's spherical shape. Always looking for a logical, scientific explanation to anything paranormal first,I assumed it was a tiny bubble in the glass of the window or ice on the glass of the window. I studied it for about a minute and was astonished when i witnessed it move behind a small cloud. I immediately looked down the aisle and noticed many other passengers were looking outside the window at the object as well. I looked at the object again and noticed it never swayed, dove or maneuvered at all. It was very static in it's position. This made me skeptical. How can any craft fly alongside another craft and never move, in any manner from it's present position? Anything in flight is always fighting the physics of the atmosphere every second i.e. barometric pressure, wind, air pockets, friction, etc... I looked for an explanation. Maybe some strange tether to a weather balloon or refraction of light on the window? There was no physical explanation. It was what it was. My mind raced as I tried to understand how something so non-aerodynamic could possibly create lift. I looked for some sort of glow or exhaust or any type of radiation to explain it's terrestrial origin. Nothing. It sat at one position with no presence of any mechanical movement. It appeared as if it was observing us, though there were no visual ports or windows. I didn't take my eyes off of the object as I knew I was witnessing something extraordinary and oddly beautiful. I, for the first time in my life was truly in awe. We traveled into a thick cloud formation. I witnessed the sphere pass through a patch of thick cloud and never resurface. as soon as it appeared it was gone. Here is where things got weird. I looked down the aisle to hopefully catch eye contact with someone who was witnessing this event and could discuss this. What I witnessed next shook me to my core. All other witnesses, approximately 20 plus, just leaned back into their seats and continued reading their books, newspapers and laptops as if nothing happened. Why was I the only person who felt as if I just witnessed a magnificent moment? Whether it was a higher intelligence or something we created, it was a beautiful moment. I reflected on this for several minutes up to the final hour of our flight. Once we reached our terminal,I had totally forgotten the entire experience. How could this happen? How could I forget an experience that shook my entire core and being? Several years later I started to slowly recall my experience. Why did the other passengers not even have any sign of expression on their face after the incident? Why did I totally forget the entire experience until many years later?"],"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around November 30th 2004"],"City":"Louisville","Date of the Event":"11/30/2004 12:00 UTC","Log Number":"US-01032010-0006","Date Submitted":"01/03/2010 01:10 UTC","Viewing Distance":"101-500 Feet","Region":"Kentucky","Longitude":"-85.748536","Object Features":"None"}