{"Log Number":"GB-01032010-0007","Tags":"City","Latitude":"40.047006","Source":"MUFON","Object Flight Path":"Unknown","Weather Factors":"Unknown","Region":"Pennsylvania","Object Shape":"Oval, Other","Date of the Event":"12/30/2009 07:38 UTC","Summary":"Caught on camera","Longitude":"-76.298954","Viewing Distance":"Unknown","Country":"United States","Disposition":"Unresolved","trends":["There have been 22 other sightings in Lancaster","There were no other sightings in Lancaster on or around December 30th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/21336.html.txt","/var/www/straped/mufon/more/21336_submitter_file1__036.JPG","/var/www/straped/mufon/org/21336.html"],"Object Features":"Undisclosed","Date Submitted":"01/03/2010 02:30 UTC","Sighting Duration":"Undisclosed","City":"Lancaster","map":"<A HREF = \"http://maps.google.com/maps?q=40.047006,+-76.298954(21336)&iwloc=A&hl=en\"> mufon case (21336) map </A>","divs":["Sighting DetailsOn the night of the 30th I was continuing an evening photo session I had been conducting over the previous 2 nights.My subject was not UFO's,my camera is Samsung compact 10.2 megapixel which I have set on superfine.This night I set the camera to the dim light setting placed it on a high stool to hold it steady while pointing slighly upward I took 4 photo's over a 12 second period and stopped as the flash did not work on this setting.As I was deleting the blank photo's the third had an image of an object lighting up the cloud base the fourth photo was blank. I was facing north at the time weather was cloudy, cloud base approx 4000ft no stars visable, I didn,t see the object as I was not looking up ward only the camera caught it in seconds.I submit the photo for your examination for there is more to see upon enlargement.AS well as the main bright object there 2 other dimmer on the same trajectory and something poking through the cloud upper left of the object. What did I think brilliant as at various times over the last 40yrs I,ve seen ufo's 4 times but never captured one on camera."],"Case Number":"21336"}