{"Latitude":"40.449725","Object Flight Path":"Straight-line path","Log Number":"US-01032010-0010","Source":"MUFON","Viewing Distance":"101-500 Feet","Longitude":"-79.992996","Case Number":"21339","Weather Factors":"Unknown","Object Shape":"Triangle","Summary":"12-28-2009: Inverted V shaped illuminated object witnessed.","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsOn 12-28-2009 at around 11:40. The day had been overcast, but as the night approached the clouds gave way to partial clearing and you could see some stars. I was sweeping snow from my front walk and driveway when out of the corner of my eye I saw what I thought was a formation of geese(not knowing if geese fly at night) I turned to look and realized I was looking at a inverted \"V\" shaped object maybe the size of three commerical jets. The object was illuminated by beautiful amber colored lights spaced evenly around two sides of the inverted \"V\". The object was cruising lower than any plane I had ever seen and there was no sound coming from the object other than a wisp of air being displaced. I realized the object must of flown unnoticed almost directly above me as it was on a southeastern course. I watched the object for about 25 seconds before It did disappear into a cloud. I watched for about five minutes more, but I did not see It again. The inverted \"V\" was not a solid triangle shape, the back of it seemed to have 90 degree fins which also had the amber lights, but I am not absolutely positive about this. I immediately told my mother what I saw and the next day my uncle. My uncle ask me if it could have been a sleath bomber, but I have seen the sleath and the answer is no. I have told no one else for fear of being thought crazy and thought long and hard in telling MUFON! Thank You for your time, James Bronowicz"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.449725,+-79.992996(21339)&iwloc=A&hl=en\"> mufon case (21339) map </A>","Date Submitted":"01/03/2010 06:51 UTC","Region":"Pennsylvania","Country":"United States","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around December 28th 2009"],"City":"Pittsburgh","Object Features":"Appendage(s)","files":["/var/www/straped/mufon/html2text/21339.html.txt","/var/www/straped/mufon/org/21339.html"],"Date of the Event":"12/28/2009 11:40 UTC","Sighting Duration":"Undisclosed"}