{"Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"01/03/2010 10:38 UTC","Object Shape":"Disc, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=51.903317,+-8.471689(21334)&iwloc=A&hl=en\"> mufon case (21334) map </A>","Case Number":"21334","Tags":"City","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/21334.html.txt","/var/www/straped/mufon/org/21334.html"],"Object Features":"Unknown","City":"Cork","Date of the Event":"12/31/2009 09:30 UTC","Weather Factors":"None","Region":"County Cork","Summary":"2 objects flew over house. 1 followed the other","divs":["sighting detailsmy husband was looking at the moon through a telescope on the patio, (it was the blue moon and we had observed the partial eclipse earlier in the evening). i was in the house when he called me. his eye had been caught by a large orange\\red disc in the sky. it was moving from north to south over our house. i didn't arrive quickly enough but then another object, identical to the first, appeared. i saw the orange\\red disc like object travelling silently across the sky towards the south. initially we thought it was a meteor about to break through the atmosphere but it was much too large and the height was difficult to determine as it was a very clear night. the second object when i saw it was about a quarter the size of the full moon and became redder in colour as it moved. it continued southward, to the west of cork airport, over the sea until it faded from sight. it did not burn out, as a meteor might. it did not appear to drop in altitude as a falling object would. it had no navigation lights but moved at sort of helicopter speed (faster than a satellite would and much larger anyway.) our 2 younger children 15 and 10 also saw this object. we are sure it was not a man-made object due to the silence of the movement. neither of us have ever thought much about ufos before as my younger son said it was definitely unidentified and flying! so it was a ufo!"],"Disposition":"Unresolved","Latitude":"51.903317","Log Number":"IE-01032010-0005","Longitude":"-8.471689","Country":"Ireland","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Cork","There were no other sightings in Cork on or around December 31st 2009"]}