{"files":["/var/www/straped/mufon/html2text/21330.html.txt","/var/www/straped/mufon/org/21330.html"],"Country":"United States","Source":"MUFON","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Shape":"Other","Region":"Maryland","Date Submitted":"01/03/2010 12:50 UTC","Disposition":"Unknown","Object Features":"Other","Latitude":"38.902382","Summary":"very large sort of oval shaped metallic object","Sighting Duration":"Undisclosed","Case Number":"21330","Log Number":"US-01032010-0001","map":"<A HREF = \"http://maps.google.com/maps?q=38.902382,+-77.034666(21330)&iwloc=A&hl=en\"> mufon case (21330) map </A>","Tags":"City","Weather Factors":"None","City":"Washington","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Longitude":"-77.034666","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around February 1st 1989"],"Date of the Event":"02/01/1989 12:00 UTC","divs":["Sighting DetailsIn feb. 1989, I lived in Waldorf Md. grew up there, I was driving over to my mothers house to take her to the store I was driving down a backroad , nearing the stop sign on acton lane, off in the distance was a very strange looking object in the sky, it was moving in a very strange pattern, it would move to the right very fast then to the left very fast then straight up and then back, it continued to do this for about 7 minutes I did not know what this thing was so I just went on to my mothers house which was about a mile.I picked her up and started driving her to the store, I backed out and pulled to the stop sign by her house and there was the same object up close now flying right above the tree tops and moving very slow.This object was very large, it was about the size of a football field, it was sort of oval shaped, metallic in color, it had no windows, no lights,around the center had lipped edges thats how close the object was to us, it made no sound, and the strangest thing about this object is it had like a black tube looking thing coming from the bottom center about half the lenght of the object, for some reason I felt as if it was searching for something.And I knew this was not something from our world.Then the following night I go back over to take her to the store again around 10 pm as we are pulling out from the same stop sign we see a lot of lights in the sky fling in a strange pattern that I have never seen before, they were flying at an average speed and we watched them out of sight. Now the funny thing is when we got back to her house we were watching the news and the news castors were making jokes about the flying objects or lights flying over Andrews Airforce base and making jokes about them being ufos.I will never forget this event and it will always be very clear in my mind. I will also send a sketch of what it looked like. I have drawn it so many times.And just to let you know I do not drink or do drugs I am a well respected person. I never reported this because for one I did not know who to report it to, and people just think you are making it up. What I saw that day and the next was very real.I want this to be on record some where, and that someone else knows about it."]}