{"Summary":"RAPID MOVEMENTS SO FAST I COULD NOT TRACK IT WITH MY HEAD/EYES. MORE VISABLE INFRONT OF TREES AS IT PASSED BY. NO APPARENT FLIGHT PATTERN, MORE LIKE A BUZZING FLY, THERE THEN GONE, NOW THERE ETC....","Tags":"City","divs":["sighting detailsrapid movements so fast i could not track it with my head\\eyes. more visable infront of trees as it passed by. no apparent flight pattern, more like a buzzing fly, there then gone, now there etc.... some circaling. distance 2 ft. to 500feet. i was walking my two dogs and they noticed it as well, barking and making fleeting efforts at chase. very strange experience-first ever. it followed us through the park and to my car, have not seen it since. i first thought someone had a lazer or pinpoint powerfull flashlight moving it from all directions its actions ramped up as i walked almost to get me going in a particular direction. it would circal at the outermost obstacles then seem to pass through and by me like a buzzing fly. at first i was looking for who or what could be making this and then realized it was impossible. became sceptical of my own eyes, but the dogs reminded me i wasn't the only one seeing things. the mood was apprehensive and cautious at first but then my dogs were playing and i was trying to talk to it... so no real fear, other than the unknown. we were done with our walk and left..."],"Date of the Event":"01/03/2010 10:20 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.458247,+-112.069587(21345)&iwloc=A&hl=en\"> mufon case (21345) map </A>","files":["/var/www/straped/mufon/html2text/21345.html.txt","/var/www/straped/mufon/org/21345.html"],"trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around January 3rd 2010"],"Region":"Arizona","Country":"United States","Log Number":"US-01042010-0002","Case Number":"21345","Longitude":"-112.069587","Source":"MUFON","Object Features":"None","Latitude":"33.458247","Viewing Distance":"20 Feet or Less","City":"Phoenix","Disposition":"Insufficient Data","Object Shape":"Star-like","Weather Factors":"None","Date Submitted":"01/04/2010 03:44 UTC","Object Flight Path":"Other"}