{"files":["/var/www/straped/mufon/html2text/21347.html.txt","/var/www/straped/mufon/more/21347_submitter_file1__P1010151.jpg","/var/www/straped/mufon/more/21347_submitter_file2__P1010140.jpg","/var/www/straped/mufon/more/21347_submitter_file3__P1010171.jpg","/var/www/straped/mufon/org/21347.html"],"Date Submitted":"01/04/2010 12:31 UTC","Longitude":"-119.032634","map":"<A HREF = \"http://maps.google.com/maps?q=37.630769,+-119.032634(21347)&iwloc=A&hl=en\"> mufon case (21347) map </A>","Summary":"Chemtrails, then Reflection type rainbow, then 2 orbs.","Disposition":"IFO","Country":"United States","City":"Mammoth Lakes","Viewing Distance":"Unknown","Date of the Event":"01/03/2010 12:00 UTC","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"37.630769","divs":["sighting detailsi was in the back seat with my son, on the 395 south, near mono lake, when the driver noticed a bunch of x type clouds in the sky, then we saw many white airplanes leaving contrails, but these weren't normal contrails. they did not disappear, and they grew huge, some the the trails were stringy, some were thin and then epanded, then as we reached the mono lake veiw point we noticed a rainbow. i took a picture through the window, and was happy with it, so we didn't get out of the car. we then saw some white planes flying over leaving the never disappeaing trails and we all decided that the planes must be seeding the clouds for rain? but, why would they send 100's of these large planes out... we pulled out back on the 395 and i noticed another rainbow? now there were 2, i took some pictures and said you guys these areen't rainbows. if they were they would have been gone by now. the driver said yeah i thought rainbows disappear pretty fast. then he kinda was looking worried at the sky. i started taking pictures of te rainbows they seemed pretty much to stay in the sky and thats when i noticed something moving in and around the rainbow\\trails. i tought now i'm gonna catch a picture of what it is. as we headed to the top of mammoth mountain i took so many pictures then i kinda thought my self crazy. lol. i had to go to the restroom, and as i was getting out of the car i saw the rainbow\\prisim\\whatever it was move again... i took a picture and then i looked at the picture and almost fainted. i finally got a picture of what was moving . you can see the series of photos at utube. if you want to look at them. the spheres hid in the trails of the white planes, and i then felt i really seen a ufo. i felt kinda weird and said to myself look and see if you see anything like what they looked like in any of the pic's i took. went through nothing. nothing was a green round and white round 3d looking in my camera. i showed the picture to my friends in the front seat. and they really got scared and said lets get outta here. we lost sight of the spheres but continued seeing the chemical trails and white planes till we got to little pine and the sun went down and it became dark."],"Object Shape":"Sphere, Other, Unknown","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-01042010-0004","Region":"California","Case Number":"21347","trends":["There have been 2 other sightings in Mammoth Lakes","There were no other sightings in Mammoth Lakes on or around January 3rd 2010","This sighting has never been favorited.",""]}