{"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"01/04/2010 02:26 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.616168,+-83.71721(21348)&iwloc=A&hl=en\"> mufon case (21348) map </A>","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","Case Number":"21348","Summary":"SPACESHIP LANDED IN WOODED AREA FROM MY HOME","divs":["Sighting DetailsJULY 7,2005 9:30 PM I WAS LOADING A LADDER ONTO VAN WHEN I SAW A SPACEHIP IN THE SKY COMING FROM THE WEST I SAW A LIGHTED SPACESHIP WITH LANDING GEAR IT FLIPPED UP ON ITS SIDE TO AVOID HITTING SOME OF THE TREES AND THE TOP OF IT HAD A BIG LIGHT WHICH GLOWED SIMILIAR TO THE MOON AND IT LANDED IN A WOODED AREA ACROSS THE ROAD.THERE WAS INTENSE BRIGHT LIGHTS UNDERNEATH THE SHIP THE LIGHTS WERE BRIGHT AS A BOLT OF LIGHTING. AFTER ABOUT 15 MINUTES THE LIGHTS WENT OUT. I CROSSED THE ROAD AND WENT INTO THE WOODS TO SEE WHAT IT WAS. I CAME AROUND THE HILL THERE WERE 2 POLICE CARS THEY HAD SAW IT PREVIOUSLY IN THE SKY GOING OVER WAL-MART PARKING LOT.THEY LEFT CONTINUED TO WALK OVER TO THE ARE WHERE I SAW IT.WHEN I GOT IN A DISTANCE THE SHIP HAD A LARGE FAN COVERING THE BOTTOM OF THE SHIP A DIM GLOW OF LIGHTS SHOWED FROM UNDERNEATH.THERE WERE 3 STEPS THAT CAME FROM UNDERNEATH WITH A SMALL DOOR ON THE SIDE OF THE SHIP. I WALKED AROUND IT AND LOOKED UNDDERNEATH IT I THOUGHT IT WAS FROM THE AIRFORCE. I WALKED INSIDE IT WAS DARK INSIDE THE FAN WAS BLOWING AIR REMINDED ME OF A BROILER ROOM IN A FACTORY. I SAW A HEAD THAT LOOKED LIKE A KANGEROO. THE INSIDE WAS FILLED WITH ELECTRICAL CABLES WITH VENT PIPES GOING UP TO THE TOP OF THE SHIP. THERE WERE 3 THEY TURNED AROUND THEY WERE SHORT WITH LARGE BLACK EYES. THEY HAD SKIN LIKE A LIZZARD. THEY CAME TOWARD ME BUT MADE NO SOUND OF COMMUNICATION.i HAD A FLASHLIGHT IN MY HAND THEY REACHED FOR THE LIGHT. I HANDED THEM THE LIGHT THEY BEGN SHAKING THE LIGHT. I JUST STOOD THERE LOOKING AT THEM I TRIED TO COMMUNICATE WITH THEM BUT THEY DID NOT RESPOND BUT THEY WERE LOOKING AT ME CURIOUSLY. ONE TOUCHED ME ON THE ARM AND IT SCARED ME SO I RAN OUT OF THE WOODS AND BACK ACROSS THE ROAD."],"trends":["There have been 3 other sightings in Middlesboro","There were no other sightings in Middlesboro on or around July 7th 2005"],"City":"Middlesboro","Disposition":"Unknown","Source":"MUFON","Country":"United States","Tags":"City","Longitude":"-83.71721","Date of the Event":"07/07/2005 09:30 UTC","Object Features":"Dome, Louvres","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/21348.html.txt","/var/www/straped/mufon/org/21348.html"],"Object Shape":"Disc","Region":"Kentucky","Log Number":"US-01042010-0005","Latitude":"36.616168"}