{"Disposition":"Insufficient Data","Case Number":"21344","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"01/04/2010 01:25 UTC","Weather Factors":"Unknown","Tags":"City","Country":"United States","Object Shape":"Fireball, Flash, Star-like","Region":"Tennessee","City":"Lenoir City","Latitude":"35.7991","Summary":"Two orange/yellow lights that stayed in the same spot for 8 to 10 mins","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-84.24893","Source":"MUFON","Log Number":"US-01042010-0001","trends":["There have been 2 other sightings in Lenoir City","There were no other sightings in Lenoir City on or around January 3rd 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=35.7991,+-84.24893(21344)&iwloc=A&hl=en\"> mufon case (21344) map </A>","files":["/var/www/straped/mufon/html2text/21344.html.txt","/var/www/straped/mufon/more/21344_submitter_file1__IMG_0002.JPG","/var/www/straped/mufon/org/21344.html"],"Date of the Event":"01/03/2010 06:20 UTC","divs":["sighting detailsi was getting a drink from the kitchen and looked out the window when i saw two spots of light. i have lived in my neiborhood for over 5 years and have never seen anything so unusual. i have no idea what it could be. the lights were seen in the east sky. there were two orange\\yellow lights side by side that stayed in the same spot for 8 to 10 minutes. i got my camera and started to take pictures. then the lights started to move left behind a line of trees. then it moved down for a second or two then moved up over the trees and back down behind them again. it was out of sight for at least 5 to 7 minutes. while it was out of sight i called my father, who lives close by, to see if he was able to spot it. he could not see it so i continued to watch for the lights. when it appeared over the tree line again the lights were flashing. it stayed for 20 or 30 seconds then started to move to the right in a straight line. then it changed direction back to the left in a straight line and i lost sight of it. i searched for several minutes and did not see it again."]}