{"Country":"United States","City":"Sierra Vista","Object Flight Path":"Stationary,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/21358.html.txt","/var/www/straped/mufon/org/21358.html"],"Object Features":"Unknown","Viewing Distance":"Unknown","trends":["There have been 11 other sightings in Sierra Vista","There were no other sightings in Sierra Vista on or around January 4th 2010"],"Longitude":"-110.273676","map":"<A HREF = \"http://maps.google.com/maps?q=31.55285,+-110.273676(21358)&iwloc=A&hl=en\"> mufon case (21358) map </A>","Date of the Event":"01/04/2010 06:50 UTC","Source":"MUFON","Object Shape":"Cigar","Disposition":"Unknown","Case Number":"21358","Log Number":"US-01052010-0001","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"None","Summary":"I thought it was the space station until it started moving side to side then moved across the sky to the far left then back then moved just above horizion and stayed there for about 15 more minutes then disappeared.","Latitude":"31.55285","Region":"Arizona","Date Submitted":"01/05/2010 12:21 UTC","divs":["Sighting DetailsI walked outside my home with my dog to play catch like we always do and looked up into the sky looking for shooting stars. When I looked up I seen something large and had twinkling lights. So I thought it was the space station. So I watched for just a few seconds and noticed it would move left to right like it was shaking then sit in one place not moving at all. so I wiped my eyes to ensure that my eyes weren't playing tricks on me. Then I seen a small white light the size of a star moving quickly towards it and as it got closer this object moved from the center of the sky 12 o'clock to 3 in a matter of 4 seconds then it came back to where it was at 12 alittle slower but still in just a few seconds slower. I tried calling my kids and my neighbor but got nobody on the phone. I tried to video tape it with my cell phone with no sucess. At this point I could see 3 bright white lights twinkling and a red 1 that never went out. I thought maybe it was a plane or a helicopter but after 20 years in the U.S. Army I know nothing we have is that fast, silent or that big. I watch the show UFO files and never thought I would see anything in my life. So after it went back to 12 o'clock I ran into my house to see if I had my rifle scope handy and found my high energy flash light and turned it on pointing it towards this thing and it moved north quickly to about 20 degrees aboue the horizon and stayed there for about 15-20 more minutes. Once it went North I ran next door to get my neighbor to witness this so I would know I'm not crazy or seeing things. He came out and could see the object sitting there with flashing lights for about 5 minutes and while I went into the house to finally get my scope and return it had just disappeared."]}