{"Object Shape":"Cigar","Log Number":"US-01042010-0013","Object Features":"Other","Object Flight Path":"Stationary","Source":"MUFON","Summary":"Same UFO that abducted women in Casey Cnty Ky?","trends":["There have been 7 other sightings in Covington","There were no other sightings in Covington on or around January 20th 1976"],"Sighting Duration":"00:05:00","Case Number":"21356","divs":["sighting detailsi'm not real sure of date or time. just know it was dark. me and a friend(both about 14) were walking down the street in covington ky headed for my house. had to be later in afternoon because it was dark out. as we started to turn into my yard. i noticed a cigar shaped object hovering over a hill. it had 2 beams coming from underneath, as it got closer to the ground, the light got wider. i say it was cigar shaped because of the placement of lights. it had various different colored lights around the edge blinking on\\off. seems like there should have been tons of reports because it sure looked like it was right above a big housing project. i went straight into the house and told my mom. she just looked at me like i was crazy. the next morning she had the newspaper open with the story about the 3 women in casey county ky being abducted. they described it exactally like i explained it to my mom. here is the really weird part for me. my family has always called me casey. i used that name until i was 18 and was forced to use my real name,,,lol they still call me casey. actually just pulled envelope out of mail with it being to casey mull. i thought for a long time it was a message. they abducted the women in casey county ky to let me know i was next. i will always believe that i saw the ufo that abducted those 3 women."],"files":["/var/www/straped/mufon/html2text/21356.html.txt","/var/www/straped/mufon/org/21356.html"],"Latitude":"39.092861","Date Submitted":"01/04/2010 11:42 UTC","Date of the Event":"01/20/1976 08:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.092861,+-84.505724(21356)&iwloc=A&hl=en\"> mufon case (21356) map </A>","Tags":"City","Disposition":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-84.505724","Region":"Kentucky","Weather Factors":"None","City":"Covington"}