{"Region":"Oregon","Log Number":"","Date Submitted":"06/06/2002 11:30 UTC","Date of the Event":"06/06/2002 11:30 UTC","Case Number":"2135","map":"<A HREF = \"http://maps.google.com/maps?q=42.448537,+-123.318902(2135)&iwloc=A&hl=en\"> mufon case (2135) map </A>","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","City":"Grants Pass","Source":"MUFON","Tags":"City","divs":["Sighting DetailsMy son and I were camping at a KOA a few miles south of Grants Pass on the roadto Cresent City. It was a totally clear night, without moonlight and with theMilky Way easily seen. My son looked up to what I believe was the NW sky, andsaid, Look, whats thatI saw a glowing cream or beige colored light, with a highly defined oval shapecoming fast about 15 degress from being directly overhead. In comparison to asatellite, it moved 5 to 10 times faster. At that time, I knew it wasnt one ofours.There was no trail or tail at anytime, and we watched it as it approached, wentby us, and continued past us. There was no color bleed, and the object stayedhighly defined.Suddenly, it rapidly accelerated and begin to move both forward and to the sidelike a movement that would trace the fingers of a glove. At the top of thethird scallop-like path, it disappeared instantly.I immediately asked my son to sit down and we exchange opinions of what we hadjust seen. We agreed in almost every point.About 5 to 10 minutes after this sighting we were still talking and a number offighters with afterburners on, but no navigation lights, appeared following asimilar path as the UFO and buzzed the area where the UFO disappeared. After ashort time, they left.I might have dismissed the sighting had it not been for the jets. Whatever wesaw must have shown up on radar for fighters to be scrambled. Ive listed my sonas the first observer, which he was, but he might not be willing to talk aboutit. I have experienced depresson and anxiety as a result of this sighting."],"Summary":"UFO and pursuit fighters seen near Grants Pass OR,","Weather Factors":"Unknown","Longitude":"-123.318902","Sighting Duration":"00:05:00","Disposition":"Unknown","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around June 6th 2002"],"Latitude":"42.448537","Object Features":"Undisclosed","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/2135.html.txt","/var/www/straped/mufon/org/2135.html"]}