{"Case Number":"21365","Object Features":"Undisclosed","Tags":"City","Object Shape":"Star-like","Summary":"Star like object in cross path of airport traffic.","Latitude":"39.539411","Longitude":"-119.750679","trends":["There have been 23 other sightings in Sparks","There were no other sightings in Sparks on or around January 5th 2010"],"Disposition":"IFO","Region":"Nevada","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.539411,+-119.750679(21365)&iwloc=A&hl=en\"> mufon case (21365) map </A>","files":["/var/www/straped/mufon/html2text/21365.html.txt","/var/www/straped/mufon/org/21365.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Date Submitted":"01/05/2010 01:45 UTC","Country":"United States","City":"Sparks","divs":["Sighting DetailsAt 6 am I got up to use the restroom and I have a window that faces out towards the north.I always look around and I have seen over the last few weeks at different times lights towards the north over the airspace where planes come in to reno airport.This time the light was star-like and way lower then the stars in the sky.As I watched this and really focused on it,I could begin to make out the fact that it was spinning.It seemed to be located over the area towards sparks blvd and los altos area.I got the feeling that it was watching something as it seemed to move slow and in a sweeping pattern.The way it was moving made me think it was a drone or something small but not too small.I looked to see if any planes were on aproach but no planes in the sky.I watched it do a sweep of the area and after about 10 min. it just seemed to flash out.There is a pasture in that area that this object was sweeping but don't know if it was watching something over there.I have also seen a light formation comming in from the north too always around the 2:45am to 4 am time."],"Viewing Distance":"101-500 Feet","Date of the Event":"01/05/2010 12:00 UTC","Log Number":"US-01052010-0008"}