{"Latitude":"27.337605","Viewing Distance":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.337605,+-82.528553(21369)&iwloc=A&hl=en\"> mufon case (21369) map </A>","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/21369.html.txt","/var/www/straped/mufon/org/21369.html"],"Country":"United States","Case Number":"21369","Region":"Florida","Log Number":"US-01062010-0001","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","divs":["Sighting DetailsNew Years Eve, 1999. I was attending a small party east of the city of Sarasota. Shortly before midnight I stepped out of my friends' house for a breath of fresh air. It was a clear moonless night though there were not many stars visible due to the city lights. I had a wide vista, horizon to horizon, and noticed a bright red light low on the eastern horizon. Thinking it might be an aircraft I kept my eyes on it to see which direction it was traveling. Well, it didn't seem to be moving at all and I thought maybe it was coming directly at me, but I saw no other lights as you would with standard aircraft so I continued to watch it. After approximately another 30 second from the time I first spotted it, the light traveled from just above the horizon to a position not quite directly over me and it was then that I could tell that it was at a very significant altitude. The object took less than a second to travel what I determined to be a fair distance. No gradual acceleration...just bang... from just above the horizon to almost directly over me and stopped in less than a second. It stayed in that relative position for between 20 to 30 seconds, and it was while I was watching it in that position that I detected a sort of pulsating effect. I don't know if that was caused by atmospheric conditions or not as it was a clear, cool night. Again, almost instantly, it covered another large portion of the sky heading west and stopped. I was able to follow it because it sort of left a very brief trail, streaking from position to position. It remained motionless for approximately 20 seconds more and then shot off west and disappeared over the horizon. I can say that my heart rate increased but it did not freak me out, though it did have a profound effect on me and I watch the sky whenever I am outside. Please know that I was not drinking that night as I was the designated driver, so intoxication was not an issue in this sighting. Five and a half years later I learned that my Uncle & Aunt witnessed a UFO while on a Caribbean cruise. Also on New Years Eve, 1999. Their experience lasted considerably longer than mine did."],"Date of the Event":"12/31/1999 11:50 UTC","Date Submitted":"01/06/2010 12:44 UTC","Tags":"City","Longitude":"-82.528553","Weather Factors":"Unknown","Source":"MUFON","City":"Sarasota","Summary":"Brilliant red light just above horizon/east. Traversed sky east to west in three quick moves in less that a minute and a half.","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around December 31st 1999"]}