{"map":"<A HREF = \"http://maps.google.com/maps?q=27.909466,+-82.787324(21364)&iwloc=A&hl=en\"> mufon case (21364) map </A>","Object Features":"Unknown","trends":["There have been 2 other sightings in Largo","There were no other sightings in Largo on or around November 9th 2009"],"Weather Factors":"Windy","Date of the Event":"11/09/2009 11:57 UTC","Disposition":"Unknown","City":"Largo","Tags":"City","Object Shape":"Disc, Triangle","Viewing Distance":"20 Feet or Less","Date Submitted":"01/05/2010 12:59 UTC","files":["/var/www/straped/mufon/html2text/21364.html.txt","/var/www/straped/mufon/org/21364.html"],"Longitude":"-82.787324","Case Number":"21364","Object Flight Path":"Other","Summary":"Two triangles appeared soundlessly","Region":"Florida","Source":"MUFON","Log Number":"US-01052010-0007","Sighting Duration":"11:23:00","divs":["Sighting Details\"Two triangles appeared (3 spheres each) first, an arrow of truth, ominious...a spirit ...passed overhead soundlessly followed by the second triangle straight up maybe 100 feet up over Lake Seminole (sacred Indian grounds) hurricane Ida was gusting winds passing by our coast that night. I searched for my handycam in my van then sat in the drivers seat knowing they were waiting overhead.This took from 12:00am when the triangles came to approx 12:23 when I stepped out of the van and began filming. A few minutes afterward they left. 12:57 (not on this video) yet on the original disc a Saturn red globe and a red dot passed by. This is my second encounter the first in 1981 where my wife, 5 month daughter and I were encountered in a deserted campground on the east coast of Fla at approx 12:00 midnight by a star my wife saw that was moving and then appeared directly over us blocking out the entire sky and we were enveloped in beautiful ultraviolet rays and we just looked up. Then next we are in the field again yet it was morning! Daybreak with birds chirping. Since then I began writing this music composition that I put to this video 29 years later.And 29 years for me could be 29 minutes for them.I have been a vegetarian since 19 years old.\" Used Nitespot plus Sony Handycam which sends a beam of light. Gate slammed and scared the objects. Came back over him at 4-5 feet and danced. Took picture of van. Objects went back. Witness' mother saw the lights from her condo later. Witness went back to Atlanta to see a friend. Tried to download the video but could not finalize it. Mary Margaret Zimmer FL"],"Latitude":"27.909466","Country":"United States"}