{"divs":["Sighting DetailsI was driving south on Route 11 about 9:15pm Tuesday Jan 5th 2010 The appalachian mountains are to my left. I have lived in this area my who life and have never seen anything like this here before. What I seen was two very large craft side by side. They were flying west or north west and were just right abve the top of the mountain. I had only seen this craft for under a minute. Looking at it to the left was craft one. It had four very large lights on it from left to right. There was a craft to the right of it with two large lights on it and a strobe in the middle. I think it may be fixed wing military cargo plane because just as I was trying to pull over to get a better look the craft tilted to the left and the craft next to it tilted as well and they went North along the mountain. These were very nright lights and the craft appeared to be fairly large. From my vantage point the mountain is roughly 10 miles to the peak from where I was observing. The four light craft looked like a very large house(size of) from wing tip to wing tip(if it was a plane). If there is anybody who can look up military flight paths in this area that would be great. I know they were not commercial airliners as they do not get that close to the trees as these were."],"Summary":"Massive UFO or Military Craft?","City":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"01/05/2010 10:46 UTC","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.208022,+-77.191895(21368)&iwloc=A&hl=en\"> mufon case (21368) map </A>","Object Features":"Wings, Unknown","Date of the Event":"01/05/2010 09:20 UTC","Viewing Distance":"Over One Mile","Country":"United States","trends":[],"Object Shape":"Unknown","Log Number":"US-01052010-0011","Region":"Pennsylvania","Disposition":"IFO","Latitude":"41.208022","files":["/var/www/straped/mufon/html2text/21368.html.txt","/var/www/straped/mufon/org/21368.html"],"Case Number":"21368","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-77.191895","Tags":"City"}