{"Country":"United States","Log Number":"US-01052010-0009","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around January 1st 2010"],"files":["/var/www/straped/mufon/html2text/21366.html.txt","/var/www/straped/mufon/org/21366.html"],"Region":"California","divs":["Sighting DetailsMy husband and I were in San Diego Gaslamp Quarter for New Year's Eve. We returned to our hotel on Island Ave and 4th St. around 1am and my husband was on the balcony smoking. He called me out to look at something unusual in the sky. I saw at least 4 orange orbs in the sky. They were a unique color which I thought was interesting. At first didn't look like anything unusual until I noticed them moving. It was smooth but erratic and unlike any conventional flying machinery. They would speed up and slow, turn corners quickly but always smooth and no sound that we could hear. One appeared to have an even smaller orb orbiting it quickly as it moved. My husband said he saw more than one with an orbiting orb but I only clearly saw the one. There was also an airplane trail of clouds and the orbs were under those clouds, so closer to the ground than an airplane. I watched for about 2 minutes or so but my husband followed them for about 10-15 minutes. Then they moved either higher in to clouds or moved behind the building so that we could no longer see them. This is my first sighting of anything I could not explain. My husband looked up on youtube that day and saw a number of other people with video and comments of the same thing we saw in San Diego and other areas of the world. I definitely saw something I could not explain in the sky that night."],"Date of the Event":"01/01/2010 01:00 UTC","Object Flight Path":"Path with directional change","Date Submitted":"01/05/2010 03:26 UTC","Viewing Distance":"Unknown","City":"San Diego","map":"<A HREF = \"http://maps.google.com/maps?q=32.718989,+-117.153475(21366)&iwloc=A&hl=en\"> mufon case (21366) map </A>","Source":"MUFON","Tags":"City","Summary":"Orange orbs in sky over San Diego","Object Shape":"Circle","Latitude":"32.718989","Disposition":"Hoax","Sighting Duration":"Undisclosed","Case Number":"21366","Weather Factors":"None","Longitude":"-117.153475","Object Features":"Unknown"}