{"Log Number":"US-01052010-0006","Summary":"Dark, square shape, two dim lights (red/green), 50ft. off ground, 30mph due west.","Tags":"City","Object Features":"None","Object Shape":"Square, Rectagular","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around December 30th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsTraveling southeast on Lassiter Road in Johnston County at 6:25pm on Dec. 30, 2009. Two eyewitnesses saw a small, square craft slowly float by. The craft was very dark, and the evening light made it difficult to determine an exact shape. It seemed to be square, dark, about 25ft. square base and maybe 5ft tall. We were first caught off guard that a plane would be flying so low at night with no ground lights, but then noticed how slowly the craft was moving.The craft traveled exactly due west (we returned later that night with a compass) about 50-60ft off the ground and 40 yards to our left over a field at about 30mph. The craft had two dim lights, one was definitely red. I thought the other light was a dim green, but the other eyewitness remembered it as a dim white light. I pulled over, rolled down my window and noticed no sound coming from the low flying craft. I turned around and followed the craft for a few minutes, but it was traveling too low to the tree tops that I soon lost sight of it through the trees. Also, it was headed due west, and Lassiter Road runs northwest by southeast. So the craft was traveling further away from me the further I traveled up Lassiter Road. It could have been a plane. But... it was flying very low, extremely slowly, and made no noise. A cessna flying that low at night would have had ground lights on and been remarkably loud and fast. I have attached a comp for reference."],"City":"Raleigh","Country":"United States","files":["/var/www/straped/mufon/html2text/21363.html.txt","/var/www/straped/mufon/more/21363_submitter_file1__sighting_v2.jpg","/var/www/straped/mufon/org/21363.html"],"Region":"North Carolina","Source":"MUFON","Disposition":"Unknown","Latitude":"35.778436","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=35.778436,+-78.632884(21363)&iwloc=A&hl=en\"> mufon case (21363) map </A>","Case Number":"21363","Weather Factors":"None","Date of the Event":"12/30/2009 06:25 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date Submitted":"01/05/2010 11:54 UTC","Longitude":"-78.632884"}