{"Date of the Event":"01/04/2010 08:24 UTC","Object Features":"Undisclosed","Log Number":"US-01052010-0004","Latitude":"29.889722","Object Shape":"Circle, Fireball, Oval, Sphere","Summary":"Meteorite look, but then it just stopped and hovered.","files":["/var/www/straped/mufon/html2text/21361.html.txt","/var/www/straped/mufon/org/21361.html"],"Date Submitted":"01/05/2010 04:14 UTC","Longitude":"-98.425","Region":"Texas","Source":"MUFON","Weather Factors":"Unknown","Case Number":"21361","Viewing Distance":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.889722,+-98.425(21361)&iwloc=A&hl=en\"> mufon case (21361) map </A>","Object Flight Path":"Undisclosed","City":"Spring Branch","Tags":"City","Country":"United States","Sighting Duration":"00:04:00","divs":["Sighting DetailsMy girlfriend and I were driving near the intersection of FM306 and US281 when we noticed something in the sky, it caught our attention with a burst of blue light, very brightly and we thought it was a meteorite. It came down in front of my cars windshield and we could see it. Then it seemed to level out and move further north to a stop. It then stopped and hovered. It seemed to be shaking or wobbling, it did this about 2 minutes. Then either faded out or moved quickly northward into and through Blanco county. While it was hovering it was orange and red and pulsing. We couldn't tell how high it was, but it seemed low, maybe around 25,000 feet or the height a commercial airliner might have been at, but it definitely was not a meteorite or comet, at least not one that I have ever seen. We were in amazement as we watched it, but I was able to call my brother and tell him to look in the sky for it. He was on the south side of his house about 14 miles east of where we were watching the object hover and by the time he headed to the northside the object was gone. Once we got to my brothers house, he called the Comal Sheriffs department who, he said, were enthusiastic to hear of such a thing but also concerned as to what it was. He said, they called Blanco Sheriffs department to see if they had any reports. We can't be the only people to see that tonight."],"trends":["There have been no other sightings in Spring Branch","This sighting has never been favorited."]}