{"Date of the Event":"11/27/2009 12:00 UTC","Case Number":"21372","Country":"United States","Region":"Virginia","Tags":"City","Latitude":"37.963493","Source":"MUFON","City":"Bumpass","divs":["Sighting DetailsI was sitting around a campfire making s'mores with my boyfriend's family, the night after Thanksgiving. It was my first time in Bumpass, VA, we were staying at a lakehouse and we were sitting right next to the water. The surrounding area is predominantly woods and there are many abandoned houses, planes, and cars lying in random fields. My boyfriend said \"Look at that shooting star\" and we all turned around. We knew it wasn't a shooting star immediately because by the time you turn around to see one it's usually gone, but the object we saw in the sky was visible for 3 seconds (my boyfriend says 4 seconds because he was the first to see it). It was also obvious that whatever it was, it was inside the atmosphere, and at least (I'm not good with distances) a mile away. After the 3 seconds I saw it, it disappeared behind the tree line. It looked like a glowing, blue, slightly oblong ball. It moved in a horizontal, slightly downward motion across the skyline. It wasn't floating, or falling, and didn't even seem to be flying the way a plane does. The best word to describe it was it seemed like it was driving. Everyone around the campfire saw it, 8 of us were adults ranging from 19 to 60, 3 were teens and 4 were kids ranging from 6 to 9. The campfire was not obstructing my view of the object. When I saw the object the first thing I thought was \"that's not a falling star\" and the second thing I thought was \"that's a UFO\". I remember being completely surprised I saw one on vacation, I remember wishing my dad was there to see it. However, I never thought \"oh maybe it was fireworks\" \"maybe it was a spotlight\" like some of the other people around the campfire. I said to them \"that was a UFO.\" They laughed but they stopped guessing what it was. I just felt like I knew it was a UFO. Everyone around the campfire then agreed: 1) they had never seen anything like it and 2) they didn't think they would any time soon."],"files":["/var/www/straped/mufon/html2text/21372.html.txt","/var/www/straped/mufon/org/21372.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"01/06/2010 12:10 UTC","Log Number":"US-01062010-0004","Longitude":"-77.738052","Object Shape":"Egg, Oval, Sphere","trends":["There has been one other sighting in Bumpass","There were no other sightings in Bumpass on or around November 27th 2009"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.963493,+-77.738052(21372)&iwloc=A&hl=en\"> mufon case (21372) map </A>","Disposition":"Unresolved","Summary":"Glowing, blue-ish, slightly oblong ball moved horizontal across the skyline for 3-4 seconds.","Object Flight Path":"Undisclosed"}