{"Object Flight Path":"Path with directional change","Date Submitted":"01/06/2010 06:50 UTC","Weather Factors":"Unknown","Source":"MUFON","divs":["sighting detailsi entered i-4 from the debary exit, headed north, and almost immediately saw the object. it took me a second to realize that it wasn't a plane or helicopter, because i was watching the road. it was directly ahead of me (to the north). i started examining it closer, something about it just didn't seem right. i thought then that it might have been a firework, but after a few moments watching it decided it wasn't. it was moving too slowly to be a rocket, and glided left\\right, towards me and away from me. perhaps not directly focused on me, but it did manage to stay in my view. i can't estimate it's elevation, but it didn't seem to be any higher than i've seen most helicopters. it did not have a tail. it was too dim to be a flare. it was a fiery orange color, like a sunset, and had a tight, but wavering corona. it had no hot white point, but was a fairly solid orange, maybe dipping into red at the fringes. i realized then, that i had never seen anything like it before, and that is likely what drew my attention to it. i was shocked to realize that i couldn't place the object or come up with a satisfactory explanation for it. i exited i-4 at the last exit for deland, tried to keep sight of it as the ramp made a circle, but lost sight of it for a second or two. when i had finished exiting i tried to reacquire it. it should have been easy to spot, there was plenty of open sky, but it had vanished. edit: after digesting the encounter, i didn't feel anything other than elation at my first sighting of something i couldn't identify. during the sighting, i had the distinct impression that i was seeing two objects. two identical spheres, but so close to each other that they appeared as one. again, there was only the impression of this, i can't claim to have seen two distinct objects."],"Summary":"Sighted orange ball of light.","Log Number":"US-01062010-0006","trends":["There have been 3 other sightings in DeLand","There were no other sightings in DeLand on or around December 31st 2009"],"Sighting Duration":"Undisclosed","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/21374.html.txt","/var/www/straped/mufon/org/21374.html"],"Date of the Event":"12/31/2009 10:15 UTC","Object Features":"None","Region":"Florida","City":"DeLand","map":"<A HREF = \"http://maps.google.com/maps?q=29.034758,+-81.299308(21374)&iwloc=A&hl=en\"> mufon case (21374) map </A>","Disposition":"Hoax","Country":"United States","Viewing Distance":"Unknown","Case Number":"21374","Tags":"City","Longitude":"-81.299308","Latitude":"29.034758"}