{"divs":["Sighting DetailsMY BOYFRIEND INFORMED ME THAT EVERY CHRISTMAS I TELL HIM A STORY ABOUT A UFO. HE SAID HE THOUGHT CHRISTMAS LIGHTS REMINDED ME OF IT. THIS YEAR HE INSISTED THAT I RESEARCH TO FIND ANY INFORMATION ABOUT WHAT I HAD SEEN IN THE OCALA NATIONAL FOREST. I HAD TOLD HIM OF AN ENCOUNTER I HAD AND THAT IT WAS REPORTED IN THE OCALA STAR BANNER THE NEXT DAY. HOWEVER, I HAD NEVER PURSUED ANY INFORMATION ABOUT IT. ON MAY 14, 1978 AT NIGHT, I WAS COMING HOME FROM OCALA WITH A GIRL FRIEND.I WAS DRIVING DOWN AN UNPAVED ISOLATED ROAD WHERE I LIVED WHEN I HAD AN ENCOUNTER WITH A CRAFT. ALL I CAN RECALL OF THE EVENT IS THAT MY FRIEND AND I WERE STANDING, LEANING BACK AGAINST MY CAR LOOKING UP AT A CRAFT. IT WAS A HAZY EXPERIENCE. I REMEMBER LOOKING AT HER PROFILE AND THINKING THAT THE LIGHT WAS SO BRIGHT THAT I COULD SEE TINY LITTLE HAIRS ON HER NOSE.I RECALL FEELING LIKE I WAS MOVING IN SLOW MOTION. I CAN BEST DESCRIBE THE CRAFT AS REMINDING ME OF GIANT TINKER TOYS. IT HAD ROUND POD LIKE COMPARTMENTS CONNECTED WITH LARGE CYLINDERS. IT HAD GREEN, WHITE AND I THINK RED LIGHTS (LOOKED PINKISH) ANYWAY THE COLORS SEEMED TO LOOK LIKE MUTED AND BLURRED NEON LIGHTS. I THINK THAT IT WAS NO MORE THAN 20 - 30 FEET AWAY FROM US. I DO NOT REMEMBER GETTING OUT OF MY CAR OR GETTING BACK INTO MY CAR AND GOING HOME. THE NEXT MORNING I SAID TO MY FRIEND, OFF-HANDEDLY \"DO YOU REMEMBER SEENNG THAT LAST NIGHT\"? HER REPLY WAS YES. AND THAT WAS THE END OF THE DISCUSSION. THE EVENT SEEMED DREAM LIKE AND I HAD NO IMPULSE TO TALK ABOUT IT FURTHER WITH HER, NOR DID SHE WITH ME. I VAGUELY REMEMBER SOMETHING ABOUT MY FRIEND'S FACE LOOKING LIKE IT WAS SUN BURNT, BUT DON'T RECALL IF MY FACE WAS BURNT. I REMEMBER SEEING THIS OBJECT HOVERING SILENT AND STILL ABOVE US AND I REMEMBER BEING OUTSIDE MY CAR AND EVERYTHING ELSE IS A BLANK. MY RESEARCH OF THIS EVENT CORRESPONDS WITH THE SIGHTINGS AT THE PINE CASTLE ELECTRONIC CENTER. SO FOR ANY OTHER REPORTS OF THIS SIGHTING, I WILL ATTEST 100 PERCENT THAT THIS CRAFT WAS THERE."],"Source":"MUFON","Object Features":"Appendage(s)","files":["/var/www/straped/mufon/html2text/21371.html.txt","/var/www/straped/mufon/org/21371.html"],"Object Shape":"Other","Longitude":"-81.513964","trends":[],"Tags":"City","Case Number":"21371","Date of the Event":"05/14/1978 12:00 UTC","Date Submitted":"01/06/2010 10:58 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.670727,+-81.513964(21371)&iwloc=A&hl=en\"> mufon case (21371) map </A>","Region":"Florida","Summary":"STOOD LOOKING UP AT A CRAFT ON A ISOLATED ROAD IN OCALA NATIONAL FOREST","Object Flight Path":"Stationary","Latitude":"27.670727","City":"Undisclosed","Viewing Distance":"21-100 Feet","Log Number":"US-01062010-0003"}