{"Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Hovering then path","City":"Owensboro","Log Number":"US-01072010-0001","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 9 other sightings in Owensboro","There were no other sightings in Owensboro on or around January 6th 2010"],"Weather Factors":"Unknown","Case Number":"21379","Viewing Distance":"101-500 Feet","Longitude":"-87.109458","Summary":"Bright low level flashing light which stood still, resembled a flashing tower, we have no towers in the area.","Date of the Event":"01/06/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/21379.html.txt","/var/www/straped/mufon/org/21379.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.781737,+-87.109458(21379)&iwloc=A&hl=en\"> mufon case (21379) map </A>","Latitude":"37.781737","Object Features":"Unknown","Country":"United States","Object Shape":"Flash","Date Submitted":"01/07/2010 12:31 UTC","divs":["Sighting DetailsAt approximately 8:10 CST while letting the dogs outside in our backyard, facing due West I noticed a bright white flashing light in the sky and I thought to myself, I never noticed a tower in that direction. We live on a private road in the country and the reason I never noticed a tower, is because there is NOT a tower in the area we live. I returned back into the house, puttered in the kitchen for 2 minutes and then immediately went upstairs to inform my wife that she needed to look outside and witness this. When we approaced the patio doors in our bedroom we both observed the light from the 2nd story of our house this flashing bright white light. I then turned off the TV, shut off the computer screen and turned off the lights. We both stood at the patio doors watching the object which was suspended in the sky and not moving. From our position on the second floor and looking from both the 1st and 2nd floor of the house, this object had not moved in 5 minutes. My wife happended to be on the phone with a friend and also mentioned this strange event to her friend. I then slowly opened the patio doors and went outside on the deck off of the 2nd floor to see if I could hear anything, after approximately 2-3 seconds the object moved to the east at a very slow rate. As the object came overhead, no noise was heard or any outline of any shape, it was just the bright flashing light and it continued to travel at that same pace for approximately one minute. After standing outside for this timeframe, I then came into the house as it was too cold outside. Feelings of curiousity, excitement and nervousness were both experienced by my wife and I. This was a very interesting event!!!"],"Region":"Kentucky"}