{"Longitude":"-118.353784","Object Features":"Undisclosed","Region":"California","Case Number":"21389","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.096339,+-118.353784(21389)&iwloc=A&hl=en\"> mufon case (21389) map </A>","Tags":"City","Latitude":"34.096339","Object Shape":"Triangle","Source":"MUFON","Date Submitted":"01/07/2010 05:51 UTC","City":"West Hollywood","Log Number":"US-01072010-0011","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/21389.html.txt","/var/www/straped/mufon/org/21389.html"],"Summary":"all black, triangle, NO lights, no sound","Date of the Event":"11/30/2008 12:00 UTC","divs":["sighting detailsi was on the roof of my work looking at how clear the sky was. i noticed a streek of cloud in the sky; almost like when jets release whatever they release in the air around cali; when behind the cloud was this tirangle thing. it had no lights. the only way i saw this thing was because of how bright the moon was. it was just coasting over the sky. now...i had done the research before i saw this thing, but was still skeptical. at this point, i would give it 50\\50, only because we have no idea what the government has their hands in. but at the same time, i saw a solid object, basically floating(coasting because it was moving), with no sound!!! the only way would be with remote control, but why would it beso low? my work is 10 stories, but when im on the roof, im almost eye level with the top of the hollywood hills. the funny thing to me, is that in the direction it was flying, it would have went right over burbank airport airspace. i dont know...i just just thought that i should do this because of all the phony stuff i see on tv. sorry no pics"],"Country":"United States","Disposition":"Unknown","trends":["There have been 7 other sightings in West Hollywood","There were no other sightings in West Hollywood on or around November 30th 2008"],"Weather Factors":"Unknown"}