{"Region":"Massachusetts","Object Features":"Undisclosed","Log Number":"US-01072010-0010","files":["/var/www/straped/mufon/html2text/21388.html.txt","/var/www/straped/mufon/org/21388.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.678169,+-71.299175(21388)&iwloc=A&hl=en\"> mufon case (21388) map </A>","trends":["There have been 2 other sightings in Dracut","There were no other sightings in Dracut on or around October 10th 2002"],"Case Number":"21388","Date of the Event":"10/10/2002 02:00 UTC","City":"Dracut","Disposition":"Unknown","Date Submitted":"01/07/2010 04:37 UTC","Sighting Duration":"00:05:00","Viewing Distance":"Unknown","divs":["Sighting DetailsAs object moved over my landlords house toward his driveway, it cruised right over my head and I could have hit it with a rock as I was standing in the driveway. It cruised over my cottage and over Mammoth Rd. and just over the trees on the other side of the road. At that tlime, I was living in Dracut, Ma. 01826 at 455 Mammoth Rd. At first, I was afraid but then I figured that if they could fly an object like that, they had to be more intelligent than I. So, I stayed in the driveway to get a better look at it. It made a slight puttering sound as it cruised overhead but I was unable to see any markings as it was dark out at the time. When I first encountered the object, it was over Gerrish Ave. in a field beyond some houses located on Gerrish Ave. in Dracut. When I approached the driveway of my LandLord, I saw the white light shining down that seem to erase any visions of the trees and houses. As soon as I saw it, the light went out as though the object had detected my presence. Then, it came over the trees and houses toward me. I knew that this was a UFO and started to go to my house for fear that I was about to be adducted. However, I changed my mind and declded to get a good look at it. It was a huge disc bigger than a house and just floated over my head. I never reported it for fear people would think I was insane.At that point, I knew we were being visited and observed by alien beings and that we were not alone in this huge universe."],"Object Flight Path":"Undisclosed","Weather Factors":"None","Source":"MUFON","Tags":"City","Latitude":"42.678169","Summary":"White light that went off when I spotted it. Object moved over houses toward me.","Object Shape":"Disc","Longitude":"-71.299175"}