{"files":["/var/www/straped/mufon/html2text/2138.html.txt","/var/www/straped/mufon/org/2138.html"],"City":"Tucson","Disposition":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"01/01/2003 12:00 UTC","Object Shape":"Sphere","Source":"MUFON","Sighting Duration":"00:30:00","Latitude":"32.226313","Region":"Arizona","Object Features":"Other","Log Number":"","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around January 1st 2003"],"Date Submitted":"01/01/2003 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.226313,+-110.919129(2138)&iwloc=A&hl=en\"> mufon case (2138) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Summary":"four orange disks moving s.e.to n.e","Longitude":"-110.919129","divs":["Sighting Detailsi was in the back yard of my mothers house in tucson ,arizona, enjoying the cold night sky welcoming in the new year. i noticed three bright pale orange lights in the eastern sky . they were in a verticle line with the top one offset a little to the south but moved slowly till it lined up in a straight line above the other two. i then noticed a fourth object moving from the south east to the north west at a high rate of speed. as it approched the other three it slowed then came to a stop at the same level as the third disc horizontal to it. i had spent three months watching the sky with my telescope enjoying the clear cold skies so i knew that these lights were not stars as at that time of night in that section of the sky there are no major stars or planets. i knew they were not planes nor helicopters as the night was still and cold and other than the occasional popping of revilers it was quiet. after the fourth disc aligned itself next to the top dics the bottom dics simply winked out, then the next one up winked out, then the top one winked out, i attempted to take a picture with a digital camera but no results so i took my binoculars and watched the fourth disc wink out. as i watched the last disc wink out with the binoculars i could see behind it at agreat distance the flashing lights of a commercial aircraft blinking. it wasmoving from south to north."],"Case Number":"2138","Tags":"City","Weather Factors":"Unknown"}