{"Summary":"Saw lights in the sky way to low for a plane to fly","files":["/var/www/straped/mufon/html2text/21383.html.txt","/var/www/straped/mufon/org/21383.html"],"Case Number":"21383","Source":"MUFON","Object Features":"Unknown","Log Number":"US-01072010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=32.905262,+-105.950575(21383)&iwloc=A&hl=en\"> mufon case (21383) map </A>","Longitude":"-105.950575","Date of the Event":"01/05/2010 06:30 UTC","Country":"United States","City":"Alamogordo","Disposition":"Unknown","Latitude":"32.905262","Object Flight Path":"Stationary","Region":"New Mexico","divs":["Sighting DetailsI was coming home from Alamogordo, NM on White Sands Blvd heading toward Tularosa, NM. At the intersection of White Sands and US 82 toward Cloudcroft, I looked up to my left and up in the sky, not to high up and to low for a plane to fly I saw lights. They were gold and were horizontal with two lights then a space and then four lights. Below those lights were a couple other lights but I am not sure how many. The lights were there one second and gone the next. I told my sons whom were in the car with me what I had seen and I thought it was rather odd. As we drove from US 82 toward Cloudcroft, we turned left toward La Luz New Mexico. When we go into La Luz, we stopped at the stop sign, went straight passed the Post Office and was heading toward the brigde to go up into the Canyon. Right before we came to the church that is on the left I looked up again and told my oldest son to look out the window. Sure enough there were the lights again. This time we saw the two lights and then the four lights. There were no lights below these lights. They were pretty low this time, way to low for a plane to fly, right above the tree tops and there was no sound at all. They lights were there for about 5 second and then they were gone. I pulled into the church to see if I could see anything else but there was nothing there in the sky just the stars."],"Object Shape":"Unknown","Weather Factors":"None","Viewing Distance":"20 Feet or Less, 21-100 Feet","Tags":"City","trends":["There have been 16 other sightings in Alamogordo","There was one other sighting in Alamogordo on or around January 5th 2010"],"Date Submitted":"01/07/2010 12:37 UTC","Sighting Duration":"Undisclosed"}