{"Log Number":"US-01072010-0008","divs":["Sighting Details On January 4th 2010 I went out to look for the object flashing the white light. I was outside about for about 25 minutes when me and my husband seen a white flashing object. I seen it flash twice then my husband seen it a third time using the night vision goggles. It was in the north western sky flashing and flying north. This incident started for me back on December 18th 2008. A friend of mine whom does not believe in UFO's called about a blinking light in the sky. I went to check the area of the sky that she pointed out but I could not see anything unusual but she said she saw it on four different occasions starting late July of 2008 I decided that I would make it a practice to go out every night and look at the sky in hope to find it and it was cloudy a lot so I waited for it to clear then finally a few weeks later on December the 18th I seen it and when it flashed it was a pure bright white light and as I observed it I could see the flash going back into a say oval shaped object and as it went up the object the light would go out from behind it. This light was clearly contained within an object.I could see it well enough that I could see like some sort of compartment where I thought the light might stop and then it did stop about maybe say two thirds up the object then where the light stopped I could see the oval shaped of a form of some kind of compartment where the light did not seem to extend it self. I could see this object was stationary in the sky. I had a friend with me at the time she saw the flash but then she did not see the form because she was playing with the dog's."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.873774,+-123.708648(21386)&iwloc=A&hl=en\"> mufon case (21386) map </A>","Object Shape":"Unknown","City":"leggett","Viewing Distance":"Unknown","Country":"United States","Disposition":"Unknown","Object Features":"Undisclosed","Case Number":"21386","Longitude":"-123.708648","Summary":"Object flashing white light in sky","Date Submitted":"01/07/2010 03:43 UTC","Sighting Duration":"Undisclosed","Latitude":"39.873774","Date of the Event":"01/04/2010 08:00 UTC","files":["/var/www/straped/mufon/html2text/21386.html.txt","/var/www/straped/mufon/org/21386.html"],"Tags":"City","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path","trends":["There have been 17 other sightings in leggett","There were no other sightings in leggett on or around January 4th 2010"],"Region":"California","Weather Factors":"Does Not Apply"}