{"Region":"Florida","trends":["There has been one other sighting in Apollo Beach","There were no other sightings in Apollo Beach on or around May 31st 2009"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy fiance and I were driving southbound on I-75 one afternoon several months ago when I observed two aircraft that appeared identical to each other, flying side by side at the same speed. Both aircraft had a vapor trail immediately behind them, however, one aircraft was pulling its vapor trail with it so that it didn't change in length. The other aircraft left a vapor trail that stretched into the distance from where it had been. I was very surprised to see that one of the aircraft was pulling its vapor trail along with it when the other one wasn't so I pointed it out to my fiance. I had never seen an aircraft pull its vapor trail with it. A few weeks ago I woke up in the night because I realized that what I probably saw was one aircraft being reflected on the surface of something I couldn't see. It was a bright sunny afternoon with few high cirrus clouds. The reason the vapor trail appeared to be pulled along is because it was at the end of a reflective surface. Whatever was reflecting the other plane had to be huge because the whole aircraft and a good length of its vapor trail was fully reflected. There was no mistaking the visual event we witnessed. There is a military base nearby where central command for the middle east is headquartered so we might have some kind of top secret (invisible) aircraft in the area I suppose; but I can't imagine us having one as big as this one would have to be."],"Disposition":"IFO","Summary":"What looked like two matchig aircraft, one leaving a vapor trail the other pulling a vapor trail","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/21381.html.txt","/var/www/straped/mufon/org/21381.html"],"Object Features":"Other","Source":"MUFON","Date Submitted":"01/07/2010 01:10 UTC","Case Number":"21381","Country":"United States","Log Number":"US-01072010-0003","Longitude":"-82.407594","Viewing Distance":"Over One Mile","Latitude":"27.773084","City":"Apollo Beach","Sighting Duration":"Undisclosed","Date of the Event":"05/31/2009 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.773084,+-82.407594(21381)&iwloc=A&hl=en\"> mufon case (21381) map </A>","Object Shape":"Other"}