{"Object Flight Path":"Undisclosed","Sighting Duration":"00:00:03","files":["/var/www/straped/mufon/html2text/21393.html.txt","/var/www/straped/mufon/org/21393.html"],"Object Features":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=37.276811,+-79.100854(21393)&iwloc=A&hl=en\"> mufon case (21393) map </A>","Source":"MUFON","Log Number":"US-01072010-0015","Longitude":"-79.100854","Region":"Virginia","Latitude":"37.276811","Date Submitted":"01/07/2010 08:41 UTC","Object Shape":"Sphere","Viewing Distance":"Unknown","Tags":"City","Case Number":"21393","City":"Rustburg","trends":["There has been one other sighting in Rustburg","There were no other sightings in Rustburg on or around December 15th 2009"],"Weather Factors":"Unknown","Country":"United States","Date of the Event":"12/15/2009 12:00 UTC","Summary":"A glowing orange object the size of a quarter, sped thru sky in a straight line at the speed of a bullet and made no sound.","divs":["Sighting Details On or about Dec 15th, 2009 I saw a something streak thru the sky just above the tree line and across the lake (as seen from our front porch). It was very early in the morning at about 6AM before first light. It was about the size of a quarter and was glowing orange. It sped thru the sky in a straight line from east to the west at about the speed of a bullet and it made no sound. The sighting lasted maybe 2 to 3 seconds. We are less than 5 miles from an air traffic control tower near Lynchburg, VA. It definitely was an object. It was flying thru the air and whatever it was is unknown. I do not agree to the release of my contact information to third parties as part of the investigation into this report of a UFO sighting (at this time). However, if others come forward, I might reveal my identity to the group. Thanks 1. Where were you and what were you doing at the time? I was relaxing on the front porch. 2. What made you first notice the object? It was extremely fast and glowing orange. 3. What did you think the object was when you first noticed it? a UFO 4. Describe the object and its actions and motions. Described above... 5. Describe your feelings, reactions and actions, during and after sighting the object. Difficult to find words to describe this experience 6. How did you lose sight of the object? It quickly went out off sight behind the trees."]}