{"Tags":"City","divs":["sighting detailsmy daughter and i were in the car driving south on route 12 in west boylston, massachusetts. at 7:34 pm we were passing the meolla's ice cream stand which is about a 1\\4 of a mile before the local wal-mart, when we both saw a bright florrisint-green, circular light. it streaked and arched in a downward motion towards the east, then disappeared. we noticed it because it was off in the distance above the traffic signals, right in front of us. it happened so fast,(for approx. 1-2 seconds), there was no time to photograph it with a cell phone. i suggested that it could have been a flare or a drone. however, my daughter insists that it was too big and too fast to have been either. (her 16 year old eyes are better than my 50 year old eyes at night!) while continuing towards our home we were unable to think of or see any explanations or information regarding what we had seen. because we were in traffic at the time of the sighting, we were unable to stop to inquire if there were any other witnesses to this event. when driving by the wachusette reservoir area, we were scoping the water and the landscape with our eyes in hopes of seeing any evidence or traces of what we had seen. there was an increase in air traffic, including a helicopter as we traveled down route 110 east in clinton massachusetts before the high school, at 7:43pm. we felt excited about seeing a ufo and couldn't take our eyes off of the sky! when we arrived home, we stood outside in our yard for a while to try to determine if it would have been visible to us from that vantage point. we concluded that,we wouldn't have been able to see it from our yard, even though the object was up high. tonight i'm watching the late news cast on tv to see if there are any reports about our sighting regarding what it may have been."],"Disposition":"IFO","Sighting Duration":"Undisclosed","Log Number":"US-01072010-0017","Viewing Distance":"Over One Mile","Object Shape":"Circle, Sphere, Other","Country":"United States","Object Features":"Unknown","Weather Factors":"None","Latitude":"42.272563","Case Number":"21395","Source":"MUFON","Summary":"My daughter and I saw a bright Florrissent-green circular light that arched and streaked in a downward motion. The sighting was about 1 to 2 seconds in duration.","Date Submitted":"01/07/2010 10:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.272563,+-71.794533(21395)&iwloc=A&hl=en\"> mufon case (21395) map </A>","Region":"Massachusetts","trends":["There have been 18 other sightings in Worcester","There were no other sightings in Worcester on or around January 7th 2010"],"Date of the Event":"01/07/2010 07:34 UTC","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/21395.html.txt","/var/www/straped/mufon/org/21395.html"],"Longitude":"-71.794533","City":"Worcester"}