{"Longitude":"-73.91513","files":["/var/www/straped/mufon/html2text/21392.html.txt","/var/www/straped/mufon/org/21392.html"],"Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was driving down Rte 9 going North at about 9:40-10pm on May 12,2004. As I approached the Academy St exit ramp,I saw what at first appeared to be a string of red and green lights blinking slowly. As my car neared the lights, I found myself directly under an immense,low-flying craft. It was a huge, boomerang-shaped craft--it had a dark grey body and red and green lights along its \"wings\". It moved so slowly, it appeared to be floating. It was completely soundless. I tried to keep the object in sight,which was no easy feat since I had to keep my attention on the road. By the time I was able to park my car, the boomerang had vanished. When I first noticed this craft, I assumed it was some type of jet. The longer I watched it,however, the more I realized how impossible it would be for a jet to move that slowly, especially at such a low altitude. I also can't undersatand why nobody else has come forward about this. At the time of this sighting, there were at least a dozen other vehicles besides mine in the area."],"Tags":"City","Latitude":"41.708911","map":"<A HREF = \"http://maps.google.com/maps?q=41.708911,+-73.91513(21392)&iwloc=A&hl=en\"> mufon case (21392) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"01/07/2010 08:37 UTC","City":"Poughkeepsie","Case Number":"21392","Object Shape":"Boomerang","Date of the Event":"05/12/2004 09:40 UTC","Summary":"object moving south down rte 9--flying/floating slowly; immense, silent flying low","Source":"MUFON","Log Number":"US-01072010-0014","Region":"New York","Country":"United States","Viewing Distance":"Unknown","Sighting Duration":"00:12:07","trends":["There have been 14 other sightings in Poughkeepsie","There was one other sighting in Poughkeepsie on or around May 12th 2004"],"Disposition":"Insufficient Data"}