{"Date Submitted":"01/08/2010 11:55 UTC","Object Shape":"Disc, Saturn-like","divs":["Sighting DetailsI was driving from Edmonton Alberta Canada to Enterprise NorthWest Territories and was driving through Peace River Alberta. While driving down the highway into town, I pointed my camera out the car window to my left which overlooked the river valley and the town. I did not have time to stop because I was on a deadline. I literally rolled the window down, took the picture without taking my eyes off the road, and kept driving through town. The camera is a stock standard Sony DSC model, 6.0 megapixel camera without anything fancy. I did not notice or hear any overflying aircraft or helicopter, even though the Peace River airport would be on the far right of the picture on the other side of the valley. I never actually looked at the pictures until about 2 weeks later and figured it was just an aircraft as viewed from the back and right or front and left, however over the past 2 years I've kept looking at the picture and wondering because everytime I've tried to enhance the picture myself I always get a disc-shaped object. Because I was driving I never got a look at the object with my own eyes, never saw its direction of travel, speed or motion. I never had any feelings or reaction to the object, until after I saw the picture."],"Object Features":"Unknown","Case Number":"21406","map":"<A HREF = \"http://maps.google.com/maps?q=56.230976,+-117.288829(21406)&iwloc=A&hl=en\"> mufon case (21406) map </A>","Log Number":"CA-01082010-0011","Summary":"Took a picture and realized after that it did not look like a plane.","trends":["There have been no other sightings in Peace River","This sighting has never been favorited."],"Source":"MUFON","Region":"Alberta","Sighting Duration":"00:00:00","Weather Factors":"None","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/21406.html.txt","/var/www/straped/mufon/more/21406_submitter_file1__DSC02548.JPG","/var/www/straped/mufon/org/21406.html"],"Date of the Event":"01/25/2008 02:03 UTC","Country":"Canada","City":"Peace River","Object Flight Path":"Unknown","Longitude":"-117.288829","Latitude":"56.230976"}