{"map":"<A HREF = \"http://maps.google.com/maps?q=37.341716,+-121.890486(21416)&iwloc=A&hl=en\"> mufon case (21416) map </A>","Object Shape":"Disc","Weather Factors":"None","Case Number":"21416","Log Number":"US-01092010-0010","Object Flight Path":"Hovering then path","Disposition":"Unknown","Viewing Distance":"Unknown","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around November 8th 1978"],"Date Submitted":"01/09/2010 05:06 UTC","Object Features":"Window(s)","Sighting Duration":"Undisclosed","Tags":"City","Region":"California","Date of the Event":"11/08/1978 06:00 UTC","Source":"MUFON","Longitude":"-121.890486","Latitude":"37.341716","Summary":"I saw a bright light and around it are multicolored lights but it tilted a little 'cause I just one side of it..","City":"San Jose","files":["/var/www/straped/mufon/html2text/21416.html.txt","/var/www/straped/mufon/org/21416.html"],"divs":["Sighting DetailsI was driving home from work heading south on State Route 101 in Santa Clara County, California. I worked in Santa Clara up 'till 5:30 pm and then head home to San Jose, California. Traffic was slow in SR 101, as usual, and as I was approaching the area of the San Jose International Airport, I was watching this \"bright light\" on my left side(coming from the east) and notice that it was rather a little brighter that the others I've seen when aircraft are preparing to land. It wasn't dark yet but yes, the sun was getting ready to set. A few minutes have passed and it seems the aircraft is taking it's \"sweet time\" to land. Just when the traffic started to move again and paid attention to my driving instead of the \"bright light\", I lost eye contact of this object for a while. Then as the traffic slowed down again and me searching for this object, I looked up to look for the object at about 10:00 position, I saw this \"semi-disk\" shaped object with multi colored lights (could be windows) around it. \"Semi-disk\" because I only saw one side of it because I think it was a little tilted on my vantage point. I looked around to see if any other motorist saw the object but looks like none of them saw it except me. I said to myself to pull over (I was on the fast lane and I could have easily pulled over) and take a better look...but I said nah, I'm probably just seeing things from the long day at work. As I was watching the news on TV while having dinner, the late mr. Van Amberg of ABC News reported that a UFO was sighted in the Bay Area at around 6:00 pm to 6:30 pm and was described as a bright light. The object was observed for more than half an hour and traversed a path from East to West direction. Wow! I missed that completely! My apologies for being a \"doubting Thomas\"."],"Country":"United States"}