{"Region":"Alberta","Country":"Canada","Object Flight Path":"Straight-line path","Latitude":"50.041554","Sighting Duration":"00:05:00","Summary":"Saw 1 very high tech. UFO","Tags":"City","Weather Factors":"Unknown","Date of the Event":"09/15/2002 12:00 UTC","Object Features":"Undisclosed","Date Submitted":"09/15/2002 12:00 UTC","trends":["There have been 3 other sightings in Medicine Hat","There were no other sightings in Medicine Hat on or around September 15th 2002"],"divs":["Sighting DetailsAt the time when I was seeing the ufo I was in a trail in my town which connectsa higher residential area to a lower area and there are train tracks which arein between the residential areas.I was at these tracks in the trails at a slightly higher elevation than the townso I could see the whole town from where I was. I was just walking home asusual and then I looked up and seen what looked to be a flashing and hoveringtower over the hospital in our town. I didnt think anything of it and keptwalking. Then I looked at the lights again and they were moving away from thehospital and I realized the nothing man main just sits and hovers for no reasonover a hospital and then flies off. The UFO moved quite rapidly accross thetown and then did a leaf like effect where it seemed like it was trying tobalance itself. Then it moved closer to my position and stoped in the middle ofthe town. During all this time it was flashing its lights.First one light would appear starting from the left of the craft, then two, thenthree and finally all four and then all of the lights would dissappear together.Once the object stopped in the center of town hovering over buildings ofcourseit then turned into a very bright light like a sun and came directly towards me. I felt a telepathy feeling like I knew this thing knew I was looking at it. Itcame over the house tops directly toward me so I ran down through the path andto the street below I thought that if I was on the street the craft couldnt takeme without my fellow humans seeing it happen.Once I got to the street below I could see the craft only 15 to 25 feet awayclearing houses making no sound. I hid behind a tree infront of someones houseand looked at the object hovering over me diagonally over me and I could hear itonly when it was Extreamly close. It stayed there for what I thought a fewseconds and then I looked at the ground because I was scared and when I lookedback up I couldnt see it anymore but I could hear it taking off over the housesclose by.This was without a doubt a REAL UFO and a high tech one to boot.Please, do everything you can to make this propulsion technology public.It is, in my belief the only weapon to end all wars for our race. Wars, againstourselves that is.Tha"],"Viewing Distance":"20 Feet or Less","City":"Medicine Hat","Object Shape":"Unknown","Source":"MUFON","Longitude":"-110.677607","Disposition":"Unresolved","Case Number":"2141","map":"<A HREF = \"http://maps.google.com/maps?q=50.041554,+-110.677607(2141)&iwloc=A&hl=en\"> mufon case (2141) map </A>","Log Number":"","files":["/var/www/straped/mufon/html2text/2141.html.txt","/var/www/straped/mufon/org/2141.html"]}