{"Region":"Pennsylvania","Object Features":"Wings, Unknown","Sighting Duration":"Undisclosed","Case Number":"21415","Tags":"City","divs":["Sighting DetailsI was in Newtown, PA working. I was on Manor Rd. at 1:32am.It was a totally clear night. I had just looked at the clock when ahead of me in the sky was a row of lights that looked strange, so I stopped. They were just hovering about 50ft. above the trees and a few hundred feet ahead of me. It was totally silent. I got out to get a better look. It started to bank right, very slowly. All the lights faded as if it were going through a cloud, then 4 lights brightened. One on each wing tip and two, spaced, in the middle. As it contined to bank, I saw a row of small red lights under the two center white lights and then a second row of small red lights on the belly. I absolutely could not see the shape of the craft. Just blackness. It contined to turn around until I could see the back. I then saw red and white lights, this time in bars, flashing on and off like a laser light show. The configuration of those rear lights showed the back was a different shape. Like the rudder of a plane. It was going away, but still clear in the sky and I reached for the door handle of my van, glanced back up, and it was just gone. When I first saw it and noticed it was silent, I thought of stealths. I went to an air show once and saw a stealth, but this didn't look like that. As I was looking at the front, I was reminded of a manta ray, or skate. I was surprised and a little uneasy, but it didn't do anything, just went away, so I went back to work. When I spoke with co-workers, one suggested it was some kind of upgraded stealth. Ok, but we're not near a military base, and a stealth wouldn't have a laser light show on the back. I don't know what it was. Two hours after I saw this, four choppers, in formation, were seen by me and a co-worker. As they got to Newtown, they split up. I could see them, singly, as I contined to work, for about another hour."],"Viewing Distance":"101-500 Feet","Date Submitted":"01/09/2010 02:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.233195,+-74.934833(21415)&iwloc=A&hl=en\"> mufon case (21415) map </A>","Latitude":"40.233195","Country":"United States","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Other","Summary":"A row of lights first hovering, then slowly banked just above tree level. Then went away from me and disappeared.","City":"Newtown","files":["/var/www/straped/mufon/html2text/21415.html.txt","/var/www/straped/mufon/org/21415.html"],"Longitude":"-74.934833","Log Number":"US-01092010-0009","Date of the Event":"01/09/2010 01:32 UTC","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around January 9th 2010"],"Disposition":"Unknown"}