{"Latitude":"33.794836","Country":"United States","Weather Factors":"Unknown","Object Shape":"Star-like","Summary":"bright yellow/orange light","Object Features":"Unknown","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/21428.html.txt","/var/www/straped/mufon/org/21428.html"],"Source":"MUFON","Longitude":"-83.713229","trends":["There has been one other sighting in Monroe","There were no other sightings in Monroe on or around January 9th 2010"],"Case Number":"21428","map":"<A HREF = \"http://maps.google.com/maps?q=33.794836,+-83.713229(21428)&iwloc=A&hl=en\"> mufon case (21428) map </A>","Log Number":"US-01102010-0006","divs":["sighting detailsas my family and i were traveling west on us hwy 78 near monroe, toward loganville, ga., my wife and i saw a bright yellow\\orange light traveling horizontal in a south-easterly direction. the vehicle suddenly made an abrupt turn downward, at about 70-80 degrees and dipped below the tree line. the object appeared to be traveling much faster than an ordinary aircraft and went downward at an angle that standard aircraft are not capable of. it was hard to judge the distance and size of the object but appeared to be about 1\\2 mile away from us. the objects speed, brightness and low level attracted my attention. i was startled by the object my wife asked me if we needed to call someone and i told her \"no\", we don't have enough information. she, at first, thought it was an airplane going down. when i explained to her that man-made aircraft cannot change direction at such an angle, she agreed. we never saw the object again. the object appeared to have only one light, or be completely illuminated itself, but did not blink at all. i felt a little nervous after seeing the object but no other feelings were noted."],"Region":"Georgia","Date Submitted":"01/10/2010 04:01 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"01/09/2010 09:15 UTC","Tags":"City","Object Flight Path":"Path with directional change","City":"Monroe"}