{"Summary":"Brilliant sparkeling blue, silent, horiaziontal S. to N. direction, 10 to 15 degs. abv. horizion, somewhat larger than moon.","Source":"MUFON","Object Features":"None","Disposition":"Unknown","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around January 15th 1958"],"Weather Factors":"None","Country":"United States","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Tulsa","Log Number":"US-01102010-0007","divs":["Sighting DetailsOn a clear and very cold morning in the late 1950's while delivering the Tulsa Daily Times, I saw this unusual object which was plainly and clearly visible at tree top level, moving slowly, from my perspective, across the sky with no apparent deviation from it's South to North direction of travel. I did not recognize it as anything that I had ever seen before. It obviously was not a fixed wing aircraft nor even a blimp as there was no gondola and no noise what so ever coming from it. Any body from that time era has seen plenty of blimps and I never for a second thought that this was one. This thing was something else. The object was egg shaped and was a spectacular blue color that seemed iridescent or sparkling. It was larger than the moon and smaller than my hand at arms length. It was also absolutely silent and left no trail behind it. I watched in utter amazement until it was out of sight. As soon as I got home I told my father about the U.F.O. I had seen. Well, being 14 or 15 years old , I'm sure that he took my story in with a little skepticism but he listened to me politely as I poured my heart out and that was that. Till the next morning when to both our surprise, Dad told me that he had read of reported sightings of an (object)exactly matching my description as far away as Tennessee. We both thought this was more than a coincidence and that it was the same U.F.O. that I had seen in Tulsa the previous morning. Today I'm 65 yrs. old and that memory is still with me as clear as the morning it happened."],"Region":"Oklahoma","Case Number":"21429","Longitude":"-95.983805","Object Shape":"Blimp, Egg","Date of the Event":"01/15/1958 03:00 UTC","Date Submitted":"01/10/2010 05:10 UTC","Latitude":"36.161382","map":"<A HREF = \"http://maps.google.com/maps?q=36.161382,+-95.983805(21429)&iwloc=A&hl=en\"> mufon case (21429) map </A>","Object Flight Path":"Straight-line path","Tags":"City","files":["/var/www/straped/mufon/html2text/21429.html.txt","/var/www/straped/mufon/org/21429.html"]}