{"divs":["Sighting DetailsI'm pretty sure this was in 1984 when I was just 12 years old. It was about mid summer, but I can't remember the date. It was quite a while ago. Back then, I lived in Howell, Mi. I was a clear night, with only a few wispy clouds in the sky, and the moon was almost full. It was a perfect night look look up, and I was always fascinated with the night sky. I knew that by the time I was an adult, we would be up there with our flying cars, commuting back home to Mars from an honest day's work here on Earth. Well... That's what was supposed to happen, right? Santa, I think he went by the name \"Dad,\" around that time, had given me a telescope for Christmas. It was the best gift ever, or maybe second to the Jetfire tranforming robot that I found under the tree as well. It was around nine, and the sun had just set with still a bit of orange on the horizon. I had set up the telescope in the five-acre field between my home, and the home of my best friend, Ricky, then went to his place to have him join me for a little moongazing. I knocked on the window outside his bedroom, but there was no answer. So, I climbed, like we did, to the balcony of the upper floor to see if anyone was home. It's a good thing we lived in the woods and they were used to monkeys climbing on houses, I guess. Ricky's mom came out and told me that he had left with his father to Pennsylvania to visit family, and wouldn't be back for a couple of weeks. So, we ended up talking for a few minutes and then I caught something from the corner of my eye in the sky to the north. Maybe one degree south of the treeline from the perspective of the balcony of her home, I saw 12 to 16 neon orange V shapes. They seemed to be substantial, because as they moved they would block out stars that they would pass under. I looked at Ricky's mom to bring it to her attention, but she was already staring up at this display. It was a shock at first, and we watch with interest for 20 minutes according to her watch. What we witnessed were these V shapes assembling to two locations in the sky, pointing inward, and then joining to form two discs, like slices of a pizza. The assembly farthest to the north had merged without trouble, and simply hovered in the sky without sound, and perfectly still. The grouping to the south came together for the most part, but one of the vehicles was moving awkwardly and seemed to be having difficulty joining with the other craft. And this is what we were watching, and discussing the entire time. After that 20 minutes, I had asked her if she had a camera. We simply didn't have the presence of mind to consider a camera at the time. Who would want to go into the house and miss a moment of this anyway? She said she had no film for it, but after a while, decided to go inside and look for some. I stayed there on the balcony and watched, until she returned. She said that she had no film, and then asked me where they had gone. I looked from her to the sky, and they were gone. Just like that. The entire display lasted maybe a half hour, then was gone the moment I looked away at my friend's mom! It was an amazing night. After talking for a little while about what we had seen, I went back home. My mother was irritated, and informed me that it was midnight. She told me that she went to get me, but I had just left my telescope out and was nowhere around it. I thought that was impossible. There was no way. I could not have been out for more than an hour, being generous. There was just no way I was gone that long. Ever since then, there are other things. Dreams.. Curiosities.. I can't be certain, but I think somehow, I know how those things work. I know something else, too. Something rather useful. Well... I guess it's all moot. Who is going to believe a nobody like me? My own wife never believed me! And this is not my only sighting. And I'll never have the money to explore the information that's been wedged somewhere in my mind. But if I could, this world would be forever changed. I wish I could. But I can tell you this. Difference waves. From the smallest particle, to the workings of the brain, to the mystery of consciousness. It's all a highly complex orchestra of difference waves. Even space itself. All you need to transmute anything from one form to another is the difference image of the result you're looking for. I guess this is why thought affects things in reality to some degree. The brain is a difference wave processor, not the digital device that medicine compares it to. Science doesn't realize this yet. So they slam particles into each other with the effect of a musician beating his guitar against a wall, and consider everything in the universe in terms of ones and zeroes. But it's neither a one nor a zero, yet also both, as well as the infinity in between. All images exist simultaneously. All possibilities are present. And we can't understand why people have such widely varying world views. It's because we're all seeing something different, and trying our best to come to a consensus that we can call reality. Unfortunately, violence and hatred seems to be our tool of choice. Maybe I was supposed to act. Maybe I was given a gift and squandered it. If so, I apologize to all of you. Hm... But maybe now is the time.... Maybe I will teleport that water molecule someday soon."],"Object Features":"Undisclosed","Country":"United States","Object Shape":"Disc, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=42.610425,+-83.926475(21420)&iwloc=A&hl=en\"> mufon case (21420) map </A>","Region":"Michigan","City":"Howell","Disposition":"Insufficient Data","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-01092010-0014","Viewing Distance":"Unknown","trends":["There have been 20 other sightings in Howell","There were no other sightings in Howell on or around August 15th 1984"],"Longitude":"-83.926475","Summary":"Multiple vehicles merging to form larger vehicles.","Date of the Event":"08/15/1984 09:00 UTC","Sighting Duration":"03:00:00","Case Number":"21420","Latitude":"42.610425","Tags":"City","Object Flight Path":"Undisclosed","Date Submitted":"01/09/2010 10:05 UTC","files":["/var/www/straped/mufon/html2text/21420.html.txt","/var/www/straped/mufon/org/21420.html"]}