{"files":["/var/www/straped/mufon/html2text/21426.html.txt","/var/www/straped/mufon/more/21426_submitter_file1__photos264.JPG","/var/www/straped/mufon/org/21426.html"],"Weather Factors":"None","Object Features":"Unknown","trends":["There have been 18 other sightings in Monterey","There were no other sightings in Monterey on or around January 5th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Summary":"Bright star object came in off the coast at a pretty low altitude,","Source":"MUFON","City":"Monterey","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"01/10/2010 04:03 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.608528,+-121.889926(21426)&iwloc=A&hl=en\"> mufon case (21426) map </A>","Date of the Event":"01/05/2010 06:30 UTC","Longitude":"-121.889926","Object Shape":"Egg, Oval, Unknown","Log Number":"US-01102010-0004","Tags":"City","divs":["Sighting DetailsWhen I saw the orb or \"ovni\", I was on a ridgeline above the local beaches, and the canyon I live in. I have seen this orb before and on occasion two of them in formation, so I keep a look out for them. They are really fascinating and I have been taking video of them for over a span of almost six months now. The first sighting was in september of 2009. I in the loft of our barn and I looked out the window and saw a very bright light flying over our ranch. I yelled to my brother to look and then we both ran downstairs and outside to get a better look. I was awestruck, it must have been only 3-4 thousand feet off the ground, a brilliant blue and whitish orb with an aura around it. I could instantly tell this was no airplane or helicopter, it was also totally silent. I ran in to get my little HD Sanyo camcorder and as i got back with it seconds later, I COULD NOT GET IT TO TURN ON! I have used this camera a good deal an know how to work it, and the battery had just been fully charged. I believe it somehow jammed the electronics in it. Any how I have Canon XL1S and I have gotten some really great footage of these things. For some reason they always fade out or dim away after a few minutes. I have also sighted them in high orbits. They are definitely drawn to something here. It is also my belief that these are quite possibly coming from the depths of the ocean. They seem to come in waves, appearing for five to six nights in a row and then gone, they are always at different altitudes and headings. They generally have a steady course and heading, i have on occasion seen them dip and back track, both i caught on film. The time my brother and I observed two orbs in formation (also from a ridgeline facing the ocean) they flew right over us perhaps at 8-9,000 ft. they were more of an amber color. It was a rather ominous feeling when they were right above us, then they shot straight up into space-fading out. I have a freeze frame i took off a video with the XL1S where the orb flies by a airplane. I zoomed in on it and enhanced some of the color tones. It is some what pixilated but you get can see what it is. Ill be keeping my eyes open here on the west coast =)"],"Sighting Duration":"00:02:30","Disposition":"Hoax","Case Number":"21426","Latitude":"36.608528","Region":"California"}