{"map":"<A HREF = \"http://maps.google.com/maps?q=39.962426,+-82.989094(21423)&iwloc=A&hl=en\"> mufon case (21423) map </A>","Weather Factors":"None","Latitude":"39.962426","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around January 10th 2010"],"Country":"United States","Object Flight Path":"Path then hovering","Disposition":"Unknown","Date Submitted":"01/10/2010 01:19 UTC","Date of the Event":"01/10/2010 01:00 UTC","files":["/var/www/straped/mufon/html2text/21423.html.txt","/var/www/straped/mufon/org/21423.html"],"Tags":"City","Longitude":"-82.989094","Sighting Duration":"01:10:00","Viewing Distance":"501 Feet - 1 Mile","Region":"Ohio","City":"Columbus","Summary":"one triangle object, one large object, one small object.","Source":"MUFON","Case Number":"21423","divs":["Sighting Detailsbasically the triangle object , and the large object were slowly moving in a east by south east direction. the small object would take off fast for a short distance , stop on a dime and move sharply to my left, and then stop again to a dead stop. then it would move for 15-20 minutes . i went inside to finish working on a furnace. when i came back out. they were still there but farther away. then i spotted out of the corner of my eye another small object darting around like the first one. i wear glasses so i can focus but the area of the sky i was watching looked a little out of focus ,and there maybe was fog in the air up high , but maybe not. it was very dark in the sky other than the lights from the objects which were very clear but in the middle it looked blurry.never seen any ufo's before in my life so maybe was stars. would stars move in the sky 2-4 miles away in about 20-30 minutes ? the area i seen the possible objects was above darbydale ohio off norton rd. around 5100 norton rd.i was done working and i was getting cold. the stars just didn't look right to me , too many clustered together in one area, then spread out over the rest of the sky that i was looking at. hopefully someone else seen this also. if not then i probably wasn't seeing what i did. that fast moving object i definitly saw. so thats it."],"Object Features":"None","Log Number":"US-01102010-0001","Object Shape":"Sphere, Triangle"}