{"Object Features":"Unknown","Case Number":"21425","divs":["Sighting DetailsI was starting my night watch shift sitting in my car. My care was facing west. I looked to the horizon and saw an amazing formation of bright red lights which were rising from the horizon. The formation was so big that I could not cover them all with my hand. The formation took up about a third of all my vision. I put my jacket on and grabbed my binoculars then got out of my car to get a better look. I propped the binoculars on a fire hydrant that was next to my car in order to steady the view. I saw a few of them close up with the binoculars. All I could make out was some sort of very intense bright red orb shape. I then started walking down JR Drive towards the lights to see if I could tell how far they were from my location. My perspective never changed so I assume the formation was very very far away. From the right side to the left it must have been a 50 mile spread. It was in a busy part of town so there must be hundreds of people who saw it. I had no camera with me but made a drawing of the formation which I will make available."],"Latitude":"29.570447","Disposition":"IFO","Log Number":"US-01102010-0003","Tags":"City","Country":"United States","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=29.570447,+-95.284517(21425)&iwloc=A&hl=en\"> mufon case (21425) map </A>","Date of the Event":"01/10/2010 06:30 UTC","City":"Pearland","Summary":"Symmetrical formation of 8 to 10 red lights","trends":["There have been 5 other sightings in Pearland","There were no other sightings in Pearland on or around January 10th 2010"],"files":["/var/www/straped/mufon/html2text/21425.html.txt","/var/www/straped/mufon/org/21425.html"],"Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Weather Factors":"None, Does Not Apply","Date Submitted":"01/10/2010 02:23 UTC","Viewing Distance":"Over One Mile","Longitude":"-95.284517","Region":"Texas","Source":"MUFON"}