{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.936988,+69.260653(21424)&iwloc=A&hl=en\"> mufon case (21424) map </A>","Longitude":"69.260653","divs":["Sighting DetailsI was stationed at Bagram AB during most of 2009. On or about May 15, 2009; I was enjoying a night off. I had stepped out of my B-Hut for a cigarette and noticed several red colored lights around the mountains surrounding the base. One light in particular appeared to be an orb and was hovering over the SW end of the base. This light was not like any aircraft light that operates in the area. Most of the aircraft that are coming in at night do not have any lights on to prevent insurgents from attacking them during landing. The SW light moved back in forth in a slow motion, but also appeared to hover from time to time. Another light located to the SE hovered over a mountain pass at an altitude of about 25-30k feet. The third light was over the mountains just to the E of the base. I did see a pair of F-15s go up and begin patrols, but made no effort to intercept the lights. A Kiowa helicopter was also flying around, but this was more likely as part of the base's standard force protection than in relation to the lights. These lights remained until just before sunrise, but had not lost any visibility like a star would as sunrise began. I did not see how the lights left the area as I had returned to my quarters. I know other soldiers saw them and wondered what they were from discussions at my office as well as the chow hall."],"Object Shape":"Circle, Sphere, Star-like","Region":"Parvan","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","City":"Bagram","Log Number":"AF-01102010-0002","trends":["There has been one other sighting in Bagram","There were no other sightings in Bagram on or around May 15th 2009"],"Country":"Afghanistan","files":["/var/www/straped/mufon/html2text/21424.html.txt","/var/www/straped/mufon/org/21424.html"],"Date of the Event":"05/15/2009 12:00 UTC","Source":"MUFON","Date Submitted":"01/10/2010 02:04 UTC","Disposition":"Unresolved","Summary":"Multiple lights over Bagram AB, AF.","Case Number":"21424","Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"34.936988"}