{"City":"Denver","Latitude":"39.740644","Date of the Event":"01/05/0001 07:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.740644,+-104.978233(21427)&iwloc=A&hl=en\"> mufon case (21427) map </A>","Object Features":"None","Tags":"City","Weather Factors":"Snow","files":["/var/www/straped/mufon/html2text/21427.html.txt","/var/www/straped/mufon/org/21427.html"],"trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around January 3rd 0001"],"Summary":"BRIGHT light not moving, came down hoverd over nieghbors house....","Case Number":"21427","Source":"MUFON","Disposition":"Hoax","Region":"Colorado","divs":["Sighting DetailsWhat i have witnessed for the past week is not make believe i would not waste my time on here but no one in my family believed me so i feel that i need to tell what i seen. It all started when i was walking down my ally in green valley ranch Denver co, when i saw a star that looked like it was kind of moving but then i realized it wasn't a star because it dimmed out and started to blink like a air plane with one light constant. It sort of hovered down and i followed it until i couldn't catch it. Established i walked back to my home and told my sister which told me to grow up. Then as i looked up out my living room window there were at least 5 lights in the sky all scattered and i thought airplanes or helicopters do not fly that close to each other. They kept hovering in different directions then coming back, but the main event happened on the same night i was walking down my ally again as i seen a REALLY bright light in the sky again and i knew it wasn't a star and i walked closer to it and it wasn't moving at all i began to stare at it for about 30 seconds as it dimmed out and blinked red and a constant white light that kept dimming out and on not blinking. It came down and i could tell it was kind of coming in my direction close to 43rd and Malaya a kind of busy street and it came down hovering not making any noise whats so ever and at this point i could kind of make out the fuger it looked like a triangle with three oval lights. AS it was passing me by i seen a house it was about to go over with the family getting out of there car and in shock i screamed UFO but they couldn't here me. As i shouted it again at the top of my lungs it seemed to just dart off not making any noise at all. These weird lights are in the sky's of my neighborhood for the past week but to far to track and to low to be anything commercial. And the last sighting my father and sister witnessed it also. There were two red lights in the sky one over the other and one constantly red not moving and the one on top glowing like the moon red and dimming out doing it over and over again."],"Sighting Duration":"02:00:00","Object Shape":"Disc, Triangle","Country":"United States","Date Submitted":"01/10/2010 12:16 UTC","Object Flight Path":"Path with directional change","Longitude":"-104.978233","Log Number":"US-01102010-0005","Viewing Distance":"Unknown"}