{"Longitude":"-85.691151","Object Features":"Unknown","trends":["there have been no other sightings in lexington\\vienna","This sighting has never been favorited."],"Object Flight Path":"Stationary,Straight-line path","City":"Lexington/Vienna","Case Number":"21434","Latitude":"38.658011","divs":["Sighting DetailsI had just stepped outside to walk my dog when I looked north and saw a bright orange boomerang flash in the sky. My first thought was that it was sunlight reflecting off a aircraft.Then it dawned on me that I could not see any aircraft anywhere in the sky. I then began to walk to the back of the property when I saw one and then a second flash a little to the west of where I saw the first flash. These two flashes where white instead of orange. I watched for a few minutes but saw nothing else and went back to the dog walking thing. After several minutes I turned around and looked at the spot where I had seen the flashes and saw a large ball of light that I at first thought was a star. Then it became clear this was not a star and was blinking. The blinking reminded me of a old rotating police light. The light was white and I could see flashes of blue or green in it. There was another smaller blinking light underneath and to the west of the larger light that was moving very slowly as if it were searching for something. I walked back to the house and continued to watch the lights and got my mom to come outside and look. She agreed that the lights were odd and did not look like any aircraft. We then went back inside and due to the cold and I came back out a few minutes later and the lights were gone. I was never nervous while observing this, just curious as to what the light could be and how odd it was to be there."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.658011,+-85.691151(21434)&iwloc=A&hl=en\"> mufon case (21434) map </A>","Object Shape":"Boomerang, Flash, Other","Source":"MUFON","Summary":"Unkown Flashes and Lights in Scott county","Country":"United States","Disposition":"Unknown","Date Submitted":"01/11/2010 12:02 UTC","files":["/var/www/straped/mufon/html2text/21434.html.txt","/var/www/straped/mufon/org/21434.html"],"Weather Factors":"Unknown","Region":"Indiana","Tags":"City","Viewing Distance":"Over One Mile","Date of the Event":"01/10/2010 06:30 UTC","Log Number":"US-01112010-0001"}