{"Object Features":"Undisclosed","divs":["Sighting DetailsI was outside in my backyard this evening and noticed how clear a night it was, with perhaps 12 stars visible which is a lot in the city. I noticed movement and saw a dimly visible star-like object which was moving slowly horizontally from the south-east toward due south. It was approximately 45 degrees up from the horizon. It appeared to be very high in altitude, so at first I thought it was a satellite. It disappeared with-in 4 seconds. I took a few steps (all the while keeping watch) to get a better view beyond a deciduous tree. About 3 seconds later, I saw the same star-like object just a little beyond where it had disappeared. I watched it for about 3 seconds continuing toward the south, but then it stopped and completely turned back toward the south-east. I was totally surprised. Then for about 6 seconds it slowed several times and took an irregular course and then straightened again (still going toward the south-east) and then it disappeared in the general area it had disappeared before. I watched that area of the sky, and the rest of the sky visible from my yard for about another five minutes and didn't see it reappear. It all seemed to happen slowly, yet it really only took a few seconds for the whole event to occur. I went back outside about a half-hour later and the sky was cloud covered with no stars visible whatsoever. Now several hours later it is completely clear again."],"Weather Factors":"Unknown","Summary":"dimly visible white star-like object","trends":["There have been 6 other sightings in Charlottetown","There were no other sightings in Charlottetown on or around January 10th 2010"],"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/21432.html.txt","/var/www/straped/mufon/org/21432.html"],"Longitude":"-63.11189","map":"<A HREF = \"http://maps.google.com/maps?q=46.255177,+-63.11189(21432)&iwloc=A&hl=en\"> mufon case (21432) map </A>","Source":"MUFON","Date of the Event":"01/10/2010 06:20 UTC","Tags":"City","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"46.255177","Log Number":"CA-01102010-0010","Region":"Prince Edward Island","Disposition":"Unresolved","Country":"Canada","Case Number":"21432","Date Submitted":"01/10/2010 10:06 UTC","Viewing Distance":"Unknown","City":"Charlottetown"}