{"Country":"United States","Tags":"City","Disposition":"IFO","Summary":"forward facing pyramid / fireball","Latitude":"25.795969","Weather Factors":"None","Region":"Florida","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around January 11th 2010"],"Date of the Event":"01/11/2010 11:15 UTC","Date Submitted":"01/12/2010 12:13 UTC","Log Number":"US-01122010-0001","Longitude":"-80.218129","divs":["sighting detailsthere was a bright light high over the miami skyline - which isn't unusual considering the amount of air traffic, however, living with a front row view of the skies for several years, this one wasn't moving and seemed out of place. to the naked eye, the craft seemed to have a front green light and a pyramid shaped (or cone shaped) body which was larger in the rear with white, green and blue lights, but seemed to also change in size and form. the craft moved from one side of the skyline to the other, seeming to be very very high in the sky. at times, it seemed to be more of a fireball, however the change in it's distance from us was readily visible as it continued to move over the sky. then it suddenly disappeared. completely gone from the sky. approx. 2 minutes later something, perhaps the same or another craft, appeared further to the west. so, we grabbed the camcorder. it was easy to see how the craft was moving in directions which are not the same as that of an airplane. it would change in distance as well as drift up and down in altitude and east\\west in direction. after watching for about 20 minutes, it's still moving around and continuing to hover. we are continuing to watch it from the bedroom with our binoculars and if anything major arises, we'll report back! (video is large and will be uploaded to youtube)"],"Source":"MUFON","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Saturn-like","City":"Miami","map":"<A HREF = \"http://maps.google.com/maps?q=25.795969,+-80.218129(21447)&iwloc=A&hl=en\"> mufon case (21447) map </A>","files":["/var/www/straped/mufon/html2text/21447.html.txt","/var/www/straped/mufon/org/21447.html"],"Case Number":"21447","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Object Features":"Unknown"}