{"Tags":"City","Log Number":"US-01122010-0002","Disposition":"Insufficient Data","City":"Leggett","Source":"MUFON","divs":["Sighting Details My husband was standing outside in our front yard looking east and saw bright flash of white light. About half a minute later he saw it again in the same place. He continued watching and about a minute later he saw it a third time and he watched for another five minutes and it did not repeat. That was sometime in the first week of August. A couple weeks later, my husband was again looking into the sky but South this time, around the same time of night as the first sighting. This time when the flash happened it was the same but perhaps farther away. It is hard to say what distance though because it was very high up, like a star but much brighter, and bigger. But the second one seemed \"deeper\" somehow. This time there was only two flashes about about 30 seconds apart roughly. About a week of hearing him talk about it and we had had a bar b q and evening was getting on, this probably getting towards the end of August, it was mostly dark and my brother says, \"I think I just saw that light your husband was talking about!\" And he proceeded to ask my husband if it was real bright and white, and he said yes, and my brother pointed to where he saw it, towards the North but almost directly above us, and we all looked and almost a minute had passed since he first said he saw something and then it lit up again and my brother, husband, and I all saw the second flash and to me it looked very white but also metalic, like the old strobe lights with the silver behind the light that would give it that silvery glare. And it was very bright and bigger than a star but somehow looked very high up like the stars. My brother said it looked like it was still in the same place, then after about 20-30 seconds we saw it again in the same place, but we watched for a long time and did not see it again. Then three or four weeks ago my husband came into the house and was excited. He said that he saw the same light again, this time closer in, but still not close, meaning still looking like a too large and bright star, but not as \"deep\" as the second time, but about the same as the first but this time in the Southern part of the sky. He saw it flash four times this time and it did not move in the sky. It was right after dusk and there were not very many stars out yet but there was one brighter one in the southern sky and this flash was occuring directly above it about half an inch. He states that the time passing between each flash ranged from half a minute to a minute and a half and the whole episode lasted about five minutes. I went outside and watched with him for a few minutes but neither of us saw it happen again. I called my friend that lives near us who also is an investigator for MUFON and told her about it. She arrived at my house within fifteen minutes and I showed here where my husband said he saw it and we watched for a while and flashed that area with a laser but to no avail. We did not see it again that night nor since. We live in a very remote area in California and therefore have a very good view of the skies that we take advantage of regularly. We see a lot of planes, many satalites, helicoptors...even the space station and know how to recognize these types of things. This flashing light does not resemble none of those things. The strangest thing about it being the time between each flash being irregular, and also, that it does not move even after longer than three or four minutes. I say three because the longest time my husband thinks it took was five minutes, but we all know how time goes when you are waiting for the pot to boil... That is our account of the activities to the best of our being able to describe them without having actually written it down when it happened. We will try to keep better details if we ever see it again though."],"Summary":"ref 21386","Object Shape":"Star-like, Unknown","Region":"California","Case Number":"21448","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.874844,+-123.708868(21448)&iwloc=A&hl=en\"> mufon case (21448) map </A>","Object Flight Path":"Stationary","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/21448.html.txt","/var/www/straped/mufon/org/21448.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"01/12/2010 12:26 UTC","Longitude":"-123.708868","Object Features":"None","Latitude":"39.874844","Date of the Event":"07/31/2009 12:00 UTC","trends":["There have been 17 other sightings in Leggett","There were no other sightings in Leggett on or around July 31st 2009"]}