{"Sighting Duration":"01:07:00","files":["/var/www/straped/mufon/html2text/21443.html.txt","/var/www/straped/mufon/more/21443_submitter_file1__Jan112010.jpg","/var/www/straped/mufon/org/21443.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.743474,+-104.982463(21443)&iwloc=A&hl=en\"> mufon case (21443) map </A>","Weather Factors":"Unknown","Region":"Colorado","Log Number":"US-01112010-0011","Longitude":"-104.982463","Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","Summary":"This morning while driving to work, I saw a bright white (planet sized) object that was stationary with the moon.","Date Submitted":"01/11/2010 09:07 UTC","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around January 11th 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsThis morning while driving to work, I saw a bright white (planet sized) object that was stationary with the moon. I live in the Denver area, and was traveling south on 470 to I25 South (0555). The object was as bright as Venus would be, and was 2 degrees to the right of the moon in a stationary orbit. I kept an eye on the object that was in the same position relative to the moon (2 degrees). The object stayed in the same position to the moon for the duration of the observation (1hour). After traveling on I 25 South until 0700 the object disappeared with the moon as the sun came up. From an educated guess the object was probably very large as it was in the moons shadow, and did not fade or move. The object could have been at the same position before and after my observation. My other guess is it was a mother ship from the size. I usually see at least 1 UFO a week in this area of Colorado. I reported this object as it was very differnt, and easier to not dispute."],"Disposition":"IFO","Latitude":"39.743474","Object Features":"Unknown","Case Number":"21443","Tags":"City","City":"Denver","Object Flight Path":"Stationary","Date of the Event":"01/11/2010 05:55 UTC","Object Shape":"Star-like"}