{"Longitude":"-85.929367","Log Number":"US-01112010-0013","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Coopersville","There were no other sightings in Coopersville on or around January 10th 2010"],"Date of the Event":"01/10/2010 09:00 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/21445.html.txt","/var/www/straped/mufon/org/21445.html"],"Case Number":"21445","Date Submitted":"01/11/2010 10:11 UTC","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=43.066091,+-85.929367(21445)&iwloc=A&hl=en\"> mufon case (21445) map </A>","Latitude":"43.066091","Tags":"City","Source":"MUFON","Object Features":"Undisclosed","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"I observed a dark grey triangle object with the tips of the triangle glowing in a white light.","City":"Coopersville","divs":["Sighting DetailsOn Sunday morning January 10, 2010, at 9:45 a.m. I was standing in my kitchen looking out the window drinking a cup of coffee. The kitchen window looks out over a creek a woods. I was watching a red squirrel moving from tree to tree when, out of the corner of my eye I spotted three white birds flying from west to east. I was curious about what kind of bird I was seeing, thinking they were probably sea gulls. I focused in on the birds and they weren't birds at all. When I turned my attention to what I thought were birds, I saw a dark grey triangular object. The tips of the triangle were glowing with a white light - what I originally thought were birds. Obviously the object was moving at the speed of a bird. A fixed winged object of this size would fall out of the sky at this speed. There was no sound and if it was a helicopter I would have heard the rotors and engine. I observed the object through the tops of the trees. I estimate the object was a half mile away to my south flying over an open field. My thumb extended at arms length would not have covered up the object but a tennis ball would have covered it. I estimate the object was approximately 500 feet above the open field. I observed the object for about 20 seconds when it left my field of view. When I was in college I was in the student flying club. I've flown fixed wing aircraft and I'm an avid airplane watcher. I've never seen anything like this. I've searched my mind for rationale explanations for what I saw and I come up with nothing that makes sense."],"Object Shape":"Triangle"}