{"Viewing Distance":"101-500 Feet","Log Number":"US-01122010-0007","Date of the Event":"05/14/2002 08:15 UTC","Longitude":"-115.167316","Summary":"Disc shaped with glowing yellow with blinking red, green, blue lights on the bottom, glowing in a circular motion.","map":"<A HREF = \"http://maps.google.com/maps?q=36.121076,+-115.167316(21453)&iwloc=A&hl=en\"> mufon case (21453) map </A>","Object Shape":"Disc","Date Submitted":"01/12/2010 01:41 UTC","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 14th 2002"],"City":"Las Vegas","Source":"MUFON","Object Features":"Unknown","Weather Factors":"None","Latitude":"36.121076","Region":"Nevada","Case Number":"21453","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","divs":["Sighting Detailswell, where do i start.. well, me and a friend of mine decided to go get a bite to eat.. so we were driving thru my neighborhood to go to rabertos taco shop, right around the corner from where i live.. so we took back streets to get there.. as we turned on one street we both saw an object flowting right over power lines.. the object was not moving flowting over a fire deparment on a street called flamingo.. well me and my friend both saying what is that, so we started to name what it could be.. a blimp a helicopter, ect.. and all of a sudden this thing cocked back so fast.. it looked like if someone was pulling back a slingshot, was almost instent, this thing took of so fast that it was living a green trail behind it as it was flying away.. kind of looked like lightning. we were both looking at each other saying no way that just happend.. we knew for a fact that was not a plane or anything we had ever saw.. i reported it in to some web page back in the day.. thay weren't to mutch help.. but years went by and always wanted to write to someone professionals to talk about it but never knew who to write to.. i have seen ufo hunter on tv but there was no investigators to write to back then..(well none that i new of) but i always talk about it and everyone though we were nuts and never belived us.. i wish we had a camera or something that night. but who thinks about these things when u get a bite to eat right.. i never belived in ufos untill that night... but still from this day im questioning my self was it alien or military.. im glad a friend was with me that night so i wouldn't have to share it alone.. but yea what the hell is going on?"],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/21453.html.txt","/var/www/straped/mufon/org/21453.html"]}