{"Longitude":"174.765782","City":"Auckland","Viewing Distance":"Unknown","Latitude":"-36.84194","Date Submitted":"01/12/2010 09:10 UTC","divs":["Sighting DetailsThis was not a one time event. This happened over a period of three weeks approximately for three hour periods and was witnessed by myself , kids and Neighbours. We all reported the incident including to NASA in the USA but could not get any action. These ufo's were intelligent with no doubt because they would be flying across the sky at a rate too incredible to be man made.They zig zagged and played with each other and were in the sky doing random tricks. What surprised me was the sighting was above and near the air force base and there was no reaction. We begged the media to come down but they showed no interest. what also surprised me was that these ufo's were flying well below cloud level at times and were roughly the size of a small aircraft. The craft's as sometimes there were up to 5 ufo's at one time were a 3 dimensional disc with an orb at the base which appeared to hang below the object but not joined to the disc, the orb was a very bright light. The crafts shone light and had no colour. I am commissioned as a youth missionary through the church and my family are Christians. This account is true in every aspect of what we witnessed. I have Aspergers syndrome and I am very sensitive to movement in my peripheral vision, the movement of the objects in the sky caught my attention almost immediately. At the time I was outside praying. When I first noticed the object it soon became apparent that it was intelligent in relation to it's movement and too fast to be anything man made, I know this because jumbo jets going to Australia fly over head and takes a couple of minuets for the plane to disappear over the horizon where these objects could fly across the sky as far as I could see in about 2-3 seconds. So I knew almost instantly what they were or were not. My reaction to this was that they were probably evil and possibly related to the objects mentioned in the first chapter of Ezekiel in the Bible. The objects at the end just flew and disappeared out of sight. How ever they always appeared from the direction of the Pot formation of stars ."],"Case Number":"21451","Object Features":"Unknown","Disposition":"Unresolved","Log Number":"NZ-01122010-0005","Object Shape":"Disc","Weather Factors":"None","Source":"MUFON","trends":["There have been 51 other sightings in Auckland","There were no other sightings in Auckland on or around November 5th 2008"],"Region":"Auckland","Tags":"City","Country":"New Zealand","files":["/var/www/straped/mufon/html2text/21451.html.txt","/var/www/straped/mufon/org/21451.html"],"Summary":"Circular with orb at base not appearing to be joined to the top disc","map":"<A HREF = \"http://maps.google.com/maps?q=-36.84194,+174.765782(21451)&iwloc=A&hl=en\"> mufon case (21451) map </A>","Date of the Event":"11/05/2008 10:30 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering"}