{"Viewing Distance":"21-100 Feet","Sighting Duration":"00:05:00","Longitude":"-76.091617","Summary":"rt. 40 near aberdead md","Latitude":"39.549279","Object Flight Path":"Stationary","Disposition":"Unknown","trends":["There have been no other sightings in Havre de Grace","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/2145.html.txt","/var/www/straped/mufon/org/2145.html"],"Region":"Maryland","Source":"MUFON","Tags":"City","Case Number":"2145","Log Number":"","Object Shape":"Other","City":"Havre de Grace","Date Submitted":"09/30/1993 04:00 UTC","divs":["Sighting DetailsI was currently working for a Limo. service and the call came that I had to takea guy up to philli.,Pa. After picking him up in Baltimore We proceaded on toPa.I dont remember why but we went up route 40 out of baltimore for philli.I was driving a new 2000 Dodge passenger van and we were moving about 50-55 mphas we were approaching What I believe was Riverside park way or Riverside Road Iwas noticing that the clouds we excoming up the road were disapating and beganto look for the moon as I noticed it was begining to show its light itdisappearded again . No one else was in the road I got a stong alert feeling atthis point and continued to look towards hte sky . My hair felt like it wasgoing to jump from my skin all over my body. I let the accelerator petal go as Idrifted I was looking real hard at the spot I noticed the moon, in the moon sreappearence thier was a shape plocking the light. The object was shaped likenothing I have ever seen.It had four 4 areas on it which might have been somekinda magnetic field enginethe four of these were interconnected by four walls which were not shaped forthe airodynamics we now see how everything is bubled to a single point but ithad a depressed walllike an obique from engine to enginethe two engins in the rear were fertherapart the those in the front or is it the other way arround note all the fourengine like units were seperated by a wall its just that the walls were approx.150-200 ft. long and prob. 1-3 building stories high with these engines Iguess I could say the walls resembled this---3E3C-- so if you put four of these together and make the side ones three timeslonger then that of the rear input 4 cylinder shapes bold in appearence anconnect the fron buy a slitly shorter parenthesis paint it rustic and hide therivets or bolts youll have what I saw."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.549279,+-76.091617(2145)&iwloc=A&hl=en\"> mufon case (2145) map </A>","Country":"United States","Weather Factors":"Windy","Object Features":"Other","Date of the Event":"09/30/1993 04:00 UTC"}