{"Disposition":"IFO","Weather Factors":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Richford","Latitude":"42.355629","Tags":"City","Summary":"Spotted odd \"pulsating\" light from the driveway","Region":"New York","Case Number":"21462","Country":"United States","Date of the Event":"01/10/2010 06:30 UTC","Object Shape":"Unknown","divs":["Sighting Details On the night of the 10th of January, 2010 at around 6:30PM, while I was walking my dog near my driveway. I was looking at the stars like I do most nights, and I noticed an odd pulsating or twinkling light off to the west, towards Ithaca New York. At the time I thought it might have been an aircraft with it's landing lights on. I went inside to grab the camera, a Fujifilm S5000, thinking I might be able to get a good picture of it. I zoomed into the object under maximum zoom, 10 times optical and 2.2 times digital, and proceeded to use a pine tree to somewhat stabilize the image with near zero success. I took several pictures of the object and one video over a span of 15 to 20 minutes. I brought my father out who also saw the object, commenting it was probably a plane. I'm an avid flight simmer, RC pilot, and looking forward to a career in aviation; needless to say I have a good grasp of what planes and helicopters can and can not do, and what colors are used in aircraft navigation lights. From what I can see from my pictures the object had lights or various blues, whites, yellows, reds, and greens. Blue is not used in aircraft navigation lights, nor could a mix of any of the colors that ARE used result in a blue light. during the sighting an airplane did fly by, a very common occurrence in my area of upstate New York. I could clearly see the airplane's anti-collision strobe lights, the object looked nothing like those. There are no cell phone or radio towers in that direction that are visible from my location. During the 15-20 minutes I watched the object though both the camera and with my own eye it never moved, it just kind of hovered over the hill (I'm sure it was some distance beyond the hill, but it looked like it was over it to me). It continued to pulsate different intensities of whiteish light and sit right where it was for the duration of the viewing. At no time did I feel at all like I was threatened, more an intense curiosity of what exactly the object was. At about this time, roughly 6:45pm, I headed back inside to try to warm up, when I headed back outside about a half hour later the object, which had stayed still for nearly 20 minutes, was gone. I have never seen anything like it before."],"Date Submitted":"01/12/2010 09:56 UTC","files":["/var/www/straped/mufon/html2text/21462.html.txt","/var/www/straped/mufon/more/21462_submitter_file1__DSCF5481.JPG","/var/www/straped/mufon/more/21462_submitter_file2__DSCF5486.JPG","/var/www/straped/mufon/more/21462_submitter_file3__DSCF5488.JPG","/var/www/straped/mufon/org/21462.html"],"trends":["There have been no other sightings in Richford","This sighting has never been favorited."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.355629,+-76.200764(21462)&iwloc=A&hl=en\"> mufon case (21462) map </A>","Longitude":"-76.200764","Viewing Distance":"Unknown","Log Number":"US-01122010-0016"}