{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.426372,+-98.489048(21464)&iwloc=A&hl=en\"> mufon case (21464) map </A>","Tags":"City","Object Shape":"Flash, Star-like","Date Submitted":"01/12/2010 11:14 UTC","Longitude":"-98.489048","divs":["Sighting DetailsOn January 8, 2010 around 6 pm I was closing the blinds on the back windows of my house (facing east) as the sun was setting when I noticed a bright orb in the sky. Unsure what to make of it I stood observing it for several minutes trying to figure out what I was looking at. I knew it wasn't a star since we live in a suburb in the San Antonio area and we have a pretty good view of the sky every night without the glare of city lights. It began to float very slowly to the left so I ran to grab my camera and took a picture. Soon after it faded rather quickly and I lost sight of it so I decided to keep the blinds open to see if it reappeared. About an hour later it reappeared further away with the same intensity but then faded and began to blink similar to the lights of a plane, red, white, blue, green, yellow. It flew very slowly across the sky continuing to blink and then two more similar objects appeared around it. My husband arrived home from work and I told him about what I was seeing and he observed them with me. We just stood trying to figure out what was going on. We phoned our neighbor who lives one street over and she told us she could see them from her front yard. Over the next couple of hours they would appear and disappear from starlike objects that would glare up brighter than any of the stars around and then blinking colored lights flying across the sky. The strange thing is that this has happened every night for the past week in the same area and as many as 5 will appear at one time, each slowly fading out. I keep my camera handy but they are not easy to take a clear picture of."],"City":"San Antonio","Case Number":"21464","Sighting Duration":"Undisclosed","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around January 8th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Log Number":"US-01122010-0018","Object Features":"Undisclosed","Latitude":"29.426372","Country":"United States","Summary":"Orb like UFOs that mimic planes","files":["/var/www/straped/mufon/html2text/21464.html.txt","/var/www/straped/mufon/more/21464_submitter_file1__UFO.JPG","/var/www/straped/mufon/more/21464_submitter_file2__CIMG4071.JPG","/var/www/straped/mufon/org/21464.html"],"Disposition":"Unknown","Region":"Texas","Date of the Event":"01/08/2010 06:00 UTC","Source":"MUFON","Weather Factors":"Unknown"}