{"trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around January 12th 2010"],"Date Submitted":"01/12/2010 11:18 UTC","Tags":"City","divs":["Sighting Details I was outside helping my dad washing the car around 5pm and around 6:20 we were done. We had nothing to do ,so my dad started to talk about the stars and planets in the sky. We stared at the stars then a plane flew just north and I stared at it then my dad said to look up. I saw this light that was white and that the airplane flew close to it. After the plane left, the light started to move slowly to the west. When it started to move, it changed from white to blue. My dad said that it is nothing like he had ever seen. The blue light changed course to thee south rapidly and for awhile the blue light disappeared. My dad was telling me that it was not a satellite, a plane, or a comet. We kept looking at the sky then another plane flew near, then I saw three dim blue light shaped as a triangle. As the plane flew south the triangular shaped blue light flew east towards Dallas and then rapidly in a second, the lights turned white and disappeared. I ran inside trying to get my camera ,but the battery was low. I ran back on the driveway at I looked north if I can try to see the light for about 20 minutes ,but the lights never reappeared. The First sighing was a white light that stayed in the same position then it started to move west. Then turned blue and turned to go to the south an disappeared. The Second sighting was when a a plane passed from DFW Airport flew over head to the north then three blue dim lights moved toward the east which came from the west which looked as if it passed near the plane. After 3 Seconds of looking at it, it disappeared. Non of us can identify it.I will just tell you it was not a comet because comets cannot disappear, they can't change color and can't change direction rapidly. It was not a satellite ,a helicopter or a plane. What do think it was."],"Log Number":"US-01122010-0019","Date of the Event":"01/12/2010 06:34 UTC","City":"Arlington","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-97.099576","Case Number":"21465","Disposition":"Hoax","Summary":"Triangle UFO and Strange Light","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.738197,+-97.099576(21465)&iwloc=A&hl=en\"> mufon case (21465) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Triangle","Object Features":"Undisclosed","Latitude":"32.738197","files":["/var/www/straped/mufon/html2text/21465.html.txt","/var/www/straped/mufon/org/21465.html"]}