{"Sighting Duration":"Undisclosed","trends":["There have been 62 other sightings in Memphis","There was one other sighting in Memphis on or around February 14th 1976"],"files":["/var/www/straped/mufon/html2text/21476.html.txt","/var/www/straped/mufon/org/21476.html"],"Tags":"City","divs":["Sighting DetailsTraveling west on Walnut Grove, I noticed a large object descending behind the tree line near East Highschool. It was still daylight, the sun was going down. The object was easily larger than East Highschool's football field, it was rotating and disc-like in nature. The object was clearly divided into two distinct sections, a smaller top 'half' sitting atop a larger bottom 'half'. The sections appeared to rotate opposite of each other (ie, one clockwise and the other counterclockwise) in \"half rotations\"...they would rotate halfway in one direction and then rotate halfway in the other direction, independently of each other in a smooth, consistent movement. This 'rotation' was evidenced by three sections of pulsing lights (top, mid section, and bottom) and MAY have simply been the sequence of the lights and not actually any structural rotation. The lights were pulsing and very large. The lights were yellow, red, green, and blue with yellow probably as the most prominent. As we drove down Walnut Grove, approximately 100 to 200 feet, we passed the tree line and the object was no longer visible on the other side. Others were in the car with me. I have read and heard about other observations in Memphis around the same time frame. I believe that the object I saw, the object described in your report, and an object famously observed by officer Lamar Todd of the Memphis Police Department along I-240 and Norris (which would be in the same general area as the report on your site, near the Downtown interstate and Mississippi Bridge) may all possibly be the same object. If more details are needed, feel free to e-mail me."],"Disposition":"Insufficient Data","Object Shape":"Disc","Date Submitted":"01/13/2010 04:29 UTC","City":"Memphis","Object Flight Path":"Undisclosed","Longitude":"-90.03997","Object Features":"Undisclosed","Latitude":"35.156594","Case Number":"21476","Log Number":"US-01132010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=35.156594,+-90.03997(21476)&iwloc=A&hl=en\"> mufon case (21476) map </A>","Summary":"Confirmation of 'mothership sighting' reported on February 14th, 1976","Date of the Event":"02/14/1976 04:45 UTC","Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","Region":"Tennessee"}