{"trends":["There have been no other sightings in Rutland","This sighting has never been favorited."],"Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=39.045355,+-82.130423(21479)&iwloc=A&hl=en\"> mufon case (21479) map </A>","Tags":"City","Longitude":"-82.130423","Summary":"disc slowly traveling following main street through rutland, oh","Source":"MUFON","Region":"Ohio","Log Number":"US-01132010-0012","Viewing Distance":"Unknown","divs":["Sighting Details1. at my house in my driveway starting my car to let it warm up. 2. was looking up admiring the stars and sky as i always do. 3. a white sphere dropping in altitude quickly and in my direction. 4. white sphere traveled from high altitude down to an extremely low altitude very quickly from west to east in my direction...when it reached a very low altitude it curved its flightpath as if knowing i was watching it and VERY slowly flew in a northerly direction as if following the street in front of my house so i could watch it....at this time the object was obviously a disc shape of some sort with 2 plasma-ish looking circles radiating an orangish light at the front bottom of the craft. also what looked like an electric type shield was radiating from the leading edge of the craft changing in colors from orangish to bright white...as if this ship was decloaking or something. 5. i was VERY ecstatic to see this and kept wondering how to convey this sighting in a manner for everyone to understand. as we all deserve the truth. 6. lost sight of the object when it went behind the hills and treetops. although had perfect visibilty for the duration of the sighting."],"Object Features":"Undisclosed","Date of the Event":"01/13/2010 07:35 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Latitude":"39.045355","Date Submitted":"01/13/2010 08:33 UTC","Country":"United States","City":"Rutland","Case Number":"21479","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/21479.html.txt","/var/www/straped/mufon/org/21479.html"]}