{"Weather Factors":"Unknown","Latitude":"38.370842","Region":"Kansas","Log Number":"US-01132010-0014","map":"<A HREF = \"http://maps.google.com/maps?q=38.370842,+-97.664209(21481)&iwloc=A&hl=en\"> mufon case (21481) map </A>","Source":"MUFON","Date Submitted":"01/13/2010 09:50 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","Longitude":"-97.664209","files":["/var/www/straped/mufon/html2text/21481.html.txt","/var/www/straped/mufon/org/21481.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in McPherson","This sighting has never been favorited."],"Case Number":"21481","Date of the Event":"12/15/2009 12:00 UTC","Disposition":"Unknown","Tags":"City","City":"McPherson","Object Shape":"Triangle, Other","divs":["Sighting Detailsi live 8 miles outside the closest town, and it's dark and Quiet out here. i also smoke outside the house when i smoke.this night, i walked out front about 10:00-11:00 pm to smoke.and as usual, i was looking at the stars and sky, whe i noticed 6-lights in a formation moving across the sky from east to west.the thing that caught my attention was that there were no flashing lights or sound. all aircraft have flashing lifhts and sound from the engine. but, this had none.the formation remained the same as it moved across the sky.the light's were bright but didnt seem to be emitting any beam, they just seemed to be lights like a star, with no direction.i did not see any craft because of the darkness, but the lights were very bright. iv'e seen alot of comercial aircraft go across the sky , and knowing how high and how fast the fly, i would judge the speed of this at 3-4 times the speed of a comercial craft ,if it was flying at the same height as one 300-350 mph at 30,000-35,000 ft. but as i stated,,it made NO sound which i cvan here jet wash from jets a great distance away. if this was flying at a height that was too high to hear it then the speed would be considerably greater than that of anything i have ever heard of flying today..i have watched satilites fry across the sky just after sunset when the sun still shines on them and they look almost like a star moving very fast across the sky. and would estimate the speed of this to be close to the speed of a satilite. it resembled to triangles with 1 point facing west and 1 point facing east. t i dont have a lot of computer exprience, so i will show you best that i can..as i said i saw 6 lights so you will have to imagine the shape of this without the lines just lights at the points < > at first i thought it might be 6 military jets flying in formation and the sound would follow shortly behind as mant times the craft outflys the sound, but no sound ever came and the speed was very fast,copared to a commecial airliner. as i said, they had no flashing lights as all aircraft does and if they were far enough away to not hear, then the speed would have been rediculus fast."],"Summary":"object moving across sky from east to west with no sound or flashing lights like seen on aircraft."}