{"trends":["There have been 6 other sightings in Blairsville","There were no other sightings in Blairsville on or around January 13th 2010"],"Tags":"City","Weather Factors":"None","Date Submitted":"01/14/2010 09:25 UTC","files":["/var/www/straped/mufon/html2text/21486.html.txt","/var/www/straped/mufon/org/21486.html"],"Object Shape":"Star-like, Unknown","Latitude":"34.877269","Log Number":"US-01142010-0003","divs":["Sighting DetailsAfter dinner my husband noticed a light moving to the north along the eastern horizon, then stop dead in its tracks. He called me over, and we watched from the kitchen window. At first I thought it was a star or planet. It was brighter than all the other stars in the sky, and seemed to be twinkling. But then it started to move. At first it was in one spot, then seemed to rock back and forth. I told him to go get his telescope, and he set up on the front porch. Meanwhile I kept an eye on the object. It would move slightly, then back. Once he was set up, I went out front. He couldn't get the object in focus, but looking through the telescope you could see its lights were changing colors, like a rainbow disco light. it was moving slowly. you could tell it was moving because it was behind some tree limbs in the distance, and we used that as a point of reference. I was thinking, \"Holy crap, what the hell IS that?\" i thought maybe it was a helicopter, but it was moving very strangely. i got my telephoto camera out, but that didn't do any good either. it was so cold out we decided to go in and watch through our bathroom window. it was then that the object seemed to be moving back and forth, and upwards at the same time. then it would go back down, side to side, etc. it was moving unlike anything i had seen in the sky before. there were also three smaller lights below it that seemed to be moving in unison with it, but that part may have been my eyes playing tricks on me. we were starting to get dizzy from watching it so intently, so we curled up in bed with a movie. after about a half an hour he went back to the window to go check on it and it was gone. I felt like we should start preparing for our abduction. Please contact through email only"],"Source":"MUFON","Summary":"Pulsating and hovering light moving erratically","Longitude":"-83.950211","Case Number":"21486","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.877269,+-83.950211(21486)&iwloc=A&hl=en\"> mufon case (21486) map </A>","Disposition":"Insufficient Data","Region":"Georgia","Date of the Event":"01/13/2010 08:00 UTC","Country":"United States","Object Flight Path":"Hovering then path","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","City":"Blairsville"}