{"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","files":["/var/www/straped/mufon/html2text/21482.html.txt","/var/www/straped/mufon/org/21482.html"],"Case Number":"21482","City":"Latrobe","trends":["There have been 4 other sightings in Latrobe","There were no other sightings in Latrobe on or around December 10th 2009"],"Summary":"Numerous UFO's spoted, most traveling in same direction, spotted 5 traveling in sync","divs":["Sighting DetailsI live in a rural part of town & my house is kind of in the middle of no where. In the past, I have seen silver lights that blink another red light, that look very similar to the traditional airplane. But sometimes I think that they are going way to slow to be a plane because they seem to be not moving at all. One time I even witnessed a solid ball of red light traveling low to the ground at a high speed. These experiences all take place from me looking out of my huge half circle window on top of my other 4 regular square windows in my room, so i really have a good look at the sky. It is very dark at night & i can see plenty of stars. My best friend & I were studying for our final examinations for college & in the past few years, I have enlightened him to the idea of UFO's being a part of reality. I have watched every Discovery channel show on UFO's & spend many hours on the internet researching UFO's. Between 6:50 & 7:30, my mother, sister, my good friend & I , all witnessed something truly once in a lifetime. I would sacrifice my left arm to go back in time & record the event with the most expensive HD camera money can buy. As my good friend & I walk back into my room after eating dinner, my friend says, \"There are 2 of the blinkey things again.\" (He has seen them before at my house every now & then). As we watch them move from left to right, we see another coming from the same direction. It is easy to tell that they are moving because we can use the stars as points of reference. Then we notice a couple more moving in the same direction, and all of the sudden we just keep seeing more & more coming. There were as many as 10 visible at once but they mostly came in groups of 3-5, 1 right after the other. I got my mom & sister so they could see why my friend & I were screaming \"WTF!\" at the top of our lungs. We witnessed 5 of them moving in 100% unison at 1 point were they were not blinking red, but looked like silver balls of light. They looked to be very far away & when I looked at them through the binoculars, it looked as if the red blink was traveling across the edge of the object & changing color as it dispersed around the craft. The red blink looked as if it would go through the entire color spectrum as it made its was to the but end of the craft, then it would blink again & again. We all stayed glued to the window as they just kept coming from right to left. We saw at least 50-60 within the time frame of watching them. In the middle of the time frame, I grabbed my deer spotlight that is VERY strong & went outside in the freezing cold to watch them. They all went at the same speed & went from left to right until they were too faint to see. Once outside with my friend, I randomly pointed at 1 of them to the far right, that was moving to the right. My friend then says, \"I think that 1 turned around...\". I kept the light pointed in it's direction & it indeed look as if it was getting closer. ***It continued to come towards us & I kept the light on it, it was still high up but it was Much lower than any of them. There was a 2 second time frame where I had a perfect view of the bottom of it as I was directly underneath it...this is when the both of us said \"It's a triangle!!!\" at the same time. It flew directly over us and we watched it until it was out of sight. This triangle shape was only visible with the help of the spotlight, BUT it was not close enough to actually hit it with the light but it illuminated the area underneath it & for an instant you could see a dark equilateral triangle with 3 white round lights equally spaced apart on the underside. It was a VERY distinct sight when it was right over top of us & it did not make a single sound, nor did we hear any other sounds coming from aircrafts. Latrobe Airport is about 7 minutes from my house & I know what a plane sounds like coming in & going out of the airport. The airport is very small and not that active to where I could think that maybe I was just looking at planes. THERE WERE JUST TOO MANY IN SUCH A SMALL TIME FRAME. I know what planes look like in the sky but I will say that these all looked very similar to planes from afar but they definitely were not. There were too many of them flying too close to each other to be planes. I have lived here all my life. Also, my mother was very scared. After the very low ufo was out of site, we went back inside because it was very cold, but we went straight back to the window. I then made a phone call to my friend who lives in Greensburg, (very close to Latrobe) who dose not believe in UFO's. He answered & I told him to look out his window & to look for blinky lights in the sky. The moment he got to his window he said \"Yeah I see 2.\" His next remark was \"They are flying close to each other.\" This person still dose not believe in UFO's & did not believe much of my story which I told him the next day in school, but I believe he was seeing some of the ones that have already surpassed my point of view. I did this while still watching them from my window in my room. Not to make my story sound any more unbelievable, but the next night, at the same time, it all started again. They came from left to right & once again I watched them the entire time & saw 50-60 individuals total AGAIN! This 2nd event was only witnessed by my sister & I this time. I also called a neighbor who lives up the road from me on a big hill & he instantly noticed them too. Final exams were next week and I had so much studying to do, but I just could not pull myself from the window because I kept on spotting them. Each time 1 would go out of sight, I would notice 2 more to the far left & some of them looked as if they were stationary. I emailed Stan Gordon the night of the 1st event but he never responded. I have been thinking about the event a lot because someone else must have witnessed this occurring & it bothers me that this was not on national news. I am 19 years old & I am currently a sophomore at Saint Vincent College, majoring in Environmental Science."],"Longitude":"-79.371241","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Latitude":"40.327031","Object Flight Path":"Stationary,Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.327031,+-79.371241(21482)&iwloc=A&hl=en\"> mufon case (21482) map </A>","Weather Factors":"Unknown","Date of the Event":"12/10/2009 06:50 UTC","Object Shape":"Flash, Triangle","Log Number":"US-01132010-0015","Date Submitted":"01/13/2010 10:28 UTC","Country":"United States","Source":"MUFON"}