{"files":["/var/www/straped/mufon/html2text/21489.html.txt","/var/www/straped/mufon/org/21489.html"],"Log Number":"US-01142010-0006","City":"Glen Allen","Disposition":"Unknown","Object Features":"Unknown","Longitude":"-77.506374","Sighting Duration":"04:00:00","Object Shape":"Fireball, Sphere, Star-like, Triangle, Other","divs":["Sighting DetailsApproximately 7:00 - It started when my mom was driving me home from the library. While we were on the road I noticed several large planes and a few smaller ones flying eastwards. I know they were planes because i could make out the outline of them and they had flashing red lights on them. My mom dropped me off at home with my brother, then she drove back to work. I noticed that there were still many planes flying overhead, so I decided to go into my front yard to watch. I felt kind of nervous while watching the planes, due to the fact that I've never seen this many in the air in this area, and because they were all flying east. I texted one of my friends about this and they said that around 900 troops were being flown overseas, which relieved me because I thought that maybe we were being invaded by another country. As I continued to watch, I noticed a an aircraft to the southeast that was hovering in the same place, occasionally moving in quick fluid circular motions. It was a bluish white color and looked like a pulsating fireball. I watched it for a few minutes, then called my mom over the phone to tell her about the object. After I put my cell phone away, I called my brother out to come look at it. He was fairly suprised but, because of the cold, he went back inside. Afterwards, I noticed that these three orange orbs, that i previously thought were street lamps (they were stationary and fairly close to the ground), to the north of the blue object started moving slowly towards eachother. AFter they came close together, they quickened their speed and circled around eachother for about a second before they flew apart and formed a large triangle, which appeared to even have an outline. I stared at the object for around twwenty seconds before I ran back inside the house to find a video camera, and tell get my brother to come outside to watch with me. When we got back outside the triangle with the orange orb points was gone, but there was another solitary orb higher up in the sky. While I tried to figure out how to get the camera to work, we noticed another blue fireball a bit farther to the west from the first one, and at a slightly higher altitude. I gave up trying to work the camera, and looked up into the sky to try to spot the triangle again when we both noticed that there were actually several large triangles high up in the sky. The lights making the points of these triangles looked exactly like really bright stars, and there appereared to be much smaller and dimmer lights flying back and forth between the points. Some of the triangles suddenly turned and then stopped to point in another direction. Both me and my brother were getting scared so we went back inside. After a few minutes, I came back out by myself and looked up again and saw another star-like object with several other ones around it, and from the outer ones to the center one moved those very dim lights i saw moving in the triangles. These objects, like the others, seemed to be connected in a way to form a much larger object, but this one repeatedly changed it's shape by moving the outer lights around the center one. I stared at it until i started getting scared from all the triangles in the sky. I don't really remember much after I went back outside except for when I looked out the windows at around 11:00 and noticed almost all of the objects have gone, which made me feel safe enough to go to sleep. The only object remaining was one of the orange orb."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.665978,+-77.506374(21489)&iwloc=A&hl=en\"> mufon case (21489) map </A>","Region":"Virginia","trends":["There have been 4 other sightings in Glen Allen","There were no other sightings in Glen Allen on or around January 13th 2010"],"Summary":"Several unidentified flying objects seen above Glen Allen.","Latitude":"37.665978","Tags":"City","Date Submitted":"01/14/2010 11:58 UTC","Weather Factors":"None","Date of the Event":"01/13/2010 07:00 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Case Number":"21489","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Country":"United States","Source":"MUFON"}