{"Longitude":"-117.249397","Object Features":"Undisclosed","Case Number":"21490","Object Flight Path":"Undisclosed","Date Submitted":"01/14/2010 12:37 UTC","City":"Fallbrook","trends":["There have been 3 other sightings in Fallbrook","There were no other sightings in Fallbrook on or around January 8th 2009"],"files":["/var/www/straped/mufon/html2text/21490.html.txt","/var/www/straped/mufon/org/21490.html"],"Object Shape":"Other","Viewing Distance":"Unknown","Tags":"City","Summary":"Long dark streak as far as the eye could see, Cut through cloud. Airplane flying through it","Weather Factors":"Unknown","divs":["Sighting DetailsI was working on my Grandparents avacado grove in Rural De Luz, California near camp Pendleton. It was About 11:45AM and my grandfather and I decided to eat lunch. So we were out on his porch facing an easterly direction, enjoying the weather when we both noticed a plane flying through a long dark streak that was almost a puplish color and was straight as an arrow going for miles. There were few clouds in the sky and and you could see this streak against the blue sky but it was Cutting through one cloud like a knife. We noticed the airplane, which i believe was a comercial jet, flying through it so accurately that the aircraft's contrail was actually covering the streak up as it flew through it. the plane was flying through the streak for miles before it made an abrupt turn as if the pilot realized it was flying through something and was trying to get out of it and the plane disappeared behind a mountain. However i have seen many commercial aircraft flying over my house and my grandparents house and rarely do I see them make abrupt turns like that. I found it very odd. after the contrail had covered most of the streak there was little left to see and we decided to take a ride into neighboring fallbrook. I later returned home and explained what I saw to my family and they all agreed it was very strange and had no explanation for it either. After witnessing it i felt I saw something very unusual and maybe it was something i wasn't supposed to see. I was purplexed as was my grandfather. After recalling what i saw I have a few theories what it MAY HAVE been but I am very unsure as to what it actually was. my first thought was it could have been a Worm hole but why would it be cutting through a cloud? Another theorie was that the streak could have been left by a UFO that may have taken off very quickly as i have heard of UFOs punching holes through clouds but i have never heard of one leaving a dark streak that remained for a number of minutes. My third theory is that it was some sort of military experiment as my grandfathers house is just outside of Camp Pendleton and there are constantly a number of military aircraft flying over head but if this were the case, I could not even begin to explain what they are testing. It was by far the strangest thing i have ever seen and i can't explain what it could have been. Unfortunately we got no photos of it as we were mesmerized by it and the camera on my phone is horrible and that is all i had."],"Log Number":"US-01142010-0007","map":"<A HREF = \"http://maps.google.com/maps?q=33.3821,+-117.249397(21490)&iwloc=A&hl=en\"> mufon case (21490) map </A>","Disposition":"Insufficient Data","Latitude":"33.3821","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Region":"California","Date of the Event":"01/08/2009 11:45 UTC"}