{"Source":"MUFON","Latitude":"36.116936","Object Shape":"Circle, Flash, Star-like","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.116936,+-115.165776(21497)&iwloc=A&hl=en\"> mufon case (21497) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/21497.html.txt","/var/www/straped/mufon/more/21497_submitter_file1__ericasss037.jpg","/var/www/straped/mufon/more/21497_submitter_file2__ericasss038.jpg","/var/www/straped/mufon/org/21497.html"],"Viewing Distance":"101-500 Feet","City":"Las Vegas","Case Number":"21497","Date of the Event":"01/15/2010 08:53 UTC","Longitude":"-115.165776","divs":["Sighting DetailsI went next door to the neighbors house, and we were outside talking about government conspiracy theories, and the female neighbor stopped talking and told me and her other house hold members to look up at the sky. She pointed up at a star-like circle shaped object that was blinking bright white and would fade to where it was not as bright. It was the brightest thing in the sky. My first instinct was that it was a plane. But as we kept watching it, it would only move up a short distance at a time. It has been up in the sky for about an hour now, moving into a diagnal direction. We first noticed it around 8:53 PM. We were debating on calling the cops, but we never did. I have two photos of the object. I came back outside at approximatly 9:40 and the object was still in plane site, but moved a ways from where we had saw it to begin with. I emmediatly called the neighbors back outside and we continued to watch it for about 10-15 minutes. We noticed that the object would flash white, blue, and red colors. I continue to go outside and it is still sitting in the same place as it was the previous time of my neighbors and I witnessing the object. When we first saw the object it would move slowly diagnally, but now it sits in the same place in the sky. It is no longer bright, but now is a red dim color, and looks alot bigger then when we first seen the UFO. In the photos before uploading them onto my computer the object looks like a small white dot. After uploading them i noticed that they are not circular. We have witnessed UFO's in the night sky several times from the neighbors drive way. I am hoping we find answers."],"Country":"United States","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Log Number":"US-01152010-0001","Tags":"City","Summary":"My neighbors and I saw a UFO in the las vegas night sky","Date Submitted":"01/15/2010 01:42 UTC","Region":"Nevada","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around January 15th 2010","This sighting has never been favorited.",""]}