{"divs":["Sighting Details5:40 EST Friday, Dec. 18, 2009 Dark heavy cloud cover. Rain and sleet later in the day. I saw a bright (more than one light) just above the tree tops. I felt a little fright. I thought at first that it was a small plane going to crash, but almost right away I could tell how slow it was going and that its movement was level with the ground. I stopped my van and watched it very slowly move just over the houses. I could not hear a sound. Then it stopped dead still. It looked funny, not like a plane... it must be a helicopter.. it was very still... just hovering over a house. A white light shined down like it was looking for something. I thought if I roll down my window I could tell if it was a helicopter. I knew even before the window was all the way down that it wasn't a helicopter, it had no blades... well , no tail at all. It looked flat on both sides and round in the middle when it was comming toward me, but from what I think was the side (it seemed to move in any direction) it looked like a rounded off triangle, fat near the middle and close to the frount. As I rolled down my window it moved from a stand still directly around from me, it didn't turn, it just hovered straight across moving close to me. I didn't hear a thing as it moved over me a little and very close. I could see under it, it had two large yellow strips on teh underside. It stopped and started to rotate as if to turn what I thoguht as the front toward me. It made a swishing hydraulic sound as it did staying still except for turning. As it turned, it tillted up slightly. It may have been rotating to move... It moved what I thought was sidewaysstraight ahead very very slowly. It was a solid craft, no wings or propellers. Two large red lights and a string of brilliantlu bright white small lights (around the sides). I'm not sure if the small lights moved or its rotating made it look like they where flashing around the craft. I watched it and it stopped over the retirement village and hovered. I couldn't hear the swishing noice as it moved away. My van was still running the whole few minutes. The area was on one of the GSP airports flight paths, GSP is only a few miles from teh retirement village. It was going in the direction of the airport but very low and slow. I was so close I could see it looked metalic. It has indentations or seams on teh bottom, maybe for landig gear? or how it was put together... I don't know what it was but I see 747s, prop planes, every kind, landing at GSp 3 or 4 some hours; never saw anything like this! I've seen the small planes turn into the flight path and look like big white lightsmany times, but this thing stopped then came over to me and stopped again, hovered , rotated and made no sound until it rotated. Then I'm sure no one in teh houses below it could hear it, even that swishing sound was very low. A plane or helicopter that was hovering would have blown out every window in these houses it came directly over 3 or 4 houses, no vibrations, no air movement."],"Summary":"UFO slowly moving and hovering close to the ground.","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date of the Event":"12/18/2009 05:40 UTC","trends":["There have been 4 other sightings in Greer","There were no other sightings in Greer on or around December 18th 2009","This sighting has never been favorited.",""],"Case Number":"21493","City":"Greer","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/21493.html.txt","/var/www/straped/mufon/more/21493_submitter_file1__UFOSketch.jpg","/var/www/straped/mufon/org/21493.html"],"Disposition":"Unknown","Longitude":"-82.224877","Source":"MUFON","Log Number":"US-01142010-0010","Object Shape":"Teardrop, Triangle","Viewing Distance":"21-100 Feet","Latitude":"34.947688","Region":"South Carolina","Date Submitted":"01/14/2010 03:48 UTC","Object Features":"Other","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.947688,+-82.224877(21493)&iwloc=A&hl=en\"> mufon case (21493) map </A>","Weather Factors":"None"}