{"Log Number":"US-01152010-0007","Object Flight Path":"Undisclosed","Date Submitted":"01/15/2010 11:48 UTC","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around February 28th 2005"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Other","Region":"Texas","City":"San Antonio","Latitude":"29.431482","files":["/var/www/straped/mufon/html2text/21503.html.txt","/var/www/straped/mufon/org/21503.html"],"Case Number":"21503","Summary":"White fixed wing plane with very thin fuselage and no markings","Longitude":"-98.487998","map":"<A HREF = \"http://maps.google.com/maps?q=29.431482,+-98.487998(21503)&iwloc=A&hl=en\"> mufon case (21503) map </A>","Source":"MUFON","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","divs":["sighting detailswe met for dinner at a local restaurant. after dinner my husband took my mother home and in a different car to go to the grocery store about a mile from our home. as i was pulling up to the grocery i saw something that i thought was a helicopter because it was hovering over the ditch in the back of the store. i thought it might be a police helicopter but then it did a 90 degree turn and started moving slowly above us. i am not good with distance so i asked my daughter if she thought it was a football field up in the air...she said \"no\" it looked like it was 1\\2 football field up in the air so that would be about 50 yards then. it was the size of a normal fixed wing passenger jet but this had an extremely thin fuselage and there were no markings and it just glided overhead with no sound. i don't know how it could glide because it was so big and then it took off and started to fly through the neighborhood and then i started to drive in the direction it was going. as i spotted this thing though i called my husband and he said \"do you see what i see?\" i said how could i ... i was at heb and he was on our block which is about a mile away. he was seeing the exact same thing over our block. anyway, i followed the one that i saw for about twenty minutes and then went home. as i was going home i saw four of them just hovering in the neighborhood in a stair stepped pattern. i realize that since i live in a military town that it was probably some sort of military exercise. we have had friends mention that they have seen similar aircraft at various times and have been just as freaked out as we were. the strange thing though is i called the police, the airport, local radio and television stations and none of them were interested. four of us saw this thing so i know it isn't something i just dreamed up... not to mention other friends have seen it too in other locations. i cannot find anything that looks like it on the internet. i had my phone with me but didn't even think to take a picture of it because i was so blown away. i now keep a camera with me in case i ever seen anything remotely like it or even remotely strange again."],"Date of the Event":"02/28/2005 12:00 UTC"}