{"Date of the Event":"01/13/2010 05:40 UTC","Object Flight Path":"Path with directional change","Date Submitted":"01/15/2010 01:51 UTC","trends":["There have been 55 other sightings in Gulf Breeze","There were no other sightings in Gulf Breeze on or around January 13th 2010"],"Latitude":"30.366944","Region":"Florida","City":"Gulf Breeze","Summary":"Fresh Gulf Breeze FL sighting over Escambia Bay","Longitude":"-87.162387","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/21505.html.txt","/var/www/straped/mufon/org/21505.html"],"Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Log Number":"US-01152010-0009","Case Number":"21505","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=30.366944,+-87.162387(21505)&iwloc=A&hl=en\"> mufon case (21505) map </A>","Object Features":"Unknown","Country":"United States","divs":["sighting detailsenergy \"orb\" sphere sighting :: gulf breeze fl ! hi i'm a homeowner \\ observer from .... yep, gulf breeze fl .. i wish to remain anonymous for obvious reasons. i have a report on a recent sighting that should match up with other reports in the area. i'm confident at least 50-100 people would have seen the same thing, to include my neighbor as a witness. .. taking out the trash at approx 5:40pm jan 13, 2010.. looking north from \"midway\" towards escambia bay, i saw a bright white\\orange-tinted ( about -6 magnitude brightness ) spherical light-form traveling east from garson point bridge towards eglin afb's west boundary at a rate of approx 500knts. as it approached the middle of the bay, about 3-4 secs since i noticed the object, it made a downward 180 degree turn at the same rate of speed. i dropped the garbage bag in the driveway, and knew that what i was seeing was not anything in our publicly known aviation inventory. my view was obscured from about 15 degrees from the horizon to the top of the treeline to my north. the object would dive below and above the trees moving in a very similar pattern as a dragonfly. after approx. 2 minutes of viewing i was able to signal my neighbor to be a witness.. after about a minute or two the object shot skyward from it's last position below the treeline as if it were staying in a particular piece of airspace in the middle of the bay, approx 1\\2 mile wide and below 4000ft. i should also mention there was a thin cloud layer around 5000ft which helped me judge the distance and scale of the light sphere. at times the object would traverse and incredible speeds, well in excess of mach2-3 without breaking the sound barrier and without making any audible sound from approx 1mi away. traffic from hwy98 was audible as well as several single engine recreational aircraft off in the distance, west and south of the activity, approx 8-15 miles. the last maneuver the object made was from west to east it climbed to approx 4000ft, turned north, zig-zagged in an s pattern and vanished after the 3rd zag, not to be seen again. shortly after a single rotor helicopter came on site ( pursuit ) from west to east along the original path of the sphere, and and turned north toward whiting field nas. no other aircraft approched the area except for a commercial flight leaving pns traveling north-east, which tells me the airspace was not locked down. i was under the impression that this object wanted to show-off and be seen. also another observation was 3 satellites at 90 degrees elevation, magnitude about +4, intersecting directly above shortly after the sighting. i'm still in awe over this observation. i'm very familiar with military aviation and aeronautical engineering. this sphere was defying our physics somehow by moving through the atmosphere at those speeds without disturbing the air. most impressive."],"Sighting Duration":"Undisclosed"}