{"Log Number":"US-01152010-0006","Country":"United States","Weather Factors":"Does Not Apply","Sighting Duration":"00:30:00","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around February 7th 2004"],"Region":"Georgia","Date of the Event":"02/07/2004 08:16 UTC","divs":["Sighting DetailsI was working as a security officer on a chicken processing plant. I believe it was around 20:00 hours,I was thanking about u.f.o.s, I has a very strong gut feeling to contact my mother, who is a resident at a hightrise building on Alburn Ave located at Martin Luther King historical district. when my mother answered the phone, she sounded very excited,she said boy you need to come over here and see this. She was looking out of the window of her 14 floor apartment, she notice a star like object moving in and out of the clouds. I asked my mother when did take place, she inform me that it was happening as we speak. I asked my mother what is the object doing now, she said that there is a human looking figure sitting in the object looking down at her. My mother said that every time she would look up at the figure, it would bend forward to look at her. My mother said that another similar object came out of the clouds and hovered next to the other. The two object hovered there for a while, then move off back into the clouds. I remember my mother said that this happen two night. My personal feeling is, that what my mother saw that night was real."],"Longitude":"-84.381052","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Date Submitted":"01/15/2010 11:34 UTC","Object Features":"Unknown","Object Shape":"Star-like","Summary":"The object seem by my mother was star like.","Latitude":"33.752185","map":"<A HREF = \"http://maps.google.com/maps?q=33.752185,+-84.381052(21502)&iwloc=A&hl=en\"> mufon case (21502) map </A>","City":"Atlanta","Disposition":"Insufficient Data","Object Flight Path":"Unknown","Case Number":"21502","files":["/var/www/straped/mufon/html2text/21502.html.txt","/var/www/straped/mufon/org/21502.html"]}