{"Summary":"walnut shape disc, color fuzzy white like clouds like it was a camo, very fast,","Case Number":"21508","Object Shape":"Disc","divs":["Sighting DetailsI was driving home in the evening after work. The sun was setting behind me as I was driving east on Oakley rd., toward Empire ave. As I was driving I had the radio off and I was talking to myself like usual. I suddenly knotice a white scuffle in the sky to the left of my view through the front window. It was a calm day no wind. In my mind I automaticly thought it was a plastic bag (white grocery store plastic bag) flying through the air. As I aproached the stop sign at live oak. My eyes caught view of it again as I relised it was not as close as I thought it was. Quickly my mind did a flip and I stopped at the stop sign and really looked. It was a cloud in the blue sky all by itself and it was making a swirling motion. It was as though something was comming into this demention from another. It was static in motion, it was kindof bouncing around like it was struggling. After about maybe ten seconds of watching it do this a shape appeared out of the swirling clouds. It was the same color of the white swirling cloud. It was large and had pointed ends to both sides. Walnut shape and as large as three air force cargo plane, like the kind I usually see flying in the area from Travis air force base. To me this was like a flying city. It came down from the atmosphere. The swirling cloud disapated. The disc flew at speeds I've never seen before before. It travel a distance of over 50 miles in less than a minute. I was stopped in my car at the stop sign but I started to travel forward because someone drove up behind me. I drove slowly toward empire road and watch it. Above me was blue sky but where the disc headed was cloudy off in the horizon. The clouds where getting pinkish but where still white from the setting sun. As the craft headed toward the clouds I came to the stop light at empire road and I just stared at it. The disc came to a full stop right before it came to the cloud and then entered it slowly. I never saw it again but I wish I had a camera phone then. I was very amazed at how it cloaked itself with its environment. I later told my family they laughed but knew I was serious. But its not the only time I've seen strange things. My feelings when I saw it was I knew what it was and I then relised alot of the stuff I've been hearing is true. After I saw It it didn't really change me it was more like a matter of fact and I went on with my life as normal. It is what it is a whole lot of stuff I don't know but would be fascinating to know. I would send a sketch but don't have computer capability. The disc flew toward stockton in my opinion, stange because they always seem to fly that way."],"City":"Brentwood","Log Number":"US-01152010-0012","Region":"California","Latitude":"37.940098","Country":"United States","Date of the Event":"03/18/2004 05:45 UTC","Tags":"City","trends":["There have been 5 other sightings in Brentwood","There were no other sightings in Brentwood on or around March 18th 2004"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.940098,+-121.690466(21508)&iwloc=A&hl=en\"> mufon case (21508) map </A>","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date Submitted":"01/15/2010 04:29 UTC","Longitude":"-121.690466","files":["/var/www/straped/mufon/html2text/21508.html.txt","/var/www/straped/mufon/org/21508.html"],"Disposition":"Unknown","Object Features":"None","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed"}