{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.515096,+-76.15588(21504)&iwloc=A&hl=en\"> mufon case (21504) map </A>","Object Shape":"Other, Unknown","trends":["There have been 7 other sightings in Aberdeen","There were no other sightings in Aberdeen on or around January 11th 2010","This sighting has never been favorited.",""],"Date of the Event":"01/11/2010 03:33 UTC","Tags":"City","Source":"MUFON","City":"Aberdeen","Sighting Duration":"Undisclosed","Longitude":"-76.15588","Latitude":"39.515096","Object Features":"Undisclosed","Summary":"Possible Abduction ?","Object Flight Path":"Undisclosed","Date Submitted":"01/15/2010 11:53 UTC","files":["/var/www/straped/mufon/html2text/21504.html.txt","/var/www/straped/mufon/more/21504_submitter_file1__IMG01881.jpg","/var/www/straped/mufon/org/21504.html"],"Country":"United States","Region":"Maryland","Viewing Distance":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsFor many years I have experienced many strange and unusual events. As a small child I can recall being visited by a tall gray that seemed to be feminine in stature.I was never sure if it was real or just a dream.But through out the years I have had many UFO sightings with several other witnesses to back up my claims. I have always thought that something has been going on in my life to which I cannot explain. For the past several months I have had a very strange feeling that something significant is going to happen. Lately I have been awakened by dreams of flying and every time I look at the alarm clock it has been a series of numbers..EXAMPLE 1:11AM 3:33AM 4:44AM.I am not by any means claiming to have been abducted I am just trying to put my stories out there for someone who can contact me and assure me that there is some truth behind the abduction theory.But this most recent event has caused some distress. On January 11,2010 at exactly 3:33am I awoke from yet another dream of flying.I then got up to use the bathroom when I passed by the mirror and noticed 3 fairly large trails of blood that were still moist but dried to my right arm. As I wiped the blood off I noticed 3 perfect punctures marks in the ink of my one tattoo.They were perfectly spaced apart and DEFINITELY puncture marks.As I ran my finger across them I could feel the divots and now I can feel something under the skin. There has not been any inflammatory response and I have noticed 2 larger punctures above the original 3. I am hoping that someone else can help me understand what is going on. I apologize for putting my suspected abduction case on this site but I have documented some of my ufo stories on here and did not know where else to go for answers. Please if anyone has info please contact me at alienx38@comcast.net.. Thank you.."],"Case Number":"21504","Log Number":"US-01152010-0008"}