{"map":"<A HREF = \"http://maps.google.com/maps?q=38.772399,+-93.73055(21513)&iwloc=A&hl=en\"> mufon case (21513) map </A>","trends":["There have been 7 other sightings in Warrensburg","There was one other sighting in Warrensburg on or around November 30th 1964"],"divs":["Sighting Detailswarrensburg mo. middle of the afternoon. maybe 50 people in and out of cars staring up at a circular disk. it was silver and had circulating light around perimeter. we noted several cars pulled over to the edge of semi-rural road. almost no one got out of the car. it was above all of our heads, motionless, making NO noise. the lights were blinking continuously. it was very unnerving. we didn't know, at the time, what we were looking at. we watched for 10-15 minutes. nothing more happened while we were watching. we eventually, continued on home. we were in the air force. we were married a short time. i was 18, hubby was 20. we did not know what we were looking at. the next day, my husband, who was military police back then, saw a large burned circular mark on one of the runways. they were all told never to speak about it or tell anyone about it. we didn't back then. but as soon as he told me about what had happened at the air force base, we both knew what we had seen. we could never forget it. so far it's been 45 years."],"Disposition":"IFO","Weather Factors":"None","City":"Warrensburg","Latitude":"38.772399","Case Number":"21513","Longitude":"-93.73055","Date of the Event":"11/30/1964 12:00 UTC","Source":"MUFON","Country":"United States","Viewing Distance":"21-100 Feet","Object Shape":"Circle","Tags":"City","Object Features":"Window(s)","Date Submitted":"01/15/2010 08:35 UTC","Summary":"daylight sighting, seen by maybe 50 people, no one knew exactly what they were looking at, at that time.","files":["/var/www/straped/mufon/html2text/21513.html.txt","/var/www/straped/mufon/org/21513.html"],"Sighting Duration":"Undisclosed","Region":"Missouri","Log Number":"US-01152010-0017","Object Flight Path":"Stationary"}