{"Country":"United States","Tags":"City","Object Shape":"Circle, Cylinder, Other","Object Flight Path":"Undisclosed","City":"Undisclosed","Longitude":"-86.894758","Date of the Event":"01/15/2010 12:00 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Log Number":"US-01162010-0001","files":["/var/www/straped/mufon/html2text/21519.html.txt","/var/www/straped/mufon/more/21519_submitter_file1__southpole7.JPG","/var/www/straped/mufon/more/21519_submitter_file2__southpole7a.JPG","/var/www/straped/mufon/more/21519_submitter_file3__southpole4.JPG","/var/www/straped/mufon/org/21519.html"],"Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting DetailsIt avails little if you laugh. The words of Mr. Alex Collier of 20-mile ship at 1.5 mln miles off South Pole were proved by a strange craft recorded on WWT and sky-map.org before January 1st. (together with some smaller objects). After New Year's Day (exact day unknown)were recorded additional several big objects and smaller ones, again on both WWT and sky-map. Google sky does not support the polar regions anyway. below are the coordinates, starting with the first object. I am attaching some more impressive photos. You would do better to download WWT worldwide online telescope and to continue monitoring the South pole region for newly appeared objects. There is nothing good in those ships, if you go thru all the ET stuff on Project Camelot. Most likely they are from either Orion or Draco empires, both reptiles and hostile. The human-looking Pleiadians and Andromedans seem still do not intervene and are somewhere beyond Mars, most probably in Saturn system. For more, check Project Camelot. Coordinates RA, Dec 19 25 12, -89 46 03 - first big object recorded 16 19 35, -88 43 10 - cylindrical object 02 26 39, -89 43 13 - circular 08 50 47, -89 38 09 - curved 14 38 50, -88 40 42 - curved 14 59 06, -88 21 24 - curved 23 13 00, -88 53 11 - curved 19 26 51, -88 42 38 - cylindrical, looking like ship with traces Alex Collier's statements of 3 different objects: 1. Cassini project classified, because of all the mothership activity filmed in Saturn system. 2. a 1.5 mln miles off the South pole a 20 mile craft that is sat in a stationary. NASA and other organizations telescopes have been monitoring it for 8 months, they watch its trajectory to us. It is now stationary and are craft going in and out of this 20-mile structure. 3. very large planetary structure coming in 18 degrees RA of Neptune's orbit. it should be visible sometimes next year."],"Date Submitted":"01/16/2010 02:26 UTC","Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=32.320571,+-86.894758(21519)&iwloc=A&hl=en\"> mufon case (21519) map </A>","Latitude":"32.320571","Case Number":"21519","Sighting Duration":"Undisclosed","trends":[""],"Summary":"Invading fleet detected on WWT off South Pole region.","Weather Factors":"Unknown"}