{"Viewing Distance":"101-500 Feet","Weather Factors":"Does Not Apply","City":"Durham","Country":"United States","Object Shape":"Blimp, Diamond, Star-like","Sighting Duration":"Undisclosed","Summary":"It had 2 lights and looked (dark-black)lights beeing on the outer edges of the ship..","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.000003,+-78.893439(21510)&iwloc=A&hl=en\"> mufon case (21510) map </A>","trends":["There have been 29 other sightings in Durham","There was one other sighting in Durham on or around January 3rd 2010","This sighting has never been favorited.",""],"Log Number":"US-01152010-0014","Longitude":"-78.893439","Source":"MUFON","Case Number":"21510","files":["/var/www/straped/mufon/html2text/21510.html.txt","/var/www/straped/mufon/more/21510_submitter_file1__DigitalMassStorageDevice160.jpg","/var/www/straped/mufon/more/21510_submitter_file2__DigitalMassStorageDevice168.jpg","/var/www/straped/mufon/more/21510_submitter_file3__DigitalMassStorageDevice169.jpg","/var/www/straped/mufon/org/21510.html"],"Date of the Event":"01/03/2010 03:07 UTC","Disposition":"Hoax","divs":["Sighting Details* * But You could tell of the sillouette was oval and UFO shapped like..Blemp like shape. * * * UFO :I video taped and have disappearing on tape.In space... * This is the UFO I photographed..I was out looking for the guy that was drunk and hollering at the UFO? I also photographed another UFO..I have been visited by three of them or more? I haven't been taken but I am glad that I haven't been or just don't have a vivid memory of it.I am glad that I don't also. I have 2 other pictures that show that wormholes are real and have nothing to do with blackholes???Duaaa....It has everything to do with gravitaional pull and forces of gravitation..If there is a beam of power placed at one time and place can open a rift in time and space that can be travelled. And landed safely..It has to do with a beam of power that is so confinned that It can cut a slice out of time and space.When time and space is actually one of the same. And points of tnterest will be the address of the future..To find and use the wormholeswill be a thing of the future generations.I don't have enough time to even phlosify as to how to start. But technology will advance and realize that change will be evident to even experiment on such a level? Only the government will have access to such technology.As to the cost of operation and upkeep..D.w.Howerton Industrial wiring technition.."],"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Latitude":"36.000003","Date Submitted":"01/15/2010 07:30 UTC","Object Features":"Other","Region":"North Carolina"}