{"Log Number":"US-01152010-0016","Weather Factors":"Does Not Apply","Object Shape":"Triangle, Unknown","Date Submitted":"01/15/2010 08:26 UTC","Sighting Duration":"00:05:00","Object Flight Path":"Other","Case Number":"21512","Tags":"City","Region":"Arkansas","Latitude":"34.769536","Disposition":"Insufficient Data","trends":["There have been 5 other sightings in North Little Rock","There were no other sightings in North Little Rock on or around January 15th 2010"],"Country":"United States","Source":"MUFON","City":"North Little Rock","map":"<A HREF = \"http://maps.google.com/maps?q=34.769536,+-92.267094(21512)&iwloc=A&hl=en\"> mufon case (21512) map </A>","Object Features":"Unknown","Summary":"Something following suspected formation of 3 B2 Bombers","Longitude":"-92.267094","divs":["sighting detailsi was filling my car with gas at the shell station located at 3100 jfk boulevard in north little rock. i was standing between the gas pump and my car under the awning covering the pump area. i began hearing a loud, and i do mean loud, constant low bass noise coming from the sky. i stepped in a northerly direction to get out from under the awning, which was blocking my view of the sky and looked up. i continued looking at the sky for a minute or two and did not see anything. then i saw 3 aircraft flying about as high as i think the human eye could detect them. they were triangular in shape and flying in a triangular formation. they were dark green or gray in color. i'll continue with the story in a just a moment. i need to digress briefly. i told my husband about what i had seen when we were both home late afternoon. he went to the computer and showed me various images. the image of the b2 bomber looked similar to the 3 planes in formation. i was curious about what the 3 planes were, but they are not the subject of this report. what was following them is the subject of this report. right behind the 3 planes was something i couldn't exactly determine the color of. it may have had a silver reflection to it, but at the altitude these 3 planes were, it was difficult to get a lot of detail. the weather was partly sunny with some clouds in the sky. what i found very strange about this whatever that was following the squadron was its pattern of flying. it was flying north, just like the 3 planes. however, it was moving back and forth right to left, left to right as it flew north. the movement reminded me of a pendulum on an old-time clock. imagine the lowest point on the clock's pendulum as a dot and then follow that dot as the pendulum moves back and forth. that's about what it looked like. the loud roar continued for several minutes after the 3 planes and the whatever were out of sight. this is not the first ufo i have ever seen. i remember the event very clearly but don't remember the exact date. it was about june 26, 1992, could have been july. i was driving south on college avenue in fayetteville, arkansas. i was stopped at a stoplight just north of downtown fayetteville. i believe i was next to washington regional medical center on the right and across from evelyn hills shopping center on the left. it was pouring rain. visibility was maybe a mile or so. it was dark and cloudy. this would have been about 7:45 in the morning. i was driving to work. there is a row of hills\\mountains visible to the south when you are stopped at this stoplight. i saw something oval-shaped. it would have been gray or silver in color. the most striking thing about this object is that the bottom half of it looked like it was illuminated with a bright white light. remember what the weather is like at the time. this thing was flying se so smoothly, it was like it was on invisible rails in the sky. there were no reports of anything in the news about it. again, years later my husband showed me some ufo films on tv and there was one that was exactly like what i saw."],"files":["/var/www/straped/mufon/html2text/21512.html.txt","/var/www/straped/mufon/org/21512.html"],"Date of the Event":"01/15/2010 11:55 UTC","Viewing Distance":"Unknown"}