{"Tags":"City","City":"Antioch","Object Flight Path":"Undisclosed","Disposition":"Hoax","Region":"California","Case Number":"21515","map":"<A HREF = \"http://maps.google.com/maps?q=38.007121,+-121.797109(21515)&iwloc=A&hl=en\"> mufon case (21515) map </A>","Weather Factors":"Unknown","Longitude":"-121.797109","Date of the Event":"07/14/1991 09:25 UTC","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsAt the time I was about 14 or fifteen years old. It was a summer night and the moon was not full and there were no clouds. It was around 9 o'clock pm. The night was calm like it is in the summer here. I remember I was at home and I needed something in the backyard (can't remember what it was I went back there for though). I was next to the back fence in the backyard and I heard a low hum sound comming from the west and I looked up to see what it was. There were 3 large triangle shaped craft that were flying low in a V formation. They flew very slow at extremely low altitude. They were so close it felt as though I could touch them. They were black and each one had a red glowing light under each craft. That was the only light they each had. That was the only thing that made them visible. As they flew over my first thought was that they were F-117 because I can recall their shape and knew they also had a red light under the hule. Of course as I got older and look back at this I don't think that the US air force would have the guys fly low and let alone have the capability to not be heard. As I saw them fly over I ran to the front yard where I could see them. As they were going over the neighborhood I saw them vanish over the house across the street. Then 3 more flew over in the same V patern. I ran inside and told my parents with extreme enthusiasm \"stealth fights flew over the house\". They all laughed and asked me again what? There size was difficult to determine but I think they were about 200 feet from the ground."],"Summary":"They looked like F-117's but they were silent and much bigger","Log Number":"US-01152010-0019","Viewing Distance":"Unknown","trends":["There have been 13 other sightings in Antioch","There were no other sightings in Antioch on or around July 14th 1991"],"Source":"MUFON","Country":"United States","Latitude":"38.007121","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/21515.html.txt","/var/www/straped/mufon/org/21515.html"],"Date Submitted":"01/15/2010 08:46 UTC"}