{"Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Latitude":"31.969609","Object Flight Path":"Straight-line path","Weather Factors":"None","Date of the Event":"09/30/2009 12:00 UTC","Country":"United States","Log Number":"US-01152010-0021","Case Number":"21517","Sighting Duration":"00:02:00","trends":[],"divs":["Sighting Details------------------------------------------------------ 1. Where were you and what were you doing at the time? ------------------------------------------------------ From my back porch in Kyle, Texas (just south of Austin) in mid-October 2009. It was during the day. The sky was bright blue with a few clouds. I was merely relaxing and looking at the pretty sky. ----------------------------------------- 2. What made you first notice the object? ----------------------------------------- I noticed it because I just happened to be looking in its direction as it glided past. --------------------------------------------------------------- 3. What did you think the object was when you first noticed it? --------------------------------------------------------------- It was an unfamiliar flying craft. By definition, that is \"UFO.\" I did not make assumptions as to its origin or makeup. --------------------------------------------------- 4. Describe the object and its actions and motions. --------------------------------------------------- I saw a flying object in a patch of blue sky unobstructed by clouds. I did not recognize the object, yet there it was--flying. It was close enough for me to tell it was not a helicopter, not an air balloon, not an airplane. I heard no noise coming from it. It was dark metallic and roundish, Saturn-shaped, and not elegant or sleek. It was moving in a straight line, not stopping or slowing. It is hard to judge size or speed because there was nothing sufficiently close to it to judge scale. ------------------------------------------------- 5. Describe your feelings, reactions and actions, during and after sighting the object. ------------------------------------------------- My reaction was \"Oh. I guess I have now seen a UFO.\" I have not told anyone. I know what I saw. ---------------------------------------- 6. How did you lose sight of the object? ---------------------------------------- It moved steadily and then disappeared into thin air. It was not suddenly obscured by a cloud. It *disappeared* before my eyes as I watched it. Into clear blue sky."],"Date Submitted":"01/15/2010 10:24 UTC","City":"Undisclosed","Summary":"Saw flying object disappear in midair","Tags":"City","files":["/var/www/straped/mufon/html2text/21517.html.txt","/var/www/straped/mufon/org/21517.html"],"Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.969609,+-99.899153(21517)&iwloc=A&hl=en\"> mufon case (21517) map </A>","Region":"Texas","Object Shape":"Saturn-like","Longitude":"-99.899153"}