{"Longitude":"-117.864144","Case Number":"21522","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"33.753813","Summary":"Stationary, multicolor lights, approx. 3-500ft, silent, vertical structure","Object Features":"Unknown","Date of the Event":"10/08/2009 06:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.753813,+-117.864144(21522)&iwloc=A&hl=en\"> mufon case (21522) map </A>","City":"Santa Ana","Date Submitted":"01/16/2010 07:43 UTC","trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around October 8th 2009"],"divs":["sighting detailsthe a.m. morning was clear and bright. i was walking in my parking lot and looked up at the sky. saw an unusual, colored object that was alone in the morning sky. the object was about 1.5 miles north-east of john wayne airport, stationary at about 3-500 feet in the air and approx. 1\\4 mile from me. the object was quite near i-55 just east of the macarthur blvd. exit. it was as if it was observing the flight path of incoming planes, was a thought since it was in an excellent position to do this. lights red, blue, white, and green were dotted on the structure that appeared not to be circular but vertical and beam-like\\rod-like. they did not blink. there were perhaps 7-8 from where i saw it. there was no sound. i stood to watch it for about 2 minutes and it hadn't moved or rotated. i tried to make notice if it was a helicopter but it did not at all look like one (no rotors, no tell-tale body shape)or any other aircraft as i inventoried my knowledge of aircraft. with regret, i was not able to watch it further but had to leave my area and i assume it remained. the sighting certainly left me questioning and frustrated that i was not at all able to remain with the sighting due to a pre-scheduled, medical appointment."],"Weather Factors":"None","Source":"MUFON","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/21522.html.txt","/var/www/straped/mufon/org/21522.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary","Country":"United States","Log Number":"US-01162010-0004","Region":"California","Tags":"City"}