{"map":"<A HREF = \"http://maps.google.com/maps?q=30.858244,+-89.135328(21528)&iwloc=A&hl=en\"> mufon case (21528) map </A>","Weather Factors":"None","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/21528.html.txt","/var/www/straped/mufon/org/21528.html"],"Object Shape":"Star-like","Latitude":"30.858244","trends":["There has been one other sighting in Wiggins","There were no other sightings in Wiggins on or around November 1st 2009"],"Object Flight Path":"Straight-line path","Date Submitted":"01/17/2010 02:17 UTC","Log Number":"US-01172010-0004","divs":["sighting detailson this night, i walked into my back yard to watch the sky and meditate. i was taking cleansing breaths and thanking the universe for all things. as i was watching the western sky, i felt the need to say to the space beings, \"i know you are there, and you know that i know.\" at that instant i saw what looked like a satellite moving from the south to the northwest. there was no sound. then, it lit up like a very bright starburst for a moment and disappeared. i continued to look at the sky for it another 10 minutes or so. several airplanes flew over going in different directions, but the other object did not reappear. that's when i felt that i had seen a ufo. this is not the first time i've watched a slowly moving star like object just didppear in the night sky behind my home. but this time i recorded the event in my journal. on 12\\01\\09, i saw another slowly moving, satellite like object moving from north to south. it appeared to be much higher in the sky and became obscured by clouds. on 12\\10\\09 i saw a large, glowing object moving from south to north at treetop level. i was standing in the back yard and it was coming directly toward me. it had multicolored blinking lights, but made no sound. as it it moved over the field behind my house it disappeared among the trees. i continued to look for it another 5 to ten minutes, but it was gone. i also, observed what looked like a fireball falling from northeast to the south on 11\\25\\09, while i was meditating in my back yard. i asked the space brothers to communicate with me and \"wham\", a fireball appeared. these things have all occurred between 6p.m. and 7:p.m cst, while i am outside meditating and communicating with the universe. i have seen many ufos in my life, but i know some people will think i'm crazy."],"City":"Wiggins","Disposition":"Unknown","Tags":"City","Summary":"I saw what looked like a satellite moving NW from the South. It burst into a bright light and disappeared.","Longitude":"-89.135328","Case Number":"21528","Region":"Mississippi","Date of the Event":"11/01/2009 12:00 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile"}