{"files":["/var/www/straped/mufon/html2text/21529.html.txt","/var/www/straped/mufon/org/21529.html"],"trends":["There has been one other sighting in Media","There were no other sightings in Media on or around January 15th 2010"],"Case Number":"21529","Object Features":"None","Weather Factors":"Windy, Light, Unknown","Longitude":"-75.381023","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Region":"Pennsylvania","Viewing Distance":"101-500 Feet","Date Submitted":"01/17/2010 02:32 UTC","Source":"MUFON","Date of the Event":"01/15/2010 12:00 UTC","divs":["Sighting DetailsMy four friends and I go on walks on a farm basically right next to ones house. We walked around the farm, it was beautiful outside. Nothing was out of the ordinary. When covering all the land over on the farm we continued to walk through the woods back to the house, no flash lights. When we were about 200 feet into the woods I noticed a very low flying object. I immidatly thought it was a plane because I saw three lights in the shape of a triangle. But this craft seemed to hover. It moved slowly, and quietly. What was strange about the craft was the sound. It sounded like a clean burning engine \"from out of this world\" like a fan on low. But the feeling it gave off was different. As if standing infront of a loud bass amp on full blast. Pretned that this bass amp was on so loud it made your stomach turn vibrations could be felt in your feet, your ears, your eyes, your chest. But no immidate sound was around. Just as if we were laying on a generator or something. It moved quietly infront of us, but behind trees. In a small clearing in the tree line all of our discriptions matched to perfection. The craft had three somewhat large white lights on the bottom of the craft along with one red, plasma like light in the middle of the craft. and it also looked like something was hanging out of the bottom, like a large tube (large in width, not length) The very front did not have any navigation lights, and there were no green lights. The verry back of the craft had 3 small white lights extremely bright surrounded by blue (this is very hard to discribe) It moved toward a local highway then it slowed down dramatically and turned toward the feilds in which we walked through, it could still be heard in the woods echoing everywhere. This was not our first experience with .. what we like to camm them \"our friends\" but we were in complete shock, as I saw that same looking ship or craft on TV hours before, talking about a triangle shaped craft in Illinois in which 4 or 5 people saw. We lit up a cigg and walked home trying to think of plausable excusses for it. None were found."],"Summary":"Large Triangle object, threelights on bottom one red three on back pushing.","Log Number":"US-01172010-0005","Disposition":"Insufficient Data","Object Shape":"Triangle","Sighting Duration":"00:05:00","Tags":"City","City":"Media","Latitude":"39.919678","map":"<A HREF = \"http://maps.google.com/maps?q=39.919678,+-75.381023(21529)&iwloc=A&hl=en\"> mufon case (21529) map </A>","Country":"United States"}