{"Sighting Duration":"Undisclosed","Case Number":"21531","Date of the Event":"10/21/2009 05:25 UTC","Object Shape":"Star-like","Region":"British Columbia","Viewing Distance":"Unknown","Summary":"Two bright star sized UFO,s. One seemed hunting the other.","trends":["There have been no other sightings in Quesnel","This sighting has never been favorited."],"Object Features":"Unknown","Tags":"City","Latitude":"52.981737","files":["/var/www/straped/mufon/html2text/21531.html.txt","/var/www/straped/mufon/org/21531.html"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"Canada","Disposition":"Unresolved","Longitude":"-122.494906","divs":["Sighting Details On about Oct 21 2009. I was leaving for work at about 5:25 am. It was rather cool,and the sky was very clear. All of the stars lite up the morning sky. As usual I looked for some of the more common star formations. I easily spotted the Big Dipper. The problem was,there were what looked like two other stars right in the middle of what I would call the pot. I couldn't remember there being stars in the middle? Not noticable anyway. If you held your hand out towards the stars. They seemed about 2 inches apart. Then one of the,ok I have to say it! UFO,s moved very fast about another 2 inches from the other,and stopped. The first UFO moved very fast to about where the first had been. The first UFO moved again. This time at an angle away from the first move. The second UFO seemed to being trying to get close to the first. For again very quickly it moved to the location the other had been. Then the first UFO took off very quickly increasing speed until it vanished. The second UFO took off as well following the first. Until it's speed made it vanish as well. Did anyone else see it? I'am 47,no mental problems,and work as a millwright.Let me know. Thanks."],"City":"Quesnel","Date Submitted":"01/17/2010 07:44 UTC","Log Number":"CA-01172010-0007","map":"<A HREF = \"http://maps.google.com/maps?q=52.981737,+-122.494906(21531)&iwloc=A&hl=en\"> mufon case (21531) map </A>","Weather Factors":"None","Source":"MUFON"}