{"Latitude":"28.326447","Longitude":"-80.600771","City":"Cocoa Beach","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=28.326447,+-80.600771(21536)&iwloc=A&hl=en\"> mufon case (21536) map </A>","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-01172010-0012","Tags":"City","Date of the Event":"05/10/1964 12:00 UTC","Object Features":"Undisclosed","Summary":"Large Round Fire Ball","Object Shape":"Fireball","Sighting Duration":"Undisclosed","Disposition":"Hoax","Date Submitted":"01/17/2010 09:47 UTC","Region":"Florida","Case Number":"21536","Country":"United States","trends":["There have been 10 other sightings in Cocoa Beach","There were no other sightings in Cocoa Beach on or around May 10th 1964"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/21536.html.txt","/var/www/straped/mufon/org/21536.html"],"divs":["Sighting DetailsIn May 1964 My father obtained a job working for Bindex Corp. at the Kennedy Space Center. At the time my family and I were living at the Diplomat Appartments, on the Atlantic Ocean Cocoa Beach. That late evening I went down to the beach and had my binoculars with me just looking over the ocean N. E. and S. to my left or North I could see the Cape Canaveral Pad all lite up for another Gemini missile launch for some future date. I focused my attention to the ocean right in front of me and the Sun was just setting behind th Banana River when I saw a helecoptor about a mile or two of shore out in front of me droping a capsul and practicing retreaving the capsul from the water as one of the neighbors told me it was standard practice. As I watched the stars just start to come out that cold blue sky, the missile pads are well let to the North and Patrick AFB to my right Is lit up as well. I continued to watch the the helecoptor with it running lights on shinging down on the capsule crew below it, when above the helecoptor I saw an increadable fast light what I thought was a star at first or meator like brightness heading straight for the helecptor. It was increadably fast and like a blink of an eye it was over the helecoptor an huge I would say at least a 100 ft and all of this is happning withen 30 minutes between sun set and dark. I just watched with other apartment neighbors on the beach we just stood there stairing. Being new in the area I ask the guy next to me, was this some kind of air craft helping the helecoptor he looked and me and said not that he had ever saw. The helecoptor with capsul hanging below it and crew already in the coptor started evesave manuvers away from the bright round object. No one said anything and I thought for sure it was going to crash into the helecoptor because of how close it was and remember I'm watching this through my binoculars. It was fantastic! at least I thought since I was 15 years old. No sooner had the helecoptor started for Cape Canaveral when I looked to my right and saw two jets with full after burners on from Patrick AFB heading for the helecoptor with the bright ball of fire following it. As fast as it took me to turn my attention back to the activity out in front of me, the jets were gaining on the Bright Ball of Fire, and it took off straight up like a flash of lightning and the jets were climbing after it. I was amazed at how fast that fire ball went up and away, it was like the jets were just being toyed with. During the incident some one had gone and called Patrick AFB Military up and as we started to leave the beach and not one person spoke up about what just happened. An MP Vehicles from Patrick AFB pulled up and took statements from everyone who was watching the whole thing. This type of incident happened over the years in Coca Beach many times and just before night launches the ball of fire appeared, all the way up from the Gemini Program to the Saturn one \"B\" projects. It is something many of us will never forget."]}