{"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.758955,+-84.384132(21539)&iwloc=A&hl=en\"> mufon case (21539) map </A>","Case Number":"21539","Object Features":"None","divs":["Sighting Detailsmy two kids and i saw three seperate objects.. the two smaller ufos were shining white spheres.. the third larger object was composed of two spheres in an eight figure, one red the other white. these were not balloons, and if they were they were the size of a small aircraft judging from the altitude, approx. 1000 feet. they were definitely not hot air balloons with gondolas. they moved in a triangle formation to the east, with the sun behind them. they should have been backlit but were shining white and red as though they were internally illuminated. i noted the time, 12:40 pm est.. and duration.. approx 5 mins. the red and white object blinked out of sight after several minutes, so did one of the smaller white objects. the other simply moved out of sight toward the horizon. the sky was clear blue with no clouds or haze, and the objects were easily defineable. a jet flew in the vicinity of the objects as they moved toward the east, the jet was fairly low moving northeasterly and could have been a small commercial jet. it was larger in perspective and may have seen the objects as it was headed in their direction. it did not appear to be chasing them but just going in that direction. what struck me the most was the smaller white objects that seemed to be in fofrmation with the larger one, all moving at the same speed and spaced equally apart."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"01/18/2010 12:40 UTC","Region":"Georgia","City":"Atlanta","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Longitude":"-84.384132","Date Submitted":"01/18/2010 01:22 UTC","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/21539.html.txt","/var/www/straped/mufon/org/21539.html"],"Country":"United States","Source":"MUFON","Latitude":"33.758955","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around January 18th 2010"],"Log Number":"US-01182010-0003","Summary":"3-4 circular objects in triangle formation flying over freedom parkway"}