{"Latitude":"42.46569","City":"Otsego","files":["/var/www/straped/mufon/html2text/21534.html.txt","/var/www/straped/mufon/org/21534.html"],"Source":"MUFON","Summary":"husband and wife assume to witness shooting star while viewing Jupiter","Country":"United States","Log Number":"US-01172010-0010","Object Features":"Unknown","Region":"Michigan","Longitude":"-85.687086","Date Submitted":"01/17/2010 08:51 UTC","trends":["There have been 2 other sightings in Otsego","There were no other sightings in Otsego on or around January 17th 2010"],"divs":["Sighting DetailsAt approx. 6:50 p.m. the evening of Jan.17,2010.,my wife was outside of our garage after walking the dog and invited me to see the planet JUPITER and its close proximity to the Moon.We stood in dark facing West.She was explaining that a night or so before, the sliver of moonlight was even thinner and the planet was even closer.The moon was approx 40 degrees off the horizon in the southwestern sky and the planet was left of the moon at approx 10 o-clock.Both of us while looking in that direction saw an object appear [to the right of the moon]that could be at first thought called a \"shooting star\".We agree that it could be described as falling to the horizon for 2-3 seconds,the diameter of two stars, and the brightness of an incandescent light fading to orange.Holding my thumb out at arms length over the moon,I would say it appeared at 1:o-clock and disappeared [dropped to the horizon]at 5:30 at approx. two hand widths to the right of the moon.We expected to hear a crash and it to be found between Otsego Mi, and Lake Michigan. My wife's impression is that it didn't disappear as much as fade out and she detected a silhouette continuing to the horizon.I thought it was a re-entry capsule and the crescent light at the bottom was just like an artist rendition of a re-entry capsule.There was no trailing light or \"tail\".View time 3 seconds. I assume we're not the only people that saw it.What ever it was.It was impressive.That's not to say that the New Moon and Jupiter aren't a great opening act."],"Sighting Duration":"Undisclosed","Tags":"City","Case Number":"21534","Date of the Event":"01/17/2010 06:57 UTC","Object Shape":"Circle, Fireball, Flash, Other","Viewing Distance":"Unknown","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=42.46569,+-85.687086(21534)&iwloc=A&hl=en\"> mufon case (21534) map </A>","Weather Factors":"Unknown","Object Flight Path":"Straight-line path"}