{"map":"<A HREF = \"http://maps.google.com/maps?q=40.064754,+-74.398161(21535)&iwloc=A&hl=en\"> mufon case (21535) map </A>","Object Shape":"Cylinder","trends":[],"files":["/var/www/straped/mufon/html2text/21535.html.txt","/var/www/straped/mufon/org/21535.html"],"Longitude":"-74.398161","Log Number":"US-01172010-0011","City":"Undisclosed","Date of the Event":"09/19/1999 05:28 UTC","Summary":"Metalic dark brown cylinder, no windows, white like light bulbs at the bottom one next to other. No noise, flying very low just above the trees.","Sighting Duration":"05:28:28","Disposition":"Unknown","Country":"United States","Case Number":"21535","Tags":"City","Date Submitted":"01/17/2010 09:21 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsIn 1999 in september I bought a new puppy dog and i was training him to go outsite with his \"bussiness\". I was going out side to my back yard every 5-10 minutes. I do not remember exact time but when I opened X-time door, I saw a flying round object just above my neighbours houses, above the trees. It was metalic dark brown, no windows and at the bottom there were round white like a bulbs one to another. About 2 years ago I was watching the History Channel and there was a program about UFO in New Jersey, so when I saw the pictures on TV there were the same to the one I saw in 1999. So from about 2 years I am reading the articles about UFOs arround the world. The object that I saw was flying with no noise with same speed and the radius of it was about medium plane's lenght. Object flew over the park where there were a lot of children with parents and no one witnessed it , just me and my husband. For the next 3 days I was looking in the local news papers for the article that possibly some one would see this object. But I found nothing. I didn't report it to no one. I was affraid that no one would believe me. If I knew about MUFON at that time I definitely would report it to you. From 2 years now I look up more oftern but I didn't see any object till this time. 2 times I had a very fraitening dreams about UFO. I was so terrified in the dream that I can't explain it or I do not know the proper words to desribe the fear just look at those objects. And I saw very mean men in blue uniform like a soldiers but there were not US army but some kind unknown fearful-evil secret \"organization\". I fund later on Davick Icke web site very similar photo of a man in blue military look a like uniform and David desribed it as \"secret military\". It is good that there are brave people -MUFON that are searching for the truth. My deep feeling is that all these objects that people see they are made not for the good of humanity. People must be very aware of those objects and they must RUN AWAY VERY FAST from them with the prayers on their lips. Please, continue to do research as you do. It is nessesary to warn people about possible great danger that is coming sooner or later for the whole humanity. Please do not put my testimony in public. My English in not that good. I do not have any proof for it. You can just add to your record because it is true what I wrote. I am very religious Catholic and I would like to give this testimony to help to prove that these flying objects are not imagination or halucination-BUT THEY ARE REAL. With a great respect to you, May God bless you and guide you to find the TRUTH, that possibly would save lifes and souls, Violetta Kos"],"Weather Factors":"None","Source":"MUFON","Object Features":"Other","Viewing Distance":"101-500 Feet","Latitude":"40.064754","Region":"New Jersey"}