{"Viewing Distance":"Over One Mile","City":"Paterson","Object Features":"None","Weather Factors":"None","Country":"United States","trends":["There have been 9 other sightings in Paterson","There were no other sightings in Paterson on or around August 11th 1991"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.922565,+-74.163731(21545)&iwloc=A&hl=en\"> mufon case (21545) map </A>","Object Flight Path":"Straight-line path","Date of the Event":"08/11/1991 12:00 UTC","divs":["Sighting DetailsThe object was traveling nearly a direct path that commercial aviation follows on approach to Newark airport which is common above our home. We were facing north and this object was moving west to east. Typically the commercial aviation flies at an estimated 9000 feet or sometimes much lower. I am aware of this as I used to listen to traffic talking to Newark tower on my scanner radio on 118.3 mhz. This object emitted a low hum somewhat like the 60 cycle hum of an electric motor, My son was 11 at the time and we both saw and heard the exact same observation. There were flat, pastel like round lights beneath the triangle at head and each end point then a reddish color at the back. As the object passed away it seemed to accelerate and climb rapidly then totally disappear in a second or two if that. I have to add to this report that on Thanksgiving night, 1974 traveling home thru Wayne, NJ on Berdan Avenue at approx 10 PM my wife and I observed a flat elongated disc of light passing overhead as we climbed the hill. This object was traveling erratically then shot away at an astounding speed. No sound was heard as we had windows closed and heat on in car as well as radio. I remember as does my wife as we looked at each other and asked \"Did you see that!\" I am a retired engineer and USAF vereran serving 1965-1969. Saw all kinds of aircraft. What we witnessed in 74 and 91 was no conventional aircraft."],"files":["/var/www/straped/mufon/html2text/21545.html.txt","/var/www/straped/mufon/org/21545.html"],"Date Submitted":"01/18/2010 08:32 UTC","Object Shape":"Triangle","Tags":"City","Log Number":"US-01182010-0009","Case Number":"21545","Latitude":"40.922565","Disposition":"Unknown","Region":"New Jersey","Summary":"Son and I were on lawn chaire waiting to observe perseid meteor showers when we both noticed a large triangular shape blocking the starfield.","Source":"MUFON","Longitude":"-74.163731"}