{"City":"Meridian Charter Township","Tags":"City","Summary":"Small, orange orb.","Date of the Event":"07/04/2009 08:30 UTC","Object Flight Path":"Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Region":"Michigan","Sighting Duration":"00:15:00","Case Number":"21546","Object Shape":"Sphere, Other","Longitude":"-84.417974","map":"<A HREF = \"http://maps.google.com/maps?q=42.727917,+-84.417974(21546)&iwloc=A&hl=en\"> mufon case (21546) map </A>","Date Submitted":"01/18/2010 09:31 UTC","trends":["There have been 9 other sightings in Meridian Charter Township","There were no other sightings in Meridian Charter Township on or around July 4th 2009","This sighting has never been favorited.",""],"Log Number":"US-01182010-0010","divs":["Sighting DetailsI was sitting with my family on a hill waiting for some fireworks to begin. I saw the object rise in the direction I was facing. It rose too slowly to be a plane, and too quickly to be a planet (it was cloudy, so it was impossible to see stars anyways) or a fireworks test (the object did not explode after it rose, and it was not rising from the direction from which the fireworks show was supposed to appear). I was at Okemos at Meridian Mall around 8 or 8:30 when the object appeared. At first I thought the object was a plane or maybe a fireworks test, but due to the reasons above I quickly discouraged those options. I felt rather calm during the sighting, but later I was confused because about an hour or so after the object disappeared (fading away) another object rose in exactly the same manner as the first, hovered at the same place in the sky as the first, and disappeared in the same way. After the fireworks show was over, I also saw another orange orb in the sky."],"Country":"United States","Disposition":"Unknown","Latitude":"42.727917","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/21546.html.txt","/var/www/straped/mufon/more/21546_submitter_file1__FiyahworksFourthofJuly09008.jpg","/var/www/straped/mufon/org/21546.html"],"Source":"MUFON"}