{"Log Number":"US-01182010-0005","divs":["Sighting DetailsFirst of all.... this isn't much of a sighting. A distant 'light in the sky' doesn't seem too significant. I am a member and my reason for saying anything about it is to see if anyone else may have reported anything like what I saw. I heard from friends that the Philly news stations said something about 'sightings' but said it was, I believe, a meteor! I was lying in bed watching tv. I rolled over. When I roll to my right I can look out my window. I live out in the country. Across the street is nothing but open fields. I look out to the east. There is often a lot of air traffic out there at night. I am often amazed at how some nights looking out, I may see 3 or 4 or even 5 airplanes at any given time. Well, on this wednesday night when I looked out I saw a very bright 'star'. It was a little larger appearing than any other star. Maybe the size a planet sometimes appears. I can't say how far away it was.... but, it appeared to me to be far away. It appeared approximately 30 degrees up from the horizon. It appeared motionless. I wanted to be certain that it wasn't just a plane. Now I was curious. After a short time it moved quickly 'up'! It moved up a distance and then stopped again. Then it moved in a zig-zag up and down about 3 or 4 times. Then it did it all over again. And then.... it just 'went out' It disappeared. I kept watching but nothing happened. And..... that's it!"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.445758,+-75.336567(21541)&iwloc=A&hl=en\"> mufon case (21541) map </A>","Summary":"white star-like light","Disposition":"IFO","Tags":"City","Longitude":"-75.336567","Sighting Duration":"Undisclosed","Object Shape":"Star-like","City":"Quakertown","files":["/var/www/straped/mufon/html2text/21541.html.txt","/var/www/straped/mufon/org/21541.html"],"Region":"Pennsylvania","trends":["There have been 12 other sightings in Quakertown","There were no other sightings in Quakertown on or around January 13th 2010"],"Object Flight Path":"Hovering then path","Date Submitted":"01/18/2010 03:39 UTC","Country":"United States","Latitude":"40.445758","Case Number":"21541","Object Features":"Undisclosed","Date of the Event":"01/13/2010 10:45 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown"}