{"Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/21547.html.txt","/var/www/straped/mufon/org/21547.html"],"trends":["There have been 5 other sightings in Greenfield","There were no other sightings in Greenfield on or around June 7th 2009"],"Date Submitted":"01/18/2010 10:01 UTC","City":"Greenfield","Object Shape":"Star-like","Longitude":"-72.595724","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.595056,+-72.595724(21547)&iwloc=A&hl=en\"> mufon case (21547) map </A>","Date of the Event":"06/07/2009 08:40 UTC","divs":["sighting detailsmy son and i were sitting on the deck of our house on sunday morning june 7,2009 when my son looked up in the sky and said \" what's that light in the sky ?\" i looked up and it took me a minute or so to spot it but there it was, almost overhead. it looked like a star but at that hour of the morning, the sky was much too bright to see a star. there were clouds and they would obscure the object as they passed, but then it would reappear in the same location. my wife came out on the deck and noticed my son and i looking up in the sky and asked \" what are you two doing ?\" we told her we were looking at a ufo. she thought we were nuts but looked up and after we pointed it out , she also saw it. my son went in to the house to get his binoculars while my wife and i continued to watch it. when he brought out the binoculars he looked at the obect and the handed me the binoculars to take a look. as i tryed to focus them on the object it vanished. my wife described it as just disappearing into itself. i didn't see it happen but when i couldn't find it with the binoculars, i looked with my naked eyes and the object was gone. it didn't fade away, it vanished in a spilt second. \\"],"Object Flight Path":"Stationary","Disposition":"IFO","Log Number":"US-01182010-0011","Summary":"looked like a star but the sky was too bright for it to be one","Source":"MUFON","Case Number":"21547","Object Features":"Unknown","Latitude":"42.595056","Tags":"City","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}