{"City":"Wrangell","map":"<A HREF = \"http://maps.google.com/maps?q=56.480173,+-132.373337(21551)&iwloc=A&hl=en\"> mufon case (21551) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/21551.html.txt","/var/www/straped/mufon/org/21551.html"],"Disposition":"Unknown","Object Shape":"Unknown","Date Submitted":"01/18/2010 11:38 UTC","Region":"Alaska","Log Number":"US-01182010-0015","Sighting Duration":"Undisclosed","Weather Factors":"None, Does Not Apply","Object Features":"Unknown","divs":["Sighting DetailsI was camping with my older brother a few hundred yards past our property boundaries in a small clearing in the woods. We went to sleep probably around 11:30 or midnight, and I awoke several hours later, noticing an intense blue light with no distinct point of origin filtering in through the white screen of the tent. The light was accompanied by a strange sound, which I can only describe as pulsating and whirring, similar to guitar feedback. It was not the sound of a boat engine or generator; there were no pistons firing. You get used to those sounds when you grow up on a boat. I was unable to move anything besides my eyes, and unable to speak. From where I was laying on my side, I could see that my brother had also awoken and was also struck by paralysis. I was overcome by a very strong and instance fear, like nothing else I have ever felt in my life. Neither my brother or myself remember how long this occurrence, and we don't remember falling asleep again, but we awoke in the morning around 7:30 am and walked home. He also remember this happening and has the same story. Neither of us noticed any adverse affects to our health due to this encounter."],"Country":"United States","Case Number":"21551","Summary":"Sleeping in a tent, awaking to bright lights and strange sound. Paralyzed.","Latitude":"56.480173","Longitude":"-132.373337","Date of the Event":"04/07/1996 04:00 UTC","Source":"MUFON","Tags":"City","trends":["There has been one other sighting in Wrangell","There were no other sightings in Wrangell on or around April 7th 1996"]}