{"Disposition":"Insufficient Data","City":"Southfield","Viewing Distance":"Unknown","Date of the Event":"01/13/2010 08:00 UTC","Longitude":"-83.221873","files":["/var/www/straped/mufon/html2text/21550.html.txt","/var/www/straped/mufon/org/21550.html"],"Object Shape":"Star-like","Source":"MUFON","Object Features":"None","Weather Factors":"None","Sighting Duration":"00:15:00","Object Flight Path":"Path then hovering","Log Number":"US-01182010-0014","Summary":"Bright object rapidly changing colors.","divs":["Sighting DetailsOn Wednesday the 13th January 2010 I had stepped outside my place of work to have a cigarette. As I was standing there I looked up at the night sky, which was very clear with a lot of stars being shown. There's a military airfield near by, and often times at night airplanes can be seen flying over head, and it helps pass the time watching them. On this particular occasion I had saw what I believed to be just a normal airplane flying over head in the distance, slightly above where Orions belt would be. What made this object different than any other ones I saw was the rapidly changing color of light. It had a stark bright white color to it, but you could see it change colors very rapidly (kind of like a flashing led) between red first, blue, and than green. As I watched this object I saw it clearly go from just moving straight across to going down almost like a slant, following Orions belt. It vanished momentarily, but I could still follow it by the faint flashing light. It had than made it's stop near a radio tower that stands right across from me. The radio tower has a series of red lights that will flash on and off in order to warn incoming planes. In this particular case the object which I saw was \"standing\" near the lowest point of the light, which is rather odd for something that would be an aircraft, not to mention it was just sitting there. I watched the object for approximately 15 minutes as it just stood there, flashing it's colors very rapidly. At that point my break was over, and I figured it was just a star, or my mind playing tricks on me, so I headed back inside. After that night I continued to watch the sky, trying to see if I could find the object again to assure my self that it was in fact a star, how ever I had no such luck spotting it again. The reason I am just reporting it now is because I wanted to make sure it was not a star, and also because I was listening to a podcast that had reported similar events in other states."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.473369,+-83.221873(21550)&iwloc=A&hl=en\"> mufon case (21550) map </A>","Latitude":"42.473369","Date Submitted":"01/18/2010 11:34 UTC","trends":["There have been 5 other sightings in Southfield","There were no other sightings in Southfield on or around January 13th 2010"],"Country":"United States","Case Number":"21550","Tags":"City","Region":"Michigan"}