{"Country":"Mexico","Date Submitted":"02/23/2003 06:15 UTC","Source":"MUFON","Object Features":"Undisclosed","Summary":"Saw two cigar-shaped objects in formation","Date of the Event":"02/23/2003 06:15 UTC","Log Number":"","Object Shape":"Blimp","Disposition":"Unresolved","Latitude":"25.99064","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Case Number":"2155","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Ciudad Río Bravo","This sighting has been favorited 1 time."],"divs":["Sighting DetailsI was at the local golf driving range, halfway through a bucket of balls andtaking a smoke break. It was about 6pm, bright and sunny. I had backed awayfrom the line where other golfers were still hitting balls. I looked up at theeastern sky and noticed two cylindrical objects due east of me flying information heading due south. At first I thought they were just airplanes, asTampa Int Airport is about 5 miles south and 3 miles east of where I was. Infact, these objects had to have been in the restricted airspace of TIA. Iwatched for several minutes, thinking a change of viewing angle would make theexpected wings visible to verify they were planes, but I never saw any wings,nor tail for that matter. What was strange was 1 the height, as they were toolow to be aircraft heading further south, like Miami. I see those all the time,and even at cruising altitude one can make out the wings. 2 The speedthey were moving too slow to be normal airplanes like 727 or something and toofast and narrow to be blimps. 3 The locationthere should not have been aircraft at that altitude apprx 5000 ft that were notin a landing pattern for TIA. These craft did not change altitude, nor circlethe airport as would normal aircraft. They maintained a straight path the wholetime they were in sight. 4 There are never two aircraft that close to eachother in a normal landing pattern. If I guessed their size correctly, they werecomparable to something like a wingless 737, and they were about 200 yardsapart. 5 They made no sound whatsoever, no jet engine, no prop, no exhaust. Other golfers may have noticed the craft, but I said nothing as people werehitting balls and it is real rude to shout out Hey, look at that. By the time Irealized the strangeness of the craft and their behavior, they had already moveda couple of miles farther south and more difficult to distinguish from a regularairplane.These objects may turn out to be blimps, but Ive seen lots of blimps and thesewere higher than Ive ever seen a blimp, and narrower that any blimp Ive seen. They were dangerously close to the air traffic if they were blimps. As far asIm concerned, they were unidentified, they were flying, and they were objects. I would be delighted if someone confirmed they were blimps."],"City":"Ciudad RÃƒÂ­o Bravo","files":["/var/www/straped/mufon/html2text/2155.html.txt","/var/www/straped/mufon/org/2155.html"],"Region":"Florida","Sighting Duration":"00:10:00","Longitude":"-98.109158","map":"<A HREF = \"http://maps.google.com/maps?q=25.99064,+-98.109158(2155)&iwloc=A&hl=en\"> mufon case (2155) map </A>","Tags":"City"}