{"Latitude":"51.04801","Log Number":"CA-01192010-0010","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around January 18th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.04801,+-114.049542(21561)&iwloc=A&hl=en\"> mufon case (21561) map </A>","City":"Calgary","Source":"MUFON","divs":["Sighting Detailsmy roommate and i were sitting on the porch smoking at approx 1:30 am when i noticed a large glowing circle moving across the night sky in a curving motion. the thing that brought it to my attention was its blazing orange color. we doubted its existence as a plane due to the fact that there were no FAA blinkers on it. a couple of seconds after i had drawn my roommates attention to the strange object we watched as the object turned on a dime and started heading into the opposite direction. after a few more seconds of curving movemnent, we watched as the orange orb shaped phenomena go from moving slowly to an acceleration of insane proportions. as it was accelerating we noticed that it left a very visible, very distinct red and blue streak in its trail. we both looked at each other and figured out that theres no such things as shared delusions and we both vouched for its presence. to be honest i felt very scared when i saw the object because ihad never seen such a strange object in the sky. unfortunatley i was unable to get a photo due to the random appearance of the object and the incredible speed that it was accelerating to. i also felt almost an aura like haze coming off the treeline as i was viewing the object"],"Date Submitted":"01/19/2010 10:59 UTC","Region":"Alberta","Object Shape":"Circle","Country":"Canada","Longitude":"-114.049542","Disposition":"Unresolved","Date of the Event":"01/18/2010 01:30 UTC","Summary":"glowing orange circle random hyper-acceleration","Weather Factors":"Unknown","Object Features":"None","Case Number":"21561","Tags":"City","Object Flight Path":"Path with directional change","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/21561.html.txt","/var/www/straped/mufon/org/21561.html"],"Viewing Distance":"Unknown"}