{"Latitude":"37.159795","Region":"Missouri","Viewing Distance":"20 Feet or Less","City":"Piedmont","Date of the Event":"06/10/1980 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Piedmont","There were no other sightings in Piedmont on or around June 10th 1980"],"Summary":"red orange orb flew out of woods across hood of my car","files":["/var/www/straped/mufon/html2text/21562.html.txt","/var/www/straped/mufon/org/21562.html"],"Object Flight Path":"Other","Country":"United States","Disposition":"Unknown","Longitude":"-90.689065","map":"<A HREF = \"http://maps.google.com/maps?q=37.159795,+-90.689065(21562)&iwloc=A&hl=en\"> mufon case (21562) map </A>","Date Submitted":"01/19/2010 11:51 UTC","Log Number":"US-01192010-0011","Case Number":"21562","Source":"MUFON","Object Shape":"Sphere","Weather Factors":"Unknown","divs":["Sighting DetailsWe were driving down the entrance road to a campground on Clearwater lake about nine pm (in the dark) when a red orange sphere came out of the woods ahead of us to our right about seventy five feet ahead. It was about the size of a volleyball floating about five feet off the ground. It came out of the woods ahead of us floating across a clear grassy area of about forty feet in width at a right angle to the woodline then turned and came toward our car as we approached it, following a wavy path. As it approached the car it rose slightly and came up over the drivers side front fender, glowing brightly, and passed by my open window within five feet of my head at eye level. I looked directly at it but could see no surface detail at all, only the bright glow. It passed my window and i jerked my head around to watch where it went and it continued the same wavy motion following the road behind me from whence i came, continuing on, following the road until it went around a curve out of our sight. There was no sound at all. I estimate the speed it was traveling to be about twenty five miles an hour, which was about the speed I was moving. We were quite amazed as that area was well known at the time for ufo sightings and we had just witnessed one in a \"small\" way. My wife was with me and will attest to everything I've stated."],"Object Features":"None","Tags":"City"}