{"Source":"MUFON","Country":"United States","Date Submitted":"01/19/2010 08:14 UTC","Longitude":"-73.390944","Disposition":"Unresolved","Summary":"UFO showed only on digital photo.","Object Shape":"Sphere","Date of the Event":"01/18/2010 06:05 UTC","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.690239,+-73.390944(21560)&iwloc=A&hl=en\"> mufon case (21560) map </A>","Latitude":"40.690239","Tags":"City","Log Number":"US-01192010-0009","Region":"New York","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There has been one other sighting in Copiague","There were no other sightings in Copiague on or around January 18th 2010","This sighting has never been favorited.",""],"City":"Copiague","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI took several pictures of the sky because i wanted to see if i could get a good image of the moon and its shadow. In the sky I did not see the image that appeared in the photos with my naked eye, neither did my daughter,in fact at that time, the sky was crystal clear.I used a cannon rebel xsi digital camera.The reason all the images appear in double or should I say smeared is because the lens was kept open approx. 4 seconds to allow enough light for exposure.The spherical object that appears in two completely different areas( one above right, the other below left) is the only thing that moved considerably.It also has the appearance of a bluish green reflection on its upper side.I would like to know if this is possibly an object in the sky or some sort of digital effect that happens with photos taken in this manner. please Email me a response. sorry if I have wasted your time, if in fact I did. Thank you, Gregory Steenbuck PS. photos are attached in the order they were taken."],"files":["/var/www/straped/mufon/html2text/21560.html.txt","/var/www/straped/mufon/more/21560_submitter_file1__IMG_1303.JPG","/var/www/straped/mufon/more/21560_submitter_file2__IMG_1304.JPG","/var/www/straped/mufon/more/21560_submitter_file3__IMG_1305.JPG","/var/www/straped/mufon/org/21560.html"],"Case Number":"21560","Object Features":"Unknown"}