{"Viewing Distance":"Unknown","Longitude":"-97.134494","map":"<A HREF = \"http://maps.google.com/maps?q=49.905294,+-97.134494(21564)&iwloc=A&hl=en\"> mufon case (21564) map </A>","Case Number":"21564","files":["/var/www/straped/mufon/html2text/21564.html.txt","/var/www/straped/mufon/org/21564.html"],"City":"Winnipeg","Disposition":"Unresolved","Log Number":"CA-01202010-0002","Tags":"City","divs":["Sighting DetailsI'm from Winnipeg, Manitoba. Tonight, Wed. January 20, 2010 around 1 am central time, I saw a line of light about an inch long in the sky above my apartment building bast the clouds. It interested me because it was a straight line of light too far to be a reflection. I initially mistook it for a comet. After thinking about it I went back out to see if it was still there. It had dimmed, but also brightened as I looked at it. So I came inside to get a camera to see if anything would appear on film. After it flashed, the light in the sky got really bright, and a distinct shape appeared. Along the shape, another light flashed at me. Next thing I know there is a new star in the sky. I'm writing to document, not to be a crack or quack. I'm serious about what I saw and it really shook me. I know MUFON investegates this sort of thing, but am only letting you know because you are the experts in this sort of thing. If anything shows up on film, which I highly doubt, I will be sure to let you know. This thing really shook me and made me feel like something out there responded to my actions that was beyond just being human. Too intense to describe."],"Source":"MUFON","Summary":"I flashed at it, It flashed back at me.","Object Features":"Unknown","Sighting Duration":"00:15:00","Object Flight Path":"Stationary,Straight-line path,Other","Date Submitted":"01/20/2010 03:03 UTC","Region":"Manitoba","Object Shape":"Flash, Other","Country":"Canada","Latitude":"49.905294","trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around January 20th 2010"],"Date of the Event":"01/20/2010 12:00 UTC","Weather Factors":"Unknown"}