{"Case Number":"2156","Sighting Duration":"00:10:00","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsWe lived in an apartment in the las floor 15 in buenos aires, Argentina. Mymother was outside hanging wet clothes and the rst of the family my father, mytwo brothers and I were inside. It was a clear day I remember and suddenly mymother shouted Come over here, come over here. I remember that, when I went outto see what was happening, I saw my mother pointing with her finger to the sky.We all run out when my mother shouted and looked to that point in the sky. Therewas a something hanging in the sky. It was axactly as two dishes put one againstthe other. One grey, and the other darker. This UFO as I think it is had amovement as it was over the sea. It moved like it had wavs under it. Suddenly,this thing disappear in front of our eyes. Then, I started looking all over thesky from there we could see the whole sky. There, far away...I think, at least,at 30 blocks or more, it was the UFO....I run inside to catch how do you say itin english....that thing with lens for both eyes that lets you see things thatare far away from you as they were near Well, I took that and I put it on thebalcony wire to keep it firm. I could see that UFo again, moving like it didwhen it was closer, and after a while maybe 3 minutes it desapar again. That wasthe last time we saw it. Forgive me for my english and I hope this could beuseful."],"trends":["There have been 3 other sightings in Florida","There were no other sightings in Florida on or around November 30th 1972"],"Longitude":"-58.490906","Log Number":"","Summary":"Weve seen an UFO, very close to us...I think in 19","Object Shape":"Disc","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-34.53295,+-58.490906(2156)&iwloc=A&hl=en\"> mufon case (2156) map </A>","Country":"Argentina","files":["/var/www/straped/mufon/html2text/2156.html.txt","/var/www/straped/mufon/org/2156.html"],"Date Submitted":"11/30/1972 12:00 UTC","City":"Florida","Date of the Event":"11/30/1972 12:00 UTC","Latitude":"-34.53295","Region":"Florida","Weather Factors":"Unknown"}