{"Disposition":"IFO","Latitude":"33.727487","Longitude":"-116.208642","City":"Indio","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Disc, Saturn-like, Unknown","trends":["There have been 9 other sightings in Indio","There were no other sightings in Indio on or around October 30th 2009"],"Date of the Event":"10/30/2009 09:00 UTC","divs":["Sighting DetailsWe'll I had just got to my father's house in Coachella, Ca on Oct 30, 2009. My fiance and I decided to go to BevMo in Indio and decided to take the back road, going down Ave 52 towards Indio right next to the Empire Polo Grounds. I was driving and my Fiance Chris told me \"There's a huge UFO driving right by us, it's huge and flashing all kinds of lights.\" Now he doesn't believe in aliens and ufo's like I do so I assumed he was teasing me. So I didn't bother to try and look to his side cause it was dark, I was driving and there was a Phish concert going on at the Polo Grounds so I was focused due to the cops about. Chris kept on about the Ufo he saw and I was like \"yeah right\". We went to BevMo and on the way home I took Ave 51 instead of 52 and I saw it. It was the hugest UFO, very close to the car. It reminded me of a mothership or something due to it's size and all the lights. That turned on and off almost in a sequence as if communicating. I lowered my wondow and drove about 35 cause I was in awe. There were a couple cars pulled over and I wanted to pull over but the fact it was so close freaked me out. Then all of a sudden in a split second it was super up high and then we reached a blockade and there were cops and other people that turned us down Polo Rd. I kept looking in my rear view mirror trying to see it. Then when I turned down ave 52 to get back home i saw it but it was much further away, past the polo fields and then it just vanished. Now we know what we saw, and it was something we will never forget. It left me out of sorts and it made Chris a believer. It was about 9 at night and even though it was dark there were lights around and I could see it's saturn like shape. The light were huge and some would turn on in a sequence and then they would go black and others would start up. And not just one color there were many flashing. I felt a strange vibration or humming. But then again I was driving and it could've just been me. Till today I still feel like I saw it for a reason and I now have no doubt that they are out there. I kinda felt like I was meant to see it. LIke somehow I picked up on where to go for it to show itself to us. I know it's strange right????"],"Weather Factors":"Windy","Summary":"Huge Ufo by Indio Polo Grounds","Tags":"City","Region":"California","files":["/var/www/straped/mufon/html2text/21568.html.txt","/var/www/straped/mufon/org/21568.html"],"Log Number":"US-01202010-0006","Case Number":"21568","Country":"United States","Date Submitted":"01/20/2010 09:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.727487,+-116.208642(21568)&iwloc=A&hl=en\"> mufon case (21568) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Features":"Dome, Insignia","Viewing Distance":"21-100 Feet"}