{"Object Shape":"Circle, Disc","Region":"Hawaii","Latitude":"21.979363","Country":"United States","City":"Kekaha","Sighting Duration":"00:15:00","divs":["Sighting DetailsAt the time my dad was in charge of security, and fire fighting on the naval base in Kauai hawaii. Barking Sands Naval base. At the time i was in school in the town of Kekaha, Kauai. we was called out of class to observe Humpback Whales spouting out near the Boey. I observed a flash out of the corner of my eye towards the direction of Barking sands naval base. Beings my dad was in charge of security of the base, i especially took note of the flashing. Normally that would not be Abnormal to see activity beings it is a naval base, but somethign about this struck me wrong. I waited till dad got off work to question him as to what happened. He got home at about 16:30 or so, and i immediatelly questioned him about the activity. At first he remained hesitant about what happened. After much prying i was informed from him that at that time a U.F.O. had appeared between the islands of Kauai, and Nijiau.The object showed up on radar and immediatelly contact was attempted through radio to no avail. upon no response the base commander dispatched 3-F 14 tomcats to intercept . The F-14s formed a triangle around the object, one on top, another on the side starboard side, and one port side of the object. They then started forcing the ufo down towards the water in the attempt to make it surrender or communicate, to no avail. finaly they forced it down in the channel between the 2 islands to which it Sank to the bottom of the sea in about 12,000 feet of water. Interestlly enough about 3 days later a Soviet Salvage vessel showed up and tried to (Drag) the bottom of the sea to snag the ufo. it was unable to get it, and recieved offical protests from the United States Government, due to the proxemity to U.S. territorial waters. besides this i dont know anythingmore about the occurance. I will though say i know more about other occurances, personally, and from my dad on other military contracts. I am former U.S.N. honorablly discharged, and believe in homeland security, absolutelly. This particualar incident occured a long time ago and no classified material was disclosed. I have personally seen 2 U.F.Os in my life and my mother has seen one, up close and personal. literally withing 20 feet or so when she was younger. in her case the U.F.O was cigar shaped and landed in a close by wheat field, near her home at the time. it stayed their for a while and left fast. It fried the wheat clear donw to the ground. my dad was just beggining in the fire fighting field at that time and had access to geiger counters, when he heard what happened, that day after getting home he got a geiger counter and went out to the area of the ufo. the geiger counter was off the scale. the reading was highly radioactive. Will submit this for now, i know of more but truthfully i am afraid. my dad is eaten up with cancer atm, and afraid i will cause him trouble , disclosing this info.But i feel i owe it to him atm, he has held this in for a long time so am merelly disclosing it for him, (without his knowledge), thanks :)"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=21.979363,+-159.70672(21563)&iwloc=A&hl=en\"> mufon case (21563) map </A>","Case Number":"21563","files":["/var/www/straped/mufon/html2text/21563.html.txt","/var/www/straped/mufon/org/21563.html"],"Summary":"disc object moving side to side flashing rapidlly","Date Submitted":"01/20/2010 01:40 UTC","Object Features":"Unknown","Disposition":"Unknown","Log Number":"US-01202010-0001","Object Flight Path":"Other","Date of the Event":"07/10/1973 02:11 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Kekaha","There were no other sightings in Kekaha on or around July 10th 1973"],"Tags":"City","Longitude":"-159.70672"}