{"Weather Factors":"Windy","Longitude":"-87.157937","divs":["Sighting DetailsFather and daughter traveling in the car west on US highway 98 towards GulfBreeze FL. Looked to the right north approx.in Naval Live Oaks National Seashorereserve because the sky looked unusually bright for the time of night. Justbelow the tree line we saw lights rather close to the roadway maybe 200-300 ftaway in a triangular shape with smaller lights just below stobingflashingrandomly - several colors. Just beneath that, was a well defined, rectangular,white translucent glowing object - a little less wide than the triangular lightson top. Could not see any connection between the three collections of lightsblackness but they all moved in unison -as if they were part of the same object- west on HYW 98, pretty much matching our speed the rest of the way down thehighway. Only lost sight of it periodically as it went behind clumps of trees,remaining just below tree line height until itwe got into the City proper. Wethen viewed it in the open at a slightly higher altitude 200-300 ft off theground. And it continued to appear in the same configuration describedabove-same lights, shape etc. Never able to see anything connecting the lightsbut they moved as if attached together. Didnt think to roll down windows in thecar so no sound was heard.The object continued to move NW approx. and was thenobscured by some trees off and on and then strangely, it seemd alot fartheraway, in a few seconds, to the NW out over Pensacola bay. At last sight weturned left into Gulf Breeze suburb and it appeared to be a small light off inthe distance over the bay. Lost sight of it altogether when we fully turned downShoreline Blvd. Maybe not connected, about ten minutes after we got home about1-2 minutes after the sighting my wife, daughter and self heard loud jet noisescontinuously, for over an hour in the direction of Pensacola. To me and mydaughter, we thought it looked like the top of a cell-phone tower sort of, butof course it moved Also to me it seemed taller than wide and resembled aJapanese lantern. Stangely, while we watched it, we were impressed that itseemed to float quite gently as it traveled down the highway. The winds wereunusually strong that night. We also tried to convince ourselves it was ahelicopter but it just was so strange and didnt look or act like one."],"Object Flight Path":"Unknown","Disposition":"Unresolved","Object Features":"Other","Log Number":"","files":["/var/www/straped/mufon/html2text/2157.html.txt","/var/www/straped/mufon/org/2157.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.366094,+-87.157937(2157)&iwloc=A&hl=en\"> mufon case (2157) map </A>","Country":"United States","Latitude":"30.366094","Date of the Event":"02/22/2003 08:00 UTC","Region":"Florida","Case Number":"2157","Summary":"Strange lightsstrobe with rectangle below above tr","Sighting Duration":"00:05:00","trends":["There have been 55 other sightings in Gulf Breeze","There were no other sightings in Gulf Breeze on or around February 22nd 2003"],"Object Shape":"Unknown","Tags":"City","Source":"MUFON","Viewing Distance":"101-500 Feet","City":"Gulf Breeze","Date Submitted":"02/22/2003 08:00 UTC"}