{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/21570.html.txt","/var/www/straped/mufon/org/21570.html"],"City":"Red Deer","Case Number":"21570","map":"<A HREF = \"http://maps.google.com/maps?q=52.270741,+-113.795975(21570)&iwloc=A&hl=en\"> mufon case (21570) map </A>","Log Number":"CA-01212010-0002","Viewing Distance":"21-100 Feet","Object Shape":"Circle, Sphere, Other","Date of the Event":"01/19/2010 03:30 UTC","Date Submitted":"01/21/2010 11:11 UTC","divs":["Sighting DetailsI was smoking outside a friends apartment on her patio and taking some beautiful pictures of the clouds. An airplane came flying overhead towards us pretty low, I could see the details of the wings and underside very clearly but before I could adjust my camera setting to take a pic of it, it disappeared over the roof. A few seconds later it came back the way it came and flew eastward. There was no chemtrail or comtrail and it made a motor like realistic sound. What was odd is that when it was passing overhead going east I took a couple of good pics but when I looked at my camera the plane wasn't in the shot. I showed my girlfriend, puzzled, and took another shot to show her it wasn't showing up in the frame even I widened the shot considerably. I took a couple more pics as it was farther away and those ones seemed ok, you could see a tiny spot of the plane shape. When I took the camera home to upload my photos I noticed a blur in the spot where the plane was supposed to be, when I looked closer I could see a dark round blur. In a series of three pics I was able to catch an orb moving east, it is cloaked but you can change the pic to a negative image and clearly see the round orb moving over the sky in separate frames. In subsequent frames the camera looks like an airplane, but like I said, there was no tail of exhaust or anything coming from it, and come to think of it it was really fast. There are alot of chemtrail and sylph action going on here in this area, I wonder if they are connected? I'll have to add some pics tomorrow, I just had to show my girlfriend the pictures to show her for herself- she's blown away too- and left them at her house. I wonder what they were doing, did they see me? Were they giving me a chance for my picture by decloaking temporarily? An advanced culture isn't going to let that happen unless they had some reason... One other thing maybe not worth mentioning but happend that day, a couple of hours before this, at work I got this sentence in my head and wrote it down because I thought it was beautiful in its own way. \"The path to god lies within your own heart\" I put it on a tiny piece of paper and put it in my pocket and carried it all day."],"Weather Factors":"None","Country":"Canada","Object Features":"None","Longitude":"-113.795975","Summary":"ghost plane shows up on camera as an orb","Region":"Alberta","Disposition":"Unresolved","Latitude":"52.270741","Object Flight Path":"Path with directional change","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Red Deer","There were no other sightings in Red Deer on or around January 19th 2010"]}