{"Longitude":"-104.981373","Weather Factors":"Does Not Apply","City":"Denver","Source":"MUFON","Log Number":"US-01212010-0013","divs":["Sighting DetailsMy co-worker and I were at work having lunch in my office in downtown Denver (15th floor). I looked up and I could see the sky through the window. I asked her \"what's that\"?. She replied it's a military helicopter. I laughed and said \"No way. That's not a helicopter and it's not a plane either\". She laughed and said \"what is it then...a UFO\". I told her to walk over to the window and get a better look. She did but lost sight of it for a moment. However, I could still see the object moving from where I was sitting and told her where to look. As I motioned to get up to get a better look, I noticed it was moving slow, stopping and moving again before it disappeared right front of us. It didn't go through a cloud or anything, it just simply vanished from our sights. Almost as if it knew we were looking at it. The location of the UFO was about 2 or 3 miles Southeast of the State Capitol and about 20,000 ft in the air. I am not that great at guessing distance in the air but I would say that 20,000 ft is an ok guess. My friend and I are government employees and we are both honest people. She has never seen a UFO before and I have had over 50 sightings since 1997. The funny thing is, I am starting to see more and more solid objects in the sky and not just unusual lights in the night sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.741884,+-104.981373(21581)&iwloc=A&hl=en\"> mufon case (21581) map </A>","files":["/var/www/straped/mufon/html2text/21581.html.txt","/var/www/straped/mufon/org/21581.html"],"Case Number":"21581","Region":"Colorado","Disposition":"IFO","Sighting Duration":"Undisclosed","Summary":"Brown ball","Date Submitted":"01/21/2010 10:46 UTC","Object Features":"Unknown","Tags":"City","Object Flight Path":"Path then hovering","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around January 20th 2010"],"Latitude":"39.741884","Country":"United States","Object Shape":"Other","Viewing Distance":"Over One Mile","Date of the Event":"01/20/2010 12:30 UTC"}