{"Country":"United States","Sighting Duration":"00:00:15","Longitude":"-79.760252","Disposition":"Unknown","Date Submitted":"01/22/2010 08:49 UTC","files":["/var/www/straped/mufon/html2text/21587.html.txt","/var/www/straped/mufon/org/21587.html"],"Summary":"It was moving slowly across the sky as if it were observing me. then it stopped completly. then it just shot off in a flash of light.","Object Flight Path":"Stationary","Object Features":"None","Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=34.197083,+-79.760252(21587)&iwloc=A&hl=en\"> mufon case (21587) map </A>","Latitude":"34.197083","Log Number":"US-01222010-0003","Weather Factors":"None","Object Shape":"Oval, Teardrop","Tags":"City","Case Number":"21587","divs":["Sighting DetailsI was at my cousins house on my way home. we were just approaching a dirt road when i saw something flashing in the sky. so i decided to stop and look up, and there was a slow moving, shiny, mettalic, object just cruising in the sky. at first i thought to myself \" naw thats just an airplane\". but i kept seeing the flashes on my way home. So i looked up again, and it was just floating above a cow field, spining in a clockwise motion. then i pointed it out to my cousin and he was speechless. i was astounded. i watch U.F.O Hunters when i can, but i never thought it could really happen. So i decided to take a picture, but my cellphones camera just showed a really bright red light when i aimed at the object. as i was looking at the phone, the object just slowly ascended and just shot of in a flash of light. and as it shot off, i heard a high-pitched ring in my ear. and that was the last i saw it. When i got home, i went to sleep thinking i must be crazy. then i woke up remembering the dream i had. I clearly saw the object was no airplane in the dream. it felt like the dream was real."],"Source":"MUFON","trends":["There have been 11 other sightings in Florence","There were no other sightings in Florence on or around August 22nd 2009"],"Date of the Event":"08/22/2009 01:00 UTC","City":"Florence","Viewing Distance":"21-100 Feet"}