{"Source":"MUFON","Case Number":"21588","Summary":"orange orb 6'-8' across, 1' off the ground","Weather Factors":"None","Object Shape":"Sphere","Viewing Distance":"20 Feet or Less, 21-100 Feet","Region":"Ohio","files":["/var/www/straped/mufon/html2text/21588.html.txt","/var/www/straped/mufon/org/21588.html"],"Date of the Event":"03/31/1968 05:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.606698,+-82.943613(21588)&iwloc=A&hl=en\"> mufon case (21588) map </A>","City":"Circleville","Date Submitted":"01/22/2010 02:25 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","divs":["Sighting DetailsThis report is submitted by field investigator who recieved it from the witness first hand.This is a RUFOS (Roundtown UFO Society)Circleville,OH generated report.This case although an historical one I feel is of value to be documented for research. In April (day unknown) 1968 The witness and her friend were driving home and as they approached the witnesses house they both observed an orange light across the street.She pulled into the drive and they got out of the car to see that it was approximately 100' away in the SSW, 6'-8' across, 1'off of the ground,orange in color and \"round like the moon\".No sound was heard.They watched for 20 minutes then the objects left side and its right side \"folded into itself\" and disappeared.Then the women went inside the house. The next day the witnesses neighbor came to her home and wanted to see where he had also viewed the object from his house down the road. He walked across the street where she told him where they seen the object,but he found no evidence visible. (The witness husband had recently passed away and her friend was staying with her at this time) The next day at about 5:00PM the friend was in the kitchen and looked out of the window and saw a bright white sphere 5'-8' across with \" many spokes coming from out of it\" The object was 10'-12' off the ground,15' outside the window between the house and a large oak tree to the North. The friend let out a loud scream and the witness came runnig from the other room. She was pointing out the window and the witness observed it also for 5-10 seconds before it \"blinked out\" and disappeared.This event frightened her so badly that she packed her belongings immediately and refused to stay at the witnesses home any longer. Side note: In the morning the witnesses dog went missing and was never found. No other sightings have occured since these 2 events by the witness."],"Tags":"City","trends":["There have been 5 other sightings in Circleville","There were no other sightings in Circleville on or around March 31st 1968"],"Object Features":"Undisclosed","Longitude":"-82.943613","Latitude":"39.606698","Object Flight Path":"Stationary","Log Number":"US-01222010-0004"}