{"Date Submitted":"01/23/2010 12:39 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/21592.html.txt","/var/www/straped/mufon/more/21592_submitter_file1__photo.jpg","/var/www/straped/mufon/org/21592.html"],"Weather Factors":"None","Log Number":"US-01232010-0001","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.55387,+-110.273206(21592)&iwloc=A&hl=en\"> mufon case (21592) map </A>","Object Shape":"Triangle","City":"Sierra Vista","Latitude":"31.55387","Case Number":"21592","Tags":"City","Object Features":"None","Region":"Arizona","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Path with directional change","Summary":"Black Triangle hovering, gliding in silence","Disposition":"Unknown","Date of the Event":"06/15/1985 07:00 UTC","divs":["sighting detailsit was summer 1985,,, me, my brother michael, and my best friend mike toney were throwing a baseball, playing catch in the middle of our street. it got dark real late. we lived on a military base..ft. huachuca which is outside of sierra vista, az. i don't remember who saw it first but we looked up and there was this large black triangle gliding silently but you could hear a low hum....it went over us and circled around then went behind the mountains next to our base and came over again and went straight....on the object there were 3 white lights on the points of the triangle object and a red light in the middle and it would go off\\on slowly. it was probably about 5000 feet above us maybe... but it glided slowly... and i didn't hear an engine roaring...we lived on a military base...all i can say it was definitely a ufo..i kept this with me for 25 years but thanks to tnmufon she told me to report it so i did. .the photo attached is a good drawing of what i witnessed on that evening"],"Longitude":"-110.273206","trends":["There have been 11 other sightings in Sierra Vista","There were no other sightings in Sierra Vista on or around June 15th 1985","This sighting has never been favorited.",""]}