{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.555733,+-97.14306(21590)&iwloc=A&hl=en\"> mufon case (21590) map </A>","divs":["Sighting DetailsI have reported UFO sitings with regularity. Seeing UFOs are not something I think about or ever tell anyone about. They are. On Tuesday morning 6 35a.m. I stepp'd out for my morning \"pray'r\" walk. I have been doing this faithfully every morning since 2007. I walk and converse with the God of the Universe. My dog, Tiphani escorts me. I live right next to a complex of baseball fields. I always walk between the fields. On Tuesday, I look'd up toward the western sky and one of the large planets was position'd at 4 o clock in the sky. A traveling circle appear'd in the sky just shy of the same position and to the north. It travel'd right beneath the large planet and then disappear'd. At first it appear'd to fade in and out as if traveling through a haze but the early morning sky was perfectly clear. I stood still and watched it for about 35 seconds and when it cross'd beneath the planet, it disappear'd. I stood there and watched for a bit longer and nothing reappeared. The thing that makes this sighting interesting is that \"first of all, I immediately thought I am going to observe this fully so that I can report it.\" Which I did. Noting the height in the sky and the direction it traveled in-north west-to west. Of course, when objects disappear you can never swear you saw anything, there is no left proof. I continued my walk and pray'r time to the deep-dark woods where I kneel and pray to a Sovereign Supra-natural God. On this morning, I experienced an odd vision-trance-awareness. Where I kneel is a large hill that juts up from a low meadow of trees and a small creek flows at the base of the cliff. I kneel always with my back to the cliff and the small, babbling stream. This morning, I didn't so much pray aloud as I was in motion to God. I raised my arms, I stretched them to the heavens and then dropp'd them to my side. In my mind, I was aware of a MIGHTY PRESENCE OF AN ANGEL shadowing my every move, when I raised my arms,he raised his mighty wings into the air behind me, when I waved my arms, he glided his wings in tandem with my movements. The fantastical awareness is that this angelic Being was so HUGE. It fill'd up a huge amount of space and simultaneously was not there at all. Magnificent was the Presence. I knew it was sheltering me, providing me with security. These things are never explainable or rational, they are. Later on Tuesday evening, I was giving a young friend a ride home from a dinner, and we were traveling 70 mph. on I-35. I noted in my rear view mirror the presence of a car weaving eratically behind me. My young friend was talking and oblivious. Suddenly I re-focused on the road to my front and saw that all the cars on the interstate had come a dead-halt and I was within feet of crashing into the car before me. Miraculously, I swerved and the lane next to mine was stopp'd a bit more ahead and my reflexes braked and uncannily, I was able to stop my car in a miraculous short amount of distance. I was not scared. I was not in control. In hindsight, I think all of this is related."],"Date Submitted":"01/22/2010 10:37 UTC","Country":"United States","Object Shape":"Circle","Longitude":"-97.14306","Weather Factors":"Unknown","trends":["There have been 16 other sightings in Waco","There were no other sightings in Waco on or around January 19th 2010"],"Summary":"Angels Watching Over Me","Disposition":"Hoax","Object Flight Path":"Straight-line path","Region":"Texas","Object Features":"Unknown","Log Number":"US-01222010-0006","Case Number":"21590","City":"Waco","Source":"MUFON","Tags":"City","Date of the Event":"01/19/2010 06:37 UTC","Sighting Duration":"Undisclosed","Latitude":"31.555733","files":["/var/www/straped/mufon/html2text/21590.html.txt","/var/www/straped/mufon/org/21590.html"]}