{"Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"01/23/2010 01:30 UTC","Object Shape":"Other, Unknown","Sighting Duration":"Undisclosed","Date of the Event":"11/08/2009 10:50 UTC","Country":"United States","Case Number":"21595","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was traveling southbound on US-41 in Appleton when I noticed a very unusual high density cloud that was gliding like a lifting body instead of floating. It passed almost directly between myself and the sun and was very dense. It was very low in altitude at approximately 1000ft. (Photo 3057a) Beside it was some type of other unusual cloud that was moving more like a fish than a cloud that was staying right beside it and seemed to look towards me as to make eye contact.(Photo 3057b) At this point it begain to change direction and bank away from me. It was then I could see some type of V-pattern on the bottom rear of it almost as if there was some kind of a V-shape hull or craft inside of it.(Photo 3062b) I lost sight of the objects as I traveled farther south on US-41. I know this all sounds very strange and I have thought about it for several months now and have many other photographs of the event that I have looked at very closely and I have decided just to put it out there for others to see. The photos appear dark because of the relationship of the sun to the camera which was actually a benefit. I have adjusted the brightness and contrast levels to better show the extreme density and detail of the clouds but have not altered the photos in any way."],"Longitude":"-88.409675","City":"Appleton","Tags":"City","Source":"MUFON","Latitude":"44.270141","Object Features":"Undisclosed","Log Number":"US-01232010-0004","map":"<A HREF = \"http://maps.google.com/maps?q=44.270141,+-88.409675(21595)&iwloc=A&hl=en\"> mufon case (21595) map </A>","Region":"Wisconsin","trends":["There have been 12 other sightings in Appleton","There were no other sightings in Appleton on or around November 8th 2009","This sighting has never been favorited.",""],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/21595.html.txt","/var/www/straped/mufon/more/21595_submitter_file1__IMG_3057a.jpg","/var/www/straped/mufon/more/21595_submitter_file2__IMG_3057b.jpg","/var/www/straped/mufon/more/21595_submitter_file3__IMG_3062b.jpg","/var/www/straped/mufon/org/21595.html"],"Summary":"UFO Cloud with extreme density gliding and banking over the Fox River"}