{"divs":["Sighting DetailsHUNDREDS UFO OVER THE MATAWINI SACRED SITE (2009 SUMMER) from Astraelia: Montreal, Quebec, Canada astraelia@gmail.com visit the sacred site of Matawini: www.astraelia@piczo.com The Galactic Federation have showed up in great numbers at the Matawini site during the whole of the summer of 2009... THE FIREBALL ACROSS THE HORIZON It started with a bang so to say... It was the first night that I was there after having rented a cottage for the whole season. After having finished unpacking, I said to myself, now, I am gone to rest now and have a look outside, and then I told jokingly to myself: '' to see if I see some UFO ? '' Then I open the door to look outside, and then, right away, I see a huge ball of fire crossing at the speed of a meteorite from the right to the left of the sky, crossing the whole horizon in a split second, and following a perfectly straight horizontal trajectory !!! It left behind a bright fiery trace in a perfectly straight horizontal line that persisted a few second after the Fireball like UFO had passed and continue behind the trees. That was quite a starter ! During this summer of 2009, there was innumerable UFO showing almost every starry night . It started very progressively, every night I went to the circular landing area on the side of the road. After a few weeks of no UFO at all, then some started to appear, here and then, but in a very discrete and dissimulated manner. Then, night after night, there was more UFO that the preceding night. With the many groups of people who came visit the Matawini site for the first time in modern history, as I had expected, the UFO sighting would amplify. All these people where to some degree spiritually and UFO aware. Then, this progression in the number of sightings continued to the point, that every clear and starry night, there was an almost constant flow of UFO appearance, between 12 to 20 UFO appearing every nights, with a great variety of type and manner of appearance and behaviour. At a point, I had to go to sleep, but it certainly would have continued far in the night if I could have stayed outside all night. 2012 COUNTDOWN CLOCK OF UFO OVER MATAWINI SITE: I saw again the same 2012 Countdown Clock of UFO that was described in the book Blue Star Prophecy of Miriam Delicado, and that I saw in montreal a few years ago. It was almost exactly the same, a series of 6 UFO's started to appear one after the other, in a perfectly precise circular configuration representing the left side of a clock from the 6 to 12 hour. The first UFO appeared starting at the bottom and then a second one at the 7h position and another following at the 8h. then 9h. and so on until a 6th. UFO appeared in the top position of the clock for the 12th. hour, representing the year 2012. Then, I saw another UFO crossing the sky in a straight line at great speed and leaving a trace of light behind. The direction and angle of the trajectory of this UFO in the night sky, was pointing exactly toward the circular UFO Lift Off area that is located further away on the side of the road, and that is located where the spherical stone appeared in a powerful lightning strike spiritual experienced that happened with my girlfriend as we were coming back from a visit to the sacred cave of Matawini... The very numerous UFO presence at the site, for the first summer, tells me that the Galactic Federation is now very aware of the Matawini site and may have followed closely all the new discoveries that I have made. I consider their massive showing during all the 2009 summer season indicates that the Matawini site is now officially under the protection of the Galactic Federation of Light. This is some real good news. I now remember that I had foreseen this in my prayers and seed-visions for the future. Often I have given the permission to the Galactic Federation to use the sacred site as a safe harbour for them, and that as an ambassador of the aware civilization of Earth, I called for their Armada to come in great number and use this sacred site as they see fit for their operations. They again have answered my call and prayers. UFO FAREWELL MESSAGE RECEIVED THE LAST NIGHT AT MATAWINI: The last night at the Matawini cottage, just after I finished packing the car and I was ready to go back to montreal, I then lifted my head to the stars and asked: '' Will you come pick me at the Matawini landing site before the hard times start rolling, so I can continue my mission after 2012 ?'' and then, right away, instantly a UFO showed up clearly as an answer to my question, a positive one. Then I asked: '' Will you pick me up at the parc close to where I live in montreal where a crop circle appeared when the Blue Katchina Comet exploded in size, if I am there when things start to go difficult and I cannot surviv, and again immediately another UFO showed, in a positive answer. I feel it is the best possible outcome so my knowledge about the important discoveries that have been made at the Matawini site is not lost, and that they can be fully put to contribution during and after the ascension of 2012. (The 3 PHOTOS annexed to this report, are of some of the megalithic Dolmens that I have discovered on the Matawini sacred site during the 2009 summer season. These Dolmens are very ancient, and have been sculpted and brought on the Matawini sacred site by Celestrials civilizations, advanced spiritual extraterrestrial civilizations during an ancient colonization area of this planet. ) May the Great Spirit sun shine in our hearts Astraelia"],"Region":"Quebec","files":["/var/www/straped/mufon/html2text/21608.html.txt","/var/www/straped/mufon/more/21608_submitter_file1__Astrea----Stonehenge.jpg","/var/www/straped/mufon/more/21608_submitter_file2__ASTREA-DOLMEN-22.jpg","/var/www/straped/mufon/more/21608_submitter_file3__ASTREA-DOLMENUFO.jpg","/var/www/straped/mufon/org/21608.html"],"Sighting Duration":"Undisclosed","Tags":"City","Log Number":"CA-01242010-0001","map":"<A HREF = \"http://maps.google.com/maps?q=45.51732,+-73.545692(21608)&iwloc=A&hl=en\"> mufon case (21608) map </A>","Object Shape":"Sphere, Star-like","Summary":"HUNDREDS UFO OVER THE MATAWINI SACRED SITE (2009 SUMMER)","Country":"Canada","Object Features":"None","Longitude":"-73.545692","City":"Montreal","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around August 31st 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Date Submitted":"01/24/2010 12:16 UTC","Case Number":"21608","Latitude":"45.51732","Object Flight Path":"Stationary","Source":"MUFON","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Date of the Event":"08/31/2009 12:00 UTC"}