{"Tags":"City","Region":"Idaho","Weather Factors":"Unknown","divs":["Sighting DetailsIn the book Bible Code II author Michael Drosnin interviewed Israelimathematician Elihayu Rips who used a computer program to search for hidden skipcodes in the Hebrew Torah. What he found is astounding. One of the itemslisted is that the vehicle that brought our DNA to earth is buried between theruins of the city of Mazra and Lisan on the banks of the dead sea in Jordan.It gets better, we, all of us are being tested, we must acheive world peace andthen use our knowlege to stop the SwiftTuttle comet from hitting the earth in2126. In 2005, a biological attack will hit Israel and Japan and a year later,both countries will suffer a nuclear attack. This will occur in associationwith the assassination of Yasser Arafat by Hamas. If this occurs, we will havefailed the test and by 2012, two thirds of the earths population will be dead. buried along with the vehicle that brought our DNA to earth are two obilisksmade of a metal that can withstand the salt of the dead sea. On these obilesksare contained the key to expand the code to reveal the information we need tosave ourselves. These obilesks and the vehicle need to be dug up. Right now,no one is bothering to look and time is running out. To know more, read BibleCode and Bible Code II by Michael Drosnin. One other thing, the first book waswritten in 1997. It says that the space shuttle Columbia would crash and thatall Israel will mourn. In 1994, Drosnin and Rips warned Yithak Rabin that hewould be assassinated in 1995. Yitzhak did not heed the warning and wasassassinated in 95, the name of the assassin Amir was next to Rabins in theTorah. You just got to see it to believe it. Then we need to get thoseextraterrestrial objects dug up and figured out. The end really is near, if wesit on our butts."],"Case Number":"2160","files":["/var/www/straped/mufon/html2text/2160.html.txt","/var/www/straped/mufon/org/2160.html"],"Summary":"The Vehicle that brought our DNA to earth.","Disposition":"Hoax","Object Features":"Undisclosed","Sighting Duration":"01:59:00","trends":["There have been no other sightings in Lisan and Mazra Ruins","This sighting has never been favorited."],"Log Number":"","Latitude":"44.068202","Object Flight Path":"Unknown","Object Shape":"Unknown","Date of the Event":"12/01/1993 12:00 UTC","Date Submitted":"12/01/1993 12:00 UTC","City":"Lisan and Mazra Ruins","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.068202,+-114.742041(2160)&iwloc=A&hl=en\"> mufon case (2160) map </A>","Longitude":"-114.742041","Viewing Distance":"Unknown"}