{"files":["/var/www/straped/mufon/html2text/21615.html.txt","/var/www/straped/mufon/more/21615_submitter_file1__DSC_0001.JPG","/var/www/straped/mufon/more/21615_submitter_file2__DSC_0002.JPG","/var/www/straped/mufon/org/21615.html"],"Sighting Duration":"Undisclosed","Summary":"The oddest thing in the sky I've ever seen!","Date Submitted":"01/24/2010 06:47 UTC","divs":["sighting detailsi was cleaning off the deck on january the 18th of 2010 near 6:30 pm when i noticed toward the east\\southest that there was a very bright light. since i know little about astronomy i guessed it was something like mars or jupitor. there was little cloudcover just wind. i just dismissed it then looked up about 5 minutes later and it was much bigger and brighter. i knew it wasn't a star or planet and it didn't have a blinking light like every other airplane that goes over the house so i knew something was off. it looked like it was starting to morph into something else so i ran in and first got my camcorder and took a short look at it. weather and my health was not on my side. my camcorder would zoom in onto it but the wind was blowing, my hands we shaking, and it was moving at a pretty fast pace so i just couldn't get a good shot. i then decided to get my camera and took a few pictures. the first one looks kind of like a flying saucer. the other one shows how it morphed into a triangle like object. the colors at first was white, then yellow, then red, then orange, then green. it might as well been a flying rainbow. i know the quality is not the best but under those conditions, i was pleased and surprised to be able to even get anything on camera seeing as the camera doesn't work well at night (or i just suck at operating it, probably the latter). it was flying at around the same speed as a standard aircraft but was much bigger and lower. there was also no noise so that was really creepy. it took only about 10 minutes from going from one horizon to the other to lose sight of it. mt. judea has had several weird sightings before. we have c-130s from jacksonsville afb flying over a lot and some a-10 warthogs from fort smith. since we're near the highest point in the ozarks it is a great traing spot for the military to train for conditions in afghanistan. we've also had ch-47 helicopters fly over as well. i knew that this was not any of them. whatever it was, it took a lot of know how to build. i hope this helps in the quest for the truth. thanks again!"],"Country":"United States","City":"Mt. Judea","Case Number":"21615","Object Flight Path":"Undisclosed","Region":"Arkansas","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.925596,+-93.058174(21615)&iwloc=A&hl=en\"> mufon case (21615) map </A>","Disposition":"Insufficient Data","Weather Factors":"Unknown","Longitude":"-93.058174","Object Shape":"Circle, Disc, Star-like, Triangle","Object Features":"Undisclosed","Tags":"City","Source":"MUFON","Date of the Event":"01/18/2010 06:18 UTC","trends":["There have been 3 other sightings in Mt. Judea","There were 2 other sightings in Mt. Judea on or around January 18th 2010","This sighting has never been favorited.",""],"Log Number":"US-01242010-0008","Latitude":"35.925596"}