{"City":"Calgary","Weather Factors":"Unknown","Summary":"largest meeting of embassador's an king's from acroos the solar system in cluding GOD,JESUS,MY ANGEL,ALL THE ALIENS ECT.","Case Number":"21626","Longitude":"-114.051642","files":["/var/www/straped/mufon/html2text/21626.html.txt","/var/www/straped/mufon/org/21626.html"],"Country":"Canada","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around May 14th 2006","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=51.04744,+-114.051642(21626)&iwloc=A&hl=en\"> mufon case (21626) map </A>","Latitude":"51.04744","Object Features":"Dome, Window(s), Patterned Surface, Insignia, Wings, Other, Unknown","Viewing Distance":"20 Feet or Less","Disposition":"Hoax","Tags":"City","divs":["sighting detailson may 14 2006 i was on a road trip with my girl kim an her room martina.we were on highway 24 south west of blakkie. i was eating chips an talking then i felt the sofest feathers ever the next thing i know i was not in the truck no more i was in the wing of my angel. one min into the flight i felt a steady viberation from my tail bone to the center of my face,i was now in free flight i flew around an meet everybody that was their. i was brought before jah\\allah\\god an his council of embassadors an kings. i was then taken under the new covenant of jah\\allah\\god and appointed an embassador an king in waiting,( psalms 91 )i have all the skulls,(the chrystal skull)(the roman skull)(the mummy skull)(the black skull)(the white skull)(the gray alien skull)(the spanish soldier skull)(the cow skull)(the blue whale skull)(the dolphin skull)(the silver back gorilla skull)(the cow skull)(the goat skull)(the indean skull)( the kings skulls an more. i have the only real photo of jah\\allah\\god and jesus at his right hand,an my angel that bears the staff,the cross,and the scroll that i view an have a copy. my angel stands over twenty thousand feet tall. anyway no small talk ill send you a photo or two.i have the largest ufo jump on flim of the arival of everyone....... i have been to the following the mayores office\\the army\\to churches\\the media\\to the common man an beyond so here i am talking to you. you tell me\\"],"Object Shape":"Blimp, Boomerang, Bullet, Missile, Cigar, Cone, Chevron, Circle, Cross, Cylinder, Diamond, Disc, Egg, Flash, Oval, Saturn-like, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle, Other, Unknown","Log Number":"CA-01242010-0019","Date Submitted":"01/24/2010 08:27 UTC","Date of the Event":"05/14/2006 03:30 UTC","Region":"Alberta","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown"}