{"Tags":"City","Object Flight Path":"Undisclosed","Date Submitted":"01/24/2010 05:31 UTC","trends":["There have been 21 other sightings in Little Rock","There were no other sightings in Little Rock on or around January 17th 2010"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/21623.html.txt","/var/www/straped/mufon/org/21623.html"],"Summary":"Sound only.","Longitude":"-92.288585","Case Number":"21623","Region":"Arkansas","Source":"MUFON","Object Shape":"Unknown","Date of the Event":"01/17/2010 12:00 UTC","Log Number":"US-01242010-0016","Sighting Duration":"Undisclosed","Country":"United States","City":"Little Rock","Weather Factors":"None","divs":["Sighting DetailsAt around noon I was working inside a warehouse when I heard an unusual roar. I am in an area that has and Air Force base to the North (LRAFB) and an Arkansas National Guard station. I am a fan of air shows and can generally identify an aircraft by the sound it makes. C-130 and Blackhawk helicopters are the norm for this area, although we have an occasional visit by an A-10 warthog and once I heard the distinctive sound of an Osprey going over. I learned that sound by visiting the Marine Corps Naval Air station at Camp Lejuene North Carolina. The day this occurred, I knew it was something unusual. It sounded to me like whatever it was was flying very low and I went outside to look. Oddly, even though the sound was reverberating, I could not spot what it was and gave up after a minute of staring at the partly cloudy sky. That evening, a good friend of mine called to tell me she had seen a trio of B-2 stealth bombers flying over North Little Rock, very high up, and trailed by something unusual that seemed to swing in a pendulum-like fashion behind the planes. I immediately suspected what time this took place and after she confirmed it, I wished desperately that I had tried harder to get a glimpse. I have known this person for over 25 years and I know her to be exact and meticulous in everything she does and says. I have heard a stealth bomber bofore, but never this loud. Unless there was something unusual about the weather conditions that magnified the sound of these three planes, then there should not have been that much of a rumble from them at the height she was describing. I truly wish that I had taken more time to see what it was that was trailing them. Perhaps that is the explanation for the loudness of the sound. I can tell you that it was so pervasive that I could not pinpoint a direction to look for them and knowing now where her vantage point was and where they actually flew, I can state that it was NOT anywhere near the direction I was assuming. I was searcing standard flight paths that the local bases tended to take. I would be most interested to hear if anyone else saw or heard anything ususual on that day."],"Disposition":"Unknown","Latitude":"34.754861","map":"<A HREF = \"http://maps.google.com/maps?q=34.754861,+-92.288585(21623)&iwloc=A&hl=en\"> mufon case (21623) map </A>"}