{"Tags":"City","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around November 23rd 2010"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.269023,+-97.736791(21621)&iwloc=A&hl=en\"> mufon case (21621) map </A>","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Unknown","Weather Factors":"Unknown","Date Submitted":"01/24/2010 03:04 UTC","Sighting Duration":"Undisclosed","Latitude":"30.269023","Date of the Event":"11/23/2010 12:00 UTC","City":"Austin","Region":"Texas","Country":"United States","files":["/var/www/straped/mufon/html2text/21621.html.txt","/var/www/straped/mufon/org/21621.html"],"Summary":"Bright white lights flying over Austin","Disposition":"Unknown","Case Number":"21621","Log Number":"US-01242010-0014","divs":["sighting detailslast night, between 7-8pm, my friend and i observed two brilliant white lights, one moving s\\sw, the second light moving e\\ne. the first light seemed to be in the upper atmosphere or perhaps in earth's orbit. it appeared to be moving at the same rate of speed that satelites appear to be moving when viewed from earth. i noticed it because it was, briefly, about three times as intense as the other stars in the sky. as soon as i noticed it, the light began to dim out and was no longer visible within a 2-3 second period. a moment later another bright light moved over us, this one much brighter, apparently moving faster, and apparently much closer to the ground. there were no other lights on it, and what we saw could'nt have been the headlight of a plane (theyve gotten so bright these days). the second light was highly visible as it moved toward the horizon, and dimmed out abruptly rather than fading away. i have observed similar lights in the night sky in texas, oregon, and colorado over the years. i have also viewed shooting stars that move in sort of zig-zag patterns over austin."],"Longitude":"-97.736791"}