{"City":"Goleta","Source":"MUFON","Longitude":"-119.822469","trends":["There have been 7 other sightings in Goleta","There were no other sightings in Goleta on or around January 17th 2010","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","divs":["Sighting DetailsI was taking a video portrait of a woman at the beach for 10 seconds when an interesting light appeared in the left, continues to travel slowly to the right and then disappears. Not sure if it is an airplane in the rain clouds. What is interesting to me is the light has to be fairly close to be seen through the clouds. The high of it is lower than an airplane would be flying, unless it was approaching the santa barbara airport, however I did not see any lights like this in my other footage. I also have another event that happened about a month ago, I was working in my garden in the evening and something made me look up, when I looked up at the hillside next to me I saw a large light moving fast for about the length of a hand in measurement when looking at the sky. After that the light disappeared, I got the feeling as if it were cloaking itself. The size of it was similar to a full moon, definitely a large object, and it was moving upward in the sky, which also seemed important. The edges were sharp, and it did not seem like light was emitting out from it, almost like someone put a sheet over it."],"files":["/var/www/straped/mufon/html2text/21631.html.txt","/var/www/straped/mufon/org/21631.html"],"Sighting Duration":"Undisclosed","Object Shape":"Sphere","Log Number":"US-01242010-0024","Date Submitted":"01/24/2010 11:00 UTC","Object Features":"None","Country":"United States","Case Number":"21631","Tags":"City","Date of the Event":"01/17/2010 12:00 UTC","Disposition":"IFO","Viewing Distance":"Over One Mile","Latitude":"34.438659","Summary":"orb/ufo appears in left corner of video during documentary portrait","map":"<A HREF = \"http://maps.google.com/maps?q=34.438659,+-119.822469(21631)&iwloc=A&hl=en\"> mufon case (21631) map </A>","Object Flight Path":"Path then hovering","Region":"California"}