{"Date of the Event":"01/24/0001 09:10 UTC","Region":"Washington","Log Number":"US-01252010-0003","Summary":"Two spherical glowing orbs flaoting in the sky then tried to follow then dropped INTO the trees!","files":["/var/www/straped/mufon/html2text/21636.html.txt","/var/www/straped/mufon/org/21636.html"],"Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Other","Object Shape":"Cone, Triangle, Other, Unknown","Disposition":"Unknown","Longitude":"-122.581196","Date Submitted":"01/25/2010 01:31 UTC","Latitude":"48.854219","Tags":"City","City":"Ferndale","Case Number":"21636","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been 4 other sightings in Ferndale","There were no other sightings in Ferndale on or around January 22nd 0001"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.854219,+-122.581196(21636)&iwloc=A&hl=en\"> mufon case (21636) map </A>","Object Features":"None","divs":["sighting detailswe were driving home from a party, within five minutes, my brother and i spotted two orbs floating in the sky. we turned around to keep watching them but by that time they were in front of us. we then followed the light and as we approached a hill, we saw the object start lowering into the trees, when it did, it started brightening up way more than at the beginning. it almost looked like it had been many crafts? like a christmas tree ship\\ships? when we got to the top of the small hill, the object was gone. we drove up and down the road again to see if we could find it. there is no possible way this object could have been an airplane because we watched it descend into the trees. also, from where we were, the airport would have been a good 5 miles behind us is and is to the west and it lowered ahead due south of us.if it was a plane, we would have seen it circle back around to go to the airport. we tried to go look for it, but it had disappeared. our family was skeptical at first that it was anything, but when it approached us, we were all scared. especially my dad who has seen an upclose ufo on this road. please contact us if you have any questions."],"Source":"MUFON"}