{"Disposition":"Insufficient Data","Date of the Event":"01/25/2010 06:40 UTC","Log Number":"US-01252010-0012","Object Shape":"Cylinder, Disc, Oval","Case Number":"21645","Object Features":"Dome","Latitude":"41.210652","Tags":"City","divs":["Sighting DetailsFirst off, I would never usually believe in this type of thing but I'm in awe of what I saw tonight. Coming home from work, I took the PA turnpike ramp from the Willow Grove Mall area so I beleive it would be Montgomery County? Once on the turnpike for a few minutes I saw in the distance two bright white lights. It caught my eye and I remember thinking why a plane was flying so low to the ground. I was driving straight towards the light and noticed it was getting closer and not flying away. As I was getting closer I noticed that I wasn't a plane at all and that it wasn't moving just hovering!!! The part of the turnpike I was on was in the middle of a valley so trees lined both sides of me. This object was to my left side above the tree line with the bright lights just hovering. I was trying to get a close look without wrecking. It wasn't a helicopter just a very large saucer object. The rest of traffic was slowing down as well to get a look too. So I'm sure there are many other reports of the sighting. The faces of the drivers around me were just as perplexed. This happened right before the road splits to take 476 or the Allentown ramp. By the time I took the ramp I lost sight. Again this is something I would typically never take the time to write about but I truly feel that I have seen an unidentified flying object!!"],"Longitude":"-77.186235","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"01/25/2010 09:32 UTC","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","Summary":"typical flying saucer shape with two very bright white lights","City":"Undisclosed","trends":[],"files":["/var/www/straped/mufon/html2text/21645.html.txt","/var/www/straped/mufon/org/21645.html"],"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=41.210652,+-77.186235(21645)&iwloc=A&hl=en\"> mufon case (21645) map </A>"}