{"Region":"Florida","City":"Ocala","Date of the Event":"01/25/2010 08:00 UTC","Date Submitted":"01/25/2010 09:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.192429,+-82.137492(21644)&iwloc=A&hl=en\"> mufon case (21644) map </A>","Longitude":"-82.137492","Summary":"Cool quiet evening and clear skys. Observation east over the Ocala National Forest bombing range and viewed of UFO.","Source":"MUFON","trends":["There have been 21 other sightings in Ocala","There were no other sightings in Ocala on or around January 25th 2010"],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Other","Object Features":"Dome, Other","files":["/var/www/straped/mufon/html2text/21644.html.txt","/var/www/straped/mufon/org/21644.html"],"Tags":"City","Country":"United States","Log Number":"US-01252010-0011","Latitude":"29.192429","Object Shape":"Other","Case Number":"21644","Weather Factors":"None","Disposition":"Unknown","divs":["Sighting DetailsObserved one very large saucer shaped object traveling from NW to SE at around 1pm. No flashing lights and no sound. Just a brilliance of gold in the afternoon sun. No eradic behavior. Then, another observed at 8pm. Traveling from S to N, flashing lights of green, blue, orange, red and brilliant white. Saucer with dome on top and a long tail behind carrying another round orbital ship glowing red, green and white. From a distance, blackness outlined both ships including the tail. Darker than the night sky on a three quarter moon. Flying eradically, bouncing up and down, then turning to repeat, then turning again and shooting off at tremendous speed and dissapearing only approximately two miles from first location. Only to return fifteen minutes later to bounce a few more times and then speeding north westward across the sky. Two of us noticed and watched the second of these two ships. I am an avid watcher and do so every night. I am an Abductee and have been since age three. My feelings are always the same. When are they going to come for me again? Why so many years in between? Are they waiting for me to move back home? Or, have they lost interest in me now that I have gotten older?"],"Viewing Distance":"Over One Mile"}