{"Date Submitted":"03/03/2003 11:00 UTC","Object Shape":"Triangle","Latitude":"40.15511","Summary":"Saw triangle shaped crafts and discs","Viewing Distance":"21-100 Feet","City":"Levittown","Sighting Duration":"00:05:00","divs":["Sighting DetailsDriving home from my girlfriends house and in my neighborhood when I saw manycraft in the sky. So i decided to flash my headlights on and off to signal it tocome closer also trying any sort of telepathy or emotion I could send to it. Thetiming of events seemed like they were a communication of sorts from whoever orwhatever it was. Time seemed to stop and I began having thoughts about travelingat light speed and what it would be like. The objects could appear anddisappear. They even cloked themselves. It looked like other craft hadintercepted or passed them as well. At first I thought it was a helicopter but Idrove in the general direction of it and it changed direction moved closer, thenaway then closer, as my car was stoppped and my eyes open in awe. I also felt aslight headache, maybe from the radiation, I dont know. I felt powerless and inawe, my eyes even teared up for a little while. I communicated back to itthrough music. Trance music. Maybe hitting a frequency it could understand whileplaying one of my cds. I always listen to music while driving. I lost sight whenI decided to go home and it flew past my house as I drove a few blocks home fromthe field near the elementary school where it approached me. I think it wantedto make contact or maybe just study me. I dont know. Please investigate thisincident further. Thank You."],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.15511,+-74.828775(2164)&iwloc=A&hl=en\"> mufon case (2164) map </A>","Region":"Pennsylvania","Tags":"City","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around March 3rd 2003"],"Country":"United States","Case Number":"2164","Source":"MUFON","Date of the Event":"03/03/2003 11:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Unknown","Log Number":"","Object Features":"Dome, Other","files":["/var/www/straped/mufon/html2text/2164.html.txt","/var/www/straped/mufon/org/2164.html"],"Longitude":"-74.828775"}