{"trends":["There have been no other sightings in Shannon","This sighting has never been favorited."],"Country":"United States","Date of the Event":"10/10/2009 05:00 UTC","Sighting Duration":"Undisclosed","Latitude":"34.336758","Disposition":"Unknown","Tags":"City","Log Number":"US-01262010-0002","divs":["Sighting DetailsI walked onto the front porch of my house to feed the dogs when I noticed that the sky over the tree-line in front of my house was a very hazy red color. It was sometime in the early evening (around dusk I think) and I was home alone. I then noticed a triad of red glowing lights orbiting in the shape of a triangle. They seemed to outline the bottom of a craft much, much larger than an airplane in the sky. It was as if the object was very close and right above the trees. It was moving in a western direction and then disappeared behind the trees. The red haze in the sky seemed to be stronger around the object and weaker the further away from the object, as if it were emanating from the UFO. I have always been very interested in UFO's and extraterrestrial life. I remember thinking that I should go get my camera but I didn't want to miss the UFO. I also remember thinking that I had to call someone and tell them what was happening when I first spotted the UFO! I was so excited. However, all I remember is walking back into the house after watching it disappear and forgetting about it! That is the exact opposite of a normal reaction from me. In fact, I didn't even remember that it happened until a couple of days later and the entire event just came back to me. I still can't remember what I did after walking back inside. In fact, I can't remember the rest of the evening until my family came back home."],"Object Flight Path":"Hovering then path","Summary":"Red orbiting glowing triangle seen over tree-line from my house.","City":"Shannon","Longitude":"-85.071336","map":"<A HREF = \"http://maps.google.com/maps?q=34.336758,+-85.071336(21649)&iwloc=A&hl=en\"> mufon case (21649) map </A>","Weather Factors":"Windy","Object Features":"Unknown","Source":"MUFON","Region":"Georgia","Date Submitted":"01/26/2010 12:08 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/21649.html.txt","/var/www/straped/mufon/org/21649.html"],"Viewing Distance":"Unknown","Case Number":"21649"}