{"files":["/var/www/straped/mufon/html2text/21659.html.txt","/var/www/straped/mufon/org/21659.html"],"City":"St Francis","trends":["There has been one other sighting in St Francis","There were no other sightings in St Francis on or around January 21st 2010"],"Summary":"A very bright light that seemed to change shape as it moved","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"21659","Object Shape":"Oval, Sphere, Teardrop","Latitude":"43.153367","Date Submitted":"01/26/2010 10:12 UTC","Object Features":"None","Log Number":"US-01262010-0012","Region":"South Dakota","Object Flight Path":"Straight-line path","divs":["Sighting Detailsat about 10:30 pm I went to a friends house and as i got to the back door ,before i knocked , a light came on in the sky to the west. I noticed it because it came on like a light bulb. It couldn't be a star because it was quite foggy and you couldn't see the sky anyway.so , it caught my eye as it lit up , then it dropped down and as it dropped it changed shape,well the light changed shape anyway. It turned to a teardrop shape as it came down to which I estimate to be about a half mile to the west of where i was standing and it was about less than a 1000 ft off the ground. So, i knocked on my friends door hoping he would answer right away so he could see what i was seeing,after i knocked i looked to see where it was, by then it was lower and coming toward me and it was rocking side to side and as it was rocking it was changing shape from round to oval. Not a sound from the light, which i thought might be a helicopter, but the fact that it was changing shape made my mind up for me. When the object started to move east, coming toward me, my sister was in the car we came in and from where she was sitting ,if she looked out the windshield she would have been able to see it. So, it was go tell her to look up or wait for someone to answer the door. by the time my friends girlfriend answered the door the object was almost right above us. While she went to go get him the object went over the house about 75-150 feet up. After it went over the house it continued east for another second or two and then went up at an angle above the fog and left a \"hole\" in the fog, so to speak. Then after the object was gone my buddy answers the door and when i got back to the car my sister was texting and wasn't even looking up. So, I guess I'm the only one that see this thing so feel free to call or e-mail i have more stories. Thanks for your time."],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Fog, Medium","Longitude":"-100.895056","map":"<A HREF = \"http://maps.google.com/maps?q=43.153367,+-100.895056(21659)&iwloc=A&hl=en\"> mufon case (21659) map </A>","Tags":"City","Date of the Event":"01/21/2010 10:30 UTC","Disposition":"Unknown"}