{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.526191,+-86.576797(21653)&iwloc=A&hl=en\"> mufon case (21653) map </A>","Disposition":"Unknown","Longitude":"-86.576797","Object Flight Path":"Path with directional change","Date Submitted":"01/26/2010 07:23 UTC","Latitude":"35.526191","Log Number":"US-01262010-0006","Case Number":"21653","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Summary":"2 oval white glowing ships and one unknown.","trends":[],"Region":"Tennessee","divs":["Sighting DetailsI was 16 visiting my aunt with my folks .Around 1700 or so I went out side to enjoy the night sky as I look up I saw two oval shape objects space apart fly straigh up, they disappeared and reappeared further up i brought my folks out to watch as they step out they saw the same obejects as i did as they did the same thing again were going straight up and disappeared from view ,they went inside and I stayed looking at the night sky for a few more mins. As I turn around to go inside there was a object over the house ,it wasnt a ufo but one of our own space craft,I look at it in detail as it had a black tip long and white with checkers circling the body of the rocket. The ship look like it was burning at the end I notice flames. it was the leaght of my aunts house but not its true size. And stars in the back ground it look to be burning up. I stood in awe just looking at it.I was not scared at all ,But felt they were telling me they were watching us . I look around but there was nothing around me nor did the ufo or the craft i was looking make any noise. I stood there until it disappeared. And I went inside and told everyone what I saw. Till this day I have search the net for this aircraft I saw I have yet to find it. I really need to know if anyone else has seen this or know of this ship I saw. I have seen my share of ufo from Tenn. to Fla. I feel this is as close of a encounter I wish to ever get with one.And still wish why they showed it to me.I have question but never recieved answers. Can you give me any thing at all!?"],"files":["/var/www/straped/mufon/html2text/21653.html.txt","/var/www/straped/mufon/org/21653.html"],"Object Features":"None","Country":"United States","Date of the Event":"05/16/1972 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Bullet, Missile, Oval, Unknown","City":"Undisclosed"}