{"Summary":"1 steadily moving object, 2 related explosion-like blooms of light near the moving object in space, no sound","City":"Jacksonville","Viewing Distance":"Unknown","Weather Factors":"None","Log Number":"US-01262010-0008","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around January 26th 2010"],"Disposition":"IFO","divs":["Sighting Detailsbetween 0615 & 0620 am, located a few miles east of NAS JAX, observed what I thought was a satellite type object in space moving southward. followed the object for 20seconds, then saw a bright white 'bloom of light' approx 6-times larger than the moving object and a good istance 'ahead of it' in space. this light bloom appeared, expanded and then faded similar to the burst of fireworks, but much faster. I kept watching and then observed a 2nd light bloom, same as the first, but in another point in the sky, again, some distance 'ahead' of the moving object. This bloom also dissipating exactly as the first one did. I had the unmistakable feeling that these had to be explosions in space of some kind. No way the light blooms could have been aircraft lights. location: in 'The Forest' neighborhood in Mandarin (suburb of Jacksonville) walking my dog. I noticed the object because I enjoy 'stargazing', have a telescope, and being near NAS JAX enjoy seeing all kinds of aircraft in the sky right over the house. IMPORTANT: while I thought I saw the moving object make a gentle turn, I could not swear to this as I was still slowly walking when I first observed it, and only after I stopped walking did I then see the event described. After the 2nd light bloom I lost track of the moving object and for me the event was over."],"Object Shape":"Unknown","Date of the Event":"01/26/2010 06:18 UTC","Case Number":"21655","Latitude":"30.333644","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=30.333644,+-81.647551(21655)&iwloc=A&hl=en\"> mufon case (21655) map </A>","Date Submitted":"01/26/2010 08:06 UTC","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/21655.html.txt","/var/www/straped/mufon/org/21655.html"],"Region":"Florida","Longitude":"-81.647551","Object Features":"Unknown"}