{"map":"<A HREF = \"http://maps.google.com/maps?q=32.226603,+-110.920919(21652)&iwloc=A&hl=en\"> mufon case (21652) map </A>","Viewing Distance":"Over One Mile","Region":"Arizona","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/21652.html.txt","/var/www/straped/mufon/org/21652.html"],"Date of the Event":"12/31/2007 11:15 UTC","Weather Factors":"None, Does Not Apply","Case Number":"21652","divs":["Sighting DetailsOn New Year's Eve of 2007 we went out on our back patio to see the fireworks residents set off. While waiting for the midnight hour, we both sighted a diamond formation in the eastern sky over Reddington Pass. (Tanque Verde Mtns.)Four brightly shining objects were positioned what we judged to be about 7 miles away form us. Our impression was that they appeared to be a thousand yards apart from each other, with the top one about 2,000 yards from the bottom one. They were brighter than any stars appearing that night and remained stationary for 40-50 minutes, all total. We had never seen such objects in the past so remained focused on them the entire time. When the diamond shape dispersed - each object went on a separate path - in various directions. The rapid speed with which they left caused them to disappear within moments. They did not return. On New Year's Eve of 2008, we went out & looked in the same, general direction & saw a similar formation. This time there appeared to be five objects. There was more movement this time as they rearranged their positions, sometimes stretching out further than the others in the diamond. We video-filmed what we could, but had no zoom on the camera so it appears as a bright mass. In 2008, we first noticed a silent, plane with only a minimum of lights on the edges - fly by very low and very close to our elevated location. Having viewed the Stealth at the Davis-Monthan Airbase (in Tucson) on more than one occasion & up very close - we were able to identify this plane as such. It was immediately after observing it's silent movement past out locale that our attention was drawn to the object formation in the eastern sky. Our curiosity rendered us immovable on the first occasion, but on the following year - we moved quickly to film it, regardless of the fact that we are both nonprofessional photographers. Not being drinkers - we were in full command of our faculities & knew we were witnessing something out of the ordinary. However, many sightings take place in AZ between Phoenix & Tucson so we weren't completely shocked. After 20 years of being Tucson residents, we have recently moved to NM."],"trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around December 31st 2007"],"Latitude":"32.226603","Object Shape":"Circle","City":"Tucson","Longitude":"-110.920919","Date Submitted":"01/26/2010 03:42 UTC","Sighting Duration":"Undisclosed","Log Number":"US-01262010-0005","Summary":"Stationary formation of 4 objects forming a diamond shape - dispersing in various directions after several minutes.","Object Flight Path":"Stationary","Country":"United States","Object Features":"Unknown","Disposition":"Unknown"}