{"Viewing Distance":"20 Feet or Less","Case Number":"21660","Region":"Missouri","Log Number":"US-01262010-0013","Object Shape":"Cigar","Latitude":"38.610302","Sighting Duration":"Undisclosed","Longitude":"-90.412518","Tags":"City","trends":["There have been no other sightings in St.Louis County","This sighting has never been favorited."],"Disposition":"Unknown","Summary":"Small silver cigar shaped/ scout class","City":"St.Louis County","Weather Factors":"None, Does Not Apply","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21660.html.txt","/var/www/straped/mufon/org/21660.html"],"Date Submitted":"01/26/2010 11:00 UTC","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=38.610302,+-90.412518(21660)&iwloc=A&hl=en\"> mufon case (21660) map </A>","Country":"United States","Date of the Event":"05/15/1973 12:00 UTC","divs":["Sighting DetailsThis sighting pertains to my mother Kathleen Ruvane Reardon Davis who lived at the address in Kirkwood in the 1970s. Upon her sighting I directed her to talk to the UFO society in St. Louis (Wash U. based?). She did go and pick out the type of spacecraft. Sadly she passed away due to cnacer in 1978. I have seen UFOs several times in this life but I wanted to tell her story. I was on active duty in the Army (Vietnam Era) so I was not present. I recieved a call from her on or about this date. Mom was frantic about this event. She was never a believer ever in UFOs. By phone and later by excamining the area she told me the following: At 6AM she always walks her Bulldog named Ladybug. SHe lived on Geyer Rd. just north of Woodbine in Kirkwood in an apartment on the east side of the road. She told me she walked out of her sliding door onto the enclosed rear patio to walk her dog in between her apartments. Apartmemnts are about 30 feet apart and the patios back up to each other. So this area is very secluded in this time of day. SHe walked ladybug out of the gate and told me she saw this object scarcely 6-10 feet away, sitting motionless about 4 feet off the ground. She hinted that she almost walked into it. Kay told me it was a grayish color with windows in the front and portals in the sides. It seemed to her to be about 10 feet across and about 20 feet long. It was silent and never gave off noise. Mom told me she was startled and scared but was also curious. So she stood watching it for several minutes. Finally, fearing that perhaps \"they' were maybe going to abduct her or worse than that, Ladybug, she backed away from it with Ladybug and went inside her apartment. It left and she never saw it again I remember that for the remaining years of her life she always kept a kodiak instant camera next to her bed and carried it with her when she walked Ladybug. I have always felt afinity with extrerrials since I was a small chld. I have my reasons. I can't help believing that her health condition had something to do with \"their\" visit. Not for bad, but for good.She was diagnosed with cancer not long after and even went into remission for awhile. I am certian she knows the truth about the visit now..."],"Object Features":"Window(s)"}