{"Object Flight Path":"Stationary,Other","Sighting Duration":"00:00:45","City":"Hinzweiler","divs":["Sighting DetailsMy girlfriend and I were walking home from the nearby woods to my house just at twilight. As I passed a small clearing in the trees to the east I saw two bright stars in my peripheral vision just as I walked passed a tree that obscured the view8 that seemed odd. I stopped my girlfriend and we walked back a few steps so I could see it and point it out, there was a line connecting the two \"stars\" that started to fade. these were low on the horizon just above a hill. I never noticed any bright stars in that direction, and definitely not two so close together and so intensely bright. Within seconds of looking at it, the line of light that was connecting the two 'stars' began to fade, much like when the flash for a camera leaves a bit of a visual imprint in your eyes for a short while after seeing the flash. After that the star on the right side faded in the same manner, the the star on the left side faded shortly after wards. It happened fairly quick, less than a minute I would estimate. We had no idea what it was and continued to walk home. A strange thing about it was that it was almost like we had forgotten seeing it and it was hours later while we were at home I suddenly thought about it again. My girlfriend and I said nothing to each other as to what we both saw, only something along the lines of \"what is that?\" - I asked my girlfriend to describe to me what I saw to make sure my eyes weren't playing tricks on me and she described exactly what I recalled and described. I have no idea what it was, I live about 35 kilometers from Ramstein Air Force Base and see aircraft occasionally in the area, but this was definitely not any sort of plane, jet or aircraft I have ever seen. It made no sound and didn't appear to move other than just fading away in 3 steps. I also recall the sky being very clear that night and the moon was near full and already out, but still a bit of light in the sky from the setting sun. Attached is a photo I took from the exact location of the area where I saw this occur, the photo was taken 25 January 2010 so the trees are much more bare now and not obstructing any view of the sky as it was in the late fall."],"Region":"Rheinland-Pfalz","files":["/var/www/straped/mufon/html2text/21666.html.txt","/var/www/straped/mufon/more/21666_submitter_file1__250120101375.jpg","/var/www/straped/mufon/more/21666_submitter_file2__250120101375.jpg","/var/www/straped/mufon/org/21666.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=49.591875,+7.548439(21666)&iwloc=A&hl=en\"> mufon case (21666) map </A>","Date Submitted":"01/26/2010 03:03 UTC","Object Features":"Other","Object Shape":"Cross, Sphere, Star-like","Disposition":"Unresolved","trends":["There have been no other sightings in Hinzweiler","This sighting has never been favorited."],"Source":"MUFON","Summary":"2 lights like very bright stars attatched with a line of light","Date of the Event":"10/31/2009 05:00 UTC","Tags":"City","Country":"Germany","Latitude":"49.591875","Longitude":"7.548439","Weather Factors":"None","Viewing Distance":"Unknown","Log Number":"DE-01262010-0019","Case Number":"21666"}