{"Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","trends":["There have been 10 other sightings in Hattiesburg","There were no other sightings in Hattiesburg on or around January 25th 2010"],"files":["/var/www/straped/mufon/html2text/21669.html.txt","/var/www/straped/mufon/org/21669.html"],"Longitude":"-89.282219","Log Number":"US-01262010-0022","Object Shape":"Sphere, Star-like","Case Number":"21669","Country":"United States","Weather Factors":"None","Date of the Event":"01/25/2010 06:00 UTC","City":"Hattiesburg","Date Submitted":"01/26/2010 04:23 UTC","Object Flight Path":"Straight-line path","Summary":"While watching ISS a round object appeared, went 15 degrees & vanished","Object Features":"None","Sighting Duration":"00:00:04","map":"<A HREF = \"http://maps.google.com/maps?q=31.332119,+-89.282219(21669)&iwloc=A&hl=en\"> mufon case (21669) map </A>","Region":"Mississippi","Latitude":"31.332119","Tags":"City","Source":"MUFON","divs":["Sighting DetailsMy wife and I have watched the sky together for 25 years. Before I met her I did amateur astronomy for many years. We like to watch all kinds of celestial phenomena and particularly enjoy watching ISS transit because it is SO big: quite an impressive sight. My wife and I were watching the ISS transit over our house yesterday about a little after 6:00 PM. The sky was clear and the temp was about 61 degrees. The ISS appeared in the North Western sky headed to the SE. As the ISS approached it's maximum elevation an orange red dot with the apparent diameter of the head of a pin held at arms length suddenly appeared. It was in the same part of the sky as ISS which had come from the NW and was now falling away toward the SE and the object was separated from the station in the sky by about 20 degrees. It was going from South to North. It was about magnitude +1 because although it was bright it was no where near as bright as ISS which was about -3. Also ISS looked golden in color and was really shiny reflecting the sun's light off its solar arrays. This thing was a somewhat less bright orange dot moving at about the about the same apparent speed as ISS and NOT blinking or making noise of any kind. We were thrilled to see what was apparently another spacecraft (which appeared to be) moving in low earth orbit over our house at the same time as the ISS. The object moved approximately 15 or 20 degrees through the sky and disappeared. It winked out just like someone turned off a light switch. The whole sighting lasted about 4 seconds if that long. We were both really puzzled. That shouldn't have happened. If the object was in orbit we should have observed it for somewhat longer than 4 seconds. This did happen at sunset which might explain the orange glow of the object. Objects in orbit frequently look orange at sunset or sunrise because they are reflecting the colors of the sunset or sunrise from above the atmosphere. It didn't look like pictures of \"iridium flares\" I have seen either although those are pretty cool and last about as long as this did. Still iridium flares, which occur when sunlight reflects off the solar power arrays on orbiting iridium satellites, do not look like orange dots. They appear grow bight then disappear. Still I checked the Heaven's Above website to see if any were visible from our house at that time. None were scheduled for our area until the next day. We discussed the possibility that it might have been a fireball but fireballs look like fireballs not like a round, orange, something-or-another in orbit. The color was wrong for a fireball too. They are orangy-red or green or occasionally blue. Anyway the ISS drifted on off to the Southeast and faded away as it went into the earth's umbra and we were left there wondering what we saw. One more thing....the ISS passed into the umbra going SE. What we saw couldn't have disappeared into the umbra because it disappeared when it was almost overhead. If anyone else saw this I would love to know."]}