{"Object Features":"Unknown","Viewing Distance":"Over One Mile","Weather Factors":"None","Object Flight Path":"Hovering then path,Straight-line path","Summary":"Flame colored object, multiple sightings, emitting smaller controlled objects","Region":"New Mexico","divs":["Sighting DetailsI was looking NE, over my garden wall, toward and over the Organ Mountain Range, which borders the White Sands Missile Test range, but what I saw cannot be explained by a missile test, AND locally whenever they are testing they close down the HWY 70 so that no one is endangered. Specifically, I was letting my dog back in, and saw a series of stationary fireballs that were so bright, I at first wondered if I were about to witness a boloid or other meteoric event. It was bright enough to clearly stand out and be both brighter and larger than sodium vapor streetlights, which were also in my field of view, and at least 10 degrees above the horizon, which would have put it above my view of the mountain range. I saw 3 or four flashes like this, the orange color of flame, then it went out. I let the dog back in, and on a whim, because I was curious, I went back outside to see what else I might see. When I went back out, slightly more north, I saw what looked like two fireballs, or stationary jet boosters, side by side, and that object, whatever it was, was stationary like the other fireball looking thing. It let out a smaller set of objects, which were also flaming and curved beneath the larger object, and out of view. I witnessed this twice, then the flare went out. At this point, I tried to go get my tripod and my video cam, but I couldn't get the settings right to see anything, apparently, on review of the video. I watched for about another half hour, and just as I was going to call it a night, I saw a series of 7-8, well, fire flares, as if an object was travelling laterally in the sky, and having an engine set on fire. short, very short bursts of flame. The object was just past due north now, headed from the south to the north north west. I did not see it again. I will allow that, being so close to a military base, it may have been training exercises, but there was no sound, there was no road closure which they do all the time when testing, and nothing showed up today in the local media. I don't know what to think."],"files":["/var/www/straped/mufon/html2text/21675.html.txt","/var/www/straped/mufon/org/21675.html"],"City":"Las Cruces","Longitude":"-106.758692","Object Shape":"Egg, Fireball, Flash","Latitude":"32.336032","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.336032,+-106.758692(21675)&iwloc=A&hl=en\"> mufon case (21675) map </A>","Tags":"City","Sighting Duration":"00:20:00","Disposition":"Unknown","Date of the Event":"01/26/2010 07:15 UTC","Log Number":"US-01272010-0001","trends":["There have been 24 other sightings in Las Cruces","There was one other sighting in Las Cruces on or around January 26th 2010"],"Country":"United States","Date Submitted":"01/27/2010 12:37 UTC","Case Number":"21675"}