{"Region":"Virginia","Log Number":"US-01272010-0004","Date Submitted":"01/27/2010 02:32 UTC","City":"Lynchburg","Sighting Duration":"00:10:00","Viewing Distance":"Unknown","Latitude":"37.413754","Date of the Event":"01/26/2010 11:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.413754,+-79.142246(21678)&iwloc=A&hl=en\"> mufon case (21678) map </A>","Case Number":"21678","divs":["sighting detailswhile out side smoking i like to look up at the stars. i saw some thing very very out of place! i saw a neon blue\\white lite flickering so i watched it to see if it was a plane but it never moved!the lights went out then it started flashing a rang of colors red,orange,and neon yellow that lasted approxmatly 1-2min. it then went dark and the blue\\white light came back. i know it wasnt a plane because there was no sound or movement. i have been looking for it for a few weeks some times it stays a red\\orange then sometimes its the blue\\white.i have been seeing the lights off and on for about a month. the most recent was tonight.it is always in the same spot. which is above the train tracks and\\or the james river. i was shocked to see a ufo that close to home.after i finished smoking i went back inside and thought nothing more about it. ufo's and the idea of alien life it not a fary tale god made the whole universe and we are but a small part of it and when the aliens decid to make contact with us i hope they come in peace!!!"],"Summary":"glowing blue/white light that changes to a orange red flashing light","Source":"MUFON","Weather Factors":"None","Object Shape":"Flash, Sphere, Star-like","trends":["There have been 3 other sightings in Lynchburg","There were no other sightings in Lynchburg on or around January 26th 2010"],"Country":"United States","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/21678.html.txt","/var/www/straped/mufon/org/21678.html"],"Tags":"City","Longitude":"-79.142246","Object Features":"Unknown","Disposition":"Unknown"}