{"Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Case Number":"21673","files":["/var/www/straped/mufon/html2text/21673.html.txt","/var/www/straped/mufon/org/21673.html"],"Source":"MUFON","Country":"Canada","Date Submitted":"01/26/2010 09:05 UTC","Disposition":"Unresolved","Object Shape":"Unknown","Region":"Ontario","Sighting Duration":"Undisclosed","City":"Bowmanville (east of Toro","Tags":"City","Latitude":"51.257325","Date of the Event":"05/10/1994 12:00 UTC","Summary":"My husband and I both saw whatever this was hovering just over the trees above us.","divs":["Sighting DetailsTo start; we are educated people, previous UFO non-believers and have only told a few people about this. We were driving home, we lived on a country road which is very dark with no street lights. My husband was driving in his car with the top down and I was behind him in my car. We approached our home when all of a sudden the entire area was glowing in light. When I looked up all I could see was large metal panels with what appeared to be huge bolts. This thing was hovering just above the trees and was so close. We stopped our cars, stuck our heads out and looked up trying to figure out what it was. My first thought was it must be a huge plane that was going to crash but it wasn't moving and there was no sound of any motors. It was so large we couldn't see where it ended because we were directly under it and so close. We don't remember much else about that night. I think we were both in shock and our brains just couldn't identify it. We both don't remember how it went away. We live close to a nuclear plant so we were wondering if maybe it was attracted to the area. It bothers me to this day, and I can't stop thinking about it. I'm only writing to you so I can hopefully find a similar case so I can find people that experienced what we did."],"trends":["There have been no other sightings in Bowmanville (east of Toro","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.257325,+-85.321004(21673)&iwloc=A&hl=en\"> mufon case (21673) map </A>","Object Flight Path":"Other","Object Features":"Other","Log Number":"CA-01262010-0026","Longitude":"-85.321004"}