{"Country":"United States","Disposition":"Unknown","Source":"MUFON","Date Submitted":"01/27/2010 03:59 UTC","City":"Burns","Sighting Duration":"Undisclosed","Region":"Oregon","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.590231,+-119.044413(21679)&iwloc=A&hl=en\"> mufon case (21679) map </A>","Log Number":"US-01272010-0005","Object Flight Path":"Path with directional change","divs":["sighting detailson january 22, 2010 @ around 18:35 hrs my friend and i stepped outside as she was leaving to go home. i was on my porch and she went down the steps onto the grass and we were talking and i kept watching her and she was staring at something in the sky. i asked her what she was looking at and she said, \"just wondering what the hell that is\". i came down the steps and turned to look over the top of my house and this brillant luminous lighted cylinder, almost a sideways bowling pin shape if you will was just floating over the house from the north to the south end of the county. we kept watching it and she remarked how fast it was going that it couldn't be a plane and no noise, to which i replied that there are no blinking lights or wings to it and that it was as if it was floating\\gliding, and yes it was that close probably around 4-5000 feet up under the clouds (sky was cloud covered that night)- we watched it until we could no longer see it anymore. if i was to compare it to something at arms length would be an large pink eraser. i told my friend it was probably a ufo as there has been several reports of them in oregon and that i've reported several myself for the county. i felt excited about seeing it and wondered where it might be going -"],"Summary":"Brillant White Cylinder Object","Tags":"City","Object Shape":"Cylinder","Case Number":"21679","Viewing Distance":"Unknown","Date of the Event":"01/22/2010 06:35 UTC","trends":["There have been 8 other sightings in Burns","There were no other sightings in Burns on or around January 22nd 2010"],"Latitude":"43.590231","Object Features":"Undisclosed","Longitude":"-119.044413","files":["/var/www/straped/mufon/html2text/21679.html.txt","/var/www/straped/mufon/org/21679.html"]}