{"Summary":"the first object was square with poles in the top, the second was triangular.","trends":["There have been 20 other sightings in Savannah","There were no other sightings in Savannah on or around April 30th 2008"],"Disposition":"Insufficient Data","Country":"United States","Weather Factors":"None","Object Features":"Appendage(s)","Tags":"City","Region":"Georgia","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/21676.html.txt","/var/www/straped/mufon/org/21676.html"],"Latitude":"32.093401","divs":["Sighting DetailsI am contacting you because I saw your program \"Bucks County Flap\" about all the sighthings in Pennsylvania in 2008. Cliff Thomas' description exhilerated me because I thought no one could have seen the same type of UFO as I had seen that night. It was very unusual, but he is telling the truth. I know because I saw the same UFO and I saw a secondary UFO that seemed to come from the primary. I contacted the Air Force as I didn't know who else to inform. Nothing happened. But I KNOW what I saw, and I know what Cliff Thomas saw in Bucks County PA. I was sitting in my driveway looking at the moon through my telescope. It was about 11pm in the summer. I saw something square with a lot of poles coming out from the top of it. It was visible only against the moon. I blinked only for a second in disbelief. Then it was gone. A second later I saw a triangle shaped object coming from the location where I had just seen the first object. It flew in a very purposeful smoothe manner right across my telescope. It too was illuminated only against the moon. I reconciled myself to the fact that I had seen a satellite, and a stealth fighter or bomber. But my husband worked on the stealth when he was in the Air Force. And of all the photos I have seen of stealths, day and night, near and far, at every angle possible, what I saw was NOT a stealth. As far as the first or primary object I was perplexed. What kind of UFO would have pole like structures coming out of the top of it. That was until I and saw your depiction of Cliff Thomas' UFO. Then I knew what I had seen, and I don't feel crazy, hysterical, or confused, as some people I have told suggested. I feel vindicated! Thank you Mufon for that program. Thank you Cliff Thomas for being brave enough to say what you saw and render a chilling animated depiction."],"Object Shape":"Square, Rectagular, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=32.093401,+-81.094194(21676)&iwloc=A&hl=en\"> mufon case (21676) map </A>","Longitude":"-81.094194","Sighting Duration":"Undisclosed","Date Submitted":"01/27/2010 01:47 UTC","Date of the Event":"04/30/2008 11:00 UTC","Object Flight Path":"Straight-line path","Case Number":"21676","Log Number":"US-01272010-0002","City":"Savannah","Source":"MUFON"}