{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Summary":"At first was seen as a bright shine of light that would resemble almost a fireball,until spotted twenty minutes later as a cylinder.","Region":"County Waterford","Latitude":"52.25227","Tags":"City","Case Number":"21670","Date Submitted":"01/26/2010 05:51 UTC","Object Shape":"Cylinder, Fireball, Flash","map":"<A HREF = \"http://maps.google.com/maps?q=52.25227,+-7.127206(21670)&iwloc=A&hl=en\"> mufon case (21670) map </A>","Country":"Ireland","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Undisclosed","Longitude":"-7.127206","trends":["There have been no other sightings in Waterford","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/21670.html.txt","/var/www/straped/mufon/org/21670.html"],"Disposition":"Unresolved","City":"Waterford","Weather Factors":"Does Not Apply","Log Number":"IE-01262010-0023","divs":["Sighting DetailsFirstly i would like to say i have taken a quite inaccurate date of the sighting.In 2008 I had being on my way to Waterford city to spend the night at a mate's house,my father had been driving me to the town which is almost half an hour drive approx from my parents home in kilmeaden. As we drove alone the main road(N25),around ten minutes or so from our departure,my father had noticed an extremely bright object making it's way over the hills where i could only describe had been coming from the area of Ardeenlone heading Northwest, as the sun had being setting at the time and this area was a usual route for the rescue helicopter to make it's way to the mountains nearby,my father and I,whom at the time were still sceptical and puzzled at the lack of any sound coming from such a loud aircraft,had put a logical explaination to what we were seeing and said that it must be the helicoptor with the reflection of sun striking from it and at such a low altitude.so we kept driving as normal to our destination. Nearing my friends house by Ardkeen just under twenty minutes later,I recieve a call from home, I answered and it was my mother on the other end in a frantic state,saying my younger brother had seen a UFO,now in all honusty some of my family including myself are firm believers in UFO's and are sometimes very gulable to the fact,but never to the state where i recieve a frantic urgent almost upsetting phone call over something seen,except for this circumstance.my brother who is also a very crediable withness who always looks for a logical explaination for event's like this,had been frantic about this happening and could find apsolutely no explaination for it,once i had asked him about what he had seen i was amazed. He described the object as being the shape of half a cone(from bottom end up),it was completely metallic (which explained the strong reflective shine my father and I had seen as it flew towards the sunset),it had two lights on it,one was a consistant white light at the bottom right and a blue light that flashed in sequence halfway up the side, the craft made a small low frequency buzzing noise, and the craft did not spin or rotate in any direction according to his view, he had also described the scenario to me from where he saw it, his account of it is he had been out the front of the house when he had noticed it in the neighbouring field to the North of our house heading in the same direction we had described before hand, he said it had been so close it had him scared as it was at estimate of five to six hundred feet from him and hovering upward, as he watched the object hover at a slow rate, he then said it moved at an acute angle at incredible speed over the nearby mountainous forestry to the east where it stopped suddenly and hovered downward behind the trees and wasn't seen afterwards. i had went to the forest the next day in hope to find a landing site but could not estimate the area of it's descent and so no finding. this is no hoax, it's a true account i swear to you."],"Date of the Event":"11/20/2008 07:20 UTC"}