{"Latitude":"25.796219","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"01/26/2010 07:01 UTC","Object Flight Path":"Stationary","Weather Factors":"Fog","divs":["Sighting DetailsE-Mail from Witness:Friday morning (1-22-10) while running west bound (heading towards Miami) over the Bridge from Key Biscayne at about 6:30 AM, I saw if I remember correctly five lights in a \"V\" shape in the sky. My first thoughts were that the lights were from one of the tall building from the Miami skyline. The lights were in the \"2 o'clock\" position. The lights from the first time I noticed them lasted about two seconds and then slowly faded away into the fog that prevailed that morning not to appear again. If those lights were from a tall building, I was certain to see those lights again which I did not. Nor did I see any other lights from any other object or objects. My vantage point at sighting was directly at the zenith of the bridge's height. Lights from the Miami skyline would not appear that high in the sky as such. I heard no sound and the way the lights just slowly drifted off into the fog could not be from an airplane. It was impossible to discern the size of the object due to the fog occluding any background. I am a pilot, an electrical engineer with a Master's degree and a rational thinker. What I saw defies any explanation I could ever come up with."],"Tags":"City","Summary":"Five Lights in V Formation","Object Shape":"Triangle","Date of the Event":"01/22/2010 06:30 UTC","Longitude":"-80.219249","Object Features":"Undisclosed","Sighting Duration":"00:00:02","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around January 22nd 2010"],"Region":"Florida","Source":"MUFON","Country":"United States","City":"Miami","map":"<A HREF = \"http://maps.google.com/maps?q=25.796219,+-80.219249(21672)&iwloc=A&hl=en\"> mufon case (21672) map </A>","Case Number":"21672","Log Number":"US-01262010-0025","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21672.html.txt","/var/www/straped/mufon/org/21672.html"]}