{"Object Features":"Patterned Surface, Appendage(s)","Date of the Event":"09/20/1987 12:00 UTC","Latitude":"41.090652","Longitude":"-73.917915","Weather Factors":"Unknown","Summary":"a very large lightedobject desened over hudson and small lighted craft flew out of it and many flew in","files":["/var/www/straped/mufon/html2text/21687.html.txt","/var/www/straped/mufon/org/21687.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.090652,+-73.917915(21687)&iwloc=A&hl=en\"> mufon case (21687) map </A>","Country":"United States","trends":["There has been one other sighting in Nyack","There were no other sightings in Nyack on or around September 20th 1987"],"Object Flight Path":"Other","Disposition":"Unresolved","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"21687","Source":"MUFON","divs":["Sighting DetailsI was traveling south on rt.9w at dusk when a large ball of light began to desend over the river. It lit the river from bank to bank just south of the tz bridge. it hovered for sometime. the object was a ball of small lights, thousands of them in a circular shape with each light being individually distint. i pulled over and watched as the small lights flew out of the object and circled it and flew off. the speed that they where travelling was unbeilvable. thousands of the small lights speeded in and out from it, some coming in at top speeds also many other where cicluling around the main object. the size of the main craft was about a quarter mile across.after watching the craft for about 20 mins, it slowly lifted into the sky and them in a flash it disapearred at light speed. i also had my mother and a freind with me at the time of this sighting. it was definately not from this planet. i know that other ppl saw this and that the nyack ny police dept as well as the tarrytown ny police recieved tousands of calls to report this sighting. i can't remember the exact date ,but i will never forget it. when i first saw it i thought it was the moon. my feeling at the time was that the earth was being invaded by aleins and that i also knew that i was witnessing proof positive that ufo's are real."],"City":"Nyack","Date Submitted":"01/27/2010 10:46 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-01272010-0013","Region":"New York"}