{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/21689.html.txt","/var/www/straped/mufon/org/21689.html"],"Summary":"Years of strange illnesses after multiple UFO sightings at Area 51","Object Shape":"Circle","Object Flight Path":"Undisclosed","City":"Rachel","Case Number":"21689","Region":"Nevada","trends":["There have been 9 other sightings in Rachel","There were no other sightings in Rachel on or around March 9th 2005"],"Weather Factors":"Unknown","Tags":"City","Longitude":"-115.741675","Log Number":"US-01272010-0015","map":"<A HREF = \"http://maps.google.com/maps?q=37.649172,+-115.741675(21689)&iwloc=A&hl=en\"> mufon case (21689) map </A>","Viewing Distance":"Unknown","Date Submitted":"01/27/2010 11:44 UTC","divs":["sighting detailsmy name is david manzi. please use the following information to look up a sighting report that i made back in 2006.(date submitted: 1\\2\\2006, date of event: 3\\9\\2005, state: nevada, couty: lincoln, short description: close call staking out area 51 in nevada) when i lived in cedar city, utah, i made frequent trips to area 51, aprox 2 hours to the west. the information listed above will help you find a sighting report that i made in 2006. since my sighting of multiple orange orbs in the sky at area 51, i have suffered with many strange ailments over the last 4 years. i have seen many doctors and have alot of er bills to prove it. i have been through hell with these doctors. i truly need some advice regarding these issues. i have procrastined for 4 years because i did not want to accept the possibility that my illnesses may have resulted from the encounters i had that night at area 51. i am a serious inquirer of help and advice. this has changed my life, maybe for the worse. please help. i need some closure on this. call me anytime. the time is now that i face this. i truly need your help. sincerely, david john manzi junior (406-593-0553) 625 13th st, butte, montana, 59701"],"Date of the Event":"03/09/2005 12:00 UTC","Disposition":"Unresolved","Object Features":"Undisclosed","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"37.649172"}