{"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsWE live in Orange Springs in Marion County Florida. The way my chair sits in my living room it faces a window that overlooks a spring fed brook which is about 75ft away from my house. I was talking to my fiance on the phone he was on his way home on an adjacent road to our house CR318. I looked out the window opposite my chair across the room and saw this real bright light. I thought at first it was a plane or something like that, it was i mean just above the tree line. I kept looking as I was talking to my fiance and this thing just STOPPED!!! and hung there. I hollered at my fiance over the phone OH MY GOD i think i am seeing a ufo. At that point it started moving again. Super Super bright light almost like a floating star. I ran outside while I had my fiance ON THE PHONE saying oh my god oh my god its a ufo..All the sudden he hollered OH CRAP i can see it from here. This is how bright this sucker was. Then he started watching it as it went out of my vision and he caught it. And as quick as we had seen it. He went crap it disappeared. Then he said I dont know what that was but it wasnt any plane I have ever seen before. There was NO noise just the bright light and some type of red lights NOT PLANE lights i know what they look like. Then he said I dont know what that was but now there are planes all over the place here. I can see four or five of them flying around where that thing was. WELL i dont know about anyone else but im telling you right now that WAS NOT ANY NORMAL PLANE I HAVE EVER SEEN"],"Object Shape":"Star-like, Triangle","Log Number":"US-01282010-0004","Case Number":"21693","Sighting Duration":"Undisclosed","City":"Ocala","Weather Factors":"None","Date of the Event":"01/27/2010 07:00 UTC","Source":"MUFON","Object Features":"Other","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"29.194299","map":"<A HREF = \"http://maps.google.com/maps?q=29.194299,+-82.130192(21693)&iwloc=A&hl=en\"> mufon case (21693) map </A>","Region":"Florida","Longitude":"-82.130192","Tags":"City","Date Submitted":"01/28/2010 05:25 UTC","trends":["There have been 21 other sightings in Ocala","There was one other sighting in Ocala on or around January 27th 2010"],"files":["/var/www/straped/mufon/html2text/21693.html.txt","/var/www/straped/mufon/org/21693.html"],"Summary":"bright slow moving light","Disposition":"Unknown"}