{"Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-83.39342","Log Number":"US-01282010-0010","Summary":"While driving home from Monroe to Dundee in Nov. 2008 on M50 saw a flash of what first appeared to be lightening.","Disposition":"Unknown","trends":["There have been 9 other sightings in Monroe","There were no other sightings in Monroe on or around October 31st 2008"],"Case Number":"21699","Viewing Distance":"Over One Mile","Object Shape":"Flash","files":["/var/www/straped/mufon/html2text/21699.html.txt","/var/www/straped/mufon/org/21699.html"],"Source":"MUFON","Date of the Event":"10/31/2008 08:30 UTC","Weather Factors":"None","Object Flight Path":"Stationary,Straight-line path","divs":["Sighting DetailsMy husband had an evening Dr's appt in Monroe, Mi in Nov. 2008. At about, one mile outside of Monroe on M50 headed towards Dundee, I saw what looked like a flash of lightening (sp) through the Drivers side window. I turned to look and it was visable continually and got so bright it hurt my eyes. I slowed down pointed it out to my husband and we drove about 5 miles watching the light. He said it was changing colors (violet, yellow, light blue) while I saw very bright white light that got brighter and brighter, hurting my eyes. After, 5 miles of watching it we pulled over and got out of the truck and watched the light all the time it was light a streak of lightening. After, about 5 minutes we got back into the truck and drove to dundee (all together 14 miles) the light was visable the whole time. We pulled into our driveway and watched it from the tail of the truck for about 2-3 minutes. The entire time it was visable it seemed to be moving evenly with the truck at about a 30 degree angle in the sky. At the time we went into the house it had dissappeared. The brightness of the streak caused my eyes to water and the light would intesify. My husband said that as it got brighter it changed color. His distance eyesight is better then mine."],"Latitude":"41.919504","map":"<A HREF = \"http://maps.google.com/maps?q=41.919504,+-83.39342(21699)&iwloc=A&hl=en\"> mufon case (21699) map </A>","Date Submitted":"01/28/2010 08:47 UTC","Region":"Michigan","Object Features":"Other","City":"Monroe"}