{"Summary":"Two sheres hovering approximately 400 feet in the air...about five miles away.","Object Flight Path":"Stationary,Hovering then path","Object Features":"Unknown","divs":["Sighting DetailsWe've had abnormal weather occurring lately. Two weeks ago we had snow and a deep freeze for days. As that thawed away, we had fog like I've never seen in our area before. This past weekend, it felt like spring, nearing the 60s. But now it has gotten colder again...and we are anticipating a bigger snow storm. Our dog is an English Mastiff (Big dog!) and for some reason became spooked and barked, and looked toward the door. He rarely barks. So, I stepped out of my house for a cigarette, as I normally do. The barometric pressure was high, thus no clouds and all stars. I love it when it's like that...you can see every star. So, I looked over to my neighbor's house to see his heat exhaust go straight into the sky. That always looks so neat, but two objects just over his garage caught my eye. From my view, they \"looked\" like they were over his garage, but were actually about five miles away. I look into this area every night. There is a flight pattern for the Louisville International Airport, but these objects were lower and stationary. They almost looked stationary like stars, but the lights were bright orange and other lights were flickering at times. I'm a UFO enthusiast and thought, \"I'm finally seeing it!\" I thought no one would believe me, so I bravely woke up my sleeping fiance. She wasn't too happy, but she humored me and got up to look out. In the back of my mind, I kind of assumed they'd be gone, but they weren't. She saw them too. She still told me that I was crazy, but got my iPhone for me. I snapped the attached picture. The objects stayed for about 10 minutes until the bottom one gently flew off to the left, or direction-wise East towards Louisville. The top one stayed for much longer. In the picture, you can see my neighbor's house. There is a utility pole in front of his house with a bright white light on it. But just to the left of the pole are the two objects. They made no sound, but remember, I'm about five miles away from them. If these are not UFOs, my theory is that they are military helicopters training for urban warfare. Fort Knox is about 40 miles south of where I live."],"Latitude":"38.220172","Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","trends":["There have been 12 other sightings in Corydon","There were no other sightings in Corydon on or around January 26th 2010","This sighting has never been favorited.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.220172,+-86.112916(21694)&iwloc=A&hl=en\"> mufon case (21694) map </A>","Date of the Event":"01/26/2010 11:30 UTC","Longitude":"-86.112916","Sighting Duration":"Undisclosed","City":"Corydon","Date Submitted":"01/28/2010 10:35 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/21694.html.txt","/var/www/straped/mufon/more/21694_submitter_file1__IMG_0416.jpg","/var/www/straped/mufon/org/21694.html"],"Log Number":"US-01282010-0005","Object Shape":"Sphere, Star-like","Tags":"City","Region":"Indiana","Case Number":"21694","Weather Factors":"Unknown"}