{"Object Flight Path":"Straight-line path","Disposition":"Unknown","Case Number":"21692","City":"Wind Gap","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21692.html.txt","/var/www/straped/mufon/org/21692.html"],"Summary":"Sighting of black chevron-shaped object with 5 red blinking lights underneath, moving northeast over Bangor, PA approximately May, 2008 at 10pm.","Latitude":"40.848151","Weather Factors":"None","Region":"Pennsylvania","Viewing Distance":"101-500 Feet","Date of the Event":"05/10/2008 07:00 UTC","divs":["Sighting DetailsApproximately May, 10th, 2008 at 7pm, I was leaving my son's house in Bangor, PA. As I sat in my car, I noticed a black chevron-shaped object with five huge, bright red disc-shaped lights underneath moving noiselessly over the house. It was dusk and the object was about the size of a 727 traveling at about 180 mph at an altitude of about 500 feet. Having advanced knowledge of conventional and military aircraft, I realized that this object was neither of these because all five lights were blinking on and off simultaneously. In other words, they would all go out for one second and then all come on for one second. I used my cell phone to call my mother in NJ as a witness to what I was describing. I told her I was seeing a UFO and was going to follow it with my car. My son's house is on Rt. 512. The object followed Rt. 512 for about one mile. I trailed it with my car and as Rt. 512 makes a sharp right, the UFO went straight and I watched the object fly off over the mountains until it was out of sight. I remember being fascinated and thinking that this was definitely not something from this earth. I also recall being amazed at the large size of the lights and their bright red color. It was my first UFO sighting and I was thrilled. Oddly enough, my son told me that he had seen the same black, chevron-shaped object over Bangor, PA only a week before in broad daylight. He said the red lights were off because of the time of day. He told me that he was afraid to tell anyone for fear they would think he was crazy. I remember thinking that a lot of people must have seen this object on the same night that I had seen it because we were on the main street in a small, densely populated town and the object was in plain view at dusk, flying low right down the main street. It was still light enough to see it clearly. It reminded me of the sightings of the Phoenix Lights and it looked just like them, except on a smaller scale."],"Object Features":"Wings","trends":["There has been one other sighting in Wind Gap","There were no other sightings in Wind Gap on or around May 10th 2008"],"Object Shape":"Chevron","Longitude":"-75.291569","Date Submitted":"01/28/2010 01:15 UTC","Country":"United States","Sighting Duration":"00:05:00","Log Number":"US-01282010-0003","map":"<A HREF = \"http://maps.google.com/maps?q=40.848151,+-75.291569(21692)&iwloc=A&hl=en\"> mufon case (21692) map </A>","Tags":"City"}