{"Disposition":"Unknown","Object Features":"Unknown","Date Submitted":"01/28/2010 05:46 UTC","Country":"United States","Latitude":"36.10456","Viewing Distance":"Unknown","Longitude":"-80.239016","Date of the Event":"01/26/2010 02:07 UTC","files":["/var/www/straped/mufon/html2text/21698.html.txt","/var/www/straped/mufon/org/21698.html"],"Region":"North Carolina","Tags":"City","Case Number":"21698","Weather Factors":"Windy","Summary":"White star like light in sky...red & green flashing lights on it...moved around in erratic circles & up & down","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around January 26th 2010"],"Object Shape":"Star-like","City":"Winston-Salem","divs":["Sighting DetailsI had just turned off the TV & was lying in bed looking out the top window of my bedroom (we have cathedral ceilings). I can see the tops of the trees through that window & I was watching them swaying with the wind. I saw what I thought was a white star beyond the trees, but it was really bright. At first I thought maybe it was the North star, but it seemed even brighter than that. Chalking it up to a star, I closed my eyes for a couple minutes. I opened them up again & looked out to see the bright light had moved up and over the trees. I then realized it couldn't be a star because of the distance it had moved in that short of time. So I figured it must be an airplane. I kept looking at it then I noticed the faint blink of red & green lights. I noticed that it hadn't changed it's position in the sky since I had been watching it over the trees. As I continued looking at it, it finally moved in some small circular motions, then stopped. Then it moved in an up & down motion, then stopped. Even when it was moving, it stayed in that same general area, but always stopped right back where it started. I woke my husband so he could look at it too, but he had been horribly sick with a stomach virus, and wasn't really awake, and he never looked out the window. I started getting freaked out & scared & forced myself to roll over and stop looking at it."],"Object Flight Path":"Stationary","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.10456,+-80.239016(21698)&iwloc=A&hl=en\"> mufon case (21698) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-01282010-0009"}