{"Weather Factors":"None","Object Shape":"Disc, Flash, Oval","Latitude":"45.672802","Longitude":"-97.039875","Disposition":"Unknown","divs":["Sighting DetailsMy friend Liz and I were driving South on a desolate road South of Sisseton SD at exactly 10:19 P.M.Wed. evening when she said \"Dorene what is that?\" when I looked up to the left in the sky Id guess 30 miles out traveling South to North was a cluster of the goofiest looking lights I had ever seen. They were clustered together like one big one then to the right of that big red light was a few small ones then a big bright red one again and it floated erratically across the sky, Liz and I were screaming in the car at the excitement of seeing such an odd shaped lighting arrangement when all of a sudden 2 bright white lights shot out the back of the red lighted thing then disappeared. We watched the cluster of reddish amber looking lights change shape a few times like it was spinning or morphing always changing not like a normal craft, which blinks the same continuously til it was behind us instead of in the front of us as it turned into a star and stayed stationary a few seconds then we lost sight of it as it just blinked out. We again started screaming in excitement at what we had just seen. I have become very interested in ufology in the last few years and believe we are not alone, and what I believe we saw was not of earthly origin. It felt ..........strange, surreal because it was not your normal run of the mill airplane. I also would like to add that at the time it was drifting across the sky South to North one plane flew right by that thing then there were a few more planes in the sky at the same time and usually in South Dakota there is never 4 or 5 planes in the sky at one time and I would know I have lived here for 4 years now and watch the skies alot."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.672802,+-97.039875(21690)&iwloc=A&hl=en\"> mufon case (21690) map </A>","trends":["There have been 2 other sightings in Sisseton","There were no other sightings in Sisseton on or around January 27th 2010"],"Region":"South Dakota","Date Submitted":"01/28/2010 12:45 UTC","files":["/var/www/straped/mufon/html2text/21690.html.txt","/var/www/straped/mufon/org/21690.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"driving south of Sisseton we seen a a cluster of reddish amber lights with two white flashes streaking out the back object was traveling S. to N sometimes the lights would just quit flashing stay red turned into a star.","Viewing Distance":"Over One Mile","City":"Sisseton","Country":"United States","Tags":"City","Log Number":"US-01282010-0001","Date of the Event":"01/27/2010 10:19 UTC","Case Number":"21690"}