{"Object Features":"Window(s), Patterned Surface, Wings","City":"Batavia-Leroy-Rochester","divs":["sighting detailswhile commuting at night i noticed 4 white\\pale yellow lights. low enough from changing driving angles to make me first consider there to be a tower or smoke stack i had forgotten. as i got closer i realized the lights were moving toward the i-90 thru-way. i was able to see some structure. it was as if there were two nearly straight flying wings (objects \"wings\" were only slightly swept back). the tips of the wings had the lights i initially saw and the underside had a dimmer light of the same color. the underside light appeared to be windows like from a wwii bomber. a yb-35 was the closest thing i could think of. i passed nearly underneath with no audible engine noise. as my initial thought of tower would suggest, i would guess they were 1,000ft up and 200-500 ft across. the height is well defined by my changing perspective as well as the speed, which was too high for a normal lighter than air, perhaps at or slower than a landing commercial jet. the two were in a formation that would make it look like a flying rectangle or diamond if not as close as i was. i lost sight because i was past the lights and they were moving off by the time i realized this was strange. very strangely there were no headlights i could see behind me and the closest car ahead was a ways out, but that is likely unrelated. sorry i should have stopped and tried to get a fuzzy cell phone pic. the exact cross road from google maps is i-90 between buckley and warner. the object(s) were moving south south west."],"Date Submitted":"01/28/2010 12:47 UTC","Object Shape":"Square, Rectagular, Other","Tags":"City","Log Number":"US-01282010-0002","Region":"New York","trends":["There have been no other sightings in Batavia-Leroy-Rochester","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.958534,+-76.909593(21691)&iwloc=A&hl=en\"> mufon case (21691) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Summary":"Two flying wings crossed over I-90 East of Rt 237.","Latitude":"42.958534","Case Number":"21691","Source":"MUFON","Longitude":"-76.909593","files":["/var/www/straped/mufon/html2text/21691.html.txt","/var/www/straped/mufon/org/21691.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date of the Event":"01/27/2010 07:57 UTC","Disposition":"Insufficient Data"}