{"Weather Factors":"None","Country":"United States","Longitude":"-74.916181","Object Shape":"Oval, Star-like, Triangle","trends":["There have been 2 other sightings in Mansfield","There were no other sightings in Mansfield on or around January 28th 2010"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was around 9:15 pm on January 28th 2010. My friend and I were driving up a mountain road on a very clear night and the moon looked brighter than i had ever seen it before. as we passed a house we saw something in the air that was completely still and very low. like the georgia entry, this object had a bright white center light with blue white and red lights flashing around it. as we stopped to watch it, it started flying away from us slowing so we turned the car around and started following it and as we did this it took off flying very quickly away. we went back down the road as fast as we could and went to open fields to try to see it. we saw it still flying away from us, then it stopped, turned left and we watched it fly away for awhile. as we went to leave we turned around and we saw another one flying over the mountain top and as we were watching this one fly either another one appeared or the one that we thought flew away had come back and now two of the objects were flying toward each other right above the tree line. as they got close to each other they stopped. both of them had bright white lights on the front and were facing each other, then all of the sudden both lights turned away from each other and pointed directly at our car and started moving slowly toward us. at this point we freaked out and drove away to my friends house. we stood in my friends driveway and could kind of see them in the distance. we went inside and hung out about an hour. little did we know this was just the beginning. we left my friends house with him being very skeptical of our sighting but when we came to the fields again we saw another one, we started following it and when we came out where the tree line ended we saw at least 10 different objects in the sky all blinking colors and moving around, some of these were very close too. as we drove closer the 4 closest objects started flashing a white light and moving away from us, as we got closer the white light got brighter and brighter until it looked like a sliver bright light flashing quickly. we again freaked out and drove to my house. when we got to my house I called the cops to see if anything was going on, if helicopters were looking for a missing person or something, and they said nothing was going on in the area. as soon as i got off the phone, it is about 1120 now, we see about 6 of the objects in the sky above my house flying around, then we hear a loud noise and we could feel a vibration and three large bright orange circles appear from the tree tops in a triangle, they fly quickly over my house and disappear in the horizon, as soon as that was gone one of the ships flew above my front yard and a bright light started growing from the, I'm assuming, back of it. it stayed still as the light beam grew longer and was changing different colors (blues, reds, purples, yellows, everything) once the light beam was at least 100+ feet long it swooped over my house. my friends and i ran from the front to the back yard and watched it fly close over head, and as soon as it passed my over my house it let go of the light beam and the beam seemed to fall and turn into smoke that fell right above our heads and disappeared, as we saw this falling we shut the door and went inside. after all this happened, we called the police again to see if anyone saw anything and they said that they had a few calls of people reporting lights in the sky. i hung up the phone and we didnt see anything else really. I felt very strange, i dont know if it was from them or from freaking out, but at one point i felt very sick and the letters on my computer screen started moving and we all felt very paranoid. I was completely sober this entire time. Everything we saw was clear as day. My digital camera wouldnt work when i tried to take a picture of them, and my video camera wasnt charged and everytime i took it out there was nothing around. i called the cops today to see if anything was reported about last night and the cop who had been on duty since 730 am said he had not heard one thing. after i read the ufo sighting in georgia that happened the same night with the same objects, i knew something either very exciting or very scary had happened. there was a small orb of light that was significantly brighter than the rest of the stars that was far in the sky above my house that i caught on video, and on the video you can see the orb change colors some, and it stayed very still while everything else was going on. i will try to upload that footage later"],"Source":"MUFON","Latitude":"40.786918","map":"<A HREF = \"http://maps.google.com/maps?q=40.786918,+-74.916181(21706)&iwloc=A&hl=en\"> mufon case (21706) map </A>","Tags":"City","Disposition":"Unknown","Log Number":"US-01292010-0005","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/21706.html.txt","/var/www/straped/mufon/org/21706.html"],"Date of the Event":"01/28/2010 09:30 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"01/29/2010 02:36 UTC","Region":"New Jersey","Summary":"saw same thing as Savannah, Georgia but way more intense.","Case Number":"21706","City":"Mansfield"}