{"Object Features":"Unknown","Region":"Texas","Date of the Event":"01/26/2010 03:00 UTC","Log Number":"US-01282010-0011","Case Number":"21700","Disposition":"Hoax","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around January 26th 2010"],"Tags":"City","City":"Abilene","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Latitude":"32.457026","files":["/var/www/straped/mufon/html2text/21700.html.txt","/var/www/straped/mufon/org/21700.html"],"Source":"MUFON","Object Shape":"Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.457026,+-99.731354(21700)&iwloc=A&hl=en\"> mufon case (21700) map </A>","Date Submitted":"01/28/2010 10:55 UTC","Weather Factors":"None","Longitude":"-99.731354","Viewing Distance":"501 Feet - 1 Mile, Unknown","Country":"United States","Summary":"Multiple hovering lights. Triangular shaped orbs. white and black orbs. Chemtrail clouds with a ufo fleet of hundreds!","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn Janurary 26th 2010 around 3am I went outside my house to get fresh air because I wasnt feeling very good. As I went outside it was a clear blue night with the stars very visible. As I went around my house I noticed about 10 to 20 miles away in the southwest, a pulsating light with many colors. It seemed to dissapear and reapear, up and down closer to me and then further away. As I watched I got a wierd feeling to look up. I then spotted above a very dark but bright orange orb of light. \"what a strange star.\" I thought. Then it bolted away then hovered in another area, directly over my house. I would say about 2 or 3000 ft. up. As I watched there seem to be white orbs coming and going around the orange orb at light speed. I was so scared by this sight that I ran in the house to get my girlfriend. We went back out and I showed her the first pulsating light further away. She gasped in disbelief! we stood there for a couple of minutes cuz I couldnt see the other one. Then the other reappered out of no where above my house again. It seemed to be flashing lights and then dissapered and reappered while hovering. My girlfriend gasped and and said \"Nooo!\" then ran into the house. I stood in amazment at what I saw. She begged me to come back in and I did so. After fianlly calming down I went back outside. The orange light was gone and the one further away had moved to the complete opposite side of town. It had moved to the North east side. still about the same distance. I then noticed possibly a c-130 flying at VERY low altitudes. It was accompanied by a airplane releasing chemtrails at a very low altitude. Thy sky became cloudy in what seemed a matter of 30 minutes. I went back inside very distraught at I what I saw. around 5:45 am my girlfriend got up so I could take her to work. I could not sleep. We got in the car and as we pulled out we noticed in the northeast sky 2 pulsating flashing lights. As we drove down the block one light began to move upwards and towards my town. My girlfriend begged me to hurry and leave. Amazed I drove about 6 miles southbound to her work. As I pulled up to her work I noticed the flashing light had made its way very close and could be seen moving eraticly and flashing multiple colors. I then decided that I had to find out if I was really as crazy as this was making me feel. So I headed eastbound out of town towards the country to get a better look. As a traveled a very dark road I looked up and rolled down the window. I was in complete shock and horror at what I saw. I slammed my brakes and parked on the shoulder. I got out and stood in awe. What I saw next was straight out of a sci-fi movie. There was a widespread chemtrail cloud. In it and above is what seemed like thousands of orbed lights. They seemed to be moving with the cloud. Silent I stood in horror. Out of no where I saw what looked like a triangular shaped ufo descend really damn close to me. I could see three distinct orange lights. And what seemed to be scribling on the underbelly edge. It hovered and zipped in bursts several times before I completely freaked out and got in my car. I did about 90 mph down this road to a right down a access road by the highway to the nearest convinence store. The clouds and the fleet where gone! I went inside got a water bottle. As I left I asked the clerk if anyone had come in and reported seeing anything. He stared at me and asked \"what did you say?\" he could see the fear on me. I told him never mind and left. As I walked to my car I saw the same orange orb about 2 miles to the west. It looked directly above Dyess airforce base. It hovered and pulsated. dissapearing and reapearing several times. The clerk then came outside to \"see what I was looking at.\" We both stood in silence by my car as we watched the orb pulsate and hover. Moving closer and further away. At a closer look you could see white orbs zipping to and from it. Finally I left and watched this ufo the entire time. When I got home the orb had moved closer to my house. I decided to get a closer look so I went to my backyard. I looked at my clock and it was around 6;50 am. The sun was starting to light the sky. I observed the sky over my town light up with activity. Everything from The large strobbing orb to white orbs. Diffrent ufo's at diffrent altitudes. What looked like a c-130. A chemtrail jet. Bomber sounds that could not be seen. THere seem to be a explosion of activity!! Exhausted and petrified I went in to the house. Laid down and finally went to sleep. I can only say that what I saw will forecver change me. There here now."]}