{"Log Number":"US-01292010-0006","trends":["There have been 6 other sightings in Cross Plains","There were no other sightings in Cross Plains on or around November 30th 2000"],"Date of the Event":"11/30/2000 09:00 UTC","Object Shape":"Boomerang","Tags":"City","Summary":"Moving west to east, very slowly at treetop level, passing directly overhead,affording the three of us a detailed observation.","files":["/var/www/straped/mufon/html2text/21707.html.txt","/var/www/straped/mufon/org/21707.html"],"divs":["Sighting DetailsMy wife, a retired school teacher, myself, in Austin and Cross Plains, Texas were standing at the edge of a pasture west of the ranch house at 9:00 pm talking about our purchase of the 600 acre ranch he had for sale. We noticed a row of bright lights off to the west at treetop level and my wife making the statement,\"It's not a plane because there are no flashing lights.\" We watched without speaking as the craft drew closer moving directly towards us a a very slow speed. When it was about a mile away I noticed the craft was huge, I mean it was gigantic and coming straight for us. As it passed directly overhead I was in disbelief and wonder as it blocked out the night sky. There was what I would describe as a round or circular gondola that lowered from the center of the underbelly being 20 to 30 ft. in diameter and coming out of the bottom of the craft about 10 to 15 ft. It is a part of the craft not seperate. It appeared as if they could raise it back into the craft or lower it at will. The gondola was glassed in with many seperate panes of glass 4 to 6 ft wide having a metallic bottom and 3 to 4 ft of metal at the top. The glass panes allowed us to clearly see the individuals in what resembled a control room atmosphere that comprised the interior of the gondola. The occupants of the gondola were humanoid in appearance but I was struck by the fact they were all the same size being thin and slightly long limbed as they moved about at what looked like control panels or monitors of some sort. I sensed a sense of urgency in their movements but cannot put into words why I felt that way. They seemed completely oblivious to our presense as thy went about their duties. The craft slowly moved across highway 279 continuing east at treetop level. We stood speechless for a moment and **********broke the silence with, \"Did you just see what I just thought I saw?\" We said we had But we were all in an awed stupor of what's going on , our normal, safe, uneventful lives and world had been violated by images we were having trouble getting a grip on as our minds raced with so many thoughts. My wife said, \"It's going to crash!\" but as we waited in expectation of a terrible fireball and explosion, nothing happened. My wife and I do not share this event with others because we do not wish to be considered whacko's. BUT we saw what we saw! I am giving you this information to assist you as you compile information because I saw a gentleman ridiculed on Fox News Network by good people who just had no way of understanding what they had not seen for themslves. My wife and I are 66 yrs. of age, retired in a gated golf resort on Lake Whitney. We are affluent, respected members of our community and are willing at any time at our expense to take a lie detector examination. A sketch will be provided upon request. I do not wish to be contacted by a hoard of people and this is the reason I am supplying this information to you. I will co-operate with you and anyone who represents you. This is why I am Checking the no box for third party contacts. I understand from others that you are a reputable group searching for truth."],"Weather Factors":"None","Date Submitted":"01/29/2010 04:50 UTC","Case Number":"21707","Object Features":"Window(s), Appendage(s)","Viewing Distance":"21-100 Feet","Longitude":"-99.162442","map":"<A HREF = \"http://maps.google.com/maps?q=32.136109,+-99.162442(21707)&iwloc=A&hl=en\"> mufon case (21707) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Cross Plains","Latitude":"32.136109","Country":"United States","Region":"Texas","Object Flight Path":"Straight-line path"}