{"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/21703.html.txt","/var/www/straped/mufon/org/21703.html"],"Country":"United States","Date Submitted":"01/29/2010 10:19 UTC","Weather Factors":"None","Longitude":"-85.030594","Tags":"City","Case Number":"21703","City":"LaGrange","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"33.040187","Disposition":"IFO","Object Flight Path":"Straight-line path","Log Number":"US-01292010-0002","Region":"Georgia","Sighting Duration":"00:00:20","Date of the Event":"11/17/2009 05:00 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.040187,+-85.030594(21703)&iwloc=A&hl=en\"> mufon case (21703) map </A>","Summary":"2-3 bright star-like objects with unusual movement.","divs":["Sighting DetailsI was watching the meteor shower in the early morning hours of November 17, 2009 and saw plenty of meteor activity. However, I also noticed other light movement that was so unusual I mentioned it to a friend. She agreed it was odd but I thought no more of it until hearing that Troup County has been know to have frequent UFO sightings. I found this website and was surprised to see an entry that reported a sighting on October 13, 2009 which sounds identical to how I would report my event. I had been star gazing for about an hour and had seen a nice handful of meteors related to the shower that night. Then I noticed a light with brightness and movement that behaved nothing like I had seen before. I wondered how these lights could be related to the meteor shower because the brightness and pattern were so very different. These lights moved much slower and more deliberate than the \"shooting stars\". They were brighter than a star so I tried to convince myself if was an airplane but it was faster than the airplanes that I watch flyover on a regular and frequent basis. Additionally, airplanes always fly north and south over our house as they always fly into and out of Atlanta. These lights were going west to east but they also disappeared before they crossed the entire sky whereas you would see an airplane until it flew out of your line of sight. Also, I can always hear the faint and distant sound of an airplane engine - these light movements were silent. After watching the first light glide across the sky for about 15-20 seconds I saw two or three additional lights appear (or the same light reappear) individually in the same area flying in a similar pattern for similar lengths of time."],"trends":["There have been 29 other sightings in LaGrange","There were no other sightings in LaGrange on or around November 17th 2009"]}