{"Date Submitted":"01/29/2010 12:43 UTC","Case Number":"21704","Date of the Event":"05/31/1990 12:00 UTC","Summary":"UFO Pulling","Log Number":"US-01292010-0003","Object Shape":"Cigar, Oval","divs":["Sighting DetailsI was around twelve years of age at the time. My Mother, sister and I were driving back to our house late in the evening. I was in the back seat and my mom and sister were in the front. We were driving down Hwy 45 towards Eden when I looked off to the NE (the strange blue jumpy lights grabbed my attention) and roughly a mile to a mile and a half in the distance i saw a large cylindrical object hovering in the sky. Below that, however, I saw large \"bolts\" of lightning coming out of the bottom of this object. It looked like a miniature lightning storm that was \"grabbing\" a large electrical tower. I remember feeling very scared at the time. My mother kept driving and it seemed as though she didn't even care or blew it off as something other than out of the ordinary. So here is where I wonder if my young mind was imagining things. While I specifically remember seeing this and my sister and mother seeing this I am the only one who can recall this event. My mom and sister look at me like I'm crazy when I bring this up. Any suggestions? I remember this very vividly and I have remembered it all these years. I believe there was something more to this than just a young imagination."],"Country":"United States","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/21704.html.txt","/var/www/straped/mufon/more/21704_submitter_file1__myufo.jpg","/var/www/straped/mufon/more/21704_submitter_file2__UFOSighting.jpg","/var/www/straped/mufon/org/21704.html"],"Disposition":"Unknown","Region":"Wisconsin","Sighting Duration":"Undisclosed","Latitude":"43.693603","map":"<A HREF = \"http://maps.google.com/maps?q=43.693603,+-88.360936(21704)&iwloc=A&hl=en\"> mufon case (21704) map </A>","Tags":"City","Source":"MUFON","trends":["There have been no other sightings in Eden","This sighting has never been favorited."],"City":"Eden","Weather Factors":"Unknown","Object Features":"None","Longitude":"-88.360936","Viewing Distance":"Over One Mile"}