{"Longitude":"-88.42838","Region":"Wisconsin","Object Flight Path":"Path with directional change","Date Submitted":"01/29/2010 07:29 UTC","Sighting Duration":"Undisclosed","Object Shape":"Disc","Weather Factors":"None","Summary":"Tags","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.596684,+-88.42838(21709)&iwloc=A&hl=en\"> mufon case (21709) map </A>","divs":["Sighting DetailsDuring the late summer of 1978, myself and my now ex-wife were walking southeasterly on the 800 block of Wrigley Drive near the northern end of Lake Geneva. We were going back to our cars when we looked up and there was a saucer flying slowly above us. It was approx 150 yards away and 50 yards diameter. There were about 3 other people in our vacinity and they all saw it too. We all stopped and just stared up at it as it slowly moved about 100 yards or so from east to west. It then changed directions going away from us {southerly} at an ever increasing speed. We watched until it was out of sight. I remarked to my wife, \"we have just seen a UFO\". We then went into our car and started to leave on Hwy 12 going south. When we reached County Hwy U where it crossed Hwy 12, it was fully dark. It was then we saw what we assumed was the same craft. Only this time it was all light up. It had a wide band of lights around it and other markings. I can't really remember all of them after all this time. The second sighting was about 45-60 min later and lasted about four min. I pulled over to watch, but my wife got hysterical and wanted to leave. We drove on to Milwaukee. I know what I saw was not of this world. I worked as an metallurgical R&D machinist for the \"Big B\" (Boeing) in Washington state. I am not sure why I am reporting this now. We both felt absolute terror after seeing this. My wife more so. She feels we may have been abducted, and has talked about going to a hypnotist to see if any memories surface. I don't think so. I am pretty much a sceptic on that. Some time after I reported it to the NUFO Center. I am just now reporting this. I was a member of MUFON in 2008. But I didn't report it them and I don't know why."],"City":"Lake Geneva","Tags":"City","Date of the Event":"11/30/1977 09:00 UTC","trends":["There have been 2 other sightings in Lake Geneva","There were no other sightings in Lake Geneva on or around November 30th 1977"],"Latitude":"42.596684","Viewing Distance":"101-500 Feet, Over 1 Mile","files":["/var/www/straped/mufon/html2text/21709.html.txt","/var/www/straped/mufon/org/21709.html"],"Case Number":"21709","Source":"MUFON","Log Number":"US-01292010-0008","Disposition":"Insufficient Data"}