{"Object Features":"Undisclosed","trends":["There has been one other sighting in Tabuk","There were no other sightings in Tabuk on or around January 31st 1994"],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"SA-01302010-0003","divs":["Sighting DetailsMy crew and I were flying our aircraft from Cairo Egypt to Dhahran Saudi Arabia. When our location was approximately due south of Tabuk (unk distance), we spotted a star like object in the distance off of our right wing(200 heading) and at about 30-50 miles. Within seconds a very bright beam had projected down onto the cloud deck below like a searchlight. The searchlight itself did not appear to be actively moving. Our aircraft was at approximately FL 210-230, heading approximately 110 degrees. The object The object was at a similar altitude, appeared stationary and the cloud deck below was around 10-12K MSL. At first we thought it was another aircraft but there was little chatter on the ATC frequencies that would indicate traffic in our area. A helicopter was ruled out due to altitude. Their were no anti-collision lights nor navigational lights from the object that could be seen. It is possible a RSAF C-130 based at Jeddah was conducting night operations and the retracted landing lights could have been turned on causing the \"searchlight\" appearance. The lack of other lighting makes this unlikely. The only initial feeling aboard the aircraft was of puzzlement This faded fairly quickly as explanations were running out and it seemed as if the other crew members would rather forget about the sighting. The object was in our view for about 3-5 minutes before we lost sight of it as it passed behind our aircraft. I do not have charts and flight logs available to give more accurate information. There was no significant weather in the area."],"Source":"MUFON","Date Submitted":"01/30/2010 10:43 UTC","Latitude":"28.395189","Date of the Event":"01/31/1994 12:00 UTC","Tags":"City","Summary":"Large light at high altitude shining spotlight below it","Weather Factors":"Unknown","Country":"Saudi Arabia","files":["/var/www/straped/mufon/html2text/21714.html.txt","/var/www/straped/mufon/org/21714.html"],"Longitude":"36.57763","Case Number":"21714","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.395189,+36.57763(21714)&iwloc=A&hl=en\"> mufon case (21714) map </A>","City":"Tabuk","Object Flight Path":"Undisclosed","Region":"Tabuk","Object Shape":"Star-like"}