{"Longitude":"-121.120233","Tags":"City","Disposition":"IFO","Log Number":"US-01302010-0001","Weather Factors":"Rain, Light","Sighting Duration":"00:03:00","divs":["sighting detailsi was driving northbound from modesto through ripon heading towards manteca where my fiance and i noticed a very bright set of lights in the sky hovering on the left hand side of highway 99, 1\\4 of a mile from ripon high school. we thought the lights were from a tower at first until we noticed the object spinning slowly as the outside lights glowed off and on with out a pattern. i said \"i think it's a ufo\" and as we drove by the object, it was clear that there was nothing holding the lights in the air as it was hovering on it's own. the center light glowed diferent colors as the outside lights changed from white to orange to red with out blinking. i then turned off the highway to turn around so i could get a photo or a video from my phone but by the time we got back on the highway and to the spot of the sighting, the object was gone. the duration of time of the sighting was roughly around 3 minutes. the object seem to be at about 600 ft agl and the size was roughly around 30 yards from point to point. i swear on everything that i have seen the same object in videos as well with the same exact characteristics. i'm baffled!"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.745075,+-121.120233(21712)&iwloc=A&hl=en\"> mufon case (21712) map </A>","Object Features":"Other","Summary":"Hovering triangle with 3 lights on the outside and one glowing light in center","Region":"California","trends":["There have been 4 other sightings in Ripon","There were no other sightings in Ripon on or around January 29th 2010","This sighting has never been favorited.",""],"Country":"United States","Date Submitted":"01/30/2010 02:11 UTC","Date of the Event":"01/29/2010 09:33 UTC","Object Shape":"Triangle","Case Number":"21712","Viewing Distance":"501 Feet - 1 Mile","City":"Ripon","Latitude":"37.745075","files":["/var/www/straped/mufon/html2text/21712.html.txt","/var/www/straped/mufon/org/21712.html"],"Object Flight Path":"Hovering then path","Source":"MUFON"}