{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["sighting detailsour aircraft was conducting a resupply mission to tuzla, bosnia herzegovina. we were somewhere between fl 150 and 210 and our heading was west\\northwest heading for the airspace of northern italy. while still in close proximity of tuzla there was a thunderstorm slightly to the left of the nose of our aircraft. behind the thunderstorm was the slowly setting sun which still appeared to be 20-30 degrees above the horizon. what caught my attention was a bright like similar to a star that was \"playing\" in the vicinity of the thunderstorm. it was on the side of teh storm closest to us. the objects altitude appeared to be a few thousand feet lower than ours and was performing a series of random high speed maneuvers. there were nato combat air patrol aircraft in the general area but command and control authorities remarked that there was nothing seen in the that vicinity. the object was conducting maneuvers that are considered technologically impossible by today's standards. the fellow crew members took note of the object but seemed disinterested. after \"playing\" for several minutes the object disappeared."],"Latitude":"44.532841","Tags":"City","Country":"Bosnia and Herzegovina","Log Number":"BA-01302010-0004","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Region":"Federacija Bosna i Hercegovina","Object Features":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.532841,+18.6705(21715)&iwloc=A&hl=en\"> mufon case (21715) map </A>","Date Submitted":"01/30/2010 11:11 UTC","Date of the Event":"11/30/1996 04:30 UTC","trends":["There has been one other sighting in Tuzla","There were no other sightings in Tuzla on or around November 30th 1996"],"Object Shape":"Star-like","Longitude":"18.6705","files":["/var/www/straped/mufon/html2text/21715.html.txt","/var/www/straped/mufon/org/21715.html"],"Viewing Distance":"Unknown","City":"Tuzla","Summary":"Star like object performing high-G acrobatics near a thunderstorm","Case Number":"21715"}