{"Source":"MUFON","Date Submitted":"01/30/2010 07:52 UTC","Disposition":"IFO","Weather Factors":"Rain","Object Features":"None","Object Shape":"Circle, Other","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=25.794989,+-80.220389(21721)&iwloc=A&hl=en\"> mufon case (21721) map </A>","divs":["Sighting DetailsI couldn't really categorize this as a ufo but I still think it could be some kind of strange phenomena. First of all I'd recently started bringing my camera with me whenever I went out because of some strange things that I was noticing lately in general. As I took my dog for a walk, just around the corner from my apartment building in Miami near the 826 highway, I just looked up at the rain clouds for a second and noticed what looked like a noticeable dark circle in the cloud cover. I immediately took a few snap shots with my camera. What made it even more interesting to me is that over the past few months or so, once or twice I'd seen what looked like a very bright flickering light that resembled a star in more or less that same area. I've seen the light look gold-colored and I've also seen it look more white on another occasion. About a week and a half before the cloud sighting I was on my balcony and saw the small flickering light in that same spot and my neighbor was out walking his dog with his small daughter. They'd seen it too because I saw them looking in that direction and I heard her ask him what it was and he replied that he didn't know. That night I first saw it around 8pm or so, and I went back in to eat some dinner for about 15 or 20 minutes, and when I went back out to look at it again, it was gone. The skies were clear so if it was a star, there were no clouds that could have moved in front of it. I think there was something strange going on here last summer that started as far back as June and as I've said I'd seen some strange things in the sky and experienced things like waking up with a very loud ringing in my right ear one night and occasionally hearing a single loud electronic-sounding beep in my ears always when I was just about to doze off. Again I know this report isn't exactly about a ufo but I still think it's kind of strange."],"Date of the Event":"10/18/2009 06:00 UTC","Longitude":"-80.220389","files":["/var/www/straped/mufon/html2text/21721.html.txt","/var/www/straped/mufon/more/21721_submitter_file1__HPIM0595.JPG","/var/www/straped/mufon/more/21721_submitter_file2__HPIM0596.JPG","/var/www/straped/mufon/org/21721.html"],"trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around October 18th 2009","This sighting has never been favorited.",""],"Log Number":"US-01302010-0010","Latitude":"25.794989","Region":"Florida","Case Number":"21721","Country":"United States","City":"Miami","Summary":"Dark Circle Above Cloud Cover","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Other"}