{"Date of the Event":"09/05/2009 05:15 UTC","Case Number":"21722","Object Shape":"Other","Weather Factors":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=25.794979,+-80.223879(21722)&iwloc=A&hl=en\"> mufon case (21722) map </A>","Summary":"Huge contrail right over my apartment building","Source":"MUFON","Object Features":"Appendage(s)","files":["/var/www/straped/mufon/html2text/21722.html.txt","/var/www/straped/mufon/org/21722.html"],"Country":"United States","Log Number":"US-01302010-0011","Region":"Florida","Longitude":"-80.223879","Disposition":"IFO","Object Flight Path":"Unknown","Viewing Distance":"21-100 Feet","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around September 5th 2009"],"divs":["Sighting DetailsI took my dog out around 5am this morning and exited the building from the north entrance. I always look up and the skies were perfectly clear and it was still dark. We walked around to the front of the complex on the south side and re-entered the building and then exited the building again on the west side. I didn't look up again until we reached the south side again, and when I did, I saw a huge big white contrail of smoke or clouds that was very low and looked to be literally right over my building that wasn't there before. I could only see that the direction of the trail was stretched diagonally from somewhere over my building going towards out over the highway extension behind my building. I must repeat that when I'd looked up at the sky more or less in that same spot about 10 minutes before that, there was absolutely nothing there. I didn't see anything or hear a single sound and there was no breeze either. I wish I'd thought to get a picture of it with my camera at the time but for some reason I didn't. It's actually pretty unnerving to think of what could have made a large trail of smoke like that right over my building and for me to not have seen or heard a thing just prior to it."],"City":"Miami","Date Submitted":"01/30/2010 08:16 UTC","Tags":"City","Latitude":"25.794979"}