{"Country":"United States","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/21726.html.txt","/var/www/straped/mufon/more/21726_submitter_file1__2010_01_29_1832PST_1.jpg","/var/www/straped/mufon/org/21726.html"],"Longitude":"-106.122829","Sighting Duration":"06:32:32","Case Number":"21726","Log Number":"US-01312010-0003","Summary":"See Photo - Red/Blue Lights","trends":["There have been 2 other sightings in Buena Vista","There were no other sightings in Buena Vista on or around January 29th 2010","This sighting has never been favorited.",""],"Disposition":"IFO","Date of the Event":"01/29/2010 12:00 UTC","Region":"Colorado","Object Features":"Unknown","City":"Buena Vista","Object Flight Path":"Stationary","divs":["sighting detailsphoto taken with canon 5d mark ii with canon 35-350mm \"l\" lens tv\\av = 30\\5.6 canon ae iso 200 time and data are correct at my location. the sky was exceptionally clear even for buena vista, co. elevation at my home is 9,300 feet. when leaving for the store i noticed this unusual size \"star\" with a nice mag but thought nothing of it. however, considering the brightness of the moon i took a second look through the lens of the camera. i then took the photo. then i picked up my binocs and looked at the \"stat\" again. the item was brightly colored with red\\blue. but i wasn't concerned!!! i only thought about the coating on the lenses and the possible effects it would have on the image. maybe i missed a great opportunity. now i think i did because i have the 8\" telescope and tripods for cameras to record this item. i think i blew it. i picked up the camera and shot additional frames of the sky for test purposes, but i didn't shoot at the image. my intent was to experiment with the camera and lens to actually be able to take a photo of a ufo. i cam back into the house and continued to get ready for my trip to town. i looked up and the item was still in the same place. but, nothing unusual because it seemed very distant. i made my errand and didn't think much about the \"star\". last night (jan30) i began to think about other reports and colors mentioned. so this morning i looked at the frame again. in the image you can see the diagonal light which indicates movement of the camera for .30 sec. around the frame you will see other diagonal items (stars) which verify the movement. my camera is very heavy for this kind of freehand attempt. the original image was shot in canon raw (.cr2). this image is about 20meg in size so a smaller version is uploaded. download it, blow it up 800% and go figure! i'm not claiming it to be unidentifiable (ufo). i sure has the colors others have mentioned. this is the second report i have submitted in 10 years. occurred : 8\\23\\2000 02:17 (entered as : 08\\23\\00 0217pst) reported: 8\\24\\2000 13:39 posted: 3\\21\\2003 location: vail, az shape: flash duration:5 sec"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.848258,+-106.122829(21726)&iwloc=A&hl=en\"> mufon case (21726) map </A>","Source":"MUFON","Date Submitted":"01/31/2010 12:34 UTC","Tags":"City","Latitude":"38.848258","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"None, Does Not Apply"}