{"Case Number":"2172","Log Number":"","Source":"MUFON","Longitude":"-86.356666","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around March 2nd 2003"],"Date Submitted":"03/02/2003 08:10 UTC","Object Flight Path":"Path with directional change,Unknown","Weather Factors":"Windy","Object Features":"Appendage(s), Other","Disposition":"Unknown","Date of the Event":"03/02/2003 08:10 UTC","divs":["Sighting DetailsMe and my witness heard sirens and went outside to see what had happend, but mywitness noticed something off to the left of us just over the factories by theborder of the town. We walked down the block and observed the craft zig-zaggingleft and right and behind the trees to above the trees and at that moment weboth concluded that this wasnt an airplane. I myself have seen about 3 sightingsin the past 4-5 months, and this is the second time someone has been with me. Iwas ofcourse happy that someone witnessed this with me. we then started to loosesight of it and i know where i have seen them before so i went to the spot,which is a wooded area by the local highschool. We ran up the hill got in my carand drove about 2 min to the school. My witness the pointed out in a kind offear, Oh my god there it is whats it doin It started to get very close to theground and then was at about the tops of the trees about 300 feet away, i couldsee it as plain as day, it was dumbell shaped, unlike any i have seen before,and it had glowing orangeyellow wings and a red light spining underneath it.Best i could relate it to was one of those tie-fighter things offa star wars Icouldnt beleve my eyes. She was scared to go home and begged me not to follow itafter we lost sight of it behind the tree line. So i took her home and as i washeading down the hill, i saw it again I couldnt belive it I have seen thsesbefore, once with my sister and then it was a bunch about 4-7 Glowing balls oflight that were pulsating and actually making a very loud puslsating sound, andthey were in the same area, over the highschool I then have seen another closeup, around the same area i saw yesterday, it wasent the dumbell i saw before, itwas a strange triangle shape, with many yellowblueand red lights underneath it,some blinking some not. I was scared, but curious as ever I dont know why i amthe one to always see these phenomenons but i would like to know why they are inmy area This town is close to an air force base, would that have anything to dowith it These arent airplanes, im sure of it, but why are they hear. When i seethem, dogs normally bark, and my witness from yesterday night said her days cellphone was going crazy, and her dogs start"],"Object Shape":"Other","Country":"United States","Latitude":"40.754484","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=40.754484,+-86.356666(2172)&iwloc=A&hl=en\"> mufon case (2172) map </A>","files":["/var/www/straped/mufon/html2text/2172.html.txt","/var/www/straped/mufon/org/2172.html"],"City":"Logansport","Tags":"City","Viewing Distance":"101-500 Feet","Summary":"A dumbell shaped craft-2 glowing wings, red rotati","Sighting Duration":"00:30:00"}