{"Case Number":"21723","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/21723.html.txt","/var/www/straped/mufon/org/21723.html"],"Source":"MUFON","Tags":"City","Date Submitted":"01/30/2010 11:18 UTC","Region":"Ohio","Longitude":"-82.906003","City":"Undisclosed","Object Shape":"Triangle","Object Flight Path":"Path with directional change","trends":[],"Log Number":"US-01302010-0012","Weather Factors":"Unknown","Latitude":"40.425737","divs":["Sighting DetailsI stepped outside my apartment waiting on my girlfriend to get home and looked to the west sky. I noticed a very bright star changing colors. It kept my attention. There were other celestial objects in the picture, planets, and probaly a star. There were even planes in the area. I live down the street from the airport and I have all my life, so I'm used to seeing Aircraft of all kind. This was different. It was just like a star flickering different colors, frm white, red and blue. at first it seemed as though it wasn't moving, then it shifted directions going south then moving closer toward my direction. I immediately ran upstairs to tell my neighbor to witness the event. He came out and seen the same thing I seen. We witnessed a triangular craft with lights on all three corners and one in the middle. The light in the middle appeared a lite blue. The triangular craft was flying with the two bottom angles moving foward and the one angle on the back. Each corner had a light with the one on the back glowing red. The front two on each corner were white. It flew over with no noise at a normal speed. I could clearly see the triangular shape of the craft as it flew over. The object flew to the east and we lost sight of it."],"Disposition":"Unknown","Viewing Distance":"Unknown","Summary":"Looked like a star at first. It changed colors often. Very bright! It eventually got closer and went overhead as a triangle shaped craft with lights on every angle and one in the middle","Date of the Event":"01/30/2010 06:57 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.425737,+-82.906003(21723)&iwloc=A&hl=en\"> mufon case (21723) map </A>","Country":"United States"}