{"Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet","Date Submitted":"01/31/2010 05:16 UTC","Country":"United States","Log Number":"US-01312010-0002","Tags":"City","Region":"Ohio","Summary":"Triangle shaped ufo's all over that night with lights at each point","Date of the Event":"06/20/1996 08:30 UTC","Case Number":"21725","Object Features":"Undisclosed","Longitude":"-80.643759","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around June 20th 1996"],"Sighting Duration":"Undisclosed","Latitude":"41.10502","City":"Youngstown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.10502,+-80.643759(21725)&iwloc=A&hl=en\"> mufon case (21725) map </A>","Weather Factors":"Unknown","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/21725.html.txt","/var/www/straped/mufon/org/21725.html"],"divs":["Sighting DetailsI'd say i was about 16 or 17 when i saw them. Me and 2 friends were on our was to boardman from new middletown to go to the subway to get food when we saw what looked like 2 headlights in the air next to a radio tower on call road. we thought well thats kinda weird. As we drove by we noticed it was a shiny silver greyish triangle shaped craft with lights at the points. We drove past and it just kinda hovered there like it didnt notice. It was so close to the radio tower that it was almost against it. Awww stuck we decided to drive by again a few times. The last time we drove back toward it being young and dumb i sped up and went into the oppsite lane heading toward it. When i seemed to notice that we knew it was there and we trying to get its attention. the craft started weaving and bobbing eradically in the air in a zigzag pattern and began to rise. When we turned around again the craft to of across the sky faster than anything i guarantee manmade could go. Hitting the horizon in a matter of seconds. So after our fun messing with the ufo we decided to finally go eat. Not really knowing what to think about what we saw. When we left the subway heading back to new middletown we could see another wet of lights above the cornfield in the initial area of the radio towers. We also noticed that there were about 30 people in the gas station parking lot sittin on their hoods and next to their cars watching the object hover in the air. It was at that point you really know your not nuts and other people see what you do. When we tried to get closer to it after leaving the gas station it moved away from the roads this time. These sightings when on for at least 3 days. No one really said anything on the radio or tv but tons of people saw them. Even i skywatcher i know saw serveral of them over cities all over the area. Finally after about 3 days the black silent helicopters started showing up. Flying around with no lights on. The only way i even knew they were there was because you could see their outlines in the light from the nearby city. We also saw a very big craft fly over boardman in the night time. It was huge. Like another sighting i read about it was the size of a shopping mall and silent. There were alot of weird things in the sly after that. Large fireballs honestly it looked like the back of a star destroyer from star wars. Like a row of big firey engines. Those could have been fire baloons i guess after all the hype someone probably thought hey would play a joke or it was attempt to cover up the other ufo's. But i will say i get chills up my back still from thinking about this. Haha, all my house lights are on now. It's scary. And even the old timer that lived by the towers said they show up once in a while. When i told him about them he said \" there back again\" they show up about ever 10 years or so hover around and then the go away again. So i still have my eyes in the sky waiting for them to come back. Besides how many chances do you get to chase a ufo with your car."],"Object Flight Path":"Stationary,Path with directional change,Other"}