{"map":"<A HREF = \"http://maps.google.com/maps?q=-43.527054,+172.640015(21732)&iwloc=A&hl=en\"> mufon case (21732) map </A>","Latitude":"-43.527054","Object Shape":"Unknown","Object Features":"Unknown","Longitude":"172.640015","Country":"New Zealand","Region":"Canterbury","Date Submitted":"02/01/2010 06:04 UTC","Weather Factors":"None","Case Number":"21732","Viewing Distance":"Unknown","Date of the Event":"02/01/2010 11:20 UTC","files":["/var/www/straped/mufon/html2text/21732.html.txt","/var/www/straped/mufon/org/21732.html"],"Log Number":"NZ-02012010-0002","Tags":"City","City":"Christchurch","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Christchurch","There were no other sightings in Christchurch on or around February 1st 2010"],"Source":"MUFON","Disposition":"Unresolved","divs":["Sighting DetailsI was outside having a cigarette and noticed bright lights in the sky coming towards me. I thought they were too bright for a plane and wondered why a plane would be flying this far from the city as we are in the countryside surrounded by hills. I continued to watch it and all of a sudden it changed direction in a 90 degree angle. As it seemed quite low I was listening for sound but heard absolutely nothing and it is a very quiet still night. I noticed also that the lights got no dimmer as it changed direction and seemed to be the same brightness all around it. I then watched it travel very rapidly over the hills still very bright. i saw this from front, side, and the back and the lights stayed the same brightness at all angles. The moon was full and bright and situated in the northeasterly direction. The lights on the object were brighter than the stars and it was not a reflection of the moon as the lights on the object were too bright. I was in a bit of shock after i witnessed the whole event. I then called my husband out after the event, as while I was watching the object i didn't want to move or make a sound. I was in awe as to what i had just seen and described the whole thing to my husband and we went through a list of things it could have been ie.. plane , helicopter, space debris, satellites but none of those applied as there was no noise and too low in the sky for satellites or space debris. We both feel i just witnessed a UFO sighting."],"Summary":"bright lights in sky from south suddenly changed direction heading east low in sky but no sound","Sighting Duration":"Undisclosed"}