{"Source":"MUFON","Viewing Distance":"Unknown","Summary":"Very Big Very Orange Object","Case Number":"21738","Sighting Duration":"Undisclosed","Date Submitted":"02/01/2010 04:25 UTC","trends":["There has been one other sighting in Orangedale","There were no other sightings in Orangedale on or around February 20th 2009"],"Object Features":"Undisclosed","Disposition":"Unresolved","Object Shape":"Star-like","Log Number":"CA-02012010-0008","Tags":"City","Region":"Nova Scotia","Latitude":"45.902232","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.902232,+-61.096977(21738)&iwloc=A&hl=en\"> mufon case (21738) map </A>","files":["/var/www/straped/mufon/html2text/21738.html.txt","/var/www/straped/mufon/org/21738.html"],"Country":"Canada","City":"Orangedale","Object Flight Path":"Undisclosed","Longitude":"-61.096977","Date of the Event":"02/20/2009 09:00 UTC","divs":["Sighting DetailsWas outside in the evening around 9:00pm on febuary 20th 2009 and had a 10 000 000 000 lumen spotlight in my hand and was waving it into the sky and switchin it on and off for no apparent reason.And on the Eastern side of the sky where I was waving the light an object which first resembled a shooting star came into view then it dissapeared and reappeared right above me and stopped;I then knew it was a ufo because I never seen anything so Orange in my life.started to pulsate a bright Orange and slowly moved along the land line and then it just turned itself off.I tried to get it to turn itself back on by waving the light back on and off,and nothing so I turned the light off.Then I yelled into te Air \"you not kidnapping me you evil reptile Bastards\".And to my amazment I felt as if It really heard me.Then while I was heading back into the house the object reappeared for a second and moved at the same speed it came into view then dissapeared.It went over the tree lines at incredible speed and I lost sight of it. Afterwards I felt as If I was being monitored or as if someone was in the room with me for the remainder of that night.But I started reading the bible and prayed.And nothing happen out of the ordinary after that. No photos sorry."]}