{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/21746.html.txt","/var/www/straped/mufon/org/21746.html"],"Country":"United States","Region":"New Mexico","Date of the Event":"01/30/2010 12:00 UTC","Longitude":"-106.648687","Summary":"Albuquerque bright, orange sphere","Date Submitted":"02/02/2010 01:39 UTC","divs":["Sighting DetailsI was outside and my fiancee was in the car looking at the sky through the sunroof. She noticed that some airplanes had left contrails that resembled a pentagram in the sky and told me to look up at it. That is when we noticed a bright, orange light traveling from the northeast towards the southwest. It did not appear to be an airplane and was, in my opinion, traveling much too fast to be a weather baloon. The object remained at a constant brightness the entire time. It traveled straight across the sky and did not seem to change direction. The sky was clear with the exception of a few clouds. It appeared to be traveling below the clouds when we first saw it as the clouds were behind the object. We watched it for about three minutes as it traveled across the sky. Then it appeared to be traveling above the clouds as the clouds were now below the object. We continued to watch for the object but did not see it again after if traveled above the cloud. We felt a little aprehensive while watching it because we did not know what it was and could not rationally explain it. We considered that it may have been an airplane reflecting the sunlight off of it but it was much to bright and perfectly round (no wings)."],"Case Number":"21746","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","City":"Albuquerque","Object Shape":"Circle, Sphere","Viewing Distance":"Unknown","Log Number":"US-02022010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=35.089441,+-106.648687(21746)&iwloc=A&hl=en\"> mufon case (21746) map </A>","Disposition":"Unknown","Latitude":"35.089441","Object Features":"None","Tags":"City","trends":["There have been 129 other sightings in Albuquerque","There was one other sighting in Albuquerque on or around January 30th 2010"]}