{"Date Submitted":"02/02/2010 10:27 UTC","City":"North Massapequa","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02022010-0002","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/21743.html.txt","/var/www/straped/mufon/org/21743.html"],"Longitude":"-73.457978","Region":"New York","Date of the Event":"02/01/2010 09:30 UTC","Object Features":"Unknown","divs":["Sighting DetailsThis sighting last night was only the most recent of my experiances. I have seen many objects over the past few months in the skys over my neighborhood in massapequa,ny. Last night my friend Tom and I were in his car, parked on a side street around the block from plainedge high school. We were bored and having a conversation and a bright ligh cought my eye in the passenger side mirror. I looked at it throught the mirror for a second and realized that it was not a car head light or a light on someones house. I turned around in the car and told Tom and he also started watching. It was headed for us comming from our \"6\" as a Pilot would say, I'd say mabey a few 100 feet in altitude. When we both confirmed with each other that this was strange we both got out of the car. This is where I'm looking for answers, the object started to bank toward the left, mind you very gracefully and SILENTLY, note how I stress the silent because as a young man who watches alot of military channel and discovery channel, and I've been to a couple air shows here on li, I've never seen something fly silently other than a glider. All of the objects I've seen in recent months are silent and it's starting to really scare me. So when it banked the 1 light turned to 3 not a v form but more of a triangle. The object kept pretty strait after the initial bank turn or I'd estimate about 20 degrees or so. The is a fair amount of ground light in the area we were but there was no real outline of the object othere than the lights and it had to be colored black and it definatly didn't have a traditional tail like most planes. I didn't take my eye off the object until it was unviewable due to tree cover, we were parked facing north and the object appeared in the south and went out of view in the north northweast. I don't think this was a traitonal aircraft unless I can be proved otherwise, I'm always open for a feasable and resonable explanation and that is why I'm contacting you. If these things I've been seeing lately aren't alien space craft then what are they. I will tell you that my neighborhood and long island in general is having a heroin epidemic, could these be dea stealths or something I am trying to be open minded but my father said that that's crazier than thinking it's aliens. I don't know what to think anymore all I want is a reply and I invite you to let me discribe in person what I'm seeing, I'm seriously thinking about buying nightvision camcorder because too many people think i'm nuts because everyone is so nieve and never allows themself to think out side the box. It's been a weekly or even multiple time a week thing for me that's why I'm starting to get scared, your help would be appreciated. -Mike from massapequa,ny"],"Summary":"Strange variety of silent \"aircraft\" over the Massapequa area.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.710684,+-73.457978(21743)&iwloc=A&hl=en\"> mufon case (21743) map </A>","Latitude":"40.710684","Country":"United States","trends":["There has been one other sighting in North Massapequa","There were no other sightings in North Massapequa on or around February 1st 2010"],"Sighting Duration":"Undisclosed","Case Number":"21743","Object Flight Path":"Path with directional change","Weather Factors":"None","Tags":"City","Object Shape":"Boomerang, Cigar, Cross, Triangle"}