{"Object Flight Path":"Straight-line path","Country":"United States","Object Features":"None","Longitude":"-89.282079","Log Number":"US-02022010-0006","City":"Hattiesburg","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/21747.html.txt","/var/www/straped/mufon/org/21747.html"],"Summary":"Bright white light that faded to red and disappeared.","divs":["sighting detailsmy wife and i witnessed what we believe to be a sighting we could not explain. we live in purvis, ms. on january 22, 2010 around 6:30 p.m. we were outside in the driveway cleaning out a car we were selling. i was on the phone at the time talking to the guy buying the car. he was on the road between laurel and meridian ms. while talking to him, i turned facing north because i saw what i thought was a very bright star in the sky. i pointed it out to my wife and we both noticed it moving in a south east direction. our first thought was an airplane, so we didn't think much of it. as it got closer, it looked as if it was flying really low for an airplane. we couldn't see any of the normal blue and red lights on it, which of course got both of us wondering what it was. i started talking about it to the guy on the phone. he said he had also seen it from his location not more than 5 minutes ago. we watched it as it passed over us thinking it might be a helicopter, but it had no sound at all coming from it. as it got a little past us it blinked from a white light to a red light that lasted for maybe two seconds and then disappeared. we have asked a couple of people if they were aware of any night missions in the area that night, but nobody from our location knows of anything. we are both in the military stationed here at camp shelby, ms. i just wanted to see if anybody has any info about this. i have never seen a ufo and i don't think this was extraterrestrial. it's just something i can't explain. 1. outside my home cleaning out a car. 2. it looked like a bright star that was not normal for that area. 3. a star\\planet 4. bright white light traveling southeast. it turned red before it disappeared. 5. not sure what i just witnessed. 6. it disappeared."],"Date Submitted":"02/02/2010 01:50 UTC","Date of the Event":"01/22/2010 06:30 UTC","Disposition":"Unknown","trends":["There have been 10 other sightings in Hattiesburg","There were no other sightings in Hattiesburg on or around January 22nd 2010"],"Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=31.329709,+-89.282079(21747)&iwloc=A&hl=en\"> mufon case (21747) map </A>","Viewing Distance":"501 Feet - 1 Mile","Case Number":"21747","Latitude":"31.329709","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed"}