{"Country":"United States","Sighting Duration":"01:00:00","Source":"MUFON","divs":["Sighting DetailsDriving home again from Bensalem exit on 95 north to Bristol I saw the objectsagain.First it was 2 craft flashing lights white colored. I follwed the lightsdown Route 13 to Levittown Pkwy. I saw one or two more heading in the directionof Lakeside Section they looked triangle shaped with red and white lightsblinking. I decided to turn back to Levittown Pkwy and towards Stonybrooksection. my home section I turned into my street and I noticed they werefollowing me. I parked in my driveway and gazed into the shy. There were severalcraft manuevering in many directions. Some with pulsating red and white lights,others with steady white lights. Two craft with quick flashing white light. ThenI noticed several more craft which seemed to be circling and moving left toright and right to left. One was actually hovering about treetop height behindmy car. Another passed it. I counted close to 9 craft total at one glance. Therewere so many my mind was spinning. I picked up a faint red beam from one of thecraft for about a split second. They passed each other in all sorts ofdirections. Some moved in formation. Some went in and out closer than furtheraway. Some made an effort to deliberately fly close by overtop of my car.Strangely the more I report this to you the more I see and the closer they come.Im hoping one might land for me soon. So I can know what or who it is. I know wehave a looming war with Iraq and N Korea, so I dont know if these are justmilitary exercises or genuine UFO."],"files":["/var/www/straped/mufon/html2text/2174.html.txt","/var/www/straped/mufon/org/2174.html"],"City":"Levittown","Region":"Pennsylvania","Disposition":"Insufficient Data","Date Submitted":"03/06/2003 09:45 UTC","Object Shape":"Unknown","Log Number":"","Weather Factors":"Unknown","Longitude":"-74.819775","Latitude":"40.15924","map":"<A HREF = \"http://maps.google.com/maps?q=40.15924,+-74.819775(2174)&iwloc=A&hl=en\"> mufon case (2174) map </A>","Case Number":"2174","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around March 6th 2003"],"Summary":"9 craft look like planes others tringle and cigar","Tags":"City","Viewing Distance":"20 Feet or Less","Object Flight Path":"Unknown","Object Features":"Undisclosed","Date of the Event":"03/06/2003 09:45 UTC"}