{"Country":"United States","Viewing Distance":"Over One Mile","Object Features":"Unknown","Case Number":"2175","trends":["There have been 11 other sightings in Palmdale","There were no other sightings in Palmdale on or around March 6th 2003"],"Date of the Event":"03/06/2003 09:51 UTC","Weather Factors":"Windy, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.579434,+-118.116461(2175)&iwloc=A&hl=en\"> mufon case (2175) map </A>","Object Flight Path":"Straight-line path","Tags":"City","divs":["Sighting Details1 Travelling North on hiway 14 in Palmdale just past the palmdale blvd. exit2 I noticed one bright round light off to the left then two other lightsappeared to form an unequal triangle. The long point of the triangle was facingin an easterly direction.3 My initial reaction was that there was a flight of three aircraft.4 My reactions were pretty much involved in trying to see this object better outmy cars window. I thought about telling the security guard at a local gorcerystore about what i had seen but decided that no one would believe me.5 First of all--this object, was five miles north of my viewing area and couldhave been much further. I really cant estimate the size other than it must havebeen three or four football lengths. The three balls of light were fairly roundand as bright as a typical aircraft landing light but much larger. Within thethree balls of light was an almost indistinguisable yet observed dark grey orblack structure. The long point of the object seemed to be facing eastwardbriefly but rotated in two axes towards the north. It appeared to movenorth. The three lights faded very quickly and completely disappeared.6 I list sight of the object when it disappeared."],"Object Shape":"Triangle","Log Number":"","Region":"California","Summary":"SIGHTING NEAR PALMDALE","Date Submitted":"03/06/2003 09:51 UTC","Source":"MUFON","Disposition":"Unknown","Sighting Duration":"00:00:59","Latitude":"34.579434","City":"Palmdale","Longitude":"-118.116461","files":["/var/www/straped/mufon/html2text/2175.html.txt","/var/www/straped/mufon/org/2175.html"]}