{"files":["/var/www/straped/mufon/html2text/21757.html.txt","/var/www/straped/mufon/org/21757.html"],"Tags":"City","Object Flight Path":"Stationary,Path with directional change","Source":"MUFON","Latitude":"35.071794","Date of the Event":"06/02/2008 07:00 UTC","divs":["Sighting DetailsMe and my wife had just sent the kids out the door, to catch the school bus @ their grandfathers, an me and my wife had 2 hours before we had to be anywhere, she went to the restroom only a few minutes after the kids left, I looked at the clock to confirm our time, and time had gone, we had to leave immediately to get to where we was going. Later that day we thought maybe we had made a mistake, but the kids came in and said, (did yall see the ufo this morning in the sky?)That got us to thinking about it a little more, all this happened about 2 years ago, and since we wondered if it was just in our heads, about a week after that my dad told my wife he had seen a strange craft in the sky, but later that day when I got home, he could not recall seeing anything. About 3 or 4 months ago we were coming home late a night, when we turned into our long driveway, we seen bright lights like a hellicopter at the end of our drive, and in front of my dads front yard, as we sped towards it, it flopped left and right like nothing I had ever seen through the woods at tree top level, towards a main highway, I also noticed as we got closer and it was leaving, that it did not have lights like a hellicopter, more like a circling light that went around it, I could not tell the shape though, and as time went by we just forgot about it. It seems like the more you wait and not tell anyone, the easier it is to think maybe you really didnt see anything. If I could afford it, me and my wife would be hypnotized just to see if anything was to it. But with our jobs it would not pay for this info. to be released. Hope you can answer some of the questions...Thanks"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.071794,+-81.64982(21757)&iwloc=A&hl=en\"> mufon case (21757) map </A>","Disposition":"Unknown","Log Number":"US-02032010-0002","Longitude":"-81.64982","Summary":"Me and my spouse loss of time. Kids seen strange object in sky the same day.","City":"Gaffney","Object Features":"None","Viewing Distance":"21-100 Feet","Object Shape":"Disc","Weather Factors":"None","Date Submitted":"02/03/2010 04:09 UTC","trends":["There have been no other sightings in Gaffney","This sighting has never been favorited."],"Region":"South Carolina","Country":"United States","Sighting Duration":"02:00:00","Case Number":"21757"}