{"files":["/var/www/straped/mufon/html2text/21751.html.txt","/var/www/straped/mufon/org/21751.html"],"Viewing Distance":"Unknown","Country":"United States","Date Submitted":"02/02/2010 07:08 UTC","Log Number":"US-02022010-0010","City":"Fort Myers","Summary":"Humming noise like a generator or jet running...very constant, like it was hovering overhead but I couldn't see anything. It was a cloudy night.","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsMy husband went to bed early that night about 9:30 PM and I decided to stay up and watch TV. Around 10:30 PM or so I kept hearing a very unusual sound. Intially, I thought it was perhaps an airplane flying over the house..which isn't unusual. However, I noticed that the sound was very different and it didn't come and go..and fade out like a normal airplane would do as when one would normally approach and fly over. It was a very constant hovering humming type of sound, like it was right overhead. Trust me, it wasn't an airplane or a helicopter..I can recognize these quite easily. It sounded like a huge generator or like a jet does when it is sitting still at the airport. I kept thinking, it can't be a plane, it would have faded out by now and the sound was quite different. So, I muted the TV and sat and listened, I went to the front window, saw nothing, went to the rear of the house and looked out the back window, saw nothing. So, I decided to go outside. I walked down the walk to the house because I couldn't figure out this odd noise, the wind was blowing the trees and I was looking around to see if I could see anything, but I didn't. I was just looking towards the front skies. The sound was so different and constant. I walked down the drive and suddenly the noise just very quickly shut off. It was weird, like someone flicked a switch. All of a sudden all the trees and air became very still and the winds stopped and I got chills up the back of my neck and just knew something was going on..very strange. I just ran into the house screaming for my husband, I woke him up but he wouldn't get out of bed. He thought I was crazy and told me to go to bed. I went back out into the den and looked out the window again and the wind was blowing again...and the noise started again, but this time only lasted a minute or so and it was gone. Remember, I never saw a thing, it was the sounds that I heard..but I really didn't look all around..just towards the North. It didn't dawn on me until later that it could have been an UFO. My husband doesn't want me saying anything to anyone, but I can't help but write this letter to you, because deep down inside me, I know something very strange and unusual happened that night. He doesn't want people showing up at the house. Has this type of incident every been reported before? I am a little concerned over giving out my address to third parties. My phone number and email would be OK."],"Longitude":"-81.867288","Region":"Florida","Tags":"City","Case Number":"21751","Source":"MUFON","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.649848,+-81.867288(21751)&iwloc=A&hl=en\"> mufon case (21751) map </A>","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around January 31st 2010"],"Object Shape":"Unknown","Date of the Event":"01/31/2010 10:30 UTC","Latitude":"26.649848"}