{"Object Features":"Unknown","trends":["There have been 4 other sightings in Brighton","There were no other sightings in Brighton on or around January 1st 2010","This sighting has been favorited 1 time.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=50.851101,+-0.127412(21754)&iwloc=A&hl=en\"> mufon case (21754) map </A>","Region":"England","Latitude":"50.851101","City":"Brighton","Tags":"City","Source":"MUFON","Date of the Event":"01/01/2010 07:30 UTC","Date Submitted":"02/02/2010 11:20 UTC","Longitude":"-0.127412","Case Number":"21754","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/21754.html.txt","/var/www/straped/mufon/more/21754_submitter_file1__map.jpg","/var/www/straped/mufon/org/21754.html"],"Object Flight Path":"Path with directional change","Disposition":"Unresolved","Object Shape":"Sphere","Weather Factors":"Unknown","divs":["Sighting Detailswhile eating mcdonalds on the roof of the multistorey carpark at brighton marina, a friend and i observed an orange sphere come from over the horizon, to the west, and travel in an easterly direction along the line of the coast. as it moved towards us it seemed to change to a south easterly heading and move out to sea. as it grew fainter another sphere appeared from the west and followed the same course. over a 25 minute period we observed 5 spheres do this and another 3 came directly overhead, from the north, heading in a south, south easterly direction and also heading out to approximately the same area of the sea. the 3 that came directly overhead made no sound and seemed to be at about the same height as a light aircraft although as it was dark it is hard to be precise. friends i have told have dismissed these objects as chinese lanterns but i do not believe this for 2 reasons: firstly, at one point i observed one of the spheres overtake another slower moving one. if these were lanterns drifting in the wind, how could one be moving so much faster than another? and secondly, the 3 that came from the north originated from a completely different direction, many many miles away from the 5 that came from the west and were travelling on a different bearing also. surely this would not happen if they were drifting in the wind? from what i saw, i believe these objects were travelling under their own power and all seemed to be heading out to the same area of the sea where they grew fainter and eventually dissapeared from view. before this experience i had no particular interest in ufo's but what i saw felt 'other worldly' and i only regret i didnt have a camera to capture it."],"Summary":"8 orange orbs","Sighting Duration":"00:25:00","Viewing Distance":"Unknown","Log Number":"GB-02022010-0013"}