{"Object Flight Path":"Undisclosed","Region":"California","Log Number":"US-02042010-0001","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/21768.html.txt","/var/www/straped/mufon/org/21768.html"],"Longitude":"-120.831024","Date Submitted":"02/04/2010 03:23 UTC","City":"Baywood-Los Osos","Latitude":"35.322508","Sighting Duration":"Undisclosed","Date of the Event":"02/03/2010 10:30 UTC","trends":["There has been one other sighting in Baywood-Los Osos","There were no other sightings in Baywood-Los Osos on or around February 3rd 2010"],"Case Number":"21768","Disposition":"Insufficient Data","Weather Factors":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.322508,+-120.831024(21768)&iwloc=A&hl=en\"> mufon case (21768) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsArriving home from a trip to Santa Maria, my brother and I were admiring the stars in an unusually clear sky. The location of his home, being well away from the city made for very little or no light pollution so we could even see the billowy dust lane of the Milky Way. My brother told me to look just to the right and above the constellation Orion because he had seen a flash there. Sure enough, the next time it flashed I saw it as well. A few seconds later there was a third flash. These flashes were no brighter than the stars in Orion, with the intensity seeming to vary somewhat each time. The color seem to vary each time as well. I detected amber, green, blue and a grayish white at various times during this sighting. My brother began counting between flashes, \"one-thousand, two-thousand, three-thousand...\" We found that the flashes were almost exactly ten seconds apart. After many flashes I detected that the position of the flash was now changing slightly with each flash. Over the course of one half hour the flash moved from a position directly in line with the three stars in Orion's sword, above and to the right of Orion's belt to a position still above but to the left of Orion. By this time, the brightness of the flashes was quite dim, although they were definitely still detectable. We then carried our stuff into the house, coming out about a half hour later to check on the anomaly, but the flashing was no longer goin on."],"Tags":"City","Object Shape":"Flash, Star-like","Country":"United States","Summary":"Continuous single flashes every ten seconds near the constellation Orion lasting at least 30 minutes."}