{"Region":"Ohio","Date of the Event":"03/07/2003 02:20 UTC","Country":"United States","Log Number":"","Latitude":"40.234231","Summary":"Silent triangular object","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2176.html.txt","/var/www/straped/mufon/org/2176.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.234231,+-82.45127(2176)&iwloc=A&hl=en\"> mufon case (2176) map </A>","Sighting Duration":"00:05:00","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Shape":"Triangle","divs":["Sighting DetailsI work 2nd shift till 1100 pm or later and had left work, in Columbus OH, aftermidnight and gone to shop in Newark before going home. I was only about 1 milefrom my house, traveling NE on County Highway 17 Reynolds road at approximatly220 am on Friday, March 7, 2003. The road is fairly deserted with only a coupleof farms along its length and the point I noticed the object was in between twoof the farms where there is only empty fields. As I topped a hill I noticed whatI at first assumed to be a plane very low in the sky approching me following theroadway. It was traveling NW and was just to the north side of the road. As Icontinued moving, I realized it was only barely moving, almost hovering but sortof drifting only a couple of miles per hour. I then thought it was a helicopterand was wondering what one would be doing at that place and time so I stopped myvehicle and pulled to the side of the road to check it out.After looking closer, I was pretty sure it was not a helicopterI used to volunteer on a local emergency squad and had seen medical helicopterscomming in at accident scenes and this did not resemble those at all. I turnedoff the radio and rolled down the window to hear what it sounded like andrealized that it was totally silent outside. I then turned of the engine so Icould hear better and still heard nothing. This is what really piqued my intrestbecause in that area at 220 a.m. you should be able to hear anything that was asclose as this was. I can usually hear dogs barking that are three quarters of amile away or more in conditions like there was at that time.I could see the siloet of the object aginst the sky and it appeared very clearlytriangular, with a white light at each point of the triangle and blinking redlights in a circular pattern within the triangle. The only thing triangle shapedthat could fly with no sound, that I know of, is a hang-glider and this was 2 to3 times that in size and considering the temperature as my thermometer in mytruck showed was 12 deg F., it would have had to have been a very hardy personto be flying one of those.I have never seen anything I would call a UFO before and dont beleive in alienvisitations or things like that, but I have no idea what this thing could havebeen and figured that it couldnt hurt to report it.Thank you,James Landis"],"Tags":"City","Longitude":"-82.45127","Object Flight Path":"Straight-line path","City":"Utica","Date Submitted":"03/07/2003 02:20 UTC","Weather Factors":"Unknown","trends":["There have been no other sightings in Utica","This sighting has never been favorited."],"Disposition":"Unresolved","Case Number":"2176"}