{"Weather Factors":"Unknown","Object Shape":"Circle, Disc, Other","Viewing Distance":"Unknown","City":"Indianapolis","Date Submitted":"02/03/2010 11:03 UTC","Sighting Duration":"00:15:00","Region":"Indiana","Case Number":"21765","Latitude":"39.771616","Summary":"Refracted ring or disc appears with holographic images.","Date of the Event":"02/02/2010 10:30 UTC","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around February 2nd 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Log Number":"US-02032010-0010","Longitude":"-86.151834","divs":["Sighting DetailsI was at Allison Transmission on 10th street walking toward the east around 10:30 am and I noticed a light ball off in the distance in front of me which I've seen many times before. I stopped to look around and to look for anything unusual and when I looked almost straight up I noticed a colored ring or semi-circle right above me. I could see what looked like some type of holographic image in it or above it but couldn't make it out at the time because it was so bright out. I took several photos of the object and kept walking as I was working at the time and needed to go inside the building. When looking at the photos later and enhancing the brightness and contrast levels I could clearly see some holographic images. My first thoughts were that this image was from the hand of God and I had been given a message to share. What the message is I am unsure of but it seems important considering everything that is happening in the world today so I am putting it out there for all to see. The first photo is unedited with the brightness and contrast adjusted to enhance the image. The second photo is the raw photo directly off the SD card with no adjustments."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.771616,+-86.151834(21765)&iwloc=A&hl=en\"> mufon case (21765) map </A>","Disposition":"IFO","Country":"United States","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21765.html.txt","/var/www/straped/mufon/more/21765_submitter_file1__IMG_9024b.jpg","/var/www/straped/mufon/more/21765_submitter_file2__IMG_9024.JPG","/var/www/straped/mufon/org/21765.html"],"Object Features":"Undisclosed"}