{"Longitude":"-114.310752","Viewing Distance":"Over One Mile","Summary":"Metallic objects randomly jerking around range ~15mi alt ~4-6,000ft","Sighting Duration":"00:05:00","divs":["Sighting DetailsI am a pilot, fairly scientific and very techically inclined. The most unexplained phenomena I have ever observed follows. At the time, I was about 17yo and had been flying hang gliders for about 5 years, was expert in meteorology, as well as very observant and knowledgeable about sky conditions. It was a very clear day, sometime between around 10:30am to perhaps 13:00, gauging from the southern altitude of the sun. There were no cirrus clouds or any clouds of any type, and the sky was a high pressury pale blue, not bright blue, although it was quite bright. I was indoors perhaps watching tv. Early in the summer, sometime around 1976-77, my mom called me into our living room which had a large picture window on a second story with a clear view of the northern sky. I am not sure why, but she had noticed some objects (about 5?-never actually counted) that appeared fairly small to the eye at a range of what appeared to be 5-15 miles and an altitude of about 3-5,000 feet at about NNW about 5\" at arms length above the horizon. At first they appeared to be birds, because they were 'darting' about. But after watching for a minute or two, it was baffling because they were not moving in any pattern any bird could or would fly. I would estimate the objects to be possibly the size of a medium size tv(difficult to estimate), but certainly larger than seagulls. Watching further, there appeared to be greyish, and metallic qualities to them. Keep in mind this was over 30 years ago, but I remember it fairly clearly. I cannot remember if I actually saw reflected 'glints' from sunlight, but the appearance at the great distance was that of metal. As I recall, it appeared to be like crumpled balls of aluminum foil, but not as shiny. The distance, altitude, shape and composition was difficult to ascertain, being at some altitude in the sky with no close reference to gauge by. I do not believe they were seagulls, because that was my first impression, but there movement was far too erratic to be seagulls, and they seemed to be solid with no evidence of wings, as well as motion that seagulls could simply not accomplish. But the pattern of movement was jerky and sometimes circular, initially suggesting birds. But further observation showed the motions to be quite unnatural. Being a pilot, I considered perhaps that it was a dust devil at altitude with debris picked up from the ground. But, I dismissed this with the irregular motion which was sometimes quite linear, and sometimes with fairly high accelleration, immediately changing to a circular arc both in horizontal and up and down directions. I have seen thousands of dust devils, and many, many debris objects caught in dust devils, but the objects would move horizontally, and sometimes upwards diagonally, and sometimes in curved motions, from my vantage point several hundred feet in any direction, an possibly if my distance estimate is correct up to 1000' laterally; the motion was unnatural in that the vertical and horizontal motions were of fairly high and incredible (way beyond a seagull or debris) accelerations, beyond what a bird could accomplish and sometimes with sharp angular vector changes, which would suggest a significant direct force, but these motions were confined to an 'area' where the multiple objects stayed within a rough group, but with no apparent connectedness, except that they appeared similar and none departed from the 'group'. They also appeared to remain at a fixed altitude and did not rise or descend, but occupied an area about the size of the tip of your little finger at arm's length. There seemed to be enough resolution that there were no wings, as that of birds observed, but that the objects were solid bodies with no moving parts, and appeared to be metal, but the shape was undeterminable. In conclusion, having observed thousands of aircraft, dust devils, birds and other things, I still cannot determine what the objects were. We discussed what we were seeing, and because it was indeterminate and difficult to focus at the distance, we became bored and stopped watching at some point. Looking again in few minutes, I was unable to spot the objects again. At the distance, unless you had it pointed out to you, you would not have noticed on casual observation, because of the fairly small size against the sky. The key points are that there were multiple objects (5-9?), the motion of the objects was very irregular, but confined to one area, and their motion had sharp changes in velocity and acceleration, and appeared metallic. I observed the objects in detail, but due to the distance, I am still puzzled as to what we observed. My mom passed away, so she can not offer testimony. I know that I definitely observed something, and any conceivable explanation in my mind does not satisfy my observation. I have not had a reputable avenue for reporting this observation, so now I submit it to your independent database of observations. See attached sketch diagram.."],"Object Features":"None","Date Submitted":"02/03/2010 06:01 UTC","Log Number":"US-02032010-0008","Date of the Event":"06/01/1977 01:15 UTC","Weather Factors":"None","trends":["There have been 4 other sightings in Kalispell","There were no other sightings in Kalispell on or around June 1st 1977","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change,Path then hovering,Other","Country":"United States","Region":"Montana","Case Number":"21763","Latitude":"48.209511","map":"<A HREF = \"http://maps.google.com/maps?q=48.209511,+-114.310752(21763)&iwloc=A&hl=en\"> mufon case (21763) map </A>","City":"Kalispell","Tags":"City","Source":"MUFON","Object Shape":"Other","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21763.html.txt","/var/www/straped/mufon/more/21763_submitter_file1__UFOobservationdetail.jpg","/var/www/straped/mufon/org/21763.html"]}