{"Date of the Event":"01/27/2010 08:45 UTC","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.598062,+-89.907682(21760)&iwloc=A&hl=en\"> mufon case (21760) map </A>","Viewing Distance":"101-500 Feet","Longitude":"-89.907682","Case Number":"21760","Tags":"City","Summary":"Black triangle with white lights","Object Features":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Region":"Illinois","Weather Factors":"Snow, Light","trends":["There have been 4 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around January 27th 2010"],"Log Number":"US-02032010-0005","Date Submitted":"02/03/2010 03:19 UTC","Latitude":"38.598062","divs":["Sighting Details My husband and I had just pulled into McDonalds parking lot and stopped the car. I looked up and directly in front of us was a Petsmart. Right over the top of Petsmart I saw three REALLY bright white lights. They were very low and seemed to be sitting still at first. I thought maybe it was just a very low airplane coming straight and that's why it seemed to be moving slow. Then I could tell it was getting closer, and I even made the comment to my husband, \"If thats an airplane it's awfully low.\" I had looked at the clock and it said exactly 8:45. My husband I both sat and watched it and it was taking forever for it to get to us, considering it was so close to begin with...I looked back at the clock and it was 8:48 and was just getting to be almost directly over our car. My husband got out and went on inside the store (he said he thought it was strange, but he's not really interested in this kind of thing) and I sat in the car and still watched it. I rolled down the windows of the car and there was NO sound at all...even though it almost directly above the car and I could tell at this point that it was a black triangle shaped object. It was just HOVERING...not making a sound, no engine noise or anything. It was really eerie to watch it just gliding along completely silent. It was still moving really slowly and as it banked (sort of like the jets do in the air shows) and got further away, I looked at the clock again and it was 8:51. I watched it till it got far enough away that it was hard to see. It was 8:58 whenever I stopped watching. I had my cell phone with me and WANTED to take a picture of it, but for one, I've never taken a picture with my cell phone and didn't want to try at that moment to figure it out. Also, I was in total awe of this thing. It was SO pretty and SO huge. I really didn't want to stop watching it, and except for glancing at the clock a few times, I just wanted to keep watching...when it 'banked' to turn it was incredible. It was just gliding along completely silent...my husband estimated it to be no more than 300 feet in the air."],"City":"O'Fallon","files":["/var/www/straped/mufon/html2text/21760.html.txt","/var/www/straped/mufon/org/21760.html"],"Disposition":"Insufficient Data","Object Shape":"Triangle"}