{"files":["/var/www/straped/mufon/html2text/21777.html.txt","/var/www/straped/mufon/org/21777.html"],"Date of the Event":"06/30/0001 12:00 UTC","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","Region":"Saskatchewan","City":"Prince Albert","Latitude":"53.203349","Country":"Canada","Case Number":"21777","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Summary":"moving bright light","Object Features":"Undisclosed","Log Number":"CA-02052010-0001","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=53.203349,+-105.75307(21777)&iwloc=A&hl=en\"> mufon case (21777) map </A>","divs":["Sighting Detailsi see objects almost every single night i do not know what they are i have had several different encounters once it was two bright lights one just floated in the air and another one came out of no where and flew right over my house very fast and stopped in mid air made no sound there was an air craft also that had one light in the back that stayed on and one on each side that took turns flashing with one in the front it flew right over my house it was not very high and made no sound at all i seen it close up twice i see these light's every single night when the sky is clear i have seen so much ufo's this year and i have never seen any before in my life! i just wish some people who are interested in this phenomemon would come and see for urself! im not sure what they are im not saying i'v seen aliens but i'm saying i see ufo's every time the sky is clear the people i tell all shrug it off for a reason i do not understand , mabye fear or maybe they just do not have the mental capacity to fathom such an occurance! i guarantee you will see these objects if you visited this little reserve in the middle of canada, it is in the bush basicly in the middle of no where! i have been facinated every since and i look up everything i can about the topic that is how i found this site, i'v seen your shows on tv where you people go to investigate these sightings so please listen close if you want to see a ufo with your own eye's visit this reserve i guarntee that you will see these objects because they are out here every single night! i have seen em so much that i am used to it!"],"Source":"MUFON","Longitude":"-105.75307","Date Submitted":"02/05/2010 01:03 UTC","trends":["There have been 3 other sightings in Prince Albert","There were no other sightings in Prince Albert on or around June 28th 0001"]}