{"divs":["sighting detailswe were driving from texas to florida for vacation. my dad was driving the car and woke me up in the back seat asking me what i thought this could be? my mother was in the passenger seat. i we continued to look we all agreed that maybe it was a water tower but that wasn't adding up. all of a sudden it shot across over a lake clear as day and just hovered. i knew it wasn't from earth instantly. i just kept saying [cms\\tg\\pd]. my parents didn't say anything about the language i was using since they were also completely startled. it was as it was looking right back at us. i don't remember seeing any light around it but it was a disc shaped object. i all distinctly remember is how it took off. i remember something coming out of it as it exited the atmosphere. it was like a spark of some sort and then it vanished. it was a truly amazing and life changing experience that i will never forget. i have told many people this story in which they believe me but can never truly understand the affect of seeing one for themselves. i always bring it up to my parents and we all know what we saw but know we are not alone and that is all. i had a good minute to a minute and a half looking at this so i'm 100% on what i saw. i always am looking up in the sky looking for another craft as my wife and i are driving. i really want her to get to see what i saw when i was a child. it is a life changing experience to say the least. i'm obsessed with ufo's and always have been after this moment!"],"Object Shape":"Disc, Sphere","files":["/var/www/straped/mufon/html2text/21779.html.txt","/var/www/straped/mufon/org/21779.html"],"Country":"United States","Summary":"It was a disc shaped object hovering over a Lake Charles casino bright as day.","Longitude":"-93.214316","City":"Lake Charles","Latitude":"30.235355","Source":"MUFON","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around June 10th 1995"],"Case Number":"21779","map":"<A HREF = \"http://maps.google.com/maps?q=30.235355,+-93.214316(21779)&iwloc=A&hl=en\"> mufon case (21779) map </A>","Region":"Louisiana","Date Submitted":"02/05/2010 06:57 UTC","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Log Number":"US-02052010-0003","Date of the Event":"06/10/1995 12:00 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City"}