{"Date Submitted":"02/05/2010 06:33 UTC","Case Number":"21783","Weather Factors":"Unknown","Object Shape":"Disc, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/21783.html.txt","/var/www/straped/mufon/org/21783.html"],"Log Number":"US-02052010-0007","City":"Wichita","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.694096,+-97.335245(21783)&iwloc=A&hl=en\"> mufon case (21783) map </A>","Date of the Event":"10/23/1973 12:00 UTC","trends":["There have been 39 other sightings in Wichita","There were no other sightings in Wichita on or around October 23rd 1973"],"Tags":"City","Longitude":"-97.335245","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"Unknown","Region":"Kansas","divs":["Sighting DetailsWe were riding my harley to a party at Cheney Reservoir around 8:30pm on or about October 23, 1973, in any case, it was a Friday night. We were headed west on 21st Street North barely outside of Wichita, Kansas. I stopped my bike on a dirt road intersection to relieve myself. I was a flight-line mechanic at the Cessna Aircraft Factory at Mid Continent Airport (ICT) in Wichita, and a student pilot, so I was watching incoming planes. That night there must have been a slight south wind, because the aircraft were headed south to land on runway 19 left. Donna and I saw an orange ball just sitting there, seemingly in the way, or the approach path to land. We both watched for a few moments and shrugged it off. As I swung a leg over the seat to start the sportster Donna waited to get on until I kickstarted the bike. She then told me that as she watched me start it, it got darker around me, as if the UFO had somehow lit the area around us, as if watching us. Again, we shrugged it off and rode on toward the party, not knowing we would never get to that party. As we continued down the two lane blacktop, we looked over our shoulders to the east, and it kept the same relative position to us. It was following us. TO MAKE A LONG story short, the ordeal lasted until we thought it was midnight, it was three am. I could think a question, and it would move west for yes, east for no, and north and south if it didn't understand or want to answer. A few days later, a local radio station,KEYN, had a call in talk show on UFO's. A woman from El Dorado,KS. called in and reported that she had had almost the exact same experience a few days before we did, but we did not hear her storty until after we had also experienced the same self-explanitory telepathic orange sphere. (With at least one three foot smaller \"scout\" UFO. It changed our lives. Hers for the worse, and I have had some terrible nightmares over the years, but I feel lucky to have had the experience. One question it answered positivly, was that I would see it again someday. Since Donna and I grew up together, and I knew she was our Senior Valedictorian, and I was the Senior Class President, we had some credibility, but did not want to tell anyone. I am now on disability and plan to write a book about the whole story. I thought the UFO was here for her, due to her high I.Q., until about five years ago when we got together for the first time in years, when she told me she knew all along that it was here for me. I guess I am the one that it suggested telepathy to and with. We both always sort of doubted what happened, a sort of denial, but every few years we go out to eat and see a movie, but the conversation inevitably ends up with us reliving that night and talking for hours about it. I am sending this report to MUFON now because I recently had cancer and want to tell it before I die. I'm cancer free now, but I had a taste of mortality, and it sucks."],"Source":"MUFON","Latitude":"37.694096","Viewing Distance":"Unknown","Country":"United States","Summary":"Girlfriend and myself on motorcycle observed UFO observing us. Had telepathic communication for hours. Three foot diameter smaller orb followed 500' behind us. Orange with other colored lights circling it on larger UFO."}