{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/21789.html.txt","/var/www/straped/mufon/org/21789.html"],"divs":["Sighting DetailsI left my house and was driving through Langhorne, Pennsylvania. The direction I was traveling in was the direction from the Sheraton Hotel to LA Fitness on North Oxford Valley Road. It was late at night, around 10:30-10:35 ish. I noticed a huge rigid, spherical light in the sky on the horizon past LA Fitness. It was emanating lights and glows like a small star would, only this large light object was high in the sky and was not the size of a star at all. No quick movement came from the object, it was moving slow. I would like to tell you that I was able to understand its path of direction but I lost site of the object a few times because of tall buildings and trees as I was driving. It wasn't a plane because it was a lot larger than the two other planes I saw in the sky moving at the same time this object was; so I was able to compare both the airplanes and this large light object. I watched this light for about four minutes and then it disappeared, no more light emanated anymore and I couldn't see the object either as well. When it disappeared, I was able to get a full view of it as it disappeared since there was nothing in my way (buildings, trees etc.) at all at that time when I was nearing toward LA Fitness. The feeling I felt was, I finally got to witness a UFO sighting. It all caught me by surprise and I told another man at the gym what I saw and he said he saw the same thing. I explained to him what I saw and he said \"Yeah, what was that?\". He said it didn't look like a plane at all to him because of the size but he did not see it disappear because he got to the gym before I did. I think he brushed the situation off his shoulder, he wasn't as enthusiastic as I was about the object."],"Latitude":"39.955205","Sighting Duration":"Undisclosed","Longitude":"-75.156759","Date Submitted":"02/06/2010 11:11 UTC","Country":"United States","Date of the Event":"02/03/2010 10:34 UTC","Log Number":"US-02062010-0004","Region":"Pennsylvania","Tags":"City","Weather Factors":"None","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around February 3rd 2010"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=39.955205,+-75.156759(21789)&iwloc=A&hl=en\"> mufon case (21789) map </A>","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Source":"MUFON","Case Number":"21789","City":"Philadelphia","Object Shape":"Sphere","Summary":"Large, Rigid, spherical shape that eminated glows like a star."}