{"Longitude":"-74.78794","Object Shape":"Cylinder, Flash","Disposition":"IFO","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"02/03/2010 08:13 UTC","files":["/var/www/straped/mufon/html2text/21788.html.txt","/var/www/straped/mufon/more/21788_submitter_file1__ufosnow2310.JPG","/var/www/straped/mufon/more/21788_submitter_file2__snow1min6secondsafter.jpg","/var/www/straped/mufon/more/21788_submitter_file3__snowsquirrel.JPG","/var/www/straped/mufon/org/21788.html"],"Log Number":"US-02062010-0003","Summary":"Flash glow for a minute or more.","trends":["There have been 5 other sightings in Morrisville","There were no other sightings in Morrisville on or around February 3rd 2010","This sighting has never been favorited.",""],"Weather Factors":"None","Case Number":"21788","Object Flight Path":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.211498,+-74.78794(21788)&iwloc=A&hl=en\"> mufon case (21788) map </A>","Tags":"City","Sighting Duration":"00:01:08","Country":"United States","Date Submitted":"02/06/2010 10:25 UTC","Latitude":"40.211498","divs":["sighting detailsi opened my living room blinds to take some snapshots of the recent snow to forward to my two sisters, one lives in georgia, the other in arizona and there was a quick flicker or flash and i took the shot. i took other snapshots within minutes, one of a squirrel eating from my bird suet cage and another in the same direction of the first which was 1 minute, 6 seconds later, i didn't have a flash on and the sun does not rise in that location so i know it was not that. i downloaded the camera onto the computer and there was the first picture\\image showing a glow\\flash that illuminated the area but the strange part was the lights\\headlights above the glow. you could see new jersey in the distance and the street lights still on by the john fitch way, a major highway in that state. the glow had what looked like a tunnel with orbs according to my wife who saw the images. my one sister said it could have been the rising sun but the next day i took several snapshots of that and the sun rises in a different direction in new jersey. i am most certain i didn't have the flash on because the second image was clear and visible. the lights above this glow was about 6-8 lights and it was in the sky and could not have been from the new jersey highway. my neighbors fence across the canal was visible and the glow\\light was behind that and trees were visible. if this was an error on part of my camera, i could live with that but i just don't know. i am retired and never had submitted anything to anyone and the only ones that i told or sent images to were my sisters and one to your organization that same day."],"City":"Morrisville","Region":"Pennsylvania"}