{"Viewing Distance":"20 Feet or Less","Summary":"In the fall/winter of 1973-1974 I dreamt of flying in a TRIANGULAR shaped craft.","Object Features":"Window(s), Wings","trends":["There have been 9 other sightings in New Smyrna Beach","There were no other sightings in New Smyrna Beach on or around November 30th 1972"],"Object Shape":"Triangle","Longitude":"-80.919588","Latitude":"29.033519","divs":["Sighting DetailsIn the Fall Winter of 1973 - 1974 I drempt of flying in a TRIANGULAR shaped craft. I even drew a picture of it the next day. This was before anyone knew about the Stealth Program and the Stealth Aircraft. I flew over the North West. There were Very tall red wood trees and mountains.T was flown down very close to the tree tops and the mountains. I could see the consol and I stood behind the pilots seat, and I believe I even sat in the pilots seat. I do remember seeing dials and the control panel, but could not draw them then, maybe under Hypnosis.(???) I do not remember seeing any other individuals in the craft with me. But I know they were there. The craft from New Zeland resembles the craft that I rode in. Case # 21773 Log #NZ 202042010-0006 GMT City Auckland Country NZ Long: 174.767 Lat:-36.867 Shape Triangle. 1) I was in the cockpitof the craft 2) I awoke to bestanding in the cockpit watching the view below me and around me 3) I felt it was not anything I had ever seen before, or really ever expected to see. 4)It flew like a regular aircraft,But it seemed to manover quite quickly and easily to the touch as it flew over the trees and the mountains. It almost seemed to glide reather than fly, unlike any other aircraft I have been in or have seen on TV. 5) It was quite exciting, fascinating. I did not have to hold on during the extream turns either right or left, or the climbs or descents of the craft. The scenery was breathtaking and the experience was augh inspiring. 6) I awoke the next morning and carried on with my normal activities, I got my husband off to work, my children off to school, then this event just would not leave my mind. So I sat down and begsn to draw the craft. Everyone else in the home was asleep and has no knowledge of my experience. 1974 After this event I was expecting my son and gave birth in march, 1974. He was dramaticly effected by something.He would awake at night crying and visably shaking and it would take me hours to get him to calm down. He drempt of a ball chasing him. Or of a mash potato substance falling from the sky on the photocarpous trees at the end of the house. (east side) he would awake outside, in his dreams."],"Region":"Florida","Log Number":"US-02052010-0004","Date Submitted":"02/05/2010 10:48 UTC","City":"New Smyrna Beach","Source":"MUFON","Case Number":"21780","Tags":"City","Disposition":"Unknown","Country":"United States","Object Flight Path":"Path with directional change,Other","files":["/var/www/straped/mufon/html2text/21780.html.txt","/var/www/straped/mufon/org/21780.html"],"Date of the Event":"11/30/1972 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.033519,+-80.919588(21780)&iwloc=A&hl=en\"> mufon case (21780) map </A>","Weather Factors":"None","Sighting Duration":"Undisclosed"}