{"Case Number":"21793","Latitude":"29.821246","Log Number":"US-02062010-0008","trends":["There have been 2 other sightings in Cistern","There were no other sightings in Cistern on or around February 6th 2010"],"Tags":"City","Date Submitted":"02/06/2010 05:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.821246,+-97.210493(21793)&iwloc=A&hl=en\"> mufon case (21793) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"None","Date of the Event":"02/06/2010 02:45 UTC","Region":"Texas","City":"Cistern","divs":["sighting details at 2:45 pm today my family and 2 of my son's friends were all in the backyard helping my husband with a carpentary project. i was sitting on a bench visiting with my mother when i noticed what i thought were 5 geese flying in a v formation from east to west .after looking at them for a couple of seconds i was shocked realizing that they were not geese since the sun was reflecting upon them showing that they were actually metalic sphere objects.today the sky is clear and it is about 65 degrees. with excitiment i yelled ufo's and the 3 boys came running to see. i pointed them out and then i ran into the house to get the binocualrs.when i got back outside i tried to focus on the objects but i was to shaky so i handed them to my sons friend.we were all screaming and laughing that we couldn't believe what we were seeing. as they started to go behind the tree line we ran to the coral area in front of the house to continue watching them.one of the spheres shot off back towards the east disapearing as the other four continued steady and equal distance on to the north\\west- towards austins bergtrom airport. they slowy just disapered. right before they vanished a white prop plane was traveling near and behind them to their south. the plane must have seen them. we heard the plane but no noise from the objects.the plane seemed to have been traveling faster than the spheres. the funny thing is one of my son's friends was a sceptic until this afternoon. he even said that he wished he a gotten a picture for the news. it is 2 hours later and we are still excited and talking about the event,especially since it was a daytime sighting!"],"Country":"United States","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Summary":"At first thought there were 5 geese in a V formation then noticed that they were metalic shphere like objects.","files":["/var/www/straped/mufon/html2text/21793.html.txt","/var/www/straped/mufon/org/21793.html"],"Disposition":"Unknown","Longitude":"-97.210493"}