{"files":["/var/www/straped/mufon/html2text/21797.html.txt","/var/www/straped/mufon/org/21797.html"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Region":"Florida","Log Number":"US-02062010-0011","Date Submitted":"02/06/2010 10:36 UTC","divs":["sighting detailsi was driving home when my four year old son said \"mommy look airplane\" as i pulled into my apartments and saw an object very low to the ground and almost looked to be hovering. the object was triangle shape with three very bright white lights one on the top \"point\" and the second and third on the bottom two forming a triangle all lights equally spaced. at the top of the \"triangle object's\" first light was a beam almost foggy looking beam of light going straight out like a head light. my first thought was helicopter - i turned my music off, rolled my window down and heard nothing. i pulled my cellphone out in an attempt to take a picture\\video but my cellphone was not picking up the lights - and then i received a call. i was confused saying \"what the hell is that?\" as i slid my car to get into my gated apartments. i then turned and got off my phone in my second attempt to take a picture or video when the object was gone. completely and totally gone literally as if it had vanished into thin air. i pulled up to my apartment again on my cellphone trying to look into the cloudy sky wondering how if i can not see stars could i see this object and where did it go? once i got into my house i searched triangle ufo's just to see and there it was some more than other because the object that i saw was very clearly triangle with 3 white not blue not read or yellow but white lights, none of them mentioned a foggy looking headlight\\beam(?)."],"Source":"MUFON","City":"Bradenton","Object Shape":"Triangle","trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around February 6th 2010"],"Longitude":"-82.566209","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"27.500508","Case Number":"21797","Object Flight Path":"Hovering then path","Summary":"Triangle object with three bright white lightsand beam of light almost like headlight","map":"<A HREF = \"http://maps.google.com/maps?q=27.500508,+-82.566209(21797)&iwloc=A&hl=en\"> mufon case (21797) map </A>","Disposition":"Insufficient Data","Country":"United States","Date of the Event":"02/06/2010 08:47 UTC","Tags":"City"}