{"files":["/var/www/straped/mufon/html2text/21798.html.txt","/var/www/straped/mufon/org/21798.html"],"Longitude":"-105.406116","Object Shape":"Fireball","Source":"MUFON","Date of the Event":"02/06/2010 08:50 UTC","Object Features":"Unknown","City":"Red River","Region":"New Mexico","Log Number":"US-02062010-0012","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Summary":"fireball, blinking lights, erratic movements, slow then unbelievable speed","Latitude":"36.708085","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"02/06/2010 11:58 UTC","Country":"United States","Weather Factors":"None","trends":["There have been no other sightings in Red River","This sighting has never been favorited."],"divs":["Sighting DetailsReturning home from friends, heading east on Hwy 64 from Red River, NM to Bobcat pass (elev-9800 ft), 36.68 deg N - 105.35 deg W, and noticed red fireball with blinking lights which appeared to be on top of the mountain above our house. First reaction was it was a snow cat (plow) on top of peak. Then realized there is no snow runs above us and there is no way for a vehicle to reach that point. Getting closer it was clear it was in sky but low on horizon, a fireball,intense and we thought it was a helicopter with search lights and maybe it was on fire. Then object started moving and shining bright white(almost LED in appearance) down on ground. Movement was slow to west then abrubtly back east very short distances.Object moved up and down with movement not capable of helicopter unless it was falling out of sky, then shooting straight up to original position. We continued driving to mountain pass as object moved northwest quickly. Object stopped completely above us then with incredible speed moved due north, then slowed briefly colors fading. At this moment it just vanished in a streak northwest into the clear night sky. My wife and I were at first concerned that something was on fire so near our house and we live next to a national forest. After realizing this was something extraordinary we gave chase to get a better view and perhaps a picture with camera phone. Picture taking unsuccessful except for one bright streak in a black backround. We actually got a little scared, excited and now can not sleep. This event has changed our lives, to what degree we are unsure but we will be more aware of the sky and hope that we can see something else and pray whatever happens is not malevolent but enlightening."],"Case Number":"21798","map":"<A HREF = \"http://maps.google.com/maps?q=36.708085,+-105.406116(21798)&iwloc=A&hl=en\"> mufon case (21798) map </A>","Disposition":"Unknown"}