{"Summary":"2 of them. Very bright lights.","Latitude":"35.414149","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"02/04/2010 12:00 UTC","Tags":"City","Case Number":"21809","Longitude":"-78.668409","Source":"MUFON","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsI was walking my dog in an open field on our farm. It was cold and getting dark about dusk. No clouds in the sky. I turned to call the dog and looked to the Western sky and saw 2 cigar (though wider) shaped bright lights.I kept looking and gazed into one hard to see if any movement inside the light and there seems to be some movement. It was very bright. They never moved but just sat in the sky. I kept looking back and forth at them as they hovered. As I looked from one to the other, a trail of little lights came from one. They then began to disappear or fade. One finally did and as I turned my back which was only for a very short time, both disappeared.I just kept praying and asking God to show me what it was as I just could not believe this. These objects must have been huge if they had been closer because at a distance they were big. Found out another person had seen this too and actually stopped their car and got out to view.I was not afraid just shocked to see these things. I wondered if anyone was looking at me from them which was unnerving. The objects coming out were much smaller and I would estimate about 10-15 of them and they just disappeared into the air as they were coming out. Did anyone else see anything that time of day and on that day? By the way, I always take my cell with me as I walk but of all times I left it in the car and could not get a pic. I know what I saw was real."],"City":"Coats","Log Number":"US-02072010-0011","trends":["There have been 4 other sightings in Coats","There were no other sightings in Coats on or around February 4th 2010"],"Region":"North Carolina","Disposition":"Unknown","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=35.414149,+-78.668409(21809)&iwloc=A&hl=en\"> mufon case (21809) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"02/07/2010 10:49 UTC","files":["/var/www/straped/mufon/html2text/21809.html.txt","/var/www/straped/mufon/org/21809.html"]}