{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Date of the Event":"06/30/2009 12:00 UTC","trends":["There have been no other sightings in LeRoy","This sighting has never been favorited."],"City":"LeRoy","Weather Factors":"Unknown","Summary":"Followed by a ball of light while driving.","Case Number":"21817","Source":"MUFON","Latitude":"41.360037","Sighting Duration":"Undisclosed","Longitude":"-87.271978","Country":"United States","files":["/var/www/straped/mufon/html2text/21817.html.txt","/var/www/straped/mufon/org/21817.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.360037,+-87.271978(21817)&iwloc=A&hl=en\"> mufon case (21817) map </A>","Date Submitted":"02/08/2010 03:14 UTC","divs":["Sighting Detailsdriving west bound on RT 231 about5 miles from my first sighting a few years ago. I was a mile or two past a little town called Leroy. I was one the cell phone with my dad when i noticed a bright light behind me i first thought that its was a cop with his spot light getting ready to pull me over but then i suddenly moved closer and then to the side of my vehicle. my cell phone cut out and lost signal my radio went to static and my high beams went out. the Super bright white light then moved behind and then passed me ( like a person in a vehicle wouls pulled into the opposite lane and sped up then pulled in front of me) the objectthen slowed and came along side of me and followed beside me for about 1.5 miles and abruptly disappeared as a approach the street light at I-65 Rt 231 junction as soon as it diappeared the street lights went out and i pulled onto the interstat and as I came over the overpass and reach the bottom of the hill the street lights came back on my cell phone regained signal and my radio went back to music. I proceeded homa and called my dad told him what happend and when i got home as I was pulling into the driveway my high beams suddenly turned on. I went inside and started talking to my dad and noticed my dog acting very strange she was standing back from the window and barking at something out side then a sudden flah (like one from a camera) happend outside and the dog ran to the window and started growling and barking."],"Viewing Distance":"20 Feet or Less","Tags":"City","Object Shape":"Fireball, Sphere","Region":"Indiana","Disposition":"Unknown","Object Features":"None","Log Number":"US-02082010-0006"}