{"files":["/var/www/straped/mufon/html2text/21826.html.txt","/var/www/straped/mufon/org/21826.html"],"Object Features":"Unknown","trends":["There have been no other sightings in Georgetown","This sighting has never been favorited."],"Source":"MUFON","Region":"Florida","Disposition":"Unknown","Log Number":"US-02082010-0015","Date Submitted":"02/08/2010 08:48 UTC","Case Number":"21826","Tags":"City","Object Shape":"Circle, Star-like","Sighting Duration":"00:10:00","Latitude":"29.391362","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Weather Factors":"Does Not Apply","Summary":"Small circles playing tag.","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"07/07/1996 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.391362,+-81.638689(21826)&iwloc=A&hl=en\"> mufon case (21826) map </A>","Longitude":"-81.638689","divs":["Sighting DetailsThee was one bright white sphere (?) that for for lack of a better word appeared to the naked eye to be about the size of a quarter in the sky. 3 smaller white spheres that were about the size of dimes not far off in distance looked as if they were playing tag. Suddenly the larger sphere blinked on and off and then one by one the smaller soheres moved next to the larger sphere and then suddenly disappeared. My girlfriend and I were on a fishing trip and before going to sleep were sitting behind a mobile home we had rented. I was merely gazing at the stars (we wee a long way from the nearest large city and I was just seeing how different the stars looked without all the bright lights of a large city distorting the clarity of the sky. At first, the spheres looked like the rest of the stars. No bigger. No smaller. I noticed them because they were the only stars moving. Once I saw them move, I called my girlfriend outside to see if she saw them too, just to make sure I wasn't seeing things. She confirmed what I saw and the two of us watched them for approx. 10 minutes before they vanished. At no time were either of us scared but we both commented that we were looking at UFOs."],"City":"Georgetown"}