{"Date of the Event":"02/08/2010 10:12 UTC","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Viewing Distance":"Unknown","divs":["Sighting Detailsmy daughter and I were on our way to my fathers to work on his computer. i prepared to turn right (north up Bristol street cross streets bristol and memory lane). as I turned my head to check traffic i noticed a very bright silverish shape in the sky. My first thought was that it was a mylar balloon. My daughter noticed it and asked me what it was. I stated that I did not know. We watched it while waiting to turn right and the object continued to decrease in altitude until i was able to distinctly see the shape. It was cylindrical in nature, sort of hazy in texture is the only way I can describe it. At this time the object was approximately 100 to 1500 feet high. It had very bright lights at either end. It was moving rather erratically with in a small area of the sky. by this time I had backed my car up and parked on the side of my street. a passer by noticed me looking in the sky and what he saw was enough to make him also pull over and exit his vehicle. By this time my daughter was very upset and almost panicked, tears and all wanting badly to go home. I soothed her and got back in my car and proceeded to the gas station on the corner of bristol and memory lane with the excuse that i had to get gas. I pulled into the gas station, went to the window and informed the gas station attendant (whom I know. They are of middle eastern descent and not prone to outlandish things. They came out of the office and viewed the object with me. They stated \"oh its a balloon Oh Wait no its not\" at this time they exclaimed \" looked it split into two\" by this time the object had gained altitude and become motionless. at this time a plain white jet was observed by all partied flying very close to the object. the gas station guys said look at the jet. during the time that we watched this object it went from 2 lights to one very bright light, very bright. brighter than landing lights on the wheel gear of a plane. the white jet buzzed the object a total of three time all the while there was no other aircraft in the sky. by this time by daughter was totally freaked out complete with tears and shakes so I proceeded to go home. I watched the object in my rear view mirror while driving. It got brighter than pulsed several times and faded from view..."],"Case Number":"21828","Summary":"blinking vertical oriented cylinder buzzed by aircraft","City":"Santa Ana","Region":"California","Latitude":"33.746823","Object Features":"Unknown","Longitude":"-117.858514","map":"<A HREF = \"http://maps.google.com/maps?q=33.746823,+-117.858514(21828)&iwloc=A&hl=en\"> mufon case (21828) map </A>","files":["/var/www/straped/mufon/html2text/21828.html.txt","/var/www/straped/mufon/more/21828_submitter_file1__2010-02-0810.10.59.jpg","/var/www/straped/mufon/more/21828_submitter_file2__ufo0001.JPG","/var/www/straped/mufon/org/21828.html"],"Weather Factors":"None","trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around February 8th 2010","This sighting has never been favorited.",""],"Date Submitted":"02/08/2010 11:12 UTC","Log Number":"US-02082010-0017","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Cylinder","Disposition":"IFO","Tags":"City"}