{"Disposition":"Insufficient Data","Weather Factors":"Unknown","trends":["There has been one other sighting in Hobe Sound","There were no other sightings in Hobe Sound on or around February 8th 2010"],"Latitude":"27.059498","Object Flight Path":"Path with directional change","Region":"Florida","Tags":"City","Date of the Event":"02/08/2010 09:50 UTC","Case Number":"21820","files":["/var/www/straped/mufon/html2text/21820.html.txt","/var/www/straped/mufon/org/21820.html"],"Country":"United States","Longitude":"-80.136432","Log Number":"US-02082010-0009","Source":"MUFON","Object Shape":"Circle, Sphere, Star-like","Sighting Duration":"Undisclosed","Object Features":"None","Date Submitted":"02/08/2010 01:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.059498,+-80.136432(21820)&iwloc=A&hl=en\"> mufon case (21820) map </A>","Viewing Distance":"Unknown","Summary":"Two Slow Moving White Stars in the Morning Sunlight","divs":["sighting detailsi woke up this morning and went down stairs for a cigarette and coffee out on the back porch, here in hobe sound, today, 2\\8\\2010 at 9:50 am. i then looked west and looked up at an airplane and noticed there was a white balloon floating behind it. as the airplane moved on the white object moved much slower. i then noticed another white object and went to get my binoculars inside. when i came out they were still there and as i looked at them through the binoculars they got brighter from the sunlight. there then appeared a red\\orange object between them that i could not see with the naked eye. my mother came out and asked what i was looking at and i pointed them out and she noticed them and went to work. there was a shuttle launch this morning and i wondered if that had anything to do with it. i looked back up and the trailing white round thing went back in the direction it came from (ne), and then i followed it through the binoculars. when i looked away and went back to find it, it was gone. i tried through the binoculars, but i could not find it. i then went on the computer to look for anybody else who witnessed this and there was nothing."],"City":"Hobe Sound"}