{"Latitude":"38.149576","Tags":"City","Summary":"I saw a transparent-like sphere cross above from northeast to southwest direction moving fast.","Viewing Distance":"Unknown","Log Number":"US-02082010-0013","Weather Factors":"None","Longitude":"-79.071696","Case Number":"21824","Source":"MUFON","Disposition":"Unknown","divs":["Sighting DetailsI was playing ball with my dog in a parking lot because it was clear of snow after the snowstorm. The sky was sunny and clear for a change so I was looking around and saw a cloud or smoke from wood-burning stove and wondered which it was. Something caught my eye above and northeast of me -- the only thing in the sky and it was now above me! It was like a gold bubble! If you closed one eye it would be approximately the size of a bb from a rifle. But it was transparent-like, and silent. It just eased across the sky very fast. Very strange to see something move like that through the sky without a sound. What is the proopulsion system? I was just whispering to myself excitedly \"What is that?\" It was like Glenda the Good Witch's first appearance in The Wizard of Oz; just that fantastic. Just to interject, I knew pretty much immediately it was a real UFO because I have seen them before. It slipped over my town and the hill they call \"Trimble's Knob\". I remember thinking -- This thing has an agenda moving so fast. I was a bit sad then because it was headed into the sunlight and over the mountain, no chance to holler at anyone to join me and share the experience."],"Region":"Virginia","trends":["There have been 2 other sightings in Staunton","There were no other sightings in Staunton on or around February 7th 2010"],"Date of the Event":"02/07/2010 02:00 UTC","files":["/var/www/straped/mufon/html2text/21824.html.txt","/var/www/straped/mufon/org/21824.html"],"Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Features":"None","City":"Staunton","Date Submitted":"02/08/2010 07:41 UTC","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=38.149576,+-79.071696(21824)&iwloc=A&hl=en\"> mufon case (21824) map </A>"}