{"Latitude":"43.499451","files":["/var/www/straped/mufon/html2text/21834.html.txt","/var/www/straped/mufon/more/21834_submitter_file1__1959-ufo-large-shot.jpg","/var/www/straped/mufon/more/21834_submitter_file2__1959-ufo-close-up.jpg","/var/www/straped/mufon/org/21834.html"],"Tags":"City","Object Shape":"Disc","divs":["Sighting DetailsI am telling this story as related to me in 2008 by a former employer who wishes to remain anonymous. He is a Loveland, Colorado business owner in his 80's, a conservative WWII vet who fought in the Battle of the Bulge and is the least likely person you'd think would ever try to put on a hoax. I was amazed when I brought up the subject of ufos one day and he told me his story and went to his desk and pulled out a picture he took of a formation of ufos he saw. I examined the picture and it was a genuine photo on Kodak paper, obviously aged a bit but still in very good condition. With his permission I scanned it at high resolution and am including it with this report. He recalls he was flying west with a friend near Idaho Falls, ID, just west of Yellowstone Park in spring 1959, he couldn't recall the exact month. The plane he owned for years is called a \"Moonie\", aviation buffs would know what type it is, and I assume that was the plane he was flying. The time was midday, he estimated it to be between noon and one o'clock. He said they were flying at 120 MPH at about 10,000 feet when his friend commented on a formation belown them crossing an unidentified lake. After watching the objects for a few moments they realized the objects were far too big to be birds, being visible from that altitude. He got his camera out and snapped 2 pictures, one included here and the other which I inspected which he said showed the objects banked on edge but which were virtually undetectable in the photo so I didn't include it with this report. Shortly afterwards, the objects shot upwards and ascended to their altitude in a matter of seconds, circled the plane twice, shot off into the distance and were lost to sight in a few seconds. He said they looked like silvery discs with no insignia or other detail, and estimated their speed at 8-900 MPH. They continued on their flight path and landed at their destination without further incident. He did tell a few close (he thought) acquaintances but the story got out and for a time he got quite a bit of ribbing and abuse from other pilots. However at a local pilot's club meeting shortly afterward, the president of the club who had the respect of their group mentioned that if this man said what he saw then you could take it to the bank. This being 1959, a man's word carried a bit more weight than today and the abuse stopped. He never saw anything like it since but he swears the events happened as he told them. I think this is an important photo, as it's one of the few (or only) pics I've ever seen of a formation of ufos viewed from above. The objects are visible in the large photo just barely below and to the right of center. The blue area on the right is the windshield strut and the glare arc on the left is from the sun off the glass. The second photo is a closeup of the objects."],"Date of the Event":"04/30/1959 12:00 UTC","Case Number":"21834","Weather Factors":"Unknown","Country":"United States","Date Submitted":"02/09/2010 03:11 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-112.029034","Region":"Idaho","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Summary":"Private pilot snaps UFO formation in Idaho in 1959.","Source":"MUFON","City":"Idaho Falls","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.499451,+-112.029034(21834)&iwloc=A&hl=en\"> mufon case (21834) map </A>","trends":["There have been 8 other sightings in Idaho Falls","There were no other sightings in Idaho Falls on or around April 30th 1959","This sighting has never been favorited.",""],"Log Number":"US-02092010-0006"}