{"Object Shape":"Fireball, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=29.430492,+-98.486878(21842)&iwloc=A&hl=en\"> mufon case (21842) map </A>","Date Submitted":"02/09/2010 10:53 UTC","Country":"United States","Date of the Event":"02/09/2010 09:03 UTC","Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Latitude":"29.430492","Summary":"3 UFO's San Antonio, TX 151 & 1604","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/21842.html.txt","/var/www/straped/mufon/org/21842.html"],"Tags":"City","Object Features":"Undisclosed","Longitude":"-98.486878","Weather Factors":"None","trends":["There have been 148 other sightings in San Antonio","There were 2 other sightings in San Antonio on or around February 9th 2010"],"Log Number":"US-02092010-0014","Sighting Duration":"Undisclosed","Case Number":"21842","Region":"Texas","divs":["sighting detailsi had just clocked out of work at citi bank on hwy 211 and potranco when i start walking towards my car i notices a bright orange red light (like when your getting a muffler welded you see that bright blue light it was exactly like that but red\\orange\\and a slight violet and a bright brown) it was eastbound by 1604 and so i call my friend to tell ask her where shes at she said las palapas on 1604 and bandera hwy 151 i told her look up in the sky!! she said said what am i supposed to see??? i said you don't see it??? its a bright orange reddish light looks like an hid light from a bmw\\mercedes... she said ur crazy and hung up so i get in my car and start driving down potranco towards 1604 and saw it was not 1 but 3!!!!! so i called her again and she confirmed it she saw it too!! this happened for a good 15 minutes and then they were gone! as i was driving i also saw about ten small lights flying over me like small stars but they only flashed white but not very bright. i think they were jets they were more man made looking compared to the 3 bigger brighter objects (ufo's) i hope im not the only one besides my friend that saw this."],"City":"San Antonio"}