{"Country":"United States","Disposition":"IFO","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21851.html.txt","/var/www/straped/mufon/more/21851_submitter_file1__UFO-4503-2.jpg","/var/www/straped/mufon/org/21851.html"],"Sighting Duration":"00:00:00","Object Flight Path":"Undisclosed","Summary":"I never saw anything at the time of event. In a photo taken, I see 3 blurred white lines (contrails) in sky. Photo is 1/1600 second, so the objects speed is incredibly fast.","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Lawrence","There were no other sightings in Lawrence on or around January 23rd 2010","This sighting has never been favorited.",""],"Date Submitted":"02/10/2010 01:38 UTC","Date of the Event":"01/23/2010 03:02 UTC","Log Number":"US-02102010-0007","Latitude":"42.713565","Case Number":"21851","divs":["sighting detailsi did not notice the objects in person. it was a bright sunny winter day with snow everywhere, so i had sunglasses on. i was shooting my child and friends as they sled down hill toward me at the bottom. a couple weeks later, i finally had time to load the shots into my computer and sort the best shots. i noticed the 3 white flashes across the sky, but didn't give it much thought. but, seeing it again, i decided to look at my metadata for the photo. when i saw shutter speed was 1\\1600th of a second, i became suspicious. a plane would have been frozen in place. like i said, i never saw anything with my eyes. but, the photographic evidence is striking. if i had shot at a slow shutter, i would have shrugged it off as planes. it's as if the object traveled across the sky at a blistering speed, and my camera captured it as the lens opened and shut. the fact that the 3 white lines are half an inch long, traveling in same direction, with a shutter that was open 1\\1600th of a second just defies imagination. it would take a one or 2 second exposure (camera on tripod) for a commercial jet at 500 mph to leave a half inch blur in same scene. fyi, i was shooting at iso 100 at f\\5.6, which explains why the sky is not in focus (short depth of field). it was with a nikon d700, nikon 70-200mm vr lens shot at 102mm focal length, highest rez nikon raw 14 bit. none of the other photos i took has this phenomenon, even taken from exact position shooting in exact direction. answer to questions: 1. i was at bottom of hill at andover high school shooting up at kids sledding, revealing blue sky above them. i am shooting toward west south west direction. (3:02:31 pm, january 23, 2010). 2. i first noticed the objects while viewing photos on my computer, i shoot in raw, so i have to put them into adobe lightroom to make into jpg. the photo i am sending is unretouched sky. 3. first assumed white blurs were falling stars or meteors, something with great speed that naked eye in daylight would not see. 4. i can only judge it's actions by photo, appear to travel left to right across sky. 5. not visible in any other photo from that day."],"City":"Lawrence","Longitude":"-71.154514","Weather Factors":"Unknown","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.713565,+-71.154514(21851)&iwloc=A&hl=en\"> mufon case (21851) map </A>","Region":"Massachusetts"}