{"Viewing Distance":"Unknown","Date of the Event":"02/09/2010 09:10 UTC","Country":"United States","Longitude":"-98.665601","map":"<A HREF = \"http://maps.google.com/maps?q=31.556828,+-98.665601(21852)&iwloc=A&hl=en\"> mufon case (21852) map </A>","Log Number":"US-02102010-0008","files":["/var/www/straped/mufon/html2text/21852.html.txt","/var/www/straped/mufon/org/21852.html"],"divs":["Sighting DetailsWe were driving into our property and saw two small red lights in the sky above our barn. The sky was dark so the lights showed up well. They looked a bit like tail lights on a car but up in the sky. There were also some small blinking white lights that appeared when the red lights had gone off. We saw the same lights a couple of years back, in the same spot. Do not remember the date but the time was about the same - somewhere between 7:00 pm and 9:00 pm. When we stopped to look at the lights, they went out. We started driving again and they came back. Our sons girlfriend, who is staying on the property, said she has been seeing the same lights. My husband made the comment \"look how fast they are moving\". I didn't see them move because I was alternating between the lights and making sure my husband didn't hit anything while driving and looking at the lights. In trying to keep our 15 year old calm - we didn't make a big deal about it. He wouldn't go back outside by himself after we got to the house. The time before when we had seen them there were more lights, maybe 5 or 6, that just hung there then split and left in different directions. This time I only saw 2 red lights."],"Weather Factors":"None","Region":"Texas","Date Submitted":"02/10/2010 02:47 UTC","Case Number":"21852","Sighting Duration":"Undisclosed","Summary":"Two red lights appeared in the southwest sky above our barn.","City":"Mullin","Object Features":"Unknown","Latitude":"31.556828","Object Shape":"Circle, Flash","Tags":"City","trends":["There has been one other sighting in Mullin","There were no other sightings in Mullin on or around February 9th 2010"],"Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Stationary"}