{"Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Two star-like objects flying over the city one to the north, the other to the northwest crossing paths over my house","Region":"Colorado","Date of the Event":"02/10/2010 04:20 UTC","Case Number":"21857","map":"<A HREF = \"http://maps.google.com/maps?q=38.842982,+-104.813503(21857)&iwloc=A&hl=en\"> mufon case (21857) map </A>","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02112010-0002","Object Flight Path":"Straight-line path","Latitude":"38.842982","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around February 10th 2010"],"divs":["sighting detailssomething caused me to wake up that morning out of a deep sleep and immediately i was compelled to look out my bedroom window to check the weather conditions. as i looked up into the clear starry sky i saw two lights flying approximately the speed of a private airplane. the first light i notices was flying from south to north at an undermined altitude. it appeared to be the size of a pencil eraser held out at arms length. it flashed like the light of an arc welder but emitted faint colors of blue, red, green light through the bright white light of the object. i knew it was not an airplane since there were no navigation lights blinking. i knew that what i was seeing was \"not one of ours,\" this fascinated me. the second object i saw i saw almost at the some moment i saw the first object but this one was flying from southeast to northwest over the city. the characteristics were identical to the first object. the north\\south object was a little ahead of the second object so it was further north when the second object crossed its trajectory. i watched them both until they disappeared completely from my view. duration of the sighting was about 3 minutes. i have seen this phenomena before in 1995 but then an f-16 was scrambled out of peterson air force base in cos and gave pursuit. that object accelerated before the jet had a chance to even come close. these recent object appeared to have the same characteristics as the object i saw in 1995, that sighting lasted for no more than 30 seconds."],"Source":"MUFON","Weather Factors":"Does Not Apply","Date Submitted":"02/11/2010 01:56 UTC","Longitude":"-104.813503","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/21857.html.txt","/var/www/straped/mufon/org/21857.html"],"Object Shape":"Flash, Star-like","City":"Colorado Springs","Country":"United States"}