{"Region":"VeszprÃƒÂ©m","divs":["Sighting DetailsI was about 14 at the time, and I was on vacation for the entire summer with my mother visitng my grandfather and uncle in my mother's hometown of Balatonfured. We stayed with my grandfatherfor theduration of the entire summer and he lived on a rther large hill. This hill was populated by German tourists and older naturalists, so I was lonely for most of the time. I had actually spent most of my time reading a book on thestring theory and using my imagination to keep myself busy. Being at a higher altitude than I'm used to, the stars were always wonderously bright in the sky, and on clear nights you would be foolish not to spend a few minutes gazing upon it. This particular night was clear, not a cloud anywhere. I was staring at the sky trying to look for the big dipper, when I noticed one of the stars in the sky moving. At first I thought nothing of it; I figured it was a satellite or a high flying plane. Being so bored through the summer, I was conditioned to spending at least a few minutes with whatever caught my attention to help the time go by faster. It was a good thing I didnt't look away, because all of a suddent it stopped and reveresed its orbit! It had been traveling east until it suddenly stopped and began to head west. It didn't need more than a second to make such a drastic turn. It did this several times. In hindsight I now realize it was extremely distant due to its size. It was orbiting very high in our atmosphere, if it was in it at all. All I knewat the time was that it was an unusual thing I was witnessing, so I stared at it for about fifteen minutes before deciding to go in to call my mother to witness the event. I ran in, but she was in the middle of aconversation with my uncle and told me to wait. I tried to explain to her that time was of the essense, and noticing the ugerncy in the tone of my voice she excused herself to come and humour me. When we made it outside, either because it was so distant in the sky or because it had flown out of sight, we could not find it. It's just one of those memories that doesn't dim with time."],"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=46.956461,+17.888963(21869)&iwloc=A&hl=en\"> mufon case (21869) map </A>","City":"BalatonfÃƒÂ¼red","Summary":"Saw an unidentifiable light that changed its orbital path several times","Longitude":"17.888963","Weather Factors":"None","Disposition":"Unresolved","Log Number":"HU-02132010-0001","Object Features":"None","Latitude":"46.956461","Date Submitted":"02/13/2010 12:00 UTC","Case Number":"21869","Date of the Event":"08/02/2004 10:15 UTC","Country":"Hungary","Source":"MUFON","Object Shape":"Star-like, Unknown","Sighting Duration":"00:15:00","trends":["There have been no other sightings in Balatonfüred","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/21869.html.txt","/var/www/straped/mufon/org/21869.html"],"Viewing Distance":"Over One Mile","Tags":"City"}