{"Weather Factors":"Unknown","divs":["Sighting DetailsOn Monday, February 8, 2010I was driving with my daughter on the Elgin-O'Hare expressway heading toward Lake St. when a huge white lightning came down to the north of us. The area flickered with light (similar to a flickering flourecent light bulb but much brighter) and then an enormous trapezoid shape appeared that was wider than an industrial warehouse, and twice the height. The entire trapezoid shape was flourent white and the bottom of it was at or near the ground. From the top of this light an enormous beam of light was emitted which lit up the entire sky. Then after a few seconds, the lights went off. A few seconds later, the same thing occurred. This happened three times. I thought it was an explosion or some type of enormous search light, but there was no fire, and no other signs of an explosion. I had to keep driving but my daughter kept an eye on it, but it \"turned off\" and we didn't see it again. There were many cars on the highway and the area has many residential homes. I am hoping someone can explain what this was. Maybe warehouse or store video cameras captured this. There was no lighning in the area that evening. This occurred about 6:45pm and snow fall began later that evening."],"Case Number":"21864","Date of the Event":"02/08/2010 06:42 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/21864.html.txt","/var/www/straped/mufon/org/21864.html"],"Object Features":"Unknown","Latitude":"42.000902","Viewing Distance":"101-500 Feet","Object Shape":"Square, Rectagular","Date Submitted":"02/11/2010 07:54 UTC","Region":"Illinois","Object Flight Path":"Stationary","Longitude":"-88.135874","Source":"MUFON","Disposition":"Insufficient Data","trends":["There have been 4 other sightings in Hanover Park","There were no other sightings in Hanover Park on or around February 8th 2010"],"Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-02112010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=42.000902,+-88.135874(21864)&iwloc=A&hl=en\"> mufon case (21864) map </A>","City":"Hanover Park","Summary":"Enormous lightning came down and flickered and then a huge flourescent type of explosion occurred with the base of the light a trapezoid. From this trapezoid flourescent white light a huge beam was emittted."}