{"Disposition":"Unknown","Sighting Duration":"00:00:30","Weather Factors":"None","trends":["There have been no other sightings in Green River","This sighting has never been favorited."],"Longitude":"-110.161804","Date of the Event":"10/30/1973 03:00 UTC","Summary":"birds-eye view of mothership coming in for a landing","Object Shape":"Disc","Source":"MUFON","Date Submitted":"02/12/2010 01:12 UTC","Object Flight Path":"Path with directional change","divs":["Sighting DetailsMy girlfriend and I were driving eastbound on I-70 threw the Utah mountains. While driving threw the San Rafael Swell area the forest was very close to the highway and it was very dark that night. As we approahed the San Rafael Valley suddenly about 6 deer jumped from the trees into the highway in front of me causing me to lock up my brakes to keep from hitting them;after I resumed speed I started to drop into the valley below. Suddenly something caught my attention to my left, and I turned to look up the valley. Thats when my life changed forever; coming down the valley below the level of the mountains about a 100 feet above the ground was a gaint UFO mothership moving very slowly. I had a birds eye veiw because I was above it as it passed down the valley.The ship had a bright red glow it emitted that lite-up the whole valley. you could see everything like on a full moon night..there was no sound...it was a giant Disc with a Dome in the middle of it, the Disc moved counter clock wise and the Dome moved clock wise in rotation. The size of the ship in the valley would be about the size of the Astro Dome in Houston Texas. It scared the Hell out of me causing me to stop my car in the middle of I-70 and get out and watch it pass in front of me moving on down the valley and out of sight..there were no other cars on the highway at the same time..the only other person who saw it was my girlfriend. I lost track of her not long after that for 36 years...when I finally got in contact with her one of the first things she asked me was did I remember seeing the UFO."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.99525,+-110.161804(21866)&iwloc=A&hl=en\"> mufon case (21866) map </A>","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/21866.html.txt","/var/www/straped/mufon/org/21866.html"],"Tags":"City","Region":"Utah","Case Number":"21866","Country":"United States","Object Features":"Dome","City":"Green River","Latitude":"38.99525","Log Number":"US-02122010-0002"}