{"Object Features":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 22 other sightings in Middletown","There were no other sightings in Middletown on or around January 14th 2010","This sighting has never been favorited.",""],"Summary":"Reconfiguration of lights in the sky above and to left of me while driving Middletown, NY.","City":"Middletown","Date of the Event":"01/14/2010 07:57 UTC","Date Submitted":"02/11/2010 05:11 UTC","Object Flight Path":"Undisclosed","Region":"New York","Disposition":"IFO","Log Number":"US-02112010-0006","files":["/var/www/straped/mufon/html2text/21861.html.txt","/var/www/straped/mufon/org/21861.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.447227,+-74.421084(21861)&iwloc=A&hl=en\"> mufon case (21861) map </A>","Country":"United States","Source":"MUFON","Latitude":"41.447227","Case Number":"21861","Longitude":"-74.421084","Object Shape":"Star-like, Other","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn 1-14-10 (Thur.) I was driving my car on North on Rte 211, near to Walmart, in Middletown NY, with my grown daughter, who was sitting right next to me in the passenger seat. It was 7:57pm as I looked at my clock on the dashboard since what I was seeing above me,to the left of me, towards the West (thousands of ft. in the sky,) was something that I couldn't identify. It was a very clear night and these 3 objects shown very brightly which was what caught my attention. What we both saw a moment later was what looked like 3 planes circling around each other which, in itself, was strange enough, that they were that close to each but while I sat at a traffic light a moment later (lots of traffic on this road now and couldn't pull over since I was caught up in the middle lane) watched these objects now turn themselves into a triangular shape..sideways, to make it easier to visualize, and was so surprised at seeing them turn into a triangular pattern that I pulled into a parking lot to see more of this (and of course didn't have a camera with me, neither one of us could get a shot with a camera phone, too high in the sky) but then they seemed to disappear. We weren't scared by what we saw just amazed at this very strange I immediately drove out of the parking lot, drove my daughter home, which was another 5 mins..she lives on a rural road, very dark, wide open so you can actually get a panoramic view of the sky, and in this case, we did..the same 3 objects we had just seen were now back again, but this it was rightside up triangular pattern..we were watching them for a few mins..they didn't move just stayed in the same spot, but as we watched I caught another object passing by on my right..this was indeed closer, maybe 200 ft. high from where we were standing that we could actually see it pass going towards the East..3 white lights across, with a red light flashing directly underneath, and of course listened for any sounds coming from this object..there were no sounds, floated right past us...heading towards the East of where we were, then disappeared..didn't have time to get my binoculars so just watched with the naked eye..it was pretty awesome but was disappointed that I couldn't see any type of structure just the lights, but all in all it was an interesting sighting. This all happened in the span of about 15 mins...the 3 lights were still in the triangular shape but it was just too cold to be outdoors so headed inside. --------------------------------------------------------------------------------"]}