{"Object Features":"None, Unknown","Log Number":"US-02122010-0004","files":["/var/www/straped/mufon/html2text/21868.html.txt","/var/www/straped/mufon/org/21868.html"],"Tags":"City","Date Submitted":"02/12/2010 09:46 UTC","City":"Lanham-Seabrook","Source":"MUFON","Case Number":"21868","Summary":"Approx 15 - 20 Orange spheres traveling southeast then turning due south.","Region":"Maryland","divs":["sighting detailsi came outside at approx 9:20pm with my mom to let my dog out and smoke a cigarette. i happened to see something out of the corner of my eye and looked up and saw 4 orange spheres traveling southeast. as i continued watching they then turned in a due south direction. i saw approx 10 to 15 more following the original 4 that i saw. they came out of the horizon over the rooftops and tree line in my neighborhood. they were not flashing, and the speed and distance from my location is unknown. the last orange sphere that i saw was gaining altitude higher then the one before it and gaining speed at a much faster rate. there was no rhyme or pattern to these spheres. there was uneven distance between all of them and they were each traveling at different speeds, although it appeared that they were all following the same flight path. i heard no engine noise, and saw no strobe lights whatsoever, nothing but orange spheres about the size of a pea or smaller, 1\\8 of an inch, from my location to theirs."],"trends":["There has been one other sighting in Lanham-Seabrook","There were no other sightings in Lanham-Seabrook on or around February 12th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.967888,+-76.844972(21868)&iwloc=A&hl=en\"> mufon case (21868) map </A>","Object Shape":"Sphere","Object Flight Path":"Path with directional change,Other","Country":"United States","Longitude":"-76.844972","Disposition":"Unknown","Date of the Event":"02/12/2010 09:20 UTC","Weather Factors":"Unknown","Latitude":"38.967888","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown"}