{"Region":"Kansas","City":"Wichita","Date of the Event":"02/10/2010 11:30 UTC","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unknown","Latitude":"37.700826","Tags":"City","Summary":"Peculiar object in close proximity to aircraft on landing approach","trends":["There have been 39 other sightings in Wichita","There were no other sightings in Wichita on or around February 10th 2010"],"Country":"United States","files":["/var/www/straped/mufon/html2text/21878.html.txt","/var/www/straped/mufon/org/21878.html"],"Object Shape":"Sphere","Log Number":"US-02132010-0010","Viewing Distance":"Unknown","Date Submitted":"02/13/2010 02:56 UTC","Object Flight Path":"Undisclosed","Case Number":"21878","map":"<A HREF = \"http://maps.google.com/maps?q=37.700826,+-97.336405(21878)&iwloc=A&hl=en\"> mufon case (21878) map </A>","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-97.336405","divs":["sighting detailsen route home from a follow-up visit to my doctor, my wife and i turned south on ridge road. the location is roughly 3\\4 mile from the city airport. i tend to check the sky regularly as i do a quite a bit of aircraft photography and am always interested in any planes in our area. i could hear a jet coming in low, under the cloud cover, making an approach. looking out the side window, i spotted a business jet coming in low -- possibly at around 1000'. as it passed i noticed an unlit, spherical object following closely behind. i'd estimate it as possibly 4-5' across, and following the jet at something like 30' distance. i mentioned this to my wife, but am unsure if she actually registered it, though she stated she did see it. my initial impression was that there was some sort of balloon attacked to the plane, which seemed somewhat odd. you don't really use a jet as an advertising tow, and a small sphere isn't exactly an advertising banner. nor was it a drogue 'chute -- the only other thing i could think of, but which would obviously not be used on a commercial or private jet, not would it be deployed in flight. as the plane continued southwards, the object swung off to the left (eastern) side and peeled away from the jet's path, movingly to the east with a slightly upward cant. i lost sight of it at that point, due to slowing traffic in our lane requiring my attention. i was unable to locate the object when i looked back. conditions were overcast and cold (temperatures in the middle 30s. moderate breeze."]}