{"Log Number":"US-02132010-0011","Object Features":"Undisclosed","Date of the Event":"02/13/2010 11:40 UTC","Case Number":"21879","files":["/var/www/straped/mufon/html2text/21879.html.txt","/var/www/straped/mufon/org/21879.html"],"Source":"MUFON","Disposition":"Insufficient Data","Summary":"Pure white orb-like shape, seemed to morph into two then back to one.","Tags":"City","Weather Factors":"Unknown","Longitude":"-117.229966","Latitude":"32.812474","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around February 13th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.812474,+-117.229966(21879)&iwloc=A&hl=en\"> mufon case (21879) map </A>","divs":["Sighting DetailsI was driving to my car's oil change appointment. While driving out of the area I live in, I noticed first a helicopter (white with blue, fairly large one), flying to the east. Then I noticed nearby, to the west, just hanging in the air what appeared to be a roundish white orb, for lack of better terms. It was hard to tell how high up, but in relation to the helicopter that was leaving the area which was about regular cruising altitude you always see helicopters at when they are flying around your area, I would guess about 800 yards to 2,000 yards high? Back to the pure white orb. It was bizarre, because I was really trying to perceive it as a balloon. But at the relatively low altitude that it was at, I would have expected a much sharper outline to it, as I've seen balloons rising up at around this altitude, and they look more defined. This thing was perfectly still in an absolutely clear blue sky, but it was kind of fuzzy (at times?). Hard to explain. Then it actually seemed to morph into two orbs right next to each other. Also, it stayed absolutely stationary in the sky. I was driving about 20 miles an hour after getting out of the complex I live in, where as I was leaving, driving like 10 miles an hour, constantly watching this thing just hang there, slightly to the north and west of me. Definitely not rising, just hanging above N. Mission Bay Drive. As I turned onto that road, wanting desperately to stop, but not wanting to miss my darn appointment, now the thing is basically right over the car, enough so that I have to stick my head out of the window and look up (it still hadn't seemed to move, it's just that my direction was putting me more and more below the object). Now I'm on a fairly busy road, although not much on a mid saturday. I'm glancing at other cars and drivers to see if anyone else is looking up at this thing. It was low enough to see that it was not a balloon, or if it was, it was not drifting or going up at all, just hanging there in the sun. Next thing was I got to the light where I had to turn, a red light. I look up to see it again, and low and behold it has completely disappeared from site. I mean no where. I would guess that I had my eyes off it for no more than 20 seconds, tops, having to keep my eyes on the darn road, and next time I look up, seconds later it has disappeared. Then I turned into the service station (about 2 miles from my house, at the most), jump out of the car and I am looking everywhere in the sky for this thing, and there is nothing at all in the sky. Today in San Diego we are experiencing absolutely amazing weather, by the way, absolutely clear blue sky. When I say the sky is empty, I mean no trace of this thing. If it had been a balloon, I surely would have seen it again, no way it could have gone like that."],"Object Shape":"Sphere","Country":"United States","Sighting Duration":"Undisclosed","Region":"California","City":"San Diego","Date Submitted":"02/13/2010 03:30 UTC"}