{"Region":"Sharjah","Disposition":"Unresolved","Weather Factors":"None, Does Not Apply","Log Number":"AE-02132010-0008","divs":["Sighting DetailsDear Sir, I stay in a villa in Sharjah and i was with my baby boy and two nephews ( 10 & 12 years of age) in my verandah, when i looked at the sky to show stars to my baby. To mine as well as my nephews surprise, i saw a star like but a bit huge and more shiny and moving almost at the speed of the jet. It travelled from North West towards East and stopped a little far away from the sharjah airport. It was there for a couple of minute when suddenly we were able to see that brightness reducing and seemed like rays emanating from a point. Suddenly it started to fade and it was gone in 10-15 seconds. (could have been traveling in vertical direction) Myself being an engineer, i know the difference between other ariel objects and i am sure it was not a planne. Colour was almost yellowish, in between orange. I have two witness also, being my nephews and i am waiting to know if there are more people witnessing that. Please mail me if you know about other guys seen that or any articles in those regard. I apologize as i was not able to take any pics or video, as i was in my pajamas and just strolling around. Regards,"],"files":["/var/www/straped/mufon/html2text/21876.html.txt","/var/www/straped/mufon/org/21876.html"],"Summary":"Star like Fireball sighting with varying travelling speed","Longitude":"55.383333","Country":"United Arab Emirates","Latitude":"25.366667","Date Submitted":"02/13/2010 02:27 UTC","Source":"MUFON","trends":["There has been one other sighting in Sharjah","There were no other sightings in Sharjah on or around February 13th 2010"],"Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Object Features":"Unknown","Object Shape":"Fireball, Star-like","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=25.366667,+55.383333(21876)&iwloc=A&hl=en\"> mufon case (21876) map </A>","City":"Sharjah","Date of the Event":"02/13/2010 11:05 UTC","Case Number":"21876","Sighting Duration":"Undisclosed"}