{"Summary":"diamond shaped aircraft cruising 50-100 feet","Tags":"City","Sighting Duration":"Undisclosed","Region":"California","Country":"United States","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/21875.html.txt","/var/www/straped/mufon/org/21875.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.203006,+-119.08816(21875)&iwloc=A&hl=en\"> mufon case (21875) map </A>","City":"Lindsay","Log Number":"US-02132010-0007","Viewing Distance":"21-100 Feet","Longitude":"-119.08816","Object Features":"Unknown","trends":["There has been one other sighting in Lindsay","There were no other sightings in Lindsay on or around October 31st 1999"],"Case Number":"21875","divs":["sighting detailson october 31,1999 around 4 pm my wife at the time and i were on our way to my aunts house for a halloween party. my aunt lived out in the country so we were taking the back roads of lindsay ca. we headed down strathmore ave and turned down tulare road . when we arrived at the corner of tulare road and honolulu when i noticed a low flying craft headed towards my vehicle heading west to east . it was traveling approx. 10 to 15 miles an hour. i got out of my vehicle as it approached to get a better look. i was baffled at what i was witnessing. i was at the time enlisted in the united states navy and stationed in lemoore california working with f\\a -18 and the craft matched no known military aircraft. the craft i witnessed was diamond shaped ,dark in color almost like a dark charcoal color with many flashing lights at the bottom. i want to say the lights resembled led lights as they rapidly flashed in random order. it cruised by about 100 feet away from us and about 50 feet above. there was absolutely no sound . i lost sight of the craft after two minutes or so as it disappeared over the foothills. my ex wife also witnessed the same event. i would also like to note that i was sober at the time of incident."],"Weather Factors":"Unknown","Date Submitted":"02/13/2010 11:41 UTC","Object Shape":"Diamond","Date of the Event":"10/31/1999 12:00 UTC","Latitude":"36.203006","Disposition":"Insufficient Data"}