{"divs":["Sighting DetailsI was in my bedroom at 22:45 which overlooks the front of the house and has a clear view of the sky north towards central london when heard a car screetching loudly outside somwhere so i looked out the window but didnt see the car but as turned to walk away from the window i noticed a bright light pulsatin blue red and yellow (but in more of a sequence of a few blue and reds and then one yelollow and so on) in the distance above the house line, the sky was mostly clear with a couple of patches of cloud that was quite well illuminated by what i presumed to be the moon but i could noy actuall see the moon itself. Straight away i realised this was like nothing i had ever seen before. The light appeared to be moving quickly directly from west to east and approx 2 miles in the distance, low altitude but above the low cloud and was still visable faintly even when it went behind the patches of cloud. The object was visable for around 45 seconds until it was finaly out of sight. As the object left sight another object appeared in a almost the samplce the previous object had appeared and then proceeded to move towards the west in the opposite direction slowly and then just vanished without moving out of site. This second object which appeared identicle to the first was only visable for around 10-15 seconds before it dissapeared. Neither object made any sound and definatly were not planes or helicopters as there where no winglights front beams or tail lights just on single point of light pulsating on and off. The skies are extremly busy of this part of london a plane goes over the house every couple of minutes at low and high altitudes so am very familiar with the appearance of planes and heicopters and this was not either."],"Viewing Distance":"Over 1 Mile, Unknown","Log Number":"GB-02142010-0003","Object Shape":"Flash, Star-like, Unknown","Tags":"City","Country":"United Kingdom","Date of the Event":"02/13/2010 10:45 UTC","files":["/var/www/straped/mufon/html2text/21886.html.txt","/var/www/straped/mufon/org/21886.html"],"Sighting Duration":"00:01:00","Summary":"A pulsating lights flashing red blue and yellow travelling quickly with no audible sound","Latitude":"51.510239","Longitude":"-0.118485","Case Number":"21886","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around February 13th 2010"],"Date Submitted":"02/14/2010 09:21 UTC","City":"London","Weather Factors":"Does Not Apply","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.510239,+-0.118485(21886)&iwloc=A&hl=en\"> mufon case (21886) map </A>","Region":"England","Source":"MUFON"}