{"map":"<A HREF = \"http://maps.google.com/maps?q=35.767413,+-79.01619(21885)&iwloc=A&hl=en\"> mufon case (21885) map </A>","City":"Undisclosed","Log Number":"US-02142010-0002","files":["/var/www/straped/mufon/html2text/21885.html.txt","/var/www/straped/mufon/org/21885.html"],"Summary":"Round dome slightly larger then a basket ball","Latitude":"35.767413","Date of the Event":"11/30/2002 12:00 UTC","Case Number":"21885","divs":["Sighting Details1963. Hitch hiking across the State of Tennessee. West to East. It approched me from a star filled sky, yet very distinct from other stars in sky. It focused onto me walking on a desolate hiway. As it drew closer to me I had the feeling it was stalking me as a individual. It came to me as close AS 25 feet. I became frightened and ran under a bridge overpass. It continued to follow me. In the distance I could hear a group of people far belowm the hiway on a seconedary road with out buildings. I was frightened but do not recall why. I HAd the feeling it intended me no harm. I shouted out. No response from the people below. Perhaps 3 -4 hours later I awoke in stranger's house. To me, only minutes had passed sinse the encounter under the bridge. I dressed and left, continuing on to Washington DC. That has been many years ago. At age 67, I now live in the mountains of Westwern North Carolina. the globe has returned. It follows me every where. If I park in a lot of a local store, it waits for me to to resume my jouney. I don't know what it wants from me. It just follow me silently and often sits just above my home in the darkness of night. Im am of sound mind and body. I served in the military, followed by thirty years as a Paramedic for a local govwernment. I am not senile nor comprimized in any fashion. I do not know what this globe wants from me. It has to date, not offered any reason to fear it. It is though it wants tyo talk to me, yet there remains some type of inteligble contact. What should I do ? I failed to mention that it sometimes hovers over the roof of my house and makes a very low, yet distinct humming sound til daylight, then gone."],"Longitude":"-79.01619","trends":[],"Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Weather Factors":"Unknown","Date Submitted":"02/14/2010 12:54 UTC","Object Shape":"Sphere","Object Features":"Undisclosed","Region":"North Carolina","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed"}