{"files":["/var/www/straped/mufon/html2text/21881.html.txt","/var/www/straped/mufon/org/21881.html"],"Date of the Event":"02/12/2010 01:00 UTC","Weather Factors":"Unknown","City":"Beverly","Log Number":"US-02132010-0013","Latitude":"42.558428","Object Features":"Wings, Unknown","Longitude":"-70.880049","trends":["There have been 4 other sightings in Beverly","There were no other sightings in Beverly on or around February 12th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.558428,+-70.880049(21881)&iwloc=A&hl=en\"> mufon case (21881) map </A>","Case Number":"21881","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Unknown","Region":"Massachusetts","Source":"MUFON","Disposition":"Hoax","Viewing Distance":"Over One Mile","Summary":"there are crafts that are have been at in the air every night since the summer, i don't know if they are ufo or american..but nothing I am aware of","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Date Submitted":"02/13/2010 07:31 UTC","divs":["Sighting Detailsfrom Dane Street beach in Beverly ,ma..every evening since this summer there have been crafts in the sky over Salem Willows and that point there in to the ocean. 2 or 3 that appear to cirlce ...feels like they are black ops or something? because they don't have sound like a helicopter and move differently. there are more since this summer. There is also some activity in the water that they appear to put a spot light on from time to time and then shut off the lights and hang around ..flying back and forth betwwne the ocean just off the tip to the towers of a plant in Salem. There has been more activity and since the summer. it drives me crazy to see this going on..and feel that something is going on right in front of everyone. It could be some project I am unaware of but I don't think so at all. since that time I started becomeing aware of this activity..a couple months ago I also on night had different craft follow me..at the time that was at meadow road in beverly...it followed over me down the street and back ( it had 2 like spot lights that when in a circle ) eventually it just went from 2 lights in a circle to them going in a line and taking off and disappearing. This is all new to me to see this stuff. I am just tired of watching this activity every time I go in that Dane street beach area or Salem Willows..cause I know it is not normal. Please investigate this and let me know what the heck is going on ..just for my own information please."]}