{"Longitude":"-122.061003","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.910353,+-122.061003(21888)&iwloc=A&hl=en\"> mufon case (21888) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsI have been an avid stargazer for 5 years now and have seen many different objects in the night sky which to my knowledge can be identified as celestial or man made such as meteors, Iridium flares and a host of others. However there seems to be this one anomaly that I can't logically deduce! This is not the first time I have observed these events. The latest was early morning on the 14 of Feb. I woke early to gaze as I find it easier to spot satellites when I saw 2 lights which looked to be stars moving together from west to southwest at 45 degrees just south of ursa major (Big Dipper). At first I thought my eye's were playing that trick created when there's nothing in the background which makes them seem to dance around. Not the case here as they moved a considerable distance in one direction then stopped then changed orientation from one another while keeping an equal distance between them. There also seemed to be 2 faint lights which faded in and out that appeared to be connected in some way. It's like there's an invisible object using some sort of cloaking to either mimic a few stars traversing the sky or rendering transparent so as to see through it. I am now reading an increase on these particular sightings. Fascinating to say the least. After close observation of at least 10 of these sightings in the past year, I have yet to come to a logical explanation. Last bit here, they appear to be within or very close to our atmosphere as I can almost make out a shape and see contour to see around whatever they are."],"Object Features":"Undisclosed","trends":["There have been 9 other sightings in Walnut Creek","There were no other sightings in Walnut Creek on or around February 14th 2010"],"Log Number":"US-02142010-0005","City":"Walnut Creek","Weather Factors":"None","Source":"MUFON","Object Shape":"Star-like","Case Number":"21888","Summary":"3 star like objects moving in unison & changing orientation & maintaining equal distance","Date Submitted":"02/14/2010 10:38 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/21888.html.txt","/var/www/straped/mufon/org/21888.html"],"Country":"United States","Latitude":"37.910353","Tags":"City","Date of the Event":"02/14/2010 05:15 UTC","Disposition":"Unknown","Object Flight Path":"Undisclosed"}