{"Source":"MUFON","Log Number":"US-02152010-0003","Case Number":"21897","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/21897.html.txt","/var/www/straped/mufon/org/21897.html"],"Summary":"Apparent airplane seen at night, over a city, takes a violent dip of approx. 100 feet in two seconds, then bounces back to original altitude.","divs":["sighting detailsmy wife and i were going to jack in the box around 7:00 pm. she was driving. out my passenger-side window, i saw what looked like a plane's lights. this was over a residential neighborhood about about 1\\2 mile away. at first i saw a \"root beer\" colored light that was not bright but bigger than any star or planet. as soon as i started watching it, i saw it jerk to the right, turn to a dull white color and then disappear. a second later it appeared again as a red light, about the same size as when it was \"root beer\" colored. it was moving about the speed you would expect a plane to be moving. all of a sudden it took a dive like a roller coaster when it goes down that first steep plunge. i estimate that it plunged 100 feet. at the bottom it looped back and returned to it's initial altitude. the entire maneuver took two seconds or less. when i saw dive, it really got the adrenalin going. i knew innately that this was a much too radical maneuver for a plane. for one thing, it's against faa regulations for planes to be flying like that over a city. i lost sight of the object when we drove past some buildings."],"trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around February 12th 2010"],"Tags":"City","Date of the Event":"02/12/2010 07:00 UTC","Longitude":"-120.993078","Disposition":"IFO","Date Submitted":"02/15/2010 01:44 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.643307,+-120.993078(21897)&iwloc=A&hl=en\"> mufon case (21897) map </A>","Sighting Duration":"00:01:00","City":"Modesto","Latitude":"37.643307","Object Shape":"Star-like","Viewing Distance":"Unknown"}