{"Log Number":"US-02152010-0005","Region":"Vermont","Disposition":"Unknown","Latitude":"43.48164","City":"Windsor","map":"<A HREF = \"http://maps.google.com/maps?q=43.48164,+-72.381568(21899)&iwloc=A&hl=en\"> mufon case (21899) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/21899.html.txt","/var/www/straped/mufon/org/21899.html"],"Object Features":"Unknown","Date of the Event":"02/13/2010 12:00 UTC","Case Number":"21899","Tags":"City","divs":["Sighting DetailsA friend and I were grilling steaks on our back deck and admiring the beautiful night sky. There were clouds, but very high up. It was windy, from the Northwest. My friend first noticed three configurations of five red lights each, steady and not blinking. They were close to a mile up in altitude, and some distance away, over New Hampshire on the East side of the Connecticut River. We were situated near the top of Cobb Hill with a clear view of the area in which these lights appeared to be situated. The groups were far apart, at least fifty to a hundred yards. They were positioned one over the other, but not in a straight line, the middle group being to the right of a straight line between the top and bottom groups. What was noticeable was that the lights did not move relative to the ground or relative to each other for close to five minutes; they just hung there in the air. I left my friend and went inside to get the others in our group. By the time I returned, probably twenty seconds later, my friend said that the lights just left almost instantly just before we had come outside. We speculated as to what the lights might have been. They were much too high to be something tethered to the ground. If they were aircraft or helicopters they would have moved, at least relative to each other. They were too far apart to be lights from the same vessel of any kind. We could not come up with a reasonable explanation. The sighting was not frightening, but puzzling. Neither my friend nor I have ever seen or reported a sighting of any kind before. I don't drink and he had had less than one beer. Neither of us uses drugs nor is either of us on any kind of suspect medication that might have affected our senses or perceptions, and we saw exactly the same thing."],"trends":["There has been one other sighting in Windsor","There were no other sightings in Windsor on or around February 13th 2010"],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"02/15/2010 06:03 UTC","Country":"United States","Object Shape":"Square, Rectagular","Longitude":"-72.381568","Viewing Distance":"Over One Mile","Summary":"Sighting of three groups of red lights stationary in the sky and relative to each other."}