{"Object Flight Path":"Unknown","Longitude":"-90.492621","Country":"United States","Sighting Duration":"00:30:00","Region":"Missouri","City":"Valley Park","Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date of the Event":"06/14/1976 02:00 UTC","Case Number":"2189","trends":["There have been no other sightings in Valley Park","This sighting has never been favorited."],"Log Number":"","Date Submitted":"06/14/1976 02:00 UTC","files":["/var/www/straped/mufon/html2text/2189.html.txt","/var/www/straped/mufon/org/2189.html"],"Source":"MUFON","divs":["Sighting Details1. My fiance Dan and I were fishing at a fishing hole at the time. Late night.2. I noticed the object because sometimes when youre fishing, you get bored,and I was just gazing at the sky. I noticed a starlike object moving very highin the atmosphere, north to south, in a slow fashion.3. I pointed it out to Dan and he noticed it-he said looks like a satellite tome. That seemed sensible to me but I continued to watch it move across the sky.I wasnt afraid but curious.4. Dan started watching it with me. We first noticed something was wrong when asmall plane flew by,and the object stopped in its tracks and was completelystill in the sky. When the plane had passed, it resumed its northsouth movement.This got our riveted attention. The plane seemed to cause it to stop.Throughout the entire incident, we did not move from our location.5. As I said, it stopped when the small plane went by, and then resumedmovement. It appeared that it was hiding because when it was stopped it lookedjust like another star. After the plane went by we watched it move around. Itstarted doing strange, abrupt turns-also it would stop, start, turn on an angle.It did not seem to gain or drop in altitude. There was no sound-I assumedbecause it was so high we couldnt hear it-yet the small plane that passed andcaused it to stop was at about 1000 feet.We watched it for some minutes as it changed direction, stopping, starting. Thenall at once it just-from a stop-sped off upwards at an incredible speed-I cannoteven estimate the speed-perhaps 700 mph and out of sight immediately.6. As I said, it sped off and was out of sight within 1 second."],"Weather Factors":"Unknown","Object Shape":"Unknown","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=38.54922,+-90.492621(2189)&iwloc=A&hl=en\"> mufon case (2189) map </A>","Latitude":"38.54922","Summary":"Viewed a flying object performing oddly at night."}