{"map":"<A HREF = \"http://maps.google.com/maps?q=-33.226995,+151.503008(21896)&iwloc=A&hl=en\"> mufon case (21896) map </A>","Longitude":"151.503008","divs":["Sighting Detailsmy mother was driving myself to school and had two of her work friends in the car also, we where driving east to south east from the small township of cumnock towards Orange, a much larger country city in central west New South Wales, Australia. I was in the rear seat behind mum who was driving, the ufo was on the right side of the car as we drove past so i had a clear view. We where about halfway between the township of Molong and Orange when i noticed in the distance a glow on the side of a small hill, at first i thought it was the sun refecting of a new tin roof but i had not noticed it before so looked out of place, it was very visible to west bound traffic and would have had anyones attention. as we drove closer to and rounded the bend i saw this very large disc object with 3 what looked like normal human being around the ufo, one was walkiing towards the road to the fence line, i didnt say anything but looked at mum and the front passanger and both where looking in the same direction as the object but we said nothing, the passenger next to me was looking out the other window so would not have seen anything. for me i didnt want to say anything incase they didnt see the same thing but i am sure they would have, it was easily seen by anyone in the front seat or looking to the right in the back seat going west, being only 14 i didnt think anyone would beleive what i saw so have kept quite till a few years ago. two of the beings, for want of a better word, where standing either side of the craft holding something as was the third being. the ufo would had to of been at least the size of a large flat bed truck, about 15 - 20 mtrs in length, it had landed next to large dead tree and was about the same hieght as the tree, approx 6-8 mtrs, it was the shape of a disc with a bulge in the middle. it had landed on the edge of the small hill the road went around so the top of it was what i had seen from a distance. i couldnt believe my eyes when i saw the whole object let alone the 3 being around it. when i saw the being walking towards the fence line which ran along the side of the road i am sure we where looking at each other, i will never forget him looking at our car as we drove past. we where driving slow around the corner which gave plenty of time to take in as much as i could before loosing sight of it further up the road. i can still picture it as if i had just seen it. it was not a reflection as i first thought or a mist, i know what i saw was very real and i am sure other people driving to work in either direction would have seen the same thing, driving west it would have been seen for a lot longer from a distance, in the other direction it would not have been seen until the corner. They looked too human to be alien, it is my firm belief they where from another planet, our cars may have been a curiosity, the beings would have been around 6feet tall, maybe be a little more, when the being walked towards the fence line he was close enough to the fence for me to see he would have been close to a couple of feet taller than the fence and the others where just as tall. i since found out there was a few reports of sightings around 1972 about the same time of year. i was going to school in orange from 1971 to 1972, but am sure it was 1972 and with the cooler weather i am thinking it would have been around march to april. at the time i was in very good health with no sight, hearing problems."],"Source":"MUFON","Date Submitted":"02/15/2010 01:27 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/21896.html.txt","/var/www/straped/mufon/org/21896.html"],"Tags":"City","Case Number":"21896","Country":"Australia","Region":"New South Wales","City":"Charmhaven","Object Features":"Dome","Latitude":"-33.226995","Summary":"white glowing like you would have if a fluro light is turned on outside in daylight, 3 human like people standing around disc in similar glowing like suite..","trends":["There have been no other sightings in Charmhaven","This sighting has never been favorited."],"Viewing Distance":"21-100 Feet","Log Number":"AU-02152010-0002","Object Shape":"Disc","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Flight Path":"Stationary","Date of the Event":"03/31/1972 08:00 UTC"}