{"Date of the Event":"03/15/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/21892.html.txt","/var/www/straped/mufon/org/21892.html"],"Object Shape":"Disc","Object Features":"Undisclosed","Source":"MUFON","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around March 15th 2008"],"Latitude":"39.773646","Longitude":"-86.149174","Disposition":"Insufficient Data","Region":"Indiana","Object Flight Path":"Undisclosed","Weather Factors":"None","Country":"United States","Case Number":"21892","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.773646,+-86.149174(21892)&iwloc=A&hl=en\"> mufon case (21892) map </A>","divs":["Sighting DetailsIt was dark out and my son wanted a toy out of the car. I told him (8 yrs. old) go ahead and run out and get it honey im right here.(still inside) I heard the car door shut and he came running in saying he saw 4 lights in the sky that look like a ufo. Always being a believer, I still was like sure hhoney lets go look. I stood there in shock trying to come up with another explanation of what I was seeing. I couldnt see details because it wass enclosed in a cloud of mist or something, way to low to be a cloud. It was very low what seemed to be maybe 40 ft, but probably more. I saw 4 big lights shining from within the mist. They were 4 different colors. The shade of color coming through the clouds was blue pink green clear. This object was of considerable size and just hovered silently over my neighbors house. I began to feel a sense of unknowing fear because my son was still outside with me. i grabbed his arm and pulled him inside still in a state of i guess shock. It was a very strange feeling and even stranger i didnt react the way i thought i would if i had seen something like that. I came inside told my boyfriend to look but didnt take me seriously a brushed it off. Not a believer. I then just remember sitting on the couch scared and peeking out my side door to see if it was there. Im guessing it remained for probably another ten minutes. I amshocked that I never picked up the phone to call my dad who probably would have drove over to see. I get a weird feeling of just kinda blanking out. Even stranger, I didnt remember to tell anyone for a couple of days, which is very strange for me! My neighbors were retired nuns who had lived there for years. I never asked them about it out of embarrassment, but wish I had. I noticed some injuries that they said was a surgery, but it was odd that they up and moved back to their perish. I wish I would have said something to them because it drives me crazy not knowing now. Dont have any memory of the rest of the night. Its like it escaped my mind until a couple days later when my boyfriend was making fun of what I said I saw and then I felt really weird, like how could I forget something like that. This is an issue that I have been drawn to my whole life. More of an obsession, now that I have actually seen one, I cant stop thinking about all the mysteries of this world. I must know the truth! I hope we have answers soon!"],"Log Number":"US-02142010-0009","Summary":"My son said, mommy there is 4 lights in the sky that look like a ufo! I went outside and it had to be a ufo!","Sighting Duration":"Undisclosed","City":"Indianapolis","Date Submitted":"02/14/2010 01:13 UTC","Tags":"City"}