{"map":"<A HREF = \"http://maps.google.com/maps?q=31.145739,+-93.255378(21908)&iwloc=A&hl=en\"> mufon case (21908) map </A>","Object Shape":"Bullet, Missile, Circle, Egg, Fireball, Oval, Sphere, Star-like, Teardrop","Tags":"City","City":"Leesville","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"02/16/2010 09:56 UTC","Sighting Duration":"07:30:00","Weather Factors":"None","divs":["sighting detailson february 16, 2010 around 7:30 pm cst i was watching tv and looked out my window and noticed one very bright light in the northern sky. i immediately ran outside to get a better view and then took a picture. i then drove about 1\\4 of a mile to our local lake area in order to get a better view without treetop interference. when i got to the lake which only took about a half of minute, the first one disappeared and then two of these bright lights were side by side and slowly approached my vehicle. the two lights stayed at the same height and and same distance apart while moving, then all of a sudden it appeared that the lights started to move in the opposite direction. i then followed them for about 2 miles and then they both appeared to have burned out. within seconds one more bright light appeared and continued to move away from me, and i also followed that one for about 3 miles and it seemed to have burned out. on the way home i noticed other people where also at the lake viewing the northern sky. while attempting to write this report, two more lights appeared through my window, i then ran outside again to capture them on camera...this happened about one hour from the first encounter. both lights appeared to stay stationary and burned out after about a minute, then another one appeared, but this one moved slowly and burned out about after one minute or so. i was not scared, more curious and wanting to capture it on camera. just makes me wonder, what or who is out there?"],"files":["/var/www/straped/mufon/html2text/21908.html.txt","/var/www/straped/mufon/more/21908_submitter_file1__feb16thlightsintheskystrange057.JPG","/var/www/straped/mufon/more/21908_submitter_file2__feb16thlightsintheskystrange058.JPG","/var/www/straped/mufon/more/21908_submitter_file3__feb16thlightsintheskystrange063.JPG","/var/www/straped/mufon/org/21908.html"],"Country":"United States","Object Features":"Unknown","Case Number":"21908","Viewing Distance":"101-500 Feet","Date of the Event":"02/16/2010 08:30 UTC","Longitude":"-93.255378","Disposition":"Unresolved","trends":["There have been 3 other sightings in Leesville","There were no other sightings in Leesville on or around February 16th 2010","This sighting has never been favorited.",""],"Log Number":"US-02162010-0007","Region":"Louisiana","Summary":"Strange lights above Vernon Lake","Latitude":"31.145739"}