{"City":"Tempe","map":"<A HREF = \"http://maps.google.com/maps?q=33.42946,+-111.937175(21917)&iwloc=A&hl=en\"> mufon case (21917) map </A>","Summary":"Imagine seeing a full moon but orangish glow color. I was within 50 to 75 feet from it. I know without a doubt it saw me too.","Region":"Arizona","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"02/17/2010 05:11 UTC","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around November 6th 2001"],"Log Number":"US-02172010-0008","Object Shape":"Circle, Sphere","divs":["Sighting Detailsi lived in tempe arizona when i saw it. i was on my way home and in tempe behind every house theirs an ally. well i took the allys home cause it is way faster. anyway, im walking down an ally heading towards home when out of the corner of my eye i saw a orange ball kinda hidden behind a tree. i didnt think nothing of it except it must be the moon. well my mind changed quick when it moved out from that tree. i stopped instantly and just stared at it.it was nomore than 75 feet from my head and it just moved floated or hovered whatever you call it over my head. not even the slightest of a sound as if it controls sound. as it moved, my eyes moved with it.I SWEAR TO YOU THAT IT SEEN ME. THE REASON I KNOW THIS IS CAUSE IT WAS MOVING LIKE IT WAS THE ONLY THING AROUND AND IT HAD NO WORRIES BUT ALL OF A SUDDEN ITS LIKE IT GOT SPOOKED OR FLINCHED AND TOOK OFF FROM MOVING SLOW TO LIGHT SPEED. IT WAS MOVING TO THE LEFT AND THEN BOOM! STRAIGHT UP IN THE AIR SO FAST THAT IT LEFT A TRACER. JUST LIKE A SHOOTING STAR! i know that what i saw was definiately something thats not us. i think that i am the only one who has been that close to one before according to alot of sightings ive researched. i am extremely lucky to have seen this so upclose."],"Weather Factors":"None","Case Number":"21917","files":["/var/www/straped/mufon/html2text/21917.html.txt","/var/www/straped/mufon/org/21917.html"],"Date of the Event":"11/06/2001 09:30 UTC","Country":"United States","Tags":"City","Sighting Duration":"00:25:00","Disposition":"Unknown","Object Features":"None","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","Latitude":"33.42946","Source":"MUFON","Longitude":"-111.937175"}