{"Object Shape":"Other","Object Flight Path":"Stationary","divs":["Sighting DetailsI awoke in the middle of the night with my my head spinning so much that I felt sick. My first thought was, \"Did I drink? Is this a hangover?\" but as I was laying there I realized I hadn't had any alcohol at all. I couldn't move - in part I think because of the spinning and inability to focus my vision - and both my arms were numb as if they had been \"asleep\" and were now slowly and painfully \"waking up\". I then started rationalizing because of the arm numbness that perhaps I was having some sort of heart attack or something and I tried my best to calm my mind down. When the dizziness subsided a bit I was able to get myself up into a seated position. I was feeling very nauseous and thought I'd better get downstairs in case I was going to be sick. Movement was still difficult though. At that point I looked up (our bedroom is at the top of the house and there is a big window in the slanted part of the roof right above the bed) and saw this - for lack of a better description - spaceship that seemed to be just \"parked\" in the air about 50-100 meters above my house. From what I saw of it it was huge - I couldn't see the sides of it - and it was dark and there was a very bright pale green rectangular panel of light that was shining, although not like a beam, down on me. There was no noise coming from it at all. The strange thing was that as I was staring up at it, it seemed to be emanating the thought, \"this is nothing, don't look here. It's nothing\". Whether the \"ship\" really was projecting that thought or whether I was just experiencing a very human reaction to something one can't wrap one's mind around, I couldn't tell you for sure. But my experience of it was that it was sending the thought out to me. I could tell it was focused on me and \"looking\" at me - and I suddenly became aware of a feeling that I wasn't supposed to have awakened so quickly and for some reason at that point I became afraid. It wasn't a fear like \"These people are evil\", but rather it seemed to be a very primitive fear of something that was very outside my realm of experience. Throughout all of this my husband was asleep next to me. I really don't know why I didn't think to wake him up. I think maybe it was a combination of the extreme nausea and incomprehension of what was happening. I made my way downstairs and it was at that point that I saw that it was just before 4:00 AM. I had a bit of bread to try to settle my stomach but the dizziness, while it abated a bit, didn't completely go away for another 2 or 3 days. I sat downstairs going through everything in my mind and I was sort of trying to convince myself that it didn't happen. Then a few hours later my husband came downstairs and the first thing he said was, \"something very strange happened last night\" and he proceeded to describe the same ship, the light (which he felt was somehow also \"inside\" the room), and the feeling of \"this is nothing, don't look at it\" coming from the ship. He had noticed I was gone (I'm assuming this is after I'd gone downstairs) then had gone back to sleep. Before this happened I was never particularly interested in UFOs or Aliens. I had an open mind about it but it didn't particularly matter to me and I thought people who talked about encounters were mostly just attention seekers. Well this experience has changed everything. Whether I was \"abducted\", I have no idea. But I do feel as if I'm waiting for \"them\" to visit again. My husband and I have got into the habit of gazing up at the sky before we go to sleep and in the weeks after this event we saw several strange things there. We saw a strangely-shaped thing with multicolored lights flying in an odd formation and we've seen several times things that almost look like stars but they are moving - not in a straight line like an aircraft or a comet, but sort of all over the place like an insect. Something else: That night when I went downstairs I had this incredibly happy feeling come over me as if \"someone\" were telling me not to be afraid and that everything was going to be alright. That feeling has stayed with me since this incident. I feel like whoever \"they\" are, the fact that they are here is a good thing. I don't feel any evil about it at all. PS. I've ticked the box to not agree to release this information to third parties because I'd like to know who those third parties would be first. I feel rather guarded about who I tell this experience to. Thank you JCS"],"trends":["There have been no other sightings in Ghent","This sighting has never been favorited."],"Date Submitted":"02/17/2010 03:25 UTC","Viewing Distance":"101-500 Feet","Log Number":"BE-02172010-0003","Disposition":"Unresolved","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21912.html.txt","/var/www/straped/mufon/org/21912.html"],"Longitude":"3.72","Region":"Flemish Region","Tags":"City","Object Features":"Other","Country":"Belgium","map":"<A HREF = \"http://maps.google.com/maps?q=51.05665,+3.72(21912)&iwloc=A&hl=en\"> mufon case (21912) map </A>","City":"Ghent","Date of the Event":"07/27/2009 12:00 UTC","Summary":"I saw the underneath part - it was very dark and with a huge pale green panel of light.","Latitude":"51.05665","Weather Factors":"Unknown","Case Number":"21912","Sighting Duration":"Undisclosed"}