{"files":["/var/www/straped/mufon/html2text/21920.html.txt","/var/www/straped/mufon/org/21920.html"],"City":"New York","Case Number":"21920","Object Flight Path":"Path then hovering","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.719753,+-74.002393(21920)&iwloc=A&hl=en\"> mufon case (21920) map </A>","Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.719753","Summary":"Fell through the clouds like a falling jet then hovered towards the horizon towards Newark Bay!","Object Shape":"Disc, Oval, Other","Tags":"City","divs":["Sighting DetailsI was coming out of the Duncan Donuts by the old Military Ocean terminal in Bayonne and it was heavy snow. I stayed outside my car looking toward the Manhattan skyline which was hardly visible. I glanced up into the snow for a moment as I was about to get in and saw a hole in the clouds open and what I thought at first was a jetliner falling. My heart in a panic, I thought there would be a crash before my eyes. Suddenly this air craft stopped in midair and stated to float in the direction of the Verraza no Bridge. When it stopped it became apparent that it was a saucer craft that has some kind of propulsion on the bottom of the saucer. It also had a dome and was dark gray in color and made no sound whatsoever. There was a row of what may have been windows but were long and thin markings along the rim. I felt as if this craft had to duck thru the clouds as a sort of evasive monuever because it seemed to be sneaking along the bottom of the clouds..the object had some type of distortion effect on the atmosphere around it. I lost sight of it as it went through the heavy snow towards the bay."],"Date Submitted":"02/17/2010 08:23 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around February 10th 2010"],"Log Number":"US-02172010-0011","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"02/10/2010 12:00 UTC","Object Features":"Dome, Window(s), Patterned Surface","Weather Factors":"Snow, Heavy","Longitude":"-74.002393"}