{"Summary":"Much snow and ice hangs over the edge of our roof so I was looking up, and I caught the ufo out of the corner of my eye,","Date of the Event":"02/18/2010 06:45 UTC","Date Submitted":"02/18/2010 08:35 UTC","Sighting Duration":"Undisclosed","Disposition":"IFO","Longitude":"-93.451339","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.016259,+-93.451339(21928)&iwloc=A&hl=en\"> mufon case (21928) map </A>","Object Shape":"Sphere","Case Number":"21928","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-02182010-0004","divs":["Sighting DetailsWe have much snow and ice hanging over the edge of our roof, ready to fall, so I was looking up after taking the trash can to the curb. I caught the ufo out of the corner of my eye. At first I thought airplane as MSP isn't very far away. It was about half the size of a pencil held at arms length. Direction was NW to SE in the direction of the airport, however, the object didn't make any sound. I've heard many airplanes fly over and they are loud enough to hear. The object was a white sphere. I didn't see any blinking lights, nor did I see wings, and the object didn't appear to be very high. I watched the object til it went behind the neighbors house, so I walked approximately 50 feet to watch it between the 2 nearby homes. I didn't see it any longer. The speed was like that of an airplane, so there is no way it would have traveled far enough in those few seconds to be at the horizon, nor would it have been far enough to have landed if it was an airplane on final approach to MSP. The attached photo was taken with my cell camera, which is a samsung highlight with a 3.0 mp camera."],"Tags":"City","Region":"Minnesota","trends":["There have been 6 other sightings in Plymouth","There were no other sightings in Plymouth on or around February 18th 2010","This sighting has never been favorited.",""],"Object Features":"Unknown","City":"Plymouth","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/21928.html.txt","/var/www/straped/mufon/more/21928_submitter_file1__Photo0011.jpeg","/var/www/straped/mufon/org/21928.html"],"Latitude":"45.016259"}