{"Viewing Distance":"Unknown","Region":"England","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"0.488736","Case Number":"21936","Log Number":"GB-02192010-0003","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/21936.html.txt","/var/www/straped/mufon/org/21936.html"],"Latitude":"51.576084","Date of the Event":"10/10/2009 10:30 UTC","City":"Basildon","Date Submitted":"02/19/2010 05:28 UTC","Summary":"bright light in night sky low down could be seen above row of houses.","Country":"United Kingdom","divs":["sighting detailsas i was getting ready to go to bed i noticed that it was a full moon. as my room window faced the moon at around that time i decided to open my blinds and let the light of the moon fill my room. i laid in my bed watching the sky and admiring the stars. as i looked southwards i noticed an unusual star. the star seemed to be moving towards my house as it was getting brighter and bigger. this went on for around half hour (that i noticed. then it stopped. i could not possibly say how big it was or how close, low etc but i can say that it was not a plane nor a helicopter. in comparison to the stars around it, it was much bigger and brighter. after it had stopped it started to flash on and off. being a bit wary i called my parents up to my room to take a look. neither could really say what it was. i continued to observe this 'star\\plane\\ufo?' for the next half hour but there was no more movement and so i fell asleep. the next evening, at around the same time i looked to see if this object was there again. it was not and has not been there ever again. i can definitely say that this was not a star, a meteorite, a plane or any other explainable object. i now believe that this was something 'supernatural' maybe alien??"],"trends":["There has been one other sighting in Basildon","There were no other sightings in Basildon on or around October 10th 2009"],"Source":"MUFON","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.576084,+0.488736(21936)&iwloc=A&hl=en\"> mufon case (21936) map </A>","Object Features":"Unknown"}