{"Viewing Distance":"Unknown","Log Number":"US-02192010-0001","trends":["There have been 10 other sightings in Punta Gorda","There were no other sightings in Punta Gorda on or around February 18th 2010","This sighting has never been favorited.",""],"Longitude":"-82.042276","Region":"Florida","Weather Factors":"Unknown","Disposition":"Unknown","Date of the Event":"02/18/2010 11:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.937964,+-82.042276(21934)&iwloc=A&hl=en\"> mufon case (21934) map </A>","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsI got off work at 11:30PM and was driving home. There is a bridge that I have to drive over and this is where I first saw the object. It was moving parallel to me at what looked like the same rate. I thought nothing of it because there are two airports near me and I figured it was just another plane. I turned off of US 41 onto East Olympia ave, and came to the stop light. I looked over too my right to see the object moving towards me parallel to the street. This seemed odd because it was about a 90 degree turn from its initial direction, and I hadn't seen it make the turn. Usually an airplane that big takes a while to turn. It was moving slowly over the buildings of downtown punta gorda. Then it completely stopped moving. It just stopped! Airplanes cant hover in the air like that. I was shocked I leaned over the passenger seat to look out the window, and get a better look. It was triangular with a total of seven white lights four, on what I'm calling the back based on the direction it was moving, two close together near the front on the side closer to me, and one in the middle on the side away from me. It also had two red lights on the bottom around the middle evenly spaced parallel to the back. I was staring at it for a little while then it started moving again. I noticed that as the object was moving the red lights blinked, but when it was still they were off. It appeared that there were two faint white streaks coming from behind the object, but that could have just been clouds. The object eventually moved out of my vision and I did not pursue it. I have been a believer for years now, and I am mixed on whether or not to be happy or nervous at the fact that I have now had experiences myself. I am a graphic designer So when I got home I sketched out and then modeled the object in 3D, which I am including as an attachment to this report."],"Case Number":"21934","Object Shape":"Triangle","Source":"MUFON","Latitude":"26.937964","Object Features":"Unknown","Tags":"City","City":"Punta Gorda","files":["/var/www/straped/mufon/html2text/21934.html.txt","/var/www/straped/mufon/more/21934_submitter_file1__UFO_re-creation.jpg","/var/www/straped/mufon/org/21934.html"],"Sighting Duration":"Undisclosed","Date Submitted":"02/19/2010 01:39 UTC","Summary":"A strange triangle shaped ufo with 7 white lights and 2 red lights.","Country":"United States"}