{"Object Features":"Unknown","Latitude":"34.229696","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"North Carolina","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.229696,+-77.93859(21933)&iwloc=A&hl=en\"> mufon case (21933) map </A>","trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around February 18th 2010","This sighting has never been favorited.",""],"Disposition":"Unknown","City":"Wilmington","Country":"United States","Log Number":"US-02182010-0009","Object Shape":"Fireball, Sphere","Summary":"blue light flying in patterns, figure 8, loops etc.","Viewing Distance":"Over One Mile","Case Number":"21933","Source":"MUFON","Date Submitted":"02/18/2010 11:23 UTC","Date of the Event":"02/18/2010 10:20 UTC","files":["/var/www/straped/mufon/html2text/21933.html.txt","/var/www/straped/mufon/org/21933.html"],"divs":["Sighting DetailsI was outside smoking a cig, because we dont smoke inside the house, messing around with a laser i have for my rifle, hi powered green laser. decided i was going to get my rifle out of my truck, turned around after locking up, was walking back to the house, when i saw a blue light, it was really bright, going left right left right, real fast. i stopped, confused at what i saw, we live near an airport, so i thought maybe i was misinterpreting a plane or whatever, then the light stopped, and started doing very tight, and very fast figure 8 pattern, i ran to the door, yelling for my brother, he and his girlfriend came out, and saw what i saw. a bright blue light doing tight and fast figure 8 patterns, i shined it with my laser, (generally, it was kind of far away and hard to judge) instantly, the blue light stopped. i turned the laser off, and the blue light in the sky turned bright green, and then shot up in the air, a few miles i would guess. it then started doing huge loops, while flashing blue, black, blue, black. i ran inside and grabbed my camera and beat on my father's door yelling for him to come, we went outside, and he also saw it, i got a short recording of it, maybe 1:30 one min 30 seconds. doing some pretty strange things, but not like what we (me, bro, and his GF) saw. my mother came out and saw the last bit of it, it was maneuvering in strange patterns away from us, towards the south. it went behind the tree line, and that was it. i was excited, i actually had people see what i see on a regular basis. and caught it on camera, though crappy quality, i know its authentic. i see strange things in the sky, quite often, 2-3 times a month usually. i tell my family about them, but they never believe me, and ive never been fortunate enough to have them with me at the time, or be near a camera until this evening. im kind of shaky, my nerves are rattly at the moment, its normal and goes away after a little bit, but probably not tonight because i was able to get witnesses, and video. if there is anyway you can clean this video up some, id like a copy of it, if thats is fine by you guys, id pay for if it necessary. thanks"],"Object Flight Path":"Other","Longitude":"-77.93859"}