{"Object Features":"Undisclosed","Longitude":"-83.913079","Summary":"A Moon right above a street lamp","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Date of the Event":"08/11/1971 09:36 UTC","divs":["Sighting DetailsThis probably sounds stupid. I am forty years old and this happened when I wasaround 9 yrs. old. I was in the house and I thought I should go outside, summerevening, not too late, nice weather and as a kid I just wandered outside,nothing unusual. I went to the back yard and this caught my eye. Right above aneighbors street lamp was a moon. Honestly, a moon, revolving and it wasshowing the street light on it like the moon does the sun. It was revolvingfairly fast and it even had crater marks. I was amazed and for a second thoughtthe moon was crashing but then thought it was an asteroid or meteor but thenwondered why it was hovering above the street lamp. I felt very calm duringthis and fascinated. I went to get my parents and yelled for them to comeoutside and ran back to the back yard, the thing was just a small speck aboutthe size of a raisin in the sky and disappeared. It was fairly large when itwas above the street light, my folks just shrugged when it was not there.Later, I had some very unusual awake dreams where the Munsters, yes the Munsterswere touching me and talking to me and raising me up to sitting position andlaying me back down in my bed, nothing scary but I could feel them even though Icould see right through them.I have always wanted to relay this to see if this sounds like anything anyonemay relate to. I swear it did occur and I do not believe it was hallucinationbut I dont know.Rodney Beason2100 Wilson Road Apt 122Knoxville, TN 37912I will be changing email at the end of the week so I can be mailed regular mailif anything seems to be anything with this. If not, sorry to have taken up yourtime but thank you anyway."],"trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around August 11th 1971"],"Country":"United States","Latitude":"35.965388","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.965388,+-83.913079(2193)&iwloc=A&hl=en\"> mufon case (2193) map </A>","Case Number":"2193","Tags":"City","Log Number":"","files":["/var/www/straped/mufon/html2text/2193.html.txt","/var/www/straped/mufon/org/2193.html"],"Date Submitted":"08/11/1971 09:36 UTC","Sighting Duration":"00:05:00","Viewing Distance":"21-100 Feet","Disposition":"Insufficient Data","Source":"MUFON","City":"Knoxville"}