{"City":"Seattle","Source":"MUFON","Log Number":"US-02192010-0011","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around February 19th 2010"],"Date of the Event":"02/19/2010 06:47 UTC","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Boomerang, Triangle","Disposition":"Insufficient Data","Region":"Washington","Summary":"What I saw was real","Latitude":"47.668678","Date Submitted":"02/19/2010 11:31 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/21944.html.txt","/var/www/straped/mufon/org/21944.html"],"Longitude":"-122.382133","Case Number":"21944","Object Features":"Undisclosed","divs":["Sighting DetailsOk...so now what. I actually saw something very strange tonight. I live in ballrd, wa. My building has a rooftop deck. The sun had set and the sky was mostly dark now. I was smoking a cig, and watching the normal path of air traffic that flows into Seatac airport. i just happened to be looking at a patch of ski to my south, when I noticed a flying V- shaped bommerrang craft flying lower than normal air traffic, about 1500 ft, traveling directly east at a high rate of speed. It was completely dark..no aircraft lights at all and completely silent. If, I held out my arm, it would take my entire hand to fully block the object. It blended in perfectly to the night sky. It was more like watching an invisible shape blocking the sky behind it as it moved. I watched the object travel from west to east until it disappeared in the distace and darkness (about 15 seconds). I don't believe that anyone could have seen this object unless you just happened to be looking directly at it, as I was. I feel kinda freaked out because, #1. I definitely saw this. 2. Because I know that I definitely saw this, what was it?, and what is it doing? This is not a joke. I am someone who knows the value of the scientific method. Summary: Flying craft, completely silent and extremely stealthy, flew over Ballard, Wa."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.668678,+-122.382133(21944)&iwloc=A&hl=en\"> mufon case (21944) map </A>"}