{"Tags":"City","Weather Factors":"Unknown","trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around December 27th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Case Number":"21948","Region":"California","files":["/var/www/straped/mufon/html2text/21948.html.txt","/var/www/straped/mufon/org/21948.html"],"Log Number":"US-02202010-0004","Date Submitted":"02/20/2010 01:39 UTC","Object Features":"Undisclosed","City":"Clovis","Country":"United States","Date of the Event":"12/27/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.833448,+-119.694619(21948)&iwloc=A&hl=en\"> mufon case (21948) map </A>","Disposition":"Unknown","Latitude":"36.833448","Object Flight Path":"Straight-line path","Summary":"dark double-wing shape with red blinking lights","Longitude":"-119.694619","divs":["Sighting DetailsOn a cloudy evening around Christmastime, my 14-year-old daughter and I were outside in our backyard with our dogs, doing one of the frequently needed bathroom breaks for our new border collie puppy. The sky was overcast with the clouds low and visible, reflecting the city lights, as is common on a winter night. We live in Clovis, close to the Fresno-Yosemite Airport, which gets routine air traffic and also has air reserve practice a couple of times a month. We were facing northeast. From behind us and overhead, a pretty large, dark boomerang shape glided silently across the sky going from south to north. About ten slowly blinking red lights echoed the object's shape. We noticed it because it was very big and right overhead and close and had blinking lights. It just catches your eye, that does. My daughter and I noticed it at about the same time, I think. The lights seemed to be positioned in the midbody along the wings, echoing the shape of the object. The boomerang looked like about a 120-130 degree angle. It was going pretty slow for something that big. Like it had no stall speed. It looked low, between us and the clouds for sure. How big? Hard to say. It was pretty big, though. If I held my arms up, I could not have covered the shape with both my hands outspread. Not even close. Maybe if I had a piece of legal sized paper, that might have covered it. My daughter and I just looked at each other and then stared at it. I don't remember if it went out of sight or if I just went inside. I think it just flew off. I don't remember if we said anything at the time. Nothing memorable. Maybe something like, \"Boy, what IS that?\" I felt kind of stunned. At first I thought...what is it? and tried to find a category for it. Finding no category is a little confusing when the thing is some kind of flying craft. Seems like it should be a plane or a blimp or something we know to fly. We didn't say anything else at the time and we didn't talk about it. Recently I brought it up in family conversation and my husband asked why didn't I say anything, and I am not sure. My daughter told about it too and said then that there were helicopters flying around awhile afterward. I sort of felt like it was being escorted somewhere."],"Source":"MUFON","Object Shape":"Boomerang"}