{"Sighting Duration":"01:10:00","Latitude":"-36.8429","divs":["Sighting DetailsAt approximately 1.30am my friends and I went out for a cigarette when we noticed a large multicoloured flashing light in the sky. It was flashing bright white red blue and green. It would flash extremely bright at times and at other times dimming and completely fading out before returning to flashing. We left to go inside once we had noticed it moving and then returned approx 5mins later and it was still there. At this time my dog took off and would not return to our calls which has never happenned before, after getting a torch and searching for him we found him with his tail between his legs and uncooperative but okay. It was extremely large, speherical, and flashing. We had also noticed one earlier however the one earlier was a singular white light travelling across the sky at an extremely high speed. At the time of writing this (2.24am)it is still there. We have video footage but we are unable to up load on to the computer at the moment, will send it with your reply. signing off at 2.50am and it is still there. however it is getting dimmer and moving south. Samantha Spencer Auckland-New Zealand."],"Viewing Distance":"Over One Mile","Region":"Auckland","trends":["There have been 51 other sightings in Auckland","There was one other sighting in Auckland on or around February 21st 2010"],"City":"Auckland","Tags":"City","Weather Factors":"Unknown","Country":"New Zealand","Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"Dome, Other","files":["/var/www/straped/mufon/html2text/21945.html.txt","/var/www/straped/mufon/org/21945.html"],"Date Submitted":"02/20/2010 08:48 UTC","Case Number":"21945","map":"<A HREF = \"http://maps.google.com/maps?q=-36.8429,+174.772532(21945)&iwloc=A&hl=en\"> mufon case (21945) map </A>","Object Shape":"Blimp, Circle, Flash, Sphere, Star-like","Summary":"going out for cigarette, looking at stars, looking at stars, saw multi coloured flashing light fading in and out,and moving,","Disposition":"Unresolved","Longitude":"174.772532","Log Number":"NZ-02202010-0001","Date of the Event":"02/21/2010 02:10 UTC"}