{"trends":["There have been 39 other sightings in Wichita","There were no other sightings in Wichita on or around September 15th 1971"],"Log Number":"US-02212010-0006","Disposition":"Unknown","Region":"Kansas","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21959.html.txt","/var/www/straped/mufon/org/21959.html"],"City":"Wichita","Longitude":"-97.332005","Latitude":"37.697046","Date of the Event":"09/15/1971 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.697046,+-97.332005(21959)&iwloc=A&hl=en\"> mufon case (21959) map </A>","Country":"United States","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Summary":"Formation pattern movement , line up and accelerate in a flash","Date Submitted":"02/21/2010 06:02 UTC","Viewing Distance":"Unknown","Tags":"City","Case Number":"21959","Object Features":"Undisclosed","divs":["sighting detailsfour bright lights approached from the horizen in the west heading in a easterly direction. as they were almost overhead. object one and three deviated from a straight line formation and slowly moved to the south for a few seconds while still staying in motion heading east as a group of four objects. the first and third objects slowly moved back to the north and fit back in a straight line with the other two objects. after a few seconds, object two and four deviated from a straight line formation and slowly moved to the south for a few seconds while still staying in motion heading east as a group of four objects. the four objects continued to move in this zig\\zag fashion for four cycles then once back in line they accelerated east across the sky in a flash! being in a pilot ground school at the time, when four objects appeared in close proximity to one another i thought small aircraft may be violating seperation rules and this caught my attention. then the four objects beguan to zig\\zag with object one and three moving off line and back the object two and four. this was unexplainable to an exact situation? then after a few zig\\zags they lined up and accelerated forward in a flash. nothing man made flying could come close to resemble this."],"Object Shape":"Star-like","Sighting Duration":"Undisclosed"}