{"files":["/var/www/straped/mufon/html2text/21951.html.txt","/var/www/straped/mufon/org/21951.html"],"Disposition":"Insufficient Data","Date of the Event":"11/30/1965 12:00 UTC","Source":"MUFON","Latitude":"39.475523","Longitude":"-87.407589","Summary":"Saw a shiny silver round object in sky near 181st Air Natl'l Guard","Object Flight Path":"Unknown","Object Features":"Unknown","Country":"United States","City":"Terre Haute","Date Submitted":"02/20/2010 06:38 UTC","Sighting Duration":"Undisclosed","Case Number":"21951","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.475523,+-87.407589(21951)&iwloc=A&hl=en\"> mufon case (21951) map </A>","Log Number":"US-02202010-0007","trends":["There have been 22 other sightings in Terre Haute","There were no other sightings in Terre Haute on or around November 30th 1965"],"Object Shape":"Circle, Disc","Weather Factors":"None","divs":["sighting detailsi was a child 8-12 yrs. old playing kickball at the 2nd house se of milner rd. & chamberlain rd. a short distance n of the 181st air natl' guard near hulman airport near my home. this was during a warm-weather month. i saw this object in the sky & watched it on & off for 5-15 min. it was shiny, silver & round (not sure if it was circular or disc-shaped); i was puzzled because it didn't look like an airplane. i kept looking back at it to be sure of this. i was very familar w\\the appearances of airplanes due to growing up so near an airport. i didn't see it when it left or disappeared due to the game. i told my mother about it as soon as i got home, but she discounted it. i've wondered about it every since. (note: yrs. later when i was a teenager i saw a large,bright-orange round object in the sky at dusk that was over the same airport. i was driving on e. wabash ave. near the intersection of wabash & brown avenues. in terre haute & quickly pulled into a parking lot to look at it longer. although it was near sunset, this object was east from my location. i was alarmed enough by this sight that i strongly considered driving closer to the object, but i didn't really have the time to do so & finally convinced myself that it may have been some unusual weather phenomena, etc. also, when i was in my 30s my husband saw an round, circular silver? object on the ground or hovering just above the ground on the nw corner of the property at the intersection of old maple ave. & hunt rd when he was traveling home. in terre haute--vigo co. he said he also heard a strange humming sound then. he paused for quite a while at the stop sign as he faced e. trying to make sense of this object. this was in the early a.m. hrs. not sure of the date or time of year. he told me about it the next morning, but refused to report it--strongly wished to remain anonymous. do not mention this to him or contact him about this.) all three of these sightings were of objects in the e. glenn area of terre haute,in--very near or fairly near the 181st air natl' guard & hulman airport."],"Region":"Indiana","Tags":"City"}