{"Log Number":"US-02212010-0002","Object Flight Path":"Straight-line path","Latitude":"42.36398","Country":"United States","Source":"MUFON","Object Shape":"Disc","Object Features":"None","Date of the Event":"09/05/2005 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.36398,+-71.880907(21955)&iwloc=A&hl=en\"> mufon case (21955) map </A>","divs":["Sighting Detailsgot an instant message from a friend of my brothers online saying he saw something near a small resivouir near where he lives..its not to far from where I live so I went outside to see if I could see something..went out to the backyard and thats when I saw it..low flying,no sound,first glowing close to street light colored..it flew a little bit below the treeline around our neighborhood..circled about 4 times around the area like it was looking for something..before it dissappeared behind the treeline in our backyard it turned to a brite white after the third time it circled before it dissappeared. Im suprised no one else saw it besides me,my brother,and my mom,we thought it mightve been a baloon or something at first..but it flew at a consistant elevation..and didnt float.I was quite shocked..a little scared too and excited along with awe.could see a slight dark disk outline contrast above the glowing..it looked like a really flat cieling light almost.quite strange,never saw anything like that since."],"Disposition":"Hoax","Region":"Massachusetts","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/21/2010 03:33 UTC","Case Number":"21955","Weather Factors":"Does Not Apply","Longitude":"-71.880907","files":["/var/www/straped/mufon/html2text/21955.html.txt","/var/www/straped/mufon/org/21955.html"],"City":"Holden","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Glowing, street light color to brite white, glowing on bottom, dark slim outline on top.","trends":["There has been one other sighting in Holden","There were no other sightings in Holden on or around September 5th 2005"]}