{"Disposition":"IFO","City":"Woonsocket","Object Shape":"Star-like","Summary":"Two lights, one small and one larger travelled over my house from west to east","map":"<A HREF = \"http://maps.google.com/maps?q=42.010316,+-71.505534(21958)&iwloc=A&hl=en\"> mufon case (21958) map </A>","trends":["There have been 10 other sightings in Woonsocket","There were no other sightings in Woonsocket on or around February 20th 2010"],"Tags":"City","divs":["Sighting DetailsI have to smoke outside and on the early morning of Feb. 20 at 5:15 am, I went out for a cigarette. It was a very clear night at the time. There were many stars which I looked up to see. As I finished my smoke, I noticed up to my left a bright star like object travel from behind the house heading east. It was silent with no blinking lights. I was amazed and watch but a second later, a larger light came out travelling slightly behind the smaller one. I walked out onto the drive to see them better. The larger one slowed down as I walked out but then kept going. The lights were definitely not planes as there were no blinking lights. I thought right away these were different. As the lights got across the sky to above the trees at beginning of property, I saw a commercial plane with blinking lights coming from the northeast. The two lights flew directly across the flight path of the plane. Not sure if you can check into what plane was in the vacinity at this time but they also must have seen the two lights. The lights then faded into the tree line across the property. I was very excited at what I had just seen but was disappointed I did not go into the house to get my binoculars for a better look. I was afraid I would miss the sighting. Please check to see what the commercial plane was at the time these objects flew by. This might also be on radar from Logan or TF Green."],"Latitude":"42.010316","Longitude":"-71.505534","Country":"United States","Object Flight Path":"Path with directional change","Region":"Rhode Island","Sighting Duration":"Undisclosed","Weather Factors":"None","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Features":"None","Date of the Event":"02/20/2010 05:15 UTC","files":["/var/www/straped/mufon/html2text/21958.html.txt","/var/www/straped/mufon/org/21958.html"],"Case Number":"21958","Date Submitted":"02/21/2010 05:56 UTC","Log Number":"US-02212010-0005"}