{"Object Features":"Unknown","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Tags":"City","Region":"Washington","Summary":"Witnessed a light, similar to a star (but with blue and red lights) move slowly south to west from our backyard over a 45 minute duration.","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Rainier","This sighting has never been favorited."],"Weather Factors":"Unknown","Latitude":"46.856879","Date of the Event":"02/20/2010 11:45 UTC","Source":"MUFON","Log Number":"US-02212010-0003","map":"<A HREF = \"http://maps.google.com/maps?q=46.856879,+-121.751652(21956)&iwloc=A&hl=en\"> mufon case (21956) map </A>","Disposition":"Insufficient Data","Longitude":"-121.751652","Case Number":"21956","Date Submitted":"02/21/2010 04:06 UTC","files":["/var/www/straped/mufon/html2text/21956.html.txt","/var/www/straped/mufon/org/21956.html"],"City":"Rainier","divs":["Sighting DetailsMy wife and I went on our back porch to smoke before turning in for the night. To the south of our house, we witnessed what appeared to be an exceptionally bright star with flashes of red and blue light. The object remained stationary for approximately five minutes and then began a series of movements to the right, left, and towards us. Over the next thirty minutes it moved, in relation to the treeline and our location, closer and to the west eventually passing out of sight. When this object moved it was clearly noticable, making rapid movements to the west or east and then stopping in place (the treeline made an excellent baseline for observations). Over the course of the event, a meteorite and a plane passed between us and the object giving us a rapid and slow comparison. I have never seen a plane that could manuever in this manner and I am familiar with helicopters and their movements. This was not a conventional plane or helicopter. I have never seen an object that moved in this manner. We were unable to film the object because we do not have a video camera and our digital cameras lack decent zoom."]}