{"Source":"MUFON","Object Features":"Appendage(s)","divs":["Sighting DetailsThe sighting occurred on a side street in an industrial neighborhood, a few blocks from the intersection of Capital and Palmer in Milwaukee, WI. A friend was in a meeting with a local community organization and I decided to stay in the car to make some work related phone calls. I had just finished up with the phone calls when I decided to step out of the car for a cigarette. I leaned up against the driver-side door of the car facing the South as I smoked. I noticed movement some movement to my right, and looked in that direction. An object anywhere from 4 to 5.5 feet long oriented perpendicular to the ground like so: | was floating about 15 feet off the ground. The object was moving from the West to the East at about 6 - 8 miles per hour with a very shallow guide slope, about 1 degree. At first I thought that the object might be a kite cut loose from its string with how smoothly and quietly it was gliding along, until it passed underneath some power lines and a few feet later it ascended vertically by about 5 feet to clear the top of a building that it was headed for. It then moved parallel to the top of the building for about 300 feet until my view of the object became obstructed by another taller building to my left. The object was an imperfect cylindrical shape with a few small protrusions here and there. When I realized that the object was not a wayward kite, I thought about reports of flying humanoids. However, the protrusions didn't seem to fit with what was described in those accounts - additionally there was a brief metallic flash as light from a lamppost reflected off of the object - this does not seem to fit with the description of flying humanoids either. Other than the brief metallic flash the object was entirely black. The closest the object's path took it to me was about 120 feet and I was able to observe the object for about 2 minutes, so I had ample opportunity to try to identify the object and for the life of me I cannot think of anything that this object could have been. Even after going home and doing a Google image search for UAVs nothing I have ever seen can match up with the description of this object. My reaction to this object was initially one of pure curiosity until after I had dropped my friend off at his place, then I became extremely nervous and scared."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.042992,+-87.900474(21961)&iwloc=A&hl=en\"> mufon case (21961) map </A>","Case Number":"21961","Object Shape":"Other","Viewing Distance":"101-500 Feet","Log Number":"US-02212010-0008","Longitude":"-87.900474","Country":"United States","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/21961.html.txt","/var/www/straped/mufon/org/21961.html"],"Tags":"City","City":"Milwaukee","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around February 2nd 2010"],"Date Submitted":"02/21/2010 12:03 UTC","Summary":"Humanoid shaped object moving at a slow speed, low altitude, no sound.","Latitude":"43.042992","Disposition":"Unknown","Region":"Wisconsin","Sighting Duration":"00:02:00","Weather Factors":"Unknown","Date of the Event":"02/02/2010 06:23 UTC"}