{"Summary":"pre dawn objects split a meteor","trends":["There have been 3 other sightings in Yelm","There were no other sightings in Yelm on or around February 21st 2010"],"Object Flight Path":"Straight-line path","Latitude":"46.942043","Region":"Washington","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/21/2010 09:58 UTC","Disposition":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI awoke @ 5:36 to a light in my window facing north pre dawn. I was glad as I was hoping to see a meteor this morning I grabbed my binoculars, which I keep by the door and I went outside and I was looking at the dipper facing south looking almost straight up with binoculars pre dawn. I am an avid photographer, Prior Military and in The Civil Air Patrol I am a trained observer in Search and Rescue. I can't describe this as anthing I have seen before moving faster than a jet and of the glide path into Seattle and well I don't know. I lit a cigarette. A Sphere shaped object became visible in the western sky moving from from west to east it took about 4 minutes to move across the sky during this time in its wake its path was almost if not exactly duplicated by a bell shaped object it seemed to be chasing at a distance during this time there was a meteor that fell right in between them. I Lit another cigarette, I went back in to chek the time and it was 6:06am There flight pattern reminded me of an A-10 on attack run dropping flares well the flares were as bright as the objects and the objects were indeed low in the sky but they were flying it seemed straight 46.831431 -122.547512 elevation about 472 feet. The things that struck me as odd was the fact that was no nature sounds frogs stopped the owls stopped the roosters stopped at all not even the frogs their illumination did not vary nor did it brighten the sky as a Low earth satellite's do e.g. iridium at sunset usually put on quite a show."],"City":"Yelm","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.942043,+-122.605958(21960)&iwloc=A&hl=en\"> mufon case (21960) map </A>","Log Number":"US-02212010-0007","files":["/var/www/straped/mufon/html2text/21960.html.txt","/var/www/straped/mufon/org/21960.html"],"Longitude":"-122.605958","Case Number":"21960","Weather Factors":"Unknown","Object Shape":"Circle, Sphere, Other","Date of the Event":"02/21/2010 05:53 UTC","Object Features":"Other"}