{"Case Number":"21962","Tags":"City","divs":["Sighting DetailsI was jogging on the Pinellas Trail heading towards clearwater beach. It was 1:47pm. It was maybe 70 degrees and almost completely clear sky. As I was jogging I notice this enormous object directly ahead of me. I finally realize it's a giant whitish looking color triangle. Im no pilot but im guessing to altitude to be 5000 ft maybe..give or take. Very low. There's 3 giant lights on the bottom. 2 red and one white. The first red one lit up so bright and then dimmed, then the 2nd red light lit up and dimmed, then the white. It repeated that cycle about every 20 seconds or so i think. 2 other UFO's were behind it. They were brighter than stars by far. They were just solid white. Another solid white light was in front of the triangle. As I stood there watching this a second triangle with the red and white lights became visible and disappeared within a flash. It did this 2 or 3 times. The triangle hovered silently for approx. 5 minutes then began to gain altitude. The top of it seemed to be moving or shifting or something. It was strange. Im not sure how to describe it. The lights remained still and covered most of the bottom of the craft. But the top was odd. I watched the triangle for 12 minutes. Even when it was extremely high altitude you could still see the lights flashing in sequence.It eventually got so high up I decided to get back to my run. I woulda stayed for ever, it was awesome. Talk about the time not to have a video camera..would of ended the debate for good. Personally Im leaning towards this being military craft, given the number of bases around this area. Macdill also has some rumors of secret craft and thats approx 20 mins away. But why fly that thing, that low on a clear blue sky over clearwater beach area at the warmest part of the afternoon when the beach is packed with people laying on their backs looking up???????????? I jog that trail alot and will continue to look up.."],"Region":"Florida","Latitude":"27.975423","Disposition":"Insufficient Data","Object Features":"Undisclosed","Date Submitted":"02/21/2010 02:37 UTC","files":["/var/www/straped/mufon/html2text/21962.html.txt","/var/www/straped/mufon/org/21962.html"],"Viewing Distance":"Over One Mile","Date of the Event":"02/20/2010 01:47 UTC","Weather Factors":"None","Country":"United States","Longitude":"-82.794113","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Object Shape":"Triangle","City":"Clearwater","trends":["There have been 31 other sightings in Clearwater","There was one other sighting in Clearwater on or around February 20th 2010"],"Summary":"5 UFOs. One close...big whitish triangle.","map":"<A HREF = \"http://maps.google.com/maps?q=27.975423,+-82.794113(21962)&iwloc=A&hl=en\"> mufon case (21962) map </A>","Log Number":"US-02212010-0009","Source":"MUFON"}