{"Source":"MUFON","Disposition":"IFO","Region":"Florida","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around February 18th 2010"],"City":"Clearwater","divs":["Sighting DetailsHas anyone reported a sighting yesterday, Feb. 18th at 2:00pm?? I was in Clearwater (Coachman Carwash off 19N). I was waiting along with others outside for our cars to be done. We stood outside the storefront. The sky was very blue (except for the white streaks - chemtrails?) I always look up. I noticed an object that came in over the area...looked almost white against the blue sky. Then it just stopped and stayed in one spot for a minute or 2. When I saw this I asked the couple next to me \"what is that?? pointing up at it. The man had regular reading glasses on and had to struggle to see it. But I had on my sunglasses (polarized) and so did his wife. We both stared at it and even she said \"I don't know what that is.\" Then it moved towards the north, and stopped abruptly again. It was a weird shape. Not quite round...definetley NOT a plane or copter either. We watched it move again closer to our location and stop on a dime again. We were all watching it. This object, against my thumb at arms length, was about the size of a pencil eraser. But the shape was strange. Also it finally took off to the north again, and the sun reflected off it momentarily and it gleemed, only for a second...Then I knew it was metal. It shot away and went behind one of those \"streak\" lines in the sky, and we didn't see it after that. Sorry did not have a camera!"],"Log Number":"US-02222010-0007","Date of the Event":"02/18/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.973183,+-82.797233(21976)&iwloc=A&hl=en\"> mufon case (21976) map </A>","Case Number":"21976","Country":"United States","Object Features":"None","Object Shape":"Oval, Square, Rectagular","Longitude":"-82.797233","Date Submitted":"02/22/2010 10:43 UTC","Summary":"Object staying still in sky","files":["/var/www/straped/mufon/html2text/21976.html.txt","/var/www/straped/mufon/org/21976.html"],"Weather Factors":"Windy","Latitude":"27.973183","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Tags":"City"}