{"Date of the Event":"02/20/2010 09:00 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/21978.html.txt","/var/www/straped/mufon/org/21978.html"],"Longitude":"-95.989558","City":"Omaha","Latitude":"41.258003","trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around February 20th 2010","This sighting has never been favorited.",""],"Case Number":"21978","Log Number":"US-02222010-0008","Summary":"9 lights in a row that were 'staggered'","Sighting Duration":"00:01:00","Date Submitted":"02/22/2010 02:35 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy husband and I went out to smoke a cigarette and I looked up in the sky and saw a bunch of oragish-red lights in a row in the sky. At first, I thought 'oh my god, are we under attack?' but then realized it was something 'different'. I yelled at my husband to look at them and then I went down my from porch steps because I realized there were more of these lights behind a big evergreen tree (it was blocking my vision of the sky. My husband and I counted 9 of these lights. I yelled at him to get the video camera and within a few more seconds they were just 'gone'.(like it slowly dissappeared) I called 911 and reported strange lights in the sky and they said they would call SAC and the Air controller to see if they know of anything. I then decided to call KETV channel 7 (this is approximately at 9:30pm)and report it to them. When the main switchboard operator answered he said that 'many people have called in about this' and he asked me if I lived around 90th and Fort and Blondo area. I said 'yes'. He asked me to describe what I saw. I told him and he said that this is what all of the other callers were describing. He then said that some of the caller's were actually pulling their cars over and looking at them while they called the news station. He then said that they had sent out a reporter to try to get a video or pictures of what we were all seeing and he took my name and phone number down. I stayed up to watch all of the local news stations ( I was flipping back and forth between the2 because the Olympic's was on the other) and they didn't mention anything about people calling the station or seeing these 'strange lights'. I went and got a Sun morning paper right away the next morning because I was sure there would be a little 'snipit' of this event in the Midlands' section-but no such luck. Basically, I haven't seen or heard anything re: what these lights were. I KNOW that they weren't 9 planes flying in a row because they were too close to each other and almost 'evenly space'. There was no noise to them, either, and no blinking lights. If this was our military, it's pretty amazing that they had 9 planes flying that close together with no noise--and there may have been more of these lights that I couldn't see because it was cloudy that night and a few could have been behind clouds. I would really just like to know what it was I saw because it has forever changed my life."],"Region":"Nebraska","map":"<A HREF = \"http://maps.google.com/maps?q=41.258003,+-95.989558(21978)&iwloc=A&hl=en\"> mufon case (21978) map </A>","Tags":"City","Country":"United States","Object Shape":"Other","Source":"MUFON"}