{"Object Shape":"Triangle","City":"Sarasota","Date Submitted":"02/22/2010 12:13 UTC","Latitude":"27.387678","Disposition":"Insufficient Data","Region":"Florida","Sighting Duration":"Undisclosed","Case Number":"21970","Source":"MUFON","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/21970.html.txt","/var/www/straped/mufon/org/21970.html"],"Country":"United States","Weather Factors":"None","divs":["Sighting Detailsattention Morgan Beall We were driving home to LBK longboat key FL on 53 ave headin west we all saw the lights from 34th st and 53 av back then was all cow pasture at the corner (the road went west and then went 90 deg turn to north and connectetd to Cortez rd at about 75th street or so). From 34th it looked like some big lights very low at corner(looked like the interstate lights)we thoght perhaps they installed some lighting as they have had numerous accidents at corner. but as we got closer we could see it was an arrowhead shaped vehicle about 1000 ft up maybe lower. it had 3-5 very large lights that formed a shape of a V at the front(i assume front) as we got right up on it we were stunned! it was amazing at the bottom a light would flash and i could see the bottom and it wasnt like any airplane it was kinda boxy with texture not sleek and smooth, no FAA lights and it NEVER MOVED(from what we could tell) We were a little to the south of it but we were very close(probably throw a rock and hit it). We rolled the windows down and was drivin at about 10 mph no one else on road at the time thats what was freaky there was NO SOUND ad i mean no sound not a whir clink nuthin. I have heard and seen planes gliders hot air ballons helicopters blimps and they all made some noise and they were all farther away than this object. We were freakin at this time we were sayin to each other \"are we all seein this are you seein this!!?!?\" we were scared as we were in cow pasture( cow mutilations) so we wernt about to stop. We drove the entire length of that area until it was out of sight(shortly after turning onto Cortez) and it never moved. we thought we would just go home and see it on the news and it would be open for discussion. never saw a thing about it. It wasnt until i saw a show on disc channel( a few years ago) that had a report of these police in like 5 counties and what they described was nearly identical to our expeirence. I am clear it was nothing convetional. I assumed it was military as we are just south of Mcdill AFB and the Stratigic Air Command SAC. I dont have ay video or pics but i could probaly draw a sketch but i have recently leared of a military TR3-B and it does look a lot like that. Regardless I have seen many unexplained lights in the sky and what not but this was the real deal it was low and clearly visible and CLOSE. It was wtinesed by me, my wife, my step daughter , and her fiance'. The first three are here and willing to share their expierence, and without to much effort the fourth would probably do the same. I will never forget it I doubt he will either. We aint no yuppies or fine upstanding citizens but this we saw without a doubt, no lie, no hallucination! I would love to contribute anything you thought would be helpful as we wanted to the next day but we didnt know were to go or who to tell. It is real and i belive is leading up to some very important events. I look foward to talkin to you and right now my step daughter is staying with us so we 3 are available. the fourth party we havent been in touch with for years.please feel free to contact me Carl E Zahrndt, Jr"],"Tags":"City","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around November 30th 1988"],"Log Number":"US-02222010-0001","Date of the Event":"11/30/1988 12:00 UTC","Summary":"attention Morgan Beall 4 people witnessed an arrowhead shaped object low altitude no sound","Longitude":"-82.553464","map":"<A HREF = \"http://maps.google.com/maps?q=27.387678,+-82.553464(21970)&iwloc=A&hl=en\"> mufon case (21970) map </A>","Object Features":"Patterned Surface, Appendage(s)"}