{"Latitude":"28.542996","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Longitude":"-81.372236","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date Submitted":"02/23/2010 01:30 UTC","Country":"United States","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around February 18th 2010"],"Region":"Florida","Log Number":"US-02232010-0003","Disposition":"Hoax","Summary":"Saw large, black, boomerang shaped object with blinking lights in night sky.","map":"<A HREF = \"http://maps.google.com/maps?q=28.542996,+-81.372236(21987)&iwloc=A&hl=en\"> mufon case (21987) map </A>","Tags":"City","Object Shape":"Boomerang","Weather Factors":"None","Source":"MUFON","divs":["Sighting DetailsWhile traveling from the Atlanta, GA to the Ft. Lauderdale area, on the evening of Thursday, Feb. 18th at around 9:15 p.m., I was driving south on Florida's Tpke. when I noticed some a light in the sky, off to my left, which caught and held my attention. I immediately asked myself, \"What is that?\" The light I saw was standing still, way up in the air. I thought that it might be on a tower...but it'd have to be 200 feet up in the sky, and that didn't make sense. So I kept glancing at it as I drove on, trying to figure out what I was seeing. I managed to see some light reflected off the object, and I made out that this huge flying object was just hovering in the sky, and the light on it was constant...it was not blinking. I could not stop anywhere along the road...it was pitch black and it would not have been safe. So I continued for a few more minutes, constantly checking the object...and I saw what appeared to be a black, very large, boomerang shaped aircraft, with a light, and not moving...just hovering in the sky. Unfortunately, when I could finally stop, it was at a very well lighted service area, which prevented me from really getting a good look at the the object. At that point, it seemed to slowly move off, but I was not able to make out the entire shape of the craft. As I got back on the road, I noticed that there were lots of planes in the sky, also off to my left, as I was near an airport, around Orlando, FL. However, as I studied the planes and their lights, it was very clear to me that the light on the object that I saw was not at all like the lights on the planes I was now seeing. That led me to believe that my eyes were not playing tricks on me. I had actually seen a huge, unidentified flying object in the sky. I just wish I could have parked sooner and gotten a good look...and perhaps a snapshot."],"Object Features":"Unknown","City":"Orlando","files":["/var/www/straped/mufon/html2text/21987.html.txt","/var/www/straped/mufon/org/21987.html"],"Case Number":"21987","Date of the Event":"02/18/2010 09:15 UTC"}