{"Log Number":"US-02232010-0002","Object Shape":"Disc, Other","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.584775,+-97.360497(21986)&iwloc=A&hl=en\"> mufon case (21986) map </A>","City":"Crowley","Longitude":"-97.360497","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Latitude":"32.584775","Disposition":"Unknown","divs":["Sighting DetailsI was coming down 1187 from Crowley toward Benbrook and I saw 3 different sets of lights flying low to the ground, even hovering off to my left. I kept watching and they would go together and become more disc appearing and separate and swirl around and flash different colors of lights and it continued for probably about 5 minutes or less and they flew off toward the west, and before long they came back toward me and soon after I saw several jets flying after them until I lost sight of them. They were so cool to see, nothing like I've ever seen before flying around in the sky. I was excited, I just pulled over on the side of the road so I could watch them as long as I could. I was happy to hear several reports the next day of other people in the area also seeing them. I didn't know this network exists until tonight, so I didn't know who to report to that I had also seen them."],"Sighting Duration":"Undisclosed","Weather Factors":"None","Tags":"City","Date of the Event":"01/14/2008 07:00 UTC","Region":"Texas","Date Submitted":"02/23/2010 12:54 UTC","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/21986.html.txt","/var/www/straped/mufon/org/21986.html"],"Source":"MUFON","Case Number":"21986","trends":["There have been 3 other sightings in Crowley","There was one other sighting in Crowley on or around January 14th 2008"],"Summary":"3 separate entities that would change shape and go together as one, long and straight-looking then disc-like changing colors, fast and slow-moving, dancing low."}