{"Object Shape":"Circle, Oval, Sphere","City":"Tualatin","Object Features":"Unknown","Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"02/22/2010 09:40 UTC","Disposition":"Unknown","Longitude":"-122.762245","Country":"United States","Object Flight Path":"Path with directional change","Latitude":"45.391948","divs":["Sighting DetailsOn the way home, I was driving with my girlfriend and we were coming to a four-way stop at Martinazzi and Sagert. I saw a bright red light above the tree line in the direction we were going. As I came up to another four-way stop on Avery, we could clearly make out a large low-flying red light that was sort of pulsating. It was moving from our right to left, (from SW to NE). It was one very large red pulsing light, but there also seemed to be a smaller red light on its side, and was pulsing as well, but differently and very fast. There was no white lights, indicating it was a plane, and no blue lights either, just one very large red light, along with a smaller red light on its side. Then as my girlfriend and I were watching it, it made a sharp 45 degree turn and was coming towards us. It seemed very low and almost just above the tree line above some apartments that were to our left. The light made no noise at all, even planes very far away make a decent amount of noise, this thing was silent. We took a right almost right after the four way stop on Avery and wanted to be able to stop and see this thing better. As we pulled over to stop, when we looked back to see the light, there was nothing. As soon as we noticed that the light was gone, right above us were two large low-flying helicopters, (with white, blue, and red lights) they were coming at each other and looked like they were going to hit each other. They flew right next to one another, and took off in opposite directions, almost in search of something. These we could hear and we could also make out the shape of them. The other thing we didnt hear anything from it, neither could we make out a distinct shape, it only seemed maybe like an oval or sphere."],"Date Submitted":"02/23/2010 02:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.391948,+-122.762245(21988)&iwloc=A&hl=en\"> mufon case (21988) map </A>","Case Number":"21988","trends":["There have been 4 other sightings in Tualatin","There were no other sightings in Tualatin on or around February 22nd 2010"],"Region":"Oregon","Weather Factors":"Unknown","Summary":"Low flying large red pulsing spherical light","Source":"MUFON","files":["/var/www/straped/mufon/html2text/21988.html.txt","/var/www/straped/mufon/org/21988.html"],"Log Number":"US-02232010-0004","Sighting Duration":"Undisclosed"}