{"Longitude":"-1.61178","Tags":"City","Log Number":"GB-02222010-0011","Object Flight Path":"Hovering then path","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/21982.html.txt","/var/www/straped/mufon/org/21982.html"],"trends":["There have been 13 other sightings in Newcastle Upon Tyne","There were no other sightings in Newcastle Upon Tyne on or around February 22nd 2010"],"Date of the Event":"02/22/2010 12:00 UTC","Object Shape":"Disc, Oval","Source":"MUFON","Case Number":"21982","Weather Factors":"Unknown","Summary":"Bright whote lights moving slowl y left, large object close shape was like typical UFO shape (oval) however definite shape cannot be given as light were bright","Disposition":"Unresolved","Date Submitted":"02/22/2010 04:26 UTC","City":"Newcastle Upon Tyne","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Latitude":"54.982822","divs":["Sighting Detailsme and my boyfriend were out walking the dog and going towards our local fish and chip shop. we had just arrived back from a weekend away and were talking about going away again when my boyfriend turned and said 'look at them lucky they must be going somewhere nice referring to a plane that was coming towards us. when we both looked the object wasn't coming towards us but was hovering. my boyfriend at this point said thats not a plane. all i can describe is bright white lights and an irregular shape to that of a plane. although my sight is not ideal my boyfriend has perfect sight but we could both tell that it was more like an oval shape. However the light were bright and seemed to sim the eact shape. it was quite close however there was no sound. When it started moving slowly to the left and stopped there hovering. it was definitely not a helicopter as we see quite a few of them locally chasing motorbikes on a local wood area. i was shouting at my boyfriend to get his phone out so we could take a photo as we were jogging towards it it faded out staying exactly the same size so it was not disapearing moving away but in itself as going transparent. it then formed itself as solid, hovering all the time and faded again this time not coming back. there was no lights or zoom it just disapeared leaving us gobsmacked at seeing this but also how close we were to this."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=54.982822,+-1.61178(21982)&iwloc=A&hl=en\"> mufon case (21982) map </A>","Region":"England"}