{"divs":["Sighting DetailsOn February 16, 2010 at or about 3:08 PM. I was driving south on N. Meridian rd, north of Grand Rives Ave, near Okemos, MI. Weather was very cloudy, solid, dark storm type clouds, they did not appear to be moving. I was not looking at the sky but noticed large movement through the tops of approaching trees. I realized immediately what I was seeing was not normal and slowed the car to a crawl all most stop, as I am not one to look away from the road in front of me while driving. I saw a large oblong shape (cigar shape) at least the length of a football field or even longer. The height I can only guess was maybe 80 to 100 foot tall. It was maybe 1000 foot off the ground. I really do not know but did measure with my hand. It was darker then the clouds behind it. It was a matted flat charcoal black with very defined edges, it seemed like it was outlined in a darker black at the edges. If it were not for the darker edges, it almost would have been camouflaged to the clouds behind it, but the edges made the shape very defined and stand right out. The shape was moving southeast steady but much slower then an airplane. My brain tried to say that it was a HUGE black airplane, however there were no wings. If it were a plane I could see it clear enough I should have seen huge wings, but it was way way to big to be a plane, and moving to slow to be a plane. I watched it for about 10 seconds then it disappeared. About 6 seconds after that it reappeared for about 15 seconds again, still moving in the same direction. No lights, it just disappeared again. I thought maybe I should stop and just watch for a few minutes then decided to go slow and keep glancing for it in the direction it was headed, and I could get passed the trees and maybe see it totally unobstructed from trees. Although in no way did the trees prevent or alter what I was seeing, I just wanted complete view without any trees. I continued south on Meridian rd seeing nothing. I crossed Grand Rive Ave, continued on Meridian rd, when I came to the I-96 overpass on Meridian rd, (about 5 minutes after seeing the object) I decided to stop the car on top of the overpass and just look as long as no cars were on the road. I figured I would just look in the direction the craft was heading when I saw it, taking advantage of the height of the overpass and wide-open space and maybe see it again. I was not stopped but maybe 30 seconds and a lighting like almost blinding pulse type intensity flash of blue white clear light in the sky at about the same height as the object was flying. The flash was not lighting. It held a large oblong shape for the entire time it was visible, about 6 seconds. I would say the shape was the size of a large two-story house. It was directly over the highway towards Williamston. It seemed to have depth somehow in the center. I have to feel this was related, as that area would have been about where the object would have been if it continued on the same path of flight and speed, it was traveling just minutes earlier. I cannot think of anything else in the area that it could have been. It was not a normal thing to see, and it was above the highway, which goes on for miles in the same direction at the same elevation, it would not have been a reflection from traffic in the distance, it was too high. It reminded me of a huge doorway but it was like lightning. There were cars approaching so I moved on."],"trends":["There have been 9 other sightings in Meridian Charter Township","There were no other sightings in Meridian Charter Township on or around February 16th 2010"],"City":"Meridian Charter Township","Log Number":"US-02242010-0003","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/21999.html.txt","/var/www/straped/mufon/org/21999.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.728377,+-84.420944(21999)&iwloc=A&hl=en\"> mufon case (21999) map </A>","Date of the Event":"02/16/2010 03:08 UTC","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Features":"None","Region":"Michigan","Latitude":"42.728377","Tags":"City","Disposition":"IFO","Case Number":"21999","Viewing Distance":"Over One Mile","Source":"MUFON","Date Submitted":"02/24/2010 03:42 UTC","Summary":"Okemos, MI sighting.","Country":"United States","Longitude":"-84.420944","Object Flight Path":"Straight-line path"}