{"Source":"MUFON","Object Features":"Other","Region":"Oklahoma","Weather Factors":"Unknown","Date Submitted":"03/25/2003 08:15 UTC","City":"El Reno","map":"<A HREF = \"http://maps.google.com/maps?q=35.532274,+-97.955049(2199)&iwloc=A&hl=en\"> mufon case (2199) map </A>","Tags":"City","Object Shape":"Sphere","divs":["Sighting DetailsA friend was walking me out to my car as I was getting ready to leave. Wehappened to look up into the clear night sky and notice a plane heading towardsthe air port. We could identify the plane as a civialian model because of thebright white light in front, red lights on wings, and flashing light in back. This plane was moving from the west heading eastward. As we watched the planewe noticed what we thought to be a satellite moving northward. We then realizedit was too low in altitude and moving too fast to be one. It was glowing whiteand was an orb or sphere shape. This light was about the entire size of theplane. As we watched both the plane and the white glowing sphere, we noticedthat it looked as though both were at the same altitude. Both came close tomeeting each other and we thought that they were going to hit each other at onepoint. Upon approaching the plane, the orb zig zagged off to the east a littledistance and then remained heading north bound. They barely missed each other. Once they crossed paths, the orb started heading northeast as though to turnaround, but then started zig zagging back and forth from east to west in a sharpalmost 90 degree angel turns. Then it appeared to ascend and disappeared in theclear night sky. My friend and I were worried at first that plane and orb wouldhit each other. As the event went on however, we realized that the orb was acraft that we could not reconginize. Both of us were excited about thesighting. In my opionion, whatever was in the sky with the plane at that timewas under intelligent control and was not an air craft of any type that I amaware of."],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"03/25/2003 08:15 UTC","Latitude":"35.532274","Sighting Duration":"00:05:00","Log Number":"","Disposition":"Unknown","Case Number":"2199","files":["/var/www/straped/mufon/html2text/2199.html.txt","/var/www/straped/mufon/org/2199.html"],"trends":["There have been no other sightings in El Reno","This sighting has never been favorited."],"Summary":"UFO Crossing Flight Path","Object Flight Path":"Straight-line path","Longitude":"-97.955049"}