{"Region":"Tennessee","divs":["Sighting DetailsOak Ridge, TN: It was the evening before Thanksgiving, 25 Nov 2009. I went outside for some reason (taking out the trash?), looked over my home to the north and saw a bright star like object moving west to east. I thought it was a plane at first, but the intensity of the light never varied, and there were no blinking lights as on planes. I watched it for a minute, then noticed a smaller star like object following it. I didn't have the impression they they were lights on a single object, but rather two independent lights. In spite of the lack of blinking lights, I figured it to be airplanes approaching the Knoxville airport, but after reading three other very similar accounts on MUFON's site, the lights appear to have moved across East Tennessee. Maybe they were satellites, but I'm pretty sure they were planes. I went into the house to get my binoculars to see the objects better, went into the back yard on the north side of the house, but tree limbs blocked the view. I went back to the front yard, but the lights were out of sight. It seems to me they disappeared behind clouds, but I'm not 100% sure of that."],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.015546,+-84.262655(21992)&iwloc=A&hl=en\"> mufon case (21992) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/21992.html.txt","/var/www/straped/mufon/org/21992.html"],"Date of the Event":"11/25/2009 08:00 UTC","Weather Factors":"None","Object Flight Path":"Straight-line path","Sighting Duration":"00:02:00","trends":["There have been 7 other sightings in Oak Ridge","There were no other sightings in Oak Ridge on or around November 25th 2009"],"Summary":"Bright blue-white star trailed by dim blue-white star, moving W to E","City":"Oak Ridge","Longitude":"-84.262655","Log Number":"US-02232010-0008","Tags":"City","Date Submitted":"02/23/2010 03:00 UTC","Latitude":"36.015546","Object Shape":"Star-like","Case Number":"21992","Viewing Distance":"Over One Mile","Source":"MUFON","Disposition":"IFO"}