{"Date of the Event":"02/19/2010 07:35 UTC","Region":"New South Wales","Object Features":"None","Latitude":"-34.014106","Viewing Distance":"Unknown","divs":["Sighting DetailsMy buddy and I were on the sidelines photographing a rugby match south of Sydney. He called my attention to the object. It was about the brightness and colour of Saturn or Jupiter and 2-3x that apparent diameter. Flight was from SW to NE on a straight course. He, a sceptic, pointed out that there were no navigation lights. It moved at the speed, I suppose, of a high flying aircraft. Therefore it was not all that startling. If it had made a sudden right angle turn and sped off at blinding speed I would be much more excited about the sighting. There were a couple of times during this flight when it appeared to waver like a balloon buffeted by a cross wind. However I am not sure I really saw that. (There were stadium lights on so viewing was not optimal). It did seem that it could have been some sort of a hoax. But, it appeared to be glowing with its own (rather than reflected) light. I could be wrong about this though - it wasn't long after sunset and something high enough and big enough could have produced a spectacular reflective effect. I could not estimate its altitude in those conditions however I did watch it on a transit of something like 120 degrees. It simply faded slowly from view out over the ocean in the oceanic haze. My buddy has great professional Canon gear and he shot a frame with the 400mm lens. It does not reveal anything though as it appears simply as a bright dot on a black field. Not sure of the transit time - it could have been one minute or two. I am aware of something called an Iridium flare but am not sure what that is. Could this be what we saw? Or the ISS?"],"Object Shape":"Saturn-like, Star-like","Log Number":"AU-02252010-0001","files":["/var/www/straped/mufon/html2text/22005.html.txt","/var/www/straped/mufon/org/22005.html"],"Country":"Australia","Disposition":"Unresolved","Case Number":"22005","Source":"MUFON","Date Submitted":"02/25/2010 01:40 UTC","Summary":"bright star like object in straight flight over rugby match","Tags":"City","Longitude":"151.108152","trends":["There have been no other sightings in Sylvania Waters","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Weather Factors":"None","City":"Sylvania Waters","map":"<A HREF = \"http://maps.google.com/maps?q=-34.014106,+151.108152(22005)&iwloc=A&hl=en\"> mufon case (22005) map </A>"}