{"City":"York","files":["/var/www/straped/mufon/html2text/22004.html.txt","/var/www/straped/mufon/org/22004.html"],"Summary":"2 very bright greenish lights","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.95125,+-76.733652(22004)&iwloc=A&hl=en\"> mufon case (22004) map </A>","Region":"Maryland","Weather Factors":"Rain","Case Number":"22004","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"01/15/2010 05:15 UTC","divs":["Sighting DetailsOn Monday January 15, 2010 at 5:15 am I was compelled to get up for the day. I usually get up for work at 6:00 and enjoy every bit of sleep I can get. As i walked past my window in my bathroom i notice a bight glow coming from the farm field across from my house. I though the woods were on fire. I quickly through some closes on grabbed my binoculars and ran outside to my driveway. It was raining so I quickly came to grips with the fact of fire in the woods was highly unlikely. I focused the binoculars on the tree line in the distance to see 2 very bright greenish lights. There are no houses or roads in this direction to be confused with. I really wanted to walk out into my yard and move closer but I got a sense of dread to move any further. I watched these lights for about 5 minutes. The lights seemed to be attached to something but I could not make it out. I went back in the house, showered got dressed and started my car in the garage. I opened the garage door and peeked out to see if they still were there, which they were. Got in the car and pulled my car on to the driveway. Once on the driveway I looked for the lights and they were gone."],"trends":["There have been no other sightings in York","This sighting has never been favorited."],"Object Flight Path":"Stationary","Tags":"City","Longitude":"-76.733652","Date Submitted":"02/24/2010 09:10 UTC","Log Number":"US-02242010-0008","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Latitude":"39.95125"}