{"Region":"Nebraska","Longitude":"-95.992288","trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around February 20th 2010"],"Object Shape":"Sphere, Triangle","Date Submitted":"02/24/2010 05:43 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.256363,+-95.992288(22001)&iwloc=A&hl=en\"> mufon case (22001) map </A>","Log Number":"US-02242010-0005","Tags":"City","Date of the Event":"02/20/2010 09:15 UTC","files":["/var/www/straped/mufon/html2text/22001.html.txt","/var/www/straped/mufon/org/22001.html"],"Latitude":"41.256363","Disposition":"IFO","Country":"United States","divs":["Sighting Details Saturday night 20 feb I went onto my front porch for a smoke and noticed a cluster of lights just west in the sky over Hobby Lobby. I thought it was an awful lot of helicopters in one group. Then I noticed the lights weren't on machines and the color was gold. At the same time I turned my head a little north and saw a kind of lanternshape pale reddish in color on the inside and goldish skin like a balloon.I thought: How do they keep candles burning inside a balloon? the effect was exactly like candlelight. It was beautiful. And I realized that something was happening and there were so many of them and I thought: Jeff has to see this. So I opened the door and yelled \"come out now!\" He was laying on the living room floor. I closed the door and kept watching. Jeff came out and I said Look and he screamed. Then we started to laugh and he said\"Are we being invaded?\" We watched and laughed. There were just so many it was absurd. Some of them bounced and we saw two come together and separate in opposite directions. Jeff went in and grabbed the binoculars we keep by the door. When the reddish glowing one moved further on it looked like the others which were glowing gold in other words as they got further away and the details weren't clear they just looked like spheres of light.Then Jeff was on the walk which goes from our front porch and here comes another from the north and it was still the reddish with the gold envelope around it and he checked it out with the binoculars. He said there was atriangle inside with yellow red and green like a rainbow grading into each color outlined in a bright blue light. He freaked out then and started running down the driveway where he slipped and fell but then he was back up and running down the street. Meanwhile the lights were heading sw and as they got further away they appeared like gold from a sparkler but without the flashing got smaller and smaller and the I couldn't see them anymore. One went straight up into the clouds and went transparent when it touched the cloud. We weren't afraid. JEFF IS MY HUSBAND.WE DON'T DRINK OR TAKE DRUGS WE WERE WATCHING TV BEFORE I WENT OUTSIDE"],"Object Features":"Undisclosed","Case Number":"22001","Summary":"at least 2 dozen glowing objects came across the sky west of my house traveling without sound from the north to the sw","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Omaha","Source":"MUFON"}