{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/22006.html.txt","/var/www/straped/mufon/org/22006.html"],"Latitude":"40.46205","Longitude":"-74.338204","Date of the Event":"03/31/1985 07:00 UTC","Country":"United States","Summary":"craft gliding slowly until coming to complete stop, then ascended very swiftly","Case Number":"22006","Sighting Duration":"00:02:00","Region":"New Jersey","Object Flight Path":"Path then hovering","Tags":"City","Date Submitted":"02/25/2010 02:21 UTC","divs":["Sighting DetailsI relaize I am reporting an event that occured about 25 years ago but I am now comfortable reporting it to competent persons working in this investigative field. I have difficulty believing that I actually witnessed this event and I have not heard of any other reports describing exactly what I had seen. I recall this occurred in early spring during mid-evening hours as the sun was almost fully set. I was living in my mother's home at that time. I was sitting outside in the open carport. I first noticed a bright light shining through the tree in the front yard. I assumed it was probably some conventional aircraft with a spotlight. As the light emerged from behind the tree I saw an aircraft the likes I never had seen before. The main body of the craft was shaped like a five-pointed star. The light I first saw seemed to eminate from the star casting a very bright white or pale yellow light. On the lower right point was a sphere. Initially the sphere swirled with a rainbow of colors. The craft seemed to drift slowly and was probably not more than about 1000 feet above the rooftops. As the craft reached a position directly across from me over the rooftop of the house across the street it stopped abruptly. The sphere then began to glow a deep red color. The craft then took off at an incredible speed at about a 45 degree angle still travelling on its northerly direction. The craft eventually reached an altitude at which it was no longer visible. Through the entire event there was no sound coming from the craft. As I said before, I have difficulty believing I saw this. I would doubt there are any witnesses as I was home alone and I did not notice any of the neighbors outdoors. During the sighting I was in awe of the craft and I couldn't take my eyes away. I have never heard any other reports describing exactly what I describe and it makes me wonder what this really was."],"City":"Sayreville","map":"<A HREF = \"http://maps.google.com/maps?q=40.46205,+-74.338204(22006)&iwloc=A&hl=en\"> mufon case (22006) map </A>","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Object Features":"None","Object Shape":"Sphere, Star-like","Log Number":"US-02252010-0002","trends":["There have been 2 other sightings in Sayreville","There were no other sightings in Sayreville on or around March 31st 1985"],"Weather Factors":"None"}