{"Object Shape":"Circle, Oval, Other","Tags":"City","City":"Anaheim","Object Flight Path":"Stationary","divs":["Sighting DetailsIts 1am in the moring and im driving down the street. I start noticing 3 unidify flying Oribe or ball, they dont look like their moving. i stop at the red light of the street what made me notic the flying object was its color, the ball didnt light up but the glow of its color. orange red looking oribe or ball, i start rolling the windo and stick my head out, and it looks low because everything in the sky was cloudy. also i started to keep going but i could'nt keep my eyes off the site, as i drive slowly i notice that im right under the 3 flyihg objects. when i notice that im actully driving under it i got scared and grave my phone and call 911!!!!!! I dont know why but i think i realy got scared because i wanted someone else to see the site. and plus it was right over our city hall building. Hoping that someone would see it , as im telling the operider that im seeing strange lights over or city hall, she thinks that im drunk. she takes down my information and we hang up., so much for try to make someone else to see. i keep driving along the same street maybe half a mile or less i loss site of it, they do not fly away but i just keep't going my way."],"Source":"MUFON","Sighting Duration":"00:05:00","Longitude":"-117.909904","files":["/var/www/straped/mufon/html2text/22000.html.txt","/var/www/straped/mufon/org/22000.html"],"Date Submitted":"02/24/2010 08:03 UTC","Viewing Distance":"Unknown","Log Number":"US-02242010-0004","Weather Factors":"Unknown","Region":"California","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around February 24th 2010"],"Country":"United States","Date of the Event":"02/24/2010 01:10 UTC","Latitude":"33.842153","Case Number":"22000","map":"<A HREF = \"http://maps.google.com/maps?q=33.842153,+-117.909904(22000)&iwloc=A&hl=en\"> mufon case (22000) map </A>","Disposition":"Unknown","Summary":"RED WITH ORANG AND UNDER IT WAS LIGHT.LIKE A HEAD LIGHT OF CAR","Object Features":"None"}