{"Object Flight Path":"Path with directional change","Log Number":"US-02252010-0010","Country":"United States","files":["/var/www/straped/mufon/html2text/22014.html.txt","/var/www/straped/mufon/org/22014.html"],"Date of the Event":"02/26/2010 09:03 UTC","Object Shape":"Saturn-like, Star-like","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Liberty","There were no other sightings in Liberty on or around February 26th 2010"],"Summary":"bluish light w/tail moving from stop position","Weather Factors":"Unknown","Latitude":"39.639585","Tags":"City","Disposition":"Unknown","Longitude":"-84.924821","Object Features":"Appendage(s)","Source":"MUFON","divs":["Sighting DetailsAt approximately 21:03 hrs. local, I was trying to pull into my driveway, but was blocked by an Indiana State Trooper helping a motorist. When said Trooper got out of his car and walked up to me, I explained I lived in the house he was blocking. He politely moved his car and as I was pulling in, notice through a large break in the clouds, a saturn or star like object in a stationary position. The object was a bluish and white color, very luminescent with a small tail of the same color. It then did a quick backup and shot forward, gaining momentum and wobbling. It also did a small zig zag, then came to another stop. This would not be inherent of a satellite as then it faded. I thought perhaps the clouds may have obscured the object, however, there were visible stars and planets near it. I then exited the vehicle to go into the house and felt it inappropriate to speak with the Trooper because he was busy. There was also another Trooper present, but I also felt it inappropriate to bother him, too. My background is in Earth and Space Science, hence, I am familiar with astronomical objects. This did not behave as a satellite, star, planet or ISS. Since living in Indiana, I have seen some pretty interesting stuff, but it was a little more exciting living on Long Island, where I had seen quite a bit of interesting things since the 1950's. My only reaction was that I thought it was pretty cool. My feelings after the sighting? Only that it is inconceivable that we humans are alone in the universe, so I just smiled to myself."],"Case Number":"22014","Date Submitted":"02/25/2010 10:37 UTC","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=39.639585,+-84.924821(22014)&iwloc=A&hl=en\"> mufon case (22014) map </A>","Viewing Distance":"Unknown","City":"Liberty"}