{"Latitude":"33.100492","Object Flight Path":"Path with directional change","Case Number":"22019","Date Submitted":"02/26/2010 04:19 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.100492,+-116.301327(22019)&iwloc=A&hl=en\"> mufon case (22019) map </A>","Country":"United States","divs":["Sighting DetailsOn November 29, 2009 my husband, my son and I were out in Anza Borrego Desert exploring. We were in Grapevine Canyon; we stopped at 1:30 pm to eat lunch. We were close to the end of the canyon in an old Indian village looking around. At approximately 1:54 pm we heard a military jet go by. We looked up and saw to the left of us a silver object. It moved across the sky from left to right slowly, then it broke apart into what looked like a larger triangle of three silver balls. It then moved slowly and went back to the smaller object which was a smaller triangle. My husband yelled \"UFO\" and I started taking pictures. What is weird with the three pictures I am sending to you is that in the third picture it does not take off and disappear...It disappears in place. The wires you see in the photos are telephone wires. Grapevine Canyon is a sandy trail located between the Volcan Mountains and Grapevine Hills into Anza-Borrego Desert State Park. Grapevine Canyon can be reached via a road that passes through private property off S22. Another access is from S22 through the Jasper Trail which is more towards the west end of the Grapevine Canyon."],"Longitude":"-116.301327","Tags":"City","Object Features":"Other","Date of the Event":"11/29/2009 01:58 UTC","Weather Factors":"Unknown","trends":["There have been no other sightings in Borrego Springs","This sighting has never been favorited."],"City":"Borrego Springs","Log Number":"US-02262010-0004","Object Shape":"Triangle","Region":"California","Summary":"UFO Grapevine Canyon","Sighting Duration":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/22019.html.txt","/var/www/straped/mufon/more/22019_submitter_file1__DSC_0056-1.jpg","/var/www/straped/mufon/more/22019_submitter_file2__DSC_0057-2.jpg","/var/www/straped/mufon/more/22019_submitter_file3__DSC_0059-4.jpg","/var/www/straped/mufon/org/22019.html"],"Viewing Distance":"Over One Mile","Source":"MUFON"}