{"City":"Toronto","Date Submitted":"02/26/2010 03:36 UTC","Summary":"Noticed (through my window) a formation of lights in the eastern sky and decided to pull out my tripod and dslr . . .","Date of the Event":"07/15/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.656996,+-79.378584(22017)&iwloc=A&hl=en\"> mufon case (22017) map </A>","Disposition":"Unresolved","Latitude":"43.656996","files":["/var/www/straped/mufon/html2text/22017.html.txt","/var/www/straped/mufon/more/22017_submitter_file1__70snap.jpg","/var/www/straped/mufon/more/22017_submitter_file2__68snap.jpg","/var/www/straped/mufon/more/22017_submitter_file3__6772snap.jpg","/var/www/straped/mufon/org/22017.html"],"trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around July 15th 2009","This sighting has never been favorited.",""],"Country":"Canada","Case Number":"22017","Source":"MUFON","Weather Factors":"Unknown","Region":"Ontario","Log Number":"CA-02262010-0002","Object Features":"Undisclosed","Tags":"City","divs":["sighting detailsone night last july (date\\time is wrong on my camera) i noticed a bright light in the eastern sky (probably 30 degrees or so off the eastern horizon). when i had a closer look, there were several points of light forming an arrowhead formation about 30-35 degrees off the eastern horizon (first picture). i've highlighted the slightly dimmer points of light to emphasize the formation. it was much more noticeable that night. i live right at bay and bloor, and normally see very few stars due to the city lights. when i looked at the formation through binoculars, i could only see blobs of light. after debating whether it was worth it, i finally decided to pull out my tripod and dslr to grab a few shots. when i downloaded the images, the thumbnails didn't look promising so i forgot about them until just recently. i have seven or so photos, most at fast shutter speeds, so they're quite grainy. i was focusing on the brightest point of light in the formation of lights, but it turns out the other point of light (to the bottom right corner of the closeup images) is more interesting. the last two pictures are of the same two points of light. upon inspection, it would appear that at least one of the light sources appears to be tumbling.the cloesups were shot through a 200 mm lens with 3 and 4 second exposures at f10 and f11. the pictures were all taken with a few minutes of each other. what is it ? bruce in toronto"],"Object Shape":"Unknown","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-79.378584"}