{"Sighting Duration":"Undisclosed","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around February 11th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","Country":"United States","Object Shape":"Circle","Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/22026.html.txt","/var/www/straped/mufon/more/22026_submitter_file1__22749_334510147418_715017418_5299616_4803777_n.jpg","/var/www/straped/mufon/org/22026.html"],"Log Number":"US-02272010-0003","Longitude":"-97.101526","Date of the Event":"02/11/2010 12:00 UTC","Case Number":"22026","City":"Arlington","Viewing Distance":"Unknown","Region":"Texas","Latitude":"32.741417","Date Submitted":"02/27/2010 07:10 UTC","Tags":"City","Source":"MUFON","divs":["sighting detailsi want to start out to explain this is not my photo, but a friend of mine that posted it on facebook. but i am a paranormal investigator. when she took the picture, she saw or heard nothing. she didn't know anything was even on the photo till she posted it and i saw it on there because she never really looked at it except in a thumbnail form. when i saw it i was floored. i have never seen a picture that clear of a real unidentified object caught on camera. the girl that took the photo was working part time at the stadium that night. the picture was either taken on 2\\11\\2010 or 2\\12\\2010. that was then north texas got that record breaking snow fall in 24hrs. ever. it was like 12 to 14 inches. i'm not sure of the event that they had their that night, but as you can see in the photo the parking lot had pretty much cleared out. i was hoping this photo could be further analyzed. i'm sure it was taken with your basic $100 digital camera."],"Summary":"Round disk shape over Cowboys Stadium in Arlington, Tx.","map":"<A HREF = \"http://maps.google.com/maps?q=32.741417,+-97.101526(22026)&iwloc=A&hl=en\"> mufon case (22026) map </A>"}