{"City":"Clinton","Region":"Mississippi","Latitude":"32.346124","divs":["Sighting Details A colorful ring of lights hovering over someones house, then it moved away making no sound over the trees... I was in Clinton Ms. standing outside a friends house in her driveway talking. We were in a residential neighborhood.It was dark out. About 8:00pm. There were houses accross the street from us. Very close. While chatting with my friend i looked accross the street. And i glanced up, up above a house accross the street. There were tall trees directly behind this house. And what i saw was a ring of lights in a circle. It was very large, bigger than a couple houses put together. The lights were different colors, they were very bright alsmost glowing. They were in a horizontal plane above this house, just sitting there. And i said what the heck is that, well putting it nicely. My friend said i dont know. I said thats not normally there, and she said no. And i said its not making any sound. It was close enough we should have heard some sort of noise . I mean it was directly accross the street from us. I said well it cant be a balloon becuase a balloon would have fire, and would not be out at night anyway. Then all of the sudden it started moving. It was almost directly over the house accross the street from us, and directly above the trees. It started moving away from us. There was no sound. It was so strange. Anything that big, should have made noises, and that close. It did not move up it went sideways , horzontally. Away from us. Almost as if it knew we were looking at it. Before it moved it was just sitting there above the trees, then it just started moving , away from us. So i said lets get in the car and chase it , and get another look, but by the time we went around the block , it was gone. I thought about calling the police, but said noone would believe us. So ive only told a few people about this, and most people say they believe me. Scince this happened to me, im always watching the skys. Hoping to see something again. I feel very lucky to have seen this thing, just wish i had a camera, but its forever etched in my mind."],"Log Number":"US-02282010-0004","trends":["There have been 6 other sightings in Clinton","There were no other sightings in Clinton on or around August 2nd 1988"],"Object Shape":"Disc","Source":"MUFON","Date of the Event":"08/02/1988 12:00 UTC","files":["/var/www/straped/mufon/html2text/22033.html.txt","/var/www/straped/mufon/org/22033.html"],"Summary":"A ring of colorful lights in a circle or disc shape.","Disposition":"Unknown","Object Flight Path":"Hovering then path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.346124,+-90.313398(22033)&iwloc=A&hl=en\"> mufon case (22033) map </A>","Case Number":"22033","Viewing Distance":"101-500 Feet","Country":"United States","Longitude":"-90.313398","Sighting Duration":"Undisclosed","Weather Factors":"None","Date Submitted":"02/28/2010 12:35 UTC","Object Features":"None"}