{"Weather Factors":"None","Object Flight Path":"Path with directional change,Other,Unknown","Date of the Event":"02/28/2010 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.430042,+-98.492448(22032)&iwloc=A&hl=en\"> mufon case (22032) map </A>","Longitude":"-98.492448","Object Shape":"Flash, Sphere, Star-like","Case Number":"22032","Log Number":"US-02282010-0003","Date Submitted":"02/28/2010 10:14 UTC","Disposition":"Unknown","Sighting Duration":"00:05:00","divs":["Sighting DetailsTHE OBJECT LOOKED LIKE A NORMAL FLICKERING SPHERE OF LIGHT SEEN AT ABOUT 1215AM ON THE 28TH OF FEB 2010 UNTIL ABOUT 1;30 WHEN CLOUDS OBSTRUCTED FURTHER VIEWING, BUT IT SEEMED TO BE FLICKERING IN A MANNER THAT IT WAS GOING THRU SOME TYPE OF COMMUNICATION SEQUENCE. I TOOK VIDEO USING A BLACKBERRY CURVE SMARTPHONE WITH 5X ZOOM...IT CAN BE SEEN PRETTY CLEARLY IN THE VIDEO. I USED CARSON BINOCULARS 80X ZOOM TO GET A BETTER LOOK AND NOTICED THAT THE OBJECT APPEARED TO BE MOVING FROM SIDE TO SIDE, UP AND DOWN, SIDEWAYS BUT WITHIN A VERY SMALL FIELD OF VIEW IN MY BINOCULARS, SO WITH THE NAKED EYE IT LOOKED STATIONARY. OCCASIONALLY CHANGING COLORS AND SHAPES (CIRCULAR TO BOOMERANG AND BACK TO CIRCULAR, BUT OCCASIONALLY A LINE OF SMALLER ORBS OR SOMETHING) WHILE DIMMING, GLOWING AND THEN BRIGHTLY LIGHTING THERE APPEARED TO BE ANOTHER IDENTICAL OBJECT DUE WEST OF SAN ANTONIO AND IT APPEARED TO BE MOVING WEST AWAY FROM SAN ANTONIO AND SINKING LOWER AND LOWER ON THE HORIZON. 5 MINUTE VIDEO AVAILABLE UPON REQUEST"],"Object Features":"Unknown","Latitude":"29.430042","Region":"Texas","Source":"MUFON","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around February 28th 2010"],"Tags":"City","Summary":"FLICKERING INTENSE WHITISH BLUEISH REDISH SPHERE THAT MOVED VERY FAST BUT WITHIN A CONFINED SPACE, LIKE A BALL BOUNCING AROUND IN A BOX, SW SKY TOWARD CARRIZO SPRINGS TEXAS","files":["/var/www/straped/mufon/html2text/22032.html.txt","/var/www/straped/mufon/org/22032.html"],"City":"San Antonio","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States"}