{"Date Submitted":"02/28/2010 01:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.388042,+-84.795777(22039)&iwloc=A&hl=en\"> mufon case (22039) map </A>","Object Shape":"Circle, Disc, Oval, Sphere","Source":"MUFON","divs":["Sighting Details Earlier this month in February, I was at Newnan High School softball field with my father filming my sister as she took batting practice. My intention was to make a short video that college softball coaches could view. I filmed many homeruns that day and as I was getting in the truck to leave, I decided to review the footage. As I was viewing one of my sister's homeruns I noticed something strange. I filmed the ball as it hit the bat, but I lost sight of it for a moment. Later I found out that this was because she hit a pop up. I moved the camera upward towards the sky and caught an object that I thought was the ball in my view. To my amazement the object took off towards the outfield extremely fast and at one point seemed to move horizontally over the light pole and over the tops of the trees across the road behind the ball field(The road is an extra 100 feet towards the trees). The object showed no signs that it was descending and flew at speeds that i've never seen an aircraft fly at. I reviewed what I had filmed later on that night at home on a bigger screen and I found that I could prove that the object was not a softball. (It goes without saying that neither my sister nor anyone else I know could hit a ball that far.)As I examined the video, I found that I had actually captured the ball on film falling to the ground in the outfield. At this point I was baffled. I ruled out any birds or airplanes due to the fact that they did not match the speed or the shape of the object. I eventually made the batting video and I also made a seperate video of the unidentified object. I used what tools I had on Windows Movie Maker to create a video with slow motion clips and also a sharpened picture. Interestingly enough the sharpened view seems to indicat the object gave off some type of gas or air or some other type of disturbance in the sky. I am not an expert so I am not ruling out that this could just be a side effect of the program. I do have a video and I will be including it in my report. I have not altered the film in any way except to provide a slow motion version and a sharpened view after the raw footage. I was using a hi 8 video camcorder. The footage was filmed on an 8 millimeter tape and converted to dvd using a sony video to dvd converter and ripped from DVD using \"SoftwareDepo DVD Ripper\". I think you will find this footage significantly interesting. My name is Joseph Craig Garmany. I am 19 years old and I might have witnessed a UFO. Thank you for your time. I hope to hear back from you."],"City":"Newnan","Summary":"Circular object flew over the softball field that I was on.","files":["/var/www/straped/mufon/html2text/22039.html.txt","/var/www/straped/mufon/org/22039.html"],"Object Flight Path":"Path with directional change","Object Features":"None","Longitude":"-84.795777","Viewing Distance":"Unknown","Case Number":"22039","Sighting Duration":"00:00:04","Latitude":"33.388042","trends":["There have been 4 other sightings in Newnan","There were no other sightings in Newnan on or around February 14th 2010","This sighting has never been favorited.",""],"Region":"Georgia","Tags":"City","Disposition":"Insufficient Data","Date of the Event":"02/14/2010 02:15 UTC","Weather Factors":"None","Log Number":"US-02282010-0010","Country":"United States"}