{"Object Flight Path":"Straight-line path","trends":["There have been no other sightings in calcutta , clarkson","This sighting has never been favorited."],"Date of the Event":"08/14/1974 12:00 UTC","Object Features":"Window(s)","Viewing Distance":"101-500 Feet","Longitude":"-80.573841","Source":"MUFON","Disposition":"Unknown","Summary":"daylight sighting , 2-300 ft from saucer riding on treetops ,believed to avoid detection","Case Number":"22031","divs":["Sighting DetailsTHE EVENT TOOK PLACE IN BEAVER CREEK STATE PARK GRETCHINS LOCKS AREA. IT WAS A DAYLIGHT SIGHTING AT EXTRMELY CLOSE RANGE + OR - 200 ' THE SAUCER MADE NO SOUND WHEN OBSEVED. WE OBSERVED SAUCER FOR APPROXIMATELY 30- 60 SECONDS. IT WAS DISC SHAPED WITH OPPOSING SAUCERS TOP AND BOTTOM WITH APPARENT PORTS? ARRANGED AROUND CIRCUMFERENCE IN CENTER LINE SEPERATING SAUCER SEGMENTS. COLOR WAS WHAT IS TODAY CALLED CHAMPAIGN ON AUTOS.A POLISHED TITANIUM COLOR.RARE FOR THE TIME PERIOD. THE LOCATION WAS IN AN AREA NO LONGER PUBLIC ACCESSABLE APPROXIMATELY ONE MILE BEHIND THE OLD MILL FACILITY DIRECTLY OVER THE CREEK IN THE VALLEY.THIS IS A REMOTE AREA ACCESSABLE AT THE TIME BY A ONE LANE DIRT ROAD,THE AREA HAD BEEN USED AS PUBLIC HUNTING AT THE TIME. WE WERE A GROUP OF HIGH SCHOOL FRIENDS WHO WENT THERE TO CAMP FOR THE WEEKEND.WE WERE ALL SEVENTEEN YEARS OLD PREPARING FOR OUR SENIOR YEAR IN HIGH SCHOOL. THERE WERE TWO OF US AT THE SITE AT THE TIME OF THE SIGTING.MYSELF AND ANOTHER MALE. WE HAD ALL GONE TO THE SITE WITH CAMPING GEAR THE THIRD MEMBER OF OUR GROUP LEFT TO GO TO A GIRL FRIENDS AND RETURNED AFTER DARK. WE WERE SETTING UP CAMP APPOXIMATELY BETWEEN THE HOURS OF 6:30 AND 7:30 PM WE HAD SELECTED A SITE WHICH WAS APPROXIMATELY 75' FROM THE CREEK IN A VALLEY WITH HILLS BEHIND US TO THE NORTH AND IN FRONT TO THE SOUTH.AS WE WERE SETTING UP A LOUD CRACK( WHICH WAS DISCOVERED TO BE TREE TOPS BREAKING)STARTLED US AND WE TURNED AND LOOKED BEHIND US AND UP.THE CRAFT CAME INTO VIEW SLIDING ON THE TREE TOPS BENDING THEM AS IT TRAVELED.IT EXITED THE TREES TO CROSS THE CREEK VALLEY TRAVELING AT VERY LOW SPEED AND TRAVELED DIRECTLY OVER OUR POSITION SLIGHTLY FOREWARD, WE WERE LOOKING S.E.DIRECTION.IT MADE NO SOUND.THE CRAFT WAS NO HIGHER THAN 200' FROM THE GROUND.IT WAS AN UN OBSTUCTED VIEW AS IT CROSSED THE CREEK VALLEY WHICH TOOK BETWEEN 30 AND 60 SECONDS, IT RE ENGAGED THE TREES ON THE HILL IN FRONT OF US AND DISAPPEARED FROM SIGHT. I TURNED AND SAID TO DON \"DID YOU SEE THAT?\" HIS REPLY WAS \"YEA BUT I'LL NEVER ADMIT IT!\".HE FINALLY DID, THIRTY YEARS LATER.BY THIS ADMISSION I DECIDED TO MAKE A FORMAL REPORT OF THE VERY CLOSE RANGE SIGHTING IN DAYLIGHT.IT WAS LITERALLY CLOSE ENOUGH TO HIT WITH A THOWN OBJECT. THE CRAFT WAS APPORXIMATELY 100'WIDE.IT WAS OPPOSING SAUCER SEGMENTS ARRANGED TOP AND BOTTOM WITH WHAT APPEARED TO BE PORTS IN SEMETRICAL SPACED DISTANCES ARRANGED AROUND THE CENTER ,APPROX.THREE FEET APART. THE PORTS APPEARED TO BE CLEAR,WHICH ENABLED A VIEW OF THE INTERIOR. THE ONLY OBJECT VISABLE APPEARED TO BE A HUMAN OR HUMANOID STANDING IN THE FOREWARD END OF THE CRAFT , HOLDING WHAT APPEEARED TO BE CONTROL STICKS,ONE IN EACH HAND.THE COLOR OF THE CRAFT WAS A POLISHED TITANIUM WITH NO EMBLEMS. THE FACT THAT IT LEFT THE TREES ON ONE SIDE OF THE VALLEY AND RE ENGAUGED THEM AFTER CROSSING THE OPEN VALLEY MADE IT APPEAR TO BE TRYING TO AVOID BEING SIGHTED.WE WOULD NOT HAVE SEEN IT IF IT HAD NOT CAUSED THE NOISE OF BREAKING THE UPPER LIMBS OF THE TREES, ALLERTING US.AS IT CROSSED THE OPEN AIR ABOVE THE VALLEY IT MADE NO NOISE.THERE WAS NO VAPOR TRAIL OR ANY SIGN OF EXAUST MADE BY CONVENTIONAL PROPULSION SYSTEMS.THERE WAS NO SIGN OF PLASMA SURROUNDING THE CRAFT,NO VISABLE DISTORTION OF THE ATMOSPHERE SURROUNDING THE CRAFT."],"Region":"Ohio","Weather Factors":"None","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.754814,+-80.573841(22031)&iwloc=A&hl=en\"> mufon case (22031) map </A>","Latitude":"40.754814","Date Submitted":"02/28/2010 09:49 UTC","Log Number":"US-02282010-0002","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/22031.html.txt","/var/www/straped/mufon/org/22031.html"],"Country":"United States","City":"calcutta , clarkson"}