{"Date Submitted":"02/28/2010 01:11 UTC","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around September 17th 1954"],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/22030.html.txt","/var/www/straped/mufon/org/22030.html"],"Object Features":"None","Region":"Ohio","Log Number":"US-02282010-0001","Case Number":"22030","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-84.50533","Summary":"A round ball with two tear drop shaped objects behind it.","divs":["Sighting DetailsMy family lived in Mariemont,Ohio, on top of a bluff over looking the little maiami river valley. My grand mother took me for a walk in the evening, down to a concourse, that over looked the valley to the south of us towards Lunkin airfield. my grand mother pointed the object out to me. It was a glowing white ball with two tear shaped objects following it, with the thick end closest to the sphere.One atop of the other, they changed color as it moved,the ball was always white. the tear shaped objects went from yellow to blue and orange every two secounds. It made no sound. It traveled in a slow movment from west to east and appeared to be at the same level as we were. It was reported to be a mass haluciation for some 40,000 or so people. My grand mother and I did not mention that we had seen it. I was'nt very old at the time only 8 or so. I have never heard it mentioned as one of your sighting. I am not sure of the exact date because I was so young at the time. Surley there must be some record of it, in the news papers archives."],"Disposition":"Insufficient Data","Weather Factors":"None","City":"Cincinnati","Object Shape":"Sphere, Teardrop","Object Flight Path":"Straight-line path","Date of the Event":"09/17/1954 08:26 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.105898,+-84.50533(22030)&iwloc=A&hl=en\"> mufon case (22030) map </A>","Source":"MUFON","Latitude":"39.105898"}