{"Log Number":"US-02282010-0005","Object Flight Path":"Undisclosed","Source":"MUFON","Longitude":"-121.909042","Tags":"City","Weather Factors":"Unknown","Date of the Event":"02/09/1985 11:30 UTC","files":["/var/www/straped/mufon/html2text/22034.html.txt","/var/www/straped/mufon/org/22034.html"],"divs":["Sighting Detailsit was approx. the time and date described above, i was living in a 2 story victorian in pacific grove ca, in the 80's i grew up in this house, i was 19 years old at the time being born in 1966, i have never related this sighting to anyone, and as per the usual reasons i'd be labeled crazy or stoned or on drugs! but after watching \"I KNOW WHAT I SAW\" on the history ch. i had to relate this! I'm not exactly shure of the exact date but i know it was before the space shuttle blew up by a few months so it must have been 1985, at approx. 11:00 P.M. i was upstairs in bed looking out the window counting stars and enjoying the milky way, the night was crisp and very clear with a light wind, after a while i lit a cigarette and for some reason i decided it was too late to smoke so i put it out, within several minutes i returned looking out to the stars, and as i did i noticed what looked like a satalite moving from east to west approx. then i noticed it was bright red in color, yet it was as high in the atmosphere as satalites travel, having seen several that night, but this one was just weird, being red as a street light, so i opened the window and sat on the sill, to make shure the old victorian glass was not playing tricks on my eyes, as i watched this object travel west i then noticed another object moving east same size yet this object was blue bright blue! Now i saw close encounters of the third kind as a kid in a san antonio tx. theatre as a kid and dismised ufo's as hollywood stuff although the air traffic scene sent chills down my spine, i still was a true non-beliver in ufo's. in any event as i watched this red object move towards what looked like a collision course with this blue object, i had to wipe my eyes in disbelief, was i really seeing this? then i thought it might be a product of the space program nasa ect. and as i watched these objects meet they both stopped dead still high up in the apmosphere and just stood there for about 5 seconds it looked like they had docked, and i told myself this is impossible at the speed they were moving and then just coming to a halt? after the 5 seconds of stillness they suddenly split apart at phenominal speed at oblique directions they moved so fast i could only track one so i made a decision to track the red object it flew out of sight over my house and out of sight in about 3-4 seconds! Now what kind of spacecraft can do that? to this day i have never heard of something sighted or reported that matches this, if anyone at mufon can shed any light on what i saw back in 1985 i'd like to know, it has bothered me ever since, because i have tried to find a simple awnser to this and have found nothing, i'd hate to go to my grave without ever knowing what i saw that night. Now there are really only 3 awnsers to what i saw, 1 it was a strange undocumented atmospheric annomly, 2 these were some sort of top secret man made craft, although i find that hard to swallow, because of their flight ablilties, 3 the big one there are not of this earth! any help on what i saw?"],"Viewing Distance":"Unknown","Case Number":"22034","trends":["There have been 6 other sightings in Pacific Grove","There were no other sightings in Pacific Grove on or around February 9th 1985"],"Object Shape":"Other","Sighting Duration":"00:03:00","Date Submitted":"02/28/2010 01:20 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.626487,+-121.909042(22034)&iwloc=A&hl=en\"> mufon case (22034) map </A>","Latitude":"36.626487","Summary":"high atmosphere objects","Object Features":"Undisclosed","City":"Pacific Grove","Disposition":"Hoax","Region":"California"}