{"Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","City":"Bangor","Log Number":"US-02282010-0015","Tags":"City","Weather Factors":"Unknown","Object Features":"Undisclosed","Region":"Maine","Longitude":"-68.775174","Summary":"A friend and I herd a noise while walking near a river and then a UFO flew away at tree top level","files":["/var/www/straped/mufon/html2text/22044.html.txt","/var/www/straped/mufon/org/22044.html"],"Disposition":"Unknown","Sighting Duration":"00:06:00","divs":["Sighting DetailsThis is my first close incounter with a UFO. But not my last. I have seen a disk shaped UFO and a triangle UFO so close I could hit them with a rock. I've only told 2 people these storys in the years since I've seen them for obvious reasons. It all started one night when my neighbor and I snuck out at night to walk around town and cause trouble. We lived in a small town of about 300 residence. We hadn't evan gotten off our small dead end road when we herd a noise coming from the river which runs parallel to our road. The ice was cracking. We thought I moose or bear was coming our way so we started running back to my house. The noise of the ice cracking seemed to be following us. Then sudenly the noise stopped and a disk shaped object with lights and colors swirling around It flew out from the woods by the river. It was flying at tree top level about 150 feet in front of us and it made no noise. It looked like it was flying about 5 MPH. It didn't look as big as I thought a UFO would be. It looked to be about 25 to 30 feet wide and about 10 feet tall. It flew off still at about 5 MPH continuing to go east untill we couldn't see it anymore because of the trees. We both stood there not moving as we watched it, knowing we were seeing something that no one would ever belive. We went back to my house after this which is about 30 feet from the objects flight path. We stayed up all night from the adrenalin rush talking about what we saw. Since this day I've seen 4 other UFOs"],"trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around February 12th 2000"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.802462,+-68.775174(22044)&iwloc=A&hl=en\"> mufon case (22044) map </A>","Source":"MUFON","Object Shape":"Disc, Flash, Other","Latitude":"44.802462","Case Number":"22044","Date of the Event":"02/12/2000 01:06 UTC","Date Submitted":"02/28/2010 03:50 UTC"}