{"Latitude":"35.903806","Tags":"City","files":["/var/www/straped/mufon/html2text/22043.html.txt","/var/www/straped/mufon/org/22043.html"],"Region":"North Carolina","divs":["Sighting DetailsVery clear & cold night. Could even see the milky way. Camping with my 2 sons and another boy. Kids were in the tent sleeping & I sat on the passenger side in the car to read, occasionally turning on the engine to warm up. Inside light was on. All of a sudden a strong wind blew in. Engine stopped & lights went out. I looked around. All looked calm. Then I looked up & saw a mushy white metalic craft above the little hill I was parked next to. There were 5 or 6 dark windows on its side. I got scared & did not leave the car. I looked at the tent which seemed OK (next morning the main pole & 3 side pegs were out & rope was twisted tight in a counter-clockwise position). The color of the craft reminded me of Mica. I felt tense & helpless & scared. I know I sensed a time loss & have no recollections. At some time I remember looking up at the craft for a moment (several seconds) when it suddenly silently flew out of sight. Then it appeared over the vast strip-mine area, bobbing into sight & out of sight in the darkness. From a distance it appeared brighter than when it hovered over my car. It was around 6:30 AM when I went to the tent & asked the boys if they heard anything. They did not. I noticed that the ground had counter-clockwise wind evidence I'd experienced. I drove to the mine office to meet a geologist from Greensboro who was going to work on Geology Merit Badge with the boys this day. While waiting I spoke to the owner & told my story. He didn't want to hear it. He thought I was nuts. When we returned to Charlotte I told my wife. She thought I was nuts. A few people I told also questioned my sanity, so I kept it to myself...until I read about George Fawcette (Lincolnton,NC) in a news article a couple of years later who was an expert on UFO sightings. I reported the story to him by phone & learned NC has many sightings & I wasn't nuts after all. Now that History & Discovery channels frequently discuss the topic I don't feel like the Lone Ranger. I talk about it now if people are interested. But I don't talk about my behavior after that incident...frequent sightings of sorts & an obsession to watch the skies at night...street lights frequently going out...a slight bump on my neck I noticed. In 1993 the bump was removed by Dr. Ken xxxxxx in Charlotte along with a few growths in my scalp. The pathology report identified the growths BUT COULD NOT IDENTIFY THE METAL REMOVED FROM MY NECK. Since that procedure nothing unusual has ever happened again & lights don't go out, I don't feel a presence or see UFO activity anymore. I definitely don't talk about it to anyone. This is the first time. One time a cynical person asked me if I felt \"special\". No! It's random. A UFO sighting made me a believer who can't ever forget the fear of that encounter & a gnawing feeling embedded in me forever. We have a lot to learn & accept."],"Summary":"heavy momentary wind shook car, engine stopped,lights went out. I looked around & saw object hovering above me.","Country":"United States","City":"hiddenite","Date Submitted":"02/28/2010 03:38 UTC","Source":"MUFON","Object Shape":"Oval","Sighting Duration":"09:00:00","trends":["There have been no other sightings in hiddenite","This sighting has never been favorited."],"Disposition":"Unknown","Date of the Event":"11/15/1983 08:15 UTC","Weather Factors":"None","Object Features":"Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=35.903806,+-81.090557(22043)&iwloc=A&hl=en\"> mufon case (22043) map </A>","Case Number":"22043","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-81.090557","Log Number":"US-02282010-0014","Viewing Distance":"21-100 Feet"}