{"Case Number":"22040","Date Submitted":"02/28/2010 02:05 UTC","Viewing Distance":"Unknown","Object Features":"Patterned Surface","Object Shape":"Disc","Country":"United States","Date of the Event":"10/22/2007 05:33 UTC","trends":[""],"divs":["Sighting DetailsUpon reviewing my Ham Radio photos a few weeks ago, I noticed a Disc in the picture, to the right of my tower. The picture was taken with a new Casio camera, Model EX-S770, 7.2MP. I took 3 other pictures prior to this one using different ASA settings to test it out. This was the last picture I took of the series and the only one showing the Disc. The photo was taken looking North East at approx. a 45% angle. My Lat. is 40 Degrees, 11 Min and 36 Seconds North. The Long. is 75 Degrees, 4 Min. and 1 Second West. All I know is that my tower is crystal clear and I have no idea as to what this Disc is.The movement can be seen from its start, a dark circular area until lens closed. The forward and upward movement had to be very fast.Thhe Disc also shows a bright outside and green inside. I am 63 years old and have been into photography since I was 12. this is the first time I ever caught, what I think is a U.F.O. I must admit, that I started believing in them when I was stationed in Colorado Springs after Vietnam. My friend that lived in the same apartment as I was stationed at NORAD in the Air Force. He told me about tracking Mach 7 UFO's making right hand turns etc. They always received hundreds of calls after they saw the sightings on Radar. Tim Eisner WN3UCA@AOL.COM"],"Source":"MUFON","City":"Undisclosed","Disposition":"IFO","Log Number":"US-02282010-0011","Summary":"Forward and upward movment of disc. Oct. 22,2007 @17:33:20","Tags":"City","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Latitude":"41.206352","map":"<A HREF = \"http://maps.google.com/maps?q=41.206352,+-77.188745(22040)&iwloc=A&hl=en\"> mufon case (22040) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22040.html.txt","/var/www/straped/mufon/more/22040_submitter_file1__10222007533pm.JPG","/var/www/straped/mufon/org/22040.html"],"Longitude":"-77.188745","Region":"Pennsylvania"}