{"Latitude":"43.71684","Object Flight Path":"Stationary,Hovering then path,Path with directional change","trends":["there have been no other sightings in portland \\ wells","This sighting has never been favorited."],"Region":"Maine","Longitude":"-70.303448","Weather Factors":"Unknown","Date of the Event":"02/22/2010 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.71684,+-70.303448(22042)&iwloc=A&hl=en\"> mufon case (22042) map </A>","Viewing Distance":"Unknown","Object Shape":"Circle, Diamond, Disc, Sphere, Star-like, Teardrop","Log Number":"US-02282010-0013","Case Number":"22042","City":"Portland / Wells","Country":"United States","Date Submitted":"02/28/2010 02:54 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","divs":["Sighting DetailsSince December 25,2009 to the present day February 28, 2010, I have been taking pics outside over my house and in each pic there are multiple lights, spheres,circles,cones,and even flame-like teardrop colors. Craft appears to be VERY large and transparent with human-like people inside at what appears to be computer terminals,pics are very detailed, although, most objects appear on pic while using the flash. There appears to be smaller sphere shaped objects that dart around separate from large craft ( exact size unestimable ) Some are green and white circular, some are multi-colored almost rainbow colored, also I have seen these craft go from hover to the speed of a shooting star ( 3 times ). I have 100's of pics.To many to make a clear, definitive description. Has happened nearly every night from Christmas night to present. What caught my eye at first were small flashes of light and round spherical objects moving at high rate of speed ( west to east, north to south, all directions )I had no clue what these things were or are. The first pic I took on Christmas night, there was 1 round green and white object, quite high in the sky directly over my home. Since that photo, I obviously became interested and curious and began taking photos nightly, and most nights I capture images that are quite curious. I was very afraid the first time I saw this object, because I had no idea what the heck it was. The larger object appears to hover and possibly maybe only rotates slowly in a clockwise circle, the smaller spheres dart about as if in practice mode or so it appears. Pics submitted are of the single disc photographed on Christmas night."],"Source":"MUFON","Summary":"Was taking pics at 10 pm est and object appears to be very large, with multiple lights, spheres,circles,and human like people inside.","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/22042.html.txt","/var/www/straped/mufon/more/22042_submitter_file1__disconchristmasnight2009006.jpg","/var/www/straped/mufon/more/22042_submitter_file2__disconchristmasnight2009008.jpg","/var/www/straped/mufon/more/22042_submitter_file3__disconchristmasnight2009005.jpg","/var/www/straped/mufon/org/22042.html"]}