{"Latitude":"36.116666","map":"<A HREF = \"http://maps.google.com/maps?q=36.116666,+-115.168466(22048)&iwloc=A&hl=en\"> mufon case (22048) map </A>","Log Number":"US-02282010-0019","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Summary":"a ridiculously big sphere with bright white light with it that moved into space in seconds","City":"Las Vegas","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around February 20th 2010"],"Object Features":"Undisclosed","Longitude":"-115.168466","Object Shape":"Sphere","Case Number":"22048","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was getting ready to go to bed and was going to step out on patio to pray and give my thank you to god for blessing me with another day. I do this every night, and I always look up at the stars for at least a minute just looking at space, I have seen maybe 7-8 shooting stars or comets burning up since we moved here a year ago, there is no way it was anything like that. So I was opening the sliding glass door to step out and as I was doing this I saw a huge white light lower then a duel prop plane that staggered by earlier that night pretty sure it was a C-130, I love the military always watch nellis jets and choppers all the time when they go by. This light was by far the brightest thing I have ever seen in the sky, I could kind of see a faint light from the sphere in the center, then that was surrounded by a huge glowing halo of white light, then I stepped out and started really looking at it for about 15 seconds. At which point the whole thing looked to be zooming off into space, not decipitating or burning out, it looked to be completely staying that same size but moving out and away into space, is the best way I can describe it. It seemed as I watched it go out I saw this all the way til it was just a point of light in the sky that looked like all the stars in the sky, exept I stood there and watched it completely disappear."],"files":["/var/www/straped/mufon/html2text/22048.html.txt","/var/www/straped/mufon/org/22048.html"],"Region":"Nevada","Sighting Duration":"00:00:30","Country":"United States","Date of the Event":"02/20/2010 04:30 UTC","Date Submitted":"02/28/2010 04:58 UTC"}