{"Date Submitted":"02/28/2010 04:59 UTC","Sighting Duration":"00:12:00","Country":"United States","Object Flight Path":"Stationary","City":"Mesa","divs":["Sighting DetailsI am a school bus driver. I had just finished dropping off my last student for one school, and was on my way to another school. I had thirty minutes before the second school students were released, and it would only take seven or eight minutes to get there. I was proceeding eastbound on E. Contessa Street in the residential area just northwest of the intersection of N. Greenfield Road and E. University Drive when I noticed a black object or spot in the air due north of my location. It appeared to be in the climb-out path of runway 22 of Falcon Field airport. I stopped my bus in the intersection of E. Contessa Street and n. Orlando for a better look, and determined that the object was stationary in the sky at approximately a 25 or 30-degree angle above the horizon. It was featureless black and mostly round, though the edges were not sharply defined in my eyes. (Note: I have a slight double-vision problem; traffic light one or two blocks away appear to be two lights side-by-side; aircraft in flight appear to have two wings or two fuselages depending on the angle at which they appear from my position.) I could not see the double-vision effect in this case, however -- the edges of the object just appeared to be poorly defined.) I considered the possibility that this was an inflated black garbage bag floating around and changing shape slightly, but it seemed to be locked solidly in one position, unmoving, and was too black -- i.e., it was much blacker than a distant black object should have been given the intervening hazy atmosphere. (Also, the weather was a high thin overcast.) I continued on to N. Greenfield Road and turned left, or northbound. As I drove northbound a light aircraft was observed climbing out of Falcon Field from my right to left and it passed apparently between me and the object, though it did not pass directly in front of the object. The aircraft then made a climbing turn to the right, apparently passing to the west of the object. I don't know if the pilot saw the object or not. At the time I was monitoring 124.6-mHz, the control tower frequency of Falcon Field (I am a student pilot), and while I was not paying a lot of attention to the radio traffic I did not hear any excited transmissions or anything indicating the control tower personnel was aware of the object. As I drove north at 45 mph there was an optical illusion of the object seeming to get lower on the horizon as though it was moving away from me faster than I was approaching it. Yet, when I stopped for traffic lights, the object was still unmoving and still at 25 to 30-degrees above the horizone, and had not gotten any smaller or larger, and did not appear any closer or farther away. However, it had seemingly moved slightly to the west, so it was now north-northwest of me. The angle above the horizon, and its size, and it degree of blackness did not change as I traveled three miles north from where I originally saw it -- in other words, I did not appear to be getting any closer to it; I was not getting under it, it's position relative to me seemed unchanging in all respects. At one point I saw a woman standing on the curb on the east side of Greenfield with a cellphone to her ear, and she was looking in the general direction of the object, but I don't know if she was looking at the object. The intersection of N. Greenfield Road and E. McDowell Road was the three mile point from where I started, and as I drove the last half mile or so from there to the 202 freeway, the object did move further to the west and began to get smaller. When I turned east on the 202 the object was north-northwest of me and getting significantly smaller. As I proceeded east on the 202 I looked back over my left shoulder and lost sight of it as the freeway dipped into a trench, but when the freeway climbed out of the trench again I caught a glimpse over my shoulder of a very tiny black dot in the distant north-northwest. A possibility, though I seriously doubt it: McDonnell-Douglas manufactures the Apache helicopter on the north side of Falcon Field and it is not unusual to see dark olive-drab and other helicopters flying patterns in the area. It could be claimed that the object I saw was a helicopter. I seriously doubt it, however, because 1: I never saw any flickering of rotor blades; 2: it was stationary at all times when I stopped at three different traffic lights, yet I never got any closer to it and the angle above the horizon never changed even as the azimuth changed more and more toward the west after I crossed McDowell. P.S. I was a field investigator for APRO in the 1970's in Australia, but the last case I paid any attention to was the Travis Walton abduction case after I returned to the U.S. This sighting generated in me the same feelings that caused me to eventually give up on UFO sightings: Most of them didn't make any sense: Even extraterrestrial spacecraft couldn't do what many sightings reported if they had any physicality at all. This was more like a hole into our space from another dimension -- and that doesn't explain it either. So, there it is, for whatever it is worth."],"Case Number":"22049","Tags":"City","Disposition":"IFO","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=33.422024,+-111.828202(22049)&iwloc=A&hl=en\"> mufon case (22049) map </A>","Longitude":"-111.828202","Region":"Arizona","Summary":"A black spot stationary in the sky","Log Number":"US-02282010-0020","files":["/var/www/straped/mufon/html2text/22049.html.txt","/var/www/straped/mufon/org/22049.html"],"Date of the Event":"02/26/2010 03:20 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Does Not Apply","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around February 26th 2010","This sighting has never been favorited.",""],"Latitude":"33.422024","Object Features":"None","Source":"MUFON"}