{"Summary":"Disc shape with round lights flashing around the edge going clockwise.","Longitude":"-72.973789","Log Number":"US-02282010-0017","Date Submitted":"02/28/2010 04:50 UTC","Object Shape":"Disc","Region":"Connecticut","Latitude":"41.888091","Tags":"City","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI had gone out the side dor of our house to play in the side yard.It wasn't quite dark yet. the side yard overlooks our hayfield. I had turned to look down into the field when I saw a disc shaped object moving slowly up the field towards the house. I wanted to run in to tell my family, but couldn't move. I tried to scream but nothing came out. The disc came up the field within 100 ft of the ground.The lights were flashing one at a time clockwise aaround the egde.As it got closer, I could see the lights were recessed into the edge and the disc was a grayish black color. as it got closer,it seemed to get lower. It flew over a large tree in the side yard,almost hitting it,then it was gone. As soon as it was out of view,I ran into the house to tell my family. As soon as I got into the door, my mom started yelling at me that I had missed dinner and wanted to know where I was. I tried to exlpain that I was in the side yard, but that got her even madder. She claimed to have yelled out the side door for me several times, my dad backed her up.I looked at the clock,it showed a half hour later then when I had gone out. To me the whole incident, from when I went outside to coming back in was under five minutes."],"trends":["There have been 2 other sightings in New Hartford","There were no other sightings in New Hartford on or around August 31st 1980"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.888091,+-72.973789(22046)&iwloc=A&hl=en\"> mufon case (22046) map </A>","Case Number":"22046","files":["/var/www/straped/mufon/html2text/22046.html.txt","/var/www/straped/mufon/org/22046.html"],"Country":"United States","Object Features":"None","Disposition":"Unresolved","Viewing Distance":"21-100 Feet, 101-500 Feet","Source":"MUFON","City":"New Hartford","Date of the Event":"08/31/1980 12:00 UTC"}