{"trends":["There has been one other sighting in Susanville","There were no other sightings in Susanville on or around December 15th 2009"],"Longitude":"-120.653006","Object Shape":"Cigar","Object Features":"Undisclosed","City":"Susanville","Sighting Duration":"Undisclosed","Case Number":"22050","files":["/var/www/straped/mufon/html2text/22050.html.txt","/var/www/straped/mufon/org/22050.html"],"Tags":"City","Weather Factors":"Unknown","Region":"California","Date of the Event":"12/15/2009 02:00 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Log Number":"US-02282010-0021","Summary":"very small cigar shaped, black, silent, slow moving","Latitude":"40.416284","map":"<A HREF = \"http://maps.google.com/maps?q=40.416284,+-120.653006(22050)&iwloc=A&hl=en\"> mufon case (22050) map </A>","Disposition":"Unknown","divs":["sighting detailsi was standing in front of my house with my ex husband, waiting for my son to come back downstairs so we could go to the bank. as i was waiting and conversing with my ex i looked up directly above, left of my house and saw two birds flying in tandem cicles together which is what hawks do but what struck me as strange was that one was a hawk and one was a crow so i said to randy in amazement \"look at that, isn't that strange one is a crow and one is a hawk.\" he looked ,.\\said yeah and shrugged it off. well as i continue to watch them fly together in this stange way i see something in my perepherel vision coming from the left. it wasn't to far to the left of the flying birds and it was just a little above them closing in on their location slowly. i watched it fly right over them and continue on towards dyer mountain range and i watched til i could not see it anymore. it made no noise. nothing came out of the back of it. the birds were not bothered by it and the part i found the strangest is that it wasn't much bigger than the birds. there were no lights nor windows or anything like that. no identifying marks of any kind it just looked smooth, solid, black, small."],"Date Submitted":"02/28/2010 05:21 UTC"}