{"trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around February 27th 2009"],"City":"Fort Worth","Case Number":"22051","Date Submitted":"02/28/2010 05:32 UTC","Summary":"Beautiful, amazing, humbling, it felt personal, like it was waiting for me to come outside and notice it, it was really large and like nothing I had ever seen before.","Tags":"City","Object Features":"Dome, Patterned Surface, Other, Unknown","Longitude":"-97.31684","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22051.html.txt","/var/www/straped/mufon/org/22051.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.728639,+-97.31684(22051)&iwloc=A&hl=en\"> mufon case (22051) map </A>","Viewing Distance":"101-500 Feet, Unknown","Object Shape":"Sphere, Other, Unknown","Country":"United States","Latitude":"32.728639","Date of the Event":"02/27/2009 05:30 UTC","Log Number":"US-02282010-0022","divs":["Sighting DetailsMy boyfriend, Russell,and I were standing in our small suburban backyard enjoying the clear morning. We had been up all night hanging out with 2 friends of ours. They were in our living room at the time of our sighting. I spotted a white reddish pulsating Orb high in the north-eastern sky. I pointed and said to Russ, \" what is THAT?\" He looked and started to say \"Oh thats just a plane but said after a moment instead \"I don't know, what IS that?\" Then it started moving slowly from north-east toward the eastern quarter of our house. As it got closer we were able to see 3 smaller orbs connected to the larger orb. Then it started moving west directly over our heads!!! Surrounding the Orbs was a very large, CLEARish, flat craft or ship. As a whole! But it was clear, we could see light glimmering very subtly off of it, and it radiated a trail of \"heat-like\" substance behind it- also clear. The UFO Stopped completely over Russell and I for about 45 seconds, the light in the middle pulsated reddish white and greenish white..all we could hear was a very low octave drone coming from the stealthy craft.....when it hovered over us, we went from amazement to feeling paralyzed in fear for a moment...we felt completely vunerable and at the mercy of this advanced ariel craft. All I could do was murmer,\"Oh my God Russell, What are we LOOKING at????!!!,'' We felt scared and in shock. The craft then continued on toward the west. Making all the neighboring dogs bark frantically. The entire experience lasted about 5 minutes...or less, it's hard to tell...it seemed like forever! I then went inside to get our friends to come outside and see it...but when they came out it was to far away for them to see it. I will never be the same. It was beautiful!"],"Region":"Texas","Disposition":"Hoax"}