{"Log Number":"US-02282010-0025","Region":"Illinois","Date Submitted":"02/28/2010 06:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.069742,+-88.1136(22054)&iwloc=A&hl=en\"> mufon case (22054) map </A>","Case Number":"22054","Object Flight Path":"Path with directional change","Tags":"City","trends":["There have been 7 other sightings in Hoffman Estates","There were no other sightings in Hoffman Estates on or around December 9th 1965"],"Summary":"Fireball headed in South-southeasterly direction, slight arching in trajectory","Disposition":"Insufficient Data","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","City":"Hoffman Estates","files":["/var/www/straped/mufon/html2text/22054.html.txt","/var/www/straped/mufon/org/22054.html"],"Latitude":"42.069742","Object Features":"Other","Object Shape":"Fireball","Sighting Duration":"00:05:00","Weather Factors":"None, Does Not Apply","Date of the Event":"12/09/1965 04:00 UTC","Longitude":"-88.1136","divs":["Sighting DetailsThese are a string of events which I witnessed at first and experienced later and I believe are related to the Kecksburg, PA. sightings and subsequent crash reported in 1965 Pennsylvania. You'll see as this factual story developed over the next 2 and a half years (!), the events associated with what I witnessed didn't stop merely with what I witnessed on December 9, 1965. On that date, I was 16 yrs. old and living with my family @ 183 Hillcrest Blvd., Hoffman Estates, Illinois, called by the locals there \"The Hoffman Highlands\". (I am now 60 yrs.old, and live in Vermont). The address which was then 183 Hillcrest Blvd., is now about 560 Hillcrest Blvd. due to the subsequent housing development there. I had a friend, Eberhard Becker who lived on Harvard Ln. and whose street curved around to meet with Hillcrest Blvd. The Event: I was riding my bicycle home around 4 pm. from my friend's place on Harvard Ln. I saw above our house on Hillcrest Blvd. a silent fireball with a long 'tail' behind it, and moving at a slow rate of speed...much slower than, say, a meteor or ball-lightning. It actually moved as though it was being somehow controlled, exhibiting a 'flight' of sorts in its trajectory. I was \"mesmerized\" to the point that I actually drove my bike into a large dirt-mound on the side of the road near the end of Harvard Ln., skinning my legs and elbow upon hitting the ground. I stood for 4 or 5 minutes as this fireball continued towards what at the time I thought may eventually go into Lake Michigan. Also, being relatively close to O'Hare Airport, I also thought that this may have been a Jet-liner which caught on fire and was going to crash. I recall that I told my folks what I had just seen, and also the next day was intent on looking in the newspaper to see if anything had been reported, watched the local news...and, I didn't rule out that this may have been a UFO of some sort which was experiencing some serious problems. However, I was dismayed to find that there were no reports anywhere of even so much as a sighting, let alone a crash of anykind. (!) At that point I just put what I had seen \"on-the-back-burner\"...not thinking very much about it thereafter...BUT remembering it for the rest of my life as being an unusual sighting...I never forgot about it for it 'moved' me tremendously in curiosity and emotionally, and quite decisively. All this, please keep in mind, until I saw the History Channel's report of the Kecksburg incident, and what surely must've been what I saw...however...unbeknowns to me at the time and subsequently, even stranger events were to unfold which are, in my minds eye NOW anyway, and related to the Kecksburg incident, even stranger yet...and practically defy considerations of mere 'coincidence'! Now...here comes the strange part. In January, 1968, just over 2 years later I enlisted in the US Army. I went through boot-camp at Ft. Leonardwood, MO. I became a fairly lowly clerk-typist, despite the fact that due to my excellent standing in my boot-camp and AIT scores, they wanted me to go Airborn Rangers. I declined. I was told by my recruiter that he'd make sure that I would go to Japan and other Asian countries, which he said would also most probably include Viet Nam as well, as most young folks back then ended up there eventually anyway! Well, it turned out that despite the war and all, my permanent station ended up being none other than the NORAD Radar Installation at Oakdale, PA. (which was the installation called to cordon-off the sight of the Kecksburg incident a mere 2+ years earlier and collect all the materials there!!!) (!!!) See where this is going? :-) Not only that, but they took me first, at the NORAD sight, out of my clerk-typist vocation, and told me I'd be much better off working there as a draftsman up \"on-the-hill\" IN the NORAD radar building itself...but, as Draftsman! And...that's not all...one morning as I was walking to my post in the Radar Building, the Brigadier General Lloyd L. Leech, commander of the post was walking down the hill and directly in my path. I stopped and saluted him sharply as was required, and continued up to my station. About a half-hour later, his General's Aide was in my office, and stated that the General wanted to see me. Keep in mind, I am only at this point a Private First Class...not very high-up on the scale. I thought, \"Man, I must've screwed-up something...?\" Upon arriving in the General's office, I was told to go right in. The General bid me to sit for a moment or two, which I did. He THEN said...\"My Specialist First Class Aide is about to deploy to a different assignment, and I want YOU to be my Aide. My Aide will contact you with the details of this assignment. I was immediately given a DOD Secret Clearance...and became the General's Aide! So anyway, in view of what I recently saw on the History Channel, and stories of \"Men-in-Black\" keeping tabs on civilians and their progress through society and other related things...it is odd to say the least, that what I saw going through the late afternoon sky in December, 1965, and where I ended up, and the way events throughout my life unfolded relatively quickly and HAVE continued to unfold subsequently in my life, I thought maybe someone there where you are may find this interesting, or possibly put more together where this incident at Kecksburg is concerned. I have ended up working in Government Jobs ever since, building Nuclear Submarines with a Secret Clearance, and now am being considered for a job with the aerospace industry and the Corning Corporation milling lenses for satellites, telescopes and lasers...also for the US Government. ...and \"the 'hits' just keep on coming\", as it's said. :-) Just thought you there at MUFON may find all this to be of a 'particular-type of coincidental nature'. It sure seems that way to me. Please feel free to contact me if you feel further investigation or elaboration may be necessary. Thank you... Richard Babcock"],"Source":"MUFON"}