{"Object Flight Path":"Undisclosed","Case Number":"22055","City":"Milford","Object Features":"Undisclosed","Latitude":"42.835362","trends":["There have been no other sightings in Milford","This sighting has never been favorited."],"Date Submitted":"02/28/2010 06:27 UTC","divs":["Sighting DetailsOn Sept 26th 2009 I was in Milford, New Hampshire just west of Manchester. I was with a friend of mine. We are both highly experienced commercial airline pilots with almost 60 years and 40 thousand hrs of flight experience between us. Around noon time my friend called me excitedly to the outside of the garage we were working in. He pointed high up in the sky to the northeast of Milford towards a position I would have to say was very nearly overhead the city of Manchester. As I looked I saw an object that had to be at an altitude of 70 to 80 thousand feet in altitude hovering over the Manchester area.(please keep in mind that we are both experienced pilots used to making accurate judgements of an object's altitude.) It was spherical in shape and a greyish silver color. This object hovered stationary for some 30 to 40 minutes. I have seen high altitude weather ballons and I know that it would be impossible for a weather balloon at that altitude to remain perfectly stationary for even a few seconds even on the calmest of days As for the idea of a helicopter, the object's altitude rules that out.(Most helicopters can't hover out of ground effect much above 10 thousand ft. Cerainly none at 70 to 80 thousand ft.) We both watched the object for 30 to 40 minutes and then watched it takeoff to the northeast at such a high rate of speed it almost appeared to vanish. I don't know what this was but I'm pretty damn sure what it wasn't and so is my friend."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.835362,+-71.648984(22055)&iwloc=A&hl=en\"> mufon case (22055) map </A>","Longitude":"-71.648984","Date of the Event":"09/26/2009 12:00 UTC","Weather Factors":"Unknown","Country":"United States","Region":"New Hampshire","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Log Number":"US-02282010-0026","Tags":"City","Viewing Distance":"Unknown","Summary":"Stationary sphere at high altitude above south central NH","files":["/var/www/straped/mufon/html2text/22055.html.txt","/var/www/straped/mufon/org/22055.html"],"Disposition":"Unknown"}