{"Object Shape":"Circle, Flash, Other, Unknown","Date of the Event":"02/16/2010 08:30 UTC","trends":["There have been 3 other sightings in Great Bend","There were no other sightings in Great Bend on or around February 16th 2010"],"Viewing Distance":"Over One Mile","Case Number":"22065","Object Features":"Unknown","Latitude":"38.366977","Object Flight Path":"Path with directional change,Path then hovering,Other","files":["/var/www/straped/mufon/html2text/22065.html.txt","/var/www/straped/mufon/org/22065.html"],"Log Number":"US-02282010-0036","Weather Factors":"Unknown","Longitude":"-98.755997","Tags":"City","divs":["Sighting DetailsI noticed these lights when I stepped out to my car to grab a bag of clothes to bring in. I glanced to the north to what I thought were a few airplanes flying near each other, I looked again to notice that these lights were far to unusual to be typical aircraft. I ran inside to fetch my video camera and my father. What I saw was approximately 4 and 15 objects at any given time. They would group and scatter frequently moving in very erratic paths. The changed their direction effortlessly within a full 360 degree spectrum. Their lights were pure white and pulsed without a distinguishable pattern. On several occasions many of them would disappear from sight only to reappear again in completely different spots. About 10 minutes after my dad at I began watching them, two jets came along and seemed to be attempting to get near the objects. The jets were easily recognizable compared to the objects, they moved in very linear paths, had the common red and blue aircraft lights and turned in stretched arcs. Every time a jet came near one, the object would \"bounce\" out of its way at a sharp 90 degree incline, then would quickly change directions again. I was watching this from 18th and Van Buren looking straight north, starting around 8:30. We continued to watch for 15 minutes or so from this location until they all began to head further north, out of our viewing range, so we hopped in my car and headed out on McKinley, just north of Twin Lakes and continued to watch them dart back and forth across the sky until they eventually sped off to the South East, moving far too fast to keep an eye on them by car. I managed to capture a little bit on video, though most of the time they were moving too fast and changing direction too frequently for my camera to stay focused enough to see them. The video that I do have does capture the unusual sequence of lights blinking on and off, and reappearing elsewhere. I cannot say that what we saw was a group of ufos, or a strange government test, for that I am unsure, but these do defy a logical explanation on my behalf and I feel deserve some sort of investigation. I will release the video after email contact when I feel comfortable with whom contacts me. I do not wish to come off as arrogant, I just prefer not to open a can of worms. I am typically skeptical as far as unusual sightings go, but this left me unsure as what to think. Thank you for your time."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.366977,+-98.755997(22065)&iwloc=A&hl=en\"> mufon case (22065) map </A>","City":"Great Bend","Sighting Duration":"Undisclosed","Date Submitted":"02/28/2010 10:09 UTC","Region":"Kansas","Country":"United States","Source":"MUFON","Disposition":"Unknown","Summary":"Strange lights above Great Bend, KS"}