{"divs":["Sighting Details I did not note the exact day of the event.I may even be off by a year. It was around 1991 and was a warm clear night. A friend and I where laying on our backs on a trampoline in the back yard of a house in a suburban neighborhood. I noticed some small white objects flying directly over the trees to our left. I orignally mistook these objects as birds. I took a more interested look at the objects, as white birds in that area would be unusual. As I looked, these objects seemed to notice my friend and I as well. As the objects appeared to be following each other, the lead object flew directly overhead and stopped. The lead object was closely followed by 2 to 3 other objects and one straggler, about a second or two behind. Directly over our heads at that point were 4, maybe 5, white, circular shaped objects. I would guess them to be 1 to 2 feet in diameter. They may have been spherical, but our perspective did not allow for an accurate interpretation. They were approximately 15 to 20 feet above our heads. These objects had formed themselves in a circle (like ring around the rosy). They hovered for maybe another second or two before they starting moving, still following one another, in this circular shape they had formed. Within another second or two, they were moving at such a fast rate that there appeared to be a solid white circle hovering above us. They did this for another few seconds or more. Then they stopped in a very quick manner to the same circular shape that they had originally formed. As my friend and I looked on in disbelief, these objects took off to our right from a complete stand still to a rate of speed that was extraordinary. They were beyond our sight in what seemed to be less than a second. I have tried to rationalize what we saw that night and could not. What truly made these objects UFO's was the speed in which they could move, the exraordinary trick they seemed to do for our amusement, and the fact that during all this menuveuring they did not make one sound. They were completely silent. The objects did not seem to be illuminated, just white in color against the night sky. It was a very peaceful and pleasant experience and I felt a little proud to have witnessed it. I have told very few people of this incident over the years, simply because it is not something I would have believed myself have I not seen it with my own two eyes. Anyhow, that was my only ufo experience, yet one of the most interesting experiences of my life."],"Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=32.952209,+-96.72498(22064)&iwloc=A&hl=en\"> mufon case (22064) map </A>","trends":["There have been 10 other sightings in Richardson","There were no other sightings in Richardson on or around November 30th 1990"],"Source":"MUFON","Latitude":"32.952209","Longitude":"-96.72498","City":"Richardson","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Texas","Disposition":"Insufficient Data","Case Number":"22064","Summary":"4 to 5 white circular objects-small, fast, silent w/ unusual behavior","Sighting Duration":"Undisclosed","Date Submitted":"02/28/2010 08:43 UTC","files":["/var/www/straped/mufon/html2text/22064.html.txt","/var/www/straped/mufon/org/22064.html"],"Weather Factors":"None","Log Number":"US-02282010-0035","Object Shape":"Circle, Disc, Sphere","Tags":"City","Object Features":"Unknown","Country":"United States","Date of the Event":"11/30/1990 12:00 UTC"}