{"files":["/var/www/straped/mufon/html2text/22066.html.txt","/var/www/straped/mufon/org/22066.html"],"Date Submitted":"02/28/2010 11:04 UTC","Longitude":"-98.962561","Disposition":"Unknown","Sighting Duration":"00:10:00","Source":"MUFON","Tags":"City","Object Features":"Unknown","Weather Factors":"None","Latitude":"32.100884","Summary":"A Series of large bright circular lights appeared in the night sky and then disappeared without a trace","Region":"Texas","Object Flight Path":"Stationary","divs":["sighting detailsi was driving a hazardous material transport truck between cisco,tx. and rising star,tx. southbound on hwy 183.i noticed an extremely bright series of 3 lights in the sky.the lights werent moving or were moving very slowly.i passed a car that had apartly pulled over to view the sight and thought about pulling over myself.the shoulder was too narrow so i proceeded in a southerly direction toward the lights high in the southern sky.then an additional 6 lights came on and the lights covered at least 1\\4 mile of the sky.i turned my spot light on and shined it in the direction of the lights.the lights went out after a few minutes and the sky was dark with no signs of any aircraft or aircraft lights.i could see planes in the far distance but nothing in the immediate area.then the original first 3 lights reappeared for a few more minutes and went back out again.i was closer this time but still could see no signs of aircraft of any sort.the lights were very bright and impossible to not notice.there were 2 cars behind my truck and they were sure to have seen the sight as well as the folks that had pulled over.i studied the sky carefully.i have worked at night alot in my life.i have seen the space shuttle re-enter the atmosphere,space junk fall and catch fire,comets,meteors of all sorts,apache helicoptors with lights underneath,and passenger jets with landing lights on.these lights were quite unique in comparision to anything ive ever seen.the light they admitted was white and bright with no colors at all.i would love to get a look at the radar at 8:02 pm.it was several small craft or one very large one."],"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=32.100884,+-98.962561(22066)&iwloc=A&hl=en\"> mufon case (22066) map </A>","trends":["There have been 7 other sightings in Rising Star","There were no other sightings in Rising Star on or around February 25th 2010"],"City":"Rising Star","Log Number":"US-02282010-0037","Date of the Event":"02/25/2010 08:10 UTC","Country":"United States","Viewing Distance":"Over One Mile","Case Number":"22066"}