{"Log Number":"","Object Features":"Undisclosed","Object Shape":"Diamond","Weather Factors":"Unknown","Date Submitted":"03/30/2003 10:45 UTC","Disposition":"Unknown","Date of the Event":"03/30/2003 10:45 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.131455,+-76.765788(2206)&iwloc=A&hl=en\"> mufon case (2206) map </A>","Summary":"Unknown Object in the Sky","City":"South Butler","Longitude":"-76.765788","files":["/var/www/straped/mufon/html2text/2206.html.txt","/var/www/straped/mufon/org/2206.html"],"Latitude":"43.131455","Sighting Duration":"00:05:00","Country":"United States","Region":"New York","divs":["Sighting DetailsMy husband and I were out in the country heading to a store in a city. We weredriving along and happened to notice a ball shaped object in the sky blinkingred, green, yellow, purple and blue. We were mesmorized. So we stopped the truckand got out to look at it. Then we seen 2 more, of the same objects in differentplaces in the sky. We used binochulars but all we could make it is that theyappeared to be ball formed and the lights flashed different colors all the wayaround them. We werent sure what it was but we both know it was nothing we haveever seen before. So now that we are all excited about what we saw, we continueddriving down the road. I was continously watching the sky out my window and thefront window as we drove along. We got about 10 miles or so down the road andsuddenly this light thing appeared in the sky. It was extremely low to theground and headed right towards our truck, well over it anyway. So we jumped outonce again to see what this was. Thinking it may have been a plane or somethingflying really low. But as it came closer to us we noticed the light pattern onit was weird. It had 3 bright white lights in the front, in a straight line fromleft to right, and 3 bright lights in the back, in a straight line from left toright. Also it had red and green lights on the sides. It was nothing I have everseen before. It just flew over top our truck quickly and really low, but made nosound. My husband stated he could see right through it, as it was transparent. Ididnt take notice though as I was too intrigued with the lighting system on theobject. It just dissapeared into the night. I would really like some input onthis if you can offer any as I stated before, my husband nor I have never seenanything like we have seen tonight. Thanks..................Ira and Rebecca."],"Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"2206","trends":["There have been no other sightings in South Butler","This sighting has never been favorited."]}