{"trends":["There have been 18 other sightings in Novato","There was one other sighting in Novato on or around February 27th 2010"],"Country":"United States","Viewing Distance":"Unknown","Log Number":"US-02282010-0032","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/22061.html.txt","/var/www/straped/mufon/org/22061.html"],"Summary":"Beam of bright light in yard, projection of something blue white object high in sky","Date Submitted":"02/28/2010 08:04 UTC","Sighting Duration":"Undisclosed","Region":"California","Source":"MUFON","Longitude":"-122.565143","divs":["Sighting DetailsI was reading a book and got a little tired, so I turned off the light and was just relaxing in the dark looking out into our yard. Last night the moon was overhead and lit up my backyard like a spotlight. But suddenly I noticed, there was a definite separate beam of light about 3 feet across coming straight down in one part of my yard. The light beam ended up moving towards one of my windows then held there about 3 feet away from it. Our fruit tree in the backyard is covered in bright white flowers right now. First on the tree I saw what looked like a wave, that caught my eye, like when the heat is coming off the blacktop on a hot summer day. It obscured part of the flowers, but the other flowers and trees in yard were clearly seen. I have high end energy efficient silvered windows that block 99% of the UV so that was really weird. Then I saw 2 lights in the fruit tree. Little tiny like LED's bright white, reminded me of when you take a flashlight and see the cat eyes looking back in reflection only much brighter. The lights were about the distance apart that eyes would be. I noticed because I wear glasses and they projected some light and they reflected off my lenses. Then I saw what looked to be a projection on the white flowers on the fruit tree of a head and shoulders of a mottled brown and black reptile humanoid figure. It seemed to be mouthing words or something, no nose, reptile like folds where the nose would be, dark yellow eyes, it had a hand? with 3 claws one was bigger than the other 2, it motioned while speaking? Teeth too, little points, they were white so they stood out against the color of the mouth. I couldn't hear anything, words or sounds for that matter. We have a marsh nearby and right now the frogs are mating so it is loud. I didn't even hear that when this happened. After a few minutes the beam, image and eyes disappeared. I looked outside and saw an out of place blue, white star scintallating and then it disappeared. If that star was projecting something and it hit my window from that angle then it would have hit the spot right there on my fruit tree. Never saw that before."],"Weather Factors":"None","Object Flight Path":"Stationary","Latitude":"38.11692","Object Shape":"Star-like","Date of the Event":"02/27/2010 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.11692,+-122.565143(22061)&iwloc=A&hl=en\"> mufon case (22061) map </A>","Case Number":"22061","City":"Novato","Tags":"City","Object Features":"None"}