{"Viewing Distance":"501 Feet - 1 Mile","City":"Casco","Date of the Event":"02/20/2010 04:45 UTC","Weather Factors":"Unknown","Longitude":"-70.515498","Source":"MUFON","Tags":"City","trends":["There have been 3 other sightings in Casco","There were no other sightings in Casco on or around February 20th 2010"],"Summary":"Two light bulb size objects hovering then straight up then moving away together","Disposition":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsCame out of the house at approximately 4:45 to start by vehicle. I happen to look to my right across the lake and saw a bright light below the tree line. The object did not blink nor did it move or make a noise. I walked to the end of the deck as the light was unusual as there are no houses across the lake in this direction. I got to the end of the deck when I looked to my right and then saw a second light. Again, same height, same color, same size, no noise. I watched for a few seconds and then went into the house to prepare for work. About 5 minutes later I came out of the house not thinking about the lights, got into my vehicle and then proceeded down the driveway towards the water when I noticed the lights once again. This time the lights appeared to be moving so I stopped and got out of the vehicle. The two objects were now moving straight upward and were now above the tree line they remained the same distance from one another and at the same brightness. I watched until they came to a stop they were about 8 times the size of the stars in the sky. The sky was totally cloudless. At this point the object to my right seamed to move east while the second object appeared to be still. When the objects were in now a perpendicular position to the prior position they moved off in unison as if the first object was pulling the second. I watched for a few minutes until they disappeared beyond the hills and headed southeast towards Portland, Maine. Day 2 February 23rd. time 9:40 coming home from work pulled into the driveway and once again walked up to my door in total darkness. I always look up to the sky and to my amazement I once again saw what appeared to be the same two objects appear behind my house and pass over the lake and over the hills only this time heading in a more south direction. Same as before no sound, same size as before with the same brightness. I watched the two objects move in unison for about 3 minutes until they disappeared. I went into the house and went right to the computer and checked for other sightings and on the 19th of February a gentleman from Raymond Maine saw similar two objects. Just to add some additional information...I have had 2 previous unidentified experiences with one in particular that was investigated by Govt. and Military in 1969."],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Features":"Unknown","Latitude":"44.012207","Country":"United States","Date Submitted":"02/28/2010 08:20 UTC","Case Number":"22062","Region":"Maine","files":["/var/www/straped/mufon/html2text/22062.html.txt","/var/www/straped/mufon/org/22062.html"],"Object Shape":"Circle, Star-like","Log Number":"US-02282010-0033","map":"<A HREF = \"http://maps.google.com/maps?q=44.012207,+-70.515498(22062)&iwloc=A&hl=en\"> mufon case (22062) map </A>"}