{"Weather Factors":"None","Summary":"huge, black, triangle silently glided over us at very low altitude","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-97.133854","Source":"MUFON","Date of the Event":"Unknown","Country":"Canada","trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around"],"Object Features":"Other","Disposition":"Unresolved","Latitude":"49.903884","Region":"Manitoba","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was working the evening shift in Winnuipeg, Manitoba, Canada. On the last break approx 11pm roughly 30 of us were outside for our smoke break. It was a clear night with no clouds or wind. The building we worked in was behind us (to the south)and is a manufacturing facility for city buses, so the building is roughly the height of a 2 story building. This is located in a residential area. Unobstructed view looking west, north and east. As we were sitting there talking and joking directly above us came into view a huge black triangle shaped object moving from the south at a very slow speed. There was no sound at all coming from it. Being in a residential area at that time of night, the area was very quiet. This was in the suburb of Transcona which is at the edge of city limits. Also, that area is not an area for aircraft to fly over. I am a military aircraft enthusiast. this was NOT a military aircraft or civilian either. It was a few hundred feet across at the tips of the triangle. Some details on the bottom of the object were visible due to the street lights. Several red lights were visible on the bottom. It was roughly flat from what I could see. The shape and dimensions were made out because it blocked out the stars as it was a clear night. This was not a B-2 stealth bomber. I had seen B-2's on television and air-shows, this was deffinately not one of them. All of us were mezmerized by what we were seeing. No one had any idea what it was. No markings of any kind were seen. The sides were not visible from our vantage point. The altitude can only be guessed at being roughly 2000 feet or less. It was moving very slowly in a north or northwest direction. Speed was maybe 50km per hour, but could have been less. As it moved away from us, there was no sound at all. Unfortuneatly, our break was over before it went out of sight. Even a B-2 at low speed makes noise when it passes. I was completely mystified by what I was seeing. My mind was going in circles as to what it could be. Several days later I read in the Winnipeg Free Press about sightings of a triangle shaped object a week earlier taking place in a province to the west (either Alberta or Saskatchewan). This sighting would have been in the very 90's or early 2000's. Sorry I can not be more specific about the date. But that sighting is as fresh in my mind as if it happened yesterday. With all the shows about triangle shaped objects I felt I should finally tell you about my sighting. Again, I apologize for not reporting this sooner. I hope this information will be useful to you, and I hope to hear from you. I now live in Houston, Texas. Thank you."],"map":"<A HREF = \"http://maps.google.com/maps?q=49.903884,+-97.133854(22060)&iwloc=A&hl=en\"> mufon case (22060) map </A>","Case Number":"22060","City":"Winnipeg","files":["/var/www/straped/mufon/html2text/22060.html.txt","/var/www/straped/mufon/org/22060.html"],"Date Submitted":"02/28/2010 07:47 UTC","Object Flight Path":"Straight-line path","Log Number":"CA-02282010-0031","Object Shape":"Triangle"}