{"Weather Factors":"Unknown","Object Features":"None","Disposition":"Unknown","Longitude":"-81.90647","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path","Date of the Event":"02/28/2010 07:00 UTC","trends":["There have been no other sightings in Fruitland Park","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet","Object Shape":"Bullet, Missile, Saturn-like, Star-like","Region":"Florida","Country":"United States","Log Number":"US-03012010-0010","City":"Fruitland Park","Date Submitted":"03/01/2010 04:04 UTC","Summary":"several strange objects","map":"<A HREF = \"http://maps.google.com/maps?q=28.861376,+-81.90647(22076)&iwloc=A&hl=en\"> mufon case (22076) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22076.html.txt","/var/www/straped/mufon/org/22076.html"],"Tags":"City","Case Number":"22076","divs":["Sighting DetailsLast night as my wife and I were standing on the back stairs smoking , we both witnesses a glowing object come from left to right,high in the sky over are house. The object traveled was very bright and very abruptly stopped and shot almost completely straight up out of sight. Within a few seconds of its disappearance, we both witnessed a helicopter with a search light in the area of about were we seen it disappear. After about 20 minutes, the helicopter left. Now, also over the past month or , both my wife and I together and alone, have witnessed several bright orange balls of light in the horizon at the front of our home that all suddenly disappear. One ,we watched for approximately 30 minutes and as it passed over relatively close to our position. It was round, large and had several multi colored light on it. I live near a private airstrip , a municipal airport and 2 military installations , aircraft passing over are home is nothing new to use and we have learned to distinguish between stars , airplanes helicopters and what not. None of these things we have seen even come close to resembling any of the normal aircraft we come across out here"],"Latitude":"28.861376"}