{"Date Submitted":"03/01/2010 06:12 UTC","Case Number":"22079","Log Number":"US-03012010-0013","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=48.717057,+-122.205158(22079)&iwloc=A&hl=en\"> mufon case (22079) map </A>","Object Features":"Undisclosed","Latitude":"48.717057","Object Shape":"Star-like","Disposition":"Insufficient Data","trends":["There have been no other sightings in Acme","This sighting has been favorited 1 time."],"Tags":"City","Longitude":"-122.205158","Date of the Event":"04/17/2006 12:00 UTC","Country":"United States","divs":["Sighting DetailsIn the spring of 2006 I lived in Acme, Washington. One night while looking at the night sky I watched what appeared to be a single airplane light whose path of travel was heading east and just above my house. There was no airplane engine or jet sound, just silence. The sky is so dark and clear at times in Washington that I often look at stars etc. The light was at airplane height as I watched it anticipating nothing. Then - and this might be coincidental - just as the light passed overhead it expanded to 30 to 50 times the area. It did not shoot down like a search light. It just expanded in a contained area. What I mean is....it appeared to be contained, it didn't have a fuzy edge, it just glowed. The light continued at the same pace as it passed overhead. After passing, it reduced to the smaller airplane light size and stayed its course until I lost sight of it. (It didn't travel very fast and was not exceptionally slow.) The UFO part of this is the whole silent large contained light, and the fact that I felt as though it was looking at me. Was it looking at me? I don't know. It just traveled its straight path east, and I never saw anything like it again."],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","City":"Acme","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22079.html.txt","/var/www/straped/mufon/org/22079.html"],"Region":"Washington","Sighting Duration":"Undisclosed","Summary":"A single light that appeared tp be an airplane light expanded to Times 30 to 50"}