{"City":"London","Date Submitted":"03/01/2010 10:00 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around February 27th 2010","This sighting has never been favorited.",""],"Disposition":"Unresolved","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.509969,+-0.126495(22070)&iwloc=A&hl=en\"> mufon case (22070) map </A>","Longitude":"-0.126495","Case Number":"22070","Date of the Event":"02/27/2010 11:00 UTC","files":["/var/www/straped/mufon/html2text/22070.html.txt","/var/www/straped/mufon/org/22070.html"],"Object Shape":"Circle","Latitude":"51.509969","Tags":"City","Weather Factors":"Unknown","Log Number":"GB-03012010-0004","divs":["Sighting DetailsI was standing on my back door step, smoking a cigarette when I saw 1 perfectly round, deep red light coming towards me overhead. At first I thought it may be the safety light that you see commonly on commercial aircraft but as it came closer I realised that the light was perfectly round and bright and was not flashing at all. Within 30 or so seconds another one appeared behind it, following the exact same flight path as the first. There were 8 in total that I witnessed within the next ten minutes. They seemed to be flying in pairs and each pair followed 2 definate indentical paths. One pair would come toward me and take a smooth curve off to my left. The next pair would curve off to my right. They had a sound coming from them that I have never heard from an aircraft before. The best way I can describe it is to say that it reminded me of a 2-tone car alarm siren coming from approximately 1-2 miles away. I did think that was what I was actually hearing but this sound was in perfect timing with the craft being overhead. This sound would disappear as soon as the craft were out of sight and then reappear as soon as the next pair came into sight over the horizon. They were perfectly smooth in their flight and were travelling at what I would say was a slighty slower speed than normal commercial passenger aircraft. The overhead height was approximately what you would expect of a aircraft being on it's landing path, maybe 30 minutes from landing. I could see no bodywork at all as you would on an aircraft, just a very bright red circular light. I have uploaded 2 mp4 videos taken from my cellphone. The craft appear unsteady when in fact they moved perfectly smoothly. I am afraid I could not get my camera very still. If you turn up the volume very high 3 minutes into the first clip, you will be able to hear the 2-tone sound that was eminating from them. This sound was in fact much louder in reality and was the same volume and duration for each craft but the phone just couldnt quite pick it up well enough. I'm not sure why this sound was only picked up for a short time. Also, it appears that I was filming just 1 craft when in fact I was trying to switch from one craft to another. I had trouble getting the pairs into one shot but if you observe closely at 18 seconds into the second clip, you will see 2 crafts in the same shot. All 4 pairs travelled in this manner. Feel free to contact me via my supplied email. Kind regards, Paul"],"Source":"MUFON","Sighting Duration":"00:10:00","Country":"United Kingdom","Summary":"Bright red lights","Region":"England"}