{"Country":"Italy","Date of the Event":"03/01/2010 12:00 UTC","Longitude":"11.346518","map":"<A HREF = \"http://maps.google.com/maps?q=44.49419,+11.346518(22071)&iwloc=A&hl=en\"> mufon case (22071) map </A>","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"22071","Viewing Distance":"Unknown","Region":"Emilia-Romagna","Latitude":"44.49419","Summary":"12 object likes moving star in the blue sky","City":"Bologna","Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting Detailsbetween 12.30 and 1.30 PM, i finished my physic's lesson at bologna's university. coming home, casually i loked on the sky, and i see for first four little light points, looks like stars, in movement. ten minuts later, at home, while i was telling the event to my roomate, looking outside the window we saw another 3 light point, and when they pass our visual field, another 3 coming from the same point to the same direction. the moviment was slowly, the first 3 go from west to est, and in a point, they turned nord, the following 3 make the same direction of the 3 before. after this 6 light points, another 2 was came from the same point of the others, but one of this 2 went from west to east, and the other one turn south. for the first time, i thinking they was satellites, but is impossible have in the sky 12 satellites in the same moment and everyone without fixed routes, in relation of the movement, is also clear that this points don't followed the wind, absent on the ground. we maked some picture but only 3 of these are clear. In particular, zooming the third picture, it looks like a donut, and this this phenomenon is very similar to many other pictures and videos that i watch on youtube."],"trends":["There have been no other sightings in Bologna","This sighting has been favorited 1 time."],"Object Shape":"Circle, Disc, Flash, Star-like","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"IT-03012010-0005","files":["/var/www/straped/mufon/html2text/22071.html.txt","/var/www/straped/mufon/more/22071_submitter_file1__DSC01419.JPG","/var/www/straped/mufon/more/22071_submitter_file2__DSC01420.JPG","/var/www/straped/mufon/more/22071_submitter_file3__DSC01421.JPG","/var/www/straped/mufon/org/22071.html"],"Date Submitted":"03/01/2010 11:38 UTC"}