{"Viewing Distance":"20 Feet or Less","divs":["Sighting Detailsmy brother in law and i was raccoon hunting behind my parents house saw a light shining down just thought it was the moon as we walked back toward the house i felt like we were being followed we turned and this strange object was hovering just above the cornfield it had a large round bright light on the front of it knowing no one would believe me i walked up to it as close as possible walked half way around it to make sure i was seeing what i saw!it was a weird blue metalic like color round on the bottom and top was like a roundish type dome i was close enough to touch if i chose to,the strange thing is that we sat down in front of the barn n looked up as if we were seeing it for the first time like a memory gap! then it slowly drifted back into the woods we went to the house to tell otheres we ran out side and a bright light flashed strait up into the sky from the woods my mom called the neighbors to see if they saw anything the neighbor said they didnt see any thing but that her husband went blind 5 minutes earlier? i was about 22 yrs old at the time i was home on leave from the navy my brother in law has since taken his life! years later i answered an ad for anyone with ufo experiences so i wrote n told them my story a few weeks later the perspon who had the ad was a reverend so the ad said any way i got a letter back from a woman who wrote and said since the reverand recived my letter he became very ill and could not respond she also said a black cloud was hovering over my head? i know this sounds very strange but it is very true! i am willing to take a polygraph exam or hypnosis to prove it if u so choose to do so.please feel free to contact me my email is ogerr51@yahoo.com thank you for allowing to tell my story. respectfully David W.Oliver"],"Disposition":"Unresolved","Latitude":"42.280801","Date Submitted":"03/01/2010 01:22 UTC","City":"Rockford","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.280801,+-89.088095(22073)&iwloc=A&hl=en\"> mufon case (22073) map </A>","Object Shape":"Circle, Disc","Object Features":"Dome, Other","Log Number":"US-03012010-0007","files":["/var/www/straped/mufon/html2text/22073.html.txt","/var/www/straped/mufon/org/22073.html"],"Date of the Event":"10/20/1976 12:00 UTC","Object Flight Path":"Path then hovering","Summary":"Was hunting was followed from wooded area.","Country":"United States","Region":"Illinois","Case Number":"22073","Weather Factors":"Unknown","Sighting Duration":"08:10:17","Longitude":"-89.088095","Source":"MUFON","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around October 20th 1976"]}