{"Region":"California","trends":["There have been 17 other sightings in Leggett","There were no other sightings in Leggett on or around February 28th 2010"],"City":"Leggett","Source":"MUFON","Latitude":"39.872664","Sighting Duration":"Undisclosed","Disposition":"Unknown","Longitude":"-123.712938","files":["/var/www/straped/mufon/html2text/22086.html.txt","/var/www/straped/mufon/org/22086.html"],"Date Submitted":"03/02/2010 02:03 UTC","divs":["Sighting DetailsOn Feruary 28th 2010 I was sitting across from my aunt Paula at her kitchen table it was approxamitly midnight and she was describing her UFO experiences to me. I looked up to answer a question she had asked me when I saw a very bright white beam of light come down through the ceiling and flash behind her. The beam was about the size of a tennis ball and had a few jagged edges. The only thing I can compare it to is a lightning bolt. At first I didnt say anything but it was so extraordinary I had to tell her. She went on to tell me about a recording of crop circle tones she had, she played them for me and we decided to take a drive. Before we left I said out loud \"I am totally open and I hope you will show yourself to me.\" We got into her car, put the crop circle tones on the radio and drove to the highest point on the mountain where she lives. We pulled into a turnout, turned the engine off and started casually talking, I was so into the conversation we were having that I didnt really expect to see anything. Within a few minutes I saw the same beam of light shoot down from the sky into her window and illuminate the front of her shirt.It was a very foggy night and we coulnt see anything around us. It was like a white sheet surrounded the car. A few seconds later The beam came down again in the same spot. We looked at each other and said WOW did you see that! We sat in that spot for a few more minutes before we decided to move a little further down the road. As soon as we moved and turned the car off the beam came down again right outside the drivers side window. We decided to slowly keep moving down the road and every time we moved and turned the car off the beam would come down into the drivers side of the car. I was a little anxious before we left the house because I didnt know what to expect, but when I saw the beams of light a calm feeling came over me. My aunt and I think that us seeing the lights was a show of approval for the experieces she had shared with me earlier in the night."],"Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Features":"Undisclosed","Weather Factors":"None","Object Shape":"Unknown","Tags":"City","Summary":"Beam of light:","Country":"United States","Log Number":"US-03022010-0002","Case Number":"22086","Date of the Event":"02/28/2010 11:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.872664,+-123.712938(22086)&iwloc=A&hl=en\"> mufon case (22086) map </A>"}