{"Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22083.html.txt","/var/www/straped/mufon/more/22083_submitter_file3__ufo6.jpg","/var/www/straped/mufon/org/22083.html"],"Log Number":"US-03012010-0017","Summary":"Two very fast moving UFO's cought on high end surveillance camera.","Latitude":"41.520961","Date of the Event":"04/03/2008 10:58 UTC","Disposition":"Unknown","Case Number":"22083","Date Submitted":"03/01/2010 10:22 UTC","Object Shape":"Triangle","trends":["There have been no other sightings in Frankfort Township","This sighting has never been favorited."],"divs":["sighting detailsto start with i build & install dvr surveillance systems and this was caught on one of my very high end bosch true ir camera. i was on the phone with a customer giving him a live view of the cameras showing how they worked. this camera is on a pan\\tilt 360 mount, so i was moving the camera all over to show him how it worked. we started to talk again and i had left the camera aiming up towards the southern sky. then him and i both saw it fly through the shot and i told him it was probability a bird. so i took the chance to show him the on-line replay.when looking back i new at once it was some sort of ufo, but not just one....in playback i saw there was two and very clear. i also analyze video for customers and police so i'm very good at it. i worked on it for hours and they appear to be two triangle crafts moving very fast from west to east. what the real clincher for me was is that the top craft went in and out of the clouds, proving the where not a illusion or something on the lens. it happened so fast there where really no feeling at the time, but when i played it back i just about had a heart attack because i new what it was at once without a doubt. i left the camera aimed at that same place for about a week, and they never them fly by again."],"Longitude":"-87.835328","Object Features":"Unknown","Region":"Illinois","City":"Frankfort Township","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.520961,+-87.835328(22083)&iwloc=A&hl=en\"> mufon case (22083) map </A>","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path"}