{"Object Shape":"Triangle","Longitude":"-81.096582","Country":"Canada","Log Number":"","Summary":"Black Triangle","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.302723,+-81.096582(2208)&iwloc=A&hl=en\"> mufon case (2208) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsI had just returned home from drawing class. I pulled up the laneway we live on100-acre farm, got out, and looked up at the clear night sky, admiring the view.While so entranced, I made a prayer, as is my custom in such moments, for peace,interstellar togetherness, love and that sort of thing.Then, scanning the sky, I came across a black triangle directly overhead, movingquite slowly, and silently, towards the southeast. This is about 6km NW ofChesley, ON, for which I gave the coordinates above. I watched it pass in frontof stars and temporarily block them from view. It had a small white, maybeblue-tinged light at each corner, and had a scalene shape, that is, if it was anisosceles triangle, it seemed to be slightly on edge, tilted to one side. It wasclose to the width and length of my thumb at arms length. Actual size wasimpossible to determine, as there was no texture or point of reference. It movedalong and after about 4 minutes became too hard to see, so I went inside . Itwas cold out.This is not my first sighting of unusual craft, having previously seen an orangesphere May 1997 in North Bay, ON--multiple witnesses and a white light thatturned red and raced away at high speeds winter 2000-2001, in Elmwood, ON, bymyself. Keep doing what you do. I love reading the monthly updates. One Love."],"Sighting Duration":"00:05:00","City":"Chesley","Case Number":"2208","Date of the Event":"03/31/2003 09:27 UTC","trends":["There have been no other sightings in Chesley","This sighting has never been favorited."],"Disposition":"Unresolved","Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"44.302723","Region":"Ontario","files":["/var/www/straped/mufon/html2text/2208.html.txt","/var/www/straped/mufon/org/2208.html"],"Date Submitted":"03/31/2003 09:27 UTC","Viewing Distance":"501 Feet - 1 Mile"}