{"Country":"United States","Date of the Event":"03/01/2010 09:28 UTC","Log Number":"US-03022010-0010","files":["/var/www/straped/mufon/html2text/22094.html.txt","/var/www/straped/mufon/org/22094.html"],"trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around March 1st 2010"],"City":"Mesa","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.418364,+-111.822142(22094)&iwloc=A&hl=en\"> mufon case (22094) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Latitude":"33.418364","Case Number":"22094","Weather Factors":"None","Summary":"Green light dropping from sky and disappeared","Region":"Arizona","Longitude":"-111.822142","Object Features":"Unknown","divs":["Sighting DetailsI was out walking my two dogs. I went to go and grab a free newspaper to do some clean up dog duty... When I turned around and looked at the moon i saw to the left of the moon a neon green light in the sky. The light was falling down quickly and then disappeared. There were very few clouds in the sky and a full moon was present. The light was at ~ 45 degrees in the sky. I stayed and watched the sky for about 15 minutes longer, but saw nothing. At first I thought it was one of those lights that car dealers shine in the sky to attract customers, but I saw nothing after the one appearance (the light was more like a ball and not a laser or light from a directs source). I am thinking it might have been a meteor?? I was excited when I saw it and kind of freaked out.... my first reaction was to run home and get my camera but I was afraid I would miss it if it appeared again! Also wondered how on earth people do get photos of this stuff since it happened so quickly!! I wanted to call people and tell them! After staring at the sky for about 15 minutes, I decided to walk over towards the direction where I saw the light. I didn't see anything else noteworthy for the rest of the evening. Wondering what it was!"],"Object Shape":"Circle","Date Submitted":"03/02/2010 02:57 UTC"}