{"Weather Factors":"None","divs":["Sighting DetailsEarly February 2010, 8pm, in the eastern sky just above the horizon of Riverside County, California my attention was drawn to what appeared to be an intense flashing light. I grabbed some inexpensive binoculars and focused them on the light. While viewing what appeared to have been one blinking light now became something else. I'll try to create a picture: In the binoculars the light jumped around in measurements of great distances or there was more than one light. For comparison purposes I'll use tis analogy: When I look at an airplane in the binoculars the blinking lights move back and forth about a 16th to 8th inch increments. The lights of this object, however, jumped back and forth randomly or it was following the frame-work of a triangle, I'm not sure. It didn't jump point to point but anywhere within the lines of the triangle. The spacing was within the distance of the two inch binocular forward glass. Without knowing the distance of the object, but within the magnification of the glasses (an airplane light jumps a 16th inch or so) these lights or the light was jumping two inches or slightly more, randomly possibly within a shape. It was difficult to believe what I saw so later I tested the visual by viewing several airplanes, trying to duplicate the distance of the jumping lights. The airplane lights at many distances remained the same, i.e. within that tight 16th to 8th inch measurement. To condense what I saw is this: with the naked eye I saw a single light that had an unusual snap to it. It grabbed my attention. I looked at it with binoculars and the one tight area blinking light became many randomly moving lights with movements that suggested hugh distances in a frame-work. It lasted minutes until it disappeared from view. I'm assuming that it was moving away from me, but the object or light(s) was so far away that I could not detect its apparently eastward slightly southern movement as it disappeared."],"Country":"United States","Object Shape":"Triangle, Other, Unknown","Object Flight Path":"Straight-line path","Log Number":"US-03022010-0007","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=36.785831,+-119.414512(22091)&iwloc=A&hl=en\"> mufon case (22091) map </A>","Case Number":"22091","Viewing Distance":"Unknown","Date of the Event":"02/01/2010 12:00 UTC","Source":"MUFON","Tags":"City","Date Submitted":"03/02/2010 01:52 UTC","City":"Undisclosed","trends":[],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/22091.html.txt","/var/www/straped/mufon/org/22091.html"],"Region":"California","Disposition":"IFO","Summary":"In the distance I saw a single light with an elevated intensity and snap to it. Through binoculars it was multiple lights or moving within a frame-work.","Latitude":"36.785831","Longitude":"-119.414512"}