{"Disposition":"IFO","Case Number":"22101","Object Shape":"Flash, Other, Unknown","Date Submitted":"03/03/2010 12:52 UTC","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around February 28th 2010"],"Summary":"same strange beam of light as in \"Beams of light:22067\" report!","Viewing Distance":"20 Feet or Less, 21-100 Feet, Unknown","Object Flight Path":"Stationary,Unknown","Tags":"City","Weather Factors":"None","divs":["Sighting Detailsi was looking at the night sky through my kitchen window, since we've been having what looks to be Northern Lights the past few nights, which is strange in itself. all the house were lights off, since i was about to go to bed. suddenly a light came on from DIRECTLY ABOVE my window, from OUTSIDE of my one story home. It just blinked on, with no sound, or anything else. there was no movement (like a helicopter passing over, etc) and it was silent. it was a quiet night outside, no traffic or noise, or random lights. our yard lights were turned off, and none of them are near the window, anyway. at first, i thought it was a neighbor's lights, but when i pulled the curtain back to look, there were none on, which gave me a chill. it was so creepy. it really caught me off guard and scared me a little. one minute im quietly looking out a dark window and the next minute a light \"turns on\" straight above my window, lighting up my window, me, and half my kitchen. like someone pointing a light at you. it was a grayish white light, similar to an multi-LED flashlight, it wasnt harsh or extremely bright, it sort of \"glowed.\" it was a perfect column of light, lighting up the window, and me. it was like nothing i'd ever seen before. i stood there for a few minutes, trying to figure it out, but not at all brave enough to go outside. just as i had finally decided to go wake my roommate to show her what was happening, just as soon as i stepped away and turned to leave the room, it silently blinked off. it had felt like it was in the house with me. imagine sitting in the dark in your house and suddenly someone turns on a spotlight a couple feet above your head. it was very unnerving. when i read the report from the same date and almost same time, i got chills. i thought i should file a report. ive seen several ufo's and strange things in the sky here, theres airports and govt bases in every direction, and a huge expanse of land with govt and private sites up in the fremont hills. lockheed-martin, nasa, and lawrence-livermore labs all have facilities not far from here, as well. this was definitely a new experience, one i'd rather not have again."],"Sighting Duration":"00:12:00","files":["/var/www/straped/mufon/html2text/22101.html.txt","/var/www/straped/mufon/org/22101.html"],"Country":"United States","Date of the Event":"02/28/2010 11:00 UTC","Source":"MUFON","City":"Fremont","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.5527,+-121.985372(22101)&iwloc=A&hl=en\"> mufon case (22101) map </A>","Latitude":"37.5527","Longitude":"-121.985372","Object Features":"Unknown","Log Number":"US-03032010-0002"}