{"City":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unresolved","Log Number":"US-03032010-0008","trends":[""],"divs":["Sighting DetailsI dont know how to start but all i know is that since my husband was hospitalize i have seen them and they continue coming and coming to me. I have video taped this every night since i wanted to show my self and everyone else that i am not going crazy or seeing things. They hover over my house and i have even had one close enough to me to the point that i saw what it looked like since it stared at me as it went passed the front of my face. I have emailed many people especially Dr. Steven Greer but i dont seem to get a response. I dont know what or who to tell anymore. And as days go by they get close and closer and show more. I can hear them coming and if i ignore it i feel sick like flue symptoms. All i know is that many of them hover and do shapes over my house as if they want me to see them or they are trying tell me something. I need to get someones attention since my husband says im going crazy and its just my imagination. I feel like if they are preparing for something and i just dont know what it is. I even see them around places Camouflaging. All i know is that they know is that they know that i see them and they let me record them when ever they are not hovering and just Camouflaging. I thought about calling the media and showing them all of the videos that i record day and night. I even had my husband get me a telescope to see what it is see every night. You are my last hope. If i dont hear or get anyone's attention i might just delete everything i have since its driving insane. I wont attach any videos since i dont know who to even trust anymore. I will attach a picture that i took of my computer as i slowed down the video to see it closer."],"Object Features":"Undisclosed","Case Number":"22107","Summary":"They come every day and night.","Weather Factors":"Unknown","Latitude":"38.80843","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22107.html.txt","/var/www/straped/mufon/more/22107_submitter_file1__pic6.jpg","/var/www/straped/mufon/more/22107_submitter_file2__pic9.jpg","/var/www/straped/mufon/more/22107_submitter_file3__pic12.jpg","/var/www/straped/mufon/org/22107.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.80843,+-116.414129(22107)&iwloc=A&hl=en\"> mufon case (22107) map </A>","Object Shape":"Boomerang, Bullet, Missile, Cone, Circle, Cross, Cylinder, Diamond, Fireball, Flash, Oval, Saturn-like, Sphere, Star-like, Other, Unknown","Region":"Nevada","Longitude":"-116.414129","Tags":"City","Date of the Event":"01/23/2010 12:00 UTC","Source":"MUFON","Date Submitted":"03/03/2010 01:50 UTC"}