{"map":"<A HREF = \"http://maps.google.com/maps?q=35.141475,+-91.78625(22109)&iwloc=A&hl=en\"> mufon case (22109) map </A>","Weather Factors":"None","Date of the Event":"10/05/2008 09:00 UTC","Log Number":"US-03032010-0010","Summary":"6 large spheres on a country backroad.","Object Features":"Unknown","Case Number":"22109","City":"Garner","Source":"MUFON","Longitude":"-91.78625","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsAround the approx. the date above my ex,her mother,and I were head back to their house. They had for a long time told me about strange lights in the sky and the weirder part was the ones they saw hovering in the fields. So that night headed towards their place we spotted six large spheres in the sky. I know planes cause they fly over my house every day for the last 27 yrs Ive been alive. The lights were yellow and they were not blinking. I decided to speed up and get underneth it. As I excelerated I started flashing my headlights at it. After the third time doing that the lights lite up really bright and started heading downwards at an angle to wards us. I knew it was to big to get past the tree along the side of the road. I sped up more hoping to get to quick. At the S type curve up a head I could tell it was no more than 20 or 30 feet off the ground. As I got to the break where the woods meet the feilds it turned a 90 degree turn to its left. I made it to the break after it changed course within 4 to 5 seconds. There was nothing. It was a clear night all the stars were out and it was gone. I turned my car off and got out and walked up the road and nothing....it was gone. This has not been my first sighting. I have had others. Never had a camera to shoot them with. But I have witnesses to these sightings and would like to try and get some footage. Im not one easily spooked and in my mind I have my own theory of what a ufo could be. But excited is what I felt. I dont know if we will ever know what or who they are but if you want to know more you can contact me."],"Tags":"City","Latitude":"35.141475","trends":["There have been no other sightings in Garner","This sighting has never been favorited."],"Country":"United States","Region":"Arkansas","Object Shape":"Other","Date Submitted":"03/03/2010 06:58 UTC","files":["/var/www/straped/mufon/html2text/22109.html.txt","/var/www/straped/mufon/org/22109.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Disposition":"Unknown","Sighting Duration":"Undisclosed"}