{"Country":"United States","Source":"MUFON","Log Number":"US-03032010-0004","Case Number":"22103","Region":"Ohio","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/22103.html.txt","/var/www/straped/mufon/org/22103.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.696184,+-84.163977(22103)&iwloc=A&hl=en\"> mufon case (22103) map </A>","City":"Kettering","Date of the Event":"03/01/2010 02:04 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"03/03/2010 03:04 UTC","Tags":"City","Sighting Duration":"00:02:00","Longitude":"-84.163977","Summary":"Black circle","divs":["Sighting DetailsI was with my girlfriend doing things irrelevant to this story when I got out of the car to stretch. The sky was dark, of course seeing as it was in the middle of the night. As I was pacing I suddenly noticed a strange lack of noise. It felt like everything just kind of stopped. The I heard a very high pitched sound and looked up. While the sky was dark, a VERY large circle that was darker than the sky and contrasted well was just above me. It was perfectly still, as though it was a fixture in the sky. When my eyes focused and I fully recognized there was certainly an object above me, I couldn't look away. My girlfriend peeked out and was just as speechless as myself. I was still focused on the object when suddenly it felt like all the air just got sucked out of me. I stumbled and then sat down and the object just went up. I can't describe it any other way, it either got smaller or went straight up. Then it was just gone. I don't know what I do or don't believe, I just know what I saw. My girlfriend just cried and refused to discuss it. I was more confused than anything. I don't drink or do drugs. I still am completely baffled."],"Object Shape":"Circle","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Kettering","There were no other sightings in Kettering on or around March 1st 2010"],"Latitude":"39.696184","Object Flight Path":"Undisclosed"}