{"Case Number":"22104","Latitude":"29.428472","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around March 2nd 2010"],"Region":"Texas","Object Flight Path":"Stationary","Source":"MUFON","Object Shape":"Saturn-like, Star-like","Tags":"City","Object Features":"Other","divs":["Sighting DetailsAfter dropping my son off at school, I was driving home on the acceses road of 410 heading east when I a bright object in the sky caught my attention. The object I thought might be a star but I questioned how could it be so bright with the 7:30 sun shining? I was captivated and stunned. I starred to at it to try and figure if this obect had it's own light source or if the sun was reflecting from it. The objest did not seem to move as I was looking at it. It may have had motion but would have been difficult for me to see since it was so high up and I was driving. Had I been still, I may or may not have seen it in motion. As I was looking into the sky, I had nearly forgoten that the road (I'm all too familiar with), merges into one lane. From my periphrial vision, I notice the car in the next lane and I nearly collide. I swerve to avoid hitting and the driver slows down to let me get ahead. I re-adjust my vehicle on the road and look back to scan the sky. It's been about 5 seconds since I took my eyes away from the object and it's gone. I figure since I'm in motion, perhaps I maybe mistaken the location of the object in sky. I quickly turn into a nieghborhood just off of the access road and drove back west then drove back onto the access road in an effort to study the sky from the position I had been in just one minute prior. I still saw nothing. I'm baffled. By the way, not one cloud in the sky. I tried to come up with an explination but can't. I've never seen a plane move in a way that it could be out of sight in 5 seconds and a star that bight would need more time to not be visible in the sky. I really don't know what to make of it."],"Log Number":"US-03032010-0005","files":["/var/www/straped/mufon/html2text/22104.html.txt","/var/www/straped/mufon/org/22104.html"],"Summary":"Bright star-like light during the day vanishes","Date of the Event":"03/02/2010 07:32 UTC","Date Submitted":"03/03/2010 04:07 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"01:00:00","Country":"United States","City":"San Antonio","Longitude":"-98.488928","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.428472,+-98.488928(22104)&iwloc=A&hl=en\"> mufon case (22104) map </A>","Disposition":"IFO"}