{"Object Flight Path":"Unknown","Region":"North Carolina","Country":"United States","Viewing Distance":"Over One Mile","Tags":"City","Object Features":"Unknown","Object Shape":"Egg","Longitude":"-78.26778","Latitude":"34.0175","Weather Factors":"Windy","map":"<A HREF = \"http://maps.google.com/maps?q=34.0175,+-78.26778(22115)&iwloc=A&hl=en\"> mufon case (22115) map </A>","Disposition":"IFO","Sighting Duration":"00:01:25","files":["/var/www/straped/mufon/html2text/22115.html.txt","/var/www/straped/mufon/more/22115_submitter_file1__015.JPG","/var/www/straped/mufon/more/22115_submitter_file2__023.JPG","/var/www/straped/mufon/more/22115_submitter_file3__024.JPG","/var/www/straped/mufon/org/22115.html"],"Log Number":"US-03032010-0016","Date Submitted":"03/03/2010 10:09 UTC","Date of the Event":"08/25/2009 11:36 UTC","Summary":"Multiple objects caught in photographs, with each at different locations.","Case Number":"22115","divs":["Sighting DetailsStanding on porch second story of our rented beach house, I was taking photos of the beach, surf and scenery. As I was shooting the photos with the camera when I noticed the objects in the sky with the sight glass view finder. I lowered the camera to look at them with my naked eyes to confirm the anomaly was in fact there. The bright surfaces had alerted my attention to them. I thought at first they could be weather balloons or aircraft perhaps. I have in the past did find one weather balloon washed up on shore, However these objects were not moving at all in the stiff ocean wind, they were stationary. I snapped several pictures before they vanished from both the camera an my sight. The objects seem to just vanish with no trace. At the moment I was taking pictures in that direction, it seemed that no one else saw them. I only observed them mere seconds and they were gone. I felt as if it could have been a explained somehow, and I am not one to jump to the idea that it was other worldly i.e. the UFO Theory. However I still do not know what the objects in the photos are, and still do not."],"City":"Supply","trends":["There has been one other sighting in Supply","There were no other sightings in Supply on or around August 25th 2009","This sighting has never been favorited.",""],"Source":"MUFON"}