{"trends":["There have been 4 other sightings in Conway","There were no other sightings in Conway on or around April 30th 2009"],"Date of the Event":"04/30/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/22118.html.txt","/var/www/straped/mufon/org/22118.html"],"divs":["Sighting DetailsA friend of mine reported to me that he and several friends went to witness something that others had previously seen or experienced. The location was in Georgetown or Conway, SC or somewhere in the vacinity. I'm sure if he was interviewed by a professional, he could help narrow down the location. His story goes as follows: He and 3 friends went to a location where they had heard that a phenomenon has occurred for others. According to him (His name is Luke and has said he'd be willing to repeat this to a professional investigator.) According to Luke, upon going down a dirt road, and 'orb' (my word, not his) approached them. He said it may have been 4 feet across, but first appeared as a small blip of light. He and his friends had 3 video recorders going in anticipation of something happening because of local lore. He said they later \"woke up\" several hours later on the road to Myrtle Beach where they were staying with no recollection of what happened from the time they saw the ball of light until then. Also, hours of video were missing from the 3 cameras they had. He further states that the next day he had a foreign object in his hand that his doctor later explained to be from heated aspartame in a diet cola that he ingested. Several things struck me from this story: 1. Lost time 2. Lost video 3. An unexplained object that raced toward them. 4. A foreign object in him the next day which he claims is still there. 5. He says at least one other member of his party has an object in them from this. 6. He described it as an orb, though 'orb' was my word, not his, he said it was a \"ball of light\" He says locals have reported similar expriences, which is why they went down this road with video cameras rolling. He says he'd be willing to interview with a MUFON investigator. I told him that he should, because they could ask questions in a professional manner. I should be able to set up an interview with him if someone wants to follow up on this. I believe his story to be true. He did not volunteer the info about something being lodged in his hand until after I told him that it was not uncommon for something like that to happen to people who have had experiences like this. He claims to have never heard of MUFON. I have never had an experience like this, but have seen enough documentary evidence to believe that this bears following up by someone who is trained to document this. Let me repeat: I believe he has some unexplained encounter. If you want to set up an interview, contact me at the email address above. Randy G."],"Object Features":"Undisclosed","Latitude":"33.838203","Region":"South Carolina","Log Number":"US-03042010-0001","Weather Factors":"Unknown","Date Submitted":"03/04/2010 02:06 UTC","Longitude":"-79.045624","Source":"MUFON","Viewing Distance":"Unknown","City":"Conway","Case Number":"22118","Object Flight Path":"Undisclosed","Country":"United States","Tags":"City","Summary":"Orb approached them, time lost, hours of video lost on 3 cameras.","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=33.838203,+-79.045624(22118)&iwloc=A&hl=en\"> mufon case (22118) map </A>","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed"}