{"Date of the Event":"03/03/2010 07:44 UTC","Longitude":"-79.928395","map":"<A HREF = \"http://maps.google.com/maps?q=39.629526,+-79.928395(22110)&iwloc=A&hl=en\"> mufon case (22110) map </A>","Case Number":"22110","Source":"MUFON","Disposition":"Insufficient Data","City":"Morgantown","Country":"United States","trends":["There have been 8 other sightings in Morgantown","There were no other sightings in Morgantown on or around March 3rd 2010"],"Summary":"Diamond shaped four bright white lights and one red light","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"03/03/2010 08:29 UTC","Object Shape":"Diamond","Log Number":"US-03032010-0011","divs":["sighting detailsi was driving through dellslow west virginia outside of sabraton\\morgantown when i noticed \"two\" white lights on the mountain top to my right. i pulled the vehicle off to the side of the road and watched the craft glide silently from the right side of the road from that mountaintop to the left side of the road to the other mountaintop. the craft was gliding right above the tree line and when the craft was crossing the road i saw \"four\" white lights in a diamond shape and a solid outline of a solid silver craft with bright white non flashing lights at each tip and a bright red light toward the rear of the craft. there were absolutely no green lights on the craft whatsoever. what makes me a little suspicious is the direction the craft was flying was in the direct line of the local airport runway. i use to live right beside that runway in apartment buildings called west run apartments. those apartments are at the base of the approach into the runway because the planes would always fly into the runway 100 yards directly over my building. the sighting of this craft was at the opposite end of the runway according to mapquest and was heading in the direction of the departure end of the runway. i am not familiar with faa regulations but i am sure there are regulations that prohibit craft from flying in the direction of planes departing the runway. unlike most encounters others may have had my vehicle did not malfunction or have any electrical shortages. it stayed on and nothing shorted out and the car did not stall."],"files":["/var/www/straped/mufon/html2text/22110.html.txt","/var/www/straped/mufon/org/22110.html"],"Latitude":"39.629526","Object Features":"Undisclosed","Tags":"City","Region":"West Virginia"}