{"Object Features":"Unknown","Case Number":"22116","Summary":"Bright, pulsating, form changing","City":"Tucson","map":"<A HREF = \"http://maps.google.com/maps?q=32.227283,+-110.917689(22116)&iwloc=A&hl=en\"> mufon case (22116) map </A>","Date of the Event":"03/03/2010 02:00 UTC","Viewing Distance":"Over One Mile","Date Submitted":"03/03/2010 10:11 UTC","Object Shape":"Egg, Oval, Sphere, Star-like","Source":"MUFON","Disposition":"Unknown","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around March 3rd 2010"],"Weather Factors":"None","Country":"United States","divs":["Sighting DetailsI was in my work truck out at Tucson airport driving south toward my destination (a building on the property) when I glanced out my driver side window at a jet flying south. A bright, white, pulsating, shape changing object appeared several miles behind the jet. I stopped my truck to be safe and I was soon joined by a company employee who was in a golf cart turning north in front of me. She stopped and asked me what I was looking at and I pointed and showed her. She responded WTF is that and I said I do not Know. The object never changed its position and disappeared after a minute or so. (It's amazing how long a minute can seem) If I was looking east standing straight and I pointed to the object with my right hand, it would be at the 2 O'clock position. Using the surounding mountains as reference I would estimate that the object was around 10,000 ft in altitude. This would put it over the town of Sahuarita. The airport altitude is aproximately 2300 ft. I did not think to use my phone camera until too late. I hope some other folks saw this. This my first day time sighting and I am pretty exited about it. I believe the other witness is too. Thanks for this forum, Dave"],"Longitude":"-110.917689","Region":"Arizona","Log Number":"US-03032010-0017","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/22116.html.txt","/var/www/straped/mufon/org/22116.html"],"Latitude":"32.227283","Sighting Duration":"Undisclosed","Tags":"City"}