{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.272753,+-97.734961(22114)&iwloc=A&hl=en\"> mufon case (22114) map </A>","Object Features":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/22114.html.txt","/var/www/straped/mufon/org/22114.html"],"Longitude":"-97.734961","Summary":"knew skylab time,knew direction,at 620 mi up this med gray circle about like a penny at 8 ft, had heard of ufo but didnot think true. knew skylab pinpoint light","Log Number":"US-03032010-0015","Latitude":"30.272753","Source":"MUFON","City":"Austin","Object Shape":"Disc","Disposition":"Unknown","Weather Factors":"Unknown","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around February 28th 1973"],"Date Submitted":"03/03/2010 10:10 UTC","Case Number":"22114","Date of the Event":"02/28/1973 12:00 UTC","divs":["Sighting Detailsi spent 20 years in air force, retired at san antonio, tx. had met the owner of company in austin and went to work for them. i was single and rented a room in a storage bldg. large u shaped. i either saw it on tv or read it in newspaper about skylab coming over austin at a given time. i knew it would be just a pinpoint of light but thought it would be a neat thing to see. to my surprise it was this medium gray round object passed overhead, it was like a penny at 10 or 12 ft. it appeared flat on the bottom, it was in view about 10 sec. it is still burned in my mind. i had read some stories about ufo's but didn't put very much credit at all in it. i left there after job offer from univ. of tex. to work on skylab project. spent alm ost 20 yrs there. retired. purchased my own computer and got to thinking about what had happened, checked with google and found out that skylab was 17000 mph and 620 miles altitude. the 3 men in skylab took about 4 pic's which showed a red-orsnge color which they estimated at 60 miles away. the sky was cloudless over to 30deg."],"Country":"United States","Region":"Texas","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed"}