{"Date Submitted":"03/04/2010 03:24 UTC","trends":["There have been no other sightings in Ruthton","This sighting has never been favorited."],"Region":"Minnesota","Country":"United States","Latitude":"44.176911","Summary":"White light, Looked like a star, Orange red light.","Sighting Duration":"Undisclosed","Date of the Event":"03/03/2010 12:00 UTC","Object Shape":"Circle, Fireball, Star-like","Object Features":"None","files":["/var/www/straped/mufon/html2text/22129.html.txt","/var/www/straped/mufon/org/22129.html"],"Longitude":"-96.105863","City":"Ruthton","Tags":"City","Weather Factors":"Unknown","Case Number":"22129","divs":["Sighting DetailsMe and my friend were outside at night around six o clock and we could see the stars crystal clear. When it looked kinda like a star but it was moving really fast through the sky. Then later we saw the same thing but only there were two lights they were both parallel from eachother and stayed that way even when they were moving. Then out in the distance there was a bright orange light that fell to the ground. It looked like a star fell from the sky. We were looking around to see where it may have landed. But we didnt go to the exact spot we just stood across the road and watched. We didnt see any fire but could tell there was some light in the distance. We saw planes like five or six planes flying towards the spot. They were going pretty fast too. Then at about eight o clock I started to walk home from my friends after seeing all that the planes were still everywhere in the sky and ive never seen that many before. There was another light flying through the sky and planes following behind it. The object was doing very fast speeds and moving like nothing ive ever seen before. Then it just slowly faded in the sky with the planes still following it. The object was moving very fast I could tell the plane couldnt keep up."],"Object Flight Path":"Path then hovering","Log Number":"US-03042010-0012","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.176911,+-96.105863(22129)&iwloc=A&hl=en\"> mufon case (22129) map </A>","Source":"MUFON","Disposition":"Hoax"}