{"Date of the Event":"08/17/2007 01:00 UTC","City":"Concord","Object Flight Path":"Path with directional change","Log Number":"US-03042010-0003","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=43.210977,+-71.535042(22120)&iwloc=A&hl=en\"> mufon case (22120) map </A>","Source":"MUFON","divs":["Sighting DetailsWhile driving on highway 89 North in NH I witnessed a bright light appear in the top edge of my windshield. I leaned forward and looked up and observed a bright light meandering along under apparent intelligent control. I immediately recognized the light as some kind of propulsion. The craft was very low in the sky maybe one hundred yards or more up, it was just below the mountain line in the background. The flight pattern of the craft was a very slight and gradual weaving from left to right barely noticeable. Then, suddenly, it accellerated faster than any aircraft I have ever seen and I have seen the fastest aircraft in the world, the SR71, take off many times. Then, the most amazing thing of all happened, the craft, while accellerating, made an absolute ninety degree turn to the right(east), which confirmed my thought of the light being that of the propulsion system, the light was no longer visible because the craft had turned, and there was no light visibly emminating from the back after it turned, then it was gone in a split second as it accellerated even faster. I was able to see just a shadow of the craft against the moonlit sky as it dissapeared, and as fast as it took off it did appear to literally dissapear. Due to my job at the time, I was in this particular area six days per week and generally around the same time, and I had witnessed many strange things in the exact same area on many different occasions. Such as, lights that would appear in the sky and just drop straight towards the ground as if they were dropped from the sky, also I watched a light race around the inside of a cloud very rapidly, the light was literally inside the cloud not on the exterior, there was no beam coming up from the ground, the light just kept racing around and around inside the the cloud. Then, one day in broad day light flying directly over Concord, NH was a black object that appeared to be block shaped and had a flame trail about one hundred yards long emitting from what appeared to be the back of the object. I have photos of this object. The very next day I saw two army helicopters following the same path as the object had the day before."],"Region":"New Hampshire","Viewing Distance":"101-500 Feet","Case Number":"22120","Latitude":"43.210977","trends":["There have been 23 other sightings in Concord","There were no other sightings in Concord on or around August 17th 2007"],"Longitude":"-71.535042","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22120.html.txt","/var/www/straped/mufon/org/22120.html"],"Country":"United States","Summary":"Fly Over","Tags":"City","Object Features":"Unknown","Date Submitted":"03/04/2010 09:51 UTC","Sighting Duration":"Undisclosed","Object Shape":"Other, Unknown"}