{"Tags":"City","Date of the Event":"05/11/1988 06:00 UTC","divs":["Sighting DetailsIll start from the beginning.When i was 2 or maybe 3 years old , i woke up floating above the crib,itdidnt shock me at first for some reason. it was like being half asleep. i openmy eyes looked down at the crib and took a quick glance at the ceiling and thenclose my eyes and when to sleep. But whats strange about the whole thing, periodically growing up i would think about it but not take it seriously. inever told anybody.The second encounter, i was 14 years old. i was watching t.v in the livingroom,with my 2 brothers and my little sister and my mom was watching t.v inher bedroom. it was about 6 or 7pm at night i was watching the six milliondollar man show i was sitting near the front door on one side of the t.v set andmy other brother was sitting on the other side of the t.v and my older brother was lying down on the sofa and my little sister was in a chair. and thats whenit happen, i had a strong feeling of someone or something being outside so iopened the door looked around didnt see anything,and then i looked up into thesky and there it was a flying saucer itwas like a stone throw away. iwas shocked i couldnt say or do anything for acouple of seconds and then i saw the spaceship started to turn around , when itdid, i saw the two aliens there was a yellow light, i didnt see any facefeatures all i saw were silhouettes, two bodys one was sitting down, like driving the ship and the other one was standing up and looking around and thenthey saw me the one that was standing up started to point at me and thespaceship was coming closer i could see features on the spaceship plus itdidnt make a sound and when it started to get closer i slam the door shut, iwas lost for words i couldn"],"Disposition":"Insufficient Data","Source":"MUFON","Summary":"Saw flying disc and Aliens inside","City":"Los Angeles","Country":"United States","Region":"California","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 11th 1988"],"Object Flight Path":"Stationary,Unknown","Object Features":"Dome, Window(s), Insignia","Viewing Distance":"21-100 Feet","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/2212.html.txt","/var/www/straped/mufon/org/2212.html"],"Log Number":"","Weather Factors":"Unknown","Date Submitted":"05/11/1988 06:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.053834,+-118.236305(2212)&iwloc=A&hl=en\"> mufon case (2212) map </A>","Case Number":"2212","Object Shape":"Saturn-like","Longitude":"-118.236305","Latitude":"34.053834"}