{"map":"<A HREF = \"http://maps.google.com/maps?q=44.927189,+-89.963463(22121)&iwloc=A&hl=en\"> mufon case (22121) map </A>","Country":"United States","Case Number":"22121","City":"Edgar","Date of the Event":"11/30/2008 12:00 UTC","Disposition":"Unknown","Weather Factors":"Unknown","Summary":"3 glowing red lights appeared over the tree line across the street","Latitude":"44.927189","Tags":"City","Date Submitted":"03/04/2010 11:28 UTC","files":["/var/www/straped/mufon/html2text/22121.html.txt","/var/www/straped/mufon/org/22121.html"],"Object Flight Path":"Hovering then path","divs":["sighting detailsit was very very cold outside, (-20f) i had let the dog out and noticed a deep reddish orange light appear over the tree line about 1\\2 mile to the south west. the light came on, then went out. i called my husband to grab the camera, but it was so cold the camera froze up as soon as we went outside. we continued to watch from an inside window.. three lights in a row would come on, one at a time, then go out. then all 3 came on and went out one at a time. several months later i mentioned this to a friend of mine who got all excited because she saw it too, from a different area, but in the same direction. several months later, this past summer my daughter was with this same friend of mine and they were driving back home to edgar from wausau. she noticed something in the sky and pointed it out. no one else could see it until they got into town off the freeway. they sat on their front porch for a while (this was after midnight) and saw the object slowly move up and down the street a few blocks away. then, suddenly a sparkly shiny light flashed down for a brief second and the object was gone. my daughters friend was sitting facing her and saw her face light up from the glow of the light that came down from the object. i can have her send in her own report of the incident."],"Log Number":"US-03042010-0004","Viewing Distance":"501 Feet - 1 Mile","Region":"Wisconsin","Source":"MUFON","Object Features":"None","trends":["There has been one other sighting in Edgar","There were no other sightings in Edgar on or around November 30th 2008"],"Object Shape":"Sphere","Longitude":"-89.963463","Sighting Duration":"Undisclosed"}