{"Object Features":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 40 other sightings in Dublin","There was one other sighting in Dublin on or around March 4th 2010"],"City":"Dublin","Tags":"City","Summary":"30-40 large yellow tint lights flashing in a round shape for a few minutes","Weather Factors":"None","Source":"MUFON","Date of the Event":"03/04/2010 08:20 UTC","Country":"United States","Log Number":"US-03042010-0017","Disposition":"Unknown","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path","Longitude":"-98.339248","files":["/var/www/straped/mufon/html2text/22135.html.txt","/var/www/straped/mufon/org/22135.html"],"Latitude":"32.091113","Case Number":"22135","Region":"Texas","Object Shape":"Disc, Flash, Oval","divs":["Sighting DetailsI was driving from Stephenville toward my parents house which is a Dublin address. As I was approaching their house which is on the left side of fm 242, Dublin texas I saw about 30 or more huge lights with a yellow tint flashing, one after the other, in an oval to round shape. They appeared very low to the ground, the shape appeared to tilt to one side slightly. Turning into the drive way, the house obstucrted my view of the UFO lights. I began honking my horn as I drove into the drive way, trying to get my mom and duahgter's attention so they would come outside and see what was going on. As I ran up the walkway to the front door I could barely see the UFO lights. When they came outside the lights were gone, BUT we saw and heard 10-15 jets flying much higher in the area above their house. Funny thing though, I heard no noise coming from the UFOs. The only thing I felt was excitement, I was wearing extremely high heels and am 5 months pregnant, otherwise I would have ran toward the lights, becausse they appeared that close. About 20 feet behind my parent's house in the pasture just behind. I was the only car driving at this time on a dark farm to market road."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.091113,+-98.339248(22135)&iwloc=A&hl=en\"> mufon case (22135) map </A>","Date Submitted":"03/04/2010 10:45 UTC"}