{"Weather Factors":"None","Country":"Mexico","files":["/var/www/straped/mufon/html2text/22136.html.txt","/var/www/straped/mufon/more/22136_submitter_file1__MJ12-150909-6.jpg","/var/www/straped/mufon/more/22136_submitter_file2__MJ12-150909-2.jpg","/var/www/straped/mufon/more/22136_submitter_file3__MJ12-150909-4.jpg","/var/www/straped/mufon/org/22136.html"],"Region":"Chihuahua","Object Features":"None","Summary":"SEMI-STATIC ARGENTINE-WHITE METALICAL SPHERE IN SKY BY 2 HOURS","map":"<A HREF = \"http://maps.google.com/maps?q=31.731129,+-106.462562(22136)&iwloc=A&hl=en\"> mufon case (22136) map </A>","Case Number":"22136","divs":["Sighting DetailsIT WAS THE MEXICO'S INDEPENDENCE DAY PARTY IN MY UNIVERSITY, THE \"U.A.C.J.\" AT THE ENGINEERING INSTITUTE, ABOVE 6PM, THEN, I WAS LEAVING THE SCHOOL TO GET TO MY HOME AND FOR SOME REASON I RISE MY HEAD AND I SAW IN THE SKY ONE SPHERE, VERY BRILLIANT, WITH METALICAL APPEREANCE, LIKE ALLUMINIUM FOIL, SOMETHING LIKE THAT, IT WAS SATNDING SEMI-STATIC RIGHT ABOVE MI HEAD AT 1 KM. OF DISTANCE, MORE-LESS. THE OBJECT WAS NOT ENTIERELY STATIC, IT WAS MOVING VERY VERY SLOW, IN A VERY EXACTO PATTERN, IT WAS MOVING TO THE WEST AND THEN RETURN TO IT'S ORIGINAL POSSITION MOVING TO THE EAST. THAT MOVEMENTS TAKE ALMOST TWO HOURS, MORELESS 1 HR MOVING VERY SLOWLY TO THE WEST, AND BACK, BUT THE OBJECT DIDN'T MOVE MUCH I THINK, TALKING ABOUT DISTANCE FROM THE ORIGINAL POSSITION, APROXIMEDIATELY 5 TO 15 DEGREES IN REFFERENCE OF MY POSSITION. THE SUN-LIGHT WAS HITTING THE OBJECT MAKING IT SHINE, A LOT, BUT WHEN THE SUNSET PASS OUT, THE OBJECT STARTED TO CLIMB MORE RAPIDLY AND PASSING SOME 20 TO 30 SECONDS THE OBJECT WAS COMPPLETELY INVISSIBLE. ONE NEIGHBOOR SAW THE OBJECT TO, AND I WAS ABLE TO TAKING SOME PICTURES FROM THE OBJETC, AND TO TAKE A VIDEO IN MY CAMERA. I FEEL SOMETHING VERY STRANGE, LIKE OTHER TIMES THAT I SAW STRANGE OBJECTS IN SKY, I FEEL SOME COMBINATION OF JOY, HAPPYNESS, SCARE, EMOTION, FEAR, BUT ALL IN THE SAME TIME, AND I CAN SAY THAT ONLY IN SITUATIONS LIKE THAT I FEEL IN THAT WAY. I LOSE SIGHT OF THE OBJECT BECAUSE LATER THAN THE SUNSET THE OBJECT STOP SHINNING AND A FEW SECONDS BEFORE THAT IT STARTED TO CLIMB, NOT TO FAST, BUT I LOSE SIGHT."],"Longitude":"-106.462562","Latitude":"31.731129","Sighting Duration":"02:00:00","Disposition":"Unresolved","trends":["There have been 5 other sightings in Ciudad Juarez","There were no other sightings in Ciudad Juarez on or around September 15th 2009","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/05/2010 05:41 UTC","Source":"MUFON","Object Shape":"Sphere","City":"Ciudad Juarez","Object Flight Path":"Other","Tags":"City","Date of the Event":"09/15/2009 06:38 UTC","Log Number":"MX-03052010-0001"}