{"Latitude":"27.277903","City":"Port St Lucie","Case Number":"22133","Source":"MUFON","divs":["Sighting DetailsI noticed from my porch (which faces east)an unusual bright (I first thought it was a large bright meteor) object (no strobe lights or sound) traveling from the North east toward the South west (more due south than west. The object appeared to be gaining altitude and was a very bright orangeish white light (no sound). I called for my wife to come and see the object. She stated she could see a triangle structure with the light in the center, I then said \"get your camera quick\" and I will keep an eye on the object. She came back with camera and we took some photos (none came out very well) but the object had moved so far south and gained altitude that you can only see a dim round bluish light. My wife said she saw what appeared to be wings that were retracted into the sphere then it performed a very quick dart left then right then up then down, then shot up and appeared to disapear. We were both excited and I was a bit disappointed that I didn't grab my camera as soon as I saw the object. If there is a next time I'll know better."],"Region":"Florida","trends":["There have been 15 other sightings in Port St Lucie","There were no other sightings in Port St Lucie on or around March 4th 2010","This sighting has never been favorited.",""],"Date of the Event":"03/04/2010 06:55 UTC","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=27.277903,+-80.35271(22133)&iwloc=A&hl=en\"> mufon case (22133) map </A>","Summary":"very bright orangish/white light appeared to be at high altitude","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"03/04/2010 10:01 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/22133.html.txt","/var/www/straped/mufon/more/22133_submitter_file1__UFO1.JPG","/var/www/straped/mufon/org/22133.html"],"Longitude":"-80.35271","Country":"United States","Log Number":"US-03042010-0015","Tags":"City","Disposition":"Unknown","Object Features":"Undisclosed"}