{"map":"<A HREF = \"http://maps.google.com/maps?q=41.808951,+-88.070708(22134)&iwloc=A&hl=en\"> mufon case (22134) map </A>","Weather Factors":"Unknown","Latitude":"41.808951","Object Features":"Undisclosed","Longitude":"-88.070708","Tags":"City","Log Number":"US-03042010-0016","Summary":"moving star that suddenly loses brightness then fades to nothing","City":"Lisle","trends":["There have been 4 other sightings in Lisle","There were no other sightings in Lisle on or around March 4th 2010"],"Source":"MUFON","Date Submitted":"03/04/2010 10:16 UTC","Country":"United States","Date of the Event":"03/04/2010 07:36 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:02:00","divs":["Sighting Details I've had three sightings of unexplained crafts that defy explanation, in the past three weeks. The first was on february 23rd at about 8:07 PM. I was walking to my car, having just left my friend's house, and as I got about five feet from my vehicle I looked up. My eyes instantly went to the brightest light in the sky, which was a plane with two white lights and a blinking red and white beacon light. As I realize what I'm seeing I notice that behind the plane is what looks like a dim star moving at the same speed about three inches behind the plane. as i start to focus on the dim light, it brightens itself and then deviates from it's path trailing behind the plane, and drops at a faster rate towards the ground. As it falls about four inches from where it was, it gets dimmer, then ( as if drawing a U in the sky ) gets brighter and starts heading back up and to the right. My friend's girlfriend pulled into the driveway and as her headlights hit me, I took my attention off of this amazing light to get out of the way and when I looked back up, it was gone. Then on March 3rd at 12:37 PM I'm driving to work. As I pull up to the light on 75th street and Wherli Rd. to make a left on 75th, I notice directly ahead at my 12 o'clock position, I notice what looks like a star in the middle of the day. That day there wasn't a cloud in the sky and in the middle of all the blue was a bright ball of light that had a dark spot underneath it. It was a shiny object that was reflecting the sun and the dark spot underneath the shine was the bottom of this object that wasn't being hit by the sun. as I watch this shiny craft, it moves slowly to the right and them right before my eyes, it slowly cloaks itself, losing it's shine but still has it's shape. It was the most extraordinary thing to see. This object was able to mask itself to the point where I eventually lost it after about 5 seconds once it made itself invisible. I don't know if it went out of our atmosphere and that's why it slowly lost it's color and mass, or whether it cloaked itself, but right before I lost it in the blue, I could still see it's shape but it's reflective surface was gone. Just like if you took a crystal ball and hung it in the sky, where you can see through it but still can see it's three dimensionality. Last but not least, the very next day I'm on my way home from work at 7:36 PM and just as I turn onto 75th street to go up to Wherli Rd., I see another bright moving star. This time I pulled over and got out of my car to verify what I'm seeing, and to try and use my phone to take video of it. This moving star slowly moved above me and after about two minutes of watching this bright light with no beacon lights, or any other lights for that matter, it got dimmer, and dimmer, and then disappeared right above me. I was absolutely astonished. Three sightings in weeks of each other. I don't know why I'm seeing so many sightings so close to each other, but I'm sure of what I saw. I wanted to see if your investigators can keep an eye out here because this is amazing and someone should be watching the sky up here, cause something's visiting here and it needs to be put on video and documented. Thank yo for your time. by the way, what camera can i buy that will be able to capture the night sky if I want to take video of what I'm seeing?"],"Disposition":"Unknown","Case Number":"22134","files":["/var/www/straped/mufon/html2text/22134.html.txt","/var/www/straped/mufon/org/22134.html"],"Region":"Illinois","Object Flight Path":"Undisclosed","Object Shape":"Star-like"}