{"Longitude":"-111.092621","Case Number":"22139","Date Submitted":"03/05/2010 11:30 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Log Number":"US-03052010-0004","files":["/var/www/straped/mufon/html2text/22139.html.txt","/var/www/straped/mufon/org/22139.html"],"City":"Undisclosed","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.052078,+-111.092621(22139)&iwloc=A&hl=en\"> mufon case (22139) map </A>","trends":[],"divs":["sighting detailswhile driving from my house heading west i notices what at first appeared to me to be a satellite in the night sky's. but when i saw it was moving up and down in a split second and its orange\\red color i change my mind. after that i came to a stop sign and change my direction to the north and the object also accelerated to the north with great speed. by then i was driving in the middle of the road beacause i could not belief my eyes. then, i came to a street light and change my direction to the east and guess what? the object change direction to the east, by that time i was a little nervous. but still i was thinking theres another explenation for what i was seeing. all my windows were down, so there was no reflection of any lights. again i stop at a street light and focused my vision on a lightpoll to confirmed that the object was moving and sure enough it was. it all most seem to me that it had the same heading and speed as my car. stoping and going like my car was. scary stuff!. finally, i change directions to the north and of course the object did the same, by that time it seemed to be all most on top of central tucson and finally it dissapered. it was like the object dimmed his light."],"Latitude":"34.052078","Object Flight Path":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Summary":"While I was heading south on my car I notices a strange orange/red circle on the sky. It was moving up and down in split seconds. Then changing direction from west to east and finally north. The object was making complete stops in mid air.","Date of the Event":"03/03/2010 07:38 UTC","Object Shape":"Circle","Sighting Duration":"Undisclosed","Region":"Arizona"}