{"Latitude":"42.276291","divs":["Sighting DetailsI am not sure I can add much of value to the discription, but it seemed to be dark greyish brown. Mayby a matt finish, or something non glossy that had no observable reflections of light, as a smooth surface would. It seemed to be centered above or focused on the farmhouse. I don't have a witness to the event, because I could not get my passenger to look in the correct direction to see the object untill it was too late and the object had fled quickly, or just dissapeared. I looked away for an instant to talk to the passenger, and it was gone, no trace. It was the first time I seen a craft up close, relatively close. I have seen lights in the sky before from a great distance, and they were distinguished from meteors by the fact that they turned corners instantaneously and were able to accelerate at a great rate of speed. I am aware that these objects may have been unmanned military craft. But the one I seen on Cherry Valley road was definately not any craft known to the public and did not fit any discription of any top secret craft like the stealth series. I did not think it was any known object, and immediately recognized that it was unfamiliar and out of place. When I saw the craft, I felt surprise, cautionary feelings, not necessarily fear as it was quite a ways away. I also felt fascination and belief, as I did not give any credence to ufo sightings in the past, before I saw the far away lights, and the craft hanging over the farm."],"Case Number":"22145","Region":"Illinois","files":["/var/www/straped/mufon/html2text/22145.html.txt","/var/www/straped/mufon/org/22145.html"],"Object Shape":"Cigar, Disc","Longitude":"-89.085255","Object Features":"None, Unknown","Date of the Event":"06/15/1993 01:30 UTC","Country":"United States","Source":"MUFON","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around June 15th 1993"],"City":"Rockford","map":"<A HREF = \"http://maps.google.com/maps?q=42.276291,+-89.085255(22145)&iwloc=A&hl=en\"> mufon case (22145) map </A>","Log Number":"US-03052010-0010","Date Submitted":"03/05/2010 03:31 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Summary":"I was driving down Cherry Valley Rd. and I saw a large disc or cigar shaped object hanging motionless over a farm, just above the large oak trees. It was as large as the whole yard, maybe an acre. From approx. 1000 yds.","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}