{"Date Submitted":"03/05/2010 12:55 UTC","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"03/04/2010 06:45 UTC","Case Number":"22141","map":"<A HREF = \"http://maps.google.com/maps?q=38.136897,+-121.270247(22141)&iwloc=A&hl=en\"> mufon case (22141) map </A>","Region":"California","Country":"United States","City":"Lodi","Weather Factors":"Unknown","Disposition":"Unknown","Summary":"saw a flashinging, strobe like light crossing the sky","Log Number":"US-03052010-0006","trends":["There have been 20 other sightings in Lodi","There were no other sightings in Lodi on or around March 4th 2010"],"Latitude":"38.136897","Longitude":"-121.270247","Object Features":"Undisclosed","divs":["Sighting DetailsMy daughter and I were driving home from Lodi around 6:45 PM, and, as usual, we were talking when I decided to look out and see if I could see any stars as the weather was finally clear. Just above us, but slightly to the south, I saw a flashing light. Very bright, very white, and flashing like a strobe light does. It was, from where I was about the size of an M & M candy, and traveling rather too slowly to be a plane. I would estimate it was probably about 30,000 ft. up. It continued on a southward path while just a few degrees lower to the southwest a plane was going to the east with its standard red and green lights flashing. My daughter said, that's just a plane., but from the drivers seat she could not see the strobe like thing. Since we were driving, of course I could not determine if there was any sound I can't discount that this might be a plane, but certainly I have never seen a plane using those kind of lights. It actually looked to be a ball of light rather than lights spaced along the length of something. I watched it for approx 12 minutes until it vanished in the south. Because there was no near 'contact' I cannot describe any unusual effects, except that I spent a very restless night constantly seeing the thing in my mind and wondering what it could have been. Any ideas what this might be?"],"Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/22141.html.txt","/var/www/straped/mufon/org/22141.html"],"Object Flight Path":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed"}