{"Case Number":"22147","Source":"MUFON","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around March 1st 1953"],"divs":["Sighting DetailsMy father was in the Air Force Air Police stationed at Walker AFB, NM (Roswell) from 51-54. My oldest sister and I were both born at Walker. I don't know the exact date of the events but my father worked flight line security as an Air Policeman between 51-54. My mother related to me that when they were first assigned to Walker that there had never been any mention or scuttlebutt about the \"Roswell\" incident from the 40s. One night he came home from work(they lived in base housing)and she said he was very frightened and white as a sheet. He said that there had been an incident on the flight line and that afterwards he had been told that everything about it was classified and if he spoke about it he would be prosecuted. He told her that a disc shaped object had landed on the flight line and that they had surrounded it...at a distance...and it sat there for approximately 2 hours. She said that all of security, DCM, base commander etc responded to the incident. They photographed it non-stop. There was no interaction between anyone and the craft and after about 2 hours on the ground it simply lifted off and flew off as quickly as it had arrived. Later she said they had another incident with the same craft but this time there was some limited interaction between the it and one of the APs vehicles. She said that this time as my Dad told her it did not set down but hovered over the base for a period of time and for a little while seemed to follow one of the APs vehicles. My Dad left the AF after 54 and never talked about this to anyone that I'm aware of....he passed away about 15 years ago. I overheard my Mom talking to someone about this when I was younger but never discussed it with her until later in life. A little over a year ago my Mom passed away after battling cancer. Prior to her death we setup a video camera to record my mom as she talked about different things....on one of these days I asked her about the Walker incident and she retold the account again basically as I had overheard it years ago. As there were a lot of people that supposedly were aware of these incidents I've always been surprised that no one has ever come forward about it."],"City":"Roswell","Object Flight Path":"Undisclosed","Date Submitted":"03/05/2010 03:37 UTC","Longitude":"-104.516334","Summary":"Disk shaped object.","Date of the Event":"03/01/1953 12:00 UTC","Latitude":"33.403896","Country":"United States","Object Features":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"New Mexico","Tags":"City","Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=33.403896,+-104.516334(22147)&iwloc=A&hl=en\"> mufon case (22147) map </A>","Disposition":"Unknown","Log Number":"US-03052010-0012","files":["/var/www/straped/mufon/html2text/22147.html.txt","/var/www/straped/mufon/org/22147.html"]}