{"Tags":"City","Sighting Duration":"00:02:10","divs":["Sighting DetailsOn this particular night, I was parking my car after returning home from a friends house. I generally look up at the night sky anyways, but on this particular night I heard a helicopter approaching from my right of me, thinking nothing much of it I get out of the car and pan my head over in the direction of the helicopter. When I did this, I saw a very large object slowly approach over head and it looked to me like it was being escorted by a helicopter. The helicopter was flying directly adjacent to this very large triangular object, I'd say it was about 2-3 football fields in diameter. I saw the 3 bright lights making out the triangular shape, and noticed a very slow pulsing red light in the bottom of the object. Stunned at what I was seeing I froze to look at the object in the middle of the street. It was about 6-700 feet above me flying fairly low and extremely slow for an aircraft that large. The curious thing about it, was that it made absolutely no noise. All I heard the whole time was the sound of the helicopter and nothing else. When the object went straight over my head, I felt a very eerie feeling like I was being watched at that very moment. After it went over head and beyond the horizon, it looked like it was heading toward (the direction) of March Air Force Base into the San Timoteo Canyon. The total event only lasted a few minutes, and I thought it was very interesting that it looked like the helicopter was escorting it."],"files":["/var/www/straped/mufon/html2text/22142.html.txt","/var/www/straped/mufon/org/22142.html"],"Latitude":"34.060289","map":"<A HREF = \"http://maps.google.com/maps?q=34.060289,+-117.180168(22142)&iwloc=A&hl=en\"> mufon case (22142) map </A>","Disposition":"Insufficient Data","Log Number":"US-03052010-0007","Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Summary":"Triangular object, a light at each point, and a slowly pulsing red light in the middle.","City":"Redlands","Object Flight Path":"Straight-line path","Case Number":"22142","Longitude":"-117.180168","Date of the Event":"08/20/2008 01:20 UTC","trends":["There have been 10 other sightings in Redlands","There were no other sightings in Redlands on or around August 20th 2008"],"Weather Factors":"None","Object Shape":"Triangle","Date Submitted":"03/05/2010 01:16 UTC","Object Features":"None","Region":"California"}