{"trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around July 10th 1993"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.276661,+-89.092965(22151)&iwloc=A&hl=en\"> mufon case (22151) map </A>","files":["/var/www/straped/mufon/html2text/22151.html.txt","/var/www/straped/mufon/org/22151.html"],"Sighting Duration":"Undisclosed","Region":"Illinois","Log Number":"US-03052010-0016","Longitude":"-89.092965","Object Features":"Undisclosed","Object Shape":"Unknown","City":"Rockford","Date of the Event":"07/10/1993 04:15 UTC","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","Country":"United States","Latitude":"42.276661","Case Number":"22151","Summary":"I was indoors in a basement room alone, and I was sitting on a bed, when I was paralized and manipulated.","Viewing Distance":"Unknown","divs":["Sighting DetailsLike I said, I was alone in a basement room, sitting on my bed, when I felt a weakness come over me and I fell prostrate was turned onto my belly by unseen forces. I had an overwhelming feeling of warmth and friendliess, as though my best friend in the whole world was with me. Its hard to explain, like the feeling was imposed on me without my knowledge or control over it. My head was turned to the side, so that my face was directed towards a wall. I noticed something moving in my feild of vision. I was unable to move, exept to slightly turn my head as though it were very heavy and hard to move. So I moved my head to see what was moving in the corner of the room. Because of the influence of the drugged feeling, I had no fear at that time and felt a feeling of welcoming a good freind, again as though it was a feeling imposed on me, not seeming to originate from my own mind. Hard to explain. then I saw the crease of the corner between the two walls open, like the walls became soft and kind of bent to allow the corner crease between the walls to spread open and stretch open, like an orifice or opening. It was a cynder block wall. It became fluid or soft and moved apart, and beyond was blackness. then I seen the figure of a humanoid being, inside of the blackness, it slowly floated or was riding on some kind of support from behind, not sure. it was similar to the classic image of how alien beings are portrayed by the media, exept that where the nose and mouth should be, there was perhaps a nose and mouth, but were not very recognizable and had folds and wrinkles that made it hard to make out the features plainly. It had great large slanted but not squinted solid black eyes, a large bald head and was wearing some kind of dark colored cloak or clothing. I could not see its legs or feet as though it was floating or riding on some sort of linkage or support of some kind. It also had long spidery thin fingers, and on its fingers were shiny metal conplicated looking devices and some of them had needles on the end. It came out of the black opening in the corner slowly and proceeded to advance towards me until it was over me and I was no longer able to see it as my head was laying down and seemed to heavy to lift. At this point I was starting to wonder why I was so glad to see this being, and suddenly realized that I should not feel this way. then a wave of fear came over me and I was unable to move or fight or flee or even to look and see what was going on. the next thing I felt was a needle, which I assumed was one of the instruments the being had attached to its fingertips. I felt the prick of the needle at different points along the side of my spine. Each time it entered my back I felt what i thought was an electrical stimulation in my back along the spine, and whatever corresponding limb was near each puncture site, that limb, arm or leg would spasm and move when the electrical impulse would fire into my spine, as though the nerves going from my spine to my limbs were being stimulated electrically. At this point I was unable to move my head at all, and did not see the being leave, but eventually, I was able to move, and I got up and went to the corner and the wall was same as ever, intact, hard, seemingly undisturbed. I had no idea what this being was, or its intention."],"Date Submitted":"03/05/2010 04:33 UTC","Weather Factors":"None, Does Not Apply","Tags":"City","Disposition":"Unresolved"}