{"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Latitude":"41.686081","files":["/var/www/straped/mufon/html2text/22150.html.txt","/var/www/straped/mufon/org/22150.html"],"City":"South Bend","Longitude":"-86.240237","Source":"MUFON","divs":["sighting details1 week before christmas, 1989 i awoke at 5:45 a.m. there was a light flashing through my window blinds. i was in a paralized state. while in this paralasis, i was forced to watch my life replay on my blinds. this lasted until 7:00 a.m. the same experience at exactly 5:45 until 7:00 happened for 5 days straight. on each day i watched different times in my life unfold. on the 6th day it was different. i awoke at 5:45 but this time it felt as thought someone or something was being dropped into my body. this time, information was given to me that i believe was meant to make a difference for mankind. information was given to me regarding present day communication technology and how to use it to peacefully change our existing governmental system into a 21st century system that allows the \"people,\" not the politicians, to raise, debate and vote directly on the issues. i was released from this at exactly 7:00 a. m. on the 7th morning, it was a refresher course of the 6th morning. this experience has totally changed my life. because of the information that was given to me, i have gone on to win the dr. martin luther king jr. award here in our community and have hosted a radio program here called \"stand up america.\" i would appreciate the opportunity to present this experience and the message that came from it to someone on your staff for their consideration. i believe the message that was given to me during this ordeal is exactly what our country needs to fix the broken system that we are all experiencing. thank you for your kind consideration..sincerely, [cms\\tg\\pd] p. s. everything thing in this experience that i just described can be proved and verified.."],"Case Number":"22150","Weather Factors":"Unknown","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around December 25th 1989"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.686081,+-86.240237(22150)&iwloc=A&hl=en\"> mufon case (22150) map </A>","Tags":"City","Country":"United States","Log Number":"US-03052010-0015","Summary":"I was abducted for 7 days in a row","Date Submitted":"03/05/2010 04:18 UTC","Object Flight Path":"Undisclosed","Date of the Event":"12/25/1989 05:45 UTC","Viewing Distance":"Unknown","Region":"Indiana","Object Shape":"Unknown"}