{"Object Features":"Other","Region":"Georgia","Longitude":"-84.985579","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Country":"United States","Log Number":"US-03052010-0021","trends":["There have been 22 other sightings in Columbus","There were no other sightings in Columbus on or around April 30th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.462176,+-84.985579(22156)&iwloc=A&hl=en\"> mufon case (22156) map </A>","Latitude":"32.462176","Tags":"City","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22156.html.txt","/var/www/straped/mufon/org/22156.html"],"Date Submitted":"03/05/2010 05:47 UTC","City":"Columbus","Object Shape":"Triangle","divs":["Sighting DetailsI recently told a friend about my experience, as he has a special interest in such things, and afterwards he suggested that we cross check my experience with other reports on your site. I was sceptical that we would find anything at all, so imagine my surprise when I found a report that EERILY matched and corroborated mine. The report that I'm referring to is listed as having occured on May 10th 2007. To be honest, I can't say that I remember the exact date but I know that it was in May because a relative's birthday had just passed. I had for a while passively inquired as to whether or not anyone in the neighborhood had seen anything which they apparently had not, and was in fact at the very time of the incident attempting to call the friend whose apartment I had just left. This event took place possibly as late as 2:00 a.m. (The exact time I can't recall) on the north end of the city of Columbus as I was returning home. The object I saw was (and I emphasize) very low to the ground and moving slowly, such that I was able to follow near behind it for nearly two miles. I had just begun to travel northbound on Whitesville Rd., on which I lived, when crossing a highway bridge I spotted it over the trees. It almost seemed to be trying to fly parallel to the road on my left-hand side. I slowed down and drove cautiously never taking my eye off the thing. I was alone on the road which had no outlets that would take me anywhere other that directly beneath it. I approached my house which was also on my left-hand side and watched astonished as the object flew directly over it and seemed then to align itself directly over the road. I stopped the car directly in front of my house and stared up after it as it moved along down the street. With it then in plain sight I could see the shape against the contrast of the stars. It was a large triangle with dim orange lights in each corner. I remember chuckling in fact because I'd recalled years prior watching a t.v. show wherein a man, in europe I believe, described the exact same thing. I let off the brake and slowly followed the object northward for a little while before it broke away from the road and headed west back behind the trees. I lost sight of it, turned around, and went home where I sat in the driveway a while before getting out and staring another while in the direction it had gone. On a side note, Columbus has a small airport and residents of the city are very accustomed to seeing run-of-the-mill aircraft, everything from commercial airliners to jets and helicopters, and none of these could have been mistaken for this. From the moment I saw it I knew it couldn't be anything comparable. In addition to being slow moving ( I followed it at around 30 mph.) it wasn't likely more than 300 feet off the ground. I say this given that I watched as it flew over my house which coupled with the massive pecan tree in the front yard gave me a familiar perspective on height."],"Weather Factors":"None, Does Not Apply","Date of the Event":"04/30/2007 12:00 UTC","Case Number":"22156","Summary":"Large triangular silhouette with dim orange lights on each corner moving slowly low-overhead"}