{"Latitude":"43.100903","trends":["There have been 16 other sightings in Utica","There were no other sightings in Utica on or around April 30th 1990"],"Date of the Event":"04/30/1990 09:30 UTC","Sighting Duration":"01:59:00","Log Number":"","divs":["Sighting DetailsWe were sitting on front porch abd I saw what I thought was a low flyingairplane above the tree line. Then the way it was moving I thought it might bea helicopter. Had my husband look and my daughter came home then so she watchedand I went in and got my son to come out. It came over the tree tops and wherethe creek is it stopped and turned and came towards us. By now we are out on thesidewalk looking up and it was right over us. Maybe 50 ft off the ground. Itjust hung above the house for maybe about 5 min. We were just looking straightup at the thing. There were 3 lights on each corner and what seemed like alotof little lights under. My husband saw what looked like a purplish swirrlinglight underneath. It slowly moved off, but we watched it for maybe a couple ofhours as it was making a grid pattern across the creek from us. But what got methe most was the lights. They were very bright but gave off no illumination.The sound was like a very low humming. We lost no time or power. My dog wasout on the porch with us but she never moved from her spot even when we werejumping around so scared. She normally be right there with us. That wasstrange. I finally had to try to go to sleep so I had to give up on it. AKeith Conroy in Utica, NY contacted us about a year later. He had an article inthe paper asking if anyone has seen a UFO. So I wrote in and he did interviewus."],"Case Number":"2215","Date Submitted":"04/30/1990 09:30 UTC","Object Shape":"Triangle","Disposition":"Unknown","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Longitude":"-75.232664","Region":"New York","Source":"MUFON","City":"Utica","map":"<A HREF = \"http://maps.google.com/maps?q=43.100903,+-75.232664(2215)&iwloc=A&hl=en\"> mufon case (2215) map </A>","Object Features":"Wings, Other","files":["/var/www/straped/mufon/html2text/2215.html.txt","/var/www/straped/mufon/org/2215.html"],"Object Flight Path":"Straight-line path","Country":"United States","Summary":"ufo over So. Trenton, NY","Tags":"City"}