{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-98.223432","Date Submitted":"03/05/2010 04:38 UTC","Latitude":"26.206517","map":"<A HREF = \"http://maps.google.com/maps?q=26.206517,+-98.223432(22152)&iwloc=A&hl=en\"> mufon case (22152) map </A>","Object Shape":"Other","trends":["There have been 11 other sightings in McAllen","There were no other sightings in McAllen on or around March 29th 2009"],"Date of the Event":"03/29/2009 12:00 UTC","Viewing Distance":"Unknown","Weather Factors":"None","Source":"MUFON","Tags":"City","Region":"Texas","Country":"United States","Log Number":"US-03052010-0017","divs":["Sighting DetailsI had just flown in from Dallas to Harlingen, landed after 12 noon. I drove back with a friend and her husband to Mcallen, my home town. Before Mcallen, we drove through Pharr Texas. I was in the back seat, and I happened to look up. I noticed, and not too high from the sky, a formation of birds, in an arrow shape, the way your normal birds migrate, but these were not the normal looking birds. They were in a perfect arrow shape, and about 8-10 of them on either side. They were flying in synch, the exact same time and way, these birds looked like sting ray looking animals, very strange looking birds, with a wide wing span, and bodies like a sting ray. As I was watching, they disappeared, then they reappeared within seconds, and they were still in synch as they were flying flapping their wings all at the same time. I did mention what I saw to the 2 people I was driving with, I was a little embarrassed to mention it again. With in seconds they disappeared again, and not into clouds, because they were way below the clouds. I've told my close friends and am embarrassed to mention it to anyone because don't want anyone to think I am crazy. Oh and I failed to mention, it was a beautiful clear day. 1. In the backseat driving home I was looking out the window. 2. Their perfect formation and in synch flying. 3. Regular geese 4. They looked like the body of a sting ray, especially their flapping wide wings as that of a sting rays, they were all flapping at the exact same time. 5. I thought, wow, this couldn't be. There's no way, a formation of birds can flap all at the same time and then just disappear. I know I'm not crazy! 6. They disappeared."],"City":"McAllen","files":["/var/www/straped/mufon/html2text/22152.html.txt","/var/www/straped/mufon/org/22152.html"],"Object Features":"Undisclosed","Disposition":"IFO","Case Number":"22152","Summary":"sting ray like looking birds in an arrow formation/disappear, reappear, and dissappear again"}