{"Log Number":"US-03052010-0023","Latitude":"34.352142","Date Submitted":"03/05/2010 06:45 UTC","divs":["Sighting Detailsi was out walking my dog as usual when i happened to stop to look back to c where my dog was, i justt happened to look up at the sky and to my surprize i saw this very bright object, at first i thouhgt maybe a satelite. i changed my mind when the object did some very high speed manuvers that i feel was impossible for a human pilot to do. the speed at which it did its turn would have pulled to many G's for a man to go thru without passing out. i have included a short note and drawing of what i saw. i also sent this report to UFO hunters and i had to do a follow-up after a month of not hearing anything from them. i was told it was fowarded to the proper persons but i never heard from them after that. i know i saw somethign that wasnt quite rite. the speed of the object and the manuvers were not what i feel was humanly possible."],"Disposition":"Unknown","trends":["There have been 8 other sightings in lake havasu","There were no other sightings in lake havasu on or around April 9th 2009","This sighting has never been favorited.",""],"Object Features":"Unknown","Date of the Event":"04/09/2009 04:35 UTC","Region":"Arizona","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.352142,+-114.171953(22158)&iwloc=A&hl=en\"> mufon case (22158) map </A>","Weather Factors":"None","City":"lake havasu","Viewing Distance":"Unknown","Longitude":"-114.171953","Tags":"City","Object Shape":"Circle, Star-like","Summary":"this was just a very bright white lite travling very very fast and at a very hig altitude.","Country":"United States","files":["/var/www/straped/mufon/html2text/22158.html.txt","/var/www/straped/mufon/more/22158_submitter_file1__Picture16.jpg","/var/www/straped/mufon/more/22158_submitter_file2__Picture17.jpg","/var/www/straped/mufon/org/22158.html"],"Case Number":"22158","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change"}