{"Latitude":"43.979183","Date Submitted":"03/05/2010 09:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.979183,+-71.120348(22163)&iwloc=A&hl=en\"> mufon case (22163) map </A>","Region":"New Hampshire","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","City":"Conway","Tags":"City","trends":["There have been 3 other sightings in Conway","There were no other sightings in Conway on or around March 5th 2010"],"Object Shape":"Chevron, Circle","Disposition":"IFO","Viewing Distance":"Unknown","Object Features":"Undisclosed","divs":["Sighting Details I was saying good-bye to my husband as he was going to work from our first floor apt. He was in the car when I looked up and noticed the light approaching from the left. I quickly pointed out the light to him. We watched for approx. for 1 minute as the light traveled from SW in a NE direction towards the big dipper. It was very bright white with no audible sound. It suddenly grew dimmer and faded out. The object is too big and moves at a constant rate of speed unlike any shooting star. It always seems to be traveling in a straight line. We have tried to film the object with no luck. We have seen this same object on multiple occasions since last year(not always traveling in the same direction) with many other people so we were quite excited. We seem to be located in an area that has a lot of active lights in the sky and have tried to take pictures but are not having much luck with that as of yet. The ones I have are often blurry or squiggly. We have been lucky enough to have witnessed multiple lights expanding which I will post separately as they were a totally different type of lights. I am so glad to have found a place to post without sounding crazy and gather information from real people,after all we are only 35 miles from the Betty and Barney Hill incident."],"Date of the Event":"03/05/2010 07:27 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22163.html.txt","/var/www/straped/mufon/org/22163.html"],"Longitude":"-71.120348","Log Number":"US-03052010-0028","Summary":"Bright white round with a sort of peak or light cast from top of circle on either side","Weather Factors":"Unknown","Case Number":"22163","Country":"United States"}