{"files":["/var/www/straped/mufon/html2text/22166.html.txt","/var/www/straped/mufon/org/22166.html"],"Case Number":"22166","Log Number":"US-03052010-0031","Date of the Event":"08/15/1969 12:00 UTC","Object Features":"None","Latitude":"38.708461","Tags":"City","Date Submitted":"03/05/2010 11:29 UTC","Weather Factors":"None","Object Flight Path":"Path with directional change","Region":"Missouri","Longitude":"-93.223421","map":"<A HREF = \"http://maps.google.com/maps?q=38.708461,+-93.223421(22166)&iwloc=A&hl=en\"> mufon case (22166) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsI just wanted to finally go on record someplace in regard to the only sighting that I have ever had. I was 19 years old back in 1969, hanging out with 3 of my friends when some other friends invited us to go to a party out in the country about a mile or so out side of Sedalia, MO to a regular party spot. It was about 7pm or so when my friends and I were heading out to the party. We were about a half mile or so outside of town driving down a country road when I noticed, out the back drivers side window, what looked like a darkish silvery object. From my view point, the object was on the other side of a row of big trees and seemed to be just about at tree top level. It seemed to be about a quarter mile or so away(although I cant really be sure how far it actually was). I shouted to the other people in the car to take a look at this thing. The driver stopped the car and we all got out to get a better look. One of the strange things was the lack of any noise from the object. I could hear the light breeze blowing through the trees, the barking of a dog somewhere off in the distance, but nothing from the object that I could detect. The triangle looking object was slightly turned at first, which showed me that the shape seemed to be triangle. It was moving in the direction we had been coming from, and kind of seemed to be just floating along (not moving real fast, but not dead still either. We all stood there with our jaws hanging on the ground, so to speak, wondering what in the world we was witnessing, when all of a sudden the object turned away from us and broke into 3 different smaller triangles and then they shot away up into the sky. The 3 objects was gone out of sight in a matter of seconds. I did not see any blasts of flames like you would expect from a jet engine or something like that. I mean there was absolutely no noise that came from the 3 objects that I, or the other people with me could detect. We all got back into the car, very excited needless to say, and headed on toward where the party was going to be. When we arrived at the location, the people there had built a campfire and about 12 or so people was standing around it, looking and pointing toward the direction that I had seen the objects. I approached the other people with the intent of asking them if they had seen anything, but before I had the chance to ask, people started asking the 4 of us if we had seen anything on the way to the party. It seems that from the vantage point of the party location, that the people there had a pretty good view of this thing also. They had seen the single triangle break into the 3 different triangles and shoot up into the night sky as we had seen. Of course that was about all everyone there talked about most of the evening. During the next couple of days, I talked to a few different people in Sedalia that had seen something that night also, although from talking to them, it seemed like they did not have near as good of a view as we did out on that country road. I have seen shooting stars, planets in the night sky and some weird stuff, but never anything like that night back in 1969. Thank you for giving me a place to tell my little bit of UFO history."],"Summary":"Saw a triangle shaped object, that broke into 3 objects and shot up in the night sky","Disposition":"Unknown","Country":"United States","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","City":"Sedalia","trends":["There have been 3 other sightings in Sedalia","There were no other sightings in Sedalia on or around August 15th 1969"]}