{"Disposition":"IFO","Viewing Distance":"Unknown","Source":"MUFON","Date Submitted":"03/05/2010 09:55 UTC","Region":"Rhode Island","Object Features":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22164.html.txt","/var/www/straped/mufon/org/22164.html"],"Summary":"the trailing object caught up with and then passed the first and seemed to shadow it","Log Number":"US-03052010-0029","Latitude":"41.93073","Case Number":"22164","Tags":"City","divs":["Sighting DetailsOn the evening of September 21, 2008 while fishing in a local lake located in the town of Smithfield I witnessed an event that I never saw before until that night. It was early evening and beginning to get dark and the sky was clear except for a few scattered clouds. Suddenly I noticed a very bright light in the sky almost directly overhead and moving at the speed a satellite would appear to be going. I thought maybe it was the ISS or maybe a shuttle mission passing over the area. I looked for signs of an high altitude aircraft but saw no nav. lights or strobes and there was the absence of any jet sounds. Then to my amazement a second light, about half as bright as the first, appeared behind the first object on the exact flight path. Both objects exhibited typical ballistic trajectories except the second object was going faster than the first and closing at such a rate that I believed I was about to witness a collision or maybe some sort of killer satellite bearing down on a target. There was still no aircraft sounds or lights from the second object. To my amazement the second light suddenly moved to the left (they were going away from me)and caught up with the first object and seemed to pace it as they both went behind a cloud and disappeared over the horizon growing ever dimmer. I have witnessed many orbiting satellites since 1957 but they never did anything like what I saw on that September night. The entire event lasted about 10 seconds. It wasn't an irridium flair or a meteor. The second object had to have been under intelligent control to have made a manouver like that at what seemed like a last second change in course. I'm not claiming it was aliens I'm just saying it was real strange to see that type of manouvering going on that high up at what seemed to be orbital height."],"City":"Smithfield","Weather Factors":"None","trends":["There has been one other sighting in Smithfield","There were no other sightings in Smithfield on or around September 21st 2008"],"Date of the Event":"09/21/2008 07:38 UTC","Longitude":"-71.54361","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.93073,+-71.54361(22164)&iwloc=A&hl=en\"> mufon case (22164) map </A>"}