{"Latitude":"47.035763","City":"Lacey","Case Number":"22169","Summary":"Colored lights in the sky","Viewing Distance":"Unknown","Weather Factors":"None","trends":["There have been 5 other sightings in Lacey","There were no other sightings in Lacey on or around March 5th 2010"],"Date Submitted":"03/06/2010 03:30 UTC","Object Flight Path":"Hovering then path","Country":"United States","Sighting Duration":"01:10:00","Date of the Event":"03/05/2010 10:20 UTC","Longitude":"-122.818882","Log Number":"US-03062010-0003","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=47.035763,+-122.818882(22169)&iwloc=A&hl=en\"> mufon case (22169) map </A>","files":["/var/www/straped/mufon/html2text/22169.html.txt","/var/www/straped/mufon/org/22169.html"],"Source":"MUFON","divs":["sighting detailsi stopped by work to bring my co worker some food. after hanging around for a while i needed to use the restroom. both of the bathrooms were occupied so i stepped into the backyard to pee. once outside i noticed a flashing\\flickering light in the sky. at first i thought it was probably a star or a planet but then i noticed it was moving. i could not make out any discernable shape. it was flashing\\flickering in what can only be described as the colors of the rainbow. it moved up and down and back and forth as if it was wobbling. it wasn't always \"wobbling\" though. it was moving, in relation to me, to the right. i watched it from 10:20pm pst until 11:30pm pst at which time my co worker and i left for our homes and lost sight of the object. i watched it calmly and curiously for the entire duration of the event. i tried to gather as much information as i could. i had several points of reference. periodically i would ask my co worker what he was seeing. i was very careful not to ask if he was seeing the same thing as me. instead i let him describe to me what he was seeing and it was definitely the same stuff i was seeing. the moving, the flashing\\flickering, the wobbling etc. i live near ft. lewis and mcchord afb. i've seen my fair share of flares and air craft. this certainly wasn't a flare nor was it any conventional air craft. it was moving far too slow to be conventional and far too fast to be just the earth moving and changing my perception relevant to the object."],"Object Shape":"Unknown","Object Features":"Unknown","Region":"Washington","Tags":"City"}