{"Latitude":"41.965278","Log Number":"US-03052010-0030","Summary":"Strange light that appeared to be in flames and fly over house.","Viewing Distance":"101-500 Feet","Disposition":"IFO","Region":"Connecticut","Weather Factors":"None","Object Features":"None","Object Shape":"Circle, Fireball, Star-like","files":["/var/www/straped/mufon/html2text/22165.html.txt","/var/www/straped/mufon/org/22165.html"],"divs":["Sighting DetailsAbout 2am I saw a strange light on the tree line in the backyard. I was curious due to the fact its all woods in that direction and no airport or towers. As I watched it appeared to be moving up very slowly. It looked as if it were getting larger in size but I then realized it was getting closer. It started to flicker a bright orange color as if on fire. I thought it my be a plane about to crash into my house! I was frozen and continued to watch. It moved to slow to be a crashing aircraft. It stopped flickering and was just a solid orb like ball of light. It almost resembled a spot light from a helicopter being shine directly at you only there was no ambient light coming from it. It was as if iluminated from the inside. It proceeded toward my house only about 200 ft. in the air. I was extremely puzzled. I thought that it must be a helicopter. There were no navigation lights or strobes to identify it as an aircraft. So I opened the window expecting to hear the sound of the rotors but heard nothing but absolute silence. I watched as it went over the roof asfter I lost sight I ran to the other side of the house and watched it from there. It was still moving slowly and then it accelerated EXTREMELY fast into the distance where it was no longer visible. I chalked it up to its 2am and tired and went to bed. A few days later at about 8am during dinner I saw it again. I told my brother and mother about the previous event and they just kinda laughed. I pointed out the window and said look! They saw it as well. He said it looked like it was on fire. It stayed just above the tree line for about an hour before just disappearing. It re occured a few more times since then. I looked up if there was anything else like this happening and saw videos on the lights in Arizona and decided I should atleast report this so people know to keep an eye out. I have recently purchased a camera and will capture photos and videos the next time it re occurs. If you would like to contact me please do so using the email provided. Thank you for your time, Brandon"],"Case Number":"22165","Tags":"City","Date of the Event":"01/05/2010 02:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.965278,+-72.022222(22165)&iwloc=A&hl=en\"> mufon case (22165) map </A>","City":"Woodstock","Sighting Duration":"Undisclosed","Longitude":"-72.022222","Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Woodstock","This sighting has never been favorited."],"Source":"MUFON","Date Submitted":"03/05/2010 10:45 UTC"}