{"Log Number":"US-03062010-0006","City":"Cape Canaveral","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsat approximately 9pm om 3\\5\\10 my wife and i were sitting in our back yard enjoying the cooler florida nights with our kids. while sitting facing south i noticed two fast moving but very discernable silver ball-like shperes moving together and making a tight sweeping arc moving from over the ocean out of the east to the west making the hard arc to the south and straightening out towards the south over the beachline. these two objects did not blink. moved way to fast to be a plane and were not birds. they flew so tight together and at perfect speed and distance as to seem to be attached....however they clearly were not as i could see clear night sky between to the two. i could not really tell how large they were as i could not get a good feel of their relation in the sky....they could have been thousands of feet up however it seemend that they were in lower altitude and possibly about the size of a small car."],"Date Submitted":"03/06/2010 09:40 UTC","Region":"Florida","Longitude":"-80.601041","Latitude":"28.390373","Date of the Event":"03/05/2010 12:00 UTC","Case Number":"22172","map":"<A HREF = \"http://maps.google.com/maps?q=28.390373,+-80.601041(22172)&iwloc=A&hl=en\"> mufon case (22172) map </A>","Weather Factors":"Unknown","Disposition":"Insufficient Data","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/22172.html.txt","/var/www/straped/mufon/org/22172.html"],"Object Features":"None","Source":"MUFON","Object Flight Path":"Path with directional change","Tags":"City","trends":["There have been 7 other sightings in Cape Canaveral","There were no other sightings in Cape Canaveral on or around March 5th 2010"],"Summary":"two silver metallic orbs with a slight glow where in exact flying alignment and made a sweeping arc across our field of view and then straighten out and flew quickly straing south out of view over the ocean."}