{"Object Features":"Dome","Country":"United States","Log Number":"US-03062010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=43.040602,+-87.902234(22175)&iwloc=A&hl=en\"> mufon case (22175) map </A>","Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/22175.html.txt","/var/www/straped/mufon/org/22175.html"],"Viewing Distance":"Over One Mile","Longitude":"-87.902234","Summary":"Looking through plane window I saw four very large lights under the surface of Lake Michigan.","Latitude":"43.040602","Object Flight Path":"Straight-line path","Disposition":"Unknown","divs":["Sighting DetailsI was in Delta Airline flight DL2220 flying from Seattle WA to Detroit. I was looking through the window for most of the flight. At about 6:00am we were flying over a big city probably Milwaukee when I noticed glowing lights at a distance several miles ahead of us. I was suddenly amazed because the lights seemed brighter and bigger the all of the city light combined. It was the brightest light I had seen from a plane window I love sitting in a window seat and looking out. What puzzled me was that the lights looked like they were under water. I had the feeling that we were flying over water so I looked down to make sure. There were few clouds and I could see the rapples on the surface of the water, because the moon was full. I kept looking at the light as the plane got closer. I started getting apprehansive as the plane approached it. It didn't seem man-made. When we finally got over it I was terrified and could look no more because I thought it was going to capture the plane. There was a gentleman sitting in the window seat in front of me. I am sure he saw it too. I think he was affaid too because he turn away too. I wanted to ask him about it but my connecting flight was leaving in a short time and I was travelling two others so I didn't have the time to find him in the airport. Now I going to try to give a detail discripting of the lights. I noticed three lights close together under the surface of the water. The biggest one looked like a giant light bulb. It was several miles in diameter. It was yellowish. The one beside it was a little more the half the size and it was reddish. It was also huge several miles in diameter too. The third one was smaller and greenish. I will assume that it was less the 2 miles in diameter. They were all brighter then any light I have ever seen except the sun. I do not believe they were from this world. There was another light at a distance the size of a city it was greenish but we didn't flying near it. Unless you guys tell me that there are several giagantic under water projects going on in Lake Michigan I going to believe that was extra-terrestial."],"Sighting Duration":"00:10:00","Object Shape":"Circle, Diamond, Oval, Unknown","Case Number":"22175","Region":"Wisconsin","Tags":"City","Date of the Event":"03/02/2010 06:10 UTC","City":"Milwaukee","Date Submitted":"03/06/2010 01:42 UTC","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around March 2nd 2010"]}