{"Viewing Distance":"Unknown","Longitude":"-105.074663","City":"Lakewood","Date of the Event":"03/04/2010 11:15 UTC","Sighting Duration":"Undisclosed","Date Submitted":"03/06/2010 12:41 UTC","Latitude":"39.70581","divs":["Sighting DetailsI had been sitting in my hottub on the north side of my house facing southwest. I had just changed seats to face the northwest and happened to notice lights above and to my north position moving east to west. They had already passed overhead when I saw them. There were 3 lights in a triangular pattern with 2 more lights to the right of the first three. The two individual lights were spaced at equal distances from the group of three. My first thought was an aircraft but there were no red and green recognition lights. Then I noticed that the middle light started moving closer to the farthest light and came to almost appear that it was one light. Then it moved back toward the middle position where it was when I first saw it. The lights then appeared to turn to the northwest and at that time I was unable to see it because of tree branches and homes. After I lost sight of these lights, I scanned the sky for any other lights, aircraft, satellites, etc., but did not see anything other than the familiar stars. The pattern of the three lights was very small and I was unable to see if it was one unit or three seperate lights. I was trying to use background stars as a base of this observation and see if I could see any lights through the center of the three, but was unable to verify. The intensity of the brightness was that of slightly brighter than a satellite passing over, but had greater speed and then gave the appearance to turn. I did not notice any sound from the sighting and there were no other aircraft in the vicinity at the time of this observation. I was in awe when I first saw this as I have almost always been able to identify objects in the sky both day and night. I have been a licensed pilot for 36 years and I am constantly watching aircraft, both civilian and military, as well as satellites which pass overhead in the evening. I was very intrigued to finally see something that I was unable to identify. Would you be kind enough to let me know if anyone else spotted this pattern on the night indicated? I am very curious to know if I was the only one to observe this. Thank you."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.70581,+-105.074663(22174)&iwloc=A&hl=en\"> mufon case (22174) map </A>","files":["/var/www/straped/mufon/html2text/22174.html.txt","/var/www/straped/mufon/org/22174.html"],"Country":"United States","Disposition":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Tags":"City","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around March 4th 2010"],"Object Features":"Unknown","Summary":"Five moving lights in the sky moving east to west and then appeared to turn northwest","Region":"Colorado","Case Number":"22174","Log Number":"US-03062010-0008","Object Shape":"Star-like, Triangle"}