{"Latitude":"41.148006","Tags":"City","Case Number":"22182","Disposition":"Hoax","divs":["Sighting DetailsIn Fairfield, Conn. in either 1965 or 1966 I was 6 or 7 years old playing in the street at dusk with at least 50 other kids. It must of been in the summer for that many of us to be outside. Someone tapped me on the shoulder and said \"Look at that\"! I turned around and saw a disc with two layers of rectangular windows with the lower row of windows being larger. The object had red and green lights and was low and close, being just above the house on one side of the street. I saw three figures in one of the lower windows with the middle one waving back at us (all of the kids were waving at them, we were excited, we were not afraid). I also saw two figures in the smaller window above the larger window, they were not waving. The object made very little noise, just a humming sound. It did a half circle around us. I can't remember how it left. I went inside to tell my unbelieving parents, (of course they heard nothing). The next day the Bridgeport paper had a stock photo of a meteorite on the cover."],"Date Submitted":"03/06/2010 09:32 UTC","City":"Fairfield","Viewing Distance":"21-100 Feet","Date of the Event":"11/30/1964 12:00 UTC","files":["/var/www/straped/mufon/html2text/22182.html.txt","/var/www/straped/mufon/org/22182.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.148006,+-73.255092(22182)&iwloc=A&hl=en\"> mufon case (22182) map </A>","Region":"Connecticut","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Disc","Summary":"Very quite disc with two levels of rectangular windows with the lower one larger than the upper one. Three figures with one waving back at us, two figures in upper window. Object 100' distant.","Longitude":"-73.255092","Country":"United States","trends":["There have been 7 other sightings in Fairfield","There were no other sightings in Fairfield on or around November 30th 1964"],"Object Flight Path":"Hovering then path","Source":"MUFON","Object Features":"Window(s)","Log Number":"US-03062010-0015"}