{"Date Submitted":"03/07/2010 12:10 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.120887,+-117.076521(22183)&iwloc=A&hl=en\"> mufon case (22183) map </A>","Region":"California","Source":"MUFON","trends":["There have been 28 other sightings in Escondido","There were no other sightings in Escondido on or around March 3rd 2010"],"divs":["Sighting DetailsAround 6:45pm on the evening of March 3rd 2010, I was at home watching TV when my father and my brother-in-law had just arrived back from a quick trip to the grocery store to get a few food items for our evening dinner. My father got out of the car and came in through the front door and asked me to come outside and help them unload the items from the trunk of the car in our driveway; as we both walked towards the car from the front door of the house, my father had mentioned that the evening's moonlight was unusually bright and it was helping to put the planets Mars and Venus into plain view and so we all looked upward to see what he was talking about when suddenly my father noticed something else and said \"hey, what is that?\" and he directed both myself and my brother-in-law to look in the direction where he was pointing to - and we all saw two small star like lights moving at a significant rate of speed towards each other directly overhead but slightly to the southwest of us; if these lights had not been moving, then I would say that they would have easily been mistaken for stars, but all the other stars in the night sky were stationary like they usually are, but these two lights were definitely the only two lights that we could see that were moving, and they both appeared to be close enough in the upper atmosphere to be visible, but yet once again I will say that they easily could have looked like ordinary stars if they weren't moving; they were both star-like in appearance but also had a dark reddish glow in the center of them and they seemed to \"sparkle\" just a tiny little bit; one was headed in a northern direction and the other was moving in a southern direction and they were both headed for each other at a pretty good rate of speed in which first appeared to be like they were going to have a head-on collision, but then suddenly the one light that was traveling south abruptly stopped dead in it's path of travel and then the light traveling north stopped abruptlty in front of the other light that just stopped - then the light that was just traveling northward immediately reversed it's direction and began traveling south - it didn't turn around, it didn't spin, it just started moving in the opposite direction that it was just traveling in - so I tracked it with my own eyes for a good several minutes as it continued to travel in a southern direction until it was no longer visible and vanished into the city skyline about where all the street lights begin; the other object that had stopped abruptly was no longer reddish in color and had blended into the night sky along with all of the other stars so we could not identify which light it was. I was so intrigued by this event that it made the hairs stand straight up all over my body and my heart was pounding and I was trying hard to stay focused and let my brain try to comprehend exactly what I was looking at. I didn't take my eyes off it for a even a brief second and I kept shouting to my father and brother-in-law \"do you guys see this too?\" And they were both in shock and awe at what we all were just witness to at that very moment. We are still not sure what it was that we all saw; we have ruled out that it was a satellite or possible piece of space junk re-entering earth orbit because that does not explain the strange movement and behavior of these objects. My father is also a veteran of the Air Force and even he is not aware of any man-made craft that can move like these objects did. My personal opinion is that whatever the object was that abruptly stopped and reversed it's direction had to be under some sort of intelligent control in order to do that kind of movement. Even from watching video footage on TV of the space shuttle and various other man-made space vehicles in flight, I have never seen something move like these lights did in the sky over us that night. This is not the first time that I have personally seen strange things in the sky, but it is definitely the first time that I have felt compelled to come forward and report it without fear of ridicule, especially since it was witnessed by two other people in my family other than myself, and I would be very interested to know if anyone else in our local area also witnessed the same event at the same time on the same evening."],"Date of the Event":"03/03/2010 06:45 UTC","files":["/var/www/straped/mufon/html2text/22183.html.txt","/var/www/straped/mufon/org/22183.html"],"Country":"United States","Latitude":"33.120887","City":"Escondido","Log Number":"US-03072010-0001","Case Number":"22183","Tags":"City","Summary":"two star-like objects in the night sky moving together","Object Features":"Other","Disposition":"Insufficient Data","Object Shape":"Circle, Sphere, Star-like","Longitude":"-117.076521","Viewing Distance":"Unknown"}