{"Object Features":"Undisclosed","Date Submitted":"03/28/2003 11:45 UTC","divs":["Sighting DetailsI woke up to take pain reliever around midnight March 28, 2003. I turned on theTV and sat on the living room couch facing the window on my front porch. I seensomething out of the corner of my eye and turned to look out my window to theEast. I then noticed a person standing in front of the window, looking in. As Istood up it started running across my porch. I quickly went to my front door toget a better look at it as it ran by and looked out the door in time to see whatthis creature looked like as it ran around the corner of my house on the porch.It was a little shorter than average heighthad abnormally long arms, its arms and legs were somewhat spindly thin. It had alarger than normal bald head. I did not get a good look at the face but I couldtell that it was not human. Although it was running somewhat fast, it alsoappeared to be limping like a chimpanzee. I think it was hurt Within a fewseconds of this, the lights went out and I could see two large blue spotlightsin the sky moving as if it was searching for something. The First was in myfield about 50-80ft away and the second was in the field across the street about300 ft. As the moved away, the power came back on. I did notice that it wasunusually quiet during this time and the lights went off in the whole area.This morning I called my friend to ask her if her lights were off and she toldme about the blue lights and her electricity going off. She then told me thatpeople around here dont talk about these things because they will be labeled ascrazy."],"trends":["There has been one other sighting in Capac","There were no other sightings in Capac on or around March 28th 2003"],"City":"Capac","Viewing Distance":"101-500 Feet","Object Flight Path":"Unknown","Tags":"City","Summary":"Alien on my Porch Blue Lights in the Sky","Date of the Event":"03/28/2003 11:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.012551,+-82.934479(2218)&iwloc=A&hl=en\"> mufon case (2218) map </A>","Latitude":"43.012551","files":["/var/www/straped/mufon/html2text/2218.html.txt","/var/www/straped/mufon/org/2218.html"],"Case Number":"2218","Object Shape":"Triangle","Source":"MUFON","Disposition":"Unresolved","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Region":"Michigan","Log Number":"","Longitude":"-82.934479"}