{"Tags":"City","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around March 6th 2010"],"Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"03/07/2010 02:38 UTC","City":"Fresno","map":"<A HREF = \"http://maps.google.com/maps?q=36.752897,+-119.765256(22186)&iwloc=A&hl=en\"> mufon case (22186) map </A>","Summary":"Star like object, bright & multi-colored, blinking in the sky","files":["/var/www/straped/mufon/html2text/22186.html.txt","/var/www/straped/mufon/org/22186.html"],"Viewing Distance":"Over One Mile","Case Number":"22186","Latitude":"36.752897","Longitude":"-119.765256","Weather Factors":"Unknown","Object Shape":"Star-like","Object Flight Path":"Stationary","divs":["Sighting DetailsI was outside with my husband and we noticed what we thought was a beautiful star. We noticed that it was blinking brightly, red - blue - white - and gold. It was 11:25 pm, PST. We were sitting outside drinking a coffee. We looked closer, as none of the other stars were blinking these colors. It was closer than the other stars in the sky. We thought it might be an airplane but it was not moving at all. It never moved except to split itself and then come back together again. Several times in this 10 minute or so period, I could see that the 'star' or orbs would split up, with 4 different stars, different colors, and then they would go back together as one unit. The first thing that made us notice the object was because this star looked extremely brilliant in color. The actions and motions consisted more of bright blinking of red, blue, white, and gold or yellow, splitting apart and then coming back together as if it was one. The first thing we thought it was when we first noticed it was that it was a star. My first feelings were that it was an awfully bright star. Then we realized that it was multi-colored, we thought it might be an airplane. My second thoughts were that it was an UFO. We compared it to the other stars in the sky and they all appeared only white. Plus the objects were closer like we would see an airplane in the sky. I realized even more that it must be an UFO because of the approximate 4 times that I could see the object split away from itself into four different colored lights then back together. It faded out quickly and just disappeared."],"Log Number":"US-03072010-0004","Object Features":"Undisclosed","Date of the Event":"03/06/2010 12:00 UTC","Disposition":"Unknown","Source":"MUFON","Region":"California"}