{"Region":"Florida","Object Flight Path":"Stationary","Longitude":"-82.518997","Country":"United States","files":["/var/www/straped/mufon/html2text/22180.html.txt","/var/www/straped/mufon/org/22180.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.529968,+-82.518997(22180)&iwloc=A&hl=en\"> mufon case (22180) map </A>","divs":["Sighting DetailsLooking toward the west near the horizon I noticed a bright white light as I was getting out of my car to go into the house. The light was strobing on and off, it appeared to be stationary, I stood and watched it for the duration it was in the sky trying to rule out things it could be. The strobing was a faster pace than typical airplanes and it appeared to be one single bright white light, while planes strobe white, red and blue lights. After 2 or 3 minutes the light blinked off and stayed off, there didn't appear to be clouds that it went behind, but it was a little hazy in that direction, I watched to see if it would reappear but it didn't. I also stayed and observed planes fly through that part of the sky, their lights appeared normal, so I don't think it was atmospheric distortion of a normal plane's lights. I checked the satellite tracker on spaceweather.com but there were not satellite flybys during the window of my sighting. I can also rule out a planet or a star shimmering with atmospheric distortion because this light blinked completely on and off with each pulse, it was not a shimmer. So it could have been a balloon with a bright light on it, a plane flying west away from me with unusual lighting or something else. I'm really not sure so I thought I might as well report it here."],"Log Number":"US-03062010-0013","Tags":"City","trends":["There have been no other sightings in Archer","This sighting has never been favorited."],"City":"Archer","Case Number":"22180","Object Shape":"Flash","Disposition":"Insufficient Data","Weather Factors":"None","Date Submitted":"03/06/2010 08:46 UTC","Object Features":"Undisclosed","Date of the Event":"03/06/2010 07:44 UTC","Summary":"Fast pulse stationary white light","Viewing Distance":"Over One Mile","Source":"MUFON","Latitude":"29.529968"}