{"Summary":"Circular Object Passed us High overhead","Log Number":"GB-03072010-0006","Date of the Event":"03/07/2010 01:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.5427,+0.15572(22188)&iwloc=A&hl=en\"> mufon case (22188) map </A>","Country":"United Kingdom","divs":["Sighting DetailsI was round a friends house picking up the kids and myself and two friends were in the back garden. It was a very clear blue sky above and we were noting how many planes were going by. To my left I saw a round white Orb shaped object appear and pointed it out to my friends. One of them commented that it was a balloon, but my other friend said it was way to high and looked too big and I agreed with him. It was moving pretty quickly across the sky and then directly above us stopped dead in its tracks. We all commented if it was a baloon it would not do this. After a brief stop for around 4 seconds, it then continued off to the right across the sky at speed again. I grabbed my phone camera and pointed it skywards. As I hit the camera button, the object simply dissapeared. We all commented how weird it was, there was just no sign of it in the sky anymore and we were all watching it and all saw this thing just dissapear so I couldn't get a picture. What makes this even stranger is a few minutes before I saw a similar object going from North to South above me. Now this was going very quick and I only saw it for a couple of seconds before it dissapeared to my left behind the house. I ran and looked into the direction it was travelling and couldn't see anything. One of my friends asked, what the matter was and I explained I just saw a white orb shape object travelling pretty fast from North to South. So basically a similar object viewed within minutes apart from each other, one traveling quickly North to South, the other West to East. If these were balloons, you wouldnt think they would be going in different directions so quickly and especially strange that one of them just stopped dead."],"Latitude":"51.5427","Case Number":"22188","Disposition":"Unresolved","Tags":"City","Object Features":"Undisclosed","Longitude":"0.15572","Object Shape":"Circle","trends":["There have been no other sightings in Dagenham","This sighting has been favorited 1 time."],"files":["/var/www/straped/mufon/html2text/22188.html.txt","/var/www/straped/mufon/org/22188.html"],"Date Submitted":"03/07/2010 09:01 UTC","Sighting Duration":"00:00:18","Region":"England","City":"Dagenham","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON"}