{"files":["/var/www/straped/mufon/html2text/22199.html.txt","/var/www/straped/mufon/org/22199.html"],"Date of the Event":"03/06/2010 12:00 UTC","Viewing Distance":"Unknown","Longitude":"-86.324253","Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","Latitude":"44.244447","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Disc, Triangle","City":"Manistee","Date Submitted":"03/07/2010 05:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.244447,+-86.324253(22199)&iwloc=A&hl=en\"> mufon case (22199) map </A>","Object Features":"Undisclosed","Case Number":"22199","trends":["There have been 4 other sightings in Manistee","There were no other sightings in Manistee on or around March 6th 2010"],"Summary":"Orange Lights","Log Number":"US-03072010-0017","Region":"Michigan","Tags":"City","divs":["Sighting DetailsI took my kids out to watch the stars at Orchard Beach north of Manistee. We were finding constellations and learning some names of stars. We saw an orange blinking light. It moved from East to West across the sky blinking in uneven intervals. It appeared as if there were more than one point of light. My daughter said \"oh that is an airplane\" \"I said have you ever seen an airplane marked with only orange lights?\" At this point I was still kinda joking about saying. \"nope. UFO. Not an airplane.\" and we were laughing about it. The lights stopped and remained stationary out over Lake Michigan. We continued to look at stars. I decided to get out the binoculars.I looked at the orange lights and saw that it was a perfect triangle of three lights. We all took turns and confirmed what we saw. I did not state to them what I had seen first but asked them to tell me what they saw so I would not implant what I was seeing into their responses. All of us, my wife, my son (12) and my daughter(14). After a few minutes the lights started moving again,it happened as if it was in response to us having realized that it was no airplane, planet, or star that we were looking at. It moved at high speed from West to east, at least 10x faster than the airplanes (blinking with red and blue lights, easily discernible with naked eye and binoculars). When I realized how fast it had to actuall6y be going I ran up a small sand dune so I could continue to watch it and it was no where in sight after only about 5 seconds of having went behind the dune. (The night before my wife and I had seen another strange object that did almost the same thing from Sirius traveling to the south west, hovering for a long time and then returning to where it started. WE were wondering why there were so many orange stars in the sky that we never noticed as kids, they could not all be heading toward supernova.) We looked around the sky and started to look at other orange stars. Several of them were actually triangles made of three orange lights. My daughter and I were watching one just off of north, we turned around briefly to respond to something being said and in the few seconds it took to listen, when we turned around there was one coming fast and low, it had a row of perfectly straight orange lights, it was moving at extremely high speed. As it flew over we could hear the sound of it cutting through the atmosphere. When it was directly over head there was a visible central light concentrically located between the other three, that was not visible before. It was triangular. There was a bubble of distorted light or energy of some kind pulsating from beneath the craft. This was like a purplish or blackish dark cloud or bubble beneath the thing. AS it passed the row of lights looked more curved as it moved away as if the back were more of an eye shape. We watched the orange lights flying around, far off, for about another 15 minutes until the kids got cold. My wife and I went back down there but nothing spectacular was happening then."]}