{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Log Number":"US-03072010-0014","Region":"Texas","Object Shape":"Unknown","Case Number":"22196","files":["/var/www/straped/mufon/html2text/22196.html.txt","/var/www/straped/mufon/org/22196.html"],"City":"Athens","Date Submitted":"03/07/2010 03:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.204874,+-95.855521(22196)&iwloc=A&hl=en\"> mufon case (22196) map </A>","Source":"MUFON","Longitude":"-95.855521","divs":["Sighting DetailsI met this gentleman for the first time, well over a year ago. I was in my front yard with a telescope, upon seeing him I asked him to have a look. The next time I see him he relates this story to me. This happened to him in Athens Texas. At the time we spoke February 18, 2010, the event had just happened approximately ten days earlier. The time of the abduction was 11:00 or 11:30 pm. He was shaking and had goose bumps covering his arms as he was telling me his story. I reported this abduction to another web site but did such a botched job, I felt I had to file it again. Subject got out of a car he was riding in with friends. He was going to walk across a field surrounded by woods to an apartment complex. His reason for not going directly to the apartments was that he did not want someone at the apartments to see him with his friends. As he was crossing the wooded area heading to the field he felt a presents above him. Some how he knew it was a ufo without looking. He started running through the woods to escape. This is when he heard a twitching noise in the bushes in front of him. He turned and ran in a different direction but no mater which way he turned he would hear the same noises ahead. The noises keep him running in a circle. Then he became paralyzed and could only move in a jerking motion and fell to his knees. At this time God told him not to open his eyes. He became weightless for a few moments. Next he was examined with some device that he called a scanner. As it was moved around his head he could hear a buzzing sound similar to a radio being tuned across the band. This devise made his hair stand up as it was moved over his head. As he was relating this to me he was holding both sides of his head as if he were in pain. While in the craft he hears someone say, he is still alive. Then hears someone one else say, I need a transfer then a string of numbers. For some reason he felt that these numbers were very important and related to me that he wished that he could be hypnotized to reveal the sequence. The duration of the time he was abducted was approximately fifteen minuets. He told me that he cried so much that his shirt was soaking wet. The event was so traumatic that he prayed to God that if he made it through the ordeal that he would give his life to God. When he was returned he was standing, his arms outstretched, looking up at the sky. The condition of the sky before the abduction was cloudy, after his return no clouds with the stars clearly visible."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","trends":["There have been 2 other sightings in Athens","There were no other sightings in Athens on or around February 8th 2010"],"Summary":"Man relates to me his abduction.","Country":"United States","Date of the Event":"02/08/2010 12:00 UTC","Object Features":"Undisclosed","Disposition":"Unknown","Latitude":"32.204874"}