{"Disposition":"IFO","Longitude":"-122.295939","Object Features":"None","Object Flight Path":"Path with directional change","Date Submitted":"03/07/2010 10:07 UTC","Viewing Distance":"Unknown","Date of the Event":"02/06/2010 11:00 UTC","Object Shape":"Sphere","trends":["There have been 2 other sightings in Pinole","There were no other sightings in Pinole on or around February 6th 2010"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.008587,+-122.295939(22190)&iwloc=A&hl=en\"> mufon case (22190) map </A>","Latitude":"38.008587","divs":["Sighting DetailsI saw a light in the sky that seemed like a star over the hills in Pinole, CA. It was 11:00 at night and I was outside smoking a cigarrette. The star seemed to have a colored strobe on it but it wasn't moving like most aircraft and remained mostly in place except for motions latarally not vertically. I told my wife as I went into the house and got my telescope from the back bedroom. Once I aquired the object in the viewfinder it became appareant it wasn't as star or a plane. It was clearly a sphere and it radiated a light of all colors; yellow closest to the sphere and red further out, ending in violet. The light were not just light but seemed to be more colored spikes than a light hue from other stars or the moon. It moved back and forth qiuckly in a short pattern like a right triangle. My wife looked through the telescope and confirmed what I saw. We watched it until it left our field of view around 12 a.m. We talked about it and both decided that what we saw wasn't a plane or helicopter or a star. We agreed on the shape and the colorful spikes, and we agreed it was nothing like we had ever seen before. The next night at around the same time it was in the sky again except it was exactly 180 degrees from the first night, meaning it would have been exactly behind me from the first night. It demonstrated the same behavior until disappearing."],"City":"Pinole","Summary":"I saw a light in the sky then I called my wife as I went and got my telescope. We both watched it for 45 minutes.","Log Number":"US-03072010-0008","Country":"United States","Tags":"City","Region":"California","Source":"MUFON","Case Number":"22190","files":["/var/www/straped/mufon/html2text/22190.html.txt","/var/www/straped/mufon/org/22190.html"]}