{"Tags":"City","Disposition":"Unknown","Sighting Duration":"00:00:59","Object Flight Path":"Stationary","Log Number":"","files":["/var/www/straped/mufon/html2text/2219.html.txt","/var/www/straped/mufon/org/2219.html"],"Object Shape":"Oval","Viewing Distance":"501 Feet - 1 Mile","Summary":"I am a skeptic.had 3 encounters could not denunk","map":"<A HREF = \"http://maps.google.com/maps?q=39.204024,+-76.860565(2219)&iwloc=A&hl=en\"> mufon case (2219) map </A>","Object Features":"Other","Longitude":"-76.860565","Weather Factors":"Unknown","divs":["Sighting Details1. I was driving to work at Able Labs in Columbia ,Md.2. The night was clear, quiet and the sky was clear blackrefaction ofnearby light sources notwithstanding The section of roadway was hillyapprox. 200-300 feet rises and dips. I was at the apex of a rise whenI noticed a cigar shaped motionless blackness directly in front of andand maybe 20 ft. above ground. It was almost level with my line of sight.I noticed that it was darker than the night sky which allowed me toperceive its shape. Suddenly, at the center of this motionless cigar,a circular light appeared. As a lifelong medical scietist I have usedand seen white light and its various colors taken apart and used toanalyze unknowns in the lab.spectrophotometry of many types but Inever saw this type of white light before. It did not emit light soas to cast a shadow or enlighten any nearby object. This begs thequestionhow can the eye perceive a light via photon emission whichis apparently absent as the above observation impliesIt was dead silent and moments after the light appeared, thevehicle swooped downward 10--15 feet and then vectored upward intonight sky at a veryvery high rate of speed. Silently, It disappeared"],"trends":["There have been 6 other sightings in Columbia","There were no other sightings in Columbia on or around March 18th 1987"],"City":"Columbia","Date Submitted":"03/18/1987 11:30 UTC","Case Number":"2219","Source":"MUFON","Date of the Event":"03/18/1987 11:30 UTC","Region":"Maryland","Latitude":"39.204024","Country":"United States"}