{"Latitude":"46.255147","Source":"MUFON","Summary":"flashed different colors and looked kinda like a cross","Tags":"City","Weather Factors":"Unknown","Date Submitted":"03/07/2010 06:18 UTC","Object Flight Path":"Stationary","City":"Charlottetown","Object Shape":"Cross","Disposition":"Unresolved","Object Features":"Appendage(s), Wings","Viewing Distance":"Unknown","divs":["Sighting DetailsI was sitting with my friends in my buddies car. I started looking around the sky because the weather had been cloudy for the past week or so, and I was taking this opportunity to enjoy the view. I ended up looking up toward the southwest and there was this light in the sky, it caught my eye because it looked like a cross in the sky. I sat there for about 15 minutes trying to figure out what it was and nothing I had ever seen before looked like this. Then we went to get a camera and the whole time it didn't seem to move from its spot. After we got the camera we went to Wendy's for some food and i started filming it. I ended up calling my friend and asked if he was seeing this. When he called me back i was talking to him and while that was happening a helicopter or plane i don't know what exactly it was dark, but it did have a bright red light flashing on its tail. Anyways when it got close to the object it turned the other way and flew out of sight. After we got some food we went to Victoria park to get a better view of it. Still it hadn't moved and was still flashing colors. I filmed it some more, and as I was doing a plane flew toward it and when it got close to it, it turned back the other way. We ended up watching it till about 11:30 then we had to go. I did see it again around 12 when I went back outside to check if it was still there and it was. I wasn't around when it left but it happened between 12 and 12:30. That was how that happened. But the next night I saw the same object again just floating the and flashing different colors, but this time it was closer and it was more visible. Didn't have a camera tonight because it was too late to get one, being that it was about 11:30 or so when i caught site of this one. This time it was more to the west. My friend and I were driving around when this happened so we decided to follow it and try to get closer to and also find a good dark spot so we could get a better view of it. We ended up driving for a good hour to the west. We ended up stopping at a road out in the country where we had a better view. As we were watching it was moving farther away, but as it did it seemed to dim and then light up quick and then dim out again till it disappeared. The whole event this time was about an hour and a half. The first night i first caught sight of my heart was pounding and it like gave me a burst of energy that lasted for the whole next day. When i seen the second I was surprised because I didn't expect to see it again. Anyways I dont have the original video on this computer but you can see it on youtube.com the name of it being \"UFO floating above Charlottetown PEI March 5,2010\""],"map":"<A HREF = \"http://maps.google.com/maps?q=46.255147,+-63.11256(22204)&iwloc=A&hl=en\"> mufon case (22204) map </A>","Region":"Prince Edward Island","Sighting Duration":"03:00:00","Longitude":"-63.11256","files":["/var/www/straped/mufon/html2text/22204.html.txt","/var/www/straped/mufon/org/22204.html"],"trends":["There have been 6 other sightings in Charlottetown","There were no other sightings in Charlottetown on or around March 5th 2010"],"Date of the Event":"03/05/2010 09:15 UTC","Case Number":"22204","Country":"Canada","Log Number":"CA-03072010-0022"}