{"Object Features":"None","Viewing Distance":"101-500 Feet","Longitude":"-104.817286","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Wyoming","map":"<A HREF = \"http://maps.google.com/maps?q=41.143641,+-104.817286(22205)&iwloc=A&hl=en\"> mufon case (22205) map </A>","Date of the Event":"07/25/2001 12:00 UTC","Tags":"City","divs":["Sighting DetailsWhile visiting my son at F.E.Warren AFB in Cheyenne Wyoming, we all decided to go to the Thunderbirds Air Show in Cheyenne. This is the week that they celebrate the Frontier Days Rodeo event in Cheyenne. After taking many photos of the event ,I found some strange objects in the photos. I have taken thousands of photos over a 33 year period and I have just started reviewing many photos for strange objects. I am concentrating on Air Show photos. Being in the Air Force for 12 Years has put me in contact with many Airshows events over the years. I did not notice the objects at the time but I did easily notice them the other day while looking through all the shots I took that day. I took these photos with a Minolta GSN SLR 1.4 lens with 2oo speed film. This is what I always used to take action photos. I have always taken good care of my equipment and I am sure the objects is not dirt on the lens. I am also sure that the objects are not other planes because the air space would of been prohibited because the Thunderbirds need a very large area to perform. I have researched UFO sightings and have discovered that these objects seem to concentrate near Air Shows, airports, firework shows, military bases and many large sporting events. F.E Warren Air Force Base is a Nuclear Base and in 2001 they were still active with the missle silos located over a three state area. Many silos were concentrated around Cheyenne Wyoming. My son and hundreds of other Security Forces guarded them every day....."],"Case Number":"22205","Country":"United States","Log Number":"US-03072010-0023","files":["/var/www/straped/mufon/html2text/22205.html.txt","/var/www/straped/mufon/org/22205.html"],"Disposition":"Unresolved","Latitude":"41.143641","trends":["There have been 17 other sightings in Cheyenne","There were no other sightings in Cheyenne on or around July 25th 2001"],"Weather Factors":"None","Date Submitted":"03/07/2010 06:20 UTC","Object Shape":"Oval, Other","Object Flight Path":"Unknown","City":"Cheyenne","Summary":"After taking many photos of the Thunderbirds air show in Cheyenne Wyoming I discovered a few photos with objects in them.."}