{"trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around March 6th 2010"],"Weather Factors":"None","Region":"California","Tags":"City","Summary":"Flying higher than planes, moving much slower through the sky, clear for 15 min before disappearing behind clouds.","Date Submitted":"03/07/2010 06:53 UTC","Latitude":"37.348236","Longitude":"-121.885156","Viewing Distance":"Unknown","Case Number":"22208","files":["/var/www/straped/mufon/html2text/22208.html.txt","/var/www/straped/mufon/org/22208.html"],"Log Number":"US-03072010-0026","Source":"MUFON","divs":["Sighting DetailsWe were in San Jose California for a Bar-B-Q. One of the birthday boys was showing me some special Oakley fishing glasses he had received as a present. They had yellow lens, with a blue coating to help see clearly through the water. I was looking through them I looked toward the sky. I was amazed how clear you could see with no glare. As I was looking up, I saw something very high in the sky. There are planes flying low and high in the bay area, this was higher the the furthest plane and jet trail. It was just a white dot to me, but at times you could see a shiny light reflection from the sun. It was moving from east to west, heading out over the Pacific Ocean. My friends were looking at me and asked what I was staring at. I asked if it was to early to see stars since it was only around 4 pm. Thats what it looked like, but it was moving very slowly, way slower than the highest flying jet would appear to fly. It took about 15 minutes just to move a small space in the sky, where even a jet wouldn't take that long. Two of my friends looked to the sky and could see it with the naked eye. We watched it til it slowly disappeared behind the clouds as they moved in from the west. To many clouds followed and we were not able to see it again. I have seen UFO videos on tv and the internet. This reminded me of some of the slow moving, high flying UFO videos I have seen."],"Sighting Duration":"Undisclosed","Disposition":"IFO","Object Shape":"Circle, Star-like","City":"San Jose","Date of the Event":"03/06/2010 04:00 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.348236,+-121.885156(22208)&iwloc=A&hl=en\"> mufon case (22208) map </A>","Country":"United States","Object Features":"Unknown"}