{"City":"Gordon","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.548464,+-98.369216(22207)&iwloc=A&hl=en\"> mufon case (22207) map </A>","Case Number":"22207","Date of the Event":"03/04/2010 08:34 UTC","Tags":"City","Source":"MUFON","Object Shape":"Flash, Other","Country":"United States","Summary":"4 to 5 yellow orange lights in a row.","Date Submitted":"03/07/2010 06:52 UTC","Disposition":"Unknown","Object Features":"Unknown","Longitude":"-98.369216","files":["/var/www/straped/mufon/html2text/22207.html.txt","/var/www/straped/mufon/org/22207.html"],"Weather Factors":"Windy","trends":["There have been no other sightings in Gordon","This sighting has never been favorited."],"Latitude":"32.548464","Sighting Duration":"00:00:30","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI work on a ranch so I am outdoors all the time. At 834pm I left the barn and was walking outside when I noticed 4 to 5 yellow orange lights in a row. They were southeast of Gordon Texas just above the tree line. If I extended my arm towards the lights I could cover them with my thumb. In other words they were not close to me. The lights were very intense. to the right a new light appeared and the far left light disapeared. I went back to the barn to get my phone and when I returned the lights were gone.The total time that I watched them was for a few seconds. I immediatley recognized the formation as I have seen a similar one before. Several months before the big sighting at stephenville Tx, I was on Hwy 6 near Carbon TX. When I saw the lights I was almost directly under them. I stopped behind a trucker and his wife who were looking at them also. This thing was huge.make a fist and extend it to the sky. It was the width of 4 fists. the lights did not move,but rather one new light would form to the right and the far left light would disappear. When the new light was forming it resembled a neon sign that flickers before it comes on completely. In between the lights there were no stars present. But when the left light would disapper stars could be seen. Consequently, when a new light was forming to the right the stars would fade and only the new light and the light next to it could be seen. We also noted a jet flying above the lights in a circular pattern. The jet was making noise but the lights in a row were silent. I do not remember how long we watched it but it traveled west until it went out of our sight. I also do not know how many minutes passed until a new light would form. I was rather excited and did think about that at the time."],"Region":"Texas","Log Number":"US-03072010-0025"}