{"Object Shape":"Triangle","Date Submitted":"03/07/2010 09:40 UTC","Case Number":"22211","Date of the Event":"03/07/2010 12:00 UTC","Country":"United States","Region":"Pennsylvania","Source":"MUFON","trends":["There have been 2 other sightings in New Cumberland","There were no other sightings in New Cumberland on or around March 7th 2010"],"Viewing Distance":"Unknown","City":"New Cumberland","Object Flight Path":"Straight-line path","Longitude":"-76.884696","files":["/var/www/straped/mufon/html2text/22211.html.txt","/var/www/straped/mufon/org/22211.html"],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.232312,+-76.884696(22211)&iwloc=A&hl=en\"> mufon case (22211) map </A>","Latitude":"40.232312","Object Features":"Undisclosed","Summary":"Many flashing lights seen over New Cumberland area","Log Number":"US-03072010-0029","Weather Factors":"None","divs":["sighting detailsaround 9pm i was outside and noticed what i've seen a few times recently. white and red strobing lights in the sky over the lemoyne\\new cumberland area. this time i decided to report it after i noticed two become remarkably close. planes obviously do not fly towards eachother and take up course together unless it's a military mission. after going inside and showing my husband the blinking lights i've been telling him about i decided to go back out. again i witnessed white and red strobing lights (at least 4 at once) in different parts of the sky as i looked towards the new cumberland area. shortly after returning out the second time one flew over my house towards new cumberland. it was triangular in shape judging by the lights. i couldn't see the body of the object just one red strobing light at the front point of the object and white lights on the other two points. it seemed to be moving about the speed of a plane but there was no sound at all. about 3 minutes later another one flew over following the same path. three minutes after that a third one, flying the same direction, passed by but this time more over the neighbor's house. this one had a different configuation of lights. this had two white lights and an amber one. as all this is happening i am continuing to see strobing white and red lights off in the distance up to 4 at a time. i have never witnessed so many of these lights at once or so close. but one thing seems to follow a pattern. i always see these lights in the same area on very clear and stary nights starting anywhere from 9 pm to 10 pm. hopefully if you look out now you can still see them!"],"Tags":"City","Sighting Duration":"Undisclosed"}