{"Object Features":"Unknown","Region":"California","City":"Eureka","Summary":"Large light emitting 2 crafts(flewSE)fire fell from lite object the 2 more objects with lights flew out NE, more fire(hot coals) fell, it flew up and stopped","Source":"MUFON","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 12 other sightings in Eureka","There were no other sightings in Eureka on or around March 6th 2010"],"Latitude":"40.805001","map":"<A HREF = \"http://maps.google.com/maps?q=40.805001,+-124.159763(22219)&iwloc=A&hl=en\"> mufon case (22219) map </A>","divs":["Sighting DetailsI was driving down California St in Eureka California, towards the south. 9:00pm last night 3-6-10 I saw a very very bright light in the sky, dime size, it was to large to be a star, and much to close, the size of a dime in the sky... All of a sudden 2 sets of lights came out of it traveling down and east. The bright object started dumping flaming objects like coals on a barbecue, they were falling to earth but would extinguish before impact. Some were very large, fire also appeared to fall. When this fire stopped 2 more objects with lights came out again, this time flying upwards. The larger object emitted more flame and cinders, I thought something may have been wrong and it was possibly going to fall to earth, instead it flew straight up until it became very small and stopped. The fire stopped. It suspended itself at that elevation until the fog covered it and I could no longer see. I know several others stopped their cars to watch as did I. Please respond if you saw this too...pc_dynamics@yahoo.com I was in Eureka California on California street heading south I looked because it was a huge bright ball in the sky resembling a very large star but way to close to be a star I thought it was a UFO as it could have been nothing else Its actions were as stated above,after being to close to be a star and after all the action this object flew straight up until it looked like a star off in the far distance and stayed there until I could no longer see it due to the fog. I was frightened for the people who may have lived below the object and thought possibly they were in danger of it crashing down, I began to cry, to much fire and embers to have this ship in proper order"],"Object Shape":"Circle, Star-like, Other","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Tags":"City","Weather Factors":"Unknown","Log Number":"US-03082010-0004","files":["/var/www/straped/mufon/html2text/22219.html.txt","/var/www/straped/mufon/org/22219.html"],"Case Number":"22219","Country":"United States","Longitude":"-124.159763","Date of the Event":"03/06/2010 12:00 UTC","Date Submitted":"03/08/2010 01:58 UTC"}