{"Date of the Event":"03/04/2010 05:30 UTC","Longitude":"-122.763866","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.440329,+-122.763866(22218)&iwloc=A&hl=en\"> mufon case (22218) map </A>","Log Number":"US-03082010-0003","Object Features":"Undisclosed","trends":["There have been 11 other sightings in Tigard","There were no other sightings in Tigard on or around March 4th 2010","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Disposition":"IFO","Summary":"Strange Cloud Formation In Portland Skies - Pics Need Enhanced","City":"Tigard","Country":"United States","divs":["Sighting DetailsI was driving to class at Portland Community College at 5:30 pm. I was heading up I5 going north toward Portland and noticed a very strange cloud formation. From the looks of it, and the area, it appeared to clearly be an exhaust trail from a plain, but it does not look conventional. I had my girlfriend snap a few pictures while I was driving with the camera phone. You can sort of see them, but the pics need to be enhanced if anyone can do that for me that would be great! In one of the pics I drew an outline next to the exhaust trails of what we actually saw. Some of the lines were to reference other exhaust trails that appeared to be flying along side of this craft that looked more normal. Because of the very sharp turns and movement that had to be involved I do not believe this was something our government has, or would be flying in daylight over a big city."],"Weather Factors":"Unknown","Date Submitted":"03/08/2010 01:36 UTC","Latitude":"45.440329","Source":"MUFON","Tags":"City","Case Number":"22218","files":["/var/www/straped/mufon/html2text/22218.html.txt","/var/www/straped/mufon/more/22218_submitter_file1__WeirdExhaustTrail1.jpg","/var/www/straped/mufon/more/22218_submitter_file2__WeirdExhaustTrail2.jpg","/var/www/straped/mufon/more/22218_submitter_file3__WeirdExhaustTrailOutline.jpg","/var/www/straped/mufon/org/22218.html"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Unknown"}