{"trends":["There have been no other sightings in Fort Yukon","This sighting has never been favorited."],"Tags":"City","divs":["Sighting DetailsMy name is James Beaman. From Jan 1974 thru December 1975 I was stationed at Ft. Yukon Acws site in FT Yukon Alaska, which is part of the early warning system. The site was manned By USAF personell. Many times during the evening shifts we would get radr images of unidentified aircraft molesting civilian aircraft bound to different destinations through out the world. These aircraft were incredibally fast and could turn on a dime. We had several times that the aircraft in question would molest an SR 71 heading through Alaskan airspace. You know haw fast the SR71 is. The manual ground speed, as dertermined by the operatoers was over 2600 hundred miles per hour. These craft would com in from different headings and molest the aircraft for a few minutes and then spead away in some different direction. Some of these turns were impossible for the Military and the civilian aircraft. When these air space incursions happened to militarry and civilian aircraft alike Anchorage Center would yell on the hot box if we had any military aircraft molesting the civilan aircraft. Our proceedure at the time was to turn on the scope camera to record the incidents. I am sure there are records of these interdictions In the USAF files if you know what to look for. The reason I am writing this letter today Is that I am watching the story of the JAL pilot that saw a UFO over alaske in the 1980's. I want to tell you that I am sure this Pilot saw wahat he saw. If you look deeper into the incedents over Alaskan Air Space you will definately find the proof you need. I am not sure what the USAF did with the record of these incursions. But I know they happened and there is alot of Guys stationed in Fort Yukon Alaska that could tell you more about these incidents."],"Object Features":"Undisclosed","Log Number":"US-03072010-0032","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"05/09/1974 06:14 UTC","Case Number":"22214","Latitude":"66.56735","Longitude":"-145.25134","files":["/var/www/straped/mufon/html2text/22214.html.txt","/var/www/straped/mufon/org/22214.html"],"Country":"United States","City":"Fort Yukon","map":"<A HREF = \"http://maps.google.com/maps?q=66.56735,+-145.25134(22214)&iwloc=A&hl=en\"> mufon case (22214) map </A>","Source":"MUFON","Date Submitted":"03/07/2010 11:04 UTC","Summary":"Radar aquasiton of object","Object Shape":"Cigar","Region":"Alaska","Disposition":"Unknown","Weather Factors":"Unknown"}