{"Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Does Not Apply","Date of the Event":"03/07/2010 09:15 UTC","files":["/var/www/straped/mufon/html2text/22213.html.txt","/var/www/straped/mufon/org/22213.html"],"Object Shape":"Triangle","Case Number":"22213","trends":["There have been 6 other sightings in Mt Clemens","There were no other sightings in Mt Clemens on or around March 7th 2010"],"City":"Mt Clemens","Tags":"City","Region":"Michigan","Country":"United States","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"00:13:13","Disposition":"Unknown","Log Number":"US-03072010-0031","Date Submitted":"03/07/2010 11:02 UTC","Latitude":"42.606256","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.873275","divs":["Sighting DetailsOn my way home from shopping,9:15 PM I was Driveing North On M-97 (Grosebeck) Looked to the West Sky saw a Plane or Chopper (3000 ft) with Lights Blinking following It was a Very Large V(Triangle)(Longer then Wide) Red lights on three tips. I pulled Over to get a better Look acrossed from Citgo at about Harrington Street.Wile I was Viewing It I tried to get a Pic then I tried for one more.9:20 PM It banked Right. I then pulled In to a Parking Lot and could see It Stoped Moveing and there was a 2nd One Up there as well.Then the Red Lights went Out.There were 3 yellow lights on the tips of each. It looked like 2 V's Over Mt.Clemens,Mi. On my way home when I was heading East On 23 Mile Rd I saw a Van Stopped on the side of the Road and a man was Looking In to the Sky. I pulled Over Once More then Noticed the Sky was Clear Loads of Stars In the Sky.Unlike Mt.Clemens Stars were not In eye shot nor In the Two Pic I took. So now that I could see the sky was clear It could have been (10,000 ft) This Is for Real I will Not consent to the release of my contact information to third parties who are not connected or affiliated with MUFON Untill I know who and where there from."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.606256,+-82.873275(22213)&iwloc=A&hl=en\"> mufon case (22213) map </A>","Summary":"Large V following an aircraft with glowing red on three points."}