{"Weather Factors":"Unknown","divs":["sighting detailsit was 11 pm on thursday night, march 4, 2010. i was alone in my hot tub taking a quick dip. i don't drink. my vision is good. i had been to the eye doctor for an exam that same day. i am 20\\20 with glasses. i was just looking at the sky and relaxing. suddenly a brilliantly lit white ball just showed up in the sky. i can't determine exactly how far away it was or how high it was in the sky. i would estimate that it was between a half mile to a mile away and probably between 500 feet and one mile high. i was startled to see it. at first, i thought that it was a falling star. it didn't move at first and was way too bright for a falling star. it then moved from south to north in a very controlled manner. there was no sound. i have been around planes and other aircraft my entire life. it was nothing like i had ever seen before. it flew to the north at an incredible speed. within approximately 7 seconds, it just disappeared. i would be surprized if others did not see it. it flew right over i-40 at the western edge of albuquerque. it was very, very bright. there were no clouds that night. there was no wind. it was a clear, beautiful night. i am just curious to see if any others saw this. i am also curious to see if the object can be identified. it has me very puzzled."],"Country":"United States","Date of the Event":"03/04/2010 11:00 UTC","files":["/var/www/straped/mufon/html2text/22222.html.txt","/var/www/straped/mufon/org/22222.html"],"Disposition":"Unknown","Sighting Duration":"00:00:07","Case Number":"22222","Region":"New Mexico","Object Flight Path":"Undisclosed","Summary":"A brillantly lit ball suddenly appeared in the sky. No noise detected. It flew from south to north and then disappeared.","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around March 4th 2010"],"Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"03/08/2010 05:23 UTC","Object Shape":"Circle","Latitude":"35.086381","Longitude":"-106.641627","City":"Albuquerque","map":"<A HREF = \"http://maps.google.com/maps?q=35.086381,+-106.641627(22222)&iwloc=A&hl=en\"> mufon case (22222) map </A>","Viewing Distance":"Unknown","Tags":"City","Log Number":"US-03082010-0007"}