{"trends":["There have been 2 other sightings in Staunton","There were no other sightings in Staunton on or around March 8th 2010"],"divs":["Sighting DetailsI first saw a very bright light (as bright as noon day sun), shortly after sundown - about 1850 hours, in the distance over the Blue Ridge west of Staunton, VA from my kitchen window. I got my binoculars, 10 power, and went outside. With the binoculars I saw four very bright lights close together moving slowly to the West. Approximate distance 10 miles. As I watched the four lights, three of them appeared to spread out like a fireworks multicolored starburst. Then, I noticed another object lower on the horizon a few miles to the north and further away doing the same thing. These were not airplanes or helicopters, I have been around enough of both in the military to know the difference. This happened on 3-8-2010. The object was moving slowly toward the West probably not more than 10 miles per hour. Altitude estimate about 2000 feet above the mountain tops for the first object, perhaps lower for the second object. It was a very clear night with excellent visibility. I lost sight of the object as it moved slowly to the west over the horizon."],"Region":"Virginia","files":["/var/www/straped/mufon/html2text/22228.html.txt","/var/www/straped/mufon/org/22228.html"],"Latitude":"38.151906","Disposition":"Unknown","Source":"MUFON","Date Submitted":"03/09/2010 10:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.151906,+-79.069946(22228)&iwloc=A&hl=en\"> mufon case (22228) map </A>","Tags":"City","Object Shape":"Circle, Star-like","Log Number":"US-03092010-0002","City":"Staunton","Object Features":"Unknown","Date of the Event":"03/08/2010 06:50 UTC","Weather Factors":"None","Longitude":"-79.069946","Case Number":"22228","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Summary":"Four very large, bright lights becoming starburst-like, multicolored.","Country":"United States"}