{"Weather Factors":"Unknown","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Object Shape":"Other","Tags":"City","Object Flight Path":"Straight-line path,Unknown","Latitude":"32.647254","Log Number":"US-03092010-0001","Country":"United States","Object Features":"Undisclosed","Longitude":"-117.077676","Date Submitted":"03/09/2010 01:45 UTC","Case Number":"22227","Summary":"Flying Humanoid","files":["/var/www/straped/mufon/html2text/22227.html.txt","/var/www/straped/mufon/more/22227_submitter_file1__FLYINGHUMANOID.jpg","/var/www/straped/mufon/org/22227.html"],"trends":["There have been 11 other sightings in Chula Vista","There were no other sightings in Chula Vista on or around March 3rd 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was in a friends backyard and he suddenly starts telling me that he had been mowing his lawn and just by happenstance caught something out the corner of his eye. He looked up to see what he immediately called a Flying Man. He looked at it for 4-5 Secs and yelled out to his brother who was working with him to come quickly and see this thing. His brother ignored him. He ran over and dragged his brother to the spot. His brother could not see it and walked away. He watched for a few seconds and again went and dragged his brother to the spot at which time neither could see it. Viewed from it's left side and below, it was a 7' tall man in a Copper Colored fitted shell that was metallic looking reflective material. It was 1.30 pm in the afternoon ,bright sunshine and mostly blue skies. The Flyer was ascending at a 35 degree incline at walking speed. From its elevation he thought it might have left the ground 30 secs prior. He estimates it was eighty feet away at about 30' elevation ( right over a telephone poll he used for distance) and he had a clear unimpeded view. The flyer had a forward tilt, Ski Jumper attitude and was climbing slowly and silently. The shape was immediately recognizable as a man wrapped in an aerodynamic shell. The hooded head and shoulders were smoothed together ,the chest was large 3' plus across. It tapered down to what was obviously feet pointing down. He really wasn't thinking about it too deeply because it didn't make sense to him. He had never heard about the Flying Humanoids and was relieved to have me give some credence to his account. His brother was non responsive to the whole affair and only after I told them about this phenomenom did he think his brother might have actually seen something. Which is strange because he was uncharacteristically being yelled at to come quickly. He said his brother was definitely worked up, instantly. We looked at a map and determined the starting point might well be a Big Church that takes up a large area. He drew the Flyer and captured its simplicity. The brothers are keeping their eyes to the sky."],"Date of the Event":"03/03/2010 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.647254,+-117.077676(22227)&iwloc=A&hl=en\"> mufon case (22227) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Chula Vista"}