{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/22231.html.txt","/var/www/straped/mufon/more/22231_submitter_file1__7-29-01FRONTIERDAYSCHEYENNEWYOMING--THUNDERBIRDS--KENPFEIFER--PIC1.JPG","/var/www/straped/mufon/more/22231_submitter_file2__7-29-01FRONTIERDAYS--CHEYENNEWYOMINGTHUNDERBIRDSSHOW--KENPFEIFER--PIC3.JPG","/var/www/straped/mufon/more/22231_submitter_file3__7-29-01FRONTIERDAYS--CHEYENNEWYOMINGTHUNDERBIRDSAIRSHOW--KENPFEIFER--PIC4.JPG","/var/www/straped/mufon/org/22231.html"],"Latitude":"41.148731","Summary":"I captured many UFO's while photographing the Thunderbirds demonstration team in Cheyenne.","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Egg, Sphere","Region":"Wyoming","trends":["There have been 17 other sightings in Cheyenne","There were no other sightings in Cheyenne on or around July 29th 2001","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.148731,+-104.810996(22231)&iwloc=A&hl=en\"> mufon case (22231) map </A>","City":"Cheyenne","Log Number":"US-03092010-0005","Date Submitted":"03/09/2010 02:45 UTC","Sighting Duration":"Undisclosed","Date of the Event":"07/29/2001 12:00 UTC","Country":"United States","Case Number":"22231","Object Features":"None","Tags":"City","Longitude":"-104.810996","Source":"MUFON","divs":["Sighting DetailsWhile visiting my son at F.E. Warren Air Force Base in Cheyenne Wyoming, we decided to see the Thunderbirds show on July 29th. Cheyenne celebrates the Frontier Days rodeo event every year and the Air Force Thunderbirds are a big part of that celebration. I took a couple rolls of film that day while watching the Thunderbirds perform their fly-bys and aerial stunts. My camers was a Minolta GSN SLR 1.4 lens and I was using 200 speed film for the event. I did not see anything unusual in the sky at the time but I just recently noticed objects in the photos I took back in 2001. I was in the Air Force for 12 years and I have been to many air shows over the years with my family. I am starting to review all of my aerial shots from past air shows. I have accumulated a few hundred. After extensive research into the subject it has occured to me that these objects are seen near Air Shows, fireworks displays, military bases, air ports and rocket launches. F.E Warren was home of the Space Command and my sons primary duties was to guard the silos in a three state area because he was attached to the Security Forces at Warren AFB. I hope these photos, I took that day, prove that there are some strange things going on in our airspace. I have always kept great care in my equipment so I know that the lens and inner reflective surfaces within the camera was clear and dust free. Thanks"]}