{"Date Submitted":"03/09/2010 05:50 UTC","Longitude":"-104.82871","City":"Aurora","Object Features":"Undisclosed","divs":["Sighting DetailsI first noticed very large long puffy 'chemical' exaust trails turning into puffy 'clouds' on 9-11-09, last year, the trails are very long, persistant, numerous and very suspicious, The trails on that day were created by 3 large white planes flying in a \"V\" formation over Denver at 10am in the morning,Ive been photographing them on occasion ever since. They seem to appear mostly on cloudless days,start in the morning and increase throughout the day, also seem to occur more on weekends then week days. I see them while going to work, riding my bike and at times photograph them from inside my car. Sometimes they are so large and right above Me that I can take a great photo, I dont beleive them to be standard jet trails or plane exhaust, I beleive they are the product of a \"cloud cover\" program involving global warming or perhaps a military program of somesort,I also see them in the backrounds of TV shows filmed recently, They are very obvious. My feelings about this situation is that someone is commiting a crime by doing this to our skies, It doesnt seem right and there will be negative consequences to this activity in the near future."],"trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around November 15th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.735232,+-104.82871(22232)&iwloc=A&hl=en\"> mufon case (22232) map </A>","Country":"United States","Tags":"City","Date of the Event":"11/15/2009 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"39.735232","Object Flight Path":"Undisclosed","Object Shape":"Other","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/22232.html.txt","/var/www/straped/mufon/org/22232.html"],"Case Number":"22232","Summary":"Numerous persistant mysterious Jet-Chemical Trails","Source":"MUFON","Log Number":"US-03092010-0006","Region":"Colorado","Disposition":"Hoax"}