{"Sighting Duration":"Undisclosed","Country":"United States","City":"North Pole","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/22235.html.txt","/var/www/straped/mufon/org/22235.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=64.751111,+-147.349444(22235)&iwloc=A&hl=en\"> mufon case (22235) map </A>","Summary":"A bright yellowish white sphere about 40' across","divs":["Sighting DetailsI was a USAF Special Agent assigned to the AFOSI on Eielson AFB, AK. We were running an investigation on the munitions site up the hill from the main base. I had to go up the hill in the middle of night to change tape in the video recorder we had placed outside the site. As I was locking up the box, I saw lights coming up the hill from the main base. At first I thought it might be the Security Police coming up,but did not hear a vehicle. I stood there in the trees watching as this bright light came over the top of the trees. It did not make any noise at all and seemed to glide just over the tree tops as it continued over the crest of the hill to my right as I faced the munitions area. It appeared to be about 40+ feet across. I thought for a second to pull my gun out and shoot at it, but didn't want to end up as dust where I stood if it was a UFO. After it passed, i ran to my truck and sped down the hill and and went to base ops and asked if there was anything flying at that time that showed up on radar. I was told no and was asked why,but I did not say because of my position and was not sure as to what I saw."],"Log Number":"US-03092010-0009","Object Flight Path":"Straight-line path","Latitude":"64.751111","Object Shape":"Circle, Fireball, Sphere","Object Features":"Undisclosed","Viewing Distance":"21-100 Feet","Longitude":"-147.349444","trends":["There has been one other sighting in North Pole","There were no other sightings in North Pole on or around January 20th 1999"],"Weather Factors":"Unknown","Region":"Alaska","Date of the Event":"01/20/1999 02:30 UTC","Disposition":"Unknown","Case Number":"22235","Date Submitted":"03/09/2010 09:58 UTC"}