{"Longitude":"-82.106484","Source":"MUFON","Log Number":"US-03092010-0012","Region":"Florida","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsBlack Triangle UFO with 3 Dimly Lit lights, 1 in each corner, made no noise, flew over Plant City FL. Estimated distance from ground to air: 1,000 feet. Flight direction: North by North West. Estimated speed: 120 MPH. I went out in my back yard for a few moments tonight and by chance I looked up during that time to enjoy the clear sky's and bright star night when I noticed an object moving north by north west very fast. Due to it's dark color blending in with the night sky backdrop, it took a moment to judge it's shape. There was no noise at all and it had 3 dimly lit lights, 1 in each of it's 3 corners. It was a large black triangle. When a plane or helicopter fly's over our area at low or high altitude, within a few seconds or sooner you can here it's propeller or jet sound depending on how high it is. This made no noise at all. I observed it for about 30 seconds until it flew out of sight. No other details. Attached is almost an artist render of the object that flew over. Thank you."],"Country":"United States","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Case Number":"22238","City":"Plant City","Date of the Event":"03/09/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.019982,+-82.106484(22238)&iwloc=A&hl=en\"> mufon case (22238) map </A>","files":["/var/www/straped/mufon/html2text/22238.html.txt","/var/www/straped/mufon/more/22238_submitter_file1__UFO-Triangleexample1.jpg","/var/www/straped/mufon/org/22238.html"],"Date Submitted":"03/09/2010 11:48 UTC","Latitude":"28.019982","trends":["There have been 9 other sightings in Plant City","There were no other sightings in Plant City on or around March 9th 2010","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Features":"None","Object Shape":"Triangle","Summary":"Black Triangle UFO over Plant City FL"}