{"Date of the Event":"03/06/2010 10:48 UTC","Weather Factors":"Windy, Light","map":"<A HREF = \"http://maps.google.com/maps?q=28.046185,+-81.948804(22230)&iwloc=A&hl=en\"> mufon case (22230) map </A>","City":"Lakeland","Log Number":"US-03092010-0004","Object Features":"Unknown","Disposition":"Insufficient Data","Source":"MUFON","divs":["Sighting DetailsI saw something on March 6. I was driving by Lakeland Florida airport. From a distance I thought it was just several planes flying in a close formation but that is explainable because they may have been landing. When I got closer I saw that there were seven small blue blinking lights like you would see on the bottom of airplanes. It was these flashing lights that lead me to believe they were planes at first. As I got even closer I saw that they were completely still. Totally frozen. Hovering motionless. It couldn't be planes. They can't hover. The lights were pretty close together. They formed kind of a long triangle? Not the usual triangle that people see. The people in my car said maybe they are. Why would seven soundless helicopters sit there hovering in the dark without their search lights on? It didn't even move a little like balloons would. Me and everybody in the car came to the conclusion that it was a ufo. I don't know that it was aliens but it was weird. Other cars on the highway were looking up at it too, so we weren't drunk or hallucinating. The lights weren't randomly scattered. They were in a geometric formation witch lead me to believe it was one craft. We were on the highway so we didn't stop but as we kept driving we saw two or three more of these lights higher up and not close to the craft. The were the same exact blue blinking lights that blinked on and off about once every second. I would have just thought they were stars if I hadn't just seen the same thing closer up in a formation. Also, in the past around a year ago I saw what looked like a rod. I was in Miami and it was during the day. The rod was really far away and the way that the sun reflected on it made it not possible to be a cloud. As I kept looking at it I thought that it probably wasn't a plane cause it was going really slow but I wasn't sure because again it was far away. All of a sudden it shot off and disappeared. One time I was in a car in Orlando and I saw a white ball floating in the distance. But since the car was in motion the tree line got in front of it for about 6 second. When i could see the place it was again it was gone. The last two sightings I didn't think much of but I thought I would let you know since I was making a report anyway. The first one though was really weird and I'm positive it was not explainable by known aircraft. When I fill out the report I will be doing so for the lights at the airport. For the degrees of angles you should know that I drove up to and under it. For the distance I don't have a good idea of how far up things are but it was close and it was lower than where clouds are."],"Object Shape":"Cross, Flash, Star-like, Triangle","files":["/var/www/straped/mufon/html2text/22230.html.txt","/var/www/straped/mufon/org/22230.html"],"Tags":"City","Object Flight Path":"Stationary","Case Number":"22230","Summary":"A triangle like object with flashing blue lights at airport.","Date Submitted":"03/09/2010 12:28 UTC","Longitude":"-81.948804","Region":"Florida","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around March 6th 2010"],"Latitude":"28.046185"}