{"Date of the Event":"03/07/2010 01:00 UTC","Case Number":"22247","Longitude":"-105.00835","Disposition":"Unknown","City":"Littleton","Log Number":"US-03102010-0007","Viewing Distance":"Over One Mile","Latitude":"39.619721","Object Flight Path":"Path then hovering","Weather Factors":"None","Country":"United States","trends":["There have been 29 other sightings in Littleton","There were no other sightings in Littleton on or around March 7th 2010","This sighting has never been favorited.",""],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.619721,+-105.00835(22247)&iwloc=A&hl=en\"> mufon case (22247) map </A>","Region":"Colorado","Summary":"Sloowly moving very large object which either changed shape or spun and rolled","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI looked up in the sky south of my house in Littleton, Colorado and saw a very large odd shaped object low in the sky to the south west, moving slowly down or South, going slowly behind the house across the street. It could have been over Lockheed Martin Space Systems, but I couldn't judge the distance perfectly. I went in the house to get binoculars and it was gone. I got in my car and drove to a point a block away where I could see it again. I watched it through my binoculars for about 5 minutes or so. It changed shape the whole time I watched it, about a mile or so away (I guess)and forty feet long (I guess), but it was hard to tell if maybe it was farther and bigger. It wasn't closer I'm sure. I thought maybe it was a weird balloon or something twisting and rotating in the wind, but it wasn't anything like a hot air balloon or aircraft that I have ever seen, and didn't seem to be moving anymore. I drove to get a closer look and it was suddenly gone, so I doubt it was a balloon, because it had vanished while I was driving towards it. It was there one minute and gone the next. I didn't see it disappearing or moving away which I should have because I was keeping a close eye on it, because I was looking away periodically in order to drive."],"Tags":"City","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/22247.html.txt","/var/www/straped/mufon/more/22247_submitter_file1__UFOsketch.jpg","/var/www/straped/mufon/more/22247_submitter_file2__UFO.jpg","/var/www/straped/mufon/org/22247.html"],"Source":"MUFON","Date Submitted":"03/10/2010 06:55 UTC"}