{"Country":"United States","files":["/var/www/straped/mufon/html2text/22249.html.txt","/var/www/straped/mufon/org/22249.html"],"Log Number":"US-03102010-0009","City":"Goldfield","Longitude":"-117.235713","Latitude":"37.708448","divs":["Sighting DetailsI WAS SOUTH BOUND ON HWY # 95,WHEREUPON I OBERVED A LARGE BALL OF LIGHT HOVERING ABOVE. UPON APROACHING THE DEVICE I NOTED THE OBJECT ROUND IN SHAPE AND HAVEING A SEMI-TRANSLUSCENT APEARANCE. FURTHER INVESTIGATION REVEALED THAT THE ABOVE DISCRIBED OBJECT WAS PROCEEDING NORTH BOUND WITH NO APPEARANT SOUND AND OR ENGINE TO PROVIDE POWER. THE UFO PROCEEDED OUT OF MY VIEW AND WAS SUSEQUENTLY OBSERVED SOUTH BOUND FROM MY LOCATION.I SUBSEQUINTLY TRANSMITTED ON MY C.B. RADIO THAT I OBSEREDD MY FIRST UFO! AT THAT TIME AN UNIDENTIFIED MALE INDIVIDUALS VOICE CAME ON CHN 19 AND STATED ( O-WHAT DIRECTION WAS IT TRAVELING?) I DIDNT RESPONED. THE OBJECT WAS APOX.30FT. IN DIAMETER AND HAD NO APPEARANT PHYSICAL MATTER OR SUBSTANCE TO IT OVER ALL STRUCTURE!AT THE TIME OF THIS INCIDENT I WAS SOUTH BOUND ON HWY#95 IN AN 18 WHEELER TRUCK..PRIOR TO TRUCK DRIVING I WAS IN THE U.S. ARMY INWHICH I WAS A C.I.D. AGENT. I SUBSEQUENTLY SPENT ANOTHER 15 YRS. IN LAW ENFORCEMENT I FEEL MY PRIOR BACKGOUND JOB DUTIES MY HELP SUBSTANTIATE THE ABOVE GIVEN INFORMATION ON THE UFO. INCIDENT? FURTER INVESTIGATION WITHIN THE PAST FEW YREARS ON MY PART REVEALED THAT THE SAID ABOVE DISCRBED MY IN FACT BE A DEVICE USED BY THE U.S. IN REGARD TO ANTI-GRAVITY TRAVEL???"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.708448,+-117.235713(22249)&iwloc=A&hl=en\"> mufon case (22249) map </A>","Viewing Distance":"501 Feet - 1 Mile","Case Number":"22249","Date of the Event":"06/25/1998 12:00 UTC","Weather Factors":"None","Object Flight Path":"Hovering then path","Summary":"500FT.ABOVE ROADWAY--BRIGHT LIGHT--- NO SOUND.","trends":["There has been one other sighting in Goldfield","There were no other sightings in Goldfield on or around June 25th 1998"],"Source":"MUFON","Tags":"City","Region":"Nevada","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Date Submitted":"03/10/2010 09:45 UTC","Object Shape":"Sphere"}