{"Date of the Event":"03/06/2010 08:05 UTC","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=47.757085,+-122.155848(22241)&iwloc=A&hl=en\"> mufon case (22241) map </A>","Sighting Duration":"Undisclosed","Latitude":"47.757085","Object Features":"Unknown","Longitude":"-122.155848","Country":"United States","Source":"MUFON","Object Shape":"Other","Date Submitted":"03/10/2010 01:05 UTC","trends":["There have been 4 other sightings in Woodinville","There were no other sightings in Woodinville on or around March 6th 2010"],"City":"Woodinville","divs":["Sighting DetailsIt was a clear night. I was walking between house an shop admiring the stars on such a clear night when I noticed an unusually bright light south-south east of our house. It is hard to estimate the distance, however I would estimate it was between 5 and 10 miles. The light was flashing in a seemingly random pattern. Each color was turning on and off independent of the other. The on time of each color seemed to be random also. When a color turned on or off it was instantaneous, unlike a light bulb. When I first saw these lights I watched for several minutes to see if it was moving. It was not traversing in any direction. My perspective was that the object was jerking around a central point possibly in a tight pattern. The light was brilliant enough to cause it to appear like a point source light causing a dancing star like optical pattern. I observed the light also with binoculars exhibiting the same visual effects. I wanted confirmation as to what I was seeing, so I asked my wife to come out and look at the object. She did observe the object for several minutes until she got cold and went indoors. The only difference in her observation, was she did not think the object was moving at all. Since it was cold outside that night, we stopped observing while it was still present. I checked the position of the common planets (online) and there were none in that part of the sky that night. This light was magnitudes brighter than anything else visible in the sky that night. I am a private pilot and can verify this definitely was not an aircraft. We live under the SeaTac airspace and have aircraft transit this area often, so we are quite familiar with the appearance of aircraft. I realize this may not be highly accurate, but I thought it may have some significance."],"Weather Factors":"Does Not Apply","Summary":"Very bright red and white lights flashing in random time patterns remaining in same position.","Case Number":"22241","Disposition":"IFO","Region":"Washington","Log Number":"US-03102010-0001","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/22241.html.txt","/var/www/straped/mufon/org/22241.html"],"Tags":"City"}