{"Date Submitted":"03/10/2010 05:52 UTC","files":["/var/www/straped/mufon/html2text/22246.html.txt","/var/www/straped/mufon/org/22246.html"],"Source":"MUFON","divs":["Sighting DetailsI was outside with 2 of my close friends smoking a cigarette when i observed the orb above a building in the distance. we were on my college campus and when i first saw the light, i thought nothing of it. when i noticed it had dramatically changed position in the sky compared to the building and surrounding trees i pointed it out to my companions and they both saw it. we then observed the \"orb\" to move from right to left, down behind the building in the distance, rise back above the top of the building, then move even further to the right. at this point me and one of the two friends decided to travel across campus to the nearby field and observe the light without and buildings in the way. the campus rests on top of a rather large hill, so we were able to get a clear view of the object from where we ended up. from here we were able to see the object in a much clearer view. on that particular night, the stars were out in full view, and when comparing the object to the stars in the sky, we were able to conclude then that the object was far too low in the sky to be a star, too large and bright to be a star, and didnt appear to be millions of light years away, as it was only just above the horizon, which isnt ordinarily where stars are so clearly visible in the early evening sky. from here we continued to view the object for about 30 minutes before we were joined by another friend, who was unable to come up with any sort of rational explanation as to what the object could be. we continued to view the object until we thought that it must just be something natural, but when we started off to head back inside, i watched the object vanish from the skyline, as if someone had flipped a switch on the light to make it turn off. seeing how stars, planes, helicopters, and various other explanations could not account for a silent, slow moving, hovering bright orange orb in the early evening sky, i can account for nothing else other than some sort of object which i dont have any reasonable explanation for it, so i turn here. friends, what do you think?"],"Weather Factors":"Unknown","Longitude":"-70.435885","Country":"United States","Object Flight Path":"Undisclosed","Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=43.686751,+-70.435885(22246)&iwloc=A&hl=en\"> mufon case (22246) map </A>","Case Number":"22246","Sighting Duration":"00:45:00","Date of the Event":"12/29/2009 08:00 UTC","Latitude":"43.686751","trends":["There have been 2 other sightings in Gorham","There were no other sightings in Gorham on or around December 29th 2009"],"Region":"Maine","Summary":"Bright orange silent slowly moving orb hovering moderately above treeline/ horizon.","Log Number":"US-03102010-0006","Viewing Distance":"Unknown","Disposition":"IFO","Object Features":"Undisclosed","City":"Gorham","Tags":"City"}