{"Object Features":"Undisclosed","divs":["sighting detailsi was driving 3\\4 miles north of the \"old st. george's\" bridge on rt. 13. i looked up and saw a cigar shaped object with 3 lights, as i got closer to the object, which was slowly moving southwest, i was able to make out windows in the object. there was no audible noise. my friend called my cell phone just as i saw the object, i told him what was going on and he told me to double back. i did, the slow moving object was gone; however, i saw what appeared to be planes or helicopters now in the distance. i continued on my original course, and again the same\\duplicate object appeared in the same fashion. this time i drove directly under it. no noise, moving at relativity low speed 50mph, approx. 200 - 500 feet in the air, approx 70 - 90 feet long. gray in color, cigar shaped. i'm not sure what i saw, my friend was on the phone the whole time, i don't have a camera so i couldn't capture it. dover afb is located roughly 30 miles south of my position. could these have been planes on a mission? i've never seen planes move so slowly, without noise. definitely freaked me out. i'm no saying it was alien, but it was an object i can't easily identify. hopefully someone can find out. this must have been seen by others, since rt 1 (a busy highway) runs directly parallel with my position."],"Object Flight Path":"Undisclosed","Longitude":"-83.058475","Disposition":"Insufficient Data","Log Number":"US-03102010-0005","Source":"MUFON","Summary":"Several Cigar Shaped Objects","Tags":"City","Region":"Delaware","Latitude":"40.306802","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"03/10/2010 03:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.306802,+-83.058475(22245)&iwloc=A&hl=en\"> mufon case (22245) map </A>","trends":["There have been 6 other sightings in Delaware","There were no other sightings in Delaware on or around March 9th 2010","This sighting has never been favorited.",""],"Date of the Event":"03/09/2010 07:27 UTC","City":"Delaware","Case Number":"22245","Object Shape":"Cigar, Oval","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/22245.html.txt","/var/www/straped/mufon/more/22245_submitter_file1__UFO.png","/var/www/straped/mufon/more/22245_submitter_file2__FLIGHTPATH.png","/var/www/straped/mufon/org/22245.html"]}