{"Date Submitted":"03/11/2010 05:17 UTC","City":"Boston","map":"<A HREF = \"http://maps.google.com/maps?q=42.362161,+-71.050653(22253)&iwloc=A&hl=en\"> mufon case (22253) map </A>","Summary":"The incident at Stellwagen Bank.","Object Shape":"Disc","Country":"United States","divs":["Sighting DetailsOn Friday July 18, 2008, at about 10:30 pm, a co-worker and I were taking a 15 minute break on the stern of the SS HORIZONS EDGE BOSTON, a casino cruise ship and company I was employed for at the time out of Lynn, Ma. We were drifting on the outer edge of the Stellwagen Bank Marine Sanctuary during casino hours. As we started to make our way back inside the vessel to return to work, we heard a loud \"whooshing\" sound from about 10 to 15 degrees off the port-bow. This is not an uncommon occurence as waves continually hit the bow; especially during inclement weather. But we knew right away the sound was a bit \"off\". We hurried to the port side of the stern and saw what seemed to be a spectral, greenish, faint-glowing, disc shaped object (at best estimate, about 50 to 100 feet in diameter and about 500 feet out) come clear out of the water and hover for what seemed to be 45 seconds or so. We both confirmed with each other, that we could \"feel\" or somewhat \"sense\" heat coming from the object...(and subsequently would both later suffer from unusal yet uneventful bouts of dehydration and cold-like symptoms regardless of how the amount of fluids we drank.) The object then rose sharply to about 1000 feet and shot away, aft and ascending, until we couldnt see it anymore... that particular movement of the object took less than 10 seconds... there was absolutely no sound of any kind and the erradic movements it made as it came out of the water, was as if someone were hoisting this thing up on the end of a chain and it sawyed a bit back and forth. I have never seen anything like it before or since. Naturally, I have never mentioned this incident to anyone for fear of any social reprisal... and we have subsequently, stopped speaking to each other all together. I have only mentioned it here, and will probably never mention it again. I just had to tell someone. JS"],"trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around July 18th 2008"],"files":["/var/www/straped/mufon/html2text/22253.html.txt","/var/www/straped/mufon/org/22253.html"],"Weather Factors":"Unknown","Case Number":"22253","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"07/18/2008 10:30 UTC","Disposition":"IFO","Log Number":"US-03112010-0003","Longitude":"-71.050653","Region":"Massachusetts","Latitude":"42.362161","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City"}