{"Date of the Event":"04/10/2003 07:17 UTC","trends":["There have been 36 other sightings in Corona","There were no other sightings in Corona on or around April 10th 2003"],"Weather Factors":"Windy","Longitude":"-117.566438","Disposition":"Unknown","Case Number":"2225","City":"Corona","Date Submitted":"04/10/2003 07:17 UTC","Summary":"Single saucer shaped object","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=33.875294,+-117.566438(2225)&iwloc=A&hl=en\"> mufon case (2225) map </A>","Region":"California","Log Number":"","Latitude":"33.875294","divs":["Sighting DetailsIm a nurse and I take care of a patient in a wheelchair. We take short restswhile on these outings.I had my video camera with me because the day before Ihad noticed many contrails in the sky, and I wanted to video tape them if theyappeared again on this day. I parked the wheelchair next to a circular wall atthe local mall. I got my camera out of a bag which is attached to thewheelchair,and started to scan the skies in the northwest direction. I didnt seeany contrails on this day but I did notice a bright object hovering in the sky.I thought it was the sun illuminating a cloud at first. But the object had form.It appeared to be saucer shaped with domes to the top and to the bottom of theobject. The domes didnt protrude very much from the body. The object was alsotilting downward. It started to propel itself at a slow rate, from left to rightacross the sky. At times it seemed to hover or stop and them it preceded itsslow movement again. I followed it until it went behind a tree. By the time Ihad a better vantage point, without the tree obstucting my view, the object wasgone. I had caught this entire sequence on videotape. When I went home to viewthe tape again, I noticed another object come into view. This was a smallerobject and it was flying toward the 1st object. It appears to be round in shapeand smaller than the 1st object. It then flies past the original object and isgone from view. It doesnt reappear at any time after that. The video is about 1minute and 40 seconds long."],"Sighting Duration":"00:05:00","Country":"United States","Viewing Distance":"Over One Mile","Source":"MUFON","Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/2225.html.txt","/var/www/straped/mufon/org/2225.html"]}