{"Longitude":"121.05146","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=14.681891,+121.05146(22251)&iwloc=A&hl=en\"> mufon case (22251) map </A>","files":["/var/www/straped/mufon/html2text/22251.html.txt","/var/www/straped/mufon/more/22251_submitter_file1__photo0025_001.jpg","/var/www/straped/mufon/org/22251.html"],"Region":"Metro Manila","Case Number":"22251","Summary":"5:30PM Philippines over at a hilltop playground","Viewing Distance":"Unknown","Date of the Event":"03/08/2010 05:30 UTC","trends":["There have been 9 other sightings in Quezon City","There were no other sightings in Quezon City on or around March 8th 2010","This sighting has never been favorited.",""],"Weather Factors":"Windy","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"14.681891","Object Shape":"Diamond, Disc, Triangle, Unknown","Source":"MUFON","divs":["Sighting DetailsAt 5:30pm in the afternoon. While waiting for my daughter in the playground. This place is just over the hilltop and I was awestruck as i looked up the sky and saw this cloud formation: take note of the beautiful ring like structure. Looks like a flower! as my daughter described it. So i had to take a photo of it. But frustratingly i just had my Nokia X3 Phone equipped with a crappy 3.2megapixel camera with me. I took the shot. So as i went home to take a look at my creation, i didn't expect too much, but to my amazement i noticed a dark object included. I could not explain what could this object be? This area has a lot of low flying bats at that time. and when i took the shot i just snapped away focusing on the ring. I couldn't see anything due to the tiny screen of the phone. I don't know how to explain but if anyone can analyze this photo. i would be very thankful for your inputs. You will have to zoom into the photo to see the object on the left. is it a bat? a bird? a commercial aircraft from a distance?"],"Object Flight Path":"Unknown","Log Number":"PH-03112010-0001","Date Submitted":"03/11/2010 01:00 UTC","Country":"Philippines","Tags":"City","City":"Quezon City"}