{"Latitude":"35.997433","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.997433,+-78.895829(22258)&iwloc=A&hl=en\"> mufon case (22258) map </A>","Case Number":"22258","Date of the Event":"02/28/2010 12:00 UTC","Disposition":"IFO","divs":["Sighting Details I saw a curious thing that just kept making me stare trying to figure it out. I am staying on the 2nd floor of a hotel facing west. I came out of my room onto the outdoor walkway(it was fully dark out) and noticed an aircraft flying slowly, south-to-north directly west of me maybe 2500 to 3800 feet away and at a low altitude. The vehicle consisted of maybe 8 to 10 dim colored lights-red, white, green, possibly violet, and amber. I was sure it was just a helicopter going to nearby Duke Medical Center (I installed security cameras ON that helipad and at the Nat. Guard helo base in Raleigh)and maybe it was. But there were several odd things about it: 1)all the lights were tiny, constant & dim and seemed to be behind the slightest fog. There were NO STROBES. 2) there were no green or red lights near where wingtips should be if a winged craft. 3)the lights didn't make a distinct T shape-maybe a fat-stubby T (so again-like a helo) but... 4) it was silent! As it seemed to be less than 4000 feet away I expected to hear rotor and engine noise: nothing-even after all the local car traffic stopped...silence. I have heard people claim that UFO 'craft' have mimicked human aircraft lights, but imperfectly. This fit my pictures of what that might look like. (Cue Twilight Zone music)"],"trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around February 28th 2010"],"Country":"United States","Object Features":"Unknown","Object Shape":"Unknown","Date Submitted":"03/11/2010 02:12 UTC","City":"Durham","Log Number":"US-03112010-0008","Tags":"City","Source":"MUFON","Summary":"Cluster of dim lights, low, slow, silent (mimicking an aircraft?)","Longitude":"-78.895829","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/22258.html.txt","/var/www/straped/mufon/org/22258.html"]}