{"Longitude":"-117.239375","Date of the Event":"03/06/2010 05:00 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","City":"Spokane Valley","Weather Factors":"None","Date Submitted":"03/10/2010 11:04 UTC","Disposition":"IFO","trends":["There have been 2 other sightings in Spokane Valley","There were no other sightings in Spokane Valley on or around March 6th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/22250.html.txt","/var/www/straped/mufon/more/22250_submitter_file1__march62010ufo1.jpg","/var/www/straped/mufon/more/22250_submitter_file2__march62010ufo3-cu.jpg","/var/www/straped/mufon/more/22250_submitter_file3__march62010ufo4-cu.jpg","/var/www/straped/mufon/org/22250.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.673228,+-117.239375(22250)&iwloc=A&hl=en\"> mufon case (22250) map </A>","divs":["Sighting DetailsI was riding in the backseat of a car going west on Interstate 90 toward Spokane Valley about 5 p.m. March 6, 2010. The two other people in the car and myself spotted this object in the sky above some hills to the southwest. It appeared to be hanging out stationary in the sky, but I cannot confirm this because I was in a moving car. If it was moving, it was not moving very much. I looked at the object through the zoom on my small digital camera and still was not able to figure out what it was. We got off the freeway in Spokane Valley and began driving south toward the object, but we lost sight of it behind the hills when our elevation changed and were unsure how to find it again, so we gave up. We drove the same route the next morning, and the object wasn't there. All three of us are natives to the area and have never seen such a thing. Our first thought was it may be a hot air balloon, but we haven't ever seen one of that shape."],"Latitude":"47.673228","Case Number":"22250","Summary":"Rocket-shaped object appeared to hang stationary in the sky","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Region":"Washington","Object Shape":"Bullet, Missile, Cylinder","Object Flight Path":"Stationary","Log Number":"US-03102010-0010"}