{"Latitude":"40.771254","Weather Factors":"None","Region":"New York","Summary":"Pyramid-shaped object","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsIt was July 1st, 2007 at 7:25pm & I was laying on the front lawn talking to my dad and the sky was clear. I looked up in the South-western sky and I saw an object moving slowly. I thought it was merely a plane or a helicopter, then I noticed there was no sound. At that point I told my dad to look at that object and tell me what he thought it was. We thought it was maybe an osprey, blimp or balloon- it was far away and difficult to tell it's shape. I even thought it was a trash bag. As the object came directly above our home, we were able to see the shape very clearly. The unidentifiable craft was a very large flying pyramid. It looked nearly identical to the pyramid of Giza, except it had a tall antenna with 3 horizontal bars & two areas on the side that were indented. At that moment we realized it was a UFO. When I say \"UFO\", I don't mean an extraterrestrial craft, I mean that it was not a known craft that I have seen. The craft was flying at a very slow, steady speed in a strait line. It came from the South-west & kept going without pause to North-east. We watched it until we could no longer see it. The craft was brown in colour, had 4 sides & was flying fairly low, maybe 3-4 telephone poles up. We saw this UFO on July 1st, 2007 at 7:25pm & watched it for approx. 5 mins. My dad and I were so busy analyzing the craft that I did not stop to think to get my camera! I'm still very upset that I didn't get my camera, it would have been a great picture too. This is not the first time I have seen UFOs, but this particular sighting was the best one. Well, I attached a sketch of the \"flying pyramid\" (that's what I call this sighting). Um, if I tell you about my sighting, you're not gonna report me to those men in black guys are you? That is why I hesitated for years to tell you."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.771254,+-73.013538(22263)&iwloc=A&hl=en\"> mufon case (22263) map </A>","Disposition":"Insufficient Data","Country":"United States","Object Flight Path":"Straight-line path","Tags":"City","City":"Patchogue","Object Features":"Patterned Surface, Appendage(s)","Object Shape":"Other","Date of the Event":"07/01/2007 07:25 UTC","Case Number":"22263","Longitude":"-73.013538","trends":["There have been 2 other sightings in Patchogue","There were no other sightings in Patchogue on or around July 1st 2007","This sighting has never been favorited.",""],"Log Number":"US-03112010-0012","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22263.html.txt","/var/www/straped/mufon/more/22263_submitter_file1__ufo07012007at725pm.JPG","/var/www/straped/mufon/org/22263.html"],"Source":"MUFON","Date Submitted":"03/11/2010 11:33 UTC"}