{"trends":["There have been no other sightings in Fridley","This sighting has never been favorited."],"Viewing Distance":"Unknown","divs":["Sighting Detailswas lookin toward south(mpls) and saw what appeared to be ufo. was triangular and had white lights on all corners with a red flashing light in middle going from side to side and in the rear of craft there were two blue lights. i opened sliding glass door and looked closer and noticed that it was on same route as most passenger plane routes to msp airport, but the light configuration i thought was pretty wierd so, thats when i realized i couldnt hear the craft. i continued watching it but it did not follow the route but instead continued on a south western path rather than going to msp airport. i did stand out on the patio and could hear the passenger planes at the same distance. all im saying it definately was a ufo not that it was alien but.... what do we have that capability?...also it was not flying as fast as the regular planes i really wish for the first time in my life that i had a video recorder then i could discern it for myself.... i just hope someone else saw this other than me and my girlfriend. I did feel pretty freaked out cuz it was movin so slow and the gosh darn red lights goin back and forth i just cant understand why, and why would it have been following the path of passenger planes only to go off in a different direction it never zig zagged or anything just left out of my view thats all very strange."],"Object Features":"Other","Summary":"Dark Triangle with lights at vertices - two witnesses","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Log Number":"US-03122010-0007","map":"<A HREF = \"http://maps.google.com/maps?q=45.086076,+-93.263282(22270)&iwloc=A&hl=en\"> mufon case (22270) map </A>","Date of the Event":"02/27/2010 08:30 UTC","Tags":"City","Latitude":"45.086076","Date Submitted":"03/12/2010 08:53 UTC","Region":"Minnesota","Weather Factors":"Unknown","Longitude":"-93.263282","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","City":"Fridley","files":["/var/www/straped/mufon/html2text/22270.html.txt","/var/www/straped/mufon/org/22270.html"],"Case Number":"22270"}