{"Weather Factors":"None","divs":["sighting details on tuesday march 9, fox 8 news in cleveland featured a report of an individual observing strange lights from his apartment window for the sixth consecutive night. the euclid native reported the lights would start out bright and then gradually dim. as soon as the lights begin to dim, the object moves away. since no official mufon report had been filed, i drove to the area of the sightings on both march 11 and 12. on march 11 the object was reportedly seen and disappeared before i arrived. on march 12 i choose a different location which provided a better view and saw a light matching the news report to the northwest. the light was orange-white and about the size and intensity of venus two-fingers above the horizon. the light was seen at least three times between 7:15pm and 7:48pm starting as a bright light, then dimming and in the first observation moving to the southwest. the light was observed by not only myself but three other individuals. the light or should i say lights were observed by naked eye, video camera, and binoculars. through binoculars not only was one light seen, but a second the same color and of lower intensity slightly above and to the right. a faint light was also seen fading in and out in the same area until 8:08pm. there was light air traffic in the area and the two closest airports are burke lakefront airport 10 miles to the southwest and cleveland-hopkins airport 18 miles to the southwest. first thought is it may be an airplane circling over lake erie for an approach to cleveland-hopkins airport and the bright light was the landing light. the sky was partially cloudy and the light could be dimming either by cloud cover or the plane disappearing in the distance. as we watched the light\\s the emotions of the group were mixed. media is available and is a large file."],"Case Number":"22276","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Euclid","There were no other sightings in Euclid on or around March 12th 2010"],"Object Shape":"Sphere","Disposition":"IFO","Date Submitted":"03/13/2010 08:59 UTC","Country":"United States","Viewing Distance":"Over One Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.596905,+-81.517487(22276)&iwloc=A&hl=en\"> mufon case (22276) map </A>","Source":"MUFON","Summary":"Light/s seen over Lake Erie from Euclid Beach","Log Number":"US-03132010-0005","Object Features":"None","Latitude":"41.596905","Object Flight Path":"Path then hovering","Region":"Ohio","City":"Euclid","Longitude":"-81.517487","Date of the Event":"03/12/2010 07:15 UTC","files":["/var/www/straped/mufon/html2text/22276.html.txt","/var/www/straped/mufon/org/22276.html"]}