{"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.227118,+-116.029307(22279)&iwloc=A&hl=en\"> mufon case (22279) map </A>","Summary":"Three ghostly figures materialize in the next room as they were approaching my bedside.","Object Features":"Undisclosed","Weather Factors":"Unknown","Case Number":"22279","Source":"MUFON","Object Shape":"Unknown","Viewing Distance":"Unknown","Region":"Idaho","Longitude":"-116.029307","Date Submitted":"03/13/2010 05:18 UTC","City":"Kamiah","Sighting Duration":"Undisclosed","Latitude":"46.227118","trends":["There have been no other sightings in Kamiah","This sighting has never been favorited."],"Log Number":"US-03132010-0007","Country":"United States","files":["/var/www/straped/mufon/html2text/22279.html.txt","/var/www/straped/mufon/org/22279.html"],"Date of the Event":"11/30/1951 12:00 UTC","divs":["Sighting DetailsOne winter night as I was fast asleep in the West bedroom near the stairs, I was awaken by a strange pulsating hum. Sitting strait up, I turned to the left to see three ghostly figures materialize In the next room as they were approaching my bedside. Please remember that we had no electric and I had never been to a movie or heard a radio show to that point. Two of the creatures looked just like the gray aliens you see in the movies and the one in the center was much taller and looked different. As they got closer they told me to relax and go back to sleep telepathically. The floating sensation I felt helped stop my nervous shaking as I blacked out. The next morning my grandmother met me half way to the kitchen and asks if I was all right. She said that I had sunburn on the left side of my face and looked very tired. in the back seat of the new Buick on our way to the farm I felt compelled to lay down on the floor with my back to the front seat. The telepathic message was like the one I received from the three ghosts. Moments after laying down we t-boned another car on route 13 near Blackbird. Everyone except I was seriously injured and taken to the hospital. The year I believe was 1959 while at the park I noticed about 12 flying saucers to the West of the park. To my great surprise I had a visit the next day while at my friends home that lived around the corner from my grandparents home at 806 Brown st. John's father answered the door to find two Air force people in uniform asking to speak with me in private. My mother stood with the air force officer to my left and the sergeant stood in front as another man entered the room dressed in black wearing A hat and dark sunglasses. I was asked to tell what I saw as follows: I saw bright round objects mostly in triangular groups of three flying in a manor not like any aircraft known. They were able to stop and turn on a dime and when they departed to an altitude near space they took off so fast that they appeared To vanish at about a 30 degree angle into space. For the next hour the air force guys tried to get me to change my story and I was growing tired of repeating myself. I then parroted back one of the officer's stories as a way to make them leave. I noticed the officer look up at the guy in black for approval, As I could see the guy in black shake his head left and right. Now I knew I had to convince the guy in black and realized that the officer was taking his orders from him. So I came up with a better idea that got the approval from the big boss in black. The man in black never said a word to me even after asking him direct questions. He then folded his notebook and left followed by my mother and the officer. There are many other strange stories about hard to believe events, but either you believe or not will make no difference. This is my recorded statement so others like me will take some comfort in knowing that they are not alone?"],"Tags":"City","Disposition":"Unknown"}