{"Country":"United Kingdom","Region":"England","Date of the Event":"03/11/2010 07:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","City":"Staffordshire","Case Number":"22275","divs":["Sighting DetailsI was wondering if anybody has reported any UFO sightings in Cannock town on Thursday night 11th March 2010 around 7pm. i was walking into my kitchen of my flat on Thursday night and i looked up thinking that aeroplane is flighing really low and slow, then i looked properly and noticed it wasnt a shape of a plane or helecopter and the lights were different to. The lights were changing from white, to green to red. it then just stopped suddenly and hovered very still in the air, looked like it was over the Cannock town center (UK), it moved up and down a couple of times not drastically, then a few minutes later it shot over to my right, towards the A5 and hovered there for another 20 mins or so still with the lights flashing, it had a small dome like shape ontop. i also noticed when it was over the area of the A5 road there was another set of the exact same lights way up in the clouds, higher than a plane, also just hovering in one place and not moving. i was i had been able to take a picture as nobody believes me, thats why i am wondering if anybody else has reported this? i have never seen anything like it before."],"map":"<A HREF = \"http://maps.google.com/maps?q=52.769796,+-2.104524(22275)&iwloc=A&hl=en\"> mufon case (22275) map </A>","Log Number":"GB-03132010-0004","Summary":"UFO sighting over Cannock Town","Object Shape":"Disc","Latitude":"52.769796","trends":["There have been no other sightings in Staffordshire","This sighting has never been favorited."],"Disposition":"Unresolved","Source":"MUFON","Longitude":"-2.104524","files":["/var/www/straped/mufon/html2text/22275.html.txt","/var/www/straped/mufon/org/22275.html"],"Object Features":"Dome","Object Flight Path":"Stationary,Hovering then path","Weather Factors":"Does Not Apply","Viewing Distance":"Unknown","Date Submitted":"03/13/2010 07:43 UTC"}