{"Country":"United States","Weather Factors":"Unknown","Date of the Event":"03/12/2010 03:13 UTC","Tags":"City","City":"Fuquay-Varina","Longitude":"-78.798883","Region":"North Carolina","divs":["Sighting DetailsAt 3:13 AM eastern time I was awakened by the 4-5 brightest flashes I have ever encountered. I thought lightning had struck my home becuase it was so intense, but I never heard a sound (thunder). Following this extreme flash that resembled the intensity of a Arc Welder I proceeded outside to see if I could observe anything obvious. I walked outside and this strange feeling was surrounding me. There was absolutely \"Zero Wind\" it was not raining, so I knew it could not have been a lighting strike. I went across the street to my neighbors house as I noticed she was lighting candles in her house for light. All power was gone, and I knew it was not a transformer blowing up as it could not do this 4-5 times. She also did not feel normal and this is why she also awakened. We turned on her battery operated radio and could not get any signal for any stations - just white noise. She also had a XM radio and this picked up stations. Our CEll phones also would not get a signal. We both decided to get in the car and take a drive just to see if anyone had been in a car wreck and hit a power line. We both jointly commented at the same time of the erie animal behavior. I have never seen so many animals walking around as stunned as we were. After driving for a while and not seeing anything we decided to call authorites in case someone had run into something and needed help. The operator had not reportings of power outages and accidents. This was approx 15-20 mins after the sighting. Our radios and cell phones by this time were working in the car and power was still out. When we got back to our neighbor hood and proceded to go back inside we heard a strange deep whisteling noise in the sky. After the sound had left power was restored. My neighbors solar cell system is not working and the intense light overloaded her electrical system. The company that came out to repair said they had never seen anything like this."],"Viewing Distance":"Unknown","Latitude":"35.594044","Object Shape":"Flash, Other","Sighting Duration":"Undisclosed","Summary":"Did not actually see a craft, however I did see a very scary flash of bright light 4-5 times that was blinding","trends":["There have been 6 other sightings in Fuquay-Varina","There were no other sightings in Fuquay-Varina on or around March 12th 2010"],"Source":"MUFON","Date Submitted":"03/13/2010 11:07 UTC","Case Number":"22277","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/22277.html.txt","/var/www/straped/mufon/org/22277.html"],"Object Flight Path":"Unknown","Object Features":"None","Log Number":"US-03132010-0006","map":"<A HREF = \"http://maps.google.com/maps?q=35.594044,+-78.798883(22277)&iwloc=A&hl=en\"> mufon case (22277) map </A>"}