{"Longitude":"-85.712991","Log Number":"US-03132010-0002","City":"Daleville","Viewing Distance":"Unknown","Object Features":"Undisclosed","Summary":"6 lights in the sky then 2 roughly five min. later.","Weather Factors":"None","Object Shape":"Other","Country":"United States","Region":"Alabama","Disposition":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.310172,+-85.712991(22273)&iwloc=A&hl=en\"> mufon case (22273) map </A>","Case Number":"22273","files":["/var/www/straped/mufon/html2text/22273.html.txt","/var/www/straped/mufon/org/22273.html"],"Date Submitted":"03/13/2010 01:08 UTC","trends":["There have been 4 other sightings in Daleville","There were no other sightings in Daleville on or around March 12th 2010"],"Object Flight Path":"Straight-line path","Latitude":"31.310172","Date of the Event":"03/12/2010 09:20 UTC","divs":["Sighting DetailsMe and a fellow employee were out on the flightline of an airfield waiting on another employee to inspect a part we were going to put on an aircraft. We got out to the aircraft at around 9pm. As soon as I stepped out i looked back toward the hangar and notice the lights. I asked my partner if he saw them. He said he did. There were six of them above the horizon. All were Orange looking in color. The same color as the lights on the hangars roughly. I thought they were a stick of aircraft planning to shoot an approach to Cairns Army airfield. As we watched they very slowly drifted from right to left. They were southwest of Cairns airfield. There was no sound only the lights. I called a employee in the hangar who also was looking at them on my cellphone. Anyway, as we watched they started disappearing. My friend who was in the hangar said to him it looked like an army aircraft flew toward them and when it did they started disappearing. I didn't see that from my position. One by one they started disappearing till they were gone. Me and my partner were discussing what we had seen while waiting for the other employee to come. About five min. later we saw two more of the lights suddenly appear in the same area but higher up. These lights stayed lit for several minutes then they disappeared. The one on the left disappeared first then the second. Later I talked to at least two other employees who saw the lights besides me and my partner. I've seen ufo's on tv shows about the \"Phoenix lights\" and to be honest these looked like them. Honestly, if i had to guess i think they could have been flares from an aircraft at high altitude but i just don't know. I've never seen flares in this area all of my life but I suppose it is possible. Other than that I have no idea what it was. But I know I'm not the only one who saw them. Also there was no sound that we could hear. The lights were orange and no other lights were visible (such as position lights on aircraft). The whole time we saw them was roughly 9 to 9:20PM and positionally they looked to be over the south end of coffee county, Alabama. But I don't now how far away they were. But it was southwest of Cairns army airfield."]}