{"Log Number":"US-03132010-0003","Tags":"City","Viewing Distance":"101-500 Feet","Latitude":"36.014176","Case Number":"22274","map":"<A HREF = \"http://maps.google.com/maps?q=36.014176,+-84.264725(22274)&iwloc=A&hl=en\"> mufon case (22274) map </A>","Longitude":"-84.264725","Country":"United States","Date Submitted":"03/13/2010 06:06 UTC","City":"Oak Ridge","Source":"MUFON","Summary":"This was one of a series of sightings around the Oak Ridge labs area.","files":["/var/www/straped/mufon/html2text/22274.html.txt","/var/www/straped/mufon/org/22274.html"],"Object Flight Path":"Straight-line path","Object Shape":"Cigar","divs":["Sighting DetailsThere were several sightings around this area at the time. My father was the first to point it out to me. We were outside one afternoon around 8 or 8:30 pm when he pointed out a bright object to me over the area of melton hill lake. He asked me if I saw this star that was out at the time and I said yes I was around 10 years old at the time . He told me if I watched it it would move slowly across the sky which it did. I think we all got our best look at it one night though when he woke us up about 11 pm and said we needed to go outside. There was an object close to 30 feet in length no more than 100 feet above the power lines outside of our house. We were not the only ones to se this as well the people who lived on our street were for the most part all outside. This object was moveing slowly without an disernable sound.Multi colored lighst seemed to be pulseing around the outside of the object. we observed this object for around 40 min untill it abruptly seemed to shoot stright up and dissappear. The sightings of the moving star like object reoccured severl times over the years following this event. I still wonder to this day if what we were doing at the oakridge national labs at the time had something to do with these sightings.Description of object : cigar shaped rounder at front more tapered at the rear? white or light gray in color with multi colored lights pulseing aroung the ouside skin.(possably comming from inside of object)"],"trends":["There have been 7 other sightings in Oak Ridge","There were no other sightings in Oak Ridge on or around April 10th 1979"],"Weather Factors":"None","Object Features":"Patterned Surface","Region":"Tennessee","Sighting Duration":"Undisclosed","Date of the Event":"04/10/1979 11:30 UTC","Disposition":"Unknown"}