{"Object Flight Path":"Undisclosed","Longitude":"-70.943994","Country":"United States","Date Submitted":"03/13/2010 10:03 UTC","Disposition":"Hoax","Object Shape":"Boomerang, Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22283.html.txt","/var/www/straped/mufon/org/22283.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.474943,+-70.943994(22283)&iwloc=A&hl=en\"> mufon case (22283) map </A>","Case Number":"22283","Latitude":"42.474943","Region":"Massachusetts","Viewing Distance":"Unknown","Summary":"Bright lights.","Object Features":"Unknown","Date of the Event":"07/31/2009 12:00 UTC","Tags":"City","City":"Lynn","trends":["There have been 3 other sightings in Lynn","There were no other sightings in Lynn on or around July 31st 2009"],"Log Number":"US-03132010-0011","divs":["Sighting Detailsi do not know the exact date it was like august. at about 2am i was awaken to what sounded like a helicopter when i opened my eyes i saw what looked like a flashlight coming through my window at first i thought police helicopter looking for someone i looked out my window saw nothing layed back down saw lights through my window again this time when i looked out my window it looked like a flashlight again going house to house when i looked up i saw nothing again but could hear noise so i continued to look out the window all of a sudden the street lit up so bright on one side then the other it was the wierdest thing i ever saw so i continued to look out so i could see what it was then all of a sudden i seen a reflection on my neighbors roof if was kinda rounded and had lights it looked like it was coming from out back. My husband was sitting in a chair in our room but it was like he wasnt moving i asked him to look but it was like frozen so i ran out back alone. i have a large deck i was standing on and there was a bright light that shone down on me. next thing i remember is standing on my back deck near my door and there was like a flash of light and like a swooshing noise i said to myself what was that kinda confused so i walked back in my house and it was eight oclock in the morning my husband asked where i was and i explained what i rememebered and he laughed i was really scared and couldnt explain so just kinding he said maybe u saw a ufo.thats when i started looking into it and the more i think about it i think i may have seen one. also for the longest time i had this wierd smell and taste all the time my hair started falling out in clumps and i was sick for a couple of days. after that there were airforc people aroung my neighborhood i saw trucks taking things from the woods i also saw some strange figure i dont know maybe military but not to sound crazy maybe aliens i dont know i would like help to figure this out i saw people in white suits too"],"Weather Factors":"Unknown","Source":"MUFON"}