{"divs":["Sighting DetailsDuring the summer of 1978 I was outside playing in the yard and heard a humming sound. I was attentive as a child to the military aircraft that are always flying over our home. After hearing a humming sound I looked up and saw a small aircraft that I had not seen before. I watched the craft fly slowly Eastward for about a minute and was out of site over the trees. I estimate flying at about 1500-2000'. The wings were a swept wing design placed in the rear of the craft, but forward facing. Towards the front of the craft were smaller, cannard like wings.I have heard prop planes and have not heard anything that was similar to what I heard that day. I have looked at different types of experimental aircraft and not have found anything that was flying at the time that was close to what I witnessed. The only aircraft that may resemble is a Velocity Aircraft. The only noted difference is the wings are swept back. After serving in the Air Force and being around aircraft, I have yet to see any type of aircraft that has this design."],"Summary":"object shaped like small aircraft with forward facing wings- not developed at time of observation","Weather Factors":"None","Disposition":"Insufficient Data","Source":"MUFON","Date of the Event":"07/15/1978 12:00 UTC","Latitude":"29.431452","map":"<A HREF = \"http://maps.google.com/maps?q=29.431452,+-98.492198(22281)&iwloc=A&hl=en\"> mufon case (22281) map </A>","Log Number":"US-03132010-0009","Object Flight Path":"Straight-line path","Region":"Texas","Sighting Duration":"Undisclosed","Object Shape":"Bullet, Missile, Chevron","Object Features":"Wings","Longitude":"-98.492198","Tags":"City","Date Submitted":"03/13/2010 07:16 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/22281.html.txt","/var/www/straped/mufon/org/22281.html"],"trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around July 15th 1978"],"Viewing Distance":"Unknown","City":"San Antonio","Case Number":"22281"}