{"Log Number":"US-03142010-0004","files":["/var/www/straped/mufon/html2text/22288.html.txt","/var/www/straped/mufon/org/22288.html"],"divs":["Sighting DetailsOn December 5th 2009 my family and I decided to attend a Christmas parade in the city of Jamestown, a small city located in western NY state about thirty miles south of lake Erie. It was very cold that evening, so we decided to skip the parade and get dinner at a local restaurant instead.. While driving from the restaurant, I glanced into the sky, and noticed a round orange light, almost directly above the parade route. At first I thought a news aircraft was filming the parade. Then I saw a second and then a third and a forth. They were all the same size and shape, and upon further inspection, I decided they were too high up to be small air craft. They were traveling from east to west, and moving very slow. If I had to guise, I would say the objects were about one mile apart, and spaced at an even distance. I thought maybe air craft, but most air craft you see, have flashing navigation lights. These objects had none , just a solid orange light. We had already ate dinner, and were on our way to drop off the kids at their grandmothers house to spend the night. She lives on a hill above the city , so while my wife brought the kids into the house, I stood in her front lawn, and watched the lights. Two were gone, but two were still visible. The sky had no clouds that evening, and one of the lights seemed to diaper (go out) and then come back on. In all I would say the whole event took 45 minutes to an hour. Too long in my opinion, to be jet air craft. I never reported this event, until I saw a news report stating several people sited similar lights in the sky over lake Erie, in Cleveland Ohio. Cleveland is about 130 miles west of Jamestown. I have never been a firm believer in the super natural or UFOs. , but what I witnessed the night of December 5th, is definitely unidentified."],"trends":["There have been 5 other sightings in Jamestown","There were no other sightings in Jamestown on or around December 5th 2009"],"Object Features":"Undisclosed","Date of the Event":"12/05/2009 12:00 UTC","City":"Jamestown","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=42.097002,+-79.235326(22288)&iwloc=A&hl=en\"> mufon case (22288) map </A>","Disposition":"Unknown","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"03/14/2010 11:24 UTC","Latitude":"42.097002","Source":"MUFON","Longitude":"-79.235326","Object Shape":"Circle, Sphere","Summary":"Four orange slow moving lights in western NY sky","Weather Factors":"Unknown","Country":"United States","Tags":"City","Case Number":"22288","Sighting Duration":"Undisclosed"}