{"Disposition":"IFO","Region":"North Carolina","Object Flight Path":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22295.html.txt","/var/www/straped/mufon/org/22295.html"],"divs":["Sighting DetailsI was out walking my dogs around my apartment complex at 6:50 am. The sun was out, and the sky was a clear light blue. On our way back to the apartment, I noticed something in the southeastern sky, approximately 60 degrees above the horizon. I do not know how far the object was, or its approximate size. It was a dark-colored, diamond-like object. I thought it was a small kite, because it glided around very slowly. I remember thinking, how strange that someone would fly a kite first thing in the morning, but it had no attached string. As it hovered around very slowly, its right half reflected the sun's light. I realized that the object was metal, and that's when I started to get really curious about what I was looking at. I studied it for a little while longer to 1) run though the list of things it could be 2) commit the experience to memory so I could later describe it. I watched it for maybe 3-4 minutes, until it started to fade into the distance towards the southeast. I brought my dogs in before it completely disappeared and promptly went onto our porch (which faces due south) but saw nothing. I do not know what it was, except that: 1) it was not a bird, for there were no wings. 2) it was not an airplane; no airplane i know of can hover at such low speeds. 3) it was not a hand-glider. there were no visible people hanging from, or riding the object. 4) i know helicopters can hover, but this object had no turning blades. 5) it had no lights, and it wasn't zipping around at high speeds like UFOs in sci-fi movies. 6) I do not know much about weather balloons, but I thought weather ballons traveled up. 7) there was not enough wind speed to carry a metallic object without a motor into the sky."],"Sighting Duration":"Undisclosed","Object Shape":"Diamond","Weather Factors":"Unknown","Date Submitted":"03/14/2010 09:50 UTC","Date of the Event":"03/04/2010 06:50 UTC","Tags":"City","Latitude":"36.079035","map":"<A HREF = \"http://maps.google.com/maps?q=36.079035,+-79.789285(22295)&iwloc=A&hl=en\"> mufon case (22295) map </A>","Longitude":"-79.789285","Country":"United States","Case Number":"22295","Summary":"kite-like metallic object","City":"Greensboro","Log Number":"US-03142010-0011","Viewing Distance":"Unknown","Object Features":"Undisclosed","trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around March 4th 2010"]}