{"files":["/var/www/straped/mufon/html2text/22297.html.txt","/var/www/straped/mufon/org/22297.html"],"Sighting Duration":"Undisclosed","Case Number":"22297","Disposition":"IFO","Summary":"Bright light in sky then fades","trends":["There have been no other sightings in Between Bozeman and Livin","This sighting has never been favorited."],"City":"Between Bozeman and Livin","Date of the Event":"03/14/2010 08:30 UTC","Date Submitted":"03/14/2010 11:54 UTC","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Region":"Montana","Object Features":"Undisclosed","Log Number":"US-03142010-0013","Latitude":"46.887472","Object Flight Path":"Straight-line path","Longitude":"-110.355536","divs":["Sighting DetailsAt approximately 2030 hrs MST, I took my dog out for his evening walk. As i walked into parking lot of my apartment building, I looked into the sky as I do every night. I noticed a bright light in the sky moving due east. I watched this bright light for about 5 minutes as it moved over the Bridger mountains between Bozeman and Livingston Montana. While I was watching it, I was comparing it to a plane in the sky flying NW. The plane was flying faster and at a higher altitude than the light. The light was flying very slowly and did not have any of the standard marking lights that airliners have. (ie. red and blue wing lights and the blinking belly light) After about five minutes or so, it then faded out. I didn't see it for the rest of the walk. When I came back inside I checked Nasa's site to see where the ISS was in comparison to my location. It was between South America and Africa at the time. I should also mention that the light was flying at a higher altitude than a Japanese flying lantern can get and the light was flying slower than a meteor. I called my mother so she could witness the event but the light faded before she had a chance to get to an east facing window. I was happy to have seen this event and hope to see another in the future."],"Object Shape":"Star-like","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=46.887472,+-110.355536(22297)&iwloc=A&hl=en\"> mufon case (22297) map </A>","Tags":"City","Country":"United States"}