{"files":["/var/www/straped/mufon/html2text/22302.html.txt","/var/www/straped/mufon/more/22302_submitter_file1__IMG_3522.JPG","/var/www/straped/mufon/org/22302.html"],"Object Flight Path":"Undisclosed","Date Submitted":"03/15/2010 03:37 UTC","Case Number":"22302","map":"<A HREF = \"http://maps.google.com/maps?q=52.100072,+5.111945(22302)&iwloc=A&hl=en\"> mufon case (22302) map </A>","Longitude":"5.111945","Sighting Duration":"00:00:15","Country":"The Netherlands","Viewing Distance":"Unknown","Tags":"City","City":"Utrecht","Log Number":"NL-03152010-0005","Disposition":"Unresolved","Region":"Utrecht","Object Features":"Undisclosed","Object Shape":"Circle, Disc","Date of the Event":"03/13/2010 11:30 UTC","Source":"MUFON","Weather Factors":"Unknown","Summary":"Chemtrails and UFO over Utrecht","trends":["There have been 3 other sightings in Utrecht","There were no other sightings in Utrecht on or around March 13th 2010","This sighting has never been favorited.",""],"divs":["sighting detailswhile photographing the chemtrails being sprayed over utrecht from my balcony, i caught sight and photos of what seemed like a small disk quickly going across the sky. it had no trail, was out of view within 10-15 seconds and made no noise that i could hear. it seemed very high up as can be seen in the videos and photos below. i only noticed the object because i was photographing that area of the sky, at first i thought it was a weather balloon, but it was moving very quickly. i felt as if it seemed strange, but would probably be identifiable when i looked at the photos subsequently. --- photo series: http:\\\\www.youtube.com\\watch?v=c5ibyf04p0k note plane going by at 1:21 leaves only a brief trail, but then at 2:28 another plane goes by at what seems to be the same distance and altitude, leaving a thick trail that stays. another plane starts at 3:20 in the opposite direction, laying down another cross in the air that flattens out and seems to stick together. at 2:36, something wizes by going north to south - looks like a disk or weather balloon at very high speed. i could not identify it. the original still photos are available here http:\\\\goo.gl\\29fi higher resolution ones of the ufo here http:\\\\goo.gl\\rrio"],"Latitude":"52.100072"}