{"Weather Factors":"Does Not Apply","Date of the Event":"03/14/2010 11:30 UTC","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around March 14th 2010"],"Log Number":"US-03152010-0009","Latitude":"26.720672","Viewing Distance":"Unknown","City":"West Palm Beach","Object Flight Path":"Undisclosed","Summary":"Very Loud Jet Propulsion Sound Over West Palm that Continued for at Least 35 Minutes.","Tags":"City","Object Shape":"Unknown","Longitude":"-80.044835","Date Submitted":"03/15/2010 05:15 UTC","Region":"Florida","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.720672,+-80.044835(22306)&iwloc=A&hl=en\"> mufon case (22306) map </A>","Source":"MUFON","Object Features":"Undisclosed","Disposition":"IFO","Case Number":"22306","files":["/var/www/straped/mufon/html2text/22306.html.txt","/var/www/straped/mufon/org/22306.html"],"Country":"United States","divs":["Sighting Details My wife, and I live near the intracoastal waterway in West Palm Beach, FL. Last night around 11:30pm I was taking our two small dogs for a walk down along the waterfront on Flagler Drive. It was a clear night, with very few clouds, and about 65 degrees. I was about a block south when the sound of a large jet starting booming in the sky, seemingly a little northwest of our location. I didn't really think anything of it as jets take off & land at Palm Beach International Airport, toward the direction of the sound. You usually start hearing the sound change, like the Doppler Effect, as they either land from the East, or take off into the East. Occasionally you could see a the small, slow moving lights of a smaller plane. After a couple minutes I realized the loud jet sound was not changing or decreasing. It seemed so close, though there was nothing to see in the sky, even though it was very loud. Even one of our little dogs started getting frightened & started pulling back toward the house. He had never reacted like this. The propulsion sound was loud enough to be similar to what you would hear standing near a jet on the runway, maybe a hundred yards away ... definitely under a fair amount of throttle & not idling. The best thing I could think of was that there was something hovering with a very powerful engine, or propulsion system, with little or no movement in one direction, or another. But it didn't have that extra whine that you hear from the induction blades, that normally sound like a whistle. I really knew this was not normal, and though I've never seen a UFO, nor have ever had desire of wanting to take a ride on one ... the experience was giving me that sense of unexplainable uneasiness. I really felt I needed to get back to my wife. By the time I got back home she was already on the front lawn, and had timed the sound as already having lasted about 8 minutes at that high level of volume. It actually was loud enough to get her out of bed. She got changed quickly so we could head off in the truck to hunt down the location of the sound. The odd thing that we started to realize was that there was no one else alarmed by the sound on our street, like only we could hear it. As we headed north we did see one group of kids outside by their truck, stopped in the middle of a side street. We thought of stopping, but wanted to keep moving. We could not believe how few people it had alarmed, as though whatever it was was only audible to certain individuals. That was at least our initial thought, as it was also evident that only certain younger kids could hear it, apart from us. As we got to Southern Boulevard, which is a main route to the airport, we kept the windows down to keep tracking the sound. Sometimes it seemed to be all around us, but then it would re-concentrate to the west. We then pulled up along side a Jeep Cherokee with the front windows rolled down, heading in the same westward direction ... with two younger guys in it. We asked if they heard the same sound, just so we could be sure there was \"someone\" else out there who heard this. They said they were trying to track down the sound, as well. They took off in front of us, as we both continued toward the airport. Just as we were cresting the I-95 overpass, which gives you a direct view of the airport, the sound stopped. No planes were taking off, and there were no odd lights in the sky. We got onto the road just to the east of the runways, but at that time my wife started feeling car sick, which she never does ... and said she really felt she did not want to enter the proper airport grounds. We got home about 12:30pm, and kept trying to listen for it to start up again, to no avail. However, our other little dog got quite nervous & started pacing around and looked up at the ceiling a few times. He did not want to come back in the room. All day today we scanned the local news & I typed different criteria into Google like \"loud noise, west palm beach,\" ufo, west palm beach,\" etc. .... for any news of the noise, or any strange news, but there was nothing. It's really been quite disturbing & unnerving, especially as there is no one who's called us to say they had a similar experience. Thanks for letting me submit this. Regards, Barry"]}