{"Date Submitted":"03/15/2010 10:46 UTC","Disposition":"IFO","divs":["sighting detailsjust happened to look out my south bathroom window right above my house around 11:15 pm and saw about a dozen really bright and large stars, or so i thought at first (i had to have opened my shade for some reason, as we keep that closed after dark). i then looked to the east and they were across the road above a field, but not above my bathroom window. i didn't notice a movement. they were in one place and then in another, just like magic. the oval shaped bright objects just hovered, and they would grow dim and then grow bright again. they really just looked like overly-large bright stars, sort of oval. usually you see small stars with a large one here and there, but these were all more or less the same size, which struck me funny. they just disappeared. it was slightly cloudy that night of 3\\11\\10, thursday, which may have accounted for the brightness changing. i told my husband, when i went back to bed, that i saw some ufos. didn't think any more about it until i heard the report on nbc about the lake erie incident."],"Sighting Duration":"Undisclosed","Latitude":"39.797871","trends":["There have been no other sightings in LaPlace","This sighting has never been favorited."],"Object Flight Path":"Other","Longitude":"-88.718124","files":["/var/www/straped/mufon/html2text/22311.html.txt","/var/www/straped/mufon/org/22311.html"],"Case Number":"22311","Object Features":"None","Region":"Illinois","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03152010-0014","Source":"MUFON","Country":"United States","Date of the Event":"03/11/2010 11:15 UTC","City":"LaPlace","Summary":"Two location switches, one slightly south above my house and one south east over a field across the road, at first thought they were stars, but too large and same size~. Moved in blink of an eye. Faded in and out.","Object Shape":"Egg, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.797871,+-88.718124(22311)&iwloc=A&hl=en\"> mufon case (22311) map </A>","Tags":"City","Weather Factors":"Unknown"}