{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.233256,+-77.93474(22315)&iwloc=A&hl=en\"> mufon case (22315) map </A>","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/22315.html.txt","/var/www/straped/mufon/more/22315_submitter_file1__100_1734.JPG","/var/www/straped/mufon/more/22315_submitter_file2__100_1734.JPG","/var/www/straped/mufon/org/22315.html"],"City":"Wilmington","Latitude":"34.233256","Object Shape":"Triangle","Country":"United States","Region":"North Carolina","Date Submitted":"03/16/2010 12:14 UTC","Date of the Event":"03/06/2010 12:30 UTC","Log Number":"US-03162010-0001","Case Number":"22315","divs":["Sighting DetailsWas riding in front passenger seat taking pictures of the scenery as it blurred by and looked up and took notice of two jets at about 40-50,000 feet. I noticed they were flying rather erradically. THEN i saw a third object emerge - this one had NO VAPOR TRAIL. I thought maybe it was a glider. I snapped a few photos of the flyover (see pic). But the image that I got doesn't show the 3rd object. These planes were out of formation. They appeared as though they were in pursuit of something. The third object went out of my sight as it went straight up 12 o'clock high in the sky, and my vantage became obscured by the roof of the car. Oh, I should mention that my passenger side window is electric and the motor has been broken for some time. SO I took a few shots through the front windshield, but both shots came away with nothinhg but blue sky. It suer looked kinda scary though, seeing the 3rd object come out of nowhere - with NO vapor trail..."],"Disposition":"IFO","Sighting Duration":"00:20:00","Summary":"2 Fighter jets w/ vapor trails escorting 1 UFO with no vapor trail","Source":"MUFON","Viewing Distance":"Unknown","trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around March 6th 2010","This sighting has never been favorited.",""],"Longitude":"-77.93474"}