{"Log Number":"US-03152010-0016","Longitude":"-95.36061","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.769243,+-95.36061(22313)&iwloc=A&hl=en\"> mufon case (22313) map </A>","Disposition":"Unknown","Summary":"Saw an unmoving blinking light far up in the sky.","divs":["sighting detailsmyself, my sister, her husband, and their kids were cooking out. i was watching the sky as i always do (i saw a ufo when i was a kid so i always watch the skys) and i spotted a light, it was blinking on and off and seemed very high in the sky. it was cloudy but the sky was visible between clouds. i asked my sister if she could see it, at first she said no, the clouds were moving pretty fast, then she said \"yes, it's a plane.\" i told her that it wasn't moving, that it was the clouds moving. after a minute she realized this was true. still she said it was probably a satelite. i asked why a satelite would be blinking, she said the sun was probably hitting it as it spun. i don't think it was a satelite, i would think satelites would move across the sky, not be stationary. the light was bright and blinked on and off. it never moved from its spot. except for the clouds, it was a sunny day. planes passed through the sky, some below the clouds and a few i saw passed above the clouds, i saw them through the open spaces in the clouds, they all seemed way lower than the thing i was looking at. after about ten minutes it was too cloudy to see the sky and i gave up, about thirty minutes later the sky cleared and the object was gone. this morning (3\\15\\10) i drove to the store and baught a pair of binoculars, i watched the sky all day, espesially from 5:00 to 6:00 pm, it was a clear day, didn't see any satelite, i will do this all week."],"Viewing Distance":"Unknown","Region":"Texas","Date of the Event":"03/13/2010 05:23 UTC","files":["/var/www/straped/mufon/html2text/22313.html.txt","/var/www/straped/mufon/org/22313.html"],"Object Shape":"Star-like, Other","Weather Factors":"Unknown","Latitude":"29.769243","Country":"United States","Date Submitted":"03/15/2010 11:32 UTC","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around March 13th 2010"],"City":"Houston","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"22313","Object Flight Path":"Stationary"}