{"map":"<A HREF = \"http://maps.google.com/maps?q=35.685383,+-82.002844(22312)&iwloc=A&hl=en\"> mufon case (22312) map </A>","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Marion","There were no other sightings in Marion on or around March 15th 2010"],"Country":"United States","Case Number":"22312","files":["/var/www/straped/mufon/html2text/22312.html.txt","/var/www/straped/mufon/org/22312.html"],"Date of the Event":"03/15/2010 08:15 UTC","Summary":"very bright, color changing sphere","Tags":"City","Disposition":"IFO","Latitude":"35.685383","Date Submitted":"03/15/2010 11:02 UTC","Object Shape":"Sphere","Object Features":"Undisclosed","Longitude":"-82.002844","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAt around 8 p.m I went to the grocery store about 2 miles from my house. Spent about fifteen minutes inside. It was dark. As I'm walking to my car in the parking lot, facing west is a group of 3 mountains. Greenlee, Hoover and Mackeys Mtn. Directly above Mackey is a VERY bright object. I stop and look and rush to my car. The shopping center is attached to a Lowes Hardware. Lowes is in a large field that borders a large shrub farm. I drive to Lowes parking lot and roll down my window, facing west. The object appears to be white with hues of blue emanating at times. Mackey Mountain is about 3 miles away, as the crow flies. I watch the object for a few minutes and decide it might be overhead at my house, because you can see Mackey from my front porch. I call my dad on my cell phone and tell him to go outside and see if sees anything. I keep my eyes on the object until I start getting closer to Mackey and realize it must have been behind the mountain instead of over top of it. Which would make it MUCH larger than I originally thought. I turn back around and go back to Lowes but it is gone. My father didn't see anything. This is not the first experience Ive had. Had a very intense experience in '05. I came home to check if anyone posted sightings in NC and someone had posted one today in Wilmington. Thats the east coast of the state and I'm at the western part of the state. Perhaps the two are related."],"Region":"North Carolina","Log Number":"US-03152010-0015","Viewing Distance":"Unknown","City":"Marion","Source":"MUFON"}