{"Longitude":"-80.475027","files":["/var/www/straped/mufon/html2text/22323.html.txt","/var/www/straped/mufon/more/22323_submitter_file1__NewUFOmovie.WMV","/var/www/straped/mufon/org/22323.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=25.475562,+-80.475027(22323)&iwloc=A&hl=en\"> mufon case (22323) map </A>","Object Flight Path":"Undisclosed","Disposition":"IFO","Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Ufo Sighting in Redlands Florida","Latitude":"25.475562","City":"Homestead","divs":["sighting detailsi was walking my dog around 6:45 pm on february 28, 2010. i looked up at the sky and saw what appeared to be a shooting star. i quickly pulled out my iphone and started taking pictures. it became obvious this was not a shooting star as it headed down to the earth. i thought maybe it was a comet or meteor. it became suspended in the air and there was three individual lights in a triangular shape still heading downward but now it was also moving side to side. a fourth light appeared and finally a fifth light. it looked like a(y). it was incredible! i had never seen anything like that. i was still caught up in amazement when i noticed a silent object in the sky moving towards me about a 1\\2 mile away from me. this object suddenly released what appeared to be another flash of light which startled me, and as before this light starts coming down to the earth, splits in two, then three, then four and finally five. it continued moving downward and side to side as if dancing in the sky until i could no longer see them beyond the horizon. i was totally beside myself. i proceeded to download all my pictures and created a u-tube for all to see."],"Region":"Florida","Tags":"City","Source":"MUFON","trends":["There have been 21 other sightings in Homestead","There were 3 other sightings in Homestead on or around February 28th 2010","This sighting has never been favorited.",""],"Date Submitted":"03/16/2010 07:37 UTC","Case Number":"22323","Date of the Event":"02/28/2010 06:51 UTC","Object Shape":"Circle, Flash, Triangle, Other, Unknown","Country":"United States","Log Number":"US-03162010-0009","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}