{"Object Features":"Undisclosed","Latitude":"38.631922","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around March 15th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Source":"MUFON","Disposition":"Hoax","Object Shape":"Boomerang, Triangle","Tags":"City","Log Number":"US-03162010-0012","City":"St Louis","Date of the Event":"03/15/2010 09:20 UTC","Summary":"Triangle over St. Louis with helicopter following.","Longitude":"-90.197274","files":["/var/www/straped/mufon/html2text/22326.html.txt","/var/www/straped/mufon/more/22326_submitter_file1__201003150820.jpg","/var/www/straped/mufon/more/22326_submitter_file2__201003150920.jpg","/var/www/straped/mufon/org/22326.html"],"divs":["Sighting DetailsMonday night March 15, 2010 I was sitting in my house in St. Louis and happened to look out the window, and saw two bright lights appearing to be underneath a street light across the way. When I locked on to it, it appeared to then \"level off\" and fly away into the distance in a slight curve around the pole, the lights on when to the right of the pole, off when to the left of it and fading to the distance. It didn't head all the way left as the airplanes do that land at the airport. It especially caught my eye because it looked similar to two white lights I saw in that same direction last June and posted to MUFON. These lights were not clearly unconventional, but an hour later, taking in groceries from the car to the house, hovering directly across the cross street were two bright lights that were stationary, with a helicopter flying underneath it. The helicopter could be heard, the \"plane\" never made a sound. After I looked at it for a few seconds just hovering there and the helicopter moving beneath it, another light appeared to the right and the object started to \"glide\" away in that direction. A red light then appeared and flashed in a non-discernible pattern. I watched the triangle of white lights with a red light in its middle slowly move away and the helicopter followed it. I could clearly hear the helicopter and no other sound but traffic when it passed close by. Ironically, or synchronistically, the June sighting already mentioned also included a triangle that flew over my house a short while after I had seen the object or objects with two white spheres. Also, this Monday night, my friend at my house and I heard rumbling off and on throughout the evening. After the sighting it got loud enough that we could feel the rumbling indoors and went outdoors to investigate. In the direction that the triangle object was hovering in when I initially saw it, it sounded as if jet engines were rumbling during takeoff when hearing that as an observer close to the ground by an airport when the planes take off. I doubt they were jet engines because the sound would usually build up then suddenly stop as if the engines were literally shut off, but if a plane were making the sound it should have faded away. The lights and sounds Monday night were strange. I've included two images I created from pictures I've taken of areas in which I saw the lights from the perspective I saw them, \"photoshopping\" in the anomalous craft, lights and helicopter."],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.631922,+-90.197274(22326)&iwloc=A&hl=en\"> mufon case (22326) map </A>","Case Number":"22326","Date Submitted":"03/16/2010 09:15 UTC","Sighting Duration":"00:03:00","Country":"United States"}