{"Country":"United States","Object Features":"Unknown","Disposition":"IFO","trends":["There have been 6 other sightings in Gaylord","There was one other sighting in Gaylord on or around March 16th 2010","This sighting has never been favorited.",""],"Log Number":"US-03162010-0013","City":"Gaylord","Tags":"City","Date of the Event":"03/16/2010 08:00 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["Sighting DetailsOn the way home from my son's soccer practice we turned south onto our road near Boyne City, MI, and in the southeastern sky in front of us, we saw about six or seven yellow circular lights in a row diagonally near the horizon. They appeared for about five seconds and then disappeared from the ends towards the center until one was left and then it too disappeared. This happened repeatedly (six or seven times) until about 8:30 which is the last that we saw them. At times, there were two grouping and sometimes they all faded out at the same time rather than disappearing from the ends inward. They were not always in the same exact location but did stay in the southeastern sky and were always close to the horizon. No way of telling for sure, but they appeared to be a couple miles away which would have made their actual size very large. The lights did not move once they appeared, but would hover in place until their disappearance. I spoke to a neighbor who has said that he has seen the same thing in the southeastern sky before. When I first saw the lights, I thought it must be some new cell-towers that went up. But the color wasn't right and the position kept moving, so my theory was quickly ruled out. I was not afraid at the time (my son WAS). I stopped my car and got out my phone to take a picture. I did get a picture, but it was only the last light in the center after the outer lights had disappeared so it just looks like a very, very big star just above the horizon. We didn't lose sight of the object. After a while it just didn't reappear anymore, and we were getting cold, so we went indoors."],"Object Shape":"Other","files":["/var/www/straped/mufon/html2text/22327.html.txt","/var/www/straped/mufon/more/22327_submitter_file1__GetAttachment-1.aspx.jpeg","/var/www/straped/mufon/org/22327.html"],"Longitude":"-84.670082","Date Submitted":"03/16/2010 09:39 UTC","Region":"Michigan","Summary":"5 or 6 hovering yellow lights in a diagonal row close to the horizon.","map":"<A HREF = \"http://maps.google.com/maps?q=45.036563,+-84.670082(22327)&iwloc=A&hl=en\"> mufon case (22327) map </A>","Weather Factors":"None","Object Flight Path":"Stationary","Case Number":"22327","Latitude":"45.036563","Sighting Duration":"Undisclosed"}