{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-96.595739","Case Number":"22329","Date Submitted":"03/16/2010 10:31 UTC","Date of the Event":"02/16/2010 10:10 UTC","trends":["There have been 12 other sightings in Mesquite","There were no other sightings in Mesquite on or around February 16th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.774726,+-96.595739(22329)&iwloc=A&hl=en\"> mufon case (22329) map </A>","divs":["Sighting DetailsOn fab 16th 2010 apx around 10:10 - 10:15 PM I was coming back from the store and was walking between the house and next door. It was just flooting across the sky right over my next door neighbors house at apx 15 to 20 mph. It was solid black. So black it was like a void in the sky. At apx 500 feet more or less it seemed to move in a stright line no sound at all. I would never have known this thing was above me if I didn't look up. It had 4 dim red lights on each conner on the craft. Solid, not blinking. It was moving wast to east. No FAA lights. I don't think I remeber ever seeing a brick flooting in the sky before. It only had one dimension! Not 2 or 3 dimensions just one.. like a flat sheet of black paper it was so flat that it was out of my sight in 30 seconds.. I guess cause it was flat and one dimensional. The very dim lights could have been plasma vents to keep it up in the air.. I dunno.. just a guess. It was a drop jaw moment for me. I couldn't believe what I was seeing. I always wanted to see a real UFO for myself all my life. Actually after seeing this thing and thinking about it it gives me the willies. I reported this to the Mesquite, Texas police dept. Nobody else reported this thing and I could tell the cop that called me back was laughing at me for reporting it.. I ask him if anyone else reported this and he said no I was the only one. I reported it like 3 or 4 days later. Didn't think the police would do much about it anyways but thought it might help just to document the sighting. This was my \"First\" UFO sighting. I wish I had a camera handy but the one I do have is only a 4 mega pix camera and seeing the UFO was so dimly lit I don't think it would have been a very good picture or video."],"City":"Mesquite","Object Shape":"Square, Rectagular","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03162010-0015","Latitude":"32.774726","Summary":"Rectagular black craft moving very slow apx 500 feet with 4 dim red lights. NO FAA lights. 1 dimensional?.. like a flat black sheet of paper with lights on each conner.","Disposition":"Unknown","Region":"Texas","Country":"United States","Object Features":"None","Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22329.html.txt","/var/www/straped/mufon/org/22329.html"],"Tags":"City"}