{"Date of the Event":"03/13/2010 03:27 UTC","Country":"United States","divs":["sighting detailsi was born and spent my summers as a youth on the beach in malibu, ca. i am familiar with flight patterns etc...( ie; military bases and lax ) i will attempt to be as short as possible w\\ out leaving out detail. i was sitting in my living room which opens unto my deck on the beach (south facing) and have views of the channel islands, and the point of palos verdes as well as lax. it was approximately two thirty a.m. and i was engaged in shall i say, adult activities. as i have an inclined sense of awareness, (not to dismiss paranoia) i felt i was being watched. the star like object that i observed as i turned to look out to the ocean, was stationary and the second i looked, it proceeded to simply move in a horizontal pattern as would the jet liners that are a consistent. at first i believed it to be a military, coast guard or law enforcement craft. due to the constant invasion of privacy by our local coast guard and sheriff's department, i immediately took video of this craft that seemed to know i was aware of their presence. i believe this because each time i would simulate as if i had dismissed their intrusion, the craft (ufo) would then reverse to its prior position or again become stationary.(at such speed that a human being simply could not stand the g-force and clearly not technology that i am aware of.) when i became absolutely livid at the thought of my privacy in my own home being violated after countless occurrences, extra terrestrial, law enforcement or not. i have been documenting these almost nightly episodes. on three apportioned incidents, days if not weeks, i was viewing my \"home video's\" and observed this multi colored (star like) ; though flat and certainly too close to be a star, send a beam (circular) of light that; judging by my personal video, seemed to have taken at least fifteen minutes to come directly into my living room (lord don't send the twinkie truck when i press send on this) an alien face(s) watched me for the remainder of my video's capacity. my \"feelings\" on this matter are of no consequence. other than simply being violated as we simple minded americans (forgive my cynicism directed to the powers that be) are assumed to not tell the difference between a weather balloon and a stealth fighter. at any rate, i did not lose sight of these \"ufo's\" more often than not, they simply travel to a distance and appear to be a star and\\or vanish. i only write this in hopes it will help in the interest of my country and fellow man regardless of nationality, and hopefully aid in the forge ahead to understand and explore the unknown. god bless you all for your efforts to inform and protect all mankind. thoughtfully, cory..."],"Region":"California","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.009818,+-118.807549(22322)&iwloc=A&hl=en\"> mufon case (22322) map </A>","Case Number":"22322","Latitude":"34.009818","Tags":"City","files":["/var/www/straped/mufon/html2text/22322.html.txt","/var/www/straped/mufon/org/22322.html"],"Log Number":"US-03162010-0007","Object Shape":"Chevron, Diamond, Disc, Sphere, Star-like, Triangle","Date Submitted":"03/16/2010 05:00 UTC","City":"Malibu","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"I observe consistent UFO activity from my deck on the beach in Malibu and have actually video taped these events.","Weather Factors":"Unknown","Longitude":"-118.807549","Disposition":"Insufficient Data","trends":["There have been 20 other sightings in Malibu","There was one other sighting in Malibu on or around March 13th 2010"],"Source":"MUFON","Viewing Distance":"Unknown"}