{"Country":"United States","Object Flight Path":"Straight-line path","Disposition":"IFO","Sighting Duration":"Undisclosed","Summary":"seen small flying mass (about 9 objects),thought it was birds but didn't notice flapping.wings. they were either lit or reflecting light.","map":"<A HREF = \"http://maps.google.com/maps?q=27.846002,+-82.696624(22338)&iwloc=A&hl=en\"> mufon case (22338) map </A>","divs":["sighting detailsat exactly 8:04pm i walked out to my back porch and i looked up as i always do. i was facing kind of southwest. from the corner of my eye in the east i noticed about 8 or 9 slightly lit, or dimmly reflective objects in the air. they were headed sw. in a split second i went from thinking they were birds to realizing the time of the day, their formation and the light. it took me a second or so to focus my eyes on them because they were not really bright, about as dim as a distant star and they were sort of blurry, i guess saying they were round with an aura is the best description. if it wasn't for them moving i would not have noticed them. they were all flying close together, not in any particular shape and they were moving around within their \"formation\" and appeared to all be and stay at the same exact altitude as it sped through the sky. they flw straight in one direction. the best way to describe the individual objects would be that they were round, disc shaped, blue-ish \\ grey center and aura. no sound at all. totally silent. i lost sight of them because of the distance and visibility. it was partly cloudy. about 10 seconds afterwards i received a phone call from my brother and told him about it. i went back out the next night at around the same time and have not seen them since. this was on wed, march 10."],"Source":"MUFON","Log Number":"US-03172010-0004","Longitude":"-82.696624","files":["/var/www/straped/mufon/html2text/22338.html.txt","/var/www/straped/mufon/org/22338.html"],"Region":"Florida","Object Features":"None","trends":["There have been 4 other sightings in Pinellas Park","There were no other sightings in Pinellas Park on or around March 10th 2010"],"Date Submitted":"03/17/2010 12:27 UTC","Weather Factors":"Unknown","Case Number":"22338","Viewing Distance":"101-500 Feet, Unknown","Latitude":"27.846002","Tags":"City","City":"Pinellas Park","Date of the Event":"03/10/2010 08:04 UTC","Object Shape":"Circle, Disc"}