{"Longitude":"-88.828455","Log Number":"US-03172010-0002","files":["/var/www/straped/mufon/html2text/22336.html.txt","/var/www/straped/mufon/org/22336.html"],"Latitude":"43.845205","Weather Factors":"Unknown","divs":["sighting detailsi was going to my cousins house one night and saw one of our local ufo's. so i decided to stop in a church parking lot to take the video, only this time i had my new high-def camera on me, so i used it. i dont need to get into details as they ask for since the video explains it. i have hundreds of these along with some other people. 1. i was going to town 2. i noticed it cause it was too low to be aircraft and looked awfully familiar as i see these all the time. 3. i didnt think of what it was when i noticed it, i knew what it was-i'm not stupid 4. the object held a steady course, slower than prop plane, and there was also a white ball as i call them that showed up in the same proximity, and time frame as this. i actually took video of it before returning to take more video of this one. 5. i felt the way i always feel, happy to have one more video 6. lost sight of it since i was in town, and there are houses and trees, and this thing is super low internet is slow so i'm not going to upload this is the link to the video, copy and paste please http:\\\\www.youtube.com\\user\\cryinthabluze?feature=mhw4#p\\u\\12\\dl5a_iw9lu8"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","trends":["There have been 11 other sightings in Ripon","There were no other sightings in Ripon on or around March 8th 2010"],"Case Number":"22336","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Country":"United States","Disposition":"Unresolved","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.845205,+-88.828455(22336)&iwloc=A&hl=en\"> mufon case (22336) map </A>","City":"Ripon","Region":"Wisconsin","Source":"MUFON","Summary":"UFO over my hometown/video","Date of the Event":"03/08/2010 12:00 UTC","Date Submitted":"03/17/2010 12:07 UTC","Object Shape":"Other"}