{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22337.html.txt","/var/www/straped/mufon/more/22337_submitter_file1__5808_119401748714_589863714_2567210_517681_n.jpg","/var/www/straped/mufon/org/22337.html"],"Case Number":"22337","Date of the Event":"03/16/2010 07:30 UTC","Source":"MUFON","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around March 16th 2010","This sighting has never been favorited.",""],"Latitude":"41.886994","map":"<A HREF = \"http://maps.google.com/maps?q=41.886994,+-87.628358(22337)&iwloc=A&hl=en\"> mufon case (22337) map </A>","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailslike the erie pa sightings these sightings over chicago have been occurring for some time now. i watch the night sky as much as i can. when i see these strange lights in the past i usually first observe red orbs changing to orange orbs then these intelligently controlled orbs of light noiselessly fly into various formations such as triangles stay stationary for minutes then dim out and shoot straight up into the sky. also i have been noticing quite a few fake aircraft. i say fake b\\c the lighting configuration and the lights themselves look like nothing i have ever seen before. i have spent the past 18 years in the aviation business and have never seen anything like what i have been seeing in the sky for the past year. attached is photo i took of orange orbs. they were in a triangle when i took the photo. only one came out well enough to see. no they were not chinese lanterns. they maneuvered in a intelligently controlled manner. i believe that its only a matter of time before who ever is piloting them make contact with earth. after researching to see if anyone else has seen the same thing it amazes me how many people around the world via youtube have caught the same exact thing. 16 mar 10 guttergawker"],"Longitude":"-87.628358","City":"Chicago","Region":"Illinois","Country":"United States","Tags":"City","Summary":"Orange UFO balls of light form triangle over house","Log Number":"US-03172010-0003","Date Submitted":"03/17/2010 12:24 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Sighting Duration":"00:10:00","Object Shape":"Circle, Fireball, Oval, Sphere, Star-like, Triangle","Object Features":"Unknown","Disposition":"Unresolved"}