{"Summary":"Thumbnail Shaped, Bright Blue UFO Streaks Across the Sky","divs":["Sighting DetailsThis is our third time seeing this event so I decided to report it. She has seen this event twice at night around 8 to 9 PM AZ time in the Eastern sky and in the Southern sky of Lake Havasu City. I have seen the object once and after discussing it we've agreed it is the same type of event. I have never seen anything even close to this and I have seen some very interesting things in our desert sky. The event lasts 2 seconds or less. It is a very bright blue (believe it or not) thumbnail shaped object traveling approx. 2800 to 3200 miles per hour and is visible by an all encompassing glow over the surface of the object. This does not compare to a meteorite. There is no trail visible and the object maintains its shape even though it is only seen briefly. We say thumbnail because it has a curved front end, flat sides and a blunt but semi-curved backend. We seem to see it straight-on from the ground to the bottom each time. We can't tell elevation or size but I would guess it to be 100+ feet across and nearly equal in length with no visible wings or extremities."],"Log Number":"US-03172010-0012","Viewing Distance":"Unknown","Disposition":"Unknown","Weather Factors":"None","Date of the Event":"02/01/2010 09:00 UTC","Tags":"City","Country":"United States","Object Shape":"Square, Rectagular","Sighting Duration":"00:00:02","Case Number":"22346","Longitude":"-114.315455","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.489301,+-114.315455(22346)&iwloc=A&hl=en\"> mufon case (22346) map </A>","files":["/var/www/straped/mufon/html2text/22346.html.txt","/var/www/straped/mufon/org/22346.html"],"City":"Lake Havasu City","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around February 1st 2010"],"Object Flight Path":"Straight-line path","Latitude":"34.489301","Date Submitted":"03/17/2010 04:39 UTC","Region":"Arizona"}