{"map":"<A HREF = \"http://maps.google.com/maps?q=33.418918,+-111.546088(22344)&iwloc=A&hl=en\"> mufon case (22344) map </A>","Case Number":"22344","Latitude":"33.418918","Tags":"City","City":"Apache Junction","Object Shape":"Sphere","Region":"Arizona","Longitude":"-111.546088","Source":"MUFON","Date Submitted":"03/17/2010 11:35 UTC","Object Features":"None","divs":["Sighting DetailsOn the weekend of March 8-9, 1997, I was camping with a group of students next to Fish Creek, AZ. Sometime between 11pm and 1 am on the night of March 8-9, 1997, I woke up to use the rest room. As I stood next to my tent, I was facing north and enjoying the starlit sky for a moment before I went back to sleep. Then, I noticed a light moving steadily from my left to right [west to east] above the rim of the canyon I was in. The light appeared to be a globe or orb glowing continuously. Because of the size of the light and its relative speed, I first thought it was a light civil aircraft. As I watched, I could see no aircraft outline, nor any other running lights (e.g. wingtip strobes, red or green running lights). All I could see was a globe that was the color of an incandescent lightbulb. I judged it to be too large for a typical light civil running light. I did not hear any sounds that an aircraft or helicopter would make. Based on the size of the globe, its brightness, and angle above the horizon [maybe 20 degrees - a guess because I have not been to Fish Creek for six or seven years], I ruled out a sattelite. I spent 12 years in the Marine anti-aircraft warfare field and spend many nights in the desert observing aircraft, and many hours watching radar scopes, and have watched sattelites go overhead. As I watched, the light disappeared behind a rock formation that jutted up from the canyon wall. I waited for the light to appear on the other side of the rock formation. I waited a minute or more. It never reappeared. While I observed it, it never changed speed or direction. I don't think it was an aircraft landing light because I don't think it would have been that bright from my angle which was appeared to be perpendicular to its line of flight. I don't know what it was. I can't compare it to the Phoenix light observed five days later because I did not observe the Phoenix lights. Recent interest over the March 13th anniversary of the Phoenix lights prompted me to make this report."],"Summary":"Not Provided","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"03/08/1997 01:00 UTC","trends":["There have been 16 other sightings in Apache Junction","There were no other sightings in Apache Junction on or around March 8th 1997"],"Log Number":"US-03172010-0010","Country":"United States","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/22344.html.txt","/var/www/straped/mufon/org/22344.html"],"Object Flight Path":"Straight-line path"}