{"trends":["There have been 2 other sightings in Nescopeck","There were no other sightings in Nescopeck on or around March 17th 2010"],"Sighting Duration":"Undisclosed","Case Number":"22347","divs":["Sighting DetailsI was driving from Berwick on rt 93 south it is a rural road. It was a clear day with bright blue skies, about 55 degrees outside. I was looking at a plane in the sky and was wondering if it was laying a chemtrail or a contrail. The plane was very distant, I could make out the plane but no color and could not see details on the plane. As I was watching, at the same height as the plane but much closer to me, a sphere simply materialized. It was the color of mercury that we got out of old fashioned thermometers. What amazed me was that as it materialized it had a white aura around it that quickly dissapated. No noise that I could hear, but it was far away and my window was closed. I would approximate it to about 15 miles away from me. As I watched stunned it seemed to roll from the bottom to the top or quiver with ripples rolling form the bottom to top. Sort of like ripples in the water of a pond. The ripples went from side to side and then upwards. The center of the sphere seemed darker. There was a glare from the sun coming off of it but not a blinding glare. Just enough of a glare to know it was metallic like. As it did that the shpere sort of seemed to pull on itself and slightly pushed into a flatter bottom so that it was almost to an oval shape. Then it was gone, simply vansished there was no fading out or anything it was just gone. In my head my first thought was 'that was a mistake' a mistake by the sphere not by me. It was an odd feeling. I was very calm though. My second thought is that the Nuclear Power Plant behind me is down for repairs. My third thought was wow that was so fast I bet no one else saw it. There was no time to get a picture and if i had not been right there looking up at the time I would not have seen it. This was my first daytime sighting of anything unusual."],"Weather Factors":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","Latitude":"41.056269","City":"Nescopeck","Summary":"Sphere materialized looked like a huge ball of mercury. Vanished after rolling over.","Log Number":"US-03172010-0013","Date of the Event":"03/17/2010 09:46 UTC","Region":"Pennsylvania","Tags":"City","files":["/var/www/straped/mufon/html2text/22347.html.txt","/var/www/straped/mufon/org/22347.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.056269,+-76.214927(22347)&iwloc=A&hl=en\"> mufon case (22347) map </A>","Object Features":"Patterned Surface","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/17/2010 05:10 UTC","Longitude":"-76.214927","Country":"United States","Disposition":"Unknown","Object Shape":"Oval, Sphere"}