{"Viewing Distance":"Unknown","divs":["Sighting DetailsThere is a UFO in one of these pictures, I have over 70 photos taken from a NASA land surveyor on Mars. These 70 frames are taken from one source-linked photo. But beyond structured crafts, we are trying to prove existance of other human like life forms. Once we jump here, UFO's, (advanced structured craft,) become a no brainer. I have proven it by using one of NASA's photo,...as it was high definition. Sure, there were tamperings and censoring observed under high zooms,...but there was so much there they missed a ton of incredible life forms they couldn't get all of the evidenced pixel, coverd, or distorted. It would be safe to assume that if you could find one humanoid on Mars photo you would be able to find two,....and once you find two, it is probable you would find three, if you can find three there is no decrease in probability of finding four, five, six, seven humanoids in a photo that is suppose to be of Mars. In this photo you will see proof of an existance of advanced civilization that has congregated around a crater and lake bed. Naturally subterranian water is the last place to give up its water. Ground water is almost a certainty if there is ice on top soil or even scant meltings and dried up lake beds. Why not underneath an ancient lake can you not find millions of gallons of water. Anyway there is a disk in an early photo you can see it on the negative and the base frame, however, what is more important I have compiled the greatest group of pictures that demonstrate a vibrant, active, integrated civilization, clinging to existance in a hostile environment. These photos are just fantastic, just simply fantastic. You all will have a great time looking over these figures, statues, tools, machinery, sculptures, and carvings. I need to confirm who is receiving the collection of pictures,...I need a name,...in the meantime, Here are a few samples! (I will need a personal email to send these to.) These actual photos were enhanced with great time expendatures,...they enhancements are protected under copywrites as my enhancements, but you can go to main NASA source photo and find the figures yourself and publish those frames all you want. Bret Lowell Peirce"],"Date Submitted":"03/17/2010 02:47 UTC","Source":"MUFON","Object Features":"Dome, Window(s), Patterned Surface, Insignia, Appendage(s), Louvres, Other","Longitude":"-112.064067","Tags":"City","Object Flight Path":"Unknown","Log Number":"US-03172010-0011","Country":"United States","Latitude":"33.450487","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around March 16th 2010"],"Object Shape":"Other","Case Number":"22345","City":"Phoenix","Region":"Arizona","Weather Factors":"Unknown","Date of the Event":"03/16/2010 12:00 UTC","Sighting Duration":"12:59:59","files":["/var/www/straped/mufon/html2text/22345.html.txt","/var/www/straped/mufon/org/22345.html"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.450487,+-112.064067(22345)&iwloc=A&hl=en\"> mufon case (22345) map </A>","Summary":"Story of the milenium,....advanced life on Mars, I still don't believe it myself!"}