{"Disposition":"Unknown","Country":"United States","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=41.256913,+-95.991628(2235)&iwloc=A&hl=en\"> mufon case (2235) map </A>","Source":"MUFON","Date of the Event":"04/19/2003 02:02 UTC","Summary":"something over Omaha","Longitude":"-95.991628","Object Shape":"Boomerang","Sighting Duration":"00:00:59","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet, Over 1 Mile","divs":["Sighting DetailsIt was about 2 am, I just returned home from playing a show with my band, I wentoutside to have a cigarette before bed. It was clear so I was looking up at thestars when I noticed this object sort of faded into my view exactly in thedirection I was looking. It was very high up in the sky, almost like anairplane, but yet it was moving very fast in a straight line. It was not easy tosee, and as it moved my view became blocked by a tree and I lost sight of it. It was shaped like a boomerang with 3 o 4 dull lights running evenly down thewings. My initial reaction was that it was not like anything that I had everseen before, except that it looked kind of like a flying wing, so I was tryingto convince myself it was probably a B2 stealth bomber out of Offutt.But the more I thought about it I didnt think B2s had lights under the wingslike this did, nor are they shaped like a boomerang. Thats when a chill beganto run down my spine as I started thinking that it looked like something out ofthe movie Signs. Of course then my imagination took over and I was a littleoverwhelmed by the whole thing, I went back in my house and woke up my wife andtold her what I saw. She could see that I was in a mild state of shock, becauseI did see something and I dont know what it was. Im not one who believes thataliens are living here on earth, nor do I go UFO hunting. In fact I wish Inever saw this thing, because it will haunt me for a long timesince Ill probably never know what it was. But I feel it is something thatshould be reported, and if nothing else I can get a sense of relief from doingso. Thank you"],"trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around April 19th 2003"],"Case Number":"2235","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2235.html.txt","/var/www/straped/mufon/org/2235.html"],"Tags":"City","Region":"Nebraska","Latitude":"41.256913","Object Flight Path":"Straight-line path","City":"Omaha","Date Submitted":"04/19/2003 02:02 UTC"}