{"divs":["Sighting Detailshere another one of my sighting i like to share. I keep a dairy on my ufo sighting I was on the way to work that morning. I was driving down Commerce Street in Loudon. I notice a strange glowing white round light moving in a distance, it was moving slow. but some trees was blocking my view. while I was driving down commerce street. when I got to the gate at the warehouse. I got out of my truck to open the gate at the warehouse. I look over the warehouse. I still could see it but it was further away. then it disappeared. after it was gone. I open the gate. I got back in my truck and drove in the parking lot and park my truck. I got out of my truck and walk over to the warehouse and open the door. I walk in the door. after I got inside of the warehouse . I cut the burger alarm off . I stood there a few minutes, then I realize I forgot to put my soft drinks in my cooler. I walk back out the door. I was looking all over the sky. while I was walking back to my truck. I open my truck door and started putting my soft drinks in my cooler. after I was done putting my soft drinks in my cooler. I close my truck door and turn around. then I was stunned by a light shining down on me, it made me look up. the light was pretty high up. I keep looking up at the light. then it started to dim down then the light went out. there was no sound. I had to get my eyes focus. I lean over sideway to see if I could see it. I could see it but I could not make out the shape. all I could see was a black object moving north. there was no lights on it after the light went out then it made a turn, then went west. I watch it until it went out of my sight. the sightings happen around 7:10 am in the morning. it was not daylight yet but the sky was started to get a little light. after it was all over. I walk back into the warehouse and went to work"],"Object Flight Path":"Other","Case Number":"22351","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.736544,+-84.328671(22351)&iwloc=A&hl=en\"> mufon case (22351) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22351.html.txt","/var/www/straped/mufon/org/22351.html"],"City":"Loudon","Disposition":"Unknown","Region":"Tennessee","Date Submitted":"03/17/2010 08:41 UTC","Tags":"City","Weather Factors":"Unknown","Latitude":"35.736544","Date of the Event":"09/24/2006 07:10 UTC","Sighting Duration":"Undisclosed","Summary":"A UFO shined a light down on me at the warehouse in the parking lot.","trends":["There have been 10 other sightings in Loudon","There were no other sightings in Loudon on or around September 24th 2006"],"Longitude":"-84.328671","Object Shape":"Circle, Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03172010-0017"}