{"Tags":"City","files":["/var/www/straped/mufon/html2text/22358.html.txt","/var/www/straped/mufon/org/22358.html"],"Log Number":"US-03182010-0005","Region":"Pennsylvania","Weather Factors":"None","divs":["Sighting DetailsAsleep in bed when I was woken up by a very bright, round white light shining right in my face. It hurt my eyes to look at it. I then turned on my other side so I would'nt have to. I don't remember any sound coming from it.I remember making a mental note to myself that it was'nt one of the many helicopters that seem to be so prevalent around here. Also thought that it definitely was not the moon! My eyes were very sore and tired for at least 2 weeks afterward. The next morning my daughter whose bedroom window also faces South, commented to me that the previous night had been strange. I asked why. She then told me that she was watching a movie in bed when suddenly white lights moved across her bedroom walls. She did'nt know what to think of it, but was'nt scared even though she realized it could'nt possibly be car lights, because we live halfway up on a mountainside, and our bedrooms are on the second floor. I told her what I had seen. We both concluded that it had to be a ufo. Two days later my friend called me and said she had seen a strange white light shining into her bedroom as well. We only live a few hundred yards from each other. Told her what we had seen, and we concluded that it was the same night, and around the same time of the night. We realized that the light had been closer than we first thought, because she saw it in a window that faces North! This is not the only weird, unexplainable thing that I have witnessed while living here. However, it took me 8 months to report this event, and I did so because I searched the report database and found an almost identicle report from July 5, 2009. In PA. The witness mentioned a radio station; Cat Country. That radio station is about 15 to 20 miles from my location. I realize now that I have been following the reports almost daily in search of a story like ours from my area. And I found it this morning. I am reporting this today in hopes of giving someone else who may have seen this event validation about it. Also, I am anxious to see if others who witnessed the blinding white lighton the night of July 5, 2009 will feel compelled to report it here. Eventually, I hope to report the other unexplained events that I have witnessed from my mountainside view."],"Object Shape":"Circle","Object Flight Path":"Unknown","Date of the Event":"07/05/2009 12:00 UTC","Case Number":"22358","Sighting Duration":"Undisclosed","Date Submitted":"03/18/2010 10:12 UTC","Country":"United States","Disposition":"Unknown","Latitude":"40.992761","City":"Stroudsburg","Viewing Distance":"101-500 Feet","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.992761,+-75.189145(22358)&iwloc=A&hl=en\"> mufon case (22358) map </A>","Longitude":"-75.189145","trends":["There have been 6 other sightings in Stroudsburg","There were no other sightings in Stroudsburg on or around July 5th 2009"],"Object Features":"Unknown","Summary":"Intensely bright white light shining in window facing south 3 witnesses."}