{"Viewing Distance":"Unknown","Longitude":"-76.726044","Date Submitted":"03/17/2010 08:47 UTC","Country":"United States","Source":"MUFON","trends":["There have been 3 other sightings in Morehead City","There were no other sightings in Morehead City on or around March 17th 2010","This sighting has never been favorited.",""],"Object Shape":"Flash, Star-like","Tags":"City","Date of the Event":"03/17/2010 05:20 UTC","files":["/var/www/straped/mufon/html2text/22352.html.txt","/var/www/straped/mufon/org/22352.html"],"Weather Factors":"Unknown","Object Flight Path":"Stationary","divs":["Sighting DetailsI took the dogs out to do thier business and began doing some sky watching for a bit while they ran around. Morning was almost completely clear, a whispy cloud here and there, about 38-42 degrees. Looking southeast about 2 o'clock in the sky. I was looking at a clusters of stars and suddenly saw a starlike object just appear from no-where. I watched it for a about 20 seconds and it began to move about but not leaving the area of the sky. I came inside and got my step-son and his friend who had been up all night playing X-box. As I walked back through the house I grabbed our small digital camera that was able to shot video too, but knew from experience that it would not shot hardle a thing at night, but knew that I would have audio. The boys came to the back door of the sun porch and I pointed it out and right away they saw the movement. I have seen stars in the past that will dance around because of atmosphere., but this was doing alot more. I tried to turn on the camera, but the batteries were dead. We watched for about 1 minute and I decided to go in and find some batteries and in the mean time I woke my wife up and told her. I returned in less than a minute and started the camera and introduced the boys and we began to detail what we were seeing. During this time we saw flashes near and in the same portion of the sky in blue, greenish and red colors. all during this time too we watched the object brighten and dim quite a few time and move around in all different directions but still stay in the same portion of the sky. WE also saw steaks of light go past the area. My wife had joined us but watched the object from inside the sunroom. The boys decide to go in after about 5 min since they were cold. but I contiuded to observe. I turned the camera off after another few mintes. Went to the bath room and returned to the sun room where my wife was still watching. I started filming again and making some more observation and commenting for I am planning to post this to my youtube account. After another few minutes I turned the camera off and decided to finish getting ready for work. I poked my head out every so often to check on it and during one of these times I saw the object shoot out a light out the left side, that faded away. It continuded to stay in the same portion of the sky until the sun came up. It stayed bright even though the rest of the stars faded but it disappeared soon after. When down loading the video from the camera the time I found that the part I recorded in the sunroon didn't. How should I feel about this hmmmmmmm...... I don't know because as of now I have seen more ufo's than any one man should see in any life time. And lots of differt types also and differnt activity. I'm motivated to do start making my sightings public."],"Region":"North Carolina","City":"Morehead City","Sighting Duration":"Undisclosed","Summary":"Let out dogs in morning saw a object appear in sky and obseved for long period of time.","Disposition":"Unknown","Object Features":"Unknown","Latitude":"34.722939","Log Number":"US-03172010-0018","Case Number":"22352","map":"<A HREF = \"http://maps.google.com/maps?q=34.722939,+-76.726044(22352)&iwloc=A&hl=en\"> mufon case (22352) map </A>"}