{"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsOn the night of March 17th at 7:30 myself and two others were out looking at the sky when we noticed a bright orb peek up over the horizon directly in front of us it was bright white and at arms length it was the size of a pea. I got out my night vision goggles and looked through them. Off to the right of it there was another orb that hung in the air and swayed back and forth in a swooping motion about a half inch on each side from the point where it was stationary. As it was doing that another orb came from above it and moved into position above the first orb and right next to a dimmer one over the horizon. They made a triangle. As we watched them they all twinkled at different times. It looked to me like they were communicating with one another. At 8:50 Paula pointed out two orbs to our imiediate right. One was amber and the other red. The amber orb was in front of the red orb and they were hovering in the same spot.As I positioned myself for a better look they started moving in a straight line accross the sky, as they moved they got closer together. They made a right hand swooping turn and became one amber colored orb. We watched them until they dissapeared in the direction of the ocean. We turned our attention back to the triangle formation and noticed that the orb that moved into position to make the triangle was moving up higher in the sky. This made the triangle look bigger. We also noticed that the orb right next to it followed it. We watched it for awhile longer and decided to go home for a bathroom break and to get something to drink. At 10:00 we went back out to the place where we had seen the orbs and the triangle was still there. We noticed that it moved again. The top orb moved down and made the triangle look small. The orb that was dimmer was still right along side of it, they were still twinkling as if communicating. At this point I looked through the night vision goggles again and after a minute or two I noticed the same amber orb moving back into view from the direction we last saw it,(comming from the direction of the ocean). It was moving in a straight line to the immiediate right of where we were. I followed it and saw it drop a red orb out from underneath it. As they moved across the sky the amber orb slowly pulled away from the red orb, they were moving away from us. We told paula to flash her headlights at it to see if we would get a response. When she did the red orb stopped in its tracks and started going back in the same direction it had come in a seconds time. The amber orb stopped ond hovered until Paula beamed her high powered laser light up into the sky next to it. When she did it came straight towards us and flew right over us. It looked like a cluster of twinkling amber lights, then when it passed us it looked like a triangle craft. It had four amber lights in a row across the back and norrowed to one red light in the front. We stood where we were for about 45 seconds then decided to move back down the road. When we stopped we looked at the triangle formation and saw that all four of the orbs were moving in and out. The formation was getting smaller than bigger, still with the dimmer orb next to the highest one. I decided to look through the night vision goggles again and when I did I saw an orb to the left of the triangle which was the same direction the amber and red orb went. It was flashing, all of a sudden it flashed very bright,so bright that lit up the sky around it and the night vision goggles. The very next morning we noticed that there was a report of the same thing flying over Nevada. The pictures that were taken over Nevada were the same things we had seen in California."],"Source":"MUFON","City":"Leggett","map":"<A HREF = \"http://maps.google.com/maps?q=39.867294,+-123.705448(22369)&iwloc=A&hl=en\"> mufon case (22369) map </A>","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/22369.html.txt","/var/www/straped/mufon/org/22369.html"],"Latitude":"39.867294","Log Number":"US-03182010-0016","Object Shape":"Triangle, Other","Case Number":"22369","Longitude":"-123.705448","Region":"California","Date Submitted":"03/18/2010 10:45 UTC","Disposition":"Unknown","Object Features":"Other","trends":["There have been 17 other sightings in Leggett","There were no other sightings in Leggett on or around March 17th 2010"],"Country":"United States","Sighting Duration":"03:00:00","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"seven UFO'S,three witnesses,four hours","Date of the Event":"03/17/2010 07:30 UTC"}