{"Region":"Michigan","Source":"MUFON","Case Number":"22362","Summary":"White light moving across sky that pulsed or exploded.","Date Submitted":"03/18/2010 12:51 UTC","trends":["There have been 20 other sightings in Holland","There were no other sightings in Holland on or around March 17th 2010"],"Longitude":"-86.10497","map":"<A HREF = \"http://maps.google.com/maps?q=42.791904,+-86.10497(22362)&iwloc=A&hl=en\"> mufon case (22362) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Flash, Star-like, Unknown","Object Features":"Unknown","divs":["Sighting DetailsI was sitting on my deck looking up at the stars, and I seen an object very high in the sky a small non blinking white light move from south east to north west (over our house), didn't think much of it because we can see the space station and satellites move across the sky at times. About 5 min or less another one traveled in the same direction as the first only all of a sudden the tiny white light pulsed into a bright white light that surrounded the object and made it look 5 times the size it was before, then just as quickly it went back to normal, then about 5 seconds later it did it again, after that it just kept moving across the sky. I thought it very strange because I've been a sky watcher for 45 yrs and have never seen anything like this. Do you know if anything was reported as something maybe exploding in space? because that's what it reminded me of an explosion, you get the first tiny pulse of light before the big explosion of light. It wasn't a shooting star I know that for sure. It reminded me of the tiny white lights I have seen on some of the UFO video's. I felt excited about it because I had witnessed something I had never seen before, and I have seen other things I couldn't explain before last night. I got up and looked on the Internet this morning to see if they were reporting something exploding in space but there was nothing."],"files":["/var/www/straped/mufon/html2text/22362.html.txt","/var/www/straped/mufon/org/22362.html"],"Tags":"City","City":"Holland","Country":"United States","Viewing Distance":"Over One Mile","Latitude":"42.791904","Weather Factors":"Does Not Apply","Date of the Event":"03/17/2010 09:30 UTC","Object Flight Path":"Straight-line path","Disposition":"Unknown","Log Number":"US-03182010-0009"}