{"Source":"MUFON","Region":"South Carolina","Object Features":"Dome","Object Shape":"Disc","Date of the Event":"05/12/2000 03:29 UTC","Tags":"City","Object Flight Path":"Stationary","City":"Undisclosed","Date Submitted":"03/19/2010 03:31 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.837981,+-81.160574(22377)&iwloc=A&hl=en\"> mufon case (22377) map </A>","Log Number":"US-03192010-0008","Case Number":"22377","files":["/var/www/straped/mufon/html2text/22377.html.txt","/var/www/straped/mufon/org/22377.html"],"Viewing Distance":"21-100 Feet","Disposition":"Unknown","trends":[],"divs":["Sighting DetailsMy husband saw something in the sky for 20-30 min and asked me to wake up and look at it. I saw something metal like in the sky going up and down and back and forth. I told him I thought it had to be either a helicopter or a harrier jet and dismissed it. 20 minutes or so went by and then when we started going over the bridge I looked over to the right and there it was..it was the size of my 1300 s.f. house and super shiney silver. I thought it was a welcome to SC thing, but then noticed htere were no wires holding it up. I looked at it for a long time before the woods took my view, several minutes, the bridge was long. It had a very dark black smokey glass top and shiney silver bottom kinda round in shape but with squarish type sides. I looked for places where the lights could be opened and there were no lines in the metal for openings for lights..it was solid as it can be. I just found the picture of what I drew 10 yrs ago just last week when I was packing up stuff to move upstairs. There was a little red pickup truck on a half moon beach just to the left of the aircraft. It wasn't spinning, it was a very pretty day with no clouds in the sky. I looked for places where lights could come out but it was solid metal. The black glass was high enough that people could have actually have been walking around up there, like a black glass roof on a house, if we ever were to make houses with roofs like that, it'd be cool. There was a couple on the half-moon beach having a picnic on a blanket behind their truck. The aircraft actually was just to the right of them and if they'd looked up, I think they'd freaked. It was just about 75 feet from the bridge and was about 15 feet up above the bridge height so I had a very good clear look at this thing. I looked for heat waves off the bottom of the aircraft but there was none. It was so close to me yet I heard nothing. I could pick the lake and the town off the map if I look at my atlas again...there was only one lake and one bridge it could have been if you need to know those details, I can look them up and provide them. I can even download the photo I drew of the aircraft. People think you are crazy when you tell them, or they ask if you'd been drinking or smoking anything, a few friends of mine (2) over the last 10 yrs have actually said they thought they saw one, but it was dark at night when it happened to them. Mine was in broad daylight and my husband would not stop or let me out to get photos. He kept on driving, made me so mad!! Thanks'"],"Sighting Duration":"00:04:00","Weather Factors":"None","Country":"United States","Longitude":"-81.160574","Latitude":"33.837981","Summary":"It was sitting over a lake when I was riding over a long long bridge passing through SC to NC."}