{"trends":[],"Latitude":"40.640485","Object Features":"Undisclosed","Object Shape":"Disc","Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Disposition":"Insufficient Data","divs":["Sighting DetailsOk, last night at 1:00am both my friend and I were talking and admiring the stars in the middle of my college campus when we thought we saw a shooting star becasue we saw two small cresent lines of light. It was not shooting star. We saw what looked like a circular black object comprised either of one or two full circles which either reflected or emmeted dim light on its two edges in the cresent shap. The light emmeted was on two of the edges symetrical to each other in a cresent shape. The thing flew over us very low and close probablly 4 stories up in a perfect straight line not moving up or down but stayed on a straight path. It made no sound what so ever. It also moved some what fast but slowly enough for us to see it for a few seconds before it seemed to disapear rather than fade into the distance. We saw this three times within a 45 min period. The first time it flew over us from south to north, 15 min later we were looking at the stars again admiring them and then we noticed it move from west to east and the same thing happened. By that time we were looking for it again. The last time it happened within 5 min after the second time goign once more from south to north but over a couple yards to the west from where we were and it was higher ( we knew this becasue what we could see was smaller and it moved slower). We were not scared by it but rather suprised and curious towards what it could be. My friend acutally just saw it again tonight, same things occured, moving south to north practically over her."],"Tags":"City","files":["/var/www/straped/mufon/html2text/22372.html.txt","/var/www/straped/mufon/org/22372.html"],"Region":"Illinois","Date of the Event":"03/18/2010 01:10 UTC","Longitude":"-89.396078","Case Number":"22372","map":"<A HREF = \"http://maps.google.com/maps?q=40.640485,+-89.396078(22372)&iwloc=A&hl=en\"> mufon case (22372) map </A>","Log Number":"US-03192010-0003","Summary":"Two Black Circles with dim cresent shaped light either emmitted or reflected on opposite symmetrical edges","Date Submitted":"03/19/2010 01:27 UTC","City":"Undisclosed","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path"}