{"Weather Factors":"Unknown","divs":["Sighting DetailsAround 2am, me and 3 other friends decided to go star gazing on top of a mountain in Banner Elk, NC. It was exceptionally clear. We took 2 cars, 2 of my friends were in another car. They drove to the spot before me and my other friend arrived. I got a text from them around 2am saying they saw a UFO. We quickly got to them, but they said it disappeared. They said it stayed hovered (in the distance) above the skyline and quickly disappeared. I was curious so I looked everywhere I could to find something similar to what they described. They described it as red, green and white flashes of light. All of a sudden, on my right hand side, I noticed something flashing, much brighter than all the other stars. It also flashed red, green, and white light. It stayed stationary for approximately 20 minutes before going in a pattern. The pattern was this: up, down, diagonally left, and then diagonally back to it's original spot. We then noticed 2 more, side by side, close to the star Betelgeuse following the same pattern of movement and had the same flashing lights. Eventually the original one I spotted began to drop, slowly, below the mountain, and then bobbed up and down, still visible. It then disappeared. The other two began to get more faint like they were farther away. Then to the far left of me, one much closer appeared out of no where, also with the same pattern and colors. Then out of nowhere it disappeared. The only two that were left were the two closest to Betelgeuse. We sat and watched until approximately 4:30am. The two did not disappear. We left so I do not know what happened with those last two. I almost cried out of excitement, I never in my life thought I would experience something like this. I'm going back tonight with one of the friends who joined me last night, and another person who did not see them last night. We're going at the same time as last night. Also, I was going to call a dispatcher to see if anyone else had reported seeing it. My GPS has been dead for a while so I couldn't get the point in the sky the original object was so my friend used her iPhone to see which direction in the sky it was, it started to work, and then stopped working all together."],"Case Number":"22379","Tags":"City","trends":["There has been one other sighting in Banner Elk","There were no other sightings in Banner Elk on or around March 19th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Other","Date of the Event":"03/19/2010 02:00 UTC","Object Shape":"Circle, Flash, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/22379.html.txt","/var/www/straped/mufon/more/22379_submitter_file1__ufo.jpeg","/var/www/straped/mufon/org/22379.html"],"Date Submitted":"03/19/2010 04:36 UTC","Sighting Duration":"Undisclosed","Summary":"Red, green flashes, multiple UFOs for approximately 3 1/2 hours.","Log Number":"US-03192010-0010","Latitude":"36.163182","Viewing Distance":"Unknown","Object Features":"Unknown","Region":"North Carolina","Longitude":"-81.871502","Country":"United States","Source":"MUFON","City":"Banner Elk","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=36.163182,+-81.871502(22379)&iwloc=A&hl=en\"> mufon case (22379) map </A>"}