{"Date of the Event":"03/17/0001 12:00 UTC","trends":["There have been 9 other sightings in Euclid","There were no other sightings in Euclid on or around March 15th 0001"],"Summary":"zig-zagging color-chhanging light over lake erie","Log Number":"US-03192010-0018","Disposition":"IFO","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"41.599345","Object Shape":"Flash, Sphere","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22387.html.txt","/var/www/straped/mufon/org/22387.html"],"Object Features":"Unknown","Longitude":"-81.524007","Region":"Ohio","Source":"MUFON","Date Submitted":"03/19/2010 08:50 UTC","Sighting Duration":"00:20:00","divs":["Sighting DetailsWe had heard about the recent sitings of a UFO hovering above Lake Erie near Euclid, OH, so we went and found a spot on a side street that looked over the lake near some apartments. We then saw what everyone was talking about. I never fully believed in UFO's until I saw this with my own eyes! It was mostly an amber-color but shifted to redish colors and sometimes more of a whitish colour. It would zig-zag sometimes, it would be stationary at others, and it would rapidly move all over the place at other times. It was not an airplane as it would move right and then left and then up and down with no rhyme or reason. It would fade in and out and change colors and intensity. When I first noticed it I thought it could be a plane so I watched it for a few minutes to determine whether it could have been a plane or helicopter. After a few minutes it started its zigzagging so I deduced that it was not a plane. I considered a star or planet but it was all over the place. I had no particular strong feelings other than thinking to myself wow I actually saw a UFO. I don't know if it's aliens or not, it's just unidentified and curious. I listen to Coast to Coast AM all the time so I am familiar with the concepts of UFO's and what people can mistake them for. It got cold so we decided to go home."],"Tags":"City","City":"Euclid","map":"<A HREF = \"http://maps.google.com/maps?q=41.599345,+-81.524007(22387)&iwloc=A&hl=en\"> mufon case (22387) map </A>","Viewing Distance":"Unknown","Country":"United States","Case Number":"22387"}