{"Source":"MUFON","Latitude":"40.308703","Object Features":"None","divs":["Sighting Details On the evening of March 15, 2010 I was driving home from Vernal, UT with my wife and son in our car. At about 7:30 PM, local time, a HUGE bright amber colored light just popped out of nowhere in front of us. It was about 3 miles from me, and about 35 degrees up in the sky in the Western sky. I noticed it because it was obviously the only light in the sky at the time. Absolutely no stars, planets, planes, or any other sort of light. I have seen this exact light in the sky before, at least six times this year already! I felt as if it really wanted us to see it. I proceeded to finish driving home. As I was continuing my drive, it moved with me to about 10 degrees above the western horizon. I detail on the attached movies exactly what we are looking at and where we are looking at. When we got back to my home, I grabbed my camera out of my Jeep and started filming. The object stayed in view for about 30 minutes total. My witness to this is my wife, ********, and the footage I have provided. ************** both of Roosevelt,UT. After filming for about 10 minutes, the object slowly flew North toward the Uintah Mountain Range. It didn't fly off or zoom off, it just kind of faded out of view. The very next day at about 6:30 PM, n unmarked Blackhawk helicopter flew right over my head and went in the exact same direction as the UFO. I even have footage of the helicopter taking pictures of me and my family. In all of the times I and my wife have seen this object, we never ever felt any fear. This thing seems just to want us to know it is there, watching us. This is a very active spot for UFO sightings. Roosevelt is home of the infamous UFO Ranch as well. I would just like to know what exactly this thing is. Is it man made? Is it a natural phenomenon? Is it extra-terrestrial? Any answers you may gather from viewing this would be very helpful to me. Thank you for your consideration on this matter. Sincerely, *********** PS To whom it may concern: I have photos and more video of this object. There are only three places for me to upload video files of the object. Thank you"],"files":["/var/www/straped/mufon/html2text/22388.html.txt","/var/www/straped/mufon/org/22388.html"],"Region":"Utah","Country":"United States","Date Submitted":"03/19/2010 09:11 UTC","trends":["There has been one other sighting in Roosevelt","There were no other sightings in Roosevelt on or around March 15th 2010"],"Object Flight Path":"Stationary","Summary":"Driving home with my wife and son and filmed a UFO over Roosevelt UT","Sighting Duration":"00:30:00","City":"Roosevelt","Disposition":"IFO","Object Shape":"Circle, Star-like","Weather Factors":"None","Log Number":"US-03192010-0019","Date of the Event":"03/15/2010 07:50 UTC","Case Number":"22388","Tags":"City","Longitude":"-109.98743","map":"<A HREF = \"http://maps.google.com/maps?q=40.308703,+-109.98743(22388)&iwloc=A&hl=en\"> mufon case (22388) map </A>","Viewing Distance":"Over One Mile"}