{"Latitude":"29.957446","Object Shape":"Circle","Sighting Duration":"00:03:00","Viewing Distance":"Unknown","Log Number":"US-03192010-0012","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.957446,+-90.070192(22381)&iwloc=A&hl=en\"> mufon case (22381) map </A>","Tags":"City","Disposition":"Unresolved","Summary":"Black Circular UFO seen over New Orleans","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around March 17th 2010","This sighting has never been favorited.",""],"Region":"Louisiana","Case Number":"22381","Object Flight Path":"Hovering then path,Path with directional change","City":"New Orleans","divs":["Sighting DetailsMy friend Greg Gomez and I were outside the Southhall dorms at the University of New Orleans at 4:15 PM. I began skateboarding on the sidewalk while Greg made a call. I then had the thought to scan the skies for a UFO. (I often scan the sky for anomalies so that I might increase the chances of actually seeing one.) Well, I got what I was looking for. As soon as I looked up, I saw what looked like a black circle floating in the sky. The object immediately caught my attention because of it's foreign appearance. The circular object was approximately half the size of a dime from my perspective and made no noise. I gazed at the object for a few seconds wondering what this object could be before I called out to Greg. After hanging up, Greg stood beside me and said \"What is that?\" The object then began moving down and to the right in an erratic motion. The flying object then moved in front of a cloud. This is where things really get strange. At this point, I thought the black on white contrast would give me a more defined visual of the object. However, the object seemed to be changing in shape. I felt as if my brain had a hard time grasping the true shape of the object. The object seemed to flatten out into an elliptical shape and even split in two at times, then coalesced in less than a second. Once the flying object moved past the cloud, it dissipated. Since it was St. Patrick's Day, we thought that this object could have been a huge balloon, but that doesn't really make sense if you consider that it moved down, changed shape, and then disappeared. I am attaching two photos of UFOs similar to what we saw that I found on the internet."],"files":["/var/www/straped/mufon/html2text/22381.html.txt","/var/www/straped/mufon/more/22381_submitter_file1__BlackHole_UK-FINI.jpg","/var/www/straped/mufon/more/22381_submitter_file2__chins.jpg","/var/www/straped/mufon/org/22381.html"],"Date of the Event":"03/17/2010 04:15 UTC","Source":"MUFON","Object Features":"Other","Weather Factors":"None","Date Submitted":"03/19/2010 04:50 UTC","Longitude":"-90.070192"}