{"Disposition":"Unknown","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/22390.html.txt","/var/www/straped/mufon/org/22390.html"],"Weather Factors":"Unknown","Country":"United States","Summary":"a white light flew in my direction and my son saw it fade out while i was looking for my camera","Date of the Event":"03/19/2010 09:22 UTC","trends":["There have been 10 other sightings in Loudon","There were no other sightings in Loudon on or around March 19th 2010"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.734804,+-84.330101(22390)&iwloc=A&hl=en\"> mufon case (22390) map </A>","Date Submitted":"03/19/2010 10:34 UTC","Viewing Distance":"Unknown","Longitude":"-84.330101","Tags":"City","Object Shape":"Star-like","Sighting Duration":"Undisclosed","divs":["Sighting Details I got a phone call from a friend of mine. she told me somebody was at my house in town. my house in town is empty, me and my wife got into my car and went to my house in town to see who was there. when we got there nobody was there. then we call my friend on my celler phone and told her nobody was there, my wife talked to her on my phone all the way home. after we got home my wife stay in the car and talk to my friend. I got out and started walking toward my front door, as I was walking, I looked up I could see a white light that looks like a star moving my direction. the object was moving east. I reach to my side to get my camera it was not there I forgot that I took it off. I ran into the house to get my camera I forgot where I layed it. I told Jimmy there is a UFO outside. Jimmy went outside with me I show him where it was. he keep watching it. while I went to my truck to find my camera. while I was in my truck looking for my camera. Jimmy told me that it faded out it never flew over us. if it was a plane you could see lights blinking there was no blinking lights at all and no sound"],"City":"Loudon","Latitude":"35.734804","Object Flight Path":"Undisclosed","Log Number":"US-03192010-0021","Source":"MUFON","Case Number":"22390"}