{"divs":["Sighting DetailsAt 4pm on March 17th (St. Patrick's Day) driving south on Grand View Ave at the intersection of Venice Blvd 1 block north of Centinella I saw an object that looked to be hovering about 1-2000 feet over the LAX area of the city. It was rather large long and wide kind of like the side of a long and very thick blim (not exactly, it appeared dark metallic) I put it in the approximate area of hovering over LAX whic is obviously restricted air space. So no blimp would be in the space. Plus it hovered didn't move for at least 2 mins. Pulled over and watched it for about 2 minutes. Snapped a pic on my cell but can't really make it out on the pic. Quickly got back in the car and drove 3-4 blocks south to see if I get a closer look and when I parked, got out and looked in the area n the sky I saw it before (4-5 mins prior) it was gone. On the pic below I think it's the dot right over the top of the light post across the street. Anyone else see or report anything that day in that general vicinity?"],"Source":"MUFON","Object Flight Path":"Undisclosed","Case Number":"22394","files":["/var/www/straped/mufon/html2text/22394.html.txt","/var/www/straped/mufon/more/22394_submitter_file1__DSC00250.JPG","/var/www/straped/mufon/org/22394.html"],"Date of the Event":"03/17/2010 04:00 UTC","Region":"California","Log Number":"US-03202010-0002","Disposition":"IFO","Viewing Distance":"Unknown","Longitude":"-118.392396","Tags":"City","Country":"United States","trends":["There have been 9 other sightings in Culver City","There were no other sightings in Culver City on or around March 17th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=34.029212,+-118.392396(22394)&iwloc=A&hl=en\"> mufon case (22394) map </A>","Sighting Duration":"Undisclosed","Latitude":"34.029212","Object Features":"Undisclosed","Weather Factors":"None","Summary":"Something hovering over LAX","Object Shape":"Blimp, Disc","City":"Culver City","Date Submitted":"03/20/2010 02:00 UTC"}