{"Source":"MUFON","Object Shape":"Flash, Star-like","Region":"California","Case Number":"22396","Viewing Distance":"Unknown","divs":["Sighting DetailsI was outside having a cigarette while looking up at all the stars in the sky. Every once in awhile I see starlike objects in the sky moving around and will watch their flight paths to determine if it is satellite or something else. I have seen a few that fly straight and dim out in the distance and I have seen a few that have erratic movements. But what I saw tonight, I have no idea what it could of been. I was looking straight up in the sky and all of a sudden a there was a quick flash of light from nowhere. Almost like a camera flash taken from the sky. Then about a second later another flash just like the first happened about a foot away from the first from my perspective. These flashes were not near any stars and just came out of nowhere. I did not hear any sound or see any type of craft at all. This was very strange due to the fact that nothing was near these flashes. It almost made me feel like they were communicating to each other and I wished I had night vision goggles to see if something was there. I doubt it was seen by anyone else since it happened so quick, but it was strange. I have seen a few unexplained objects the last few years including an extremely close up sighting of a triangle UFO."],"Country":"United States","Summary":"Two different flashes in sky at close proximity to each other.","Log Number":"US-03202010-0004","Latitude":"37.805617","files":["/var/www/straped/mufon/html2text/22396.html.txt","/var/www/straped/mufon/org/22396.html"],"Tags":"City","Weather Factors":"None","Disposition":"IFO","Date of the Event":"03/19/2010 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.805617,+-121.211953(22396)&iwloc=A&hl=en\"> mufon case (22396) map </A>","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Longitude":"-121.211953","trends":["There have been 6 other sightings in Manteca","There were no other sightings in Manteca on or around March 19th 2010"],"Object Features":"Unknown","Date Submitted":"03/20/2010 05:09 UTC","City":"Manteca"}