{"files":["/var/www/straped/mufon/html2text/22392.html.txt","/var/www/straped/mufon/org/22392.html"],"Date Submitted":"03/19/2010 11:35 UTC","Weather Factors":"None","Sighting Duration":"Undisclosed","divs":["sighting detailswatching for satellites on back patio, seen a bright light coming from the n\\w to s\\e direction no sound from a motor or jet engine very smooth and on course direction, somewhat appearing to decend, suddenly levels off and starts a zig zaging course approximately six zig zags and now it's accending towards the n\\e but it should'nt be going out of sight because its well within our atmosphere but it does, what was a brite noticeable light is quickly getting smaller and disappears. and then the blue flash and it gone. it's intriguing nothing to be scare of, i've been watching this activity since the late sixties, and i know what everyone assumes. but i just write them off as narrowminded people who would never believe it anyway.i feel very blessed to have wittnessed so many sighting from maine to california. i don't know how to put sketches or audios on the computer i'm not that savvey.i never report my sighting to authorities simply because they're idiots and not worth my time, but mufon strikes me as being sincere."],"Log Number":"US-03192010-0023","Disposition":"Unknown","City":"Phoenix","Object Flight Path":"Straight-line path,Path with directional change,Other","Case Number":"22392","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Flash, Star-like","Date of the Event":"03/19/2010 07:58 UTC","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around March 19th 2010"],"Region":"Arizona","Object Features":"None, Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.451017,+-112.066557(22392)&iwloc=A&hl=en\"> mufon case (22392) map </A>","Summary":"Light coming from n/w no wing or tail lights smooth gliding zig zag disaapeared blue flash.","Latitude":"33.451017","Tags":"City","Longitude":"-112.066557"}