{"Region":"Arizona","Longitude":"-112.066637","divs":["Sighting DetailsI was driving back to Gilbert from the Superstition Springs Mall with my mom and my daughter at about 7:30 p.m. on Baseline Rd. We looked up and saw a string of evenly spaced lights that looked identical to what I had seen in news stories of the famous \"Phoenix lights\" sighting in 1997. There were three evenly spaced white lights in an arc relatively near the horizon that did not appear to move. There were other lights that extended the arc higher into the sky but they seemed to shift into a \"V\" or \"diamond\" shape. There were also other aircraft lights in the sky that were clearly planes or helicopters moving around, perhaps observing the phenomenon. I am not sure if the shifting \"V\" or \"diamond\" was part of the phenomena or was composed of aircraft observing the phenomena. We observed the lights for about 15 minutes as we drove east on Baseline before stopping at the Safeway on Higley and Baseline. The lights were still in the sky when we went into the store but were gone when we exited the store no more than 20 minutes later. The pattern of evenly spaced lights was remarkable enough for us to notice and comment. My ten year old daughter immediately connected the lights to the \"Phoenix lights\" sighting video she had seen on TV months earlier - the similarity was very strong. My mother did not know anything about the 1997 sighting but immediately recognized that it was unusual."],"Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22399.html.txt","/var/www/straped/mufon/org/22399.html"],"Country":"United States","City":"Phoenix","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around March 19th 2010"],"Latitude":"33.454697","Date of the Event":"03/19/2010 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.454697,+-112.066637(22399)&iwloc=A&hl=en\"> mufon case (22399) map </A>","Object Flight Path":"Stationary","Tags":"City","Weather Factors":"None","Date Submitted":"03/20/2010 11:57 UTC","Case Number":"22399","Disposition":"Unknown","Object Shape":"Other","Object Features":"Unknown","Log Number":"US-03202010-0007","Summary":"Arc of evenly spaced lights observed in night sky while driving east on baseline road from superstition springs to gilbert.","Viewing Distance":"Unknown"}