{"Object Shape":"Cylinder, Other, Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.724919,+-76.723134(22402)&iwloc=A&hl=en\"> mufon case (22402) map </A>","City":"Morehead City","Case Number":"22402","Weather Factors":"None","Log Number":"US-03202010-0010","files":["/var/www/straped/mufon/html2text/22402.html.txt","/var/www/straped/mufon/more/22402_submitter_file1__cylinder.jpg","/var/www/straped/mufon/org/22402.html"],"Region":"North Carolina","Tags":"City","Disposition":"IFO","Date Submitted":"03/20/2010 02:17 UTC","Summary":"Sky watching and saw objects that appeared to be aircraft but flying to slow","Source":"MUFON","Object Features":"Wings","Date of the Event":"03/19/2010 08:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"34.724919","Longitude":"-76.723134","trends":["There have been 3 other sightings in Morehead City","There was one other sighting in Morehead City on or around March 19th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Path then hovering","divs":["Sighting DetailsStarted to Sky watching about 8:15pm est . Saw alot of commercial traffic along with local aircraft. Saw 1st object that appeared as a aircraft about 8:25pm that changed it's lighting pattern while in flight and had no decernable noise moving south to north at a very slow rate. I grabbed one of my step son friends to come watch and he saw the object hovering and just blinking North from house and then dissappeared. Later we saw several other objects that had the exact same light pattern that fly over with no sound also. Flying very slow. We continued to watch the sky at appox. 9:30pm we saw an object that passed just west of the house moving south to north that looked like two small coffee cups stacked open end on each other. It seemed to be lite up by an external light and had one white blinking light on the upper portion. This visual was made by both of us through binoculars. It traveled at a very slow rate. We watched this for about 5min. Appox. 9:45 we saw an object that was traveling north to south change direction 180 degrees and go back. We watched as it disappeared beyond the houses. We returned to house to get warm for a bit, but when when return outside we never saw anything for the rest of the night."]}