{"Longitude":"-86.861194","trends":["There have been 2 other sightings in Brookston","There were no other sightings in Brookston on or around July 11th 1995"],"Tags":"City","Log Number":"US-03202010-0016","Weather Factors":"Unknown","Object Shape":"Triangle","Latitude":"40.603814","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","Region":"Indiana","Case Number":"22409","Date Submitted":"03/20/2010 11:15 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsLook, this is not very easy for me. I feel stupid even doing this, and I dont want phone calls or any other crap. I was about 17 years old(I am now 32) and I was with three friends outside of Brookston Indiana(town of 5000 people in white county) at my parents house. We were all drinking and smoking Marijuana, which is part of the reason I never reported this. I knew what people would say. Behind my parnets house, is a wide open field for about 200 yards before reaching the Town Baseball Park on the outskirts of Brookston. We were just bored kids, walking around and talking, drinking, and having a good time. At one point, two of my friends walked across Highway 18 to the Cemetary to get some fresh air. My other friend and I decided to watch the night sky while laying in the wide open field, enjoying our Buzz and relaxing. All of a sudded, I saw lights behind me(to the west) and at first i thought they were a plane of some kind, or a high flying jet, but i kept listening for engine noise that never came(it is VERY quiet at night outside my parents house.) The light intensity slowly got brighter, still no noise, when before we knew it, we were both looking at the front tip of the UFO DIRECTLY above us and floating slowly and silently towared the east. I was terrified. It was so huge and so quiet, it is like a totally contrasting situation to see something so big moving that doesnt make any noise at all. We lied there, both of us frozen with fear and unable to speak. Contrary to other sightings I have heard of and read about, the object did not up and zip away into the clouds or off of the horizon. It just continued on its course until it was completely out of sight. Never a noise, never a change in course, nothing. Just a giant, Black, silent triangle flying low and moving slowly over the landscape. I have never been so afraid of anything in my life. Ever. I have never seen anything like that since. I am a married man(10 years) I have two kids, a good job, and no history of mental illness, or medications. I havent done any drugs since I was 21 years old, and I would like to consider myself of above average intelligence. I cant bring this up to my family or other friends for fear of ridicule, but this really happend. I wish I could recollect some more details, but that was 15 years ago, and I was a pothead for years after that, so some of those memories are gone. But what I saw that night, is unforgettable, and the only conversation we had about the object was(paraphasing) \"Did you see that?\" \"Yes I did\" \"Oh my god, what the hell was that?\" \"I dont know\" We never said anything else about it. When something scares you that much, you dont need to talk about it, you dont need to discuss it, joke about it, tell tall tales about, you are just thankful to God that you saw it, and lived. Therefore you dont speak about such things because doing so could Bring back those Demons. I hope this Account in some way helps you guys piece together a flight pattern, or time table, or anything, but there you go. Rodney."],"Country":"United States","Summary":"Giant, Triangle shaped, Silent, Very slowly moving, very low flying, lights underneath.","map":"<A HREF = \"http://maps.google.com/maps?q=40.603814,+-86.861194(22409)&iwloc=A&hl=en\"> mufon case (22409) map </A>","Object Flight Path":"Undisclosed","City":"Brookston","Date of the Event":"07/11/1995 03:00 UTC","files":["/var/www/straped/mufon/html2text/22409.html.txt","/var/www/straped/mufon/org/22409.html"]}