{"Latitude":"45.037373","divs":["Sighting DetailsWe were at a farm in rurual Hudson Township north west of Gaylord by about 10 miles. We were specifically there to watch the sky because several neighbors has reported lights in the sky on the preceeding two nights. At around 8:38 pm we were parked on a high knoll on the farm behind the house. We were outside of te car watching the stars begin to appear and identifying constellations when a white orb passed overhead moving roughly the speed of an airplane. We all thought it was a satellite but it was very low to the ground - a real satellite past over 20 minutes later and we knew then that the light we'd seen was not a satellite. It was a clear night - no clouds - the light was large like landing gear on an airplane but it did not flash - it disappeared abruptly. Roughly two minutes later a bright orange light appeared about the treeline roughly 5-7 miles away. The lights were very large even for that distance. At first we thought it was a firework display but there was no bursting of light. This was followed by two bright orange lights and then finally three in a boomerang shape which appeared to turn away from us and go back below the treeline. The objects appeared to come from the ground up each time. Once it disappeared for the last time the area became busy with air traffic - three-four planes very high up in the air and at a considerable distance. There are several large private lakes in the area that are rumored to be very deep. Because the obects seemed to come up from the ground, we wondered about a USO instead of a true UFO though this was certainly airborne. We all agreed that we were not frightened but rather curious and we knew that it was no any sort of aircraft we had ever seen. The incident two days early was seen by one of the people in our party that night and he was certainly shaken up becuase he was in a cabin in the woods with no electricity when he was awakened at 6 am by a very bright light shining into the cabin's bedroom window. I will not report on this event since I was not privy to it but it was the event that caused us to go back out to the farm two nights later to watch for some sort of event - other people in the neighborhood witnessed the lights as well."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.037373,+-84.670472(22408)&iwloc=A&hl=en\"> mufon case (22408) map </A>","Log Number":"US-03202010-0015","Sighting Duration":"Undisclosed","Date Submitted":"03/20/2010 10:05 UTC","trends":["There have been 6 other sightings in Gaylord","There was one other sighting in Gaylord on or around March 17th 2010"],"Region":"Michigan","Case Number":"22408","Tags":"City","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/22408.html.txt","/var/www/straped/mufon/org/22408.html"],"Object Features":"Unknown","Disposition":"IFO","City":"Gaylord","Date of the Event":"03/17/2010 08:38 UTC","Weather Factors":"None","Longitude":"-84.670472","Viewing Distance":"Over One Mile","Summary":"orange lights above the treeline","Object Flight Path":"Other","Object Shape":"Boomerang, Sphere"}