{"divs":["Sighting DetailsAt 8:19 P.M. I was in the Yolo Fairgrounds at a local event. As I was sitting, watching the sky a white \"ball\" or \"sphere\" or \"orb\" of light caught my attention. When I first noticed the light it seemed to be moving in a downward direction, down toward the horizon line. After about a second it abruptly changed direction - which brought me to my feet. The downward angle would have been 120 to 140 degrees and the direction change would have been upward at 90 degrees. The light was brighter than any star I could compare it too and there were no flashing or other lights attached that I could see. The light traveled completely over my head to a nearly identical opposite position in the sky and vanished almost in an instant, I'd say it seemed to fade for 1 or 2 seconds. From inside the Fairgrounds I couldn't tell north, south, east, or west. I drew several others to pay attention to it, my brother, and his wife were the only two that I knew. All were in concurrence that if this were any typical aircraft the light would have somehow changed or dropped out of view as it passed over head. The light remained constant until it vanished; I marked the time at 8:21. There wasn't a lot of background noise, some idle chatter, but I heard no noise that I could relate to an aircraft."],"Disposition":"IFO","Country":"United States","Summary":"Ball of light travels across night sky, then vanishes","Longitude":"-121.772027","Case Number":"22418","Object Shape":"Sphere","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Path with directional change","Weather Factors":"None","Log Number":"US-03212010-0006","trends":["There have been 6 other sightings in Woodland","There were no other sightings in Woodland on or around March 20th 2010"],"Tags":"City","Date Submitted":"03/21/2010 03:18 UTC","City":"Woodland","Date of the Event":"03/20/2010 08:19 UTC","Sighting Duration":"00:03:30","files":["/var/www/straped/mufon/html2text/22418.html.txt","/var/www/straped/mufon/org/22418.html"],"Source":"MUFON","Latitude":"38.685346","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.685346,+-121.772027(22418)&iwloc=A&hl=en\"> mufon case (22418) map </A>"}