{"Country":"Italy","map":"<A HREF = \"http://maps.google.com/maps?q=41.89635,+12.500779(22425)&iwloc=A&hl=en\"> mufon case (22425) map </A>","Date of the Event":"03/20/2010 09:46 UTC","trends":["There have been 4 other sightings in Rome","There were no other sightings in Rome on or around March 20th 2010"],"files":["/var/www/straped/mufon/html2text/22425.html.txt","/var/www/straped/mufon/org/22425.html"],"Latitude":"41.89635","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Longitude":"12.500779","Viewing Distance":"Unknown","Date Submitted":"03/21/2010 04:07 UTC","Region":"Lazio","Log Number":"IT-03212010-0011","Object Features":"None","Case Number":"22425","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","divs":["sighting detailsi was on the cell phone and while conversating i was looked out of my bathroom's open window. (my window looks right over teatro marcello in the center of rome.) it was dark and slightly foggy. there are usually plenty of planes flying over the city so i did not give much importance to this sighting at first. suddenly i notice that the object is flying at an unusually low altitude and at very low speed coming in my direction from the left. it is a red\\orange light. bright but not blinding. the object flies horizontally at an average distance of 500 meters\\ 1 km away from me and at about 150 mt. altitude, roughly; again, very slowly and almost halts approximately infront of my window. i tell the person on the other end of the line that im seeing something very strange in the sky and i start becoming emotional about it. he tells me to hang up and to take pictures of it. so i hang up and run in my room to get my camera but as i get back to record i decide not to because the object was slowly leaving and it wouldn't have showed well so i decided i wanted to enjoy it with my own eyes. meanwhile i am screaming to my mother in the other room to come and see. doing so i grab a potent green laser pointer i own. i point at the object with it while it is fading away on the right but nothing happens apart from it turning on and off rapidly in sequence and slowly fading away. she saw the same object fading away. i felt a mix between fear and excitement that continued up until 3-4 hours later. i was in shock."],"Disposition":"Unresolved","Object Shape":"Circle","City":"Rome","Summary":"RED-ORANGE UFO FLYING OVER ROME AT LOW ALTITUDE AND LOW SPEED NO SOUND NO CONVENTIONAL RED AND GREEN LIGHTS PRESENT. UFO STOPPED AND SLOWLY LEFT"}