{"Date of the Event":"03/05/2010 10:30 UTC","Region":"New York","Log Number":"US-03212010-0014","Source":"MUFON","Case Number":"22428","map":"<A HREF = \"http://maps.google.com/maps?q=42.447691,+-76.492861(22428)&iwloc=A&hl=en\"> mufon case (22428) map </A>","Longitude":"-76.492861","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Ithaca","There were no other sightings in Ithaca on or around March 5th 2010"],"Sighting Duration":"Undisclosed","Latitude":"42.447691","Weather Factors":"None","Object Features":"Unknown","divs":["sighting details10:30 pm -- my husband was flying into ithaca airport and noticed what he thought of as a bright planet off to the southwest. particularly bright and had colors changing. 11:15 - 11:45 pm -- at home (in ithaca) i (independently) noticed the same bright object out my window to the southwest, low on the horizon. i would have just thought it to be a bright planet, but for the fact that it's light was such that it changed colors -- going from typical \"star-like\" colors to blue and green, maybe red (hard to recall). kind of a pulsating quality to the light. and the colors were not vibrant but you could make out the change in color. the colors never lasted too long before changing to another color. it was moving with the \"speed\" typical of a celestial object -- i took note of it as it was \"setting\" over a neighbor's roof. i got online to see if there were any celestial objects i should be looking for in the night sky. frankly, i would just chock it off to strange atmospheric conditions. however, with the cleveland\\euclid ufo sighting about the same time, i thought i'd let you folks know about this as well. a friend also saw this same object a few nights later (monday or tuesday), however, his time is not as pinned down (9-10pm maybe) as mine and according to him, the direction was more westerly."],"City":"Ithaca","Disposition":"IFO","Date Submitted":"03/21/2010 07:07 UTC","files":["/var/www/straped/mufon/html2text/22428.html.txt","/var/www/straped/mufon/org/22428.html"],"Tags":"City","Object Shape":"Star-like","Object Flight Path":"Stationary","Country":"United States","Summary":"Bright object in SW sky"}