{"Region":"Minnesota","Object Features":"Unknown","Date Submitted":"03/21/2010 04:19 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.006077,+-93.156611(22426)&iwloc=A&hl=en\"> mufon case (22426) map </A>","Weather Factors":"None","trends":["There have been 2 other sightings in Roseville","There were no other sightings in Roseville on or around March 21st 2010","This sighting has never been favorited.",""],"Longitude":"-93.156611","Object Flight Path":"Straight-line path","Latitude":"45.006077","Viewing Distance":"Over One Mile","Case Number":"22426","Source":"MUFON","Sighting Duration":"00:01:30","files":["/var/www/straped/mufon/html2text/22426.html.txt","/var/www/straped/mufon/more/22426_submitter_file1__ufo2010.2.jpg","/var/www/straped/mufon/more/22426_submitter_file2__ufo2010.jpg","/var/www/straped/mufon/org/22426.html"],"Object Shape":"Bullet, Missile, Cigar","Summary":"White cigar shaped UFO, silent moving from NW to SE","divs":["sighting detailsmy girlfriend and i stopped at the byerleys grocery store in roseville, mn approx 2pm sunday march 21st 2010. got out of the car to go in and i happened to look north as i exited the car. i noticed an object, which i first thought was any common plane, and then immediately noticed that it looked strange. there were no apparent wings and certainly no tail. if i had to guess the approximate length i would say 50 - 75 ft. it appeared to be not much higher than 2000-3000 ft in the air moving from the nw to the se and maybe 1-1\\2 miles away and absolutely silent. i pointed and asked my girlfriend to look and she saw the same thing. we both remarked at the relatively slow speed at which it was moving and the absence of wings, a tail or markings or sound. i noticed a couple of other people staring at it too. we followed it for maybe a minute and a half and it eventually faded from sight to our s.e. i did take a couple pictures with my phone camera, but unfortunately they don't show much more than a small white object that's not very clear. i've lived in mpls for twenty years and have seen countless numbers of aircraft, blimps, etc but have never seen anything like it. what made it so unusual was the lack of any sound and it was definitely not any sort of aircraft i've ever seen."],"Disposition":"IFO","Log Number":"US-03212010-0012","Date of the Event":"03/21/2010 12:00 UTC","Tags":"City","Country":"United States","City":"Roseville"}