{"Latitude":"41.207782","Tags":"City","Object Shape":"Disc, Star-like","Country":"United States","divs":["Sighting DetailsI TOOK MY DOG OUT IN THE BACK YARD TO GO TO THE BATHROOM AND NOTICE A VERY BRIGHT STAR AND AS I WAS LOOKING AT IT I SAW IT DOUBLE IN SIZE. AGAIN AND AGAIN AND AGAIN UNTIL IT WAS RIGHT UP ON EARTH ! I GAZE AT THE STARS ALL THE TIME AND WOULD SAY THIS THING WAS AT LEAST 2 OR 4 HUNDRED THOUSAND MILES FROM EARTH AND WAS CLOSE TO HALF THE SIZE OF OUR MOON!IT SAT THERE FOR ABOUT 20 SECONDS THEN ZOOMED AWAY SO FAST THAT IT LOOK LIKE A ROCK SIPPING ACROS A POND AND IT SKIPED ABOUT 16 TO 18 TIMES BEFORE IT WAS GONE OUT IN SPACE ! IT WAS SO BRIGHT THAT FOR TWO DAYS EVRY TIME I CLOSED MY EYES I COULD STILL SEE IT AS IF IT WAS STILL THERE. THE SHIP WAS DISC LIKE IN SHAPE BUT HAD VERY BRIGHT PURPLE LINES ON TOP THAT CROSS THE SHIP FROM TOP TO BOTTOM AND THIS MIGHT SOUND WEIRD BUT THE PURPLE WAS BRITER THEN THE WHITE PART OF THE SHIP!i can say that i know with out a blink of an eye that we are not alone.i'am sending this to you two years later in case some one came to you with the same claime but no way to prove it.so if there description matches mine then you know they are not bsing you.and ido not want to be on tv. i dont care if people beleive it or not . i know for my self ."],"Case Number":"22435","Summary":"LOOK LIKE A STAR FAR AWAY THEN ABOUT EVERY 3 SECONDS IT GOT BIGER AND BIGER UNTIL IT WAS RIGHT THERE CLOSE TOO EARTH !","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.207782,+-77.191265(22435)&iwloc=A&hl=en\"> mufon case (22435) map </A>","Object Flight Path":"Undisclosed","Date Submitted":"03/22/2010 03:34 UTC","trends":[],"City":"Undisclosed","Object Features":"Undisclosed","Disposition":"Unknown","Source":"MUFON","Date of the Event":"01/18/2008 01:20 UTC","Sighting Duration":"Undisclosed","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/22435.html.txt","/var/www/straped/mufon/org/22435.html"],"Weather Factors":"Unknown","Longitude":"-77.191265","Log Number":"US-03222010-0004"}