{"Latitude":"45.529402","Date Submitted":"03/22/2010 12:11 UTC","Object Flight Path":"Straight-line path","Case Number":"22432","Region":"Oregon","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/22432.html.txt","/var/www/straped/mufon/org/22432.html"],"Log Number":"US-03222010-0001","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around March 19th 2010"],"Object Features":"Unknown","Object Shape":"Triangle","Date of the Event":"03/19/2010 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Longitude":"-122.672407","Tags":"City","Weather Factors":"Unknown","Summary":"Low-flying UFO Siting in West Linn, Oregon","City":"Portland","map":"<A HREF = \"http://maps.google.com/maps?q=45.529402,+-122.672407(22432)&iwloc=A&hl=en\"> mufon case (22432) map </A>","divs":["Sighting DetailsOn March 19th, 2010, I walked outside my condo in West Linn, Oregon to walk the dog at around 8:00 p.m. It was completely dark except for the stars and the crescent moon - there were no clouds in the sky. Instantly I heard dogs barking and howling in the Northwest direction of the neighborhood, but my dog remained silent (he's not a me-too barker). Right away I looked up in the sky as I always do when I go outside, and to my left I saw a low-flying vehicle that was coming from the Southeast direction and heading Northwest. I estimate it being between 50 to 75 yards up in the sky. It was close enough that I saw the bottom of the metal triangular shaped vehicle. I was thinking it would hit some trees or crash because it was so low, but apparently it didn't. I could see the bottom of this jet-sized vehicle, but it was triangle shaped and didn't look like a plane or jet. It was at least 75 feet long. After wards, when I stretched my arm out where I saw the vehicle before, it was the size of my hand (woman's hand). There were bright orange lights on the bottom. I watched it zoom by at about 100 miles an hour - it looked like a fast moving car speed. I could only watch the vehicle between the trees, probably for about 5 seconds max. My dog and I ran to see if we could see anything on the other side of the trees but it was nowhere in sight. The dogs kept barking when the vehicle passed over in their direction. It was so silent, my dog didn't even look up. Sideline, when I told my husband how low this UFO was flying, he didn't think it was possible without hitting the trees. So my first report said 100 yards up. But as I was driving on the freeway the following day I noticed all the tallest street lights that are always next to certain areas of the freeway - the ones that have three lights on them. There are also shorter lights but I'm talking about the tallest ones. The tallest lights were how low the craft was flying. When I checked out the path in the daylight, there was plenty of room for it to fly that low without hitting any trees. I don't know how anybody else did not see this strange siting, but nobody else was in site. I'm tempted to go door-to-door and ask other neighbors if they saw anything. Right away I called the local TV Channels. The only one that had a live person to talk to said, \"that's kind of funny that you'd report that today because it's the Spring Equinox and you could have seen a reflection from the Northern Lights. This was no reflection but rather a solid, industrial strength vehicle. I sent this information to the local Oregon Mutual UFO Network. Tom Bowden responded right away and will send a local rep to interview me. However, he thought I should also send this information your way. Please give me a call or email me if you have any other questions. There were no pictures. Even if I had a camera it all happened so fast I wouldn't have been able to take the picture in time. I guess I wasn't expecting such a surprise. Thanks for your help and please keep my name, phone and email address anonymous."],"Country":"United States","Source":"MUFON"}