{"Date of the Event":"03/21/2010 08:40 UTC","Country":"United States","Longitude":"-84.379282","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around March 21st 2010"],"files":["/var/www/straped/mufon/html2text/22430.html.txt","/var/www/straped/mufon/org/22430.html"],"Region":"Georgia","Log Number":"US-03212010-0016","map":"<A HREF = \"http://maps.google.com/maps?q=33.756665,+-84.379282(22430)&iwloc=A&hl=en\"> mufon case (22430) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Diamond, Star-like","Viewing Distance":"Unknown","Object Features":"Appendage(s)","divs":["Sighting DetailsMy neighbor and I were going to meet outside to look at the stars with our telescopes. As I stepped outside, my neighbor told me to look up. He mentioned that maybe there was a satellite flying over head. Immediately, I realized this object was way too low to be a satellite. What I saw was flying from the north-northwest towards the south-southeast. Its entire body was made of a white light and had a diamond-like shape. To the left, right, up, and down were 4 very bright green \"spikes\" or \"protrusions\". The white and green lights were unmistakable. In addition, there was NO SOUND at all. We compared later airplanes flying by and their sounds to the fact that this object had no sound at all. I did look at it through binoculars but by them time my wife brought them to me, it was a little late and then I wasn't able to get a good, tight look at it. As an amateur astronomer, I have seen many odd objects in the night sky. Not only that but since we live close to an air force base and the ATL airport, there is always a lot of air traffic in my area. However, this particular one was nothing like I've ever seen. At the moment there were no other aircraft to our knowledge. The only thing about this craft that was \"normal\" was the fact that it moved in a straight line at a regular pace. Normally, I would not have bothered reporting this but after my neighbor and I spoke about it, I feel confident this craft was not anything we consider \"normal\"."],"Date Submitted":"03/21/2010 10:55 UTC","Sighting Duration":"Undisclosed","Case Number":"22430","Latitude":"33.756665","Summary":"Diamond-shaped white light body craft with bright green spikes","Weather Factors":"Unknown","City":"Atlanta","Disposition":"Unknown","Source":"MUFON"}