{"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Fireball, Square, Rectagular","Longitude":"-114.9197","Region":"Nevada","Date Submitted":"03/21/2010 11:49 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/22431.html.txt","/var/www/straped/mufon/org/22431.html"],"Object Features":"Other","Disposition":"IFO","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.465268,+-114.9197(22431)&iwloc=A&hl=en\"> mufon case (22431) map </A>","Latitude":"35.465268","Summary":"A fireball appeared far away in the sky, speeding towards me as I drove south. Fire -rectangular shape twice the width & length of a box car, but not as tall. 100 feet from hitting me head on, it rose up slightly just clearing my vehicle & cont'd north.","Source":"MUFON","Case Number":"22431","trends":["There has been one other sighting in Searchlight","There were no other sightings in Searchlight on or around March 26th 1995"],"City":"Searchlight","Date of the Event":"03/26/1995 03:30 UTC","divs":["Sighting DetailsOn March 26, 1995, I left Las Vegas about 2:30 am and traveled in my pick-up driving south on Highway #95. I was driving a little Nissan pick-up. My shift ended at 2:00 am at a casino that morning in Las Vegas, and I was eagerly going to drive to Laughlin, Nevada to see the love of my life. He was the graveyard floor person for the Ramada Express. I was driving south on #95 and was fast approaching Searchlight and Cal-Nev-Ari. I was not yet to the junction in the road where you need to make a decision - you can either keep going straight on #95 on the way to Needles, California, or you can turn left on the way to Laughlin, Nevada. This is the honest to God truth, and I have never forgotten the moment. The moment I arrived in Laughlin, I wrote about this in my journal (which I always kept with me). It was absolutely pitch dark. A two-lane highway, one lane going south (the one I was on) and one lane going north. It was such a beautiful clear night that you could see all the stars. When I first noticed it, I saw it high in the dark sky right in the middle of all the stars. I thought, \"My God! What is that?\" I couldn't take my eyes off of it, and I could see it was coming closer and closer towards me in a northerly direction, straight out of the stars getting lower and lower towards the highway. I was now seeing the real shape of it, and still it was just all flames. It was rectangular - all fire - about twice as wide as a box car, twice as long, but not as high. It was coming so fast towards me, steady as it went. I remember those few seconds as it got closer and closer thinking, \"So this is it? This is how I'm going to die?\" It was as if it was going to hit me head on. It was almost level with my truck on the road. It seemed like it got to only a few feet from hitting me head on, and then it suddenly dipped upwards with just enough space to clear my truck and it just kept on going, never once coming into contact with me. I was so amazed - like in two seconds, it scooted upwards and went right over the top of my truck, just clearing it, and it kept on going north as I was headed south. I was like in a state of shock. The only thing I could think of was that something was \"checking me out.\" It was like when teenagers are zooming around showing off in their speeding cars and they zoom up to you and check you and your car out, and then they zoom off. Once it went above and over me, I was so afraid I shook. I never looked back - I was just glad it didn't destroy me. I couldn't believe what just happened, but it was true. It actually happened. I just kept driving, and driving, all the time praying that it would leave me alone, whatever it was. I was the only vehicle on the road coming or going. It was shortly after that, that I came to the junction where I turned left and headed towards Laughlin, Nevada. Just 2 weeks ago, I found that journal that was in storage. I was so very happy to find it and search for the exact morning that it happened. I have wanted to report this since that day of March 26, 1995, and now I have done so."],"Log Number":"US-03212010-0017","Object Flight Path":"Path with directional change","Country":"United States"}