{"files":["/var/www/straped/mufon/html2text/22438.html.txt","/var/www/straped/mufon/more/22438_submitter_file1__Jaysranch.jpg","/var/www/straped/mufon/more/22438_submitter_file2__JayOmahaWorldHeraldSept1974.jpg","/var/www/straped/mufon/more/22438_submitter_file3__Jaydrawing.jpg","/var/www/straped/mufon/org/22438.html"],"Latitude":"41.001665","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-96.242611","Weather Factors":"None","Summary":"Woke up between 12 and 2 AM. Loud roar, colored lights coming down outside. Thought to go and look and it shot back up.","Tags":"City","Viewing Distance":"21-100 Feet","City":"South Bend","trends":["There have been 2 other sightings in South Bend","There were 2 other sightings in South Bend on or around September 5th 1974","This sighting has never been favorited.",""],"Date Submitted":"03/22/2010 10:13 UTC","Case Number":"22438","Log Number":"US-03222010-0007","divs":["sighting details[cms\\tg\\pid] report #2. i didn't know i couldn't go back into the report and add details. report filed by [cms\\tg\\pid] field investigator mufon iowa. mufon questionnaire filled out 4\\1\\1989 and signed by [cms\\tg\\pid] the article in the omaha world herald says the other sightings were made after 2:30 am. the area of the sighting has hills and powerlines. there is a cliff to the dump ne of the trailer and \"j\" said the horses didn't go off. \"j\" said the sound was like a turbine (electromagnetic generator), anti magnetic, generating a field against the earth. he said he read in the papers the next day (omaha world herald?) there were other sightings, police involved. the ashland gazzette comes out twice a week. after he was on the road he read the paper 10-12 days later. his memory about the actual event is unclear. another version: got up, moving around in the house while going on. don't remember what happened. was going to look and that's all i remember. at first, went back to sleep. later, blacked out, don't remember. (ashland, nebraska schirmer hwy 6) heard about shirmer, no details. \"j\" has never read a ufo book. i have talked to \"j\" about ufo's and some about abductions. hypnosis? \"yes. i'll try it. you may get a real weird story out of me. i knew it was there. i knew it was there\". \"j\" is religious and believes god could have made more creatures. never believed before. \"something's going on. we're too primitive\". \"j\" said police chief dimmit saw ufo's and it was in the paper. he was kidded by people. in an interview 8\\10\\2009 \"j\" again described his sighting. this time he saw the object. (memory fill-in?, recovered memory?) loud whine like a jet engine. round-big. 130' across arena so object barely fit. 4 legs, 2 wheels on ends (dual round things). dust was blown away in the arena, bare spot. cop everyone made fun of, he saw one same night. lights? thinking-no lights on it. skin of object lit up. light blue\\grey. whole object bright. bedroom noise. lights woke me up. looked out the window at it in the arena-went back to sleep. thought he was dreaming. my dreams are crazy-this was real. drawing \"j\" made of object is in attachments. another sighting: 3\\2\\1990 6:45 pm. \"j\" and his wife were at their daughter's house. looked like 5 dimes shiny, turned on edge. evenly spaced. \"weird\". 2 jet trails through them."],"Object Features":"Appendage(s)","Object Flight Path":"Other","Object Shape":"Disc, Unknown","Date of the Event":"09/05/1974 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.001665,+-96.242611(22438)&iwloc=A&hl=en\"> mufon case (22438) map </A>","Source":"MUFON","Region":"Nebraska","Disposition":"Unknown"}