{"Case Number":"22434","Viewing Distance":"Over One Mile","Date Submitted":"03/22/2010 01:08 UTC","Longitude":"-80.14799","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Object Shape":"Flash, Sphere","Object Flight Path":"Path with directional change","Latitude":"26.016811","Weather Factors":"Windy","Date of the Event":"03/20/2010 11:52 UTC","files":["/var/www/straped/mufon/html2text/22434.html.txt","/var/www/straped/mufon/org/22434.html"],"Summary":"10 - 12 red sphere objects were moving northwest through cities Hollywood and Pembroke Pines","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.016811,+-80.14799(22434)&iwloc=A&hl=en\"> mufon case (22434) map </A>","trends":["There have been 18 other sightings in Hollywood","There were no other sightings in Hollywood on or around March 20th 2010"],"Disposition":"Unknown","Region":"Florida","Source":"MUFON","City":"Hollywood","Log Number":"US-03222010-0003","divs":["Sighting DetailsAround 11:48 to 11:57 p.m. Eastern Time I witnessed 10 - 12 red sphere like objects moving in an irregular line formulation. I was ready to close up my store when my brother called telling me excitedly that there were a group of bright objects within the sky. I went out to look at the scene and there were these objects, moving northwest from my initial point. My two fellow employees came out to see the objects, as did the last three customers we were helping. On Taft St. nearby drivers stopped and got out of their cars to look at the objects. These objects were red with yellow on the bottom, at times blinking. There were no sounds being omitted from them, unlike when a jet airliner passes overhead at 10, 000 ft. My brother explained to me that he first saw the objects moving in a single file line, then breaking apart still being somewhat behind one another. Upon seeing the objects I began to run across the plaza parking lot, keeping my phone on so that I could get my brother's view from where he was. By the the time I had crossed the end of the lot the last two objects began crisscrossing one another, never hitting one other. Finally the very last one appeared to elevate into the atmosphere, becoming dimmer as it reached higher elevations. My coworker believed it was a meteor shower penetrating into the Earth's atmosphere; however, these objects were moving below low level clouds the entire time I was out there. When I got home I immediately called the local police dept. of Pembroke Pines and Hollywood to see whether anyone had already reported the sightings, which no one did. My brother saw the same with the remaining items, saying that they all had ascended into the atmosphere. For me this was the most amazing sight I've ever seen, for I've been interested in this subject since my years in middle school. If anyone else saw the same thing please let me know, for I would like to get another individual's perspective."]}