{"map":"<A HREF = \"http://maps.google.com/maps?q=34.206505,+-119.170162(22436)&iwloc=A&hl=en\"> mufon case (22436) map </A>","Case Number":"22436","Log Number":"US-03222010-0005","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Date of the Event":"03/20/2010 08:15 UTC","Object Features":"None","Source":"MUFON","City":"Oxnard","Latitude":"34.206505","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/22436.html.txt","/var/www/straped/mufon/org/22436.html"],"Longitude":"-119.170162","divs":["Sighting DetailsTime: 20:15 Date: 03-20-2010 Location: Lemonwood neighborhood Oxnard, California Weather conditions: Clear Me, my wife and a friend were out sitting, waiting for the ISS to pass (N to ESE) approx. and looking North near the horizon for it. Just prior to the ISS we saw a bright white meteor going from the East towards approx NNE at approx 40 degrees off the horizon. How long? (two feet @ arms length) for 2 seconds or so. (It was BRIGHT) I'm SURE we were not the only ones to have seen this or the coming phenomenon. If they did kept looking they saw it also. After the meteor burned up there was a faint glowing object in that immediate area, possibly \"flat, round or both\" (couldn't tell even with binoculars) I could NOT focus on it. It blocked out stars as it passed! Got within a few degrees of Mars. It was big and NOT an airplane. So close we would have heard it had it been a plane. We observed this object moving to the East (in the direction the meteor had came from) Then it changed directions abruptly 5 or 6 times over five minutes or so, going back and forth, up and down until we lost it. Actually \"ZIG ZAGGING\". Not moving any faster than the ISS seems to move (for reference), It's just that it did these abrupt turns with NO noise, NO lights (or running lights) Just this very faint glow. If you were to look up at any time of any night this would not catch your attention. We were looking for the ISS then got the meteor vista, then the UFO.? I cant seem to find anyone who saw it also. I am freaked out a bit and this is NOT my first sighting. Not a UFO buff but I love the heavens."],"Country":"United States","Disposition":"Unknown","Object Shape":"Circle, Disc, Sphere","Weather Factors":"Unknown","Date Submitted":"03/22/2010 04:09 UTC","Summary":"Meteor / UFO","Tags":"City","Region":"California","trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around March 20th 2010"]}