{"Country":"Canada","Date of the Event":"03/16/2010 11:55 UTC","Object Features":"None","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/22440.html.txt","/var/www/straped/mufon/org/22440.html"],"Case Number":"22440","Latitude":"50.5","divs":["Sighting DetailsI was taking my wife to work. She worked the 12-8 shift. Therefore I know the exact time within one minute. As I dropped my wife off at her work I continued on past her building to turn around. Just as I started to go up a small hill to make the turn, I was driving a four wheeled ATV, I saw directly in front and above me, where there had been complete darkness, lights appearered. These lights were in a circular pattern and I could see individual lights, I cannot say for sure how many there were because they immediately began to spin and became one big light. The object then began to move very rapidly away from me going almost due west. In so doing it left a trail of light similar to a shooting star. That was my first impression a shooting star. But there is no way a shooting star could appear out of nowhere and be at that low altitude. I cannot say for sure the exact altitude but it appeared to be only at the most two hundred feet above me. The clarity of the lights when they appeared and the width of the trail it left could only mean that it was very low. All I saw were the lights I was unable to see anything else or even a shadow of a shape. It happeded so fast and I was unable to believe what I was seeing. It was a dark night with a little cloud but very clear. I was uanble to sleep until after 2am. All I could think about was what I had seen. I kept seeing these lights appear and start spinning and then fly off at such a fast speed that it looked like a comet. It was very unbelievable but something that I will never forget. I hope that someone else may have seen something similar around this time. I would love to know that I was not the only one seeing this object. I would also love to have been able to get a picture of it."],"Region":"Quebec","Longitude":"-59.483333","Object Shape":"Circle, Unknown","Object Flight Path":"Hovering then path","Source":"MUFON","City":"Harrington Harbour","Disposition":"Unresolved","Log Number":"CA-03222010-0009","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Date Submitted":"03/22/2010 11:38 UTC","Summary":"Lights appeared directly in front of me and sped off.","trends":["There have been no other sightings in Harrington Harbour","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=50.5,+-59.483333(22440)&iwloc=A&hl=en\"> mufon case (22440) map </A>"}