{"Date of the Event":"03/17/2010 09:00 UTC","Latitude":"43.009292","Disposition":"Unknown","Log Number":"US-03222010-0012","map":"<A HREF = \"http://maps.google.com/maps?q=43.009292,+-83.614462(22444)&iwloc=A&hl=en\"> mufon case (22444) map </A>","Region":"Michigan","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Burton","There were no other sightings in Burton on or around March 17th 2010"],"Date Submitted":"03/22/2010 05:50 UTC","Viewing Distance":"Unknown","Longitude":"-83.614462","Case Number":"22444","Country":"United States","Object Shape":"Triangle","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/22444.html.txt","/var/www/straped/mufon/org/22444.html"],"Summary":"Very large, grey triangle shaped object floating in the sky above us with no sound and no lights.","divs":["Sighting DetailsWe were watching for the satelite and it was a bright clear night full of stars. First craft appeared and floated towards bishop airport. Second craft did the same. We contacted bishop airport about this incident and given a number to call in detroit. They were not interested about this and blew my mother off. After this, the next day our phone went dead. We have Comcast cable with Interent,phone and cable T.V. We have had the same setup for around 4 years never with any issues. Only our phone went dead. The cable man said it had something to do with the splitters but as I am very handy with computers and IT things related, I had checked these myself and there were no issues that I could see. I just recently found this website and figured you guys would be interested in it. My mother and her Boyfriend are the ones who witnessed this and she would be more then happy to explain it to someone who will actually listen and take her seriously. If anybody else in Michigan witnessed this It would be great to hear from you also and compare notes. However, my mother and her boyfriend did not have the video camera out. Thank your for reading and good luck with everything you are doing. Hopefully it won't take to long for the government to tell us the truth about this instead of covering up every bit of evidence. Thanks again. Sincerely, Jordan"],"Tags":"City","Source":"MUFON","City":"Burton","Sighting Duration":"00:10:00","Object Flight Path":"Undisclosed"}