{"Tags":"City","Longitude":"-157.849023","City":"Honolulu","Weather Factors":"Windy","Sighting Duration":"Undisclosed","Summary":"Cylinder flying west to east a half-mile out from the beach.","trends":["There have been 17 other sightings in Honolulu","There were no other sightings in Honolulu on or around March 14th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=21.313144,+-157.849023(22447)&iwloc=A&hl=en\"> mufon case (22447) map </A>","Case Number":"22447","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Log Number":"US-03222010-0015","Object Shape":"Cylinder","Latitude":"21.313144","Source":"MUFON","Date of the Event":"03/14/2010 03:00 UTC","files":["/var/www/straped/mufon/html2text/22447.html.txt","/var/www/straped/mufon/org/22447.html"],"Date Submitted":"03/22/2010 07:49 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"Hawaii","Object Features":"Undisclosed","Country":"United States","Disposition":"Unknown","divs":["Sighting Details Weekend before last, I was standing on Waikiki beach looking South, toward the ocean and a moving object in the sky caught my attention. It was up about 2000-3000 ft and looked like a white hotwater heater, laying on its side, moving sideways. The small end was facing the beach. It moved from West to East, like a floating balloon; but, as I watched, it never bobbed or tumbled; it stayed level on its side. It stopped South of Diamond head crater and that's when I confirmed the gusty winds were blowing from the North-NorthEast by the blowing palm trees. After a minute or so the object moved Northward, a 90 degree change in direction, against the wind, toward the crater, without turning. Then I knew for sure it wasn't a floating baloon!! It had changed direction of flight 90 degrees and was moving on its long axis as it headed North. When it got even with the crater, perhaps it was East of the crater, it stopped again.....holding against a strong, gusty, March wind. In about a minute it moved along its wide axis, again another 90 degree direction change, but, it did not turn or bank. It continued at a 90 degree direction of flight, due East. After 2-3 minutes, my vision was blocked by the crater rim and I lost sight. All changes in direction were 90 degrees!! No wings or tail!! The white was brighter than the high clouds. It was about 3PM and the sun was arching high Westerly and was not in the field of view for most of the time I viewed the object. It was easier to see, as it moved Eastward out of the sun's glare."]}