{"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.065921,+-70.174132(22442)&iwloc=A&hl=en\"> mufon case (22442) map </A>","Object Shape":"Other","trends":["There have been 3 other sightings in Provincetown","There were no other sightings in Provincetown on or around March 19th 2010"],"Disposition":"IFO","Log Number":"US-03222010-0010","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"22442","City":"Provincetown","Longitude":"-70.174132","Date of the Event":"03/19/2010 07:30 UTC","files":["/var/www/straped/mufon/html2text/22442.html.txt","/var/www/straped/mufon/org/22442.html"],"Tags":"City","Weather Factors":"Unknown","Region":"Massachusetts","Summary":"Bright, silent and low flying light seen over Provincetown","Country":"United States","Latitude":"42.065921","divs":["sighting detailstwo of us were driving rte 6a in truro, ma heading towards provincetown sometime after sunset to our left (west) - it was approx. 7:20pm. it was a nearly cloudless evening, with a thin moon and a few stars starting to become visible. it was unusually mild for this time of year. as we looked north\\northwest toward provincetown we could see a very bright light, larger than a star, over the bay which looked stationary. as we watched the seemingly low and bright light flicker slightly, a small wispy cloud out was drawing near to it and we thought we could now determine how high up it really was. the light was not obscured by the cloud and was in fact in front of it eliminating the star theory we were debating. once getting into provincetown proper and waiting at a light at conwell st.\\ rte 6a, we could see that it was now moving slowly and heading towards us from near the airport. thinking it was a low plane or helicopter we parked our car in our driveway about a minute later and jumped out to watch it. the light passed directly over us. it was solid, not blinking, and large compared to lights seen on high altitude international and military flights in the distance and completely silent. it \"drifted\" overhead and had no faa lights. at this point it was very dark out with no residual light from the sunset. as the light went in a southernly direction back over the bay it began to dim, leaving a sort of yellow glow to it like a street light and then shut off abruptly. we didn't see it thereafter. strangely, inside our house ten minutes later the little speakers for ipods snapped on mysteriously as we were sitting down. the unit has a little lcd screen that suddenly lit up. it's never done that and we found that odd and somewhat fitting to the situation. i called the police and the airport two days later since nothing seemed to match what we saw. nothing odd reported. i did take a picture on my iphone and it caught the light but not much detail. can send if interested."],"Date Submitted":"03/22/2010 04:08 UTC","Object Flight Path":"Hovering then path,Straight-line path"}