{"Object Shape":"Teardrop, Triangle","Date Submitted":"03/22/2010 05:56 UTC","Longitude":"-76.611189","files":["/var/www/straped/mufon/html2text/22445.html.txt","/var/www/straped/mufon/org/22445.html"],"Weather Factors":"None","Viewing Distance":"Unknown","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.300335,+-76.611189(22445)&iwloc=A&hl=en\"> mufon case (22445) map </A>","divs":["Sighting DetailsOn march 20th 2010 at about 9-930pm i was in my backyard setting up my telescope and i was outside about 15-20 minutes when i took my binoculars and was looking at mars which was pretty much strait up in the sky when right in my view i saw 5 triangle shaped objects go right past my view going east to west. So i turned around and looked up and they were moving fast,and were out of my view in about 8 to 10 seconds. they made no noise at all and no they were not birds. They almost blended in with the sky if they didnt go right through my view i would have never even noticed. They looked silverish black and didnt have any lights on them. they were in a tight v formation like a sqaud of fighter jets, Its hard to tel there size or how high up they were but they were definently structured craft. This was in northeast baltimore city right off of the 5900 block of bel air road. I saw a ufo about 8 years ago at loch raven resivior but i could have been mistaken, But this time there was absolutley no dout as to what i saw, it creeped me out but i was also amazed at the same time. Did anybody else see these things?? ive looked around online and havent found anything yet. Im hoping at least somone else saw what i did? I know i will never forget it.."],"Latitude":"39.300335","trends":["There have been 65 other sightings in Baltimore","There was one other sighting in Baltimore on or around March 20th 2010"],"Log Number":"US-03222010-0013","Country":"United States","Object Flight Path":"Straight-line path","Region":"Maryland","Summary":"5 triangle shaped craft in a tight v formation.","Sighting Duration":"00:01:00","Object Features":"Other","Tags":"City","City":"Baltimore","Date of the Event":"03/20/2010 09:30 UTC","Case Number":"22445","Source":"MUFON"}