{"Log Number":"US-03232010-0006","Case Number":"22457","trends":["There have been 6 other sightings in Fall River","There were no other sightings in Fall River on or around February 20th 2010","This sighting has never been favorited.",""],"Country":"United States","Region":"Massachusetts","Sighting Duration":"00:05:00","Date of the Event":"02/20/2010 09:39 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/22457.html.txt","/var/www/straped/mufon/more/22457_submitter_file1__2-20-10127.jpg","/var/www/straped/mufon/more/22457_submitter_file2__2-20-10127fullsizedetail.JPG","/var/www/straped/mufon/org/22457.html"],"Disposition":"IFO","Summary":"Shot photo of UFO in distance while taking photos of Coast Guard helicopter.","Date Submitted":"03/23/2010 01:04 UTC","Latitude":"41.705481","divs":["Sighting DetailsOn February 20, 2010, at 9:39 AM, my toddler son and I were walking on the boardwalk at Fall River Heritage State Park, Fall River MA. We saw a US Coast Guard helicopter fly directly overhead very low to the ground along the edge of the Taunton River, heading north. Because my son loves helicopters, I took my digital camera out and started photographing it. As I was shooting photos, the helicopter turned west and accelerated quickly across the river toward Somerset, MA. I saw an object in the distance, moving at a steady speed in a northbound direction. One of my photos captured this object. At first, although I did notice it, I didn't pay it much attention, assuming it might be a plane departing TF Green Airport in Providence RI. The object continued to fly in a northerly direction until it was out of sight past the treeline along the river. However, when I uploaded the photos to my computer, I looked at the one of this object and noticed that it doesn't appear to have wings or a tail section. I showed my wife and several friends, and all agreed that although the object is difficult to see clearly due to its distance, it does not in fact appear to have wings or a tail. The first attached photo is the original unedited photo. I was standing on the aforementioned State Park boardwalk, facing west. The second photo is cropped and zoomed to show the helicopter and object relative to each other."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.705481,+-71.147755(22457)&iwloc=A&hl=en\"> mufon case (22457) map </A>","Viewing Distance":"Over One Mile","City":"Fall River","Longitude":"-71.147755","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","Object Features":"Unknown","Object Shape":"Disc"}