{"Date Submitted":"04/20/2003 09:07 UTC","trends":["There have been 13 other sightings in Encinitas","There were no other sightings in Encinitas on or around April 20th 2003"],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/2245.html.txt","/var/www/straped/mufon/org/2245.html"],"Country":"United States","Disposition":"Unknown","Tags":"City","Region":"California","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Sighting Duration":"00:00:59","Longitude":"-117.27963","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.009823,+-117.27963(2245)&iwloc=A&hl=en\"> mufon case (2245) map </A>","Case Number":"2245","City":"Encinitas","Summary":"Triangular object with unusual lighting flying ver","Object Features":"Undisclosed","Log Number":"","Date of the Event":"04/20/2003 09:07 UTC","divs":["Sighting DetailsI had pulled off of Highway 101 on the California Coast at Cardiff State Beachto call my father on my cell phone to wish him a happy Easter. Before I madethe call, I got out of my car to take in the scenery. I was watching sea gullsland in the ocean partially lit by the light of a nearby restaurant to the northwhen the motion of lights in the sky attracted my attention from the directWest. Immediately, I recognized what I was seeing as an aircraft I had seen ina documentary a year earlier. I heard no sound coming from the aircraft. Istood motionless as I watched the object fly north. Less than ten seconds afterI noticed the strange aircraft, it disappeared into an overcast sky to theNorth. It seemed to continue in a somewhat straight path at a consistant andquick speed while it was in view. As best as I can describe what I saw, it wasa perfect 60 degree iscoseles triangular shaped object with rounded points withthree LARGE, glowing, white lights on the underside located symmetrically towardeach point. The lights easily covered 30 per cent of the bottom surface of theUFO. The UFO was pointed in the direction of travel with one light leading theother two. Other than the lights and the outline of the UFO it was too dark tomake out any details which may have otherwise been apparent. After the objectleft my sight I continued watching the sky for a minute and then returned to mycar to call my sister on my cell phone to tell her what I had seen."],"Latitude":"33.009823","Weather Factors":"None, Unknown"}