{"Disposition":"Unresolved","Summary":"Lights (orbs) Moving Sporadically, Covering Large Distances in an Instant","Tags":"City","Case Number":"22450","Object Shape":"Oval, Sphere","Region":"Louisiana","files":["/var/www/straped/mufon/html2text/22450.html.txt","/var/www/straped/mufon/org/22450.html"],"Date Submitted":"03/22/2010 11:24 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Longitude":"-93.433219","Date of the Event":"03/22/2010 08:27 UTC","Log Number":"US-03222010-0018","map":"<A HREF = \"http://maps.google.com/maps?q=30.450478,+-93.433219(22450)&iwloc=A&hl=en\"> mufon case (22450) map </A>","Latitude":"30.450478","divs":["sighting detailsmy buddy stands out side and talks on the phone every single night because we cannot get cellphone service indoors. approximately 2 weeks ago he had a sighting of a light(s) that was very close and very bright in the sky. at the time it gave him chills because of the irregular movement they we're preforming. he says at one point they would be on one side of the sky, then blink out, only to appear on the other side (miles apart from each other). he describes them as a car shape and sometimes it would \" morph \" into a ball or teardrop or ice cream shape. they were so bright that he could pick them up on his video camera on his cell phone. (for a reference, when he points his phone's camera at the brightest star in the sky it is not visible because there is not enough light for it to pick up on the screen). he claims they where blinking on and off and moving in between blinks at no set pace or pattern. the light was a white color. at times there was one then, there would be two or three smaller ones that seemed to do exactly what the brightest one was doing. this all went on for about (20-30) mins. enough time for him to get 3 videos on his phone to show others. the videos aren't perfect and wont prove anything definitely, but they still move, and show up when no other stars do in the film. the second sighting that happen just a few hours ago happen the same way. he was out side on his phone as usual, and a very bright light appeared in the sky and was blinking at random. he hung up immediately (with out saying good bye) and ran inside to get his grandmother to see the light. (he says he got her because he needed some credibility and another witness) the light this time was as he said \" ..almost like i could throw a golf ball in the sky and it be glowing.\" he also says \" ..its not the same as a star because, when you look at a star, you can see the fuzz and little lines of distortion coming off of it. this one was a very bright, almost glowing hot white light, and very spherical.\" he claims this one was making jumps across the sky. at some points the light would jump so far across the sky, that it looked as though it would go out and a different one would appear on the other side at the exact moment. the sighting lasted about 3-4mins. my name is [cms\\tg\\pid], i've had a sighting before also but only a silver ball in the sky stationary above my school. i am not seeking anything special, i only want to do my part and report this event so you will know that these things are happening in our area. i hope that i can see them some time too, and we will do our best to use a real video camera to capture them on film. if you have any questions, please email me. i am 18 and my buddies name is [cms\\tg\\pid] and he is 16."],"City":"DeQuincy","trends":["There have been no other sightings in DeQuincy","This sighting has never been favorited."],"Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Other","Country":"United States","Sighting Duration":"00:04:00","Weather Factors":"Unknown"}