{"Object Features":"None","Object Flight Path":"Straight-line path","Weather Factors":"None","Viewing Distance":"Unknown","Disposition":"Unknown","Date Submitted":"03/22/2010 11:48 UTC","trends":["There have been 129 other sightings in Albuquerque","There was one other sighting in Albuquerque on or around March 21st 2010"],"Region":"New Mexico","Country":"United States","Longitude":"-106.642257","Tags":"City","Source":"MUFON","Summary":"Four then apx. twenty Spheres in a pattern over ABQ.","Log Number":"US-03222010-0019","map":"<A HREF = \"http://maps.google.com/maps?q=35.089191,+-106.642257(22451)&iwloc=A&hl=en\"> mufon case (22451) map </A>","Date of the Event":"03/21/2010 09:32 UTC","divs":["Sighting DetailsLast night my girlfriend and I were in the hot tub at my apartment around 2100. We were in the tub for around a half hour when we first saw the unknown objects. We were facing South and looking up at the sky enjoying the stars when four spheres evenly spaced and moving from south to north towards us and at a constant speed. They were lighted but not to the extent that I would say they had light.(This is hard to discribe...but the spheres were an orangish color, not bright and I discribe them as possibly reflecting the lights of the city more than producing litte.) they did not get brighter as they got closer and stayed the same hue through out the whole event. Now I am not the only one to see these and the objects traveled at a constant rate not very fast but fast enough to go from our line of site in the south to out of site in the north in around twenty seconds. I would guess to say the objects were no more than two thousand feet above us, but it being night I could not tell the height. I only guess the height do to other planes in the air with flashing lights being very tough to see and these were much more clear to see. The objects held the same horizontal line pattern with no movement heigher or lowwer than the others. However, the objects moved left and right in unconventional methods. They moved fast making left to right shifting moves, yet they stayed even in their south to north motion. The objects made zero noise and were round and from what we could see were sphere in shape. All same size. So this blew my mind and my girlfriend and I both witnessed the fly over and were a little worried that we just saw something that might not have been from this world. The lack of sound, the movement and shape. The event was not over yet. So we set in the hot tub around another 15 minutes while I called my father in St. Louis and told him what we saw. We then got out and dried off and walked to the apartment. I went onto the balcony and then called my sister back in St. Louis to talk to her about what we saw. While telling her the story, Right above my apartment appeared more spheres and many more. I would estimate the amount to be from twelve to twenty orangish spheres in a pattern this time and seeming to be at the same height as the other four and moving in the same direction from South to North. The spheres were in a \"V\" pattern and all moving at the same rate of speed. I scream out the the F. is that and my girlfriend ran out on the balcony and saw the spheres again. The pattern was like a flock of geese and the \"V\" moved north and as it moved the front or point of the \"V\" moved back till the \"V\" became flat and evened out. The \"V\" was then a straight line and still moving at the same pace. The middle then started to move out ahead of the line line it was starting to become a \"V\" pattern again until we lost sight of the objects in the north sky. The objects were all the same shape and size. I then called the Albuquerque police non-emergency number to see if there had been any other reports and to have the guys keep their eyes open in the north-west sky. I then called the Fox news station to see if anyone had called them about it. They said no one had yet. I then decided to sit on the balcony for a while with my camara to see if anymore events would happen but nothing to that extent. I saw one more object take the same path from south to north and this one had no light but was a sphere and I had my neighbor see this one as well. I am not sure what I saw last night and I am not saying it was un-human but it was not anything that planes of today can do. No sound and the patterns. Now I know I was not the only one to see this last night and my brother told me about this sight. I am writing this to hopefully find someone else that saw what I did last night. I do now feel that something is overhead in Albuquerque, NM and hope UFO buffs keep their eye peeled to the north west sky. These objects flew directly over my head so look up tonight. I know I will be looking."],"Case Number":"22451","City":"Albuquerque","files":["/var/www/straped/mufon/html2text/22451.html.txt","/var/www/straped/mufon/org/22451.html"],"Latitude":"35.089191","Object Shape":"Sphere","Sighting Duration":"Undisclosed"}