{"Viewing Distance":"Unknown","City":"Annapolis","Disposition":"IFO","Latitude":"38.984465","Date of the Event":"03/19/2010 09:16 UTC","Summary":"I captured 3 digital images of 9-12 blue translucent discs over St. John's College in Annapolis Maryland","files":["/var/www/straped/mufon/html2text/22466.html.txt","/var/www/straped/mufon/more/22466_submitter_file1__UFO1CloseCrop.jpg","/var/www/straped/mufon/more/22466_submitter_file2__UFO2.jpg","/var/www/straped/mufon/more/22466_submitter_file3__UFO3.jpg","/var/www/straped/mufon/org/22466.html"],"Object Flight Path":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.984465,+-76.485973(22466)&iwloc=A&hl=en\"> mufon case (22466) map </A>","Longitude":"-76.485973","Date Submitted":"03/24/2010 07:55 UTC","Weather Factors":"Unknown","Region":"Maryland","Object Features":"Undisclosed","Case Number":"22466","divs":["sighting detailsi am a local photographer in annapolis, md. i was doing a night shoot on the practice fields of st. john's college at 21:16:54 on 3\\19\\10. i was using a nikon d 700 with a 70-200 mm 2.8 professional lens mounted on a tripod. i didn't open the files to edit the images until sunday 3\\21\\10. when i enhanced the dark areas around the buildings on campus i noticed approximately 9 light blue orbs with a corona like halo around them. the orbs were positioned in front and back of the end of the roof line. this was image #1. image # 2 revealed approximately 9 light blue translucent discs each with a bright light blue beacon on top. they appeared to be in a loose formation, banking to the right and departing the area. image # 3 revealed the formation in the open night sky over annapolis at a slightly higher altitude. the objects were now in the shape of a of a slightly flattened bell with a bright light blue beacon on top. several of the objects had a slight maroon hue to them."],"Object Shape":"Disc","Tags":"City","Log Number":"US-03242010-0002","trends":["There have been 14 other sightings in Annapolis","There were no other sightings in Annapolis on or around March 19th 2010","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Country":"United States"}