{"divs":["Sighting DetailsI opened my back door at 11:52 PM and I Immediately spotted Two lights shoot up into the sky, The first light was red and the second was green. They both disappeared in the same spot. It was silent and no flash, solid bright red and green, brighter than the three lights on cell phone tower in background. I thought they were fireworks at first but then i was thinking more about it more and i was thinking that fireworks make noise, this didn't make a noise, it was silent. Fireworks Flash They didn't flash at all, they were both solid colors and did not fizzle out and fall like a firework, they disappeared before the arch started to fall. it was very odd and never see anything like it. I started feeling paranoid after it. Never had this feeling.We have a security camera for our cars but i checked and the angle we have, didn't catch anything. If i had my camera i wouldn't of had time to take the picture it was that fast. I reported to Mufon once before, but I'm pretty sure that was a meteorite, not a UFO. I don't know what this, but i have never seen a firework look like this, maybe a dud? or even a UFO"],"Date of the Event":"03/21/2010 11:53 UTC","Tags":"City","Disposition":"Insufficient Data","Log Number":"US-03232010-0009","Latitude":"40.10136","Viewing Distance":"Unknown","Case Number":"22460","Sighting Duration":"Undisclosed","Date Submitted":"03/23/2010 02:16 UTC","Object Features":"Undisclosed","trends":["There have been 3 other sightings in Chester Springs","There were no other sightings in Chester Springs on or around March 21st 2010"],"files":["/var/www/straped/mufon/html2text/22460.html.txt","/var/www/straped/mufon/org/22460.html"],"Region":"Pennsylvania","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Summary":"Two lights shot up into sky and disappeared. 1st red followed by the 2nd green, No noise","Longitude":"-75.607932","Object Shape":"Sphere, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.10136,+-75.607932(22460)&iwloc=A&hl=en\"> mufon case (22460) map </A>","City":"Chester Springs"}