{"Latitude":"32.721029","Object Shape":"Sphere","Log Number":"","City":"San Diego","Longitude":"-117.150175","Case Number":"2246","Date Submitted":"04/20/2003 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.721029,+-117.150175(2246)&iwloc=A&hl=en\"> mufon case (2246) map </A>","divs":["Sighting Details1. We were at home filming two significant contrails that had been createdthirty of so minutes earlier.2. We noticed the object after tracing the contrails northwest from the frontof our house.3. The objects were immediately identified as being unusual due to their size,color, movement, and brightness.4. We were excited by the sighting. I started taking pictures with my OLYMPUSC-4000 DIGITAL CAMERA and my friend initiated videotaping with her SONY DIGITALHANDYCAM - Digital 8 DCR-TRV140 NTSC with Super Night Shot. Due to objectsmotion we were required to keep changing the location from which we were filmingto maintain visual contact. After the objects disappeared I went up on the roofof my house to obtain a better view should the objects return. I stayed therefor approx. 30 minutes. My friend setup her camcorder on the ground and filmedthe sky in hopes of catching another glimpse of the objects. The objects did notreturn. We returned to the house contacted our local news stations to see ifanyone had reported the incident. No reports had been made.5.-Two round red orange - orange globe-like objects with spiking edges, kind oflike fireballs. Possibly plasma-like.-Objects brighter than stars or planets.-Objects appeared to pulse.-No blinking lights.-No other color lighting, just orange.-Moved as if gliding or drifting.-Made small jumps in sky, maintaining their general location, but with aforwarded motion.-Camcorder footage showed the larger of the two objects dropping smaller whiteobjects or lights, like firecrackers, that appeared to have dissipated beforethey reached the ground.-Larger object appeared to have a shaded bottom.-No sound.-No planes, helicopters, etc. were in flight at that time.-Coincided with 2 significant contrails that were completed 15-30 min. earlier.-Abnormally little community traffic cars, etc.-Lightly cloudy evening.-Vanished. It disappeared after eight or so minutes.-A number of planes were seen afterwards in general area of where objects werelast seen.6. Visually the objects abruptly disappeared without a trace. Camcorderfootage shows that they pulsed to darkness a few times before they disappeared."],"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around April 20th 2003"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Region":"California","Disposition":"Unknown","Sighting Duration":"00:05:00","Weather Factors":"None, Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/2246.html.txt","/var/www/straped/mufon/org/2246.html"],"Object Features":"Unknown","Summary":"Two Orange Fireballs Seen Over San Diego","Country":"United States","Source":"MUFON","Date of the Event":"04/20/2003 01:00 UTC","Object Flight Path":"Unknown"}