{"Longitude":"-94.170278","Date of the Event":"03/22/2010 02:00 UTC","Sighting Duration":"Undisclosed","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/22473.html.txt","/var/www/straped/mufon/org/22473.html"],"Log Number":"US-03242010-0008","Object Shape":"Cigar","Disposition":"Unknown","Object Features":"Window(s)","divs":["sighting detailsi went to the window sunday night\\monday morn to see if it was cloudy. (i had not been sleeping. i am often up late.) it was approximately 2 am. i looked at the sky and could see only one star. i thought that was strange because i did not really see clouds--maybe haze at most. then as i was looking, i realized i was seeing something else. i probably would not have noticed it at all had it not been for the illuminated \"windows\" in the object--because it seemed to be about the same color or darkness as the sky. there were no lights on it whatsoever and i could see no projections such as wings. the row of windows was very very long. my impression was that it was much longer than a passenger aircraft (maybe 3 times as long). the long row of windows seemed to be \"undulating\". i could not judge for sure, but my general impression was that it was flying very very low. as i was watching it, i felt it was moving very slowly, but after it was gone i decided it must have been faster than i thought. i think i only saw it for less than 1 or 2 minutes. it was flying toward the nw. as it went out of sight, i hurried to the other windows to see if i could see it, but i could not. as i was watching it, i seemed to be aware of a low hum, but if i hadn't been looking at it i don't think i would have noticed any \"noise\". after it was gone, i kept feeling like i should \"pinch myself\". i couldn't believe what i saw. i have never seen anything like that before (although i have seen another ufo -- more than 40 years ago). it reminded me more of an illustration out of a storybook or a dream, rather than a traditional ufo."],"Country":"United States","Date Submitted":"03/24/2010 05:26 UTC","Weather Factors":"None","Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"22473","Latitude":"45.553889","Summary":"very long object with a long row of undulating illuminated windows","Viewing Distance":"Unknown","trends":["There has been one other sighting in St Cloud","There were no other sightings in St Cloud on or around March 22nd 2010"],"Tags":"City","City":"St Cloud","map":"<A HREF = \"http://maps.google.com/maps?q=45.553889,+-94.170278(22473)&iwloc=A&hl=en\"> mufon case (22473) map </A>"}