{"Summary":"A giant glowing green ball flew over my home around 9pm at high speed for approximately 1.5 second span of visual.Unfortunately unrecorded.","Longitude":"-81.510414","files":["/var/www/straped/mufon/html2text/22475.html.txt","/var/www/straped/mufon/org/22475.html"],"Case Number":"22475","trends":[],"City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.672027,+-81.510414(22475)&iwloc=A&hl=en\"> mufon case (22475) map </A>","Date of the Event":"03/24/2010 12:00 UTC","Date Submitted":"03/24/2010 09:58 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Region":"Florida","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","divs":["Sighting Details I walked out my backdoor to sit on my back porch around 8:45pm.I have a small space i can see the sky between treetops and my roof on the porch.My girlfriend and her sister were present but facing with back to sky.We were all talking and I was looking towards the sky when a Giant ball of light, very light green almost florescent in color flew over at a downward angle.It was going so fast it wasn't even 2 seconds till it was behind treeline.I said Oh My god,wow ,unreal.I became cold excited overwhelmed with emotion like I had seen something truly amazing.It was amazing to see.I was awestruck.The girls were like what what what is it.My girlfriend described the look on my face as surprised shocked and scared all at once.It was unbelievable.I have had sightings in the past,but nothing like this.This looked like one of the best fake videos you've seen.Only real as I'm sending this email! The object from my point of view would have blocked out the sun if it had flown in front of it from the distance which I would estimate 1500 ft or so.Easily as big around as a 747 in length but round.It was brighter in the center which emitted the glowing effect.Bright glowing green,big like nothing on Earth without a doubt.I felt as I had seen something spectacular.it went at an angle as if landing.A meteor some would say ,but no sign of a trail no fire nothing.Solid perfect Sphere like from a movie,computer graphics in real life.I still can't believe what I seen. As usual in most cases I have no proof of what I personally seen.but,i would swear that it is."],"Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Object Shape":"Circle, Sphere","Log Number":"US-03242010-0010","Object Features":"Undisclosed","Tags":"City","Latitude":"27.672027"}