{"map":"<A HREF = \"http://maps.google.com/maps?q=38.612043,+-90.335919(22480)&iwloc=A&hl=en\"> mufon case (22480) map </A>","Longitude":"-90.335919","Case Number":"22480","Latitude":"38.612043","trends":["There have been 2 other sightings in st. louis","There were no other sightings in st. louis on or around January 31st 2010"],"Disposition":"Unresolved","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"03/25/2010 08:55 UTC","Object Flight Path":"Undisclosed","City":"st. louis","Object Shape":"Boomerang, Triangle","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Region":"Illinois","Date of the Event":"01/31/2010 07:50 UTC","Log Number":"US-03252010-0002","Tags":"City","Summary":"driving home from st. louis and me and my son both saw something.","divs":["Sighting Detailsi tried to get ahold of you guys the day after it happened but i could only use my cell phone. got a message back but when i tried to follow up i recieved no more messages. me and my son were driving home from st.louis,hes 12, im 31. on the interstae still within view of the arch behind us my son pointed out jokingly that an \"airplane was on fire\". i looked up and it was up in the air in front of us not moving. we looked at it. i was trying to find anything to explain it off as an airplane or helicopter but i couldnt. it started moving and went right over top of us. it shocked us so much that we turned around to get a better look.by the time we turned around it went over topv cahokia mounds, a local native american earthen pyramid site. and was over top east st. louis in a matter of a second. wewere driving roughly toward it, back towards st.louis when it lit up very bright and shot toward lambert airporet. in that direction anyway. now the reason i am e mailing you now is because just last night my friend saw the exact same thing in the exact same spot. i never showed him the pictures that me and my son drew of thwe craft. his drawing was about 90% the same as my sons. I would HIGHLY appreciate a connection with someone in the st. louis area that i could go into more detail about this. it was the second time ive seen this craft in the same area. i saw it about two years ago in the exact same spot as well but wrote it off as an airplane.my phone number is *** *** ****. i would really like to talk to anyone about this to see if anyone else has experienced this in the same area. i dont know if it has anything to do with the ancient native american site or the arch in st. louis or lambert air port, or even scott airforce base. I would like to keep this anonymous please. i dont want my son getting anything froim kids at his school. thank you for your time. also I have detailed info that me and my son wrote down about ten min, after the event that i could share. i have audio of me and my son seeing this and my son has a VERY pixelated picture on his cameraphone. ANY help would be VERY much appreciated, i dont know where to go. thank you... ***"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22480.html.txt","/var/www/straped/mufon/org/22480.html"]}