{"map":"<A HREF = \"http://maps.google.com/maps?q=37.169228,+-94.844124(2249)&iwloc=A&hl=en\"> mufon case (2249) map </A>","Object Features":"Window(s)","Object Shape":"Cylinder","Latitude":"37.169228","Weather Factors":"Unknown","Longitude":"-94.844124","Log Number":"","Viewing Distance":"Over One Mile","Disposition":"Unknown","Source":"MUFON","Case Number":"2249","Date Submitted":"05/31/1999 08:00 UTC","Region":"Kansas","Object Flight Path":"Unknown","divs":["Sighting Details1. I was in the rural Kansas countryside on a clear blue sky Sunday morning dontrememember the exact day, filling my planter in preperation for planting a fieldof soybeans, as I am a farmer.2. I was facing the north as I was working and looked up as something caught myeye and observed a round black basketball shaped object several miles distantand approximatley two to four thousand feet up at a 50 60 60 degree angle. As aformer Army Officer paratropper I used to jump at 1200 feet so I believe myhight and distance estimate is fairly accurate. It seemed like it appearedsuddenly as I had been facing that direction for a few minutes and noticed itall of a sudden, like it appeared out of no-where.3. At first I thought it was a hot air ballon which is common in this areaduring the festival season, but as I studied it I observed it was perfectlyround and did not have any lines and basket hanging below it, and the color wasjet black, not colored like most hot air ballons.4. I was intrigued as I observed it because I knew it was not any convedntionalflying object based on its appearance and movement . I did make a report severalweeks later to a now defunct ufo website, as I recall, UFOs, New Mexico and theWorld. I also related my sighing to family and friends whose reaction was thetypical skepticism and disbelief. I decided to make this report again to yourcredible organization as I cannot forget this sighting and belive it isimportant information even though it happened almost three years ago.5. The round black ball shaped object appeared to be decending at a very slowrate of speed and as it got closer I could begin to observe that it had massbehind the circle. I estimate that it was several miles distant to the Northwhen it finally stopped after approximatley 10 minutes or less into its decentand foreward movement to the south in my direction. The black round object afterstopping and hovering for a few seconds, began turning slowly to the west, andas it turned the shape revealed itsself as a long cigar shaped, shinny metalic,silver fuselage, anywhere from 100 to 300 feet long, with small portals alongthe bottom half of the fusleage.After a 90 degree turn to the west, it continuedto hover a few seconds, then iI could see an aura of energy waves radiating allaround the object as if it was powering up, then it tilted slightly upward a fewdegress and began moving slowly at first"],"Tags":"City","files":["/var/www/straped/mufon/html2text/2249.html.txt","/var/www/straped/mufon/org/2249.html"],"trends":["There have been no other sightings in Columbus","This sighting has never been favorited."],"Sighting Duration":"00:10:00","Date of the Event":"05/31/1999 08:00 UTC","Summary":"Observed a silver cigar shaped object with a black","City":"Columbus","Country":"United States"}