{"Case Number":"22496","Object Shape":"Boomerang, Other, Unknown","Longitude":"-89.883154","City":"Troy","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.729215,+-89.883154(22496)&iwloc=A&hl=en\"> mufon case (22496) map </A>","files":["/var/www/straped/mufon/html2text/22496.html.txt","/var/www/straped/mufon/org/22496.html"],"Latitude":"38.729215","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-03252010-0018","Object Features":"Other","Region":"Illinois","Summary":"Saw this while driving last night. Could not believe my eyes!","divs":["Sighting Detailsabout a month or two ago while driving home from st louis ,i noticed bright lights from what i thought was an airplane. i have never seen bright lights on an airplane like this and i lived in that area my whole life. the lights turned and moved slowly away from me and i assumed it was just an aitplane or helicopter. last night while driving home i saw the exact same bright lights, but this time it was much closer to the ground and stationary. as i approached this object i was waiting for the moment when i could tell myself \"its just a plane\". i didn't get to do that. it was some sort of space ship or unknown something! looked like it was not of this world. it resembled a claw, kinda like the ones you use to win prizes at carnivals. except it had four \"claws\". neon blue lights at the tip of each one, they were hard to see until i got close, the shape of the claws were seemingly designed to hide the light. once i drove under the craft i noticed it had four white lights under the very center of the craft. these were not the same bright lights that i noticed from far away,those were like headlights and there were five of those, small outside lights medium sized towards the center and one big light in the center. the four white lights under the center had a small red light directly in the center of them, this was also the center of the bottom of the craft. once i passed the craft, i could not see it any more when i looked back. one last thing is the physical part of this craft was blacker than the night sky. i got a real good look at this thing and will attach a sketch as soon as possible."],"Disposition":"Unresolved","trends":["There have been no other sightings in Troy","This sighting has never been favorited."],"Date Submitted":"03/25/2010 07:02 UTC","Object Flight Path":"Stationary","Date of the Event":"03/24/2010 09:35 UTC","Weather Factors":"Unknown"}