{"Summary":"Hovering Rectangular Object, surrounded by lights with one red flashing light","City":"Riverside","trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around March 24th 2010"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"33.956499","files":["/var/www/straped/mufon/html2text/22507.html.txt","/var/www/straped/mufon/org/22507.html"],"divs":["sighting detailsi was driving southbound on i-15 at approximately 6 pm pst, 3\\24\\2010. i had just left the riverside area. i noticed a object in the air over an open field on the northbound side of the interstate. at first glance, i thought the object was a helicopter. as my car approached the object, however, i discerned a rectangular shape and noticed that the object was stationary in the air. i estimate the object was roughly 500 - 700 feet above the ground, and approximately 60 - 90 feet long on the side facing me. it was generally light gray in color...nearly the ambient color of the sky at that time. it had lights along the exterior edges, and a flashing red light on one end. my wife was in the car with me at the time. she thought the object might be a helicopter (she made that observation after we had passed the object and it was no longer visible). i had suspected this myself when i first noticed the object in the distance, but changed my mind as we passed it by and i was able to view it more closely. she did not view the object as we passed by. we were traveling at approximately 70 mph. due to the traffic conditions at the time, i was not able to immediately pull over in order to observe this object more closely. i was going to do so approximately a quarter-mile down the highway...but when i looked in the rear-view mirror at where the object should be, it was gone. i estimate 1 minute 15 seconds elapsed between the moment when i first noticed the object, to when i was able to discern that it wasn't a helicopter. i searched for a place to pull over (paying close attention to traffic), looked in the rear-view mirror, and noticed the object was gone. this incident strikes me as unusual as i am typically able to discern types of aircraft under most visibility conditions (i was in the military and so am accustomed to viewing all kinds of helicopters). this one was highly unusual due to the rectangular shape of the object. it stuck in mind, because this is the first time i have ever witnessed what amounts to a ufo in my life."],"Region":"California","Longitude":"-117.392556","Country":"United States","Source":"MUFON","Log Number":"US-03262010-0004","Weather Factors":"None","Disposition":"IFO","Date Submitted":"03/26/2010 04:23 UTC","Date of the Event":"03/24/2010 06:00 UTC","Object Features":"None","Object Flight Path":"Stationary","Object Shape":"Square, Rectagular","Case Number":"22507","map":"<A HREF = \"http://maps.google.com/maps?q=33.956499,+-117.392556(22507)&iwloc=A&hl=en\"> mufon case (22507) map </A>"}