{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.98387,+-87.896591(22501)&iwloc=A&hl=en\"> mufon case (22501) map </A>","Object Features":"Unknown","trends":["There have been 3 other sightings in Des Plaines","There were no other sightings in Des Plaines on or around March 10th 2010","This sighting has never been favorited.",""],"Case Number":"22501","Date of the Event":"03/10/2010 08:00 UTC","Date Submitted":"03/25/2010 10:27 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22501.html.txt","/var/www/straped/mufon/more/22501_submitter_file3__IMG_0893.jpg","/var/www/straped/mufon/org/22501.html"],"Tags":"City","Longitude":"-87.896591","Latitude":"41.98387","Region":"Illinois","Disposition":"Unknown","Object Flight Path":"Stationary","Summary":"Stationary and pulsating orange orbs seen from Chicago suburb.","Log Number":"US-03252010-0023","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Other","divs":["sighting detailsi stepped out back back to have a cigarette and it was before daylight savings, so it was very dark still at 8pm. from my yard i can see many flights preparing to get into their landing paths as ohare is east of me, but this was different. looking east from carol stream to what appeared to be in the direction of ohare there was a cluster of bright lights in a horizontal line that remained stationary, bright and flashed red and orange at this point (almost spinning) some moving in and out of vision and some staying, but the ones that disappeared returned to sight after just seconds. for the most part they stayed in a horizontal line or moved to a semi circle formation with some disappearing and returning and some disappearing all togehter. but there are consistantly 2-3 bright, glowing pulsating orbs that just don't move at all. assuming they were planes, i continued to watch them to make sure they were moving lower to land, but it didn't happen. the distance from the ground wasn't changing. i grabbed my camera, jumped in my car and drove about 2 miles east to the mall parking lot where the lights were still there pulsating and moving in and out of the picture\\videos i've included. still not convinced, or maybe just freaked at this point and amazed that no one else was seeing what i saw, i drove another approx 2 miles east to a parking lot that's on a hill where i was able to get additoinal shots of the view where these orbs were still visible. being visible from my back yard that night, i've checked every night since at various time to see if it was possibly planes in a holding pattern, but it's not happened since. i hadn't really noticed them spinning\\pulsating from the naked eye, but noticed when i viewed the videos. the first video was from the mall parking lot (2 miles east of my house) adn the second video was from the hilled parking lot (4 miles east of my house). i used just a cannon digital camera and have litle skill and apparently shakey hands, but tried to zoom in\\out so you can see the landscape. i also have some pictures as well. keep in mind the line of bright white lights in the video under the white and orange pulsating orbs are actually street lights. keep you eye right above them to see the pulsating orbs moving in and out of view (video 2) the picture quality is not very good, but zoom in on the lone orange orb high above the street lights. maybe a plane,but in line with vid 2 and the orbs. the sky was clear and it was approx 40 degrees. i'm sorry for the quality of the videos, but it was the best i could so at the time."],"Weather Factors":"None","City":"Des Plaines"}