{"map":"<A HREF = \"http://maps.google.com/maps?q=39.291895,+-76.609809(22511)&iwloc=A&hl=en\"> mufon case (22511) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsMy friends and I were outside since it was nice out. There were seven of us. One of the little kids made two of my friends mad so I suggested we lay down in my friends driveway and look at the stars. We were talking when I noticed the light from a star was blocked out for a moment. I had a double-take and when I looked again, I saw a triangular shaped craft with four orange lights. Three of these four lights were located near the tips of the craft while the fourth was in the middle. I was in shock. I live in a busy area and my father and I are involved with astronomy and own two telescopes. We both look at the stars all of the time and live near an airport,so we have a VERY clear idea of what a plane looks like at night. This object wasn't hard to see or obscured by clouds, and I could CLEARLY make out the shape and lights on it. When I saw it, I immediately stood up and shouted to everyone and pointed out the object. One of my friends saw it and kept his eye on it. The object was relatively slow and very low, moving northwest. This friend always blew off anything about UFO's and thought the whole idea of it was bogus. That is no longer the case. Two other people caught a glance of it, but saw it just before it escaped our point of view. Of course, no one else saw it and when we talk about it they just belittle us. But my friend and I know what we saw."],"files":["/var/www/straped/mufon/html2text/22511.html.txt","/var/www/straped/mufon/org/22511.html"],"Summary":"A triangular shaped craft with four orange lights passed silently over my neighborhood. It was very clear.","Tags":"City","Log Number":"US-03262010-0008","Sighting Duration":"Undisclosed","Date Submitted":"03/26/2010 11:48 UTC","trends":["There have been 65 other sightings in Baltimore","There was one other sighting in Baltimore on or around March 19th 2010"],"Case Number":"22511","Object Features":"Unknown","Date of the Event":"03/19/2010 09:15 UTC","City":"Baltimore","Region":"Maryland","Latitude":"39.291895","Object Shape":"Triangle","Country":"United States","Object Flight Path":"Straight-line path","Longitude":"-76.609809","Source":"MUFON","Disposition":"Insufficient Data"}