{"Summary":"on 91 freeway, craft flew a couple of feet above my car, lost track of time, was sick for three years after that.","Object Flight Path":"Straight-line path,Path with directional change","Disposition":"Insufficient Data","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Date Submitted":"03/27/2010 05:35 UTC","City":"Riverside","Log Number":"US-03272010-0003","divs":["Sighting DetailsI and a friend went to a BBQ at my sisters house in Riverside california. We left the BBQ around midnight. My friend was driving and I was in the passenger seat with my head against the window, dozing. We were driving down the 91 freeway in Riverside, in the slow lane, headed towards the 57 freeway to Costa Mesa, where we lived. As we were driving, I noticed the sign on the freeway said we were at Weir Canyon. As it was a Saturday night, there was alot of traffic on the freeway. I closed my eyes and began to relax for the long ride home. As I began to doze, a distinct thought came to my mind. The thought said, \"Turn your head and look out the window.\" I turned my head, and I saw a red \"ball shaped\" object that looked like it was perhaps 20 to 30 feet away from me. As we were in the slow lane, there was nothing beyond that but the shoulder of the freeway. No houses, no lights, just barren fields, completely dark. I thought the red ball odd, as I had traveled that freeway many times and that area is totally undeveloped. Nothing there. As we drove, I noticed the ball was keeping up with us. I didn't say anything at the moment to the driver. I just watched it. Finally I said, \"Why don't you speed up a little.\" She did and the ball kept up. I strained to look at it, to see if it was a reflection of some kind, possibly from our own car. I said to her, Now slow down a little, so she slowed the car, and the ball was still right with us. She asked what I was doing, and I told her about the ball. She looked and saw it too. She pulled over on the shoulder and stopped. We got out to look at it, and it disapeared. I figured it was a reflection. So I took the wheel this time, and waited for the traffic to move ahead so I could get out in the lane. This time, I moved to the center lane, turned on the radio and began to cruise home. All of a sudden, I saw what looked to me like white car lights coming toward me in my lane. I called her attention to it, and she became frightened. It looked exactly like a potential head on collision. I looked to my right and left, to see if I could move in to another lane to get away from it, but the traffic was heavy on both sides and in back of me. I couldn't move in any direction. I layed on the horn, the lights were comming closer, I couldnt change lanes. This all happened in a split second, or so it seemed to me. I slammed on my brakes, knowing I would surely get hit from behind. I brought my knees up behind the wheel and covered my face with my hands, waiting to be hit from the back and head on. I waited, but nothing happened. When I uncovered my face, I saw that the lights in front of me in my lane, was not in my lane at all, but \"above\" my lane. I watched it moving slowly. I could see the front of it. It was arch shaped in the front, like a horseshoe shaped bumber, with a purplish hue around it and three huge lights under it. It moved slowly over my car, and I turned to watch through the back window and saw it move slowly away. It was enormous. I opened the door and got out. There was no sound from the craft, no sounds of any kind. At that moment, I noticed there was no traffic on the freeway. It was completely empty. There was no one. I took the keys to start the car, and realized I had not shut it off when I slammed it in to park, yet it was off. I started the car and sped off, scared to death, running red lights all the way home. When I got home, I looked at the clock. It was 4:30 in the morning. I couldn't understand why it was so late. I was tired and confused. I went to bed. When I woke up the next morning, I didnt feel well. I told a neighbor about what I saw. He said \"Lets go back tonight, and see if we can see something.\" Fear shot through me. I didn't want to go, but they razed me until I went. As we traveled down the same freeway, we came up to weir canyon again. I noticed there was aprox 50 cars pulled over on the shoulder, with people standing outside their cars, looking up. We did the same thing. There must have been a thousand of those red balls darting back and forth, flying around, like playing tag with each other. Then suddenly an enormous white light, just popped on in the middle of the sky. The crowd gasp, and then the light went off again. I jumped in to the car and drove down the freeway to the next underpass and got off, going to the gas station at the bottom. I asked the gas attendent there if there was an airport near. He said there was. IT was a light plane airport not far from there. I decided to go there to check it out, but before I could go, a huge white helicopter, with blacked out windows, flew over the overpass and hovered over my car. It looked like military, but I couldn't be sure. The blades were kicking up dust so bad, I couldn't hardly keep my eyes open, but I did see the pilot clearly. It hovered over my car for several minutes, then it flew off in the direction I had just come from. I knew this was no mistake, no coincedence. This all had something to do with what I had seen the night before. I went to the airport and watched the planes coming in and out for over an hour. No way was there anything there that even remotely resembled what I saw on either night. After that, I went home, and went to work the next morning. I wasnt feeling well, so I decided to make a doctors appointment. I went the following day. They did some test, and bloodwork. When I left the doctor, I couldnt find my car in the parking lot. It took me over an hour to find it. Once I got in, I had forgotten how to start the car. When I finally got it started I got lost on the way to work. When I finally got there to pick up my friend, my shift was over and we went home. She said she felt sick too. She cried for three days, not knowing why. I asked her what was wrong, she said she didnt know. She just cried, she suffered severe depression which was unusual for her. I went to work and found I couldnt remember how to operate my machine. I had trouble walking, as my gate was completely off. To make a long story short, over aprox a months time, I slowly and surely deteriorated, little by little. I lost my job, my car, and my home, as I got sicker and sicker, becoming incapable of supporting myself. I developed a stutter that I had never had before in my life. My head and neck tilted to the right and was unable to straighten it. My doctor said for some reason, my autonomic nervous system was shot. I did not tell him what happened that night, as I believed he would think I was crazy. I was sick like that, and on medications for three years. It took three years for me to re-learn how to drive again. It has been years now, and although I am able to work, It has been a hard climb up. I still have lingering disabilities from this. All these years, I have been looking for anyone who witnessed what I saw those two nights. I have been looking for answers, and have found nothing. I watched a documentary the other night and learned of your organization, which is why I'm writing you now. I have no photos of it. I have blogged for years to try to find anyone at all who saw what I saw. I have had no luck. Today, I still have memory problems in that I still have no sense of direction, and can get lost in my own neighborhood. My walking gate never got better, and I still stutter from time to time. I don't know what happened to me, but something sure did."],"Object Features":"Unknown","Object Shape":"Oval","Tags":"City","Case Number":"22514","Source":"MUFON","Date of the Event":"06/16/1977 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.959739,+-117.392886(22514)&iwloc=A&hl=en\"> mufon case (22514) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22514.html.txt","/var/www/straped/mufon/org/22514.html"],"trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around June 16th 1977"],"Latitude":"33.959739","Longitude":"-117.392886","Region":"California"}