{"City":"Devils Lake","Summary":"UFO moving slowly across the sky before abruptly moving in opposite direction at speeds.","Weather Factors":"None","Tags":"City","Country":"United States","Log Number":"US-03272010-0006","divs":["Sighting DetailsMy father, mother, and I were traveling back from a family trip to Bemidji, Minnesota where we had family. We were traveling in my family's 2001 Buick LeSabre and it was about 9:30 at night. We were about an half hour or so away from Devils Lake and my father and I were talking and listening to the radio while my mother was asleep in the passenger seat. I was sitting in the back looking out the rear view window when I noticed a small light moving in the sky. At first I thought it was an airplane, because we see those all the time, but there was no blinking lights on the object that I usually associate with a plane. I didn't really think much of it at first, I just kept watching it to pass the time on the way home. The object was moving about the speed of an airplane, going from east to west across the sky. Suddenly, however the object in the sky began to slow down and start to make a small circle in the sky, before coming to a complete stop for about a half a second or so and then it suddenly darted off towards the east, going very fast, covering probably a fourth of the sky in about a second before it disappeared. It looked liked it had moved higher up in altitude as well. After seeing this I was shocked because I had never seen anything like it and to this day I still don't know how to explain what I saw. I immediately told my father what I saw, but he didn't see anything and wasn't terribly inclined to believe me."],"Object Shape":"Sphere, Unknown","Disposition":"Unknown","Latitude":"48.112779","Longitude":"-98.86512","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/22517.html.txt","/var/www/straped/mufon/org/22517.html"],"Region":"North Dakota","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Devils Lake","This sighting has never been favorited."],"Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"06/12/2006 09:30 UTC","Case Number":"22517","Source":"MUFON","Date Submitted":"03/27/2010 12:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.112779,+-98.86512(22517)&iwloc=A&hl=en\"> mufon case (22517) map </A>","Object Features":"Unknown"}