{"Latitude":"40.493934","map":"<A HREF = \"http://maps.google.com/maps?q=40.493934,+-85.148304(22510)&iwloc=A&hl=en\"> mufon case (22510) map </A>","Source":"MUFON","Date Submitted":"03/26/2010 10:37 UTC","Region":"Indiana","Date of the Event":"07/19/2009 12:00 UTC","Object Flight Path":"Undisclosed","Object Shape":"Disc","Log Number":"US-03262010-0007","Sighting Duration":"10:30:09","Tags":"City","Longitude":"-85.148304","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22510.html.txt","/var/www/straped/mufon/org/22510.html"],"trends":["There have been no other sightings in Pennville","This sighting has never been favorited."],"divs":["Sighting DetailsMy sister, and brother-in-law and I, and our 5 children were taking the \"back way\" home from an all day trip to King's Island...which is located in Cincinnati, Ohio...It was getting late at night..My sister and I had the 2 older kids, and the youngest child in the mini-van with us..My brother-in-law had the 2 middle kids with him, and, he was traveling ahead of us going north on Pennville road....My sister and I were talking when, suddenly, to our right, we saw this HUGE greyish colored \"disc\" pop down under the clouds....we both were shocked by it! My sister and I, at the same time, exclaimed, \"Did you see that!!!!!?\" As fast as it descended (which only took less than a few seconds..) it immediately shot straight back up into the sky!!...I exclaimed that it had to be a UFO, and my sister gave me the \"evil eye\" and said,\"No, it was just a shooting star..\" I told her she was crazy, and, to avoid an argument, I just let it drop....It was pretty dark that night, out in the middle of the country..there were no street lights...the thing had to have been huge, because it looked to be bigger than her mini-van..It all happened in a split second...I have seen shooting stars..they look bright, and appear to be somewhat small...also, they usually don't shoot right back straight up into the sky!!! The disc had a \"glowing\" characteristic about it..not bright, but, bright enough for us to see it...Another strange thing that happened,was that we were headed to a \"T\" in the road..it intersects with U.S.40....As we got to the intersection, an unmarked, white police car, with blacked out wheels came squealing off of U.S. 40 headed south...Keep in mind that we were out in the \"boonies\" at about 10:30-11:00 at night...we didn't pass any accidents, and didn't see anything suspicious (except for the disc...) There wasn't any other traffic on the road that night...He could have been responding to an emergency, but, the coincidence really unnerved me....It all happened so fast! My sister and I just let it drop...we didn't mention it again! As large as the disc appeared to be, I would approximate it to have been probably about 1-2 miles away from us....I have never seen anything like it before, or since.."],"City":"Pennville","Viewing Distance":"Unknown","Summary":"large, luminescent, grey, looked like the \"old-fashioned\" flying discs from the 1950's movies","Disposition":"Insufficient Data","Case Number":"22510","Object Features":"Undisclosed"}