{"Object Features":"Other, Unknown","Case Number":"22516","Latitude":"38.258155","Summary":"On clear nights there is always an orb like object in the skies above my house.","files":["/var/www/straped/mufon/html2text/22516.html.txt","/var/www/straped/mufon/org/22516.html"],"Source":"MUFON","Region":"Kentucky","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering,Other","Tags":"City","Date Submitted":"03/27/2010 11:52 UTC","Disposition":"Unknown","Longitude":"-85.750426","Weather Factors":"Unknown","City":"Louisville","Country":"United States","Sighting Duration":"12:00:00","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.258155,+-85.750426(22516)&iwloc=A&hl=en\"> mufon case (22516) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsAny night the skies are clear I can look out the window and see an orb like object above my house. About a year ago I was looking at stars and this caught my eye. At first this object would only change colors. Red, white or orange are the colors I would see the most. As nights went by I would regularly check out this object. One particulary night I was looking at this object pretty hard and it seemed to start to get brighter almost as if it was moving closer to me. And it was, it got so close and so bright I could even see a red ball of light rotating around it. Which explained it turning red at times. I even decided to show some of my friends and they were surprised at what they were seeing too. About a month ago I was looking out the window just checking it out like normal. Although this time I was concentrating very hard on it. Suddenly the slight movements I had seen in the past (ones that kinda made me think I was crazy)turned into full out zips across the sky. When this first happened I was terrified and went into the house and locked the doors. Now whenever I get bored at night I go to my window and look at the object just to pass time. And as crazy as this sounds when I'm staring at the object, in my mind I'll be thinking about what way I'd like to see the object move and sure enough it will move that way. Another night I was looking at the object and it was pretty bright. So I thouht I would photograph it so I went inside to get my camera. When I came back outside it was so far away I could barely see it. I took the camera back inside and when I came back out it was bright again. Last night after watching this object move so rapidly through the sky I felt I had to let someone know that mattered."],"Date of the Event":"03/26/2010 11:02 UTC","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around March 26th 2010"],"Log Number":"US-03272010-0005"}