{"Summary":"I just saw one 30 minutes and I still have goosebu","Tags":"City","Longitude":"-122.04024","map":"<A HREF = \"http://maps.google.com/maps?q=37.529659,+-122.04024(2251)&iwloc=A&hl=en\"> mufon case (2251) map </A>","Weather Factors":"Unknown","Object Shape":"Boomerang","Log Number":"","Region":"California","Source":"MUFON","Latitude":"37.529659","Date Submitted":"04/24/2003 09:04 UTC","files":["/var/www/straped/mufon/html2text/2251.html.txt","/var/www/straped/mufon/org/2251.html"],"Object Features":"Appendage(s), Wings","Date of the Event":"04/24/2003 09:04 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:00:59","Object Flight Path":"Unknown","Country":"United States","Case Number":"2251","City":"Newark","divs":["Sighting DetailsI went outside to take the dog to the bathroom. As Max ran over to go I put myhands in my sweatpants pocket and looked up at the sky. It had rained hard lastnight so I was admiring how nice it was with light clouds spotting the sky andhow pretty the stars were. There wasnt a breeze or any noice other than the dogscollar from walking around.It smelled very fresh out.I noticed out of the corner of my eye what I thought was a bird flying overhead.I looked directly at the object and thought thats not a bird...How the heck isthat guy hang-gliding around here I thought it was a hangglider because of itsaltitude, shape, and lack of noise.Then I said, Oh my God, what the heck is thatI watched the object, perfectly focused for about 6 seconds before it flew intosome sparse clouds. I was dumbfounded.I followed the path of the object hoping it would hold its course and come outthe other end. It didnt...I thought I saw it circle tightly and turn towards theEast.When then all heck broke loose. 4 planes came out of no where and converged onsome mountains East of my housewhere the object headed. Not sure what kind of planes they were. Then what Ithought were two jets F-16 off in the north headed over towrds my direction in asort of glide speed. They made very little noise, but I could still hear thejets.I ran in to tell my wife what had just happened. Grabbed the binoculars and ranback outside, she came outside for a second to look, but went back in because itwas cold for her.I watched the sky intensly for awhile 1 to 2 minutes and watched for the craft., ran into the garage, grabbed the ladder and climbed onto the roof. There werealot of aircraft over new the mountain range.Two passenger jets went over head slightly west of me their flight for SFOAnother jet F-16 came into view, southwest of where the object first glided overhead. He headed into the clouds the object went into which had now blowed overthe mountain range and disappeared. I then head a helicopter over in thearea...it held its course thorugh the clouds heading North toward the Oaklandairport.All of this was amazing i still cannot believe it, but I swear I saw this objectand I have NEVER seen anything like it in all of the military programs I haveseen on cable stations.I had one beer while I bar-b-qed"],"Disposition":"Insufficient Data","trends":["There have been 3 other sightings in Newark","There were no other sightings in Newark on or around April 24th 2003"]}