{"divs":["Sighting Detailsat a little after 8pm I was outside in the barn finishing up feeding and went back in the house and noticed something weird in the western sky horizon.. well I got the binocs out and looked and it was something bright yellow but off in the distance but I could get a pretty good look thru the binocs. I got my mom and she saw it as well. we both agreed it looked like a dusk to dawn light but it was definitely in the sky. I tried to video it but it wouldnt show up in my camera at all! well I tried to get closer as it wasn't moving at all. well I got on the road and could see it had moved off to the northwest and in a matter of seconds it was gone. so I was driving back home and had just turned onto the main road to my dead end road and saw it again appear over a neighbors farm.. I got out the binocs and it indeed was the same thing. I tried to get closer and when I looked for it again as I drove up it was gone! now my dad has said he's seen it a couple times as well coming home from bowling past tuesday nights.. now I also found this weird.. one monday late afternoon it was still light outside we saw what looked like an airplane in the air but it wasn't it had 2 headlights like a car but we couldn't see a plane or any object at all.. it was heading straight south and all of a sudden it was just gone.."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.110815,+-88.712611(22520)&iwloc=A&hl=en\"> mufon case (22520) map </A>","trends":["There has been one other sighting in Winneconne","There were no other sightings in Winneconne on or around March 23rd 2010"],"Region":"Wisconsin","Tags":"City","Case Number":"22520","Object Shape":"Diamond, Star-like, Teardrop","City":"Winneconne","Summary":"Barn Light Object in Sky","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/22520.html.txt","/var/www/straped/mufon/org/22520.html"],"Weather Factors":"None","Log Number":"US-03272010-0009","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"03/23/2010 12:00 UTC","Country":"United States","Sighting Duration":"01:00:00","Longitude":"-88.712611","Latitude":"44.110815","Object Features":"Unknown","Date Submitted":"03/27/2010 02:16 UTC","Object Flight Path":"Hovering then path"}