{"map":"<A HREF = \"http://maps.google.com/maps?q=36.336528,+-119.287048(22527)&iwloc=A&hl=en\"> mufon case (22527) map </A>","Case Number":"22527","Region":"California","Object Flight Path":"Stationary","Country":"United States","divs":["Sighting DetailsI let my indoor cats outside to get some fresh air, while sitting in my chair I saw a silver object. At first I thought it was a airliner high in the sky as I had watched several cross the sky earlier. This was different. The silver disk shaped object did not move in any direction for several mins. As I watched longer ,it seemed to move very slowly to the left then stop and moved back very slowly to its original postion. As I watched I tryed to consider what I was seeing. I knew this was not a balloon as it did not drift or rise in the wind. I was facing east and the object was N.E. at a 45 degree angle. The object seemed to be very high in the sky.I would say 30,000 to 40,000 ft up. I had the impression the object was spinning but cant say for sure because of the distance. After watching the object for 10 mins,I ran for the back door to get my wife to see it, when we got back outside less than a min later the object was no longer visible. I live near a major air corridor and see all kinds of aircraft all the time. This was unlike anything I have ever seen. I was very disappointed that my wife missed it, as it was very odd. The other high aircraft were making short contrails but this object had none. I had the impression as I watched the object that I was seeing something very unusual and strange. The object seemed brighter that other aircraft reflecting sunlight, because its was small enough that I could have easily missed it, if not for its brightness. It was like polished chrome in appearence."],"Log Number":"US-03272010-0015","Weather Factors":"Windy, Light","Date of the Event":"03/27/2010 04:15 UTC","Sighting Duration":"00:10:00","Longitude":"-119.287048","Tags":"City","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/22527.html.txt","/var/www/straped/mufon/org/22527.html"],"Viewing Distance":"Over One Mile","Object Features":"None","City":"Visalia","Object Shape":"Disc","trends":["There have been 12 other sightings in Visalia","There were no other sightings in Visalia on or around March 27th 2010"],"Source":"MUFON","Date Submitted":"03/27/2010 09:42 UTC","Summary":"Silver disk shaped object hovering in one spot","Latitude":"36.336528"}