{"Country":"United States","Log Number":"US-03272010-0017","Longitude":"-118.40743","Summary":"SHAPED LIKE A \"V\" - 5 LITTLE LIGHTS","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","City":"Los Angeles","Source":"MUFON","Date of the Event":"08/12/2007 08:15 UTC","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around August 12th 2007"],"Disposition":"Insufficient Data","Case Number":"22529","Object Features":"None","Date Submitted":"03/27/2010 09:54 UTC","files":["/var/www/straped/mufon/html2text/22529.html.txt","/var/www/straped/mufon/org/22529.html"],"divs":["Sighting DetailsI WAS WAITING FOR MY NEXT FLIGHT..I WAS TALKING TO A CO-WORKER WHEN I LOOKED UP AND FROM THE SOUTH DIRECTION WAY UP IN THE NIGHT SKY WAS THIS V SHAPED OBJECT WITH ONE LIGHT AT THE TIP, THEN TWO AND TWO. I WATCHED IT FOR ABOUT 5 SEC. AND TOLD MY FRIEND TO GET OUT AND LOOK AT THIS OBJECT. I LOOKED BACK UP AND THERE IT WAS. SLOWLY COMING OVERHEAD WHEN IT TURNED SLOWLY TO THE EAST AND VANISHED. BY THE TIME MY FRIEND GOT OUT, IT WAS GONE. IT LOOKED SO STRANGE UP THERE, NOT LIKE NORMAL AIRCRAFTS. ALSO, I WAS WATCHING THE MOVIE \"JAWS\" AND NOTICED A WHITE LIGHT OBJECT JETTING THROUGH THE BACKGROUND, LEAVING A SLIGHT TRAIL THAT SOMETIMES TURNED A REDDISH COLOR, WHEN YOU GO FRAME BY FRAME. I WAS KNOCKED OUT AND PLAYED IT OVER AND OVER.(I HOPE YOU CHECK THIS OUT!) AND IF YOU LET THE FILM RUN ABOUT 1 MINUTE MORE, WHEN THE SCENE CHANGES TO THE BOAT SITTING IN WATER WITH THE FOG AND CLOUDS IN THE BACKGROUND, ANOTHER,OR, THE SAME ONE, ENTERS FROM THE LEFT SIDE OF THE FILM, AND HEADS TOWARDS THE FOG AND DISSAPEARS. THE FIRST SIGHTING IS WHEN ROY SCHNIDER (CHIEF) GOES TO GET HIS GUN CAUSE THE BOAT IS SINKING. ITS A NIGHT SCENE. I HOPE YOU GET BACK WITH ME AFTER YOU ANALIZE IT. WAS IT A SHOOTING STAR? I PERSONALLY DONT THINK SO. AND...AND ANYONE ELSE EVER NOTICED IT?"],"Object Shape":"Triangle","Region":"California","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.950342,+-118.40743(22529)&iwloc=A&hl=en\"> mufon case (22529) map </A>","Latitude":"33.950342","Tags":"City"}