{"files":["/var/www/straped/mufon/html2text/22526.html.txt","/var/www/straped/mufon/org/22526.html"],"Log Number":"US-03272010-0014","Disposition":"Insufficient Data","Date of the Event":"03/26/2010 08:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.442217,+-123.320992(22526)&iwloc=A&hl=en\"> mufon case (22526) map </A>","divs":["Sighting DetailsWhile at a local bingo night in Grants Pass, Oregon on Friday, March 26, 2010, about 10-15 of us were outside in the parking lot during break time (approx. 8:45 pm). After being there for a minute or two, someone said \"What is that?\". Looking up towards the high South section of sky, we saw 4 bright orange-gold-yellow lights (kind of star shaped, but also looking slightly like the lights were in a triangle format). They were moving very slowly upward toward each other from different places in the sky (#1 higher and slightly towards the West, #2 slightly lower \"under\" #1 and slightly towards the West from #1, #3 was placed quite a bit lower than #2 slightly towards the East, and #4 was much lower and more to the East of the other lights, moving slowly upward toward the higher lights). The #1 light suddenly disappeared when it reached a certain spot (which we thought may have been a cloud, although no \"light\" showed behind the space at the place where it disappeared - it just \"winked out\"). Meanwhile, the other three lights were slowly converging on the same area where the #1 light disappeard. The #2 light slowly moved towards the East and disappeared in about the same place a few seconds (maybe 30 secs) later. As the other two were converging on that area of the sky, another light (#5) began to come up from the area where the #4 light had been at first sighting (this all took about 3-5 minutes). About 1 minute later the #3 light disappeared in the same section of sky as #1 and #2, and about a minute after that, another light appeared (#6) from the same area as #4 and #5, continuing upward, angling toward where the other lights had disappeared. Within approx. 4-5 minutes more, all but #6 had \"winked out\". #6 seemed to stay in place for about 20-30 seconds after the #5 light had gone out, then slightly and slowly angled to the area where the others disappeared, and \"winked out\". We stayed for a couple of minutes more, then went inside. We obviously talked about it while it was happening and afterwards, but everyone was baffled and said they had never seen anything like it. We discussed that we didn't think it could be helicopters because they came what seemed to be too close to each other before they blinked out, and there was absolutely no noise. We also agreed that they could not have been flares, due to no smoke trails, and their speed was very slow. Their direction also seemed purposeful as the lights seemed to curve in their ascent towards the spot where they all blinked out, although they did not seem to radically change direction. A couple of us suggested they may be \"weather balloons\" with lights, but none of us knew if weather balloons are used anymore, and everyone thought their ascent to the spot where they disappeared was very purposeful. The lights were very bright and I don't remember noticing the placement of the moon. We never witnessed any \"zipping around\" or fast movement, except the #6 light seemed to move slightly faster after it's pause, but still slowly. The sky seemed to us to be clear of any visible clouds where we were looking. There was no ambient light that I noticed other than the disappearing lights to show anything in the dark sky, and the disappearing lights did not cast ambient light on anything that we could see. Several people used their cellphones to capture a picture of the lights, but sadly I didn't have my cellphone with me. I can't really estimate the height of the area where the lights blinked out, but it seemed very high in the sky and fairly far from us - they were far away enough for us to discuss the fact that it was probably over the Oregon coast, or even over the wster. After the slight pause before disappearing, the #6 light seemed to move slightly faster, but still slowly."],"Object Shape":"Star-like, Triangle","Tags":"City","Case Number":"22526","Date Submitted":"03/27/2010 09:39 UTC","Source":"MUFON","Longitude":"-123.320992","Object Flight Path":"Path with directional change","Region":"Oregon","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"several lights moving up in atmosphere from SW lower sky in S-SW portion of sky","City":"Grants Pass","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around March 26th 2010"],"Viewing Distance":"Unknown","Latitude":"42.442217"}