{"divs":["Sighting DetailsI was coming out of work, walking across the parking lot. I am in the habit of looking at the sky. noticed an amber light. it looked like a plane coming in for a landing, but very far out. the humidity was high. no stars visible. (there is an airport up the hill from my work place) As I wathced the light dimmed out and another light lit up a bit above the level of the first light. I thought it was the plane banking to the left. there was no sound. I continued to watch. the second light dimmed as another light began to brighten, this was a bit higher than the second one. I knew then it wasn't a plane. As I watched, the 3rd light dimmed as a fourth lite came on. again, this one was a bit higher than the rest. still amber in color. the lights continued 6 or 7 more times. each one higher than the next - in a straight line. None of them moved or drifted as a flare would. they were low in the sky. Just over the hills of West Lebanon. they started in the south and lit up going towards the north. they were spaced about 4 - 5 inches apart, by my fingers. As this was happening, one of my coworkers came up to me and asked what I was looking at. I pointed and asked him if he saw it. He said he did. we agreed that we didn't hear any sound coming from it. As we watched a small plane came from the airport and flew over head, heading west. of course we heard that very clearly. after it was gone, the lights continued. No sound could be heard from that direction. I couldn't see an object. It was dark, overcast and the lights from the parking lot prevented seeing anything but the lights. after the last light dimmed, I ran to my car to try to get away from the town lights. I couldn't see anything in the sky at all. I asked some friends if anyone else had seen anything. One friend had a friend who reported seeing the same thing, from Lebanon. I was in West Lebanon at the time. Whatever it was must have been enormous. I was very excited to see this. It is the 3rd \"UFO\" I've witnessed in almost 30 years. Wish I could've seen something other than just lights. wish I could've video taped it."],"Longitude":"-71.562805","Disposition":"IFO","Country":"United States","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.198492,+-71.562805(22524)&iwloc=A&hl=en\"> mufon case (22524) map </A>","Object Flight Path":"Undisclosed","Case Number":"22524","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"03/27/2010 08:06 UTC","Object Features":"Undisclosed","Latitude":"43.198492","Log Number":"US-03272010-0013","Object Shape":"Unknown","Region":"New Hampshire","Date of the Event":"11/19/2009 12:00 UTC","Summary":"lights in straight line, dimmed as another lit up. lasted a few minutes","City":"Undisclosed","trends":[],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22524.html.txt","/var/www/straped/mufon/org/22524.html"]}