{"Longitude":"-117.843652","Tags":"City","Date Submitted":"03/27/2010 05:00 UTC","files":["/var/www/straped/mufon/html2text/22522.html.txt","/var/www/straped/mufon/org/22522.html"],"Sighting Duration":"Undisclosed","City":"Orange","Object Flight Path":"Other","Date of the Event":"03/25/2010 04:30 UTC","Object Shape":"Circle, Flash, Other","Summary":"White dots, blinking close to the moon. Flash on flash off, moving different directions, there were many of them. It was an amazing display of white shiny dots.","trends":["There have been 23 other sightings in Orange","There were no other sightings in Orange on or around March 25th 2010"],"Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.796874,+-117.843652(22522)&iwloc=A&hl=en\"> mufon case (22522) map </A>","Object Features":"Other","Source":"MUFON","Region":"California","Log Number":"US-03272010-0011","Disposition":"IFO","Latitude":"33.796874","Viewing Distance":"Unknown","divs":["Sighting DetailsOn March 25th around 4:15pm, when to get the mail from my complex mail box, was walking towards my condo, when look up to look a the moon, suddenly i saw some blinking ligths movign like in zig -zag kind of like very playful in the sky. I call my husband to look it up, and he say he saw many of them too. but he was skeptical about it, he told me is our eyes playing a trick on us. he did see the flashing ligths for sure. we when back into the house amaze on what we have seen. All this is sitll in my mind and having dreams about it. in one of my dreams, they were lifting me up, it seams like they speak by telephaty. it seams like they are getting ready for an even that is going to happen here on earth and they are ready to rescue us. they kept telling me that more are coming and everyone will be able to see more of them. they are going to reveal themselves to us. I am not understanding the meaning of all this. but they are here and they are allowing people to see them even with a naked eye. so we have the evidence and people start to prepare themselve for what is coming... that is what telephaticly was transfer to me. (I am affraid to talk about this, don't want people to think I am crazy). thank you and hope this helps.. feel free to contact me. I don't have any physicall evidence, like pictures or videos. only what we saw."],"Case Number":"22522"}