{"Source":"MUFON","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.882907,+-123.983949(22533)&iwloc=A&hl=en\"> mufon case (22533) map </A>","trends":["There has been one other sighting in Blue Lake","There were no other sightings in Blue Lake on or around March 27th 2010"],"Country":"United States","Longitude":"-123.983949","Log Number":"US-03282010-0002","Date Submitted":"03/28/2010 01:11 UTC","files":["/var/www/straped/mufon/html2text/22533.html.txt","/var/www/straped/mufon/org/22533.html"],"City":"Blue Lake","Summary":"Anomalous cigar shaped craft with 3 lights flew within 50 feet over my house!","Disposition":"Unknown","Case Number":"22533","Object Features":"None","Region":"California","divs":["Sighting DetailsFlying from North to South at maybe about 50 mph at 9:30 pm PST, was a black silhouette of what looked like a black disc edge on. The profile of the thing never changed shape as it flew over. It was kind of like two long, skinny cones with rounded tips glued together at the base. The two ends displayed huge bright white non-flashing lights that lit my front yard as it flew over. It had to be about 70 to 100 feet long. It made a very loud buzzing noise as it flew over like an extra large lawn mover engine. It had a gigantic red light in the middle of it about twice the size of the two white lights. None of the lights flashed. It flew about 50 feet over the top of my house and then once it got over the Mad River, it followed the river East and then cut to the right as it followed the ridge line of Fickle Hill out of site. All total, the siting lasted about 2 - 3 minutes. I couldn't get my dang cellphone camera out fast enough to snap a pic. Dammit!! This thing was very bizarre as it flew lengthwise forward and not like a missile. I've never seen anything like it. I live about 6 miles East of Arcata, California outside of a little town called Blue Lake. Erik 1) I was in the house on the computer when I heard it approaching. I thought is was a plane but it sounded funny. 2) The funny sound 3) A kit helicopter of sorts. 4) It glided and banked slowly and smoothly 5) Excited. I tried to get my cellphone camera out fast enough but I couldn't make my hands work right I was so jittery and shocked at what I was seeing. This is all but unheard of in Humboldt County Northern California. We only have one major airport and it can only land commuter planes! 6) It flew over the ridge line in front of my house."],"Latitude":"40.882907","Viewing Distance":"21-100 Feet","Object Shape":"Cigar","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"03/27/2010 09:30 UTC"}