{"Longitude":"-102.986111","Object Shape":"Triangle, Other","Date of the Event":"05/03/2008 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.139167,+-102.986111(22540)&iwloc=A&hl=en\"> mufon case (22540) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"We came into very,very close contact","Region":"Saskatchewan","Log Number":"CA-03282010-0009","City":"Estevan","Object Features":"Unknown","divs":["Sighting DetailsI need to be taken seriously right now I am not carzy or a lier just because people did not see it does not mean it did not happen.. It was May 3 2008 im pretty sure. It was about 2:00 in the morning I was at my fiances moms farm near Kisbey in south east Saskatchewan. Iwas out late with a buddy sitting on the deck it was a nice warm clear night a good night to just sit back and look at the stars while we talked about our alien theories and what not..Anyways at around 2:00 we noticed a set of lights out in the feild behind the house they were about 600 700 yards away and very low to the ground from what we could see. We stared at them for about 10 mins trying to figure out what they were they appeard to be moving in a circular motion and flashing in a pattern from left to right. We decided to get a better view so we walked up to a near by hill and crouched down but when we did all other lights around faded out of sight except for the rotating lights, At first we thought it was a semi on a dirt road but It just sat there and was far to long to be a semi at such a far distance. So we decided to walk back to the house as we got back onto the deck we saw a bright falsh of light shoot off into the sky the light looked like it came from the object in the field, The light looked kinda like a flar but it was in the shape of what looked like Pac-Man it only lasted a few seconds and then faded and at about that time we started to hear twigs snapping in the trees all around the house and what sounded like light foot steps in the tall grass we went inside and grabbed a flashlight, when we got outside we walked close to the treeline looking for whatever was in the bushes and then out of nowhere our flashlight died but we kept going I dident want to but I dident want to seem like a baby infront of my buddy anyways everytime we got close to the tree line we would hear a sound on the opposite side of us when we went towards the sound it would move to another part of the tree line almost like there was multiple creatures in the bush and they would make noise anytime we got close to one so that we couldent see it. we did this for about a half hour by the time we got back to the deck it was almost 3:30am we were already scared. My buddy came up with a little test to see if we were alone he is very smart and clever in his mind but what he would do is yell out \"If you can understand me snap a twig\" and sure enough we heard a loud snap come from the trees I jumped and said a few bad words. Then we decided to try another test we went to one side of the yard and ran to the other side as we did we heard something crash through the bushes toward us as if it was eagar to follow us but it stayed in the bushes We were so scared that in mid run we turned on a dime and ran towards the house in fear we went back on to the deck and sat for a min to catch our breath and analize in our heads what we just heard after a few mins we decided to walk down the ramp behind the house that led around the house to the driveway as we got to the corner of the house we saw something standing in the driveway we could not see its face but it just stood there. We stared at it for about 30 seconds or so when we heard a low whine noise come from behind us we turned to look but found nothing when we looked back to see the creature standing in the driveway it was gone. (the creature was about 6 foot 3 or so it had long arms and a round head but had no clothing from what we could see.)anyways as I was saying I was scared I really wanted to go inside so we decided to go inside. We walked towards the house we had our backs toward the house staring at the driveway when out of nowhere we heard what sounded like a loud gust of wind that slamed a bush near the front door right up against the house and it was loud I did a full 360 jump when we looked at the bush it was pretty much pressed up against the hous I was shaking so bad I had to sit down. When I was on the ground my buddy was infront of me talking to me as I looked up at him I saw a large black shadow on the roof looking down at us as I told him to look it darted away it was really fast, I got up and we ran to the back of the house to see what it was but there was nothing at about that time we noticed a large object in the shape of a triangle move across the sky above the house it had 3 lights on it one on each corner but there was no sound we could feel a slight vibration on the ground but yet no sound, It moved very slow about 10 miles an hour then all of a sudden a bright light luminated the yard and it sped of heading south at an incredible speed then it was gone. A strong sulpher smell filled the air In total shock we went inside and down to my buddy room so that we could regroup and get our minds straight so we could figure out what just happened we did not sleep for the rest of the night we were to scared. About 3 nights later my buddy woke up gasping for air and it was loud enough to wake me and I was in another room I went to see if he was okay he said he could not remember his dream but it felt like something was pressing really hard on his chest and then once againg the strong sulpher smell filled the room but only for about 2 mins. After that for about 3 weeks we had weird dreams constinly smelled sulpher and seen weird lights in the sky almost every night.. I had one dream that was exactly the same for 2 nights in a row I dreamed that I was abducted and taken to a strange place where I was stuck with a needle like object in the corner of my eye I could not speak, scream, or move then everything would go black and Id wake up. When I would wake up it would be mornig but it felt like I only slept for a few mins. To this day we still see strange lights in the sky others have witnessed it as well but I will never forget that night ever It was the most frightning thing I have ever gone through...."],"Latitude":"49.139167","Country":"Canada","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Tags":"City","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/22540.html.txt","/var/www/straped/mufon/org/22540.html"],"Date Submitted":"03/28/2010 03:44 UTC","Disposition":"Unresolved","Source":"MUFON","trends":["There have been no other sightings in Estevan","This sighting has never been favorited."],"Case Number":"22540"}