{"Viewing Distance":"Unknown","divs":["Sighting DetailsOn the evening of Saturday, March 27th, I was facing west sitting on my balcony here in Banker's Hill, San Diego, CA at 8:30 PM PST. Through the trees I saw a flash of white light which streaked from the west to the east resembling a meteor streak, but more close. I got up off my chair and looked directly above our condominium. I then saw the underbelly shadow of something smoothly gliding to the south. It was barely detectable, but with the bright moonlit sky I clearly saw wingtips. I don't believe it made any sound, but it was hard to tell since we live near an airport and there was an incoming plane arriving in the flight path to the airport. The entire sighting lasted no longer than 10 seconds. I am an avid sky watcher and this was not a normal event. The plane was completely dark aside from the flash of light it emitted which drew my attention to it. It reminded me of Batman's Batplane. Perhaps a drone plane of some sort taking a photo. I did watch for from the roof our building for the next 45 minutes and it did not return."],"Object Features":"Undisclosed","Summary":"Unlit silent winged aircraft flashed meteor-like streak of light","Latitude":"32.718889","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"03/29/2010 12:25 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.718889,+-117.152215(22547)&iwloc=A&hl=en\"> mufon case (22547) map </A>","Region":"California","Case Number":"22547","Date of the Event":"03/27/2010 08:30 UTC","Log Number":"US-03292010-0001","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around March 27th 2010"],"City":"San Diego","Object Flight Path":"Undisclosed","Object Shape":"Cross, Flash","Disposition":"Unknown","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/22547.html.txt","/var/www/straped/mufon/org/22547.html"],"Longitude":"-117.152215"}