{"divs":["Sighting DetailsIt was about 5 minutes till midnight, I stepped outside with my small dogs. The sky was clear, stars plentiful, a beautiful evening. I called one of my dogs back to me but he was interested in something in our driveway, so I walked out away from the house and that is when I saw an orange colored light to my Northwest, traveling East. The object suddenly stopped and remained still. It was now located a few degrees west of due North and perhaps 5 degrees above the horizon. It never moved from that position, which was probably close to being directly over Crystal Falls. At first I thought it might be an emergency helicopter, as we are not quite a half mile from the local hospital. It only took a few seconds to be sure that it was not. After watching for a few minutes, I ran inside and told my spouse, \"You need to see this!\" I grabbed my binoculars, flung open our front door and pointed. He saw it. He grabbed my binoculars but they were set for me, so he grabbed the other set of binoculars and looked again. We discussed it and agreed we were seeing the same thing. The light would be a deep red, then it would change to a brilliant orange, then brighten even more, to a yellow white. Every time I spoke out loud that it should come closer, or get brighter, it would flash brightly, then it would dim to red again. What we saw was an horizontally elongated light, with something bright hanging down from the bottom center, like a narrow \"V\". As we watched, I began to be able to see a slight outline of an object, that the light was attached to (see depiction). The light was mounted to some type of structure. Seen from our perspective and without aid, the light was approximately 3 times the magnitude of Venus at it's closest to earth. The light appeared to be several miles away, yet through the binoculars it was fairly large. After being able to see a faint outline of the object that the light was attached to, I'd have to say the object in total, was massive. I took several photos with my small digital camera and watched the object for slightly over an hour.At approximately 01:06, as my spouse and I watched, the light flared up to several times it's original size, then as if by flipping a switch, the entire object disappeared. We both stayed awake until 03:00 but the object did not return. I have had many sightings but this is only the second time that my spouse and I have witnessed something like this together. From my perspective, the object (light) flared brightly and disappeared, while my spouse thinks it exploded, then disintegrated. Whatever it was, we both watched it for over an hour before it disappeared in a flash. Note: This is my own personal sighting. Photos were taken only seconds apart. Depiction shows how the structure appeared, as I viewed it through my binoculars. My spouse and I are in agreement about the 'appendage' appearing to protrude from top and bottom of the light, though he had trouble making out the structure around it. -SW"],"City":"Breckenridge","Case Number":"22558","Weather Factors":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/22558.html.txt","/var/www/straped/mufon/org/22558.html"],"Object Flight Path":"Hovering then path","Tags":"City","Sighting Duration":"Undisclosed","Region":"Texas","Longitude":"-98.8985","Summary":"brilliant red/orange light seen by two witnesses","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.761227,+-98.8985(22558)&iwloc=A&hl=en\"> mufon case (22558) map </A>","Log Number":"US-03292010-0012","Source":"MUFON","Country":"United States","Date Submitted":"03/29/2010 08:45 UTC","Latitude":"32.761227","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Unknown","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around March 14th 2010"],"Date of the Event":"03/14/2010 11:55 UTC"}