{"Viewing Distance":"Unknown","Case Number":"22557","Date Submitted":"03/29/2010 07:35 UTC","Region":"Kentucky","Object Shape":"Unknown","Tags":"City","trends":["There have been 9 other sightings in Paducah","There were no other sightings in Paducah on or around March 12th 2010"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-88.593398","Log Number":"US-03292010-0011","Disposition":"Unknown","Source":"MUFON","Country":"United States","Weather Factors":"None","Summary":"I did not see anything.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.091649,+-88.593398(22557)&iwloc=A&hl=en\"> mufon case (22557) map </A>","divs":["Sighting DetailsMy eyes were closed, I had been asleep. Not for very long because I had been up late that night and went to sleep around 1:30 or close to 2:00. I could see a light flashing ... flicking off and on. I knew I was awake but couldn't open my eyes. How was that light flashing in my bedroom? That's when I thought that THEY were here. I became very frightened and I could hear my heart pounding in my ears. Then I feel this awful feeling going through my body. It was like an electrical shock that lasted for some seconds with a slight vibration. I was thinking I had felt this feeling before. For some reason I knew this was not a natural feeling and yet I thought this was something \"I\" was doing myself. I tried to scream.. open my eyes.. but I couldn't I took note of my surroundings. I was in bed. The covers where over me and I was lying on my side facing the bedroom door. The cat was on top of the covers laying next to me and was very still. Everything was quiet in the house and the feeling had passed. I think they were gone but I could not open my eyes or move yet. For some reason I started to feel very relaxed and very calm. I could feel my heart rate slow and I felt a feeling of tranquility. My head cleared of all worries and thoughts of what had just took place. I drifted off to sleep and did not wake till the next morning, remembering all that I have just described. I have seen objects in the sky that I can't explain and have several \"Dreams\" of encounters with strange beings. I don't like thinking about them. This is the most recent event that I would like to share with you in hopes that I may find some kind of release....understanding...to these feelings of helplessness, anger and fear."],"Latitude":"37.091649","City":"Paducah","files":["/var/www/straped/mufon/html2text/22557.html.txt","/var/www/straped/mufon/org/22557.html"],"Date of the Event":"03/12/2010 12:00 UTC"}