{"Summary":"silvery disk in a slow dipping and tilting motion","Object Flight Path":"Stationary","City":"Chesterland","Latitude":"41.522274","files":["/var/www/straped/mufon/html2text/2255.html.txt","/var/www/straped/mufon/org/2255.html"],"Longitude":"-81.337887","trends":["There have been no other sightings in Chesterland","This sighting has never been favorited."],"Sighting Duration":"00:30:00","divs":["Sighting Detailswhen first observed at 1105 a.m. I had finished a conversation on my cell phoneat the parking lot of the chesterland Mcdonalds. I looked up to the North andsaw something moving like a hawk or vulture sbout a thousand feet high.As I watched the object I noticed mannerisms of a vehicle not a bird.I grabbed the binoculars in the car and clearly saw a disk slowly moving to thenortheast of my location. I then called my friend who lived nearby and had himlook in the direction that i was looking in.he observed the same thing along with the other witness at the same location.The object was moving to the southeast and comming toward their location.meanwhile I drve north on rt306 about a half mile closer and again observed thedisk still moving slowly and revolving around its axis and doing a u shapedipping from side to side. with the binoculars the object was filling the lensand i clearly saw the shape and light on the underside and the slightly domedtop from both locations that i was at. About 15 minutes have elapsed now and idrve to my friends house due to direction of the craft headind closer to him.when I arrived, about a half mile, I was able to see the object to my left theentire time they were on the porch following the object with binoculars.the object moved slowly to the east gaining altitude and moving away from usover the trees. It never stoped fluttering and moving in the u shape alsosometimes moving in an upside down rotaion. the craft seemed at times todisapear compleatly and reaaper in the same spot doing the same fluttering.finnaly it moved eastward out of site because of the trees."],"Date Submitted":"04/27/2003 11:05 UTC","Object Shape":"Disc","Tags":"City","Object Features":"Patterned Surface","Region":"Ohio","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.522274,+-81.337887(2255)&iwloc=A&hl=en\"> mufon case (2255) map </A>","Country":"United States","Case Number":"2255","Source":"MUFON","Log Number":"","Date of the Event":"04/27/2003 11:05 UTC","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile"}