{"Case Number":"22562","Sighting Duration":"00:00:40","Region":"Nevada","Log Number":"US-03302010-0004","Disposition":"Unknown","divs":["Sighting DetailsOn June 2, 2009 at approximately 3:00 pm I was sitting on my balcony which I do often, looking toward the north (I can view the entire sky over Las Vegas and my balcony is partially covered so I can sit outside during summer) I witnessed the most unbelievable, most incredible object that I have ever seen in my life. From out of my left peripheral vision I noticed what I thought was an airplane traveling from west to east. When I turned my head to the left I saw a giant metallic tube (bright silver) that resembled a giant airplane without wings and without a definitive fuselage or tail. As I watched this object travel eastward I was able to see the sun shine(reflect) along the side of this object. As I watched in awe the object slowed and then came to a complete stop right in front of my viewpoint. There was no wind (I had area rugs hung over my balcony which would sway even in slight wind) and there were no clouds in the sky, it was a perfectly blue sky. As this object sat there still (for about 15 seconds) I watched in disbelief as this object's sides began to shrink inward making the object smaller and smaller (shorter and shorter tube) until it became a small point that completely disappeared in front of my eyes. This object was completely silent and was moving at a very fast velocity before coming to a complete stop in a matter of seconds. The entire incident lasted maybe 40 seconds. The object was extremely high in the sky (I had to tilt my head all the way back to see it) but it was easily visible due to its great size. I have been watching airplanes all my life and this was no airplane. I estimate this object must have been the size of at least 10 jumbo-jets. I have been skeptical about this topic and a non believer in ufos. This incident has completely changed my life and I feel my mind has expanded 100 fold."],"City":"Las Vegas","Date Submitted":"03/30/2010 02:43 UTC","Latitude":"36.117046","Object Features":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Longitude":"-115.166516","Object Shape":"Cigar, Cylinder","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around June 2nd 2009"],"files":["/var/www/straped/mufon/html2text/22562.html.txt","/var/www/straped/mufon/org/22562.html"],"Summary":"Gigantic metal tube cylindrical/ cigar-like","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.117046,+-115.166516(22562)&iwloc=A&hl=en\"> mufon case (22562) map </A>","Object Flight Path":"Undisclosed","Source":"MUFON","Date of the Event":"06/02/2009 03:00 UTC"}