{"map":"<A HREF = \"http://maps.google.com/maps?q=34.257038,+-85.164673(22567)&iwloc=A&hl=en\"> mufon case (22567) map </A>","Weather Factors":"None","Sighting Duration":"00:10:00","Country":"United States","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/22567.html.txt","/var/www/straped/mufon/org/22567.html"],"Disposition":"Unknown","Longitude":"-85.164673","divs":["Sighting DetailsI was driving. Turned off of hwy 101 south onto Alabama hwy heading into rome. I saw what I thought was a bright star and as I got closer it got brighter. I then realized that it was cloudy and that there were no other stars around. I focused on the light that was stationary and it brightened then turned off... immediately I saw a red light on the left side and a green light on the right side. I knew that there was a rr crossing up ahead and assumed it was a train, however when i arrived at the rr crossing the was no train but instead an almost sperical object floating about 3 yrds past the crossing and about 30foot in the sky. I immediately called my husband in tears bc I knew that what I was seeing wasn't \"right\". I was crying in fear when I told him what I was looking at. I passed directly under the object and could see there circular shaped on the bottom. I pulled over into the old Coosa Middle School parking lot in an effort to take a pic?video with my camera phone. There were no lights on the back side and by time I could get my window down it shot off toward the mountains were it turned around again to where the red and green light were showing then with a flash it was gone. I am still creeped out and afraid to drive home from work tonight!"],"Latitude":"34.257038","Object Features":"Unknown","Tags":"City","Object Shape":"Blimp, Circle, Oval","Log Number":"US-03302010-0009","Date Submitted":"03/30/2010 01:56 UTC","Case Number":"22567","Summary":"sighted a bright glow which turned to one red one green light 30-40foot above road","Region":"Georgia","Viewing Distance":"21-100 Feet","City":"Rome","Date of the Event":"03/29/2010 08:40 UTC","Source":"MUFON","trends":["There have been 10 other sightings in Rome","There were no other sightings in Rome on or around March 29th 2010"]}