{"Log Number":"US-03302010-0006","Case Number":"22564","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/22564.html.txt","/var/www/straped/mufon/org/22564.html"],"Weather Factors":"Does Not Apply","Region":"Maine","Tags":"City","Object Flight Path":"Stationary","Latitude":"43.440589","divs":["Sighting DetailsI was heading home from a friends house in Sanford, Maine at around 7:00 pm on RT 202 (also called Lebanon Rd). When I got to the top of Mt. Hope and was turning with the road towards the west at a short downhill grade,what looked like a large cluster of lights to my left caught my attention. I've been on this road countless times and never had any kind of experience like this. I think the reason it caught my attention because of the size of this thing.I was probably around 1-3 miles away and it looked to be around 4 inches tall and three inches across. There were alot of lights on this thing but they all looked to be separated by some distance. There was a center mass that had sections coming off of it in multiple directions,much like the space station. It didn't seem to move as I drove along. It reminded me of the way the UFO's in the movie \"Independence Day\" just seemed to float. I was a distance from this thing so I didn't hear any noise. I drove approximately a mile in a westerly direction and as the road turned to the left and downhill in a southerly direction I couldn't see the object anymore. It was gone!! I'm not quite sure what to think about this, but I sure wish I had had a camera."],"Date of the Event":"03/25/2010 07:10 UTC","trends":["There have been 4 other sightings in Sanford","There were no other sightings in Sanford on or around March 25th 2010"],"Sighting Duration":"Undisclosed","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.440589,+-70.768555(22564)&iwloc=A&hl=en\"> mufon case (22564) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"03/30/2010 12:35 UTC","Longitude":"-70.768555","Summary":"I saw strangely configured lights in the sky.","Country":"United States","Object Features":"Appendage(s)","City":"Sanford"}