{"City":"Lima","Date of the Event":"03/29/2010 01:00 UTC","Country":"United States","Source":"MUFON","Tags":"City","Region":"Ohio","Object Shape":"Other, Unknown","Case Number":"22561","trends":["There have been 7 other sightings in Lima","There were no other sightings in Lima on or around March 29th 2010"],"Date Submitted":"03/30/2010 12:56 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path then hovering","Weather Factors":"Unknown","divs":["Sighting DetailsThis is the 2nd time I've seen these lights. I wouldn't have filed a report but I did a quick search for Ohio and recent sightings and found more than one news story, in particular from Euclid, Ohio, that match what I've been seeing exactly. The lights at first glance appear to be plane or helicopter lights. In fact, the first time I saw them, I didn't even give them a second look. That was on March 23 at approximately 11:30pm. I only thought it was something strange when I went out later that evening at 12:30am and saw the same lights in about the same position. I watched them for quite awhile and attempted to video tape them (which I do have), but the tape only reveals fuzzy lights so it's not worth much. The lights stayed there for another 30 minutes until my curiosity got the better of me so I got into my car and drove toward them as best as I could. As I left town, I seemed to be getting closer to the lights and they were actually closer than I initially thought since they didn't in line with the stars and horizon as a distant object would. Just as I noticed I was getting closer, that's all the closer I was able to get. In fact, the lights moved relatively quickly away from me toward the east. I tried driving as fast as I could to catch up and drove about 60 - 70 mpg for about 10 minutes and could not catch up. I turned around and the lights were gone a few minutes later. The lights I saw tonight (the 29th) were exactly the same lights. The difference is that I saw them to the Northwest of Columbus Grove instead of the East (March 23). I watched the lights for more than an hour and tried video taping them but again, the video camera couldn't get a good focused video. I tried using the 60x zoom on it and a couple times I did get a clear glimpse, but the lights just appeared as , well, lights. the lights were white and blue. Truly, I would have thought they were helicopter lights but they hovered in approximately the same spot for hours and there was no noise at all. I didn't want to waste gas so I didn't chase them this time. Again, the Euclid sighting seems to match what I saw exactly."],"Summary":"Bright lights in sky, hovering about 5 miles N-NW of Columbus Grove.","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=40.745111,+-84.098246(22561)&iwloc=A&hl=en\"> mufon case (22561) map </A>","Log Number":"US-03302010-0003","Longitude":"-84.098246","Viewing Distance":"Over One Mile","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/22561.html.txt","/var/www/straped/mufon/org/22561.html"],"Latitude":"40.745111"}