{"Weather Factors":"Unknown","Region":"New York","Object Shape":"Unknown","Date of the Event":"07/26/2009 08:39 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"Photos clips from video.","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.721393,+-74.004253(22572)&iwloc=A&hl=en\"> mufon case (22572) map </A>","Object Features":"Undisclosed","Date Submitted":"03/31/2010 12:25 UTC","Country":"United States","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around July 26th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/22572.html.txt","/var/www/straped/mufon/org/22572.html"],"Source":"MUFON","Longitude":"-74.004253","divs":["Sighting DetailsI am sending a photo of a UFO. It was disguised as a small floating burn cinder that may have come from a neighbors BBQ grill. I notice the burn cinder in my NY backyard. However, 10 minutes later the cinder did not move from the last place I saw it. Therefore, I slowly move the camcorder toward the middle of my back yard. It accelerated at a high speed. I cough it as it disappeared into the clouds. I was in California for the January 2009 winter as I opened the garage door I looked into the back yard and saw three identical craft similar to the one in the photo, take-off. I was not surprised that the crafts were in my backyard but that they opened a dimensional door that was in contrast with the topography in California and with the 4:00 PM sky. Hours later I turned to my daughter and asked her if she had seen something strange. She was afraid to be ridiculed but related The 2nd picture is similar to the UFO depicted approaching the Space Station orbiting Earth as seen on the TV show: Los Archivos De Jaime Mausan. [Reference Sep 2006 Atlantic Mission STS-115, Dec 2006 mission STS 116 & mission STS 117]. In February 2003 there was communication with a similar looking UFO. The 3rd picture is the similar face that appeared in a UK crop-circles depicting a humanoid face comparing their DNA structure to that of homo-sapient sapient. Their was telepathic communication letting me know that they had achieved terra forming technology. What relationship and responsibility do these third parties in the section \"WITNESS NOTICE AND ELECTION FOR RELEASE OF CONTACT INFORMATION\" have with Mufon?"],"Disposition":"Insufficient Data","Tags":"City","Log Number":"US-03312010-0001","City":"New York","Latitude":"40.721393","Case Number":"22572"}