{"Case Number":"22578","Summary":"glowing lights going dimmer and brighter..everywhere","Longitude":"-81.00623","divs":["Sighting Detailsi was sitting at my computer downloading a game when i looked out my window to see if that birght green light in the sky was there (ive seen it before) and turns out it was , accept this time there was more then one of them there was like 10 of them and 4 of them were forming this kind of upside down 3 dimensional pyramid that was moving slowly if at all because after a while i could only see half of it as i live in an apartment and some house was blocking the rest of it. the lights were really high in the sky and they got really really bright and then they got dimmer but they never stopped shining they just got really hard to see, not the pyramid ones but the other 6 around it and one of them was over the formation it was larger then all of them and glowing bright orange i saw all of this at 9:30 and it lasted til about 11:30 then all of them dissapeared except for one. it just sat there for a half hour and then i decided to stop watching it and when i came back it was gone. i tried taking pictures but for some reason the lights wouldnt show up on my digital camera i pointed it in there direction but nothing happend the street light popped up and in 3 pictures i dont no im not to sure what i got its very strange it dosent look like what i could see with my eyes but when i took the picture it was there one of them is a tiny red light that you can see moving rapidly in two pictures i took simultaneously after the other. the other is a bright blue blob and i think i messed the other ones up because of the way i was shacking i dont no but i was very anxious when it happend and my heart was beating really fast and i could not calm down i thaught it was a tower they use to make sure planes dont get to low but they were to high up in the sky and they moved i also thaught maybe its a bunch of satelites but they dont glow bright green and they dont stay still when u watch them u you can see them move. i can assure you what i saw just sat there in place, and now there gone. and they only come back some nights its weird, oh and they arent stars unless stars get bright and fade and all the other stars in the universe blew up because there wasnt a star out yesterday night, only a alot of glowing lights.."],"files":["/var/www/straped/mufon/html2text/22578.html.txt","/var/www/straped/mufon/more/22578_submitter_file1__reddot1..JPG","/var/www/straped/mufon/more/22578_submitter_file2__reddot2.JPG","/var/www/straped/mufon/more/22578_submitter_file3__dontno.JPG","/var/www/straped/mufon/org/22578.html"],"Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=46.49435,+-81.00623(22578)&iwloc=A&hl=en\"> mufon case (22578) map </A>","Sighting Duration":"Undisclosed","Latitude":"46.49435","Country":"Canada","Tags":"City","Date of the Event":"03/30/2010 09:32 UTC","Object Shape":"Circle, Flash, Sphere, Star-like, Triangle","Disposition":"Unresolved","Date Submitted":"03/31/2010 09:13 UTC","Object Flight Path":"Stationary","City":"Greater Sudbury","Weather Factors":"Windy","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","trends":["There have been 12 other sightings in Greater Sudbury","There was one other sighting in Greater Sudbury on or around March 30th 2010","This sighting has never been favorited.",""],"Log Number":"CA-03312010-0007"}