{"files":["/var/www/straped/mufon/html2text/22577.html.txt","/var/www/straped/mufon/org/22577.html"],"Object Shape":"Star-like","Summary":"dancing lights in the sky","Latitude":"44.959297","divs":["Sighting DetailsWalked outside for a cigarette, looked in the sky and saw dancing lights.... I first saw one light, it looked like it was in one spot and then moved quickly to a different point in an erratic manner. We watched it for some time, it would move up when planes were in the area, it also looked like it did some loops. It would move quite a bit in different directions but basically stay in a (defined) area. It looked like it could be a star, but obviously too low to be a star. It moved back to where we first saw it then moved quickly to where it looked like it was in the middle of the street, that is when we saw the other light. It was smaller and stayed below the original light. The lights were white, there were no other colors and no flashing light to indicate a plane. At one point while we were standing on Greenbrier a lady stopped and asked if we had seen the 5 lights,she said a few of her neighbors had watched the lights for a while before we saw them, she said there were 5 originally, then it one fell and seemed to explode at Greenbrier and Sims, but they could not find anything on the ground. At one point of the night it appeared to follow my friend and I to the gas station and back to our house. Every once and awhile I would go outside and check to see if it they were still there and they were, at about three am I walked outside and walked to were the lady said the light exploded at and I walked under the lights the were about from my point of view about 50' apart from each other but that's from my point of view underneath and I walked back home. About the time I had to go to work at five ten in the morning they were still there I continued to go to work when I came back at a few hours later there was no sign of them at all."],"Disposition":"Hoax","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","City":"St Paul","trends":["There have been 22 other sightings in St Paul","There were no other sightings in St Paul on or around March 30th 2010"],"Log Number":"US-03312010-0006","map":"<A HREF = \"http://maps.google.com/maps?q=44.959297,+-93.108779(22577)&iwloc=A&hl=en\"> mufon case (22577) map </A>","Region":"Minnesota","Longitude":"-93.108779","Viewing Distance":"Unknown","Tags":"City","Case Number":"22577","Sighting Duration":"07:10:18","Country":"United States","Object Features":"Undisclosed","Date Submitted":"03/31/2010 09:06 UTC","Source":"MUFON","Date of the Event":"03/30/2010 10:30 UTC"}