{"Sighting Duration":"Undisclosed","Longitude":"-87.163529","trends":["There have been 5 other sightings in Washington","There were no other sightings in Washington on or around March 24th 2010"],"Latitude":"38.662045","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsOn this date and others days also me and my son were on our way to work and we noticed 2 bright looking stars but they were moving on Hwy 257 heading to Otwell Indiana. I siad Wow Daniel look those aren't stars they are moving then they were changing colors red, green, blue, flashing lights. I started using my cell phone to zoom in on them and video them and one just in a bright light shot across the sky and was gone. The other in my zoom on my cell phone looked kinda round but oval and changing different colors then in a bright flash it was gone. We still don't know what we were watching but we have seen things like this before on that same road. We also saw a huge orange ball in Velpen Indiana that we thought was the sun coming up behind the trees but knew that was not what it could be because it was like 11:30 at night time. We first heard a low humming that was getting loud in the house and our dogs went nuts outside and then ran under our trailer. Thinking nothing of this I went back in and then heard the humming again outside only louder and went to the door and the orange ball was huge behind the tree line across our yard and you could hear some kind of loud humming noise the orange ball was bigger than a big barn!!!! It scared us so bad we went in locking doors and then the noise stopped and we finally looked out again and it was gone no where to be found, our neighbors in Velpen also witnessed this that night everyone was talking about it. This has been seen by people on more than one occassion there are things out there and we have seen plenty that just can't be explained what it was."],"Case Number":"22589","Region":"Indiana","Summary":"Looked like 2 stars at first multi colored.","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"03/24/2010 06:45 UTC","Disposition":"Insufficient Data","Date Submitted":"04/01/2010 12:58 UTC","Log Number":"US-04012010-0004","map":"<A HREF = \"http://maps.google.com/maps?q=38.662045,+-87.163529(22589)&iwloc=A&hl=en\"> mufon case (22589) map </A>","files":["/var/www/straped/mufon/html2text/22589.html.txt","/var/www/straped/mufon/org/22589.html"],"Source":"MUFON","City":"Washington","Country":"United States","Object Shape":"Oval, Sphere, Star-like","Object Features":"Undisclosed"}