{"files":["/var/www/straped/mufon/html2text/22585.html.txt","/var/www/straped/mufon/org/22585.html"],"Object Flight Path":"Hovering then path","City":"Carbon","Date of the Event":"03/31/2010 08:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.27188,+-98.825172(22585)&iwloc=A&hl=en\"> mufon case (22585) map </A>","Weather Factors":"Windy, Medium, Light","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsWe live on a farm not far from Hwy 6 and Carbon, Texas. My husband and I went out on the patio, facing the west, after dinner around 8:35 PM on Wednesday, March 31st. By the way we had lasagna, a salad and water, no alcohol. I was setting in a rocker facing the southwest, my husband was in a rocker facing the northwest. I was looking toward our pecan orchard directly to the south of us. All of a sudden I saw 5 bright amber colored orbs in the sky about 35 degrees above the horizon. They just appeared and stayed on steady and didn't move. They appeared to be overhead and just west of the city of Carbon almost 3 miles south of us. When they appeared it was like they came on in sequence, 1,2 3 4 5, real fast. The front light would go off as the back light would appear, but always 5 lights stayed on solid in a row. I told my husband, \"what the hell is that\" and when he saw my eyes and heard me he turned his head quickly to the south and he saw them too. We both got up out of our rockers and headed south into the lawn and stood there for a good minute or so watching these lights. He said that's not an airplane. I said it's not a meteor show either or a comet or a star. My mind was trying to process just what this was and if it was anything similar to anything I had ever seen before. There was no noise. The adrenilin was flowing and my heart was in my throat. I had never seen anything like this. I was scared. They were moving to the east. They would disappear for several seconds then reappear a little further east in a different formation almost like if you spread your fingers out on your hand and hold it up to the sky, there would be a large orb at each finger tip. They were large amber lights in the sky. They were not blinking lights, just solid lights that would appear and stay on solid, then all would disappear for a few seconds. They didn't move in a straight line. Each time they appeared they would be at a different level off the horizon from 10 to 35 degrees. I ran inside to get my camera while my husband stayed in the yard and continued to watch. While I as inside I called the sheriff's dispatch and reported it and ask if they had an officer in the area to ask him to look to the south toward Carbon to see if they could see it. I ran back out side and my husband said they had moved farther to the east and lower on the horizon maybe about 10 degrees. They looked like they were headed in the direction of Stephenville. We stood there for a good 15 minutes to see if they reappeared but they didn't. Sadly, I didn't get my camera in time. I was too in awe of this thing to leave to go inside and get it."],"Longitude":"-98.825172","Summary":"5 large amber orbs in a horizontal line about 35degrees above the horizon over Carbon, TX. Appeared out of nowhere, one after the other in sequence, i.e. 1,2 3 4 5 then stayed on steady, no blinking, then all went out. , then reappeared in diff form .","Log Number":"US-03312010-0014","Latitude":"32.27188","trends":["There have been 4 other sightings in Carbon","There were no other sightings in Carbon on or around March 31st 2010"],"Viewing Distance":"Over One Mile","Case Number":"22585","Date Submitted":"03/31/2010 11:40 UTC","Source":"MUFON","Region":"Texas","Object Shape":"Sphere","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed"}