{"files":["/var/www/straped/mufon/html2text/2258.html.txt","/var/www/straped/mufon/org/2258.html"],"Region":"California","Summary":"3 red lights","Log Number":"","Object Shape":"Undisclosed","Country":"United States","Viewing Distance":"Over One Mile","Tags":"City","Case Number":"2258","City":"Costa Mesa","Latitude":"33.641132","Sighting Duration":"00:30:00","Weather Factors":"Windy","divs":["Sighting DetailsMy wife and I were walking down the street from our church to our home. When wereached our next-door neighbors house I noticed three reddish-orange lights inthe sky. It was a clear night and I could see stars and these lights werereally out-of-place. When I first noticed them I asked my wife if she saw themand if she knew what they might be. I asked her because I immediately thoughtthat they were UFOs. I thought it was kind of cool because I never had seenanything like it before. I wasnt thinking aliens I was just thinking UFOs. Icould better show you the pattern that they were in on paper or if we wereface-to-face, but its kind of hard to explain. Finally they turned and headedover the ocean or they were already over the ocean and headed towards directocean. I had called my wifes parents and my youngest brother out to see it andthey all confirmed what my wife and I saw. They finally kept going until theywent out of sight. They never seemed to change altitude. Just direction. Finally my wife called the police to report them and to see if they had anyinfo. They said that they had recieved multiple reports regarding the lightsand that they were going to send a helicopter to see what they were, but theynever did. When my wife called back around 1100p.m or so they said that theywere waiting for a call requiring the helicopter instead of just sending it outjust for the lights. The sight happened originally around 730p.m."],"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.641132,+-117.918669(2258)&iwloc=A&hl=en\"> mufon case (2258) map </A>","Date of the Event":"04/26/2003 07:30 UTC","Longitude":"-117.918669","Source":"MUFON","Object Features":"Undisclosed","Disposition":"Unknown","trends":["There have been 17 other sightings in Costa Mesa","There were no other sightings in Costa Mesa on or around April 26th 2003"],"Date Submitted":"04/26/2003 07:30 UTC"}