{"Latitude":"33.813712","Log Number":"US-03312010-0011","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-85.761354","Date of the Event":"03/09/2010 06:30 UTC","Object Shape":"Cigar, Disc","City":"Jacksonville","Object Flight Path":"Stationary","Sighting Duration":"00:00:02","Summary":"I saw a metal object in the sky during a storm when lightning struck.","Case Number":"22582","divs":["sighting details i was driving home from the store at around 6:30 pm. it was very cloudy & dark out, with a storm coming on. as i was driving down highway 204, a bright flash of lightning brightened the whole sky and right in front & above me i saw what looked like a metal object in the sky. there were no lights on it, & it was silver in color. the lightning flash lasted about 2 seconds. after it was dark again, i didn't see anything, but i slowed down to see if i could see it again. lightning flashed again about 30 seconds later, but this time the object was gone. i'm positive about what i saw. it appeared to be cigar shaped, but it could have been a classic disk shape, with the middle being thicker than the ends. because i only saw it briefly, it didn't appear to be moving, just hovering. i didn't hear anything. i believe it was maybe about 1\\4 mile away, so it wasn't just a dot in the sky.it seemed pretty big to me. i was shocked. if it was a known aircraft, there would have been lights. i only saw it for about 2 seconds, but that image is burned into my mind."],"trends":["There have been 4 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around March 9th 2010"],"Country":"United States","Disposition":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/22582.html.txt","/var/www/straped/mufon/org/22582.html"],"Tags":"City","Region":"Alabama","Weather Factors":"Lightning, Light","map":"<A HREF = \"http://maps.google.com/maps?q=33.813712,+-85.761354(22582)&iwloc=A&hl=en\"> mufon case (22582) map </A>","Date Submitted":"03/31/2010 07:18 UTC","Source":"MUFON"}