{"map":"<A HREF = \"http://maps.google.com/maps?q=39.305241,+-85.216604(22598)&iwloc=A&hl=en\"> mufon case (22598) map </A>","Source":"MUFON","Case Number":"22598","Region":"Indiana","Summary":"Bright Flashes in the Sky Like Welder's Arc Over S.E. Indiana","trends":["There have been 3 other sightings in Batesville","There were no other sightings in Batesville on or around March 16th 2010"],"City":"Batesville","Viewing Distance":"Unknown","Longitude":"-85.216604","files":["/var/www/straped/mufon/html2text/22598.html.txt","/var/www/straped/mufon/org/22598.html"],"Tags":"City","Date Submitted":"04/01/2010 10:57 UTC","Log Number":"US-04012010-0012","divs":["sighting details this is a combination of a sighting report and commentary. i hope you will post this as i feel the need to convey this message. i made my 1st sighting report in oct. 4, 2008 which was in s.e. indiana after i overheard (later verified) police scanner traffic @ around 9:30pm regarding a blue flash n-ne from my location some 20 mi. perhaps. i imediately went outside to look and i saw a starlike object traverse the nw skyline for a few moments and turn a pinkish hue and dissapear over the horizon. about 2 weeks ago(can't pinpoint exact date around 03\\16\\10) in the morning hour i observed what appeared 3 (arc welder's) flashes in sequence of 3 in the ne sky. i can only compare this as looking like the sun glinting off a polished airliner or the above mentioned welder's arc. not sure what it was, there was a jet in the air towards the nw and that's what i was initially looking at when those flashes caught my eye in the ne sky. i can't be positive however, but they may have well been sun reflecting off some white geese(which flew over) for all i know. i am 52 yrs. old and have always had a curiousity, since about 10 yr. old, about the subject we refer to as ufo's. it wasn't until about 1 1\\2 ago that i began an intensive study of ufology. in my quest to learn as much as possible i realized i had to delve into practically every facet of human life, i.e; history,archeology,science,physics,economics, (exo-)politics,biblical,etc. the list goes on. for each subject i researched there is also someone famous for their discoveries, insights, research on that particular subject, to which is theorized(by some) correlates to an alien visitation that has occurred throughout human history for reasons of exploration, observation and \"yes\" perhaps even biological experimentation on us. i believe we have always been observed and not until technology advanced far enough to develope\\test the 1st atomic bomb , did they(aliens) begin to make themselves known in our skies near military bases housing bombs. i believe they have assisted us throughout humanity, steering us away from self destruction with much resistance on our behalf due to hatred and greed. i also believe that modern world governments\\unacknowledged shadow governments and secret societies have had knowledge of unearthly visitors since they were formed and this information is most valueable and sacred, but sightings and visitations have been recorded throughout human existence. i believe world governments are in limbo at this point in time on how to disclose what everyone has always wondered in the back of their minds....irregardless of the countless witnesses of unquestionable backrounds, in all levels of government, airline pilots, scientists who are willing to testify before congressional hearings regarding ufo's. however, disclosure would raise very serious issues on the part of our government that even the old excuse \"national security\" wouldn't hold up from a legal standpoint and would likely destroy credibility on the part of the u.s. creating distrust and perhaps chaos among the masses. i believe disemination- an extremely long game of sherades, has been applied to us through ancient art renderings, illustrations, cave drawings\\hyroglyphs to modern tv media and books since the 1st discovery of a ufo\\occupants by any world society at any point in history. disclosure will come at a cost, you can believe that. if it doesn't benefit those in control 100%, disclosure will not come from humans. after all, isn't that the only evidence you will believe....your own lying eyes. open your minds, it is the greatest story ever denied....it's the holy grail of humanity. i only hope i live long enough to bare witness to what would be \"revelation\" in it's truest sense. a monumental paradigm shift in human history."],"Latitude":"39.305241","Country":"United States","Date of the Event":"03/16/2010 08:30 UTC","Disposition":"Hoax","Object Shape":"Unknown","Sighting Duration":"00:00:03","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed"}