{"Weather Factors":"Windy, Medium, Light","files":["/var/www/straped/mufon/html2text/22597.html.txt","/var/www/straped/mufon/org/22597.html"],"Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"32.089663","City":"Dublin","Region":"Texas","Country":"United States","Object Features":"Unknown","Tags":"City","Log Number":"US-04012010-0011","divs":["Sighting DetailsMy son and I were driving home to Dublin from Cottonwood Baptist Church on Highway 6 at about 8:30 p.m. When we got about a mile outside of Dublin proper we noticed two blinking lights in the sky. They were blinking white and blue and were very subtle looking. Then they turned big and bright orange. They sat there for about 15 seconds then dimmed to the subtle flashing lights again. Then they turned the bright orange again. But this time just one of the orange lights had a stream of 5 or 6 lights come from it. Then those went out and the orange lights dimmed to the flashing lights again. They then began to speed across the sky and then more lights showed up. Once again they turned bright orange then dimmed and sped around then brightened again. Sometimes there would just be one light sometimes there would be several . . . as many as 4 or 5. Only one time did I hear a sound from them. It sounded like a jet had flown by but it came from the lights. After watching them for about 20 minutes doing this repeatedly I had to leave. But I came back about 10 minutes later with my son and daughter this time. We looked for them again but never saw them. While we were sitting there though two jets flew by at a very high rate of speed and within 5 minutes two more flew by. I do have pictures but have not been able to download them to my computer yet. They are still on my iphone."],"Case Number":"22597","map":"<A HREF = \"http://maps.google.com/maps?q=32.089663,+-98.332758(22597)&iwloc=A&hl=en\"> mufon case (22597) map </A>","Object Shape":"Unknown","Date Submitted":"04/01/2010 10:43 UTC","Summary":"Several blinking objects appeared then burst into larger orange lights then disappeared","Date of the Event":"03/31/2010 08:35 UTC","Longitude":"-98.332758","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 40 other sightings in Dublin","There were no other sightings in Dublin on or around March 31st 2010"],"Disposition":"IFO","Sighting Duration":"Undisclosed"}