{"Weather Factors":"Windy, Light","Summary":"Orange lights appeared...up to 5 ...in straight vertical lines...then 4 in horizontal lines...then in circles","Country":"United States","trends":["There have been 6 other sightings in Cross Plains","There were no other sightings in Cross Plains on or around March 31st 2010"],"Sighting Duration":"Undisclosed","Latitude":"32.130979","Longitude":"-99.157902","Disposition":"Unknown","Region":"Texas","Tags":"City","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=32.130979,+-99.157902(22599)&iwloc=A&hl=en\"> mufon case (22599) map </A>","City":"Cross Plains","files":["/var/www/straped/mufon/html2text/22599.html.txt","/var/www/straped/mufon/org/22599.html"],"Date Submitted":"04/01/2010 12:17 UTC","divs":["sighting detailslights appeared south east of my house in abilene texas...15 or so degress on the horizon putting them in callahan county around hgh 36 somewhere near the pecan bayou or eula area. i was sitting on my back porch when i first saw them at 8:30 on march 31'st. first i saw one light...then two lights...then 5 lined up in a straight vertical line...the next sighting they were 4 horizontal...each time they lasted just a few seconds...the whole event was just about minute and 1\\2. i got my wife to see witness them also...she saw up to 3 lights and then went back to her tv show...i told her to bring me some aluminum foil. i'm 57 years old lived around planes all my life...i can tell you the type of jet plane flying over by the engine noise and sound...i have seen flares, afterburners, lights...these i cannot explain. they were like little 'm' s or spheres and mostly orange...they had no comet tails...they did not move once they appeared. they did appear in different locations each time...but not too far from their last appearance. what got my attention was a plane was landing at abilene municipal airport when the object appeared behind the plane... i thought the plane might be in trouble and started to call 911 to report it...i watched and the plane went on to land but the lights were still appearing behind the plane...the aircraft landing was a probably a commercial flight coming from dfw. this is the second time i have seen the lights...first time i just blew it off...told my wife and she got a good laugh...not this time. fort hood is 180 miles southeast of abilene and i'm sure i could not see activity from where my house is...i have seen many dog fights from aircraft around lake brownwoood area but these were not afterburners or flares that are dropped to confuse heat sinking missles...i have seen those before at many air shows...they are like sparklers that drop in altitudes...these would just appear and disapper quickly."],"Object Features":"Undisclosed","Case Number":"22599","Source":"MUFON","Log Number":"US-04012010-0013","Date of the Event":"03/31/2010 08:30 UTC"}