{"map":"<A HREF = \"http://maps.google.com/maps?q=34.97708,+-105.022864(22592)&iwloc=A&hl=en\"> mufon case (22592) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"08/01/1997 10:00 UTC","Log Number":"US-04012010-0007","Date Submitted":"04/01/2010 01:36 UTC","Longitude":"-105.022864","Object Shape":"Square, Rectagular","Country":"United States","trends":[],"City":"Undisclosed","Latitude":"34.97708","Tags":"City","Source":"MUFON","Disposition":"Insufficient Data","Summary":"A large, seemingly dark object of unknown size but appeared to be larger than 3 football fields across. Had no reference. Just HUGE!!","divs":["sighting detailsafter my initial sighting with the object i was interested in knowing more. i made my husband and daughter sleep on the car port on the off chance that we would have a mutually shared sighting. i would stay awake and they would sleep and that was pretty much that. one late night in early august i got a feeling that i should open my eyes and i didn't want to, but was compelled to...and there it was. the night sky above me appeared as normal for that time of year, however, as i looked straight up above there was a big chunk of sky\\stars that were missing. instead of the stars above there was what appeared to be a darker than the night black\\grey something just moving slowly across the sky, making no sounds and it was huge! i can't say how huge because i had no frame of refernce...just that it was a darker than the night sky, silent and huge> i noticed after that, that there were lot's of aircraft whenever i thought, just thought, about this stuff. so i went outside just now and 2 aircrafts were deployed and cruised rt over this house. same thing used to happen when i lived in nm. i have proof that i have been in 2 places at once but also can traverse time in one episode."],"files":["/var/www/straped/mufon/html2text/22592.html.txt","/var/www/straped/mufon/org/22592.html"],"Object Features":"Undisclosed","Case Number":"22592","Region":"New Mexico","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown"}