{"Source":"MUFON","Date of the Event":"11/24/1999 12:00 UTC","Object Flight Path":"Undisclosed","Latitude":"41.255933","Weather Factors":"Unknown","Tags":"City","City":"Omaha","Disposition":"Unknown","Summary":"Large black triangle with gold lights/ then several gold discs.","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around November 24th 1999"],"files":["/var/www/straped/mufon/html2text/22594.html.txt","/var/www/straped/mufon/org/22594.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.255933,+-95.992348(22594)&iwloc=A&hl=en\"> mufon case (22594) map </A>","Object Features":"Undisclosed","Date Submitted":"04/01/2010 03:39 UTC","Region":"Nebraska","Viewing Distance":"Unknown","divs":["Sighting DetailsWell, I am not sure where to start. I will start by saying I was interested in ufos since I was about 13. I was pretty familiar with various types of reported ufos before this event happened. So anyway, here we go. I was having Thanksgiving dinner at my mothers house about ten years ago. I am not sure exactly what year it was.(I know that sounds sketchy, but I simply do not remember for sure if it was 1999 or 2000) I went outside in the backyard with my brother and a family friend to have a ciggarette. It was a full moon or near one so the small white clouds in the sky were illuminated. My brother and friend were near the backdoor and I had walked about 20 feet away into the yard. For some reason I happend to look up at a cloud just above the left side of the roof of the house from my perspective.(the cloud was about the size of my opended hand held out at arms length) Within a second or two I saw what looked like a black line in the middle of the cloud. As I stared at it it droped out of the cloud and rotated so that I could see it was a smokey-black colored triangle with gold lights on the underside of the tips. I should note when it did it seemed to be moving like it was \"floating\" and made no sound . I would guess it was about the size of a football field considering it was almost the size of the cloud it came thru. It was positioned just under the cloud with the moonlight shining on it. I immediatly recognized it from descriptions on tv programs and became terrified. My mind tried to rationalize it(I thought for a split second it might be a giant hanglider as ridiculous as that sounds) but after about ten seconds I realized what it was. I tried to say something but my brother and friend did not seem to get the point. They were talking to each other and standing under the back porch light. I yelled at them to get over here. Just then the object started moveing from the over the left side of the roof over to the right. As it did, it \"blinked\" into six or seven gold dics, in triangle formation,the same size as the solid object, but now I could see stars between them. Babbling, I ran to my friend, grabbed him by the jacket pulling him to back away from the house so he could see without the porchlight in the way. I pointed as it went behind another cloud. I demanded he tell me what he saw, so I would know I wasnt seeing things. He said he saw gold lights go behind a cloud. This was VERY important to me. I did not describe it as I was pulling him away from the house. It was my on the spot way of proving it to myself. I ran in the house jabbering about what I saw, while sketching it out with a crayon. I should note, the creepiest thing about it was the way it seemed to be \"hideing\" behind the clouds. I have never reported this event. I have told friends about it however. I KNOW I CANNOT PROVE IT, BUT I KNOW WHAT I SAW. For what its worth, seeing this has changed my life and my outlook on the world."],"Case Number":"22594","Longitude":"-95.992348","Object Shape":"Triangle","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-04012010-0009"}