{"Country":"United States","Object Features":"None, Other","Object Shape":"Fireball","Log Number":"US-04012010-0008","Case Number":"22593","Summary":"Orange, sun-sized sphere rolling slowly across the sky and trailing flames","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWhen I was approximately 6 years old, I lived near 136 Hickory Ln in Boone, North Carolina. (I just consulted Google Maps for the location and got that address from there.) My great grandmother, then approximately 78 years old, lived a couple blocks away from my house in a mobile home park, also on Hickory Ln. I would often walk down and spend the night with her in her trailer on weekend nights. One evening in either mid-to-late spring or summer (I remember that it was warm weather and the days were longer), I had just arrived at her trailer and she had come outside to greet me, when we both noticed an enormous orange or red-orange ball of fire rolling across the sky to the northwest. It was perfectly round and the size of the sun (maybe slightly smaller), but we had no idea how far away it was. It rolled very slowly across the sky, horizontally from right to left (from northeast to southwest), and was trailing orange flames behind it. The ball was engulfed in flames too and the \"rolling\" motion was very clear. If my memory serves, we also heard a deep roar coming from it. I remember watching it for as long as we could; it was at least a minute because it rolled very slowly. We were both saying to each other that we had never seen anything like it before and had no idea what it could be. It was eventually out of sight; I can't remember if it disappeared beyond the horizon or behind mountains. The time was near sunset but there was still a good amount of daylight. We were both shocked by the experience and went inside and continued to talk about it and what it could possibly have been. As the years went by, I remember telling the story many times to other kids at school. When I got older, the sheer strangeness of the event made me wonder if I hadn't just dreamed it. I asked my great grandmother about it in the mid-80s and she immediately recalled the event and remembered it exactly as I did. She is now deceased."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.222545,+-81.673492(22593)&iwloc=A&hl=en\"> mufon case (22593) map </A>","Date of the Event":"11/30/1973 07:00 UTC","Disposition":"Unknown","trends":["There have been 11 other sightings in Boone","There were no other sightings in Boone on or around November 30th 1973","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/22593.html.txt","/var/www/straped/mufon/more/22593_submitter_file1__fireball.PNG","/var/www/straped/mufon/org/22593.html"],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Boone","Sighting Duration":"Undisclosed","Date Submitted":"04/01/2010 03:30 UTC","Region":"North Carolina","Source":"MUFON","Longitude":"-81.673492","Latitude":"36.222545"}