{"Latitude":"33.544418","Object Features":"Other","Object Shape":"Sphere","Date Submitted":"01/31/1999 12:00 UTC","Region":"Punjab","Sighting Duration":"00:05:00","divs":["Sighting DetailsMy name is Bilal. My parents visited our home land Pakistan back in 1999 and tobring the experience back to me in the states they video taped almost everythingincluding to my surprise, me being an avid UFO fan, a footage of an UnidentifiedFlying Object. The UFO was unlike any I had ever seen on TV and I was not toosure if it was a UFO at all but after viewing the video a couple of times I wasconvinced that what I was looking at was not something you commonly see inPakistani sky92s or any sky in the world for that matter.The footage is not very long I believe its like 6 to 7 minutes the most. My dadtook the footage in a hurry becuase they My parents were about to go shoppingand my mother was getting impatient. Its taken in the evening and taped on avideo camera. It shows a bright object in the sky over the roof of our house youcan see the roof of the house the light in the shed of our garage and a creepernext to the shed. Then the camera zooms in to capture a bright white object witha ring of different hues changing quite rapidly, I am not sure if its because ofthe distance of the object or changes in the atmosphere but the most interestingthing I noticed as the camera is zooming in you can see a smaller orb flashingas it leaves the object to the right of the screen. You can hear my dad say thatthe object is unusually bright and that it92s going in and out on its own and that he sees some lights around it. Then ashe zooms out again you can see the same smaller flashing orb make its way backtowards the bigger orb. The UFO goes in and out a couple of times going from abright point to a burst of fuzzy light like in the Christoffer Walther footage,even the markings are similar with a nucleus center and a brighter outer ring,like a bright chandelier. One other thing that I noticed in my dads footage isthat the object seems to have a flat base at certain times like its not aperfect sphere and it does not seem to be grain in the footage but quite adeliberate shape change. At one point my dad leaves the house to goes out inthe street and you can hear neighborhood children in the back ground obliviousof the bright light in the sky because in Pakistan there is too much chaos onthe ground then for people to be concerned with objects in the sky unless"],"files":["/var/www/straped/mufon/html2text/2259.html.txt","/var/www/straped/mufon/org/2259.html"],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"01/31/1999 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.544418,+73.072342(2259)&iwloc=A&hl=en\"> mufon case (2259) map </A>","trends":["There have been no other sightings in Rawalpindi","This sighting has never been favorited."],"City":"Rawalpindi","Case Number":"2259","Summary":"UFO from Rawalpindi Pakistan","Longitude":"73.072342","Country":"Pakistan","Log Number":"","Disposition":"Unresolved","Tags":"City","Source":"MUFON","Object Flight Path":"Stationary"}