{"Longitude":"-81.967032","divs":["Sighting DetailsI remember it being a friday evening, as we always went to the property for the weekend, leaving shortly after I got off work. We were traveling north on county rd. 315 north of Ft. Mccoy. The road runs through thousands of acres of lumber company woodlands. There was no radio in my truck just the sound of the engine and tires on the road. My wife who was with me was fast asleep, as was her custom when things were quiet. It was just a few miles north of Ft. Mccoy, as the road made a very gradual right turn, that this object came to view. It passed me from the right. Paralleled the truck briefly then passed on to dissapear in the treetops along the road. I sped up to try to catch it, but abruptly veered more to the right and the trees hid it instantly I was traveling around 60 mph. when it passed. I would estimate it's speed at 80 to 90. The really strange things were the lights and the total lack of sound. One would reasonably expect an object 100ft. or so above you traveling 80-90 mph. to make some type of noise ( a whine or hum of some sort)but nothing but silence came from it. The lights were horizontally attached,(yellow, bright white and green) about in the center of it, Spaced about 10 ft. apart for it's full length, Which seemed to be 120-30 ft.in all. The diameter of it was 20-25 ft. (using the height of the trees for comparison) The shape resembled a thick stubby cigar. Each light was mounted on what seem to be a bump. Simillar to the headlights on 1940 vehicles in the way that they stick out. After the encounter, as I drove on, I thought it could be a blinp of some kind headed to a game or some type of event. As I went through the sighting in my mind, I realized that no blimp could have made an almost instant 90 degree turn as this had. Blimps can only (because of their shape) make slow gradual turns."],"Object Shape":"Cigar","Region":"Florida","Disposition":"Insufficient Data","Log Number":"US-04012010-0019","Tags":"City","Case Number":"22605","Summary":"Exterior lighted cigar shaped object passed vehicle at tree top level","files":["/var/www/straped/mufon/html2text/22605.html.txt","/var/www/straped/mufon/org/22605.html"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.364973,+-81.967032(22605)&iwloc=A&hl=en\"> mufon case (22605) map </A>","trends":["There have been no other sightings in Ft. McCoy","This sighting has never been favorited."],"Latitude":"29.364973","Date Submitted":"04/01/2010 04:34 UTC","Country":"United States","Source":"MUFON","City":"Ft. McCoy","Viewing Distance":"20 Feet or Less","Object Features":"Other","Object Flight Path":"Path with directional change","Date of the Event":"11/30/1981 07:00 UTC","Sighting Duration":"Undisclosed"}