{"Latitude":"36.164277","Disposition":"Unknown","City":"Greeneville","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 9 other sightings in Greeneville","There were no other sightings in Greeneville on or around March 31st 2010"],"Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["Sighting DetailsMy mom got home from work at UT hospital about 10:30 last night and there was a hitchhiker walking right by our house as she pulled in the driveway, and he asked her for a ride. He said he was going home and he lived near Johnny Martin's (not his real name but we'll call him Johnny)house. I know Johnny, but mom doesn't so she said she didn't know how to get there and she was extremely sleepy because she had only gotten about 45 minutes of sleep the night before, then had to go work another 12 hour shift. She politely declined his request to be driven home. As she came in the door, she told my family about him and how it's unusual to see a hitchhiker on our road. She told me where he lived and I said I knew Johnny. She said he had told her that he had been walking since Newport (about 30 miles) and was extremely tired, so I went with her to keep her safe and we gave him a ride (she didn't want to go alone for fear of him robbing her or harming her). We took him home and he showed us around for about an hour. As we walked out his door, I looked toward the Southeast horizon and saw a baby-blue (almost white) light that at first I thought was a star. I immediately realized it was moving and thought \"that must be an airplane.\" I judged its distance by observing its speed relative to distance and determined it to be about 2000 feet away. It soon went so low that it went below the treetops. I thought nothing of it then. It was not until much later after we had gotten home that I realize the way that object was flying was not like an airplane, and how could it land when the closest town is still 22 miles away and this thing was only about an estimated 2000 feet away? It was flying in a zig-zag pattern which is very unusual and I realized later that it was also completely silent. At a distance of around 2000 feet, any aircraft I know of would be easily heard. I didn't comment on it at the time I saw it since I thought it was just an airplane. This could be something easily explainable but I was unable to identify it."],"Object Shape":"Star-like","Object Features":"Undisclosed","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.164277,+-82.825336(22607)&iwloc=A&hl=en\"> mufon case (22607) map </A>","Source":"MUFON","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/22607.html.txt","/var/www/straped/mufon/org/22607.html"],"Longitude":"-82.825336","Tags":"City","Date of the Event":"03/31/2010 11:30 UTC","Case Number":"22607","Country":"United States","Summary":"Strange silent light seen moving slowly around 11:30 at night","Log Number":"US-04012010-0021","Date Submitted":"04/01/2010 10:46 UTC"}