{"Latitude":"41.979138","Viewing Distance":"Unknown","Case Number":"2260","map":"<A HREF = \"http://maps.google.com/maps?q=41.979138,+-90.055994(2260)&iwloc=A&hl=en\"> mufon case (2260) map </A>","Longitude":"-90.055994","Weather Factors":"Unknown","Summary":"labor day river sighting","Object Features":"Undisclosed","Country":"United States","trends":["There have been no other sightings in thomson,, savanna","This sighting has never been favorited."],"City":"thomson,, savanna","Disposition":"Unknown","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/2260.html.txt","/var/www/straped/mufon/org/2260.html"],"Date of the Event":"09/03/1999 10:30 UTC","divs":["Sighting Details On a friday night on Labor day weekend, my friend and I decided to visit my summer trailer and upon ariving at the location, we decided to grab a couple of beers and take a walk down to our dock on the mississippi river. While enjoying the evening and discussing what we were going to do that night, my friend got my attention and pointed to a red glowing object that was hovering above the river. I began to rationalize and looked upstream and recognized the radio tower in savanna, and tried to justify what i was seeing,,,the radio tower was a couple of miles away and tiny at best compared to the object we were fixated on. I started realizing that i wasnt sure of what i was witnessing,,and began telling my friend that no radio tower or bright light like we were seeing is natural to the area...The large object hovered silently in the air while i told my friend that the area that light was above was a man made island that was made when the river channels were widened..This man made island is about quarter to a half mile from our dock, and is so overgrown that no one except duck hunters will venture on the outskirts of the island. After rationalizing that this light wasnt a helicopter, wasnt the moon, and wasnt the light that acompanies barges and riverboats, the object began to rise about 100 to 200 feet no noise, just a steady glow...after a minute,,the object lowered behind or below the islands treeline, when it lowered beyond sight,,the glow in and around the area was completly gone, like a light bulb had shut of. My friend and I had the impression that what ever the object was,, was probably still there, but with its light turned off..it was to dark, and we werent about to chase it at night, and decided to go back in the morning to see whats back ther absolutly nothing but overgrown trees,,and lilly pads when we took our waverunners behind the island on the way to the main channel no place to land except a patch off water behind the island. After the sighting my friend and I walked up to our trailer and got ready to go out that evening. I told my dad what we had seen,,and was ready to tell others about my story. My friend and i went out and came back around 130a.m.,not really thinking about the ufo incident, and ready to have fun at the beach in the morning.upon falling asleep that i night,, I was awaken by my dad who was in my smallsingle bedroom in my trailer. he was calming me down..All that i remember wasthat i was screaming get them off me while i was sleepwalking on my bed, rippingposters down and banging on the wall...in a tr"],"Date Submitted":"09/03/1999 10:30 UTC","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"00:05:00","Log Number":"","Tags":"City","Region":"Illinois"}