{"Date Submitted":"04/02/2010 01:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.27947,+-79.935727(22616)&iwloc=A&hl=en\"> mufon case (22616) map </A>","Object Flight Path":"Stationary","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around November 30th 2008"],"Viewing Distance":"Unknown","Tags":"City","Disposition":"Unresolved","Log Number":"US-04022010-0003","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/22616.html.txt","/var/www/straped/mufon/org/22616.html"],"Case Number":"22616","Country":"United States","Date of the Event":"11/30/2008 10:00 UTC","Region":"Virginia","Longitude":"-79.935727","Weather Factors":"None","Latitude":"37.27947","Source":"MUFON","City":"Roanoke","Summary":"possible abduction, definate sighting, including marker memories","divs":["Sighting DetailsI was at home around 9-10:00 PM. I am an astronomy nut and a believer in aliens and UFOs so recently I had been watching the skies and had noticed several lights blinking various different colors, lights above the clouds, etcetc, for a few months, and had noticed some marks on my body that I had jokingly suggested were the results of an abduction. Of course nobody believed me but I was alright with that and I was pretty happy to just go outside when my mother asked me to bring out our dog and watch the lights. However, that particular night I noticed something different, there was a brighter light just above the roof of my apartment complex. Well, obviously I stood there and just stared at it for a minute trying to figure out what it might be, because I'd never seen anything like that before. It wasn't blinking, it was just staying stationary in the sky but was way too bright to be a star. For a minute I thought it could be Jupiter, though I had no idea whether or not I could see Jupiter from where I was at that time during the year because I had recently moved across the country. Then I thought, 'Hey, that could be a UFO, you should go get your camera!\" and rushed into the house in order to get it, left my dog there and ran back out to stand exactly where I had been before I stood there with my camera for maybe thirty seconds, and after that I don't consciously remember being approached by the object nor it getting any closer to me. I have this sort of unconscious memory, instead, like a marker memory, where the object grew big and bright until it filled up my entire vision and I couldn't see anything but this blinding light. I couldn't see any features. I closed my eyes because it got too bright for me to keep them open,a nd then when I opened them again, it was exactly where it had been in the sky. I was perfectly calm. I turned, walked back into my house, put down my camera, and tried to figure out what had happened. I looked at the clock, which I had checked just seconds before going out to take the picture, and found that ten minutes had passed. I was pretty calm about the entire ordeal, but after that I began noticing weird red marks on the insides of my elbows like needle marks and kept waking up with nosebleeds and getting weird pains in nose and sinus on one side. They continued for about a month and then stopped. I was calm about those, too, though I probably should have worried at that point, and for some reason felt almost like they were there for some important reason that I was vaguely aware of, but couldn't quite recall."],"Object Features":"Unknown","Sighting Duration":"00:10:00"}