{"Tags":"City","Latitude":"27.275833","Country":"United States","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/2261.html.txt","/var/www/straped/mufon/org/2261.html"],"Longitude":"-80.355","Log Number":"","Date of the Event":"03/31/1999 06:30 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=27.275833,+-80.355(2261)&iwloc=A&hl=en\"> mufon case (2261) map </A>","Summary":"bright lights in the sky","trends":["There have been 15 other sightings in Port St Lucie","There were no other sightings in Port St Lucie on or around March 31st 1999"],"City":"Port St Lucie","Object Shape":"Disc","divs":["Sighting DetailsI saw one or two UFOs from my house in Port Saint Lucie in 1999...I think thatwas the year. It was on an early April evening as two bright lights appeared inthe sky to the east. One of my childs friends pointed them out to me...I thoughtthey were spot lights from 2 police helicopters at first, but they didnt move,they remained stationary. I called for my wife, who was in the kitchen, to comeand see. But before she could get out to the street, the lights had folded inupon themselves in a shroud of mist or cloud like matter and disappeared. Itslike the lights slowly went out...first one, and then the other. Like a doorslowly closing on a brightly lit room. Later that evening it was reported on alocal news station by the meteoroligist that two strange lights had been seen inthe eastern sky simultaneously by many witnesses from Vero beach to Boca Raton.Therefore whatever it...or they were, both must have been tremendously largeobjects. He went on to say that no rocketlaunches had been made from the KennedySpace Center that day. I never heard another word about this incident from themedia...and have concluded that they were indeed UFOs. If anyone could offer alegitimate explanation, Like the local news station that reported it channel 25 I would be very grateful."],"Source":"MUFON","Object Flight Path":"Stationary","Object Features":"Undisclosed","Region":"Florida","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Case Number":"2261","Date Submitted":"03/31/1999 06:30 UTC"}