{"Object Flight Path":"Path with directional change,Path then hovering","Summary":"Multi-colored blinking rotating lights","Latitude":"39.556201","Object Features":"Unknown","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"04/02/2010 09:07 UTC","divs":["Sighting DetailsLast night I had to run out to my car because I parked too close to the garage. We live in Roxborough, so it is very dark here at night and we have a great view of the sky. Last night I noticed that something appeared strange. The stars in the sky seemed to be really blinking. At first I thought something was wrong with my eyes so I came inside and walked upstairs and looked back out the window. I was about ready to call to my wife to see it, when out of nowhere a multi-colored blinking object appeared in the distance. The lights on the object appeared to be rotating in a counter clockwise direction. The object seemed to have a very smooth and fluid motion like it was gliding through the sky. I could hear no noise coming from the object, yet it appeared to be only a few thousand feet above the ground. At this point I yelled to my wife and ran into the bedroom. We opened the blind and we both saw it together. She agreed that she had not ever seen anything like it. It was really cool to watch. As the object traveled east, it appeared that a few more of these objects also appeared. I am 30 years old, I own two businesses and I don't drink any alcohol, or use any drugs. I have always been very sceptical of this kind of stuff, but I am convinced this was not a plane. This was unlike anything I have ever seen. These things stayed visible for about 10-15 minutes and then they were gone. Please let me know if you have anyone else that saw this. Both my wife and I did, but then I ran outside because one of my neighbors had just returned from a flight and he had not seen anything."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.556201,+-105.780097(22618)&iwloc=A&hl=en\"> mufon case (22618) map </A>","Disposition":"Unknown","Log Number":"US-04022010-0005","City":"Undisclosed","Longitude":"-105.780097","Object Shape":"Circle","Country":"United States","Case Number":"22618","trends":[],"Region":"Colorado","Sighting Duration":"Undisclosed","Date of the Event":"04/01/2010 10:30 UTC","files":["/var/www/straped/mufon/html2text/22618.html.txt","/var/www/straped/mufon/org/22618.html"],"Source":"MUFON","Weather Factors":"Windy"}