{"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.701687,+-76.054667(22614)&iwloc=A&hl=en\"> mufon case (22614) map </A>","divs":["Sighting DetailsMy wife and I were outside earlier this evening, getting ready to take the trash can down to the street... when I noticed her looking up towards the sky. So I glanced up too. This was around 8pm or so, so it was already dark. I noticed right away what had caught her eye, and I started looking too. At first glance, this looked like a small group of geese flying in a triangular shape like they normally do during migration. I noticed each of the individual objects moving amongst themselves as the whole group traveled across the sky above us. I guess it kept my interest even more because these white colored objects were quite visible even in the dark, unlike a bird would be. And when have you ever seen birds migrating at night anyway? Then this triangular shaped group of objects started moving faster.. So I leaped down from the porch to watch them continue to move, but by the time I walked around the corner of the house, my wife said the entire thing vanished. Whatever it was, it moved that quickly. And absolutely no sound whatsoever. We both feel we're relatively intelligent, but neither of us can explain what we both saw. It was way to close to be a plane of any sort, and plus there was no sound. It definitely wasn't a weather balloon because it moved way to fast. It's four hours later and I still have no idea what it was."],"Log Number":"US-04022010-0001","Date Submitted":"04/02/2010 12:10 UTC","Longitude":"-76.054667","Region":"Maryland","Case Number":"22614","trends":["There have been 3 other sightings in Rising Sun","There were no other sightings in Rising Sun on or around April 1st 2010"],"Weather Factors":"None","Object Shape":"Boomerang","Summary":"boomerang shaped group of objects moving very quickly","Date of the Event":"04/01/2010 08:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","City":"Rising Sun","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/22614.html.txt","/var/www/straped/mufon/org/22614.html"],"Object Features":"None","Latitude":"39.701687","Source":"MUFON"}