{"Tags":"City","files":["/var/www/straped/mufon/html2text/22610.html.txt","/var/www/straped/mufon/org/22610.html"],"trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around March 29th 2010"],"divs":["Sighting DetailsAround 21:00 on March 29th, 2010, I took my two dogs out to do thier business before bed. As always I looked up to see whats going on in the sky. I saw the usual air traffic from DFW coiming and going. I did see somthing heading east that caught my eye. I saw a flash at first I thought it was another plane and it's FAA lights blinking off and on, but as I watched the object contunue to move to the East it split into two craft and went into different directions. One object went North and the other stayed on it's original path. The object heading North moved in an eratic pattern until I lost it in the haze. The second object move in steady pattern. The two objects were identical in size, shape and color. the shape was hard to determine due to the lack of light but if I had to guess it would be circiular. The weather was clear, breezy and hazy. The moon was out but not emitting alot of light. I see planes flying in the sky all the time coming and going to all the airports around the metroplex, but I've never seen anything like this before."],"Summary":"FLASH - RED LIGHT OBJECT SPLIT INTO 2 AND BOTH WENT INTO DIFFERENT DIRECTIONS","Latitude":"32.739287","Sighting Duration":"00:03:00","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Path with directional change","Country":"United States","Case Number":"22610","Object Shape":"Flash, Oval, Star-like","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.739287,+-97.106986(22610)&iwloc=A&hl=en\"> mufon case (22610) map </A>","City":"Arlington","Source":"MUFON","Date of the Event":"03/29/2010 09:02 UTC","Date Submitted":"04/01/2010 11:23 UTC","Weather Factors":"None","Longitude":"-97.106986","Object Features":"Unknown","Disposition":"Unknown","Log Number":"US-04012010-0024"}