{"Disposition":"Unknown","Source":"MUFON","Sighting Duration":"00:01:00","Longitude":"-94.040218","Tags":"City","Object Flight Path":"Straight-line path","City":"Texarkana","Case Number":"22615","Object Shape":"Triangle","Date of the Event":"03/31/2010 11:15 UTC","files":["/var/www/straped/mufon/html2text/22615.html.txt","/var/www/straped/mufon/org/22615.html"],"Region":"Texas","trends":["There have been 9 other sightings in Texarkana","There were no other sightings in Texarkana on or around March 31st 2010"],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/02/2010 01:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.431825,+-94.040218(22615)&iwloc=A&hl=en\"> mufon case (22615) map </A>","Summary":"three real bright lights in a triangle shape","Log Number":"US-04022010-0002","divs":["Sighting Detailsthe object was moving from the north to the south at a tremendous speed. it was not very high in the sky prob several hundred feet. there were no acq. lights blinking like an airplane..just the three bright lights in a triangle shape. I do believe it was a single object. as fast as it was moving there was no afterburner fire like a jet and there was no after noise as a plane would make. most of the planes here move from the west to the east. I called the local airport and they had already shut down their radar as had the airport in Shreveport, Louisiana. I called Barksdale AFB in Shreveport and i finally for a response and the officer who's name i didn't get told me that me that the base could neither confirm or deney my sighting. All i know is that the object was moving like a bat out of hell and there was no sound. I was out in the yard checking on a sick dog of mine. I noticed it because it is weird to see somthing flying from the north to the south here and at first i though it might be Careflight and i was wondering where it was going. It didn't scare me. I was excited to have seen it as it was the first flying object that I couldn't identify myself as I love planes and I know quite a lot about planes. I hope that it was the new F23 or a Stealth going to Barksdale, but of course they wouldn't tell me. I just wish the AFB would tell me that I actually did see something and they can't tell me what it was. As it is it is just my word against the world. I know i saw it; just wish someone would just tell me what it was or that they don't know what it was either. I'm more curius now, and I am going to watch the sky now even more that i have been. Thanks for having this site. Wish I had of had my phone camera with me. I will carry it with me all the time now. The part that really gets me is that there was no sound with it as it was moving so fast."],"Weather Factors":"Unknown","Latitude":"33.431825","Country":"United States"}