{"Tags":"City","Date of the Event":"04/01/2010 10:38 UTC","Source":"MUFON","Summary":"UFO Hovered Over Neighborhood, Helicopter Search Youtube Links Included","Longitude":"-80.646469","Disposition":"IFO","Country":"United States","City":"Youngstown","Sighting Duration":"Undisclosed","divs":["sighting detailshello mufon, my name is [cms\\tg\\pid]. i live in youngstown, ohio. i am an avid skywatcher and ufo researcher. last night during a skywatch, i filmed something very interesting. there was an apparent water main break down the street from where i was, it was very loud. so i kept looking in that direction. i saw through the trees a bright shiny gold star moving up and slowly above the trees in the neighborhood a few streets away. i honestly thought it was a satellite, but i filmed it anyway. the object clearly on film hovers for an extended time before very very slowly making it's way toward where i was standing. the sky was clear, the weather was about 55 degrees at that moment. i was initially filming under infrared night vision on my sony hdd dcr sr40 handycam. it records onto a hard disk drive, and there are no tapes or disks. as the object made it's way closer from east to west i shut off the infrared night vision and recorded under regular night vision. zoomin in on the object it appeared to be two square white strobing white lights. no faa red or green blinking lights, no nose light on the craft. i will be honest, the object did make a sound of a low airplane or jet sound when it passed over. the sound was strange and sounded muffled or distorted. the object flewover my vantage point and i tried to get it back into focus but could not. i did continue to film as it went out of sight. it gets stranger. exactly 10 minutes after the ufo flew over, a helicopter headed from south to east directly where the object originated from. it flew extremely low over the neighborhood. as a finale, a half hour later the same helicopter made another pass-by from east in a horizontal path directly over where the object came from. the helicopter was so low it was near even with the houses. youtube links: http:\\\\www.youtube.com\\watch?v=fesvcrbe4j8 http:\\\\www.youtube.com\\watch?v=t2y_dy1kkxw http:\\\\www.youtube.com\\watch?v=ua8xvaxo_2w"],"Region":"Ohio","files":["/var/www/straped/mufon/html2text/22620.html.txt","/var/www/straped/mufon/org/22620.html"],"Date Submitted":"04/02/2010 10:50 UTC","Case Number":"22620","Log Number":"US-04022010-0007","map":"<A HREF = \"http://maps.google.com/maps?q=41.10357,+-80.646469(22620)&iwloc=A&hl=en\"> mufon case (22620) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Star-like, Unknown","Object Flight Path":"Hovering then path","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around April 1st 2010"],"Latitude":"41.10357"}