{"Log Number":"US-04022010-0009","Object Flight Path":"Hovering then path","Summary":"Metalic/Large/lighted","Source":"MUFON","Country":"United States","Date Submitted":"04/02/2010 07:10 UTC","Weather Factors":"None","Latitude":"33.877094","Viewing Distance":"Over One Mile","City":"Corona","Date of the Event":"03/17/2009 07:50 UTC","Longitude":"-117.557808","map":"<A HREF = \"http://maps.google.com/maps?q=33.877094,+-117.557808(22622)&iwloc=A&hl=en\"> mufon case (22622) map </A>","Region":"California","Object Shape":"Disc, Oval","divs":["Sighting DetailsCorona, Ca UFO sighting - March 16th 2009, Myself and my Family witnessed a UFO; my Son was looking for the International Space Station that night as it was supposed to be visible around dusk. He stayed out there for a while and it got dark he did not see the ISS then he came in and went into his room upstairs for a while, he glanced out the window to take one last look to see if he could see the ISS and instead spotted a very small light making very strange patterns and darting at great speeds horizontally and vertically, he ran downstairs and went out the front door and was screaming a UFO. He called me out and I was like yea sure it's probably an airplane; I saw it and was in shock! I called my wife and other kids out and we were just standing there in amazement, after about 10 minutes of this I was thinking could I shoot this with my point and shoot still camera then I realized that I had bought my daughter a video camera for last Christmas, which she never uses, it was still in the box (dead battery, etc, etc) so I had to plug into the outlet on our porch for power and I started shooting, I had never used that camera before so I was figuring it out as I shot the footage. Also my daughter had been telling me for a few months now that she had seen a strange looking object several times and would come to get me, but by the time I got there it was gone. I have tried several times to upload sample images of UFO footage that was shot during the sighting to your website, but your system is not working. I am including a few stills from the footage taken, so you can see the craft we witnessed. I am telling you I have some incredible footage that rivals anything I have seen anywhere. I have approx. 6 minutes from the March 16th 2009 sighting showing the craft in great detail, shape shifting and flying in very strange patterns. Also the next morning my Wife was in our back yard and witnessed two (ALL BLACK NO MARKINGS) large twin rotor helicopters flying very low right over our home they circled what appeared just over our yard at least 5 times then flew off towards the north. We have kept a look out since then and have seen nothing."],"Sighting Duration":"Undisclosed","Object Features":"Dome","Tags":"City","files":["/var/www/straped/mufon/html2text/22622.html.txt","/var/www/straped/mufon/org/22622.html"],"Disposition":"IFO","trends":["There have been 36 other sightings in Corona","There were no other sightings in Corona on or around March 17th 2009","This sighting has never been favorited.",""],"Case Number":"22622"}