{"Region":"Nevada","Date of the Event":"03/29/2010 11:50 UTC","Log Number":"US-04032010-0005","Source":"MUFON","Date Submitted":"04/03/2010 08:26 UTC","City":"Las Vegas","Country":"United States","Tags":"City","Case Number":"22629","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around March 29th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=36.123776,+-115.166316(22629)&iwloc=A&hl=en\"> mufon case (22629) map </A>","files":["/var/www/straped/mufon/html2text/22629.html.txt","/var/www/straped/mufon/more/22629_submitter_file1__weird-stripe-in-sky-20100329-LAS-cropped.jpg","/var/www/straped/mufon/more/22629_submitter_file2__weird-stripe-in-sky-20100329-LAS-cropped-2.jpg","/var/www/straped/mufon/more/22629_submitter_file3__DSC01190.JPG","/var/www/straped/mufon/org/22629.html"],"Viewing Distance":"Unknown","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Disposition":"IFO","Summary":"Yellowish stripe directly above that didn't move as stars and moon did","divs":["Sighting DetailsI was staying at the Luxor on the southern side (in the pyramid, not the tower). Yes, the Luxor is the hotel with the giant vertical light beam that they turn on at night, but this was separate from that. Near midnight, I shut off all the lights to take some pictures of the surrounding lights from the hotel window. Just about directly above and far enough up that it appeared above the thin layer of clouds directly to the south of it (and visible with the stars in the attached pictures) was a small \"stripe\" in the sky about an inch long generally along a north-to-south axis. It also had a small interruption in it near the northern end of it. It didn't move over the course of an hour (as that's when I went to bed), and as the stars \"moved\" as the Earth rotated, the stripe stayed in the same spot relative the Earth. (It didn't \"move\" with the stars.) The ghosting in the attached picture is an artifact of the thick glass of the hotel and couldn't be avoided (unless I went outside, but that was 25 floors down and it was the middle of the night). I woke up at about 2:00 AM (tinkle time) and the \"stripe\" was still there, but was gone at 7:00 AM. It did not reappear the next night."],"Longitude":"-115.166316","Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Bullet, Missile","Latitude":"36.123776"}