{"Country":"United States","Tags":"City","Region":"Kentucky","trends":["There have been 3 other sightings in Liberty","There were no other sightings in Liberty on or around February 29th 1976"],"Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","City":"Liberty","Sighting Duration":"00:10:00","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.318406,+-84.939398(2262)&iwloc=A&hl=en\"> mufon case (2262) map </A>","Longitude":"-84.939398","Object Shape":"Disc","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/2262.html.txt","/var/www/straped/mufon/org/2262.html"],"Summary":"Contact","Weather Factors":"Unknown","Latitude":"37.318406","Case Number":"2262","Log Number":"","divs":["Sighting DetailsLiberty, Kentucky200am, one mile from home-two of us are in a carmobile.We see two bright lightstree top levelwest1000-1500away-moving Northward Were moving Southward. Westop, it stops. The object then changes direction Eastward towards us. We knewescapewould be impossible so we waited as this object slowly, gently floated towardus. Abreathtaking exp-combined with fear extreme excitment-and an forgien sensationasthis object came directly over our car. As previous discribed many small lightshad appeared in unision with the two brighter white lights. There was a very lowfluttering sound almost silentcoming from the craft-a lot like a bic lighter.Note: I was in the US Navy at this time-and-this was no earthly craft, espicallyso with the light colors discribed. We dont remember how the craft left-amystery till this day. Also, two months prior to this exp, one of the mostfamous abduction cases ever happened within 25 miles ofour location. See Stanford,Ky hwy 78 abduction of Mona Stafford and twoothers-either Jan 6th or 9th of 1976. There is a connection with ours and hers.Also,in the months afterwards-I experienced migrane headaches for the first timein my life, nightmares, and strange skin rashes. Today, none of these hardlybother me. Im certain something happened that night. Im willing to behypmotized to find out. Reply at your conveince, thanks. Also we never thoughtto check for a time loss that night. Kind reguards, Greg Cundiff E-mailsafari_roadhouse@hotmail.com"],"Source":"MUFON","Date of the Event":"02/29/1976 02:00 UTC","Date Submitted":"02/29/1976 02:00 UTC"}