{"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-04042010-0005","Object Features":"Unknown","Latitude":"36.975934","Case Number":"22638","Date of the Event":"03/30/2010 10:30 UTC","Weather Factors":"None","divs":["Sighting Details On the night of 03-30-10, my boyfriend and I experienced an event that we can only explain as being a UFO. My boyfriend had come to pick me up from my house at 21:00 so I could stay the night with him. We proceeded to watch television for one hour before we proceeded to go to his house which is the neighboring town. We drove down from the top of my hill until we were in front of our local high school. In the sky above the high school was gold looking light that we at first had thought was the North Star. We first ignored the light until we noticed it was slowly moving closer to the Earth. At this point we were freaking out because we thought it would make a crash collision with our little town. I personally along with my boyfriend could not take our eyes away from this strange light that kept getting brighter. My boyfriend and I first looked at it thinking it was in the shape of a body then with closer examination of staring at it longer I noticed it had bright rings around it. The light eventually stopped in mid air and began moving back father into the sky in a right aimed direction and eventually vanished. My boyfriend and I being skeptics can still not rap our mind around anything but the light had to be a UFO."],"Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/22638.html.txt","/var/www/straped/mufon/org/22638.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.975934,+-82.575711(22638)&iwloc=A&hl=en\"> mufon case (22638) map </A>","City":"Wise","Date Submitted":"04/04/2010 08:29 UTC","Summary":"Strange sighting in small town.","Object Shape":"Star-like","trends":["There have been no other sightings in Wise","This sighting has never been favorited."],"Region":"Virginia","Longitude":"-82.575711","Source":"MUFON","Object Flight Path":"Path with directional change"}