{"Longitude":"-98.596018","Object Features":"Unknown","Object Shape":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.904789,+-98.596018(22635)&iwloc=A&hl=en\"> mufon case (22635) map </A>","Region":"Texas","Latitude":"31.904789","Object Flight Path":"Stationary,Straight-line path","Disposition":"Unknown","Summary":"first, fairly high altitude small blinking lights, then, short-term bright yellow lights","Date of the Event":"03/31/2010 12:00 UTC","Case Number":"22635","Log Number":"US-04042010-0002","Sighting Duration":"Undisclosed","Weather Factors":"Windy, Medium, Light","Tags":"City","trends":["There have been 8 other sightings in Comanche","There were no other sightings in Comanche on or around March 31st 2010"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Source":"MUFON","divs":["Sighting DetailsI was driving a charter bus and was driving south and west between Proctor, TX and Comanche, TX. Large front windows with great views. I noticed one, at first, moving to my left up ahead(fairly low altitude but ahead of me)...small blinking lights similar to an aircraft...didn't pay much attention to it as it was typical looking, but, then...it suddenly gives off a brighter yellow light which only lasted about 10 seconds or less. I was driving pretty much straight in that direction. A few seconds pass...maybe 30 or so...I see another one, this time it was closer like I was driving under that same area as the first siting. I asked a passenger sitting in the front seat of the bus if he could see the lights as now 3 or 4 appear more directly overhead. The passenger gets up and moves to the front window and we discuss what we are observing. \"you know, this is the area where they saw those UFO's near Stephenville\" is part of the discussion. The last one I saw was so directly overhead that I had to lean forward and look practically straight up. I really could not discern altitude. I was thinking that a negative aspect of summer was all the bugs that hit auto's and bus windows and create quite the mess as the insect activity was picking up as the sun had only recently gone down. But, then...I began hearing \"popping\" noises like I was hitting large bugs or beetles on a regular basis...it got fairly intense, actually..but, I also could hear what I thought was the same \"popping\" noises hitting the roof of the bus. Bugs can't hit the roof of the bus..only the front when one is travelling 65 MPH or so...I ask my passenger if he can hear that \"popping\" sound on the roof ??...it was like a shower of something although there were insects hitting the window and front of the bus, also, so, it was difficult to verify what I was hearing. However, I was convinced I was driving directly under the (ufo) area and something was falling from the sky (nothing visible) only the popping noise as something was falling on the bus."],"City":"Comanche","Date Submitted":"04/04/2010 04:39 UTC","files":["/var/www/straped/mufon/html2text/22635.html.txt","/var/www/straped/mufon/org/22635.html"]}