{"Log Number":"","Region":"Alabama","Latitude":"33.102896","Country":"United States","City":"Calera","Object Shape":"Unknown","Sighting Duration":"00:00:59","Summary":"large orange object followed by four small strobe","Case Number":"2263","Date Submitted":"05/06/2003 08:30 UTC","Source":"MUFON","trends":["There have been 3 other sightings in Calera","There were no other sightings in Calera on or around May 6th 2003"],"Weather Factors":"Windy, Lightning, Light","map":"<A HREF = \"http://maps.google.com/maps?q=33.102896,+-86.753598(2263)&iwloc=A&hl=en\"> mufon case (2263) map </A>","Object Features":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"05/06/2003 08:30 UTC","divs":["Sighting Detailsbetween 8 and 9 pm just after a severe thunderstorm passed over the calera noaa radar station I was loading 50 ton trucks at the Chemlime plant in Calera Alabama. I just looked up to check on the weather and noticed a bright red to orange colored star light, very high up, but thought it was going into Birmingham airport. Then noticed 4 strobe light objects chasing it in a perfectly straight line toward Birmingham. I thought that they were military fighters chasing this bright star like object but they did not catch it as I could tell as the bright star like object went behind the high clouds north of me well over the city of Birmingham. I did not hear a sonic boom or see a vapor trail as it was night and you could of seen a trail if it had one, with lightning to the east. It gave me an eerie feeling just watching it for the 20 to 30 seconds that I observed it, then told my supervisor about it and he got out of his pick up and looked up toward Birmingham and saw the light as it went behind the high clouds. I had my digital camera with me , but It did not dawn on me to take the pictures as it was astonishing to watch. I brought my camera to work to take pictures of the bad weather and try to catch one of the tornadoes that we were having the last three days and nights."],"Viewing Distance":"Over One Mile","Longitude":"-86.753598","files":["/var/www/straped/mufon/html2text/2263.html.txt","/var/www/straped/mufon/org/2263.html"],"Tags":"City","Disposition":"Unknown"}