{"Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/22630.html.txt","/var/www/straped/mufon/org/22630.html"],"Date Submitted":"04/03/2010 10:22 UTC","Case Number":"22630","trends":["There have been 13 other sightings in Canton","There were no other sightings in Canton on or around April 3rd 2010"],"Object Shape":"Circle, Disc","City":"Canton","Log Number":"US-04032010-0006","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date of the Event":"04/03/2010 09:15 UTC","Tags":"City","Summary":"As we sat in the field the two silent circular objects flew over side by side at a low altitude.","Longitude":"-81.368677","divs":["Sighting DetailsAround 9 pm my brother and I went out into a field next to our home with binoculars to look at some stars and whatever else we could see. As we sat there all we were seeing were planes. After about 15 minutes I took my eyes away from the binoculars and two greyish objects flying from the SW caught my eye. I was expecting them to be plane or something like it, but about instantly I could tell they wernt. I said to my brother, \"Hey look at those\" as I pointed in their direction. I looked at them through the binoculars but could only see their shape with no details except some lines on the bottom. They were very low on a level of aircraft and were dead silent. They flew side by side in a straight line with a large gap inbetween. They got closer and I could see they were circular and had dark curved lines on the under side. There were no visible lights and the size of both was hard to tell, but if I had to estimate I would say they were 25 feet across. As we watched them we was amazed because we had never seen anything like it. They were visible for about 15 to 20 seconds as they flew to the NE. They went out of sight when they flew over the tops of some trees. My brother and I talked about what we saw and we seemed to describe them the same way. Afterwards we waited for another 15 minutes to see if more would show up, but nothing like it was seen again."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.803737,+-81.368677(22630)&iwloc=A&hl=en\"> mufon case (22630) map </A>","Latitude":"40.803737","Source":"MUFON","Weather Factors":"None","Region":"Ohio","Sighting Duration":"00:00:20"}