{"Latitude":"34.395666","Region":"California","Date of the Event":"03/27/2010 01:00 UTC","Sighting Duration":"02:00:00","Viewing Distance":"Over One Mile","Summary":"Brilliant Blue UFO with three levels of lights and one red light on top","files":["/var/www/straped/mufon/html2text/22632.html.txt","/var/www/straped/mufon/org/22632.html"],"Disposition":"Unknown","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around March 27th 2010"],"Object Flight Path":"Stationary","divs":["Sighting DetailsExtraordinary sighting with photo and video evidence. There has to be a rational explanation for this sighting. I'm sure there is. And I'm really curious to identify it. I'm in Valencia, CA. After midnight on March 27, 2010, I came upstairs and immediately noticed a blue light (like a huge glowing LED) emanating from outside the large window in the baby's room. Looking outside, I could clearly see three rows of brilliant blue lights hovering low to the ground over the mountains -- perhaps a mile away. I had an eerie sensation seeing this unidentified object, as I had never seen anything like it before. The mountains are free of houses or any man-made structures, so it was completely out of place and very prominent. I immediately ran to grab my Sony Cyber-shot. After taking a few pictures, I tried to take a video, but it was not very clear. So I ran downstairs and got my Panasonic DVX-100 and started filming with that. The video doesn't begin to do it justice, but at least it's something. You can see a blue-lit object just hovering there. From what I could make out, there were 3 rows of brilliant blue lights and one pulsating red light at the top in the middle. (You hear me describe this on the video.) There appeared to be slight movement or rotation, but I can't say that with any certainty. After the camera battery ran out, I watched the object for a few more minutes and then went back downstairs and tried to convince myself that there was a rational explanation. I came up fifteen minutes later and the object was still there. Went to bed soon after, so I'm not sure how much longer it stuck around. Kicking myself for not continuing to watch, but quite frankly, I couldn't quite believe what I was seeing. It was only the following morning when I reviewed the footage that it really began to sink in. (P.S. The event occurred at 12am, but I'm saying 1am because you have an error message that keeps coming back when I put in 12.) To be certain, I recorded video out the window at the same time the following two nights, but no lights appeared. I searched around online to see if anyone else reported a similar sighting. It looks like there were two other reports on or around March 27 -- one in Tracy, CA and one in Blue Lake, CA. Specifically, I believe both of those reports also cited the pulsating red light atop blue lights. I tried attaching a video and picture of the object, but keep getting an error message. (Please contact me and specify the format you need. Happy to provide original footage if it's helpful.) Would appreciate any info."],"Longitude":"-118.559469","Object Shape":"Cylinder","Object Features":"Undisclosed","Tags":"City","Source":"MUFON","Country":"United States","Date Submitted":"04/03/2010 11:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.395666,+-118.559469(22632)&iwloc=A&hl=en\"> mufon case (22632) map </A>","Case Number":"22632","Log Number":"US-04032010-0007","City":"Santa Clarita","Weather Factors":"Unknown"}