{"Object Flight Path":"Stationary,Other","Source":"MUFON","Latitude":"40.081912","Object Features":"Unknown","Date of the Event":"04/04/2010 08:55 UTC","files":["/var/www/straped/mufon/html2text/22641.html.txt","/var/www/straped/mufon/org/22641.html"],"Longitude":"-93.611397","Tags":"City","Object Shape":"Bullet, Missile, Flash, Oval, Star-like","Log Number":"US-04042010-0008","Sighting Duration":"00:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.081912,+-93.611397(22641)&iwloc=A&hl=en\"> mufon case (22641) map </A>","trends":["There has been one other sighting in Trenton","There were no other sightings in Trenton on or around April 4th 2010"],"Weather Factors":"Windy, Lightning, Light","Disposition":"Unknown","Region":"Missouri","divs":["Sighting DetailsI went to let my dog out to potty when i came outside i looked up at the sky to see what i thaught was a helicopter (hovering flashing lights)but i noticed it was to high up and hovered without movment for too long. When seeing this i called my stepdad to come out and look he agreed somthing wasnt right. We watched for some time when we watched the light fire a missle of light we watched in amazment as we seen the light missle strike another similar ball of light they threw light missles at one another for some time when finaly the new helicopter like light zig zaged back and forth and the light dissapered as if it had been destroyed. The first light stayed in place for some time until we went in the house for the phone to call our neighbors and when we came back out the light was gone. A incident similar happened in the town of Cameron, MO about an hour away in 1997 the next day a cow was found mutilated in a field and a large burned area near the cows corps police refused to get involved with the investigation so no report was made however a vet from my town did the autopsy and was shocked the cows insides were gone without a trace over night with now external damage (besides the head being decapitated and missing) the area were the cow died had turned black overnight after the animals removal. I recall chasing thoughs lights that night with my mother and father as a child it was about 9pm (dark out) and we seen what we thaught was a house fire in the country side however we never found a thing but heard that many others chased the fire in the sky as well and came up empty handed too. The next day we would here the same story i just told you. Im not sure if their is any relation but who know in this sleepy old country town."],"Summary":"Helicopter Like Lights Involved in Shootout","Case Number":"22641","Date Submitted":"04/04/2010 10:32 UTC","Country":"United States","Viewing Distance":"101-500 Feet","City":"Trenton"}