{"Latitude":"33.419134","Object Features":"Wings","Sighting Duration":"00:00:19","Source":"MUFON","divs":["Sighting Details On April 3, 2010 in Mesa, Arizona, I was outside watching for UFOs and I saw: 2 ball size objects (no lights)[object-1 and object-2], 1 possible satellite (dim light), 1 huge (blimp size) UFO (low altitude, no lights). During the late afternoon of the same day before the night event, I think I captured on camera an UFO at close range which is the reason why I decided to watch for them possibly occurring at night too. While watching at night, I spotted object-1 at an altitude height area typical of spotting either high altitude commercial jets or satellites. I had my camera set up on a tripod; however, this object came towards me from a high angle in the sky which thereby caused me to dismount the camera and take hand held pictures. While taking pictures of it, I saw with my eyes through the camera viewer it appearing to be perfectly spherical in shape, dullish gray color with a hint of black color. It did not appear to emit light; however, it did appear to reflect city ambient light. From my best estimates in size via experience with camera shots at that distance, I would estimate the size of object-1 similar in size to a large weather balloon size but not the shape of it. Viewing it with no camera but with eyes only: the object-1 appeared to be at a high altitude, traversed slowly typical of a satellite or drifting balloon heading East, barely noticeable in the sky until spotted, no audible sound were heard. Duration of object-1: 46 seconds starting at 20:41:31. Object-1 never changed in shape or in light intensity throughout the entire observation of it. Pictures were taken (no tripod); faint light can be seen upon adjustments of lighting in photo program. Object-2 similar to object-1. Heading: South East. Duration: 65 seconds starting at 20:55:58. Object-2 never changed in shape or in light intensity throughout the entire observation of it. Pictures were taken (no tripod); faint light can be seen upon adjustments of lighting in photo program. Object-3 (possible satellite) 5 pictures were taken with a camera on a tripod until object observation was lost upon readjustment of camera view. No enhancements required except via D-Lighting low. Light characteristic of 1 second exposure is not typical to any known jet or plane light pattern. Object-3 had a level flight coarse, but interpretation of light characteristic is unknown at this time. However from past observation of satellites with eyes only, object-3 appeared to be a satellite with minor fluctuation in light intensity. Duration: 16 seconds starting at 21:00:46 Object-4 (blimp size) was unquestionably an UFO of some sort in my opinion. I first noticed the unknown object within a 1 mile range with my eyes only. This object had no lights on it nor did the object emit any lights. The size of the object is comparable for that distant of being an extremely large commercial jet, or comparable in size to a large C-31 military transport jet, or comparable in size of a Goodyear blimp. It was almost unnoticeable while traveling except it almost stand out from the background scenery as a large and dark, elongated object traversing very slowly in speed which the speed is very comparable to a blimp speed. The altitude is estimated to be at the altitude of a blimp flying, or at the altitude of a landing-approach of commercial jet. I had a difficult time trying to locate object-4 with my eyes while trying to locate object-4 through the camera's viewfinder since the viewfinder on the camera has a darken filter. Once I was able to locate it on the camera, what I saw quite literally sent chills down my body as being startled but not frighten,; yet, I continue to take pictures of it with the remote. The object appeared to be a huge eye looking thing. It is possible that it might be a blimp because of it elongated shape, but I doubtful of that. At the ends points of the object, it appeared to come to a point similar to how our eyes come to a point at both ends. A blimp is more rounded at those ends. In the center of this object structure appeared to be a wavering, huge darken, circular-like mass area as in some similarities to the iris of a dark, color eye on a person. Outside the darken circular area but in the area that comes to a point, the color was of darken, yellowish color with maybe a hint of orange in it. While looking at it through the camera, it appeared to me to have a mean-like look which that part is what sent chills down me. I managed to take 4 pictures on the tripod before I completely lost sight of the UFO including searching with my eyes only. Only one pictures shows up with no enhancements required; plausibly, one of the search light from the light show that was taking place near my location possibly lit the object up which was pure luck for me. Duration: 19 seconds starting at 21:15:34. Pic-1 resembles (to some extent) the object which I saw through the camera's viewfinder. Further cropping and resizing (pic-2) shows something completely unknown and bizarre yet enlightening in features as to being unique. About 10 minutes later, a jet making the sounds similar to a fighter jet headed NW in direction towards the commercial airports but in opposite direction of the UFO's heading. I took 3 pictures of that jet. Now I know how all this sounds with \"light show\" and \"eye looking\" terms used; however, this event did take place, and this is not a concocted or exaggerated event. This is a true chronicle of the event and how it unfolded that night."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.419134,+-111.827962(22640)&iwloc=A&hl=en\"> mufon case (22640) map </A>","Date of the Event":"04/03/2010 09:15 UTC","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around April 3rd 2010","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","Log Number":"US-04042010-0007","City":"Mesa","Longitude":"-111.827962","files":["/var/www/straped/mufon/html2text/22640.html.txt","/var/www/straped/mufon/org/22640.html"],"Tags":"City","Disposition":"IFO","Object Shape":"Blimp, Cigar","Date Submitted":"04/04/2010 10:24 UTC","Summary":"Huge, blimp size, darken and stealthy object quietly and slowly traverse at low altitude.","Case Number":"22640","Region":"Arizona","Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Windy, Light"}