{"map":"<A HREF = \"http://maps.google.com/maps?q=35.093031,+-106.645037(22647)&iwloc=A&hl=en\"> mufon case (22647) map </A>","Case Number":"22647","Date of the Event":"04/03/2010 09:05 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22647.html.txt","/var/www/straped/mufon/more/22647_submitter_file1__ufo_3.jpg","/var/www/straped/mufon/org/22647.html"],"Region":"New Mexico","Latitude":"35.093031","Longitude":"-106.645037","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Features":"None","Object Shape":"Boomerang","Object Flight Path":"Straight-line path","Tags":"City","City":"Albuquerque","Country":"United States","Summary":"Bow-shaped object low in the sky","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around April 3rd 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsAbout 9:05, ****** and I were sitting on the patio when we saw something strange in the sky (see attached photoshop rendering). It passed by roughly south to north. It was low in the sky (mountain tops visible above it). It was visible for probably less than a minute before disappearing beyond the neighbor's trees. It made no sound. It was difficult to determine the size or altitude, but if it was about 3000' AGL (common altitude for airliners passing over our house), it was bigger than (and traveling slower than) an airliner. I have to think it was low, because if it was higher, it would have been huge! It was very dimly illuminated. In fact, it was difficult to see if you looked straight at it (center field vision is not good at night). It almost looked like it wasn't directly lighted, but might have been illuminated by reflection of the city lights. (Imagine the phosphorescent glow of a ship's wake on the ocean at night.) It had no navigation lights. Our house is just north of the Tijeras arroyo, between Tramway & Juan Tabo. The patio faces east, with a good view of the south end of the Sandias. We spend a lot of evenings on the patio skygazing. It is common for us to see aircraft (airliners, helicopters, Ospreys), satellites, weather balloons and shooting stars. This wasn't any of those."],"Disposition":"Insufficient Data","Log Number":"US-04052010-0005","Weather Factors":"None","Date Submitted":"04/05/2010 01:37 UTC"}