{"Case Number":"22644","Summary":"Not Provided","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.907452,+-105.953915(22644)&iwloc=A&hl=en\"> mufon case (22644) map </A>","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"IFO","Longitude":"-105.953915","Tags":"City","Date of the Event":"Unknown","divs":["Sighting DetailsMy brother was talking about stars that moved across the skys for months, but I just thought he was seeing an average satellite. Tonight he called me outside and said \"it was back\". We some skepticism, I took a look. What I saw was amazing. It was an amber colored light that looked like a star but it zipped, stopped, turned in right angles and back-tracked in the same approximate spot for around 30 minutes. It was still doing its little dance when I just went inside. I live near a Holloman Air Force Base (5 miles away) to be exact. A jet was flying into Holloman approaching from the NE, but the aircraft was clearly lower than the \"light\" and he was moving in a steady and slow direction. The \"light\" made movements that far surpassed this jet. It covered alot of space in seconds. It was very neat for the lack of better words. It was still there when I went in. I don't have a video camera, but I do have a very good 5 megapixel kodak digital at the ready. I wish you could have seen this. It might be back tomorrow, but my brother said this was the first time he has seen it in approximately 3 months. It was not a satellite.. I am sure of it. It was not a star. It was not a hoax, and it was not a meteor. It moved so erratically, it was something very cool to see."],"Viewing Distance":"Unknown","Latitude":"32.907452","Object Shape":"Unknown","trends":["There have been 16 other sightings in Alamogordo","There were no other sightings in Alamogordo on or around"],"Log Number":"US-04052010-0002","files":["/var/www/straped/mufon/html2text/22644.html.txt","/var/www/straped/mufon/org/22644.html"],"Region":"New Mexico","Date Submitted":"04/05/2010 12:24 UTC","Country":"United States","City":"Alamogordo","Object Features":"Undisclosed"}