{"Weather Factors":"None","Object Flight Path":"Undisclosed","Log Number":"US-04052010-0006","Object Shape":"Unknown","Disposition":"Unknown","Object Features":"Undisclosed","Tags":"City","Date of the Event":"05/31/2002 03:00 UTC","Region":"Florida","Latitude":"26.272262","trends":["There have been 18 other sightings in Coral Springs","There were no other sightings in Coral Springs on or around May 31st 2002"],"Viewing Distance":"Unknown","Country":"United States","Case Number":"22648","Sighting Duration":"Undisclosed","Longitude":"-80.269474","files":["/var/www/straped/mufon/html2text/22648.html.txt","/var/www/straped/mufon/org/22648.html"],"Date Submitted":"04/05/2010 02:01 UTC","Summary":"Near encounter.","map":"<A HREF = \"http://maps.google.com/maps?q=26.272262,+-80.269474(22648)&iwloc=A&hl=en\"> mufon case (22648) map </A>","City":"Coral Springs","Source":"MUFON","divs":["Sighting DetailsI was sleeping and woke up because my cat was meowing loudly, I woke up to find her going crazy around the room and running through the blinds. I stood up to walk to the sliding glass door to see why she was going crazy and why it there was such a bright orange glow coming from outside at 3 in the morning. At the same time that I was walking over, a strange electronical, whizzing noise passed by my small side window across the room and then by the sliding glass door, which was so strange for how close it sounded because my door is surround by a screened in outdoor porch. After I recovered from hearing the noise, and my cat still going crazy all around the room, I looked outside to see the lawn and my view of the sky from over my bushes and saw everything lit up with that orangey red glow. I ran out into the house to see if other people where up, I was shocked to see no one up, how could they not be? It was so bright out! I turned towards the windows to see if light was coming in and it was gone. I decided to tell this to someone once I saw a docudrama on tv about a guy who was visited by an alien and was awakened for the same reasons I was, minus the crazy cat of course. He got something implanted into his arm though, I'v have of course checked mine and I think I'm good. I hope this means something to you guys, I personally hope it never happens again."]}