{"Viewing Distance":"Over One Mile","City":"St Marys","Log Number":"US-04052010-0008","Summary":"Bright light in the night sky that changed colors and seemed stationary","files":["/var/www/straped/mufon/html2text/22650.html.txt","/var/www/straped/mufon/org/22650.html"],"Country":"United States","Date Submitted":"04/05/2010 09:36 UTC","Weather Factors":"Unknown","Latitude":"30.760979","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"04/04/2010 08:30 UTC","divs":["sighting detailsyoutube video: http:\\\\www.youtube.com\\watch?v=4-tuulds31q i was outside in my front yard talking on the phone with my dad when i noticed a 'star' over the western horizon near saint marys, georgia. i called my brother out to take a look at it and he thought it might be a star. i know sirius is the brightest star in the sky and pointed it out to him. this was easily 10 times as bright as sirius. there were no aircraft lights that we could see... just lots of 'twinkling' that you'd see in a star. i went inside and grabbed my video camera. the twinkling turned out to be pulsating lights that changed from blue to red. towards the end of the video the light is a solid red and blinks on and off. i would say from the time i noticed it until the time it escaped my view finder at a separate location was about 45 minutes total. if i had to guess the appx. location it would've been right on the fl\\ga border to the west of kingsland. it appeared to move steadily to the west, but at a very slow rate of speed. so much so that when we were watching it we thought it was stationary. also, shortly after spotting it, there were many aircrafts in the sky all at once which we thought was odd. i have no idea what this might have been but i'd like to know if anyone else had a better look at it, or what jax international airport (25 miles south on i-95) had on their radar. i have the video on youtube at: http:\\\\www.youtube.com\\watch?v=4-tuulds31q"],"Object Shape":"Unknown","Source":"MUFON","Case Number":"22650","map":"<A HREF = \"http://maps.google.com/maps?q=30.760979,+-81.562849(22650)&iwloc=A&hl=en\"> mufon case (22650) map </A>","Tags":"City","Longitude":"-81.562849","Disposition":"IFO","Object Flight Path":"Stationary,Straight-line path","trends":["There have been 3 other sightings in St Marys","There were no other sightings in St Marys on or around April 4th 2010"],"Region":"Georgia"}