{"Date Submitted":"04/05/2010 11:10 UTC","Weather Factors":"Unknown","Latitude":"28.547296","Log Number":"US-04052010-0017","divs":["sighting detailsshot 10-15 images of shuttle launch (digital images in raw file format) and in three, found off green object that appeared in only three images over a 3-second period of time. i did not notice this object with my naked eye. discovered the object when doing initial review\\post processing of the raw images in adobe photoshop cs4. i have not altered the images in any manner. i have copied them in their raw format only to label them \"shuttleplusa etc. i do not know the origin of this object or the source of the green light and i wanted your team to inspect\\review these three images to determine the spatial relationship between the ascending shuttle and the object. obviously, i am unable to make such a determination. the images were atpured using canin eos t2i digital camera, handeld, 70-300mm sigma lens (actually at 480mm after 1.6 factor applied) f\\5.6 at 1\\6th of a second. i submit these fyi and make no claim that they represent the sighting of a controlled object. it may somehting as simple and innocent as lights (starboard-green) from a commercial aircraft downrange of the ascending shuttle. or it may in fact, be a ufo. upon discovery of this object in three of my 10-15 images my initial reaction was \"this is extremely odd\" given the security of the air space in and around a shuttle launch area. i was also puzzled as to why this object only appeared in three of the 10-15 images. the order of the images, in capture order is - plusb 5:23:05 plus c 5:23:07 and plus a 5:23:08. the raw files have been attached. good luck. keep me posted please."],"Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Case Number":"22660","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/22660.html.txt","/var/www/straped/mufon/org/22660.html"],"Source":"MUFON","Date of the Event":"04/05/2010 05:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.547296,+-81.373106(22660)&iwloc=A&hl=en\"> mufon case (22660) map </A>","Country":"United States","Summary":"Shooting shuttle launch and in three of a number of images, caught UFO in/near ascending shuttle","Region":"Florida","Tags":"City","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around April 5th 2010","This sighting has never been favorited.",""],"Disposition":"IFO","Object Shape":"Circle, Unknown","Object Features":"Unknown","Longitude":"-81.373106","City":"Orlando"}