{"Longitude":"-95.929134","Latitude":"32.884289","City":"East Tawakoni","Region":"Texas","Object Shape":"Disc","Object Features":"Undisclosed","divs":["Sighting DetailsWe were on a weekend retreat at a home on Lake Tawakoni which is located about50 miles east of the DallasFt.Worth metroplex. It was 300am and there were onlynine of us sill awake outside sitting around the fire talking. None of us drinkor do drugs of any kind. The object was first noticed very high in the sky. Itwas moving slowly at first. One of us ran into the house to get the smalltelescope. By the time the telescope was ready the object was a little closerand stationary. I zoomed in on it with the telescope and was amazed at the sightof it. It was round and had a green thin outline of light that appeared to bemoving counter-clockwise. Just inside of that there was a white thin outline oflight moving clockwise. Inside of those was a myriad of different colors oflight all dancing about with no apparent pattern. Then the object decided tomove drastically. It instantly darted closer to us high above the lake andstayed there for a couple of minutes. Then it went directly above us around thesame altitude. The speed of it was incredible. It was in view for about 30minutes total. When it decided to leave it simply went. Just a flash of lighttoward the east. When I say flash I mean flash. We all thought the obvious-thatit was something not man made. How else could it have moved like that Witnessnumber 2 owns the home there Still does and weve not seen anything like thisbefore or since. Its been 12 years since this happened but in my mind its stillas clear as it was at the time of the incident."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.884289,+-95.929134(2266)&iwloc=A&hl=en\"> mufon case (2266) map </A>","Date Submitted":"07/31/1991 03:00 UTC","trends":["There have been no other sightings in East Tawakoni","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Object Flight Path":"Unknown","Date of the Event":"07/31/1991 03:00 UTC","Disposition":"Unknown","Country":"United States","Summary":"Circular Mobile Object","files":["/var/www/straped/mufon/html2text/2266.html.txt","/var/www/straped/mufon/org/2266.html"],"Case Number":"2266","Viewing Distance":"101-500 Feet","Source":"MUFON","Sighting Duration":"00:30:00","Tags":"City","Log Number":""}