{"Source":"MUFON","Latitude":"40.724283","Summary":"Object with at least 15 to 20 white and red lights, the size of at least 2 747's in length","City":"New York","Object Flight Path":"Hovering then path,Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around January 30th 2010"],"Disposition":"IFO","Region":"New York","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22665.html.txt","/var/www/straped/mufon/org/22665.html"],"Object Features":"Undisclosed","Log Number":"US-04062010-0004","Country":"United States","Case Number":"22665","Date of the Event":"01/30/2010 12:00 UTC","Longitude":"-74.002833","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.724283,+-74.002833(22665)&iwloc=A&hl=en\"> mufon case (22665) map </A>","divs":["Sighting DetailsI checked out a story on my cell phone that the moon was at it's biggest, so I went to the window to check out the moon, which was setting over NJ over the Hudson River from my perspective. I see planes taking off in the distance all the time from NJ, helicopters fly by all the time, but this was wierd and amazing at the same time. 1- A bunch of lights were coming in right under the moon, they were special because they were not only bright, but were sort of high definition, when I see plane lights they are not as bright and kind of fuzzy. This was extremely bright, and when they shined they shined with a triangular hi def, super clear shine, so it got me watching. 2- It was big and long, as it was coming in towards me towards the river, I realized it had to be as big as two 747's end to end at least. It came in with descent speed, and then slowed down, and hovered. That killed the some type of massive plane idea, and destroyed the some type of helicopter idea for two reasons. It hovered motionless for fifteen minutes, flashing it's lights in a few different sequences, pretty to watch, freaky to think what if it knew I was watching. It had way more lights than any plane or helicopter. 3- After the whole, then calming and nice, now spooky and wierd, light show, for fifteen minutes, it slowly started to move north. I mean slowly. The thing was inching, perfectly level, helicopters tilt, period. This thing was beautiful, didn't tilt, and had me so amazed, I freaked myself out for weeks. 4- It dissappeared behind my neighboring building, and I waited to see if it came back, I was feeling way to good for some reason, I mean I felt super calm, whatever. Maybe it was like a mosquito staring at a light, I don't know. wierd wierd ideas were going through my head, whatever. 5- While waiting about three to four minutes after it had dissappeared two helicopters flew in from the south, stopped exactly where the thing was, and they hovered there for about three minutes, and then flew back south. The two helicopters side by side were tiny in comparison. Remember this was after the helicopter and the plane crash fiasco, so radar must be very good. I now own an hd video camera just in case. Now I have to pay it off. :) I know taking pictures of something like this is rediculous, I bought my first camera after seeing a football shaped object over the world trade center in 1990, it hovered for 45 minutes, and got to check it out with my binoculars. That one had lots of little lights on it almost like a led display, but way brighter, with a matte black skin which absorbed light, that one sped up, zigzagged, and went straight up, wierd thing was it hovered right over wtc, for 45 minutes before that, both my brother and I were trying to guess what it was, it definitely was not a blimp, I've seen the blimps around here, they can't hover like these things can."],"Object Shape":"Disc, Other","Date Submitted":"04/06/2010 04:27 UTC"}