{"Latitude":"29.287747","Case Number":"22669","Object Shape":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"IFO","divs":["Sighting DetailsWe were enjoying Good Friday with family south of Yoakum, Texas. My husband and his son and our grandchild spotted what they thought was a vehicle traveling along the upper ridge of the property. Immediately we jumped into the car and went to see the object thinking it was a red vehicle. There was no vehicle in sight and there were no gates that a vehicle could have gone through....the \"vehicle\" dissappeared quickly and there were no signs of tire tracks ....after considering this scene I began to consider a ufo as I have been studying them for awhile now.... Another story: My father-in-law [long time deceased], early 1900's was walking home from hunting [late at nite]...he was approached by bright lights and was knocked out so to speak...when he awoke his eyebrows were burned and the hair on the dog that was with him hair was burned....the dog frightened, must have jumped across his lap and you could see the \"burned\" area on Mr. Barre's britches where the frightened dog laid across his legs during this encounter. This man was a very upright man in the community, never drank, and very well respected."],"Log Number":"US-04062010-0008","Object Features":"Undisclosed","Source":"MUFON","Longitude":"-97.151931","map":"<A HREF = \"http://maps.google.com/maps?q=29.287747,+-97.151931(22669)&iwloc=A&hl=en\"> mufon case (22669) map </A>","files":["/var/www/straped/mufon/html2text/22669.html.txt","/var/www/straped/mufon/org/22669.html"],"City":"Yoakum","Date of the Event":"04/02/2010 12:00 UTC","Region":"Texas","Date Submitted":"04/06/2010 09:00 UTC","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Yoakum","There were no other sightings in Yoakum on or around April 2nd 2010"],"Country":"United States","Summary":"We spotted an object that we thought was a vehicle...red in color, looked like a gas tank on back.","Tags":"City"}