{"Object Flight Path":"Stationary,Other","divs":["Sighting DetailsAt approximately 8:30-8:35 on the night of March 31st, I was driving south on Hwy 183 between Breckenridge and Cisco. I was in Eastland County about 6-7 miles northeast of Cisco when white lights appeared suddenly to my southeast and caught my attention. My view of the lights was somewhat obstructed, but the lights appeared to be stationary and in a wedge shaped formation (orientated as an inverted V or ^). They were located to the east of 183 and to the south of 112. After about two seconds the lights disappeared. I had traveled about another quarter of a mile when I saw a short flash of white light traveling upwards at an angle. My view was obstructed by trees. This light was very low to the ground, lasted for less than a second, and was almost directly to my east and closer to the highway. After I had gone a little further down the highway, a line of white lights appeared in the same relative position of where I had saw the wedge of lights. The lights came on simultaneously and went off simultaneously after about a second or two. They appeared to be stationary, in a perfectly straight line, and evenly spaced. My view of this line of lights was unobstructed. It is my opinion that this line of lights was the left side of the wedge. Over about the next mile, I saw a single white light appear twice, each time for about a second. I then saw three white lights appear simultaneously. They were stationary for about a second, then very quickly turned counterclockwise about a third of a turn and disappeared. These lights were almost directly east of my position and close to the highway. I have never before seen anything unexplainable. These lights were unexplainable. I had my cruise control set on about 66-67 mph and I did not speed up or slow down when I saw the lights. Looking back, I might have done things differently. But, if I had stopped or slowed down at any point I might not have saw everything that I did. I would say that utter disbelief was the prominent feeling that I had except I knew exactly what I was seeing. It took about an hour for my pulse rate to go back to normal. Please note that below I have checked that my contact information not be released to third parties. However, if it would be possible to remain anonymous and my identity kept confidential I may in the future consent to the release."],"Source":"MUFON","Country":"United States","trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around March 31st 2010"],"Date Submitted":"04/06/2010 03:49 UTC","Summary":"Northeast of Cisco, Texas, I witnessed various light phenomena for the duration of about three minutes as I was traveling on Hwy 183.","Region":"Texas","Log Number":"US-04062010-0003","Latitude":"32.397736","City":"Cisco","files":["/var/www/straped/mufon/html2text/22664.html.txt","/var/www/straped/mufon/org/22664.html"],"Weather Factors":"Windy, Medium, Light","Case Number":"22664","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.397736,+-98.975114(22664)&iwloc=A&hl=en\"> mufon case (22664) map </A>","Longitude":"-98.975114","Sighting Duration":"Undisclosed","Date of the Event":"03/31/2010 08:30 UTC","Object Shape":"Boomerang, Flash, Other","Disposition":"Unknown","Object Features":"Unknown"}