{"Region":"Massachusetts","Object Shape":"Circle, Sphere","Disposition":"IFO","Date of the Event":"04/06/2010 02:26 UTC","Country":"United States","Tags":"City","Log Number":"US-04062010-0006","Source":"MUFON","City":"Pittsfield","Sighting Duration":"Undisclosed","Date Submitted":"04/06/2010 05:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.451684,+-73.237762(22667)&iwloc=A&hl=en\"> mufon case (22667) map </A>","Summary":"darkish orange, not very bright. too slow to be shooting star and did NOT fade","Case Number":"22667","trends":["There have been 17 other sightings in Pittsfield","There were no other sightings in Pittsfield on or around April 6th 2010"],"files":["/var/www/straped/mufon/html2text/22667.html.txt","/var/www/straped/mufon/org/22667.html"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI am a 3rd shift security guard [at what used to be GE] in Pittsfield, Massachusetts. I was on my nightly security tour of the buildings, and not too long after I started I decided I was going to have a cigarette on the second floor roof. I was finished with my cigarette and decided to do a bit of star-gazing for a few minutes, and almost immediately as I looked up at the sky, a dark orange object caught my eye. It came from the south-west end of the sky, which I should add that from where I was standing the horizon was covered by another nearby building so i couldn't tell you if it came from behind the mountains, but was moving north-east in a straight line. I know my coordinates in every building only because I am required to when reporting \"discrepancies\", so I know for sure it was moving south-west to north-east. Being on 3rd shift for over a year and a half now, I have seen many shooting stars and know that every single shooting star I've seen was followed by a streak and was bright. I've even noticed a streak lingering in the sky immediatly after a shooting star has passed when I failed to see it before it had burned out, so there is absolutely no doubt in my mind that what I saw was NOT a shooting star - it was NOT bright and had NO tail. When I first saw the object, I initially thought it was a shooting star, until I noticed that it wouldn't fade away and was way too slow. While tracking it through the dark sky, I was following it with my head, and when I turned a street light sort of screwed up my night vision so I thought I saw it fade away. I lost sight of it for a good second, but sure enough, there it was again. I watched it for probably another good, long second or two until it went behind the mountain-line. The one thing in particular that stood out to me at first was its pace. I had never seen a shooting star move that slow nor a plane move that FAST. It went completely from one side of the sky to the other in about 5 seconds - if not less. Once it was out of sight, I had a second to re-think about what I just saw and that's when I felt the fear in the pit of my stomach make me almost feel ill. I actually almost felt like I needed to run away or cry or something, but under the fear was a lot of excitement as well because I have been a long-time believer in UFO's. So as for my reaction, I was very shaky and giddy at the same time. After calming my nerves for a few minutes (while still searching the skies to maybe see another) I called and woke up my girlfriend to tell her, and as it is she already has nightmares about aliens taking her off into space and harming her, so she wasn't too happy about me calling her at almost 2:30am to tell her that her worst fear just flew over my head. Last words: I wasnt paying attention to the time, but I just checked my cell phone and it says that I last called my girlfriend at 2:29am, so it must have been around 2:25 when I saw it. It was NOT a dot in the sky, it was too big to even look like a star. And I also feel like it wasn't traveling that high in the sky, maybe a few thousand feet, but that's just an estimation. It was a dim orange color, but I guess you could say it WAS illuminated or how else would I have seen it. No shape-shifting, no getting darker or brighter, and no changes of direction - just a straight line from point A to point B. p.s. I called the Pittsfield Police Dept. just to see if anyone else might have reported it, but nobody did.."],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Latitude":"42.451684","Object Features":"None","Longitude":"-73.237762","Weather Factors":"None"}