{"Latitude":"36.31076","Object Flight Path":"Other","Longitude":"-86.865936","Viewing Distance":"Unknown","Object Shape":"Square, Rectagular","City":"Nashville","Date of the Event":"03/16/2010 11:00 UTC","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around March 16th 2010"],"Disposition":"Unknown","divs":["Sighting DetailsLast week I was taking our dog out back to do his business when I happened to look up in the sky to my left over the woods in our backyard.. I noticed a peculiar cloud formation. A very flat and thin-shaped cloud. It was around 11 o'clock at night. There were no other clouds in the sky. I noticed a thin, horizontal white light moving near the bottom of the cloud parameter. It started moving very fast to the left , then back all the way to the right side of the cloud and kept making that course, back and forth. It never left the inside of the cloud. I took the dog back in and asked my wife to come out and look. She saw this also..Then there was another one and they started criss-crossing and moving up and down randomly at a pretty fast rate of speed.. I thought maybe something was reflecting in the cloud but it was night and there was obviously no sun and no moon was out. I looked for some sign of a light source from the ground like a spotlight but there were no beams coming up from the ground. I have spent many a night out there and never noticed anything like this before. Within minutes the whole cloud just disappeared before our eyes and the objects were gone also, with no trace of anything. Just a perfectly clear sky. I'm sure it can be explained logically, maybe some kind of gaseous phenomena, etc."],"Object Features":"None","Summary":"fast moving lights inside cloud formation","Case Number":"22678","files":["/var/www/straped/mufon/html2text/22678.html.txt","/var/www/straped/mufon/org/22678.html"],"Tags":"City","Region":"Tennessee","Date Submitted":"04/06/2010 09:54 UTC","Log Number":"US-04062010-0016","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.31076,+-86.865936(22678)&iwloc=A&hl=en\"> mufon case (22678) map </A>","Country":"United States","Source":"MUFON"}