{"Tags":"City","Country":"United States","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.328031,+-78.91287(22671)&iwloc=A&hl=en\"> mufon case (22671) map </A>","Date of the Event":"04/02/2010 12:00 UTC","Object Shape":"Diamond, Flash, Triangle, Other","Disposition":"Unknown","Case Number":"22671","Region":"Pennsylvania","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Johnstown","There were no other sightings in Johnstown on or around April 2nd 2010"],"divs":["sighting detailsaround 11:28 pm i was sitting in my sunroom. animals began to bark, chirp, whatever noise they make, their sound filled the area. i live on top one of the mountains so i have a great view down into the city and over to the horizon. high up in the sky i saw a strange electric cloud, it looked like a cloud shadowed the moon because it was very bright but the moon was nowhere around the area. i was facing south at the time and with the animals still going crazy, there appeared a three-pointed object with lights at each point. i am partially colorblind, but the colors seemed to look like greenish blue, or even a yellow purple, i really can't explain the color. i stared at object which seemed to appear over the horizon near the galleria mall \\ airport area. the object hovered for about 20 seconds, there were no blinking lights on it, so i knew it wasn't normal. it suddenly after 30-40 seconds disappeared into another cloud of what i can only explain as electricity. the cloud was amorphous and very jelly-fish like, long and whispy strings with a type of density. the animals stopped barking and the object then reappeared, closer to me than before. it moved very slowly from east to west then it stopped again then it started to move very fast past my field of vision. i ran through the house, out the front door and watched it fly quickly overhead towards the west. it made a strangely low humming noise and buzzed by me very quickly then it disappeared suddenly. i went back to the sunroom and sat down very confused."],"Date Submitted":"04/06/2010 12:15 UTC","Log Number":"US-04062010-0009","Object Flight Path":"Hovering then path","Object Features":"Undisclosed","Longitude":"-78.91287","Latitude":"40.328031","City":"Johnstown","Summary":"Cloud-Like appearance in the sky followed by a hovering triangle.","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22671.html.txt","/var/www/straped/mufon/org/22671.html"],"Source":"MUFON"}