{"Weather Factors":"None","Tags":"City","Object Flight Path":"Path with directional change","Date Submitted":"04/07/2010 07:37 UTC","trends":["There has been one other sighting in Roanoke Rapids","There was one other sighting in Roanoke Rapids on or around October 21st 1968"],"City":"Roanoke Rapids","files":["/var/www/straped/mufon/html2text/22685.html.txt","/var/www/straped/mufon/org/22685.html"],"Viewing Distance":"101-500 Feet","Case Number":"22685","Summary":"3 UFOs seen by multiple witnesses in 2 near-by towns on the same night investigated by AIR FORCE personnel from PROJECT BLUEBOOK.","Source":"MUFON","Longitude":"-77.646246","Date of the Event":"10/21/1968 12:00 UTC","Latitude":"36.46387","Sighting Duration":"Undisclosed","Region":"North Carolina","Country":"United States","Log Number":"US-04072010-0006","Object Shape":"Disc","Disposition":"Unknown","Object Features":"Dome","divs":["sighting detailst he story begins on the night of oct 21,1968. i went to a friends house,[cms\\tg\\pid], another documented witness, to visit. \"t\" had to find out which part of the sky the big dipper was in for [cms\\tg\\pid] high school latin class so after dark we went outside and walked about 50 yds to a large field used for farming which had a few singular trees on its border. i also was carrying \"t's\" yougest brother,about 3 yrs old, in my arms. it was an extremely clear,crisp fall night with unlimited visibility.we were standing on an old dirt farmpath facing south\\southwest when we both;i think at the same; shouted what in the hell is that? though the top of a thinnly leafed and branched tree about 40 yrds away was a brilliant white light with trailing red light which looked like a yo-yo on a string.the white light was large and very bright and very close the red moved very erradically.there was absolutly no sound coming from the objects we freaked..and ran out into the field for a better look. what we saw was the objects began to pulsate different colors red,green and ithink blue the colors would go from dim to bright without going out. i saw then that there were actually 3 objects with 1 in the front and two in the back-in a triangle-like geese fly.the objects then banked in a slow arc and started to head straight toward us-still silent-and moving only about 5 to 10 mph-very slow.the rate of flight speed remained constant throughout the sighting. the objects came directly over our heads-my estimate is they were about 300 ft high and 45 ft in diameter-but truthfully it is hard to judge size and distance on totally unknown craft in a totally clear night sky with no known point of reference-but they were close.when this happened i could see that the light source was on top of the crafts because you could see the bottoms of the crafts ccontrasted against the lights the bottoms were round-bowl shaped and looked as if they were made out of dark metal there were no other appendages or wings.the craft were heading back from the direction they had come from s\\sw.we really got very excited-the hair on the back of my neck and arms were standing up.we ran downthefarmpath about 75 yrds to another friends house-[cms\\tg\\pid]-who also witnessed the crafts pass over his house and until the crafts passed out of visual range. so it had been one hell of an exciting night in a small town aswe told our parents who didnt know what to think and that was that-so we thought.well 2 days later-oct.23-an article appearred on the front page of the daily herald ,a roanoke rapids newspaper,that [cms\\tg\\pid] of jackson,nc had seen a flying saucer along with other witnesses in the roanoke rapids area.a friend of my father who was from roanoke rapids told him of a man hunting on the roanoke river on oct21 when his boatmotor broke down.three unknown objects flew over him so low that the lights from the objects were reflecting off of him and the river,but he heard sounds like tin cans rattling which we didi not hear.then on oct 25-26 the us air force called then came to my parents home in jackson to question \"t\", \"h\" and i about the sighting. there were 3 of them-a major or col in uniform and 2 radar techs in jump suits from the roa.rap radar base.evidently they found out about us from the article in the paper.the officer was very peed off that we didnt report the incident when it happened.the officer then told us he was associated with project bluebook which we proceeded to answer the booklet questionaire.iasked 1 tech what was it that we saw and he replied orion which was bs then and is bs now....."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.46387,+-77.646246(22685)&iwloc=A&hl=en\"> mufon case (22685) map </A>"}