{"files":["/var/www/straped/mufon/html2text/22687.html.txt","/var/www/straped/mufon/org/22687.html"],"City":"Undisclosed","Viewing Distance":"21-100 Feet","Latitude":"40.425577","Country":"United States","Region":"Ohio","divs":["Sighting Details In the summer of 1973, Poland Township, Ohio, during the afternoon daylight hours a 12 year old child hears a very loud sound, similar to the rumble of a rocket engine. While reading a SGT Rock comic book, he hears shouting from ouside, that \"APollo\" is landing. Two children appx. 10 and 9 are outside playing basketball in the driveway. The child in the home races outside as the sound begins to fade. As the child exits the home, the object is now only a small speck moving awaty into the clouds. The 2 children outside were excited and ponting toward the shy. They had seen the craft very close above the back of the house and descibed the craft as an upright cone shaped metalic craft that was dented. It was descending and had multicolored lights and 3 landing legs with circular pods on the feet. The craft was coming down over the house, but it did not land. It quickly rose and disappeared in the clouds going in a Southward direction. It was a clear warm day, with no rain. There was no smell of exhaust or jet fuel and there was no visible smoke. The structure of the home had no visible damage to the roof or discoloration. The children were excited and thought it was an Apollo landing. It was described as appx. 20 Ft high and a silvery metalic with many dents along the structure. This rural suburb is outside Youngstown , Ohio and is appx 65 miles from Cleveland NASA, and 4-5 hrs from Dayton, Wright Patterson AFB. Nothing was ejected or found in the area around the home after the crafts departure. The craft was a cone shape that narrowed at the top, it did not contain visible external storage compartments or modules. It did not contain a ladder or identification nunbers or lettering. The craft did have observation ports or small windows. The area contained tall grass with wheat and corn fields. There were no bodies of water. There was no follow up or questioning by local police or officials. It has been 37 years after the sighting of this craft in Ohio. It was most likely a rocket based propulsion system, and a testing platform for a Lunar Lander that experianced navigation problems and had to descend for a potential landing. Perhaps the pilot even saw the children playing and decided to give them a memory. The craft was dented and most likely had problems in the past and may have struck trees. The craft did not have any stencils, numerals, or identifying symbols, but it did have the required flight lights."],"Log Number":"US-04072010-0008","trends":[],"Object Features":"Undisclosed","Date Submitted":"04/07/2010 10:47 UTC","Tags":"City","Object Flight Path":"Hovering then path","Weather Factors":"None","Summary":"Summer 1973, Poland, Ohio, daylight, a loud rocket sound is heard within house, 2 children see a metalic dented cone with lights and 3 landing feet with pads descending over home, descibed as \"Apollo\", craft rises quickly into clouds in Southern direction","Sighting Duration":"00:10:00","Date of the Event":"08/20/1973 07:00 UTC","Source":"MUFON","Longitude":"-82.904643","Case Number":"22687","Object Shape":"Cone","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.425577,+-82.904643(22687)&iwloc=A&hl=en\"> mufon case (22687) map </A>"}