{"Case Number":"22680","City":"Ventura","Country":"United States","Date Submitted":"04/07/2010 12:10 UTC","Object Features":"Unknown","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Boomerang, Egg, Flash, Star-like","Disposition":"IFO","Date of the Event":"04/06/2010 08:00 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/22680.html.txt","/var/www/straped/mufon/more/22680_submitter_file1__Picture1.png","/var/www/straped/mufon/more/22680_submitter_file2__turner.ufo.1.jpg","/var/www/straped/mufon/more/22680_submitter_file3__turner.ufo.3.jpg","/var/www/straped/mufon/org/22680.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.27843,+-119.224925(22680)&iwloc=A&hl=en\"> mufon case (22680) map </A>","Weather Factors":"Unknown","Log Number":"US-04072010-0001","Latitude":"34.27843","Sighting Duration":"08:00:00","trends":["There have been 17 other sightings in Ventura","There were no other sightings in Ventura on or around April 6th 2010","This sighting has never been favorited.",""],"Summary":"Lights seen and video taped for past 3 weeks, very colorful, strange movement, taped dropping light out bottom.","divs":["Sighting DetailsDriven by intuition I've been seeing and video taping UFO's over the city in all directions for the past 3 weeks. I have been woken up to horn like tones coming from two different directions, lasting for hours, and filmed them moving, then stopping, and then moving again. I have also filmed them dropping lights out the bottom and spinning around the sides. I am a photography student, and have been shooting all this footage on the Canon 5D Mark II, these files are great quality, and for the most part are shot on a tripod. The lights can be seen traveling a great path in the sky. I didn't have my camera on me, but friday night I saw the lights in Camarillo, there were 2 strange ones slowly flying over the city, then I spotted a large light soon a huge craft that looked like a sideways boomerang flew over the car very low, like 200 feet, later I saw a craft with weird pulsating lights over the Pacific Mall in Ventura, as I traveled towards seaward looking back the light was the same height from a different direction, about 100 feet up. Some friends at school saw a blue green flash in ventura as they were coming into town over the grade. They saw 3 more flashes around them as they pulled into their neighborhood, the power went out after each of them, the last one was followed by a bang and humming, the wind then went crazy. The first image I'm including is a screen grab from one of my videos, the next two are of a 2.5 second exposure, the cropped in version shows one of four lights revealing a necklace type pattern in the sky. A weird path to travel in 2.5 seconds, with the camera on a timer, on a tripod. I have seen so many of these that I am growing tired of filming them. Please feel free to look through my footage, there is a lot of it, and I do not have the time to look through it all. Each one has a gem of weird actions in it. They will be out tonight."],"Longitude":"-119.224925","Source":"MUFON","Region":"California"}