{"Disposition":"Unknown","Date Submitted":"04/07/2010 02:13 UTC","Summary":"4 red/orange lights in shape of square S.CA.","Case Number":"22683","divs":["sighting detailsmy family and i were driving down from los angeles, back home to san diego, when around 8:30pm (april 6,2010) driving down i-5 prior to getting to san clemente, maybe in the laguna hills area i notice 4 bright orange lights in the low southern sky. knowing that the lights could not have been street lamps, because of the brightness of them, i brought it to the attention of my family. my father in law looked up and noticed them immediately and tried to get his video camera setup, however by that time we had lost sight of the lights. i tried to maneuver around traffic to get a better shot on them, but it appeared that one of them started sinking faster behind another. at this time we lost total sighting of them as they dropped down behind a hill ahead of us. we continued to travel south on i-5 to see if we could get another glimpse, but unfortunately we could not see them anymore. from where we were i would say they appeared to be directly south maybe above the nuclear power center just south of san clemente (possibly north of there) or out above northern camp pendalton. really hard to judge as it was dark, but these lights had to have been seen by many people. (as i did see this event already reported by another poster.) my wife, daughter, father in law, and i tried to debunk this as being possible helicopters or bright street lights which might have confused us as to their height in the sky. but we just could not find a conclusion to it. especially when we saw the one light drop out of the sky a bit faster than the others. could have been flares...? maybe, but the uniformity of the other 3 lights made this seem like they were in some sort of constant movement\\formation. my daughter was quite shaken and scared, but my father in law and i were very curious and rushed home to see if we could find on the internet or on the news of any other sightings. and as the other poster stated there was quite a bit of traffic and more people had to have seen this."],"Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"33.430933","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.430933,+-117.609392(22683)&iwloc=A&hl=en\"> mufon case (22683) map </A>","files":["/var/www/straped/mufon/html2text/22683.html.txt","/var/www/straped/mufon/org/22683.html"],"Viewing Distance":"Over One Mile","Object Features":"Unknown","Log Number":"US-04072010-0004","Date of the Event":"04/06/2010 08:30 UTC","Region":"California","City":"San Clemente","Longitude":"-117.609392","Object Shape":"Circle, Fireball, Square, Rectagular","trends":["There have been 15 other sightings in San Clemente","There were no other sightings in San Clemente on or around April 6th 2010"],"Country":"United States"}