{"Tags":"City","Summary":"Strange light pattern above south Orange County sky","Object Features":"Unknown","Object Shape":"Square, Rectagular, Star-like","Object Flight Path":"Unknown","divs":["sighting detailsmy wife and i were driving south on i-5 around 8:45-8:50pm when we saw 4 yellowish lights in a rectangular\\parallelogram shape above the southern horizon. going south on i-5 around bake pkwy, they were about the location of the home savings \\ wamu building, but a bit higher above the horizon from where the roof of the building would be. the lights were about the color and glowing nature of a street lamp (sodium vapor) but they were in a shape and location that we had never seen before, since we both grew up in the area and i make this drive home on the same stretch of freeway on a nightly basis. as we drove further south, about the time we got past el toro road, one of the lights faded out, and as we passed alicia parkway, the other three faded out. we continued down the freeway to see if we could identify what caused the lights, but we were unable to do so. we were a bit startled, since neither of us has seen things like this before. i asked my wife what she would have said if i came home and told her what i saw, and her response was \"i'd call you crazy, seeing your 'black helicopters' again\", a reference to might slight paranoia as a child after an over-enthusiastic experience with the x files. she was a little shaken, but i'm sure someone closer to the light source would have a better view of whatever it was. the freeway had a decent number of people on it, and we couldn't have been the only ones to notice there being lights where there aren't normally lights like these. hopefully someone further south could shed some light on the subject!"],"Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.663094,+-117.63495(22681)&iwloc=A&hl=en\"> mufon case (22681) map </A>","files":["/var/www/straped/mufon/html2text/22681.html.txt","/var/www/straped/mufon/org/22681.html"],"Log Number":"US-04072010-0002","City":"Mission Viejo","Region":"California","Date Submitted":"04/07/2010 12:43 UTC","Source":"MUFON","Date of the Event":"04/06/2010 08:50 UTC","Disposition":"Unknown","Longitude":"-117.63495","trends":["There have been 10 other sightings in Mission Viejo","There were no other sightings in Mission Viejo on or around April 6th 2010"],"Latitude":"33.663094","Case Number":"22681","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}