{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/22682.html.txt","/var/www/straped/mufon/more/22682_submitter_file1__IMG_0733.JPG","/var/www/straped/mufon/more/22682_submitter_file2__IMG_0739.JPG","/var/www/straped/mufon/more/22682_submitter_file3__IMG_0745.JPG","/var/www/straped/mufon/org/22682.html"],"Viewing Distance":"Unknown","Object Shape":"Circle, Disc, Oval, Other, Unknown","City":"San Diego","Object Flight Path":"Undisclosed","Log Number":"US-04072010-0003","Case Number":"22682","Longitude":"-117.150055","Disposition":"Insufficient Data","Summary":"Minding my business.","divs":["Sighting DetailsI was riding passenger with a friend in a Honda Civic with a sunroof. I had recently purchased my new camera and I love taking photos of anything I see. I was taking pictures while my friend was driving. We were going South, heading East towards Mission Valley. I saw something black in the sky near the clouds. I knew it wasn't a jet, plane, helicopter, and was nowhere near the flight path of the airport. It never occured to me to stop taking pictures but only to keep taking pictures of what I saw as we traveled. The day was partly cloudy and the weather was beautiful. As we went from one freeway to another I opened up the sunroof and kept shooting as best as I could and zoomed in as best as I could to try and get a better image of what floated in the air for a while not moving in any direction even though the clouds moved freely east from the coast which was only a few miles away. The object shined every so often. The object hovered without any sound. It also looked as if it was very light. There was nothing attached to it. There was only one. As we drove I felt as if I were taking pictures of something no one else might have seen at that time. I only wanted to get a good shot of what was hovering so high in the air, but still can not identify what it was. After finally looking to the sky once again to capture it once more, it was gone. There was nothing anywhere else in the sky that I could identify as the object anywhere I looked. I have more pictures than allowed to upload and have sent them to this site as well."],"Object Features":"Undisclosed","Region":"California","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around April 8th 2008","This sighting has never been favorited.",""],"Date Submitted":"04/07/2010 02:03 UTC","Country":"United States","Date of the Event":"04/08/2008 12:00 UTC","Latitude":"32.724579","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.724579,+-117.150055(22682)&iwloc=A&hl=en\"> mufon case (22682) map </A>","Weather Factors":"Unknown"}