{"Region":"Arizona","Case Number":"22690","Date Submitted":"04/07/2010 02:27 UTC","City":"Phoenix","files":["/var/www/straped/mufon/html2text/22690.html.txt","/var/www/straped/mufon/more/22690_submitter_file1__Balloflight_wholepicture.JPG","/var/www/straped/mufon/more/22690_submitter_file2__Balloflight_zoomto100percent.JPG","/var/www/straped/mufon/org/22690.html"],"Object Shape":"Sphere","Object Flight Path":"Straight-line path","Longitude":"-112.067597","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around April 7th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Summary":"Basketball size Sphere or a globe of bright light.. Solid and round, not just light itself.","Source":"MUFON","Date of the Event":"04/07/2010 05:29 UTC","Sighting Duration":"00:03:00","Tags":"City","Log Number":"US-04072010-0011","map":"<A HREF = \"http://maps.google.com/maps?q=33.452897,+-112.067597(22690)&iwloc=A&hl=en\"> mufon case (22690) map </A>","Latitude":"33.452897","divs":["Sighting DetailsApril 7, 2010 Mesa, Arizona. Time: 05:25 or 5:25AM Cold (60F), clear skies, star still showing, dawn coming. No wind. Sighting lasted roughly less than 3 minutes. Basketball size object I was outside smoking a cigarette and drinking a cup of coffee while looking out towards the sky when I saw coming from the West a solid, round and pure light about the size of a small basketball. At first, I thought that it might be a plane; however, this also looked very similar to what I saw back in April of 2003. Thinking that maybe it was just a plane but possibly that ball of light, I continue to watch it. I first spotted it about a mile or two away from me. It was at an altitude of about 100 feet. It was still twilights (stars could still be seen) and the sun was still below the horizon. I kept watching that the ball of light thinking. \"My how familiar that looks. Probably plane's light?\" I kept looking to see if there was any change in the light such as flickering, and I was listening for any kind of sounds of a plane, but I didn't hear no sounds. Just when the ball of light was just upon me of almost 100 feet away, I realize that this was no plane or jet except only one thing, and one thing only! It was that ball of light that I saw back in April of 2003! The first thing I thought, \"Now here is my chance to get that picture of that ball of light which I couldn't get back in April 2003, and to see finally what that ball of light really is by zooming on it with the 300mm adjustable telescopic lens. Maybe there some structure in it or around it that I can't see with just my eyes.\" I ran inside the house, grabbed my camera, check the settings on the camera to make sure it was on night mode, then I ran back outside onto my porch. Then I zoomed onto the ball of light, and I focus the lens manually, then I began taking pictures. I wanted to get every possible pictures I could get until I could no longer see the ball of light, or until I was no longer able to follow it. I took many pictures from the porch until the ball of light object started to get out of my view because of tree branches. I then ran through the house with my camera still in hand. I came to spot in the middle of a sidewalk, and I began taking many closes up pictures, and I zoomed out once or twice for size comparison. Thankfully, there was enough light out during the dawn hours which I was hoping that the shutter wouldn't take too long to close. But at the time, I thinking the shutter was taking to long to close. I wanted a whole bunch of pictures, but the camera was just taking too long for each picture shot. There was a couple of times when a tree branch was almost blocking a clear shot of it, so I move over slightly to a different spot in order to get a clear shot of the ball of light. I just kept taking pictures hoping I was focusing the lens clearly so the pictures wouldn't turn out fuzzy. I was also thinking , \"Do I have enough time to set up the tripod?\" I quickly decided against that idea. I was also going to use the auto-focus, but I decided against that because it is unreliable in a quick situation which it takes up valuable time. [From camera experience taking pictures at night.] Any pictures of that ball of light UFO was better than no pictures, and I wanted all the pictures of it as I could possibly get of it. Eventually, a big tree got in the way of me seeing it, and it seem that the ball of light was just getting dimmer and dimmer as it travel away from me (smaller in size too.) Possibly, because of the direction the ball of light took was near in direction where the sun would eventually come up. I moved over to a spot where I thought where it might pass through an open area to view it which the ball of light should not had taken too long for it to reach that area. But I never did see it after waiting for it about a minute. At that moment, I thought \"maybe it was getting too dim, and that's the reason I can't see it.\" Then I thought, \"Well, maybe I could see it on the computer if there was any light still being emit by the ball of light. \" So I took 3 more pictures, but I still didn't see that ball of light once it went behind that tree. I then thought, \"Maybe it instantly disappeared like that first ball of light. [April of 2003].\" I went back inside the apartment, and I looked at the clock to see what time it was, then I noted that time down. I saw my compass laying on the desk, so I decided to take a compass bearing of that ball of light route which was at 45 degrees of 360 degrees (almost North East). This ball of light that was seen in Mesa, Arizona is identical to the ball of light I seen in Pensacola, FL back in 2003. Identical in shape, in light, in speed, and in altitude. Identical. This observation I just had was much closer than the first observation back in 2003 which I filed a report to Nuforc back then. I had a really good look of it. I saw no out lines of any structure for a ball of light to be attached. It was simply a ball of light very similar to a globe. Unquestionably, it definitely look like it was a solid sphere, not just a light. It almost seem like I could almost reach out and touch it; being, it was that close. It was actually awe inspiring to observe this little ball of light just silently and slowly traversing through the air with it being bright yet gentle enough as to a soft glow to allow me to intensely gaze at it for every little hints of details that it may have for me to see. Since 2003, I been searching on the internet for any logical explanation of what that ball of light may be. In the past week, I seen maybe several UFO objects, but I started to discount them as being UFOs. Then last night when I was watching 1 video on youtube showing ancient UFOs depiction, I was giving reason to every depictions why they were not UFOs since it could also be intercepted in a different way. Now this may sound a little odd, but I was actually going to start thereafter showing some of my pictures on youtube. Pictures I took over the years, and give reasons why some pictures that other people took may be just birds, or planes, or whatever because there was a logical phenomenal reason for each one, and how some other people's photo may have these kinds of phenomenal occurrences in their pictures. In another words, I turned on my views to that of UFOs were not real because I didn't see any real hard evidence except for only pictures as possible proof. And maybe what I saw back 2003 was just something of a fluke created by the military with their new invention or contraptions. However, this morning, I awoke up from a dead sleep at 5:00AM which I normally don't get up that early. I figured, since I up, I make some coffee, then I just go outside to drinks some coffee and smoke a cigarette. I was probably no more than a couple minutes outside when I saw this ball of light. Now this all sounds very incidental, but I was going agree with some of those people out there that UFOs are not real, but this morning quite literally and instantly reminded me again about the facts that UFOs are indeed real. No questions or doubt about that; they undeniably and truly do indeed exist. I have pictures of that ball of light now, unquestionably those pictures shows somewhat as evidence as to the fact that there are UFOs possibly extraterrestrial in origin. And there is very good chance that somebody saw that same UFO too in the Phoenix area this morning. The question is: are they going to come forward maybe onto this site to say, they saw it too."],"Object Features":"Unknown","Disposition":"Unknown","Country":"United States"}