{"Region":"Kansas","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.980429,+-95.22997(22691)&iwloc=A&hl=en\"> mufon case (22691) map </A>","Object Features":"Patterned Surface","Latitude":"38.980429","Date Submitted":"04/07/2010 03:40 UTC","Country":"United States","Date of the Event":"09/01/2004 08:30 UTC","City":"Lawrence","Case Number":"22691","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/22691.html.txt","/var/www/straped/mufon/org/22691.html"],"trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around September 1st 2004"],"Log Number":"US-04072010-0012","Weather Factors":"None","divs":["Sighting Details A friend and I where hanging out by this lake only a block from our houses on the south west part of lawrence Kansas. There was a full moon and the frogs where croaking. Everything seemed normal, until my friend noticed something. \"What is that?\" he asked, pointing to the horizon at the East end of the lake. Above the tree line was a glowing red ball, and it was getting closer. \"It's just an airplain comming towards us.\" I said, knowing airplains don't move that fast, but before I could second guess myself the bright red orb simply dissapeared. Everything whent quiet. I remember watching the reflection of the moon in the water being eclipsed by a shadow. So i quickley looked up to see a giant triangle slowly come to a stop over our heads. My friend and I held eachother like whimpering school girls. It didn't make a sound. I remember lights on the bottom of it kicked on. A red, blue, and green light, one on each corner. I was so scared the experience is blurry, and hard to remember. We watched the craft slowly move west over the wheat field behind us, turn back into the twinkling red ball and sink into the horizon. I don't think i've ever ran so fast in my life. We where almost home When we noticed jets in the sky. These where verry obviousley jets with lights on there wings. performing flight patters as they screatched through the night sky, looking for something. I had nightmares for a wile after the experience, but it was years ago now. I wish i had more information for you. When I ask my friend about it he only remembers the red light above the trees. I can't blame him for not wanting to remember. Where we obducted? Did we experience time loss? Where we somehow chosen for some greater purpose where not sure of yet? I simply don't know. But one things for sure, that night changed my life."],"Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","Summary":"A big red light apeared over the horizon, getting closer, we noticed it's triangle shape as it slowly hovered by.","Longitude":"-95.22997","Source":"MUFON","Object Shape":"Triangle"}