{"Summary":"2 white orbs flying around above Woodland Hills Ca suburbs. Criss-crossed each other after about 2 mins. and then disappeared.","Sighting Duration":"Undisclosed","Log Number":"US-04072010-0017","Object Shape":"Sphere","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around April 7th 2010"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.166797,+-118.602845(22696)&iwloc=A&hl=en\"> mufon case (22696) map </A>","Region":"California","Date Submitted":"04/07/2010 09:03 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Los Angeles","Country":"United States","Source":"MUFON","Case Number":"22696","Object Features":"None","files":["/var/www/straped/mufon/html2text/22696.html.txt","/var/www/straped/mufon/org/22696.html"],"Latitude":"34.166797","Object Flight Path":"Path with directional change","divs":["Sighting DetailsWhile walking through a friend's neighborhood we spotted 2 white orbs cruising around at what I estimate was maybe 2-3 thousand feet. The objects were first noticed by my fiance's sister and at first glance I assumed they were birds. I put my sunglasses on and looked again; at that point I realized there was no wing, tail, or identifying shape other than what I would call a \"shiny orb\". I kept staring as I expected my eyes to be playing tricks on me or for wings or some other markings to become visible but there were none. They flew in a rounded \"zig-zag\" path above the neighborhood for about 2 minutes. They criss-crossed each other's path after a short time and then seemed to just disappear. I was able to compare their shape, size, and color with birds and a passenger jet that flew by far off in the horizon. For a second I thought they could be balloons but there was absolutely no mistaking not only some kind of intelligent control but also a shape unlike any wildlife or human made object I have ever seen. I was with two others who also saw the same thing. It was a very thrilling experience. I have always believed in alien life but never expected to see any. There is just no way they could be anything other than UFO's. Amazing."],"Date of the Event":"04/07/2010 04:30 UTC","Tags":"City","Longitude":"-118.602845","Disposition":"IFO"}