{"Weather Factors":"Unknown","Case Number":"22693","Latitude":"37.690207","Date of the Event":"04/06/2010 10:59 UTC","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-04072010-0014","map":"<A HREF = \"http://maps.google.com/maps?q=37.690207,+-92.660786(22693)&iwloc=A&hl=en\"> mufon case (22693) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"5 or 6 star burst objects that had spikes or protrusions from a dark centre","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/22693.html.txt","/var/www/straped/mufon/org/22693.html"],"Source":"MUFON","Region":"Missouri","trends":["There have been 7 other sightings in Lebanon","There were no other sightings in Lebanon on or around April 6th 2010"],"Object Shape":"Star-like","City":"Lebanon","Longitude":"-92.660786","Date Submitted":"04/07/2010 04:01 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI'm a travelling salesman who's been working around the Lebanon, Mo area for the past year or so. I had just got done with an appointment just north of Lebanon on Hwy 5 when the people who's home I was visiting brought up the subject of UFO's. After I mentioned I had a great interest in the subject but that I personally had never witnessed a UFO, they said they have had several sightings beginning in January and that \"they\" are out there almost every night. So as I was leaving the lady's father said I'll go see if they are out there tonight. About a minute later he came back in and confirmed they were. This peaked my interest. So we all went outside, I loaded up my things in my van and then I looked skyward to where the people directed me. At first the objects just looked like stars until they handed me the binoculars. I had trouble keeping the binoculars steady until I rested them on a large car jack. As I focused in on the object I saw it quite clearly. It looked like when fireworks explode, the initial burst except there wasn't a burst or explosion. There were several lights that appeared to protrude from an inner object that was perhaps spherical in shape but not visible. It absolutely was not an airplane or helicopter. Then my new friends pointed out a few more similar objects in different parts of the sky. The objects appeared to oscillate somewhat about 10 - 15 degrees. My new friends said that on other nights the objects would sometimes appear to make rectangular patterns and even \"morph\" into one another. They also mentioned that they've seen what they refer to as the \"mother ship\" that was absolutely enormous but since I did not see that object I will confine this report to what I saw personally witnessed. These \"star-burst\" objects were there the entire time I stood outside these people's home which was a little over an hour. Since these people said that the objects are there almost every night, I'm going to continue to work in that area but watch out for them now. I told these people about Ted Phillips whom I saw speak at the MOU Conference last July in Independence, Mo. I told them about the \"Marley Woods\" and how Mr Phillips wouldn't disclose where exactly in Missouri it was located but that it was in fact a UFO hot-spot. Also I told them that a lady I met at the conference told me that the Marley Woods were around the area of Licking, Mo which was a little over an hour by car down Hwy 32 from where we were in Lebanon, Mo. I'm going to go buy my own set of binoculars and go down there again tonight and see if I can see the objects again."]}