{"City":"Ukiah","Tags":"City","Object Features":"Other","Source":"MUFON","divs":["Sighting DetailsThree friends and myself were at our campfire high in the mountains on a clear and quiet moonlight night. talking about our coming activities of the next day when I saw something in the sky heading toward us.It seemed odd right away since there was no engine sound.Before long it was moving across our path at about 200 ft. above us and about one hundred feet away.We all stood up and watched in silent amazement.The ship was moving very slowly in front of us.It was about 300ft.long.It looked like a submarine,some kind of metallic color with black pock marks all over it and tower about thirty ft. high three quarters of the way at the back of the ship.We were all in shock as it silently glided by us.Then something amazing happened.A large green circle seemingly solid appeared under the ship about thirty ft. in circumference.At first it looked solid then as the ship slowly kept moving away it started to disapate and finally broke into shockwaves and disapeared.This continued to happen with three other geometric shapes.a square, a triangle and I can't remember the last.We were all speechless as we quietly watched our silent visitor pass on into the night.Two weeks later, one of these friends and myself came back for the weekend to finish our annual hunt.Again, it was late at night.The sky clear when my friend pointed to a moving object.I looked down his pointed arm and then I could see it as well. It was a point of light bouncing on the horizon.It would dart on an angle to the edge of the horizon and then back again.It did various manuvers and would then hang in space this went on for minute until it finally shot off into space.I have never had a ufo sighting since these two events.We are not alone."],"Longitude":"-123.203473","Latitude":"39.151541","Sighting Duration":"Undisclosed","Region":"California","Country":"United States","Object Shape":"Square, Rectagular","Date Submitted":"04/07/2010 09:11 UTC","files":["/var/www/straped/mufon/html2text/22697.html.txt","/var/www/straped/mufon/org/22697.html"],"Case Number":"22697","map":"<A HREF = \"http://maps.google.com/maps?q=39.151541,+-123.203473(22697)&iwloc=A&hl=en\"> mufon case (22697) map </A>","trends":["There have been 8 other sightings in Ukiah","There were no other sightings in Ukiah on or around"],"Weather Factors":"Unknown","Log Number":"US-04072010-0018","Date of the Event":"Unknown","Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","Disposition":"Hoax","Summary":"submarine looking ship.200ftaway made contact by projecting geometrical shapes."}