{"City":"South Bend","Sighting Duration":"Undisclosed","Summary":"I observed a v-shaped object in the north sky that was disappearing and reappearing into view multiple times.","Date Submitted":"04/08/2010 04:47 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.692211,+-86.241307(22712)&iwloc=A&hl=en\"> mufon case (22712) map </A>","Object Shape":"Boomerang","Disposition":"Unknown","Object Features":"Patterned Surface","Case Number":"22712","Object Flight Path":"Path with directional change,Other","Region":"Indiana","Weather Factors":"Unknown","Tags":"City","Date of the Event":"03/23/2010 12:45 UTC","Log Number":"US-04082010-0013","Latitude":"41.692211","Longitude":"-86.241307","divs":["sighting details i was doing some yard work on the 23rd,enjoying a beatiful sunny day.i looked up to the northwest and thought i saw a flock of geese flying towards me about 1\\4 mile away. it was'nt a flock of geese. it was some sort of a v-shaped object. it came in slowly,like it was floating,to about 1\\8 of a mile north of me. the front or tip of it was dark and going back on each wing were light and dark stripes. the light and dark stripes went across each wing about four times,like little segments. it was silent,i did't hear anything coming from it. so this object comes in from the northwest to about 1\\8 of a mile from me,up in the air about 500ft. then it turns to my right and moves to the east. through the turn the object stayed parallel to the ground. now the strange part. it had moved about 200ft. to the east and then just vanished. i waited a few seconds and was about to get back to the yard work when all of a sudden there it was again in the same area of the sky,but now going west. i really started to watch it now. it did a flip or a tight roll and was going east again, disappeared again and reappeared going west. it did this 3 or 4 times,along with twisting and turning from east to west. i went in the house to get some binos' for a better look,but it was gone when i came back outside. i'd estimate the wingspan at about 100ft. or more,it was big. a nice,cloudless sunny day that i'll never forget."],"trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around March 23rd 2010"],"Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22712.html.txt","/var/www/straped/mufon/org/22712.html"]}