{"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around April 7th 2010"],"Object Shape":"Circle, Oval, Teardrop","Case Number":"22710","Country":"United States","Date of the Event":"04/07/2010 01:12 UTC","Tags":"City","City":"San Diego","Object Features":"None","Log Number":"US-04082010-0011","Longitude":"-117.151865","Latitude":"32.716729","Date Submitted":"04/08/2010 04:01 UTC","divs":["sighting detailswent outside for lunch and looked up and saw a military jet following a round \\ oval object to the east for a few seconds. then the object changed its direction and headed to the west at a high rate of speed with no sound and no vapor trail quicker than anything i have ever seen.it seemed to be rotating counter clock wise as it moved in west toward the ocean. my wife called me when it was happening and she was headed north on i-15 and i asked her if she had seen anything as she drove by the area i was at, she said she didn't. i was explaining what i had seen to her and she told me to hold on. at that point she was up near lake hodges and said \"i see some kind of object over the lake that looks like a silver orb\". i told her to take a picture so she went to look again as she was driving and lost sight of it. i have seen a lot of weird things in my life but nothing ever so clear and intimidating as this it moved with such power and grace that it really shocked me for the few minutes that i saw it. it was one of the clearest days of the year not a cloud in the sky and it was also the fact that it was as large as the plane that seemed to be following it for the few seconds before in reversed its direction that i think i should report it. im very interested in knowing what it was to the point that im writing this email. im not going to consent to a third party release because the explanation for third party is to vague but if someone want to contact me by email and leave a number to call back i would consent to that. i just dont want to be harassed by tellimarkiters or someone else that dosnt have anything do to with your web site."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/22710.html.txt","/var/www/straped/mufon/org/22710.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.716729,+-117.151865(22710)&iwloc=A&hl=en\"> mufon case (22710) map </A>","Disposition":"Unknown","Summary":"Looked up in the sky","Region":"California","Viewing Distance":"101-500 Feet"}