{"Longitude":"-111.829192","Date Submitted":"04/09/2010 12:30 UTC","Weather Factors":"Windy, Light","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around April 8th 2010"],"Country":"United States","Latitude":"33.423784","Region":"Arizona","Date of the Event":"04/08/2010 08:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.423784,+-111.829192(22724)&iwloc=A&hl=en\"> mufon case (22724) map </A>","Summary":"Formation of 4 blinking lights moving from N to SW","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Mesa","Case Number":"22724","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22724.html.txt","/var/www/straped/mufon/org/22724.html"],"Object Features":"None","Object Flight Path":"Straight-line path","Disposition":"Unknown","Object Shape":"Star-like","Log Number":"US-04092010-0002","Tags":"City","divs":["sighting detailslast night, april 7, 2010 around 8:45-8:50pm i observed 4 sharp\\bright pin sized blinking lights moving in formation. i first noticed them directly west and they moved off at a high rate of speed to the south\\southwest. i had my binoculars and tried to make a positive identification if they were aircraft. i could not. there was no other lights attached, no body glow or other distinguishing or familiar markers. tonight, approximately the same time, april 8, 2010, they appeared again, this time witnessed by my wife and daughter. this time i caught them as the came out of the north by north west and crossed the southern horizon at approx 30 degree apex and dissapeared to the south\\southwest. again, they moved in a pattern, separated by considerable distance estimating altitude above 5,000ft. this time, with binoculars i did notice a dull red glow accompanying the flashes, however i am convinced they are not conventional aircraft. also, thier speed was such that they crossed the sky in about a quarter of the time that a high altitude aircraft took to cross the same distance. considering the speed, formation and lack of any other lights and no dicernable body shape, i do not believe they were planes, helicopters or other conventional aircraft"]}