{"Disposition":"Insufficient Data","Case Number":"22721","Object Features":"None","Object Shape":"Square, Rectagular","Region":"Florida","Country":"United States","Latitude":"27.957555","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22721.html.txt","/var/www/straped/mufon/org/22721.html"],"Log Number":"US-04082010-0022","Summary":"Black rectangle over eastern Tampa flying north, turning east toward Lakeland, FL.","Longitude":"-82.448328","Date of the Event":"04/06/2010 06:30 UTC","Object Flight Path":"Path with directional change","Date Submitted":"04/08/2010 10:16 UTC","Source":"MUFON","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around April 6th 2010"],"Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsI was driving south on Orient road in Tampa to get on I-4 and drive west. I glanced up and to the east (I don't know why) and saw a rectangle flying more or less north. I immediately thought of a rectangle my wife and I saw fly north of Orlando International Airport about 7-8 years ago. I had no idea what it was, but it was not one of ours. I was extremely curious. I kept glancing through trees as I drove to try to keep it in view, but I realized I would not get a good view unless I turned east. I turned east onto Hillsborough Avenue instead of taking my turn to the west. I was concerned about time, as I had a meeting at 7 pm miles away through traffic. The object was not coal black, but grayish black as though it was partially transmitting light. It seemed to be about 5000 feet high, but I was unsure of its length and height. It appeared to be about three of four times as long as it was high and maybe the size of a twin engined commercial jet, but taller. Most peculiar was that it appeared to be flat, like a gray flag that did not wave. It appeared to be 4-5 miles away and perhaps 20 degrees above the horizon. I realized that it was foreshortening in length, which meant it was turning to the east, and that I could not catch up. Before it started its turn to the east it was moving through roughly 1-2 degrees of arc per second. I turned around, got back on I-4 this time, and headed west. I could no longer see the object, even in my mirrors. Surely someone else saw the thing, as this was rush hour traffic, and it had to cross the path of I-4 from Tampa to Orlando or maybe just stay on the north side of I-4. I decided to report it to Mufon. I did not think to take a picture with my cell phone. It made no sound, nor did it have lights or a contrail."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.957555,+-82.448328(22721)&iwloc=A&hl=en\"> mufon case (22721) map </A>","City":"Tampa"}