{"Object Features":"Unknown","Country":"United States","Object Shape":"Fireball","Date Submitted":"04/09/2010 03:08 UTC","Source":"MUFON","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around March 27th 2010"],"Sighting Duration":"Undisclosed","City":"Phoenix","Log Number":"US-04092010-0006","Object Flight Path":"Path with directional change","Disposition":"IFO","Date of the Event":"03/27/2010 12:00 UTC","Weather Factors":"None","Region":"Arizona","Summary":"Red, falling star? Had no tail behind it.","Case Number":"22728","files":["/var/www/straped/mufon/html2text/22728.html.txt","/var/www/straped/mufon/org/22728.html"],"Viewing Distance":"Over One Mile","Latitude":"33.451877","map":"<A HREF = \"http://maps.google.com/maps?q=33.451877,+-112.064417(22728)&iwloc=A&hl=en\"> mufon case (22728) map </A>","Longitude":"-112.064417","Tags":"City","divs":["sighting details was driving south on i-17, some 50 miles north of phoenix, az. both wife and i saw the object as it was falling toward the ground, behind a mountain range, at about a 45 degree angle from our travel direction, or in a southwest direction. it appeared to be some 5 miles away! the apparent size was approximately 1\\4 the width of the forefinger, when held at arm's length. i would say it was rather large. strangely, i later thought the color of the object was red, but wife thought it was white! neither of us is color blind! at 85 years of age and 82 (wife) we have seen many 'shooting stars' but what made this object different was its size, and lack of a streaming tail. the time was about 12:33 am, arizona time, on mar. 27 of this year. we were headed to phoenix to attend a conference. i am a wwii marine corps veteran, and participated in 3 pacific island campaigns. we noticed the object as soon as it came into our vision at some 50 degrees above the line of the horizon. we thought perhaps it was a falling star, but it was rather big, appeared somewhat close, and had no trailing tail. it disappeared as it fell beyond the mountain range."]}