{"Region":"Colorado","Source":"MUFON","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/22720.html.txt","/var/www/straped/mufon/org/22720.html"],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"04/07/2010 12:00 UTC","Longitude":"-104.82733","Country":"United States","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around April 7th 2010"],"divs":["Sighting Detailsi stepped outside at approximently 2:00 am to smoke and seen a bright light hovering or slowly moving toward my direction. it was night shining a light but more like iluminating itself about 30 ft above a neighbors house it took about 2 mins to get closer and as it did i called my younger sister which also witnessed the craft we could tell it was a helicopter or anything like that because we was so close we could not see prepellers or hear any it was just hovering and then slowly moved on til we lost sight of it we also noticed another bright light aabout 10 ft above an apartment across the street which seemed to be just hovering and then 2 more crafts appeared no higher than the street lights at the corner of our block we recorder this one on our camera phone. the light abover the appartment seemed to just disappear. we witnessed these crafts for about 10 min or more. we can assure you it was no plane helicopter or anyhing like that we were so close that we could tell it wasnt nothing of our military the news or the airport.when first seeing this light i couldnt believe it i wasnt sure if i was seeing a ufo or not until it got closer and then thats when i new that it was a UFO i am now a firm believer and no one can change my mind i know what i saw and no one can tell me different."],"Latitude":"39.734742","map":"<A HREF = \"http://maps.google.com/maps?q=39.734742,+-104.82733(22720)&iwloc=A&hl=en\"> mufon case (22720) map </A>","City":"Aurora","Log Number":"US-04082010-0021","Tags":"City","Viewing Distance":"Unknown","Case Number":"22720","Summary":"4 hovering object no more than 30 to 75 ft from me 2 of which iluminateing got on camera.","Object Shape":"Disc, Unknown","Date Submitted":"04/08/2010 08:11 UTC","Object Features":"Undisclosed"}