{"map":"<A HREF = \"http://maps.google.com/maps?q=37.810034,+-122.269194(22729)&iwloc=A&hl=en\"> mufon case (22729) map </A>","Sighting Duration":"Undisclosed","Latitude":"37.810034","Object Features":"Undisclosed","Date of the Event":"04/09/2010 01:13 UTC","Weather Factors":"Unknown","Tags":"City","Object Shape":"Triangle","trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around April 9th 2010"],"City":"Oakland","Viewing Distance":"Over One Mile","Disposition":"Hoax","Date Submitted":"04/09/2010 05:01 UTC","Country":"United States","Log Number":"US-04092010-0007","Summary":"Huge Triangle of Lights seen Speed over Oakland, CA in the early Morning","files":["/var/www/straped/mufon/html2text/22729.html.txt","/var/www/straped/mufon/org/22729.html"],"Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"22729","Longitude":"-122.269194","divs":["Sighting DetailsI went outside for a smoke at around 1:10 AM this morning. I was looking at the stars facing southwest, when something caught my eye. I quickly looked over and in 1-2 seconds I saw 4 lights moving at an incredible speed past the roof of my house. I quickly ran around to the side of the house to see what it was. For the next 2-4 seconds I clearly saw 3 lights forming a triangle speeding across the sky directly south. There was also a light right in the middle of all 3. There was a large distance between the lights, because at the speed they were moving, they stayed in perfect unison probably 5-6 miles apart from each other. I'm not sure whether or not these were rim lights to some large craft, but it seems unlikely since the distance between them stayed in a perfect triangle. If this is the case, the craft must have been absolutely huge. The speed of this object was approximately (and I'm guessing here) 10-15x faster than the airplanes I observed in the sky over the SF Bay Area during the minutes after the sighting. I can't stress enough that this thing was moving INCREDIBLY FAST! The night sky during the event was very hazy, with the lights from San Francisco making it hard to see the stars. I lost sight of the object in the haze traveling southward. The lights also appeared to be speeding up. For the past year, I lived outside the city, and saw many shooting stars during the night and early morning. I am absolutely certain that these lights were not shooting stars. I hope this report is of use to someone. -Cheers -Stuartb"],"Region":"California"}