{"Weather Factors":"Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Case Number":"22739","Latitude":"33.495389","files":["/var/www/straped/mufon/html2text/22739.html.txt","/var/www/straped/mufon/org/22739.html"],"divs":["Sighting DetailsDriving from Fallbrook to Temecula on my way to Pechanga (casino) I saw what I first thought was just another plane (I've seen photograghed and reported many sightings of \"orbs\" to MUFON) but I couldn't see the wings. I was just a few blocks from the casino in the right hand lane and the lane was about to end so I drove very slowly (i had the top down) and looked very carefully and determined that it was a round disk. I have a Nikon D50 in the back seat and thought to myself that as soon as I get to the parking lot of the casino I would take some photo's but I had to take my eyes off the object and change lanes and when I looked back it was gone. I pulled into the parking lot and searched the sky to no avail, nothing. Then on my way into the casino a small orb the size of a balloon floated by about as high as the street lights. I took some photos with my cell phone (left the Nikon in the car) and have been trying to email them to myself but for whatever reason my POS google tmobile phone won't send them. If they come through I'll post 'em (very exiting though it was the first time I ever saw a traditional \"flying saucer\")"],"Longitude":"-117.141085","map":"<A HREF = \"http://maps.google.com/maps?q=33.495389,+-117.141085(22739)&iwloc=A&hl=en\"> mufon case (22739) map </A>","trends":["There have been 13 other sightings in Temecula","There were no other sightings in Temecula on or around April 9th 2010"],"Sighting Duration":"Undisclosed","Summary":"Beige disk that dissappered","Object Shape":"Disc","Date of the Event":"04/09/2010 12:00 UTC","Date Submitted":"04/09/2010 10:13 UTC","Object Features":"Undisclosed","Region":"California","City":"Temecula","Source":"MUFON","Disposition":"IFO","Object Flight Path":"Straight-line path","Tags":"City","Log Number":"US-04092010-0017"}