{"Date Submitted":"04/09/2010 01:55 UTC","Object Shape":"Unknown","Viewing Distance":"101-500 Feet","Region":"Oklahoma","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Shape was difficult to make out, but the size of a small private jet or helicopter with several white lights and one small red blinking light underneath.","Date of the Event":"03/23/2010 07:45 UTC","Log Number":"US-04092010-0010","Longitude":"-97.761244","Object Features":"Unknown","trends":["There have been 6 other sightings in Yukon","There were no other sightings in Yukon on or around March 23rd 2010"],"divs":["Sighting DetailsMy husband and I were traveling south bound on the West Kilpatrick Turnpike just east of Yukon, OK. As we passed by the Northwest Expressway exit we noticed two white lights a mile or more ahead of us which at first glance looked like nothing more than a low flying small airplane heading towards us. As we got closer we both noticed that this object in the time it took us to get to it had never moved. In fact, as we got closer and closer we noticed it was hovering over a field just off the highway. I would say it was less than 100 yards above the ground and less than 50 yards off the highway so we drove right by it. It was definitely not an airplane because it wasn't moving, but then it wasn't a helicopter either. I even rolled my window down as we drove by to see if I could hear propellers hoping it was a helicopter but it was completely silent. It was just before the sun set but the object was too dark to actually see the shape of it. But, I do know that it did not have wings like an airplane because I was really straining to see wings as we drove by. We noticed more white lights on the object as we got closer and judging by their arrangement would say it was either in a cylinder or disc shape but that would only be a guess. There were probably a total of 3 to 4 bright white lights on it. And occasionally I could make out a tiny red flashing light underneath but it was not a consistent blinking like a plane would be it was more random. I watched it in the mirror as we passed by and it was still there for as long as I could see it. It never moved in the 5 or more minutes since we first noticed it. And I never saw it leave. Surely there are other people out there who saw this. It would have been very difficult to ignore if you were driving on that highway that night! There is a small airport just several miles east of where we were, I wonder if they could have picked it up on their radar?"],"City":"Yukon","map":"<A HREF = \"http://maps.google.com/maps?q=35.508232,+-97.761244(22732)&iwloc=A&hl=en\"> mufon case (22732) map </A>","Latitude":"35.508232","Case Number":"22732","files":["/var/www/straped/mufon/html2text/22732.html.txt","/var/www/straped/mufon/org/22732.html"],"Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Stationary"}