{"Disposition":"Unresolved","Tags":"City","Date of the Event":"03/17/2010 11:35 UTC","Sighting Duration":"00:00:30","Object Flight Path":"Straight-line path,Path with directional change,Other","Weather Factors":"None","Region":"Illinois","Object Features":"None, Other","Latitude":"41.887194","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.887194,+-87.620498(22738)&iwloc=A&hl=en\"> mufon case (22738) map </A>","divs":["Sighting DetailsI was off of work from Tuesday through Friday this week taking care of my son who had a mild case of the chicken pox. My wife whom works from home had asked me on this day to go pick up some lunch. It was a nice sunny day and not too cloudy. I walked outside and got in my car. When I was backing out of the driveway I naturally looked back to my right and left to make sure no cars were coming. I don't remember looking to the right, but I know prior to reaching the curb, there was an object I saw out of my left drivers side window that caught my eye. So, I stopped the car (still in the driveway) to observe the object briefly. It was moving North, the same direction that I was backing out of the driveway prevoiusly. It then stopped completely and suddenly and headed South. I had only seen the object long enough at this point (3-4 secs) to know that it was definitely heading North. When it moved South it headed in that direction for only about 2-3 seconds. This is when I stepped out of my car to view the object. It then went back to the North, changing direction again for a few more seconds. Then appeared to do a two circles and then headed Southwest flying in my direction but angled slightly to the South directly towards the Sun. By now I had been watching the object for around 15 seconds or so. When it started in my direction I then had the best look at the object as it was getting closer to me. It was shaped like a saucer. The color was sort of a light brownish color with a red tint. The bottom of the craft seemed to have more of the red tint then the rest of it did, but was much darken in color than the rest of it. It was flying probably 50ft lower than most airplanes I see around my house with the exception of the really high planes I see that leave the white smoke trail behind them. I did not see any features on the object like lights or windows or anything like that. It was just sort of a grainy techture. One thing that struck me as being very strange as I was observing the object or craft, it seemed at times to almost fade away and almost be transparent, but not completely, and then it would be completly visable again. It did this two times after it headed in my direction. As it came closer and closer to me I started to lose sight of it in the Sunlight as it was headed straight in that direction. The craft was close enough to me that I should have heard some sound from it but I could not hear any noise at all. It was totally silent. I lost sight of it when it flew under the Sun. I stayed in my driveway another 10 minutes or so looking for it. I should have seen it once it was out of the Sunlight but it was just gone. Like it disappeared. I did not see it again."],"Object Shape":"Disc, Oval","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/22738.html.txt","/var/www/straped/mufon/org/22738.html"],"Country":"United States","Longitude":"-87.620498","City":"Chicago","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around March 17th 2010"],"Summary":"Saw a disc shaped object in the sky to my left while in my car backing out of the driveway.","Log Number":"US-04092010-0016","Case Number":"22738","Date Submitted":"04/09/2010 09:43 UTC"}