{"Viewing Distance":"Over One Mile","Sighting Duration":"00:10:00","Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.242304,+-111.652164(22733)&iwloc=A&hl=en\"> mufon case (22733) map </A>","files":["/var/www/straped/mufon/html2text/22733.html.txt","/var/www/straped/mufon/org/22733.html"],"Disposition":"Unknown","Object Features":"None","Longitude":"-111.652164","Object Shape":"Unknown","Weather Factors":"None","Summary":"White object in sky appeared motionless then seen to be falling.","Source":"MUFON","Country":"United States","Date of the Event":"04/09/2010 12:08 UTC","Case Number":"22733","Log Number":"US-04092010-0011","divs":["Sighting DetailsI was laying on the grass near my house with my wife. We were laying in the sun with our son and looking up at clouds. I saw a solid white speck that wasn't moving in the sky and pointed it out to my wife. The object stayed there for at least a couple of minutes, and I described my disappointment that I didn't have my binoculars. I started to walk home to get my binoculars, and noticed that the object was in a different spot lower in the sky (aprox 60 degrees from horizon) and approximately 20 degrees east of north. I watched it get lower and lower. It was at about a 30 degree angle and starting to go behind some tall trees near my house when I rushed inside to grab binoculars, but I could already tell that I probably would not get them in time. The object appeared to be changing brightness, and was dark against some clouds as it passed in front of them before it dropped behind the trees. It fell like a flat disk flipping and swishing from side to side slightly with a period of about 2 seconds. My final estimate of it's size was about the size of a car. The entire elapsed time was perhaps 5 minutes from initial sighting to loss. No planes were observed in the sky in the 10 minutes before the sighting. The object appeared to have been moving east less than 10 miles north of my position and falling from a great height, perhaps from orbit."],"Latitude":"40.242304","Region":"Utah","trends":["There have been 6 other sightings in Provo","There were no other sightings in Provo on or around April 9th 2010"],"Tags":"City","Date Submitted":"04/09/2010 03:02 UTC","City":"Provo"}