{"files":["/var/www/straped/mufon/html2text/22737.html.txt","/var/www/straped/mufon/org/22737.html"],"Case Number":"22737","Latitude":"33.985089","Tags":"City","Summary":"Bright Star like object over the L.A. sky","trends":["There have been 8 other sightings in Pico Rivera","There was one other sighting in Pico Rivera on or around April 8th 2010"],"Source":"MUFON","Object Shape":"Star-like","Country":"United States","Object Features":"Undisclosed","Date of the Event":"04/08/2010 10:56 UTC","Object Flight Path":"Undisclosed","Date Submitted":"04/09/2010 08:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.985089,+-118.090355(22737)&iwloc=A&hl=en\"> mufon case (22737) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-04092010-0015","Viewing Distance":"Unknown","Disposition":"IFO","City":"Pico Rivera","Longitude":"-118.090355","Weather Factors":"Unknown","divs":["Sighting DetailsI received a phone call from a friend telling me to go outside and check out a bright object in the sky at 10:36PM PST. I looked in a South-western direction from Pico Rivera, toward Long Beach, and saw a large bright \"star\" like object that was flickering several different colors --red, blue, green and white. At first, I brushed it off as a planet, or a large star. My mother, a firm believer in UFO sightings, stood outside to watch the object. She called me outside within 10 minutes and said that it had been moving at a very slow rate, but insisted that it was moving. We didn't hear a sound, so I assumed it was only a planet and tried to convince her of this. I tried to walk inside again when my mom pointed out that this thing was actually moving. I stood out and watched it move further west toward the coast. She was right. About 20 minutes in, we saw a second bright object, which was smaller and closer to us. This one seemed to be white in color, and it glided from directly under that \"star\" like object, to the east, and disappeared a moment later. The original \"star\" like object seemed to glide over to the west at an extremely slow rate and moved over about 6 inches in our perspective. We were able to measure that from a pole that was in our view. 35 minutes in, we noticed the flare of the colors dim and watched the object simply fade away and disappear! I know of 5 other witnesses to this occurence, in 3 different locations in the L.A. area."],"Region":"California"}