{"Object Shape":"Circle, Star-like","Weather Factors":"None","Date of the Event":"03/31/2010 07:30 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.291634,+-73.913626(22735)&iwloc=A&hl=en\"> mufon case (22735) map </A>","Latitude":"41.291634","Disposition":"Unresolved","Country":"United States","Region":"New York","Source":"MUFON","divs":["Sighting DetailsWhile I was visiting my brother in New York, I walked outside to retrive my camera. When I did I noticed an extremely bright \"star\" shining in the sky. The sky was still light, as it was about 45 min utes before sunset, yet this \"star\" was incredibly bright. I also noticed tht it was flashing and changing colors from red to blue. I knew that this was not an ordinary star or planet that I was seeing. I quickly grabbed my camera with a 70x zoom and began to zoom in and film this object. To my amazement I clearly saw the object acting as no other celestial object does. The \"star\" was changing size, shape, colour and luminosity at a very rapid speed. It changed from red to blue to green, from a small bright circle to a large circle with an intricate pattern within it. I continued to film it for five minutes or so, and the whole time it kept moving, shifting and changing shape, size and color! It was at this point that the star began to fade out from my camera, although it was still clearly visible to the naked eye. It was as if it was no longer enabling me to film it. I tried again to zoom in to the object, but was unsuccessful. During the entirety of the experience I was filled with excitement, wonder and joy. Just seeing the \"star\" shining in it's great beauty filled me with hope and joy. It was truly exhilerating."],"files":["/var/www/straped/mufon/html2text/22735.html.txt","/var/www/straped/mufon/org/22735.html"],"Longitude":"-73.913626","Object Features":"Patterned Surface","trends":["There have been 5 other sightings in Peekskill","There were no other sightings in Peekskill on or around March 31st 2010","This sighting has never been favorited.",""],"Tags":"City","Object Flight Path":"Stationary,Other","Viewing Distance":"Unknown","Log Number":"US-04092010-0013","Date Submitted":"04/09/2010 04:29 UTC","City":"Peekskill","Summary":"I witnessed a bright \"star\" in sky that was changing colors. When I zoomed in with video I was amazed to see \"star\" changing color, size and shape.","Case Number":"22735"}