{"Object Flight Path":"Path with directional change","Region":"Pennsylvania","Case Number":"22741","files":["/var/www/straped/mufon/html2text/22741.html.txt","/var/www/straped/mufon/org/22741.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.384057,+-75.119511(22741)&iwloc=A&hl=en\"> mufon case (22741) map </A>","Sighting Duration":"Undisclosed","Summary":"UFO flew twenty meters in front of me and my friends","Object Shape":"Boomerang","divs":["Sighting DetailsMe and my friends were at High rocks which is a park in PA. It is popular because it is a large cliff that falls off into a small river. Me and my friends were there at night at around 3 am on the cliff edge. We suddenly saw a bright light above us that was brighter than the rest of the stars. It was very high up and seemed to be getting closer very fast. As it got closer to the ground we were concerned it was a plane that was going to crash. It's light also got dimmer the closer it got to us. We were very confused because there was no sound until it was right in front of us. It was making a low humming noise like a bee or something. It flew by us left to right very slow and all of a sudden it darted off into the distance instantly. We were very freaked out after this because we looked behind us into the woods and there was a light in the distance getting closer. It didn't look like a flashlight though more like a lantern because there was no beam of light. We got scared and started for my car then we heard a very very loud whaaauummpp noise that echoed through the woods that seemed to be coming from nowhere in specific. My friend hurt his leg because he fell from being startled from the noise. We carried him back to my car. When I turned my key in the ignition my car would not start which was very scary because the light in the woods was getting closer. Suddenly the light went out and my car turned on and we were out of there."],"City":"Plumstead","Longitude":"-75.119511","Disposition":"Unknown","Latitude":"40.384057","Country":"United States","Object Features":"Unknown","Date Submitted":"04/10/2010 12:04 UTC","Log Number":"US-04102010-0001","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"09/23/2009 03:01 UTC","trends":["There have been no other sightings in Plumstead","This sighting has never been favorited."],"Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile"}