{"Object Shape":"Circle","Date of the Event":"04/09/2010 08:30 UTC","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around April 9th 2010"],"Country":"United States","divs":["Sighting DetailsWalking outside in my neighborhood looking at the stars. Precise location was Carmel Mountain Ranch, in north San Diego county. I noticed what looked like an extremely bright star right above a hill when looking to the west. The \"star\" then proceeded to get dim, so dim I could barely see it anymore, which was very strange given how bright it was just moments earlier. In fact, I remember thinking it was the brightest star in the sky at that moment after looking east, west, north, and south. Over the next 4-6 minutes, the \"star\" proceeded to get VERY bright again, then dim, then bright, then dim, etc. BUT, not \"blinking\". The brightening and dimming happened gradually, with each event taking about 5 or more full seconds for it to reach a maximum or minimum. After watching this object glow extremely bright, then so dim you could hardly even see it anymore for about 5 minutes, it disappeared altogether! If it were a star, it would remain stationary, or move slowly across the sky at best, and remain visible in the same general location for a significant amount of time. But after being there for 5 minutes glowing and dimming, it simply was gone altogether! I was so perplexed by this I spent another 10 minutes staring at the same part of the sky (west) waiting for the \"star\" to become visible again. In fact, I just went outside again (9:09 p.m.) to look for \"the brightest star in the sky\", but to no avail. I am an avid sky watcher as I have seen anomalous things before a total of 3 times in my life. I do not report these things often, or at all, unless I am certain I have seen something \"out of the ordinary\". This event lasted about 5 minutes and was VERY peculiar. I am very logically based, and consider myself a practical and scientific person. However, after seeing strange things in the sky 3 times in my life, I now look up almost every time I go outside. This event is one that will stick with me, as this \"star\" was SO bright it stood out among all the other stars in the sky for those moments, then simply disappeared after glowing at different intensities over a period of 4-6 minutes. I was excited, and still am, as I realized that this bright \"star\" was actually not a star at all. I just looked again (9:16 p.m.) and it's STILL not there, after being the brightest thing in the damn sky! Truly awesome..."],"Tags":"City","Disposition":"IFO","City":"San Diego","Source":"MUFON","Case Number":"22742","Summary":"looked like a super bright star low and to the west in the sky, except got dim, then bright, then dim, then bright over and over again. Then, simply disappeared altogether!","Longitude":"-117.148325","Log Number":"US-04102010-0002","Object Flight Path":"Undisclosed","Region":"California","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=32.723339,+-117.148325(22742)&iwloc=A&hl=en\"> mufon case (22742) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/22742.html.txt","/var/www/straped/mufon/org/22742.html"],"Object Features":"Undisclosed","Latitude":"32.723339","Date Submitted":"04/10/2010 12:22 UTC","Weather Factors":"Unknown"}