{"Weather Factors":"None","Tags":"City","Latitude":"44.996389","divs":["Sighting DetailsThis happened, first of all in a rural area, small community. It was also near a ceremonial area I do not wish to disclose, for respect of the area and family. My brother, his wife, her little brother and myself, were all sitting in a car that wasn't running at the time, bored teenagers, except for her brother who was around 12 at the time. There was an Inipi (sweat ceremony-lakota) going on at the time about a quarter mile away, north of us. We were in the non-running car smoking cigarretes, and talking, and her little brother noticed a dim light of northwest of us. He was starinng out of the back window, and told us, so we all, begin to watch it as it would go out of sight behind hills, and I would say we spotted it when it was about 5 miles away. I say this because we watched the object for about 15 min., or longer, it has been a few years since I talked about it. But it got closer, about 3 miles away now, and split into 2 dim lights. They would go back and forth real softly. Then it came to the top of the valley in which we were in, the opposite end or northwest side, and turned into 2 lights ...One blue and one red. The place where we were at has a creek running through, and encircles an island about quarter mile in diameter, and the lights went to each side, one at the south end, one at the north end. When they did they immediately brightened so much, they lit up the whole island and a good part of the valley. I focused on the blue light as it radiated so quickly. What made us lose sight is fear, we didn't know what was happening, but I remember hearing a buzzing in my ears, like hearing static and low buzzing. We all turned and ran, as we were standing at the top of the road parallel to the line up of the lights. Her younger brother was so frightened he began to screem and cry as we ran, i was the last and was very frightened."],"Region":"South Dakota","Case Number":"22747","map":"<A HREF = \"http://maps.google.com/maps?q=44.996389,+-101.235833(22747)&iwloc=A&hl=en\"> mufon case (22747) map </A>","Country":"United States","Summary":"1 light that turned into 2 lights, one red and one blue.","Longitude":"-101.235833","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been no other sightings in Eagle Butte","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/22747.html.txt","/var/www/straped/mufon/org/22747.html"],"Date Submitted":"04/10/2010 08:46 UTC","Date of the Event":"07/15/2003 09:45 UTC","Source":"MUFON","Log Number":"US-04102010-0007","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","City":"Eagle Butte","Object Shape":"Oval, Sphere","Object Features":"Unknown"}