{"Log Number":"US-04102010-0004","divs":["Sighting DetailsI was smoking out side at around 1a.m. and saw a really bright star. I looked at it and thought maybe it was Venus, and saw it change shape and color (withought binocculars)and was stunned. had seen the TV program \"UFO's best evidence ever caught on tape\", and knew right away it was the same formation of swiggle lines as the ones in the program that 3 different states reported. I watched all night (around dawn:5 hrs). From far I could see it move substantial distances in an instance, changing shape from a twinkle, to a star shape, to a diamond shape. The colors would variate red, blue, green, and white. With the binocculars (closer) I could see that the shapes I saw from further were actually being formed from 3 or 4 flourescent lines wrapping around one another, twisting, making all kinds of impossible maneuvers, and comming back together (Just like I saw in that program where MUFON investigated. I learned that when the object would move, thats when the formation of lines would change. For the most part, It just stayed still, like a star, but it was not a star. It was also silent, 100 percent the whole time. About 3 hrs later, I physically saw as another, smaller on descended from the clouds, and just stop, on a dime a little further than the other one. Same deal, exactly, only smaller. I had to go to sleep because I had to work the next day, but before I did, I took one final look out and saw 3 of them. the one bigger one, and 2 smaller ones forming the shape of a diamond across the sky. Its been a few days now, and there has been, consistantly, 2 smaller ones in the sky every night, but further away. This is how I was able to convince my family of it. We are all very smart, level headed, have common sense, and are skeptical at times. I do know that what it was was not a man made spacecraft. We cant afford cameras of a descent video camera, but its the truth. Thanks, JS"],"Sighting Duration":"05:00:00","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around April 7th 2010"],"files":["/var/www/straped/mufon/html2text/22744.html.txt","/var/www/straped/mufon/org/22744.html"],"Disposition":"Hoax","Weather Factors":"Windy","Date of the Event":"04/07/2010 01:00 UTC","Source":"MUFON","Region":"Idaho","Summary":"From far looks like star, close 3 color lines spiratic, intersecting warp speed","map":"<A HREF = \"http://maps.google.com/maps?q=43.619901,+-116.206866(22744)&iwloc=A&hl=en\"> mufon case (22744) map </A>","Object Features":"Undisclosed","Latitude":"43.619901","City":"Boise","Longitude":"-116.206866","Tags":"City","Date Submitted":"04/10/2010 06:37 UTC","Case Number":"22744","Object Shape":"Star-like","Viewing Distance":"Over One Mile","Country":"United States","Object Flight Path":"Stationary"}