{"Disposition":"Insufficient Data","Region":"Florida","Latitude":"29.908163","Object Flight Path":"Straight-line path","Case Number":"22756","Weather Factors":"Does Not Apply","Object Shape":"Circle, Oval, Star-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.908163,+-82.972744(22756)&iwloc=A&hl=en\"> mufon case (22756) map </A>","Longitude":"-82.972744","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around March 1st 2010"],"Summary":"While out on my aunts back porch for a smoke I noticed a very bright light comming off the G ulf","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"03/01/2010 07:35 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/22756.html.txt","/var/www/straped/mufon/org/22756.html"],"Tags":"City","divs":["Sighting DetailsWhile standing on my aunts back porch smoking when I noticed a bright white light comming from the Gulf (west) headed east. I thought It might be an aircraft but there were no strobe lights or landing lights and no sound of an engine either. The night was cold and crisp no wind and engine noises would have traveled well..It appeared to be about 1500 to 2500 feet in the air. The nearest airport is approximately 12-14 miles south of my location. The trees were bear of leaves and I could see the light comming through the limbs. It appeared to be about a mile away if that. The strangest thing happened while I was watching, a falling star crossed in the bright white lights path. For a brief moment I thought they might colide in mid air. But they did not. I watched the bright white light until it was completely out of sight. And saw no more falling stars. We do not usually have aircraft comming in from this perticular direction, that was what really peaked my curosity. I just watched the light and the falling star and really thought they might colide."],"City":"Mayo","Sighting Duration":"Undisclosed","Date Submitted":"04/11/2010 05:08 UTC","Log Number":"US-04112010-0007","Object Features":"Unknown"}