{"Object Shape":"Cigar","Disposition":"Unknown","divs":["Sighting DetailsI was driving on I-17 south just past Happy Valley rd. when my daughter and I saw what appeared to be helicopter in the distance. The object had a very bright font and tail light. We thought it was odd that the lights were much brighter than helicopters we have seen in the past and lacked blinking lights. The object appeared to be heading west of I-17. What we assumed to be the front of the helicopter was tilted downward as the other light was above the \"front\" light. The lights then became parallel evenly spaced. At this point, we thought the object was a plane heading north and that we were seeing the bright lights of its' wings. Then it disappeared as if someone shut the lights off suddenly. My daughter were puzzled and started joking about being one of those people who claimed to have seen a UFO. Approximately 40 seconds later, the object was visible again and this time it seemed to be much closer. It now seemed to be coming towards us again (instead of heading west) and the lights were extremely bright. The object moved slowly and smoothly- still evenly spaced. It once again moved west and then came to a still.The object was motionless and as we continued driving, we passed it. As we passed the object, it appeared to be on the edge of the west side of I-17 (before 101 loop and I-10 exits). We drove by ( and somewhat under it). I slowed down, rolled down my window and saw that there was a thin object between the two lights. It was solid and the object was close enough to see a gray mass, (perhaps metal because there was a reflection off the mass caused by either the object itself or the lights on the freeway). No loud sounds...nothing. I tried to find an exit to pull off and watch it. My daughter was able to turn around in the car and watch the object while I tried to find an exit. Within seconds (and before an exit), it was gone. It is difficult to say how big it was. I believe it was no bigger than a blimp. It was close- close enough to see the underside of the craft. There were other cars on the freeway. Someone else had to see this. I wish I had answers to what we saw. I can't believe it is 2:26 AM and I am not asleep...what was that?"],"trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around April 10th 2010"],"Object Flight Path":"Stationary,Path with directional change,Path then hovering","Log Number":"US-04112010-0003","City":"Phoenix","Viewing Distance":"101-500 Feet, Over 1 Mile","Weather Factors":"None","Latitude":"33.457677","Date Submitted":"04/11/2010 05:33 UTC","Summary":"2 bright lights with thin cigar mass between them","Source":"MUFON","Tags":"City","Case Number":"22752","Date of the Event":"04/10/2010 11:14 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.457677,+-112.068457(22752)&iwloc=A&hl=en\"> mufon case (22752) map </A>","Region":"Arizona","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/22752.html.txt","/var/www/straped/mufon/org/22752.html"],"Country":"United States","Sighting Duration":"00:05:00","Longitude":"-112.068457"}