{"Longitude":"-98.813995","map":"<A HREF = \"http://maps.google.com/maps?q=26.382647,+-98.813995(22768)&iwloc=A&hl=en\"> mufon case (22768) map </A>","Weather Factors":"None","Tags":"City","trends":["There have been 2 other sightings in Rio Grande City","There were no other sightings in Rio Grande City on or around April 8th 2010","This sighting has never been favorited.",""],"Source":"MUFON","Viewing Distance":"21-100 Feet","City":"Rio Grande City","Object Flight Path":"Stationary","Sighting Duration":"00:00:04","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsI was coming back home from college in my car, on the 83 highway, late at night. My mother called to see when I was going to arrive home and I answered her call from my cellphone. I was on the passanger seat at this time, while a friend drove me home. My mother was upset I was coming home late, so I ignored what she was saying to me and instead looked out the windshield at a slight angle towards the driver's side. In the sky, across from Alvarez Rd (in between Rio Grande,TX and Roma, TX)I saw a bright white light, a perfect sphere. My first reaction was: \"Oh my God!! What's that!?..Oh my God..it's moving!!..it's f*king moving!\" While the driver still drove at 55mph-60mph, I kept track of the object for about 3seconds. The object was NOT far up in the sky, but instead it seemed to be pretty low to the ground. I saw it moving down towards the ground as if it were going to land. It moved downward in the shape of an arc, a movement I believe no airplane or helicopter do when they plan to land. Anyhow, I do not know if the object landed because I lost site of it once it got too low to the ground because of trees covering the site. I noticed there was a house near where the object was, but there may be more than just one. The driver did not see what I saw, but I wanted to ask people around the area where I saw this object if they had seened something similar to my story but I was too scared of doing that for fear of being called crazy. What made me first notice the object was its perfect sphere-shaped bright-white glow. When I first saw it, I didn't think anything of it; until I saw it was actually moving downward as if to land, I thought it could be perhaps a UFO because of the way it moved downward, forming an arc path. During the siting I felt in disbelieve; It was very unexpected because I was not looking at the sky to find strange things, but yet there it had been very tangible. While still on the phone with my mother, I told her what I had seen: the bright white light shaped as a sphere. After the sighting when I got home, I asked myself what it could have been and started iliminating possibilities and I could not find an explanation for it. So I arrived at one conclusion: an Unidentified Flying Object..apparantly about to land."],"Region":"Texas","files":["/var/www/straped/mufon/html2text/22768.html.txt","/var/www/straped/mufon/more/22768_submitter_file1__BrightWhiteFlyingObject.jpg","/var/www/straped/mufon/org/22768.html"],"Summary":"moving sphere object with a bright-white light","Log Number":"US-04122010-0003","Latitude":"26.382647","Object Shape":"Sphere","Date Submitted":"04/12/2010 04:39 UTC","Object Features":"None","Date of the Event":"04/08/2010 10:40 UTC","Case Number":"22768"}