{"map":"<A HREF = \"http://maps.google.com/maps?q=35.997833,+-78.892299(22767)&iwloc=A&hl=en\"> mufon case (22767) map </A>","files":["/var/www/straped/mufon/html2text/22767.html.txt","/var/www/straped/mufon/org/22767.html"],"City":"Durham","Date Submitted":"04/12/2010 02:45 UTC","Weather Factors":"Does Not Apply","Date of the Event":"03/03/2010 09:15 UTC","Viewing Distance":"101-500 Feet","Object Features":"Window(s), Insignia","Longitude":"-78.892299","Tags":"City","Object Shape":"Disc","Country":"United States","divs":["sighting detailsi was out taking my dog dj. out for a pee. i looked up and saw a blimp like object that looked as a saucer shaped object that moved with no sound and no motor? it moved slow and it was dark matter that was the ship is the only way to decribe the way i realized how huge it was..the light behind the craft made it visible and you could see the boackness of the ship outline. you could see the errieness of the ship..i was so afraid just because of the size of this thing??i guess that i am in shock !!!my dog just looked at me fall to the ground ? why is this beeing a regular sight with just me and not all of the area???i just wish that the government could protect me and thne rest of society???i wish all of us (suvivors) could unite and demand the governments help in this matter??but we would probably just get the advising of broken bones and all? seems that that is all the gov. is use to do instead of uniting the way and truely starting a force that can automatically help us stop this unseen force. and somewhat unstoppable.. [cms\\tg\\pid] if i keep seeing these ufo's i may have the cradentials of a ufologist? why not? [cms\\tg\\pid] out..the airport wouldn't say either way if or not there was anything in the sky that night?god bless and keep looking up!!!i was upset at the time and felt i should go inside to get more batteries. it felt ominous....hope this situation doesn't get any more vollitile. and i stop getting visits from ufo's. if i go missing i assure my family to never give up on me because i will never give up either..god as my whitness.dr.k.h.ufo logist ."],"Source":"MUFON","Latitude":"35.997833","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around March 3rd 2010","This sighting has never been favorited.",""],"Disposition":"Hoax","Region":"North Carolina","Case Number":"22767","Summary":"UFO was atleast a football field in size and had 2 starlike pulsating stars at both ends centered.","Object Flight Path":"Path with directional change","Log Number":"US-04122010-0003","Sighting Duration":"00:15:05"}