{"Summary":"Driving on highway 12 we saw a very bright, maneuvering light flying fast at a low altitude","Object Flight Path":"Path with directional change","Case Number":"22761","Longitude":"-123.511829","Region":"Washington","City":"Brady","Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/08/2010 10:40 UTC","Latitude":"46.995929","trends":["There have been no other sightings in Brady","This sighting has never been favorited."],"Tags":"City","Object Shape":"Oval, Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/22761.html.txt","/var/www/straped/mufon/org/22761.html"],"divs":["Sighting Details On 8 April 2010,At about 1040 P.M. (22;40) I was driving west on highway 12 from Elma to Aberdeen, Washington. I was in the middle of a sentence when looking at my friend a very bright light came into view. I knew immediately it wasn't any kind of conventional aircraft. I am a private pilot and the first thing I looked for was any kind of navigational lights. There were none. The white light was so bright I couldn't make out any kind of defined structure. At the time we were just emerging from a hail storm, The ceiling under the hail cloud was about thirty two hundred feet according to the nearest reporting station,Hoquiam, Washington. The object seemed much closer. But it could have been at an elevation of between one thousand and three thousand feet. It moved at a high rate of speed. I would estimate at several hundred miles per hour. Probably close to mach 1. It made an ascending, climbing turn of about ten degrees and then turned back to the left about 15 degrees and leveled off. It still looked very low. Less than 2500 feet above ground level. In just a few seconds it had moved quite aways away. Possibly as much as ten to fifteen miles. Then it seemed to slow or even stop. Maybe over Aberdeen. But it was to far to say. Being about the size of a small aircraft and being so bright it was easily outshining the stars that had come out after we emerged from the hail cloud. When I first saw the light I asked my friend \"What the hell is that?! Looking at it he then said the obvious \" I don't know.\" It was in view in the western sky for maybe as long as ten minutes while we drove the highway. About five minutes out of Aberdeen it disappeared from sight behind obstructions. As we entered Aberdeen about five minutes later I looked for it. But I did not see it. On a side note: The cloud levels were obtained through a flight weather station."],"Sighting Duration":"00:10:00","Weather Factors":"Hail","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.995929,+-123.511829(22761)&iwloc=A&hl=en\"> mufon case (22761) map </A>","Log Number":"US-04112010-0012","Date Submitted":"04/11/2010 09:58 UTC"}