{"map":"<A HREF = \"http://maps.google.com/maps?q=41.38949,+-82.019032(22769)&iwloc=A&hl=en\"> mufon case (22769) map </A>","Region":"Ohio","Tags":"City","Case Number":"22769","trends":["There has been one other sighting in North Ridgeville","There were no other sightings in North Ridgeville on or around April 12th 2010"],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Object Features":"Unknown","Latitude":"41.38949","Date Submitted":"04/12/2010 07:38 UTC","divs":["sighting detailsi had let the dog out to use the bathroom, when i noticed that my dog suddenly stopped in his tracks and started to look upwards in a easterly direction. i then looked in the general area that he was looking, and saw a small triangular \\ chevron shaped object flying from the east, to the west. what struck me as strange about this object was that is was so small (less than 6 feet across), silent, had 3 light (one center and one at each end) and so very quick moving, as it seemed to be flying no more than 100 feet from the ground. if i hadn't noticed my dog looking for something, i certainly would have missed it! the object quickly flew directly over my house, at which time i lost sight of it. when i went to the other side of the house (a second, or two later), the object was nowhere to be found. i understand that it was early in the morning, but i had been awake for a few hours, so it wasn't because i was still not awake. it should also be noted that i regularly see aircraft flying in and out of cleveland hopkins airport, and this certainy did not belong with that group of commercial aircraft."],"Disposition":"Unknown","Summary":"Fast moving, small, silent, chevron shaped UFO.","Log Number":"US-04122010-0004","Source":"MUFON","Sighting Duration":"Undisclosed","City":"North Ridgeville","files":["/var/www/straped/mufon/html2text/22769.html.txt","/var/www/straped/mufon/org/22769.html"],"Date of the Event":"04/12/2010 04:30 UTC","Longitude":"-82.019032","Object Flight Path":"Straight-line path","Object Shape":"Chevron, Triangle","Country":"United States"}