{"Summary":"Looked like a star, changed color, moved slowly across the sky in one direction (North), disappeared, reappeared stationary, then moved slowly in another direction (West) as another object appeared.","map":"<A HREF = \"http://maps.google.com/maps?q=33.750235,+-84.385562(22772)&iwloc=A&hl=en\"> mufon case (22772) map </A>","Tags":"City","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around April 10th 2010"],"Case Number":"22772","City":"Atlanta","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"04/10/2010 05:20 UTC","Log Number":"US-04122010-0007","Object Features":"Other","Country":"United States","Date Submitted":"04/12/2010 10:01 UTC","Longitude":"-84.385562","Region":"Georgia","Latitude":"33.750235","divs":["Sighting DetailsOn Saturday, April 10, at around 5:20 pm EST, I woke up from a nap and looked out of my bedroom window. It was still bright sunshine and very high occasional wispy clouds. Other than that, the sky was blue. I looked up and saw a bright orb - It looked at first glance to be a very high flying aircraft. I'm an aircraft buff so looking up to see what's flying over is something I've always done. It took a matter of seconds to realize that it wasn't an aircraft. The next thing I thought was that it was a star. Just as I convinced myself that that was was it was, it dawned on me that it's a little too bright outside to be a star. It was then that i noticed that this thing was moving, very slowly north. At this point i knew is was something special. I grew more and more excited as i watched. I watched it a little while longer before I ran to get my camera. Brought the camera to the the window an realized that I wouldn't be able to catch it with the type of camera I had. At this point the object was crossing slowly over my house. I ran into the other room. put some pants and shoes on and ran outside. At this point, the object was over my house. As it crossed over I thought that maybe I'm seeing a satellite.\"Naw\" I thought. \"It's moving too slowly. At this point I noticed that it was also alternating colors. Orange then white then orange then white at a constant pace. I thought \"well maybe it's a mylar balloon. It was very high because it would dip behind the occasional wispy cirrus cloud. \"As I began to settle on balloon based on the speed at which it traveled, the object dimmed then disappeared as it crossed Cascade road and over the golf coarse. I stood a watched for about another 2 minutes. Then it reappeared, seemingly hovering over the golf coarse. The object hung in the sky for bout another 3 minutes, then made a course change, now headed west. As I watched it move now parallel to Cascade Road I, then, noticed a second object slowly grow brighter. Both objects hanging in the same area of sky, the first object brighter than the second. Then, after about 1 minute, both disappeared."],"files":["/var/www/straped/mufon/html2text/22772.html.txt","/var/www/straped/mufon/org/22772.html"],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere","Disposition":"Insufficient Data"}