{"Longitude":"-75.192125","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Wings","Viewing Distance":"Unknown","divs":["Sighting DetailsI just read the report from WI and viewed photos. Now I really feel like we all need to pay attention to this curiosity in our skies. Over the last few weeks, I, too, have been seeing unususl chem trails in the daytime sky. A recent report out of TN, photos and a report out of IN. And now WI. Well now you can add PA to that growing list of sightings. Report from TN states that some kind of flying vehicle keeps going back and forth creating these strange trails of white. What is so strange about this?....These chem trails don't dissapate the way you and I are familiar with. Instead, they fan out and create a false cloud cover. It is bizarre to witness! One sunny morning last week, after countless fly bys, I noted that the sky above me was now cloaked in white clouds. On the numerous occasions that I've seen this occur, I keep asking myself, what could be the purpose of this. I am beginning to wonder what someone is trying to hide or disguise! Afterall, it is the equivalent of pollution distribution. After a couple of hours there are literally lines and lines of this stuff in the sky. It ends up looking like blue and white stripes until it fans out and creates cloudiness. This is so strange to watch happening. I live on a mountain and can see alot of the sky. It's also alittle alarming. The fact that I've seen other unexplainable lights and crafts in the night sky from here only adds to the puzzle. I'm beginning to believe these events are all tied together. What do you think MUFON?"],"Country":"United States","Weather Factors":"None","Tags":"City","Summary":"Vapor trails were noticed in PA.","Date of the Event":"03/31/2010 10:00 UTC","trends":["There have been 6 other sightings in Stroudsburg","There were no other sightings in Stroudsburg on or around March 31st 2010"],"Object Flight Path":"Straight-line path","Latitude":"40.993041","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.993041,+-75.192125(22770)&iwloc=A&hl=en\"> mufon case (22770) map </A>","Case Number":"22770","Log Number":"US-04122010-0005","Disposition":"IFO","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22770.html.txt","/var/www/straped/mufon/org/22770.html"],"City":"Stroudsburg","Date Submitted":"04/12/2010 09:32 UTC"}