{"Source":"MUFON","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around April 9th 2010"],"Tags":"City","Log Number":"US-04122010-0013","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"04/09/2010 06:30 UTC","Case Number":"22777","map":"<A HREF = \"http://maps.google.com/maps?q=39.093496,+-94.410717(22777)&iwloc=A&hl=en\"> mufon case (22777) map </A>","Object Shape":"Unknown","Object Features":"Unknown","Country":"United States","City":"Independence","divs":["Sighting DetailsWitnessed in Sam's club parking lot, (I-70 & M-291), an hour before sunset. Witnessed approx. 7 to 10 \"lights\" moving west at high rate of speed. Started with white lights followed by green lights and a couple of yellow lights with two green lights at the end. Lights were spaced equidistant except for last two, which were closer together. I estimate they were at airliner altitude and the lights might have been several miles apart. The lights traversed the sky at the same altitude moving in a flat line. They didn't flash, spark, change course or size. They looked like a string of jewels in the sky. We witnessed them for approx. 20 seconds in a 60 degreee field of view before they disappeared behind Sam's club. We sat in the car for a couple of minutes trying to decide what we saw. We looked around for other witnesses, but nobody else seemed to be paying attention. We were too far away to see any craft, just lights. I am a long time plane spotter and trained storm spotter. Definitely not planes or weather balloons-they were moving way too fast for that. Definitely not a shooting star or comet. Lights were moving in a flat plane straight west. There were other jets in other parts of the sky that night and several were leaving contrails, but these left no tracks. I would estimate they were actually over Lees Summit or Grandview MO. We were completely sober. We're both from Missouri- the Show Me state and both of us feel that you would have to \"show us\" in order for us to believe. An alien spaceship would have to land in our backyard in order for us to believe in little gray men, BUT in writing this I also realize that my above description is a classic UFO sighting, which is why I'm posting this. We've seen nothing in the local press of course!"],"Summary":"lights in sky moving west at a high rate of speed","files":["/var/www/straped/mufon/html2text/22777.html.txt","/var/www/straped/mufon/org/22777.html"],"Sighting Duration":"Undisclosed","Date Submitted":"04/12/2010 02:17 UTC","Disposition":"Unknown","Region":"Missouri","Viewing Distance":"Over One Mile","Longitude":"-94.410717","Latitude":"39.093496"}