{"trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around March 13th 2010","This sighting has never been favorited.",""],"Date Submitted":"04/12/2010 06:59 UTC","Date of the Event":"03/13/2010 10:15 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.131524,+-80.077159(22783)&iwloc=A&hl=en\"> mufon case (22783) map </A>","Log Number":"US-04122010-0019","Source":"MUFON","Case Number":"22783","Summary":"Looking Out Window to the West-To-North West toward lake erie","City":"Erie","Disposition":"IFO","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/22783.html.txt","/var/www/straped/mufon/more/22783_submitter_file1__UFO.JPG","/var/www/straped/mufon/more/22783_submitter_file2__UFOcrop.jpg","/var/www/straped/mufon/more/22783_submitter_file3__UFOedited.jpg","/var/www/straped/mufon/org/22783.html"],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Shape":"Fireball, Flash, Oval, Sphere, Star-like","divs":["sighting detailsi was doing some star gazing with my 20x80 astronomical binoculars trying to get a good view of mars to the direct west. i then noticed a brightly light pulsating light that appeared to have a rotation of colors (red\\blue\\yellow) off on the distance towards the shores of lake erie, in erie pa. i tried using my bino's but hand shake was too much, so i then went to my kodak z612 digital camera that has a 2x tele-converter matched to the already strong 12x digital zoom or 420mm (2x) doubled together (840x). i live on the higher portion of erie on what is called chestnut hill on or above of west grandview blvd with a panoramic view of the city and shoreline. i first took video of the object for a few seconds but zoom in video mode in very limited. i then switch to photo mode with the settings still set for mars with with a longer shutter speed and aperture settings. it was only visible for about 10 minutes and stayed stationary the whole time in relation to the stars and planets (mars) in the same sky shot. i was very excited and kept trying new ways and camera settings but the last time or about 10 minutes in length i returned to the window the last time and it was gone! the attached photo is the only one i got off minus the brief video that i mistakingly deleted, which only showed a long off blinking light anyway. i have submitted 3 versions, first one is the un-edited version, the second is the cropped version and the last is the color inverted image that shows it is a solid object versus the black sky. i am looking for someone to match up the light pattern, colors and placement to some sort of terrestrial aircraft or to confirm my sighting as a ufo event. thank you."],"Latitude":"42.131524","Region":"Pennsylvania","Longitude":"-80.077159","Object Flight Path":"Stationary,Hovering then path"}