{"Tags":"City","Region":"Pennsylvania","Longitude":"-75.161949","Summary":"Witnessed boomerang shaped object when crossing over Ben Franklin Bridge","Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=39.956965,+-75.161949(22789)&iwloc=A&hl=en\"> mufon case (22789) map </A>","Source":"MUFON","Log Number":"US-04132010-0002","Weather Factors":"None, Does Not Apply","divs":["sighting detailsi went to pennsylvania for a weekend vacation. when we were driving back, we took the ben franklin bridge back into nj. as we were on it, i noticed off to my right there was a stationary object above the water about a mile from my location. the object was also sort of hazy. as a bridge support went by my vision, the object was gone from the area that i originally viewed it. i then saw it approx. 2 miles to the east a second or two later. it once again was stationary. it was in the same position in the air and strangely did not increase or decrease in size even though my distance from it changed. while moving down the highway, it was obscured by trees for a couple seconds, then it was gone when i was able to see it's location again. i looked all around the area however could not get any other location on it. i remember thinking to tell the other four people in the car with me but for some reason, i didn't tell anyone about it until later that night. the entire event may have lasted about 10 seconds from start to finish. the object could have been easily seen by anyone in the area due to its location was in a wide open area of the sky over the water. this object should have been recorded on the radar of the philadelphia airport. it was well within reach and the area of that airport. judging by my memory of its location, it was probably closer to the walt whitman bridge than the ben franklin bridge. even if i was mistaken on this object and it was a plane, the shape was close to a proper \"l\" shape and to relocate to its second location, the \"plane\" would have had to be flying backwards. not possible. this event took place on 04\\11\\2010 at approx. 3:30 to 4:00 pm est."],"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/22789.html.txt","/var/www/straped/mufon/org/22789.html"],"Object Features":"None","Latitude":"39.956965","Object Shape":"Boomerang","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Stationary","Country":"United States","Date Submitted":"04/13/2010 04:15 UTC","Date of the Event":"04/11/2010 03:30 UTC","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around April 11th 2010"],"City":"Philadelphia","Case Number":"22789"}