{"Source":"MUFON","trends":["There have been 7 other sightings in Hot Springs","There were no other sightings in Hot Springs on or around April 11th 2010"],"Object Features":"None","divs":["Sighting DetailsI was driving home from a friends house about 11:48 pm when I noticed this huge bright ball of light in the sky. At first, I thought it might be a porch light on top of a hill. So I kept my eye on it but soon noticed that it was moving. I watched it for about a minute but then it disappeared. I was about to call my husband around 11:52 pm but then I heard this humming noise. Almost like a woman humming softly. So I rolled down my windows some more and it got louder. All of a sudden I had this overwhelming need to look up out of the sun roof and as I did I saw this huge ball of light again blocking my view of the sky. It had no detail but it was like looking at the sun except for the fact that instead being orange it was white. And I could tell the humming was coming from it. But the thing that bothered me the most was that the light coming off this UFO didn't shine onto my vehicle. It didn't cause any other the surrounding area to light up or be seen. It went across the sky, blocking my view for about 3 seconds, then disappeared. I looked back at the road and realized I had come to a complete stop in the middle of the road. I quickly started driving again and looking around to see if it would reappear. I called my husband and told him about the finding right away. Ever since I saw it.. I've been seeing glimpses of shadows. I thought maybe it was my glasses but when I took them off I was still seeing things walk in front of me. I'm also terribly too hot. And nothing seems to cool me off. Plus, I'm easily agitated now. A lot more then I've ever been."],"Date of the Event":"04/11/2010 11:48 UTC","Region":"Arkansas","City":"Hot Springs","Tags":"City","Summary":"Driving home from a friends house and say this huge bright like in sky. Soon the bright light was over my car but not shining on my car.","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-93.04886","Latitude":"34.51238","Log Number":"US-04122010-0022","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/22786.html.txt","/var/www/straped/mufon/org/22786.html"],"Object Shape":"Circle, Fireball, Sphere","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/12/2010 11:27 UTC","Weather Factors":"None, Does Not Apply","Case Number":"22786","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.51238,+-93.04886(22786)&iwloc=A&hl=en\"> mufon case (22786) map </A>"}