{"Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 3 other sightings in Keene","There were no other sightings in Keene on or around October 15th 1967"],"Date of the Event":"10/15/1967 12:00 UTC","City":"Keene","Summary":"One, then two start like objects that changed color and moved about the sky in random patterns","Viewing Distance":"Unknown","Object Features":"Undisclosed","Case Number":"22788","files":["/var/www/straped/mufon/html2text/22788.html.txt","/var/www/straped/mufon/org/22788.html"],"Object Shape":"Star-like","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Date Submitted":"04/13/2010 04:13 UTC","Region":"New Hampshire","Log Number":"US-04132010-0001","Country":"United States","Longitude":"-72.272421","divs":["Sighting DetailsMy family has just returned from grocery shopping on a Friday night, in the Fall of 1967, October I think, but it also may have been Sept. It was a clear night, no clouds in the sky. We lived on the edge of a recently developed neighborhood on the outskirts of Keene, NH, so behind our house was forest and very little in the way of ambient light. My parents called me to the back yard from my bedroom and I went out to join them and watch a strange light in the sky. The light was like a very bright star, and it was at about 60-75 degrees above the western horizon. It changed color from red to green to blue to yellow to white as it moved in a fairly tight formation up, down, to the right, to the left, down, up, and in zig zag patterns. There was no noise, and we watched in awe as it continued its color changes and slow random movements across the sky. Within a few minutes, another star like object appeared near it, also changing color and moving around randomly. The objects were fairly close together when an arc of light moved between them, back and forth. One of the objects then disappeared as the remaining object continued its random movement, until it moved lower in the sky and became obscured by the tree line of the forest in our back yard. I was only 8 years old at the time, but I remember this incident clearly. My parents and I were clearly freaked by this incident. My dad called the police and reported the sighting, and I believe there was an article in the paper, the Keene Sentinel, about the sighting from several observers in the town."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.934692,+-72.272421(22788)&iwloc=A&hl=en\"> mufon case (22788) map </A>","Latitude":"42.934692","Source":"MUFON"}