{"map":"<A HREF = \"http://maps.google.com/maps?q=57.7,+13.483333(22781)&iwloc=A&hl=en\"> mufon case (22781) map </A>","Object Shape":"Oval","Latitude":"57.7","Object Features":"Unknown","Disposition":"IFO","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"04/12/2010 04:47 UTC","Sighting Duration":"Undisclosed","Country":"Kingdom of Sweden","Longitude":"13.483333","Case Number":"22781","Object Flight Path":"Hovering then path,Straight-line path","City":"ÃƒÂ„ngabo","Source":"MUFON","Date of the Event":"10/30/2009 02:30 UTC","Summary":"On October 30, 2009 and other dates as well I experienced UFO sightings in the mountains of Puerto Rico. I began taking pictures with my camera and zooming the picture in only confirmed my suspicions of this sightings as you will see attached,","Log Number":"PR-04122010-0017","Tags":"City","files":["/var/www/straped/mufon/html2text/22781.html.txt","/var/www/straped/mufon/more/22781_submitter_file1__Chu047.JPG","/var/www/straped/mufon/more/22781_submitter_file2__Chu042.JPG","/var/www/straped/mufon/more/22781_submitter_file3__Chu086.JPG","/var/www/straped/mufon/org/22781.html"],"Region":"VÃƒÂ¤stra GÃƒÂ¶taland County","trends":["There have been no other sightings in Ängabo","This sighting has never been favorited."],"divs":["Sighting DetailsI experienced in Naguabo Puerto Rico a UFO sighting. I looked up at the mountains and began taking pictures of the view when I noticed a black spot through the camera. When I removed the camera from my eye and tried to look for my self I could not see anything. But when I focused again with my camera I saw a black dot in the sky towards the mountains. I was so nervous when I saw this obscure object, I just felt chills all over my body. I then returned home and my wife zoomed into the photo with the camera and we noticed it was some sort of UFO. My wife then downloaded the pictures onto her laptop where we were able to take a closer look and believed it was a UFO. After I experienced this I began taking more pictures, on November 7th 2009 and noticed another UFO with my camera. I have several pictures with these sightings. The last time I saw a UFO was by my home in January 2010."]}