{"Country":"United States","Weather Factors":"Unknown","Log Number":"US-04132010-0012","Source":"MUFON","trends":["There have been 4 other sightings in Alexandria","There were no other sightings in Alexandria on or around June 30th 2008"],"Viewing Distance":"Over One Mile","Date Submitted":"04/13/2010 02:40 UTC","files":["/var/www/straped/mufon/html2text/22799.html.txt","/var/www/straped/mufon/org/22799.html"],"Latitude":"45.884258","Date of the Event":"06/30/2008 12:00 UTC","Object Features":"None","Longitude":"-95.373978","Tags":"City","Region":"Minnesota","Summary":"Multiple star like lights hover in the sky and then took off at high rate of speed","Object Shape":"Star-like","City":"Alexandria","Case Number":"22799","divs":["Sighting DetailsMy Father, Fiance, and I were camping at a Lake. We were the only 3 left camping that night as everyone else had gone home. We were standing by the camp fire when we decided to go out onto the dock to look at the stars. Since there is not a lot of light out in the country we could see tons of stars. We saw shooting stars, we saw satellites, we saw planes, everything that you would expect to see when looking up at the stars at night. However i noticed a star-like light moving across the sky at a slow rate of speed, it then stopped, stayed still for about 10-15 seconds and then it shot back across the sky in the same direction it came at a high rate of speed and then disappeared. About 20x faster than it was moving before. After seeing this i thought to myself \"ok, thats weird maybe its just a new satellite or something \" and then my fiance saw the same thing in a different part of the sky. All three of us saw about 5-6 of those star-like lights in different part of the sky. We were very excited but yet skeptical at first. But after we saw the same thing 5-6 times in different areas of the sky, we thought \"what else could it be?\" And each time it would move slowly across the sky, come to a stop for about 5-10 seconds and then jet off at a high rate of speed that direction it came from and then disappeared. In all my years of stargazing and camping i have never seen anything like that and neither had my father or my fiance."],"Disposition":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.884258,+-95.373978(22799)&iwloc=A&hl=en\"> mufon case (22799) map </A>","Object Flight Path":"Other"}