{"Summary":"Mix between a sphere and a disc ( no sharp edges-more rounded).","City":"Syracuse","Sighting Duration":"00:05:00","Date of the Event":"09/05/2009 12:00 UTC","Object Shape":"Disc, Sphere, Other","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Stationary","Longitude":"-76.146104","Region":"New York","Case Number":"22795","Date Submitted":"04/13/2010 09:56 UTC","Weather Factors":"None","Object Features":"Unknown","Log Number":"US-04132010-0008","Country":"United States","divs":["Sighting Details I was looking out over the city of syracuse from the north (app. 1mile north of the city line in Mattydale. I just happened to look out my computer room window and i saw it flashing in the sky. The colors were that of the rainbow and they were swirling around the horizontal face of the object. No sound( that i could hear )and no movement ( in any direction )that i could make out. I looked for about 5 minutes and for the life of me i cannot explain why i didn't grab my phone and take a picture. I admit i was a little scared and by the time i collected my thoughts and came to terms with what i was looking at i opened my window so i would have an unblocked (by the window) line of sight on the object. i went outside and stared for maybe 5 to 10 minutes and then i just came inside and went to bed. I have been very puzzled with my behavior during the siting because i had always told myself i would take a picture if i ever saw anything like that. But i was honestly in shock in a way and didn't think once about taking a picture until the next morning. I didn't tell anyone for awhile and as the months went by a started to think more and more about it and to question myself. I have never seen anything that I could not account for with conventional wisdom but this challenged my worldview a little bit ( actually alotta bit ). I just thought that since i had no physical proof that noone else would care what i said i saw but i really hope that your organization can assist me in making sense of it. ...I do appreciate your efforts and thank you for your time Sin, Eric Flynn"],"trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around September 5th 2009"],"files":["/var/www/straped/mufon/html2text/22795.html.txt","/var/www/straped/mufon/org/22795.html"],"Latitude":"43.055102","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.055102,+-76.146104(22795)&iwloc=A&hl=en\"> mufon case (22795) map </A>"}