{"Country":"United States","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/22792.html.txt","/var/www/straped/mufon/org/22792.html"],"Date Submitted":"04/13/2010 07:36 UTC","Sighting Duration":"Undisclosed","Object Shape":"Egg, Oval","Case Number":"22792","Summary":"Camped by a fence on way to Texas on motorbike. rocket tower was off road on hwy we on. gov fence no trespassing on sign on fence.","Region":"California","Latitude":"35.373292","Log Number":"US-04132010-0005","Source":"MUFON","Object Features":"None","Longitude":"-119.016832","Tags":"City","Viewing Distance":"101-500 Feet","City":"Bakersfield","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around September 12th 1974"],"Date of the Event":"09/12/1974 03:00 UTC","divs":["Sighting Detailsmy friend at time talked me into driving him to twin falls texas to see a uncle that had been sick and was dieing? on a 350 cc. honda so he said. first night on road we stopped by a fence to camp by road in sleeping bags. left bakersfield ca.(kern) going east to hwy 40 stopped around 12pm to camp by fence marked gov. prop.no trespassing could see a rocket tower off road. mile or more away. parked bike rolled out bags. and got warmer as it was cold. I had just got out of NAVY four months before . jorden warden was guy saw 3 things we saw? a guy next day came out of base on a chopper hd (moterbike) and had been on radar see it was going 10.000+ was told by his comm. to write it up as a broke down. I got up to water fence at 3am. saw 3 lights east of my point. thought it was street light off in destert on road as it was in line with fence ? thought it might be over pass on road.? but looked again later and saw lights moving toward me spaced just so that it looked like spaced street lights but was a large light, a med, size like and a smaller sized egg shaped like steet light ? as me being ex navy and know fences get check by guards I got my flash light out as I had jeans on under camo to stay warm but look like a combat fighter and did not want to be shot by guards in copper huey! so I lit flash light and pointed it at lights thinking it was floodlamp on hueys but no sound was heard . big one was two hundred ft or more egg shaped and came down by me I woke up guy with me to see it and he said I was a ufo and went back to sleep. tmbleweeds moved like a huey was landing but no sound ? light looked like it had no outline just translosent white shape two lights went over rocket tower and did the three move like movie thing. close enconters. i was so shaken I set an looked at it and til day light as lights slowed and two left to west fast and made a strek of light so fast. big one just went over base and as light of dawn came up. it got higher and higher and as it got to colder air of next layer of sky it turned into a cloud and moved off to west at 30.000 ft . next day was starting bike and guy from base came out going home. ask me if I need help as bike was not starting easy had to kick it many times . he was radar watch that night asked if I saw any thing like 3 round shape moving high speed as it was to fast for earth things . he reported and was told to just write up report breakdown on radar at that time and speed he reported. I told him I saw it too. but friend was back to sleep as he thought he was dreaming. I am reporting this now as I saw on mufon tv show a guy three guys saw very near same thing. I do have time lapes as two weeks out and back to bakersfield. and next time i drove a van past same spot comingfrom reno nv to bakersfind ca, saw a green metor going west copper color burning trail. might have been seen by more people. end call me."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.373292,+-119.016832(22792)&iwloc=A&hl=en\"> mufon case (22792) map </A>","Weather Factors":"Unknown","Disposition":"Unknown"}