{"Disposition":"Unknown","Viewing Distance":"Unknown","Date Submitted":"04/13/2010 05:43 UTC","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/22791.html.txt","/var/www/straped/mufon/org/22791.html"],"Region":"New Hampshire","Case Number":"22791","trends":["There has been one other sighting in Kingston","There were no other sightings in Kingston on or around November 30th 1976"],"Log Number":"US-04132010-0004","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Kingston","Country":"United States","Date of the Event":"11/30/1976 12:00 UTC","Tags":"City","Object Features":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsThere was alot of ufo reports and indentations in ground in Kingston. Went with my mothers friends son who was 18 or so. He just got his license so wanted to go specificaly UFO hunting. I lived in Exeter at the time so we had traveled to Kingston. We pulled over the side of the road where there was this wooded hill. As soon as we parked and got out of the car this flying object came over the horizen. Then it immediately reversed direction. This is how we knew it wasn't a plane. Then it slowly dropped appearing as if it landed in the woods. I being 9 years old started running in the field until I came the the woodline. At that point I got scared as we had no flashlight to guide us through. Then we ran back to the car and left quickly amazed at what we just saw. The object was round and my memory is faded as to what the lights were like. The biggest impression I had was that this thing landed. Didn't actualy see it land but saw it gradualy lower itself until it went out of site into the woods. It was close enough though to where I felt it reachable if we vetured into the woods. The fact that it reversed direction without turning around was eye catching as well. I often wonder if we could have had an alien encounter. I don't remember if we did. I just know what I saw this night. There was a witness with me whom I haven't spoken with in years. He was 18 and I don't ever remember discussing this incident with him either."],"Summary":"object came over the sky then reversed in same direction then landed in woods","Longitude":"-71.052233","Object Flight Path":"Undisclosed","Latitude":"42.9411","map":"<A HREF = \"http://maps.google.com/maps?q=42.9411,+-71.052233(22791)&iwloc=A&hl=en\"> mufon case (22791) map </A>"}