{"files":["/var/www/straped/mufon/html2text/22798.html.txt","/var/www/straped/mufon/org/22798.html"],"trends":["There have been 22 other sightings in Terre Haute","There were no other sightings in Terre Haute on or around April 11th 2010"],"Case Number":"22798","Country":"United States","City":"Terre Haute","Summary":"Triangular with bright white lights that turned bright red that did not blink","Source":"MUFON","Object Features":"Unknown","Latitude":"39.472313","Sighting Duration":"Undisclosed","Date Submitted":"04/13/2010 12:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.472313,+-87.405309(22798)&iwloc=A&hl=en\"> mufon case (22798) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/11/2010 10:00 UTC","Weather Factors":"None","Region":"Indiana","Disposition":"Unknown","Longitude":"-87.405309","Log Number":"US-04132010-0011","Tags":"City","Object Shape":"Triangle","divs":["Sighting DetailsMy husband and I witnessed a fast moving very bright white light that came from the east and immediately turned red when it slowed down more toward the north. I had initially thought it was a low-flying plane until I noticed that the lights did not blink and it seemed to be moving faster than a plane until it came to an abrupt halt and all the white lights immediately turned red. It moved to the southwest, (where it appeared to hover for a awhile over I-70) before heading back toward the northeast again. This happened sometime between 9:45pm and 10:30pm. We pulled off the street into a vacant lot to watch it go overhead. I stayed in the car, but my husband stood outside our vehicle and watched as it slowly passed over us. He described the underside view as a triangle with distinct bright red lights at the corners. There were no green or blue blinking lights just very bright glowing red lights that did not blink. My husband said he could hear a slight humming sound as it passed, but I didn't hear anything from inside the car. It's hard for me to say how low it actually was...my best guess would be about 1000 ft. The object never returned to the bright white color I had initially seen, it just remained red until it went out of view. Also, when this happened, we were on our way to the gas station, but, our usual station was having system difficulities. So, we went out of our way to try another and their systems were down during this time as well. We do live near the air national guard and a small airport, but this did not look or sound like a plane to us. I'm a skeptical person for the most part and not one to \"report UFOs\" but, I would like to know if there may be a logical explaination for what we saw or if anyone else witnessed it. I must say, this experience has made me curious."],"Object Flight Path":"Straight-line path,Path then hovering"}