{"map":"<A HREF = \"http://maps.google.com/maps?q=36.550061,+-85.505247(22805)&iwloc=A&hl=en\"> mufon case (22805) map </A>","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/22805.html.txt","/var/www/straped/mufon/org/22805.html"],"Case Number":"22805","trends":["There have been no other sightings in Celina","This sighting has never been favorited."],"divs":["Sighting DetailsIt was the summer of 1987 approxiamtely and I was with my mom and sister visiting a friend of my mothers in Celina Tennessee. It was in the early evening and we were all outside the house I know there were several adults including my mother outside. We had decided to make icecream with an electric icecream maker and I knew I needed to go inside I was looking for a toy or something to play with. Around 15 minutes had gone by and I remember my mom yelling at me to come out of the house, and I was walking across the yard and she was at the road with everyone else.. I remember getting up to them and looking at her and asking what she wanted when I noticed they were all looking up and as I did I saw this massive ship. I think city block or rather several city blocks would be the description. To give a good idea I use the relevance in size of a aircraft carrier ie 1000 feet long and 20 ~ 30 stories high... except it was one huge block, Dark in complection... black or dark gray and had a millon windows lit up in white lights.. just like looking at city building at night .. perhaps in chicago or any major city. The width was close to the same height or a little less. No noise what so ever emitted from it and the air was not blowing or so light that you couldnt notice it. The object was coming almost directly up the road ie when I walked down to it from the house it was on my left and was going between 1 and 5 mph ... I am guessing but I do remember I could have walked with this it was so slow. It was very close to the tree tops, guessing I would say the trees were a 100 feet and the ship would be half the height of the trees above or less. So 150 feet directly over my head, always thought about throwing a baseball at it... but then again.. was scared at the time if this was so powerful.. it would do what to retaliate possibly lol. Ok so the object was within site of the house for 10 -15 minutes and it slowly disappeared into the center of the town. Now back to the icecream, I remember the icecream very specifically because 30 min latter we needed salt for it... so we drove 1 - 2 miles down the road or less and stopped at a lil conveince store and the object was just leaving the baseball fields directly overhead where everyone had s topped to watch. There is a newspaper writeup where the army claimed this object was a baloon of some sort.. which is not even realisitc with the design of the object. I am in the navy and have never even seen or heard of anything like this and am trying to simply know if anyone has a copy of the article or knows of how to obtain it. As far as anything different in myself or my family I don't recount any or have ever seen another UFO again in my life. Except for the occasional shooting star."],"Object Features":"Window(s)","Object Shape":"Square, Rectagular","Weather Factors":"Does Not Apply","Summary":"Rectangular small city close to the size of a aircraft carrier","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Latitude":"36.550061","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-85.505247","Date Submitted":"04/13/2010 10:23 UTC","Country":"United States","City":"Celina","Date of the Event":"11/30/1986 12:00 UTC","Log Number":"US-04132010-0018","Tags":"City"}