{"Object Flight Path":"Path with directional change","Latitude":"35.197653","Country":"United States","Object Shape":"Sphere","Object Features":"Unknown","Longitude":"-114.046306","Region":"Arizona","Log Number":"US-04132010-0015","Summary":"was traveling fast then switched directions in the western sky","Tags":"City","City":"Kingman","map":"<A HREF = \"http://maps.google.com/maps?q=35.197653,+-114.046306(22802)&iwloc=A&hl=en\"> mufon case (22802) map </A>","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 35 other sightings in Kingman","There were no other sightings in Kingman on or around April 4th 2010"],"divs":["Sighting DetailsI was outside our house in Golden Valley Arizona, looking west towards the mountains and up at the stars. At approx 8pm I noticed a bright light circular in shape in the western sky at about the 10 o'clock position. it was traveling at a fast rate of speed going from left to right. at first I thought it was a plane, (though I never saw a plane go that fast), when it suddenly went straight down to about the 6 o'clock position. Then just as suddenly it flew straight back up to approx the previous position and flew from right to left, then disappeared. I searched the sky to see if I could see it again when I noticed a similar object due south at 11 o'clock going back and forth at a great rate of speed, again occasionally dropping down before changing directions. It then flew straight up into the clouds and I lost sight of it. I saw no other lights on or around this object, and from where I was standing the object was approx the size of a pencil eraser. I had not been drinking any alcohol or smoking anything. I am not on any anti psychotic medications. I first thought it was a plane, then when it dropped I thought shooting star. I never took my eyes of the object so when it changed positions and directions so rapidly I knew in my heart it was not something I had ever seen and that is was a UFO. I was so excited I called my husband in Calif to let him know. Our house in Arizona is approx 90 min southeast from Vegas, near the Colorado River."],"Date Submitted":"04/13/2010 03:37 UTC","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/22802.html.txt","/var/www/straped/mufon/org/22802.html"],"Sighting Duration":"Undisclosed","Date of the Event":"04/04/2010 08:00 UTC","Disposition":"Unknown","Case Number":"22802","Source":"MUFON"}