{"Log Number":"US-04132010-0020","trends":["There have been 7 other sightings in Kent","There were no other sightings in Kent on or around April 6th 2010"],"divs":["Sighting DetailsMy coworker mentioned to me this last weekend that somewhere near the 6th or the 7th he was driving south on I-5 and noticed 4 vehicles pulled over on the east side of the freeway, watching something going on over a lake (Unsure the name of the lake) between 272nd and 317th. He said he then saw a cylinder about 200' above the water, very bright lights flashing and they weren't red or green, which might indicate a known aircraft. He also said that the object seemed to be slowly rotating. I tried looking the event up and haven't found any reference to it, and with no other explination present, I'd call it a UFO. I told him this and he didn't want it called that LOL. I explained that if he didn't know what it was, then it was Unidentified, it was Flying, and it was an Object, and that it didn't nessisarily have anything to do with aliens. Unknown for most factors. I also do not know who the other witnesses were. Merely reporting because it should be. I believe 99% of sighting have some sort of explination, and in the event that this particular one doesn't, than you've got some place to start or looking. \"P\""],"Longitude":"-122.227943","Weather Factors":"None","Summary":"Dark, Cylinder with varied very bright flashing lights. It rotated.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.384394,+-122.227943(22807)&iwloc=A&hl=en\"> mufon case (22807) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Region":"Washington","Object Shape":"Cylinder","Disposition":"Insufficient Data","Date of the Event":"04/06/2010 05:00 UTC","Case Number":"22807","Object Features":"Unknown","Date Submitted":"04/13/2010 10:47 UTC","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/22807.html.txt","/var/www/straped/mufon/org/22807.html"],"City":"Kent","Latitude":"47.384394"}