{"City":"Mexican Hat","Object Features":"None","Viewing Distance":"Over One Mile","Date of the Event":"10/07/2005 12:00 UTC","Latitude":"37.151946","Object Shape":"Boomerang, Flash","Weather Factors":"None","trends":["There have been no other sightings in Mexican Hat","This sighting has never been favorited."],"divs":["Sighting DetailsOn October 7, 2005 my husband, 3 year old, and I were hiking in Monument Valley, UT. It was a spectacular cloudless autumn day. My husband was taking pictures when we saw a shiny curved object in the sky. We both assumed it was a hanglider, but it seemed very high. We were trying to figure out where a glider would launch to be where it was. We watched it for a few minutes a bit puzzled, because it didn't move through the sky like a typical glider. This one went across and wasn't turning - a very odd motion for a glider. The object went across the sky, then became brighter - we thought it was turning and catching the sun's reflection. It suddently flashed bright, and was gone. We kept looking around, but didn't see anything. We looked at each other, as if to confirm we actual saw something. We just kind of accepted it as an odd site, and my 3 year old kept asking 'where'd the glider go?' I recently downloaded a picture disc, and came across our trip to Monument Valley. There were two photos with the shiny \"hanglider\" in it. The pictures show it to be sphere shaped, but we saw a shiny curve-like object."],"Summary":"Shiny object in the sky.","Region":"Utah","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=37.151946,+-109.867066(22812)&iwloc=A&hl=en\"> mufon case (22812) map </A>","Source":"MUFON","Longitude":"-109.867066","Case Number":"22812","Log Number":"US-04142010-0003","Country":"United States","Date Submitted":"04/14/2010 12:32 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/22812.html.txt","/var/www/straped/mufon/more/22812_submitter_file1__so.utahoct05014.jpg","/var/www/straped/mufon/more/22812_submitter_file2__so.utahoct05015.jpg","/var/www/straped/mufon/org/22812.html"]}