{"map":"<A HREF = \"http://maps.google.com/maps?q=41.886694,+-87.625998(22818)&iwloc=A&hl=en\"> mufon case (22818) map </A>","Object Shape":"Boomerang, Triangle, Unknown","Country":"United States","Region":"Illinois","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around April 4th 2010","This sighting has never been favorited.",""],"City":"Chicago","Object Features":"Wings","Date of the Event":"04/04/2010 12:00 UTC","Weather Factors":"Unknown","divs":["sighting detailsi first noticed a large c shaped dark object that looked like a large boomerang or c shaped; cloud?, cloaked military craft?, ufo?, idk object, manifest then get hit by lightning in the sky over chicago. it was easter sunday 4\\4\\10. what's interesting is that a part of the lightning strike forms what i think looks like a cross and halo above a symbol of a man in the video recorded on easter sunday, but that's my opinion. the lightnings path is from north to south, goes up,(separates,disappears,is blocked?) and continues on a downward path out of frame. i personally believe the lightning was harnessed by 4d et craft using the earth's natural free energy but that is novice guess and again \"only my opinion\". thanks for letting me share my sighting mufon. fyi if you watch the video i translated my own perspective as to what i was recording in the comments of the youtube video b\\c it seemed to me the ets knew they were being recorded and projected a message in the split second of the lightning's flash. -guttergawker http:\\\\www.youtube.com\\watch?v=lue8ude4vkq"],"Viewing Distance":"Unknown","Latitude":"41.886694","files":["/var/www/straped/mufon/html2text/22818.html.txt","/var/www/straped/mufon/more/22818_submitter_file1__lightning2.jpg","/var/www/straped/mufon/more/22818_submitter_file2__lightning6.jpg","/var/www/straped/mufon/org/22818.html"],"Disposition":"IFO","Object Flight Path":"Undisclosed","Longitude":"-87.625998","Tags":"City","Log Number":"US-04142010-0009","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"22818","Date Submitted":"04/14/2010 05:07 UTC","Summary":"LIGHTNING STRIKES MANTA RAY LOOKING OBJECT?"}