{"divs":["sighting detailswe were on our way home from kc from my mother in laws funeral and was turning down bb highway going east about 5 miles from 65 highway that is between the towns of warsaw and lincoln missouri. we were going east when we saw large bright object in the sky that was not a plane, not anything but a ufo. it was square, as silly as it sounds my husband thought it looked like a usa flag at first. it was like just hovering there over the highway up ahead and then darted over to the left (north) husband said some red and blue and mostly yellow lights. he told me to look (i was doing a text message at the time) and looked up and saw the very bright yellow lights and then saw it over the woods to the left (north). keep looking but did not see it again. got to a clearing but did not see it again. i wanted to call the sheriff dept but husband said that they would think we were crazy. i really wish i had not seen it. back many years ago in the late 70's we saw one but it was more like a muffin pan....made a report a couple years ago with your group. 1. explained that 2. the bright lights in the sky 3. just did not know..... 4. just kind of like floating there, lights extremely bright. started across to the left and just got off over the woods and did not see again. 5. just shook up. called son to tell him we got home ok and told him about it. 6. it just went off into\\over the woods"],"Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","trends":["There have been 3 other sightings in Warsaw","There were no other sightings in Warsaw on or around April 13th 2010"],"Date of the Event":"04/13/2010 10:13 UTC","Latitude":"38.251781","files":["/var/www/straped/mufon/html2text/22810.html.txt","/var/www/straped/mufon/org/22810.html"],"Country":"United States","Longitude":"-93.373601","Region":"Missouri","Log Number":"US-04142010-0001","Disposition":"Unknown","Summary":"Big square with bright yellow lights around edges","City":"Warsaw","map":"<A HREF = \"http://maps.google.com/maps?q=38.251781,+-93.373601(22810)&iwloc=A&hl=en\"> mufon case (22810) map </A>","Object Features":"Unknown","Date Submitted":"04/14/2010 12:12 UTC","Case Number":"22810","Sighting Duration":"00:01:45","Object Shape":"Square, Rectagular","Tags":"City","Source":"MUFON"}