{"Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet","Object Features":"Insignia","Log Number":"US-04152010-0001","map":"<A HREF = \"http://maps.google.com/maps?q=35.763263,+-79.01437(22827)&iwloc=A&hl=en\"> mufon case (22827) map </A>","Disposition":"IFO","Summary":"Have never seen these kinds of UFO before?","Region":"North Carolina","Object Flight Path":"Hovering then path,Other","Longitude":"-79.01437","Country":"United States","Date Submitted":"04/15/2010 12:04 UTC","City":"Undisclosed","trends":[""],"Case Number":"22827","Weather Factors":"Unknown","Tags":"City","Date of the Event":"04/04/2010 03:03 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22827.html.txt","/var/www/straped/mufon/org/22827.html"],"divs":["Sighting DetailsI was getting my usual photo's of UFO's per night and since this is a hot-spot for UFO's in Durham..Duke St facing west and south area. I recieved my pictures after down load and found other UFO's that I would have missed if I hadn't have used a digital camera from a certain pharmacy that sell vivitar digital mini-camera's..Great for Night pictures of stars and whatever else...And CVS has never pais me a penny for any coments. I just know that I have almost a camera that basically would have been a 20.00 camera..I found out in my work with robots and making them run around the room on sollar power.And noticing getting a light(s) in the dark and with all lights out. So, I thought that I could find UFO's the in the same manner. By concentrating on the bio-illuminessant ship that they are flying. Weither it be dark matter(Dark light)will be on the negative segment of the wavelegnth of light from the ships or so called UFO's. Or light matter or in our light spectrum which is possitive matter.( Light) I , Mr. D.w.Howerton, believe that and have proof that saucers exist and visits are getting more and more prevallant. I think this area is getting highly active and needs people here to videotape this to teach others what to look for and what to do in case this happens to You???"],"Latitude":"35.763263","Object Shape":"Disc, Teardrop, Unknown"}