{"files":["/var/www/straped/mufon/html2text/22828.html.txt","/var/www/straped/mufon/org/22828.html"],"Source":"MUFON","City":"Parkville","Object Features":"Undisclosed","Summary":"slow falling slight angle yellow fireball with explosion","Date of the Event":"04/14/2010 12:00 UTC","divs":["Sighting Detailsat approx. 1015 pm while exiting I435 onto 45hwy my wife brought my attention to a slowly falling yellow object that appeared to be like a falling star but much larger and slower. It appeared as if it was on fire. it appeared to go from yellow to green (maybe the color change was due to obscuring of the object from clouds?) it was a fairly clear night though??? then it went to yellow again then our vision was obscured due to the low level of the falling object behind trees then a large flash of yellow light like it exploded. (the explosion was like when a transformer blows) we were facing North while exiting the interstate and were looking in the direction of KCI airport. It appeared to fall east of I435 and north of HWY 152. While I cannot be certain of its distance away from us due to it being dark.... it looked like it was just west of the Airport. 911 was notified, Platte county dispatch transferred the call to KC, MO 911 operator. the operator did tell me that i was not the only person to report this that a couple of other people had called. no photos sorry...."],"Longitude":"-94.682181","Date Submitted":"04/15/2010 12:27 UTC","Disposition":"IFO","Tags":"City","Log Number":"US-04152010-0002","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Parkville","There were no other sightings in Parkville on or around April 14th 2010"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.195003,+-94.682181(22828)&iwloc=A&hl=en\"> mufon case (22828) map </A>","Case Number":"22828","Weather Factors":"Unknown","Latitude":"39.195003","Object Flight Path":"Undisclosed","Region":"Missouri","Object Shape":"Fireball","Sighting Duration":"Undisclosed"}