{"map":"<A HREF = \"http://maps.google.com/maps?q=29.429122,+-98.488028(22825)&iwloc=A&hl=en\"> mufon case (22825) map </A>","Date Submitted":"04/14/2010 06:36 UTC","Summary":"Brightlight (UFO) then a Massive Star-like explosion","divs":["Sighting DetailsApril 13, 2010 - Approximate 10:05PM - Clear Sky - Moon cycle is on Waning Crescent - Sunset was at 8PM Local (US Central)- The temperature was recorded at a low of 60 degrees last night, down from a high 76 degrees Fahrenheit. I was washing my truck at a car wash located on West Hilderbrand Ave near the crossroad of Aganier Ave. The car wash is located 6 miles north of downtown San Antonio, Texas. My truck (1998 Dodge Durango) is parked in a stall facing south. I was standing at the rear of my truck when a Bright-light (UFO) was reflecting off the back window down from the stars above. I quickly turned around and tilted my head up to the Bright-lighted (UFO)'s direction. My bodies position is facing due North. My left and right is parallel with the Hilderbrand Ave. The Bright-light (UFO) continues to brighten with no sound. I quickly noticed that the Big Dipper was up and to the right of the increasingly Bright-light (UFO). I stretched my right arm out and put my right hand up and was able to measured three finger width below from the lower left Big Dipper star (Dubhe). If you follow a straight line from Merak throw Dubhe like your looking for the North Star, this Bright-light UFO was positioned about two fingers width to the left of that line. The Bright-light UFO was about the size of the Dudhe star when I first noticed it, then its size or brightness increased to about three times the size of the Dudhe star. Then, with no sound what so ever, it looked like it exploded. I watched as the center of the UFO turned black like space was filling it and a ring was forming from what was left of the Bright-light UFO. The blackness from the center quickly filled outward and consumed the Bright-light UFO until it was completely gone from view. It did not move in any direction from when I first noticed it. I scanned left and right, up and down to cover the general area to see if a second light might show or and falling star or debris might be falling. I scanned the stary night for approximately 2 to 4 minutes. No new subject appered. Then I noted the clock on my truck was 10:14PM."],"Object Features":"Unknown","Date of the Event":"04/13/2010 10:05 UTC","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"IFO","Source":"MUFON","Object Shape":"Star-like","Case Number":"22825","Region":"Texas","Latitude":"29.429122","City":"San Antonio","Viewing Distance":"Unknown","Longitude":"-98.488028","Object Flight Path":"Stationary","Log Number":"US-04142010-0016","files":["/var/www/straped/mufon/html2text/22825.html.txt","/var/www/straped/mufon/org/22825.html"],"trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around April 13th 2010"],"Weather Factors":"None","Country":"United States"}