{"Tags":"City","City":"Undisclosed","Region":"Florida","divs":["Sighting Details I was walking outside of my office and looking at the sky, which was blue with a a group of dark clouds that looked like it might shower soon. I was watching a twin propeller airplane that was very loud and not flying very high go across the sky heading in a northwestern direction. As the plane was flying out of the area, a small black object caught my eye to the southeast of the plane, maybe a couple of miles back from the plane's position. The object seemed to emerge from the dark cloud formation over the area. I thought it was a bird that had flown very high because it was not making any noise like the plane or any flying object I have watched usually makes. It was heading in a northern direction, slightly different than the course the plane had taken. When I judged that the object was moving faster than the plane had been moving and was not a bird, I stopped walking and stared at it fly across the sky. The object's flight was so gracefully quick and smooth as it flew. It moved completely different than the plane had moved and with no noise emanating from an engine or propulsion that I could notice. I did not see any kind of exhaust trail and the sky was not in a condition to make contrails very easily. I watched the silent, black sphere-like object smoothly and quickly make its way across the sky, actually passing adjacently behind the same path that the plane had taken, which I could still hear and see as it flew further away. The black sphere-like object did not reflect any light as it flew overhead, nor did it have any kind of running lights on its surface that I could see. I walked along the sidewalk trying to follow the object and keep it in my line of sight. The object then gracefully arced into a lower trajectory, still heading in northern direction and I lost it as it dipped below a tree line that was across the street and went out of my view. I have no idea what I saw flying overhead, but I know that it was not a bird or an airplane or a jet or helicopter. I was puzzled by the experience and after I lost sight of the object, I was amazed at what I had witnessed. It was only after a couple of minutes at staring at the sky and trying to find the object again that I decided to phone my wife and tell her what I saw. I am still a bit awestruck at witnessing the UFO, and as much as I am skeptical about what I think I saw, I am inclined to believe that it was not a man-made flying object. I was so captivated and amazed at what I saw, and it happened so fast, that it did not occur to me to try and take a picture of it with my phone until after I was speaking with my wife on the phone."],"Viewing Distance":"Over One Mile","Object Features":"Unknown","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed","Summary":"Black sphere-like object, silent and fast.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=27.669467,+-81.509574(22821)&iwloc=A&hl=en\"> mufon case (22821) map </A>","Latitude":"27.669467","Object Shape":"Oval, Sphere, Teardrop","Date Submitted":"04/14/2010 11:51 UTC","Date of the Event":"04/13/2010 02:40 UTC","Case Number":"22821","Weather Factors":"Windy, Light","Log Number":"US-04142010-0012","Longitude":"-81.509574","Object Flight Path":"Path with directional change","trends":[],"files":["/var/www/straped/mufon/html2text/22821.html.txt","/var/www/straped/mufon/org/22821.html"]}