{"Object Shape":"Diamond","Country":"United States","Region":"Minnesota","Case Number":"22823","Log Number":"US-04142010-0014","map":"<A HREF = \"http://maps.google.com/maps?q=44.987745,+-93.257666(22823)&iwloc=A&hl=en\"> mufon case (22823) map </A>","Date of the Event":"03/22/2010 09:30 UTC","City":"Minneapolis","Longitude":"-93.257666","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around March 22nd 2010"],"Weather Factors":"Does Not Apply","Object Features":"None","Tags":"City","Date Submitted":"04/14/2010 06:09 UTC","Object Flight Path":"Straight-line path","Latitude":"44.987745","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22823.html.txt","/var/www/straped/mufon/org/22823.html"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","divs":["Sighting DetailsIt was approximately 9:30 PM (cannot remember if it was Sunday the 21st or Monday the 22nd of March.) I was out on our lawn and looking up at the sky. I was facing West. I noticed what, at first, I thought was an airplane. It was brighter than a normal airplane and it had only an orange glow. We live about 20 miles from the airport and we see planes on approach all the time (but we can hear them too.) The light (object) was traveling what seemed to be the same flight path, at the same height and speed as an airplane on approach. However, as it got closer, I couldn't see any of the other (blinky) lights that normally are evident on any aircraft. As it got closer, it seemed to be higher than airplanes would normally be over our house, and it was silent! I quickly asked my grilfriend to come outside and see it. At that time it was directly over head and we both agreed that it was no airplane. I observed the obeject as it passed over head and continued to the East. Normally, with planes (no matter how high they are) as well as with satellites they travel from West to East over our house and disappear over the horizon. In this case, the object continued Eastward but seemed to climb in altitude. It went higher and higher until it was too high to see any more. I have contemplated, this event for over three weeks. I have obsevered many airplanes since the event and cannot figure out what it was that we saw that night."],"Source":"MUFON","Summary":"Medium-bright, orange light. Moving slowly with no sound.","Disposition":"Unknown"}