{"Sighting Duration":"Undisclosed","Date Submitted":"04/15/2010 01:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.062222,+-88.397528(22830)&iwloc=A&hl=en\"> mufon case (22830) map </A>","Source":"MUFON","City":"Delafield","Log Number":"US-04152010-0004","files":["/var/www/straped/mufon/html2text/22830.html.txt","/var/www/straped/mufon/org/22830.html"],"Disposition":"Unknown","Weather Factors":"Unknown","Summary":"Green glowing oval shape object descending from Northern sky with a trailing orange glow about 20 times its length exploded into about 25 large orange pieces over Delafield Wisconsin.","Latitude":"43.062222","Region":"Wisconsin","Viewing Distance":"Unknown","Object Features":"Undisclosed","Tags":"City","Country":"United States","trends":["There has been one other sighting in Delafield","There were no other sightings in Delafield on or around April 14th 2009"],"Longitude":"-88.397528","Object Shape":"Egg, Fireball, Oval, Teardrop","divs":["Sighting DetailsI was driving West on Beaver Lake Rd. just East of Highway 83 near Chenequa, Wisconsin. We had just slowed the vehicle to allow some deer to cross the road in front of us when a green glow appeared from the North--the deer were passing from South to North so I was scanning the tree line ahead of us carefully for more deer. Suddenly and rapidly, the green glow brightened and over the tops of the trees appeared a green glowing oval shaped object descending in a flat rapid trajectory. Trailing the green glowing object was a orange trail which appeared to be about 20 times the length of the object itself. The descent continued until the object appeared to explode into about 25 orange pieces over what appeared to be the area of Delafield Wisconsin. I did not hear a noise or feel a blast wave. I thought the object was a meteor. Another person was in the car, and we both thought is was the most unusual thing we had ever seen. It did not appear to be very high in the sky when we saw it, and no other objects or meteors were visable as we scanned the night sky. I did phone this into 911, and they said there were other similar reports, and no reports of missing aircraft at that time."],"Case Number":"22830","Object Flight Path":"Undisclosed","Date of the Event":"04/14/2009 10:20 UTC"}