{"Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"28.521929","Object Shape":"Disc","Region":"Texas","Case Number":"22835","Object Features":"Dome","Date Submitted":"04/15/2010 09:23 UTC","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.521929,+-99.860611(22835)&iwloc=A&hl=en\"> mufon case (22835) map </A>","Tags":"City","trends":["There have been no other sightings in Carrizo Springs","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Summary":"Lightning blue spinning lights on hovering disc shaped craft.","Longitude":"-99.860611","Log Number":"US-04152010-0009","files":["/var/www/straped/mufon/html2text/22835.html.txt","/var/www/straped/mufon/org/22835.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Date of the Event":"11/17/1990 06:00 UTC","divs":["Sighting DetailsI got in my deer hunting stand at 5:30AM. The stand is 12 ft off the ground. The vegetation is 7ft high. Visibility of the sky is clear 10 miles to the horizon. When the sky was turning pink in the east just before daylight, I opened the south facing window, and saw a brightly lit object hovering 100 meters off the ground, 400 meters due south. It was the size of a school bus. It had lightning blue lights spinning horizontally around the middle of a disc shaped craft. It was completely silent. After 30 seconds, it shot up 200 meters like a bullet, and stopped dead, like it had hit a wall. It hovered there for a few seconds then shot back down to the same spot it was previously. It stopped there like it had hit a brick wall and hovered. It didn't rock back and forth or drift when it hovered. It didn't move an inch. After another minute of hovering, the spinning lights slowed down and dimmed. The craft then shot off from south of me over the west horizon, which was at least 10 miles away. It took about 1 second total. The craft left a brief contrail that I can only compare to a very thin bolt of lightning. The craft changed directions a couple of times before going over the horizon, so the lightning like contrail had a couple of zig-zags in it. To be honest, the contrail could have just been my eyes playing tricks on me. But, the ufo I saw was nothing from this world. From the second I saw it the hair on my neck raised. The light itself was different from any light I had ever seen. It looked liquid and was very bright, but very crisp. It was so quiet out, I could hear field mice nesting in a bush 20 meters away. I was 20 miles from the closest road, and 40 miles from the closest town. This craft made no sound at all. When it bolted off, I should have at least heard a sonic boom as it passed the speed of sound, but I didn't. This was the weirdest, most unexplainable occurance of my 32 year life. I was actually very afraid the whole time I saw it, and have not been back to that spot since. I had a pair of Zeiss binoculars around my neck the whole time I was viewing this thing, and never even thought to use them."],"City":"Carrizo Springs"}