{"Latitude":"33.752581","Date Submitted":"04/15/2010 06:47 UTC","City":"Tustin","Viewing Distance":"101-500 Feet","Longitude":"-117.819736","Region":"California","Summary":"Stars or lights in odd formation of arrow or triangle","divs":["Sighting DetailsOn the night of June 22 around 2-2:30 am i was driving home after dropping off a few buddies, we were out late at a bar in Huntington Beach for a friends concert. I had dropped them off and continued north on my normal route home the streets were empty and i remember getting that feeling of anxiety or like when the hairs on your arms and back of your neck stand up, like something is about to take place that you would rather not have happen. I remember feeling tense because i was running into every red light although no one was on the road and i couldn't help but feel the sensation that like i was running from something or like as if i was being watched or chased. I remember feeling a small sense of relief every time i would pass another motorist or local seven-eleven, i even stopped to buy a pack of cigarettes although i had quit the month before i think i just needed the reassurance of the cash tender to make me snap out of whatever i was feeling but when i got back into my car i felt it again like an aura was surrounding me in my car. As i continued Northbound i lit a cigarette at one stop sign when i saw the first flash, it was as though someone had taken a photo of the street from above, i initially shrugged it off as i was too focused on getting home. There was one more flash that seemed to be 20-30 feet ahead of my vehicle, thats when i looked up and saw what appeared like an arrow tip formation of lights changing colors, it looked as if it was traveling in the same direction as i as the tip of the arrow was pointing in my direction. At first i believed it to be a commercial aircraft or jetliner as we have many airplane traffic by John Wayne Airport so i tried to ignore it but i remember that the colors kept pulsating like a heart beat so i continued to follow it through my windshield. The formation was composed of perhaps 9-12 lights all at different variations of brightness, the tip was a crimson-red that pulsed to a tangerine-orange, the two rear lights were purple and would change to a light blue, and in between there were white and yellow dimly flickering lights. On this particular night i remember that the moon was not out and the sky was quite dark so i couldn't make out any solid structure they could have been attached to. I was still driving behind it waiting to see if it would fly further away or reveal a flight pattern but it would not move forward nor fall back, it was as though it was hovering at the same speed that i was traveling, and that is when i got the feeling of anxiety again except this time i felt like i was being watched. It would stay with me for about 4-5 miles and finally the leading light started to fall behind, still throbbing the same crimson pattern, it was as though it was changing formation. The white and yellow flickering lights were gone by now and the arrow was now pointing the opposite direction but continued before my vehicle until it began to travel in that direction. These lights were following me for approximately 10 minutes before they past over me, disappearing to my rear. i didn't look back or see exactly where they dissipated but i remember a terrible head ache, in fact when i finally got home and got out of my car i remember vomiting because my head hurt so bad. I wanted sleep really bad, my eyes felt like they were shutting and i couldn't control them thats when my girlfriend came to the door and found me laying in my own vomit, she asked if i was drunk but i explained to her that i had been sober for the later part of the night. I don't remember exactly what time i had arrived home but i saw the clock as i was explaining the incident to my girlfriend and the time was almost four, i remember thinking how could a twenty minute drive from my buddies house to mine prolong to an hour and a half. My girlfriend still doesn't know how long i was laying out on the front porch. This event sticks out in my memory because of the strong emotional feelings of anxiety and helplessness. I have only shared this experience with a select few including my girlfriend and they all say i should seek other witnesses to this event but i have yet to find any."],"Object Shape":"Chevron, Flash, Triangle","Object Features":"Unknown","trends":["There have been 8 other sightings in Tustin","There were no other sightings in Tustin on or around June 22nd 2006","This sighting has been favorited 1 time.",""],"files":["/var/www/straped/mufon/html2text/22833.html.txt","/var/www/straped/mufon/org/22833.html"],"Log Number":"US-04152010-0007","Date of the Event":"06/22/2006 02:00 UTC","Disposition":"Unknown","Weather Factors":"Unknown","Sighting Duration":"00:10:00","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.752581,+-117.819736(22833)&iwloc=A&hl=en\"> mufon case (22833) map </A>","Source":"MUFON","Tags":"City","Case Number":"22833","Country":"United States"}