{"Object Features":"Undisclosed","Date of the Event":"06/30/1947 02:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.521771,+-86.79269(22837)&iwloc=A&hl=en\"> mufon case (22837) map </A>","City":"Birmingham","Object Shape":"Disc","Longitude":"-86.79269","Weather Factors":"Unknown","Disposition":"Unknown","Case Number":"22837","Summary":"This is an account of my mothers about an unwelcome visitor in her yard","Tags":"City","Object Flight Path":"Undisclosed","Country":"United States","Date Submitted":"04/15/2010 02:32 UTC","Latitude":"33.521771","Source":"MUFON","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around June 30th 1947"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting Details A mothers story. My mother told me something, and let me say this;if my mother ever told me something i always knew that i could beleive her. My mother was talking about the weather or whatever and i had gotten distracted by something. When i turned back around to face her and rejoin the conversation, i found that she had gotten on to the stangest subject. 'What did you say?'I asked her. It seemed that i had heard something that didnt make sense. So she told me a story of her at the door of her house and experiencing an hair raising event.'All she could do' she said.'Was to try and run and grab the baby.'The thing' she said.' came down low and moved across the yard with a wistling noise'. 'Really?'i said'What did it look like?''A flying saucer' she said 'What did you do when you saw it?'I asked.'I thoght about the baby who was in the yard playing'she said.'It could hurt the baby''So you ran to grab the baby?'i asked.'Yes' she said.' as soon as the stun came off me'Whether the flying saucers sudden appearence or some capability of the thing to stun or freeze people in their steps caused her to be frozen in place, i dont know. My mother related this story to me one time in my life. At the time she was advanced in years and suffering from alzymers. I beleive she had forgotten about the incedent for many years of her life, only to have it come to her mind as an elderly person, by chance i guess. Im just lucky to have been their at the moment she remembered the incedent and chose to relate it to somebody."],"files":["/var/www/straped/mufon/html2text/22837.html.txt","/var/www/straped/mufon/org/22837.html"],"Log Number":"US-04152010-0011","Region":"Alabama"}