{"files":["/var/www/straped/mufon/html2text/22849.html.txt","/var/www/straped/mufon/org/22849.html"],"Date of the Event":"04/16/2010 01:50 UTC","Date Submitted":"04/16/2010 02:50 UTC","Longitude":"-69.719218","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.765062,+-69.719218(22849)&iwloc=A&hl=en\"> mufon case (22849) map </A>","divs":["Sighting Details Sitting at computer ready to shut it down and go to bed when I heard a wierd rumbling sound outdoors. Ran out and directly above house at an estimated 1000 or so feet up, alot lower than any other planes, was a huge diamond shaped craft. It had a bright white light at all four tips of its diamond shape, but also the craft itself could also be seen as a solid goldish green diamond. It traveled at a steady speed, est 15-20mph, and was traveling NE 60. On approach it made a very quiet low rumbling sound and as it flew above and then the further it got, the more high pitched and strange sounding it became. As it was directly above the house I had a few short seconds to run back indoors yelling for my girlfriend to come out quick quick quick, as I have seen this same thing about three years ago flying almost the exact same direction but lower, and was believed by her at the time, but with skepticism. This time as I awoke her from a deep sleep she did get to see it, as it was traveling so slow. So now I at least have a witness to it, yet it all happened in a minute or less and I must've wasted 20 seconds of that when I first was looking at it in amazement, for this time I could clearly make out and see the exact shape of it, but had no time for a camera. It was not \"bat\" or wing shaped like a B2 spirit Bomber, this was a oblong diamond shape. A little bit more enlongated in the front and rear than the sides. The white lights were not blinking on each of the tips, and were very bright and large. There may have been a fifth light but I cannot remember the color of it, none were blinking. As it traveled further away, the solid shape of the body of it started to disappear. When it was directly overhead it appeared a pale green and then a translucent goldish color. As it disappeared on the treeline about 500 yards away, all that was visible were the corner lights. When it was directly above and flying overhead it did make a sound. It was a high pitched hissing whining sound, like a turbocharger without the engine. The further it got the more high pitched it became. It was low enouugh that if it were a jet or conventional plane of some sort, this late at night hte whole neighborhood would have awoken. Just happened to be directly above my house, yet again. But this time I saw the shape. It was amazing. After my girlfriend calmed down from being angry for waking her up, she then thought it was pretty cool to see too, and says \"you should have gotten the camera\". Now she believes I was telling the truth 3 years ago as well."],"Latitude":"44.765062","Case Number":"22849","Object Features":"Unknown","Tags":"City","trends":["There have been 2 other sightings in Skowhegan","There were no other sightings in Skowhegan on or around April 16th 2010"],"Sighting Duration":"00:01:00","City":"Skowhegan","Log Number":"US-04162010-0003","Source":"MUFON","Summary":"Diamond Shape Ufo 4 lights on tips Solid Green gold Diamond Low Slow","Weather Factors":"None","Object Shape":"Diamond","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"Maine","Object Flight Path":"Straight-line path"}