{"Object Shape":"Cone, Triangle","Object Features":"Unknown","Object Flight Path":"Hovering then path","Latitude":"40.521893","Region":"Utah","trends":["There has been one other sighting in Riverton","There were no other sightings in Riverton on or around August 19th 2009","This sighting has never been favorited.",""],"Longitude":"-111.939102","Date Submitted":"04/15/2010 06:15 UTC","Case Number":"22842","divs":["sighting detailsme and my friends were standing outside at a small bbq in my friends backyard. we were smoking cigarettes and just standing around enjoying the nice day. i was already looking at the sky when i saw whatever it is that i saw. its weird how it flew though, because when something is flying for example an airplane you can follow it across the sky and see how its following the circular motion around the earth through the sky. but, this thing was almost like it just cut through the atmosphere. just through a little chunk. i have never seen anything that size it must have been gigantic! if i were to hold a 50 cent american coin at half arms length up to the sky it was about that big. i cant really explain how fast it went it was really weird because it got really quiet right before i saw it than it was almost like it just showed up and sat there for a second than it just zoomed off. but there were no tracers or cuts in the sky that i noticed. it was like a off shaped 3d triangle and the color of it was a mango-yellow with a very light hint of light blue at the front tip.. i'm not the only one that saw it three other of my friends saw it too. my girl friend saw it as the same color. and the two guys i was with saw it as a greenish blue colors. i didn't really know what to think because i want the only one that saw it i thought it was very cool to see something so unusual. (with the video its the image 3m 26s in. it kindof looked like that but had horizontal yellow lines in it) link http:\\\\www.youtube.com\\watch?v=6jel4fr4hre"],"Weather Factors":"None","Source":"MUFON","City":"Riverton","map":"<A HREF = \"http://maps.google.com/maps?q=40.521893,+-111.939102(22842)&iwloc=A&hl=en\"> mufon case (22842) map </A>","Disposition":"Insufficient Data","Date of the Event":"08/19/2009 12:00 UTC","Sighting Duration":"00:00:06","Log Number":"US-04152010-0016","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/22842.html.txt","/var/www/straped/mufon/more/22842_submitter_file1__4a1c2f4dcf2bf76L.jpg","/var/www/straped/mufon/org/22842.html"],"Summary":"It was a huge, bright object that moved unlike anything that I have ever seen, even in space movies...","Viewing Distance":"Over One Mile"}