{"Log Number":"US-04162010-0002","Date of the Event":"04/15/2010 09:00 UTC","Case Number":"22848","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.110105,+-80.391445(22848)&iwloc=A&hl=en\"> mufon case (22848) map </A>","Longitude":"-80.391445","Country":"United States","files":["/var/www/straped/mufon/html2text/22848.html.txt","/var/www/straped/mufon/org/22848.html"],"Disposition":"Insufficient Data","Date Submitted":"04/16/2010 01:50 UTC","Region":"Florida","Latitude":"26.110105","divs":["sighting detailsi was sitting in my room looking out my window when i had noticed this object had been in the same spot for at least ten minutes of me first noticing it. i remember thinking it was an approaching airplane at first, but when i looked back again in a few minutes, it was in the same spot. i went to get my binoculars (10x42) and went outside to look. when i looked through them , i could see the outer edge of this circular\\disc shaped object was glowing green while the inner part was more of a reddish\\golden color. i watched the object for about 10-15 seconds. after it not moving, i went to get my mother from inside to look. when we came out, the object was still in the same spot hovering in the sky. i could see airplanes flying under and around the sky of the object. it never moved and a few times it seemed to blink its light. the whole object would disappear in an instant and reappear again just as fast. i couldn't even see it in the binoculars. there were no clouds in front of it but behind it, that's how i could tell it was inside the atmosphere. it was a huge circular\\disc shaped object. even in the binoculars, at that distance, it was much bigger than an airplane. it was silent, didn't move, and glowed... i had never seen anything like it before. after about 20 mins of me seeing it, it just disappeared."],"Summary":"This object behaved like nothing I've seen before.","Tags":"City","Object Shape":"Circle, Egg, Square, Rectagular","trends":["There have been 5 other sightings in Weston","There were no other sightings in Weston on or around April 15th 2010"],"City":"Weston","Object Features":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"00:20:00"}