{"files":["/var/www/straped/mufon/html2text/22847.html.txt","/var/www/straped/mufon/org/22847.html"],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Silver Lake","There were no other sightings in Silver Lake on or around April 15th 2010"],"Longitude":"-121.048099","Date of the Event":"04/15/2010 08:30 UTC","Latitude":"43.127847","Tags":"City","Log Number":"US-04162010-0001","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting DetailsMy husband and several friends are camping at Table Rock, about 3 miles east of Silver Lake. Sitting in their camp chairs, they look to the East a few miles, and just above the horizon they start seeing orangish-yellow, round discs in the sky. This begins about 8:30 and continues for a solid hour; it dwindles off but continues for the next half hour at least. (This is play by play as they call me with updates) At any given time 1 to 4 of these show up, dim, then another lights up, dims, sometimes at the same time, sometimes not. Kind of like fireflies. There is no moon but the weather is crisp, cold and clear. They're all a little freaked out, but excited too. Mainly no one wants to get abducted or probed! My husband and a couple others witnessed this the same time of year a couple years ago and no one believed them. Those same non-believers are currently watching this phenomenon! They were trying to film it but I don't know yet if they got anything. If it turns out they did - or do, since they'll be there a couple more days - we will try to post what turns up."],"Object Shape":"Disc","Viewing Distance":"Unknown","Case Number":"22847","City":"Silver Lake","Date Submitted":"04/16/2010 01:11 UTC","Region":"Oregon","Summary":"About 30 - 40 sightings within 1-1/2 hours.","map":"<A HREF = \"http://maps.google.com/maps?q=43.127847,+-121.048099(22847)&iwloc=A&hl=en\"> mufon case (22847) map </A>","Disposition":"Insufficient Data","Country":"United States"}