{"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"03/29/2010 10:25 UTC","Date Submitted":"04/16/2010 02:20 UTC","Source":"MUFON","trends":["There have been 34 other sightings in Naples","There were 2 other sightings in Naples on or around March 29th 2010"],"Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/22854.html.txt","/var/www/straped/mufon/org/22854.html"],"Region":"Florida","Log Number":"US-04162010-0008","City":"Naples","Weather Factors":"Unknown","divs":["Sighting DetailsFor three consecutive nights (March 27,28, and 29th), at approximately the same time each night (10:25ish), my husband and I saw a large bright white light hovering about 150 feet from the ground water level over Johnson's Bay to the west of our house. On the first night, it was raining when this happened. On the second night it was cloudy, no stars, no moon...and on the third night, there was a full moon off to the East. We ruled out that it was an airplane or helicopter because it was too low, hovered far to long, and was totally silent. On the first night, we watched it for about half an hour and it disappeard in a poof! On the second night, we watched it for an hour, and then went to bed before it disappeared. On the third night, we did the same. On the morning of March 29th, Fire Chief Emilio Rodriguez called us about 8:30 A.M. to see if we had been on-line to look at the weather cam. He was excited and said, \"The camera caught on film last night this large white light shaped in somewhat of a flattened ball that dropped straight down from the sky and then hovered in the same spot without moving until finally after hours, it just seemed to drop to the ground and disappear.\" We were both curious and skeptical at first, but also at the same time had an erier feeling that this was something very out of the normal. We have no major air bases near us, no military and no industry that would be experimenting with something like this."],"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=26.146046,+-81.79125(22854)&iwloc=A&hl=en\"> mufon case (22854) map </A>","Object Features":"Undisclosed","Longitude":"-81.79125","Object Flight Path":"Stationary","Country":"United States","Summary":"Bright white large round light slightly compressed completely stationary, silent and approx. 150 from water level.","Latitude":"26.146046","Disposition":"Unknown","Tags":"City","Case Number":"22854"}