{"map":"<A HREF = \"http://maps.google.com/maps?q=40.316346,+-75.128304(22852)&iwloc=A&hl=en\"> mufon case (22852) map </A>","Object Features":"Unknown","City":"Doylestown","Region":"Pennsylvania","Latitude":"40.316346","Country":"United States","Weather Factors":"Does Not Apply","Date Submitted":"04/16/2010 11:40 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Other","Summary":"While out on a follow up investigation of an assigned case CI, SSD, & case witness witnessed several unexplained events.","Date of the Event":"04/15/2010 08:15 UTC","divs":["sighting details1. investigating a case for mufon by taking photographs & readings of an old farm site, we captured on film a triangular shaped craft that appeared to be a light in the sky (a) & a bit later while on location in a state park several miles away, we witnessed a arc-like\\crescent shaped pinkish-red light\\craft (b) in the sky. 2a. checking the digital pictures & saw orbs in the picture, but then i said what the hell is that dot of light in the upper corner. 2b. checking the horizon. 3a. a light in the sky not seen with the naked eye. 3b. looked like the bottom crescent of the moon, but in the wrong direction. 4a. n\\a. 4b. it was moving slowly towards us & moving up @ a 45 degree angle then it dematerialized before our eyes. 5a. we were like wow that is strange. it wasn't till we arrived home that the ssd downloaded the pics & saw it was triangular. 5b. we were awe-struck because we never saw anything like this. 6a. we never saw it until viewing the pics on the digital camera. 6b. it dematerialized slowly & faded away."],"Tags":"City","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around April 15th 2010"],"Viewing Distance":"Over One Mile","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/22852.html.txt","/var/www/straped/mufon/org/22852.html"],"Longitude":"-75.128304","Case Number":"22852","Log Number":"US-04162010-0006","Source":"MUFON","Object Shape":"Boomerang, Triangle"}