{"Disposition":"IFO","trends":["There have been 65 other sightings in Baltimore","There was one other sighting in Baltimore on or around April 15th 2010"],"Viewing Distance":"Unknown","Tags":"City","divs":["sighting detailsthis has been going on for about 2 weeks, every night except for one. it appears to be small and cylindric. usually it's yellow but sometimes i'll see a flash of red. it can move fast but usually it's still unless i move then it moves to follow i guess.if i wave at it or throw up the peace sign it moves in it's general area and flashes. last night 4\\15\\09 there was also a smaller cylindric object that moved and hovered right above the phone lines in my vacinity. it flashed red and one or two other colors. it also seemed to make a hardly audible noise that kind of sounded like morris code coming in. i'm not saying it was morris code, that's just what it sounded like. i've also seen a few triangles, i think. but i am positive about the rest. interesting note, he first time i saw it about an hour after it appeared there was two military aircraft first making circular patterns ever closer to it then they crossed each others path in a grid like fashion getting closer to it each time. when they got close enough they would turn of their lights. there was also 1 stealth type plane that came into play 40 minutes after the other 2 aircrafts had already been there observing it. a neighbor saw all of this too. i just want someone to believe me and send a team here. you won't be dissapointed."],"Weather Factors":"None","Object Features":"Unknown","Longitude":"-76.603629","Log Number":"US-04162010-0011","Date Submitted":"04/16/2010 02:49 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/22857.html.txt","/var/www/straped/mufon/org/22857.html"],"Object Shape":"Circle, Fireball, Flash, Sphere, Star-like, Triangle","Date of the Event":"04/15/2010 08:00 UTC","Latitude":"39.293965","Case Number":"22857","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.293965,+-76.603629(22857)&iwloc=A&hl=en\"> mufon case (22857) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Summary":"u.f.o's over field by neighborhood","Region":"Maryland","City":"Baltimore"}