{"Object Shape":"Sphere, Star-like, Other","Region":"Indiana","files":["/var/www/straped/mufon/html2text/22862.html.txt","/var/www/straped/mufon/org/22862.html"],"City":"Newburgh","Date of the Event":"04/15/2010 08:27 UTC","Longitude":"-87.405286","map":"<A HREF = \"http://maps.google.com/maps?q=37.944488,+-87.405286(22862)&iwloc=A&hl=en\"> mufon case (22862) map </A>","Summary":"The event that happened this night occured with 3 spheres also three humanoids practically riding the spheres.","Source":"MUFON","Tags":"City","Log Number":"US-04162010-0016","trends":["There have been 2 other sightings in Newburgh","There were no other sightings in Newburgh on or around April 15th 2010"],"Case Number":"22862","Weather Factors":"Unknown","divs":["Sighting DetailsOn the night of April 15,2010 at 8:27pm i was riding along in a vehicle on a highway passing a grocery store called Shnuck's.The sky was black with no stars in sight when suddenly three white spherical orbs rushed down hovering from no where about 214 feet off the ground.When i first saw this i thought where those lights came from them the orbs came lower about 25 feet. After about 10 minutes of watching this there was suddenly a 3 second power outage, but when all of the lights from the store came back on beside me one of the orbs started to smoke like a plane does when it has been shot then i noticed that in these luminous orbs where humanoids and i stared to panick. One of the humanoids pointed towards SSW direction and then all three orbs began to gai nquite some altitude then vanished. Once the humanoids vanished i started to think what just happened and if i should tell my friends, but my thoughts were suddenly interupted by the noise of a helicopter and supposable an f-16 military fighter jet that zoomed right over me.Thankfully i got a picture but after the picture was saved into my phone the screen twitched and the picture was immediatly erased."],"Viewing Distance":"Unknown","Disposition":"Hoax","Country":"United States","Object Features":"Undisclosed","Date Submitted":"04/16/2010 07:31 UTC","Sighting Duration":"00:02:09","Object Flight Path":"Undisclosed","Latitude":"37.944488"}