{"Object Features":"Other","City":"Bournemouth","Object Shape":"Circle, Sphere, Star-like","Case Number":"22860","Region":"England","Object Flight Path":"Stationary,Path then hovering","Tags":"City","Longitude":"-1.880769","divs":["Sighting DetailsI went out to the garden to have a smoke. I lit my ciggarette then looked at the stars to stargaze abit. I saw a red light moving and thought it was a plane since the airport is nearby. But then the light didn't blink like the lights on planes. And then I started seeing it glow and five lines potruding out of the center. I thought I got dirt in my eyes but I looked at other lights and didn't see the lines. So I kept watching it and it started to move erratically although very slowly. I watched it for around 3-4 minutes before it started pulseating and then dissapearing all together. I was still in shock as I looked around. As I looked behind me I saw a whitish light with the same star like features. It was remarkably still but would twinkle in colors of blue, red, yellow, green, and violet. It stayed there for half an hour roughly and I took my camera and took a few pictures of it. What I got were time lapse pictures showing not blinking but again pulsing lights, this time in different colors. After I went in to tell people inside, the light was gone. Now I oly have the pictures to prove my story. I am writing this on my phone so if I could have an email address to send my pictures to I will send them at once."],"Disposition":"Unresolved","Weather Factors":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=50.719164,+-1.880769(22860)&iwloc=A&hl=en\"> mufon case (22860) map </A>","Sighting Duration":"00:30:00","Date Submitted":"04/16/2010 05:39 UTC","Date of the Event":"04/16/2010 10:00 UTC","trends":["There have been no other sightings in Bournemouth","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/22860.html.txt","/var/www/straped/mufon/org/22860.html"],"Viewing Distance":"Unknown","Log Number":"GB-04162010-0014","Country":"United Kingdom","Latitude":"50.719164","Summary":"2 star like lights. Bigger than stars. Have halo and lines projecting from it. Colors red and rainbow"}