{"Region":"North Carolina","divs":["Sighting DetailsI was driving from my house in Rutherfordton, NC towards the mall in Spindale down Hwy 74 Bypass. It's one of the flatter areas of the county. In the sky I saw a triangle of red lights. It caught my eye because I knew that a radio tower would only be one light. Thinking quickly I realized I couldn't identify what it was using logic and common sense. It seemed to disappear and reappear in another nearby area of the sky. I got to the mall and parked on a hill so I could see it, and sat watching it for a while. It continued to skip around the sky, disappearing and reappearing somewhere else. Eventually, the lights began to rotate in a circular pattern, with one red light lighting up at a time in a triangular pattern. After that, it zoomed across the sky to the east, and I lost sight of it. I have three friends who have told me about experiences seeing something similar around the same time, and they had time-loss experiences. I only found out about that within the last 6 months or so. They were driving in the same area and saw a large black triangular shape floating above their car. Hours later, they sat around the kitchen table at one person's house without any knowledge or memory of how they got there, as if time had skipped forward a few hours. They don't like to talk about it. It was a really frightening experience for them. They had never been able to begin to explain it until they heard my story about the red triangular lights in the same area on the same day, and how I sat and watched it and saw it fly away."],"Disposition":"Unknown","Country":"United States","Source":"MUFON","Summary":"Triangle of Red Lights","trends":["There have been no other sightings in Spindale","This sighting has never been favorited."],"Object Shape":"Triangle","Object Features":"Unknown","Tags":"City","Longitude":"-81.929271","Case Number":"22875","Date of the Event":"05/31/1998 07:00 UTC","Latitude":"35.360121","Weather Factors":"None","Date Submitted":"04/17/2010 09:10 UTC","Log Number":"US-04172010-0011","Object Flight Path":"Path with directional change","Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/22875.html.txt","/var/www/straped/mufon/org/22875.html"],"Viewing Distance":"Unknown","City":"Spindale","map":"<A HREF = \"http://maps.google.com/maps?q=35.360121,+-81.929271(22875)&iwloc=A&hl=en\"> mufon case (22875) map </A>"}