{"Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"04/17/2010 05:02 UTC","Region":"California","Log Number":"US-04172010-0010","Disposition":"Hoax","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 39 other sightings in Redding","There were no other sightings in Redding on or around February 13th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/22874.html.txt","/var/www/straped/mufon/more/22874_submitter_file1__IMG_0208_2.JPG","/var/www/straped/mufon/more/22874_submitter_file3__IMG_0202_2_2.JPG","/var/www/straped/mufon/org/22874.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.58936,+-122.384775(22874)&iwloc=A&hl=en\"> mufon case (22874) map </A>","Country":"United States","City":"Redding","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Cigar, Sphere, Star-like, Triangle, Other","Longitude":"-122.384775","Case Number":"22874","divs":["Sighting DetailsI have had the honor to witness, and video a clan of M.E.F.F.'s( Mechanical Energy Force Fields).It all started when my neighbor put up Infrared Led's to stop my cameras. This didnt work so some how, don't ask me how but he was able to infiltrate the city street light's. Since that date 021310 I started noticing strange events on camera.What appeared to be black spheres of energy started to do unexplained movements and sounds.This would go on every few days,and when I noticed something different I made sure to have it filmed.So this is it people!! I have watched and learned studied there movements, patterns,functions,and how they work together as separate forces, with a special function.Like bee's or insects, looking and gathering useful energy.processing it, then taking it back to the triangle in the sky. When to day's work is done all six types combine and form one side of the triangle.This in turn powers the main craft, to open the\" gate\" for inter dimension transfer.Other craft and forces are able to come and go when it's open.I knew from the very first sighting, that this must be recorded every second that i saw something,so I could study it more closely. Since this started, I have lost most friends and people that respected me. I cant talk about making contact, or waking up to find three pages of formulas for time travel. I have not seen them in two weeks now I don't know if they are done with me, or just moved on.What I have will shock most of you this is to be taken very serious most people will not watch more then two videos.I want help with tracing pulsarts and quasarts, so we can collect the useful anti-matter.Then we could open a sub-parallel black hole, all the benefits of a black hole but no side effects. How cool, We are about one hundred years behind, so we need to take this more serious.Contact is real not like the movies always but through telepathic mind sensory communication.If you you tube \"footage of a real black hole\" By Mr.wildrhino, you will see just the first part of the film it actually seems to collapse or die.You will see in the end how it looks like a nuclear explosion in the sky,but its sub parallel so we don't know it's there.My I.R camera can see it is the only way I could witness this.Any way I have a months worth of footage that blows me away every time I watch it. show me if people are ready for this and I'll try to upload more,I don't know why it's so hard to upload but I get kicked off most times. I try ,The truth is really out there. I am no body special(before) I would have never believe this stuff, We need to think on a simpler level with everything under are noses. Ask me any thing you want about clan(bh021310).I have all i have spoken in a very well documented film and photo format. Want to see actual picture's of what people are trying to draw? When I started to read the stories of eye witness account's. I knew I cannot keep silent no more. What ever is going to happen to me has been planned well long before I knew about it."],"Sighting Duration":"02:54:17","Summary":"Seven Types, Well Documented over a month","Date of the Event":"02/13/2010 05:14 UTC","Latitude":"40.58936"}