{"Disposition":"IFO","Summary":"Looked like a bright satellite.","trends":["There have been 9 other sightings in Brunswick","There were no other sightings in Brunswick on or around April 16th 2010"],"Longitude":"-81.488719","Object Shape":"Other","Case Number":"22871","Log Number":"US-04172010-0007","Date Submitted":"04/17/2010 04:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.157153,+-81.488719(22871)&iwloc=A&hl=en\"> mufon case (22871) map </A>","Source":"MUFON","Region":"Georgia","Country":"United States","Sighting Duration":"00:00:10","City":"Brunswick","Object Features":"Undisclosed","Latitude":"31.157153","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"None","divs":["Sighting DetailsI am a pilot for a charter company. Flying at 36,000 ft my co-pilot and I were flying south down the coast of Georgia around 9 pm. We are both very familiar with seeing satellites and meteors on every night flight. My co-pilot said \"there's one\", I looked about 45 degrees up at 1 o-clock, thinking I would never see it, because they are so tiny and slow, that they are hard to pick out of from the stars sometimes. I immediately saw this satellite for 2 reasons. 1 it was brighter, not to any great extent, but there were stars that were brighter, but was the brightest object in its immediate area. 2 Its speed, it was tremendously fast. It moved from west to east at a very high rate. I don't want to try to estimate altitude or speed, but to say it was definitely extremely high and fast. It went from the right side of the cockpit to the left in less than 10 seconds. My first thought was meteor. Except that it was pulsing on and off like a rheostat light switch. the light would dim and un-dim quickly. No flashing on or off like a beacon or strobe. The whole thing would dim to nothing in about a half second then un-dim in about a half a second. I felt immediately that it was man-made or at least not a natural object. The pulsing was very regular in timing, and its speed was very constant since the distance traveled in between pulses was the same. We lost sight of it about 11 o-clock high as it pulsed off and did not pulse on again. WE joked that we had seen a unidentified falling object, if it was a meteor. But we both came to the same conclusion that neither of us had ever seen anything like that before."],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/22871.html.txt","/var/www/straped/mufon/org/22871.html"],"Date of the Event":"04/16/2010 09:00 UTC"}