{"files":["/var/www/straped/mufon/html2text/22878.html.txt","/var/www/straped/mufon/org/22878.html"],"Latitude":"38.717102","City":"Pt. Pleasant or Southside","Country":"United States","Summary":"I saw what I thought was a plane, but it was just hanging in the air low to the ground with no noise.","map":"<A HREF = \"http://maps.google.com/maps?q=38.717102,+-81.967949(22878)&iwloc=A&hl=en\"> mufon case (22878) map </A>","Viewing Distance":"101-500 Feet","Date of the Event":"04/13/2010 04:15 UTC","Source":"MUFON","Date Submitted":"04/18/2010 03:30 UTC","Log Number":"US-04182010-0003","Disposition":"IFO","Region":"West Virginia","Sighting Duration":"Undisclosed","Longitude":"-81.967949","Weather Factors":"None","trends":["There have been no other sightings in Pt. Pleasant or Southside","This sighting has never been favorited."],"Object Shape":"Other","Case Number":"22878","Tags":"City","Object Flight Path":"Stationary","divs":["Sighting DetailsI was driving South on 35, somewhere between Pt.Pleasant and Southside, WV. To my left, I saw what looked like a huge plane flying way too low. I thought it was going to crash with it being so low, so I started to slow down. The closer I got to it, I saw that it was a military cargo plane. Then, it seemed like it was not moving...so I stopped almost completely when I got right beside it. It was not moving. I turned down my radio and there was no noise from the plane. It looked like a big military cargo plane, it couldn't have been any higher in the air than the top of a telephone pole. I could read the stickers on it it was so low. All I remember of the stickers is that there was an American flag and numbers and letters, no words. The plane was not tipping in any direction. It was completely still. Just sitting in the air. After about a minute of being right beside it, traffic started coming from the other direction so I had to move. Once the traffic moved, I could not see it anywhere behind me. There was no plane and no smoke from a crash. It was just gone. I had the worst feeling of a panic attack I have ever felt. It started just as soon as I looked over at the plane when it was beside me. My entire chest hurt and I felt like I was going to vomit. I was so afraid. And, I do not know why!"],"Object Features":"Window(s), Insignia, Wings, Other"}