{"divs":["Sighting DetailsI left my home to go to the shops at approx 2132 GMT and saw a very bright orange hazy light with a blue glow around it.I first thought it was a helicopter It was flying from the east and it was absolutely silent. I live very close to Luton aitport in the uk and am very used to planes and helicopters going over. This was nothing like either. I also knew that volcanic ash covered the uk and it was a no fly zone. Then the light started heading upwards and got fainter and then it stopped dead at which point i ran to get my partner to see. The light then moved slowly and stopped again then it started to flicker and was gone as if heading upwards. When it had gone i looked back to the east and there was another light moving exactly the same as the first and did exactly the same disappearing in the same place. I Have to admit to being a non believer but i was exhilerated by the sight and as i said i am very used to police helicopters and planes going past but never have they been silent or stopped dead in the air as i saw tonight. At the moment i saw the lights there were no flights due to volcanic ash and i just can't explain it at all."],"Country":"United Kingdom","Weather Factors":"Unknown","Case Number":"22872","Region":"England","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/22872.html.txt","/var/www/straped/mufon/org/22872.html"],"Date Submitted":"04/17/2010 05:31 UTC","Sighting Duration":"Undisclosed","City":"Luton","Longitude":"-0.412546","map":"<A HREF = \"http://maps.google.com/maps?q=51.887051,+-0.412546(22872)&iwloc=A&hl=en\"> mufon case (22872) map </A>","Log Number":"GB-04172010-0008","Object Features":"Unknown","Summary":"Two Bright orange lights going from E to W stopping still then flying upwards","Disposition":"Unresolved","Tags":"City","Date of the Event":"04/17/2010 09:32 UTC","Source":"MUFON","Object Shape":"Unknown","trends":["There has been one other sighting in Luton","There were no other sightings in Luton on or around April 17th 2010"],"Latitude":"51.887051","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering"}