{"Log Number":"US-04182010-0007","Case Number":"22882","Date of the Event":"04/17/2010 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.797596,+-83.704139(22882)&iwloc=A&hl=en\"> mufon case (22882) map </A>","Object Features":"Unknown","Summary":"We observed a star like object move up down left and right with light dimming and then getting brighter","Sighting Duration":"00:40:00","files":["/var/www/straped/mufon/html2text/22882.html.txt","/var/www/straped/mufon/org/22882.html"],"Source":"MUFON","Tags":"City","Viewing Distance":"Over One Mile","Date Submitted":"04/18/2010 10:33 UTC","Latitude":"33.797596","trends":["There has been one other sighting in Monroe","There were no other sightings in Monroe on or around April 17th 2010"],"Weather Factors":"Unknown","Object Flight Path":"Other","divs":["Sighting DetailsMY husband and I were watching TV with the front door open. We have a storm door and we both observed what seemed to be a very bright star. We both commented on this \"star\" then a few minutes later we observed that the star had not only moved up and to the right but had gotten brighter. We are aware that we can see aircraft going to the Atlanta airport. We see them all the time but this was different. Then we observed the \"star\" to move vertically and to the right, then vertically to the left while this \"star\" was doing this we also observed that it would get very dim then get very bright. We got your binoculours and went outside because this was very odd to us and then we both observed the \"star\" to continue moving up, down, to the left and to the right and at the same time once again it would get so dim we could not see it then it would very bright! When we first noticed the object we thought it was odd because almost every night we sit with the door open and are very aware of what stars we see every night. This was something we had never seen before. I myself am a beleiver in UFO's and my husband is a huge sceptic. The fact that he could not explain what we were observing really excited me. At first we though it was a airplane but it made no sence with it moving in the manor it was moving and the brightness of this object dimming then brightining, with no clouds around to speak or see of. We went from just laughing and courious to complete confusion and amazement. Neither of us could make out a normal explanation for what this was. Finally after all of the movement and the dimming and brightness of this object it simply dissapeared. We could no longer see it. It dimmed and never brightened back up. We have been outside with our binoculers ever since we first started observing it around 9:10 just trying to find this object. We just came back inside and my husband and I felt we needed to let someone know about this. This is very far out of our comfort zone as far as reporting this. If this wasn't such an amazing moment, we would had not felt the need to share what we both saw tonight. We both grew up a few miles from an airport and we both feel we know when we see an aircraft. This was too odd the manor of which this \"star\" moved and changed brightness. This was not an aircraft or helicopter. We just do not know what it was. It is now 10:30 pm."],"Region":"Georgia","Longitude":"-83.704139","Country":"United States","Disposition":"IFO","City":"Monroe","Object Shape":"Star-like"}