{"Tags":"City","Source":"MUFON","Country":"United States","Latitude":"44.051944","Date of the Event":"04/11/2010 12:30 UTC","Longitude":"-88.9925","Summary":"I was taking photos of strange clouds and noticed a strange object in photo.","Date Submitted":"04/19/2010 11:25 UTC","Object Flight Path":"Undisclosed","City":"Auroraville","map":"<A HREF = \"http://maps.google.com/maps?q=44.051944,+-88.9925(22888)&iwloc=A&hl=en\"> mufon case (22888) map </A>","Sighting Duration":"00:00:01","Disposition":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsI was traveling west on Highway 21 near Auroraville, WI and had been noticing and photographing some unusual clouds. I was driving at the time so I was holding and pointing my camera south and not looking at what I was photographing so I could keep my eyes on the road ahead of me. I was using a Canon A1000IS which is usually very fast to focus and snap photo's. In this one instance when I pressed the shutter release there was about a full second of delay and then a bright flash of light filled the inside of my truck and then the camera captured the photo. I remember at the time thinking WOW was that bright. It wasn't until later on in the day when I remembered the unusual set of events and I went back to look at the photos and saw the unusual object in the photo. It's hard to see but it doesn't look like any type of aircraft that I've ever seen so I thought I'd put it out there to see if anyone else knows what it was."],"files":["/var/www/straped/mufon/html2text/22888.html.txt","/var/www/straped/mufon/more/22888_submitter_file1__IMG_5109a.jpg","/var/www/straped/mufon/more/22888_submitter_file2__IMG_5109b.jpg","/var/www/straped/mufon/more/22888_submitter_file3__IMG_5109c.JPG","/var/www/straped/mufon/org/22888.html"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-04192010-0003","Region":"Wisconsin","Object Shape":"Unknown","trends":["There have been no other sightings in Auroraville","This sighting has never been favorited."],"Case Number":"22888"}