{"Disposition":"IFO","Source":"MUFON","City":"San Francisco","divs":["Sighting DetailsLived in San Francisco's Richmond District (NW corner of the City, 2 blocks from the Ocean). I Left home for my nightly walking-jogging exercise. While facing South on the crest of the hill at one of the high-numbered Avenues- about 44th Ave., doing my stretching exercise before heading down the hill, I looked roughly Southwest and saw four large, bright, flat discs forming a diamond shape (one up, one down, one left, one right), all white, with each light, in seemingly random order, flashing slowly off and on. Just four lights stationary in the sky, and they appeared to be no more than 3 or 4 blocks away. I watched for a few minutes, then proceeded down hill Southward to Anza Street, which was the next street down, walked westward, and stopped at the driveway of the house which sits at the top of the cliff. (If you're familiar with the famous Cliff House at the Beach in San Francisco, you stand out in front of the place, look up toward the top of the hill and see a house. That's where I was. I watched from the driveway of that house.) I stayed there and watched for a few more minutes. The lights stayed in the same spot and continued their blinking. I then went back Eastward to 44th Ave., and continued downhill to the level of the Ocean, in an attempt to get closer to where the lights seemed to be positioned (it appeared that they were hovering above the Beach near the Safeway). As I continued down the very steep hill, I lost sight of the lights, because the houses on my right blocked my view. When I reached the bottom of the hill, which was near the Safeway grocery store-at-the-Beach, the lights were gone. There were some people waiting at the Bus Stop near the bottom of the hill, and I thought of asking them if they had seen anything, but as I looked at them, I could immediately tell that nothing unusual was occuring, or had occured. I continued my exercise walk up and down the Avenues as if nothing had happened, but I told a couple of friends about my experience. Incidentally, I was not- and am not- a Drug user. I was calm throughout the experience and maintained an objective attitude. I felt nothing strange or unusual. Nothing like this has happened before or since."],"Latitude":"37.77828","Region":"California","Summary":"4-flat , white round lights forming diamond shape, stationary, ea. light, in turn, slowly flashing on/off","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Case Number":"22897","map":"<A HREF = \"http://maps.google.com/maps?q=37.77828,+-122.415436(22897)&iwloc=A&hl=en\"> mufon case (22897) map </A>","Country":"United States","Object Shape":"Circle, Diamond","Longitude":"-122.415436","Date Submitted":"04/19/2010 09:21 UTC","Object Flight Path":"Stationary","Date of the Event":"11/30/1980 12:00 UTC","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around November 30th 1980"],"Tags":"City","files":["/var/www/straped/mufon/html2text/22897.html.txt","/var/www/straped/mufon/org/22897.html"],"Log Number":"US-04192010-0012","Sighting Duration":"Undisclosed"}