{"Longitude":"-79.391743","Weather Factors":"Unknown","Object Shape":"Star-like","Case Number":"22894","Object Features":"None","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Danville","There were no other sightings in Danville on or around April 13th 2010"],"Summary":"Appeared to be a satelitte but kept moving back and forth","divs":["Sighting DetailsI stepped onto our front entrance to get some fresh air. I looked up at the shy and for a change was full of stars. I noticed a bright object moving toward the east going a short distance then appeared to back up and travel forward again the same distance. After watching for a while I got my binoculars out for a closer look. At first I thought I was jerking the binoculars in my hands but I held them against one of the support beams of the entry way. I could not get over what I saw through the binoculars. The object I saw without the binoculars was moving very erractic. In the center was a pale white area and the object would pulsate and each time it pulsated red green and blue lights would appear on the opposite of its movement. At one time the object split apart and became two and joined back togather to form one unit. The object would not remain stable veiwed through the binoculars but just looking at it with them them object was like a star or satellite moving forward then backing up doing the same thing over and over. I watched this object for at least 2 hours. Two pale white objects appeared some distance below the one I had been watching. I cannot tell how far away these objects were. May have been a few miles but hard to tell being dark and no reference. I called my wife out to see the first object she watched it for a while but her sickness would not allow her to stay very long. After watching this dislpay clouds moved in so I had to stop. I don't think I saw an optical illusion and do not belive this was a man made object or machine. At night in this area there have been many objects appear in the sky. yes an airport is near by but not that many planes in the area. A few years ago my wife and I saw the giagantic fly V shaped object not far from our home here. Will never forget that. I hope that whoever was controlling what we saw last week are friendly."],"Region":"Virginia","Date Submitted":"04/19/2010 03:04 UTC","Date of the Event":"04/13/2010 12:00 UTC","Source":"MUFON","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/22894.html.txt","/var/www/straped/mufon/org/22894.html"],"Latitude":"36.593052","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.593052,+-79.391743(22894)&iwloc=A&hl=en\"> mufon case (22894) map </A>","Country":"United States","Log Number":"US-04192010-0009","Sighting Duration":"Undisclosed","City":"Danville"}