{"files":["/var/www/straped/mufon/html2text/22908.html.txt","/var/www/straped/mufon/org/22908.html"],"Viewing Distance":"Over One Mile","Log Number":"US-04202010-0009","City":"Coeur d'Alene","Object Features":"Unknown","Summary":"Second viewing of diamond shaped object in horizon located in same place as previous viewing. Asked a neighbor to look at it and we drove out of town to get a better look. Through his binoculars, we saw red, green and yellow lights.","Date Submitted":"04/20/2010 05:26 UTC","Disposition":"Unknown","Source":"MUFON","Tags":"City","Latitude":"47.684303","trends":["There have been 19 other sightings in Coeur d'Alene","There was one other sighting in Coeur d'Alene on or around April 19th 2010"],"Longitude":"-116.771876","Case Number":"22908","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=47.684303,+-116.771876(22908)&iwloc=A&hl=en\"> mufon case (22908) map </A>","divs":["Sighting DetailsSaturday, April 19th, 2010 At 8:00PM, I reeturned to the back porch to look for the triangle seen for the first time on April 15th. It wasn't there, but when I returned at 8:45PM, it was there, in nearly the same position only lower. I was using a tree branch and telephone line as cross points to verify location. I was surprised and decided that this time I would take action so I asked my 19 year-old neighbor to come into the yard and look into the sky. I asked him what he saw and he said: \"A triangle.\" We then looked with his binoculars and were shocked to see jumping red, green, and yellow lights, but no triangular shape. We looked at other bright objects in the sky, but saw no such flickering lights. He said: \"Let's go chase it,\" so we jumped into his truck and drove SW out of town to a rural area with fewer lights. We located the triangle which was SW of the moon. We both agreed that the triangular object was further away than when we looked at it from my porch and alley. After watching it for ten minutes, we returned home. The young man was confused about it. We discussed possibilities such as satellites or other orbiting objecs, but what got us was that it was stationary for some time and then moved, not across the sky from side to side, but seemed to be retreating away from us as we observed it becoming smaller. Upon returning home I looked for it from the usual spot on the porch, but there was no sight of it. I felt wide awake and stimualted, as I had not expected to see the triangle again. If I see it again tonight, then I will suspect that it is an orbital object. I am not convinced that it is extraterrestrial. I am not upset or excited, but remain curious and would like an explanation of what this object might be."],"Date of the Event":"04/19/2010 08:30 UTC","Region":"Idaho","Object Shape":"Triangle"}