{"map":"<A HREF = \"http://maps.google.com/maps?q=51.409709,+-1.313664(22903)&iwloc=A&hl=en\"> mufon case (22903) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/22903.html.txt","/var/www/straped/mufon/org/22903.html"],"Object Flight Path":"Undisclosed","Date of the Event":"04/19/2010 10:15 UTC","Region":"England","trends":["There has been one other sighting in Newbury","There were no other sightings in Newbury on or around April 19th 2010"],"Case Number":"22903","Log Number":"GB-04202010-0004","Source":"MUFON","Object Features":"Undisclosed","Summary":"Large black triangular craft passed silently overhead - Newbury, UK","Disposition":"Unresolved","City":"Newbury","divs":["sighting detailsi woke up from a deep sleep for no obvious reason at 10.15pm last night and felt compelled to open the bedroom blinds and look out. here in the south of england the night sky was faintly lit by street lamps reflected from the mist of volcanic particles filling our atmosphere at present. for perhaps three seconds i stared intently at the clearly defined shape of a triangular black craft which passed silently overhead and out of sight over the house. its shape was of an elongated triangle, reminiscent of concorde. it had lights at each of its three points - red to the front and two white. it was flying to the west at the relatively low height of a small private plane, and was the size of a large passenger aicraft, but silent. the flying ban due to volcanic ash is still in operation throughout the uk, and we have not even had the regular chinook helicopter patrols patrolling around nearby aldermaston nuclear plant for the past few days, and none of the usually constant heathrow and gatwick air traffic. the craft's path would have brought it from the direction of flaring orbs in the sky which develop false navigation lights and which we have been observing for some months. our aldermaston orbs bear a strong resemblance to those repeatedly filmed by alison kruse in pennsylvania, usa, and posted by her on you tube at http:\\\\www.youtube.com\\user\\moreseeingufospa interestingly, during daylight hours on monday last week, before the flight ban was imposed, an unmarked military helicopter flew at roof top height over a heavily populated area and towards the aldermaston orbs. who is observing whom?!"],"Longitude":"-1.313664","Country":"United Kingdom","Date Submitted":"04/20/2010 05:51 UTC","Tags":"City","Viewing Distance":"Unknown","Latitude":"51.409709","Object Shape":"Triangle","Sighting Duration":"00:00:03"}