{"map":"<A HREF = \"http://maps.google.com/maps?q=36.077425,+-79.790075(22900)&iwloc=A&hl=en\"> mufon case (22900) map </A>","Country":"United States","Disposition":"Unknown","Object Features":"None","divs":["Sighting DetailsMy friend and i were walking down the street to my local store from my apartment and I happened to look up,as I heard an airplane that was particularly loud. I saw at first what appeared to be a single, sphere shaped craft that seemed to be trailing the airplane. It was \"silver\" in color when I first spotted it. As i followed the sphere trailing the airplane, it suddenly stopped. I mean it just stopped moving and was perfectly still. I couldn't believe my eyes. Suddenly, the sphere began to turn baby blue as if it were reflecting the sky. It wasn't an immediate change, but more like an exotic lizard--it didn't take more than a few seconds. Subsequently, it then changed from blue to the most amazing green that would describe as emerald, then red. When changing colors it gave the appearance that the craft was \"wobbling\" as the craft would begin the color change at one end of the sphere and it would make its way to the other side. The best way i can describe it alternately is like a modern lighthouse that moved its light beam in a circular motion parallel to the ground, almost like an old fashioned police car siren. I was pretty much just standing in the middle of the street completely mesmerized. About 2 minutes into this I see another sphere that shot by the stationary sphere at incredible speed. I then moved my focus to the new object. It was identical to the first. In order to keep up with it I was pretty much just spinning in circles. I then see another sphere catch up with the fast moving one (#2). They flew in tandem for a few minutes or so and then suddenly reduced their respective speeds to half that of a conventional aircraft and it was at this point that I noticed the silver appearance began to fade as the crafts began to oscillate and change color, still adhering to their formation. Very spooky. In all I believe that I saw 4-5 spheres--but given their intermittent high speed and hovering behavior, it is hard to say precisely how many there were in the air at that time. Definitely at least 3 as at one point there were 3 craft in my field of vision. The funny thing about all of this is that during this whole experience there were still airplanes that were flying either to or from the airport nearby. The craft just seemed to effortlessly avoid the airplanes and at times they appeared to be chasing them, only to turn around and shoot off in another direction. The whole event lasted approximately 20 minutes as one by one the spheres just seemed to disappear. They didn't fly off into the horizon but just kind of vanished instead. This is the second UFO that I have seen...both sightings within 2 years of each other. Both were here in North Carolina, one in Greensboro and the previous one in Snow Camp, North Carolina which is about a 45 minute drive from Greensboro."],"Tags":"City","Date Submitted":"04/20/2010 12:33 UTC","Log Number":"US-04202010-0001","Case Number":"22900","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"01/15/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/22900.html.txt","/var/www/straped/mufon/org/22900.html"],"Sighting Duration":"00:20:00","City":"Greensboro","Region":"North Carolina","Object Shape":"Sphere","Summary":"Translucent, color changing sphere in broad daylight","Weather Factors":"None","trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around January 15th 2010"],"Viewing Distance":"Unknown","Longitude":"-79.790075","Latitude":"36.077425"}