{"Longitude":"-71.757888","Region":"Massachusetts","Date of the Event":"04/18/2010 12:00 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","Latitude":"42.158025","Disposition":"IFO","Source":"MUFON","divs":["sighting detailsme and my parents were watching tv when we spotted a bright white light coming from a field located a few hundred feet away. the view is obstructed by the woods but you could still see the white light that's how bright it was. the light then appeared to start to rise up from the ground until it reached about tree level and then started to move towards our house. at that point we went outside onto our deck and watched the craft move towards us. the noise was unlike ive ever heard from any type of aircraft before and ive heard a lot seeing we live underneath a major airline route used nonstop. the craft moved very slowly at about tree level over our house and we were able to make out all the lights underneath. it had round white lights on each point of the triangle and 3 smaller rectangular lights that fit between the the round lights on the edge of the craft. the craft passed over head very slowly and very quietly for about 1-2 minutes at which point we could make out that there was an arm extending from the middle of the craft that had a pulsating red\\white light. the craft proceeded to move past our house at which point it suddenly took off at an extremely fast rate. i did some research online and found out that there was a sighting in the dominican republic the day before in which they had video of the same craft i had seen the next day over my house."],"Tags":"City","Summary":"Low flying V shaped craft.","trends":["There has been one other sighting in Sutton","There were no other sightings in Sutton on or around April 18th 2010"],"Country":"United States","Object Features":"Undisclosed","Case Number":"22909","Object Flight Path":"Undisclosed","Date Submitted":"04/20/2010 05:40 UTC","files":["/var/www/straped/mufon/html2text/22909.html.txt","/var/www/straped/mufon/org/22909.html"],"Sighting Duration":"Undisclosed","Log Number":"US-04202010-0010","Viewing Distance":"Unknown","City":"Sutton","map":"<A HREF = \"http://maps.google.com/maps?q=42.158025,+-71.757888(22909)&iwloc=A&hl=en\"> mufon case (22909) map </A>"}