{"Object Shape":"Boomerang, Unknown","files":["/var/www/straped/mufon/html2text/22911.html.txt","/var/www/straped/mufon/more/22911_submitter_file1__UFO001.jpg","/var/www/straped/mufon/org/22911.html"],"Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","divs":["Sighting DetailsMy friends and I were in our hometown of Red Bluff, CA, for the annual rodeo each year, on April 17, 2010, and we had just finished eating dinner at our friend B's house. Around 9:30 PM we decided to go into town for the festivities, and since there were more than a handful of us, a few of us had to jump in the back of my buddy T's truck. We were all laying down in the bed of the truck so that we wouldn't be pulled over. It was myself, \"K\", \"B\", and B's brother \"C\", who were in the back of the truck. As we drove along, we were all talking loud, looking around at different things as we whizzed along Wilcox Rd, when suddenly I hear \"K\" yell out, \"Hey, I see a f---ing UFO!!\" and I was like, \"What? You're kidding,\" and I look up into the middle of the sky directly overhead and see this strange shape that at first reminded me of an angular cloud, in a kind of boomerang shape, but a cloud that was moving, and moving quite briskly. It immediately clicked in my mind that this was not a natural object or a natural cloud. It moved in a fashion that is impossible for a cloud, and there was not a natural cloud in the nightsky, it was completely clear out. As my disbelief turned to awe I continued to stare at the object as it glided over our position in complete silence, and I saw that within the cloudy substance that flowed from the front of the object to the rear, was a geometric boomerang shaped object, with sharp lines, as if drawn by a ruler, contrasting against the background. The cloudy mist-like substance seemed to spring forth out of nothing from the front of the object, and trailed over the rest of the craft towards the rear. And as we gazed on in amazement for what was probably at most, 10 seconds, it approached the tree filled horizon, and that coupled with our turn on the road, took it out of our view. We could not believe our eyes, and started cursing a myriad of profanities uttering our complete amazement at what the hell just happened, and what the hell we just saw. \"B\" and \"C\" had looked up a bit later than \"K\" and I, and had failed to see the geometric boomerang shape within the cloudy substance, but they did see the cloudy mist, in an angular fashion, gliding across the sky in a straight line briskly. It had absolutely no sound at all, no lights, and moved in a completely straight line, in a direction that I believe was North or Northeast. We have no idea how big it was, only that it looked extremely large. When talking about it with \"K\" later he told me that he held his hand up to the sky afterwards, with his pinky finger and index finger extended outwards, the others tucked in, in a sort of devil's horn you might say, and he felt like the distance between the two fingers pointing outwards was a good approximation of the wingspan of the strange object in the sky. This however, really does not solve the qustion of just how big it really was, rather it only makes the argument for it being rather large. If it was close to us in the sky, it was still huge as all hell, and if it was even higher up in the sky, then its size is even larger, almost mind boggling large. This story is written with all honesty and complete truth. Both \"K\" and I had always believed in the possibility of UFOs, but had never seen or experienced anything like this in our lives. After talking about it more and more, we both feel like this is an event that has changed our lives forever. To us there is no question about it: this was a real UFO, and it was not of this Earth. There is absolutely nothing manmade out there, not the stealth bomber, or anything, that can match up to what we saw that night. Immediately the following day after seeing the object, I began to research online what sightings of UFOs were out there that met the same description, and I came upon a sighting of a UFO seen over Belville, Texas, in September of 2009, Case Number 19343. The article describing the UFO fit our description perfectly in almost every detail. The way it was described to be moving, that at first it seemed to be a fast moving cloud, but not a cloud at all, the way it looked, and the way it glided across the sky in a straight line. After reading this I knew that this was the exact same craft we saw, and that we were not alone in witnessing such a spectacular object. I will forever be changed by this. Let people judge me how they may, but I speak the truth. This is what I saw, and I was not alone in seeing it. Something IS out there."],"Weather Factors":"None","City":"Red Bluff","Date Submitted":"04/20/2010 06:13 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.184659,+-122.2305(22911)&iwloc=A&hl=en\"> mufon case (22911) map </A>","Log Number":"US-04202010-0011","Region":"California","Date of the Event":"04/17/2010 09:30 UTC","Summary":"My friend and I saw a large, boomerang shaped object, with a cloud-like substance flowing over the object from the front to the back of the craft. It was silent, moved in a straight line, with no lights on the object at all.","Latitude":"40.184659","Disposition":"Unknown","Source":"MUFON","Longitude":"-122.2305","trends":["There have been 6 other sightings in Red Bluff","There were no other sightings in Red Bluff on or around April 17th 2010","This sighting has never been favorited.",""],"Case Number":"22911","Object Features":"Unknown","Sighting Duration":"Undisclosed"}