{"Latitude":"32.534026","Region":"Texas","Disposition":"Unknown","trends":["There has been one other sighting in Ferris","There were no other sightings in Ferris on or around"],"Summary":"Very large,and round.In the nite sky it was hard to tell how largeit was,not knowing how high up it was.There were white lites that went around it,like chasing lites.Very deep humming or vibrating sound.Seemed very close to ground and moving about 20 mil","Country":"United States","Object Flight Path":"Undisclosed","divs":["Sighting DetailsThis event happened shortly after my son saw it streaking across the horizon like a falling star,stop suddenly,than streak back in the same direction and dissappear. Five minutes later this large vessel appeared over my back yard,seemed to hover, than continue on slowly,back towards the woods where I could no longer keep up with it.This is actually just one of many other events out here.This was the only time we,my son and I and a few next door neighbor kids witnessed,what we all know as a ufo. When I was 13 years old,my family lived in Calif,where on this one nite I had gone outside to find my cat socks.It was late around midnite,and I stood out in the street calling to her,only to suddenly feel I was being watched and I looked straight up over me,and in the sky hovered this huge round object,with the same lites I saw now here in Texas, several years ago.Back than I had never heard of ufos,did not know what I was seeing, but continued to stare straight up at it for several minutes,when suddenly it darted up at an angle and dissappeared.Years later when I was an adult,and learned about ufos,I than knew what I had seen that nite.It was exactly like the one we had seen over my pasture here in Ferris. I had an incident out here several years back,with a friend who was visiting.This friend was a bad friend I guess you could say,he had sawed rings around all my young trees I had planted out here to destroy them,after a breakup.He had allways teased me about my ufo sightings out here until this certain nite.He was here to apologize for his horrible misdeeds,and sat in the living room,facing a window that faces out the back to the pasture.Suddenly,the whole living room lit up,and we were both shocked. I stood in the kitchen,and watched as these bright lites were like moving and like in a searching way,up and down the walls,like very bright lites from a car or something.This person sat speechless staring out the window,and this went on for maybe, 40 seconds than was gone.The guest jumped to his feet,and started going on about this big ball of lite that just opened up down in the pasture,than he said it just shop this beam of lite straight thru the window.He kept saying something about the bush in front of the window and how it was like it was not even there.We went out quickly to the deck in the back,there was nothing in the pasture, but I looked up in the sky,and saw it.It was a star,brighter than all the rest,that is how they look, it was almost like it saw us looking at it,because than it suddenly shot up at an angle, and dissappeared from site.I knew exactly wht it wass than.My guest than fervently believed in ufos,from this point on,and insisted they were after him,and somehow watching out for me,because of what he had done to my trees.Never saw this person again. About a year ago, I woke up,went into the kitchen to get a drink.I did not turn any lites on as I went.My house which is empty at the end of the hall,since my son was not staying here at this time.There was a lite on at the end of the hall.Not the type of lite which would be from a bedroom or bathroom,but a dimish,kind of foggy almost,well hard to explain,however as I stood there in the dark looking down the hall wondering if my son had come home,it suddenly went out.We walked to the other end of the house searched,and no one was there,the doors were all still locked,windows etc.,no one had come in,but there was a lite on,that went off when I saw it. There was another important incident out here. I was by myself this one nite and had settled in to spend an evening watching tv.At 8 pm, I began watching a show called incredible fat man or something.It started off about this overweight guy,which had to be taken to the hospital by tr uck he was so big,and how he was having hamburgers sneacked in.Well a commercial came on,and I stepped out on the back deck to call in Sabrina my German Sheperd.Than all I remember is feeling stressed it took her so long to come when I had called her.I remember looking down and seeing her at the foot of the stairs and saying what took you so long.Than I hurried in thinking the commercial was over and did not want to miss any of the show,to my surprise,I could not find my show,there was something else on the same channel,and I am thinking what is going on.I glanced up at the clock and it was 9 15 and it should have been 8 15 so I am thinking I am loosing my mind.An hour just dissappeared. There have been other incidents over the years since I have been out here.I know they are the unbelievable ones,they are the ones I hesitate to mention,because than people than think too unbelievable and than I become or loose any credibility,but you know It does not matter.Believe it or dont believe it.This story happened when I first moved out here, 20 years ago.I let an ex sleep on the couch in the liveing room.Around 2 in the morning I was woke up by this person who was hysterically beating on my door.By the way,this is the very first incident that took place out here.When I finally got up and opened the door,I remember how excited he was,almost in a scared way,and going on and on that I had to see this,and he was so like astonished himself.He told me he had fallen asleep this nite watching the stars out the window.He said there was a falling star shower which I already did know about.He said he fell asleep,and was awoke by the sounds of what he first thought were kids laughing.The sounds he said went around the house so he got up and saw figures running outide my house.He than said he saw them,children down in the pasture by the tank,but than they would suddenly be next to a barn 100 feet away without walking to it.This is when he realized something was wrong with the picture, they did not wear clothing,and appeared greyish.It was at a distance but he said he could tell they were not kids.He said they sounded like kids playing and laughing but were not.He had than come in the house to wake me,and during this time,at least 5 minutes of getting me up,and briefing me, and when I got out on the back deck they were gone.I never saw them,but I was convinced this person did. Also,thru the years as my son grew up he tells me now about the eyes looking in his window at nite,and his fear of his bedroom.He use to allways ask if he could sleep in my room,there were faces in his windows and he was scared,and I feel so bad now,I thought he was making these stories up.We have all experience feeling someone is in our rooms at nite and watching us.I am sorry,everyone but be that is has felt or seen shadows at nite,standing in thier rooms outside thier doors.I thought these were spirits,I do not know anymore. My feelings about all these experiences are feelings of gratitude,that I may have been chosen for what ever reason they have to make themselves or thier existence known to me.Not everyone will have these experiences in thier lifetime so it is an honor for me.I believe there are the good ones and the bad ones,and the ones I feel I have had contact with are of course the good ones,the little ones.I somehow feel a very peaceful feeling when I think of them,I feel they are harmless to humans that is. I have found many small animals out here,dead and very strange.We found a cat that had been missing for several weeks one day laying in the front yard right after it had rained.We did not know what the object laying in the lawn was at first till I picked it up.there were absolutely no insides to it.The head and legs and tail were all tucked inside like a sock turned inside out.It was horrible, and the eyes looked like the cat was still alive.There have been a few other animals found on my property simialar,and are they ufo realated,who knows.Well these stories did not just happen but over the years I have been out here.There is nothing to investigate,they left me with no evidence. I am certainly not afraid, well at least that is what I say now.If I woke up on a ship it may be another story,but really, the thought that they may come agin fasinates me."],"Weather Factors":"Unknown","City":"Ferris","Longitude":"-96.665549","Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"04/21/2010 12:33 UTC","Case Number":"22917","Viewing Distance":"Unknown","Log Number":"US-04212010-0001","files":["/var/www/straped/mufon/html2text/22917.html.txt","/var/www/straped/mufon/org/22917.html"],"Object Shape":"Disc","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.534026,+-96.665549(22917)&iwloc=A&hl=en\"> mufon case (22917) map </A>"}