{"Region":"Oregon","Longitude":"-122.632851","Latitude":"45.44767","Date Submitted":"04/21/2010 12:54 UTC","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI am not the witness. I met the witness today while having lunch at ****** Bar located at *** ******** Ave, Gladstone, OR, 97027. His name is *** and he is a regular who appears approximately in his early 60s. On Monday, April 12th, he witnessed a very bright, colorful UFO flying at an altitude of only 300 feet. He said it was about 90 feet long and make a low humming sound that \"you could physically feel.\" He first noted it coming from across the Willamette (near West Linn) heading in a northerly direction. He said it \"shifted\" to a ENE direction without turning or banking. It moved very slowly. He said it changed multiple colors but without a distinct light source. He stated that he flagged down a car and asked the two people in it to confirm what he was looking at. They concurred then drove off. He claims he had not been drinking. Ultimately it flew towards Clackamas before he lost sight of it. Days later, while visiting his daughter, he described what he saw. His grand-daughter overheard him and said she saw it too. I have yet to find any news on this so far. I hope this is helpful. I plan to go back to talk with him more. My contact info is ***-***-**** My Name is **** ***** Feel free to call, but like I said, I was not a witness to the event."],"Date of the Event":"04/12/2010 09:30 UTC","files":["/var/www/straped/mufon/html2text/22918.html.txt","/var/www/straped/mufon/org/22918.html"],"trends":["There have been 10 other sightings in Milwaukie","There were no other sightings in Milwaukie on or around April 12th 2010"],"Viewing Distance":"Unknown","Case Number":"22918","Country":"United States","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.44767,+-122.632851(22918)&iwloc=A&hl=en\"> mufon case (22918) map </A>","Weather Factors":"Unknown","City":"Milwaukie","Source":"MUFON","Log Number":"US-04212010-0002","Summary":"UFO seen over Milwaukie on April 12th.","Disposition":"Insufficient Data","Object Shape":"Sphere"}