{"Longitude":"-72.426196","City":"Southold","Weather Factors":"Unknown","trends":["There have been no other sightings in Southold","This sighting has never been favorited."],"Date of the Event":"04/18/2010 12:00 UTC","Log Number":"US-04202010-0012","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Sphere","Country":"United States","Disposition":"Insufficient Data","Latitude":"41.064822","files":["/var/www/straped/mufon/html2text/22912.html.txt","/var/www/straped/mufon/org/22912.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.064822,+-72.426196(22912)&iwloc=A&hl=en\"> mufon case (22912) map </A>","Sighting Duration":"Undisclosed","divs":["sighting detailsi was on my back patio having a smoke and was looking up at the stars when a sphere shaped, framed, not solid object went right over my head, across the yard and disappeared over the treeline behind my property after being visible for approx 100 yds. it was traveling slow enough for me to follow it and absorb the details etc. pls find listed below various details as to what i saw: 1) it looked like the toy that is constructed of 6 inch plastic rods that opens and collapses. the object was a frame and not solid.it was the size of a basketball , maybe a bit larger. 2) it displayed vivid colors that i have never witnessed ie hi glow orange, blue, violet, yellow, red. the lites were constantly changing positions. they were neon like but 100x more vivid. 3) it made no sound nor did it leave a trail of smoke or lite. 4) it moved to quickly to be a balloon. it was not a gas powered plane, helicopter or remote type device nor was it fireworks. 5) it was elaborate and sophisticated. 6) after i saw it, i thought to myself i just saw my 1st ufo. it was thrilling because i don't believe what i saw was manmade. i immediately thought it was some type of probe but not military or police\\govt agencies. i was certain it was from another world."],"Summary":"MULTI COLORED BASKETBALL SIZED SPHERE CROSSED OVERHEAD AT APPROX 100 MPH/100-150FT.","Date Submitted":"04/20/2010 07:03 UTC","Tags":"City","Source":"MUFON","Region":"New York","Case Number":"22912"}