{"Disposition":"Unknown","divs":["Sighting Details In the spring of 1988, i was walking from the hot-springs fed swimming-pool and daytime resort complex,across the unlit road,to the employee housing complex,probably one-quarter mile southeast, and uphill. After leaving the pavement, I was on the steeper narrow dirt path,and had to hold an arm out to block tall weeds and shrubs. As I walked,I was looking forward and up, and I saw what I first thought was the moon,but it was moving toward the east very slowly. As I stopped and watched the object,I realized it was slowing down. I noticed a very rough surface and saw a very small piece of debris fall away at the same spot from which arose a small blue-white flicker of flame. The object was moving slow enough at this time, that the flame was not influenced by the wind or the forward motion. The object moved from approximately a 7:00 position to a 4:00 position across my field of vision.The object took maybe two to two and one half minutes to cross my field of vision. I was walking south- south- east. After the object passed over the trees and ridges to the east,I stood still, and hoped to hear it hit. I heard nothing . I then hurried the next couple of hundred yards to my apartment, and rushed in to tell my girlfriend about the funny-moving, odd-looking thing I had just seen. She pretty-much just appeared uninterested.I then went back outside to see if anyone else was able to see what I saw.The security guard was just pulling up outside by the side walk. I asked him if he had seen what I had just seen. He said he had and it scared him. I suggested that he should report it to someone. He didn't act like he was in any hurry to tell anyone. I do not ever remember discussing the subject again with him. I asked around and only one other person admitted to me that they had seen the object.The other person was born again religious and simply shrugged it off as a manifestation of god. This incident occurred on (over?) the warm springs indian reservation.The object was easily five times the size of the sun or moon.The object was mostly dark, but was clearly visible, and had small patches of reddish-orange, and other small patches of blueish-white.The small piece of debris that sort of popped out or off was from a blue-white patch."],"Longitude":"-121.266162","Object Flight Path":"Straight-line path","City":"Warm Springs","Country":"United States","Date of the Event":"04/10/1988 09:30 UTC","Source":"MUFON","Region":"Oregon","Log Number":"US-04212010-0007","Weather Factors":"None","Sighting Duration":"00:02:00","trends":["There has been one other sighting in Warm Springs","There were no other sightings in Warm Springs on or around April 10th 1988"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.763452,+-121.266162(22923)&iwloc=A&hl=en\"> mufon case (22923) map </A>","Latitude":"44.763452","Case Number":"22923","files":["/var/www/straped/mufon/html2text/22923.html.txt","/var/www/straped/mufon/org/22923.html"],"Date Submitted":"04/21/2010 10:13 UTC","Object Features":"None","Summary":"I was one of three witnesses to a rough-surfaced,silent,slow-moving, large, spherical object at approximately 9:30 pm","Object Shape":"Sphere","Tags":"City"}