{"Latitude":"40.61788","Date of the Event":"04/21/2010 08:18 UTC","Case Number":"22932","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was taking my daughter to her fathers house Leaving from allentown going towards kutztown.It was 7:40 when we left. We were traveling on Shantz rd. Near the police station when I just turned my head to look out the window and I saw this large light over the industrial park. What really caught my interest was the color and size.It was this reddish orange light that just pulsated. I was driving so I put my eyes back on the road and I asked my 10 year old daughter if she saw it. She looked over and said yes what is that. She kept and eye on it and realized it was not moving. We then went over the hill towards the winery and we looked back to try to see it again and we couldn't. It was to low to see over the hill. So we just dismissed and went on our way to Kutztown. The best way I could describe this was if you could imagine a low flying air plane that was just a ball of puslating light and didn't move. Thats how big it was. So I drop my daughter of in Kutztown a little after 8 pm and start heading home. I get to where I turn of on 222 to Shantz rd. There is a gas station right there. I pass the gas station and just look toward the Terri Hill Water Park area of 222. My heart Dropped Three Extremly large Lights Reddish Orange like the size of a full moon all in a perfect triangle shape. The lights spanned maybe the half the size of a football field. I couldn't believe how low and large it was. I thought to myself I need to get a picture of this my husband will never believe me. Where I was on Shantz Rd I couldn't pull over so as soon as I got to the Lucent Building drive way I pulled over but the building was blocking the lights. I still can't believe what I saw. I called my husband and told him. While I was on the phone with my husband I decided to see if I could see it if I kept going further. I drove up and over the hill turned onto the road to go into the industrial park knowing this is where I saw the other light earlier. I turned onto the road and I saw nothing as if nothing ever happened. There is now way that I was the only one that saw this."],"files":["/var/www/straped/mufon/html2text/22932.html.txt","/var/www/straped/mufon/org/22932.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.61788,+-75.482693(22932)&iwloc=A&hl=en\"> mufon case (22932) map </A>","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Fireball, Triangle","Log Number":"US-04222010-0005","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-75.482693","Region":"Pennsylvania","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around April 21st 2010"],"Object Flight Path":"Stationary","Date Submitted":"04/22/2010 05:51 UTC","City":"Allentown","Summary":"It was three very large reddish orange lights in a triangle formation","Disposition":"Unknown"}