{"Disposition":"Unknown","divs":["Sighting DetailsFirst off, I didn't believe in u.f.o sightings prior to last night. My friend and I were sitting out front of my house on my stoop smoking a cigarette. All of a sudden I saw this thing. It was really bright, like it drew my attention to it when I wasn't even looking in that direction. It kind of appeared out of nowhere or I didn't see it come and it had a straight steady trail until it got to a certain point in the sky and then it looked as if it were just falling towards the ground. My first thought was it's a bomb (that was a dumb first impression because bombs don't light up really really bright and they don't just change their course out of no where. It was just the most possible to happen ,in my mind, at that very second), so I had an extremely panicked look on my face to the point that my friend got scared just because of the look on my face. I was telling him all about it afterward because I knew he would be one of the only people that would believe something like that. I kept saying I wish you could've seen it so I had someone else that really saw it too. Then all of a sudden it came back. It was in a different location in the sky. It almost did a loop in the sky and then started to steady off on a straight path and then in the middle of the sky in my direct line of view, the u.f.o vanished into thin air. At first, I was terrified because I thought that I was about to die at any second, then after I realized that it was definitly a u.f.o, I was still kind of scared but also excited because, well, I just saw a u.f.o. I was also happy that I personally now had proof that there really are u.f.os. I know it wasn't a satellite because it was larger, closer to earth and waaaaay to fast to be a satellite. It couldn't have been an airplane or helicopter, they are always around my house and i know what they look like very well. This sighting could not have possibly been anything other than a u.f.o"],"trends":["There have been no other sightings in Kenhorst","This sighting has never been favorited."],"Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/22947.html.txt","/var/www/straped/mufon/org/22947.html"],"Source":"MUFON","Summary":"very bright, decently large green light with a black center that moved freely","City":"Kenhorst","Region":"Pennsylvania","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.310648,+-75.939376(22947)&iwloc=A&hl=en\"> mufon case (22947) map </A>","Case Number":"22947","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"40.310648","Tags":"City","Date of the Event":"04/23/2010 11:30 UTC","Longitude":"-75.939376","Date Submitted":"04/24/2010 08:48 UTC","Object Shape":"Circle, Other","Log Number":"US-04242010-0004"}