{"Weather Factors":"Unknown","divs":["Sighting Details I WAS CAMPING WITH MY FRIEND HIS MOM AUNT SISTER AND ANOTHER FRIEND. WE ALL SEEN A VERY BIG AND BRIGHT STAR IT WAS BIGGER THAN ANY OTHER STAR IN THE SKY. AS WE WERE AT THE CAMP FIRE WE ALL STARED AT THE STAR IN SILENCE NOT EVEN MENTIONING IT TO ONE ANOTHER. AFTER A GOOD FIVE OR TEN MINUTES OF STARING AT IT WE NOTICED THAT WE WERE SURROUNDED BY A CIRCLE OF COOL BLUE ALMOST WHITE LIGHT THIS LIGHT STAYED ON FOR MINUTES WILE WE WERE FROZEN IN SILENCE. AFTER A WILE THE LIGHT DIMMED OUT AND DISAPPEARED BUT AS THE BEAM OF LIGHT DIMMED OUT THE STAR SLOWLY SHRANK AND DISAPPEARED WITH IT IN SEQUENCE AT THE SAME TIME. WE ALL SAT QUIET FOR A WILE AND STARTED TALKING ABOUT IT IN EXCITEMENT AND FEAR TRYING TO FIND A LOGICAL EXPLANATION FOR WHAT HAPPENED. AFTER COMING BACK HOME FOR A WEEK OR SO MY FRIENDS MOTHER SHOWED US A LOCAL NEWS PAPER SHOWING THAT THERE WERE CROP CIRCLES FOUND NEAR BY. MY FRIENDS SISTER ALSO SAID THAT SHE HAD A DREAM THAT WE WERE ABDUCTED AND SHE REMEMBERED THAT HER BROTHER WAS SCREAMING TRYING TO FIGHT AND THAT ARE OTHER FRIEND WAS CRYING AND I WAS SLEEPING. THIS SOUNDED TRUE TO ME IN THE PART THAT SHE SAID MY FRIEND CHRIS WAS CRYING AND SHE DID NOT KNOW HIM THAT WELL BUT HE WOULD BE THE TYPE TO CRY AND GET SCARRED BUT DID NOT LOOK LIKE IT AND SHE JUST MET HIM. BUT HER BROTHER ALSO TOLD ME THAT HE THOUGHT SHE WAS LYING AND I AM NOT SURE IF SHE TOLD HER MOTHER BROTHER AND AUNT THE SAME STORY TO OR MADE IT UP TO ME."],"Viewing Distance":"Unknown","Date of the Event":"07/14/2003 11:00 UTC","Object Features":"Unknown","City":"Roscommon","trends":["There have been 3 other sightings in Roscommon","There were no other sightings in Roscommon on or around July 14th 2003"],"Object Shape":"Star-like","Country":"United States","Date Submitted":"04/24/2010 03:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.314739,+-84.76475(22949)&iwloc=A&hl=en\"> mufon case (22949) map </A>","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/22949.html.txt","/var/www/straped/mufon/org/22949.html"],"Longitude":"-84.76475","Case Number":"22949","Latitude":"44.314739","Log Number":"US-04242010-0006","Summary":"BIG STAR SHOT BEAM OF LIGHT ON US","Sighting Duration":"00:15:00","Tags":"City","Disposition":"Insufficient Data","Region":"Michigan","Source":"MUFON"}