{"Object Flight Path":"Hovering then path,Straight-line path,Other","Source":"MUFON","Tags":"City","Date Submitted":"04/25/2010 02:10 UTC","Case Number":"22959","divs":["Sighting DetailsMy family and I took a trip up north to Cambria. We entered the town Cayucos (next to Morro Bay) and I am looking to the right of me where there are houses next to the green hills. I immediately spot a craft flying extremely low and very very slow. It was \"cruising\" ever so slowly over where the cows were grazing. It had a big red light blinking every 2 seconds. I knew right away it was a UFO and asked my partner to hurry and get closer. He gets off the main road and manages to find a dirt dead end street right below the hills where the craft is still cruising. I run out of the car getting as close as I can. My partner is watching this as well, along with our 4 year old daughter. The 2 year old one is sleeping in the car. I could clearly see that this craft was round in shape, silver metallic in color, and a part of it spun counter clockwise at the same time something brownish or darkish spun the opposite way. Once it has spun a full circle, a big red light would blink approximately every 2 seconds. The craft is going at a very slow pace and starts moving further away, at the same time elevating higher....we keep watching it the entire time until we barely could make it out, except for the red blinking light. A huge airplane is coming going north, then two others are coming right after...and the this craft elevates even higher and goes right underneath the planes. We can no longer see it and decide to continue our trip. I want to add that a couple of minutes into observing the craft, I started to see some glittery interesting little \"things\" in the air. Millions of them, they convered the air, the atmosphere...as I was watching it wondering what in the world...? My partner speaks up saying; I am also seeing these little white glowing wormlike things all over the air. We both described them the same way. He also said he got a shockingly powerful headache just like that, along with a icy feeling in his forehead. I felt fine, except being high with excitement and adrenaline rush. Later on a headache crept in, along with an extreme back soreness, as if I had worked out like mad or something. I am still sore today. the day after. The inside of my left elbow also became extremely sore and sensitive to touch, along with a slight bruise on the back of my arm which wasn't there before. One more thing to add, which I also report separately is that on april 5th at 10:40pm, I saw a huge red light hovering close to the freeway. It was silent, did not move and the red light did not pulse or blink. Later on I lost consciousness at work...woke up somewhere else on the floor with extreme soreness in my abdominals...I will fill in a report on it."],"Object Features":"Unknown","Viewing Distance":"Over One Mile","City":"Cayucos","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Region":"California","Latitude":"35.442751","Longitude":"-120.892125","trends":["There have been no other sightings in Cayucos","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/22959.html.txt","/var/www/straped/mufon/org/22959.html"],"Date of the Event":"04/24/2010 12:00 UTC","Summary":"UFO slowly cruising the hills in Cayucos","Log Number":"US-04252010-0006","map":"<A HREF = \"http://maps.google.com/maps?q=35.442751,+-120.892125(22959)&iwloc=A&hl=en\"> mufon case (22959) map </A>","Disposition":"IFO","Object Shape":"Circle"}