{"Object Flight Path":"Hovering then path,Straight-line path","Viewing Distance":"Unknown","Weather Factors":"None","divs":["sighting detailsmy observations were made from the parking lot in front of tj maxx store in the target shopping center on the west side of bald hill road (rte 2), in warwick, ri on april 24, 2010 at 3 pm. sky condition was 35% scattered thin cirrus clouds (wide bands similar in shape to jet contrails) in a transparent blue sky. temperature was about 70 deg f. i was sitting in my car looking in an easterly direction with sunroof open, due to the heating from the bright sun. i was waiting for my wife while she was shopping at the maxx. to pass the time while eating my apple snack i started to watch jet planes high overhead (approx 15,000) as they were making a beeline to and from boston's logan airport. i watched several of the northbound jets and at one time i noticed what i first thought was a white jet at a higher altitude traveling southeasterly (diagonally) across the apparent path of a boston bound jet. i then noticed 3-4 of these small white winged objects and concluded they must be seagulls soaring high above warwick, which is not uncommon for this city of 100,000 +\\- on narragansett bay. anyway, i watched another jet continuing along the same \"to boston\" trajectory and then noticed a intensely bright, white, circular object in a northeasterly direction and approximately 70 degrees above the horizon. i thought it funny that it just hung in that position for many minutes, but it was lazily moving extremely slowly generally in a figure-eight pattern, which i verified by lining the object up with the edge of my car door jamb. as far as i could tell, the object did not vary in brightness, color or shape during my total observation. it was brighter than a daytime observation of the planet venus and it definitely exhibited a diameter (disclike). i did have the distinct impression that it was spherical but without the aide of optics i was unsure. after several minutes of watching the object at the initial altitude, it started to drift slowly in a nearly straight path to the northeast --- my tall vertical light stanchion was my reference to determine this, for sure. i continued watching until the object met a cirrus cloud and then i lost it at about 40 degrees above the horizon. at last sight, the diameter of the object did appear to shrink a little bit, but the brightness did not. my sighting lasted apporximately 25 minutes and, unfortunately, ended about 10 minutes before my wife returned from shopping...i was hoping i could show this to her to get her impressions. after i spotted the object i wondered what it could be. venus? no, wrong position. another plane with lights coming toward me? no, too slow and not a pinpooint light source and planes don't wobble in an almost stationary position. a helicopter? no, uniformly lit and probably too high. a weather balloon? maybe, but strange behavior for a weather balloon. i also initially thought it might be a daylight supernova until i examined it more intently and noticed the slight wobbling motion. i did not think of ufo at first but i came to that conclusion as my observation went on. it brought back a memory of the same kind of sighting i had when i was about 13 years old when one summer day i was playing in a park with the neighborhood kids, also in warwick, ri. i have had several other sightings over the years but never reported them to anyone. my last sighting was a few years ago when i was in florida on vacation. i have been an amateur astronomer since a teenager and own a couple of telescopes. i am also a ham radio operator. i am a professional engineer (civil) licensed to practice in several states."],"Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Warwick","There were no other sightings in Warwick on or around April 24th 2010"],"City":"Warwick","Tags":"City","Disposition":"IFO","Longitude":"-71.413827","Log Number":"US-04252010-0004","Latitude":"41.706601","Region":"Rhode Island","Date of the Event":"04/24/2010 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.706601,+-71.413827(22957)&iwloc=A&hl=en\"> mufon case (22957) map </A>","Summary":"Bright White Circular Disc Observation in Warwick, RI on 4/24/10","Date Submitted":"04/25/2010 11:58 UTC","Case Number":"22957","Object Shape":"Circle, Disc","Country":"United States","Object Features":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22957.html.txt","/var/www/straped/mufon/org/22957.html"]}