{"Object Features":"Patterned Surface","City":"Port Huron","Case Number":"22951","Country":"United States","Object Shape":"Triangle","Latitude":"42.975663","files":["/var/www/straped/mufon/html2text/22951.html.txt","/var/www/straped/mufon/org/22951.html"],"Source":"MUFON","Log Number":"US-04242010-0008","Longitude":"-82.418504","Region":"Michigan","Weather Factors":"Unknown","Date Submitted":"04/24/2010 04:28 UTC","Sighting Duration":"Undisclosed","Summary":"My 15 yr. old daughter witnessed small aircraft hovering right in our yard","divs":["Sighting DetailsOn the evening of April 22, 2010 my 15 year old daughter claims to have witnessed a strange triangular object hovering in our yard. It all started when she was swinging back and forth on the swing and she noticed something in the sky off to the west. It was quite a distance away and as it began to get closer she thought possibly it was a helicopter getting ready to land in our yard but as it continued to get even closer she knew it was too small to be a helicopter. It started fom the west in an eastward direction then shifted slightly to the north and back eastward until it was over our roof and into the east side of our yard. It suddenly remained stationary for a few seconds. She describes it as being dark, triangular shaped and thick like a rock with a metallic look to it. She said it remained for a few seconds then basically disappeared to the north. What was even more astonishing was the speed at which it departed. It was so incredibly fast that it seemed to disappear right before her eyes. Immediately after her experience she came into the house and stood there with this dumbfounded look. I won't ever forget the look on her face as she was trying to tell us what she just saw, but we were oblivious as we were all laughing and arguing about something that I really don't remember at this time. She had this nervous laugh that almost seemed to be mixed with heavy breathing and panting as she was having difficulty getting any words out. And then the words came out, \" I think I saw a ufo\" that was when we all began to lower our voices and focus solely on her. I must admit sarcasm wanted to get the best of me initially following her comment but her laugh turned immediately into sobbing and she was so visibly shaken that I thought she was going to collapse. All I could do was go over to her and pull her into me to calm her. After she told us what happened we all went outside to see if we could see anything and by this time darkness was falling. We all witnessed approximately 4-5 aircraft in the night skies over St. Clair County. I personally believe the aircrafts were from Selfridge and maybe they tracked this strange object on radar. Needless to say I probed my daughter with questions. I asked her if it had windows- no. I asked her if it was large enough to hold people- she didn't think so. I asked her exactly where the orange lights were located on the craft- she claimed that the corners were glowing dim and that she didn't see any direct bright lights. I wanted to know just how close this thing was and so I asked her if she thought a rock could possibly hit it if she threw one and she replied yes (omg). I also asked her if there was any type of noise coming from the object and unfortunately she had earphones on listening to music from her mp3 but she did turn off the music at some point during the encounter and with her earplugs still in, she still didn't hear any noise. I also want to mention that the entire object was rotating in an unusual manner- not just in an up & down fashion but sideways as well (at the same time). The bottom was flat, metallic and smooth and the top was thick and maybe domed shaped? It had some sort of pattern to it that she isn't very clear about but claims that it sort of resembles a rock cut in half. I am just amazed by the fact that it was that close!!! Anyway, I still continue to question her."],"Date of the Event":"04/22/2010 12:00 UTC","Viewing Distance":"20 Feet or Less","Disposition":"Unknown","Tags":"City","Object Flight Path":"Path then hovering","trends":["There have been 11 other sightings in Port Huron","There were no other sightings in Port Huron on or around April 22nd 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.975663,+-82.418504(22951)&iwloc=A&hl=en\"> mufon case (22951) map </A>"}