{"Object Flight Path":"Stationary","Longitude":"-111.823922","Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around August 4th 2008"],"Case Number":"22960","files":["/var/www/straped/mufon/html2text/22960.html.txt","/var/www/straped/mufon/org/22960.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.423084,+-111.823922(22960)&iwloc=A&hl=en\"> mufon case (22960) map </A>","Object Features":"None","Region":"Arizona","divs":["Sighting DetailsI am responding to a report submitted from Mesa, AZ on Apr 24, 2010 regarding circling lights that merged. I was on the fence about UFOs existing until Aug. 4, 2008. At 5am I woke to get ready for work. I made a cup of coffee and went out on the back patio to drink my coffee. We had a good rain storm the night before and the sky was still somewhat cloudy. I looked at the trees in our yard that were to the west and something above them caught my eye. I could normally hear the cars on Apache Blvd and that morning it was dead silent. I don't know how high in the sky they were, but they were very large. They didn't seem much higher than our 2 story house, though I knew they were. There was one large white circular light with five smaller white circular lights rapidly circling the larger one. Then they would all merge with the larger one and bounce right back out to the circle formation and rapidly circle again. One rotation around the larger one and then they would merge again. I was quite frightened and felt that there was something behind me but nothing was there. I guess my imagination was getting the best of me. I grabbed my cell phone and called my husband who was already at work. We stayed on the phone for about 15 minutes and he told me I better get ready for work. He worked in Phoenix and looked at the sky there but didn't see anything. After ending the call I couldn't pull myself away to get dressed for work. I got my camera but nothing showed on the camera. About 15-20 minutes later I called him again because they were still there but now after they merged and went out in a circle, a sixth smaller circle shot out and disappeared after it was away from the moving circle of lights. I stayed outside for almost an hour watching it then had to get dressed for work. Before I left the house I went out back again and it was still there. Low dark clouds were starting to form for another storm. As I watched the clouds go below the lights, they were blocked out from the clouds. That made me realize I was looking at something that was lighting the sky from above not below. Ever since then I have been searching for someone to have a sighting like the one I had. It amazed me that someone else reported the same thing 2 years later in the same state and city that I had resided in."],"Latitude":"33.423084","Object Shape":"Circle","Disposition":"Unknown","Date Submitted":"04/25/2010 02:31 UTC","Summary":"1 lg circle w/5 smaller circling then merging with lg circle then circling again","City":"Mesa","Date of the Event":"08/04/2008 05:10 UTC","Weather Factors":"None","Log Number":"US-04252010-0007"}