{"Date Submitted":"11/30/1967 12:00 UTC","Longitude":"-79.530529","map":"<A HREF = \"http://maps.google.com/maps?q=40.309828,+-79.530529(2297)&iwloc=A&hl=en\"> mufon case (2297) map </A>","Object Flight Path":"Unknown","Sighting Duration":"00:00:00","Tags":"City","Viewing Distance":"Unknown","City":"Greensburg","Latitude":"40.309828","trends":["There have been 21 other sightings in Greensburg","There were no other sightings in Greensburg on or around November 30th 1967"],"Case Number":"2297","Country":"United States","Object Features":"Undisclosed","Object Shape":"Other","Source":"MUFON","Log Number":"","Disposition":"Insufficient Data","Weather Factors":"Unknown","Region":"Pennsylvania","divs":["Sighting DetailsWhen I was 2 to 4 years old 1968 - 1970, my mother wrote down in a journal thatI had a pretend friend whose name was Arjid, at our residence at 444 LocustStreet in Greensburg.I dont remember this pretend friend at all. However, I recently looked up theword on the internet. It turned up in one language only, called Manx, meaningHighness.I had no idea what Manx was or where it was spoken. I did some research andfound out it is an extinct Gaelic language once spoken on the Isle of Mann offthe coast of England.In one of Whitley Striebers books, Transformation, there was a possibleconnection mentioned between the Gaelic languages and the Visitors.I cant shake the suspicion that maybe I was visited at a very young age inGreensburg.There was one other incident, maybe around 1970 or 1971, where I thought I saw apurplish silhouette of a man or something standing outside my second storywindow. He or it would have been standing on our sun parlor roof. Anyway, itscared the shit out of me. But I have always passed that off as a hallucination,or maybe even an after image from rubbing my eyes. It also could have been myolder sister playing a prank on me."],"files":["/var/www/straped/mufon/html2text/2297.html.txt","/var/www/straped/mufon/org/2297.html"],"Date of the Event":"11/30/1967 12:00 UTC","Summary":"Possible contact with visitors as a child"}