{"Disposition":"IFO","Source":"MUFON","Case Number":"22972","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around April 18th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.965676,+-82.997354(22972)&iwloc=A&hl=en\"> mufon case (22972) map </A>","Region":"Ohio","Viewing Distance":"Unknown","Date of the Event":"04/18/2010 11:30 UTC","Object Flight Path":"Undisclosed","Latitude":"39.965676","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-04262010-0002","Weather Factors":"Unknown","divs":["Sighting DetailsMy son, a friend of his and I were driving west on E. Hudson Ave in Columbus, OH at about 11:30pm after dropping off one of their friends. I was driving about 25 mph on Hudson on the way to catch the I-71N entrance ramp. Several blocks east of 71 I first saw lights in the sky, very low, about 1000 ft up and slightly to the south of us - it was not directly overhead, but was in front of us and off to the south side and was surprisingly low. It caught my attention because there seemed something odd about it and as our truck moved forward, I realized the lights remained stationary. My rational mind tried to make sense of it -- helicopter - no, plane - no, blimp - no? It was silent, and there were no blades or wings. The object had a very large white light that was self-contained (meaning it did not radiate light), and then an odd or kind of random configuration of red lights. The red lights were not \"in order\" e.g. not in a line, circular or discernible pattern and the white light was very vivid, about the size of the full moon when seen in a clear night sky (except this was very close). None of the lights were blinking -they were all steady. I said to the passengers (son in front passenger seat and friend in back seat of F-150 truck) \"Do you guys SEE that?\" My son said yes, he had already been looking at it, and the friend in the back then moved over to the south side of the seat to look out the window and said yes, he saw it, too. We were kind of gobsmacked and I said \"What the hell IS that?\" and came to a dead stop in the street. We all looked up and over at it as it continued to remain stationary. Thankfully no one rear ended me when I stopped, but I don't believe there were any other cars or people on the street, although we really don't remember. We watched it for about 10 or 15 seconds and then I immediately pulled into a gravel parking lot on the north side of the street that was directly opposite of where we were stopped. The night was pretty balmy so the two front windows were down. My son leaned far out of the passenger window, kind of sitting on the ledge facing south, so he could see. The friend could see it from the driver's side backseat window on the south side of the truck, and I could clearly see it from the driver's side. I heard no sound whatsoever, although my son and his friend (in their teens) said they heard an almost imperceptible hum. My hearing has lost some of the highs and lows, so I am not surprised that it seemed silent to me and I trust their hearing more than mine. We continued to watch it hover for another minute or so and then it began to move east (the direction we had just come from) in a straight line at an incredibly slow speed. It was just creeping along at such a slow pace that were able to watch it for another 20 seconds or so. None of us are sure whether it moved out of our line of vision below a tree line or something or if it just disappeared. Regardless, we watched it until it was no longer there. We don't really know how it went away. When were stopped in the street and before we moved to the parking lot, while we were watching it my son blurted out \"Who are they looking for?!\" in an alarmed voice. I was struck by this because that thought never occured to me, that \"they\" or \"it\" were looking for someone, and when we discussed it later, my son did not remember saying this. The three of us were just stunned - \"What was it? What was it?\" We discussed the fact that it could be some a military thing, but if so it was unlike anything in our experience and was not conventional. We all thought it was a definite UFO, in that we know we saw it and it remained unidentifiable to us. It was very difficult to get any sense of the shape of the craft because the ambient light and the white light made it difficult to see beyond the white light to what it was attached to or what was behind it. To me it can best be described as lights with a kind of dark mass behind them. My son has the sense that it looked more like an odd kind of plane than anything else, because he thinks there was a long front edge similar to a plane when viewed from the front, wing-tip to wing-tip. He does NOT believe it was a plane, though, and neither do his friend or I. We all agree it was an unidentified object, either an unknown military craft using reverse techonology or an alien craft. It was not triangular, spherical, oblong, and it was also not a helicopter, plane or blimp. The three of us have no idea what it was or whether anyone else saw it. When we drove home we all talked about it but could not ID it. The only other odd thing that happened was after we dropped of the first friend and BEFORE the sighting, my son, his other friend and I were driving in the truck and there was a very uneasy vibe in the truck. Then my son said \"Tonight is a weird night - let's just get the hell home.\" I knew immediately what he meant - we were all quiet and no one was talking and things just felt off, just before he made that statement. I said, \"Yes, that's what we're doing,\" and then on the way , about 2 minutes later, we had this experience. I do believe my son has had previous encounters, and the fact that he was alarmed about the craft looking for someone makes me think that if it was an alien craft, it has something to do specifically with him and that his friend and I were along for the ride."],"Tags":"City","Object Features":"Undisclosed","Object Shape":"Unknown","Longitude":"-82.997354","City":"Columbus","Summary":"Craft hovered at 1000 ft then moved off incredibly slowly","files":["/var/www/straped/mufon/html2text/22972.html.txt","/var/www/straped/mufon/org/22972.html"],"Date Submitted":"04/26/2010 01:00 UTC"}