{"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/22979.html.txt","/var/www/straped/mufon/org/22979.html"],"Object Features":"Unknown","Date Submitted":"04/26/2010 08:43 UTC","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 15th 2009"],"Latitude":"40.715743","Weather Factors":"None","Country":"United States","Case Number":"22979","Viewing Distance":"Unknown","Tags":"City","Object Flight Path":"Stationary","Summary":"3 ufos, one with white discs on bottom","Date of the Event":"08/15/2009 02:00 UTC","Sighting Duration":"00:00:07","Log Number":"US-04262010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=40.715743,+-73.997213(22979)&iwloc=A&hl=en\"> mufon case (22979) map </A>","Longitude":"-73.997213","Region":"New York","divs":["Sighting DetailsI have been silent about this for the past several months, because there is nobody here I could tell without thinking I'm some kind of nut job. But after seeing a report on the news about Stephen Hawking(who I greatly admire)It finally gave me the incentive to speak up. Last August I was sitting on my back porch relaxing,when I tilted my head back to relax and noticed something at a very high altitude. After a couple of seconds I realized what I was looking at, what I believe was 3 ufos. As I was looking almost straight up, they looked to be stacked, one above the other, the second and third above the right (wing) of the bottom one. I remember the lower one having three large white discs along the edges of each leading edge. After watching this for no more than seven seconds they just dissapeared. There were no low level clouds and the sky was perfectly clear. There were high level clouds, but few and far between. At first I thought these were F-117s, but after seeing them just dissapear and seeing the white discs I believe these were ufos. I stared up for several more minutes but did not see anything. If these were normal aircraft I would expect to see them to emerge from the limited high level clouds and been able to see them again within several seconds or so. At such altitude normal aircraft would become visible within a few seconds and easily seen across the sky for several minutes on there flight path. I can not say how I really felt after seeing this, but I can honestly say that I have the vision burned into my memory. Thank You FRJ NY"],"Source":"MUFON","Disposition":"Insufficient Data","City":"New York"}