{"Log Number":"US-04262010-0003","map":"<A HREF = \"http://maps.google.com/maps?q=48.556917,+-113.013418(22973)&iwloc=A&hl=en\"> mufon case (22973) map </A>","Region":"Montana","Viewing Distance":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Summary":"bright white light changing colors","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22973.html.txt","/var/www/straped/mufon/org/22973.html"],"divs":["Sighting Detailsi was on hwy 2 west of Browning at Boarder Patrol homes. i saw the light directly on top of the new High School it was less then a quarter of a mile above it. me and my friend left from her house i showed he the light as we left back into Browning to Town Pump she had noticed that it was moveing with the car we were driveing in. it would dim its lights when i had notified my family where i live at. it then was moveing north of Browning towards the mountains. heading towards strr school area. i rushed to drop her off at her house and i rushed back home. at this time i was on the phone with my cousin Lee he was outside of our grandmas house and i tould him i see it moveing he said it is moveing to the left and side to side. when i had got back to my grandmas on Birdrattler hill on duck lake road it was west of browning on top of the big hill huvering. to the left a little and stop and go back to the right. we looked out the window and i had called my friend that i had given a ride she said it was fallowing me as i left and she could not see it at her location on the other side of town. i described to her where it now was and at this time it had dimmed its lights to completely off and on this big hill where it was there is a bright glow behind this hill and that was the last it was seen. there are 5 other lights in the sky in star distance. there is an orange one, red white and blue are the rest."],"Country":"United States","Weather Factors":"Unknown","Latitude":"48.556917","Tags":"City","Date of the Event":"04/25/2010 12:00 UTC","Object Shape":"Circle","Case Number":"22973","City":"Browning","Longitude":"-113.013418","Object Flight Path":"Undisclosed","Date Submitted":"04/26/2010 01:24 UTC","Disposition":"Insufficient Data","trends":["There has been one other sighting in Browning","There were no other sightings in Browning on or around April 25th 2010"]}