{"Source":"MUFON","City":"Ogden","Latitude":"41.23057","Object Flight Path":"Path with directional change","Date Submitted":"04/26/2010 01:05 UTC","Log Number":"US-04262010-0007","Object Features":"Unknown","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/22977.html.txt","/var/www/straped/mufon/org/22977.html"],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.23057,+-111.96585(22977)&iwloc=A&hl=en\"> mufon case (22977) map </A>","Object Shape":"Circle","Disposition":"Unknown","divs":["Sighting DetailsAt around 9:30pm or so, I went back into my bedroom to have a cigarette. I usually like to lean on the window ledge to smoke, with my head outside! I was looking up at the stars, like I usually like to do at night, if I'm back there, and I was looking around to the south-west, then, I turned my head to look towards the south-east, and I saw a light come on up in the sky, maybe 1800-2000 ft up! It lasted for 4 seconds or so, then went out! I live near Hill AFB and there is also another small airport to the west of where I live. At first I thought it might have been a plane making an approach to Hill, as the AF jets that come in to land, will sometimes pass over head, and make a loop before landing! But, this turned out not to be the case, as, when this light blinked out, there was no noise of any kind to be heard! Nor did whatever this was reflect any light from the ground below! I aslo doubt that it might have been a parachutist, because the chute would have reflected light also! A possible meteorite could be ruled out, as, while I watched this light for it's duration, it appeared to bank just a little before going out! Also, there was no tail associated with it, either, had it been one! There have also been no reports in the local news of anything hitting the ground, either! I tried to follow it's possible path from my point of view, but I could not distinguish anything of interest, nor could I see where any stars may have been blocked out by whatever it was!"],"Summary":"Light appeared in night sky","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-111.96585","Region":"Utah","Date of the Event":"04/23/2010 09:30 UTC","Case Number":"22977","trends":["There have been 7 other sightings in Ogden","There were no other sightings in Ogden on or around April 23rd 2010"],"Sighting Duration":"Undisclosed"}