{"Log Number":"US-04272010-0001","Object Flight Path":"Stationary","trends":["There have been 12 other sightings in Lake Elsinore","There were no other sightings in Lake Elsinore on or around April 24th 2010"],"Latitude":"33.677947","Object Shape":"Blimp, Disc, Oval","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/27/2010 01:28 UTC","Disposition":"IFO","Source":"MUFON","files":["/var/www/straped/mufon/html2text/22982.html.txt","/var/www/straped/mufon/org/22982.html"],"Longitude":"-117.321792","Sighting Duration":"00:05:00","Tags":"City","divs":["Sighting DetailsDriving home with my 6 year old son travelling north along Mission Trail while talking to a friend on my cell phone something in the sky caught my attention. I asked my son if he was seeing what I was seeing and of course he was. It was at 350 degrees north at approxiamately a 45 degree angle. The time was 8:55 give or take a minute. It was a clear cloudless night. I couldn't not notice the craft. At first I thought it might be a blimp of some sorts, the shape resembling of that; elongated rather than spherical. On the top of the craft there were to very small lights, one red and one white. Along the bottom was a row of white lights that were rotating around it's body. The reason I know it wasn't a blinking sequence of lights is because there was a break in the lights like one was out and you could see it as it progressed around. I only got a look at it from it's side so I geuss I can't be one hundred percent about it but I feel pretty confident of my assesment. For the duration of the sighting the craft was stationary to the eye; I suppose it could've been moving ever so slightly but highly unlikely. After a minute of watching I decided to keep driving in the direction of it rather than go home. I wanted to get closer to be able to \"know\" what I was seeing. As I got closer the white lights on the bottom shut off, but the small red and white on top were still visible although hard to see. I made a right turn and passed a large tree that hid it from sight. After passing the tree there wasn't anything where it should be; no lights no structure nothing. As if it had totally disappeared. The stars were shining through where if there was a blimp or aircraft or structure they wouldn't be. Also the craft was so low in the sky I can't reason it to being an aircraft. I stopped the car and my son and I looked all over in the sky to try and find it but we were unable to locate it again. We sat by the road in total astonishment for 2 or 3 minutes. I couldn't explain to him what it was that we had seen, but even he knew it wasn't anything that is normally in our night sky. I still can't believe what we saw, I know in my heart it was a UFO and I feel lucky to have spotted it. I wish I knew someone else that also saw it that night so we could talk about it together. So I could tell them Hey I saw it too! WOW!"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.677947,+-117.321792(22982)&iwloc=A&hl=en\"> mufon case (22982) map </A>","Region":"California","City":"Lake Elsinore","Case Number":"22982","Weather Factors":"None","Summary":"Single stationary craft with rotating white lights along bottom disappears after 4/5 min.","Date of the Event":"04/24/2010 08:50 UTC","Object Features":"Other, Unknown","Country":"United States"}