{"City":"Phoenix","Log Number":"US-04272010-0002","Country":"United States","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around July 15th 2007"],"divs":["Sighting DetailsI just got off work near Camelback Rd and 12th St in Phoenix AZ at 6pm and was walking to my car talking on my cell phone, when I heard a helicopter. So I looked up to see what kind it was. It looked like a news helicopter panted solid black. It was about 3 telephone poles high. After it past I saw a white light a little lower coming towards me. Then it curved changed to red and went away from me. It was doing an oval pattern. It was white coming towards me and red going away from me. It was probably moving at 30 mph and covered half the length of the block but only as wide as the alley. It made 4 passes the first three it would get a little closer. Then the last and fourth pass it made was right over my head. It paused there over me for about 2 seconds. As I looked right up at it, it wasn't white or red anymore but a ball of glittering lights. It was about the sizes of a beach ball. Then as it went away again it turn red continued down the alley a little farther this time. Here is where I got goose bumps and chills. Instead of coming back it went down and to the right so fast it left a red streak of light in the sky. It stopped there on a dime for 1 second changed to a bright white light. Then it shot up and to the left so fast it left another long red streak of light in the sky and was gone. The whole time I was watching this ball of light change colors it never made a sound."],"Viewing Distance":"21-100 Feet","Object Shape":"Other","Tags":"City","files":["/var/www/straped/mufon/html2text/22983.html.txt","/var/www/straped/mufon/org/22983.html"],"Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"07/15/2007 06:15 UTC","Disposition":"Unknown","Longitude":"-112.065327","Sighting Duration":"Undisclosed","Case Number":"22983","Source":"MUFON","Region":"Arizona","Weather Factors":"None","Date Submitted":"04/27/2010 01:41 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.456167,+-112.065327(22983)&iwloc=A&hl=en\"> mufon case (22983) map </A>","Summary":"This beach ball sized ball of light was probably moving at 30 mph making an oval pattern that covered half the length of the block but only as wide as the alley.","Latitude":"33.456167","Object Features":"None"}