{"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI had just gotten off the bus and was walking across the middle school parking lot and the small park to get home, I was talking on the phone with a friend when I looked up and noticed a very bright light that was very low on the horizon and was completely out of place from other stars in the night sky. I quickly referenced where the moon was in relation to the object, and saw that the moon was at my back. I told my friend what I was watching and was told to tell her what I was looking at in detail. As I was describing the object, A plane passed under it on its way to land at O'Hare airport. The object was oscillating back and forth in a small arc back and forth. As I watched and continued to tell my friend what I was seeing, the one object, became two. They continued to oscillate back and forth for about 2 minutes. I noticed that the objects illuminated the surrounding thin clouds up, kind of a spooky brilliance. I watched them for about another minute, they continued light up the surrounding thin clouds as they slowly faded out. During the entire time I was observing the objects, at least 3-4 airplanes flew underneath the objects, on their way to land at O'Hare airport. The object was clearly not a star, nor an airplane, the light was brighter than the stars that were in the sky, brighter even than the landing lights of the commercial airplanes that were landing at nearby O'Hare. You may contact me via Email at Scorpionking60164@yahoo.com or by mobile phone for further investigation. Thank you for your time."],"Object Flight Path":"Hovering then path","Object Shape":"Fireball, Sphere, Star-like, Other, Unknown","Region":"Illinois","Date Submitted":"04/26/2010 11:48 UTC","Tags":"City","Date of the Event":"04/26/2010 09:00 UTC","Latitude":"41.923333","files":["/var/www/straped/mufon/html2text/22981.html.txt","/var/www/straped/mufon/org/22981.html"],"Disposition":"IFO","Longitude":"-87.889618","Sighting Duration":"Undisclosed","Summary":"A pair of dancing orbs.","Log Number":"US-04262010-0011","City":"Northlake","Case Number":"22981","map":"<A HREF = \"http://maps.google.com/maps?q=41.923333,+-87.889618(22981)&iwloc=A&hl=en\"> mufon case (22981) map </A>","Weather Factors":"None, Light","trends":["There have been 4 other sightings in Northlake","There were no other sightings in Northlake on or around April 26th 2010"],"Country":"United States","Source":"MUFON"}