{"Latitude":"29.425282","Log Number":"US-04272010-0011","Viewing Distance":"Over One Mile","Object Shape":"Unknown","Object Flight Path":"Path with directional change","Disposition":"Unknown","Weather Factors":"None","Summary":"3 UFO'S","Source":"MUFON","Country":"United States","Longitude":"-98.484688","divs":["sighting detailswe were driving in north san antonio. on loop 1604, going east bound. when we saw what we thought was a plane. it looked like the plane was about to land; as if one light was on the front portion of the plane and 1 light on each wing (3 lights total). but then we quickly realized that the wing span was too wide to be a plane and too perpendicular to the earth for it to be a plane landing. then the lights moved in such a way that we realized there were 3 flying objects, not one plane. then they all 3 lights shifted in each others positions, like musical chairs or something. just like they all bounced to the others position very fastly. that shocked me. we continued to watch. then i kept watching (as i was driving). they were flying so fast, away from us (flying east bound as we were driving east bound) and then one light disappeared. i have no idea where that object went. then the second one disappeared as well, about 30-45 seconds later. not sure where that one went. then the last light\\object flew very fast in a south\\east direction and then that one too disappeared. the light was just gone. now i was never close enough to see the outlines. just the lights. my friend was in the passenger seat and probably saw way more than i did. but we both saw the shifting of the lights and the disappearing acts they performed. we know the flight paths pretty well in san antonio, and this was not on any flight path that we know of. san antonio airport should have this on their radar!!! bottom line; they were way too fast to be a plane, helicopter, or jets. and way too steady and particular & mobile to be a helicopter.,... any ideas??"],"City":"San Antonio","Date of the Event":"04/26/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.425282,+-98.484688(22992)&iwloc=A&hl=en\"> mufon case (22992) map </A>","Object Features":"Unknown","Tags":"City","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around April 26th 2010"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/22992.html.txt","/var/www/straped/mufon/org/22992.html"],"Date Submitted":"04/27/2010 10:56 UTC","Case Number":"22992","Region":"Texas"}