{"files":["/var/www/straped/mufon/html2text/2299.html.txt","/var/www/straped/mufon/org/2299.html"],"Case Number":"2299","Date Submitted":"05/10/2003 09:30 UTC","Source":"MUFON","divs":["Sighting Details1. We were in Ft. Walton Beach, Florida on a short weekend vacation. We werelying on the beach at night.2. It streaked across the sky3. A shooting star or meteor4. We were quite bewildered when it began peforming complex maneuvers that ashooting starmeteor or known aircraft could not. We pointed to it, turned towatch it move when it covered a great distance, and wondered aloud what we wereseeing.5. For the first five sightings, all we could see was a faint red light, whichlooked to be about the size of a big star. During the sixth sighting we saw thesilhouette of a shape in the moonlight. Our notes detailing the actions, takenimmediately after the sightingsA. Half moon. Lying on our backs. Big Dipper almost directly overhead. Moonsouthwest of Big Dipper. Saw it the pale red light go east to west rapidly.Thought it was a shooting star. Very faint red hue. no contrail, etc. Consideredpossibility it was a satellite.B. Approx 10 min later saw light go west-east briefly, then u-turned quickly andwent back west. Much faster than a planewed just seen one and could compare. Plane left visible vapor trail. Disappearedgoing west.C. Approx 10-15 minutes later. Light appeared below Big Dipper. Zig-zaggednorth, turned around, did S-curves and quickly went west out of sight.D. 10-15 Min later. Went all over Below Big Dipper. All over the place. Turns,stops, zig-zags, went north, stopped, came back south, stopped, then wentstraight east.E. 15-20 min later. Big Dipper area again. A little slower. Went east to west ina gentle arc, straightened and went west.F. 1130pm - Appeared again above us while we were out on hotel balcony. Watchedit go east to west, then stop, and go back and forth, making a few turns. We sawshape a little bit clearer, and it definitely has wings, but they dont move nordo they go in same direction as flight. Did move around for a minute or two,then disappeared above us, like it went straight up perhaps.6. It finally disappeared above us."],"Summary":"Flying object near Pensacola, Florida","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Region":"Florida","Weather Factors":"Windy","map":"<A HREF = \"http://maps.google.com/maps?q=30.424091,+-86.610831(2299)&iwloc=A&hl=en\"> mufon case (2299) map </A>","Country":"United States","trends":["There have been 24 other sightings in Fort Walton Beach","There were no other sightings in Fort Walton Beach on or around May 10th 2003"],"Date of the Event":"05/10/2003 09:30 UTC","Tags":"City","Object Shape":"Boomerang","Log Number":"","Object Features":"Wings","Longitude":"-86.610831","Disposition":"Unresolved","City":"Fort Walton Beach","Latitude":"30.424091","Sighting Duration":"01:59:00"}