{"trends":["There have been 6 other sightings in Killingly","There were no other sightings in Killingly on or around March 31st 1961"],"Region":"Connecticut","Log Number":"US-04282010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=41.807189,+-71.882385(23003)&iwloc=A&hl=en\"> mufon case (23003) map </A>","Object Shape":"Oval","Tags":"City","Latitude":"41.807189","Longitude":"-71.882385","divs":["Sighting DetailsHello..i would like to tell you about a story that was passed down to me by my grand mother. I BELIEVE THE YEAR WAS 1961,and my grand father was on his way home from work in plainfield ct,and as he was driving home he noticed a very bright light coming from a quarry pit.HE IS NOW ON GREEN HOLLOW ROAD IN DANIELSON CT,HE PULLED HIS CAR OVER,AND WALKED UP TO THE QUARRY.he said he was on a grassy hill looking down at this grayish roundish shaped aircraft,and the lightS were almost blinding,and the ufo was basically hovering about 10 to 15 feet off of the ground.HIS DISTANCE FROM THE UFO WAS ABOUT 90 FEET.it was making a very loud humming noise.He stated that the ufo made him feel very week like it was some how draining his energy from him.At this time he wanted someone to witness what he was seeing so he left the area and got back in his car he only leaved a min. away from where this was taken place.He got his wife,in the car and told her that you will not believe what i just saw in the quarrys.SHE TOLD ME THAT SHE WAS A LITTLE FRIGHTENED BECAUSE SHE NEVER SAW HIM ACT THIS WAY BEFORE,SO SHE GOT IN THE CAR AND WENT FOR THE RIDE WITH HIM.Though when they got back to where he saw the ufo it was gone.MY Grand mother told me that what ever he saw was real.MY GRAND FATHER WAS IN THE ARMY AND HE SERVED IN WORLD WAR 2 HE WAS ALSO THE OWNER OF A SMALL PLASTIC MANUFACTURING WITH OVER 20 EMPLOYEES..That night that he saw the ufo he got a call from one of his cousins not too long after he actually saw the ufo,and he was telling him that he saw a object in the sky that was no aircraft that he ever seen and he described the object as being a grayish colored roundish with very bright lights and he also pulled his car off the road to get a better look of it,and he also stated that he could not explain what he has seen.They both wondered how many other people witnessed the same event as they did but just never went to the newspaper or the police. I wanted to share this story with you,my grandfather was dead before i was born but this story was told to me from my grand mother and her name was claire magrey,and my grand father name was rudolf magrey..The other relative would rather not give his name.MY NAME IS JOHN GOYETTE. I know for sure that my grand father witnessed a ufo,my grandmother told me that after he saw the ufo he was not himself for at least a week,he was almost afraid of what he seen because he could not explain what he saw though he told this story to a lot of people,and everyone that knew him knew that he was a very smart man and a man who never lied,and they both knew that he was a milerty man and he knew his war planes and what he saw was not from this world. thanks for letting me share this story with you... john goyette"],"Object Flight Path":"Undisclosed","Disposition":"Unknown","Country":"United States","Case Number":"23003","Viewing Distance":"Unknown","Summary":"he witnessed a oval shape craft hovering about 10 to 15 feet off of the ground and the lights he saw were very bright almost blinding","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Undisclosed","City":"Killingly","Date of the Event":"03/31/1961 12:00 UTC","Date Submitted":"04/28/2010 11:30 UTC","files":["/var/www/straped/mufon/html2text/23003.html.txt","/var/www/straped/mufon/org/23003.html"],"Sighting Duration":"Undisclosed"}