{"Latitude":"30.276433","Tags":"City","Date Submitted":"04/28/2010 03:44 UTC","Object Flight Path":"Stationary","Weather Factors":"None","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/23007.html.txt","/var/www/straped/mufon/org/23007.html"],"Object Features":"Unknown","Sighting Duration":"00:00:15","Disposition":"Unknown","Longitude":"-97.735211","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.276433,+-97.735211(23007)&iwloc=A&hl=en\"> mufon case (23007) map </A>","Case Number":"23007","Source":"MUFON","Date of the Event":"04/25/2010 01:30 UTC","Log Number":"US-04282010-0009","divs":["sighting detailsi was in austin, texas and saw a triangle shaped object with 3 yellow\\whitish round lights on each point in the early morning hours of april 25th. i was sitting outside against a fence smoking a cigarette. i was looking up at the sky and i remember seeing the stars illuminated behind the object. it was completely silent and hovered above me for a few seconds before i even realized what i was looking at. it was so close i could make out the details of the lights and i could clearly see the triangle shape against the night sky. after the few seconds went by the lights started to rotate in a clockwise direction. i got scared and looked away to see where my boyfriend was and when i looked back it was gone. i immediately ran to find my boyfriend and told him what i saw. the time was between 1 am and 2 am. i was at the travis county expo center in austin, texas. i would like to add that i have never felt more scared when i saw the triangle shaped object in the night sky. i have always watched ufo shows and always kept an open mind but until you see it then you can truly believe it. i am not a religious person but it has made me question my personal beliefs. i have been replaying what i saw over and over in my mind and i know what i saw was real. i don't have picture or video evidence but i can draw an exact sketch of what i saw if needed. i have been very distressed since the night it happened and i do not have any reason to lie."],"Country":"United States","City":"Austin","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around April 25th 2010"],"Viewing Distance":"Unknown","Summary":"Triangle shaped object hovered above me. It had 3 glowing yellow/whitish round lights which rotated in clockwise direction."}