{"Sighting Duration":"Undisclosed","Latitude":"42.96736","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path","Log Number":"US-04282010-0006","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.96736,+-85.667036(23004)&iwloc=A&hl=en\"> mufon case (23004) map </A>","Region":"Michigan","files":["/var/www/straped/mufon/html2text/23004.html.txt","/var/www/straped/mufon/org/23004.html"],"Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Case Number":"23004","City":"Grand Rapids","divs":["Sighting Detailsi was outside and seen a bright light over grand rapids it looked to be about a mile to 2 from me but was lower than stars and was apearing to change colors it stayed in a very small area for about 35 minutes and then went very slow to the southwest i video taped this event for about 25 minutes or so i went inside to check were the space station was but it was in our sight at 5.30 am in grand rapids and was'nt due back till 10.30 pm on wed. so i track the satilight on my computer and it was still way east of the united states. ive seen the space station before and this apeared to be nothing of the sort and i watched the stars and they could'nt of moved that far i would post the tape but it's on an older tape one and i don't have the resources if you could answer . wether i'm wrong about the space stations placement i would apreciate a responce . this change alot of diferant colors and sizes and at first sight i'm sure there were two over and under each other . please understand i don't believe in ufo's even though i have seen unexplained things in the sky . but always thought there was am logocal answer . i also ask that this be confidential. due to the fact that my wife and i own a state run buisness.i did'nt feel anything but confused . and the changeong colors and sitting still or moving left to right very slow. o thought it was an jet or airplane or aeromed but it did'nt move and as i taped you can see jet's and airplanes flying bye ."],"Object Shape":"Circle","Date Submitted":"04/28/2010 11:35 UTC","trends":["There have been 45 other sightings in Grand Rapids","There was one other sighting in Grand Rapids on or around April 27th 2010"],"Date of the Event":"04/27/2010 09:30 UTC","Tags":"City","Summary":"it stayed in a small area for about 35 minutes and then went very slow to the south west i have approx 30 minutes of video tape of it","Longitude":"-85.667036","Source":"MUFON"}