{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/2300.html.txt","/var/www/straped/mufon/org/2300.html"],"Sighting Duration":"00:05:00","trends":["There have been 8 other sightings in Salina","There were no other sightings in Salina on or around April 24th 2003"],"Source":"MUFON","City":"Salina","Country":"United States","Date Submitted":"04/24/2003 09:10 UTC","Object Flight Path":"Straight-line path","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.78962,+-97.612444(2300)&iwloc=A&hl=en\"> mufon case (2300) map </A>","Tags":"City","Region":"Kansas","Summary":"V shaped formation of triangular UFOs, each with 3","Object Shape":"Unknown","Longitude":"-97.612444","Case Number":"2300","divs":["Sighting DetailsI was driving 60-70 mph east on Kansas I-70, milleage marker 261, with plenty oftraffic and headlights going both directions. Suddenly I saw 2 lines of objectsahead and roughly 45 degrees from the horizon. At first I thought I was passingunder power lines with triangles roughly 3-5 lengths apart, each having 3 lightsclose to the vertices. I think but am not sure that the colors were white,bluish white, and redish white. After about 3 seconds I realized that whilethey were moving in two lines, somewhat parallel, my car was not passing underthem, so they must be much further away. They were traveling roughly 285degrees assuming I was headed due east 90 degrees. The closer string went awayafter about 3 seconds, and the other continued in view for another 10-15seconds. I suspect the objects were flying in a V formation. There was nosound and the objects floated, somewhat like ultralight aircraft. I pulled offthe highway after they went by, and went to the back of the vehicle in order toview them moving off in the distance. By that time each object looked like adull single light. Though there was the sound of traffic, I think I would haveheard the engines of so many aircraft, particularly since I opened the window asthey went by. I stopped at the next rest area to write this report."],"Latitude":"38.78962","Date of the Event":"04/24/2003 09:10 UTC","Log Number":"","Object Features":"Undisclosed","Weather Factors":"Unknown"}