{"divs":["sighting detailswe were driving home heading south when i saw a black object in the sky that looked like a beveled triangle when viewed from the side. i first noticed that it was very large and was flying incredibly slowly. it was well above tree line (my estimate is about 500 feet or so above 50-100 foot tall trees). it seemed very low and small for a plane, but really big and high for a kite. the object was heading east. we turned a corner as the object also turned heading north and it passed over the car. this was where i got a good look at it: it was black, but appeared to have a dark blue sheen to it. it was mostly triangular shaped, except for the back which looked like torn or ripped metal. it was not evenly cut like the back end of a b2 bomber. the bottom appeared to be slightly beveled. the frayed parts did not ripple\\furl\\flutter in the air. it appeared to be a fairly solid object. i stuck my head out of the car (travelling at 30 mph) and noticed it was completely silent, there was no contrail and it was moving very slow, but deliberate. there, it curved even further and headed northwest, where i lost sight of it. wind: from the south at 17 mph visibility: clear, 10 miles weather: few clouds, light. attached is a drawing based on the ones i did immediately after the event. it is hard to really depict, but i did the best i could."],"City":"Colorado Springs","Date Submitted":"04/28/2010 10:18 UTC","Latitude":"38.841992","map":"<A HREF = \"http://maps.google.com/maps?q=38.841992,+-104.818953(23001)&iwloc=A&hl=en\"> mufon case (23001) map </A>","Case Number":"23001","Summary":"Unusual object flies over road","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23001.html.txt","/var/www/straped/mufon/more/23001_submitter_file1__object(1).jpg","/var/www/straped/mufon/org/23001.html"],"Country":"United States","Object Flight Path":"Path with directional change","Region":"Colorado","Log Number":"US-04282010-0003","Sighting Duration":"00:02:00","Disposition":"Unknown","Object Features":"Appendage(s)","Object Shape":"Triangle, Other","Longitude":"-104.818953","Viewing Distance":"101-500 Feet","Tags":"City","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around April 27th 2010","This sighting has never been favorited.",""],"Date of the Event":"04/27/2010 07:17 UTC","Weather Factors":"Does Not Apply"}