{"Object Features":"Unknown","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Latitude":"37.445883","Summary":"Bright object at about 60 degrees in the sky, far away, moved in an arc downwards, then moved away at an angle upwards at an oblique angle to initial motion. Disappeared","map":"<A HREF = \"http://maps.google.com/maps?q=37.445883,+-122.14015(23009)&iwloc=A&hl=en\"> mufon case (23009) map </A>","City":"Palo Alto","Country":"United States","Disposition":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was in a barbecue outside when I saw a bright, white object near the moon (moon was bright during the daytime). Object was bright like Venus is at night, and at first I thought it was just an unusually bright star. The object was apparently still for about a minute after I spotted it, then it moved downwards in an arcuate path. I'm not a trained observer but it seemed to be losing elevation. Then the object changed direction, perhaps around 90 degrees, and moved away at a high rate of speed because in a few minutes it disappeared in the distance. I don't think it was a usual flight and I'm not familiar with weather balloons. I pointed the object out to some friends I was with but they weren't interested in observing it. The sun was behind me, so the luminosity could have been a reflection from the sun, but it was so bright, and continued to be bright after it changed position that I think it was self-illuminated. The light was much brighter than regular plane lights and the object was flying away from me at one point and it was still bright, so I don't think they were the front lights from an airplane. I am not sure what I saw and this is the first time I ever see something like this. I was inspired by the sighting and not afraid-- but it was quite far away."],"Longitude":"-122.14015","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Case Number":"23009","Tags":"City","Sighting Duration":"06:00:00","files":["/var/www/straped/mufon/html2text/23009.html.txt","/var/www/straped/mufon/org/23009.html"],"trends":["There have been 4 other sightings in Palo Alto","There were no other sightings in Palo Alto on or around April 24th 2010"],"Log Number":"US-04282010-0011","Date Submitted":"04/28/2010 07:04 UTC","Weather Factors":"Unknown","Date of the Event":"04/24/2010 12:00 UTC","Region":"California"}