{"City":"Pinetop-Lakeside","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=34.147774,+-109.953714(23016)&iwloc=A&hl=en\"> mufon case (23016) map </A>","Weather Factors":"Windy","Summary":"I saw the UFO using my binoculars, I first saw it in the southern horizon behind a pine tree, it was ascending upwards, it was gold/yellow","Date of the Event":"04/28/2010 07:46 UTC","Object Features":"None","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["sighting detailsi was outside with my binoculars and i was looking at the sky. at 7:46 pm i saw a yellow\\goldish colored ufo in the southern horizon behind a pine tree. it was ascending upwards going east. it kept going up and up eastwards across the entire eastern horizon in about a minute and a half. it appeared to be a bit further away than a normal plane. using the binoculars it appeared that it would take something the size of a nickel to cover it. it did not flash at all, there was absolutely no noise, no dogs were barking, there was no plane activity it was very quiet. the ufo had no noise, there was no smoke trail above it or anywhere at all. as i watched the ufo ascending upwards across the entire eastern horizon it started to just go straight towards the north at a steady pace and a steady elevation.it was heading north. as it headed north it started to descend downwards and keep going north. i watched it go downwards until it was obscured by another pine tree, i could still see it though descending downwards until it went below the roof of my house. the entire duration took 3 minutes. from 7:46 until 7:49 or 7:50. once i couldnt see it anymore i went inside immediately and wrote everything i had just seen down on paper and immediately logged on to this site to report it. now im going back out there to see if there is anything more around. its like a hobby for me. it must have been going fast to be that far away and cover that much distance. im not an expert but i would really like to learn. i wish i had the equipment to capture video. i will be trying to get some equipment. there is a lot of activity here, im not very far at all from snowflake where the travis walton abduction happened. it takes about 25 minutes to get to snowflake from where i live."],"trends":["There have been 6 other sightings in Pinetop-Lakeside","There were no other sightings in Pinetop-Lakeside on or around April 28th 2010"],"Date Submitted":"04/28/2010 11:25 UTC","files":["/var/www/straped/mufon/html2text/23016.html.txt","/var/www/straped/mufon/org/23016.html"],"Log Number":"US-04282010-0018","Disposition":"Unknown","Region":"Arizona","Case Number":"23016","Object Flight Path":"Path with directional change","Latitude":"34.147774","Tags":"City","Country":"United States","Sighting Duration":"00:03:00","Longitude":"-109.953714"}