{"Sighting Duration":"00:02:00","Date of the Event":"04/28/2010 09:25 UTC","Case Number":"23013","Longitude":"-86.71347","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.614837,+-86.71347(23013)&iwloc=A&hl=en\"> mufon case (23013) map </A>","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Latitude":"41.614837","Disposition":"Insufficient Data","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","trends":["There have been 32 other sightings in La Porte","There were no other sightings in La Porte on or around April 28th 2010"],"Summary":"star like object traveling from west to east","divs":["Sighting DetailsI went outside to have a cigarette and took the occasion to look up at the planet mars. I seen a bright star like object moving across the night sky coming from the west and traveling east. The object had the same brightness or slightly brighter than the planet venus. I know it was not the planet venus because it is no longer visable at this time of night and it was moving. At first viewing I kept an eye on it expecting to see the oncoming of the red and green lights from an airplane which initially I thought this object was. After viewing it a little longer possibly another 30 seconds, I realized this was no airplane. I then took the opportunity to call my nephew John downstairs and my friend Anna Gomez. After I did this the object was now directly overhead and starting to dim in brightness. By the time my friend Anna Gomez was able to view the object it had dimmed in brightness to where it was barely visable. Approximately 20 to 30 seconds after Anna came outside, the object disappeared from eyesight caused by its dimming in brightness. No photos were taken of the object."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/23013.html.txt","/var/www/straped/mufon/org/23013.html"],"City":"La Porte","Object Shape":"Star-like","Region":"Indiana","Log Number":"US-04282010-0015","Date Submitted":"04/28/2010 10:45 UTC"}