{"Log Number":"","Case Number":"2301","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Object Shape":"Other","trends":["There have been no other sightings in from Hayward, CA to San J","This sighting has never been favorited."],"Disposition":"Insufficient Data","Summary":"Daylight sighting in San Francisco Bay area30 minu","Weather Factors":"Unknown","divs":["Sighting DetailsObjects were a pair, flew together a very small distance apart. We were betweenlocations for work and didnt have camera. Ill know better now to carry one.Other people had to of seen it. It was broad daylight and the objects didnt seemin a hurry. In fact, they lumbered enough that we took a 10 minute detor from680s to 880s. We followed them from Foothill area of Fremont area where we firstsaw them and followed through Milpitas 880s, and then to Northern San Jose. Wegot stuck in traffic and werent able to go down 101s to continue. We also had toget back to work. I hope other people had cameras or were paying attention. Wehave several major airports in the area but these were definately not anythingId seen. They also werent the disk shape objects Ive commonly heard of. Theywere like flatish triagle but had cut outs, like 3 bites off the flat part, andwere dark grey, no reflection off them. They werent A4s or anything like thatfrom MoffettAMES. They didnt have any lights that i could see and the sky wasclear as a bell. The air was fairly still like what wed call earthquake weatherbut the wind from the incoming fog on the coast caught up when we lost site ofthe two objects. Im going to try to call the FAA in Fremont today to see if theyhave any reports."],"files":["/var/www/straped/mufon/html2text/2301.html.txt","/var/www/straped/mufon/org/2301.html"],"City":"from Hayward, CA to San J","Object Features":"Undisclosed","Region":"California","Sighting Duration":"00:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=36.779761,+-119.411372(2301)&iwloc=A&hl=en\"> mufon case (2301) map </A>","Source":"MUFON","Object Flight Path":"Unknown","Latitude":"36.779761","Date of the Event":"05/13/2003 05:29 UTC","Longitude":"-119.411372","Date Submitted":"05/13/2003 05:29 UTC"}