{"Object Flight Path":"Undisclosed","divs":["Sighting DetailsI'll try to be brief... I was driving home from work, it was dark and mildly foggy. Over the highway i saw a strange object making a turn very close to the ground, a crashing plane i thought first. it went behind some trees about 600 yards ahead of me and i was waiting for fire or smoke or anything that a crashing plane would have but saw nothing. I'm not used to seeing large aircraft fly this low to the ground so it was confusing me. It was very clear that there were 5 Bright White lights on the underbelly of the plane and one or two flashing lights as well (possible of the 5). All lights were colored White with no exceptions. This aircraft goes out of my view. About 3 miles of driving later an incredibly slow moving plane comes directly over my vehicle on an open stetch of highway before a strip of businesses. This time i see a direct view under the aircraft. It has an apparent wing structure across that appears to have the 5 lights i remembered in bright white and perhaps 4 black looking engines that light is emitting around that must shield the lights' source because i can see their sillouhettes very clearly. Time seems to almost slow down as i'm driving about 30mph looking directly up through my drivers window and trying to make sense of what i'm seeing. A few more miles up the road, about 2 miles from my home, i see a third object in the sky. This is the object that has brought me to writing on this database tonight. Since this is my 3rd sighting in a short while i slow down to about 10mph with a few cars behind me right on my bumper. The speed limit is 25mph so i'm afraid to slow any more as it is a very slick night on the roads. The aircraft i'm watching not only appears to be moving at a crawl, but not moving at all. I am about 1-200 feet underneath this aircraft and not more then 40 feet away from it's horizontal distance in comparison to my location. At this point i open my window and gaze in complete awe at what appears to be hovering at 0 speed or movement completely still as i slowly drive under and passed it. There are not many lights around me so i am getting an extremely clear view of the object. I start to look for some sort of helicopter like propulsion but it is too rectangular from what i can see to be one of the local black military choppers or any rescue chopper, those would be far too small. The same 5 lights spread out over the underbelly of the object are bright white and show the same 4 outlines of some sort of engine. At this point i am trying to see what type of propulsion it is using because it looks like some sort of a hovercraft in the sky. I can describe the sound quite accurately because it reminds me of a scene from the movie sneakers where the blind man is trying to figure out where the boss had been kidnapped to by playing audio tracks. The sound the hovercraft was making was identical to tires on a bridge that has that metal grove where pavement has not been laid down upon yet. it was a lower pitch, like a rather slow moving tire on metal grill. I wanted to stop at the next clearing but began to get extremely anxious and scared. If it was a military plane then why were so many of them running exercises in close proximity on a low visibility night so close to the ground? If it were an alien craft then i know i have no business with it, no question about that. I drove the last 2 miles home and got out of my car fairly bewildered. I could hear the droning of the planes on the horizon in a fashion i have never heard at my home before. Walking towards my front door i looked back in the direction of the last sighting and heard a noise growing louder. I saw through the trees ahead the same 5 lights making a slow turn at the end of my neighborhood and back around towards the direction it came from. The neighbors lights across the street prevented my cheap cell phone camera from getting a good picture of the 5 lights in the trees. Since then there has been a constant droning and several more passes just outside of my neighborhood by one or more of these planes. If i decide to drive back out and videotape these aircraft i will post again. Just wanted to document this in case someone else can provide some information on what i just saw."],"Viewing Distance":"Unknown","Longitude":"-73.202372","files":["/var/www/straped/mufon/html2text/23011.html.txt","/var/www/straped/mufon/org/23011.html"],"Case Number":"23011","City":"Burlington","Summary":"Several Strange aircraft slowly moving 1-200ft from ground. 5 Bright White lights across width of aircraft. One was hovering as i drove by at 10mph about 150ft from ground - 40 yards from my location on ground","map":"<A HREF = \"http://maps.google.com/maps?q=44.484312,+-73.202372(23011)&iwloc=A&hl=en\"> mufon case (23011) map </A>","Region":"Vermont","Object Shape":"Boomerang","Tags":"City","Country":"United States","Latitude":"44.484312","Source":"MUFON","Disposition":"IFO","Object Features":"Undisclosed","Date Submitted":"04/28/2010 09:48 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"04/28/2010 12:00 UTC","trends":["There have been 13 other sightings in Burlington","There were no other sightings in Burlington on or around April 28th 2010"],"Log Number":"US-04282010-0013"}