{"Object Flight Path":"Path with directional change","Case Number":"23010","Region":"North Carolina","City":"Hendersonville","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.325808,+-82.453103(23010)&iwloc=A&hl=en\"> mufon case (23010) map </A>","Longitude":"-82.453103","Summary":"Very bright white/blue slowly travelling South to East, soundless","Date Submitted":"04/28/2010 09:23 UTC","trends":["There have been 9 other sightings in Hendersonville","There were no other sightings in Hendersonville on or around April 28th 2010"],"Log Number":"US-04282010-0012","Object Features":"Unknown","Weather Factors":"None","Date of the Event":"04/28/2010 08:45 UTC","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23010.html.txt","/var/www/straped/mufon/org/23010.html"],"Country":"United States","divs":["sighting detailswas getting ready to pull the curtains to our sliding glass door on the south side of our home when i saw a large, white\\blue light, approximately 20 degrees above the horizon in the south was moving very slowly towards the east. it spanned a distance of almost 45+ degrees from south to east. its size was about double that of venus, which has been in the westnorthwestern part of the sky lately. sirus is in the western sky and was also less than half of the size of the bright light. i went outside with a pair of binoculars and immediately brought it into focus. i had no other lights whatsoever and the only thing that could be seen was the bright light itself. being ex-usaf and living near airports all of my life, i'm used to most lights, including landing lights and spotlights on aircraft. this was much brighter and tinged with blue and most importantly, after the light had gone past my direct view of its front, i could still see it as if it was nothing but a bright light from any angle. landing lights on planes usually disappear once the craft has past and spotlights also begin to shade as they've gone past optimum viewing. this was neither of those. it took a good solid 5 mintues to make its way across the sky. there were absolutely no sounds associated with this light, but there was one of the usual commerical jets flying their normal track over the house at their normal altitude. this light seemed to only be between 3000-5000 feet from a guestimate. whether or not this light was an extraterrestrial craft or not, couldn't tell you, but whose ever it was...i'd like to have one :-)this is just my story off the cuff, i have not gone back and made exact measurements of the event. the only thing i didn't think to do was to take a picture, but such are practically useless at night with our digital camera. i was impressed with whatever it was. the direction should have taken it near hendersonville proper as well or somewhat south of it at worse."],"Latitude":"35.325808","Tags":"City","Viewing Distance":"Over One Mile"}