{"Case Number":"23017","Summary":"Bright white fast moving sphere.","Region":"Vermont","City":"Rockingham","Weather Factors":"Windy, Medium","Longitude":"-72.509812","trends":["There has been one other sighting in Rockingham","There were no other sightings in Rockingham on or around April 28th 2010"],"Latitude":"43.137856","divs":["Sighting DetailsAt 8:52pm, I stepped outside our home to let the dogs out prior to sending them to bed for the evening. Moving from the West towards the East, at what I later calculated to be a trajectory of 87 degrees by the compass, I noticed an extremely bright white light. The light, which was solid white, not flashing or indicating any other sign of aircraft beacons, moved towards me from the West, overhead, and passed to the East in a straight line at incredible speed. The object was flying above the current cloud cover in this area at this time and was partially hidden from view only sporadically. The striking elements in viewing the object were as follows: Solid White Light with a size of approximately 8-10 times that of normal aircraft in terms of its brightness. It traveled in a straight line across the entire horizon within approximately 30-45 seconds. Very large, very fast. The object was far too low to be any form of orbiting satellite, emitted no debris trail, nor did it appear to decrease in altitude throughout the sighting. After several minutes of listening, there were no aircraft sounds to be heard during a quiet VT evening. Object heading out of sight East towards the Southern NH border."],"Date Submitted":"04/28/2010 11:36 UTC","Source":"MUFON","Object Shape":"Sphere","Disposition":"IFO","Sighting Duration":"00:01:00","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"04/28/2010 08:52 UTC","files":["/var/www/straped/mufon/html2text/23017.html.txt","/var/www/straped/mufon/org/23017.html"],"Viewing Distance":"Over One Mile","Tags":"City","Log Number":"US-04282010-0019","map":"<A HREF = \"http://maps.google.com/maps?q=43.137856,+-72.509812(23017)&iwloc=A&hl=en\"> mufon case (23017) map </A>","Object Features":"Unknown"}