{"Latitude":"36.202069","Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Shape":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-04292010-0003","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.202069,+-115.109281(23020)&iwloc=A&hl=en\"> mufon case (23020) map </A>","Longitude":"-115.109281","Date Submitted":"04/29/2010 01:37 UTC","Summary":"Black squigly lines of North Las Vegas.","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around April 27th 2010","This sighting has never been favorited.",""],"Tags":"City","Object Features":"Unknown","Case Number":"23020","City":"North Las Vegas","Date of the Event":"04/27/2010 12:45 UTC","divs":["sighting detailstime was 1245 and it was a cloud covered day. i was driving home on washburn rd heading east of el camo drive when i came to the frist stop sign and looked both ways. in the distance i belive it was kind of north towards the mountians when i saw two objects in the distance i belive between mountains to the north and my postion. at frist i thought it was planes coming out of neils air force base to the east of where i was but something was out of place. i have seen alot of milarty airplanes in my day flying over my place in north las vegas becuase i live on the flight path to the testing range to the north of neils air force base. my father was also a b-52 nav and when i was younger taught me how to id alot of planes. these objects didnt look like a plane there is no way it could have been a plane. these objects look about 4inches across and 1\\2 an inch thick from my postion. it almost look like someone put a black squigly line in the air like if you where to put one on paper. they where close to each other almost flying in a wingman state. they where motionless in the sky for almost 5 mins as i was driving down the road then out of no where the took off at speeds i could never thought possable by normal planes over the mountains to the north out of my sight. the whole episode put me in a very creep out state of mind. -neo"],"Region":"Nevada","files":["/var/www/straped/mufon/html2text/23020.html.txt","/var/www/straped/mufon/more/23020_submitter_file1__NLVUFO.JPG","/var/www/straped/mufon/org/23020.html"]}