{"files":["/var/www/straped/mufon/html2text/23022.html.txt","/var/www/straped/mufon/org/23022.html"],"Disposition":"IFO","Country":"United States","Latitude":"45.524852","Summary":"Looked like star but moved slowly at first then accelerated straight up and out of sight","Date of the Event":"04/28/2010 10:25 UTC","Case Number":"23022","Longitude":"-122.673177","Region":"Oregon","Source":"MUFON","Sighting Duration":"00:03:00","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around April 28th 2010"],"Object Flight Path":"Straight-line path","Object Shape":"Star-like","Date Submitted":"04/29/2010 02:32 UTC","Log Number":"US-04292010-0005","City":"Portland","divs":["sighting detailswalked outside at 10:23 pm, starry night with low spotty clouds. looked southwest just above horizon and saw what appeared at first to be a star. then i realized it was moving what seemed like toward me and then thought it must be an airplane. but as it moved it wasn't moving toward me but it was moving upward. i didn't see any red or green lights that would resemble an airplane. as it moved up it seemed to accelerate until the brightness slowly started to fade and then it became faint as it seemed to move into space above me. from there i could kind of track it for just a bit and it reminded me of a faint satellite while it was up that high, then it was gone. weird. the funny thing was that i spotted something in almost the exact same location about two weeks ago, but it was quite different and brighter. the first sighting was just about 10:30 pm on a clear and cold evening. as i walked outside to get something out of my car and i looked soutwest i noticed a very bright starry looking object just above the tree line that seemed far off. at first i thought it must be a planet or bright star, but it was twinkling red, green, and blue lights. the more i looked the more it seemed like it was pulsating\\twinkling almost looked like it was communicating with something or someone the way it would twinkle. it was stationary at first but after a few minutes it started to move north, and then ascend slightly. then it moved steadily northwest until it went behind trees and i couldn't keep visual contact. my wife witnessed this event also."],"Weather Factors":"Unknown","Tags":"City","Object Features":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.524852,+-122.673177(23022)&iwloc=A&hl=en\"> mufon case (23022) map </A>"}