{"Case Number":"23025","trends":["There have been 15 other sightings in Carrollton","There were no other sightings in Carrollton on or around July 1st 1982"],"Summary":"A tiny prototypical flying saucer appeared in the sky then instantly moved to a hover 1 ft. in front of us","Tags":"City","Country":"United States","Object Shape":"Disc","divs":["Sighting DetailsMy two cousins and I were playing in the alley at my grandmother's house in the summer of 1982. I was 7. My cousins were 8 and 12. I noticed a shimmer in the sky at an unknown height. We stared at it for about 20 seconds wondering out loud what it was. It disappeared and simultaneously re-appeared directly in front of us at eye level within reach (about 1 ft. away). It was a typical flying saucer about 3 inches in diameter! It had rows of windows just above the midline and there were beings inside. I cannot describe the beings as I have no recollection of what they looked like. I only remember (very vividly) that they were making eye contact with me. I was not scared. I was in awe. It just disappeared without a trace. My cousins and I talked about it briefly but we didn't really discuss it after that until about 1995 when I brought it up. My cousin who was 8 at the time doesn't remember it at all. My cousin (his sister) who was 12 remembers it clearly. I have been looking for years for a story of a similar encounter, but have yet to find one."],"Viewing Distance":"20 Feet or Less","Disposition":"Unknown","Date of the Event":"07/01/1982 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.978622,+-96.885214(23025)&iwloc=A&hl=en\"> mufon case (23025) map </A>","files":["/var/www/straped/mufon/html2text/23025.html.txt","/var/www/straped/mufon/org/23025.html"],"Longitude":"-96.885214","Date Submitted":"04/29/2010 10:39 UTC","Region":"Texas","Object Features":"Dome, Window(s)","Weather Factors":"Unknown","City":"Carrollton","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"32.978622","Log Number":"US-04292010-0008","Object Flight Path":"Stationary"}