{"Region":"California","Object Features":"Appendage(s), Louvres, Wings, Other","Case Number":"23029","Log Number":"US-04292010-0012","Summary":"a solid brighrt red squarish with wings hoovering silently about 200ft up","City":"Culver City","Source":"MUFON","Date Submitted":"04/29/2010 04:52 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.023612,+-118.390496(23029)&iwloc=A&hl=en\"> mufon case (23029) map </A>","divs":["Sighting Details I was out on my patio, ground floor level, looking to the southwest direction, just looking at the trees and the sky noticing what a clear breezy day it was. I saw the usual birds, and a few bugs or insects flying about through the air, still looking towards SW direction. Out of the corner of my eye, towards a westerly direction, I saw a large, squarish, bright red object floating silently in the sky. My first though was a section of a large inflatable mattress used in a kids blow-up type jumping thing had escaped and blown into the air. or I thought maybe a large promotional type inflatable had escaped. Then I realized, \"how could that fly so high into the air?\" Then I realized I was looking at something very odd, completely silent, turning slightly towards me as if the front was lowering and the back was coming up. I would estimate 15-25 feet square with triangles, very long, hang from the sides at both ends. It was longer than wider, with a very geometric design. seemed to have 4 large panels on top and bottom, slightly angled towards the middle. It was strange how it seemed to move against the wind, and be very big and heavy, rotating on a interesting axis. I suddenly seemed to grasp that I was looking at no balloon, how could a blow up mattress fly up there? The thing I am talking about is where at a childs party or at a carnival there are those inflatable castle looking things, kids take there shoes off and jump around in? That is what I first thought it was. Then I realized it was not a what it seemed. I guess I thought that because what else could be flying through the air? I have drawn several sketches. This is interesting also. Afterwards, within 10 minutes I witnessed an orb type thing moving through the sky. I watched it for about 40 seconds as it flew NE to SW. About 10 minutes later, another appeared. I took 5 photos, which would look like points of light in the sky, thats all. I saw three round, orb type things in total after the initial sighting of the flying upsidedown \"W\" thing. All looked similar, high up, silent, either whitish gray or silver. The one definitely had a pattern of bright white light at a point then fade to almost nothing and repeat over and over. One was moving very quickly north to south, at what appeared to be cloud height. The camera I used was just a disposable that I bought at the 99 cent store, so they are not digital photos. It will be interesting to at least see if the point of light would show up. I feel very sure this(the orbs of light) was not an airplane because I was comparing it to other objects in the sky, which I could point out as definitely being a bird or a plane. These were not that. anyway...I am baffled but I did see or experience something large red squarish with wings hanging down(?) silently hovering 200ft off the ground. And 3 \"orbs\" within the next 30 minutes. If the photos show anything really cool I will share them. Peace!!!!"],"Longitude":"-118.390496","Date of the Event":"04/29/2010 11:35 UTC","Disposition":"Insufficient Data","Tags":"City","trends":["There have been 9 other sightings in Culver City","There were no other sightings in Culver City on or around April 29th 2010"],"files":["/var/www/straped/mufon/html2text/23029.html.txt","/var/www/straped/mufon/org/23029.html"],"Object Shape":"Boomerang, Chevron, Triangle","Viewing Distance":"101-500 Feet","Latitude":"34.023612","Country":"United States","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed"}