{"Date Submitted":"04/29/2010 07:33 UTC","Object Flight Path":"Stationary,Straight-line path","Log Number":"US-04292010-0007","Summary":"Star like object zoomed in from a distance","Viewing Distance":"Unknown","Case Number":"23024","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=33.356726,+-111.782277(23024)&iwloc=A&hl=en\"> mufon case (23024) map </A>","Disposition":"Unknown","divs":["Sighting DetailsHaving a smoke in the backyard and enjoying a full moon between 8:15pm-8:30pm. I was looking north in the sky when what appeared to be a star that was bright but way out in the distance began to twinkle and seemed to move directly towards me at great speed and increasing in size. It looked just like a big white bright twinkling star or planet but like I said this thing seemed to zoom in from out of the sky and when it was about 1000 feet or so off the ground it seemed to fall out of the sky straight down about 100 ft or so and disintergrate like a shooting star. Just as it vanished it re-appeared from same point it vanished and moved up but at an angle and dropped out of the sky and disintergrated again same as first time. This happened once more and then it never came back. Timeline for event was about a minute long. Within 5 minutes of the sighting I spotted a fast approaching helo that flew right to the spot I saw the object, hovered shortly before leaving same direction it came from. Shortly after the helo left 3 loud aircraft flew over side by side at high altitude. Sounded like airliners, I could see their anti-collinsion lights but couldnt tell if they were fighters or airliners from sound alone or lights..... Windy, Full moon, clear night sky"],"Longitude":"-111.782277","Tags":"City","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/23024.html.txt","/var/www/straped/mufon/org/23024.html"],"Sighting Duration":"Undisclosed","Date of the Event":"04/28/2010 08:15 UTC","Latitude":"33.356726","Source":"MUFON","Country":"United States","trends":["There have been 10 other sightings in Gilbert","There were no other sightings in Gilbert on or around April 28th 2010"],"Region":"Arizona","Object Shape":"Flash, Sphere, Star-like","City":"Gilbert"}