{"City":"Drummond","trends":["There have been no other sightings in Drummond","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.300312,+-98.035895(2302)&iwloc=A&hl=en\"> mufon case (2302) map </A>","Tags":"City","Country":"United States","Disposition":"Insufficient Data","Sighting Duration":"00:00:59","Object Flight Path":"Unknown","Object Features":"Undisclosed","Log Number":"","Longitude":"-98.035895","Region":"Oklahoma","Case Number":"2302","Weather Factors":"Unknown","Date Submitted":"03/01/1980 08:00 UTC","Latitude":"36.300312","Date of the Event":"03/01/1980 08:00 UTC","files":["/var/www/straped/mufon/html2text/2302.html.txt","/var/www/straped/mufon/org/2302.html"],"Object Shape":"Sphere","divs":["Sighting DetailsDear Mr. ,Thank you very much for your consideration.Regarding your previous e-mail3EIs there any possibility that your brother would like to submit a report, aswell We would like to include his report in our database.My brother, the black sheep of our family is currently incarcerated, i.e. hes inprison. I will ask him to send me a hand written report detailing hisrecollection of the UFO sighting. Upon receipt, I will file his report in yoursystem electronically.3ECould I ask, what submarines did you serve onI served onboard the USS SSN- a fast attack class nuclearsubmarine.3EAlso, I am intrigued by your interpretation of the events that you witnessedback in 1980. What is your line of reasoning, please, regarding 1 the3Eendothermic reaction, and 1 that it must have involved the combination ofwater and air molecules. If such combinations were to occur, and it gave3Eoff sparks, would that not be an exothermic reactionI apologize for my poor explanation of the chemical reactions, which I reasoned,might have been occurring around the object. I will elaborate.It appeared to me that there was some form of spherically shaped force fieldentirely surrounding the object. Imagine two concentric spheres The innersphere, being the glowing object, and the outer sphere two feet larger indiameter defining the surface of an invisible force field surrounding the objectlike one beach ball inside of another larger beach ball. Now, I couldnt actuallysee the surface of the force fieldbut I could infer that it was located there, because it was along that invisiblesurface the apparent force field surface upon which the threads which I couldsee were being formed, wiggled around, and moved about.I believed that the sparkling lights floating downward - below the object wereactually the threads breaking down exothermically after they had fallen awayfrom the intense force field, which I assumed had created them. The sparklinglights, if they were indeed the falling threads, indicated an exothermicprocess. In that case, it would have required an endothermic process to createthe threads... I reasoned that the objects force field had literally crushed theair molecules and possibly water vapor molecules as well - due to atmospherichumidity levels around it into a solid compound, which I observed as thethreads. Such a chemical reaction would require the input of energy anendothermic process.0"],"Viewing Distance":"501 Feet - 1 Mile","Summary":"Close encounter with a nocturnal light.","Source":"MUFON"}