{"Object Features":"Undisclosed","Date Submitted":"04/29/2010 04:19 UTC","Date of the Event":"04/28/2010 11:50 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23028.html.txt","/var/www/straped/mufon/org/23028.html"],"Viewing Distance":"Unknown","Log Number":"US-04292010-0011","Case Number":"23028","Latitude":"38.811953","Longitude":"-94.531898","Tags":"City","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.811953,+-94.531898(23028)&iwloc=A&hl=en\"> mufon case (23028) map </A>","City":"Belton","Weather Factors":"Unknown","Region":"Missouri","Country":"United States","Source":"MUFON","Disposition":"Unknown","divs":["sighting details(from e-mail sent to margie kay on 4\\29\\2010) i was getting ready for bed last night when i noticed a white light outside that shouldn't have been there. i went to the back door and looked out and there was a large disc shaped craft that looked like it ws about 50 feet in diameter floating about 30 feet above my fence, which is 125 yards from my house. the light was coming out from the bottom of the craft, and lit up the ground and fence underneath it very brightly. i called my wife, who was in the shower, to come quick to look and she saw it, too. it just stayed there for a while, then took off very fast and was gone in a couple of seconds. we were both too scared to do anything -even to get the camera. i don't know why i didn't get the camera. i was going to call the police to make a report but my wife said they'd just think we were crazy, so i didn't call them. i got on the internet today and found this site to make a report. if anyone else saw this i'd like to know about it. but don't use my name or address in anything - i don't want anyone to find out about this. i just wanted to tell someone in case you can do anything. i looked at the ground this morning where the light was shining on it but didn't see anything. this is just so weird - i have never seen anything like it and don't want to again. i hope they don't come back. they were obviously not ours - the craft moved way too fast."],"Summary":"Disc hoovered over field for several minutes then took off","Object Shape":"Disc","trends":["There have been 8 other sightings in Belton","There were no other sightings in Belton on or around April 28th 2010"]}