{"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Disposition":"IFO","Source":"MUFON","Object Features":"None","Log Number":"US-04292010-0016","Region":"Massachusetts","City":"Pittsfield","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/23033.html.txt","/var/www/straped/mufon/org/23033.html"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Object Shape":"Circle, Sphere, Other","Latitude":"42.459264","Case Number":"23033","Summary":"A very bright white ball of light moving erraticaly.","Date Submitted":"04/29/2010 10:33 UTC","trends":["There have been 17 other sightings in Pittsfield","There were no other sightings in Pittsfield on or around April 29th 2010"],"divs":["Sighting DetailsWe were having a fire earlier tonight (April 29th apprx 930pm) in a field and noticed a very bright ball of light quite low to the ground through the tree directly above us. Defnitely not a plane due to intensity of brightness, speed, maneuvering, lack of noise. We moved to the center of the field to see the object without obstruction from the tree, and watched the ball of light move directly over us in a NNE direction. It was constantly changing speed (speeding up and slowing down rapidly) and direction (left and right, left and right, and so on) As it moved further away, it slowly dimmed to darkness. Ive observed many planes and helicopters at night and know for certain that this was neither. Shortly after, we noticed more objects, however, much higher, moving at very high speeds across the sky. I am familiar with what satellites look like but these were changing direction, curving left, curving right. May have been jetliners at cruising altitude but the speed seemed to be about 3-4x the speed of one. An exciting night.."],"Longitude":"-73.242212","Date of the Event":"04/29/2010 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.459264,+-73.242212(23033)&iwloc=A&hl=en\"> mufon case (23033) map </A>"}