{"Date of the Event":"05/01/1999 12:00 UTC","Weather Factors":"Unknown","Region":"California","Case Number":"23036","Date Submitted":"04/30/2010 12:04 UTC","Summary":"Two friends and I see clouds bursting and...","City":"San Francisco","Tags":"City","divs":["Sighting DetailsWe three went out to Pt. Reyes National Seashore... All about eighteen years old... we consider making a fire but decide it is likely to call undue attention. In the South East... The clouds on the horizon began to burst with light, as if from within... in no particular pattern, across a hugh stretch of the view from the beach. THe whole south, towards SF. This took some twenty minutes... and I remember drawing their attention to it, as if it were required, something so strange. One friend seemed to keep staring downwards, into the sand, almost afraid, especially later on. The other seemed to reel n extasy, excitement. In the North east... a star appeared, but so luminescent, an near to sedentary, that it created a tail... must have hovered there for... fourty minutes... heading up and east. It looked much as an airplane would straight on... but very high up, maybe 45 degrees... ascending to ? 60. In the mean time, as if from the clouds which were bursting, these square lights, diamonds... they seemed, later on, once closer. There were several of them, at least six or so, up to eight or nine at one time... they were silent, did not move in straight lines but seemed to curve about our field of vision, in and out of it at times, but at some point there were many, a couple passed almost directly overhead, four white lights on the points of a diamond, NO SOUND, maybe the size of a golf ball when held from an arms length. All of them seemed square or diamond... I do not remember seeing any moon then, around sunset, nor for at least an hour afterward. In all honesty, it may very well have lasted more than a couple of hours, and I would not remember. We were all three very excited. One friend says, So What? The other friend wouldn't even talk about it with me, until one day I said, \"this is a matter of trust.\" at which point he admitted it, but also, essentially says, SO what can we do about it?? We left in a hurry, drove home to the east bay... It took me some time to convince myself I was not hallucinating... but this was not the first time!! only the most spectacular, and the one event most likely to have been reported by others, even, yes, ten years after it occurred. Iwill always remember that date, because well, of what I saw, but that it was THIS date, because it is international working man's day, and well, May Day, which is two days from today, eleven years ago. I have no hard evidence, but two witnesses who cannot, when it comes down to it, deny what an extraoridinary event we witnessed."],"Viewing Distance":"Unknown","Log Number":"US-04302010-0001","files":["/var/www/straped/mufon/html2text/23036.html.txt","/var/www/straped/mufon/org/23036.html"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around May 1st 1999"],"Source":"MUFON","Disposition":"IFO","Object Shape":"Diamond, Fireball, Flash, Star-like","Longitude":"-122.418416","Country":"United States","Latitude":"37.78178","map":"<A HREF = \"http://maps.google.com/maps?q=37.78178,+-122.418416(23036)&iwloc=A&hl=en\"> mufon case (23036) map </A>","Object Flight Path":"Undisclosed"}