{"map":"<A HREF = \"http://maps.google.com/maps?q=30.184091,+-85.798568(23031)&iwloc=A&hl=en\"> mufon case (23031) map </A>","Summary":"I witnessed a U F O do what no man made flying machine does, sit in one spot for hours","files":["/var/www/straped/mufon/html2text/23031.html.txt","/var/www/straped/mufon/org/23031.html"],"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Latitude":"30.184091","Region":"Florida","Disposition":"IFO","Sighting Duration":"05:00:00","Viewing Distance":"Unknown","City":"Panama City Beach","trends":["There have been 12 other sightings in Panama City Beach","There were no other sightings in Panama City Beach on or around April 15th 1978"],"Date Submitted":"04/29/2010 08:08 UTC","Object Shape":"Star-like","Weather Factors":"Unknown","Date of the Event":"04/15/1978 10:00 UTC","Country":"United States","divs":["Sighting Details The shining star. I noticed it as I was working. I was in the woods adjacent to my parents property. I had found a spot to build myself a new clubhouse. As I was a child age thirteen the idea building myself a clubhouse in the woods seemed pretty keen. The year was nineteen seventy eight. I was shoveling some sand when I noticed something strange, a star was shining in the daytime. \"Well look at that' I thought. It was north of my position, shining away, in the middle of the day. It did not seem like a big deal at first. I just wondered how a star would be shining in the daytime. 'Oh well' I thought,'no big deal'. I went back to working and did not pay attention to the tiny sparkle of light anymore. However; when I looked up about an hour later, it was still there. I worked about another hour and decided to go to the house for something to eat. I went to the house, ate and rested for about an hour. I then went back out to the woods and started to go back to work; but just out of curiosity, is it still there? I looked, yes it was still there. 'Now wait a minute' I thought 'I know you are not a star, you have not moved in three hours'. I strained to look at the small sparkle of light. 'Well' I thought 'what are you?' I realized that what I was looking at was not a star but some kind of an object that had held its position for hours. I know that as long as I worked that day the star like sparkle of light held its position in the sky. I know that it was not a helicopter or balloon because nothing man made can stay in the same spot for hours. Whats more; what can hold its position for hours that sparkles like a star? I believe that the bright sparkle pin point of light was a U F O. Because of the objects ability to hold station for hours and its bright sparkle appearance, nothing else fits the description. So to the best of my knowledge, I witnessed a U F O do what no man made flying machine does, sit in one spot for hours."],"Source":"MUFON","Tags":"City","Case Number":"23031","Log Number":"US-04292010-0014","Longitude":"-85.798568"}