{"Object Shape":"Star-like","Region":"Western Australia","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/23044.html.txt","/var/www/straped/mufon/org/23044.html"],"Longitude":"115.639174","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["Sighting Detailshi my spelling not good so bear with me? i stopped in my truck to take a fatuie break. and i was looking at the stars as i always do because i always immagine wat could be out there? some time ago 1 and half years ago i sore something when i first came to aus? but to scard to say anything because it was strange'' so i kept quit. and from that time i new wat i sore so i started taking more notice as u do '' anyway back to my fatiue break i was wacthing the stars and sudunly these star like objects were moveing around realy strange so i paid more atention to them and thay was moving realy fast from side to side and up and down then like thay was interacting with each over? so i looked away wiped my eyes and thought i was seeing things because of driving my truck on nigths as i am a shift truck driver.. then looked back and they was still diong it thats when i realized wat i was seing was correct' so i quickly lit a smoke and wachted these strange lights like stars playing arond like a balay dance then i moved my eyes to the west a bit to look to se the over stars in the the friying pan shape u no looks like a dimond with a handle on ? so i looked back and thay was going crazy with each over but didint seem to go to far away from each over but then i realiezd i had to go because we get tracked bye gps on are trucks. thay would think i am hanging out ' but i did not report it to eneyone because thay would feel that i was imagerning this exsperence??? i got to go patrick i giong to work now nights ' i will probly never here from use but i would like to here from u to tell u wat i sore a year and half ago bye for now lee?????? it was so strainge''' it was western australia as well?"],"Log Number":"AU-04302010-0009","Latitude":"-33.327068","Case Number":"23044","Object Flight Path":"Undisclosed","Date of the Event":"12/02/2009 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Summary":"thay was three of them moving together and stoping realy fast and moving backwards and side 2 side with each over realy fast","trends":["There has been one other sighting in Bunbury","There were no other sightings in Bunbury on or around December 2nd 2009"],"Date Submitted":"04/30/2010 03:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-33.327068,+115.639174(23044)&iwloc=A&hl=en\"> mufon case (23044) map </A>","City":"Bunbury","Country":"Australia","Disposition":"Unresolved"}