{"trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around November 13th 1992"],"Weather Factors":"Does Not Apply","City":"Oceanside","Region":"California","divs":["Sighting DetailsAs a Marine I was assigned to temporary duty at the Marine base in Oceanside California to help with reactive armor modifications on the armored amphibious landing vehicle. I was working the second shift starting at midnight and lasting for 12 hours. After working the first portion of my shift I went on break approximately 2-3 hours after my shift began. Because of the amphibious nature of the landing attack vehicles, the facility where the vehicles were kept was an inlet to the ocean. I walked outside toward the water and found a quite place to eat a snickers candy bar and drink a mountain dew soda. The night was clear and there was no light around except for the light from the moon. As I relaxed and enjoyed my break I noticed what I thought was something moving under the surface of the water in the bay. As it approached closer I noticed that it was not one object but three triangular shaped objects, I further realized as it approached that what I was seeing was not something in the water, but rather the reflection of something above moving by. I stood up and looked up to see three completely smooth black triangles flying in a triangular formation. The objects moved slowly at no more than 500 ft. altitude, making no sound, and emitting no light or any evidence of a propulsion system, and I could not tell the thickness of the objects as they were almost directly above me. The craft were approximately 50 to 75 feet from tip to tip, shaped as equilateral triangles. The only reason I was able to see the objects is because they passed under the moon revealing the shape. As they continued passing by I was unable to keep a visual on the objects after they passed under the moon. I remember feeling astonished and a bit confused because I had never seen anything like it before. I told no one about the sighting until years later, as I was afraid of being ridiculed, and assumed no one would believe me anyway."],"Object Flight Path":"Straight-line path","Longitude":"-117.377083","Tags":"City","files":["/var/www/straped/mufon/html2text/23047.html.txt","/var/www/straped/mufon/org/23047.html"],"Object Shape":"Triangle","Summary":"Witnessed three black triangle objects moving slowly above under 500 ft.","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Latitude":"33.19992","Sighting Duration":"Undisclosed","Date of the Event":"11/13/1992 03:00 UTC","Source":"MUFON","Log Number":"US-04302010-0012","map":"<A HREF = \"http://maps.google.com/maps?q=33.19992,+-117.377083(23047)&iwloc=A&hl=en\"> mufon case (23047) map </A>","Object Features":"None","Case Number":"23047","Date Submitted":"04/30/2010 11:20 UTC","Country":"United States"}