{"Weather Factors":"Unknown","divs":["Sighting DetailsI had just got home from my cousins place with my mrs and decided to take my dog for a walk, we got about 20 metre up the street when i heard some weird bird noises from one of the nearby trees (I think they where bats ) we continued on down the path, then i heard a lady yelling some profanities and heard a car schreec off down the road i was thinking to myself \"Must be a full moon\" as we walked into the local highschool football oval where i always walk my dog i instantly noticed wha i thought was a bright orange star in the south east direction ( I was standing at cranbourne high secondary college in Cranbourne Victoria, 45 min from Melbourne) i looked at it for a little while then thought \"Huh? Is that a chopper or just a bright star? I turned my head to see if i could hear any noises, no obvious sounds, so i thought \"must just be a star\" as my dog was having a sniff i noticed a guy taking out some trash or some bottles or something from the high schools theatre, i think they had a show on. I watched my dog for a little while, then about 3 minutes later after witnessing the object i looked up and noticed it was much closer, it had moved about 25c in the night sky and was headed my way, i was looking sth east and it was headed nth west, i watched it intensely trying to figure out if it was a plane or what, i listened and noticed again there was no obvious noise, i could see flashing lights on it similar to what a plane or chopper has and again i thought \"Uh, must be a plan, but as this thing got closer i noticed it didnt have the shape of a common aircraft, it was almost silent but then i notice there was a faint jet noise trailing the object, however the noise was nothing like a commercial jet plane or anywhere near as loud. The thing kept cruising along and must have been about 5 - 8 kilometres away and if i where to describe its size would say it was twice the size of a commercial airplane. So as i stared at it i noticed the lights first off, they where a deep red and orange, first the red would glow in an odd kind of pattern and then the orange would go off around the sides, the red lights seemed to be coming from underneath the craft and the orange from either on top or around the sides, if i where to count the lights i would say there was about a dozen small red lights on the underneath and i have no idea how many orange ones, the craft seemed to be a kind of odd diamond shape, but had 3d qualities to it, speed would have been about 150 - 300 km per hour. I felt very exited the whole time. I lost sight of the object because i thought about running home which was only about a hundred metres away to grab my girlfriend but realized that by the time i get there it would be gone, as this went through my head the object vanished behind the trees and then got too far. Personally i think this was a military object... i think.. Thats all."],"Object Shape":"Diamond","Object Flight Path":"Undisclosed","Date of the Event":"04/30/2010 10:00 UTC","City":"Melbourne","Region":"Victoria","Tags":"City","Date Submitted":"04/30/2010 08:43 UTC","Longitude":"144.97206","Latitude":"-37.803647","files":["/var/www/straped/mufon/html2text/23046.html.txt","/var/www/straped/mufon/org/23046.html"],"Case Number":"23046","Log Number":"AU-04302010-0011","Sighting Duration":"00:10:00","Country":"Australia","map":"<A HREF = \"http://maps.google.com/maps?q=-37.803647,+144.97206(23046)&iwloc=A&hl=en\"> mufon case (23046) map </A>","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around April 30th 2010"],"Disposition":"Unresolved","Viewing Distance":"Unknown","Summary":"Saw a diamond shape ufo near my home with glowing red and orange lights cruising through the sky","Object Features":"Undisclosed","Source":"MUFON"}