{"Object Features":"Window(s)","Viewing Distance":"Unknown","Object Shape":"Unknown","Longitude":"-66.614062","Country":"Puerto Rico","Object Flight Path":"Unknown","divs":["Sighting DetailsWent to bed and inexplicably found myself on the bed of a vehicle truck. Wasthere for about 15-20 minutes while traveling though secondary roads. meantime,I was trying to figure out what was going on. After a while 5 minutes I becamevery desperate and thought I had gone mad. Started praying and assumed that theentities driving had to be ETs. Finally stopped and 2 beings unloaded me off thetruck, by this time the paralisis was gone and I was able to walk. Went throughan open area and beyond was a round craft, all three of us went in and was gretby an incredibly tall human like being. Friendly and explained that he was notgoing to do me any harm. He stressed that I had agreed to be contacted before Iwas borned. Indicated that I was to write a book and to disceminate informationthat they were to provide at a later time. I spent about three hours in theircraft and was exposed to the most amazing realities and different version aboutreligion. They said the will contact me again. they did. Since 1993 I havebeen contacted about two dozen times. I wrote a book UFO Reality or aManifestation of the Subconscious. They have exposed me to the most unbelievablerealities. Too abstract, too crazy to expose them anywhere."],"Latitude":"18.011077","Case Number":"2304","files":["/var/www/straped/mufon/html2text/2304.html.txt","/var/www/straped/mufon/org/2304.html"],"Region":"Florida","Date of the Event":"03/29/1993 03:00 UTC","Date Submitted":"03/29/1993 03:00 UTC","Summary":"Encouter of the fith kind","Disposition":"IFO","Tags":"City","Source":"MUFON","Sighting Duration":"01:59:00","Weather Factors":"Unknown","City":"Ponce","Log Number":"","trends":["There have been no other sightings in Ponce","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=18.011077,+-66.614062(2304)&iwloc=A&hl=en\"> mufon case (2304) map </A>"}