{"trends":["There have been 6 other sightings in Plymouth","There were no other sightings in Plymouth on or around April 29th 2010"],"files":["/var/www/straped/mufon/html2text/23041.html.txt","/var/www/straped/mufon/org/23041.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","Log Number":"US-04302010-0006","divs":["sighting detailsi have an ir cctv camera pointed at the northwest sky. was not recording. saw something bright appear traveling west to east soon after dark. unsure exact time. grabbed my 120x90 astro binocs and purple astro laser pointer and proceeded outside. upon focusing of nocs i could discern no detail other than a white sphere. it was about the size venus usually looks maybe a bit bigger. it was high up, traveling quickly, but not faster than regular commercial aircraft. one difference, this craft displayed no blinking lights. at this time i noticed another craft of same type on intercept course from the southwest. no sound. lit second craft up with purple laser for a quick sec. believe craft to be in orbit at this time. both craft disappeared over treeline in the northeast never changing speed or color. about 2 minutes later a 747 appeared traveling east to west above me. saw it up close and personal with my nocs, had to be 30,000 feet or more. this confirmed in my mind these craft were in orbit. possible military space stations\\craft carriers? see this type of stuff all the time. just reporting because a lot of other people saw it, as i am watching ufostalker.com keep looking up."],"Date of the Event":"04/29/2010 12:00 UTC","Source":"MUFON","Object Features":"Undisclosed","Summary":"2 bright lights traveling west to east, high up maybe in orbit","Case Number":"23041","map":"<A HREF = \"http://maps.google.com/maps?q=41.351455,+-86.301948(23041)&iwloc=A&hl=en\"> mufon case (23041) map </A>","Date Submitted":"04/30/2010 01:33 UTC","City":"Plymouth","Latitude":"41.351455","Region":"Indiana","Object Flight Path":"Undisclosed","Longitude":"-86.301948","Disposition":"Insufficient Data","Object Shape":"Diamond, Sphere, Star-like","Sighting Duration":"Undisclosed","Tags":"City"}