{"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 20 other sightings in Venice","There were no other sightings in Venice on or around April 15th 2010","This sighting has never been favorited.",""],"Object Features":"Unknown","Summary":"At night , five silent, unblinking lights (seemingly not attached to a solid supporting structure), appeared for about 2 minutes over coast of southwest Florida.","Date Submitted":"04/30/2010 11:40 UTC","Weather Factors":"Unknown","Longitude":"-82.451573","Source":"MUFON","City":"Venice","divs":["Sighting Details Hello Mufon, At night on Thursday, April 15, 2010, three friends and I went to a beachside park slightly north of Venice, Florida, for some skywatching. UFO's are often reported in this southwest part of the state. The night was clear, and for the first hour we saw nothing moving through the sky except planes and helicopters, both flashing lights and making plenty of motor noise. About 8:31 we noticed a small cluster of lights moving together toward us from over the Gulf -- completely silent with no lights flashing. As they they moved closer to the beach, a bright beam of light suddenly shot down from the group of moving lights, scanning a small area of shallow water offshore for only about 10 to 15 seconds. The cluster then passed over the beach about a quarter mile south of where we were, disappearing inland toward the east. Luckily I captured two photos, thinking that when I processed them in Photoshop I'd see the lights connected to some outline of a plane or helicopter. The mysterious five lights are very small in the original raw images, so I had to enlarge and crop the images quite a bit, lightening them overall and increasing the contrast to reveal stars against the dark sky. Although the lights are pixilated in these enlargements, it appears that they are not attached to a solid body of any kind (unless it is invisible.) Between the five lights, there are stars shining from behind and through the areas where we might expect to see some indication of a fuselage or other structure supporting the lights. What are your thoughts? Naturally, we are quite curious but not surprised, since all of have seen UFOs before. (Enlarge to 200% to see a bit more detail.) In the data file of my camera, the attached File #1 was taken at 20:32:27, and File #2 was taken at 20:32:49. You can see in these two images that the lights moved in relation to background stars. For File #3, I exaggerated the contrast dramatically, still looking for some kind of outline of a solid body or structure to which the lights were attached -- nothing seen. If you would like to look at the original raw images, I can send them so you can see that no object in the photos was added, deleted, moved or altered in any way. My three friends can attest to witnessing this event. Sincerely, Pete Carmichael"],"Object Shape":"Unknown","Disposition":"Unknown","Date of the Event":"04/15/2010 08:32 UTC","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=27.106648,+-82.451573(23048)&iwloc=A&hl=en\"> mufon case (23048) map </A>","Region":"Florida","Log Number":"US-04302010-0013","Country":"United States","Case Number":"23048","Latitude":"27.106648","files":["/var/www/straped/mufon/html2text/23048.html.txt","/var/www/straped/mufon/org/23048.html"]}