{"Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=34.394353,+-84.968628(23050)&iwloc=A&hl=en\"> mufon case (23050) map </A>","Object Features":"Undisclosed","Source":"MUFON","City":"Calhoun","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Calhoun","There were no other sightings in Calhoun on or around April 29th 2010"],"Log Number":"US-04302010-0015","Latitude":"34.394353","divs":["Sighting Detailsi went outside at 9:12 to have a cig i saw a bright light that caught my attention so i watched it for a sec. it started to move so i called my daughter outside to witness this it started to come towards my house my daughter started to get scared she started to ask me questions that i dont have the answer as it came closer and brighter i started to panic my self so as it was passing over us i took 4 photos 3 of then cant make out but the other picture i have is something to raise questions about as it went over the house there were two airplanes one of them went under they have had to seen that light on the left side of the plane the other airplane was going above the light not to sure if they saw the light but i know their pilots had to have seen it the last photo i have a triangular shape object with a glow around it. I have the picture on my cell phone.. I dont trust to send it out.. but I am more than willing for someone to come and tell me if what I have is a ufo.. I have a crediable witness my 13 yr old daughter.. she is scared of this incident.. I would like for someone to please help me find out what this is on my phone you can clearly see it is no airplane. I would like to know if someone could enhance this photo that i have .. without the zoom on I can clearly see it a perfect triangle. Thank you again for you time.. hope to hear from you soon"],"Weather Factors":"None","Summary":"went outside for a cig and seen a light rise above a star and slowly come toward me ..","Longitude":"-84.968628","Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path","Disposition":"Unknown","Case Number":"23050","Date Submitted":"04/30/2010 01:04 UTC","Country":"United States","Object Shape":"Star-like, Triangle","files":["/var/www/straped/mufon/html2text/23050.html.txt","/var/www/straped/mufon/org/23050.html"],"Date of the Event":"04/29/2010 09:13 UTC"}