{"map":"<A HREF = \"http://maps.google.com/maps?q=33.79352,+-118.290942(23053)&iwloc=A&hl=en\"> mufon case (23053) map </A>","Object Features":"Unknown","Weather Factors":"Windy, Medium","Longitude":"-118.290942","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-04302010-0018","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around April 29th 2010"],"Latitude":"33.79352","Summary":"UFO w bright light flew rapidly into my view, shone a bright light directly at me, then sped away at an unbelievable speed.","Disposition":"Unknown","Object Shape":"Unknown","City":"Los Angeles","Case Number":"23053","Viewing Distance":"501 Feet - 1 Mile","Region":"California","Object Flight Path":"Path with directional change","divs":["Sighting DetailsThe witness, who is a close friend of mine but wishes to remain anonymous, was traveling north on the 110 Freeway, about a mile from the 405 interchange. The witness stated he was traveling along at approximately 85 mph. The time was exactly 11:30PM. He knows this because he left his friend's home at around 11:20PM, and was on his way home. After the sighting, he noted the time, then sent a text to me. I received his text at exactly 11:33PM. The witness was driving along the freeway, when suddenly, at approximately 45 degrees above the horizon, an unidentified object sped into the view of his windscreen, to the right. The witness stated that it the object was moving extremely fast, faster then anything he had ever seen or imagined, and came to a sudden stop in front of him. He estimate the distance at about a mile away. The object the shined a beam of light directly into the witnesses car, illuminating everything \"brighter than daylight\". After a few moments of this, the object sped away, so fast that the witness stated that if he had blinked his eyes, he would have thought that it had simply vanished. The witness was extremely excited after the event, and felt unusually dehydrated. When he arrived home, he chugged down several bottles of water. He could not sleep all night, thinking about what he had witnessed. I should add that this is not the first sighting my friend has reported to me. A few years ago, he and his girlfriend where on there balcony looking out at the ocean when a very colorfully lit craft put on a show for them. She corroborated the story. Going back even further (approximately eight years ago) the witness had an encounter in Malibu, where a strangely lit object flew over his car while he was driving north along the 101 Fwy. A unique element to the story is that the witness states that his sightings always occur either on the hour, or the half hour. Nothing in between. He believes the intelligence behind these craft are letting him know that they have their eyes on him, for purposes unknown. He does not know if they mean him good or harm, so he finds himself both excited, and frightened at the same time. As he related the story to me, he became agitated about it. You could tell he was re-living the event. His speech became choppy and he started to stammer a bit as he became excited. He was glad to have me as someone he could trust and relate his story to. Beyond these sightings, I know this person to be a very solid individual. He is not prone to telling stories or day dreaming. For the most part, he is a very serious individual."],"files":["/var/www/straped/mufon/html2text/23053.html.txt","/var/www/straped/mufon/org/23053.html"],"Date Submitted":"04/30/2010 06:33 UTC","Date of the Event":"04/29/2010 11:30 UTC","Country":"United States","Source":"MUFON"}