{"Sighting Duration":"00:02:20","City":"New Brunswick","Object Features":"Unknown","Longitude":"-74.445749","Country":"United States","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.496006,+-74.445749(23055)&iwloc=A&hl=en\"> mufon case (23055) map </A>","files":["/var/www/straped/mufon/html2text/23055.html.txt","/var/www/straped/mufon/org/23055.html"],"Region":"New Jersey","Disposition":"Unknown","Tags":"City","Date of the Event":"04/29/2010 11:05 UTC","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"23055","Summary":"Large UFO, with 3 bright lights passes over 287-N Highway.","Date Submitted":"04/30/2010 09:43 UTC","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsMe and my wife were driving home from New Brunswick, and were about 2 miles away from the Easton PA exit on 287-N when my wife remarked on a plane in the sky. I often see commercial airplanes when driving on this route in the evening, and I expected nothing unusual. When I looked in the sky, at about 5 minutes after 11:00pm, I saw (what appeared to me) to be a plane with 2 bright lights, that seemed to be flying relatively low or \"close\" compared to most of the planes I see flying in the sky. I looked for the tell-tale blinking red and blue lights on the wings that would indicate it as a normal commerical jetliner, but I did not see any. After about 20 seconds, the craft shifted it's orientation, and I realized it had 3 lights, not 2, and it had a faint triangular shape against the sky. At this point I still thought it was possibly a commercial airliner briefly, but I felt confused upon seeing the unusual shape, and size (or altitude) of the aircraft. It seemed either unusually close or unusually large for a craft to be flying overhead, and it moved relatively quickly (in about the span of 40 seconds) west towards the horizon, where it again was only visible from a \"side\" view, and only 2 lights were visible. It did not move erratically, but simply crossed over from one horizon to the other. At this point, I was taking the Easton PA exit onto route-78, and as I was driving, I lost line-of-sight of the craft. Before I lost line of sight with it, I did notice it was producing a 4th, very faint, blinking red light, that seemed to have a pattern of \"blink-blink-stop\" about one a second. This last quality of the craft leads me to believe it was probably man-made, although I have no idea what it was. Suggestions by others that it was a \"b-2 stealth bomber\" or similar military craft seem plausible, but on the other hand, a b-2 bomber would have to be flying awfully low for the lights appear that \"large\" from our viewpoint, and I have no idea if such military craft have lights arranged on their bottoms in that manner. I still feel I saw something very unusual and I cannot really say for sure what it was I saw."],"trends":["There have been 4 other sightings in New Brunswick","There were no other sightings in New Brunswick on or around April 29th 2010"],"Latitude":"40.496006","Log Number":"US-04302010-0020","Weather Factors":"Windy"}