{"Log Number":"US-05012010-0009","files":["/var/www/straped/mufon/html2text/23069.html.txt","/var/www/straped/mufon/org/23069.html"],"Summary":"A cigar shaped whip with portal windows and 2 open bay doors with 2 smaller ships.","Region":"South Carolina","Latitude":"34.00507","Country":"United States","trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around July 31st 1968"],"Object Features":"Window(s)","divs":["Sighting DetailsI was in the Army, in basic training at Ft.Jackson S.Carolina in 1968..Co.D..the whole company was on the night firing line in the woods in the month of August, and there was a full moon rising above the tree line, and the moon looked huge...most of the company was sitting in the bleachers waiting for their turn to go down to the line to fire their weapons..when all of a sudden somebody yelled out \"Look,Look!\" and we all turned to our right,and then thats when we saw a black cigar shaped object, moving really slow and with no noise, crossing in front of the moon.That is when you could see the portal windows, 2 open bay doors at it's stomach area of the ship, with a very bright light coming out of them, with 2 small 'scout ships' or 3 man ships, quietly riding underneath the belly of the ship...I have since that time have been studying the UFO phenomena ever since, that's how i know about what I saw that night in 1968..where a 110 military personal including NCO;s and officers saw this all together...the next morning we were told literally, \"forget about what you think you saw last night, you all going to Vietnam to die, so it doesn't matter!\"...said Sgt.Powers my platoon Sargent at that time. I found years later in George Adamski's book \"Flying Saucers have landed\" has a photo in it of the cigar shaped mother ship that i also saw , 11 years after he did. My second incident happened in the woods on November of 1968, at approximatly at 11 pm...I was with my Army buddy Tom Hudson from Hartford Connecticut whose father was a Vice President of Hartford Bell telephone, at that time...Tom's father had brought his car down from Connecticut so he would have some transport while he was in AIT(advanced individual training) as we were both stationed now at Ft.Gordon Georgia for Signal school..we both had a weekend pass and decided to go into Augusta, where he picked up a girl....we then all hopped in his car a (Ford Fairlane 389)it was fast...she told Tom of a place we could go to, so they could get intimate...she took us into the woods about 20 minutes to a half hour outside of Augusta...it was dark and about 10 11pm...as we were going into the woods we wound up in a circular clearing in the woods that she knew about, and we came into it and Tom drove the car around in the circle, to face the way out . At this time I got out of the car so they could be alone...I remember a creek about 30 feet down from the car, and i went down to it...I looked around as it was a bit dark at that time in the woods but i could see the top of some kind of a building about 100 yards down the creek from me, where i was standing, and thinking what kind of a building would be in these woods?( I found out years later it was a building for Hydro electricity)...when all of a sudden i saw something out the side of my right eye, something was above the tree line and moving, but it was dark, and thought \"well that isn't a helicopter\" cause there was no sound...now I don't know how much time went by during this incident.I dont' know if i was taken into the ship and then released, i no accounting of any time..but i do remember when the lights came on...and they came on slowly and the sequence was red to yellow to blue to green, going around the middle of the ship as it was 'bobbing' in the air and moving back and forth...then i remember banging on the back of the car yelling to Tommy \"I see one, I see one!\"...and at that moment it went forward, then back, then forward then in a blink of an eye shot out towards space...and we drove out of there very fast...Tommy didn't see anything as he was with the girl ...these incidents to the best of my memory happened to me...and since have been a believer ever since...John Trevisano, Jr. April 30th, 2010"],"Case Number":"23069","Longitude":"-81.033174","Disposition":"Insufficient Data","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=34.00507,+-81.033174(23069)&iwloc=A&hl=en\"> mufon case (23069) map </A>","Date of the Event":"07/31/1968 12:00 UTC","City":"Columbia","Date Submitted":"05/01/2010 01:36 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Source":"MUFON"}