{"Object Flight Path":"Straight-line path","Region":"Arizona","Latitude":"34.488311","Sighting Duration":"Undisclosed","Date of the Event":"02/29/2004 07:10 UTC","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around February 29th 2004"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.488311,+-114.315115(23064)&iwloc=A&hl=en\"> mufon case (23064) map </A>","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","City":"Lake Havasu City","Date Submitted":"05/01/2010 12:47 UTC","files":["/var/www/straped/mufon/html2text/23064.html.txt","/var/www/straped/mufon/org/23064.html"],"Longitude":"-114.315115","divs":["Sighting DetailsWe were on our way to Havasu City, Lake Havasu in 2004 when we got lost on a side road, we were to have exited on the Arizona side of the 95 but made a mistake and exited Highway 95 on the California side instead. My wife and I drove, actually she drove, I was sitting shotgun and looking at the night sky which was clear and visible for miles. After checking the map and figuring out we were going the wrong way for about an hour maybe less, near the Chemehuevi Mountain Reserve (forgive the spelling) I said we needed to turn around, which we did. On our way back North on highway 95 to California State 40 I was looking out North East when I noticed something in the sky. Now this was something I had never seen before, and I really don't want to say anything about it, but it is driving me nuts not knowing. In the sky as I looked out the window was a bluish green meteor, or I hope it was, I immediately yelled for my wife to stop the car so she could see. But she yelled back at me something about scaring the hell out of her, and she wasn't about to stop out here in the darkness, in no mans land. I watched this thing for about two to three minutes, the flames were fantastic, not real bright easy to the differentiate the colors within the flames. It looked like something you would have seen in the movies, thing is, as I watched it go down I rolled my window down waiting for the impact. I'm former military and have seen impacts made by a 105 recoiless, this made no sound nor did it break up into shrapnel. I was so excited to see this, but I must've scared my wife because she said she was not stopping for anything. It dropped down below the horizon, and I waited for the explosion, but nothing. I wish I could remember the day it happened. I remember passing needles Airport on our way back to the 40, which we then proceeded to make our way to Havasu City, Lake Havasu to visit her aunt. I didn't want people to think I was crazy so I didn't say anything, tonight I watched Larry King Live and he had Dan Akroyd on the show, said if you see anything report it, you guys would sort it out. Hope it was nothing, but it scared the hell out of me, yet at the same time I was pissed off my wife didn't stop, I wanted so badly to get out and check this out. Respectfully Albert R. Munoz Jr."],"Case Number":"23064","Log Number":"US-05012010-0004","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Object Shape":"Fireball","Tags":"City","Summary":"Green bluish color, flying low to the ground over the north, eastern sky.","Object Features":"Unknown"}