{"Sighting Duration":"Undisclosed","City":"San Diego","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date of the Event":"04/30/2010 08:05 UTC","Region":"California","Log Number":"US-04302010-0025","Summary":"Bright object flies silently across the sky in a matter of minutes.","Date Submitted":"04/30/2010 11:50 UTC","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around April 30th 2010"],"Source":"MUFON","Object Shape":"Sphere, Star-like","Tags":"City","Disposition":"Insufficient Data","Latitude":"32.721049","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None","Case Number":"23060","Longitude":"-117.151505","map":"<A HREF = \"http://maps.google.com/maps?q=32.721049,+-117.151505(23060)&iwloc=A&hl=en\"> mufon case (23060) map </A>","files":["/var/www/straped/mufon/html2text/23060.html.txt","/var/www/straped/mufon/org/23060.html"],"Country":"United States","divs":["Sighting DetailsI was just returning home from work admiring venus when to the right and above my head i saw an object moving. It is common for airplanes to fly by but this was to small to be an airplane and to high. It was one solitary constant light. No glimmer, no pulsating, just a stagnate light. I tried to take a few pictues with my phone but they did not turn out well. It could be a satellite or a jet that shoots across the sky, but again the light was constant and didnt shake or anything. It shot towards the east, southeast, and was out of view in a matter of 1-2 minutes. It steadily moved across the sky, it was very sleek the way the object moved and fast. It was really fast. It got to be so far i couldnt see it anymore. I also, tried to take a video but all my video phone recorded was black sky with a street light at the bottom. It just was so silent, that is the thing that received my attention the most. It was right over my head and a minute or 2 later was faded into the horizon. It was a white light as well and didnt change color."]}