{"Object Shape":"Circle, Fireball, Oval","Region":"Wyoming","Object Features":"Other","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/23063.html.txt","/var/www/straped/mufon/org/23063.html"],"Sighting Duration":"00:00:08","map":"<A HREF = \"http://maps.google.com/maps?q=41.79107,+-107.238663(23063)&iwloc=A&hl=en\"> mufon case (23063) map </A>","Date of the Event":"07/05/1977 05:10 UTC","divs":["sighting detailsjuly 5 1977\\1978. time 5;30 am rawlins, wyoming pulled out from my drive way with my son mike on the way to work. facing west as we pulled out, we saw a bright oval object,like a bright sun. it could not have been the sun traveling from north to south horizontally and about 2 oclock high. my son was twelve years old. \"i said look\" we saw the object at the same time it lasted for about six to eight seconds going from right to left, suddenly it just dissapeared. it vanished in front of our eyes. i asked my son, \"tell me exactly what you saw\". he described exactly what i had seen. he described a bright orange object traveling horizontly across the sky from right to left and then it vanished. that was a long time ago but we still remember it as it was yesterday. we never found out what it was, but it was however a ufo, it could have been nothin else. we did not report it, but it was too bizzare to have been any thing else. i still live in the same place and every day when i get up at 5,am and look up to see if i see it again. i never have."],"Viewing Distance":"101-500 Feet","Source":"MUFON","Date Submitted":"05/01/2010 12:37 UTC","Tags":"City","Country":"United States","Longitude":"-107.238663","Weather Factors":"None","trends":["There has been one other sighting in Rawlins","There were no other sightings in Rawlins on or around July 5th 1977"],"Log Number":"US-05012010-0003","Latitude":"41.79107","Summary":"Bright orange light moving from right to left for about eight seconds","Disposition":"Unresolved","Case Number":"23063","City":"Rawlins"}