{"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around April 30th 2010","This sighting has never been favorited.",""],"Log Number":"US-05012010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=35.236147,+-80.837107(23062)&iwloc=A&hl=en\"> mufon case (23062) map </A>","Summary":"Possible UFO spotted hovering near University area","Source":"MUFON","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/23062.html.txt","/var/www/straped/mufon/more/23062_submitter_file1__ufophotos-april30-10001.jpg","/var/www/straped/mufon/more/23062_submitter_file2__ufophotos-april30-10002.jpg","/var/www/straped/mufon/more/23062_submitter_file3__ufophotos-april30-10003.jpg","/var/www/straped/mufon/org/23062.html"],"Date of the Event":"04/30/2010 09:30 UTC","Country":"United States","Disposition":"Unknown","Tags":"City","Case Number":"23062","Object Flight Path":"Hovering then path,Path then hovering","Sighting Duration":"Undisclosed","Weather Factors":"Does Not Apply","Object Features":"Unknown","Object Shape":"Circle, Sphere","City":"Charlotte","divs":["Sighting DetailsWe were sitting in the living room of a third story condo watching a movie around 9:30 pm. The sliding glass windows faces south towards a manmade lake. I suddenly noticed a bright light in the sky that didn't seem to be moving like an airplane or helicopter. It hovered about 500 feet above the center of Charlotte and did not move. There were no flashing lights like an airplane or helicopter would have. It had an orangish light eminating from it. Two unidentified craft suddenly moved toward it and one hovered close for about 3 minutes and the other moved away and was determined to be some sort of airplane. The second craft finally moved away from the unidentified object in the sky. We sat and watched in awe as the unidentified object slowly started moving up in the sky about 100 feet up and towards the condo. It sat there for another five minutes before going back to the spot it was in to begin with. The light never changed shape, color, or brightness. The owner of the condo suggested that we take pictures of the unidentified craft. We took several pictures of the things in the sky. One of the witnesses stayed out on the deck and watched as yet another unidentified craft approach the first craft. It also hovered near for a few minutes before it too, took off in the opposite direction. Around 10:00pm, we noticed that the object in the sky started to diminish in size and brightness, until it disappeared in the night sky. We looked at the pictures and question whether or not anyone could make out anything in them, but we are still enclosing them just in case."],"Longitude":"-80.837107","Latitude":"35.236147","Date Submitted":"05/01/2010 12:31 UTC"}