{"Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-05022010-0002","Latitude":"27.775826","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around May 1st 2010"],"Longitude":"-82.63439","Object Shape":"Diamond","files":["/var/www/straped/mufon/html2text/23079.html.txt","/var/www/straped/mufon/org/23079.html"],"Viewing Distance":"Unknown","Object Features":"None","Tags":"City","Disposition":"Unknown","Date Submitted":"05/02/2010 01:09 UTC","Region":"Florida","Case Number":"23079","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.775826,+-82.63439(23079)&iwloc=A&hl=en\"> mufon case (23079) map </A>","Date of the Event":"05/01/2010 11:25 UTC","Object Flight Path":"Undisclosed","Summary":"Formation flight of Yellowish-red diamond shaped objects","City":"St Petersburg","divs":["Sighting DetailsWas driving home after completing a flight from Jacksonville to Saint Petersburg. When I crossed over a bridge not far from home, I began noticing several lights through the trees to the north. They immediately drew my attention because they were above the street lights and were in places where there weren't buildings - the color of the lights made me think of some sort of light that might mark the edge of a building. I spent a few seconds trying to decide if my perspective of where buildings were located was somehow skewed, but realized that the apartment building I was about to pass was not that tall. Switching my thinking to airborne objects, I ran down the possibilities of civil or military aircraft. I also considered somehow flares being dropped, but the location would have had them strung across the Pinellas County peninsula - something I'm positive would not happen. I am a pilot and am aware of where traffic going into Tampa International, St. Petersburg-Clearwater, and Albert Whitted should be, depending upon the winds. Additionally, I had just flown through Tampa's airspace and knew that commercial traffic was landing to the south at Tampa and so nothing would be this far south of the airports. By the time those few seconds had gone by, I needed to make a left turn and so continued to watch the lights now more to my right, though still in visible through the windshield. At this point, I could see there were many lights in a fairly large array or formation but I did not take a conscious count of how many objects I could see. Also, instead of stopping to take a good look, I chose to call my girlfriend to get a corroborating witness to this observation. Unfortunately, I was unable to raise her and had to complete the remaining drive in order to get her attention and get her outside. By the time she was able to make it outside, only a single object remained visible, which she saw and described without my prompting as the color of flame, two diamond -shaped objects connected and under positive control moving right to left. She is also a pilot and discounted military traffic departing the nearby airbase under full military power since there was no noise to be heard (I had flown over the base 30 minutes previously and knew there was zero activity taking place at MacDill). She also noted the objects were low - again, I had not at that point told her anything about what I had already seen. My rough recollection of the configuration is two objects on the right - perhaps 15 degrees apart from my moving vantage point, three in a line at the top center of the array, and another three or four below them, but more spread out, and possibly one more to the left of the three aligned objects. The overall size of the display I would estimate at roughly the size of Orion (tipped over on its side), though perhaps slightly larger. I am also an amateur astronomer and so am very familiar with the constellations, visible planets, and the general color and motion of meteors as they burn up in the atmosphere. As I said, I never stopped to get a proper, stable view of the flight, and by the time I had pulled into my driveway and retrieved my girlfriend from the house, only a single object remained. During the drive home, I was unable to determine the relative motion of the objects. My feelings throughout were excitement for having finally seen something I knew was not readily identifiable. Furthermore, afterward, I was very annoyed for worrying more about getting a witness than getting a good look at the objects."]}