{"Object Features":"Unknown","Object Shape":"Flash, Triangle","Country":"United States","Log Number":"US-05012010-0016","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Latitude":"42.73698","Date Submitted":"05/01/2010 10:46 UTC","Region":"Wisconsin","map":"<A HREF = \"http://maps.google.com/maps?q=42.73698,+-90.472302(23077)&iwloc=A&hl=en\"> mufon case (23077) map </A>","Tags":"City","Date of the Event":"05/01/2010 09:15 UTC","divs":["Sighting DetailsI was outside talking to my friend after I had taken my dog for a walk, and it only happened in a few seconds. He had his back to where I witnessed this. I seen it behind him in the field. It had to have only been about 35 feet above the ground. I don't know what it was doing. I saw a bright green glowing triangular type craft going downwards towards the ground at a very high speed. I only seen it for about 5 seconds. I was about 15 ft long, it wasn't very big. I asked if he had seen it and he had not. He went to leave and I went to the field to look around but I didn't see anything. I have never seen anything like this. I noticed it because it was just in the area I was looking. I heard a sound that sounded like a jet, but different, I can't really explain it. It was just going downwards like towards the ground very very fast. Since I had last put in a report here with photos and and information I have noticed an increase in activity around here, maybe it's just a coincidence but I do not know. I also notice the increased activity of jets flying over where we live. Many, many of them. I don't understand it. And I am not going to sit back and not notice it, no way."],"Longitude":"-90.472302","files":["/var/www/straped/mufon/html2text/23077.html.txt","/var/www/straped/mufon/org/23077.html"],"Weather Factors":"Medium","Summary":"Bright glowing green triangular craft going downwards fast","Viewing Distance":"21-100 Feet","trends":["There have been 2 other sightings in Platteville","There were no other sightings in Platteville on or around May 1st 2010"],"Disposition":"Unknown","City":"Platteville","Case Number":"23077","Source":"MUFON"}