{"Region":"California","Weather Factors":"Unknown","City":"Nipomo","Object Features":"Unknown","Country":"United States","Case Number":"23074","files":["/var/www/straped/mufon/html2text/23074.html.txt","/var/www/straped/mufon/org/23074.html"],"Date of the Event":"04/29/2010 10:45 UTC","Disposition":"IFO","divs":["sighting detailsi was heading to work at 10:45 on april 29th 2010, driving on 101 south...towards nipomo, and i was enjoying the full moon light making everything so bright in front of me. i was getting close to laetitia vineyards when all of a sudden a red round light popped up further away in the distance, straight ahead of me...over the freeway. it immediately got my attention as i recognized it from not too long ago, hovering over the freeway closer to my home in grover beach. i had only watched it for about a few seconds when a beam of light shot out from underneath the red light, towards the ground. i don't know if it reached the ground, but it appeared that way to me. the beam of light was white in color and was wider down at the bottom. it lasted only roughly 3 seconds, when it went back up to the red light\\craft. the red light then went over the freeway and took off across the laetitia vineyards. again, as with the first sighting of this light, i saw a white light \"behind\" it. none of the lights pulsed or blinked, and there was no sound from it. i had my windows down."],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Latitude":"35.048055","map":"<A HREF = \"http://maps.google.com/maps?q=35.048055,+-120.467099(23074)&iwloc=A&hl=en\"> mufon case (23074) map </A>","Summary":"Red light shooting out beam of light","Longitude":"-120.467099","Date Submitted":"05/01/2010 01:24 UTC","Tags":"City","Log Number":"US-05012010-0014","Source":"MUFON","Object Shape":"Sphere, Other","trends":["There have been 3 other sightings in Nipomo","There were no other sightings in Nipomo on or around April 29th 2010"],"Object Flight Path":"Straight-line path"}