{"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Mt Ida","This sighting has never been favorited."],"Log Number":"US-05012010-0013","map":"<A HREF = \"http://maps.google.com/maps?q=34.556764,+-93.634081(23073)&iwloc=A&hl=en\"> mufon case (23073) map </A>","Region":"Arkansas","Tags":"City","Latitude":"34.556764","Case Number":"23073","Summary":"UFO rising from MT. area into sky.","Date Submitted":"05/01/2010 11:52 UTC","Date of the Event":"11/30/2007 10:00 UTC","Country":"United States","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/23073.html.txt","/var/www/straped/mufon/org/23073.html"],"Weather Factors":"Unknown","divs":["sighting detailswe have a small mt. range across a field behind our house. i don`t remember the exact year\\date or time so this is approx. i was sitting in the kitchen on a sunny morning(it faces the mt range) having coffee. i started to see a brilliant shiny silver dome shaped object coming up from between the mt ranges. it continued to rise and get bigger. i sat there watching this for several mins. trying to figure out what it was. i finally ran and got my husband, who grabbed the camera. we ran outside. the object was now in the sky and a cylinder shape and not as shiny but plainly visible in the sky. the object was moving away from us so my husband started to snap pictures. it moved very slowly and wasn`t that far up in the sky. you could see it rotate. it continued to move away for several seconds then stopped. it came back toward the house. by now we were out of film. it came down lower, still rotating, stopped above me, stopped rotating and opened a door on the side of it. closed the door, started to rotate and the went over the house. we ran to the front of the house and continued to watch it move off. after a min. or so of it moving away it sped up rapidly, moved higher in the sky and vanished. this all want on for quite a few mins. from start to it vanishing. we told my daughter and her husband about the incident and they took a ride to the mt. area. there is a very small dirt road between the ranges with lots of forest and tall trees. there isn`t enough room to send up a small balloon let alone the size of the object we saw. i have the pictures but they are at a distance when the object was moving away from us. i`ve tried to enlarge the object. you can see the cylinder shape but the photos loose their sharpness with the programs i have. i`ve never seen anything like this before or after."],"Longitude":"-93.634081","City":"Mt Ida","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Features":"Dome, Other","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Cylinder, Other"}