{"files":["/var/www/straped/mufon/html2text/23078.html.txt","/var/www/straped/mufon/org/23078.html"],"Source":"MUFON","Log Number":"US-05022010-0001","divs":["Sighting DetailsIt had been storming all day and around 8p.m I went outside on the front porch to check the weather. As I sat in my chair I noticed to my left a light that would shine my way. I thought it was my glasses reflecting light so I cleaned them and kept watching the wind and lighting. I got up from my chair and went to the steps and gazing up in the sky I looked to my left above some trees and saw what I thought to be an airplane. It had red lights blinking and a bright light that would shine on and off. Then the light which looked like a spotlight aimed toward my way so I thought it must be a helicopter. My concern was the weather was really bad and it was lighting alot so I could not believe that an aircraft would be flying in the weather.It came closer and the craft's spotlight come on and zoomed the light at the back yard of my neighbors house below me. It lit up the whole yard so I called for my 2 boys to come see. My son Chris who is 25 came running out but my 13 year was to scared. By the time Chris got outside the spotlight turned off and all he could see was the red lights. Then out of nowhere it fell straight to the ground. It was a bright red ball and it fell like falling out of the sky which it did. We stood there waiting to hear a crash or see fire but nothing. It never made a sound at any time. then a few minutes later it appeared in the sky again with its red lights flashing. I called my sister which lives close by to see if she could see it but she never did.While I was on the phone with her the spot light once again turned toward the direction of my house and I started telling her its here again. The lights are shining toward my house. This encounter lasted on and off for about 1 hour. Then it disappeared.This craft never moved much it stayed in the same spot the whole time which I thought was strange. I know people will think I am crazy but I know what I saw. I was so frozen that I did'nt think to take pictures until my sister said go get your camera and get a video. I did get my camera but never could see it again. I am going back outside as soon as I finish this and if I can see it again I will video it and send it in."],"Longitude":"-88.243704","map":"<A HREF = \"http://maps.google.com/maps?q=35.228053,+-88.243704(23078)&iwloc=A&hl=en\"> mufon case (23078) map </A>","trends":["There have been 11 other sightings in Savannah","There were no other sightings in Savannah on or around May 1st 2010"],"Object Shape":"Circle, Fireball","Viewing Distance":"Unknown","Country":"United States","Region":"Tennessee","Date of the Event":"05/01/2010 12:00 UTC","Object Features":"Unknown","City":"Savannah","Case Number":"23078","Weather Factors":"Unknown","Summary":"red lights around and a spot light that lit up on and off","Tags":"City","Date Submitted":"05/02/2010 12:23 UTC","Latitude":"35.228053","Disposition":"Unknown","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed"}