{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving with two other people in my car and we were coming home from the store. We saw a enormous red sphere in front of and over our car. The height seemed to be about 500 to 800 feet above us. I stopped the car and looked out the window. Then I got out of the car for a better look. We were in awe at what we saw and transfixed on the spot. At first I thought it was the moon, then I thought maybe it was a hot air balloon or a weather balloon. Then I just didn't know what I was looking at. It was close. It did not move. The red sphere was stationary in the air, deep red and orange, mostly red and it seemed to have a pulse to it. There was no noise. The surface of it looked smooth but there appeared to be a red haze of slightly transparent red fog around it. It did not seem mechanical. We were on a very dark country road about two miles from home. It was a warm summer night. The sky was clear and I could see the stars far away. The date I wrote is approximate. The sight caused a really terrifying fear in me and I drove home as fast as I could. I drove about half a mile and turned left and the object was gone. My two companions were terrified. When we got home, my friend at the house complained that we had been gone so long. The entire trip felt like it took 20 minutes total, but we had been gone for two hours. There is no way that trip to the store can take two hours. Something happened. I never believed in UFOs, and I am a super skeptic, but I don't know what we saw that night. I can't explain what happened. There was nothing in the paper the following day. Nothing was reported on the radio. There were no reports of weather balloons or anything strange. If I had to guess the size of the object, I would say it appeared to be about five times the size of a round city water tower top."],"Case Number":"23070","map":"<A HREF = \"http://maps.google.com/maps?q=39.449497,+-74.640762(23070)&iwloc=A&hl=en\"> mufon case (23070) map </A>","Disposition":"Unknown","Date of the Event":"07/20/1977 12:00 UTC","Date Submitted":"05/01/2010 01:39 UTC","trends":["There have been 3 other sightings in Hamilton","There were no other sightings in Hamilton on or around July 20th 1977","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.449497","Longitude":"-74.640762","Source":"MUFON","Weather Factors":"Unknown","Summary":"Red sphere and lost time","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/23070.html.txt","/var/www/straped/mufon/more/23070_submitter_file1__sphere1977.jpg","/var/www/straped/mufon/org/23070.html"],"Region":"New Jersey","Tags":"City","City":"Hamilton","Country":"United States","Log Number":"US-05012010-0010","Object Shape":"Sphere"}