{"Source":"MUFON","City":"Temple","Summary":"Comet like, phosphorous glow, tail spray coming off its fan tail. White.","Object Flight Path":"Undisclosed","Region":"Texas","Disposition":"IFO","Country":"United States","trends":["There have been 10 other sightings in Temple","There were no other sightings in Temple on or around April 30th 2010"],"Object Features":"Undisclosed","Log Number":"US-05022010-0012","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23089.html.txt","/var/www/straped/mufon/org/23089.html"],"divs":["Sighting Details Comet like object moved north west, over the tree line did a spriral loop move slow, and seemed speed could not support the manuver as it circle upwards and downwards in it's loop, but it leveled out move north west over the tree line. At first I thought it was some kind of fireworks, but was so large even at a distance of a few miles away it would have bees a treat to all on the ground, due to it's size and risk of devistation had it crashed to the ground. So are there fireworks that can perform such a task, with a mass of hundreds of feet in it's dimensions, with a tail that sprayed out phosphorous particles moving less than 200 ft. off the ground, 100 ft. or more above the earth horizontal to the earth? Appeared to be heavy and labour as it did it's loops one or two loops. - I was Driving down I35 north towards Dallas TX Big rig driver. - It move west ward off to my left over what looked like a very populated area. easily seen. TEMPLE, KILLEEN, area closer to Temple, TX, Ft. HOOD is in area within 20 minutes or so. - Horizontal to spiral, to directional change! - I lost sight of it, when I dipped down, going down a hill, but when I came up the hill a minut or so later, it was still move north west above the tree line, the road dipped again I lost it. I'll have to draw it later, I just wanted to confirm it was not some new kind of firework, or if any others had observed the object."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.106734,+-97.338622(23089)&iwloc=A&hl=en\"> mufon case (23089) map </A>","Date Submitted":"05/02/2010 01:43 UTC","Viewing Distance":"Unknown","Object Shape":"Other","Longitude":"-97.338622","Case Number":"23089","Tags":"City","Latitude":"31.106734","Date of the Event":"04/30/2010 08:15 UTC"}