{"divs":["Sighting Detailsbout 3 years or so ago i had a very strange experiance , i think im ready to try and write this....it was bout 10 oclock at night and everyone was a sleep so i went in my bedroom and laid on my bed next to my wife,she was sleeping so i put off the tv, and looked at the clock i wanna say it was 10pm and i thought i still needed to get up and make sure my house was locked up for the night, i wasnt tierd at all then i was face down on my bed like i was having paralysis ,my eyes were open and my heart pounding i felt like i was gonna die, i was trying to keep moving to try and break the paralysis, so i fought myself to roll over and at the foot of my bed i saw an e.t. kinda like the movie E.T. but its head was huge and it eyes were really big , it was like a brownish skin color with huge black eyes, and i noticed it's arm was out like it was touching my wife ,then i freaked out and started to fight the paralysis more ,then i noticed the being notice me ,and i felt like it was afraid ,i was coming out of the paralsys ,after it noticed me it turned and left my room like it was floating instead of walking I jumped out of bed and went into the front room of my house ,as i went through the door it was like i was looking through a thick glass,kinda like i was in water ,but i could see it still but it was invisable somehow and it headed for the front door it picked up something on its way out off the floor like a bag of something then it went through the door , then i woke up in the bed heart pounding pouring sweat and i noticed it was 10:02 pm i thought wow it felt like more time than that. a few days pass and my sister and her husband come over for the weekend , note i havent told anyone this cause it just sounds crazy , my brother-in law says that his brother thats recently started working with the goverment said thats a huge ufo was sighted around my neighborhood around the same time i had this all happen, i thought ,was it real?, bout a week later my wife tells my that our oldest daughter had a baldspot on her head so she took her to the doctor they tested the spot and could not find any reason for it.me and my family has become more aware of the idea of et's and ufo's and we notice a ufo proly bout once a month diffrent shapes and size ufo's ,how much do we really look up in the sky? i know we r not alone in this. i belive this really happened"],"Longitude":"-90.062631","Case Number":"23092","City":"Mandeville","map":"<A HREF = \"http://maps.google.com/maps?q=30.360191,+-90.062631(23092)&iwloc=A&hl=en\"> mufon case (23092) map </A>","Log Number":"US-05022010-0015","Object Flight Path":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23092.html.txt","/var/www/straped/mufon/org/23092.html"],"Tags":"City","Date Submitted":"05/02/2010 03:16 UTC","Summary":"Was it real.","Region":"Louisiana","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Date of the Event":"Unknown","Country":"United States","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Mandeville","There were no other sightings in Mandeville on or around"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Latitude":"30.360191"}