{"Log Number":"US-05032010-0002","Country":"United States","divs":["Sighting DetailsI know this was a long time ago but I have never forgotten it. I was sitting on a friends outdoor porch with a few others and I was looking up as it was a beautiful clear night and I could see many stars. I noticed very high up in the atmosphere an object moving in a straight line. This I assumed to be a satellite as I had seen them before - so I told a friend next to me. Then, the object took a sharp 90 degree turn! I can't remember if the person next to me saw that! So, I didn't think that satellites make 90 degree turns, do they??? Anyway, it was kind of neat. Back in 1968 in Mississauga Ontario, my grandfather was walking the family dog at around 7 or 8 pm. He said all of a sudden he noticed a light in the sky which appeared unusual as it was \"incandescent\" looking. It was stationary. He stood looking at it for a short while when all of a sudden it took off very quickly. He was always a logical person and was an agnostic. But he thought this notable so he told me even though I was a young kid at that point (about 13 or 14). I had very unusual experiences as a child which are not related to these others sightings. I believe that they may have been abductions but I am not one to claim anything. These experiences can be described if you are interested. Debra"],"Case Number":"23101","map":"<A HREF = \"http://maps.google.com/maps?q=42.479502,+-79.333932(23101)&iwloc=A&hl=en\"> mufon case (23101) map </A>","Date of the Event":"06/21/1989 10:00 UTC","trends":["There have been 2 other sightings in Dunkirk","There were no other sightings in Dunkirk on or around June 21st 1989"],"Weather Factors":"None","Object Shape":"Other","Object Features":"None","Viewing Distance":"Over One Mile","Sighting Duration":"00:02:00","Tags":"City","Region":"New York","Latitude":"42.479502","files":["/var/www/straped/mufon/html2text/23101.html.txt","/var/www/straped/mufon/org/23101.html"],"Disposition":"Insufficient Data","City":"Dunkirk","Object Flight Path":"Path with directional change","Source":"MUFON","Date Submitted":"05/03/2010 01:08 UTC","Longitude":"-79.333932","Summary":"Sitting with friends on their outdoor porch looking at stars"}