{"Tags":"City","Country":"United States","divs":["Sighting DetailsWe were driving to work and out of the left side of the front window a green glow shot upwards across the sky and ubruptly stopped to the right of us. My daughter and I both at the same time said what the hell was that. We turned to the left and on the right side out the window was a diamond shapped object that was rotating counter clockwise with a white light that you could see moving. It was no plane or copter because there was only the one light and it would move up and down in front of us at a slow rate and would just hover there. The object followed us to the Kroger parking lot where we encountered 2 other coworkers that watched with us as it would move up and down and back and forth hovering. When we all got out of our cars to observe it closer there was no sound. There were no stars in the sky so it wasn't a star. We live close to the jackson airport which my daughter has to drive by on her way back home and when she was close to the airport the green light shot across the sky again and seemed to be following her. When she made it home and got out of the car the object was hovering above the neighbors treeline and just kept going up and sown very slowly. Are we crazy? All the years I have been driving this route to work in the morning this is the first time this has happened. When we first saw the object we thought of a shooting star but this seemed to go upwards not down and then abruptly stopped with a white light. Curioustiy was the main thing we were thinking, then a little shaken at the object seeming to be following us. My daughter went in the house and shut the door."],"Summary":"A green glow of light shot across the sky upwards and then abrupltly stopped to the right of us!","Longitude":"-84.552885","Region":"Michigan","Latitude":"42.740015","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Date Submitted":"05/03/2010 03:28 UTC","Log Number":"US-05032010-0005","Case Number":"23104","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23104.html.txt","/var/www/straped/mufon/org/23104.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.740015,+-84.552885(23104)&iwloc=A&hl=en\"> mufon case (23104) map </A>","Date of the Event":"05/03/2010 05:20 UTC","City":"Lansing","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around May 3rd 2010"],"Object Shape":"Diamond","Source":"MUFON","Object Features":"Unknown"}