{"Viewing Distance":"501 Feet - 1 Mile","Region":"Tennessee","Longitude":"-83.913539","Latitude":"35.962088","Object Flight Path":"Path with directional change","Log Number":"US-05032010-0011","Tags":"City","Summary":"No less than 12 fighter jets chasing a fast moving object","Object Features":"Unknown","Case Number":"23110","Country":"United States","Date of the Event":"05/03/2010 09:28 UTC","Date Submitted":"05/03/2010 09:54 UTC","Source":"MUFON","City":"Knoxville","Object Shape":"Oval","Sighting Duration":"Undisclosed","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around May 3rd 2010"],"files":["/var/www/straped/mufon/html2text/23110.html.txt","/var/www/straped/mufon/org/23110.html"],"Weather Factors":"None","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.962088,+-83.913539(23110)&iwloc=A&hl=en\"> mufon case (23110) map </A>","divs":["Sighting DetailsI had just walked out of my garage whcih faces to the northern sky. I heard a tremendous rumble and quickly started scanning the sky due north I noticed at least a dozen fighter jets in semi formation about the second I realized what I was seeing I noticed a quick moving object moving north to south in and out of the formation it was solid white the planes were flying west to east by northeast. The object was whizzing in and out of the formation it was amazing ~ the roar of the planes was deafening ~ they were flying so low ~ I started screaming for my wife to come and see ~ I guess I wanted to make sure I wasn't crazy ~ I just can't tell you the sound of the planes was so,so loud. We live within 10 miles of the local Air Guard and McGhee Tyson Airport ~ so we see smaller commercial jets everyday ~ a few Apache Copters and one to three fighters and of course the Refueling tankers (c130's) all the time. But, nothing like this not even close ~ EVER! In my 12 years living here I have never seen anything like this. My wife has lived here for 36 years and never seen anything like this. They were basically encircling the object all the fighters had red lights not flashing or white just red which is not the norm either so it was very easy to see that the object (white) was moving in and around them ~ AMAZING!! Every dog in the neighborhood was going crazy we had line of sight with the planes for about 45 to 60 seconds and only saw the object for about 30 because of the tree line. But there were 3 jets coming up right after they went past flying in a line side by side follwing the circle of planes in front ~ we could hear them for at least 4 minutes after passing thats how loud it was."]}