{"Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23116.html.txt","/var/www/straped/mufon/org/23116.html"],"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.562847,+-87.443594(23116)&iwloc=A&hl=en\"> mufon case (23116) map </A>","Longitude":"-87.443594","Case Number":"23116","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had a really bad breakup with my boyfriend a few months back and decided to clear my mind. I grabbed a chair and sat on the balcony. The day was BEAUTIFUL. There was not a cloud in the sky, and it was broad daylight. I was looking at the sky as I always do when I reflect. It makes me feel closer to God and I talk to him when I look at the sky. As I was looking, there was an HUGE object that was shining brighter than the moon would had it been out, and the light seemed to constantly change shape. It was the kind of glare like the sun, except it didn't hurt my eyes to look. I immediately knew what it was. There was no question. I ran in a got a family member who was napping at the time so that she could view it. We watched it on and off for about an hour before I tried to take pictures of it on my camera phone but it would not show up. After a couple of hours the sky got much darker and you could see it even clearer. By this time there were two more smaller crafts that had been released, one to the left and one to the right. They were blinking in a pattern unlike anything that I can describe. Almost like they were communicating with the bright craft. The craft was so bright that I could not tell it's shape. A little while after that, it moved. At first it was directly up and slightly to the left in the sky. Then it appeared much lower farther right. The smaller crafts were going in circles in their positions. When I came back to check again, they all had gone. I never felt scared. I was smiling and excited. As strange as this is about to sound, I was trying to see if I could communicate mentally with it. I asked it to change it's colors but it never did. It remained so bright, the light almost looked yellowish. I started to get in my car and drive nearer to it but I did not want to miss much. God is AMAZING! Truly fascinating this was."],"Log Number":"US-05042010-0004","Summary":"Craft releasing other crafts to survey area","Weather Factors":"Medium","Date Submitted":"05/04/2010 10:32 UTC","City":"Highland","Date of the Event":"05/03/2010 06:09 UTC","Disposition":"Unresolved","Region":"Indiana","Object Features":"Unknown","trends":["There have been 3 other sightings in Highland","There were no other sightings in Highland on or around May 3rd 2010"],"Latitude":"41.562847","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Tags":"City"}