{"Object Flight Path":"Hovering then path","Country":"United States","Disposition":"Unknown","Source":"MUFON","trends":["There have been 8 other sightings in Winchester","There were no other sightings in Winchester on or around April 28th 2010"],"Log Number":"US-05042010-0013","map":"<A HREF = \"http://maps.google.com/maps?q=39.19484,+-78.157334(23125)&iwloc=A&hl=en\"> mufon case (23125) map </A>","Date Submitted":"05/04/2010 06:54 UTC","Date of the Event":"04/28/2010 09:20 UTC","files":["/var/www/straped/mufon/html2text/23125.html.txt","/var/www/straped/mufon/org/23125.html"],"Longitude":"-78.157334","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","City":"Winchester","Object Shape":"Star-like","Tags":"City","Case Number":"23125","divs":["Sighting DetailsAs I headed to the house from the garage I could not help but notice this huge, bright light sitting above the top of the mountain. I stopped for a few seconds to see if it was moving, as I know that planes sometimes approach Dulles from this direction, and it was stationary and silent. I looked around my immediate area to note my exact spot and than ran inside to get others, returning right away, 10 seconds at best with my friends wife, I noted that it was slowly moving, I relocated with her and we watched it sit in the sky motionless, for some time. We both said \"that's no star\" \"it's too big\"\"its too close\". After 5 minutes or so she went back inside and I continued to watch as it would slowly move requiring me to relocate again due to the trees.At times it looked as if planes were circling it. I marked the driveway and needing to pinpoint its spot and judge speed I moved again until it was exactly above a telephone pole. after a few more minutes it descended behind the other side of the mountain, I watched it pass behind the trees at the top and it was gone. Later that night I was awakened by an explosion type noise, I went outside and heard 2 more, which sounded more like sonic booms, all three sounds happened in less than one minute.This is not the first time I have seen really bright lights in the area, however its the first time I watched one so close, 2 miles away at best, a mile to the mountain and about 2,000 feet above us.It's location was on the Virginia, West Virginia line exactly, and went down on the West Virginia side.I have heard sonic booms before and these were no doubt sonic booms.It did not appear any different through binoculars. As soon as I returned home to Md. I filed this report."],"Weather Factors":"Unknown","Latitude":"39.19484","Summary":"Brighter,Bigger, and way too close to be a star, later 3 sonic booms","Sighting Duration":"Undisclosed","Region":"Virginia"}