{"Object Features":"None","Summary":"Three flourescing cream-white lights standing still in the sky over head, over the beach, for longer than 5 minutes. No sound. No movement.","Log Number":"US-05042010-0015","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around February 27th 2010"],"City":"Myrtle Beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.658943,+-78.943316(23127)&iwloc=A&hl=en\"> mufon case (23127) map </A>","Case Number":"23127","Region":"South Carolina","Latitude":"33.658943","Object Shape":"Fireball, Flash, Sphere","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"None, Windy","Disposition":"Unknown","divs":["sighting detailswhen: i'm not sure the of the exact date, but it was late feb (27th?)\\early march on a saturday night at around 10pm. where: on the beach along the grand strand of south carolina, usa (a stretch of beach that runs from georgetown to myrtle beach). i would prefer not to give my exact location. who: me, alone weather: mostly clear...maybe a few wisps of clouds that you could see stars through. cold. no real wind to speak of. quiet. ocean calm. it was not very high tide, but mid or low - i don't remember exactly. what: i was standing on a beach crosswalk (over a dune) looking east across the beach toward the ocean. i often go out at night for a moment of quiet before going to bed. i looked south down the beach and noticed three larger sized glowing white lights. one of them was about 45degrees up from the horizon just over the surf. another was the same height, but further west (more directly south of me), and the final one was the same height and much further west ... i looked a bit back over the dune to see it. if i stretched my arm out to the fullest, they were about the size of my fingertip. they caught my attention because they were still. they didn't move in the sky at all. they did fluoresce somewhat, and i did not think that it was an atmospheric effect. it was more like they were 'shining'. at first i thought they were flares, but they were so high up and, as i watched, they did not fade. i continued to watch and almost began to feel that they were watching back, even acknowledging me (i know that sounds strange!). i must've been out there more than 5 minutes watching, until i went back inside. it was cold. it occurred to me that they might be alien, which i thought was ridiculous. since shaw air force base is a little over two hours away in sumter, sc, i thought it was more likely was something they were doing. i did not return with a camera because i thought i had an explanation (rationalization?). why am i changing my mind now? i just found this mufon and the ufo casebook websites today. these two pictures seem very much like what i saw. it made me wonder: http:\\\\www.ufocasebook.com\\2010\\moscow011610.html http:\\\\www.ufocasebook.com\\2010\\norfolkuk061509.html sounds\\smells\\electromagnetic feelings: nothing unusual. missing time? no other objects? this is a flightpath for commercial airlines. they usually fly quite high in the sky. i did see a few jet lights passing far up overhead. these unusual lights stood out because they seemed a bit closer and did not move."],"files":["/var/www/straped/mufon/html2text/23127.html.txt","/var/www/straped/mufon/org/23127.html"],"Country":"United States","Object Flight Path":"Stationary","Longitude":"-78.943316","Date Submitted":"05/04/2010 07:18 UTC","Date of the Event":"02/27/2010 10:00 UTC"}