{"Object Flight Path":"Undisclosed","Log Number":"US-05042010-0010","Tags":"City","Date Submitted":"05/04/2010 04:48 UTC","Longitude":"-103.202667","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23122.html.txt","/var/www/straped/mufon/more/23122_submitter_file1__UFOphoto1.jpg","/var/www/straped/mufon/more/23122_submitter_file2__UFOturned2.jpg","/var/www/straped/mufon/more/23122_submitter_file3__UFOLeaving3.jpg","/var/www/straped/mufon/org/23122.html"],"Summary":"Odd shape, hovering and high speed.","map":"<A HREF = \"http://maps.google.com/maps?q=34.412069,+-103.202667(23122)&iwloc=A&hl=en\"> mufon case (23122) map </A>","City":"Clovis","Latitude":"34.412069","Sighting Duration":"Undisclosed","Case Number":"23122","Object Features":"Undisclosed","Source":"MUFON","Object Shape":"Circle, Disc, Fireball, Flash","divs":["sighting detailsi watched the late new's and saw the weather report 5-3-10 , the following day was going to be windy, i had to go outside to move my bonsai tree's to a location that they wouldnt be damaged by tommorrow's wind. when i went outside to do so, just before 11pm i looked up at the night sky and noticed an object to the west of my house hovering and changing color , i thought it strange and thought i would run inside my house and grab my camera with my long 400mm-800mm len's and my tripod to view this object better. i ran back outside and set up my camera, the object remained in the same place for some 7-8 minutes without any movement or sound. i took 1 photo of it in this position( see photo titled ufo photo #1 )., then the object seemed to rotate around , as if it were going to move in another direction, i took 1 more photo ( see photo titled: ufo turned #2 ) , as i backed off my camera len's to get a longer\\wider view, the object took off south in direction at an alarming speed, i managed to snap the last photo as it left ( see photo titled: ufo leaving ) these photo's were long exposure's because of the low light condition's which saturated the colors more than normal , but they are suprisingly clear , and you can see distant star's in the background's with no motion blur. i live 8 mile's from a air force military instalation, so this object could be a black op's project , but from the photo's and the speed involved in my sighting i can easily say , it is like nothing ive ever seen..really a strange night, but also exhilerating."],"Country":"United States","trends":["There have been 6 other sightings in Clovis","There were no other sightings in Clovis on or around May 3rd 2010","This sighting has never been favorited.",""],"Date of the Event":"05/03/2010 10:45 UTC","Region":"New Mexico","Disposition":"Hoax","Viewing Distance":"Unknown"}