{"Region":"New York","Summary":"a triangle formation in the sky changing color then the apearence of a single one of to the left . the triangle formation of lights disapeared and the single light fluttered out of sight.","Date Submitted":"05/04/2010 07:42 UTC","Object Shape":"Sphere","Log Number":"US-05042010-0016","trends":["There has been one other sighting in Hilton","There were no other sightings in Hilton on or around May 4th 2010"],"files":["/var/www/straped/mufon/html2text/23128.html.txt","/var/www/straped/mufon/org/23128.html"],"Longitude":"-77.793342","Latitude":"43.288116","Date of the Event":"05/04/2010 09:00 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.288116,+-77.793342(23128)&iwloc=A&hl=en\"> mufon case (23128) map </A>","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting Detailsthis was about 9 o'clock at night easter time. i was getting out of the car with my fiance and 2 friends. i have been seeing triangle formations in the skay alot lately so i took a look into the sky. i saw two lights and instantly a 3red apeared and formed a triangle formation. my friend alex instantly noticed this as well. we call over our girlfriends and skepticly watched the light formation change colors, starting red and and light yellow and also included blue and green. they stood out from other stars because of the size. also each dot changed to different color sometimes being the same and sometimes not. these swayed slightly but not at a rapid point. a single dot was seen but alex's girlfriend stacy, off to the left a good was and was even bigger. this dot changed from red to yellow multiple times and happened slowly. this one moved around in all dirrections at different speeds. we all went in to get my fiances camera and apon getting to the top stairs i looked out the interior of the window facing all of this and everthing was gone. i reterned out side with the camera and did come across the single light but it was smaller and further behind the tree line. i couldnt get a clear shot. and an audio recording only picked up frantic animals which only happend mid way through viewing the light. and i mean real distress and warning calls. since this wasnt the fist time im going to try to get better footage tonight."],"Sighting Duration":"02:00:00","Disposition":"IFO","City":"Hilton","Country":"United States","Case Number":"23128"}