{"City":"Scottsville","Latitude":"37.798754","Longitude":"-78.495565","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=37.798754,+-78.495565(2312)&iwloc=A&hl=en\"> mufon case (2312) map </A>","divs":["Sighting DetailsMy mother, great-Aunt, brother, I were returning to my great-Aunts home inNelson county,Virginia during the time of the sighting. The year was either 1966or 1967,in the summer. We were visting relatives in the nearby town ofScottsville. It was still daylight, but in an instant it turned dark, as if Godhad turned off a light switch. I looked out of the rear window of the car thought I saw lightning bugs fire flys. Being a child I was surprised at thenumber of them. They first appeared in the trees then in the field on bothsides of the road. I was so scared, I screamed told my family about the lights.The odd thing is every time someone else in the car would look back, the lightswould be gone. It was as if they only wanted me to see them. I know this soundsodd, but its the way I felt also the only explaination for the disappearingact. The orbs of lights moved onto the road behind us. They were hovering, everso closely to the road. The closer they got to us, the more fear I had. As soonas the lights first appeared my mother had difficulty getting the car to go anyfaster than 10 mph. Everyone was frightened in the car, even though they didntsee the lights. I remember my Great-Aunt trying to turn her head around to look,but she seemed to move in slow motion turned her head only slightly as if shewas being held back. I will never forget her face how she screamed at my mom todrive faster. The lights made their way onto the back of the car. At this pointmy mom told me to lay down in the floor, so I wouldnt see them. After whatseemed like a few minutes, I calmed down some sat back up. Big mistake As I satup, I turned looked out of my window. There right in my face was a light."],"Date Submitted":"11/30/1965 12:00 UTC","Viewing Distance":"20 Feet or Less","Case Number":"2312","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/2312.html.txt","/var/www/straped/mufon/org/2312.html"],"Object Features":"Other","trends":["There has been one other sighting in Scottsville","There were no other sightings in Scottsville on or around November 30th 1965"],"Summary":"1966 or 1967 Sighting of White Orbs Missing Time","Tags":"City","Sighting Duration":"01:59:00","Weather Factors":"Unknown","Country":"United States","Date of the Event":"11/30/1965 12:00 UTC","Object Flight Path":"Straight-line path","Region":"Virginia","Object Shape":"Sphere","Source":"MUFON"}