{"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/23129.html.txt","/var/www/straped/mufon/org/23129.html"],"trends":["There have been 5 other sightings in Broken Arrow","There were no other sightings in Broken Arrow on or around May 3rd 2010"],"Longitude":"-95.79082","Tags":"City","Weather Factors":"None","Log Number":"US-05042010-0017","Object Features":"Unknown","Summary":"Grayish mass low over trees heading south to north.","divs":["Sighting Details I often glance up at the sky for a few moments when heading to the car or coming in, especially at night. I was headed to the store about 10:30pm and before getting into the car I just happened to catch sight of a grayish mass low over the trees headed south to north. I couldn't really make out a distinct shape. Just a grayish mass moving about 40 MPH. No lights or sound. The first thing that crossed my mind was a small aircraft but I quickly dismissed that idea since there was no sound or lights. Even though the first impression was of a single object, I wondered if it might have been a tight flock of light colored birds although I couldn't see any individual birds but I was mostly just trying to think of something that might make more sense. The object appeared to be about a block away and was about three times as long as it was thick. If the estimate on distance is correct, the object would have been 25-30 feet long.I watched the object for 5 or 6 seconds and lost sight of it due to the glare of a much closer streetlight. I continues scanning the sky for a few more minutes but nothing else unusual was seen."],"Date of the Event":"05/03/2010 10:30 UTC","Date Submitted":"05/04/2010 07:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.052599,+-95.79082(23129)&iwloc=A&hl=en\"> mufon case (23129) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Source":"MUFON","City":"Broken Arrow","Region":"Oklahoma","Case Number":"23129","Country":"United States","Latitude":"36.052599"}