{"Log Number":"","Date of the Event":"06/30/1988 07:00 UTC","Tags":"City","City":"Newburgh","Summary":"Sighting In Newburgh, NY - Mid-Late 80s","Longitude":"-74.007638","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/2313.html.txt","/var/www/straped/mufon/org/2313.html"],"Region":"New York","Sighting Duration":"01:00:00","Disposition":"IFO","Viewing Distance":"Over One Mile","Date Submitted":"06/30/1988 07:00 UTC","Source":"MUFON","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=41.504637,+-74.007638(2313)&iwloc=A&hl=en\"> mufon case (2313) map </A>","Object Shape":"Unknown","Object Flight Path":"Straight-line path","Case Number":"2313","Latitude":"41.504637","divs":["Sighting DetailsMy husband and I pulled into our home parking lot, apartments, and stopped toretrieve our mail. I just waited in the car, when I just happen to look up intothe night sky. I saw a larger object and several smaller objects following. Igot out of the car and pointed them out to my husband. We were both stunned. Anddid not think anything about it. Just that is was very, very unusual. Actuallydid give me chills. Flashing lights came from all of the objects. The whole areaof the space they took up was hugelong. We had no idea what they were but put ifoff to possibily the military. We lived near Stewart Airport. We then got intoour car and drove up to our home.About half an hour later, I went to our back window, and just wanted to see ifthe objects were still there. And to my complete shock they were. They had movedsomewhat, but were very visible to our eyes. This gave me a chill and I couldnot sleep the rest of the night. This was not pilots as reported by StewartAirport. These were NOT any airplanes that I have ever seen before. And whywould they still be in the sky after 40 plus minutes They were NOT triangledshaped as reported by the airport. And there had to be over 10-12 objects.To this day I am sorry that I did not report the incident. But....as you canwell imagine why.Thank you,Sue Kevin LaShombNew Paltz, NY"],"trends":["There have been 8 other sightings in Newburgh","There were no other sightings in Newburgh on or around June 30th 1988"]}