{"Longitude":"-111.8359","Object Shape":"Sphere","Case Number":"23147","Weather Factors":"None","Latitude":"33.30978","Date of the Event":"05/04/2010 09:15 UTC","Region":"Arizona","Tags":"City","Source":"MUFON","City":"Chandler","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around May 4th 2010","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Hoax","Date Submitted":"05/05/2010 07:43 UTC","Summary":"White Sphere over patrol aircraft","Log Number":"US-05052010-0013","Object Features":"None","divs":["Sighting DetailsOn Tuesday May 4 2010 between 9:15 pm and 9:30 pm I was looking north from my location when I observed a small aircraft headed east from my 10:oo position approximately 1 or 2 mile away. As the small aircraft hit my 12:00 position directly north of me half mile out with his taxi lights on he begain a 10 degree or so left wing down turn from east to north and shut his taxi light off. Just after his taxi lights went off, a huge white sphere appeared approximately 300ft directly above the small planes canopy and rapidly shot straight down to within 100ft or less of of small planes canopy before completely disappearing. With the size of the sphere being roughly a quarter to half of the size of the small patrol aircraft the pilot seemingly did not notice the event directly overhead. He continued a huge loop and came back around with taxi light on again and following same approach towards my position and once again when he was directly north of me, a giant white sphere appeared at extreme high altitude this time from an easterly direction and shot straight toward the small plane at the perfect angle and dissappeared within 2-3 miles from head on with small plane. The small plane shut his taxi lights off just after the sphere lit up and began to turn. I thought to myself that this pilot may have missed seeing it the first time but the second time no way. It came straight toward him extremely fast and from up high but was well out in front of him. Object appeared to be size of VW or big earthball without the fire and tail just a solid white sphere but hauling butt and still the small plane didnt so much as flinch while turning his taxi lights off!?? it appeared to be like a game of cat and mouse just directly over a populated city and im not sure the mouse was aware. The small plane appeared to be some type of civil patrol or police plane just bigger than typical Cesna single engine type 172. Maybe a piper PA 28 or similar. Night was clear and dry with excellent visibility of stars."],"files":["/var/www/straped/mufon/html2text/23147.html.txt","/var/www/straped/mufon/org/23147.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.30978,+-111.8359(23147)&iwloc=A&hl=en\"> mufon case (23147) map </A>","Object Flight Path":"Straight-line path"}