{"Disposition":"Unknown","divs":["Sighting DetailsI was driving with a friend of mine (who also witnessed it) in Lawrence, KS, driving west on 6th street, just west of downtown Lawrence, when we noticed a really strange object up in the sky. It was about the altitude that a helicopter would fly, but it wasn't a helicopter. It was located north and west of where we were. It was the middle of the day. I guess we noticed it because it was there, up in front of us, easy to see. It really mystified me because although it wasn't an airplane or a helicopter or a balloon, it also wasn't a disc, which is what I always thought, based on a past experience, a ufo would look like. This thing was metallic but tall and sort of shapeless. It was multi-faceted. It didn't seem to be flying, but hovered where it was. I don't know what shape to call it. I guess it was closest to a cylinder, but it wasn't smooth. It seemed multi faceted. I didn't know what it was. I still don't. It was confusing. We watched for as long as we could, given the traffic, and wondered out loud what the heck it was! We would have tried to watch longer and investigate it further, but I had to get home to nurse my baby. The weird thing about the experience is that I somehow forgot about it until my friend mentioned it a couple of years later. After she brought it up, it all came back to me. I have always been very interested in ufos, so it was disturbing to me that my memory of this event would be so fleeting. In thinking about where this thing was located, I kind of wonder if it wasn't checking out the coal fired power plant to the north of where we were."],"Case Number":"23148","Tags":"City","Summary":"UFO in Lawrence, KS, in the middle of the day. October, 2004.","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23148.html.txt","/var/www/straped/mufon/org/23148.html"],"Log Number":"US-05052010-0014","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/04/2004 12:00 UTC","Longitude":"-95.22932","Latitude":"38.974569","Date Submitted":"05/05/2010 07:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.974569,+-95.22932(23148)&iwloc=A&hl=en\"> mufon case (23148) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Region":"Kansas","Object Shape":"Other","Weather Factors":"Unknown","Country":"United States","trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around October 4th 2004"],"City":"Lawrence"}