{"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=33.6803,+-116.173894(23142)&iwloc=A&hl=en\"> mufon case (23142) map </A>","Source":"MUFON","Object Features":"Other","divs":["Sighting DetailsI was sitting in my bedroom floor playing a videogame.Must have around 3:30 A.M. I was charging video camera cause I thought my neighbors were snooping around my house. So i just happened to look out front window,and what looked like a huge,huge bright like a full moon was gliding like a loose balloon. It was maybe 50 yards away from window and it looked like it was in back of my neighbors house. Must have been size of two house's. So I quickly grabbed the video camera and woke up my wife to show her.And I recorded about 30 seconds cause film in camcorder was at end of tape. This happened about five to six years ago. Never thought of reporting itonly because I don't think my photage is that good. But you can see what I recorded. I think I only seen footage maybe twice since I recorded it.I thought maybe a full moon but then I remembered I seen same thing about two nights before that day. So this objesct went from my left to right just gliding slowly and confused the hell out of me. I dont remember if I lost sight of it or not. My wife was mad at me for looking out of window at that time. we just put the blinds back down because i to lift blinds to look outside. After we just laid down and went to sleep. I was kind of scared what if it saw me. Me thinking it was a U.F.O. I freaked out so I didn't look out window again."],"Log Number":"US-05052010-0008","Country":"United States","Region":"California","Weather Factors":"Unknown","Date Submitted":"05/05/2010 03:08 UTC","files":["/var/www/straped/mufon/html2text/23142.html.txt","/var/www/straped/mufon/org/23142.html"],"Longitude":"-116.173894","Tags":"City","trends":["There have been 3 other sightings in Coachella","There were no other sightings in Coachella on or around August 15th 2004"],"Disposition":"Insufficient Data","City":"Coachella","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Summary":"large moon like","Latitude":"33.6803","Case Number":"23142","Date of the Event":"08/15/2004 03:20 UTC"}