{"trends":["There have been 42 other sightings in Reading","There was one other sighting in Reading on or around May 4th 2010"],"Log Number":"US-05052010-0009","Viewing Distance":"Unknown","Object Shape":"Triangle","City":"Reading","files":["/var/www/straped/mufon/html2text/23143.html.txt","/var/www/straped/mufon/org/23143.html"],"Region":"Pennsylvania","divs":["Sighting DetailsI was sitting in a recliner watching TV, as I usually do every evening. Over a period of time I've noticed a fairly bright light out our kitchen and dinette windows. This has been most acute in the last week of April into this early week of May. I live in a rural developement SW of the small town of Sinking Spring. The windows described above face north. These lights were seen by me and my father to our NW. A few days ago, the unidentified occurance piqued my interest to the point of me geting my binoculars and viewing it. The binoculars are not the most powerful; ie. 7X35MM. I saw a V or triangle shape with lights along both sides, blinking. The lights were more bright on the left side(as viewed by me). There were 3 of them and 3 less bright flashing on the other side. The object was about 1 inch in width as viewed by my field glasses. I went upstairs to get my dad to witness it, but he did not see the same shape and light array as I. The other night I saw lights dancing around the same section of sky. This phenomenon appears every night around 9:24 till about 10:00. Once I saw it dip to the right with a red light showing as it fell below my horizon. Last night, there was a stationary presence, same place, same time. There was also dancing lights. After the lights seemed to have gone, a helicopter flew on a SW to NE diagonal line. This would have been between myself and where the object was operating. Although I have an interest in UFO's, this is my first and only sighting. It took some courage for me to observe this. I expect this to happen again tonight."],"Tags":"City","Longitude":"-75.921545","Summary":"Night time UFO sighting","Object Features":"Undisclosed","Case Number":"23143","map":"<A HREF = \"http://maps.google.com/maps?q=40.338798,+-75.921545(23143)&iwloc=A&hl=en\"> mufon case (23143) map </A>","Date Submitted":"05/05/2010 03:13 UTC","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"05/04/2010 09:24 UTC","Latitude":"40.338798","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Weather Factors":"None"}