{"Object Flight Path":"Other","Latitude":"36.33876","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"Two UFO's Intersecting. One UFO pulsated bright light to avoid collision.","Tags":"City","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"05/05/2010 06:04 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/23144.html.txt","/var/www/straped/mufon/org/23144.html"],"divs":["Sighting DetailsFour days ago, I was laying in my lounge chair peering at the sky. I noticed several small dots moving about. I have seen this every night now for the last four days. It is like they are all scrambling to get into position before total nightfall. After the nightly event the airplanes will then start to appear. Its like the star sized craft know this. I have seen four to six of these during this event. Last night about 9:45 I watched two UFO's crossing each others path at the same altitude.( approx. 15 to 20 miles up) The one that was heading south seemed to signal the one coming from the west with a really bright pulsating light, which made the one ufo a hundred times the original size. The one heading east accelerated as the one heading south seemed to quickly decelerate ( not stopping, just slowed down quickly) This is in total comparison to a horn honk and brake slam in an intersection. In amazement I went out to look again ( as I have for the past several nights} There is nothing in the skys but airplanes. It seems to be scheduled as I have only seen this between 9:15 and 10:30. This is just east of the little and big dipper. (looking east) If anybody out there peers into the same area and notices this, please feel free to e-mail me. Thank you for reading and happy hunting. -Robert M Peternell"],"Date of the Event":"05/05/2010 09:30 UTC","City":"Rogers","map":"<A HREF = \"http://maps.google.com/maps?q=36.33876,+-94.109037(23144)&iwloc=A&hl=en\"> mufon case (23144) map </A>","Log Number":"US-05052010-0010","Object Shape":"Star-like","trends":["There have been 16 other sightings in Rogers","There was one other sighting in Rogers on or around May 5th 2010"],"Source":"MUFON","Longitude":"-94.109037","Case Number":"23144","Region":"Arkansas"}