{"Longitude":"-88.536694","Summary":"Follow up to \"Star like object changing colors to blue, green and red\" in PA.","Date of the Event":"02/15/2009 09:00 UTC","Sighting Duration":"00:45:00","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/23152.html.txt","/var/www/straped/mufon/more/23152_submitter_file2__IMG_1078f2.jpg","/var/www/straped/mufon/more/23152_submitter_file3__IMG_1083f2.jpg","/var/www/straped/mufon/org/23152.html"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Tags":"City","Region":"Wisconsin","Latitude":"44.031016","Object Flight Path":"Undisclosed","Source":"MUFON","Country":"United States","Date Submitted":"05/05/2010 09:16 UTC","Disposition":"Unresolved","trends":["There have been 10 other sightings in Oshkosh","There were no other sightings in Oshkosh on or around February 15th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=44.031016,+-88.536694(23152)&iwloc=A&hl=en\"> mufon case (23152) map </A>","City":"Oshkosh","Case Number":"23152","Log Number":"US-05052010-0018","divs":["sighting detailsi too have noticed this star like object several times in the past and have photographed it with a canon eos10d on a tripod back in early 2009 but have never reported it because i pointed it out to a few people and got the typical response... well you know. so after seeing the report from pa i thought i would just put it out there to see what happens. i too was seeing the red, blue, and green colors and was photographing it in a high speed sequence when i noticed it seemed to have a repeating pattern to it. then something really bizzare happend, it blinked off for a split second then started over again. i put together a short video comprised of several still photo's in the natural order they occoured from that night and it runs in about 1\\4 real time. in addition the last 2 photos are of the object when it appeared to blink off but the camera caught something very strange looking that i couldn't see with the naked eye. i remember thinking to myself at the time, silly seti; don't you think an advanced civilization would communicate using something like light and primary colors other than radio waves?"],"Object Shape":"Star-like"}