{"Date Submitted":"05/06/2010 01:06 UTC","Summary":"tiny white strobe evolving into multiple fireballs. connected together.","Country":"United States","Viewing Distance":"Over One Mile","Source":"MUFON","Disposition":"IFO","trends":[],"Case Number":"23159","Latitude":"31.976699","City":"Undisclosed","divs":["Sighting DetailsWhile observing a strange strobe type light in the sky what at first seemed to be a high alt jet with only one strobe visible I was not sure if it was perhaps a ufo because it did not seem to be on a course and first went from east to west then west to east. Also it had no such required lights visible..While I was watching this light suddely a large ball of light like a fire ball appeared out of no where not moving at all and within ten or so seconds faded away.. I was totally shocked and called my wife just inside to get out here to see this amazing sight with me. By the time she arrived it was gone.. Next while looking at the sky for more signs she said there it is to the west. this wa only five minutes or so after the first event. Tis time the ball appeared out of no where and splt into four equal sized balls all glowing like fire and just as abruptly faded away.. This was repeated again after about five min in a complete different sector of the sky.. We never saw any after that. This all took place in the sky roughly over an area west of Bangs tx around 8 pm or thereabouts. The sky was perfectly clear. Whithin 45 min two f 16 air force planes made a hi fly by.. this is a fighter training area for carswell A F B in fort worth. They may have been sent to see wat was going on. Assuming some one else had also seen and called a report in.. This is not very far from the area in Stephenville tat made so much news a couple years ago.I had realized the stbe light had some connection with the appearence of these balls of light. Comletely different story a few years ago I and another man observed at close range a huge huge triangle shaped object at a low and slow near hudso oaks tx. I have never reported this."],"Log Number":"US-05062010-0005","Region":"Texas","Tags":"City","Object Shape":"Fireball, Other","Object Features":"Unknown","Weather Factors":"Unknown","Longitude":"-99.891993","map":"<A HREF = \"http://maps.google.com/maps?q=31.976699,+-99.891993(23159)&iwloc=A&hl=en\"> mufon case (23159) map </A>","Date of the Event":"05/04/2010 08:00 UTC","files":["/var/www/straped/mufon/html2text/23159.html.txt","/var/www/straped/mufon/org/23159.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary"}