{"Longitude":"-77.93932","Country":"United States","Case Number":"23168","files":["/var/www/straped/mufon/html2text/23168.html.txt","/var/www/straped/mufon/org/23168.html"],"Date Submitted":"05/06/2010 07:44 UTC","Summary":"Five rotating spheres stationary in the sky blinking blue-red.","Weather Factors":"Unknown","divs":["Sighting Details This is the third occasion that i and another person have witnessed these lights in the sky's over Oak Island ,NC. August of 09 i was fishing in the evening around 9:09 PM with my friend on a clear evening and just off shore there were five to six lights low in the sky pulsating different colors.They remained stationary for a long period of time making no noise then they would alternate blinking out and re-positioning themselves this happened for over three hours.We both noticed a jet come into view leaving a u-turn contrail, the jet was apparently investigating the lights. One year later my wife was outside my home which is a few blocks from the beach and she said.... hey look over there there is a half dozen or so blinking lights just sitting there, they appeared to be in the same vicinity as the lights i previously saw and acted in the same manner. Last evening Mat fifth 2010 my wife was closing the blinds for the evening and joking said come here look outside there is a UFO.I went to the window and said nah that's just a star she said do stars blink different ant colors i said sure they twinkle if there is some sort of atmospheric disturbance? We went out onto the front deck and there it was over the same part of the beach as we have previously saw, at first i thought it was Saturn because of how bright it was but spinning and blinking \"BRIGHT BLUE-RED over and over just sitting there stationary.We looked around and noticed there were five more two were side by side and the others in the two O'clock and four O'clock position all were glowing BLUE RED you could see that with your naked eyes buy when you put up my Nikon binoculars you could see them especially the one over the sea perfectly spinning glowing blue -red very bright!I drove over to the beach to get a good look at the spinning object to confirm that it was i had saw the previous year and it was the exact same thing just sitting there silently.I drove home which took about two minutes and looked again from my top deck and the one over the beach had moved over the island.Keep in mind now that over an hour had passed and the others were still just hovering in the sky. I am familiar with astronomy so i could watch the movement of the dipper and Orian's belt the stars were in procession but these lights remained put. Around 11:30 PM The object which had moved over the island rose up then moved left again and headed back to the beach area i could see it in the binoculars and the brilliant BLUE-RED Almost firecracker kind of lights, i saw it bank and was able to determine it was now not round and the lights were very bright. The objects remained in the sky until 2AM then Disappeared. Regards: Marko"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.234636,+-77.93932(23168)&iwloc=A&hl=en\"> mufon case (23168) map </A>","Object Features":"Undisclosed","Date of the Event":"05/05/2010 12:00 UTC","City":"Wilmington","Tags":"City","Latitude":"34.234636","Region":"North Carolina","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05062010-0014","Object Flight Path":"Hovering then path","trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around May 5th 2010"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Shape":"Oval, Star-like"}