{"files":["/var/www/straped/mufon/html2text/23161.html.txt","/var/www/straped/mufon/org/23161.html"],"Object Features":"Undisclosed","Region":"Texas","trends":["There have been no other sightings in Lago Vista","This sighting has never been favorited."],"Tags":"City","Case Number":"23161","Object Shape":"Circle","divs":["sighting detailsmy father and i were driving down nameless road towards the intersection with rm-1431, between leander and lago vista, on our way to put the boat into lake travis. it was a beautiful clear day, barely a cloud in the sky. i looked out the window and could see a fairly high-altitude object that was reflecting sunlight like a metallic craft would. it was far enough away that i couldn't be 100% positive as to the shape, but it appeared to be fairly circular, with maybe a slightly ovular shape to it. it appeared to be moving away, at approximately a 45-50 degree angle from the ground. i got my dad's attention and told him to look through the windshield to see if it was possible for him to see it. as soon as i got his attention, i looked back out the window and could not find the object again. he didn't see it, this time. i am fairly convinced that what i saw could not have been an airplane, helicopter, or any other craft that i'm aware of. it was clearly metallic, and had some sort of circular\\oval shape to it. my feeling during and immediately after this sighting was that it seemed very similar to \"flying saucers\" that people have reported for years, although i had never seen anything like it before. it was, by definition, a ufo. a few hours later we were on the boat out on lake travis, cruising in the boat at about 25mph. my father was piloting the boat, i was laying out on the back wraparound seat. i looked up into the sky toward the approximate direction of the road that had taken us to the lake, and there it was again. i am 95% sure that i saw the same thing (craft) that i had observed a few hours earlier from the truck. this time my dad saw it too. i got a much longer look at it, maybe a minute and a half of direct observation this time. just like before, the metallic object seemed to move away, get a bit smaller, and then disappear completely from sight. he did not get nearly as good or as long a look at it as i did, nor are his eyes as good as mine. i was wishing very badly that we had binoculars or a camera with a massive zoom lens to see the craft better. also of note- we observed another craft perhaps an hour or 2 later while headed back to the boat launch, but neither of us could eliminate the possibility that this was an airplane at very high altitude. at no time during any of these 3 sightings did either of us hear a jet engine, prop engine, or a helicopter. in fact we heard nothing from any of the craft."],"Date of the Event":"05/02/2010 01:29 UTC","Sighting Duration":"00:02:00","City":"Lago Vista","map":"<A HREF = \"http://maps.google.com/maps?q=30.460198,+-97.988348(23161)&iwloc=A&hl=en\"> mufon case (23161) map </A>","Log Number":"US-05062010-0007","Latitude":"30.460198","Longitude":"-97.988348","Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unknown","Summary":"Metallic Object, Strange movement patterns and disappearance sighted near Lago Vista TX","Weather Factors":"Unknown","Country":"United States","Date Submitted":"05/06/2010 02:50 UTC","Object Flight Path":"Undisclosed"}