{"City":"McKinney","files":["/var/www/straped/mufon/html2text/23173.html.txt","/var/www/straped/mufon/org/23173.html"],"Latitude":"33.205356","Weather Factors":"Unknown","Case Number":"23173","Date Submitted":"05/07/2010 01:07 UTC","divs":["Sighting DetailsMy wife and I were in the parks rc flying field. I had just loaded up my rc planes to start home it was almost 8:00 pm. We had been there almost an hour and a half. That's when I saw a spere shaped object flying low to the ground. I called my wife and after a few seconds she was able to see it. From my point of view it was just over the power lines to our south aproximatly a mile form us. The object was traveling from east to west. It's speed looked to be faster that a small prop plane. I't size similar to that of a HA baloon. At first I thought it was a hot air baloon. There was only a slight breeze at the time from the north. The wind was so light that an hour earlier two hot air baloons in the south east stayed in the same spot for almost 30 min. I looked at the object with a low power monocular but could not see any detail except that the sphere seemed to be flat on the bottom. The object left our field of view when it appeared to turn to the south and went below the tree line. This seems strange because the night before this sighting we reported a green fireball to MUFON. I still can not beleive my eyes and keep wandering if it was truly something unknown."],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Object Shape":"Sphere","Country":"United States","Source":"MUFON","Object Flight Path":"Undisclosed","Disposition":"Unknown","Region":"Texas","Log Number":"US-05072010-0001","trends":["There have been 30 other sightings in McKinney","There was one other sighting in McKinney on or around May 5th 2010"],"Date of the Event":"05/05/2010 07:50 UTC","Longitude":"-96.632842","Summary":"whitesh gray sphere low to ground","map":"<A HREF = \"http://maps.google.com/maps?q=33.205356,+-96.632842(23173)&iwloc=A&hl=en\"> mufon case (23173) map </A>"}