{"Summary":"In June of 1974 around 6pm a silver disc hovered above me and my mother for approximately 5 mins. then 6 days later in the middle of the night we were awakened by a blinding blue white light.","Object Flight Path":"Hovering then path","City":"Nicholasville","Date Submitted":"05/07/2010 11:19 UTC","Viewing Distance":"21-100 Feet","Weather Factors":"None","Country":"United States","divs":["Sighting DetailsEarly in June of 1974 on a Sunday evening approximately 6 pm my mother sent me to the corner store for something, as I was driving back I saw a silver disc high in the sky with the sun refelecting on it. I kept my eyes on it as I slowly weaved down the road the 50 or 60 yards to our driveway and pulled in. The disc was desending and getting closer and closer to me. I jumped out of the car yelling repeatedly for my mother and father to get the camera. Mom heard me yelling and came running out of the house with flour dough covering her hands (she was making biscuts). When she saw it she began shouting for dad to come out. However, he was watching the news and didn't hear us. By now the disc was silently hovering about 25 to 35 feet above us. It had green and blue lights flashing on and off around a white center underneath it. On the upper part it had circular windows. After approximately three minutes it silently shot off in a southwesterly direction and disappeared in a matter of seconds. We were shocked and in awe of what we had just witnessed. Of course we told dad immediately and just about everyone we knew. Then on that Friday night dad who normally worked the day shift was filling in for a co-worker on the nightshift so mom and I were home alone. It was the middle of the night and we were asleep in our beds when I was awakened by a brilliant blue white light that filled my bedroom. It was as if my window had no curtains. Although I was frightened, I believe I could not move. Then the light began to shift and now it was shining through the front door. My bedroom had two doors, one opened into the livingroom and the other into the hallway, both doors were open. As soon as that light was off me I jumped out of bed and ran down the hall to mom and dad's bedroom. Their bedroom also has two doors, one opens to the hall and the other to the kitchen, both doors were open. Mom was instantly awakened by me and the brilliant blue white light. We were very frightened so I got dad's loaded rifle from under their bed. We huddled together on the bed as we watched the shadows shift as the light now was slowly coming through the side windows. From the livingroom then through the diningroom windows and then the kitchen. With the gun cocked and pointed toward the backdoor, I said to mom that if someone comes through that door I was going to shoot them. Then the light went out and we were in the dark. We were afraid to move for sometime, finally we got our nerves up to peak out the windows and didn't see or hear anything. We called dad and told him and wondered if we should call the police but he said why bother since nothing had happened. This episode lasted approximately 15 to 20 minutes. Mom and I know the light definitely had something to do with our ufo sighting."],"Sighting Duration":"Undisclosed","Longitude":"-84.572996","Latitude":"37.880634","map":"<A HREF = \"http://maps.google.com/maps?q=37.880634,+-84.572996(23188)&iwloc=A&hl=en\"> mufon case (23188) map </A>","Object Features":"Dome, Window(s)","Date of the Event":"05/31/1974 06:30 UTC","Tags":"City","Disposition":"Unknown","trends":["There have been no other sightings in Nicholasville","This sighting has never been favorited."],"Case Number":"23188","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/23188.html.txt","/var/www/straped/mufon/org/23188.html"],"Region":"Kentucky","Log Number":"US-05072010-0015","Source":"MUFON"}