{"Tags":"City","Weather Factors":"Unknown","Date Submitted":"05/07/2010 11:45 UTC","divs":["Sighting DetailsThe month and date was approximately February. This not just a sighting....they are communicating with me at this very minute and have been since the above date. They are locked into my home anD ME via a signaling system. I cannot lose contact, no matter where I go. They have locked into my computer, dish network system, as well as my vehicle and MY HEAD. Messages and talking are comming through in english in my left ear. They are reading my mind and they are reading this as I write as they can see through my eyes!!!!!!!!!!!!!! This is not a joke and it's not funny. I NEED HELP RIGHT THE HELL NOW. If someone gets out here with the right equipment you will pick up the signal easily, the problem is that no one will believe me. I have emailed the Governor of California several times thrugh www.politicsol.com, as well as several military bases includng the Navy which is in Coronado, California. I went to Hanscom Field which is in Massachusett's and was sent away like I was a NUT CASE! This is very embarrassing as I feel so alone. I have a 13 year old son that I have to try to work this signal around.......he wants his \"same Mom back\". PLEASE CONTACT THE MILITARY IMMEDIATELY TO HAVE THEM VALIDATE MY CLAIM AS IT IS THE GODS HONEST TRUTH!!!!! 12 Pine River Road Center Ossipee, N.H. 03814 603-539-4199 PLEASE ACT NOW.............THEY ARE COMMUNICATING.....NOT JUST SIGHTINGS!!!!!"],"Summary":"Triangle, red light off of whAt looks like a star, also round silver one as well","Longitude":"-71.570065","Source":"MUFON","City":"Undisclosed","Object Shape":"Oval, Triangle","Country":"United States","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/23180.html.txt","/var/www/straped/mufon/org/23180.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.202462,+-71.570065(23180)&iwloc=A&hl=en\"> mufon case (23180) map </A>","Object Features":"Undisclosed","Case Number":"23180","Viewing Distance":"Unknown","Log Number":"US-05072010-0008","Region":"New Hampshire","Date of the Event":"02/01/2010 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Hoax","Latitude":"43.202462","trends":[]}