{"divs":["Sighting DetailsWas on vaccation with my husband, daughter, son-in-law and their one year old daughter, my grandaughter. My daughter, husband and grandaughter had gone to bed. My son-in-law (\"M\") and I were setting on the porch which was on second floor. The porch faced an empty lot and in front of that was a small street. On the other side of the street was a house with the back yard being the beach. All at once a round light appeared. It looked like about the size and color of a headlight of a car. It looked like it was out over the beach about maybe about 100 yards. I ask \"M\", what the heck is that. We both just stared and kept saying what is that. I stood up with hand on the railing and the light disappeared. Light stayed on maybe 30 seconds. I leaned on the railing and about 3 to 5 seconds after the light went out I heard what sounded like a rumble of distant thunder to my left. Sounded like it was maybe a mile away. Of course we kept saying, what could of that been. About 5 minutes later it appeared again in the same place. This time we both stood up and kept saying, \"Is this a UFO\". I started getting nervous. It stayed on about the same length of time. This time when it disappeared I heard the thunder sound to my right. Couldn't see any shapes, just the one light. Michale wanted to go up on the beach house roof because it had one of those little places with benches up there but I got half way up and couldn't go farther because I'm afrain of heights. We came back to our chairs and set down then in the same place. first one light came on then maybe 2 seconds later another light came on right beside the first one. I think it was about 5 lights that came one at a time all beside each other. I grabed his arm and he said, what should I do. I screamed to go get somebody up. I was really scared now. He took off in the front door and the lights went off. He brought my daughter out and of course she was groggy from being in a deep sleep. The lights were out but she did hear the same thunder sound. I am a 54 year old nurse who is very level headed. My son-in-law and daughter are both professionals. \"M\" is very, very intellegent and when he ask me what to do I knew he was as scared as I was. It was the week after Labor Day and most all of the houses were vaccant. Season was over. The bridge to the islad is short and its a pretty small island. I didn't even know if there were police around or who to call. It has changed my life. Every time I'm outside at night I am watching the sky. The other day one of my patients came in and told me he saw an UFO over the weekend. Of course I was interested. I told him about my incounter and he gave me this web site. It makes me feel good to tell this and think somebody may actually believe me. I'm not sure what county Ocean Isles is so I just guessed so I could submit."],"Date Submitted":"05/07/2010 10:46 UTC","Region":"North Carolina","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/23186.html.txt","/var/www/straped/mufon/org/23186.html"],"trends":["There have been 5 other sightings in Ocean Isle Beach","There were no other sightings in Ocean Isle Beach on or around September 1st 2008"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Features":"Unknown","Country":"United States","Date of the Event":"09/01/2008 12:00 UTC","Case Number":"23186","Log Number":"US-05072010-0013","Object Shape":"Other","City":"Ocean Isle Beach","Longitude":"-78.439779","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Weather Factors":"Unknown","Summary":"Saw something 3 different times. Lights only. First time one light, second time one light, third time 5 lights","Latitude":"33.905156","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.905156,+-78.439779(23186)&iwloc=A&hl=en\"> mufon case (23186) map </A>"}