{"Object Shape":"Circle, Triangle","Object Flight Path":"Path with directional change","Region":"Washington","City":"Bellingham","Summary":"cirular triangle, out in sehome football feild, small light, got bigger, then shape was visible, slowed down spead up, out of sight.","Object Features":"Dome, Window(s)","Date Submitted":"05/08/2010 01:41 UTC","Country":"United States","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around May 7th 2010"],"Disposition":"Insufficient Data","Weather Factors":"None","Case Number":"23193","Log Number":"US-05082010-0005","Source":"MUFON","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Latitude":"48.765373","Longitude":"-122.485525","divs":["Sighting Detailsso first we got bored at my friend dakotas house, (close to the highschool) and we went up to it through the mini wood trail and up into the field, and then climbed a tree as it was slowly getting darker, i was in a higher up tree so i sorta got stuck for a bit cause by the time i was getting down the first stars were starting to appear. when i finally got down it was dark enough to see some stars, and we were kinda just chillin. then we were joking around about aliens and stuff and how it was all sketch cause we were out in the middle of a field right as it began to get dark. the field was big enough that most of the light pollution couldnt ruin our view of the stars; we saw a plane and i was joking and said \"dude look, its an ALIEN!\" and it was just a plane, but then we started joking around some more and watching planes, we kinda spooked ourselves out a bit. right as we were about to leave we saw a much brighter, larger plane, even from far away. right before this happened i remember out of the corner of my eye i saw tworeally pale pinkish white flashes in the speed of a fast camera. it didnt seem like a plane as it did more like a star. it seemed to come towards us and slowly get lower; then we realized it was in our general direction but somewhat more towards the downtown bay area. then it was in an angle where we could see three lights, bunched together closely, seeming like it was one large object (rather than several) with apparently a small red light on the top, (i didnt see it though, but apparently dakota did.) i tried taking a picture with my phone, hoping it might look good, but i knew it wouldnt, and didnt. by then we could tell the object was very large, and it started slowing down, almost humorously as i tried to take a picture. but as i tried again it started speeding up, and towards the direction we couldnt see because the highschools gym building was in the way. so i stopped trying to take a photo and we ran out towards the other side of the field to keep it in view, of course as this happened it slowly sped up more and more. to fast to be a jet, but slow enough to see its general shape. by then even as we ran out to keep seeing it, it went over the forest line (an area between us and the bay unless you take the town route) and then we couldnt see it anymore. as all of it was happening i wasnt at all afraid, only interested, and i had some adrenaline pumping when i realized it was definitely NOT, a plane. now were going to buy a pizza, with nothing else to do, and go back up to the field hoping to see more. :)"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.765373,+-122.485525(23193)&iwloc=A&hl=en\"> mufon case (23193) map </A>","files":["/var/www/straped/mufon/html2text/23193.html.txt","/var/www/straped/mufon/org/23193.html"],"Tags":"City","Date of the Event":"05/07/2010 09:45 UTC"}