{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"05/08/2010 04:02 UTC","Disposition":"Unknown","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/23194.html.txt","/var/www/straped/mufon/org/23194.html"],"Object Features":"Undisclosed","Case Number":"23194","Tags":"City","Latitude":"38.891565","Date of the Event":"05/07/2010 11:50 UTC","Summary":"Cluster of objects moving North East","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Lincoln","There were no other sightings in Lincoln on or around May 7th 2010"],"Log Number":"US-05082010-0006","Longitude":"-121.293008","map":"<A HREF = \"http://maps.google.com/maps?q=38.891565,+-121.293008(23194)&iwloc=A&hl=en\"> mufon case (23194) map </A>","divs":["Sighting DetailsI had an amazing sighting this morning on my way north toward Yuba City. I was just south of Lincoln... I saw 12-15 shiny objects in the sky. I was on my motorcycle so I could not pay 100 % attention right away. I saw a \"cluster\" of objects... my mind said balloons at first... I glanced between the sky and the road in front of me several times... the objects moved from a \"cluster\" to a \"wedge or V\" shape in what seemed to be 2-3 seconds. I took the next right off the highway road to find myself in an empty parking lot between two short buildings... the lot was completely vacant. The group of objects moved slowly north by north east. I watched them travel for about a minute and then all but one of the objects vanished instantly. The one remaining object moved back in a south by south west direction and stopped nearly directly over my head. It hung above me, for two or three minutes before moving back in the north by north east direction where another object moved in from a right angle to fly beside it. I lost sight of both objects after 2 to 3 minutes. I tried to get my wife on the phone while this was all happening but ended up leaving a very excited detailed message in her voice mail box. I had my camera with me but failed epically to get any video or pictures because I didn't check all the pockets of my back pack and consequently convinced myself that I had left it at home... I guess I was too distracted, I had the camera all along. Epic failure... but what a sighting. I hadn't seen anything since 1993 and now I've had two sightings this year... this one was pretty epic... it reminded me greatly of the \"cluster\" videos taken in Mexico... the fact that they moved into a formation was amazing to me. I saw two large birds in the vicinity, one jet airliner, one smaller plane, and the moon was over my left shoulder during this event. From my perspective the unidentified objects seemed to be higher than any of the other flying things I witnessed."],"City":"Lincoln","Country":"United States","Region":"California","Source":"MUFON","Object Flight Path":"Undisclosed"}