{"Longitude":"-73.138056","Region":"Connecticut","Summary":"large disc shaped dark/no lights/silent/moving over home","map":"<A HREF = \"http://maps.google.com/maps?q=41.304167,+-73.138056(23197)&iwloc=A&hl=en\"> mufon case (23197) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Shelton","There were no other sightings in Shelton on or around August 1st 1966"],"files":["/var/www/straped/mufon/html2text/23197.html.txt","/var/www/straped/mufon/org/23197.html"],"City":"Shelton","Disposition":"Unknown","Log Number":"US-08092011-0046","Tags":"City","Date Submitted":"08/09/2011 10:47 UTC","Source":"MUFON","Country":"United States","Object Shape":"Disc","Case Number":"23197","Date of the Event":"08/01/1966 08:00 UTC","divs":["Sighting DetailsI was in the 7th grade. I was outside on a Sunday evening-about to 'head into the house' to watch TV. We lived in suburban Connecticut, bordered by hundreds of acres of land owned by the Bridgeport Hydraulic Company- there was a large reservoir which I believe was one of the reservoirs supplying water for the greater Brideport area. I was enjoying the night sounds and the cool weather once the sun had set. I noticed something in the sky and looked up to see a very large silent disc (with no lights) moving slowly across the sky not too far above our colonial 2 story home. I watched it for a few seconds and then began to call very loudly for my sister or my grandmother (who was babysitting my 4 younger brothers and sisters) that evening to 'hurry up and come outside to 'see somehing.' I kept looking up at the sky when this huge disc moved slowly and silently over our house. By the time my grandmother came out of the house (annoyed at my yelling) it was too late-the disc had passed and was 'heading' toward the area where the reservoir was located (I would often take a walk through the woods down there a lot and it seemed like the direction it was going) I have never seen anything else like this and I am now 55 years old. I have never forgotten this image and I often remember the event and am so curious about it...I remember it like it was yesterday although it occurred over 40 years ago!"],"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Latitude":"41.304167","Object Features":"None","Sighting Duration":"00:10:00"}