{"Object Shape":"Disc","divs":["Sighting DetailsI was walking home from the train approx. 1 mile and I was looking towards theSouth East when I saw a silver disksaucer at about 10,000 feet with the leadingedge pointed slightly upwards and moving East. I watched it for about 3-4seconds as it moved slowly and then there was a sort of blur and it disappeared. The saucerdisk seemed to be wobbling and it had what seemed to be notches thatwere evenly spaced around it middle rim or section as it wobbled and rotated. Ihad my camera with me but the sighting was so quick that it was gone before Icould get my camera out. It did not reappear. I live in an area between theflight paths of LaGuardia and JFK airports. I see regular jet traffic almosteveryday. I actually live closer to JFK and so I see jets at lower altitudesgoing in for landing very clearly and also jets that are climbing to higheraltitudes after takeoff. This object had no wings and I could tell it wascircular in shape because it rotated as it wobbled across the sky for that 3-4seconds. The notches around the middle seemed to be small square or rectanglenotches evenly spaced around the object as it moved in its tilted up positiontowards the East. Thank you."],"Object Flight Path":"Straight-line path","Latitude":"40.65102","Sighting Duration":"00:00:59","Source":"MUFON","Disposition":"Insufficient Data","Weather Factors":"Unknown","Case Number":"2319","Viewing Distance":"Over One Mile","Date of the Event":"05/08/2003 06:43 UTC","Longitude":"-73.94111","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around May 8th 2003"],"Country":"United States","files":["/var/www/straped/mufon/html2text/2319.html.txt","/var/www/straped/mufon/org/2319.html"],"Object Features":"Other","Summary":"Canarsie Brooklyn, New York sighting.","Log Number":"","City":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.65102,+-73.94111(2319)&iwloc=A&hl=en\"> mufon case (2319) map </A>","Date Submitted":"05/08/2003 06:43 UTC","Tags":"City","Region":"New York"}