{"divs":["Sighting DetailsTo a degree I find this humorus. For the last three years in the summer I have sat on the balcony of my apt. at night and viewed UFO's on a regular basis. I am facing north, my view to the south is blocked. Hwy 83 is on my right and I define my viewing area by Hwy 355 to the west. I call it the funnel or corridor. I have seen mundane ufo's zipping thru the skies and some amazing sitings. One such siting last summer was an object moving from the east to the west and passed right in front of me. The object was relatively low in the sky and was shaped like a cone. It was brilliant and appeared to have rectangular panels but edges were not decernable. The light coming from it was like light refracted from a prism or off the surface of a diamond. Amazed that the next day there was nothing in the news. I have seen objects change directions between 45-90*. I have seen one huge object that was outlined and milky white. In the brief time I saw it another smaller ufo crossed underneath it and was backshadowed as it crossed along the diameter of the larger craft. The real observation is the pattern of objects coming in from the south in the \"funnel\" to north in the distance and actually decending. The time frame is usually 20:00 hrs to 21:30 hrs. The number is 2-3 in most observations. If I take a leap here they are landing and from a map the only place I can see where they can do this with some obscurity is Busse Woods. I have tried to follow them down as far as I can and when possible I employ a 10X50 Nikon binocular. If you want to really document UFO's in the skys over Chicago just use a time lapse camera at night. You can't miss. There are nights I don't spot anything but over time it is enescapable. I have other accounts but this will do for now."],"Viewing Distance":"Unknown","Case Number":"23195","Latitude":"41.797531","Longitude":"-87.954784","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.797531,+-87.954784(23195)&iwloc=A&hl=en\"> mufon case (23195) map </A>","Disposition":"Unknown","Country":"United States","City":"Clarendon Hills","Date of the Event":"07/15/2009 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 3 other sightings in Clarendon Hills","There were no other sightings in Clarendon Hills on or around July 15th 2009"],"files":["/var/www/straped/mufon/html2text/23195.html.txt","/var/www/straped/mufon/org/23195.html"],"Weather Factors":"Unknown","Object Shape":"Cone, Circle, Disc, Oval","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"Sighting was at twilight in skies over the area","Date Submitted":"05/08/2010 11:26 UTC","Log Number":"US-05082010-0007","Region":"Illinois","Source":"MUFON"}