{"Date Submitted":"05/09/2010 03:29 UTC","trends":["There have been 12 other sightings in Marquette","There were no other sightings in Marquette on or around May 8th 2010"],"Summary":"Large, bright white light moving silently across sky at night.","Object Features":"Unknown","Date of the Event":"05/08/2010 11:20 UTC","Tags":"City","City":"Marquette","Object Shape":"Other","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/23207.html.txt","/var/www/straped/mufon/org/23207.html"],"divs":["Sighting DetailsIn Marquette, MI., May 06, 2010 approximately 9 PM I went outside into my yard to smoke a cigarette. The evening sky was cloudy. Stars couldn't be seen. I noticed a very bright light through the trees and it could only be seen by standing in the \"sweet spot\". Initially, I thought it was the moon but quickly realized it was not. I moved around the yard trying to get a better view without success. Moments later the light seemed to burn out. I checked local news for reports as there had been a handful of daytime sightings of a craft days earlier. No comments. May 08, 2010 at approximately 11:15 PM I was outside smoking and looked up into a very clear night sky to see a brilliantly white light moving silently across the sky. I am under commercial airline traffic so was dilligent to see what type of craft could be lit up in such a way. I live approximately a mile away from the Lake Superior shoreline. I watched this very bright, large object move overhead and east toward the lake where it appeared to launch into hyperspace. But really, what I saw was the object get smaller and disappear. What I saw was that this UFO began to ascend at 45 degrees and zoom away out of sight. Yet, the craft got smaller not as a function of it's ascent or distance but more like, I know this sounds crazy, but like it was being vaccuumed or sucked into some unseen tube. This UFO was huge and silent! A couple of seconds afterward a commercial craft flew over and I could hear it perfectly and in comparrison of the lights, ...they were visable but pinhead."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.550464,+-87.393617(23207)&iwloc=A&hl=en\"> mufon case (23207) map </A>","Case Number":"23207","Object Flight Path":"Path with directional change","Region":"Michigan","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Insufficient Data","Latitude":"46.550464","Country":"United States","Weather Factors":"Unknown","Log Number":"US-05092010-0004","Longitude":"-87.393617"}