{"files":["/var/www/straped/mufon/html2text/2320.html.txt","/var/www/straped/mufon/org/2320.html"],"Case Number":"2320","Latitude":"42.881651","Summary":"Triangular Lights No Sound Sighted","Date Submitted":"06/30/1977 11:50 UTC","Object Shape":"Triangle","Region":"New York","trends":["There have been no other sightings in Fargos Corners","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Object Features":"Undisclosed","divs":["Sighting DetailsIt was July 1977 the time was close to midnight and I was returning home fromvisiting my sister who lived not more than 1.5 miles away.The skies were clear and stars very bright. When I got within a 14 mile of ourhome I felt as if something was watching me to the extent that the hair stood upon the back of my neck.I then turned around slowly and noticed colorful lights in the nite sky forminga triangle. Since we lived close to Fort Drum New York, I thought it was amilitary aircraft. However, it made no sound which made me suspicious. I ranthe rest of the way home excited calling for my father who came with me outsideto view the thing from the blacktop of Route 3.I needed some verification of what I was seeing. His presence confirmed it.I have since been witness to events while serving in the US Navy Indian Ocean,and a strange silvery orb the size of a basketball floating in the air thenjetting off into the direction of Ft. Drum.These events were years apart. The military sighting during my time in the Navywas photographed and documents I suppose written about the event. There wasapproximately 30 wittnesses to that event alone. Aerial moves of wildproporsions. No radar contacts, no Sonar contacts... unbelievableHope this helps."],"Longitude":"-75.56924","Date of the Event":"06/30/1977 11:50 UTC","Weather Factors":"Unknown","City":"Fargos Corners","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.881651,+-75.56924(2320)&iwloc=A&hl=en\"> mufon case (2320) map </A>","Sighting Duration":"00:30:00","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"","Tags":"City"}