{"Sighting Duration":"Undisclosed","Case Number":"23202","trends":["There have been 15 other sightings in Raytown","There were no other sightings in Raytown on or around May 6th 2010"],"Object Shape":"Circle, Flash, Sphere, Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.008617,+-94.463564(23202)&iwloc=A&hl=en\"> mufon case (23202) map </A>","files":["/var/www/straped/mufon/html2text/23202.html.txt","/var/www/straped/mufon/org/23202.html"],"City":"Raytown","divs":["Sighting DetailsI'm trying to figure out how to remain calm as I am recall these events. First the Photo of what appears to be a sillouette of a dome shaped craft hovering near the clouds in downtown Kansas City Missouri. Next an oval shaped craft flying through cloud cover during a severe storm which looked intentional. A Star shaped craft near the clouds that had a perfect star shape with five points. While riding home from work noticing a object approximately 8 to 10 feet long seemingly float through the air rotating and pointing up in the air lengthwise. Moving slowly about 5-15 mph northward. tried to turn around and follow craft, but it dissapeared. Searched for several blocks but could not relocate. That brings me to 2 days ago. Since the first sighting I have really been watching the skys lately. and what I've found out is that if your'e not careful, you'll find what you're looking for. Two day ago I got the wise idea to go out and stand in the front yard and observe the sky. Well I didn't have to wait long or look very far. It wa about 22:45 hrs.It came from a southeasterly direction. a ball or sphere glowing white. Not a bright white but a luminescent glow about two to three hundred feet above my head movin in a straight line at about thirty to forty MPH, as it came over the top of me it paused glowed brighter and then continued on its way. Less than two minutes later another craft with the same approximate description was moving in the exact opposite direction also glowing. It however did not pause or increase in intensity. It never increased it's speed and flew out of sight. I could not believe my eyes. I couldn't and still can't understand why I was given an opportunity to see these things. and finally when I looked to the north after the second craft had left the area I noticed another craft toward the north with two light one red, and the other white which stayed on only a couple of minutes and appeared to be strobeing or pulsing. It seemed to just sat there in the northern sky until I got up the nerve to raise my hand to give the appearance that I was trying to say hello a few seconds later a extremely bright light came on, flashed and then were off again. I am becomming a bit concerned. After wittnessing this last event I went into my home and woke my wife and told her the details of what had just happened. It felt a bit like Close Encounters when I told her and she gave me a look as if to say you're crazy, come back to bed! I never realized that by seeing these things one is opening him or herself up to a lot of scrutiny by friends,family, and even strangers alike. So Mufon Representatives Please! Please! do your best. Don't do it thinking your'e going to help push ur toward a new era of technology. Do it to help all of us to understand these beings and why they're here. Something I noticed Most of these crafts were seen while looking toward the sun. Other during severe storms and now I think that they are becomming bolder and allowing themselves to be seen in full daylight. Why because most humans don't really pay close attention to events in the sky unless spectacular. I don't know if these crafts are that far advanced, but they sure look like it. Perhaps thousands if not millions of years ahead of us. So Good luck and be careful. They don't seem to think that we pose a threat to them. I wish I could say the same."],"Source":"MUFON","Viewing Distance":"21-100 Feet","Tags":"City","Object Features":"Unknown","Date Submitted":"05/08/2010 10:46 UTC","Region":"Missouri","Country":"United States","Weather Factors":"None","Latitude":"39.008617","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Log Number":"US-05082010-0014","Disposition":"Unknown","Date of the Event":"05/06/2010 10:45 UTC","Longitude":"-94.463564","Summary":"I have been noticing some really strange flight patterns and crafts."}