{"Tags":"City","Disposition":"Unknown","Summary":"Saw a star like flash. Very brillant and brith with lines coming out of it all around it. Went into itself glowing still then dissapeared. Event happene again with only husband watching then again with both of us watching. And a jet flying very low like i","City":"Burlington","map":"<A HREF = \"http://maps.google.com/maps?q=48.481262,+-122.317398(23205)&iwloc=A&hl=en\"> mufon case (23205) map </A>","divs":["Sighting DetailsFirst my husband and I both went out to smoke a cigarette and star gazing. Husband sat back down and I looked up above me and saw a big flash like a big beautiful star with lines coming out all around it. It came into itself still glowing then dissapeared. As for time I can only say it had just turned very dark out . We weren't paying attention to the time.Then my husband went out to have a cigarette time unknown maybe around midnight.My husband then looked up and saw a scrambler jet flying very low but could hear the engines. It was coming from the west heading east and thought it ws very odd to be so low and slow.Husband went back in house.We then both came out about 2 hours later and we were looking up towards the west and saw the star flashes again but not as bright as the first one I saw. About 5 minutes later we saw the scrambler jet again flying low and slow in the same direction as last time. It seemed to us that the jet was looking for something. There must of been other people who saw this if they were curious about the jet sound so low. It was an event we have never seen before so we thought to report it. I was a little hesitent after the last report I entered and the response I received. But we were told to report anything we saw and not to be afraid to do so. If you need to contact us please do so as my huband has another part to tell about these events we saw that night. It was amazing. We do not know what they were but seemed to be some sort of ufo playing with the jet. We were kind of dumb founded.Thank you, Arne and Paula Heyntsen"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Other","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23205.html.txt","/var/www/straped/mufon/org/23205.html"],"trends":["There have been 8 other sightings in Burlington","There were no other sightings in Burlington on or around April 8th 2010"],"Date Submitted":"05/09/2010 12:17 UTC","Weather Factors":"None","Log Number":"US-05092010-0002","Source":"MUFON","Object Features":"Other","Country":"United States","Longitude":"-122.317398","Case Number":"23205","Region":"Washington","Object Shape":"Star-like","Date of the Event":"04/08/2010 12:00 UTC","Latitude":"48.481262"}