{"City":"Canora","map":"<A HREF = \"http://maps.google.com/maps?q=51.633941,+-102.436944(23214)&iwloc=A&hl=en\"> mufon case (23214) map </A>","files":["/var/www/straped/mufon/html2text/23214.html.txt","/var/www/straped/mufon/org/23214.html"],"Object Features":"None","Date Submitted":"05/09/2010 10:36 UTC","Region":"Saskatchewan","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Country":"Canada","Object Shape":"Cylinder","Viewing Distance":"21-100 Feet","Longitude":"-102.436944","Case Number":"23214","Summary":"Timeloss 9:00 pm to 8:00 am next day.","Date of the Event":"06/01/1993 12:00 UTC","Source":"MUFON","Latitude":"51.633941","Weather Factors":"None","trends":["There have been no other sightings in Canora","This sighting has never been favorited."],"Log Number":"CA-05092010-0011","divs":["Sighting DetailsWe were leaving Canora Sask. to drive to Yorkton, Sask.approx. 9:00 pm. My wife asks me why I am driveing this way, not my normal route. The next thing I remember is it is morning, aprox.8:00 am. We are sitting in our car. It is parked on a gravel road next to a farmers field.Car is off, keys in the ignition. It was like I just woke up. I looked at my wife and said we should get going. I Wasn t aware of anything wrong. Didn t feel paniced or abnormal.I looked in the field and there was a cylinder shaped object laying on its side, not touching the ground, just above the wheat field. It was like a chrome silver, smooth, as in no seems, rivets or anything on the exterior.It had a round pointy end on both sides. It looked like chrome but there was no reflection in it.I commented.What's that.My wife replied a grain bin.I replied ,how is it laying there not touching the ground? My wife says it must have legs.I look at this object. No legs, no noise, I could actually see air space between the bottom of the cylinder and the top of the crop. The object was about 60-70ft long by 20ft in diameter. It was about 100 ft from the road .My wife says go and take a look at it.I get this uneasy feeling and have this desire to get the hell out of here. I drive to Yorkton, Sask. arrive at the grandmothers house. She meets us at the door and says, you guys stay in a hotel? We don't reply back.. Where were you guys last night?..We don t reply back.I heard her questions but my mind went blank for a responce.It did not sink in to me that I was away all night. That I left at 9:00 pm the night before and just arriveing now. The Grandma says theres something wrong..We are acting funny.I have no reply, Don t feel anything is wrong or abnormal. As I type this my heart is raceing.I'm laying in bed watching tv. My head feels hot. Diane arrives after awhile. It was her house in Canora that we left the night before. She starts asking us if we got a hotel.No reply to her,she asks if we were doing drugs or something...No reply from me.Diane goes and talks to her niece, my wife. I don t know what happened but Diane is upset that we didn t contact anyone and we aren 't saying anything. I don t feel as if anything is wrong and do not realize that there has been a time loss that I can t account for. The subject gets dropped and we go on as usual. I have never ever brought this up with my wife, or Diane,or the grandma. But I distinctly remember this as stated.It is approx. 15 years after the incident happened that I am now talking about it."]}