{"Country":"United States","Latitude":"35.091781","Tags":"City","Object Shape":"Star-like","Log Number":"US-05092010-0009","Longitude":"-106.645397","Sighting Duration":"Undisclosed","Date of the Event":"05/07/2010 10:00 UTC","City":"Albuquerque","files":["/var/www/straped/mufon/html2text/23212.html.txt","/var/www/straped/mufon/org/23212.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.091781,+-106.645397(23212)&iwloc=A&hl=en\"> mufon case (23212) map </A>","Disposition":"Insufficient Data","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"05/09/2010 10:30 UTC","Object Flight Path":"Stationary","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around May 7th 2010"],"Region":"New Mexico","Case Number":"23212","Weather Factors":"Windy, Light","Source":"MUFON","Summary":"Looked like star dancing right and left","divs":["sighting detailsmy wife called me out to our back porch to look at an object that looked like a star, but was moving back and forth. at times it appeared like two lights very close together that were circling around each other, such that they appeared to be moving side to side (about the one measure of the object's width in either direction. at other times, it appeared more like one light that was moving very quickly, though not a very great distance. this sighting was in the western sky nearly due west (89 deg west of north) from the i-40\\san mateo blvd in albuquerque, nm, us (35deg,9min,10.35in north\\106deg,35min,10.35in west) about 30 degrees above the horizon. after about 20 minutes, i went to the street in front of our house and found a star that appeared to be in the same general location in the sky, however it did not exhibit any unusual behavior as what i observed from our backyard. it's been a while since seeing this object, and when i reach back to grasp any feelings, i can only recall a sense of playfulness and maybe innocent mischievousness."]}