{"trends":["There have been no other sightings in Sandy","This sighting has never been favorited."],"Latitude":"45.397343","Weather Factors":"Unknown","City":"Sandy","Viewing Distance":"Unknown","Date Submitted":"05/09/2010 06:08 UTC","Object Flight Path":"Straight-line path","Region":"Oregon","Source":"MUFON","Object Features":"Unknown","divs":["sighting detailsi'm in clackamas county, oregon, near deep creek - sandy\\boring. last night, it was really clear and cool, so i went out on my deck to get some fresh air. i looked up, and within a couple of seconds, an aircraft came into view from over my roof and treetops. it came directly along the small canyon\\creek bed where i live, nw to se, at approximately 11:10 pm. it was not flying along the high altitude, commercial flight paths, and it was much lower in altitude, though not as low, as small, private aircraft that buzz this area. i couldn't estimate the size, nor did i see a body shape. what i did see were two deep orange wing-tip lights where the red port and green starboard lights should have been. they were steady, no strobing. there was a center, red light which strobed. there was jet engine noise. the aircraft was moving very rapidly, and disappeared into the trees, and the sound diminished immediately, which was interesting, as everything in this canyon echoes, and military jets, on training flights, can be heard both before they are seen and after, for a long period of time. i thought it was a jet aircraft, due to the sound, but the lights were totally wrong. i tried to follow it visually, but the trees blocked my view. it was visible for probably no more than 20 seconds, and it took me about three of those to realize what was wrong with the picture. no drinking or drugs involved. no real emotional reaction, just curiosity and a bit of excitement at seeing an unknown."],"files":["/var/www/straped/mufon/html2text/23210.html.txt","/var/www/straped/mufon/org/23210.html"],"Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"05/08/2010 11:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.397343,+-122.261476(23210)&iwloc=A&hl=en\"> mufon case (23210) map </A>","Disposition":"IFO","Log Number":"US-05092010-0007","Object Shape":"Other","Summary":"Aircraft with Orange Wingtip Lights, Red Center Strobe","Case Number":"23210","Longitude":"-122.261476"}