{"Object Flight Path":"Stationary","City":"Retrop","Sighting Duration":"00:05:00","Weather Factors":"Unknown","Source":"MUFON","Latitude":"35.159775","Disposition":"Unknown","trends":["There have been no other sightings in Retrop","This sighting has never been favorited."],"Date Submitted":"06/03/2003 10:35 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-99.359807","Summary":"Retrop Oklahoma sighting","divs":["Sighting DetailsI was contacted this morning by a person who wanted to file a report of asighting on 6303 at about 1035 PM just south the town of Retrop, Oklahoma 130Miles west of Oklahoma City 35.15N- 99.35W. The witness who is a radiologytechnician, was driving north on hwy. 6 and looked off to the west and saw 2objects hovering above a field. She states that the objects were between 30 and45 degrees above the horizon from her viewpoint. The witness stated she sloweddown and rolled her window down to see the objects clearer.Her description is that the objects were disk shaped, and had extremely brightwhite and red lights that flashed in sequence around the crafts. Witness statesno stars or other aircraft were seen, This area is within the ATC area for AltusAFB Altus AFB tower reported no air traffic in the area at that time. Theobjects were seen for approximately 3 minutes before vanishing, as the witnesswatched. Weather at the time of the sighting was reported to be good. No noiseassociated with the objects reportedWitness tried to find a farmhouse to stop at to try to get another person to seethese objects, however this was in a very desolate area and she was unable to doso. She did stop and contact 2 police officers in Elk City when she arrived intown, she states she asked if anyone else had seen the objects, the officerslaughed at her, and then advised her to contact me. I have interviewed thewitness and she seems very credible.Jim HickmanMUFON- Research Specialist for Media Operationsemail- jhickman1@prodigy.net"],"Log Number":"","Country":"United States","Object Shape":"Disc","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.159775,+-99.359807(2322)&iwloc=A&hl=en\"> mufon case (2322) map </A>","Region":"Oklahoma","Object Features":"Undisclosed","Case Number":"2322","files":["/var/www/straped/mufon/html2text/2322.html.txt","/var/www/straped/mufon/org/2322.html"],"Date of the Event":"06/03/2003 10:35 UTC"}