{"Sighting Duration":"00:45:00","Object Features":"Wings","Longitude":"-111.884437","Weather Factors":"Windy","Summary":"Mothers Day UFO/Humanoid/Nazca Condor? Unlike ANYTHING that I have ever seen before.","Tags":"City","Region":"Utah","Log Number":"US-05102010-0006","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.767179,+-111.884437(23223)&iwloc=A&hl=en\"> mufon case (23223) map </A>","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around May 9th 2010","This sighting has never been favorited.",""],"Disposition":"Unknown","Viewing Distance":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/23223.html.txt","/var/www/straped/mufon/more/23223_submitter_file1__firstUFO2.jpg","/var/www/straped/mufon/more/23223_submitter_file2__myfirstUFO.jpg","/var/www/straped/mufon/org/23223.html"],"Case Number":"23223","Date Submitted":"05/10/2010 02:03 UTC","Latitude":"40.767179","Date of the Event":"05/09/2010 08:15 UTC","Source":"MUFON","divs":["Sighting DetailsMothers Day, May 9, 2010 Around 8:15 PM (Salt Lake City, Utah) It was a typical day, it was Mothers Day and me and my dad celebrated with my mom having a BBQ in our backyard. So at 8:00 ironically a program came on the BIO channel called \"Alien Cover-Up\" it that show talked about UFO research cover-up in locations of Nevada and Utah. Well I normally don't follow the UFO stuff as much as I used to because it is all about stories and lights in the skies. I always was a believer but I never thought that I would see something. So we went outside to check on the BBQ since it was almost ready. I looked up above in the sky, which our neighbors garage is in front and above it I noticed a pitched black object. The object was above seen about 100 feet away, about a block down from my street. At first I thought it was a hang glider because it appeared to shaped like one, then I thought it was that airplane and I was expecting a banner or something to promote the Salt Lake Bees or something. I asked my dad \"What is that?\" He said \"What is what?\" I said \"What is that?\" \"Where\" he said. I said \"Right there\" and he said \"Oh\" I joked and said \"It made no sound\" (Referring to what other people reported when they see UFOs) This thing didn't make a sound as well. \"What is that?\" \"A balloon?\" \"Is that a kite?\" \"A bird\" \"A drone of some kind? What is that?\" It was changing shape as it was slowly above my neighborhood. It was changing shapes. It appeared to be a kite and then it looked liked a hang glider then when it was approaching a corner heading west at an angle I saw wings or spiky points in the back and it was like it was shape shifting. It was changing shapes as it was moving. then it started moving West in an angle. I took a picture of it twice with my camera phone and I freaked out because it didn't appear on my camera. (But after looking at my pictures expanded and inverted from the paint program is appears as a round orbed object. However this is not what I see with my eyes.) So it was there at the corner of my house on the east side heading towards west in an angle. I ran in front of my driveway looking up to see where it went and I couldn't see through the trees then my dad was next to me and I told him to get the car. I looked and it was already down south from where I lived. Block down in seconds. That is when I saw my dad and I ran down and we got in the car and we were talking about it and I told him \"it is going down.\", then my mom came out and was confused and my dad gestured with his finger for her to come in the car. My mom asked \"What is going on?\" I looked over at her and I said \"Mom, I saw a f_____ UFO.\" So I told my dad \"hurry\", \"hurry\", \"hurry\" and he said \"I am going\" \"I am going\" He then asked \"where is it?\" I said \"It is right there, you see it?\" He said \"Yeah I see it.\" I asked my mom if she seen it and she said \"It looks like a bird, but it isn't\" So we start heading west. I was on the passengers still looking at it making sure it doesn't lose my site. So then we turn and head south. I was still searching for it and I seen it off and on and it appeared to all the sudden it was heading East. It appeared to be a little higher than it previously was when it was by my house. But it was far. I was at Foothill Drive during this event and it was far down between State Street and 3rd West and around 33rd South, as I was able to spot it again. It looked like a star shaped figure now. It was strange. It was just there floating and hovering there. We went down 23rd South Westbound and took the Sugar House exit as it was floating above that area. It eventually went to 15th East and 33rd South. So we head back up towards East Millcreek. I was upset because I saw the object change direction. It stopped after heading East and I saw it and I felt like it KNEW that we were following it somehow and it went down west towards East Millcreek. From there I lost it for a bit because it blended well with the mountains. I thought that we were not going to see it again, until I spot it again at East Millcreek at the Smith's Marketplace. We got out and observed it some more. when I spotted it during our journey of following it, at times it appeared to have wings of some kind and the weird part of it was when it ascended straight up it did a loop and it appeared to have WINGS like the Nazca Condor. It had that wing span stretched. This object was too big to be a bird, it never flaps its wings and it was shape shifting. As it was ascending higher and higher into the sky I saw a lightning bolt that was faded appeared close to it. The weather was windy however the dark clouds were approaching from the Southwest. I don't believe that it was a balloon on how fast it went in a matter of seconds, how it was changing shape, how it looked like a spaceship of some kind. It was ascending higher and higher until I couldn't see it with my eyes it went so high that it blurred with the sky. When it was ascending up a black jet appeared going south east from where the object was. It was bizarre because I never seen that fighter plane before. My dad said it looked like an OV-10 but he wasn't sure and told me to look it up. The plane that flew by it had a two contrails coming out of it, so from that evidence alone it had two engines and he said it might of been on OV-10 because of how slow it was. However, it did seem like a reconnaissance aircraft of some kind. I had to concentrate on the UFO, because I seen planes before. The object seemed to be out of reach for that plane anyways as the airplane kept flying down south east. It came out of nowhere and coincidently towards the area of the UFO that I seen. It was also doing some weird movements as it ascended up, it was going left and right up and spiraling it's way up. It was bizarre and I am pretty sure that I saw it extend it's wings as it was doing this it looked exactly like that Nazca Condor from the Nazca Lines. The best way I can describe it it was extending out like a cross like figure. I saw something that I cannot explain. I labeled it as a flying humanoid as well because of the pattern it moved and the shape shifting that it was doing. Since I seen videos of these \"flying humanoids\" shape shifting. But this was a little different at the same time, since it appeared to have spiked wings of some kind. I am really hoping that what I saw can be explainable. I am actually hoping that I did not see an alien craft of some kind. I am hoping someone out there saw what I saw over Salt Lake City and I am hoping someone can tell me it was nothing. However, from what I experienced it was too weird to be anything from this earth. In respect to the questions this report requires me to point out I will recap below: 1. Where were you and what were you doing at the time? In my backyard with my dad cooking BBQ. 2. What made you first notice the object? I always look up, but I had a feeling that something was towards that area so I looked and there it appeared. 3. What did you think the object was when you first noticed it? A hang glider, a parachutist, a bird, a kite and a airplane. 4. Describe the object and its actions and motions. It was slow then it was fast. It appeared to be a constant speed kind of like floating and hovering. The object was triangle shaped when it started off and it was flying weird directions, it was shape shifting where it looked like a bird like the Nazca bird. It was weird. The spiked wings was changing directions and shapes. The object was also pitched black and changed into a star shaped figure at times. 5. Describe your feelings, reactions and actions, during and after sighting the object. The atmosphere did seem different. It is this uplifting feeling when I saw it really. My eyes were watery and I took this seriously. I was shocked and I was amazed and terrified at the same. I never took my eye of it and I was determine to keep staring at it until it disappeared from my eyes. 6. How did you lose sight of the object? It went so high that it blurred from my vision and a storm came in covering over the spot that I seen it at. I have two pictures. I circled the object in black as it appears as an orb. This is not what I seen with my own eyes. The phone on my camera was the only thing that I have. I am upset that I don't have any other camera or video camera of this object. But I thought that I had no evidence. The quality sucks because you can almost barely see the object. If you notice that it appears and stands out against anything around it in the sky. If you invert the color in the paint program it looks more clearly."],"City":"Salt Lake City","Object Shape":"Star-like, Triangle, Other, Unknown"}