{"City":"Platte City","map":"<A HREF = \"http://maps.google.com/maps?q=39.370277,+-94.782461(23220)&iwloc=A&hl=en\"> mufon case (23220) map </A>","Source":"MUFON","Region":"Missouri","trends":["There has been one other sighting in Platte City","There were no other sightings in Platte City on or around May 8th 2010"],"Object Features":"Undisclosed","Summary":"Large triangular UFO flying Southeast","Log Number":"US-05102010-0004","Disposition":"Unknown","Tags":"City","divs":["sighting detailsnote: i took this report by phone this morning may 10, 2010 by a man who said he lived in the county near platte city. he wishes to remain anonymous. i asked him to keep in touch with me and if he remembered anything else to give me a call. i named him john doe because he did not want to give his name out, saying that his job would be in jeapordy if word got out. i assured him that all information would be kept confidential, but he said he couldn't take the risk. margie kay report: the man stated that he went outside to tend to his dogs at approximately 9:15 pm when a light in the northwest part of his pasture where he keeps cows caught his eye. he said that there was a beam of light coming down from a black triangular object. it looked like the depth from top to bottom was approximately 50 feet or so, the sides were very even and squared. there were three small white lights, one on each corner of the object, and one big white\\blue light in the center. the object was approximately 300 yards from his position and looked like it was at least 100 yards in width from corner to corner. after he watched it for about 5-10 minutes, the beam of light went out and the craft moved upward into the clouds until he could no longer see it clearly. the ufo then moved in a southwest direction very slowly, and just above the clouds. he stated that there was no sound whatsoever. he could see the lights on the ufo as it moved through the clouds. he stated that he was too paralyzed to move and go get a camera, but he thought that it would be too dark to get a picture anyway. he has never seen anything like this before. i asked him if he had gone to look at the area where he saw the light beaming down on his field and he said no, but he would sometime this week. he seemed somewhat afraid to go look at it. his wife was inside the house at the time and he has not told her about this, but wanted to tell someone what he saw. i also asked him to send me a sketch."],"Longitude":"-94.782461","Country":"United States","files":["/var/www/straped/mufon/html2text/23220.html.txt","/var/www/straped/mufon/org/23220.html"],"Case Number":"23220","Viewing Distance":"Unknown","Date of the Event":"05/08/2010 09:15 UTC","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Latitude":"39.370277","Date Submitted":"05/10/2010 11:46 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown"}