{"map":"<A HREF = \"http://maps.google.com/maps?q=34.705358,+-86.741532(23224)&iwloc=A&hl=en\"> mufon case (23224) map </A>","divs":["sighting detailsat approx 2251 hrs on 5\\09\\10, i walked outside to let my dog out and as i always do i looked up to the night sky to see the stars. i noticed two small dots of light moving slowly from the the south to the north at a medium speed. both objects were directly in line with the other, i initially thought they might be low orbiting satalites but as i watched it appeared as if the second dot of light was being \"towed\" (for lack of a better word) by the first. the first dot of light would move, then a half second to second later the second dot of light would move. i turned around, went back inside to get my wife and turn off the patio light to see better. once we both were back outside i observed both objects make a gradiual left turn and start moving to the northeast and watched as i lost sight of them. i initially thought i lost sight of them due to the lighting conditions but now believe i lost sight due to them gaining in altitude. after losing sight of them i continued to watch the ne sky to see if i could observe anything else. after approx five minutes i noticed a bright star like object in the ne sky become brighter (like a shooting star bright) and move from the ne to the north in a short eratic movement then disappear. i continued watching the night sky for another 20-30 minutes but did not observe anything else. i live with in five miles of the huntsville\\madison airport and 10 miles of redstone arsenal. i have never seen what i witness last night before, i am not saying it\\they were alien ufo's, i am reporting what i observed to see if others reported the same or aid in additional investigations."],"Source":"MUFON","Summary":"I observed 2 star-like high flying objects move from south to north in a medium speed, then turn left towards the northeast. As I watched it appeared as if the second one was being towed by the first. I lost sight then saw bright flash","Date Submitted":"05/10/2010 02:54 UTC","Object Features":"None","City":"Madison","Date of the Event":"05/09/2010 09:51 UTC","Log Number":"US-05102010-0008","Region":"Alabama","Weather Factors":"Does Not Apply","Country":"United States","files":["/var/www/straped/mufon/html2text/23224.html.txt","/var/www/straped/mufon/org/23224.html"],"trends":["There have been 4 other sightings in Madison","There were no other sightings in Madison on or around May 9th 2010"],"Sighting Duration":"Undisclosed","Object Shape":"Flash, Sphere, Star-like","Case Number":"23224","Latitude":"34.705358","Disposition":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Longitude":"-86.741532"}