{"Sighting Duration":"00:15:00","Object Features":"Undisclosed","Disposition":"Unresolved","Weather Factors":"None","Object Flight Path":"Path with directional change","Longitude":"-73.997513","Object Shape":"Bullet, Missile","Log Number":"US-05102010-0012","Source":"MUFON","Viewing Distance":"Over One Mile","Country":"United States","Region":"New York","Latitude":"40.717683","map":"<A HREF = \"http://maps.google.com/maps?q=40.717683,+-73.997513(23228)&iwloc=A&hl=en\"> mufon case (23228) map </A>","Tags":"City","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around March 16th 2010"],"Case Number":"23228","Date of the Event":"03/16/2010 04:16 UTC","City":"New York","divs":["Sighting Detailsi was sitting at my computer with a friend (who was working on his laptop) in my bedroom at home. My apartment is located on the 19th floor of my building and my window has a pretty good view of downtown N.Y.C., so i'm usally looking out the window. I also have a great view over the Hudson River into New Jersey, and i costantly looking into the sky. On this day it was very nice out with the sky clear with no clouds so i had my windows open for fresh air. While working on the computer, i took a minute away from the screen to glance out the window. While looking out, I noticed two parallel lines of smoke in the sky above some buildings about 2-3 miles from where i am. At first, I shrugged it off as clouds in the sky or chimney smoke. Then as I thought about it for a second, I realized that it was a hot day, there shouldn't be any buildings running their heating systems, and at the same time I looked again there were no other clouds in the sky. That's when I looked more clearly and noticed that the objects weren't clouds or smoke. One of the objects started moving away from the parallel formation it was originally in and started drifting away to the left of the other object and at a greater speed. The objects were very far away, but I could still see their outline in the backgrond of the sky. I then told my friend to take a look to see if he could figure out what it was as I began to grab for my digital video recorder. I figured I could see the objects better with the zoom on the camera. At first my friend couldn't see the objects, so I turned on my camera and zoomed in on the object in the sky that was closer in the camera view. While I was doing this, the object that started to drift away at first was now very far from its original position near the other object, and was very far and high in the sky going in the direction towards space, away from the earth. I began to record the other object, which was moving in at its original speed and direction, trying to maintain the focus on it while zooming in. My friend looked at the digital display on my camera and could now see the object as well, but couldn't determine what it was. For the next few minutes, I tried to keep the focus on the object trying to get a closer view with the zoom, but I kept on losing the focus. While continueing to record, the object I was filming seemed to now change its direction as well, and was now drifting to the left, following the path as the other object, but not as fast. I could see that the object was moving at a high speed, but it was far and high in the sky. It was leaving a small smoke trail behind it that was reflecting the glow of the setting sun. I zoomed-in with the camera as best as I could, until I captured the object with the best stil hand I could hold. The objects then disappeared into the sky where I couldn't see them any more. I've seen jet planes, and other things in the sky that I could distinguish before. This object had no blinking lights, and was almost transparent in the sky. I figured it could have been a missle of some sort, but that night, there were no reports of any NASA or military events. I live in New York City, and since the events of 911, I would've thought if there were any activities in the skies above New York, the people would be very aware of things in our immediate atmosphere. Anyway, I have the original footage, but no way to upload it online. I've shown it to a few close friends and they can't figure what it could be. I welcome your expert opinions, and will allow you to view the the recorded event. Feel free to contact me as soon as possible, my information is provided above. Thank you for your time, and hope to hear from you soon."],"Summary":"i recorded two objects flying across the sky at very high speed during a clear day, from my 19th floor bedroom window.","files":["/var/www/straped/mufon/html2text/23228.html.txt","/var/www/straped/mufon/org/23228.html"],"Date Submitted":"05/10/2010 06:45 UTC"}