{"Log Number":"US-05112010-0006","Object Features":"Undisclosed","Region":"Nevada","Disposition":"Insufficient Data","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around"],"divs":["Sighting DetailsTo whom it may concern, For the last 15 months I have been dealing with an alien encounter. The alien life form says they have marooned their ufo somewhere outside the Las Vegas area. They claim to be below ground and I'm aware they constantly lie about everything! They found me and it's my belief they thought I would be easy prey to suit their needs. They have been communicating with a form of implants or hypnosis which I believe as done with light bars of some kind with a yellow, blue-purple origin. I do not think I have mental telepathy abilities and have never underwent hypnosis. This continues day and night with a higher activity late at night continuing until morning with extreme efforts for me not to sleep. When I do, I wake up at all hours with a major headache and a high pitch air noise in my ears and head. There is also pain as if being prodded on both temples and a sharp pin or drill bit on different parts of my cranium. There is a strong feeling of energy being being pulled from my head, feet and body at many times during the day and night. The voices that are very repetitive in words and both male and female with different decibel ranges claim they needs adrenalin or juice or energy and will stop at nothing to take what they want. When I am combative mentally there is some sort of vapor gas that smells like rotten eggs or clorine at times that hits you in the face (mouth nose and eyes) that makes one nauseous and bodt temp increased and diareha follows as well as dizziness and headaches. It's my belief my girlfriend and cats of which I live with have been exposed too. Hot flashes, throwing up, diareha, abnormal activity. These attacks go on at home, on the road while driving, as well as any distance from home even on vacation. They call me their specimenand their acts of aggression have increased to state of complete loss of control. The more we research this weird life form the worse their behavior becomes and they do not seem to have any concept of legal, moral, religious or human understanding od any kind. More like we re toys for their pleasure. I have kept notes and sketches and graphs of the activity. They do something to my ears and temples that causes halucinations mostly in organic mattter and silca or rock landscape. They do appear to have fear and anger. They have their lies about their size, color, shape and origin to the point of no ears, mouth or nose but large eyes and tentacles to breath and taste, and brown ;leathery skin. They have said they have to turn to liquid matter into air and survive in their transportation that brought them here and are stuck, able to come topside only at night but hate sunlight and water. I am a 54 year old male, have always had good health and mind but have undergone a serious back operation in last year and a halfwith titanium and 10 screws, 6 vertibrate fused. They use some technique of piercing the brain and explosive air hitting hard on my injury to cause great pain in my legs and tail bone area. I work out at the health club doing water aerobics to stretch and this seems to cause lots of chaos and retaliation of a nasty design. I refuse to stop or submit to the control they want. I loved being a journeyman glazier for 33 years and I'm now enrolled in college to study criminal investigation for an associates degree since my injury was job related and things have gotten a lot worse to the point oflife threatening. They are very angry, attacking my mind and body constantly. I have never had this type of eperience or abduction threat in my life, nor do I understand or want this attention or experience. It goes from stupid to exotic to dangerous. We are at a loss of what to do and researching data, books etc. but I feel we and I need help from a professional souce and I am in well over my head and fear for myself and my family and well being. I would appreciate a reply and feel desparate and know not what to do. I am will to come to a research center. Thank you and we need to hear from you. David Williams 7955 W Badura Ave. #252 Las Vegas, NV 89113 (702) 364-9230D"],"Date of the Event":"Unknown","Object Shape":"Other","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Latitude":"36.119926","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23238.html.txt","/var/www/straped/mufon/org/23238.html"],"Country":"United States","Viewing Distance":"Unknown","Date Submitted":"05/11/2010 01:50 UTC","City":"Las Vegas","Summary":"See below.","Longitude":"-115.166676","map":"<A HREF = \"http://maps.google.com/maps?q=36.119926,+-115.166676(23238)&iwloc=A&hl=en\"> mufon case (23238) map </A>","Case Number":"23238","Object Flight Path":"Undisclosed"}