{"Region":"New Jersey","Longitude":"-75.027358","Log Number":"US-05102010-0014","Weather Factors":"None","Disposition":"Unknown","Case Number":"23230","City":"Knowlton","Object Shape":"Star-like, Other","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"None","Viewing Distance":"Over One Mile","divs":["Sighting Details~A close friend and I were outside smoking cigarettes when a bright object in the sky caught our attention. This was at approximately 20:50 EST. The object appeared to be just a very bright star at first-- which was what caught our attention. It was later determined to be moving, however, after a closer study. ~A few points to supplement this assertion are: 1) object was eclipsed momentarily by tree limbs at several points and but would always return to open sky, as perceived from our position in front of my house. 2) it flickered as it moved back and forth along the horizon and in circular or arc-shaped, sweeping motions to and fro. 3) the object's light would dim after it reached the peak of its arc-maneuver and hence begin to move in the opposite direction, and would brighten considerably when facing us. the path of the light's beam could be seen when facing from side to side. 4) once in awhile, the light would juke every which way and at odd combinations of sharp angles, in short bursts of incredible speed. ~It at first seemed to be hovering over one point but we found the object to be maneuvering away from our position, as it eventually disappeared over the horizon. We were both compelled by strange, anxious feelings for the duration of the sighting. ~ We repeatedly had to back up to keep the object in our view and actually had to move to my second-story balcony for the last ten minutes of the event, as if hypnotized to stare at this weird light until it could no longer be viewed. This was at approximately 21:19. ~ I attempted to signal the object with a MAG-light-- in numeric combinations of numbers counting down from three-- but to no avail. At one point, I attempted to use the 75-watt bulbs in the balcony lights as well. But still, the object retreated. ~I judged the object to be three miles away at first and was gone forty minutes later, still moving in the direction of the Delaware Water Gap. This thing was very bright and very noticeable; I would find it hard to believe that nobody else saw it besides the two of us."],"Date of the Event":"05/10/2010 09:00 UTC","files":["/var/www/straped/mufon/html2text/23230.html.txt","/var/www/straped/mufon/org/23230.html"],"Sighting Duration":"Undisclosed","Latitude":"40.930895","map":"<A HREF = \"http://maps.google.com/maps?q=40.930895,+-75.027358(23230)&iwloc=A&hl=en\"> mufon case (23230) map </A>","Country":"United States","Source":"MUFON","Date Submitted":"05/10/2010 10:30 UTC","Summary":"Strange light in the sky...","trends":["There have been no other sightings in Knowlton","This sighting has never been favorited."],"Tags":"City"}