{"Country":"United States","Summary":"I saw a moving star.","Log Number":"US-05112010-0001","Region":"Virginia","Object Shape":"Star-like","Latitude":"38.454539","City":"Harrisonburg","Case Number":"23233","Longitude":"-78.865156","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.454539,+-78.865156(23233)&iwloc=A&hl=en\"> mufon case (23233) map </A>","files":["/var/www/straped/mufon/html2text/23233.html.txt","/var/www/straped/mufon/org/23233.html"],"Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"05/08/2010 11:00 UTC","trends":["There have been 5 other sightings in Harrisonburg","There were no other sightings in Harrisonburg on or around May 8th 2010"],"Date Submitted":"05/11/2010 12:20 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsI was on my break from work, outside eating my lunch. This was at night during graveyard shift. I looked up into the sky and admired the stars at night. I saw several different stars, and one that I thought was Mars. I told myself, wow Mars is bright tonight. I ate my lunch, and then lied on the ground because of being tired while looking up at the sky. The star that I thought was Mars looked as if it was moving. My eyes gazed upon it, and it was moving in a very unpredictable zig zag motion. I thought that it may be a airplane, but airplanes don't stop nor zig zag as they would crash. I thought maybe a helicopter, but choppers do not look like Mars nor be that high up into the sky. The star would zig zag, stop in mid flight, and then turn in the complete opposite direction. The star was fixed in the sky while I was eating, but the minute I laid on the ground, it started moving. It seemed to know that I noticed it. It would sometimes circle, go back and forth, and then stop in midflight. No sound, nor any sign of any fuel propultion system. As I was watching it more closely, I thought well maybe a satelite. But an orbiting satalite does not zig zag. I admired it for a little while, but then I had to return to work. On my second break, the sky was more hazy and all of the stars could not be seen. I laid back down again, and saw another star. This star was fixed, but did show up through the haze. I be darned, that star the started doing the same motion. I laughed at myself, and thought why do I make stars move. I shined my cell phone light up at it, but did not seem to get any response. The star did not look like Mars on the second break. It looked like a normal star light years away. But as this star started dancing, it got the Mars orange tint to it again. In my opinion, it was was either in space or at the edge of earth's atmosphere. I think it was a technology that we do not have that I am aware of. Looking up into the sky, nobody would have noticed it at all. It fit into the whole sky. I would not have noticed either, until it started moving. When I came to my belief that it was something from space, I thought that they were using it to see what us earthlings are doing. It wanted to be under cover. I think people who look for UFO's expect to see lights, triangles, or saucers, but does not think a star would be a UFO. It was like a secret camera fixed to watch us in our normal day to day lives. The spies new that if the came in their ship, then there cover would be broken. It reminded me of like a probe driod from Star Wars. I am a believer in alien life way before this event. I admire Bill Birnes and the UFO Hunters. I have a bachelor's degree in psychology, and I am aware of all of the hullicinations and sometimes mind tricks. But this was as clear as a bell. So it was no suprise to me to see a real extrordinary event. This was my first UFO sighting, so it confirms in my mind that we are not alone."],"Source":"MUFON","Sighting Duration":"00:30:00","Weather Factors":"Unknown"}