{"Latitude":"33.728944","Summary":"Bright blue light in sky that appeared to be falling, then rose back into sky.","map":"<A HREF = \"http://maps.google.com/maps?q=33.728944,+-116.371316(23235)&iwloc=A&hl=en\"> mufon case (23235) map </A>","Country":"United States","Disposition":"IFO","Viewing Distance":"Over One Mile","Weather Factors":"None","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI was sitting outside and looking towards the sky when suddenly I saw a meteor falling. Problem is that it was bright blue. I stood up because it was so bright I thought there may be an impact. As I got up I saw the light climbing back into the sky. Straight up. I then thought it was someone shooting fireworks until it started moving abnormally and then started moving off to the North. At this time I ran into the house and got my wife, who also observed the object as it was moving off in a north, northwest direction. There were no other color or flashing lights or sounds, and it was very blue in color. The most remarkable thing was the rate of decent and ascent. It was moving as quickly as a meteor at first until it dropped out of sight behind the houses across the street. As it rose back into the sky it was moving erratically, then moved off almost straight and level. I estimate this object to have appeared approximately two miles from my position. I'm still not sure I believe my own eyes, save for the fact my wife observed the object as well. It will be interesting to see if anyone else saw anything out there tonight. I know there were several airplanes in the vicinity and should have been able to see the object."],"trends":["There have been 8 other sightings in Palm Desert","There were no other sightings in Palm Desert on or around May 10th 2010"],"Date of the Event":"05/10/2010 09:27 UTC","Object Features":"None","Region":"California","Log Number":"US-05112010-0003","Longitude":"-116.371316","Source":"MUFON","Case Number":"23235","Date Submitted":"05/11/2010 01:13 UTC","Object Shape":"Circle, Sphere","Sighting Duration":"00:02:00","City":"Palm Desert","files":["/var/www/straped/mufon/html2text/23235.html.txt","/var/www/straped/mufon/org/23235.html"],"Tags":"City"}