{"Latitude":"39.965216","Date Submitted":"05/11/2010 09:08 UTC","Weather Factors":"Windy, Does Not Apply","Case Number":"23246","Longitude":"-82.991744","Tags":"City","Log Number":"US-05112010-0014","Source":"MUFON","Object Flight Path":"Path with directional change","Summary":"Three or four rows of brightly colored lights as bright as a star that changed into a boomerang shape with different colored lights","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around May 11th 2010"],"Country":"United States","Disposition":"Insufficient Data","Date of the Event":"05/11/2010 02:00 UTC","Region":"Ohio","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/23246.html.txt","/var/www/straped/mufon/org/23246.html"],"divs":["Sighting DetailsI was driving home from Ohio State University -heading West on a main street (Bethel Road) towards my house. I was about 15 minutes away from home. It was an overcast sky (no rain at the time but had been raining all day) but in the distance, about a mile ahead and hanging low in the sky was what looked like a star from a distance, almost stationary in the sky. As I got closer I observed that it was actually rows of lights like a set of football stadium lights (and exactly that bright). I was one of the only cars and the road and was surprised to see something that bright in the background of an overcast, dark sky. The object also appeared to be moving but slowly more to the North West. I thought perhaps I was just mistaking light poles in parking lots (this was in the suburb with strip mall parking lots to my right) but as I drove the object persisted. Almost stationary but moving slowly; parallel to my path. I lost sight of the object as my visibility was obscured by trees but was surprised to see it again as I got closer to my house. At that point I was able to observe it just above a row of apartments (there was no send of engines) -perhaps a three or four miles up, without the lights of other business to obscure the view. This had gone one for just over five minutes when suddenly the object's path switched direction and shape -it shifted to a kind of boomerang shape (except I couldn't make out a distinct shape, just a different configuration of lights). About half of the lights dimmed and about three red blinking lights appeared and it moved quickly in the opposite direction (directly East). I then lost sight of it. I was a Captain in the Air Force and in addition to working around planes for years, observe planes coming and going in the night sky around my house all the time. I've never seen anything quite like this."],"Object Shape":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.965216,+-82.991744(23246)&iwloc=A&hl=en\"> mufon case (23246) map </A>","City":"Columbus","Viewing Distance":"501 Feet - 1 Mile"}