{"trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around May 10th 2006"],"Tags":"City","Date Submitted":"05/11/2010 11:09 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23247.html.txt","/var/www/straped/mufon/org/23247.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, Unknown","Date of the Event":"05/10/2006 08:30 UTC","Country":"United States","divs":["sighting detailsthese have been occurring over the past weeks. they look almost like stars but are slightly discolored or over colored and they stay stationary for a while and then you can start seeing a slight movement then speed up and appear to go up away from earth towards upper atmosphere and disappear. the latest happen on monday 5\\9\\10 it was in the northwest section and i thought it was a star at first but it was way to bright and way to big where you could see it point out at the edges like a star shape slightly registering intensity and stayed staionary with a slight dip down after a 1 1\\2 hours towards the horizon. it might have been something orbiting the earth manmade (never saw this before) but it was definitely not a plane or helicopter did not know if anyone else has seen it. to see something that bright in the city is weird because of the light sources from all the buildings and street lights and cars. last night walking the dog at 11:00 p.m. saw another star speed up and looked like it was going straight up into the sky again. is anyone else seeing this? i have a picture with points of reference as to where the stationary bright light was so it can be identified with known stars or anything orbiting the earth if interested or rule that out as a possibility.."],"Disposition":"Unknown","Latitude":"39.298135","Log Number":"US-05112010-0015","Source":"MUFON","Object Shape":"Star-like, Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=39.298135,+-76.604719(23247)&iwloc=A&hl=en\"> mufon case (23247) map </A>","Region":"Maryland","Object Features":"Undisclosed","Longitude":"-76.604719","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Summary":"Several mysterious lights upward projectory non blinkinking single lights disappearing like going up towards sky.","Case Number":"23247","City":"Baltimore"}