{"Viewing Distance":"Over One Mile","Weather Factors":"None","divs":["sighting detailsfirst off aliens from other planets are real they are all over our\\their? planet. if you are a skeptic then you are a narrow minded barbarian that believes everything you've ever heard. ocassionally i will look for ufos as a recent hobby and have seen some compelling evidence. its amazing what you will see when you look up at the stars all night long night after night. since i am a night owl i have recenty been spending anywhere from 2 to 5 hours looking at the stars each night. i use a combination of a led high powered flash light and a 90 mw green laser pointer to signal or attract anything i can. well i'll speak about the latest sighting. i went to my brothers house in cockeysville maryland i told him about the stuff ive been seeing so he wanted to try too. we went out to a spot away from the street lights of his neighbor hood on a hill and started playing around to attract a ufo my brother decided to shine the laser on a low motionless star far in front of us(he said it looked out of place) then he screams its moving i look and it is true a star that has been sitting there for god knows how long starts moving towards us but to the right of us the object was some what low in the sky and still looks like a star but its moving right after we shined it with the green laser! after about 55 seconds it starts to go transparent but i could still see the light but it went from solid light to see through light to completely invisible and disapearred. he always told me that he has been seeing weird things there at his new apartment but i never really believed him till now i always thought he overacted but this was freaking realllllllllllllll@!!!!!!!!!!!!!!!!!! we were excited at the time it was happening but then stopped caring like it wasnt a big deal i mean what else can we do the event was over there is nothing left to talk about or be excited about plus we have seen much cooler stuff recently and in the past. i would recommend getting a green 90milliwatt laser or better yet more powerful and use morse code and shine stars and make your own signals basicaly draw attention to your self and you will see some stuff if you keep at it. dont shine them at airplanes though that is illegal im pretty sure mufon should bring some equipment out here because the stuff we are seeing is pretty weird and cant be from humans there are tons of different species of aliens out in our or their airspace all the time you just have to get there attention or annoy them enough please call me and send someone out you might just be able to catch something on camera its a hot spot i think maybe it has to do with the mile deep mine which is just one big hole but a mile deep timonium,cockeysville, hunt valley, and monkton, maryland has a lot of activity going on!!!!!!!111 oh the craft moved slowly and steady then gradually faded out into nothing you could tell it was making itself transparent deff not turning off lights solid light then seethrough lights then even more faded light then nothing and also i forgot to mention that there wasnt a cloud in tyhe sky at all"],"Object Flight Path":"Hovering then path","Date of the Event":"05/11/2010 11:20 UTC","Latitude":"39.490001","Country":"United States","Summary":"Laser Induced Movement Of Low Star like Object The Moved And SlowlyFaded To Invisible","Longitude":"-76.658507","Region":"Maryland","Object Shape":"Star-like, Unknown","Tags":"City","City":"Cockeysville","Sighting Duration":"00:01:00","Source":"MUFON","trends":["There have been 4 other sightings in Cockeysville","There were no other sightings in Cockeysville on or around May 11th 2010"],"Disposition":"Unknown","Date Submitted":"05/12/2010 01:20 UTC","Object Features":"Unknown","Log Number":"US-05122010-0001","map":"<A HREF = \"http://maps.google.com/maps?q=39.490001,+-76.658507(23248)&iwloc=A&hl=en\"> mufon case (23248) map </A>","Case Number":"23248","files":["/var/www/straped/mufon/html2text/23248.html.txt","/var/www/straped/mufon/org/23248.html"]}