{"Weather Factors":"Unknown","Tags":"City","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around June 3rd 2003"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.389816,+-118.564229(2324)&iwloc=A&hl=en\"> mufon case (2324) map </A>","Sighting Duration":"00:05:00","Longitude":"-118.564229","Log Number":"","Summary":"Silver aluminum cylinder hovering.","Source":"MUFON","Region":"California","Object Features":"Unknown","City":"Santa Clarita","Date Submitted":"06/03/2003 12:13 UTC","divs":["Sighting DetailsI was exiting the 5 freeway north at Valencia Blvd. in the City of Valencia,California. I was viewing a construction site to the west of the intersection asit appeared to have something hanging high over it. The object was at a heightthat was far too high for a crane, but not high enough for an airliner. About1,500 feet altitude. The object was like a 727 airliner without wings or a tail.I watched it as I turned eastbound onto Valencia and it remained stationary inthe air. I figured that the stationary illusion of the craft was a product ofreflection of the sunlight. However, it remained. I looked for a tail and wings,but it was apparent that there were none. I cannot guarantee that glare did notblock out these aspects. However, the odd thing was that the object remainedstationary.I am a practicing attorney who has absolutely no incentive to be labeled as someUFO freak and an amateur astronomer. Though I wear glasses, my corrcted eyesightis excellent.The morning gloom had burned off and the sky was hazy. In astronomy terms, theseeing was probably a 62B to 72B. There were no cloud formations in the sky.The object remained as such for approximately a minute and a half. After Iturned, I still had a visual on it. i looked forward, then back and it was gone.It was no where in the sky.This observation should probably be used as corroboration of any other versusprima facie evidence of a sighting."],"Case Number":"2324","Object Shape":"Cylinder","Object Flight Path":"Stationary","Date of the Event":"06/03/2003 12:13 UTC","Latitude":"34.389816","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/2324.html.txt","/var/www/straped/mufon/org/2324.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile"}