{"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 3rd 2003","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=32.725229,+-117.155635(23243)&iwloc=A&hl=en\"> mufon case (23243) map </A>","City":"San Diego","Object Shape":"Circle","Longitude":"-117.155635","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Tags":"City","Summary":"Best photograph of a real ufo I've ever seen or heard of, also have a video of the incident, witnessed by myself and a friend,and all over the news the next day!","Region":"California","divs":["Sighting DetailsI have told this story years ago, I had problems I choose not to explain, locked all my photos in my safe, everything was stolen in my house,including my safe but I had a CD in a hidden compartment. The object I have on video was simply amazing to see it fly east of us and capture all of this on video as well, I think the photos speak for themselves. Never believed in Ufo's till that night, my girlfriend as well. I did some research and yet to find photos that compare to what I have. I saw air crafts and helicopters going to the object and the ufo dwarfed them in size. The colors were amazing, at least 5 different colors and 1 red color spinning clockwise when moving. There also was a mother ship as well, if you want those photos, e mail me that you wish to see them, I'm reluctant to send all the pics as of now!! Nick condos"],"files":["/var/www/straped/mufon/html2text/23243.html.txt","/var/www/straped/mufon/more/23243_submitter_file1__001410x8C_0006.jpg","/var/www/straped/mufon/more/23243_submitter_file2__001410x8C_0005.jpg","/var/www/straped/mufon/more/23243_submitter_file3__001724x24cropxC_0008.jpg","/var/www/straped/mufon/org/23243.html"],"Latitude":"32.725229","Date of the Event":"10/03/2003 08:15 UTC","Disposition":"Unknown","Date Submitted":"05/11/2010 05:27 UTC","Weather Factors":"Unknown","Log Number":"US-05112010-0011","Object Features":"Unknown","Country":"United States","Source":"MUFON","Case Number":"23243","Sighting Duration":"01:00:00"}