{"Case Number":"23241","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Star-like","City":"Havre","Source":"MUFON","Longitude":"-109.6765","Summary":"object shot across sky and stopped","map":"<A HREF = \"http://maps.google.com/maps?q=48.554618,+-109.6765(23241)&iwloc=A&hl=en\"> mufon case (23241) map </A>","Tags":"City","Log Number":"US-05112010-0009","Region":"Montana","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/23241.html.txt","/var/www/straped/mufon/org/23241.html"],"Date of the Event":"05/10/2010 11:20 UTC","Date Submitted":"05/11/2010 04:04 UTC","divs":["Sighting DetailsAt approximately 23:20 I went outside to have a cigarette, it was a nice clear evening and the stars were shining. I was looking at one star that seamed to be very bright to the west of me when what I thought was a star next to it shot off heading North East. It moved VERY fast for about five seconds, I thought it was a shooting star, but then it just stopped. It did not have any flashing lights like an airplane, it just looked like a star. It continued to shine from its new location, I figured I must be really tired and just seeing things, so I put out my cigarette, went inside and went to bed. This morning on the news I heard that the local police had gotten dozens of calls about a large explosion around 23:00 last night. The local radio station(KPQX) reported that the Montana Air National Gaurd had been conducting routine training manuvers using two F-15 fighters over Havre with their afterburners on which created a Sonic boom. They also said they would be conducting more training excercises over the next few days and that they were sorry, that they didn't mean to scare anyone and that they would try to make sure it didn't happen again. A Major with the MANG added that certain atmospheric conditions contributed to the sonic boom reaching the ground. I do not know exactly what it was I saw last night, but I promise you it was NOT an F-15."],"Object Flight Path":"Path then hovering","Disposition":"Unknown","Country":"United States","trends":["There have been 2 other sightings in Havre","There were no other sightings in Havre on or around May 10th 2010"],"Object Features":"Unknown","Latitude":"48.554618"}