{"Source":"MUFON","Viewing Distance":"Unknown","Date of the Event":"05/05/2010 10:30 UTC","Region":"Utah","Country":"United States","Weather Factors":"Unknown","Object Features":"Unknown","Case Number":"23251","Summary":"Two white lights almost collide than zip apart, one eastward one westward.","Sighting Duration":"Undisclosed","Latitude":"38.582376","Tags":"City","City":"Moab","divs":["Sighting DetailsMe and my three kids were out on vacation. We stoped at Thompson springs, Utah. It was getting late so we camped in the mouth of the canyon with plans on seeing the petrogyphs the next morning. We set up the tent and when we finished it was dark. My 14 year old was playing with a powerfull green lazer. He was shining it on the canyon walls and up in the air seeing how far it would go. It went milels. He would throw dirt in the air and wave the lazer through it and make cool designs. when we were finished, we started to check out the stars. We were pointing out all the sattlites we could find. Than I looked up tward the south and saw two lights a bit bigger than the sattlites (I judged them to be closer to the earth than the sattlites) comming tward each other north ward and mostly vertically (if I stuck my hand up they would be about six inces apart and and closing fast.) and almost collided I yelled to the kids \"look Ufo's\" and pointed to them. When they almost collided one on the right was slightly northward of the other one and then they zipped apart horizontally. The one on the right zipped off to the west and behind a cloud and the other one tward the east. they were traveling in a very smooth deliberate mannor, much faster and closer than the sattlelites we were watching. I know what we were watching was out of the norm. Nothing I know of behaves this way other than UFO's (this is the second sighting in my life thus far.) the one that went west we didn't see again. We watched the other one on the east side for a while longer and then it went behind a cloud and we could still see it faintly then it disapeared. I saw another light that I belived to be the same one that came back out of the cloud tward the south again and flashed a couple of times than disappeared. the whole experience lasted for about a miniute. The kids didn't want to go to sleep. they thought that aileins were going to abduct them. I reassured them that I had the gun with me and they would be safe. They felt better and did go to sleep. In the morning we cheked all around for any tracks that were not ours and found none."],"Object Shape":"Star-like","Log Number":"US-05122010-0004","trends":["There have been 13 other sightings in Moab","There were no other sightings in Moab on or around May 5th 2010"],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/23251.html.txt","/var/www/straped/mufon/org/23251.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.582376,+-109.54343(23251)&iwloc=A&hl=en\"> mufon case (23251) map </A>","Longitude":"-109.54343","Disposition":"Unknown","Date Submitted":"05/12/2010 03:57 UTC"}