{"Weather Factors":"None","Viewing Distance":"Unknown","Case Number":"23269","trends":["There have been 13 other sightings in Peoria","There were no other sightings in Peoria on or around May 13th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.585866,+-112.233178(23269)&iwloc=A&hl=en\"> mufon case (23269) map </A>","Source":"MUFON","Date of the Event":"05/13/2010 06:51 UTC","Disposition":"IFO","Sighting Duration":"Undisclosed","City":"Peoria","Region":"Arizona","Summary":"Large luminous Orb","Latitude":"33.585866","Object Shape":"Oval, Sphere, Star-like","Log Number":"US-05142010-0003","Tags":"City","Date Submitted":"05/14/2010 01:41 UTC","Longitude":"-112.233178","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsAround 6:45am I was getting my kids ready for school when I noticed from my kitchen window a beautiful rainbow colored ring around the outermost edges of the sun. About 6 minutes later I had very strong nudge suggest I get my camera phone and take some pictures of this. Which I did. While I was reviewing the photos I saw the bright orb slighty above the sun. I showed my husband the pictures. He was confident that there is a logical explanation for the orb in the pictures. If someone could tell me I would like to know what it is. I think it's important to mention that I was about to dismiss the whole thing as some kind of natural phenomenon, when I felt for a second time I felt a very strong nudged to go outside and take more pictures. As if to reconfirm for me that which I was beginning to doubt. If you look closely to the picture taken at 7:16.08 you will notice the orb just passing in front of the sun on the bottom right. The other photos show the orbs path. I could not see the orb with the naked eye. I just held out the camera in the direction of the sun and took the pictures with my eyes looking down. I have other photos that I took of my own direction and they do not show anything unusual. I felt really excited I was looking and asking for some personal conformation. I've had some interesting encounters but I've always been able to discredit the experience in my mind. This gives me something tangable. Charity"],"Country":"United States","files":["/var/www/straped/mufon/html2text/23269.html.txt","/var/www/straped/mufon/more/23269_submitter_file1__2010-05-1307.16.30.jpg","/var/www/straped/mufon/org/23269.html"]}