{"Summary":"roundish radiating bright orange glowing orbs","Longitude":"-106.951789","Date of the Event":"05/07/2010 08:55 UTC","Region":"Wyoming","Disposition":"Unresolved","Date Submitted":"05/13/2010 06:26 UTC","Object Shape":"Sphere, Unknown","Tags":"City","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Viewing Distance":"Unknown","Sighting Duration":"00:15:00","Latitude":"44.800234","Case Number":"23263","Country":"United States","files":["/var/www/straped/mufon/html2text/23263.html.txt","/var/www/straped/mufon/org/23263.html"],"Object Features":"Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.800234,+-106.951789(23263)&iwloc=A&hl=en\"> mufon case (23263) map </A>","trends":["There have been 4 other sightings in Sheridan","There were no other sightings in Sheridan on or around May 7th 2010"],"City":"Sheridan","Log Number":"US-05132010-0011","Source":"MUFON","divs":["Sighting DetailsWe arrived at home at approximately 9:00pm on Friday May 7th to find one of our neighbors out on the sidewalk very excited and urging us to come over quickly to her and verify that she wasn't seeing things. She immediately had us look up to the sky to west and we witnessed two very bright orange glowing objects that were traveling in a southernly direction. The objects traveled for a few seconds and then stopped still. I ran into the apartment to get my binoculars and came out to scope these objects out. They were hard to make out much detail other than they were very bright and glowed orange. I was not real steady with the binoculars and could not really see any defined body shape. After a few minutes one of the objects just disappeared from where it was stopped. The other object stayed in place and then it disappeared. My neighbor said she counted nine of the objects when she first noticed them and after a few minutes one or two of the objects would disappear and this went on until we arrived on the scene with only two of the objects remaining. My neighbor indicated that they traveled to the east and then back to the west and then went in the southern direction after we arrived. We tried to determine what they might have been. They were not aircraft, fireworks, weather balloons, meteors, and they made no sound whatsoever. They were nothing that we had ever seen before. Upon first viewing these things the hair on the back of my neck was standing straight out and my heart rate was high as I had never experienced anything like this before. We kept looking for them to reappear but never saw them again. An interesting note was that I told my father about them and he said he was driving home from a friends house at about the exact same time and he said that he spotted two of these objects as well and could not figure out what they were either. It was twilight with some daylight remaining but with Venus showing clearly as the brightest star in the sky. These objects were much larger than any possible star, plus moving and glowing orange all the while until they disappeared"]}