{"Country":"Canada","files":["/var/www/straped/mufon/html2text/23265.html.txt","/var/www/straped/mufon/org/23265.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.296233,+-116.962996(23265)&iwloc=A&hl=en\"> mufon case (23265) map </A>","trends":["There have been no other sightings in Golden","This sighting has never been favorited."],"Object Flight Path":"Other","Disposition":"Unresolved","Region":"British Columbia","Object Features":"Wings","Tags":"City","Object Shape":"Triangle","City":"Golden","Log Number":"CA-05132010-0013","Summary":"STRANGE Brick red stealth bomber-esque UFO in Golden","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"23265","Latitude":"51.296233","Date Submitted":"05/13/2010 09:04 UTC","divs":["sighting detailsmy then boyfriend worked in golden, b.c. as a security guard for a construction site. he only worked nights so i would visit him and we'd lay on the roof of this building and star gaze. one night around 3am, we both heard an abrupt clapping sound and a few feet from where i was originally staring at brick red triangle appeared out of nowhere. it wasn't shining like a light but it was glowing and was a definite burgundy\\brick red color. this thing looked exactly like a stealth bomber and was flying around the same level as a common bird would fly. it wasn't too high (or at least didn't look like it was), it seemed pretty close (or it was rather large but quite a distance away). anyways, this thing was flying with the peak of the triangle in the direction it was flying, and the left and right points were almost parallel with the ground and sky. i would say it was leaning at a 70 degree angle if that makes any sense! as soon as it appeared it slowly moved across the nights sky at such an abnormal pace.. too slow for a plane, too fast for a bird.. after 5 seconds of this it there were two of them.. and it looked as if there was another one right behind it so perfectly aligned that we couldn't tell that there were two, but this thing up and infront of the original pretty quickly and instantaneously they started doing rapid coordinated flight patterns. the best way to describe it would be the light from a flash light, if someone were to wave their arms around frantically, the light would be jumping around in a violent, jerky way yet both of them remained flying together, the perfect distance apart. this lasted for 3 seconds and they stopped abruptly, flew parallel next to each other and continued the original pace for 5 seconds or so and then disappeared into the sky, not behind a tree or anything.. but disappeared from our eyes from the nights sky.. and without a sound unlike when it first appeared! this ufo flight didn't take utilize too much space either, if you were to outstretch your arms it would be a 2 foot span from your perspective in the sky."],"Viewing Distance":"Unknown","Date of the Event":"07/31/2006 03:00 UTC","Longitude":"-116.962996"}