{"map":"<A HREF = \"http://maps.google.com/maps?q=33.451302,+-94.028348(23266)&iwloc=A&hl=en\"> mufon case (23266) map </A>","Sighting Duration":"00:15:00","Longitude":"-94.028348","Case Number":"23266","Region":"Arkansas","Object Flight Path":"Undisclosed","Log Number":"US-05132010-0014","Object Features":"None","Date Submitted":"05/13/2010 11:13 UTC","Country":"United States","City":"Texarkana","Latitude":"33.451302","divs":["Sighting DetailsI am writing to notify you that I may have had another encounter. Two nights ago myself and two other friends went sky watching out in the boonies. At one point we saw a three light formation very distant on the horizon through binoculars. We all got really spooked. While driving out I was in the back seat looking into the fields. I noticed a bight object on the ground and we all got scared and my friend hit the gas. On the way back towards highway 82 the object seemed to get brighter and lift off the ground. We hauled ass and finally got to the highway and I remembered we had a video camera so I convinced my friend to go back so I could get it on film. It felt like it took forever to get back to the highway but the distance back to the object seemed much much shorter. We finally got back to it and parked in front of it. We all saw a bright white light casting a glow on the ground directly to the right of a dramatically smaller seemingly reddish light. To the left there appears to mabye be an even smaller light close to the ground moving around. Throughout this experience the lights brightned dimmed turned off turned on and even multiplied and we have this all on film. When the lights multiplied we got the he'll out if there and I managed to film it as we were leaving and the object seemed to actually pace us because it neither grew smaller or more dim as we high tailed it out if there. I can't exactly remember what happened next but I remember when we finally got away the object was completely elsewhere. I have some freeze frame stills from the original footage that I will email you but to get the full scenario I will try to convert in the next day or so. The original footage was shot with a Sony mini tape recorder type camera. Basically a mini-VHS. We recorded a copy to VHS and took frame samples from them. The pictures I'm about to send only cover a minor detail of the whole event so as soon as I make a digital copy I'll email that to you as well. I don't own or possess the original but if my friend consents to being contacted then you will have access to the original. On another note, Today my massouse noticed a scar on the small of my back that I can't account for. I haven't had any kind of cuts or anything there and the only time I can honestly remember having that kind of pain is when I went to st Louis to my ex girlfriends and woke up with the pain in my back and conciously observed the \"entity\" in the door way. I'm still not sure what to make of all of this. I can't sleep, I'm terrified of being alone, especially at night and I never FEEL alone. I always feel like I'm being watched or there is someone near me. I stay at work after hours to get caught up and Ive heard un accountable shuffling noises, grunts and coughs and moving objects. I have no clue what they are or what's causing them but I am honestly in constant fear nowadays. I thought about going to a psychiatrist to get it off my chest but they probably wouldn't take me seriously and wind up doping me up on Prozac or something. Please see what you can make if this mess, it's driving me nuts! Thank you and I really appreciate your efforts!"],"Date of the Event":"05/09/2010 09:00 UTC","trends":["There have been 4 other sightings in Texarkana","There were no other sightings in Texarkana on or around May 9th 2010"],"Weather Factors":"Does Not Apply","Viewing Distance":"Unknown","Summary":"2 friends and myself went for a ride when we gaqme across a UFO. We left immediatly but returned when I remembered the video camera.","files":["/var/www/straped/mufon/html2text/23266.html.txt","/var/www/straped/mufon/org/23266.html"],"Source":"MUFON","Tags":"City","Object Shape":"Flash, Oval, Star-like, Triangle","Disposition":"Hoax"}