{"Object Flight Path":"Undisclosed","Case Number":"23277","Country":"Vietnam","Longitude":"108.704498","Latitude":"15.40871","Disposition":"Unresolved","Log Number":"VN-05142010-0011","Weather Factors":"Unknown","Date Submitted":"05/14/2010 11:32 UTC","Viewing Distance":"Unknown","Object Shape":"Sphere","Object Features":"Undisclosed","City":"chu lai","divs":["Sighting Details My outfit (a Marine Hawk missile battalion) had been setting up camp on the beach near Chu Lai, which is about 25 miles southwest of Danang. I was assigned a machine gun emplacement (we had to provide our own defense). It was about 5 or 6 in the evening. There were a series of long and quite tall sand dunes at our back and our machine gun emplacement was at the end and on top of one of these dunes.I had my rifle over my shoulder,just waiting for my men to show up and man the bunker. Was standing looking across this field toward where the woods began (in between two dunes). All at once I noticed a black speck at about a 23 degree (approximate) angle from the ground. It grew larger and larger and never wavered from that angle until it seemed to be a black sphere, about a mile or two away. It was about the size (at that distance) of a dime but of course,from that distance it could have really been quite large...I estimate about 20 feet or so in actual diameter. It just set there for about 2-3 minutes, then it seemed (slowly to move away, at that same 23 degree angle. When it stopped and hovered I thought about shooting at it with my m-14 rifle, but I thought, well, what if it shoots back or whatever. I was not scared but fascinated. I thought about reporting it to my c.o., but I did not want him to think I had lost my mind or that I was trying to get out of my wartime service. I don't know of any devices or aircraft that could make the moves this object made...not even a helicopter could move in such a way, in my opinion. I have done some research, and the only similar incident reportedly happened in Germany in the 1600's, at which time, folks reported seeing multiple black spheres, but I do not remember what the article said about how such spheres behaved. Unfortunately, I had no cameras at that time."],"Date of the Event":"10/03/1965 12:00 UTC","trends":["There have been no other sightings in chu lai","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/23277.html.txt","/var/www/straped/mufon/org/23277.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"preparing for guard duty. Looked across a field towards beginning of woods. A black speck appeared...grew into sphere..hovered for a while then backed away and vanished","Region":"Quảng Nam Province","map":"<A HREF = \"http://maps.google.com/maps?q=15.40871,+108.704498(23277)&iwloc=A&hl=en\"> mufon case (23277) map </A>","Tags":"City"}