{"Source":"MUFON","trends":["There have been no other sightings in Ft Walton Bch","This sighting has never been favorited."],"Region":"Florida","City":"Ft Walton Bch","divs":["Sighting DetailsThis Case was imputed by Morgan Beall, MUFON Field Investigator 12273. Spoke to case number 23268s father. Primary witness was a air force pilot for the majority of his life and has never seen anything like it. Spoke to primary witness who witnessed a object at Cape Canaveral Beach in 1964 with a date. Described it as a steel ball like a steal barring. It had two rings one horizontal the other vertical. Color of the rings were yellow green fuzzy color. At arms length the object was about the size of a tennis ball. He noticed the object due to the silence that occurred at the beach area. Looked up and saw the described object. All the people on the beach area were all silent and starring at the object. The object then took off straight up in seconds. The primary witness then described the reaction of the people on the beach as not alarmed but were described as zombie like and all of them began to walk out of the beach area, get in their cars and leave. Even a vendor attached his cart to his vehicle and calmly got in his vehicle and drove off. Ray and his date followed soon after."],"Disposition":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.416507,+-86.640684(23273)&iwloc=A&hl=en\"> mufon case (23273) map </A>","Viewing Distance":"Unknown","Summary":"Saw a chrome Sphere with yellow green rings above us at the beach north of the Cape.","Object Features":"Undisclosed","Date Submitted":"05/14/2010 09:04 UTC","Weather Factors":"None","Longitude":"-86.640684","Country":"United States","Date of the Event":"11/30/1963 12:00 UTC","Case Number":"23273","Object Flight Path":"Stationary,Other","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/23273.html.txt","/var/www/straped/mufon/org/23273.html"],"Log Number":"US-05142010-0007","Tags":"City","Latitude":"30.416507"}