{"Log Number":"NO-05142010-0008","Object Features":"Undisclosed","Source":"MUFON","Region":"Troms","Country":"Norway","Object Flight Path":"Undisclosed","Longitude":"18.961344","Object Shape":"Triangle","Case Number":"23274","Weather Factors":"Unknown","divs":["Sighting DetailsI was watching a movie on my computer that I have hooked up to my TV in the living room. It was late, so I was very sleepy. All of the sudden my TV went stone black. A big bright light flashed through my living room, very slowly. I jumped up from my couch and walked over to the window thinking it was another failed Russian missile like the one I saw last year on my way to work. It was very bright, so bright that in at first I couldn't see anything, because the light was blinding me. Then it moved over to the building on my left and started flashing lights into my neighbors apartment. That's when I thought of getting my camera, I ran into my bedroom and got it. I wasn't able to turn it on,none of my electronics worked until 20 minutes after it was gone. It continued to flash a bright light into at least 7 more apartments, as far as I know. Sort of looked like it was searching for something, maybe ever scanning the apartments. It didn't make any noise at all. The light was almost like the ones you see on lighthouses, only it had a hint of red and was much brighter. The object itself was a slim triangle, with 4 \"spikes\". Three on top, one very small under where the source of the light was coming from. Seemed like if it was landing somewhere, that triangular \"spike\" had to connect to something or else it would break from my point of view. It had the color of metal, I say metal because the surface reminded me of a toaster. But at the front of the UFO wasn't spiked, it looked like if you cut the tip of a carrot of. I tried to open my door to the veranda, just as I opened the door the light turned to me. I was terrified. Then it flew right over my building without even making a sound. I ran out my front door, but it was gone. In the attachments I have added a sketch of the object."],"City":"TromsÃƒÂ¸","Summary":"2 AM, Norway. I saw a bright light. Thought it was another russian missile, Was wrong","Latitude":"69.657455","Date of the Event":"05/15/2010 02:00 UTC","Tags":"City","Disposition":"Unresolved","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=69.657455,+18.961344(23274)&iwloc=A&hl=en\"> mufon case (23274) map </A>","Date Submitted":"05/14/2010 09:18 UTC","trends":["There has been one other sighting in Tromsø","There were no other sightings in Tromsø on or around May 15th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/23274.html.txt","/var/www/straped/mufon/more/23274_submitter_file1__toppen.jpg","/var/www/straped/mufon/more/23274_submitter_file2__under.jpg","/var/www/straped/mufon/org/23274.html"],"Sighting Duration":"00:10:09"}