{"Object Flight Path":"Path then hovering","Latitude":"42.735735","Disposition":"Unknown","Source":"MUFON","Country":"United States","Log Number":"US-05152010-0004","files":["/var/www/straped/mufon/html2text/23282.html.txt","/var/www/straped/mufon/org/23282.html"],"City":"Lansing","Object Shape":"Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=42.735735,+-84.550985(23282)&iwloc=A&hl=en\"> mufon case (23282) map </A>","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around April 26th 2010"],"Date of the Event":"04/26/2010 09:15 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI was watching TV when I noticed something bright moving in the sky. I went to the window to see what it was. At first I thought it was a plane with the running lights on, but it stopped moving and got super bright, then dimmed down. I grabbed my binoculars to get a closer look at it. Through them, I could make out a pyramid shape, red and blue in color. I got excited and called a friend to see if he could see it from his place; he went outside but couldn't see it; he told me to take pics of it, which I did. I took about 8 pictures with my work phone. It was in the W-N-W sky, quite high up. I talked to him the entire time I was watching it. It just blinked out, gone. After it left, I was looking at the pictures and noticed that upon zooming in on the object, I could make out some sort of windows on the right side of it. This was repeated in the other pictures as well. There is also dimmer lights on the left side and below it, pyramid style. Zoomed in, you can make out reflection on left side, but the bottom light is strange. Perfectly square, and riddled with shapes and X's throughout the square. It came back the next night around 8:46 pm.same place. I was watching for it, hoping that it would return. I took pictures this night as well. It stayed there almost 2 hours. One week later,May 5, I saw it again, same place, around 9 pm. My daughter was visiting, and she noticed it first. She asked me if I knew what that bright light was in the sky. I got up and looked, and sure enough, it was back. It stayed around only about 45 minutes this time. But, there were other lights up there this time. They couldn't be seen without the binoculars, there were 2 other things(?) up there. They had flashing lights, but were extremely high up. I keep watching, but haven't seen it since. I have no way of attaching the pictures to this report, but have them saved."],"Tags":"City","Sighting Duration":"Undisclosed","Summary":"Bright light flashes in the sky, becoming stationary for over an hour, two nights in a row.","Object Features":"Window(s)","Viewing Distance":"Over One Mile","Longitude":"-84.550985","Date Submitted":"05/15/2010 10:14 UTC","Case Number":"23282","Region":"Michigan"}