{"trends":["There have been 3 other sightings in Bryan","There were no other sightings in Bryan on or around January 30th 2010"],"Summary":"Orange disk or sphere bright. not pulsating hovering then moved fast.","Date of the Event":"01/30/2010 10:00 UTC","Latitude":"30.675554","Object Flight Path":"Hovering then path","Object Shape":"Saturn-like, Sphere","Log Number":"US-05152010-0004","Country":"United States","Case Number":"23281","Longitude":"-96.360763","Date Submitted":"05/15/2010 05:24 UTC","Object Features":"Unknown","City":"Bryan","Weather Factors":"None, Does Not Apply","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.675554,+-96.360763(23281)&iwloc=A&hl=en\"> mufon case (23281) map </A>","divs":["sighting detailsim not [cms\\tg\\pd] crazy, i know what a saw. i cant tell you the exact date. but i was in bryan\\tx and i was standing outside of my apartments. and im just standing the taking the dog out. and i stop to look up at the sky as i often do. and i saw sosomethinghat stood out. it was just this orange i wanna say ball but thing. it was like this glowing ball of orange light like just hovering there like you know a helicopter would. and im just staring at it. just not wanting to take my eyes off of it because it was so curious. just not moving in the sky at all. i remember thinking whwheres camera or a recorder when you need one and i wanted to go inside to grab one but i dididn'tecause i wanted so bad to watch it. cuz ive never seen anything like it. but what makes me say ufo and not mimilitary tec was because. after about 6 or 7 minutes of it just sitting there not moving, it just shot off just faster then any thing i have ever seen in like a ststraightiline kinda dirirectly away from me but at an angle. it just in a matter of 2 maby 3 seconds it just didisappeare didnt go neccicaraly up but mor just out and away. so fast. i lived near a milatary base at that time so i dont really know. but. for it to hover like that. and then shoot off. never seen anything like that. and my uncle flew black hawks. they dont move like that. i was a sceptic. still kinda am but after seing that. leves so many questions you know."],"Sighting Duration":"00:07:00","files":["/var/www/straped/mufon/html2text/23281.html.txt","/var/www/straped/mufon/org/23281.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Disposition":"Unknown","Tags":"City"}