{"Summary":"At least 5 objects of varying shapes and colors over I-5 near Salem.","Weather Factors":"Unknown","Disposition":"IFO","Region":"Oregon","Source":"MUFON","Log Number":"US-05152010-0003","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.944188,+-123.028826(23280)&iwloc=A&hl=en\"> mufon case (23280) map </A>","City":"Salem","Object Shape":"Sphere, Other","Country":"United States","Date Submitted":"05/15/2010 05:19 UTC","files":["/var/www/straped/mufon/html2text/23280.html.txt","/var/www/straped/mufon/org/23280.html"],"Object Features":"None","Date of the Event":"05/14/2010 09:45 UTC","divs":["Sighting DetailsI was driving from Eugene to Portland on I-5 and was just south of Salem when I noticed a bright light in the sky. I assumed it was a planet at first, but then I realized it appeared larger as I continued to drive in its direction. As far as I could tell it was not moving. As I got closer it appeared to be a glowing white sphere that was hovering completely still directly above the freeway. I soon saw 2 more in the distance, one of which was visible to the west until I was almost in Portland. A few miles after the first white one I saw a dimmer red sphere with a smaller flashing red light on one side. Then in the distance I saw what I thought was an airplane, but as I got closer I realized it wasn't moving either. I saw to red lights and one green one. The green one slowly disappeared, and I realized the object appeared to be rotating very slowly. I know that the McMinnville UFO festival is going on right now, so I wondered if this had anything to do with that, but these seemed to be quite large and high in the sky, not something an amateur prankster could pull off. I haven't been able to find any mention of any aircrafts or any other floating or flying objects around Salem tonight in the news or on Twitter.Hundreds of people must have seen them. They were very clearly visible from the road. Anyone know what they were?"],"Object Flight Path":"Stationary","Viewing Distance":"Unknown","trends":["There have been 40 other sightings in Salem","There was one other sighting in Salem on or around May 14th 2010"],"Case Number":"23280","Sighting Duration":"Undisclosed","Latitude":"44.944188","Longitude":"-123.028826"}