{"Object Shape":"Other","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around January 15th 2000"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Source":"MUFON","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=30.440416,+-84.275873(23285)&iwloc=A&hl=en\"> mufon case (23285) map </A>","City":"Tallahassee","Tags":"City","Log Number":"US-05152010-0007","Weather Factors":"None","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/23285.html.txt","/var/www/straped/mufon/org/23285.html"],"Date of the Event":"01/15/2000 09:00 UTC","Object Features":"Unknown","divs":["Sighting DetailsCamping under the stars in Appalachicola National Forest, southwest of Tallahassee, Florida, was an unforgettable adventure for my dog, Bear, and me. On this particular night, January 15, 2000, we had been camping in Appalachicola for several days when I decided to drive around a bit and see a little more of the woods. At dusk, we followed a long trail off the main road, down a gravel road, bouncing along a dirt road until it came to an end, turning into two grassy footpaths. The break in the woods was a little meadow, but looking up, the dark sky was expansive over the Gulf of Mexico. The kind of sky that makes you feel real small. A perfect setting for a close encounter with other-worldly neighbors. About 9 or 10 p.m., as I was standing next to my car in quiet awe of nature's beauty, I saw a bright light suddenly appear in the west, darting around over the Gulf. Mesmerized, I couldn't take my eyes off the single, unblinking light, which distinguished it from manmade aircraft of any kind. It darted around, hovered awhile and moved on again, for 45 long minutes. No Earthly craft had such capabilities. It was so close, I began to consider what might happen next. My neck ached. Adrenaline surged through my body. I moved the car into the cover of the woods without turning the lights on. Thoughts rushed through my mind...What if it lands in THIS meadow? I pictured it hovering over my car and sucking us up like nectar. I wondered if my dog would save us. I wondered if they'd leave my dog behind if they took me. And I prayed they were friendly souls and not like the sci-fi aliens we've come to expect. After all, these are highly evolved species of life. How cruel could they be? (Crueler than we are?) Just as I was fully prepared to face whatever the night might bring, the craft darted off out of sight as quickly as it had appeared. And I can't say I wasn't relieved to see it go, friendly or not. Of course, the memory will last my lifetime. But that's a good thing. * * *"],"Sighting Duration":"00:45:00","Longitude":"-84.275873","Latitude":"30.440416","Date Submitted":"05/15/2010 11:01 UTC","Case Number":"23285","Summary":"Darting lights over the Gulf of Mexico"}