{"divs":["sighting detailsi was about 4 or 5yrs of age when i saw this object. this took place in the late 70's mabey about 1977. i remember it being in the evening with clear skies. i was sitting in the back seat of my parents car and happend to lean forward between them and look up thru the windshield of the car and saw this circular shaped ring with lights aound it. it was moving in a spinning motion at the speed of mabey a cessna airplane. i did not grab my parents attention at all, so they were not even aware of it. to give you an idea of what the ufo looked like, if you remember the tv show \"the greatest american hero\", the ufo in the intro of the tv show, thats what it reminded of. to also give you a geographical note on the area that i saw this, you can look up 7507 fairbrook rd baltimore, md 21244 in google maps. the closest airport would baltimore washington intl. airport just incase something was spotted on radar back then. its one thing to talk among friends occasionally about this but to have the opportunity to talk to actual people that study these cases is a pleasure. sincerly, [cms\\tg\\pid]"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.293005,+-76.609029(23293)&iwloc=A&hl=en\"> mufon case (23293) map </A>","Summary":"Spotted a circular ring shapped object with lights around it moving in a slow spinning motion.","Object Shape":"Circle","Viewing Distance":"Over One Mile","Object Features":"Other","Tags":"City","files":["/var/www/straped/mufon/html2text/23293.html.txt","/var/www/straped/mufon/org/23293.html"],"Date Submitted":"05/15/2010 12:35 UTC","Date of the Event":"Unknown","City":"Baltimore","Weather Factors":"Unknown","Region":"Maryland","Longitude":"-76.609029","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around"],"Case Number":"23293","Source":"MUFON","Log Number":"US-05152010-0016","Disposition":"Unknown","Country":"United States","Latitude":"39.293005"}