{"Date Submitted":"05/15/2010 01:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.98595,+-88.078403(23295)&iwloc=A&hl=en\"> mufon case (23295) map </A>","Object Shape":"Flash, Unknown","Log Number":"US-05152010-0018","Summary":"Flashing/Strobing light that shot like a bullet then another object repeated same pattern","Viewing Distance":"Unknown","Longitude":"-88.078403","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/23295.html.txt","/var/www/straped/mufon/org/23295.html"],"Latitude":"41.98595","Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"Unknown","Region":"Illinois","Case Number":"23295","City":"Roselle","Object Flight Path":"Path with directional change","Source":"MUFON","Country":"United States","Date of the Event":"11/18/2009 10:57 UTC","Tags":"City","trends":["There have been 2 other sightings in Roselle","There were no other sightings in Roselle on or around November 18th 2009"],"divs":["sighting detailsone night i decided to go outside and observe a meteor shower in november 2009. the shower was supposed to begin at 11:00 pm. i went outside about 10:56 pm and began observing the night sky in hopes to see a meteor. the night was clear and very cold. i was looking up towards the north sky and no more than a few minutes of observing i saw something that was of great amazement. i observed a flashing\\strobing white light that all of a sudden appeared real high up in the night sky. i observed the object for about thirty seconds to a minute. the object continued flashing and then it moved a little bit east and then went west and back east. these movements were not that great in distance. then all of a sudden the object shot east very quickly. it headed towards chicago. i continued observing the object and then it shot very swiftly south. it traveled in an l shaped pattern. then i lost sight like it vanished. wow was i amazed. i then looked back at the original starting point and saw another object appeared flashing\\strobing. the object repeated the same pattern as the previous object. it went a little bit east then came back west and then east. the object shot east towards chicago and then moved south and vanished into the night sky. both objects repeated the same movements and patterns. these things did not move like anything i've ever seen. the objects shot across the night sky. i ran into the house and told my wife and she did not believe me. i've told friends and family and most of them give me a weird stare. i know what i saw and it was definitely a ufo. i've had an interset with ufos for about 15 years. this is my first ever sighting."]}