{"City":"Taunton","Object Features":"Undisclosed","trends":["There have been 8 other sightings in Taunton","There were no other sightings in Taunton on or around April 30th 1952"],"divs":["Sighting Details This event happened sometime between summer of 1951 and summer of 1955. I had gone to church on a saturday afternnon to go to confession. The church is on Whittenton street across bay street. After confession I left the church from a door opposite the one I had entered. There is a palyground at the end of 5th ave and I was heading there to look for my friends. After leaving the church I was immediately surprised at the silence outside. There was no sound of cars on Whittenton street, at the time 5th Ave. was home to many french speaking families.There were no sounds of children playing and no sound of the old french speaking people on their porches speaking to each other. These people could be very loud as they talked to others next door and even 2 houses away. There was not even birds chirping. The silence was deafening. I looked to my left and saw no cars passing in front of the church, then as I turned to my right I noticed this thing hanging in the air above this huge old oak tree at the top of the hill on 5th ave. At first I didn't have any idea what I was looking at. I was maybe 11 to 13 years old at the time. I can still see this thing as clearly in my mind today at 70 yeas of age as at the time it occured. I was looking at a round disc shaped object hovering above the huge old tree at the top of the hill. It was larger in diameter the the tree and was maybe 20 feet above the tree. The top of the object seemed to be rotating in one direction and the bottom was rotating in the opposite driection with a stationary center section. There was a row of big what I can only describe as windows but they were not windows as we think of them. The street is not very long maybe 150 feet at most. So I was very close to the thing. I was simply stunned! I just stood there for a few minutes looking at this thing. Even today I can still see this figure in the center section kind of leaning with outspread arms on something and looking directly at me. At the time I was convinced it was looking directly at me. Suddenly I felt that someone was telling me to be calm and be quiet and that things would be ok. It felt like waves of calm were radiating out from this object. All of a sudden it was like my body came back to me and I turned around and went back into the church and down the stairs to the center of the church. I stayed there for a time and remember seeing my aunt leaving the main part of the church. I quietly went to the door I came in and all of a sudden I slammed the crash bar and left the church and without looking anywhere except straight ahead I ran just as fast as my legs could move to my home which was maybe 200 yards directly across bay stree and on another section of Whittenton street. My home was in the 3rd house on this section on the right of the street. I stayed in the house the rest of the day and knew that if I went outside that thing would be there looking for me. A few days later my mom took my brother and sisters and me to my aunts house. After we got there and visited a while my aunt asked me why I didn't say hi to her in the church. I told her I was scared and she asked me if it was because of the thing in the sky. She had seen it too and promptly went back into the church to wait inside for my uncle to pick her up. She and I both agreed on just about everything axcept the waves of calmness, She was only outside for a few seconds before returning inside. There was an empty hall just catty corner across the street from my home. One of the churches in the area was using this hall as a church while their church was being demolished and a new one built. One sunday morning after attending mass I was leaving this church and for some reason looked up in the sky and to my astonishment there was the same object slowly rising straight up and I lost sight of it as it disappeared into the clouds. Again I ran home as fast as I could and never said a word to anyone bout this event. I swear these things happened to me and my aunt. Both churches are still there. The playground still exists, all the houses are still there. The hall still exists. Sadly my aunt passed away a few months ago but she did tell my mother what happened and my mother is still living. I am writing this now because I happened to turn on the history chanell and watched the program U F O hunters. I have never comunicated this to anyone outside my family because I didn' t want to be seen as a nut case."],"Summary":"A large circular disc hovering above a tree.","Tags":"City","Sighting Duration":"00:05:00","Latitude":"41.909461","Longitude":"-71.081367","Country":"United States","Log Number":"US-05152010-0017","Viewing Distance":"Unknown","Object Shape":"Disc","Source":"MUFON","Object Flight Path":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/23294.html.txt","/var/www/straped/mufon/org/23294.html"],"Region":"Massachusetts","Case Number":"23294","Date Submitted":"05/15/2010 01:01 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.909461,+-71.081367(23294)&iwloc=A&hl=en\"> mufon case (23294) map </A>","Date of the Event":"04/30/1952 12:00 UTC"}