{"map":"<A HREF = \"http://maps.google.com/maps?q=37.302163,+-120.482968(2329)&iwloc=A&hl=en\"> mufon case (2329) map </A>","Latitude":"37.302163","Summary":"California lights in April","trends":["There have been 10 other sightings in Merced","There were no other sightings in Merced on or around March 31st 2003"],"City":"Merced","Date Submitted":"03/31/2003 08:10 UTC","Weather Factors":"Unknown","Disposition":"Insufficient Data","Case Number":"2329","Date of the Event":"03/31/2003 08:10 UTC","Tags":"City","Longitude":"-120.482968","Object Features":"Undisclosed","divs":["Sighting DetailsSometime in mid-April of this year 2003, at about 20 10, it was an unusuallyclear night for the week and I was at a barn in Merced looking at the stars.Very high up in the SE sky I saw something that looked like some random smallmeteor or piece of debris burning up in the atmosphere. I didnt pay any moreattention to the sky for a couple of hours. Later that night I was driving homefrom Merced to Chowchilla on HWY 99, the time was approximately 22 30. I noticedthat, whatever the object was, it hadnt burned up yet. In fact it was brighterand it had moved a couple of inches closer to the horizon. Since I was drivingsouth I had a fairly good view of the object. It looked like a bright star witha small tail on it. As I watched I could see that it was moving, andaccelerating as well. The object started with a fairly shallow descent and as itsped up it abruptly changed direction and began moving very rapidly straightdown towards the ground. Just as I was sure that I was about to watch somethingcrash into the earth, it pulled up and hovered just above the horizon for ashort amount of time. At this time the short tail disappeared and the objectlooked like a very bright star. As it hovered I saw a red light appear on oneside of the star and a blue light on the other. Just outside the red and bluelights another small white light appeared. Now I had no idea what this thingwas, and I was getting a little scared. The object started to move NW towardsme. The red, blue, and white lights around the outside rotated as the objectmoved towards me, like when you throw a frisbee and it spins but keeps going inthe same direction, but it only rotated a total of 180 degrees. As it rotatedand moved in my general direction I broke out in a cold sweat, I felt apreassure in my head, not pain just preassure, I got goosebumps and tingles allover my body, and now I was terrified. I dont know how I mannaged to keep myjeep on the road. I did not notice any mechanical or electrical disturbances inmy jeep. I was, however, a little distracted at the time and not payingattention to the performance quality in my vehicle. While I was watching Inoticed that this thing was only about 100 ft above the ground. It was stillspeeding up as it passed over me. I felt a tightening in my chest just as itwent by. After it was over me I looked over my shoulder to see where it went. itwas still accelarating and disappeared over t"],"files":["/var/www/straped/mufon/html2text/2329.html.txt","/var/www/straped/mufon/org/2329.html"],"Source":"MUFON","Sighting Duration":"01:59:00","Object Shape":"Undisclosed","Object Flight Path":"Unknown","Country":"United States","Viewing Distance":"21-100 Feet","Region":"California","Log Number":""}