{"Case Number":"23291","trends":["There have been 4 other sightings in Hawthorne","There were no other sightings in Hawthorne on or around July 31st 1952"],"Longitude":"-118.344865","Tags":"City","divs":["sighting detailsi was about 12 or 13 years old. me and my friend were shooting bb guns in his back yard. looking around for birds to shoot. he saw a black dot in the sky and he said he saw a smaller dot come out of it. i could barely see the first dot, but i think i did. about 5 minutes later we saw a silver or aluminum disc (it was rounded and convex on bottom) flying very slowly over the roof of his house (we were in his back yard). there were some telephone lines behind the houses across the street from his house. it appeared about as wide a house with two slits or windows in the edge and about 5 feet or more in height. it made a humming noise like a humming transformer which varied slowly in intensity (up and then down and repeated). i think i saw motion in the window\\slits but am not sure of this. it went slowly then sped up, then went so fast it seemed to dissapear. it was about a block away when it dissapeared. about a minute or less after that two jet planes (scopions) flew over the same telephone lines. i never seen jets fly that close to our homes before. we ran into to his house to tell his family, they laughed at us. i went home to tell my family and they didn't believe me also. there was no news of sightings that evening either. we lived about a block away from northrop airport in hawthorne california. they were famous for flying wing airplanes, etc."],"Region":"California","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Insufficient Data","Date of the Event":"07/31/1952 12:00 UTC","Summary":"It flew over some telephone lines slowly then sped off quickly.","City":"Hawthorne","files":["/var/www/straped/mufon/html2text/23291.html.txt","/var/www/straped/mufon/org/23291.html"],"Object Shape":"Disc","Date Submitted":"05/15/2010 11:37 UTC","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Log Number":"US-05152010-0014","Latitude":"33.922143","map":"<A HREF = \"http://maps.google.com/maps?q=33.922143,+-118.344865(23291)&iwloc=A&hl=en\"> mufon case (23291) map </A>","Source":"MUFON","Object Features":"Window(s), Louvres"}