{"Date of the Event":"09/20/1984 10:30 UTC","Country":"Brazil","map":"<A HREF = \"http://maps.google.com/maps?q=-22.896909,+-43.208437(2330)&iwloc=A&hl=en\"> mufon case (2330) map </A>","files":["/var/www/straped/mufon/html2text/2330.html.txt","/var/www/straped/mufon/org/2330.html"],"Object Shape":"Triangle","Object Flight Path":"Unknown","divs":["sighting details thissighting, involved a corporate pilot based in iowa, who is also a certifiedflight instructor. the sighting occurred in september of 1984 at about 10:30p.m. (local time) in the skies over brazil about 90 nautical miles from rio dejaneiro, and lasted for some seven (7) minutes. when this pilot witness (and his co-pilot) flying a c-p210 first saw somethingunusual, they were flying above the cloud cover at 13,000 feet altitude, lookingdown on a cloud cover at only 10,000 feet altitude.what they saw was a light illuminating the clouds below them, and - because thelight seemed to move in a somewhat see-saw motion from side to side - theyspeculated that it might be a searchlight.suddenly the light\\object came up through the cloud cover \"very fast\" and as itpassed by their aircraft and shot up into space they saw that it was atriangular shaped object (estimated to be about the size of a \"truck,\" with redlights at each corner of the triangle, and a blue light in the center of theunderside of the object.it should be noted that this is not the only ufo sighting reported by thiscorporate pilot. he indicates having sighted several formations of ufos - fromthe ground - while in europe."],"Longitude":"-43.208437","Disposition":"Unresolved","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Rio de Janeiro","There were no other sightings in Rio de Janeiro on or around September 20th 1984"],"Summary":"Corporate Pilot Sighting in Brazil","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","City":"Rio de Janeiro","Region":"Rio de Janeiro","Case Number":"2330","Date Submitted":"09/20/1984 10:30 UTC","Log Number":"","Sighting Duration":"00:10:00","Source":"MUFON","Object Features":"Undisclosed","Latitude":"-22.896909"}