{"Country":"United States","Object Shape":"Triangle","Object Features":"None","Longitude":"-114.515563","Date Submitted":"05/15/2010 06:10 UTC","Date of the Event":"05/15/1977 01:00 UTC","City":"Jerome","Region":"Idaho","Case Number":"23301","Object Flight Path":"Stationary","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-05152010-0024","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/23301.html.txt","/var/www/straped/mufon/org/23301.html"],"divs":["Sighting DetailsI was walking home from a friends house at about 12:30AM.I glanced up to see a roundish cloud just above me.3 lights appeared in the center of the cloud forming a triangle.Before I had time react,I woke up walking down the middle of the road three blocks from where I seen the lights.I had no memory of seeing the lights at all.I did notice that it was 5:ooAM when I got home.This did not even register in mind at all.I had no memory of this event until three or four months later.When I started to put this all together I realized that I was missing about three hours time.To this day I cannot recall how I walked around the corner towards my house or why it took me four hours to get home when it was a 15 minute walk.This has puzzled me for over 30 years now.The last couple of years it has become more important to me and bothering me more and more.What I would like is if anyone else has had something like this happen to them and I would also like to know where the missing time went.If anyone can help,please contact me by e-mail.This actually happened so I would ask that no skeptics contact me to tell me I'm nuts."],"trends":["There have been 2 other sightings in Jerome","There were no other sightings in Jerome on or around May 15th 1977"],"Latitude":"42.727993","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.727993,+-114.515563(23301)&iwloc=A&hl=en\"> mufon case (23301) map </A>","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Summary":"Saw 3 lights in a triangle shape and had a loss of time."}