{"Latitude":"34.861338","map":"<A HREF = \"http://maps.google.com/maps?q=34.861338,+-82.38991(23302)&iwloc=A&hl=en\"> mufon case (23302) map </A>","files":["/var/www/straped/mufon/html2text/23302.html.txt","/var/www/straped/mufon/more/23302_submitter_file1__005.JPG","/var/www/straped/mufon/more/23302_submitter_file2__005(1).JPG","/var/www/straped/mufon/org/23302.html"],"City":"Greenville","Case Number":"23302","Summary":"Three balls of blue and yellow lights in a triangle formation.","divs":["Sighting DetailsI was backing out of my driveway when I noticed a huge light in the sky that was much bigger than any star near it. From the naked eye, it APPEARED to be star-like in color, only much brighter. I pulled back into the driveway and told my parents to come outside and look at the object. At fist my father declared it to be the North Star, because of its size. I went inside to get my camera and some binoculars while they kept an eye on the object. It seemed to fade in and out at times but this may be due to clouds coming in at the same time. Through the binoculars we could see three points of light but couldnt tell if it was the same object or three seperate ones. I took 5 pictures but only the last one showed anything but complete blackness. I have no idea what they are, but it seems they are three seperate objects because the stars are clearly visible between them. We lost sight of the object after about 25 minutes due to clouds and the fact that it was very slowly moving away. As incredible as this picture looks, it is in fact 100% real! I will keep these images on my camera for further study by professionals, thank you for your time."],"trends":["There have been 10 other sightings in Greenville","There were no other sightings in Greenville on or around May 2nd 2010","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Star-like, Triangle","Tags":"City","Object Features":"Undisclosed","Date of the Event":"05/02/2010 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Log Number":"US-05152010-0025","Source":"MUFON","Date Submitted":"05/15/2010 07:14 UTC","Longitude":"-82.38991","Region":"South Carolina","Viewing Distance":"Unknown"}