{"Case Number":"23316","trends":["There have been no other sightings in Cedarville","This sighting has never been favorited."],"Date Submitted":"05/16/2010 02:43 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsDecided to write this after viewing your event map and noting, that a person in New Berlin reported seeing a cigar with windows stop over Greenfield Park someime around Oct 31, 1977 which hovered over a group of ice skaters for approximately ten minutes once and then returned for period of one minute disappearing quickly! I reported a similar encounter by myself on the road between Cedarville, Ohio and South Chrarleston, Ohio approximately in the Spring of 2006 on Peter Davenport's site, NUFORC.com if you want to look it up! The cigar had lighted portholes. The object descended rapidly to fly parallel to my car while I was driving home from classes at Payne Theological Seminary. It first appeared to be a very bright star and then came down so fast, that I was shocked, but couldn't pull over anywhere as that part of the road was narrow and had drainage ditches on both sides. The craft skimmed the top of the ground without any sound. It was a clear and warm evening and I had my car windows down! It rose rapidly and became a star again sitting in the sky over Cedarville. I went down the road to find a place to pull over and after a mile or so found a truck pull-off and kept looking backward to watch the thing as much as possible without running off the road. There was no other traffic! It was so amazing that I still think about it today every time I drive through that area. Never saw anything like that before or since. The object looked alot like the drawing submitted by the person who reported the Greenfield Park sighting. Incidentally, I worked in New Berlin nearly forty years ago and used to go by Greenfield Park to run and job in the early 80's while living in West Allis, WI which is contiguous to that are! Strange coincidence isn't it???"],"Latitude":"39.744227","Date of the Event":"03/31/2006 09:40 UTC","City":"Cedarville","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Log Number":"US-05162010-0010","Object Features":"Window(s)","Object Shape":"Cigar","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/23316.html.txt","/var/www/straped/mufon/org/23316.html"],"Country":"United States","Object Flight Path":"Straight-line path,Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.744227,+-83.808537(23316)&iwloc=A&hl=en\"> mufon case (23316) map </A>","Longitude":"-83.808537","Region":"Ohio","Tags":"City","Summary":"Strange Coincidences???"}