{"divs":["Sighting DetailsMy sister, her boyfriend, and a friend of mine, and his girlfriend went on acamping trip to the UFO watchtower in the San Luis Valley, just outside ofHooper, CO. There is a dome store, with a metal grating platform on the roof,and a patio and a rock garden in the back.It took me quite some time on the internet, but I finally found the crop circletrilling noise that CSETI uses in their UFO attracting protocol. I recordedthat onto minidisk and brought it with me. I was planning on playing it over a2 way radio, but I had forgotten the rest of the CSETI protocol. Lucky for mewhile talking with Judy, the UFO watchtower owner, a CSETI member arrived. Weall discussed for hours. Eventually I mentioned I had brought the sound and theCSETI member knew the consciousness phase of the protocol, so we went up thetower and played the sounds over the radio, then with the CSETI member, herhusband, and my sister went through the consciousness phase. It was about 9 PM,at the end of a lovely sunset. Nothing happened immediately, and we ended up inthe store.I knew we should be watching, but most of us were really into our discussions. Luckily some children and my sister were watching the skies outside. Thechildren belonged to a Spanish speaking Mexican family. My sister92s boyfriend speaks Spanish, so we were able to communicate. BTW, they, livingin the valley, had their own host of stories. My family camped a lot when I wasyoung and my sister and I loved staying up and spotting satellites, so I knewshe was a pro. Not too long after, between 925 and 930 PM, my sister called us,saying she saw a satellite. When I saw it, my first comment was that was waytoo bright to be a satellite It was directly out of the watchtower92s back door, which faced east over the rock garden. The object was at 10 o92clock, about 30-35 degrees off the horizon, above a mountain range. I am abit color blind, so I am not sure of the exact color, but the color did seem tochange. Others reported it being yellow and turning blue when it dimmed. Itwas over the Mountains, but seemed nearer, heading south, moving faster than asatellite, but not as fast as a shooting star. I would describe a satellite astypically dimmer than the brighter stars, and moving at a steady pace. Usually,spotted right above in the darkest part of the sky, and moving across the sky,and not along the horizon. This o"],"Viewing Distance":"Unknown","Object Shape":"Undisclosed","Longitude":"-105.875299","Date of the Event":"06/07/2003 09:25 UTC","City":"Hooper","Object Flight Path":"Unknown","trends":["There have been 2 other sightings in Hooper","There were no other sightings in Hooper on or around June 7th 2003"],"Sighting Duration":"00:00:59","Weather Factors":"Unknown","Tags":"City","Log Number":"","Disposition":"IFO","Source":"MUFON","Latitude":"37.742778","files":["/var/www/straped/mufon/html2text/2331.html.txt","/var/www/straped/mufon/org/2331.html"],"Region":"Colorado","Case Number":"2331","Country":"United States","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.742778,+-105.875299(2331)&iwloc=A&hl=en\"> mufon case (2331) map </A>","Date Submitted":"06/07/2003 09:25 UTC","Summary":"Saw bright object at UFO watchtower"}