{"Disposition":"Unresolved","Summary":"LARGE FLAG SHAPE OBJECT, 2 SAUCER SHAPES NEAR BY","Date Submitted":"05/16/2010 05:47 UTC","Country":"United Kingdom","Source":"MUFON","Object Flight Path":"Undisclosed","Log Number":"GB-05162010-0005","Tags":"City","Object Features":"Undisclosed","Sighting Duration":"00:00:10","Date of the Event":"05/15/2010 02:00 UTC","trends":["There have been no other sightings in Dunstable","This sighting has never been favorited."],"Region":"England","Longitude":"-0.52039","Viewing Distance":"Unknown","Object Shape":"Unknown","Case Number":"23311","Weather Factors":"Unknown","divs":["Sighting DetailsI WAS AT WHIPSNADE ZOO, DUNSTABLE, ENGLAND WITH MY PARTNER AND DAUGHTER SITTING ON A BENCH HAVING SOME LUNCH BY THE ELEPHANT ENCLOSURE WHEN I NOTICED RIGHT IN THE DISTANCE AN EXTREMELY LARGE OBJECT IN THE SKY IT WAS RIGHT IN THE DISTANCE AND AN AIR BALLOON LOOKS LIKE A SPEC FROM A DISTANCE BUT THIS THING WAS MUCH LARGER THAN AN AIR BALLOON. I WATCHED IT MOVING VERY SLOWLY THEN DECIDED TO USE MY CAMERA TO ZOOM IN TO THE MAX SO I COULD GET A BETTER VIEW. THE PICTURE I GOT LOOKS LIKE A VERY LARGE FLAG WITH SOME SYMBOLS ON IT, BUT THE WEIRD THING IS THE SIZE IS OUT OF PROPORTION TO THE TREES. THERE DOESN'T APPEAR TO BE ANY KIND OF FLAG POLE ATTACHED TO IT EITHER. THERE WERE PARA GLIDERS ABOUT THIS DAY BUT I DISMISS IT AS THAT. I ONLY TOOK THE ONE PHOTO AND THE FLAG SHAPED OBJECT CONTINUED TO MOVE SLOWLY AND DISAPPEARED BEHIND THE TREES. AFTER I GOT HOME I TRIED TO BLOW THE PICTURE UP BUT I STILL CAN'T MAKE THE SYMBOLS OUT, HOWEVER I MADE ANOTHER DISCOVERY THERE ARE 2 SAUCER SHAPES IN THE SKY NEAR BY. ON SEEING I HAVE CAPTURED 2 SAUCER SHAPES IN MY PHOTO I ACTUALLY FEEL EXCITED I HAVE WITNESSES SOME KIND OF UFO. PLEASE TAKE A LOOK AT THE PHOTO THE FIRST SAUCER SHAPE IF YOU LOOK AT THE FLAG AT THE TOP RIGHT CORNER FOLLOW IT OUT DIAGONALLY AND YOU WILL SEE IT AND THE OTHER IS BELOW IT NEAR THE TREETOPS."],"City":"Dunstable","Latitude":"51.885644","map":"<A HREF = \"http://maps.google.com/maps?q=51.885644,+-0.52039(23311)&iwloc=A&hl=en\"> mufon case (23311) map </A>","files":["/var/www/straped/mufon/html2text/23311.html.txt","/var/www/straped/mufon/more/23311_submitter_file1__DSCF4297.JPG","/var/www/straped/mufon/org/23311.html"]}