{"Disposition":"Unknown","Date of the Event":"05/04/2010 04:45 UTC","Country":"United States","divs":["Sighting Details I wake up at 4:30 a.m. every morning for work. After making a cup of coffee on this morning, I stepped outside on my back porch,to smoke a cigarette and stargaze. I occasionally see satellites moving across in space and I guess thats's what I was looking for. The sky was absolutely clear as my gaze was fixed due east since my porch faces that direction, towards the Galveston Bay. After being outside for about five minutes, I saw a very bright light appear in the southeast at about 75 degrees above the horizon. Just east of the moon. It quickly dimmed to nothing before I could get a fix on the exact location and searched for anything moving. I saw distant stars in the vicinity but not so much as a satellite. I continued scouring the skies for anything in that area. Suddenly it lit up again. Brighter than Venus and the moon. It did not appear to be moving. It, once again, dimmed to nothing and the sky was just blank again. Absolutely nothing. No satellite, no plane. Just empty sky where it had shown. I continued to watch for several minutes but saw nothing. In my honest opinion, it seemed, to me, to be a beacon or a sign. It was not a flash but rather a quick brightening and dimming. Or a pulse perhaps. One bright pulse, one minute later a repeat and then nothing. The very next morning at about the same time I was in the same position. Gazing up. Almost due south I saw something get very bright. Being prepared this time I actually saw it as it dimmed. I could see what appeared to be a distant star-like object or satellite moving. It was moving in an easterly direction at a high rate of speed. Faster than any satellite I have ever observed. It then dimmed to nothing and disappeared completely. I live by Bush Intercontinental, Hobby and La Porte Airports and I'm used to planes and their lights. I have seen space shuttles and the ISS fly over. I have never seen anything that lit up so bright and, at least, seemed so distant. Like a pulsar. I was awed by this experience and know that what I witnessed was something unique. Not just once but twice on two days, consecutively. I still believe it was a sign or beacon."],"trends":["There have been 173 other sightings in Houston","There were 2 other sightings in Houston on or around May 4th 2010"],"Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=29.767533,+-95.36176(23318)&iwloc=A&hl=en\"> mufon case (23318) map </A>","Case Number":"23318","Weather Factors":"None","Date Submitted":"05/16/2010 02:57 UTC","Sighting Duration":"Undisclosed","Summary":"Bright flashes of light","files":["/var/www/straped/mufon/html2text/23318.html.txt","/var/www/straped/mufon/org/23318.html"],"Log Number":"US-05162010-0012","Region":"Texas","Object Shape":"Unknown","City":"Houston","Tags":"City","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"29.767533","Longitude":"-95.36176","Object Features":"Unknown"}