{"Source":"MUFON","Date of the Event":"05/15/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/23313.html.txt","/var/www/straped/mufon/org/23313.html"],"divs":["Sighting DetailsI was walking in James Bible park in awe of the rising crescent moon aligned with venus, I was watching a plane at very high altitude pass overhead when I noticed what at first appeared to be a satellite pass in a perpendicular path to that of the aircraft. Then the light went out and reappeared 3 times over about 30 seconds as the object moved across the sky. Then about ten minutes later I witnessed two more traveling towards eachother. I thought for sure they would collide. One of these was dim like a satellite the other was VERY bright. After that I called 911 so I could have an official recorded reporting. Then as I was on the phone with 911 I saw a fourth one and gave a detailed description to the man at dispatch. I am a very intelligent man and have been stargazing my whole life. These were not satellites any more than they could have been weather balloons. These in my humble opinion were bonified genuine UFO's. Again they looked like a really bright venus or star but they travelled at high velocities and would sometimes get dim or disappear as they were moving. The sightings always seemed to occur in the wake of a traveling plane."],"Latitude":"39.748204","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.748204,+-104.981093(23313)&iwloc=A&hl=en\"> mufon case (23313) map </A>","Disposition":"Hoax","Weather Factors":"Unknown","Longitude":"-104.981093","Sighting Duration":"Undisclosed","Log Number":"US-05162010-0007","Country":"United States","City":"Denver","Object Shape":"Saturn-like, Star-like","Object Flight Path":"Straight-line path,Path with directional change","Case Number":"23313","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around May 15th 2010"],"Summary":"Looked like really really bright stars, over the course of a couple hours I saw 5","Region":"Colorado","Object Features":"Unknown","Date Submitted":"05/16/2010 11:55 UTC"}