{"Case Number":"23315","Weather Factors":"Unknown","Object Flight Path":"Other","Country":"United States","Source":"MUFON","divs":["Sighting DetailsMyself, a friend from back east, and another friend from Santa Barbara were on the roof of my friends approximately four story apartment building between the hours of 3:00 am and 4:00 am sometime in early July of 2009 when as we were talking, out of the corner of my eye and to the surprise of the other two individuals appeared out of nowhere and formed as if were being hand drawn in the sky the shape of a half rainbow. The color of the light was predominantly green but had essences of other colors within it. It happened over a residential neighborhood in Hollywood near the hills. There was no sound so I don't think it was a fire work nor any man made display of any kind, not to mention it was approximately 700 feet away around 60 degrees from directly in front of us. More disturbing than the suddenness of the incident was the duration, lasting only a few seconds; 30 seconds at most. As the greenish rainbow shape like vapor trail in the sky dissipated I could make out an object in my minds eye similar to that of a traditional grey saucer sinking just below tree level within the adjacent neighborhood, and just as it had come it was gone. The three of us looked at each-other in awe, silent for a few moments before I broke the silence in an attempt to quickly recap what just happened so we wouldn't forget it. I feel it is only natural human psychology to try to reason ones way into an explanation, much the way the brain can play tricks on you convincing you that things are there that aren't, on the flip-side it can also try to bend the truth so that the reality we find ourselves forced to process can fit into our definition of understanding and normalcy. I immediately said \"Did you see that? Don't forget what that was. We saw a light and a craft, did you all see the craft?\" They both nodded. My friend remarked, \"What does it mean?\" Having an inherent interest in the UFO phenomenon, i replied \"Nothing, they screwed up, maybe their shield came off, and we weren't supposed to see that.\" After all it was quite late, or early should I say, who are they to know anyone would be up here watching. I haven't talked to one of my friends since that night. I had a third friend who was with us that night, but he was downstairs inside and asleep. I told him what we had witnessed and without thinking twice he dismissed it as nothing more than a misidentified what have you. A week went by before he non-chalantly says to me; \"oh yeah, that green light thing you saw in the sky, I saw it too.\""],"Region":"California","Object Shape":"Disc","Tags":"City","Longitude":"-118.320181","Log Number":"US-05162010-0009","Object Features":"Unknown","Summary":"Bright predominantly green rainbow formed flash of light/vapor trail lead by silent silver disc shaped craft spotted by 3 witnesses over hollywood residential area between 3 and 4 am in July of 2009.","Latitude":"34.102629","map":"<A HREF = \"http://maps.google.com/maps?q=34.102629,+-118.320181(23315)&iwloc=A&hl=en\"> mufon case (23315) map </A>","Date Submitted":"05/16/2010 02:06 UTC","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/30/2009 12:00 UTC","Disposition":"Insufficient Data","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around June 30th 2009"],"files":["/var/www/straped/mufon/html2text/23315.html.txt","/var/www/straped/mufon/org/23315.html"],"Sighting Duration":"00:00:30"}