{"Object Flight Path":"Hovering then path","Date Submitted":"05/16/2010 07:00 UTC","divs":["Sighting DetailsI never took my mother for a big fan of science fiction, so naturally when I found a copy of Whitely Streiber's Transformation amongst her belongings, it raised some questions in me, It wasn't until I was old enough to appreciate the potential reality of the phenomenon that I became intrigued enough to ask her about why she had this book. As I can understand it, she had bought the book in an attempt to make peace with an incident that occurred before I was even alive. This is an account of that story that has been relayed to me on multiple occasions with absolutely no discrepancy over the years by my parents who to this day are shaken up about their close encounter of the second kind. On the evening of early June 1984, my mother and father joined some family friends at their summer place in Cape Cod for dinner. Everyone has finished their meal and by now are sitting outside within a terrace facing a lake. The couple my parents had come to visit has a young son about seven years old who because it was around 11 o'clock was being put to bed by the wife upstairs. It was then that my mother, father and the husband of the couple were outside conversing when out of nowhere an all encompassing sound of bass that seemed to surround them as if they were placed within a bubble began to sound. My father recalls it reminded him of \"someone smashing metal objects clanking up against a garbage dumpster with a sledgehammer\". My mother was four months pregnant with me at the time and recalls saying out loud \"just go away, please don't hurt my baby\". She recalls an immediate onset of life ending fear followed by a wave of calm, which in her own words she suggests was her \"acceptance of going to the other-side\", referring to the afterlife I assume. After about 30 seconds of this unbelievable sound, it stopped whereupon my father noticed what he described as a \"silver flying saucer with six or so windows\" hovering in the sky\". I asked him for a frame of reference how far he estimated it was and how big it might have been and he states that it was just over the lake and with the moon visible in the sky, perhaps 100 yards away, making it in his own estimate between 40 o 50 feet in diameter, but couldn't say for sure. he recalls the husband counting out loud on his fingers from 1 to 9, before the craft moved from a completely stationary position to shooting off into space, and within in an additional few seconds had completely disappeared. The strangest part is yet to come; When the wife of he couple came back downstairs to rejoin the group, she found a room of stunned people. She asked what was going on and thinking she was joking my mother replied \"Yeah right, very funny\", or something to that decree. She hadn't heard a thing. This made no sense. She was upstairs putting her son to bed and had absolutely no experience to any affect whatsoever. I continued to probe my parents with questions about this incident for years to come. First of all they were miles from any town or civilization, a private dirt road through the forrest being the only means to which once could reach the house., so the possibility of some earth terrain vehicle is easily dismissible, especially since the sound came from directly overhead and seemed to surround them. There was however a military base somewhere in the town in which they tried to contact the following morning to ask if there had been any test flights to which they said there hadn't been. Whether this craft was man made, or of extraterrestrial origin and even charted on radar is another mystery. The aftermath of the incident was unfortunate. The husband of the couple my parents went to visit was a man of intelligence and concrete thinking as he taught philosophy at a prestigious university. After this incident, he refused to speak one word about it to my parents dismay who at the time were trying to make some sort of sense out of it. He refused to accept the reality of what had happened as I can imagine it shook the foundation of he world around him tat he had come to know and accept. The couple and m parents stopped being friends after that night and haven't spoken since. To this day I am fascinated as to what might have happened with the craft considering I was in developmental stages of being formed, and what they might have wanted to do."],"City":"Cape Cod","Latitude":"41.679413","Region":"Massachusetts","Object Features":"Dome, Window(s)","Tags":"City","Weather Factors":"None","Country":"United States","Log Number":"US-05162010-0016","Sighting Duration":"Undisclosed","Summary":"Metallic disc shaped craft seen following deep bass sound heard over house in Cape Cod, Massachusetts during the summer of 1984.","Longitude":"-70.210334","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.679413,+-70.210334(23322)&iwloc=A&hl=en\"> mufon case (23322) map </A>","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/23322.html.txt","/var/www/straped/mufon/org/23322.html"],"Source":"MUFON","Date of the Event":"05/31/1984 11:30 UTC","Case Number":"23322","trends":["There have been no other sightings in Cape Cod","This sighting has never been favorited."],"Disposition":"IFO"}