{"files":["/var/www/straped/mufon/html2text/23328.html.txt","/var/www/straped/mufon/org/23328.html"],"Date of the Event":"05/16/2010 09:04 UTC","trends":["There have been 19 other sightings in Panama City","There was one other sighting in Panama City on or around May 16th 2010"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.165123,+-85.657816(23328)&iwloc=A&hl=en\"> mufon case (23328) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Region":"Florida","Object Features":"Undisclosed","City":"Panama City","Object Shape":"Circle, Star-like","Latitude":"30.165123","Weather Factors":"Unknown","Log Number":"US-05162010-0022","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Summary":"Floating object that dissapeared slowly.","Date Submitted":"05/16/2010 11:05 UTC","Country":"United States","Longitude":"-85.657816","Case Number":"23328","divs":["sighting detailsmy husband and i were out for a short walk after dinner in our neighborhood when we both stopped in the middle of our conversation. we both looked up and saw this circle of light moving slowly across the sky. obveiously we believed it was some sort of airplane and so we both stopped to take a listen. all we could hear was the buzzing noises of an air conditioner. we live right beside the airforce base. to make you understand we know the differences in the noises of an airplane. my husband has also first hand experience because he works on aircraft. to conclude my story i had to add that information so that its understood that both of us have never encountered anything of this sort. the \"aircraft\" was low hovering above the tree tops almost looked like the brightest star in the sky. this object appeared to be roughly 300 feet above the tree tops. we never heard a noise of an aircraft engine and then it dissapeared shortly after a car drove past. i personally don't know what to make of this considering i truely never believed in this sort of thing. after this experience i'd truely love some real answers. i only wished i had a camera\\mini dvd. thank you for taking the time to read my post."]}