{"files":["/var/www/straped/mufon/html2text/23320.html.txt","/var/www/straped/mufon/org/23320.html"],"Summary":"my wife and i witnessed a triangle moving across the sky, while looking at the big dipper.","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Carpinteria","There were no other sightings in Carpinteria on or around May 13th 2010"],"Date of the Event":"05/13/2010 12:00 UTC","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-05162010-0014","divs":["sighting detailsmy wife and i were coming back home after a after dinner walk around our nieghborhood.the sky was clear and the big dipper was up there in all its glory. i pointed it out and she got it. i was then going to show her the arch to arcturus speed on to spica thing you can do. as i moved my head back to do this,a movement caught my rt eye. i thought it was going to be a satillite and got exited to show wife something she's never seen. i started to say hey baby look a satil---,i stopped and pointing up and said, what is that? it was a triangle you could see the outline of a percect triagle moving thru the sky. in its corners was a faint gray\\blue\\white light more gray and white than blue. the lights where also triangle shaped. it moved from my back [southwest] to my front [northeast] curving slightly to east before fading out of view. the ufo was silent,no other lighting,it didnt appear to have a shadow. it seemed almost see thru there was a aura about it. you could clearly make out the outline and lighting. my wife asked if it was an owl ,i said no owl, triangle. we asked each other agian what is that. by then it moved out of our view. what did i think at 1st satillite,then quickly realizing not. my mind thought omg is this a possible ufo,but at the same time saying out loud,what is that? my wife and i were exited and thankfull we both saw it together our own witness. we've talked about it since we both agree we saw what we saw,we will never forget this."],"Longitude":"-119.515496","Region":"California","Sighting Duration":"Undisclosed","City":"Carpinteria","Latitude":"34.402294","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"23320","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.402294,+-119.515496(23320)&iwloc=A&hl=en\"> mufon case (23320) map </A>","Date Submitted":"05/16/2010 04:46 UTC","Object Features":"None","Country":"United States","Disposition":"IFO","Object Shape":"Triangle"}