{"trends":["There have been 8 other sightings in Loveland-Madeira Corridor","There were no other sightings in Loveland-Madeira Corridor on or around May 16th 2010"],"Longitude":"-84.256886","Disposition":"IFO","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23339.html.txt","/var/www/straped/mufon/org/23339.html"],"Sighting Duration":"Undisclosed","Region":"Ohio","Date Submitted":"05/17/2010 10:37 UTC","Summary":"4 Lights moving counter-clockwise in a circle, stop, converge into one, diverge and repeat the process.","Object Flight Path":"Path then hovering,Other","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Log Number":"US-05172010-0010","map":"<A HREF = \"http://maps.google.com/maps?q=39.275208,+-84.256886(23339)&iwloc=A&hl=en\"> mufon case (23339) map </A>","Date of the Event":"05/16/2010 01:30 UTC","Object Features":"None","Latitude":"39.275208","Case Number":"23339","divs":["Sighting DetailsAt 1:30AM the morning of May 5, 2010, I was travelling home from a friends house. While travelling south, I observed a bright light moving in a curved fashion across the sky between the trees. From the road, I used my forefinger and thumb and found the light was about the size of a quarter and fairly far off to the south. It appeared to be moving inside the clouds as it was not a sharply defined orb, but fuzzy around the edges much like aircraft lights seen through the clouds. Upon traveling furthur south along the roadway and my view was no longer obstructed by the trees around me, I discovered a second, then a third and finally a fourth, identical, orbs. The lights all rotated clockwise in a circle around an arbitrary point. After one and a half rotations, the four lights stopped momentarily and converged to a central point. At the central point, the four lights again paused for a moment, then returned to their positions and proceeded to rotate, again, counterclockwise. This pattern continued until I lost sight of the occurance as I travelled west. My first thought was that the lights were spot lights coming from the downtown area. The lack of any apparent column of light that would be visible from a spotlight soon dispelled any thought that they were spotlights."],"City":"Loveland-Madeira Corridor","Tags":"City","Object Shape":"Circle"}