{"Country":"United States","divs":["Sighting DetailsI left my home at 11:45 AM or so to walk to the Greenwich library that opens at 1PM on Sundays .94 miles from my home. Weather was 70 degrees farenheit with blue skies, partly cloudy-a beautiful day. Three quarters of the way to the library is the Presbyterian church on Putnam ave at the top of Greenwich ave. at Lafayette Place with a green bench and kiosk in front on the street facing south and Greenwich ave. I sat down checked my watch (12:08) to determine how long I could sit and enjoy the sunshine before the library opened. I turned my face upward to the sun, I had on dark sunglasses. To the right in my field of vision I noticed a thin white contrail approximately 4 inches long traveling from my right to left above the clouds. It was traveling very fast and what was creating the contrail could not be discerned it was just a thin fast moving white line. I watched it travel across my field of vision for a few seconds before I realized what is wrong with this picture? The contrail was not changing merely moving across the sky from my right to my left above me (my head was angled up)it did not lengthen and disperse change color or intensity that I could see with the naked eye as the contrail moved across the sky. As I continued to watch there was a brief flash of silver I could make out it had shape as if the object had banked briefly then righted itself. A short time after it made a angled turn (contrail)west,upward and away until it disappeared. Have no idea what it may have been maybe a new aircraft unknown as yet to the general public. Shortly after it disappeared I noticed a jet flying considerably lower and slower flying north over my head. I then rose and continued walking west on Putnam to the library. I do not consume alcoholic beverages."],"Case Number":"23331","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.001764,+-73.665683(23331)&iwloc=A&hl=en\"> mufon case (23331) map </A>","Sighting Duration":"Undisclosed","Disposition":"IFO","Object Features":"Unknown","Summary":"Strange contrail brief silver flash very high in the sky","Date of the Event":"05/16/2010 12:08 UTC","Log Number":"US-05172010-0002","Date Submitted":"05/17/2010 10:19 UTC","Longitude":"-73.665683","Source":"MUFON","Region":"Connecticut","trends":["There has been one other sighting in Port Chester","There were no other sightings in Port Chester on or around May 16th 2010"],"Object Flight Path":"Path with directional change","Latitude":"41.001764","files":["/var/www/straped/mufon/html2text/23331.html.txt","/var/www/straped/mufon/org/23331.html"],"City":"Port Chester","Viewing Distance":"Unknown","Object Shape":"Unknown"}