{"Tags":"City","Object Shape":"Circle","Weather Factors":"Unknown","Latitude":"39.086568","Date of the Event":"05/15/2010 10:30 UTC","Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around May 15th 2010"],"Region":"Kentucky","Summary":"Hundreds of pulsating lights going across the Sky","Case Number":"23332","Date Submitted":"05/17/2010 11:55 UTC","files":["/var/www/straped/mufon/html2text/23332.html.txt","/var/www/straped/mufon/org/23332.html"],"City":"Cincinnati","Country":"United States","Longitude":"-84.521961","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.086568,+-84.521961(23332)&iwloc=A&hl=en\"> mufon case (23332) map </A>","Log Number":"US-05172010-0003","divs":["Sighting DetailsI am hoping someone else saw this Saturday night. I was at a birthday party and around 10:30 We were all on the front porch of a my friends house in Ft. Wright Kentucky and someone there pointed I think it was the southwest direction and we saw hundreds of pulsating lights going across the sky. It looked like a plane would look at night but there were hundreds of them. It was a cloudy night so they were definitely traveling under the clouds pretty slowly across the horizon. We lost sight after they traveled behind the treeline across the street. After the majority of them were behind the treeline we would see a couple here and there trailing behind. I have never in my life seen anything like that before. I have been searching on the internet to see if I can find anything on it but have not had any luck. I e-mailed the Cincinnati Observatory but have not gotten a response from them either. I know I am not crazy. Everyone else at the party saw it too. If anyone has any answers, please let me know. It is driving me nuts. I tried to take a video with my phone but it did not work. Thanks for your time."],"Object Features":"Unknown","Disposition":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed"}