{"Object Features":"Undisclosed","City":"Portland","Date Submitted":"05/18/2010 01:51 UTC","Object Shape":"Circle, Fireball, Star-like","Source":"MUFON","Log Number":"US-05182010-0001","divs":["Sighting DetailsDriving home from school, I was on a high over pass and noticed a redish, orange ball of light thinking it was an airplane ailing toward Portland's airport. It was moving slowly, so i thought it was a helicopter, then i saw another behind it, i thought two airplanes, both reddish, orangish, moving from SE to NW, toward airport and perpendicular to Holgate, the road i was on. When i saw two more I stopped the car on the top of the over pass, putting my flashers on to watch it. The color was not like an airplane, i thought of fire, or flares. I had an unobstructed view of entire sky line. then 4 more showed up, again in a line, like airplanes in a holding pattern. there were so many, i counted about 10 and had to move my car because of traffic, i pulled to a side street and continued to see them between buildings. parked and watched the first three that i saw them change direction and appeared to fly up and into the clouds, the middle one became faint, we had high cloud cover and i could tell it was going up into the clouds and the other two went as well. The rest, when i looked were gone as well. My feelings: first I thought airplane, but the wrong color..wondered if i saw a blinking light, but it was not a blinking light it was an irregular redish, yellowish steady light, maybe a little, flicker. then I thought there were too many, i felt uncomfortable, called my daughter, which is why i know the time. i was also uncomfortable because the horizon was clear and then it was filled with these objects. action and motion. irregular formation of a line, with irregular spacing between objects, moving in SE to NW direction, then 3 went up."],"Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/23343.html.txt","/var/www/straped/mufon/org/23343.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.529472,+-122.673327(23343)&iwloc=A&hl=en\"> mufon case (23343) map </A>","Longitude":"-122.673327","Weather Factors":"Unknown","Case Number":"23343","Latitude":"45.529472","Date of the Event":"05/17/2010 10:09 UTC","Object Flight Path":"Path with directional change,Path then hovering","trends":["There have been 158 other sightings in Portland","There were 2 other sightings in Portland on or around May 17th 2010"],"Viewing Distance":"Unknown","Summary":"1 then 2 then several, i counted 10, objects moving over Portland, lined up like a holding pattern for airplanes moving from SE to NW, then moved up.","Country":"United States","Disposition":"IFO","Region":"Oregon"}