{"Object Shape":"Fireball","Disposition":"Unresolved","Weather Factors":"None","Latitude":"40.722503","Object Features":"None","files":["/var/www/straped/mufon/html2text/23342.html.txt","/var/www/straped/mufon/org/23342.html"],"Case Number":"23342","Object Flight Path":"Straight-line path","Log Number":"US-05172010-0013","Region":"New York","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.722503,+-73.999583(23342)&iwloc=A&hl=en\"> mufon case (23342) map </A>","Longitude":"-73.999583","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around May 15th 2010","This sighting has never been favorited.",""],"Tags":"City","divs":["sighting details on satuarday evening may 15th 2010 approx 9:15 i was walking north east one block west of bellmore ave i noticed a reddish dark orange ball in the sky moving south east of bellmore ave. i followed it about one block south when it appeared to stop over a house then it dissapeared. i then went back one block north then turned right {north east) when i observed two more balls one following the other comming from the north going south.i went and got my mother,and the two of us observed the two balls from our back yard treaveling south.when the first one dissapeared two more balls appeared from the same direction as the first two and went south .this happened maybe three times for a total of eight or ten objects they were moving kinda slow and each pair were evenly spaced apart the balls were dark orange and red swirling around inside.it looked like an orange red liquid marble of fire. at some point i decided to get my video camera but by time i got back outside the last one was gone. we waited and watched for about 15 to 20 minutes but there were no more balls. we went in the house and in total disbeleif what we just saw wanted to report it but didnt know where to call. after a little while i went home{directly across the street from my mothers house where the second sighting took place} i realized i needed milk so i went back to my mothers house to borrow a glass of milk, as i crossed the street i looked towards the direction the balls were comming from....and there was another ball going in the same exact direction as the others.so i ran in the house and got my video camera and managed to get about thirty seconds or so of the ball. attached is a copy of the footage, the video looks a bit different then it did with my eyes it may have been because of the settings on the camera the date and time setting on the camera is incorrect i have not erased the original video in the camera or changed the settings so if it's necessary to test the camera. please feal free to contact me for any questions thank you [cms\\tg\\pid]"],"City":"New York","Source":"MUFON","Date Submitted":"05/17/2010 11:34 UTC","Date of the Event":"05/15/2010 09:30 UTC","Sighting Duration":"01:00:00","Viewing Distance":"501 Feet - 1 Mile","Summary":"wittnest 8 to 10 orange red balls of fire"}