{"divs":["Sighting DetailsI was a passenger in a car with three companions. We we traveling south on a country highway a few miles outside of town. Directly in front of us (in line with the road), at an unknown distance, a light appeared in the sky, falling toward the ground. The driver said \"Oh look, a shooting star\". I was sitting in the back seat and the object was high enough in the sky that I had to learn forward quite a bit to see it. At first, it did in fact look just like a shooting star, falling quite fast and appearing to burn out after approximately one second. It reappeared after a very brief pause (less than 0.5 seconds) and began to shine much brighter and fall much faster. It also appeared to be getting quite a bit larger, but whether the object was actually expanding or just getting closer to our position is unknown. At this point, I said \"it must be fireworks or something.\" To which one of my companions replied \"There's no way, it was way too high\". The white light then turned to green and it continued to get brighter and fall at a very fast rate of speed, before either burning out or falling past the horizon (the darkness and unknown distance made it difficult to tell). Overall, it was a very brief sighting, but for the sake of context, after the driver first saw it, I had time to react, change my position in order to see it, and have a brief exchange with my companions all while still viewing the object."],"Case Number":"23357","Disposition":"Unresolved","Source":"MUFON","Region":"Ontario","Summary":"Bright light falling from the sky","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.354463,+-78.739314(23357)&iwloc=A&hl=en\"> mufon case (23357) map </A>","Object Features":"Unknown","Tags":"City","Log Number":"CA-05182010-0015","Longitude":"-78.739314","files":["/var/www/straped/mufon/html2text/23357.html.txt","/var/www/straped/mufon/org/23357.html"],"trends":["There have been 4 other sightings in Lindsay","There were no other sightings in Lindsay on or around May 18th 2010"],"Latitude":"44.354463","Weather Factors":"Unknown","Date of the Event":"05/18/2010 09:30 UTC","Country":"Canada","Viewing Distance":"Unknown","City":"Lindsay","Object Shape":"Fireball, Star-like","Sighting Duration":"00:00:04","Date Submitted":"05/18/2010 10:11 UTC"}