{"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","trends":["There have been 11 other sightings in Clearlake","There were no other sightings in Clearlake on or around May 17th 2010"],"Longitude":"-122.622673","Log Number":"US-05182010-0017","Date of the Event":"05/17/2010 02:59 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.964361,+-122.622673(23359)&iwloc=A&hl=en\"> mufon case (23359) map </A>","Case Number":"23359","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"I have been watching bright lights in this valley for weeks now!","Object Shape":"Oval, Sphere, Star-like","Latitude":"38.964361","Source":"MUFON","Object Features":"Undisclosed","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Clearlake","Tags":"City","Country":"United States","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/23359.html.txt","/var/www/straped/mufon/org/23359.html"],"Date Submitted":"05/18/2010 10:28 UTC","divs":["Sighting DetailsIt started weeks ago, these small BRIGHT lights appearing at night in my back yard. Then I started noticing them in the hills surrounding us. (This is a very small valley). They move around in the early morning hours. Last week I saw the most beautiful lights rotating around something on the hill, I had never seen such pure white lights! After about 30 min. only two lights remained at that spot. Some of the lights are also golden in color. My family has also seen the lights late at night soaring across the skies. They look like stars at first but then they zig zag around often disappearing. I have lost alot of sleep lately to be sure. During my hike around the valley thismorning, I noticed for the first time what I nicknamed \"Lake county crop circles\" The grasses are about 1.5 ft high right now and it looks like something has just pressed them down in odd rotations. NO animal has done this, trust me. They are ALL over the valley where I live. I have never seen anything like it around here. I believe I counted 32 of them and this is in a small area around my house. I have also seen what I thought were stars flash very bright, sometimes red but mostly white. They either stay in place or fly away after. I am not sure what is going on here in Hidden Valley, but whatever it is, it is increasing. I have only shared this with family as I DO NOT want them to be scared away. And I cannot believe my neighbors havn't noticed! People just dont even look up anymore, they are so into their own heads. About 3yrs ago my daughter and I were driving near a naval weapons stn. in Concord, Ca and we saw the hugest black UFO between two hills...just hovering! So we are not new to this concept. Please write back soon, something is going on around here and like I said it is increasing. But I do not want a bunch of nosy looky loos coming around scaring them away! I would really like to discuss this with Bill Birnes but do not know how to contact him..."]}