{"Object Flight Path":"Stationary","Source":"MUFON","Tags":"City","Case Number":"23351","divs":["Sighting Details I was driving in Union City, Tennessee, on a sunny Spring day around noon sometime in the mid-1990's. (It's hard for me to remember the exact date. I think it was sometime in April of 1995, but it could have been 1994 or 1996.) I had been running an errand for my boss and was on my way back to my workplace in a nearby city. While waiting at a traffic light in Union City, I suddenly noticed an extremely bright light in the sky in the direction that my car was pointed (toward the south). The light was white in color, small, round, and, seemingly, stationary. It was not blinking or twinkling and there was no other light near it. I could not hear any sound from it, but I was in traffic which could have masked a sound (assuming that it made one). I know that it was not the moon or an effect from the sun. It was not directly overhead and not near the sun. It seemed to be very high in altitude. There was not a cloud in the sky, so I had a perfect view of it. I was able to watch it for a few minutes, as the traffic light was taking a long time to turn green. My first thought was that it must be an airplane, but I was puzzled by a few things. If it was a plane, why would the pilot turn on one bright light in the daytime? The object was not low enough in the sky to land, so I wouldn't think that it was a landing light. Also, the light was not blinking and not red in color, as is usually seen on most aircraft. And, even though it seemed small in size due to its distance from me, it looked somewhat bigger than the usual lights that you see on aircraft. As I was wondering about all of this, the light suddenly disappeared! It was as if someone had turned off a light switch. Another strange thing was that I could not see a shape of a plane (or anything) when the light went away. If it was a light from a plane and it was close enough that I could see the light, wouldn't I be able to see a shape or silhouette when it went off? There was nothing there but clear blue sky! To be clear, the light did NOT streak across the sky or trail off like a meteor, so I know it wasn't that. It simply disappeared. The traffic light finally turned green and I went on my way back to my job. I never saw that light or any light similar to it again. I had expected to hear something about this on the local news later, but I didn't hear anything about a light in the sky. No witness reports, no mention of meteor showers, no reports of storms in the area...nothing. I only told my brother about the light and no one else, for fear of ridicule or someone just dismissing it as an airplane. (My brother is more accepting of mysteries like that, whereas most people just look at you strange if you tell them something like this.) I have read many reports of UFOs in books and magazines over the years, but that was the first time (and, so far, the only time) that I saw something strange myself. I never found out what that light was and I still wonder about it from time to time."],"Object Features":"Unknown","Disposition":"Insufficient Data","Object Shape":"Sphere","Longitude":"-89.05101","trends":["There have been 3 other sightings in Union City","There were no other sightings in Union City on or around March 31st 1995"],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/23351.html.txt","/var/www/straped/mufon/org/23351.html"],"Country":"United States","City":"Union City","Summary":"Sighting of white light during daytime","Latitude":"36.43171","Log Number":"US-05182010-0009","Date of the Event":"03/31/1995 12:00 UTC","Region":"Tennessee","Date Submitted":"05/18/2010 05:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.43171,+-89.05101(23351)&iwloc=A&hl=en\"> mufon case (23351) map </A>","Weather Factors":"None","Sighting Duration":"00:03:00"}