{"Date Submitted":"06/08/2003 11:15 UTC","Summary":"Thousands of wavy lights.","Object Shape":"Unknown","Date of the Event":"06/08/2003 11:15 UTC","Country":"United States","trends":["There have been 56 other sightings in Buffalo","There was one other sighting in Buffalo on or around June 8th 2003"],"divs":["Sighting DetailsAt this time me and my brother james decided to just go outside and hangout. Welive in a suburban area where there is just mostly houses. There is an airportnear us, so we usally look at the planes crossing above. I knew at first theobject wasnt a plane, but the thing about it was that it wasnt alien either. Itwas almost too advanced to be alien. This wasnt a regular sighting. It wasnt oneof those little disks that just you see and then it disapears across the sky. Itwas like a flowing light. It was white and blue. Not a comet. It almost lookedlike the northern lights except even more beautiful. Strange, but i felt soloving while watching this and a sense of calmness after, as if everything isgoing to be alright. The object flowed like a river. No sudden movements or jutsjust calm and relaxing. You could think of it as the most luxurious car in theuniverse. It was slow then raised up still slowly until it was nothing more. Ican explain what i saw it just to beautiful to do so. The computer amazinglywent too fast after that. Things were downloading when we didnt even have acable or DSL line. You can describe it weird, but it was almost too good."],"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.889767,+-78.874829(2335)&iwloc=A&hl=en\"> mufon case (2335) map </A>","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/2335.html.txt","/var/www/straped/mufon/org/2335.html"],"Source":"MUFON","Latitude":"42.889767","Longitude":"-78.874829","City":"Buffalo","Disposition":"Hoax","Region":"New York","Case Number":"2335","Viewing Distance":"21-100 Feet","Tags":"City","Log Number":"","Sighting Duration":"00:10:00","Object Features":"Louvres"}