{"Region":"Florida","Date Submitted":"05/18/2010 10:27 UTC","trends":["There have been 10 other sightings in Punta Gorda","There were no other sightings in Punta Gorda on or around May 18th 2010"],"Sighting Duration":"Undisclosed","Date of the Event":"05/18/2010 09:10 UTC","Tags":"City","City":"Punta Gorda","Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","divs":["Sighting DetailsI came home from dinner and was my letting dog out and as usual I stargaze when the stars are visible. So I noticed one bright star that is always there and was looking around and noticed another bright star towards the airport and also noticed there was lots of air traffic, lots of blinking plane lights out in the sky. Looking around for a few minutes I noticed a bright star within eyesight of the usual bright star which I didnt notice a minute before, then I stared at it and noticed it was moving, but I stared to look for the blinking airplane lights. It was still at a distance so I thought it was a plane that was too far for me to notice the blinking lights. I continued to stare at it and realized it was a lot closer then I thought it was. Around this point I thought I might be looking at a UFO but was still doubtful because the sky seemed blurry or cloudy so it looked like the light was twinkling still like a star which it looked like except it was moving as fast as a far flying plane. At this point I decided to call my friend from out of the house and started yelling her name but she didnt hear me, so I stared a few seconds longer deciding if I should keep staring at it or go in the house to tell my friend so I ran in the get her and we ran back out and then she reminded me to get my green laser pointer(which supposedly shoots a light two miles) to point it at it so I ran back in to get it, when I was in the house this is when my friend said the light came down fast about a quarter of the total height and was yelling at me to hurry, so I got out to the driveway and of course my laser pointer isnt working so as I'm aiming and pointing the button at the ufo(I guess) the light went towards a thin looking cloud and either dissappeard or the light went out and then that was it. We waited to see if it would come out of the other side of the cloud which wasnt thick or very big so this is my reasoning for thinking it for sure is not a plane. No sound or anything either. Afterwards we were both pretty excited and still wanted to look around but the mosquitos were bad so my friend went in and took the dog in and I stayed out until 10pm then came to the computer to see if anybody has seen this around here but nothing that I'm aware of."],"Object Flight Path":"Path with directional change","Source":"MUFON","Log Number":"US-05182010-0016","Longitude":"-82.040766","Case Number":"23358","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/23358.html.txt","/var/www/straped/mufon/org/23358.html"],"Latitude":"26.934544","Country":"United States","Weather Factors":"Does Not Apply","Summary":"light came from the airport then appeared next to bright star, flew overhead, then disappeared behind a thin cloud.","map":"<A HREF = \"http://maps.google.com/maps?q=26.934544,+-82.040766(23358)&iwloc=A&hl=en\"> mufon case (23358) map </A>","Object Features":"Unknown"}