{"Viewing Distance":"Unknown","Longitude":"-81.664802","Object Flight Path":"Unknown","Sighting Duration":"Undisclosed","Case Number":"23354","City":"Boone","Object Features":"None","divs":["Sighting DetailsI did not see these orbs at the time these two photos were taken. What I have are 2 photos taken about one minute apart. I will be as descriptive as possible but since I did not actually see these, you are seeing just as much as I did by looking at the photos I have attached. I will not call them UFO's because they don't appear to be solid objects, only points of light. I hope they will still be of interest. I am a full time breakfast manager in a restaurant. These photos were taken out of the drive thru window a little after 7am on Saturday, May 15th. The window was open. You can see the roof in the upper righthand corner and the roof of another restaurant across the parking lot. I take photos of the sunrise with my camera phone at least twice a week to send to my boyfriend in a good morning message. I've been doing this for at least 4 months. The camera is 3.2 megapixels with autofocus and I have never had any abnormalities on any of the photos (taken before or since) even under similar lighting conditions. These are the only 2 photos out of at least a hundred to ever have orbs appear in them. It is important to note that I did not see these objects at the time the photos were taken. I didn't notice until later that evening when I was about to delete them from my phone. This does not mean that they weren't visible, but the reason I took the pictures was because of the (4) trails left by planes that were streaking across the rising sun. When looking at the sky, it was too bright to see anything other than the sunshine. The 2nd photo was taken about a minute after the first photo. I am not 100% sure of the time inbetween photos but you can see the top (plane) trail is much longer in the 2nd picture than in the 1st picture. In the 1st photo the object is 2 circular lights that do not appear (to me) to have a solid form. In the 2nd photo they have a purple glare, or possibly lights coming out of the sides. I think they have moved in the sky but they remain at the same angle and the same distance apart. All I have are these photos. I have not altered them in any way. I attempted to overlap the two using MS Paint to determine whether they moved in the sky. I believe they did but I have not included that picture. Again, when you see these two photos you are seeing exactly what I saw since I did not see these until I looked at the photos later that evening. I hope they are helpful or at least interesting."],"Source":"MUFON","Log Number":"US-05182010-0012","Region":"North Carolina","Latitude":"36.221795","map":"<A HREF = \"http://maps.google.com/maps?q=36.221795,+-81.664802(23354)&iwloc=A&hl=en\"> mufon case (23354) map </A>","Tags":"City","Date Submitted":"05/18/2010 07:31 UTC","Disposition":"Insufficient Data","Summary":"Two circular lights, appeared side by side in front of sun, visible in photos","Weather Factors":"None","trends":["There have been 11 other sightings in Boone","There were no other sightings in Boone on or around May 15th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/23354.html.txt","/var/www/straped/mufon/more/23354_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/23354_submitter_file2__ufo2.jpg","/var/www/straped/mufon/org/23354.html"],"Country":"United States","Date of the Event":"05/15/2010 07:10 UTC","Object Shape":"Circle, Flash, Star-like"}