{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=26.159519,+-97.990837(23366)&iwloc=A&hl=en\"> mufon case (23366) map </A>","Country":"United States","Latitude":"26.159519","Log Number":"US-05192010-0005","divs":["Sighting DetailsMe and my sister were sleeping at my older sister's home because my parents had gone on a trip.Her house was close to a canal and you could view it from her window.I was asleep on the floor,and I woke up for some reason and looked out the window and saw this white globe that resembled a glow of light from a lantern,which I thought that was what it was at first. But then I saw that the object was floating over the canal,and I got curious to what it could be.After a quick analysis of the matter,I suddenly realized that there was no way someone could be holding up a lantern over the water unless they were flying in the air.The object would slowly move from one side of the canal to the other,then it would slowly lower down,as if looking for something. That is when fear struck me,and I dived under the bed sheets,and began to shake with fear hoping that whatever it was would go away.I must have fallen asleep because that's all I rememeber.I didnt tell anyone about this for a long time.I was just a kid when it happened, right now I am 65 and I remember everything vividly.After this incident,I had three other unexplained experiences.One was around 1956 after we had moved to Corpus Christi.It was around 9 p.m. and I was coming from the corner store,and happened to look up at the sky,which was clear with stars twinkling.Then I noticed what looked like a very tiny meteor,zigzagging from one star to another.I thought to myself thats not possible,but strange.That night I woke up after everyone was asleep,and when I tried to move I couldnt.I tried to move my arms and couldnt,then I tried to move my head to call my mom,and couldnt talk.I could see her room,which was around the corner from my room,but I couldnt do anything.I became very frightened about what was happening to me but I couldnt do anything.I finaly must have fell asleep. The next experience was 3 year later,and we had just moved to another apartment close by.My bedroom was on the second floor,and I remember I was half asleep,to the sensation that I was going out the window.Then I remember waking up,and realizing that I was floating in the air above the trees,and I could see the telephone poles,with the lights.I remember being very frightened and wanting to go back to my room,like trying to forse myself to turn around and go back.Years later I told that to my wife because my parents were not very understanding of my experiences.For a lot of years I kept this to myself because it didnt make sense.I dont know if all these incidents are connected to what I saw that night in Weslaco."],"Date of the Event":"06/20/1953 02:00 UTC","Sighting Duration":"Undisclosed","Date Submitted":"05/19/2010 05:55 UTC","files":["/var/www/straped/mufon/html2text/23366.html.txt","/var/www/straped/mufon/org/23366.html"],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Region":"Texas","Object Shape":"Sphere","Object Features":"Undisclosed","City":"Weslaco","Case Number":"23366","Disposition":"Unknown","trends":["There has been one other sighting in Weslaco","There were no other sightings in Weslaco on or around June 20th 1953"],"Summary":"white globe object gliding above canal","Longitude":"-97.990837"}