{"Tags":"City","Case Number":"23361","Viewing Distance":"Over One Mile","Country":"United States","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.632792,+-90.195444(23361)&iwloc=A&hl=en\"> mufon case (23361) map </A>","Weather Factors":"Unknown","Latitude":"38.632792","divs":["sighting detailson a path from south to north a bright light, at 9:55 pm cst, in north western sky, flared up like a flash, as if coming through atmosphere, then dimmed down for a few seconds and in a straight lined heading north. white iss not to fly over tonight wed may 18, 2010, nor was it a satellite which are visible longer with a reddish hue usually, or a plane unless it turned off all faa blinking lights, nor a meteorite cause there was never a tail. visibility was very clear. flash was as bright as the iss flyovers, then dimmed out slowly, slower moving than a meteorite, was traveling as fast (top speed) or a little faster as a commercial airliner but no faa lights just one solid white circular\\ ball like, and too big to be a normal commercial airliner at the distance. live 10 miles from airport and see flights all the time. also came through right before the brightest star of virgo. no other commercial traffic for a couple of hours as i live 10 miles away from st.louis airport, and no flyovers of commercial i've seen in an over an hour. at the distance it was at 10-12 miles away compared to normal comercial traffic it would have been the size of 4-5 707 airplanes for as big as the white circular ball like size."],"Log Number":"US-05182010-0019","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23361.html.txt","/var/www/straped/mufon/org/23361.html"],"Longitude":"-90.195444","Object Flight Path":"Straight-line path","Date Submitted":"05/18/2010 11:57 UTC","Date of the Event":"05/18/2010 09:53 UTC","City":"St Louis","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around May 18th 2010"],"Sighting Duration":"00:00:40","Object Shape":"Circle, Sphere, Star-like","Disposition":"IFO","Object Features":"Other","Summary":"A Bright white circle , First it flashed then dimmed out, came out of nowhere"}