{"Object Shape":"Unknown","Longitude":"-99.899193","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.975889,+-99.899193(2336)&iwloc=A&hl=en\"> mufon case (2336) map </A>","Tags":"City","Date of the Event":"02/03/2003 01:01 UTC","Case Number":"2336","Country":"United States","divs":["Sighting DetailsI NEED IMMEDIATE ACCESS TO A FULLY FUNCTIONAL STARGATE OR OTHER SIMILIARTECHNOLOGY. I AM LOOKING FOR A BENEVOLENT SPECIES TO PROVIDE THIS FOR ME. I HAVEHEARD THAT ALIENS MIGHT HAVE THIS , BUT I DO NOT CARE WHERE I GET IT FROM.ALIENS , GOVERNMENT , MILITARY. A FRIEND OF MINE ONE DAY OUT OF THE BLUE AFTERWORK TOOK AN OVERDOSE OF ANTI DEPRESSENTS AND OTHER MEDICATIONS AND WOKE UP INTHE LOCAL HOSPITAL. HE WAS THEN IN THEARAPY, HE THEN GOT ON SSI AND WILLEDHIMSELF INTO HELL ON EARTH. HE ALSO PHYSICALLY BEAT HIMSELF UP PRODUCING SOMELIFE THREATINING MEDICAL PROBLEMS. HE IS THROWING UP EVERDAY AND HAVINGSWALLOWING PROBLEMS ALONG WITH HAVING BREATHING PROBLEMS AND HEADACHES AND ASTOMACH ACHE HE IS NEAERLY PASSING OUT EVERDAY THEN HE GOT INTO A SERIOUS AUTOWRECK AND WAS IN A LESS SERIOUS ONE HE FELLS LIKE SHIT EVERDAY. HE IS SICKEVERDAY MY FRIEND AND I WANT HIM BACK AT HIS PEACEFULL JOB. AND FORGET HECREATED THESE PROBLEMS SO THE IDEA HERE IS TO GO BACK AND HEAD THIS PERSON OFFAT THE PASS AND PREVENT THESE UNFORTUNATE ACTS NEED THIS TECHNOLOGY TODAY THANKYOU WOULD BE AN ACT OF MERCY ON YOUR PARTFollow Ups--------------------------------------------------------------------------------Post a FollowupNameSubject Re ALIEN TECHNOLOGYMEDICAL PSYCHPROBLEMSCommentsI NEED IMMEDIATE ACCESS TO A FULLY FUNCTIONAL STARGATE OR OTHER SIMILIARTECHNOLOGY. I AM LOOKING FOR A BENEVOLENT SPECIES TO PROVIDE THIS FOR ME. I HAVEHEARD THAT ALIENS MIGHT HAVE THIS , BUT I DO NOT CARE WHERE I GET IT FROM.ALIENS , GOVERNMENT , MILITARY. A FRIEND OF MINE ONE DAY OUT OF THE BLUE AFTERWORK TOOK AN OVERDOSE OF ANTI DEPRESSENTS AND OTHER MEDICATIONS AND WOKE UP INTHE LOCAL HOSPITAL. HE WAS THEN IN THEARAPY, HE THEN GOT ON SSI AND WILLEDHIMSELF INTO HELL ON EARTH. HE ALSO PHYSICALLY BEAT HIMSELF UP PRODUCING SOMELIFE THREATINING MEDICAL PROBLEMS. HE IS THROWING UP EVERDAY AND HAVINGSWALLOWING PROBLEMS ALONG WITH HAVING BREATHING PROBLEMS AND HEADACHES AND ASTOMACH ACHE HE IS NEAERLY PASSING OUT EVERDAY THEN HE GOT INTO A SERIOUS AUTOWRECK AND WAS IN A LESS SERIOUS ONE HE FELLS LIKE SHIT EVERDAY. HE IS SICKEVERDAY MY FRIEND AND I WANT HIM BACK AT HIS PEACEFULL JOB. AND FORGET HECREATED THESE PROBLEMS SO THE IDEA HERE IS TO GO BACK AND HEAD THIS PERSON OFFAT THE PASS AND PREVENT THESE UNFORTUNATE ACTS NEED THIS TECHNOLOGY TODAY THANKYOU WOULD BE AN ACT OF MERCY ON YOUR PARTOptional Link URLLink TitleOptional Image URL0909If you press Preview Message, you are taken to a preview"],"Date Submitted":"02/03/2003 01:01 UTC","Disposition":"Unknown","Summary":"ALIEN TECHNOLOGY MEDICAL PROBLEMS","Log Number":"","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2336.html.txt","/var/www/straped/mufon/org/2336.html"],"Latitude":"31.975889","Sighting Duration":"00:00:00","Viewing Distance":"Unknown","City":"Undisclosed","Object Features":"Undisclosed","trends":[],"Region":"Texas","Weather Factors":"Unknown"}