{"Object Shape":"Flash, Star-like, Other, Unknown","Source":"MUFON","Weather Factors":"Does Not Apply","Latitude":"53.552764","Summary":"Bright Points of light and Flashes","divs":["Sighting DetailsI was outside at around 3AM looking up at the stars. A storm had passed through, the sky was 30% - 40% overcast. A bright light caught my eye and it was creating a halo around it from the misty cloud is was moving into. I Shrugged it off as a satellite catching the sun light, but it was still very eerie as I had never seen a satellite shine so brightly. Not even the ISS gets as bright as I saw it. It slowly dimmed to a faint point of light slowing moving northeast approx 60 degrees high for about a degree in length and then disappear. I star gazed for about 5 minutes until going back inside my house. Just as I opened my back door I looked up to the west about 50 - 60 degrees high to a bright star. I thought it was Mars. But after looking at a star chart, I think it was Alphekka I was looking at. Being in the City and being affected by light pollution, not too many stars are visible, especially in the weather conditions at the time. So I feel safe in saying it was indeed Alphekka. Anyways, as I was looking at this star I suddenly saw a very bright flash about 5 degrees to the top left of it. I know or a fact I saw it as I was pretty much looking right at it. The first thing that came to mind was \"Wow, I just saw a supernova\". Until 5 seconds later it happened again in the same exact spot. It was very bright, if I could speculate, it would be as bright as a nuclear bomb going off if it were as far away as the moon. I cant say it was a UFO, but it was definitely strange and out of the ordinary. The color of the flashes and bright moving light was white. The photo attached is where I saw the flashes."],"Log Number":"CA-05192010-0002","files":["/var/www/straped/mufon/html2text/23363.html.txt","/var/www/straped/mufon/more/23363_submitter_file1__DoubleFlashPoint.JPG","/var/www/straped/mufon/org/23363.html"],"Date Submitted":"05/19/2010 06:53 UTC","Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around May 19th 2010","This sighting has never been favorited.",""],"Date of the Event":"05/19/2010 03:00 UTC","Sighting Duration":"00:10:00","Longitude":"-113.486972","map":"<A HREF = \"http://maps.google.com/maps?q=53.552764,+-113.486972(23363)&iwloc=A&hl=en\"> mufon case (23363) map </A>","Object Flight Path":"Other","Country":"Canada","Tags":"City","Region":"Alberta","City":"Edmonton","Viewing Distance":"Over One Mile","Case Number":"23363"}