{"Date of the Event":"05/15/2010 10:00 UTC","City":"Live Oak","Latitude":"29.565229","Longitude":"-98.336402","Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=29.565229,+-98.336402(23369)&iwloc=A&hl=en\"> mufon case (23369) map </A>","Weather Factors":"Unknown","Log Number":"US-05192010-0008","trends":["There have been no other sightings in Live Oak","This sighting has never been favorited."],"divs":["sighting detailsreturning from wal-mart on loop 1604 and nacogdoches towards the live oak and universal city area. noticed a strobe light flash at about 45 degrees in elevation headed in a downward trajectory towards the live oak area. it traveled about 10 degrees in a second, flashed again, traveled another ten degrees in a half second, partial flash and gone. the object appeared to be at low altitude, below what appeared to be a light cloud deck and traveling at high speed towards the live oak city area or northeast san antonio. i was unable to see the object other than the single white strobe flashes. there were no other lights of any kind. it appeared to be traveling at very high speed. there were no trails, tails, sparking, debris etc that would indicate this was a meteor. once i realized this was not likely a conventional aircraft by its speed and none of the \"lighting\" that accompanies a meteor there was a sense of excitement that i may have finally spotted \"another one\" after many years. i spent a few days replaying the scene in my head to make sure that it was not a trick of light or other phenomena such as light reflections\\glare on a windshield. i am relatively certain of what it was not and am now reporting it."],"Tags":"City","Date Submitted":"05/19/2010 07:52 UTC","files":["/var/www/straped/mufon/html2text/23369.html.txt","/var/www/straped/mufon/org/23369.html"],"Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Case Number":"23369","Object Features":"Undisclosed","Source":"MUFON","Region":"Texas","Disposition":"Unknown","Object Flight Path":"Undisclosed","Summary":"Single Strobe moving at very high speed"}