{"Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=52.415252,+-1.509913(23368)&iwloc=A&hl=en\"> mufon case (23368) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Coventry","Object Features":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Log Number":"GB-05192010-0007","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/23368.html.txt","/var/www/straped/mufon/org/23368.html"],"Region":"England","Source":"MUFON","Summary":"Little black orb in england , coventry at a high altitude it was in the west and moved slowly northwards.","Tags":"City","Case Number":"23368","Date Submitted":"05/19/2010 06:45 UTC","divs":["Sighting DetailsIt was the evening of 18th may 2010,at around 5:30p.m. i was at my parents home when i looked out at sky at the dark clouds that were passing by and thought i'd go take a look,they soon blew over, as i was outside i looked around the sky then to the west i noticed a black sphere like object, now i have seen these on 2 other occassions in coventry whilst at friends houses, This time it was closer than before but soon drifted higher then stayed at a high altitude and moved very slowly across the sky towards the north i knew it was moving slowly as i lined the object up with a hole in the fence, i continued watching it for about 15 mins whilst i ate my sandwich outside on the bench, i then went into the house to take the plate and cup back and get my bag and jacket to go out on my bike, i was about 4-5mins and when i came back outside it was nowhere to be seen, it was fairly clear not many clouds so i would have thought i would be able to see it again easily but even as i went out on my bike i looked for it but still could not see it anywhere. The other 2 sightings were in the afternoon time on a weekday (not sure of dates and times) but my first sighting was a black orb at high altitude and i said to 2 of my friends, look whats that, and they dismissed it as a balloon, but it was quite a windy day and thought it would move more if it was simply just a balloon, and i watched it go in a perfect straight line away from north towards south then it kind of didnt get any further away ,at that point i looked away an within a minute it had disappeared and i did not see it again until about 2 weeks later when again i walked out into another of my friends back garden and looked up on a fairly clear day and seen the black orb shaped object and called my other friend to have a look it was clearly hovering ,not appearing to move away or get any closer it was about 10-15 mins i watched it then went inside for a drink then when i came back out to look it had totally disappeared, but again my friends are not as intrigued as me to find out what these black orbs are and why im seeing so many."],"trends":["There have been 3 other sightings in Coventry","There were no other sightings in Coventry on or around May 18th 2010"],"Date of the Event":"05/18/2010 05:30 UTC","Latitude":"52.415252","Longitude":"-1.509913","Disposition":"Unresolved"}