{"City":"Los Angeles","Case Number":"23377","Disposition":"Insufficient Data","Latitude":"34.059534","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around April 14th 2010"],"Tags":"City","Longitude":"-118.234415","Region":"California","Summary":"Key shape then into a tear drop.","Sighting Duration":"00:08:24","files":["/var/www/straped/mufon/html2text/23377.html.txt","/var/www/straped/mufon/org/23377.html"],"Weather Factors":"None","divs":["Sighting Detailswell i was out side my house. and i happen to look up and i saw this objest in the sky and at first i throught it was a bird. but then it stood still for a minutes or 2 with no movement at all. so i call my mom to bring the bonuculars. and to hurry so my mom said what is it. and she ran out with them my mom stood there to get a better look while i look threw the binuculars and i said mom you wont believe this. i said it's a key up there mom. and she said what. she grab them from me and the first words from her my was OMG. i took them back and maybe about 2 minutes it started to move. with back jerks and forward jerks. while looking it turn into a tear drop. along with this was 2 balls silver in color and it was almost as if they where watching. then the two balls spread apart from each other. and all at once they where join together. well the object glided across our sky into it disappeared. and the thing is someone else in fresno saw what we saw. and it was posted on abovetopsecret. and also youtube. well i seen this and my family with our own eyes. and we saw it clear as day because it was right over our house. and we watch it seem like forever. this was strange. i have heard people say they saw something. but not knowing that one day i would too. so do what you like with this infro. but i now know that something strange is happening. did not take any pic. but the infro is on youtube. someone else posted. and abovetopsecret. when i saw the object it was daytime."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.059534,+-118.234415(23377)&iwloc=A&hl=en\"> mufon case (23377) map </A>","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Log Number":"US-05202010-0006","Object Features":"Appendage(s)","Date Submitted":"05/20/2010 08:08 UTC","Viewing Distance":"Over One Mile","Country":"United States","Date of the Event":"04/14/2010 02:15 UTC","Object Shape":"Teardrop"}