{"Longitude":"-86.571227","Case Number":"23378","City":"Undisclosed","Object Shape":"Cigar, Egg","divs":["Sighting Details It was early spring at about a little after midnight, I was in the kitchen when my older brother said that there was a UFO outside. I, my older brother, younger sister and two nephews went outside to see what it was. I was expecting it to be just an explainable occurrence, but I was wrong, there this luminescent cigar shaped craft that was just hovering in the sky. The best way for me to describe it is that it was like an ice cream sandwiche viewed from the side only instead of brown white brown, it was glowing red yellow red. It looked an inch long in the sky, but must have been reasonably large as it looked to be about a mile or so away. I stood watching it for a few minutes, before I thought to look and see what everyone else was doing, my older brother was standing at the end of the porch with a smile on his face, while my baby sister was in a state of terror and my two nephews, well one was curious and the other seemed kinda scared, but not as bad as my baby sister. I myself was very inquisitive about the thing and actually found myself wanting to walk towards it to learn more about it,I always thought I would be the one in terror, but there was absolutely no fear at all. After doing this I looked back at it and it was still there hovering and after a while it started changing it's shape and size, it would actually shrink down to about a fourth to an eighth of it's original size and was egg shaped,but still glowing. The colors varied in the egg shape ranging from red to blue and yellow, it would also go back to it's original form and it remained there in the sky for what seemed like an hour to an hour and a half and then it finally just blinked out. The one thing that I found strangest about the whole encounter actually wasn't the UFO itself, it was what was going on at a nearby workshop up the road from our house, there was a light on the outside of the workshop that was flashing on and off the whole time the UFO was in the sky, my older brother and I noticed that it was flashing in a dicernable pattern not unlike Morse code. Unfortunately none of us knew morse code, but there was something goin on more than just a regular UFO sighting that night I just know it and many are the times I think about it and wish I had known morse code."],"trends":[],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/23378.html.txt","/var/www/straped/mufon/org/23378.html"],"Date Submitted":"05/20/2010 01:18 UTC","Source":"MUFON","Object Flight Path":"Stationary","Latitude":"35.524711","Summary":"Fully luminescent cigar shaped craft that changed shape and size.","Weather Factors":"Windy","Date of the Event":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.524711,+-86.571227(23378)&iwloc=A&hl=en\"> mufon case (23378) map </A>","Log Number":"US-05202010-0007","Object Features":"None","Tags":"City","Country":"United States"}