{"map":"<A HREF = \"http://maps.google.com/maps?q=44.981115,+-93.257846(23379)&iwloc=A&hl=en\"> mufon case (23379) map </A>","Region":"Minnesota","City":"Minneapolis","Tags":"City","Summary":"Large White Sphere or Round object","Disposition":"Unknown","divs":["Sighting DetailsI didn't know I had filmed it, I was walking near the old Army Post or Fort called Ft.Snelling. I was on the South end of the wall of the Fort. As I was walking away from the Fort towards the Mississippi River. I heard what sounded like a Loud Boom noise, like when they fire the cannons at the fort in the summer, the Fort is not open now. I comment in the video of the noise and pan towards the the North and the wall of the Fort. Later upon viewing the clip, you can see a large White Sphere or Circular object appear just after I mention the loud noise. It's around the 3:37 mark on the clip, I put a square around the area on the clip. I still have the original clip on my computer and my hard drive of my video camera.This occurred around 1:44 P.M and was on May 18th, 20010. When I view the object on the video it seems to materialize quickly and then fades away. Iv tried to submit the video file and a couple of still shots from the video. It doesn't submit, when I push the submit button with the video file and two pictures. It just processes and never submits?"],"trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around May 18th 2010"],"Source":"MUFON","Date of the Event":"05/18/2010 01:44 UTC","Longitude":"-93.257846","Country":"United States","Object Shape":"Sphere","Log Number":"US-05202010-0008","Weather Factors":"None","Date Submitted":"05/20/2010 02:06 UTC","Case Number":"23379","Sighting Duration":"00:00:03","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/23379.html.txt","/var/www/straped/mufon/org/23379.html"],"Latitude":"44.981115","Object Features":"Unknown"}