{"Source":"MUFON","divs":["Sighting DetailsTo whoever wants to read, I was putting the garbage out and as I walked down the driveway I was thinking how I see repeated patterns in the sky in relation to the locations of stars...(I had been outback a few minutes prior watching the sky and I saw the fastest shooting star I've ever seen).. anyway I'm walking down the driveway and I fixate on two stars in the northeast sky, as I'm looking at them they rotate and switch locations... this feeling overtook me like is this real? did i really see that? I stopped walking as soon as they started to rotate and I stared at them for a moment then the one of them started heading north further away from me. I dropped my garbage bag I headed down the street after it. Until it faded away in the distance. I'm pretty sure the other light that stayed behind was gone because this happened near a pretty bright star and their weren't any bright enough objects to match what I saw near by when I looked for it. These lights I saw were standing still when i fixated on them. Then after a moment or two they swung around each other like as if they were magnetically retracted or attracted to or from each other. I'm positive this is what I saw. I live near McGuire air force base so maybe they were doing some high altitude test flights or something but it sure got me excited. Hey I'm not a kook I know what I saw I'm just not sure what I was looking at. Maybe somebody else saw it too. Thanks for reading, Joe"],"Date of the Event":"05/19/2010 10:45 UTC","Region":"New Jersey","Object Flight Path":"Path with directional change","trends":["There have been 2 other sightings in Mansfield","There were no other sightings in Mansfield on or around May 19th 2010"],"Country":"United States","files":["/var/www/straped/mufon/html2text/23370.html.txt","/var/www/straped/mufon/org/23370.html"],"Sighting Duration":"00:02:00","Longitude":"-74.720689","City":"Mansfield","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Star-like","Summary":"I saw 2 stars dance and one flew away.","Case Number":"23370","Log Number":"US-05192010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=40.072789,+-74.720689(23370)&iwloc=A&hl=en\"> mufon case (23370) map </A>","Disposition":"Unknown","Date Submitted":"05/19/2010 11:52 UTC","Weather Factors":"None","Object Features":"None","Latitude":"40.072789"}