{"Object Features":"Unknown","Tags":"City","Sighting Duration":"00:00:02","map":"<A HREF = \"http://maps.google.com/maps?q=44.938296,+-93.717741(23371)&iwloc=A&hl=en\"> mufon case (23371) map </A>","Country":"United States","Region":"Minnesota","Latitude":"44.938296","divs":["Sighting DetailsCame home from work it was about 10:00 pm my husband and I were in our back yard laying in the grass looking up at the beautiful sky and talking about the stars and constellation's and how clear it was out that night because you could see all the stars so clearly and this very bright light came flying across the sky (east to west) stopped abruptly and turned right and took off just as fast as it came and was gone in a matter of seconds. My husband (not a believer) turned and looked at me and said did you see that (very wide eyed) I said yes and then asked him what did he see, he confirmed the same thing that I saw but did not say anything and then I asked him what did he think it was and he said he did not know because it did not match anything that he ever saw or knew about. There were no blinking lights, not an air craft, not a shutting star or meteor because it stopped and then turned right plus we have seen the meteor showers and shooting stars before, plus I am a disabled vet I served in the US ARMY. We looked to see if there were any satellites in our area at the time and we could not find anything stating that their was. Being born and raised in Titusville, Florida I am familiar with NASA and space debris. At present time we have not seen this anomaly again. We have seen the space station all sorts of flying aircraft, meteor showers but nothing like we saw that night. This siting has really pricked my interest even more to learn and find as much information as I can about our Universe. We still talk about this today between us because we have looked and tried to match anything we could to this and nothing even comes close not even a satellite can stop dead and turn and take off just as fast as it came. Not like this did that night. Bright Light in the shape of an oval moving fast."],"Date of the Event":"05/31/2008 12:00 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Log Number":"US-05192010-0010","Date Submitted":"05/19/2010 11:54 UTC","Summary":"Sort of Oval light","Longitude":"-93.717741","trends":["There have been no other sightings in Minnetrista","This sighting has never been favorited."],"Source":"MUFON","Object Shape":"Oval","City":"Minnetrista","Object Flight Path":"Path with directional change","Case Number":"23371","files":["/var/www/straped/mufon/html2text/23371.html.txt","/var/www/straped/mufon/org/23371.html"],"Weather Factors":"None"}