{"Longitude":"-2.245126","Case Number":"23383","Summary":"Fast pulsating UFO followed by some sort of missile","Object Shape":"Bullet, Missile, Star-like","Viewing Distance":"Unknown","Log Number":"GB-05202010-0011","divs":["Sighting DetailsIt was just before 2:30 in the morning just outside of Manchester, UK and I stepped out the back to have a cigarette. As always I looked up into the sky to look at the stars. I was looking at one particular group of stars when I noticed that the group seemed to be moving. As I looked closer I could see that It was actually just one star that was moving northbound in a straight line. As I watched it I noticed that it was brightly pulsating at a rate of around every 10 seconds. Because it was so far up I couldn't make out any definitive shape to it. It looked just like another star to me. I thought to myself that it could have been a plane, but I've seen hundreds of planes in my time and none of them ever pulsated like this before, and besides, this was moving much faster than any plane I've ever seen. I was watching it pass over the house and not 2 seconds after it passed from view I saw a shooting star follow in almost same trajectory as the UFO. I've also seen quite a few shooting stars in my time as well, but this one seemed to have a really long blueish trail behind it, and it wasn't traveling downwards either. It was moving horizontally following the exact path of the UFO at an incredibly fast speed, but it didn't sort of die out as most shooting stars do. It had a fairly consistent trail behind it. Because it also passed over the house, I couldn't see weather it actually made contact with the UFO or not, but it did seem to me that whatever it was, it was fired with some intention of hitting the UFO. I knew that as soon as it had passed over the house that I wasn't going to see anymore as the view was completely blocked by other houses in the street. I continued watching for another couple of minutes to see if anything else would happen to no avail. 10 minutes later I'm writing this report to MUFON. Hopefully someone else saw something as well. Possibly some sort of impact maybe, but it is very early in the morning so I doubt many other people would be even be awake. Anyway thanks for your time and who knows, maybe there's more to this story to come."],"Country":"United Kingdom","Disposition":"Unresolved","Date Submitted":"05/20/2010 10:32 UTC","trends":["There have been 26 other sightings in Manchester","There were no other sightings in Manchester on or around May 21st 2010"],"Object Flight Path":"Straight-line path","Region":"England","Latitude":"53.484751","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23383.html.txt","/var/www/straped/mufon/org/23383.html"],"Date of the Event":"05/21/2010 02:27 UTC","Object Features":"Unknown","Weather Factors":"Unknown","City":"Manchester","map":"<A HREF = \"http://maps.google.com/maps?q=53.484751,+-2.245126(23383)&iwloc=A&hl=en\"> mufon case (23383) map </A>","Sighting Duration":"Undisclosed","Tags":"City"}