{"Viewing Distance":"Unknown","Source":"MUFON","Latitude":"33.453147","Disposition":"Hoax","divs":["Sighting DetailsMay 20, 2010 Mesa, AZ 11:14AM I was on my computer which is situated in front of a screened and tinted window when I just happen to glance towards the window into the sky, and I saw an orange and round object about the size of a balloon slowly traversing in the sky. The distinctly orange and round object also seemed to me to be a little fuzzy on its outer surface. The object appeared to be no further away than 200 to 300 feet from my location, and the orange object seemed to be about 100 to 150 feet up in the air in altitude. I stared at the orange object for a few seconds wondering to myself what it could be when I decided to quickly go onto my porch (which that part took about 2-3 seconds) and to take some pictures of the orange object. However, when I went outside onto my porch and intensely scanned the area with my eyes where the orange object should had been located, I saw no signs of the orange object still being in the sky. This left me baffled about its disappearance since the object was very bright orange and once nearby my location. This occurrence also happened to me before in the recent past. Therefore, I quickly decided (with the zoom set at its lowest of 70mm and the focus set for distant scenery) to take some random pictures in a circular pattern in the general area the orange object was last seen with the hope of the camera capturing something (which the object may still be somewhat visible for the camera to detect but not with my eyes.) I took l1 pictures: only 1 picture shows a round object which is not orange; another pictures show a black and flat object which I am suspecting that object in that picture possibly being a black bird flying. However, upon enhancing the picture (that I think might be a bird) with the fade enhancements to bring out more colors, the object also had orange color in it rather than just black colors. This settles my thinking of possibly seeing things when the facts is: there was something that was flying which was a small and bright orange object that just simply appeared to vanish. Now the real question: what was that object because it surely was not a balloon or plane I saw flying in the air?"],"Longitude":"-112.072117","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around May 20th 2010","This sighting has never been favorited.",""],"Region":"Arizona","City":"Phoenix","files":["/var/www/straped/mufon/html2text/23382.html.txt","/var/www/straped/mufon/org/23382.html"],"Weather Factors":"Windy, Light","Summary":"Bright and small orange object slowly traverses sky which mysteriously vanished.","Log Number":"US-05202010-0010","Case Number":"23382","Object Features":"Unknown","Country":"United States","Sighting Duration":"00:00:10","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.453147,+-112.072117(23382)&iwloc=A&hl=en\"> mufon case (23382) map </A>","Date Submitted":"05/20/2010 08:50 UTC","Date of the Event":"05/20/2010 11:14 UTC","Object Shape":"Sphere","Object Flight Path":"Straight-line path"}