{"Object Features":"Unknown","Object Shape":"Star-like","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/23384.html.txt","/var/www/straped/mufon/more/23384_submitter_file1__L1.JPG","/var/www/straped/mufon/more/23384_submitter_file2__Pic1.JPG","/var/www/straped/mufon/org/23384.html"],"Weather Factors":"Lightning, Light","Tags":"City","Latitude":"35.15895","Longitude":"-89.770075","Disposition":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Summary":"Very bright fast moving ball of bluish/white light that changed direction twice and blinked 6 times before i lost sight of it.","divs":["Sighting DetailsI was at my house watching a storm in the distance through my window to see if it was headed this way. I was facing Eastward. The sky was overcast and no stars were visible but there was lightning far in the distance. As i was watching the sky suddenly there was this blue tinged object that almost looked like a very bright star just appear out of nowhere traveling from left to right in my field of vision. There was no sparks or any kind of trail. There was no curvature to the flight path, i just flew very straight. There was also no sound or solid surface that i could hear or see. It came in at a shallow angle towards the ground blinked 3 times and disappeared behind a house, but just as quickly came back up at a sharper angle then it had entered. It then changed angle again to a more level trajectory with the horizon and blinked 3 times again as it did so. It continued on to where i couldn't see it because the side of the house was in the way. The blinking was sequential in that the 6 blinks were as far as i could tell all the same duration. I cannot say how far away or how big it was i just don't know. But i do know that it was below the clouds and moving very fast. As for feelings and reactions i was dumbstruck and stood for probably a couple minutes just trying to wrap my head around what i had just seen. I know 100% what it was not...It was not a plane, helicopter, or meteor. I see planes and helicopters all the time and i've actually seen lots of meteors and fireballs, but this was none of them. Was it \"ball lightning\"...maybe but from the pictures i've seen of ball lightning and peoples descriptions of it...this looked nothing like it. The first pic is a drawing i made in ms paint that shows the full path that i saw the object moving. The second pic is an actual photo taken maybe 5 minutes later of the area. I set the exposure to 15 seconds and increased the gamma so you can see the area clearly. In reality it was very dark outside."],"trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around May 15th 2010","This sighting has never been favorited.",""],"Date of the Event":"05/15/2010 10:15 UTC","Sighting Duration":"Undisclosed","City":"Memphis","map":"<A HREF = \"http://maps.google.com/maps?q=35.15895,+-89.770075(23384)&iwloc=A&hl=en\"> mufon case (23384) map </A>","Log Number":"US-05202010-0012","Region":"Tennessee","Date Submitted":"05/20/2010 11:16 UTC","Country":"United States","Case Number":"23384"}