{"Object Shape":"Circle, Star-like","Summary":"To the witness in Manchester England, I watched something similar last night.","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Region":"Pennsylvania","Weather Factors":"None","Disposition":"IFO","Longitude":"-75.198958","files":["/var/www/straped/mufon/html2text/23388.html.txt","/var/www/straped/mufon/org/23388.html"],"Tags":"City","Source":"MUFON","Date Submitted":"05/21/2010 10:25 UTC","Country":"United States","divs":["sighting detailsi read the report out of great britain today, and felt compelled to report what i saw last night. i was going to report anyway, but i wanted to read the last 20 reports to mufon first. i was looking for anything that matched what i had seen. witness in england said sighting was at 2:30 a.m. that would be 9:30 p.m. here in the usa. i do alot of star gazing on clear nights, and felt last night would be eventful. i looked out a ne facing window and saw a yellowish white star like object movine horizontally going from s to n. thought it is probably a satelite. also thought maybe it's iss or space shuttle. however, upon going outside with my binoculars in hand, i then witnessed at least 10 other such objects within the next 1\\2 hour! the first few went e to n. then one came from the w going n. i then observed one coming from the se which merged with what i thought were just stars! it was that one that convinced me that what i was seeing was not ordinary. after it merged it became stationary. it seemed like there were alot of stars in arc formations as well. like i say i look up alot at night, and i'm familiar with star positions. i did'nt see anything that resembled a missile like you did. but i found your report to be very close to what i saw, and not that much time diffence either. this may have been going on at 9:30 p.m. here, 2:30 a.m. your time, but i began watching the sky 1 hour later. close enough i think. we may have been watching the same display on opposite sides of the atlantic. oh, i should add that these objects were really high up. at the level of stars it seemed. they moved at a somewhat normal speed. like airplanes, but definitely not airplanes. no blinking lights whatsoever. just whiteish star like objects that could be seen with the naked eye. this all took place between 10:30 and 11:00 p.m. normal air traffic was unusually light last night. one other oddity during the event was that the song birds, that are nesting right now, were chirping very softly. this is not usual for them. i live in the woods, and am surrounded by trees and all sorts of wildlife. i'm very familiar with their habits. anyway, there was nothing normal about what i saw last night. my son and i witnessed one of these on 5\\9\\10, but i dismissed it as a satelite. now i feel we may have seen more that night, but we went in to watch a movie. i really feel like those who are staying indoors at night are missing the greatest show on earth! i always knew it was'nt the circus. so long for now."],"Log Number":"US-05212010-0002","Viewing Distance":"Unknown","Latitude":"40.869602","Object Features":"Unknown","trends":["There have been 13 other sightings in Bangor","There were no other sightings in Bangor on or around May 20th 2010"],"Sighting Duration":"Undisclosed","Case Number":"23388","map":"<A HREF = \"http://maps.google.com/maps?q=40.869602,+-75.198958(23388)&iwloc=A&hl=en\"> mufon case (23388) map </A>","Date of the Event":"05/20/2010 10:30 UTC","City":"Bangor"}