{"Latitude":"32.80228","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","trends":["There have been 2 other sightings in Anza","There were no other sightings in Anza on or around April 25th 2010"],"Region":"California","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.80228,+-115.48899(23390)&iwloc=A&hl=en\"> mufon case (23390) map </A>","Date of the Event":"04/25/2010 03:00 UTC","Longitude":"-115.48899","Object Shape":"Fireball","Object Features":"Undisclosed","divs":["Sighting DetailsMy friends and I were camping in Anza Valley, near Thomas Mountain. We had a camp fire on a ridge and were enjoying the night. After most of my friends went to sleep, my friend and I decided to take a hike at about 3am. We walked approx. 100 yds up to the top of a hill that provides a 360 degree view of the valley to the north and Thomas mountain at south by south west. Upon reaching the top of the hill near our camp site, which was actually just a cut off of the dirt road south of lake Hemet off of the 74, we spent a few minutes at the top, enjoying the view and then decided not to continue over the hill since we would lose sight of our camp fire. Once we started heading back, what appeared to be a large, bright, and consistently lit shooting star pierced the sky to the south, somewhere over Thomas Mountain. About three quarter of the way through the object's flight, the object sharply changed direction downward from it's 45 degree decent to a straight down dive. It then disappeared behind the mountain without a flash or sound. My friend and I immediately took notice of the puzzling turn of the meteor and verified that we both saw a projectile turn 45 degrees in the sky without losing any velocity, or having any curve at all. This was also clear through the tail that followed the object. the tail of object followed it perfectly creating a 45 degree angled shape in the sky, before dissipating. Also, the trail was extremely straight and clean. There was no spreading of light or particles as it entered the atmosphere. We were both so scared by what we saw, that we ran full speed back to our campsite and didn't speak of it till later the next day. What I saw was physically impossible. no physical object can move at that speed, make no noise, and be able to turn so sharply without slowing down or even curving into the turn. It was similar to watching a neon light ignite from top to bottom, speedily filling a bent tube. Very eerie. What we saw was real, it came from out of the atmosphere, and it behaved as if under intelligent control. We considered that the object may have exploded and split off in a downward direction as meteors may do, but decided that the conciseness of the turn and the fact that the object changed in no way other than direction, There's no way it was a meteor. I know what I saw, and now I'm a believer."],"Case Number":"23390","Log Number":"US-05212010-0004","Date Submitted":"05/21/2010 05:47 UTC","Tags":"City","City":"Anza","Sighting Duration":"00:00:05","Country":"United States","Disposition":"Insufficient Data","Summary":"bright, high velocity light, with bright long tail, that turned 45 degrees downward at full speed","files":["/var/www/straped/mufon/html2text/23390.html.txt","/var/www/straped/mufon/org/23390.html"]}