{"Source":"MUFON","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around May 19th 2010"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Latitude":"32.224453","files":["/var/www/straped/mufon/html2text/23392.html.txt","/var/www/straped/mufon/org/23392.html"],"Date of the Event":"05/19/2010 08:25 UTC","Log Number":"US-05212010-0006","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was waiting in parking lot of my apartment complex for my roommate to pick me up. I was looking south at night sky and noticed two faint but white objects crossing my line of vision from my right to my left, heading from NW to SW direction. One seem to be following the other, just could make out what looked to be round almost ball like. At first I thought maybe they were parachutes, but why would they be out that time of night and so near to the airbase. Also, I noticed that the were traveling in the direction I noted and that they seem to stay at same altitude and traveling at same speed. I was not sure what speed they were going, not sure what size they were, since I could just make them out in the sky. No lights, very silent, I was listening for engine sounds from the objects and did not hear any type of sounds from the objects. No idea what the objects were and not sure what altitude they were at. Kept objects in sight for about 50 seconds to a minute. I was surprise to see the objects and noted that they were traveling in area and direction that most aircraft in this area do not traverse. I was very curious about the objects and wonder if they were some type of military hardware, or were they truly alien crafts. They disappeared from sight due to trees and building being in the way of the direction they were traveling."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.224453,+-110.923549(23392)&iwloc=A&hl=en\"> mufon case (23392) map </A>","Disposition":"Unknown","Country":"United States","Summary":"Two objects in sky going NW to SE","Date Submitted":"05/21/2010 07:44 UTC","Longitude":"-110.923549","Tags":"City","Object Shape":"Sphere","Weather Factors":"None","Case Number":"23392","Region":"Arizona","Object Flight Path":"Straight-line path","City":"Tucson","Object Features":"Unknown"}