{"Latitude":"38.630822","Country":"United States","Longitude":"-90.195274","Object Flight Path":"Straight-line path","Date of the Event":"05/21/2010 09:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.630822,+-90.195274(23396)&iwloc=A&hl=en\"> mufon case (23396) map </A>","Date Submitted":"05/22/2010 08:52 UTC","Log Number":"US-05222010-0001","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23396.html.txt","/var/www/straped/mufon/org/23396.html"],"trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around May 21st 2010"],"Sighting Duration":"Undisclosed","City":"St Louis","Object Shape":"Unknown","Viewing Distance":"Unknown","Case Number":"23396","divs":["Sighting Detailsupon returning home after seeing a movie, my husband and I observed a very bright light to the west in the night sky that looked as if it were 'twinkling'. I am interested in astronomy and know a little about stars and planets. This was no star or planet that I know of and seemed unusual because it was so very bright. It was moving very slowly to the west northwest. Lights were much brighter than those on a any aircraft that I know of. It was maybe 25 degrees above the horizon, although it's hard to tell because there are a lot of trees in our area. We went inside and I grabbed my binoculars and we both went back outside to take a look. Through binoculars flashing green, amber and red lights were noted. No shape could be seen, only the lights were visible. There was no sound but that could have been because of distance. It appeared that the lights were changing color, and maybe changing configuration although it was difficult to tell because of the distance. We both watched for a while, then my husband went in the house and I stayed and watched until it disappeared behind the tree line."],"Summary":"Very bright amber, green and red lights in the night sky moving slowly to the west northwest.","Object Features":"Unknown","Disposition":"Unknown","Region":"Missouri"}