{"Disposition":"Unresolved","Sighting Duration":"00:00:30","Region":"England","Summary":"Blue Crescent shaped moon with bit below m42 west mids","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=52.486243,+-1.890401(23394)&iwloc=A&hl=en\"> mufon case (23394) map </A>","City":"Birmingham","Longitude":"-1.890401","Object Features":"Undisclosed","Log Number":"GB-05212010-0008","trends":["There have been 3 other sightings in Birmingham","There were no other sightings in Birmingham on or around May 21st 2010","This sighting has never been favorited.",""],"Latitude":"52.486243","divs":["Sighting DetailsWas driving down the M42 around 1.25pm Uk time and over a bridge there was the best way to describe it was a bright blue Crescent shaped moon with a bit below like a teardrop or tube at first I thought it was a ballon but as I drove closer it was not moving its was in a fixed hover or moved very little. It was hovering over a bridge and must have been seen by other people It was brilliant blue in colour I first seen it from about 1000 yards away hovering about 25-35ft above a small motorway bridge between junction 3 and 3a and it did not seem to move it looked like a hard object and sharp i.e it wasn't flapping or rounded almost looked 2d It was hard to look at it because of been on a busy motorway but I can't understand it i mean if it was a ballon it should go up or flap about but didn't move or appear to wasn't very big probs about 4ft tall in all and 1.5-2ft feet wide After going to the airport I came back the same way and there was no sign of it must have been around 20-30mins later which throws out the idea of it been for advertising I really don't have any ideas to what it could be love to hear if anyone does or seen it too please have a look at the pic its only rough but u get the idea."],"Case Number":"23394","Weather Factors":"Unknown","Country":"United Kingdom","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary","Source":"MUFON","Object Shape":"Boomerang, Teardrop","Date Submitted":"05/21/2010 10:29 UTC","files":["/var/www/straped/mufon/html2text/23394.html.txt","/var/www/straped/mufon/more/23394_submitter_file1__ufodiagram.jpg","/var/www/straped/mufon/org/23394.html"],"Date of the Event":"05/21/2010 01:25 UTC"}