{"Date of the Event":"05/22/2010 03:35 UTC","Log Number":"US-05222010-0008","Case Number":"23403","Summary":"Gray object reflected light only seen under polarized lens","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around May 22nd 2010"],"Longitude":"-84.547393","Source":"MUFON","divs":["Sighting DetailsObviously this object was either very high or in some sort of camo mode or painted gray. I am a former USAF member. I am the son of a test pilot. I have had numerous conversations about UFO with friends. I have never, NEVER seen anything in the sky that was not explainable until today. At approx 300 pm. I went to see if my electronic neighborhood pool keys (the pool opened today) worked. They did. I went back home got my climbing shades (Julbo, polarized, I use these sahdes for intense light environments) and towel and went back. Temp today was about 85 F. After I killed a bee around 335 pm the sun began off and on behind the clouds at about 600-1000 ft alt. I got situated looking slightly to the west to get the max exposure, so the sun was at my 11 o'clock and the sun was about 65 degrees up (thinking like a azmuth or compass) The kids jumping in the pool and clouds shifting caused me to open my eyes every few minutes. At approx 340pm I opened my eyes and saw blue sky, and for a second (just a second!) I opened my eyes to see an usual flash of light in the shape of an arc at almost the same angle as the sun just to the right of the sun. There were jets on approach moving (leaving contrast trails) west to east I assume on aproach or leaving the ATL flight area. The flash of light caught my eye and I blinked after seeing this, to notice something very faint in the shape of a fuzzy square. I took this as meaning it was very high in the atmosphere or it was trying to hide. As I followed the object there was no sound over the kids and pool noise, no trail, no wings, nothing ordinary. It looked like a square but may have had a nose. What was interesting about this was that when I removed my shades it was gone completely. There were so many people there and it was quietly moving north with not a notice by anyone probably becuase this was not an easy thing to see. You'd have to have looked right at it to see it. I lost it for a few seconds while I removed my shades, but then found it again moving rapidly north. I lifted my shades several times in disbelief as I followed it; making it go away and bringing it back. This was scientifically similar to removing the light wave length in the blue spectrum. Essentially cutting out some of the refracted blue light background from the sky. I can't say how big this was,looking at my ruler here on the table... it was about 6-8mm long (again from my point of view) and 3 to 4mm wide. It was gray and fuzzy but had distinct edges, thinking back especislly the rear of the object seemed more defined , a clear straight edge. It moved smoothly north with no trails, nothing. I followed it for what seemed like 1 to 2 minutes to the north until about 30 degrees on the horizon. After I lost the object I jumped up and ran home to document all that happened. I am amazed that I saw this object. I will not say that it was something from another planet, or what, but definately not anything I have ever seen. Report worthy."],"Object Flight Path":"Straight-line path","Disposition":"IFO","Country":"United States","Tags":"City","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=33.960292,+-84.547393(23403)&iwloc=A&hl=en\"> mufon case (23403) map </A>","City":"Marietta","Date Submitted":"05/22/2010 04:34 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"None","files":["/var/www/straped/mufon/html2text/23403.html.txt","/var/www/straped/mufon/org/23403.html"],"Region":"Georgia","Object Shape":"Cigar, Cylinder, Square, Rectagular","Latitude":"33.960292","Weather Factors":"Unknown"}