{"trends":["There have been no other sightings in Opp","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Log Number":"US-05232010-0001","Viewing Distance":"Over One Mile","City":"Opp","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"05/23/2010 12:41 UTC","Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.282668,+-86.255507(23406)&iwloc=A&hl=en\"> mufon case (23406) map </A>","Tags":"City","Latitude":"31.282668","Case Number":"23406","Longitude":"-86.255507","divs":["Sighting DetailsAround the time of the incident, I was outside in the front yard looking at different objects with my new Meade telescope I had gotten for Christmas(I was 15 at the time). I had been outside for roughly an hour, just looking at random stars after I finished my routine look at Jupiter. As I was looking for something to point my telescope at, I noticed what looked to be an airplane, flying away off to the south. It was brown in color, which I originally attributed to the red and green lights on the aircraft mixing over the long distance. The only reason I noticed it was because it was headed in the direction on my next target, a plain looking star that I thought at the time might be the Andromeda galaxy (it wasn't). As it neared the point where it would have crossed the sight of the star, it seemed to flicker out of existence. My father was in the air force. I've lived near several air force bases and on two others, Tocoma AFB in Washington and Charleston AFB (it may have a different name but it was in Charleston) in South Carolina. I know a few things about air craft. I know their capabilities. I have never seen something \"flicker\" like this did. It was like a fire being extinguished rather than a light going out. I was very confused at this point. As I stared where it disappeared, however, it reappeared right above the same star with the same flicker it had left with. Now I was nervous. I felt the tingle usually associated with fear. I had the very powerful sensation that this thing knew I was there, and knew I was watching it. The object stayed motionless in this position for probably 2 or 3 seconds, and then did something I have never seen before with any airbourne object. It jumped across over half the sky at about a 50-60 degree angle in a split second, then just disappeared. While it was moving it blinked. It seemed to me that rather than actually moving, it was teleporting or jumping from point to point, but I wouldn't know for sure. If an aircraft were to move that fast I believe the friction from the atmosphere would incinerate it. I ran back into the house to tell my parents and they both proceeded to be extremely skeptical, yet start telling stories of their own weird sightings. Before this event I was very skeptical of UFOs, at least extra terrestial ones. That night, when I went to bed, I kept going over and over it in my mind, and slowly became terrified. The most unnerving thing was feeling like the thing had marked me as someone who knew that it had been there, someone who had seen it. I have always been an airospace lover, and know many things about air craft and space craft through my own research. I am a younger individual but I do not believe that restricts my ability to use rational thought. What I saw was real. It was not a man made air craft, at least no conventional aircraft. It was not a meteorite. Not a satellite. Not the ISS. What infuriates me is how, at least from a distance, it had every appearance of a passenger jet slowly moving across the sky. How do I know I havn't glimpsed dozens of these craft, only to look away thinking nothing of it?"],"Date of the Event":"12/29/2006 10:30 UTC","files":["/var/www/straped/mufon/html2text/23406.html.txt","/var/www/straped/mufon/org/23406.html"],"Object Shape":"Unknown","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Summary":"Flying like plane, disappeared, reappeared, cleared half the sky in a second","Region":"Alabama"}