{"Latitude":"38.360674","Log Number":"US-05222010-0007","Date of the Event":"05/21/2010 10:12 UTC","Tags":"City","Country":"United States","Object Features":"Undisclosed","Date Submitted":"05/22/2010 03:08 UTC","divs":["sighting detailsi was standing on my back deck facing s\\e and saw a rapidly moving series of 3 white dashes(one appear, then replaced by another further to the west) moving east to west in a straight line parallel to the ground. approx 25 degrees above ground, vanished when it went behind a tree. my son was with me and missed this part. when i exclaimed \"wtf\" he turned and as i was explaining what i saw the dashes appeared again more from a westerly point than where it disappeared, then moved rapidly again in the opposite direction for two dashes. it disappeared in an unobstructed part of the sky. the second appearance was closer to us and appeared higher in the sky(50 degrees from ground). both times it traveled in a straight line parallel to the ground. sky was partial clouds but no ground fog. no sound. i live in a rural area and am used to lighting bugs etc. this was not a natural phenomenon. total time from beginning to end of sighting was aprox 1 minute. each flash was about one second long, covering maybe 5 degrees of arc at a time. the flashes appeared like dashes in the sky that rapidly appeared then disappeared: - - - before the next one. too fast for a plane and too low. i am used to seeing planes in the sky around here."],"files":["/var/www/straped/mufon/html2text/23402.html.txt","/var/www/straped/mufon/org/23402.html"],"Region":"Maryland","Summary":"series of short white dashes","trends":["There have been 5 other sightings in Salisbury","There were no other sightings in Salisbury on or around May 21st 2010"],"Longitude":"-75.599369","Case Number":"23402","City":"Salisbury","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.360674,+-75.599369(23402)&iwloc=A&hl=en\"> mufon case (23402) map </A>","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed"}