{"Disposition":"Unknown","Summary":"2 UFOs (or same one twice) sighted by 3 witnesses near Austin, TX","Region":"Texas","Log Number":"US-05232010-0002","Case Number":"23407","Date Submitted":"05/23/2010 01:58 UTC","Object Flight Path":"Undisclosed","trends":["There have been 5 other sightings in Leander","There were no other sightings in Leander on or around May 21st 2010"],"Latitude":"30.584096","Date of the Event":"05/21/2010 08:30 UTC","Source":"MUFON","Object Shape":"Cigar, Oval, Star-like","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.584096,+-97.848669(23407)&iwloc=A&hl=en\"> mufon case (23407) map </A>","Sighting Duration":"Undisclosed","divs":["sighting detailsi was riding in the rear driver's side seat of my dad's car on the way home from eating dinner out at a local tex-mex restaurant. my dad, his girlfriend, her 4 year-old son, and myself were in the car. there was a beautiful sunset setting up in the west, so our eyes were on a grouping of reddish clouds in that direction. the skies were mostly clear, including the area just above the reddish clouds on the western horizon. as we drove north on 183a (changing back to 183), i kept my eyes on a large, cloud-like object just above the reddish clouds that were illuminated by the sunset. i figured that it was probably a stray cloud or an afterburner trail (a very short, dense one), but there seemed to be something strange about it, so i kept track of it as i kept looking out the window. after over 10 minutes of watching it from the car, i realized that the object could not be an afterburner trail, since it hadn't changed shape or faded at all, and was far too opaque. at this point i told my dad and his girlfriend to take a look in that direction. my dad was driving, so he only got a brief look at it.. but his gf got a good, long look at it. it appeared to be quite large and distant, but at this point we were both fairly certain that it wasn't a cloud. there was a definite contrast between the shade of grey in this object and the clouds around it. as we drew closer to home, the object was still there.. hanging in the sky, completely static as far as we could tell. the object appeared to be somewhat ovular or disc-like, but the actual shape was difficult to tell because of how distant it was. we had to stop at a traffic light, and the trees near the road partially blocked our view of that horizon, obscuring the part of the sky where the object had been. once the light turned back to green and we cleared the obstructing trees, the object was gone. not moved, gone. at this point there was no doubt in my mind that this was a craft, and one that had either moved an incredible distance in a matter of less than a minute, or gone invisible. my dad's gf agreed that it could not have been a cloud or any other natural occurrence. once we got home and out of the car, i started looking back up at the sky to see if i could spot the object again. when we were just about ready to go into the house, i saw an extremely bright, pulsating white light in the western\\southwestern sky. i pointed it out to my father and his girlfriend, and they both confirmed what i was seeing. it was as bright as a star (or brighter), and stayed stationary for at least 20-30 seconds. then it moved horizontally at a high rate of speed into a cloud, which obscured it from our view. we had an excited conversation about it, and went back inside the house. none of us have a good pair of binoculars or a telescope, so we weren't able to get a close look at either craft (or was it the same one?)."],"Country":"United States","Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-97.848669","City":"Leander","files":["/var/www/straped/mufon/html2text/23407.html.txt","/var/www/straped/mufon/org/23407.html"]}