{"Source":"MUFON","Region":"Ohio","divs":["sighting detailsthree of my friends and i was flying a kite at night with a pen light when from orions belt came two discs dancing towards our kite, spun around our kite, light went off and they stopped and went right back to orions belt at light speed. i watched light disapate for miles and miles in miliseconds. was i spooked? no. because, i myself, have been subjected to the grays since birth. i changed a lot of their behaviors on humans and allowed them to read my mind as they allowed me to read theirs. many encounters fourth kind. a couple of implants i quit taking them out because the always return to implant others. i changed their diet their too smart for any other supperior beings as demons,angels, or even god. they are not out there they are imbedded in the waters, swamps, grassy marshes, and even in the ground. they are and have been watching and observing and changing dna replicating humanoid and other beings from other planets. soon the answers and truths will be fulfilled. human beings are forever changing and the knowledge will allow mankind to keep up with their race. each of the grays are exact duplicates of theirself. now we have given up our secrets, cells, and our government has tried to keep them at bay except for the people that see, hear, smell, touch, a gray. if you dont understand you wont, if you do dont fear. they really\\really want whats best and want us to grow to understand. at first it might have seemed that they were radical, we were in their scope since the first days of man.im not visited as much any more.maps 'wepons,motherships desending,was instilled in my mind ;i remember everything.....after a few to many abductions.i was wide eyed,but the govn.was hot on us,men in black were everywhere;till the hubble;scope was turned on me. i guess after they [greys] knew i was not being intransed to forget and being hot zone,they moved on.i do know they will retern..i will be ready....will you."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.107678,+-84.50702(23413)&iwloc=A&hl=en\"> mufon case (23413) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Disc","Summary":"Me and friend went to the local levy to drink a 12 pack of beer and","Country":"United States","Disposition":"Hoax","Sighting Duration":"05:30:08","files":["/var/www/straped/mufon/html2text/23413.html.txt","/var/www/straped/mufon/org/23413.html"],"Viewing Distance":"20 Feet or Less","Tags":"City","Latitude":"39.107678","Log Number":"US-05232010-0008","City":"Cincinnati","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around August 9th 1989"],"Longitude":"-84.50702","Date of the Event":"08/09/1989 12:00 UTC","Date Submitted":"05/23/2010 11:06 UTC","Case Number":"23413"}