{"map":"<A HREF = \"http://maps.google.com/maps?q=43.731744,+-70.710892(23417)&iwloc=A&hl=en\"> mufon case (23417) map </A>","City":"Limington","Region":"Maine","Viewing Distance":"Over One Mile","Date Submitted":"05/24/2010 11:29 UTC","Disposition":"IFO","Tags":"City","trends":["There have been no other sightings in Limington","This sighting has never been favorited."],"Object Shape":"Fireball, Sphere, Star-like","Summary":"fire ball like light","Object Flight Path":"Other","Object Features":"Undisclosed","Longitude":"-70.710892","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Date of the Event":"05/22/2010 09:45 UTC","files":["/var/www/straped/mufon/html2text/23417.html.txt","/var/www/straped/mufon/org/23417.html"],"Log Number":"US-05242010-0004","Latitude":"43.731744","Case Number":"23417","divs":["Sighting Details My friends and I were standing on the dock at Arrowhead lake looking at the moon, there was no stars in the sky, when I noticed a light in the sky that I thought was a star until we noticed that it was moving at us, at this point we heard that it was a jet flying low and fast, at this point my friend asked me, \"well, what I want to know is, what is this other light\" as we saw the \"fireball like light\" at this point the fast low flying jet banked and headed at the fireball. Turning back to watch the fire ball we watched it (the best way to describe it) was to say it was shaking in the sky in an up and down motion, then with what would have to be really really fast it moved to the west then back at us then the shaking thing again but this time it was back and forth not up and down, at this point it started going in all different directions, 90 degree angles, stop and go (instant stop and go) and quickly dissapeared into the tree line. This is the point where we saw another jet (maybe the same one) flying in the same spot as the one before. It made it seem like they (the jets) were looking for that fireball light. I just wanted to say that my dad was a pilot and I love flying and all airplanes, and in my 38 years I've never seen anything move like that, the inertia would have killed the pilot. the whole thing gave me a weird creepy feeling, the chasing jets, starless evening, and the fact is, if the jets were privet then they should be in a bit of trouble for flying so low, made me think that they were military jets, it was creepy."]}