{"Date Submitted":"05/24/2010 12:20 UTC","Region":"Indiana","files":["/var/www/straped/mufon/html2text/23419.html.txt","/var/www/straped/mufon/org/23419.html"],"Country":"United States","Object Shape":"Star-like","divs":["Sighting DetailsMy first sighting occured around the first weekend of March. It was approximately 12:30 PM. I was sitting on my patio drinking my coffee and watching planes circle around my area. When I was watching one of the planes in the east I happened to notice two whiteish lights above it. The lights were in a pair, one on top of the other. The bottom light was slightly lower than the top and to the right. The lights then separated. One light then moved northwest and the other moved southwest. I lost track of the one moving southwest as it moved over and past my apartment building but I continued to watch the other. It moved for a minute or so then stopped. I was staring at it trying to figure out what it was then I noticed what appeared to me as a star to the right of it. I have never seen a star visible in the sky around noon so I called a friend to see if it is possible one would be visible around noon. I watched the light and star while I was on the phone for approximately 4 or 5 minutes, then the light moved off to the northeast. I have been seeing these things for the last three months. Im always doing the same thing, having coffee on the patio and watching the planes. It seems like they materialize in the sky when Im watching planes and commercial jets fly over. That's how I notice them. They always appear in a pair and then they will separate. One will move out of my sight while the other will move then stop. I would estimate that they are above cloud level. I'm not sure if they are metalic or white lights. As for their speed I would guess they move faster than commercial jets. They appear to flatten out or change their shape when they move. I lose track of them when fly over my building. I have located a youtube video and sent it to one of your case managers, Glen Means. It is an exact replica of my sightings. The only difference is I dont see as many in one sighting and the time of day."],"Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=40.419632,+-86.870627(23419)&iwloc=A&hl=en\"> mufon case (23419) map </A>","Log Number":"US-05242010-0006","Summary":"Multiple day sightings of star like objects in sky beginning March 2010 to present.","trends":["There have been 30 other sightings in Lafayette","There were no other sightings in Lafayette on or around March 5th 2010"],"Latitude":"40.419632","Viewing Distance":"Unknown","Case Number":"23419","Date of the Event":"03/05/2010 12:30 UTC","Disposition":"Unknown","Longitude":"-86.870627","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Source":"MUFON","Object Features":"Unknown","City":"Lafayette","Tags":"City","Sighting Duration":"00:10:00"}