{"City":"Winnipeg","Longitude":"-97.133514","files":["/var/www/straped/mufon/html2text/23410.html.txt","/var/www/straped/mufon/more/23410_submitter_file1__WTF.jpg","/var/www/straped/mufon/more/23410_submitter_file2__WTF2.1.jpg","/var/www/straped/mufon/more/23410_submitter_file3__IMG_8736.JPG","/var/www/straped/mufon/org/23410.html"],"Tags":"City","Disposition":"Unresolved","Latitude":"49.908564","Source":"MUFON","Log Number":"CA-05232010-0005","Region":"Manitoba","Object Features":"Unknown","Viewing Distance":"Unknown","Summary":"Solid, silver object seen 2 day in a row from backyard in the daytime.","Date Submitted":"05/23/2010 04:00 UTC","divs":["sighting detailson may 19th, 2010 while hanging my laundry outside i noticed a silver, solid object hovering in the sky towards the north. i was a perfectly claer day and i watched it for a while before it dawned upon me that this wasn't anything i could explain so i ran for my camera. when i returned it took me a few seconds if not a minute to find it again (i thought it would be gone) but i managed to get around twenty shots of it. the pictures i took were with my slr camera with a 300mm optical zoom and they were still somewhat fuzzy, but there was an object there and at one point it looked like there were two objects! on may 20th after having told some of my friends of the previous days adventure, i was fixing my bike in my backyard it was another perfectly clear day but i was not really considering that i would see anything again but there it was again this time to the west i had my camera ready on my desk so i ran over my son to get it. this time the object was much close and i got some images which clealy show defined shape or shapes because it kept changing shapes. this tiome the object moved faster and went behind my house whee i lost it. around a 1\\2 hour later i looked towards the east and since it was a fairly shiney (sticking out like a sore thumb) object i easily saw it. so i grabbed my camera once again, this time the object was much farther away and the pictures were more grainy but the object clearly changed shapoed several times before it started to move eratically. this is when the object broke into 2 pieces and shot out in 2 different directions and disappeared! sounds nuts but i have the pictures, even of it breaking apart into 2 pieces!"],"Date of the Event":"05/19/2010 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=49.908564,+-97.133514(23410)&iwloc=A&hl=en\"> mufon case (23410) map </A>","Case Number":"23410","trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around May 19th 2010","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","Country":"Canada","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Unknown","Object Shape":"Cone, Disc, Egg, Saturn-like, Sphere, Teardrop"}