{"Source":"MUFON","Case Number":"23429","Latitude":"46.090588","City":"Thetford Mines","Log Number":"CA-05242010-0015","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"11/07/1990 06:30 UTC","files":["/var/www/straped/mufon/html2text/23429.html.txt","/var/www/straped/mufon/org/23429.html"],"Viewing Distance":"Unknown","Country":"Canada","Longitude":"-71.298077","Object Shape":"Oval","Tags":"City","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.090588,+-71.298077(23429)&iwloc=A&hl=en\"> mufon case (23429) map </A>","Region":"Quebec","Summary":"Very bright orange/red/yellow oval","Date Submitted":"05/24/2010 11:49 UTC","trends":["There have been 7 other sightings in Thetford Mines","There were no other sightings in Thetford Mines on or around November 7th 1990","This sighting has never been favorited.",""],"divs":["sighting detailsin 7 nov 1990, i was 12 years old. i was playing with a friend behind our house. suddenly, appeared in the sky a magnificient oval ufo. the colors were very pure and beautiful orange\\red (with a little bit of yellow). me and my friend were very amazed about what's going on in the sky and wondered what it is? my father and uncle was also behind the house they were building the garage for the winter. my friend asked me to tell them to look in the sky, but i didn't do it, i was afraid to look crazy. my mother came outside and i asked for a camera to take a picture, but none was available. the ufo was slowly moving in the sky, and then disappeared and re-appeared behind his contrail. its stayed for a while and the disappeared behind a cloud. after the event, i went inside and talked about that with my brother. i drawed a picture of what i saw and described the event. he tolds me that some ufo networks are looking for witness of ufo, but we have no clue where to report the ufo (sorry, didn't know mufon at the time!). many years later, i read in the newspapers that the former canadian minister of defense (paul hellyer) said the ufo was real as planes over our heads and their technologies can solve the climate change and save the humanity! then i considered ufo a very serious phenomena, i read a lot about it... the french cometa ufo report, disclosure project, radio-canada ufo files, canadian national ufo archives... then i learned that the 7 nov 1990, there was a mass sighting of a ufo in montreal at place bonaventure. thousands of people saw a orange ufo and it was reported by la presse, radio-canada... and years later many tv shows reported the event. youtube ovni (ufo) place bonaventure or : mass ufo sighting montreal reported in tv news http:\\\\www.youtube.com\\watch?v=yfafydd8xbi&translated=1 it was a very beautifull event, i had no fear, i enjoyed the sight and stayed in my mind for many years..."]}