{"Date Submitted":"05/24/2010 10:50 UTC","City":"St Augustine","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-81.304228","map":"<A HREF = \"http://maps.google.com/maps?q=29.895694,+-81.304228(23427)&iwloc=A&hl=en\"> mufon case (23427) map </A>","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around May 15th 2010"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23427.html.txt","/var/www/straped/mufon/org/23427.html"],"Case Number":"23427","Country":"United States","Region":"Florida","Object Features":"Other, Unknown","Date of the Event":"05/15/2010 11:35 UTC","Summary":"Blue star turns into spacecraft.","Source":"MUFON","divs":["Sighting DetailsWhile driving north on I-95 from Miami I made a quick stop in the St. Agustine area Flying J truck stop at exit 305, about 11 PM. Soon after I returned to the highway, I noticed a bright blue light in the dark open sky. I kept sight of this blue star for about ten minutes, when suddently the blue star turn into a white glowing star, and in turn, started to move from West to East, kind of heading to the Jacksonville area, towards the Atlantic Ocean at about 30 thousand miles to then turn South. It got all my attention when from this light, two huge circled flashes came off from it, as if it had entered into the atmosphere or changed from being a circled star light to a flying craft coming down really fast. After the entry from space, I only could see pulsating and turning lights of blue, red and green colors approaching very fast the area where I was heading. Couldn't describe size or shape of object, but it flew along the highway around 5 thousand feet. The shadow above the lights was of about 100 to 200 feet long, no sound was emmited by the craft. I slowed down as much I could but I could not see where it went after I was by pass by it, because obviously I had to keep my sight in the road since I just kept driving. The night sky was clear, open and starry, no clouds, no noticiable air traffic in the area. When I first saw the blue star, never imagine that few minutes after watching it while driving, would turn into a bigger white star and move fast towards East. The most impressive was to see the emission of two huge circled flashes and then the white light dimmed to become a pack of shadow emmiting lights that started to fly right towards where I was heading. Frankly, I have never experienced such thing before."],"Object Shape":"Star-like, Other, Unknown","Log Number":"US-05242010-0013","Latitude":"29.895694","Disposition":"Unknown","Weather Factors":"Unknown","Tags":"City"}