{"divs":["Sighting DetailsMy husband and I were in front seat of car, with daughter in back seat. We were heading east toward Pioneer Pies on I240 (about May Ave) in Oklahoma City at about 7:30 pm. The skies were cloudy and various shades of gray, but still daylight. Will Rogers Airport is off to the West of us. As i was looking at the clouds, I noticed in the eastern sky in front of us, a darkish gray rectangle flying low in the sky heading S then SE. I told my husband and daughter and they saw it also. My husband was driving. It was a different color gray than the sky and looked solid. It did not appear to be a kite because it traveled very smoothly along a line, horizontally. We then had to park the car-(had to turn back to west to park) and lost sight of it for about a minute, but it had disappeared just before that). Once we got out of the car, we looked up and could see it again, but it was harder to see and higher in the sky. At the same time, another plane was taking off. That plane's contrail was diagonal-up and much higher in the sky. The rectangle had no contrail and we couldn't hear anything and it moved very slowly horizontally it appeared. It faded from view as we went into the restaurant. We did not see any lights on it nor was there any area in the middle that was darker or more dense, like an engine or cockpit area. Don't know if it was a biplane, but it looked solid all through. Not shiny. We all thought it was strange."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.47076,+-97.507638(23421)&iwloc=A&hl=en\"> mufon case (23421) map </A>","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around May 22nd 2010"],"City":"Oklahoma City","Region":"Oklahoma","Log Number":"US-05242010-0008","Latitude":"35.47076","Object Features":"None","Sighting Duration":"Undisclosed","Date Submitted":"05/24/2010 01:10 UTC","Weather Factors":"None","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-97.507638","Country":"United States","files":["/var/www/straped/mufon/html2text/23421.html.txt","/var/www/straped/mufon/org/23421.html"],"Disposition":"Unknown","Date of the Event":"05/22/2010 07:30 UTC","Case Number":"23421","Object Shape":"Square, Rectagular","Source":"MUFON","Viewing Distance":"Over One Mile","Summary":"dark gray rectangle low-flying over city toward SE direction"}