{"Object Features":"Other","Viewing Distance":"101-500 Feet","Object Shape":"Bullet, Missile, Cylinder","trends":["There have been 2 other sightings in Crowley","There were no other sightings in Crowley on or around May 10th 2010"],"City":"Crowley","map":"<A HREF = \"http://maps.google.com/maps?q=30.219793,+-92.369176(23436)&iwloc=A&hl=en\"> mufon case (23436) map </A>","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Louisiana","Longitude":"-92.369176","Source":"MUFON","Country":"United States","Disposition":"Hoax","Summary":"long ship-windows-transparent-","Tags":"City","files":["/var/www/straped/mufon/html2text/23436.html.txt","/var/www/straped/mufon/org/23436.html"],"Log Number":"US-05252010-0007","divs":["Sighting DetailsThis long ship had windows and passed over crowley at high rate of speed. i observed the craft from my front lawn and was so shocked , i told my wife and son..i described the long-sausage shaped vehicle and made mention of the windows and the Rate of the vehicle and the fact it was Ultra-transparent and less than a hundred feet as it passed over the trees and going into downtown.the Sighting was only for 15 seconds , but was very vivid and obvious it wasnt human and strange. the craft appeared to me and then went back to invisible and traveled along. thus, i make this report to your people to document and give some info. to your research. **NOTE: this craft was in comparison to a Mobile home Flying along at at least 100 MPH and then dissolved away as it flew by.It was about 6 Pm and i usually watch the news at this time..but i was going to lock my car and looked above the tree line looking at the weather ..when the Craft was seen flying along and i wasnt sure if the beings wanted me to see them . but obviously it was a Blazen display of \"BEING SEEN\" and went un-noticed by everyone except me.i thought this all to impossible and then realized this was not at all normal and told my wife.it simply was slipping along and had huge windows and was quiet and transparent. i did not see any Beings but saw the Shape.LONG,CYNDRICAL,Fast,And low(&) FEET) and then vaporised away...I have never seen an Airship suck as this...I am very observant of the sky because of my Up-bringing and notice anything that flys along the sky.i have some starnge thoughts of this sighting because i Did not know what the%$#@ it was or Have never before seen anything like it before. i made note of the fact that This would be more than others could handle if they would have witnessed the same sighting....i felt transfixed and Viewed the Ship as if i were a camera or Film-camera .as i went over the Scene repeadetly in my mind, i realized this was very un-common and what i would say was \" SNEAKY,STEALTHY and IMPOSSIBLE to view ,....but did!!I dont mess with Fiction or Presumtions because i have always sought \"TRUTH\" and theoritically will not be a TALE-BEARER as this is Not truth...but i have to reel from the Sight non-the less.I regret i have no photograph to share but this is all i had. thank you, mike D. Edwards-crowley,louisiana.70526(337)785-0171 I live in southern louisiana and have been in the bayou many times where others will not go...this area is prime for such starnge occurances as i realize the potential for sightings of this kind and have Once before observed a stange craft in the bayou apperently \"COOLING-OFF' in the water. my hunting dog\"Hunter\" went after the ship and then tured tail and ran away terrified and upset he did not BITE the Object."],"Sighting Duration":"00:01:00","Latitude":"30.219793","Date Submitted":"05/25/2010 10:32 UTC","Case Number":"23436","Date of the Event":"05/10/2010 06:10 UTC"}