{"Country":"United States","Latitude":"31.101074","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05252010-0010","trends":["There have been 10 other sightings in Temple","There were no other sightings in Temple on or around June 15th 1998"],"Date of the Event":"06/15/1998 03:00 UTC","Longitude":"-97.333242","Object Shape":"Blimp, Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=31.101074,+-97.333242(23439)&iwloc=A&hl=en\"> mufon case (23439) map </A>","files":["/var/www/straped/mufon/html2text/23439.html.txt","/var/www/straped/mufon/org/23439.html"],"City":"Temple","Tags":"City","Date Submitted":"05/25/2010 12:34 UTC","Weather Factors":"None","Summary":"Clear hot summer day. No aircraft. Viewed from approx. 1.5 kliks distance. Height approx. 1200 ft. Silver blunted cigar shape. Movement slow, North to South orientation.","Case Number":"23439","Disposition":"Insufficient Data","divs":["sighting details while working as a semi trailer inspector in a large concrete trailer parking area behind the temple,tx wal mart distribution center. at approximately 3:00pm cst the area outside was pretty much deserted as most arrivals\\departures happen morning and evenings. i was alone, caught up with paperwork, and had time to relax before the coming influx of vehicles started. hot summer afternoon, absolutely clear weather. having a cup of coffee, i strolled to the end of the open-air, covered inspection bay and leaned against one of the support pillars and just hung out. looking to the west i noticed a vehicle in the air, about 1200 to 1500 feet in altitude, and with nothing else in the area i gave it my full attention. this happened to look like what i assumed was a lighter-than-air ship, but that thought evaporated as i inspected it closely. this was no blimp, zeppelin, balloon, or any other type of human construction. hold up. i'll say right now i am a veteran cavalry recon scout. i am trained to spot and correctly identify vehicles, equipment, aircraft, and personnel with as much detail as possible. this object was silver,tubular with blunt, rounded ends fore and aft. from my point of view there were no openings, windows, panel lines. there were no markings whatsoever. it had no directional stabilizers, i.e. a tail or empennage. it had no motor pods or propellors. it made no sound. it was not affected by the light breeze nor did it 'porpoise' like a dirigible. it traveled on a straight course, in a generally north-to-south direction. its airspeed was somewhere around 50mph, possibly slower. total time in my field of vision, which in that area was unimpeded, was about 20 minutes. alongside this vehicle were two black \"dots\" maintaining formation as if escorting the silver object. they continued 'in a stately manner' until lost from sight. since i was at work i had no camera but seeing as how odd this sighting was i have the event firmly pictured in my mind and can draw\\paint the event with exact detail(which is easy since there were no details to speak of)"],"Object Flight Path":"Straight-line path","Region":"Texas","Object Features":"None","Sighting Duration":"00:20:00"}