{"City":"Little Rock","Latitude":"34.753671","files":["/var/www/straped/mufon/html2text/23444.html.txt","/var/www/straped/mufon/org/23444.html"],"Case Number":"23444","Summary":"A disc shaped object which made no sound or created any wind approached me from approx 100 yards away. Proceeded to me and hovered directly over the front of my car for approx 10 -15 sec. I could see it clearly by looking up through the front windshield","Object Features":"Unknown","Date Submitted":"05/25/2010 04:06 UTC","Object Shape":"Disc","Object Flight Path":"Hovering then path","Log Number":"US-05252010-0015","Sighting Duration":"Undisclosed","Date of the Event":"11/30/1987 12:00 UTC","Country":"United States","Region":"Arkansas","Source":"MUFON","Longitude":"-92.282445","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.753671,+-92.282445(23444)&iwloc=A&hl=en\"> mufon case (23444) map </A>","Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsI just got off work @ approx 6pm. I stopped at a convenient store and proceeded home. As I left the city limits and headed out a country road toward home, I glanced to my left out to an open field and noticed what I originally thought to be a helicopter searching for something with its spotlight. I didn't pay much attention, but then my subconscious realized that there was no propeller noise, and I was close enough I should have heard it. So then I looked back at it and noticed it was proceeding in my direction. Not fast paced, but more slow and deliberate. It was very close to the ground, it only went higher to avoid trees and powerlines. No higher than to clear the obstacles. At this point I realized that I was about to run off the road into the ditch, so I hit my breaks and came to a complete stop in the road. With the car stopped I continued to keep my full attention on the craft, not wanting to take my eyes off of it for one moment. By the time it had approached my road to my left and at the ditch line on my left, I am parked at the right ditchline. It was that close! And it was very low, just hovering above the ground. The craft proceeded very slow and went vertically up just high enough to clear the power line to cross the street I was on. As it proceeded across the street, it came to a complete stop almost directly over me. It was just enough in front of me that if I crawled up in the dash I could look directly up at it. It was very large craft, all one silver metallic color, it made no sound at all and created no wind. The only light I noticed came from the bottom of the craft in the very center of the disc. The light that emitted from the bottom was more like a laser light, not a flash light. The light did not shine outward it came down like a beam. The craft began to move on in the same direction crossing the street and lowering back down toward the ground after clearing the power lines. I decided to follow it, so I turned right on a road I was not familiar with and continued it the craft direction. However, this road came to an end and I had to lock up the brakes and stop my car. I crawled out of the car through the passenger door as the driver door did not open and proceeded to walk up the hill that the craft lowered behind. As I approached the half way point between the top of the hill and my car I noticed it was dusk and would be dark pretty quickly. I must admit I was sort of chicken at this point not having the false sense of security the vehicle provided. I was afraid to go over the hill an it turn dark on me not knowing what to expect on the other side of the hill. So I decided to abort and go to my car and continue home. I am not sure of the exact date, but I do know it happened on a Friday and I am pretty sure it was 1988. Also, I am not the only one to have sightings on this night, so you should be able to find record. In fact, there were so many sightings that the government actually issued a response. The government response was that it was a Russian satelite that had fallen out of orbit. I can assure you that this craft was not a sattelite falling out of orbit. This craft was changing speeds, dodging trees and powerlines and stopped and proceeded again. Not consisted with something falling out of orbit. I do not believe that I lost any time, however I do not remember checking times. It didn't seem like I lost time. I would love to be hypnotized to see what else could be remembered. It truly was one of the most exilerating moments of my life. I chickened out because I didn't want to be abducted and to my knowledge I was not. I did not see anyone driving the craft or anyone outside the craft. All the same, it was pretty amazing!"],"trends":["There have been 21 other sightings in Little Rock","There were no other sightings in Little Rock on or around November 30th 1987"],"Viewing Distance":"20 Feet or Less"}