{"files":["/var/www/straped/mufon/html2text/23446.html.txt","/var/www/straped/mufon/org/23446.html"],"Summary":"A star like UFO was wondering the sky over my house. It was far away, like hight wise. It was all over and then it was gone really fast","Source":"MUFON","Case Number":"23446","Latitude":"28.388296","Object Shape":"Star-like","Region":"Florida","Date Submitted":"05/25/2010 05:44 UTC","City":"Cocoa","map":"<A HREF = \"http://maps.google.com/maps?q=28.388296,+-80.739558(23446)&iwloc=A&hl=en\"> mufon case (23446) map </A>","Weather Factors":"None","divs":["Sighting Details Well to start, I was on my way home from my girlfriends house. I had left her house around 11:30 PM. Even though my parents encouage me not to I walked home from her house which takes me around 20 minutes. My house is a little under a mile away. On my way home if I walking I usually will gaze at the stars. I am and always have been fasinated with space, so if I get a chance just to sit and watch the sky I usually will scane the sky. About five minutes or so into my walk I noticed a unusally star in the sky. It just didn't look normal. The only way I can discribite is if you saw a satilite go across the sky, that was about the size. To be honest I have seen satilites numerous times and that's what I pinned it out to be at first. But, then I realized the size of the object would increase in size slowly and then decrease in size as if it was coming closer and then going away. this went on for about two minutes or so and then it disapeared right in the middle of the sky. In other words in didn't fly behind anything on the herizion of my vision. It just disapeared right in the middle of the sky. So I just was like what the hell and I left it at that. I kept walking and finally after about 15 minutes I got to my house and was walking around to the back so I could go inside and hit the sack,but as I was walking up the stairs of my back porch I looked up one more time, and it was back. It made feel uneasy like it was following me, but at the same time I was fasinated so I just watched it. Now let me explain something. If I broke the sky up in quarters(fraction),I will just use N., S., E., and W. to name these quarters. I was walking S. at the time when this object first cought my eye. But the second time I saw it it had to be at least 35 miles away from where I saw it previously in the direction W.. I had to watch this thing for well over 30 minutes and it just danced around the sky going up, then down, then left and right several times, then it went like diagnaly going tword the ground and the it stoped and it just sat there for like two minutes. I just wached it to see if it would move agine and the it went up really fast at least 50 to 150 ft if you were right there with it and the disapeared agine. Now that that story is over there is something else I would like to share it was another similer experience I had view with my father so at least this tim I had a witness. My father and I were working out in the yard. this was around four years ago. We had lived next to a man named Steve who worked for Nasa. He was a vetrian worker so he would have easily explained what we saw but he himself was in awe when he got him to watch it with us. now remember this is in plane day. when we first saw the objects there was two. We watched them for a while and they did almost did what the one I just discribed to you did. Then I ran Over top get Steve. when I retured with him there was now three of them. they dance around the sky for a while. danced around each other going in every direction. Then right before our eyes two of the objects just disapeared and the one object that was in the middle of the three just went strait up so fast it was gone before I could say one. i have seen things in the sky and when I do I try to think of evry possible thing it could be before im like \"Oh my god.. I just saw a UFO\". I mean there are plunty of things there could be like planes, satilites, or even planets themselfs. But these two thing I have no Explanation for. I brought the first thing I mentioned to Steve and he had no explanation for what I saw. I hope this helps in some way. I know People doubt the fact that there are beings from a distant places that visit us and I used to too, but no more. thank you. Phillip"],"Date of the Event":"Unknown","Log Number":"US-05252010-0017","Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-80.739558","Object Flight Path":"Path with directional change","Sighting Duration":"01:00:00","Object Features":"Unknown","Disposition":"Hoax","trends":["There have been 5 other sightings in Cocoa","There were no other sightings in Cocoa on or around"],"Tags":"City"}