{"Tags":"City","Disposition":"Unknown","Summary":"Not a UFO sort of","Longitude":"-89.974574","Latitude":"38.52678","Viewing Distance":"Unknown","Log Number":"US-05252010-0014","Weather Factors":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/23443.html.txt","/var/www/straped/mufon/org/23443.html"],"Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=38.52678,+-89.974574(23443)&iwloc=A&hl=en\"> mufon case (23443) map </A>","trends":["There have been 15 other sightings in Belleville","There were no other sightings in Belleville on or around May 25th 2010"],"Case Number":"23443","City":"Belleville","Source":"MUFON","Date Submitted":"05/25/2010 03:38 UTC","Sighting Duration":"Undisclosed","Object Shape":"Other","Date of the Event":"05/25/2010 02:14 UTC","Object Flight Path":"Undisclosed","Country":"United States","divs":["Sighting DetailsI have seen four Raptor in the air, (may 21) told a few people and then two days later, another very large \"Night Blimp?\" I take dog out at 9:45 every night, and saw the first \"Night blimp\" THe next day I remember seeing the sasme thing. I have seen Raptors in the air since then. At least one a day. I was not drinking, it was just something that appeared. I told a buddy of mine about it and I have a weird van parked across the street. It is a not communications company in my area. Guy in the truck said, and glared, It's the neighbors. THey have had internet problems and cable since so have we? Digital is cool, but we lose a bit of the non digital. It all started a few days ago... It is the same as Mark Lopinot's craft. I cannot speak of this to anyone (Wife, maybe the dog), but I will, Heck if all the cops saw it, that's fine. It is the same craft, Enormous Delta WING , SILENT, Moved Northeast. Moved Low flying. Dog , old, \"Felt it?\" and ran to the deck. Notification of the object: Saw it. Not behaving right in the night sky. It actually went over the house, SILENT. But there was a weird \"WAVE\" can't explain it I Lost sight of the object as it cleared the trees, very low. I am freaked out by the apperence of, strange repair men. I am not nuts"]}