{"trends":["There have been 6 other sightings in Pacifica","There were no other sightings in Pacifica on or around May 24th 2010","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"05/25/2010 06:39 UTC","Country":"United States","Tags":"City","Source":"MUFON","Object Flight Path":"Undisclosed","Region":"California","Date of the Event":"05/24/2010 01:00 UTC","Object Features":"Undisclosed","Summary":"UFO ORB PHOTOGRAPHED UNINTENTIONALLY BY PHOTOGRAPHER","files":["/var/www/straped/mufon/html2text/23449.html.txt","/var/www/straped/mufon/more/23449_submitter_file1__photo-1.jpg","/var/www/straped/mufon/more/23449_submitter_file2__photo-7.jpg","/var/www/straped/mufon/more/23449_submitter_file3__photo-3.jpg","/var/www/straped/mufon/org/23449.html"],"Longitude":"-122.472792","Weather Factors":"Unknown","Disposition":"IFO","Latitude":"37.633897","map":"<A HREF = \"http://maps.google.com/maps?q=37.633897,+-122.472792(23449)&iwloc=A&hl=en\"> mufon case (23449) map </A>","Log Number":"US-05252010-0020","Object Shape":"Oval, Sphere","City":"Pacifica","Case Number":"23449","divs":["Sighting DetailsA friend of mine snapped a UFO ORB unintentionally while taking a photo from her cellphone of the ocean view near the city of Pacifica, CA. This happened around 1pm. She did not notice the object while taking the photo. She first noticed the glowing object AFTER viewing the photograph so she didn't see the object in motion. I was not with her at the time but she sent me the photo the next day after noticing the glowing orb in the sky. We thought maybe it was the moon but the moon didn't rise til around 3:30pm earliest and its definitely not the sun since its 1pm and she is taking the photo facing west. The sun was above her to the left at that time. She checked her windshielf to make sure there were no bright spots or any type of spot that could make that glowing object in the sky and that was ok as well. We don't think its a planet or star cause its not glittering but glowing.... Here are the photos: one is the original and the other is altered as I increased the saturation of the photo. The third photo is a cropped, up close photo with the saturation increased."]}