{"Date of the Event":"01/31/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.140308,+-95.599857(23445)&iwloc=A&hl=en\"> mufon case (23445) map </A>","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/23445.html.txt","/var/www/straped/mufon/org/23445.html"],"Longitude":"-95.599857","trends":["There have been 3 other sightings in Sulphur Springs","There was one other sighting in Sulphur Springs on or around January 31st 2009"],"Country":"United States","Latitude":"33.140308","Log Number":"US-05252010-0016","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Region":"Texas","Summary":"Odd movement.","Object Shape":"Flash, Unknown","Case Number":"23445","Viewing Distance":"Unknown","City":"Sulphur Springs","Object Flight Path":"Undisclosed","Date Submitted":"05/25/2010 05:15 UTC","divs":["Sighting DetailsIt was my birthday an i was excited about a gift i had been given. the gift was the rocket kit you could buy at walmart. My dad has always been estatic about building the rockets with me. We came up with the idea to launch them at night and attach glow sticks to them to watch them go up in the night. it was around 1am when me and my dad and a friend went out to to a field out in the country side. (where there was no lighting) we had about 7 rockets we had built and attached the green glow sticks to. we launched about 4 of them when something strange appeared. As the 4th one launched it was hard to see the glow stick because of the fast movement but as the rocket came to the peek of its climax you could easy spot it (the rockets would arch due to the uneven weight caused by the glow sticks) as the rocket arched it seemed to land on something you could not see. as soon a the rocket seemed to come to a complet stop and hover in the air the object it had landed on had become visable and moveed very fast like if to shake off the rocket and as the rocket fell the odd metallic flat object seemed as if it was struck by lightning but made no sound and then it was unseen again. we where all struck dumb by seeing this, that non of us had an idea what it could have been. we never could fing the rocket that had landed on the object."]}