{"Country":"United States","Object Flight Path":"Straight-line path","City":"Cowansville","divs":["Sighting DetailsMyself three others had just pulled up parked in the driveway of our farm. Westared to walk toward the house, but stopped dead in our tracks when we saw aHUGE wedge-shaped like a piece of pie space ship I dont say UFO, because it wasOBVIOUS that it was a space ship appear over the treeline. One witness was veryfearful, and ran into the house, and never came back out, and will not speak ofthis event to this day and gets very angry if you bring it up. The other 3 ofus stood there in awe, as the ship flew silently toward us. It made no sounduntil it got RIGHT ABOVE OUR HEADS, at which point it made a rumbling sound asit lowered to be very close above our heads. It hovered there, and then TOOKOFF in a BLINK of an eye--shot off over the opposite horizon--barely had time toturn our heads to see it go. Of the 3 of us who stayed there to see this thing,I am the only one willing to talk about it to strangers. The other 2 will notspeak of it to anyone outside of the 3 of us. the 4th wont speak of itperiod--with anybody There MAY have been some missing time invloved here, butthe person who would most likely know the 4th who ran into the house will notconfirm or deny this. It was afternoon--broad daylight when we saw it come overthe trees, but I have the vague memory that it was a bit darker when it shot offover the other horizon. Also, we were standing in a different place about 10away from where we were when we first saw the ship when it left. We MAY havewalked there of our own accord, and I just dont remember it. There were lightsall over the bottom of the craft, but I dont remember the colors anymore. I doremember that it was metallicsilver in color, and that it had a great deal ofmetal shapes all over the bottom of it--like many mechanical pieces ofsomething. The other two people said that they saw another, smaller shipsuspended above this ship. I was not tall enough to see it myself."],"Log Number":"","Sighting Duration":"00:05:00","Region":"Pennsylvania","Tags":"City","Disposition":"Insufficient Data","Latitude":"40.886703","Date Submitted":"11/30/1983 12:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2345.html.txt","/var/www/straped/mufon/org/2345.html"],"trends":["There have been no other sightings in Cowansville","This sighting has never been favorited."],"Object Shape":"Cone","Summary":"Close Encounter with HUGE Wedge-Shaped Space Ship","Viewing Distance":"20 Feet or Less","Case Number":"2345","Weather Factors":"Unknown","Date of the Event":"11/30/1983 12:00 UTC","Longitude":"-79.589569","map":"<A HREF = \"http://maps.google.com/maps?q=40.886703,+-79.589569(2345)&iwloc=A&hl=en\"> mufon case (2345) map </A>","Object Features":"Patterned Surface"}