{"Date of the Event":"05/22/2010 11:30 UTC","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting Details Approximately one month before I saw a bright light go past my backyard window and in my kitchen. I grabbed my camera and recorded what looks to be two dark gray creatures in my kitchen. Then went out back and filmed two different UFO,s. After examining the tape I was freaked did not want to believe what I saw. And still my biggest question is why me! So last Saturday I went back outside with my camera and captured three different type crafts. The first is a futuristic looking plane it would fly within 10 feet of me. the second was a ring looking craft with a single bright light moving fast and go to a sudden halt looked to be starring me down,then a disk \"saucer\" shaped shot from the right to the left faster than a speeding bullet. It sounded similar to a fighter jet, which I have also recorded. I would appreciate contact by phone, not e-mail. I would really like a response ASAP and Thank You for your time."],"Disposition":"Insufficient Data","trends":["There have been 2 other sightings in Roy","There were no other sightings in Roy on or around May 22nd 2010"],"Longitude":"-112.016711","Log Number":"US-05252010-0025","Object Shape":"Disc, Other","Country":"United States","Sighting Duration":"01:00:00","Object Features":"Dome, Patterned Surface, Appendage(s), Louvres, Wings, Other","Weather Factors":"Unknown","Date Submitted":"05/25/2010 11:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.169811,+-112.016711(23454)&iwloc=A&hl=en\"> mufon case (23454) map </A>","Summary":"I saw three different types of UFO,s I have them all on video.","Case Number":"23454","files":["/var/www/straped/mufon/html2text/23454.html.txt","/var/www/straped/mufon/org/23454.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Latitude":"41.169811","Region":"Utah","Source":"MUFON","City":"Roy"}