{"Sighting Duration":"Undisclosed","Log Number":"US-05252010-0023","Object Shape":"Triangle","trends":["There have been 3 other sightings in Sanger","There were no other sightings in Sanger on or around May 13th 2010","This sighting has never been favorited.",""],"Source":"MUFON","Disposition":"Unknown","Region":"California","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23452.html.txt","/var/www/straped/mufon/org/23452.html"],"Date Submitted":"05/25/2010 10:44 UTC","Date of the Event":"05/13/2010 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.708006,+-119.555965(23452)&iwloc=A&hl=en\"> mufon case (23452) map </A>","City":"Sanger","Object Flight Path":"Stationary","Latitude":"36.708006","Country":"United States","Object Features":"None","Case Number":"23452","divs":["Sighting DetailsOn May 13, 2010, we were driving back from my sisters house who lives in Selma. My mom was driving and I was in the passenger seat. We were driving North on Mc Call ave from Selma and as we turned right on North ave towards Sanger when I saw what I thought was a plane hovering in one place over a field about 500ft from North ave. It wasn't that high because I saw it out of the windshield. It caught my attention because it wasn't moving, it was just floating there. I told my mom to look at it but she could not turn her head and drive at the same time. I got my phone and I called my brother, Jeffrey Gonzalez, who is a investigator for MUFON. I told him what I just saw and he said it was a plane because Jeff said their is one landing at the airport and I told him no, It's not a plane so he told me he was going to get into his truck and drive in the direction so he could video tape the craft. I told him it was a triangle with like whits Christmas lights all around it. I hung up the phone and a couple of minutes later he called me back. He was about to ask me in what direction was the craft heading then both our phone's got dissconnected. I thought it was wierd because I have a I-phone and it has never done that before. I noticed that I had all my bars for good reception. My phone rang again and it was jeff, he asked me what happened and I told him I don't know why our phoes went dead. Then he asked me once again, which way was the craft going and as I was going to tell him, our phones went dead again. Again, I had all my bars. The phone rang again but by that time I could not see the triangle anymore. I know I should have taken a picture but when you see something like that you freak out. Here is a picture that I drew, I guess it was the same size as a Military Jet."],"Longitude":"-119.555965","Summary":"I was the passenger in a car, saw triangle with lights all around it.","Viewing Distance":"501 Feet - 1 Mile"}