{"Country":"United States","Longitude":"-112.181037","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-05262010-0001","Region":"Arizona","divs":["sighting detailsi was having a rough day, piecing together a personal conspiracy puzzle -- waking up out of a government\\interdimensional being conspiracy. i go out in my car with my dog at night, headed south toward the park, driving on a city road with many other cars around. i notice a light in the southern sky, as bright as a planet like venus, and think, that's weird for a planet to be there. continue to drive, look up again, and this bright light has two blinking lights on the sides of it, like airplane lights, and as i'm looking at it, the middle light turns off, and now it looks like any airplane at night, flying north, but right above the area where i was driving. i did a \"what the hell?\" and my head was tingling just a bit after that. considering what i've discovered about technology recently, i will go out and say it: it must have been a mind reading device, or a thought implanting device, that caused the tingling. the ufo went past my view, me going south, it going north, and i went home after seeing that. i'm surprised something like this would happen considering all the very disturbing things i'm discovering these past couple days."],"Date Submitted":"05/26/2010 12:33 UTC","Tags":"City","Summary":"Planet in the southern sky that turned on plane lights and moved north, then turned off central light.","Disposition":"Hoax","Object Features":"Unknown","Case Number":"23455","Latitude":"33.543412","Date of the Event":"05/25/2010 08:37 UTC","Viewing Distance":"Unknown","City":"Glendale","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around May 25th 2010"],"Weather Factors":"None","Object Flight Path":"Stationary,Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/23455.html.txt","/var/www/straped/mufon/org/23455.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.543412,+-112.181037(23455)&iwloc=A&hl=en\"> mufon case (23455) map </A>","Object Shape":"Circle, Star-like"}