{"City":"Apache Junction","files":["/var/www/straped/mufon/html2text/23459.html.txt","/var/www/straped/mufon/org/23459.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.417388,+-111.542578(23459)&iwloc=A&hl=en\"> mufon case (23459) map </A>","Case Number":"23459","Object Shape":"Star-like","Date Submitted":"05/26/2010 12:54 UTC","Summary":"2 blinking lights were playing (thats the closest thing I can think of)","Tags":"City","Date of the Event":"05/25/2010 09:10 UTC","Latitude":"33.417388","Disposition":"Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"00:03:00","trends":["There have been 16 other sightings in Apache Junction","There were no other sightings in Apache Junction on or around May 25th 2010"],"Source":"MUFON","Log Number":"US-05262010-0005","Longitude":"-111.542578","Object Features":"Unknown","Region":"Arizona","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Country":"United States","divs":["Sighting DetailsI had went out to turn on the water for the sprinkler system when I noticed a helicopter or small airplane travling north to south. Just as the aircraft went behind the house next door roof line I noticed a faint light fadeing in and out(blinking). I thought it was a star or high fling aircraft. In a second or two another light appeared. They jumped from point to point like they were playing. The blinking was not consistant, sometimes the blink was fast and sometimes it was longer. At one point they went out and a few seconds later appeared in another point in the sky. After a few more game playing they moved back to a point close to where I had first seewn them. They played maybe 15 to 30 seconds and disappered. I ran in the house to get my cameras while my freing watched them and pointed the camcorder in their direction but was unable to set the view finder on them. I kind of believed there were such things in the sky but at almost 64 this is the first time I have seen something, now I am a beliver."]}