{"trends":["There have been 2 other sightings in Tulare","There were no other sightings in Tulare on or around April 30th 2005"],"Case Number":"23451","Sighting Duration":"Undisclosed","Date Submitted":"05/25/2010 10:42 UTC","divs":["Sighting DetailsI have the event written in my schedule, which I couldn't lay my hand on quickly right now. Just watched 'UFO Hunters' on tv, and they talked about a 'boomerang-shaped ufo'. I had never heard anyone else describe what I saw before; so I thought I'd write this note. At the time (next day) called a local director of a local observatory here, but he never called back! It was a lunar eclipse, and clear evening. My honey and I were in the hot tub, watching it. I got tired of looking at the moon, so turned away to stare off into the night opposite. I was looking at one spot in the sky, when I noticed something was moving up there. As I watched, an object that was 'boomerang-shaped' was going fast across the sky, and absolutely soundless. It obscured the stars behind it as it moved from west to east, taking about 7 seconds at the most to cross the heavens. I knew it was boomerang, not a triangle, because as the stars were revealed again, the space between the lines of the boomerang had stars immerge while the two bars of the object still obscured the stars. It was incredible! Hard to judge distance or size without a reference. It seems to be half the altitude a jetliner cruises, and at least three football fields long. It was a boomerang shadow, cutting across the sky. It was a one in a million chance that I would have seen this; if my vision hadn't been perfectly still on one spot in the sky, and in exactly the right location, and if the sky hadn't been remarkably clear and dark, during a total lunar eclipse, I would never have seen it. I shouted to Don and pointed, but by the time he could adjust his eyes, it was gone. Oh, and it was a true 'shadow'. No lights, no reflective quality (for something so large, particularly). It was exactly the same dark value as the rest of the sky; it did not have any other quality for it to stand out. Again, it was the pattern of disappearing and reappearing stars that gave it away, showing its sillouette (sp). The direction was travelling west to east, with a bit of a north-west to south-east aspect; moving in a line across the sky. It vanished out of my line of sight with houses, etc., in the way. My reaction was that I couldn't believe that I had actually seen an UFO! I know what I saw, and will take a lie-detector on it. Things really are going on that we don't know about! I was thinking how weird it was that the object I'd seen was not what other people usually talk about seeing; a disc or lights or triangle. This was trying to be invisible, like it was reflecting exactly the color of the sky behind it. Cool. I can't remember what evening that was; have it written down. I wonder if anyone saw anything unusual during that spring eclipse, 2005? Thanks, (55 year old female)"],"City":"Tulare","Summary":"Dark Boomerange Shape Obsured Stars during Lunar Eclipse","Date of the Event":"04/30/2005 12:00 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.207729,+-119.347338(23451)&iwloc=A&hl=en\"> mufon case (23451) map </A>","Country":"United States","Object Shape":"Boomerang","Viewing Distance":"Unknown","Latitude":"36.207729","Longitude":"-119.347338","Object Features":"None","Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","Log Number":"US-05252010-0022","files":["/var/www/straped/mufon/html2text/23451.html.txt","/var/www/straped/mufon/org/23451.html"],"Disposition":"Unknown","Weather Factors":"Unknown"}