{"Object Features":"Unknown","Longitude":"-97.102966","Date Submitted":"05/26/2010 12:52 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"00:25:00","Log Number":"US-05262010-0004","Date of the Event":"05/25/2010 09:07 UTC","Latitude":"32.736967","Case Number":"23458","Tags":"City","files":["/var/www/straped/mufon/html2text/23458.html.txt","/var/www/straped/mufon/org/23458.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Other","divs":["Sighting DetailsMy wife went to the pool around 9 pm. At 907pm she called me from the pool and I colud not understand what she was saying at first because the phone was making a weird whooping sound. I then heard her say ufo and I rushed out to the pool. There it was, the ufo I reported on cinco de mayo. I could see it perfectly clear this time. My wife and I began to take video with our camera phones. I told her to go get her actual camera for better video. She went and got it and we began to take regular video of it flying all around for about 5 minutes. Then it swooped down out of site on the other side of the apartment. We assumed it landed. I waited for a minute to see if it would come back and then decided to run to the other side of the building to try and see it. That was what I did when I lost sight of it on the 5th but this time it was still there. I took a few pics and shot around another four or five minutes of video of it. There was a small crowd of other people across the street who had pulled over the watch it. It flew in an acrobatic style as if putting on a show still around 500 ft in the air like last time. But this time it went up to around 1000ft and would swoop down to 500ft. it made no sound. It would hit a few hundred miles per hour every now and then. It flew around a the same 3 or 4 mile radius for about 25 minutes. then it was gone. Got great footage of it swooping at high speeds then doing an instant change in direction. When I saw it on the 5th I was unable to see it clearly and thought it was a triangle but it seemed to be a T shape as far as i could tell. Last time through the tree I was only able to see four blue lights and this time I could see 8 blue lights and a tiny red one in the middle. It had to be what messed up my wifes initial phone call. when I took two of the pictures it seemed to blink in response. that seems to be the whole thing."],"Weather Factors":"None, Windy","Source":"MUFON","Country":"United States","Region":"Texas","City":"Arlington","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.736967,+-97.102966(23458)&iwloc=A&hl=en\"> mufon case (23458) map </A>","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around May 25th 2010"],"Summary":"Ufo returned and flew in circles and back and forth."}