{"Disposition":"IFO","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around May 25th 2010"],"divs":["Sighting DetailsTonight at 9:35 pm, May 25th 2010, I just witnessed almost the same object again in color and illumination. This time it was a dim white light traveling from a north to south line. When directly overhead the intensity of the light grew as bright as the ISS does and then slowly dimmed out again as it was when I first started watching opposed the flash I saw with ther object from a few days ago. The total time of the visible object was around 30 seconds. I could see the extreme humidity outside was very thick and can only see 1 or 2 visible stars. After checking the ISS flyovers of St.Louis, there are no orbital paths flying over here until June so it wasn't an ISS flyover or a satellite, because satellites always give off a reddish hue due to the infrared light reflected back off the earth. Again it was a bright white object started out as a dim light then in the middle of path grew extremely bright as the ISS is and then slowly dimmed out with a speed about as fast as the ISS flyovers are from what I can reference. There were no FAA lights, just one solid white light, nothing blinking or flashing. No other planes in the sky before or after event. Following points answers: I went outside in my frontyard as i do all the time to smoke, don't smoke in my house, I always look up everytime at night at first i thought the dim light was a satellite for the first few seconds until the illumination grew extremely bright for about 6-10 seconds before slowly dimming out again. Shuttle or ISS doesn't seem to do this on the 10 flyovers I've seen. It's path was from almost due north to due south. I lost sight of the object after the light dimmed, but did not dim out was still visible but the humidity was very heavy here tonight in Creve Coeur (St.Louis County. (*One thing I can not account for this time is that possibly it may have been the USAF x37b)"],"Sighting Duration":"00:00:35","Object Shape":"Circle, Sphere, Star-like","Case Number":"23453","Object Features":"None","Region":"Missouri","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/23453.html.txt","/var/www/straped/mufon/org/23453.html"],"Longitude":"-90.193704","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.635532,+-90.193704(23453)&iwloc=A&hl=en\"> mufon case (23453) map </A>","Latitude":"38.635532","Country":"United States","Date Submitted":"05/25/2010 11:50 UTC","Summary":"bright white light, dim to bright to dim in illumination","Date of the Event":"05/25/2010 09:34 UTC","City":"St Louis","Tags":"City","Viewing Distance":"Over One Mile","Source":"MUFON","Log Number":"US-05252010-0024"}