{"Country":"United States","Region":"Mississippi","Date of the Event":"06/18/1947 07:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Date Submitted":"05/26/2010 02:02 UTC","Tags":"City","Case Number":"23467","Latitude":"33.410116","Disposition":"Unresolved","trends":["There have been 4 other sightings in Greenville","There were no other sightings in Greenville on or around June 18th 1947"],"divs":["Sighting Details I have sent this email to several Ufologists that I watched on the Ancient Aliens Series. So far no one has responded. I seriously believe that an abduction occurred on the night we witnessed this spectacular landing. Perhaps you know someone in my area that I could speak with about this incident. Dr. Friedman was kind enough to send me name of someone in this area in 2009 I did received an email from that person giving me a phone number. After calling and leaving several messages and not getting a response I stop pursuing the matter. However, there is not too many days that I don't think about this sighting more than 60 years ago. I realize that you are an extremely busy man. However, if you know anyone in the St. Louis, MO area that could help me understand why it took more then 30 years to remember a mesmerizing sighting my Mother, Grandfather and I witnessed when I was around 7 years of age I would appreciate the help. Here is what happened. We lived on a Plantation in Greenville Mississippi. My Father, Grandmother and sister had gone into the city to do the weekly shopping for groceries. My mother and I went outside to gather firewood for the fireplace as we walked off the porch into the front yard we observed a huge red ball of fire coming out of the sky and my mother exclaimed, \"Oh my God the world must be coming to and end\". All of a sudden the fire goes out and we saw huge ship with various lights, red, yellow and I believe green. My Mother yelled for my Grandfather who came out onto the porch and was unable to speak just stare. It lit up the area as if it was daylight. At the time we did not have electricity and used lamps for light. We actually saw people standing in the windows that was beneath the dome. The ship landed and that is all we remember. We do not recall it leaving, we do not recall ever talking to anyone about it. I find that very strange and have not been able to get it out of my mind. If you could refer me to someone in this area that I can speak to. I am now 68 years of age and am considering being regressed to re-live this experience. I seek no publicity only some kind of understanding as to what happened along with other strange occurrences on this Plantation. Thanks so much. Andrew"],"Summary":"First appeared as a Large red fireball decending slowing from the sky and the fire went out and a huge round ship with a dome and various colored flashing lights. Windows below the dome area.","Object Shape":"Circle, Disc, Fireball, Flash, Oval","files":["/var/www/straped/mufon/html2text/23467.html.txt","/var/www/straped/mufon/org/23467.html"],"Log Number":"US-05262010-0013","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.410116,+-91.061774(23467)&iwloc=A&hl=en\"> mufon case (23467) map </A>","Source":"MUFON","Object Features":"Dome, Window(s)","Viewing Distance":"101-500 Feet","Longitude":"-91.061774","City":"Greenville"}