{"Tags":"City","Object Flight Path":"Hovering then path,Path with directional change","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around May 24th 2010"],"Latitude":"43.616961","Case Number":"23462","Date of the Event":"05/24/2010 11:36 UTC","Log Number":"US-05262010-0008","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.616961,+-116.205896(23462)&iwloc=A&hl=en\"> mufon case (23462) map </A>","files":["/var/www/straped/mufon/html2text/23462.html.txt","/var/www/straped/mufon/org/23462.html"],"Source":"MUFON","Object Features":"Patterned Surface","divs":["Sighting DetailsMy cousin and I were using my 6\" Newtonian telescope in the backyard at about 11:36PM MST While chatting I was pointing out a star to the left of Polaris. (The north star) We were looking northwesterly at this point. I turned to adjust my telescope and when I turned back around I briefly glanced around the same spot I was looking before. I noticed immediately a fairly bright in magnitude light that was moving. It seemed to be about magnitude -3 or thereabouts. (My cousin having never looked away was staring at the light dumbfounded at this point. which seemed strange to me upon later recollection as I would have expected him to mention it right away.) My first impression was this must be a helicopter WAY in the distance coming toward us. I stated this to my cousin as well out loud. As the very last word of the sentence left my mouth the light became MUCH brighter in magnitude up to I would say a -5 at the peak of it. About 7 seconds had passed at this point since I had first glimpsed the light. As it peaked the light which I could see some discernable shapes in between the light gaps on it disapeared and I saw a cigar shaped object depart from the middle of the light and head north at a VERY high rate of speed. I could make out the object for about 3 seconds as it dimmed and then dispeared northbound. The bright light immediately vanished as soon as the cigar shaped object emerged. This was all fairly hard to make out at such a distance. My cousin describes pretty much the same story except he had it in visual range for about 3 seconds longer than I did while adjusting my telescope. If I hadn't looked up when I did I would have missed it and he would have been describing it to me. For obvious reasons I have kept my contact info fairly short but would be happy to talk about this in further detail at some point. Please contact by email."],"Country":"United States","Date Submitted":"05/26/2010 06:12 UTC","City":"Boise","Viewing Distance":"Over One Mile","Object Shape":"Cigar, Flash","Sighting Duration":"Undisclosed","Region":"Idaho","Disposition":"IFO","Summary":"Bright light moving fast above treeline flashed brighter and saw a cigar shaped object fly north from point of flash. Seemed at edge of space.","Longitude":"-116.205896"}