{"trends":["There has been one other sighting in Holladay","There were no other sightings in Holladay on or around May 25th 2010","This sighting has never been favorited.",""],"Date of the Event":"05/25/2010 07:45 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.668836,+-111.824656(23468)&iwloc=A&hl=en\"> mufon case (23468) map </A>","Latitude":"40.668836","Viewing Distance":"Over One Mile","Disposition":"Unknown","Object Flight Path":"Path with directional change","divs":["Sighting DetailsWhile working in the yard my wife saw a metallic glint when the vessel was first sighted in the NNE coming from the general direction of Parley's Canyon. It had an estimated altitude of ~9-10,500 feet using Mount Olympus (9,026 ft.) as a reference point. It moved at a constant speed of ~80-100 mph and made no sound. The object traversed at a steady speed from the NNE, veering slightly and crossing in front of Mount Olympus and heading SSW toward Sandy. We lost sight of it as it moved far enough away that it was no longer visible as it was blocked by our garage roof. At first glance I thought it was a commercial aircraft because the way it was reflecting light it was hard to see the object clearly and I didn't have my glasses on. My wife first thought it might be a paraglider as we see them often circling in front of Mount Olympus, but it quickly became apparent that this wasn't the case. It was moving fairly quickly but we were able to grab binoculars used for birdwatching inside the door and were able to see it quite clearly with the binoculars. It was a long (~150-200 ft.), fairly thin (~30-35 ft. diameter in the middle) metallic cigar with small fins on the rear and visible orange and yellow flames behind the fins. It looked like a large rocket lying horizontally. This was not a winged craft. There were no wings and no visible means of keeping the craft aloft. The flames seemed to be some kind of propulsion. It looked blimp-like, but didn't appear to be a balloon and the way it reflected it was either solid metal or had a metallic skin. We were unable to see any other features besides the \"rear\" fins on the craft, just a smooth, shiny metallic sheen. It looked almost identical to an object seen on 6-13-2007 in Salt Lake City. Although that object didn't have visible flames, was flying much lower and had features on the bottom that we didn't (or couldn't) see. I will attach a photo of that object as it is very similar to what we saw. Videos of that object are readily available on the internet. This isn't our first sighting of a UFO so our reaction was mostly to see as much of the craft as possible and note details. I remember that we both noted that it was silent and we couldn't understand why it didn't just drop like a rock as it had no apparent lift and the flames in the back seemed to be only to make it move forward, or possibly for directional control. It was a large metallic object apparently levitating. It always seems to cause cognitive dissonance to see a UFO as it raises so many complex existential questions. And it also raises the question as to why they are seen constantly yet the government ignores and denies their existence vehemently."],"Log Number":"US-05262010-0014","Date Submitted":"05/26/2010 04:25 UTC","Longitude":"-111.824656","Object Shape":"Cigar","Object Features":"Other","Weather Factors":"None","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23468.html.txt","/var/www/straped/mufon/more/23468_submitter_file1__UFOOverSaltLakeCity(D).jpg","/var/www/straped/mufon/org/23468.html"],"Case Number":"23468","Summary":"Large metallic, cigar shaped object with small rocket-like fins on rear and visible flames.","Region":"Utah","City":"Holladay","Sighting Duration":"Undisclosed"}