{"Disposition":"Unresolved","City":"Ocean City","Date Submitted":"05/26/2010 11:39 UTC","Log Number":"US-05262010-0012","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-75.075646","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Cigar, Cylinder","Source":"MUFON","Case Number":"23466","Summary":"LONG DARK GRAY CIGAR SHAPED OBJECT, ROUNDED AT BOTH ENDS.","Region":"Maryland","trends":["There have been 16 other sightings in Ocean City","There were no other sightings in Ocean City on or around May 20th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=38.341303,+-75.075646(23466)&iwloc=A&hl=en\"> mufon case (23466) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsTHE SIGHTING OCCURED AT LOOP G ON ASSATEAGUE ISLAND STATE PARK CAMPGROUND. THE SKY WAS CLOUDLESS AND DEEP BLUE, WITH A STEADY 8-10 MPH WIND FROM THE SOUTH. I HAD JUST SET UP CAMP AND WAS GETTING ORGANIZED WHILE I WAITED FOR MY WIFE AND SON TO JOIN ME FROM GLEN BURNIE, MD. I NOTICED SOME COLORFUL KITES ALOFT IN NEIGHBORING CAMP LOOPS AND WATCHED THEM FOR A WHILE. I GLANCED OUT TO THE DUNES FACING EAST LISTENING TO THE CONSTANT CRASH OF THE WAVES, WHEN I NOTICED THE OBJECT IN THE NE SKY, OUT OVER THE SHORELINE. MY FIRST IMPRESSION WAS THAT SOMEONE WAS FLYING A KITE ON THE BEACH, BUT THAT THOUGHT QUICKLY ENDED WHEN I SENSED THE OBJECT MOVING SLOWLY SOUTHWARD, AGAINST THE WIND. I GRABBED MY WW2 7X50 FIELD GLASSES FROM THE TRUCK AND EXAMINED THE OBJECT NOTING IMMEDIATELY THAT IT WAS SLIGHTLY CURVED WITH BOTH ENDS FACING THE ATLANTIC. IT REMINDED ME OF A DARK GRAY CRAYON WITH A BLUNT END. AT THIS TIME I BECAME AWARE THAT THE THING BECAME STRAIGHT LOOKING EXACTLY LIKE A CRAYON, THEN AMAZINGLY REVERSING IT'S CURVE, WHILE STILL MOVING SOUTHWARD, ALWAYS KEEPING THE SAME END MORE OR LESS IN THE SAME DIRECTION. WELL, AFTER 4-5 MINUTES OF NOT IDENTIFYING THIS ANOMALY, I STRUTTED ACROSS THE LOOP TO THE NEAREST CAMPSITE AND APPROACHED A GENTLEMAN TALKING TO HIS WIFE, AND WITH A FAST INTRODUCTION HANDED MY BINOCULARS TO GLEN, FROM NEW JERSEY, ASKING HIM TO TAKE A GANDER AT THIS THING IN THE SKY. AFTER A MOMENT HE WAS ALSO ASTOUNDED TO WITNESS SUCH AN UNRECOGNIZABLE WHATEVERITWAS. WE WATCHED IT TOGETHER FOR A SPELL AND I RETURNED TO MY SITE. NOW THE CRAYON WAS DIRECTLY EAST, EASILY VIEWABLE BY AYONE LOOKING TO THE OCEAN, AND VERY EXPLICIT AND VIVID WITH MY TRUSTY GLASSES. SOMETIMES THE BRIGHT SUN GLINTED OFF THE LEADING PORTION AND SIDE OF THIS THING. I TRIED TO PHOTOGRAPH IT BUT MY CAMERA WAS INADEQUATE, AND LATER SAW THE OBJECT VERY SMALL IN THE PICTURES. ESTIMATED ALTITUDE AT THE CLOSEST POINT WAS 4-5000 FEET...VERY APPROXIMATE AS THERE WAS NOTHING TO COMPARE IT TO, MOVING 20-30 MPH MAYBE. IT WAS IN SITE FOR 30 MINUTES AND FINALLY CONTINUED SOUTHWARD, AND GOT HIGHER UNTIL I COULDN'T SEE ANY LONGER. WHAT A GREAT DAY IT WAS! WITH ALL OF MY WORLDLY EXPERIENCE NOT BEING ABLE TO IDENTIFY SOMETHING I COULD SEE SO CLEARLY LEFT ME BEMUSED. WOW...THAT'S ALL FOLKS."],"Date of the Event":"05/20/2010 03:45 UTC","files":["/var/www/straped/mufon/html2text/23466.html.txt","/var/www/straped/mufon/org/23466.html"],"Tags":"City","Latitude":"38.341303"}