{"files":["/var/www/straped/mufon/html2text/23474.html.txt","/var/www/straped/mufon/org/23474.html"],"Tags":"City","Object Shape":"Bullet, Missile, Flash, Star-like","Disposition":"Unknown","Object Features":"Unknown","Summary":"speeding light (blue,orange,red)","Date Submitted":"05/26/2010 07:56 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","City":"Phoenix","Viewing Distance":"Unknown","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around May 25th 2010"],"Date of the Event":"05/25/2010 09:10 UTC","Latitude":"33.450567","map":"<A HREF = \"http://maps.google.com/maps?q=33.450567,+-112.069147(23474)&iwloc=A&hl=en\"> mufon case (23474) map </A>","Sighting Duration":"Undisclosed","Region":"Arizona","Log Number":"US-05262010-0019","Weather Factors":"None","Case Number":"23474","divs":["Sighting DetailsAs I was in my room with my little brother watching tv, my uncle called me and said \"look outside your gonna see ufos\" I honestly thought he was lying to mess with me cause I've always been interested in this. But I went outside my front door and looked outside but I couldn't see nothing. So I called him and said where? He told me to go to the back yard and sure enough their was about 6 lights blinking above the mountains. I was amazed at how low they seemd to the pinal mountains. I yelled out to my mom who was in the living room. And as I was doing that two of them moved away from the rest they were overlapping another. They were going pretty fast. I grabbed my cellphone and started recording them. The video did not come out to good even though I have a 5.0 megapixel camera which is really good for a phone so I started recording as I was recording towards the left of me I saw a huge red light that was speeding towards the two smaller lights. And those two lights stopped literallly stopped above the mountain imediately after that I saw a bright orange yellow light and the two smaller lights were gone the light went up . It wasnt a flare cause flares do not go up into the sky. This light was going up. (I got that on my phone) the rest of the lights were gone except for one to the right of me which was still blinking so I focused on that one also with my phone than more lights around it started to appear and in the blink of an eye it was gone. My family owns a restaurant in downtown. My dad, uncle, and cousin were the first ones to view it from the restaurant. My cousin told me that he saw a huge light and that the lights that I had seen had come from that light he also recorded it on his phone and you can see three bright lights. I don't know maybe they were jets but I don't think so cause this lights were going really fast stopped in the middle of the sky jets don't normally do that I think also we've had some air force jets train around here and they've been thosuands of feet in the air but you can still hear them and these were very low in the sky and you couldn't hear nothing. I just wanna find out what is my family and I saw."],"Longitude":"-112.069147","Country":"United States"}