{"Tags":"City","Date of the Event":"02/15/2010 06:30 UTC","divs":["Sighting DetailsI was sitting in my kitchen in front of the sliding glass doors which face west and overlook my yard which has a 20 foot maple tree in the middle of it and an adjacent farm field to the horizon. It was after dark and it was a vary cold night in February. I was working on a stained glass art piece and I had the grinder running which is really loud, I had digital music on the television which was up even louder so I could hear it over the grinder. All of a sudden I started hearing a loud deep humming sound over all the noise and the house seemed to be vibrating. I looked out the slider and I saw, coming over the ridge in the farm field and heading right toward the house, something flying really low with two red lights, one in front and one in back and two flashing white lights also in front and back. I freaked and thought holey s--- its my UFO moment. I through off the safety glasses and tossed off my gloves and ran for the front door. As I grabbed the knob I thought, but they're not supposed to have any sound, check and see if its a helicopter. I opened the door and ran out on the deck and it was coming right over head. It was about two and a half times as high as my tree, about 50 off the ground. First the front went over really slowly then the back. It didn't sound like a helicopter there was no fluttering of propeller blades just a deep steady humm. I didn't feel any wind either and looked around for signs of things moving but it was completely still no breeze at all. I tried to make out a shape and that was the most frustrating thing about it because it was a new moon and I live out in the country and its pitch black and I just came out from a lighted house and the porch light was on. I couldn't see a shape but it felt cylindrical, don't ask me how I know thats just what I scened. I looked for lights inside in case there was a cockpit or something but there weren't any just the single red and white lights in the front and back, the reds were on steady and the whites were flashing. I thought it was at least as long as my manufactured home, its a 16 ft wide by 80 ft long. As the back light passed over the house I ran out to the end of the driveway and got a good estimate of the length about 80 to 100 feet long. Our lotts are 60 feet wide and it almost covered 2 lot withs. I didn't know what to think, still don't. I've watched for helicopters and none have that light set up and they have a definite propeller sound. I got a mailer in April saying that they were going to be spraying for Gypsy moths and that plains were going to be flying right over the tree tops and that they were loud. I called them and asked if they were doing any research fly overs in February at night. They said that they never use helicopters and that they definitely wouldn't be flying at night. It didn't sound like a helicopter, it was a steady low pitched resonating humm, there was no wind movement at all and it was about 50 feet off the ground. I got no clue what it was but if you know of any other reports of it, or what it might be, I'd love to know. Thanks, Lily"],"Summary":"Long object aprox 80 to 100 feet long flew over house aprox 60 feet off the ground.","files":["/var/www/straped/mufon/html2text/23478.html.txt","/var/www/straped/mufon/org/23478.html"],"Case Number":"23478","Object Features":"Unknown","Date Submitted":"05/26/2010 10:59 UTC","Source":"MUFON","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=43.075952,+-89.39267(23478)&iwloc=A&hl=en\"> mufon case (23478) map </A>","Region":"Wisconsin","Object Flight Path":"Straight-line path","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-05262010-0024","City":"Madison","Latitude":"43.075952","Disposition":"Unknown","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around February 15th 2010"],"Longitude":"-89.39267","Weather Factors":"None","Object Shape":"Unknown"}