{"Object Features":"Undisclosed","trends":["There have been no other sightings in Manitowoc","This sighting has never been favorited."],"Date Submitted":"05/26/2010 07:13 UTC","Region":"Wisconsin","Disposition":"Unresolved","Summary":"Small blueish green football shaped light passes over from North to South in city. I","Log Number":"US-05262010-0019","Latitude":"44.088606","divs":["Sighting DetailsIts was nearing the end of 2007, I cant recall the actual date but I think it was in or around mid Oct. I was at my cousin's house hanging out with him and his girlfriend. We were all in the kitchen talking and his mom said something about her bird houses, (she loves taking pic's of birds with digital cam) anyways... It was probably around 8 or 9pm and my cousins girlfriend and I were by the kitchen bay window (which faces south) looking outside at the birdhouse's and his mom pointing and explaining something about the birds she took pic's of. His mom no more than walked away from the windows when I said under my breath, \"what the F*** is that.\" I remember my cousins girlfriend grabbing my arm her saying something but no clue on what she said (at this time my cousin is speaking to his mother). We both ran to the sliding door opened it and stepped outside. Now ever since I was a little kid I have always been fascinated with \"UFOs, and FLYING SAUCERS\" and the possibility of their existence, but that night proved it all to me!! We both look up at this thing and it was seriously the most amazing most frightening thing I have ever witnessed... Now I would call it a craft but there was nothing about this object to indicate that it was a craft of any sort. There was absolutely NO sound coming from this thing and no physical traits or characteristics for me to determine how close or far away it was. Now, It seemed and almost felt as it were very close (If there was a way to gauge its distance like when looking at a plane in the sky and determining what type of plane it is and the shadows it casts on its self are also things to help gauge distance including clouds)but no clouds, no shadows, and I'm pretty damn sure NO planes look anything like this thing. The object was in the shape of a foot ball but a little more rounded on what appeared to be the edge of this thing, and like I said it had no physical traits other than the color it was emitting. It was a dull greenish blue color and it wasn't shooting across the sky or moving very fast at all. The entire thing happened- From inside the house to watching it disappear in the distant city lit sky in about a minute or two. I have NO idea what this object was, where it came from or where it was heading. I do know I shared this experience with someone I know, and I'm damn sure on what we both saw. Was is an \"alien space craft\" not sure, but if you use those words in definition then yeah, maybe! But we will never know. I don't have physical evidence to prove what I seen that night, only the words that I write in this message. This was my experience and that's all I need for my proof."],"Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.088606,+-87.657584(23473)&iwloc=A&hl=en\"> mufon case (23473) map </A>","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"23473","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Oval","Viewing Distance":"Unknown","Date of the Event":"09/30/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/23473.html.txt","/var/www/straped/mufon/org/23473.html"],"City":"Manitowoc","Longitude":"-87.657584"}