{"Case Number":"2347","Summary":"Three lights seen in the sky in the 1980s","Object Shape":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=35.362024,+-86.209434(2347)&iwloc=A&hl=en\"> mufon case (2347) map </A>","Date of the Event":"11/30/1981 12:00 UTC","Sighting Duration":"00:05:00","Viewing Distance":"Unknown","Object Flight Path":"Unknown","Weather Factors":"Unknown","Object Features":"Undisclosed","divs":["Sighting DetailsI aam 34 now and was a young man adolescent at the time of the event. I wastaking out the trash for my mom at night about six or eight oclock. I looked upat the bare patch in the sky over the road where the trees had not covered. Itwas a clear night but as I lived in the middle of town there were not many starsvisible. I noticed a light that looked like a star moving across the sky. Itwas moving abbout the apparent speed of a modern passenger jet it seemed but itwas a single light and not a small grouping as planes usually appear. I watchedthe light slowly make its way across the sky and the i noticed that there weretwo other lights moving towards it from two other directions. The lights werecoming towards a central point in the sky. Their pattern together was theappearance of a shrinking isosceles triangle with the lights being at thepoints. The lights finally came together in a triangle about the width of anadult palm held up at arms length. They then went back in the direction thatthey had originally come without any appearance of turning around. They seemedto stay at least about the same altitude at all times during the encounter. Theythen went behind the trees so that I could no longer see them. There is an airforce base and a space institute located right out of town. I felt like I hadwitnessed something really rare and special and felt quite privledged. Thedates I have given are approximate as I dont remember exactly how old I was whenit occured. I think I do remember that it was not cold as I was watching so itwas probably late spring or summer. Thank you for listening. I wish I could bemore specific. Good luck in your endeavorsStephen Dale"],"trends":["There have been 4 other sightings in Tullahoma","There were no other sightings in Tullahoma on or around November 30th 1981"],"Date Submitted":"11/30/1981 12:00 UTC","Log Number":"","Source":"MUFON","City":"Tullahoma","Latitude":"35.362024","Country":"United States","Region":"Tennessee","Tags":"City","Longitude":"-86.209434","files":["/var/www/straped/mufon/html2text/2347.html.txt","/var/www/straped/mufon/org/2347.html"]}