{"Weather Factors":"Unknown","Latitude":"44.032116","Object Flight Path":"Stationary","Object Shape":"Cigar","Case Number":"23470","Longitude":"-88.541174","Summary":"multiple occurances of linear series of lights in different parts of western sky","Date Submitted":"05/26/2010 06:12 UTC","files":["/var/www/straped/mufon/html2text/23470.html.txt","/var/www/straped/mufon/org/23470.html"],"Tags":"City","divs":["Sighting DetailsFirst, I attend Airventure at OSH every year since 1987 & stay at same campground, Circle \"R\". The airport is closed after 9 pm every day. I am a pilot and an architect. My friends and I observed these lights on 3 evenings that summer, I think it was sun, tues and wed during the last week of July. Clear, slightly hazy sky. Linear rows of bright lights appeared in western sky and stayed lit for about one to three minutes each. Sometimes more than one row at a time. The rows of lights were usually horizontal, several were ascending or decending on angle of up to 20 deg. Lights were stationary and came on suddenly, then off suddenly. The area where they appeared was from 260 degrees to 280 degrees and angle above ground from 10 degrees to 30 degrees. Visibility at the time was probably 10 to 15 miles. I know there is an ANG base to the west about 80 miles, near Tomah, WI, that would be too far away to observe anything, but I don't know where their training MOA is. Also this is the 1st time we have seen this, so not a normal routine apparently. Our thought is that it may have been some form of stationary flares ejected from training aircraft, but they would have to have been fairly close, 10-30 degree angle above horizon is a lot of airspace in a short period of time if further away than 3 to 5 miles is our guess, and we heard nothing. 2009 was cloudy or mostly cloudy every night that same week in July so we saw nothing repeated. We cautiously metioned this to a few others attending Airventure - noone else was either looking westerly or view was obscured by trees, We also checked the bulletin boards including the one at FAA building for any explanations. We still discuss this event occasionally when we are together, still very curious. We would sure like to know if there is a good explanation of what we observed. We don't know if lines of lights which were regularly spaced as each one a very large cigar type or edge of disks - or if they were multiple vehicles in linear formation."],"Date of the Event":"07/25/2008 10:10 UTC","Region":"Wisconsin","trends":["There have been 10 other sightings in Oshkosh","There were no other sightings in Oshkosh on or around July 25th 2008"],"Viewing Distance":"Over One Mile","Source":"MUFON","Disposition":"Unresolved","City":"Oshkosh","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.032116,+-88.541174(23470)&iwloc=A&hl=en\"> mufon case (23470) map </A>","Log Number":"US-05262010-0016","Object Features":"Unknown","Sighting Duration":"Undisclosed"}