{"trends":["There have been 9 other sightings in Spanaway","There were no other sightings in Spanaway on or around September 15th 1975"],"Case Number":"23476","Object Features":"Dome, Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=47.109348,+-122.428206(23476)&iwloc=A&hl=en\"> mufon case (23476) map </A>","City":"Spanaway","Region":"Washington","Disposition":"Insufficient Data","Summary":"I was abducted from my bedroom closet where i was hiding. after wittnessing 3 boomering ships above our house that made no noise.","Longitude":"-122.428206","Log Number":"US-05262010-0021","Date Submitted":"05/26/2010 09:12 UTC","Viewing Distance":"101-500 Feet","Weather Factors":"None","Date of the Event":"09/15/1975 10:00 UTC","Object Flight Path":"Stationary,Hovering then path,Path then hovering","divs":["Sighting Details In 1975 september I was lying outside my mom and dads home searching the skies for any planets i could see with my dads bionoculars. there had been reports in the tacoma news tribune of alien ships being chased by usaf jets that were scrambled out of McCord AFB. I was in hopes of seeing these and how unlucky i became. If i had only known what would happen. i would have ran for my life and never look at the skies again. while earnestly searching the skies, I noticed some lites like a small planet moving form East to west. then another from west to East. and yet another from south to north. all come close to each other. infront of our house they were about 150 feet off the ground. they made no noise and they were shaped like a boomjerang with wings that sloped like the wings of a c-141 plane however these were no airplanes. i became overjoyed and then began to use my lantern flashlite shuinning it at the ships while turniong it on and off a bunch of times. then two ships began to leave one to the right and one to the left. then one just floated to above our house and stopped. under the ship there were walkways with rails andthey were in a circle under but made to the craft then i noticed this small dome and i just starred at it and it was if a small window had opend and there was this being starring at me. I waved to him and he waved back to me. thats when it hit me i became very scarred and ran inside the house. where my mom was sewing at her sewing machine. we had a big bay window where i yelled mom look help. run.... immediatly my mom looked at the craft and became wwhere she couldnt move but did lock the door. so i turned around and ran to the front door but before i could reach the door it began to open with a very intense light siloughting against the door while it was opening. So i stopped and ran to the living room . at this time my mom was already stiff as a board and floating towards the front door at about 3 feet off the ground. at seeing this I ran as fast as I could to my bedroom. and hid in my closet. I pulled the clothes that were on hangers on top of me. In hopes that they wouldnt see me. But I was realloy trembling and then my closet door opend up i was so scarred that i felt like i was on fire. but then rhis Alien dressed in a black gown with this little guy with very big eyes touched my hand and pulled me to my feet I couldnt resist them i tried but i couldnt. i went with them out the front door into this lite. i vagley remember being escorted into the ship. when we went into the ship we were in this room a metallic room with a surgical bed with 4 aliens surrouinding my mom. she was being examined by these people and then i noticed that this little guy was with me next to me. he was showing me this thing but i couldnt understand what it was used for. i think i was to take a leak in it but i said noway thats nasty. i began to notice these aliens would come through this door so when i could i made my way to thuis passageway and went through i then saw stars abouve and below me i kept walking then i came to this room a bigger room where these aliens flew the ship. there were about 9 aliens with big asian like eyes and this one alien dressed in a black robe. i started to walk around this room i saw different kinds of symbolls on different things in this room . then the little guy came for me and then this alien dressed in the black robe became very irate angry with me beacuse i wasnt to be there He asked if i was a soldier i said no way im just a kid. we then went to other parts of the ship down this long corridor there was a round table then the little guy began to explain to me how their movement was possible with no sound done with some kind of electro magnatism. then we went to a room where ther were 2boys and 2 girls. but these kids had no expressions they were for the most part normal lookingn for kids. the little guy told me that he wanted me to show these chioldren how to play. I told him where some of my toys were located one a army jeep another was a horse trailer and the last was a tonka truck. he left me with these kids and returned a short time later with my toys that i had since i was a kid. I began to make noises like a truck rrrr.... while pushing the truck around. then these kids began to laugh then i became scarred all these kids had sharp pointed teeth. we then left and continued walking around the ship. he showed me where they stay in their rooms. I asked him if i could go with them to learn and explore he then said that they wouldnt be back for 33 years but that if i wanted i could go and that i wouldnt age at all. I thought about it but then realization set in and that i loved my mom and dad and must stay with my parents. after a little while we again went to the examining room but this time my mom wasnt here. i said wheres my mom he said tha shwe was being prepaered for the returnand her mind would be erased of all memories of what had just happend to her. I then told him that i wanted to remember all that had happend to me and our friendship. I was then led to this surgical bed. where there were three aliens checking me out one had this long tube that he began to shove into my abdoman i yelled and screamed but severe pain pursued me. they act like they dont know what pain is. i began to cry still they dont give me any thing for the pain it became so severe that i almost trey to pass out but i couldnt then this other alien came around to the back of my head and i felt as if somepthing was pushed in. tyhen i was out. i remember the last thing we talked about i was taken to this erase memory room of all that had happend to me i told this little guy that i wanted to have remember and he said where do you want to be taken to i said under my bed and so it was done. later i woke up underneath my bed. tryiing and recalling all that had happend to us..."],"Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"47.109348","Object Shape":"Boomerang","Country":"United States","files":["/var/www/straped/mufon/html2text/23476.html.txt","/var/www/straped/mufon/org/23476.html"],"Tags":"City"}