{"Case Number":"2348","Longitude":"-82.605455","Region":"Ohio","Weather Factors":"Unknown","Date of the Event":"11/30/1991 07:01 UTC","files":["/var/www/straped/mufon/html2text/2348.html.txt","/var/www/straped/mufon/org/2348.html"],"Object Flight Path":"Straight-line path","City":"Milan","Date Submitted":"11/30/1991 07:01 UTC","Source":"MUFON","Log Number":"","divs":["Sighting DetailsMilan,Ohio,USA,milliman road pond,I was fishing of courseI noticed a BLACK TRIADwith three giant white lights on the bottom,over my left shoulder,for 20minutes,moving too slow,from the southeast to the northeast about a mile away.Ilive close to nasa.I just kept fishing,thinking that it would SURELY be in thepaper.My girlfriends dad asked me if I caught anything,I said in ajokingly,non-believing voice3E no,but I seen a ufo3EI hoped to prove it the next day.I havent quit,I have this ships name and whatits fuel is.I also have a metal band named after this ship,and I have never lostsight of this object.I see it every day,in my mind.I have no choice,thanks alotImade a prayer many years after the sighting,It came true the next morning,an olddrummer called me at a strange time,...IN THE MORNINGI never get calls thenevenstranger I havent heard from him in over 4 yearsHe asked me what I was into Itold him I was Looking for the Triad I seen out in milan ohio,My prayer wasanswered QUICKHe said his mom and her friend seen something in the samearea,around the same timeThey still visit the site.wow,I dont ever pray unless Iam desparate.I prayed I wasnt alone.super-coincidenceOK heres the kicker,my olddrummers band was named3EALIEN FACTORY3E3Ealso3E The EUPHEN TRIANGLE,is really a TRIAD,get it right,and open a new catagoryfor this shapeI have seen the Black Triad,on an egyptian tablet,at the tip of anegyptians nose, on the discovery channel program,Biblical Proof of UFOs in theBible. That show title is also a local metal bandWe will tour together if we hadsome TRANSPORTATIONlol3Eget the big picture my father said I am the winner after 10 years ofdisbeliefcontact me if you want to meet me......JC3Eps. I was 100 per cent free of any alcohol or drugs so I have no scapegoat,,Iwish I did,no I donthaha I love the ship,and all who dont are not invited to theshow,The big show.....and you were no help police,Thank you Sigsworthhaha...good-byeJCaka3Ethe last laugh"],"Tags":"City","Country":"United States","Summary":"BlackTRIAD,three white lights,ohio","Object Shape":"Triangle","trends":["There have been no other sightings in Milan","This sighting has never been favorited."],"Sighting Duration":"00:30:00","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=41.297552,+-82.605455(2348)&iwloc=A&hl=en\"> mufon case (2348) map </A>","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"41.297552"}