{"divs":["Sighting DetailsI was outside. I was not tired, driving, or in any way on drugs. I just happened to observe the skies because something caught my attention. As I look far to my left, I could see what looked to be a blimp in the air.I then take get up and move to get a better look at this. This was approximately one mile eastbound above the vineyards. The object was dark, but I could see a blue light towards the left. Also the object had a red and blue light on. I then watch the object shoot down a clear beam of light. Throughout the time it was on, it was rotating counterclockwise. Almost as if it was looking for something. After a few seconds, the light shut off. Next there were yellow square lights inside. The pattern looked to be a straight line horizontal cut in half. After the object made a V shaped light in yellow lights. This V shaped pattern looked like a pointer \">\" without the point. Soon the object flew slow and low across the vineyards westbound.It produced a loud vibration noise. Which could be heard within the area. No trail was left behind in any way. As it flew closer to me, I got a good view at it. The shape was a disc (black). With a blue light on top middle of air craft. Which the blue light looked like an vertical rectangular light attached. It flew straight across. When the object began to fly lower, I could see underneath it. Underneath it were dozens of rectangular lights. These lights were black until they lighted up. It started from the left and kept lighting up reverse counter clockwise. Then the lights lighted up in rows. There were three rows and nothing in the middle. After, the object made pyramid patterns. Almost like as if it was trying to show a sign. I did not see anything inside the yellow lights, even when they lighted up one by one. The lights were huge. So that explains the clear view I had. The flying saucer flew as low as street light view. It also flew directly across me. Which I estimated 500 feet. I am not a professional or trained to measure objects in the sky. So I estimate this was not wider than half a mile in diameter. So I was not seeing things with that much of a close encounter. I remained calm throughout the whole situation. After the object headed towards the city. I watched the saucer turn a an angle and shut off all the lights. Then there were two white bright lights it produced. This saucer flew at northwest, shut off all lights, and last produced a single blinking red light. The red light kept blinking as it headed off towards the city. Almost like as if it was hiding its identity. Which at the time could be identified as an airplane with just a single red light in blinking mode. Throughout the time it headed off to the city, the vibration noise it produced could still be heard for miles. Until within minutes, it faded off as well as the noise."],"Tags":"City","Latitude":"35.634069","Disposition":"IFO","Longitude":"-120.659567","Country":"United States","City":"Paso Robles","Date of the Event":"03/20/2010 08:59 UTC","Viewing Distance":"101-500 Feet","Object Features":"Dome, Window(s)","Sighting Duration":"00:02:30","trends":["There have been 7 other sightings in Paso Robles","There were no other sightings in Paso Robles on or around March 20th 2010","This sighting has never been favorited.",""],"Summary":"Flying black saucer over Paso Robles, CA with several light patterns/colors.","Log Number":"US-05272010-0009","Date Submitted":"05/27/2010 05:19 UTC","Source":"MUFON","Weather Factors":"None","Region":"California","Object Shape":"Blimp, Disc, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=35.634069,+-120.659567(23487)&iwloc=A&hl=en\"> mufon case (23487) map </A>","files":["/var/www/straped/mufon/html2text/23487.html.txt","/var/www/straped/mufon/more/23487_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/23487.html"],"Case Number":"23487","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering"}