{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.719813,+-74.001443(23485)&iwloc=A&hl=en\"> mufon case (23485) map </A>","Latitude":"40.719813","Object Shape":"Unknown","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around May 26th 2010"],"Date Submitted":"05/27/2010 02:59 UTC","Summary":"Strange cloud formation (vapor trail) ....","divs":["Sighting DetailsAt 5:25AM, on Wednesday, May, 26, 2010, I observed a large cloud formation that spanned the sky from horizon-to-horizon, similar to the arc pattern a rainbow would make. I did not see, however, the craft or vehicle that made the formation. The first thing that comes to mind, was a jetliner's vapor trail. However, I have never in my life seen such a vapor trail that was large enough to expand from one horizon to another in such a perfect arch formation. Usually, vapor trails disappear behind a jetliner after some great lenghts. 10 minutes from the time that I initially notice this, I observed smaller vapor trails that were being made by jetliners. In comparison, maybe due to the distances between these objects, the jetliner vapor trails were much, much smaller, and did not last as long. I observed the formation for approximately 30 minutes. For the duration of the time that I observed this formation, it was expanding very, very slowly as it disappeared. Though I believe that there are such things as real \"ufos\", and believe that I have witnessed one many years ago, I can't imagine what conventitional vehicle could make such a vapor trail that would last so long. I'm really puzzled. I'm wondering if there was an event with the space shuttle, becuase that would explain the formation being so high, and possibly why it was able to \"arc\" from one horizon to another. I would love to hear an explanation from your scientific staff on this one. Thanks for your great work!"],"Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"23485","Log Number":"US-05272010-0007","Object Features":"Undisclosed","Country":"United States","Region":"New York","Object Flight Path":"Undisclosed","Disposition":"Unresolved","City":"New York","Date of the Event":"05/26/2010 05:25 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/23485.html.txt","/var/www/straped/mufon/org/23485.html"],"Longitude":"-74.001443"}