{"Object Flight Path":"Undisclosed","Country":"United States","divs":["sighting detailsbetween the hours of 9:30 and 10:45 tonight, 5\\26\\10 i witnessed (8) different unknown objects high in the sky above 15102 zip code area. i had been out on my back deck viewing the moon through a small telescope with my daughters, because the moon appeared to be unusually bright.(3) of the objects were traveling in a northerly direction, (2) were traveling in a northwesterly direction and (3) were traveling due south, one of which stopped abruptly and shot back 180 degrees. most of the objects were seen individually, but on two occasions there were more than one in the sky at the same time. all of these objects traveled extremely fast and erratically, stopping and starting in their general trajectories. in addition they seemed to meander to the left and right of their general path of travel. these objects were too far away to get any detail, but just appeared as bright dots in the sky. no contrails, no flashing lights, no sound, just constant steady lights. not a standard aircraft.the objects eventually moved out of sight. i thought about attempting to film the objects, but my video recorder was not charged and i could not track them through the viewfinder on my cell phone. this event was witnessed by me and my 12 year old daughter. i didn't know who to report this to, but i wanted to make sure that i let somebody know while the information was still clear. i seriously would not be surprised to wake up tomorrow to news reports of mass sightings."],"Sighting Duration":"Undisclosed","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around May 26th 2010"],"Viewing Distance":"Unknown","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.442325,+-79.993916(23484)&iwloc=A&hl=en\"> mufon case (23484) map </A>","Date of the Event":"05/26/2010 09:30 UTC","Object Features":"Undisclosed","Summary":"Unknown objects flying erratically high in the sky over Bethel Park, PA.","Tags":"City","Log Number":"US-05272010-0006","City":"Pittsburgh","files":["/var/www/straped/mufon/html2text/23484.html.txt","/var/www/straped/mufon/org/23484.html"],"Object Shape":"Star-like","Source":"MUFON","Longitude":"-79.993916","Disposition":"Unknown","Weather Factors":"Unknown","Case Number":"23484","Latitude":"40.442325","Date Submitted":"05/27/2010 09:58 UTC"}