{"Weather Factors":"Unknown","Country":"United States","City":"Frederick","map":"<A HREF = \"http://maps.google.com/maps?q=39.416489,+-77.408331(23480)&iwloc=A&hl=en\"> mufon case (23480) map </A>","Object Shape":"Flash","divs":["Sighting DetailsI just got home. I was letting my dog out back,as I stepped outside I noticed a bright light rising in the distance. it at first I thought was a bottle rocket or something but it traveled a large part of the sky. But the light was not always visible. It like skimmed across the sky. Appearing the disappearing reapearing in the distance. But an obvius path. I struggled to define what I just saw. I stood there staring when I saw it again,or another one. Same thing like a skimming light. I couldnt believe it. Then it was like ther were multiple ones in different parts of the sky. I am willing to believe these are meteors at this point. Although I dont know if its a meteoer shower or not. After a few minutes of nothing. One starts in the southern part of the sky and within seconds was in the extreme northern sky. then it seemed to turn at an exact 90 turn and head east until i could no longer see it. There was a consistincy to the pattern 3 flashes some distance later in the same line of path 3 more flashes. Am I the only one who saw this?"],"Sighting Duration":"Undisclosed","Latitude":"39.416489","Date Submitted":"05/27/2010 12:24 UTC","Viewing Distance":"Unknown","Region":"Maryland","trends":["There have been 16 other sightings in Frederick","There were no other sightings in Frederick on or around May 27th 2010"],"Case Number":"23480","Log Number":"US-05272010-0002","files":["/var/www/straped/mufon/html2text/23480.html.txt","/var/www/straped/mufon/org/23480.html"],"Source":"MUFON","Date of the Event":"05/27/2010 12:00 UTC","Longitude":"-77.408331","Object Flight Path":"Straight-line path,Path with directional change","Summary":"unbelievable lights crossing the entire sky in seconds. lights almost skipping the sky","Tags":"City","Object Features":"None","Disposition":"Insufficient Data"}