{"Summary":"globe like somewhat transparent with a ring of colored lights (red, green, blue) and vertical white lights all around hovered and darted briefly up, down, to the side, about 200 feet over the water in the West about half a mile away - no noise","Longitude":"-81.714722","City":"Marco Island","divs":["Sighting DetailsAt 10:15 P.M. tonight, two of our close neighbors on the next block called us to tell me that while they were putting out their garbage cans, they had been watching something unusual for the last half hour. My husband and I grabbed our binoculars and went to the front yard to look out toward the west. We saw something that was gyro-shaped or globe shaped and about 200 feet over the water in Capri Pass. It was primarily white, but had colored lights (red, green, blue, and white) around it horizontally, and appeared almost transparent...like you could see inside of it. It also looked like it had spheres or points going up and down from it. It dropped down low for a brief moment, then went back up slightly. It hovered (no sound). Our neighbors (only a block away from us) drove over to our house with their binoculars and camera. We all watched it until about 10:25 P.M. at which time it appeared to back away slowly over towards the Gulf (still due West). The night is clear, the moon is bright and to our East. I called Chief Rodriguez at the Fire Station and asked if he could aim the weather cam in the direction of due west. I went on the webcam to see if it was picking it up. It was hard to see, but you could see a small white unknown object in the same location that we had wittnessed it. While watching the object, it made us all feel in awe. It was actually beautiful through the binoculars."],"trends":["There have been 5 other sightings in Marco Island","There was one other sighting in Marco Island on or around May 26th 2010"],"Tags":"City","Latitude":"25.940556","Weather Factors":"Unknown","Date of the Event":"05/26/2010 10:15 UTC","Viewing Distance":"Unknown","Region":"Florida","Log Number":"US-05272010-0008","Sighting Duration":"01:10:00","Country":"United States","Object Shape":"Circle, Saturn-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=25.940556,+-81.714722(23486)&iwloc=A&hl=en\"> mufon case (23486) map </A>","files":["/var/www/straped/mufon/html2text/23486.html.txt","/var/www/straped/mufon/org/23486.html"],"Object Flight Path":"Undisclosed","Date Submitted":"05/27/2010 05:05 UTC","Case Number":"23486","Disposition":"Insufficient Data","Object Features":"Undisclosed"}