{"Viewing Distance":"Unknown","trends":["There have been 17 other sightings in Leggett","There were no other sightings in Leggett on or around April 24th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.872464,+-123.708108(23488)&iwloc=A&hl=en\"> mufon case (23488) map </A>","files":["/var/www/straped/mufon/html2text/23488.html.txt","/var/www/straped/mufon/more/23488_submitter_file1__DSCN11671.JPG","/var/www/straped/mufon/org/23488.html"],"Object Features":"Undisclosed","Log Number":"US-05272010-0010","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Source":"MUFON","Region":"California","divs":["Sighting DetailsOn the night of April 24th at approximately 9:30 p.m. my aunt Paula and I were talking on the side of the road when we observed 5 round starlike objects right above a mountain not far from her house. They were very bright and seemed to be communicating with each other. It seemed as though they were on some kind of mission, like they were working.They were crossing paths and going into one another and when they did they lit up very bright. They were northwest of where we were standing. We started filming them with a night vision camera.After about three hours we were joined by another person who also wittnesed what we were seeing. We were able to observe them for about one more hour.At that point a helicopter flew right over the top of where we were standing and was heading straight towards the starlike objects. They seamed not to mind to much at first,they actually got very bright. Then as the helicopter got right up to where they were the starlike objects started to move behind a rock until we could no longer see them. The three of us stood on the road and were sort of angry at what we had just wittnesed.We were debating on what to do next when we saw the lights come back into view.We were so excited, we couldnt believe that they had come back. Shortly after that they left for good. Right before we got in the car to leave I looked up in the sky one last time and saw a bright green streak of light shoot up in the sky right over where we were standing."],"Country":"United States","Summary":"ufo's on video","Weather Factors":"None","City":"Leggett","Tags":"City","Date Submitted":"05/27/2010 05:20 UTC","Date of the Event":"04/24/2010 09:30 UTC","Object Shape":"Circle, Star-like","Disposition":"IFO","Longitude":"-123.708108","Case Number":"23488","Latitude":"39.872464"}