{"Case Number":"23497","City":"Anaheim","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around May 26th 2010"],"Region":"California","Object Shape":"Other","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Other","Log Number":"US-05282010-0006","files":["/var/www/straped/mufon/html2text/23497.html.txt","/var/www/straped/mufon/org/23497.html"],"Date Submitted":"05/28/2010 05:31 UTC","Date of the Event":"05/26/2010 08:35 UTC","Object Flight Path":"Stationary","Country":"United States","Source":"MUFON","divs":["Sighting DetailsTwo dark spirals emanating from the clouds downwards. One quite long and 4 times longer than the other. At first, since I was driving, I thought the longer one was the trail of smoke and I mentioned to my friend that there must be a large fire to give off that large a trail of smoke. Then, with the next good look, I noticed there were two and they were both spirals, perfect spirals like the one shown in the night photo over Norway in December 2009; only these were not fluorescent. They were not discipating as we drove along. We were headed to work, hence we could't observe longer, nor did it occur to me that I could relate the shape to the Norway incident. It was just today, a day and a half later, I searched cloud spirals and ran across the Norway photos and recognized the shape to be exactly what we saw. The source of these spirals was behind the clouds; no rotating or spinning at the base as in the Norway indicent (at least at the time we observed). The source or point of origin was not visible to us. It appeared to be the leftovers of whatever experiment was going on earlier. They were very well marked still."],"Longitude":"-117.908674","Summary":"2 dark SPIRALS emanating from the clouds; partly cloudy sky","Disposition":"IFO","Tags":"City","Latitude":"33.843163","map":"<A HREF = \"http://maps.google.com/maps?q=33.843163,+-117.908674(23497)&iwloc=A&hl=en\"> mufon case (23497) map </A>"}