{"Longitude":"-111.830372","Date of the Event":"05/27/2010 07:47 UTC","Source":"MUFON","Object Shape":"Sphere, Other","Object Flight Path":"Other","Disposition":"IFO","Case Number":"23493","Object Features":"None","files":["/var/www/straped/mufon/html2text/23493.html.txt","/var/www/straped/mufon/org/23493.html"],"Log Number":"US-05282010-0002","Country":"United States","Weather Factors":"None","City":"Mesa","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around May 27th 2010"],"Viewing Distance":"501 Feet - 1 Mile","Summary":"Witnessed gold lights popping on and off in sky","divs":["Sighting DetailsAt approximately 7:45pm Arizona time on May 27, 2010, I stepped out onto the patio for a cigarette. I had just lit the cigarette and was looking toward the east when I noticed a golden light in the sky. At first I thought it was an airplane heading for Sky Harbor Airport. A second light suddenly appeared and I was wondering where the second plane had come from when a third light appeared. When the fourth light appeared, I realized that I was seeing something out of the ordinary and I called for my daughter-in-law to come outside--she also witnessed part of this display. When the fifth light appeared the first light disappeared. The second light disappear a second later. Then the third...fourth...and fifth. Once all these lights were gone, the sequence repeated itself. It repeated four or five times. At the time, the sky was still a light blue and I could see that there was nothing else in the sky--no planes or helicopters or hot air balloons. These were not flares being dropped or being shot into the sky. They were LIGHTS popping on and off in sequence. And there was no sound from the sky. Let me add that they were not fireworks either. My daughter-in-law says the pattern these lights created as they popped on and off reminded her of a catipilar crawling across the sky. And if that isn't crazy enough, I got the impression that these objects had been traveling at a great rate of speed and had just come to a screaching halt as they appeared. While visible, they did not move. They did not spin or rotate or levitate up, down or sideways. They simply appeared from out of nowhere and then disappeared again. I would say this event could not have lasted for more than a minute. But I know what I saw! And it was not flares, fireworks, swamp gas, ball lightening, a temperature inversion or any other explainable thing. What I saw was impossible... Yet it happened. Unfortunately, it did not last long enough to get pictures or video."],"Region":"Arizona","Sighting Duration":"00:01:30","Date Submitted":"05/28/2010 12:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.423224,+-111.830372(23493)&iwloc=A&hl=en\"> mufon case (23493) map </A>","Tags":"City","Latitude":"33.423224"}