{"Summary":"Bright Orange object observed slowly travelling down from the sky diagonally, then leveling out to travel horizontally (right to left) across the sky.","Object Features":"Unknown","Weather Factors":"Windy, Light","map":"<A HREF = \"http://maps.google.com/maps?q=39.250663,+-76.520518(23499)&iwloc=A&hl=en\"> mufon case (23499) map </A>","trends":["There have been 3 other sightings in Dundalk","There were no other sightings in Dundalk on or around May 24th 2010"],"Date Submitted":"05/28/2010 07:52 UTC","Log Number":"IE-05282010-0008","Sighting Duration":"00:00:20","City":"Dundalk","Region":"Maryland","Case Number":"23499","Tags":"City","Viewing Distance":"101-500 Feet","divs":["sighting detailsi was lying on my bed @ 11:00 pm on the 24 may 2010, praying would you believe. when i finished i opened my eyes and noticed a bright object to my left, out of the corner of my eye, moving outside in the sky. for a split second i thought it was just the bright star\\planet that can be seen each night in that direction. i jumped up to the window and was blown away by what i saw. i observed, beside the star, another bright, luminous orange (same colour as fire) object, as clear day, moving down diagonally out of the sky slowly (from right to left)and then straighten out to move horizontally across the sky behind the neighbour's house facing ours. i shouted for my my wife who came into the room at that time and she also observed the object. she was stunned as she observed this thing outside. the object was very bright and moved silently. very very clear, its motion was constant and perfectly horizontal as it moved across the sky above\\behind the neighbours house across the road. it did not flicker or wobble in any way or leave any smoke trail against the bright night sky. it seemed to go out of sight or fade when it reached the bottom of the street. the whole thing lasted maybe 20 seconds from start to finish. afterwards i just couldn't believe what i saw, how close it was (.2 of a kilometer out, maybe a quarter of a kilometer up) and how clear it was against the sky. my wife said she thought it looked like a rod but i would say it orb like with a slight oval shape. definately not a plane, star, meteor or even chinese lantern. it was the strangest thing i've ever seen. this is the second time i've reported something to mufon in this area. i think i'm in the flight path lol. note: if it was one of those chinese lanterns it must have had 'light bulbs' instead of candles in it as this thing was as bright as a street light and it must have had its own propulsion as it was moving against the wind."],"Latitude":"39.250663","Date of the Event":"05/24/2010 11:01 UTC","files":["/var/www/straped/mufon/html2text/23499.html.txt","/var/www/straped/mufon/org/23499.html"],"Object Shape":"Cylinder, Fireball, Oval, Sphere","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Longitude":"-76.520518","Disposition":"Unresolved"}