{"Source":"MUFON","Tags":"City","Region":"Maryland","Date of the Event":"05/20/2010 10:40 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Log Number":"US-05282010-0007","Weather Factors":"Unknown","Longitude":"-77.048408","City":"Washington","Country":"United States","Object Shape":"Circle, Triangle","files":["/var/www/straped/mufon/html2text/23498.html.txt","/var/www/straped/mufon/org/23498.html"],"Latitude":"38.98956","map":"<A HREF = \"http://maps.google.com/maps?q=38.98956,+-77.048408(23498)&iwloc=A&hl=en\"> mufon case (23498) map </A>","Summary":"I saw and videoed a slow-moving constant orange-yellow round light with a white upside-down triangle shape that blinked a couple of times.","Sighting Duration":"Undisclosed","Case Number":"23498","Object Features":"Undisclosed","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around May 20th 2010","This sighting has never been favorited.",""],"divs":["sighting detailsi was resting on my couch when i saw an orange-yellow light shining through my window. it was a small light, but larger than a star, which is why it caught my attention. i looked around the room to see if anything was reflecting the light in the window. i even turned off the tv and lights to make sure, but the light was still there. i called my husband to look at it, and he said to take a picture of it. i turned the lights back on in the house, grabbed my camera, and ran outside to take a picture of the light. the picture turned out blurry. i then took a video of it. the video lasted for almost two minutes. it was a round light that seemed to hover above in the sky in the direction of my neighbor's house across the street to the right. a couple of times i saw a long white upside-down triange-shaped object for a split second - perhaps when the light turned. the light hovered for perhaps two minutes then started moving upwards slowly. it then moved towards my left in the sky towards the houses down my street. i had my husband hold the camera, and he zoomed in on the light as it went farther and farther away. it eventually went out of sight. this was a slow-moving light\\object. it moved much slower than an airplane, and hovered before moving up and away. the light never blinked as an airplane light does - only the bright white upside-down triangle did. it wasn't a star because there were other stars in the sky at the time. it was something - whether a strange military object or extraterrestrial, i don't know - but i have it on film."],"Date Submitted":"05/28/2010 06:46 UTC"}