{"Disposition":"Unknown","trends":["There have been 4 other sightings in Villa Park","There were no other sightings in Villa Park on or around May 27th 2010"],"Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Object Flight Path":"Path with directional change","Longitude":"-87.986044","map":"<A HREF = \"http://maps.google.com/maps?q=41.896652,+-87.986044(23495)&iwloc=A&hl=en\"> mufon case (23495) map </A>","Region":"Illinois","divs":["Sighting DetailsI was outside having a cigarette on the porch looking at the stars, when I saw 2 red, slowly blinking lights floating across the sky at a decent pace. Immediately, I thought UFO. I've seen quite a few indescribable objects in the sky over the years. I immediately felt a sense of extreme excitement, and a bit of fear. This feeling persisted throughout the encounter. These particular 2 lights were (from my point of view) about 3 inches apart in the sky, (further distance up close of course), following each other perfectly, keeping the exact same distance apart at all times. They moved to the east, banking smoothly towards Chicago. Another appeared as if out of nowhere, heading south, then banking east again towards the city, smoother than any plane or helicopter I have ever seen, but this one left a small contrail behind it that looked like a small cloud, and it slowly dissipated. The last came from the north, moving south again and did the same as the last. They were all blinking at the same rate, a very slow, dull pulsing. They all eventually faded out. There was no sound to be heard, and the lights were bright enough to be viewed behind thick clouds."],"Date of the Event":"05/27/2010 11:07 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"41.896652","files":["/var/www/straped/mufon/html2text/23495.html.txt","/var/www/straped/mufon/org/23495.html"],"Case Number":"23495","Tags":"City","Summary":"Four slowly blinking red lights floating across the sky in strange patterns","City":"Villa Park","Log Number":"US-05282010-0004","Object Features":"Unknown","Date Submitted":"05/28/2010 01:06 UTC","Object Shape":"Other"}