{"Log Number":"US-05282010-0011","divs":["Sighting DetailsMonday night at around 10:10 pm I got out of my truck after arriving at my house. While I was walking inside I noticed a very bright star like object. I looked at it and thought I saw it move side to side quickly. I could not tell if it was me shaking or if it was actually moving or not. I watched it for 10 minutes and it continued to move side to side and up and down at different times, but it stayed still for most of the time. I sat down on my bumper of my truck to try to make sure it was not just me shaking but I continued to see it move. I noticed my mother was still awake in the second story of our house. I called her and had her look out the window. I gave her the general direction and she noticed it pretty quickly. She noticed it moving a bit too, but like me she could not tell if it was her or the light moving. We did noticed it move at the same time, but it was still hard to tell. She went to bed because she works early. I watched it for about 15-20 minutes longer and noticed it position had changed slightly from when I first noticed it. I had made a mark on the ground before I sat down so I could tell where I had been originally standing when I noticed it. I do live near an airport that sees a lot of traffic, but I do not believe it could have been a plane staying in pretty much the same area for 30 minutes. Sometimes planes look like they are not moving when they are at a distance if they are moving directly towards you or away from you, but within a few minutes of watching you can eventually see it move one way or another. Another thing I have noticed about planes is that if they are anywhere near as bright as this object was, they are moving towards you. When the object finally moved out of sight it dimmed from a bright white light to a dull rust colored red and moved down under the tree line. The only thing I can think that this might have been was a helicopter, but I really just did not get the feeling that it was. If it was a search light it was shining, I never saw a beam from it and I never saw it turn at all. I see a few helicopters in the sky around Bangor, but I have never seen one sit and hover for 30-40 minutes. When the light dimmed from bright white to dull red I never got the impression that it was turning so I don't believe I was seeing any tail lights. It also did not flash at all. It was always a solid color. The glow the from the white light did seem to twist in place at times."],"Object Shape":"Star-like","Region":"Maine","Case Number":"23502","Country":"United States","Disposition":"IFO","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/23502.html.txt","/var/www/straped/mufon/org/23502.html"],"Date Submitted":"05/28/2010 01:20 UTC","Longitude":"-68.826389","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"05/24/2010 12:00 UTC","City":"Orrington","map":"<A HREF = \"http://maps.google.com/maps?q=44.731111,+-68.826389(23502)&iwloc=A&hl=en\"> mufon case (23502) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Orrington","There were no other sightings in Orrington on or around May 24th 2010"],"Summary":"Looked like a very bright star. Made wobbling movements, then stood still. Stayed put for 30 minutes then slowly moved down below tree line.","Latitude":"44.731111"}