{"Summary":"Greenish tri-light with red tint in center","City":"El Paso","Viewing Distance":"Over One Mile","Log Number":"US-05282010-0017","Latitude":"31.76843","Case Number":"23508","Date of the Event":"05/28/2010 07:30 UTC","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around May 28th 2010"],"files":["/var/www/straped/mufon/html2text/23508.html.txt","/var/www/straped/mufon/org/23508.html"],"Region":"Texas","Tags":"City","Object Shape":"Triangle, Unknown","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-106.484951","map":"<A HREF = \"http://maps.google.com/maps?q=31.76843,+-106.484951(23508)&iwloc=A&hl=en\"> mufon case (23508) map </A>","Date Submitted":"05/28/2010 10:47 UTC","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","divs":["sighting detailson may 28, 2010 at approximately 1930 hrs mst while taking pictures of an interesting sunset over the franklin mountains, from the perspective of the northeast side in front of my home, i did not see anything unusual until i imported the raw files from my canon eos 50d digital camera into adobe lightroom for viewing. whiel reviewing the numerous images taken of the sunset, i observed a set of six images within a 2.5 - 3 minute time frame that displayed an odd object with what appeared to be three lighted points with a greenish tint to them. the center light had a red halo surrounding it. at first, i thought that these were lens flares from my l-series lens (decent quality), but after looking at them more closely and observing the position change of the object, i am not so convinced anymore. i did not observe this anomaly on any other images of the set taken. the photos containing the object occurred over a 2.5 minute period or so, then disappeared in the very next frame. i invite you to review the images i uploaded to flickr. in any event, i thought you may be interested in taking a look and seeing what you think. i suppose one never knows. the images may be found at: http:\\\\www.flickr.com\\photos\\sgreeneptx\\sets\\72157624157389050\\ these are resized versions of the originals for the sake of posting."],"Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Undisclosed"}