{"Object Shape":"Star-like","Region":"Arizona","Longitude":"-110.630929","Summary":"Multiple sightings of strange lights over Tri-City area.","files":["/var/www/straped/mufon/html2text/23501.html.txt","/var/www/straped/mufon/org/23501.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.599793,+-110.630929(23501)&iwloc=A&hl=en\"> mufon case (23501) map </A>","City":"San Manuel","Object Features":"Unknown","Date Submitted":"05/28/2010 11:33 UTC","trends":["There has been one other sighting in San Manuel","There were no other sightings in San Manuel on or around May 27th 2010"],"Country":"United States","Date of the Event":"05/27/2010 07:40 UTC","Latitude":"32.599793","divs":["sighting detailson the evening of may 27th, my 17 year old son, one of his friends, and i were driving north bound on oracle rd\\hwy 77, on our way home from unloading a moving truck. maybe half a mile from mile marker 109 exit, at approximately 7:40pm. my son's friend was the first to notice these strange lights. there were two lights near each other like stars. he described them as brighter than the north star. what really made them stand out, was the fact it was still day light. they appeared to the west between the highway and the mountains to the west of town. we all three agreed as to what was seen next. the lights simply hovered for a few seconds, then one of the lights flew very quickly to the other. then it vanish as though the light was just turned off. then the other vanished as well. later that night the lights were witnessed again to the west of town, over the mountains. this was approximately 9:45pm, by my son and a different friend than the one that was with him for the first sighting (although there is some debate as to the time, we often have strange time issues with our cellular phones that cause them to show the time as being an hour ahead. i was texting with a friend at approximately 8:45pm which would have made the time the boys came in to tell us about it approximately 8:50pm not 9:50pm) my son was about to walk his friend home, they had been gone only 5 minutes or so, when they came frantically running into the house to tell us of this second sighting. after walking his friend home, my son walked down to the local minit market, to see if any of his other friends were down there. he wanted to tell them about what he had seen. while standing outside talking to the store clerk, the lights were witnessed for a third time. this time to the east of town, directly after the lights disappeared, two \"military\" or what my son described as military, jets were seen moving toward the area the lights were seen. the store clerk was so startled by the event, that he stated he wanted to \"clock out early and go home\", he told my son. this was approximately 10:10pm. my son arrived home at 10:25pm to tell his father and i what he had seen the third time. the friend he was with for the first sighting at approximately 7:40pm, came over at approximately 10:45pm to tell all of us what he saw at 10:10pm corroborating my sons account of what happened down to the 2 jets, seen from 2 separate locations in town that night."],"Source":"MUFON","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","Log Number":"US-05282010-0010","Weather Factors":"None","Case Number":"23501","Tags":"City","Disposition":"Unknown"}