{"trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around May 25th 2010"],"Latitude":"36.34074","Log Number":"US-05282010-0014","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23505.html.txt","/var/www/straped/mufon/org/23505.html"],"Disposition":"Unknown","Region":"Arkansas","Longitude":"-94.117077","Date of the Event":"05/25/2010 12:00 UTC","divs":["Sighting DetailsMe and my brother where in the front yard talking and we saw a couple of shooting stars. So we decided to keep looking up to see more, we saw two constant non blinking white lighted objects moving north to northeast one following the other exactly but a little ways behind it but close enough to see them both at the same time and tell one was following the other. We past those off as satillites. A few seconds later i saw what looked to be the same kind of object either way smaller or way higher up going the opposite way at a very fast speed compared to the \"satillites\". I tried to point it out to my brother whom has way worse vision than me, and i tried to point it out by using bigger stars. To our southeast there was an upside down triangle formation of stars all by its self in view slightly above the big or lil dipper not sure which but from our angle triangle was upside down and if you were looking at the dipper right side up the triangle would be falling into it sideways. The tiny or far object was about to pass directly under the bottom star of the triangle. I told my brother to focus on that star in hopes he might see the fast object. He did not see the object moving fast, however as soon as the object looked like it flew directly beneth the bottom star, the Star grew at least six times its size and turn from white to purple then just started cruesing off in the same direction as the smaller object was going. A couple other people we have talked to over the past couple of days have seem to have seen the same thing. All i know is this was all the proof we needed to see this seemingly impossible sight."],"Date Submitted":"05/28/2010 08:23 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.34074,+-94.117077(23505)&iwloc=A&hl=en\"> mufon case (23505) map </A>","Summary":"Small white when still. Blows up big and purple when moving..","Case Number":"23505","Viewing Distance":"Unknown","Object Shape":"Circle, Disc, Flash, Sphere, Star-like, Unknown","City":"Rogers","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Country":"United States"}