{"City":"Waycross","Longitude":"-82.344568","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"21-100 Feet","trends":["There have been 5 other sightings in Waycross","There were no other sightings in Waycross on or around June 30th 1969"],"Weather Factors":"None","Log Number":"US-05282010-0013","Region":"Georgia","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/23504.html.txt","/var/www/straped/mufon/org/23504.html"],"Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=31.220101,+-82.344568(23504)&iwloc=A&hl=en\"> mufon case (23504) map </A>","Source":"MUFON","Tags":"City","Latitude":"31.220101","Summary":"Craft flew down from clouds, hovered over home as we watched from approx.100 ft distance, then flew away rapidly to our left.","Disposition":"Insufficient Data","divs":["Sighting DetailsThis took place in Waycross, GA. I was about 10 yrs old, playing with a brother in a lightly wooded area behind our home, approx. 50 ft away. I saw a lot of turbulence in the clouds toward the front of our home, about half a mile away. The craft left the clouds & started descending in a wide half-circular pattern, slowing as it approached our home. It flew towards our home slowly at treetop level & stopped over the front of our home, remained motionless for about 1 minute, then flew away rapidly to our left, climbing into the clouds gradually. I think our home faced the north, so the craft left towards the west. It's departure only took about 5 seconds. The craft resembled a submersible vehicle, no visible or recognizable propulsion, metallic surface, was a straight cylinder, with domed ends, @ a beltline that ran down the sides from front to back. Along this beltline were several round domes, spaced evenly. On top of the craft towards one end there was a large bulge or pod projecting upwards, on the opposite end of the craft, on top, there was a large structure or mechanism that I could not identify. My brother & I stood in a clearing with an unobstructed view of the craft & watched it in disbelief, it just stood there, silently hovering. I seemed to sense a vibration in the air, & felt nervous about seeing this. The craft seemed to be doing something, but I couldn't tell what. My comprehension was being pushed past normal limits, then I seemed to come to my senses, the craft turned slightly & flew away. My brother & I had remained standing in the same place during the sighting, & after it left, we ran straight to our home. I felt panicked & scared, & I was thinking that something really strange had happened & that I didn't want to think about it again, yet I wanted to remember it, because it seemed to have major importance."],"Country":"United States","Case Number":"23504","Date Submitted":"05/28/2010 06:24 UTC","Date of the Event":"06/30/1969 12:00 UTC","Object Features":"Dome, Window(s), Appendage(s), Other"}