{"Object Shape":"Fireball","Disposition":"IFO","Longitude":"-81.303918","Date Submitted":"05/29/2010 10:47 UTC","Latitude":"29.896864","Source":"MUFON","Summary":"Unidentified aircraft in front of St. Augustine Pier had fireball appearance.","divs":["Sighting Details Just wondering if anybody else was inquiring into the object seen in front of the St. Augustine Pier Thursday, May 27th 2010 at approx. 11pm. There were several people on the beach at the time who noticed this. It at first appeared to be an airplane headed south to north but it was peculiar as it was quite low and the headlight looked like an orange fireball. It was moving quite fast and I told the person I was with \"See, that is why people always think they see UFO's. Wait till it gets closer and you can see the blinking lights and you'll see that a plane can look like a UFO from a distance.\" Well... the \"plane\" came very fast up the beach and when it got just in front of the pier (half mile south of our position) it stopped and hovered. This threw us off guard and I thought, damn, IS this a UFO? Then the aircraft shot a jet stream out the back as it hovered... only the jet stream looked like sparks flying out of the back. The craft got very bright, again resembling a fireball in the sky. It began moving again and just a few seconds after the movement the lights went out completely. We watched for another 20 minutes but saw nothing. There were a few airplanes in the background that really showed how different this craft was from a traditional plane. There were no other crafts in the immediate vicinity, it made no noise, and was approx the size of what you would expect a plane to be. It is possible that is was some sort of military craft."],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.896864,+-81.303918(23511)&iwloc=A&hl=en\"> mufon case (23511) map </A>","Case Number":"23511","City":"St Augustine","Object Flight Path":"Undisclosed","Log Number":"US-05292010-0003","files":["/var/www/straped/mufon/html2text/23511.html.txt","/var/www/straped/mufon/org/23511.html"],"Region":"Florida","Country":"United States","Date of the Event":"05/27/2010 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around May 27th 2010"],"Viewing Distance":"Unknown","Weather Factors":"Unknown"}