{"Longitude":"-99.726894","files":["/var/www/straped/mufon/html2text/23513.html.txt","/var/www/straped/mufon/more/23513_submitter_file1__DSC01829.JPG","/var/www/straped/mufon/org/23513.html"],"Date of the Event":"05/03/2010 01:19 UTC","City":"Abilene","Sighting Duration":"Undisclosed","Log Number":"US-05292010-0005","Viewing Distance":"Unknown","trends":["There have been 63 other sightings in Abilene","There was one other sighting in Abilene on or around May 3rd 2010","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","Date Submitted":"05/29/2010 05:55 UTC","Object Shape":"Oval, Sphere, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=32.452636,+-99.726894(23513)&iwloc=A&hl=en\"> mufon case (23513) map </A>","Object Features":"Undisclosed","Country":"United States","Tags":"City","Region":"Texas","Summary":"Objects seen in photos taken during a trip to Abilene, Texas","Case Number":"23513","Weather Factors":"Windy","divs":["sighting detailsmay 3, 2010 @ 1:19 p.m., my spouse and i were driving to abilene for my six month medical check up. we were driving sw on hwy 351. as we were coming up on the wind farm located nw of abilene, i felt the need to take a few photos, so i did. i had seen several small bright flashes of light in the sky but could not tell what it was. when i finally downloaded the photos to my laptop, two particular photos stood out. to the extreme left of the first photo, are some white dots. this is the location in the sky where the flashes of light caught my attention. in the center of the photo is an unknown object and 3 quarters of the way up from the bottom of the photo and just left of center, there appears to be an obtuse triangle formation of lights. there are a couple of light streaks but i am assuming they are minute scratches on the windshield, along with an amount of bug splats. after i downloaded the photos and looked at them, i went out to the pickup and checked to see if any of these anomalies might match up with the bug splatters but they didn't, so i decided it might be worth reporting. the photo was taken with a sony cyber-shot, f\\7, 1\\640 sec., 100 iso, apt-3, fl-10mm, no flash. i also have another photo taken on the way back (again through the windshield), that shows white orb-like objects in an entirely different location. they are not reflections, smudges, birds, airplanes, venus, swamp gas, etc. i have the unedited originals and will send the second photo upon request."],"Latitude":"32.452636","Disposition":"IFO","Source":"MUFON"}