{"map":"<A HREF = \"http://maps.google.com/maps?q=41.270653,+-72.947047(2351)&iwloc=A&hl=en\"> mufon case (2351) map </A>","Weather Factors":"Unknown","Sighting Duration":"00:05:00","City":"West Haven","Latitude":"41.270653","Summary":"a ufo twenty feet away","Log Number":"","Disposition":"Unknown","Object Shape":"Bullet, Missile","trends":["There have been 3 other sightings in West Haven","There were no other sightings in West Haven on or around August 31st 1995"],"divs":["Sighting Detailsit was 10 oclock at night on the beach of west haven. myself an my exgirlfriend were walking the beach right were the water meets the sand. it wasvery quiet beautiful,peaceful night. as we got to the beach pier we had to walkup and around the cement walkway of the pier.as we were doing that i was lookingstraight ahead and I saw at first what I believed was a very tight formation ofbats just above me about thirty feet away. but I quickly noticed that it was asmall circle of very dim red lights. It decended right down in front of us abouttwenty feet from us.the strange thing about it was that I could see the dimcircle of red lights but the upper outline of the craft I couldnt see at all. myex girlfriend was standing right next to me.There was absolutly now sound at allcoming from it. All I said to her was do you see what I see.Her responce waswhat is it. I said to her dont go near it. It just stood their about a foot offthe ground right were the water meets the beach,about twenty feet in front ofus.I was thinking while I was standing their that the tecnology that this craftmust have to be able what I am seeing with my own eyes is so advanced I wouldlove to know how it is powered.Then I started to walk closer to it so I couldsee what the craft looked like.I was amazed that being so close and I couldntsee the outline of it at all. I started walking toward it closer.now I was aboutten feet from it and all of a sudden it shot straight back about a foot abovethe water out toward the breakwater rocks about 500 yards out. I keeped my eyesglued to the dim red lights.I never lost sight of it ever.As it got closer tothe breakwater rocks,the moon shining on the water reveald the shape and outlineand color of the craft.The speed of the craft going straight wasnt veryfast,maybe about 30 miles per hour.The shape was kind of like a bullet head ormissle head syraight up and the color was a very dull gray green.As it reachedthe rocks it turn right and headed out to sea still only a foot above the water.I watched it untill I couldnt see it anymore.From what I experiencedtheir,something was controling the craft,it definitly new we were there,itreacted intelegently and defensively when I walked toward it,and at no time didit ever make any sounds at all.I have been living with this for years. Eversince I had this encounter Ihave been getting these image"],"Date Submitted":"08/31/1995 10:00 UTC","Region":"Connecticut","Date of the Event":"08/31/1995 10:00 UTC","Country":"United States","Case Number":"2351","Longitude":"-72.947047","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Unknown","Source":"MUFON","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/2351.html.txt","/var/www/straped/mufon/org/2351.html"]}