{"Tags":"City","Date of the Event":"05/16/2010 08:00 UTC","Summary":"Pretty freaking crazy.","Date Submitted":"05/29/2010 11:44 UTC","Object Features":"Unknown","Object Shape":"Triangle, Unknown","Longitude":"-117.178316","Source":"MUFON","Country":"United States","Log Number":"US-05292010-0011","Latitude":"34.509451","trends":["There have been 8 other sightings in Apple Valley","There were no other sightings in Apple Valley on or around May 16th 2010","This sighting has never been favorited.",""],"Case Number":"23519","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.509451,+-117.178316(23519)&iwloc=A&hl=en\"> mufon case (23519) map </A>","divs":["Sighting DetailsI was going to put my clothes in the garage (Which is where the Wash and dryer is) and I had wanted to ask my step dad who was in the kitchen if he brought my laundry detergent sheets. As I went to go in the kitchen i look out the window (The window in the picture) and seen a bright light in the distance being completely still. I asked my step-dad \"what do you think that is? and he responded a helicopter...but I kept looking and looking and it just stood in the same place for about 2 minutes. he started to look after awhile and we just stood there we screamed for my mother to come in the kitchen and it started moving closer with absolutely no sound. My step-dad then told me to go get my camera from my room, I snapped the picture and went to go run outside i snapped one more picture and then my camera stopped working all together. We just stood there looking up in the sky as the ufo passed by us without making any sound. After that happened 3-4 military helicopters went above us and the object disappeared."],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","City":"Apple Valley","Region":"California","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/23519.html.txt","/var/www/straped/mufon/more/23519_submitter_file1__DSC_0038.jpg","/var/www/straped/mufon/org/23519.html"]}