{"Latitude":"41.210119","Longitude":"-122.269703","Country":"United States","Region":"California","Summary":"Ufo sighting in Dunsmuir, CA 5/28/10","City":"Dunsmuir","Date of the Event":"05/28/2010 10:05 UTC","Source":"MUFON","Object Features":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.210119,+-122.269703(23514)&iwloc=A&hl=en\"> mufon case (23514) map </A>","Log Number":"US-05292010-0006","divs":["Sighting DetailsOn May 28 2010 around 10PM, me and my girlfriend saw 4 star like objects in the sky that were odd colored and were moving all around the sky. The objects would move up and down, side to side,two of them moved in sequence till one blinked out and the other headed closer to the mountain,and made snake like patterns in the sky. They were moving at a high rate of speed and would also disappear as if a light made been turned off then they would appear again. At one point we saw one of the UFO's appear just over the mountain top, it begin to fly closer towards us and it looked as if it was aware of us looking at it and it approached us. As we felt uncertain of how closer it was going to get to us we started to get frightened and started walking to near by homes. The object went over our heads and blinked out! We also saw one of the other objects appear over the mountain ridge, we could see the object in between 2 houses, it looked like a big star and it seemed out of place. I told my girlfriend to remember the two houses so we would be able to tell if the object moved. we moved further down the street and my girlfriend saw a star that looked like the other one directly across from the other one and as we stood looking at it, it slowly moved up higher in the sky well we watched it move up we suddenly remembered the other object between the 2 houses and went back when we got there it wasn't there anymore. and earlier that day about 10:20 about 10 huge all black UN-marked coppers flew over the town, they appeared military and flew low over the town.Dunsmuir is a small town that has never had that much air traffic and even when there is an air craft in the sky its usually only one and if its flying low it 99% of the time looking for some kind of drug bust in the mountains. We were unable to take a picture or video."],"Weather Factors":"Unknown","Date Submitted":"05/29/2010 06:42 UTC","Object Shape":"Star-like","trends":["There have been 2 other sightings in Dunsmuir","There were no other sightings in Dunsmuir on or around May 28th 2010"],"files":["/var/www/straped/mufon/html2text/23514.html.txt","/var/www/straped/mufon/org/23514.html"],"Viewing Distance":"Over One Mile","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Case Number":"23514"}