{"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Viewing Distance":"Unknown","Region":"Florida","Log Number":"US-05292010-0002","Weather Factors":"Does Not Apply","Country":"United States","trends":["There have been 16 other sightings in Cape Coral","There were no other sightings in Cape Coral on or around May 28th 2010"],"Date of the Event":"05/28/2010 10:07 UTC","Longitude":"-81.945553","Latitude":"26.566494","Summary":"3 lg bright circular lights in formation of pyramid moving forming smaller pyramid","Object Shape":"Circle","Disposition":"Insufficient Data","Tags":"City","divs":["Sighting DetailsI went out into backyard to let dogs out at about 10:05 PM. It was a full moon. I looked into WNW sky and saw 3 large (5x lger than biggest planet i've seen)white circles of light in formation of pyramid. Not moving but getting brighter. I called my friend to come outside and she said \"omg\" when she the lights. They stayed still and hugely bright in formation for about 5-7 minutes. Then they all moved slowly at same time tightening up the pyramid shape. Then somehow still in formation they appeared smaller but still a pyramid but with smaller lights. The one on the left flew off to the left and became small, like a lg star. A plane from somewhere flew to it and past it and then this smaller circle of light stopped flying and remained stationary but now looked like a plane with some blinking lights. After a few minutes it flew off to the left (S) looking like a regular plane. Back to the 2 remaining cirles of light that were bright and hadn't moved anymore. Now the top one of the once pyramid shape also flew to the left getting smaller as it flew and then it too just looked like a plane with blinking lights. The 3rd remaining stationary light now also took off flying to the left and then as it was getting smaller it too looked like an airplane. When i say looked like an airplane- it was an appropriate speed, size and lighting of a plane, as we live a little outside to the flight pattern to Regional Southwest Airport in Fort Myers, we see lots of planes in the night sky. There was no noise. We both were in awe. I have seen something like this in Sedona over 20 yrs ago- but my friend had never experienced such an unexplainable sight, especially to her the fact that they were so large and didn't move for so long."],"Sighting Duration":"Undisclosed","Case Number":"23510","files":["/var/www/straped/mufon/html2text/23510.html.txt","/var/www/straped/mufon/org/23510.html"],"City":"Cape Coral","map":"<A HREF = \"http://maps.google.com/maps?q=26.566494,+-81.945553(23510)&iwloc=A&hl=en\"> mufon case (23510) map </A>","Object Features":"Unknown","Source":"MUFON","Date Submitted":"05/29/2010 08:07 UTC"}