{"Object Shape":"Flash","Object Features":"Undisclosed","Case Number":"23527","City":"Las Vegas","trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around May 30th 2010"],"Sighting Duration":"00:00:02","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.117746,+-115.164126(23527)&iwloc=A&hl=en\"> mufon case (23527) map </A>","Date Submitted":"05/30/2010 07:30 UTC","files":["/var/www/straped/mufon/html2text/23527.html.txt","/var/www/straped/mufon/org/23527.html"],"Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-115.164126","Latitude":"36.117746","Region":"Nevada","Tags":"City","divs":["Sighting DetailsI was outside smoking a cigarette, looking at the sky like I always do, and happened to be looking in the right place at the right time. It happened very quickly: it appeared out of nowhere, and I couldn't see the object that created it, but I saw what appeared to be the trail of something moving very fast. It was blue and illuminated, and curved upwards in an S-shape. It was almost instantaneous, and the blue trail faded within a second or two. I had seen a shooting star a few minutes earlier, and I've seen those quite a few times before, so I know it wasn't a shooting star. Whatever this was was bright blue (not white), moved upwards and moved much faster than any shooting star I've ever seen. I'm fascinated by the unknown and the paranormal, so most of the time when I'm smoking at night, I'm outside looking at the sky. With that said, I feel pretty confident that I can tell if something in the sky is normal or abnormal, and this was clearly abnormal. I've looked forward to the day that I could say that I've seen something I just couldn't explain, so this is very exciting for me."],"Object Flight Path":"Undisclosed","Log Number":"US-05302010-0008","Summary":"S-shaped blue streak of light","Weather Factors":"Unknown","Date of the Event":"05/30/2010 03:40 UTC"}