{"Region":"Massachusetts","Date Submitted":"05/30/2010 03:56 UTC","Longitude":"-71.160434","Log Number":"US-05302010-0005","Disposition":"Unknown","Viewing Distance":"20 Feet or Less","Summary":"Large cigar shaped object hovered over north and southbound lanes of Route 93.","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsI was driving southbound on route 93 at approximately 11pm a night. AThe weather was clear. Suddenly, I noticed that a car that was ahead of me brake and the red brake lights came on. Then a blinding bright light shown over the whole highway - covering all lanes southbound and northbound.It was so bright, I had to brake as I was afraid I would run into it. I looked in my rearview mirror and remember thinking - if I stop in the middle of the highway, I will get hit by cars coming behind me. I glanced at the radio clock (don't remember the exact time), but it was around 11pm. At this point, the car is completely stopped in the middle lane southbound on route 93. I could not look at the light - it was blinding and enveloped the inside of the car. The next thing I remember, is seeing the object shoot vertically up at a high rate of speed- then move horizontally out of sight. I looked at the clock - it was now 1120. 20 minutes had passed and I could not account for the time lost. I drove the car off the highway at the next exit, and I was so shaken by the experience, my legs were wobbly and it took me a while before I was able to drive home. This object was cigar shaped, extremely bright and covered the entire width of the highway. Ihad a unusual mark on the inside of my left thigh (size of a pencil eraser), that I noticed after this. It eventually went away approximately 10 years later. I never wanted to report this, as I didn't know what to report. I didn't know what it was. The weird thing, is that right before this happened, I saw cars on the opposite side of the highway (going north), and they must have stopped as well as I did not see them later. This happened somewhere between the Lawrence and Tewksbury exits on route 93."],"trends":["There have been 7 other sightings in Lawrence","There were no other sightings in Lawrence on or around November 12th 1984"],"Case Number":"23524","Date of the Event":"11/12/1984 12:00 UTC","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=42.709625,+-71.160434(23524)&iwloc=A&hl=en\"> mufon case (23524) map </A>","Object Features":"None","Object Shape":"Cigar","Latitude":"42.709625","files":["/var/www/straped/mufon/html2text/23524.html.txt","/var/www/straped/mufon/org/23524.html"],"Sighting Duration":"Undisclosed","Country":"United States","City":"Lawrence"}