{"Country":"United States","Disposition":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/23522.html.txt","/var/www/straped/mufon/org/23522.html"],"Source":"MUFON","Object Features":"Unknown","Summary":"UFO seen moving erratically twice within 1/2 hr","Case Number":"23522","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around May 29th 2010"],"Weather Factors":"None","Date of the Event":"05/29/2010 10:05 UTC","Sighting Duration":"Undisclosed","Date Submitted":"05/30/2010 02:50 UTC","divs":["Sighting DetailsI happened to look up before entering my apt. We are on the 3rd floor (very well lit). We were looking at Saturn and I just glanced to the right and down from Saturn and thought I was looking at a star, but I noticed it was moving. I asked my husband if he saw it and if he saw it moving and he said yes. We both stood there and watched it moved. At first, we were wondering if it was a satellite although usually they look closer and brighter than this. But, it was slower and not following a straight trajectory. So, we watched it's erratic movement until we lost sight of it (almost 4 minutes). It was moving north towards us. There was just too much light in the area. It seemed to dim more as it moved closer to us. Finally it dimmed and we lost sight of it. So, let hubby into apt. We were both in awe cause we couldn't believe what we saw. Then I went back to the railing. Looked for about 20 seconds and saw it again. This time, it was moving away from me (south) and again moving erratically (almost like a really tight fast jerky movement right left still moving forward). I watched it for about 3 minutes and then suddenly I saw a flash move what I believe to be in front of it moving east to west. It just kept going and I couldn't follow the flash. I thought I saw another craft next to the one I had been tracking originally, but right after that flash I lost sight of everything. I went back out later but I've seen nothing in that general area. I even tried binoculars. As far as feelings, I just thought this is so cool and was just amazed and wanted to see more. I called a friend to tell her what happen."],"City":"San Jose","Log Number":"US-05302010-0003","Longitude":"-121.893916","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=37.342546,+-121.893916(23522)&iwloc=A&hl=en\"> mufon case (23522) map </A>","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Latitude":"37.342546","Tags":"City"}