{"Summary":"White cone of light","Disposition":"Unresolved","Region":"Quebec","Latitude":"46.093448","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Thetford Mines","trends":["There have been 7 other sightings in Thetford Mines","There was one other sighting in Thetford Mines on or around September 19th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.093448,+-71.300637(23525)&iwloc=A&hl=en\"> mufon case (23525) map </A>","Viewing Distance":"Unknown","Tags":"City","divs":["sighting detailsi returned to the same location where i had observed a ufo-shaped cylinder. with a friend we walked to the top of the hill. when the sunset came we went down the hill. when darkness came a 19.45, a mysterious light appeared in the sky. i do not know if it was a star, a satellite? it gradually rose in the sky. we stayed about 20 minutes, i watched the light while chatting. we finally left the place, even if the light was still rising in the sky. around 23:00, the light still shining in the sky, but has a much higher altitude. the light disappeared thereafter. fox news and cnn did stories with this mysterious light. several witnesses reported their testimony mufon and other websites. a photo was taken was from maine. and i am enclosing a drawing of what i saw was september 19, 2009 7:45 p.m. nasa says it was a rocket experiment, and frankly i do not know if it's true or not, but if it's true that i would again because many people have enjoyed the show! ufo over east coast massachusetts to virginia september 19, 2009 http:\\\\www.youtube.com\\watch?v=zqustezhy3g&translated=1 ufo nasa may have caused strange light in the sky by black brant xii http:\\\\www.youtube.com\\watch?v=7yzoettoemc&feature=related"],"Object Shape":"Cone","Date of the Event":"09/19/2009 07:45 UTC","Object Features":"Undisclosed","Country":"Canada","files":["/var/www/straped/mufon/html2text/23525.html.txt","/var/www/straped/mufon/more/23525_submitter_file3__ufosept19Zoom.jpg","/var/www/straped/mufon/org/23525.html"],"Log Number":"CA-05302010-0006","Weather Factors":"Unknown","Date Submitted":"05/30/2010 04:53 UTC","Longitude":"-71.300637","Case Number":"23525"}