{"Viewing Distance":"Unknown","City":"Lehigh Acres","Object Flight Path":"Stationary","Date of the Event":"05/29/2010 10:00 UTC","files":["/var/www/straped/mufon/html2text/23532.html.txt","/var/www/straped/mufon/more/23532_submitter_file2__Pictures072.jpg","/var/www/straped/mufon/more/23532_submitter_file3__Pictures075.jpg","/var/www/straped/mufon/org/23532.html"],"divs":["Sighting DetailsMY FIANCEE AND I LEFT A FRIENDS HOUSE AT 10PM ON MAY 29TH 2010. AS WE APPROACHED THE MAIN ROAD, MY EYES LOOKED TO THE NORTH WEST SKY AND I NOTICED A STRANGE AND VERY OUT OF PLACE LIGHT JUST SITTING THERE NOT TOO FAR ABOVE THE TREE LINE. IT WAS VERY BRIGHT, BRIGHTER THAN ALL THE OBJECTS IN THE SKY AT THAT TIME. OUR DRIVE HOME IS APPROX. 10 MINTUES, AND AT THAT TIME, WE DECIDED TO PARK IN THE CHURCH PARKING LOT AROUND THE BLOCK FROM OUR HOME AND LOOK AT THE LIGHT SOME MORE. IT WAS ABOUT 10:10PM WHEN WE ARRIVED AT THE CHURCH. I TOOK 3 PICTURES THERE, ALL OF THEM BLURRY & UNFOCUSED, SO WE DECIDED TO HEAD HOME & GRAB MY TRIPOD. AT 10:27PM I HAD SET UP MY TRIPOD IN THE MIDDLE OF MY STREET & SNAPPED THE FOLLOWING IMAGE. AT 10:28PM I SNAPPED AN ADDITIONAL IMAGE. AT 10:29PM THE OBJECT DISAPPEARED. MY FIANCEE WAS WATCHING AS THE LIGHT VANISHED. WHAT HE DESCRIBED WAS THE LIGHT SHRUNK IN SIZE TO A VERY SMALL, ALMOST TO A PIN-TIP SIZE LIGHT THEN IT WAS GONE. I WAS IN THE PROCESS OF SETTING UP MY CAMERA TO TAKE ANOTHER VIDEO WHEN IT DISAPPEARED. I HAVE THE ONE SHOT OF THE LIGHT WHICH IS VERY CLEAR & THE OTHER SHOT IS THE SAME IMAGE, JUST ZOOMED IN 10X'S. THE LIGHT ITSELF AS IT SAT IN THE SKY WAS FLASHING OR STROBING RED AND WHITE. IT SEEMED TO GROW IN SIZE, THEN SHRINK AGAIN, ONLY TO GET LARGE THEN SMALL AGAIN. COLORS NEVER CHANGED TO ANYTHING OTHER THAN WHITE AND RED, AND THE RED WAS NOT VERY PROMINENT, BUT VISABLE. SEEING IT MADE US FEEL VERY ANXIOUS, A LITTLE NERVOUS, AND EXCITED BECAUSE IT WAS MY SECOND SIGHTING IN TWO WEEKS AND MY FIRST TIME WITH MY CAMERA AND MY FIANCEES FIRST TIME SEEING ANYTHING LIKE THIS, EVER. I AM LOOKING FOR SOMEONE WHO COULD POSSIBLY TAKE THE IMAGE & CLEAN IT UP A BIT, MAYBE REMOVE SOME OF THE PIXELATION & LET ME KNOW WHAT IT IS I REALLY SAW. AS OF RIGHT NOW, I AM CONVINCED THAT WHAT WE SAW WAS A UFO... UNTIL OTHER WISE PROVEN! :)"],"trends":["There have been 5 other sightings in Lehigh Acres","There were no other sightings in Lehigh Acres on or around May 29th 2010","This sighting has never been favorited.",""],"Log Number":"US-05302010-0013","Longitude":"-81.622133","Tags":"City","Case Number":"23532","Source":"MUFON","Region":"Florida","Summary":"STATIONARY LIGHT IN SKY FOR 30 MINUTES BEFORE DISAPPEARING","map":"<A HREF = \"http://maps.google.com/maps?q=26.62726,+-81.622133(23532)&iwloc=A&hl=en\"> mufon case (23532) map </A>","Sighting Duration":"Undisclosed","Object Features":"None","Disposition":"Unknown","Object Shape":"Circle, Fireball, Sphere, Star-like, Other","Latitude":"26.62726","Date Submitted":"05/30/2010 02:18 UTC","Weather Factors":"Does Not Apply","Country":"United States"}