{"Country":"United States","Longitude":"-87.751408","Sighting Duration":"Undisclosed","Object Shape":"Oval, Other","Tags":"City","Disposition":"Unknown","Source":"MUFON","Log Number":"US-05302010-0012","Object Features":"Undisclosed","Date of the Event":"05/28/2010 09:20 UTC","Object Flight Path":"Undisclosed","Region":"Illinois","files":["/var/www/straped/mufon/html2text/23531.html.txt","/var/www/straped/mufon/org/23531.html"],"divs":["Sighting DetailsSitting outside on patio facing North when from over my left shoulder came 2 red pill shaped objects slowly pulsating and gliding in tandem. The objects were very low, large ( the size of a small car) and eitheral in nature. There was no noise at all and no FAA navigation lights. As they came over there seemed to be a huge drop in air pressure. One object seemed to be leading the other as they veered towards the East in front of me and got smaller and smaller almost instantly as they started going down towards the ground and disappeared. At this time there was also alot of regular airline traffic going on and did not fit what the routes were doing. About 2 or 3 minutes later - I see another red pulsating red pill shaped light come out of nowhere from the west in a straight line gliding fast. Again , no noise or FAA lights and it was half the size of the others. It stopped on a dime and verred up in and circled going East following the same tragetory of the other 2 lights earlier. Again - getting smaller and disappearing."],"trends":["There have been 13 other sightings in Oak Lawn","There were no other sightings in Oak Lawn on or around May 28th 2010"],"Case Number":"23531","Weather Factors":"Unknown","Summary":"2 red pulsating pill shaped objects gliding in tandem followed by singular others","Date Submitted":"05/30/2010 02:21 UTC","Viewing Distance":"Unknown","Latitude":"41.713056","City":"Oak Lawn","map":"<A HREF = \"http://maps.google.com/maps?q=41.713056,+-87.751408(23531)&iwloc=A&hl=en\"> mufon case (23531) map </A>"}