{"Region":"California","Source":"MUFON","divs":["Sighting Detailsthis is the second ufo sighting me and my girlfriend have seen in the last two nights. we always go on or nightly walk, the other night we spotted 6, after seeing 10 huge black choppers earlier during the day (we reported those sightings yesterday morning). the next night we went on our usual walk and after walking about a quarter of a mile we started seeing huge lights in the sky that where very close to the top of the mountain they would move across the sky much like a satiate light except that the light was huge and bright and the light would pulsate and move across the sky quite fast until it blinked out. it happened 5 times on our normal 4 mile walk and every time it would be coming in our direction and almost as soon as we would notice it dogs would start barking in houses all around us and at one point when we where almost home and we saw the last of the five, birds where chirping all around us witch was extremely odd because it was almost 3 in the morning. when we got to the bottom of the hill leading to our house my girlfriend noticed something unusual in the mountain trees mostly orange flickering lights moving around the mountain at first just one and then as we watched more and more started appearing until we finally got convinced we needed to go all the was home and get inside."],"trends":["There have been 6 other sightings in Mt Shasta","There were no other sightings in Mt Shasta on or around May 30th 2010"],"Date of the Event":"05/30/2010 12:00 UTC","Longitude":"-122.29345","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Object Shape":"Circle, Sphere","Summary":"huge balls of light coming just over the top of the mt. that would traval and slowly blink out","Object Features":"Unknown","Viewing Distance":"Over One Mile","Case Number":"23538","Country":"United States","Weather Factors":"Unknown","Date Submitted":"05/30/2010 07:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.402767,+-122.29345(23538)&iwloc=A&hl=en\"> mufon case (23538) map </A>","Disposition":"IFO","City":"Mt Shasta","Log Number":"US-05302010-0019","Tags":"City","files":["/var/www/straped/mufon/html2text/23538.html.txt","/var/www/straped/mufon/org/23538.html"],"Latitude":"41.402767","Sighting Duration":"Undisclosed"}