{"Longitude":"-115.165266","Latitude":"36.123606","Object Flight Path":"Stationary,Other","Weather Factors":"None","City":"Las Vegas","Case Number":"23534","files":["/var/www/straped/mufon/html2text/23534.html.txt","/var/www/straped/mufon/org/23534.html"],"Tags":"City","Log Number":"US-05302010-0015","Date of the Event":"05/30/2010 01:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.123606,+-115.165266(23534)&iwloc=A&hl=en\"> mufon case (23534) map </A>","Summary":"A white/Silverish object oval","Object Features":"Undisclosed","Object Shape":"Blimp, Disc, Egg, Star-like","trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around May 30th 2010"],"Sighting Duration":"Undisclosed","Region":"Nevada","Country":"United States","divs":["Sighting DetailsThis is the second time I have seen an object over the Las Vegas Valley. I observered the same type of object about one month ago. I am a former Police Officer. During todays occurance I was sitting on the Southern back deck of where I live with a clear view of the Southern sky above about 45degress from ground to sky. I observed a white object moving at slow but consistant pace toward the west at an unknown altitude and it seemed to flow the basic flight path of flights leaving from McCarren Airport. However its pace was a lot slower than the planes that I could clearly see leaving the area. The object changed direction at a full ninety degree turn and proceeded north. That's when I took notice of it really. I watched it come toward the north, stop and then go west and then came to complete stop for about five minutes. I used a Telephone pole as a guide of movement. It then darted south and stopped. Another white object streaked throught the sky a little way west from the stationary object. That object stayed there until I came inside to find somewhere to report it."],"Viewing Distance":"Unknown","Date Submitted":"05/30/2010 05:19 UTC","Source":"MUFON","Disposition":"Insufficient Data"}