{"Region":"Newfoundland and Lab","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=47.622837,+-52.734541(23536)&iwloc=A&hl=en\"> mufon case (23536) map </A>","trends":["There have been 2 other sightings in St John's","There were no other sightings in St John's on or around May 1st 2010"],"files":["/var/www/straped/mufon/html2text/23536.html.txt","/var/www/straped/mufon/org/23536.html"],"Case Number":"23536","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["Sighting Detailsthe little guy was green and about 3 feet tall, he seemed older. the female was taller and green as well. this happened a month or so after another dream I had. this one, my father and I were inside a craft, it was hovering above earth and it was nice. I didnt feel threatened. I remember asking a few questions. I must have asked the wrong one because soon as I did, I woke up! Crazy things have been happening to me since the year started! ufo are un identified flying objects so if thats the case then I saw two this year. me and my girl friend were driving from paradise Newfoundland to topsail, around 12 in the day. right in front of us was a prism looking object. it looked silver or quartz, it was hard to tell. but It didnt move like a plane or helicopter and it slowly dissapeared in the direction we were going. a few nights ago, I was on my way home and I saw what looked like the north star, very close to the moon. that alone was suspicious, because for one, the north star is usually to my right, not my left, seccond, it was cloudy, you couldnt see any stars and the moon was barely visible. I was blinking lights on teh front, and it manouvered to the right and back to hte left as I passed under it. It seems like ever since I got interested in ufo's I started having these werid feelings, crazy dreams and now these two sightings. I hear topsail is the ufo capital of newfoundland. I duno how much truth is to that but if that is the case I beleive it. I dont want you to think im making this up because that is the last thing I have time for. I just checked out your sight and saw u had a ufo report and thought id share my experieces with you! In my opinion. they have been here since the begining of time. they've always been here, back and fourth. we have an amazing planet. why wouldnt they like it here!"],"Log Number":"CA-05302010-0017","Sighting Duration":"00:10:00","Latitude":"47.622837","Object Flight Path":"Path with directional change","Date of the Event":"05/01/2010 12:00 UTC","City":"St John's","Weather Factors":"Unknown","Summary":"drempt a short green lizard looking man walked downstairs holding my mothers hand. next thing I remember, im on my back and a larger female looking creature was standing above me. I think they were taking samples or using my sperm.","Longitude":"-52.734541","Disposition":"Unresolved","Tags":"City","Object Shape":"Diamond, Disc, Oval, Triangle, Other","Object Features":"Undisclosed","Date Submitted":"05/30/2010 06:17 UTC"}