{"City":"Rockledge","Weather Factors":"Windy","divs":["Sighting DetailsAt around 10pm my husband and I were outside talking when I noticed a blue shaped orb in the sky. I generally look at the night time sky and anything that is sizable I look at it closely. At first glance I thought it would be an airplane, but it didn't have the normal side blinking lights. I was looking at the object for some time noticing it's odd blue color that was about the size of a planet. It was in the ENE sky and I hadn't been noticing any planets in that direction for the past few nights. Upon closer inspection my husband and I noticed that there were several blinking lights shooting around it. The colors of the lights ranged from blue to green to red. When we looked around the rest of the sky we could see it was happening in our entire viewing area, It also looked like there were faint lines connecting dots in the sky. I had a third party view the sky to make sure that we were really seeing something and that person noticed said phenomena too. The orb seemed to float in the area. It didn't stay fixed, but it had a very fluid movement about it. When we went inside the phenomena was still happening. We were a little unnerved and decided to stay inside and report it. It had an oddly appealing feeling and made us want to watch, but like I said we ended up feeling a little unnerved. When we went in side the object was still there."],"Date of the Event":"05/30/2010 10:00 UTC","Viewing Distance":"Unknown","Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/23540.html.txt","/var/www/straped/mufon/org/23540.html"],"Object Features":"Unknown","Summary":"Flashing UFO","Longitude":"-80.724466","Source":"MUFON","Tags":"City","Case Number":"23540","map":"<A HREF = \"http://maps.google.com/maps?q=28.329678,+-80.724466(23540)&iwloc=A&hl=en\"> mufon case (23540) map </A>","Latitude":"28.329678","Date Submitted":"05/30/2010 10:26 UTC","Disposition":"Insufficient Data","trends":["There have been 9 other sightings in Rockledge","There were no other sightings in Rockledge on or around May 30th 2010"],"Country":"United States","Object Flight Path":"Other","Region":"Florida","Log Number":"US-05302010-0021","Object Shape":"Circle, Flash, Sphere"}