{"files":["/var/www/straped/mufon/html2text/23542.html.txt","/var/www/straped/mufon/org/23542.html"],"Object Features":"None","Country":"United States","Disposition":"IFO","Region":"Arizona","Summary":"Appearing and disappearing small, changing colors, bright object..","Object Flight Path":"Unknown","Object Shape":"Sphere","Source":"MUFON","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around May 29th 2010","This sighting has never been favorited.",""],"Latitude":"33.452407","Sighting Duration":"00:00:02","Log Number":"US-05312010-0002","Tags":"City","City":"Phoenix","Viewing Distance":"Unknown","Date of the Event":"05/29/2010 12:32 UTC","Weather Factors":"Windy, Light","map":"<A HREF = \"http://maps.google.com/maps?q=33.452407,+-112.068567(23542)&iwloc=A&hl=en\"> mufon case (23542) map </A>","Case Number":"23542","Longitude":"-112.068567","divs":["Sighting DetailsMay 29, 2010 In Mesa, AZ around 12:30 PM, I was on the computer when I glanced at the window and saw in the sky a small and round unknown object that appeared to be light orange in color that quickly changed to a dull white color which instantly disappeared. The sighting was very brief of about 1 or 2 seconds, and it also seemed as if it moved very fast a short distant possibly a meter or less. I took 1 blind picture through the tinted, screened window where the object was once located. I then went outside to located the object but with no success. I then auto-focus on a distant palm tree then switched to manual focus. I then proceeded to take several random pictures of the general area of the sky where the unknown object was once seen. 2 pictures taken outside shows an unknown object that match identically in size (but not in color) to the 1 unknown object picture taken inside the house. I also caught other unknown objects in the random pictures which I am presuming those black unknown objects to be birds flying in the sky. Then at 1:15 PM, I saw a balloon drifting in the wind when I looked out the window, and I decided to take some pictures of the white balloon. While taking some pictures of a white balloon that was drifting with the wind, I saw several pea size white objects that zip through the picture frame viewing area traveling what seems to be across the wind. I followed 1 object with my camera taking pictures of it which I quickly begin to realize that unknown object was actually traveling with the wind. Seeing earlier a huge dandelion seed mass floating in the wind and getting pictures of it, I suspected that small white unknown objects seen with the balloon may possibly be the dandelion seed mass floating in the wind. However, some of the pictures of the unknown object has some similarities to the globe UFO thereby makes this sighting undecided in identification of the unknown object . From what I seen in the past when viewing a dandelion's fluffy seed mass floating in the wind, it can appear bright white at a far distant which therefore may also be possibly mistaken for an UFO when seen moving in the air at a far distant."],"Date Submitted":"05/31/2010 04:00 UTC"}