{"City":"Oxnard","Region":"California","Tags":"City","Object Features":"Unknown","Source":"MUFON","Date of the Event":"05/30/2010 11:35 UTC","Object Shape":"Circle, Disc","Summary":"Bright yellow-orange disc hovered above for about 2 min..","Sighting Duration":"Undisclosed","trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around May 30th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Latitude":"34.206105","Weather Factors":"Unknown","Log Number":"US-05312010-0003","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"23543","Disposition":"IFO","Country":"United States","files":["/var/www/straped/mufon/html2text/23543.html.txt","/var/www/straped/mufon/more/23543_submitter_file1__2010-05-30-23.36.20_ufo.jpg","/var/www/straped/mufon/more/23543_submitter_file2__0530002335UFO.jpg","/var/www/straped/mufon/org/23543.html"],"Date Submitted":"05/31/2010 06:16 UTC","Longitude":"-119.170352","map":"<A HREF = \"http://maps.google.com/maps?q=34.206105,+-119.170352(23543)&iwloc=A&hl=en\"> mufon case (23543) map </A>","divs":["Sighting DetailsDriving home from late show at movies at 11:35 p.m. suddenly caught sight of bright lights though passenger side front window. At first thought it was reflection of street lamps, but it quickly became apparent it wasn't. I pulled over and asked my wife to verify what I was seeing. My wife, I and our 3 kids all got out of the car to observe what was clearly a bright yellow translucent disc hovering above and moving slowly across the sky. It moved smoothly with a glowing halo around it. It was incredibly bright. I excitedly tried to take the photo with a digital SLR but it was not able to adjust the aperature quickly enough so I got a shot with my camera phone (attached). My daughter also caught a picture with her cell phone. While I have always been open-minded to the possiblity of alien visitations, I have always maintained a healthy degree of skepticism. However, in this case, I truly am convinced that this was an object encounter not of this world. My wife and kids were also impressed."]}