{"Sighting Duration":"00:05:00","Log Number":"","Viewing Distance":"101-500 Feet","Summary":"Triangle near Tucson, AZ","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.225973,+-110.923879(2354)&iwloc=A&hl=en\"> mufon case (2354) map </A>","Date Submitted":"06/10/2003 09:20 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2354.html.txt","/var/www/straped/mufon/org/2354.html"],"City":"Tucson","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around June 10th 2003"],"Object Flight Path":"Unknown","Source":"MUFON","Region":"Arizona","Longitude":"-110.923879","divs":["Sighting DetailsMy wife and I were driving west on I-10 in Tucson about 920 or so. On the right,between I-10 and the mountain, we saw a military jet take off almost straight upwith afterburners Davis-Monthan AFB is there. I thought that was odd, because ofthe noise factor in a suburb. About 45 minutes later, near Picacho Peak, we sawa red steady light about a mile in front of us. We thought it was the beaconlight on a radio tower. As we neared it, we also saw a blue light, to the rightof the red one. When it was almost overhead we saw the white light. There was notower. Sherry was yelling to pull over, but cars were on my tail. I lost sightin the windshield, but Sherry hung out the window as we passed under it. She sawa black triangle shape connecting the lights, not the wings and fuselage of aplane. There was no noise other than the wind through the open window. If it wasnot hovering, it was flying extremely slow. It was 200-300 feet up. We got offI-10 at the next exit, 212, and doubled back on the service road. But we couldnot see it again. The next morning at the motel in Phoenix, Sherry caught thetail end of a news report on TV about a military jet crashing in Phoenix. Awaitress had not heard about the crash, but told us of heavy helicopter activitynear her home during the night."],"Date of the Event":"06/10/2003 09:20 UTC","Country":"United States","Case Number":"2354","Latitude":"32.225973"}