{"trends":["There have been 5 other sightings in Hinesville","There were no other sightings in Hinesville on or around December 31st 2009"],"City":"Hinesville","Summary":"We were sitting outside smoking and we saw a large amber colered sphere of light was slowly traveling over our neighbor hood.","Case Number":"23549","Sighting Duration":"Undisclosed","Log Number":"US-05312010-0009","Longitude":"-81.593345","Date of the Event":"12/31/2009 09:10 UTC","Disposition":"Insufficient Data","Latitude":"31.851237","Object Features":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"05/31/2010 12:55 UTC","Region":"Georgia","files":["/var/www/straped/mufon/html2text/23549.html.txt","/var/www/straped/mufon/org/23549.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.851237,+-81.593345(23549)&iwloc=A&hl=en\"> mufon case (23549) map </A>","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Tags":"City","divs":["Sighting DetailsMy wife and i tend to step out side and smoke and look at the stars.Since i have a background in astrology and astrophysics I always point out the constilations and planets and satellites to her. On this paticular night it was very cold and the skies were clear and is i was showing here venus and polaris she asked me \"what that star was\" As I lookes I was astonished to not know it seemed stationary at first but we noticed it was getting brighter. It had a spherical shape and was an amber color and was a constant brightness.I thought it may have been a helicopter at first since we live next to fort stewart georgia and hunter army air field is not that far away. i myself am in the military and now how to identify each at night time. besides there were air planes that flew behind it as if it wasnt even there and thats how we new it was a point of origin fro space but actually flying towards us. it mad now sounds and then occasionally flew up and down fast. i tried to video tape the object it wouldnt show up on the screen the closer i zoomed in the more distorted it got. From what we could tell with the airplanes and helicopters flying by it it looked about triple the size of any conventinal air craft.We went back inside to see if it was just us or an annomaly. we came back outside at 2200 and 2300 and it was still outside but closer and doing the same irratic movements. We never lost sight of the object but after 3 hours of watching we decided to go to bed since it didnt appear to be threatening. i got up to use the restroom around 0315 the next morning and looked outside and the object was gone."],"Object Shape":"Sphere"}