{"Summary":"S-Shaped silver blimp-like object in sky floating/moving over the Stephenville park moving with jerking movements as if mechanically operated.","Weather Factors":"Windy","Date of the Event":"08/25/2007 06:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.225296,+-98.195753(23556)&iwloc=A&hl=en\"> mufon case (23556) map </A>","Case Number":"23556","Region":"Texas","files":["/var/www/straped/mufon/html2text/23556.html.txt","/var/www/straped/mufon/org/23556.html"],"Source":"MUFON","Latitude":"32.225296","Date Submitted":"05/31/2010 05:23 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","trends":["There have been 74 other sightings in Stephenville","There was one other sighting in Stephenville on or around August 25th 2007","This sighting has never been favorited.",""],"Longitude":"-98.195753","divs":["Sighting DetailsOn August 25, 2007, I was attending a birthday party for my 3 year old grandson at the Stephenville City Park in Stephenville, Texas. I would occasionally look up at the sky because there was an approaching thunderstorm headed our way from the North West. As I was scanning the sky, I noticed, off to the east, what appeared to be a floating object, possibly an advertisment banner, but there was no airplane pulling the banner. It was headed in our direction and the closer it got, I was able to get a better view. At this time, I asked my son to record the object on his camcorder. He zoomed in on the object and we were able to record at least 45-47 seconds, and then my son quit recording because his battery was low and he wanted to save the battery to record the birthday party. I pointed the object out to others around me and no one knew what it was, nor had anyone ever seen anything like it before. The object was in the shape of a long blimp, but it was not a blimp-it was moving as if it was floating ever so slowly towards the West. As it floated, it changed shapes with jerking movements, it swayed back and forth, sideways, and up and down. It was clearly mechanical movements that our government could only wish they had. The object and its movements were totally out of this world. This continued with jerking movements which seemed to follow the swaying, S-shape, back and forth, sideways, then up and down again until it was out of sight. Once the object was out of sight, I took my grandson over to the playground. All of a sudden, out of nowhere, there was a man sitting on a bench next to the playground. The man appeared to be staring through me. I strongly felt like he was either reading me or implanting me, or both, so much so that the hair on my neck stood straight up. I turned for a split second to grab my grandson and turned back to look at the man, but he was gone. I could see for at least 100 yards around me and the man was nowhere to be found. By the time I walked back to the picnic table, I had severe flu-like symptoms. I told my wife we needed to get home. We drove 30 minutes to Comanche. As soon as I got home, I laid down on my bed. I was very dizzy, I had stomach cramps, diarhea, chills, and sweating. I fell asleep for only 5 minutes, but it seemed like 8 hours. I then woke up feeling great as if nothing was wrong with me. I have, since then, had many dreams of UFOs, aliens attacking Earth. I have also had many UFO sightings since then. I have attempted to attach the video which contains the 45 seconds of the object-please view."],"Object Shape":"Blimp","Disposition":"IFO","Sighting Duration":"00:00:47","Log Number":"US-05312010-0016","City":"Stephenville","Object Flight Path":"Straight-line path","Country":"United States"}