{"Tags":"City","Weather Factors":"None","Country":"United States","Log Number":"US-05312010-0010","Date of the Event":"05/29/2010 10:00 UTC","Date Submitted":"05/31/2010 01:55 UTC","Object Shape":"Sphere","Longitude":"-81.586245","Latitude":"31.849877","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=31.849877,+-81.586245(23550)&iwloc=A&hl=en\"> mufon case (23550) map </A>","Case Number":"23550","files":["/var/www/straped/mufon/html2text/23550.html.txt","/var/www/straped/mufon/org/23550.html"],"Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","Object Flight Path":"Path with directional change","trends":["There have been 5 other sightings in Hinesville","There were no other sightings in Hinesville on or around May 29th 2010"],"divs":["Sighting DetailsEvery night since we saw the amber colored light in the sky we go outside before bed time and look at the stars and smoke to see if we see something else and like clock work about every three days or so and sometimes night to night we see a strange wight or some times yellow colored sphere shaped object darts across the sky this time they are not as close to the ground as our first sighting. Most of the time we will see the light as it flies toward the house like it is descending and then all of a sudden it will drift back upwards and out of the atmosphere. it even sometimes just darts upwards and dissapears. the one we saw two nights ago we were tracking a satalite and then my wife spotted a bright white light that she thought was a star moving around the ursa minor stars near Kocab. it then vanished and about 1 minute later we spotted it again and then it bursted a bright white light as if it was a meteor burning up in the atmosphere for like 2 seconds and then faded into a dim ball and instead of descending like a meteor it started to drift upward until the light got so small it dissappeard into the ursa major stars near Dubhe. we were realy excited as we have been seeing strange lights for a while but not with the capabilities of this one. we are going to continue to look when the weather clears up and try to video tape it."],"Summary":"Out side smoking again with my wife and from january til March 29 2010 we have seen strange lights and flight paths.","City":"Hinesville","Object Features":"Undisclosed"}