{"Longitude":"-97.510558","Object Shape":"Fireball, Star-like, Teardrop","Date Submitted":"05/31/2010 09:02 UTC","Object Flight Path":"Undisclosed","Log Number":"US-05312010-0024","Date of the Event":"05/31/2010 01:40 UTC","Weather Factors":"Unknown","Case Number":"23565","City":"Oklahoma City","Disposition":"IFO","Tags":"City","files":["/var/www/straped/mufon/html2text/23565.html.txt","/var/www/straped/mufon/org/23565.html"],"Summary":"Comet-like object seen over residential area near May Ave and NW 50 in the early morning","Sighting Duration":"Undisclosed","Latitude":"35.46861","Country":"United States","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.46861,+-97.510558(23565)&iwloc=A&hl=en\"> mufon case (23565) map </A>","trends":["There have been 78 other sightings in Oklahoma City","There was one other sighting in Oklahoma City on or around May 31st 2010"],"Source":"MUFON","divs":["Sighting Details A group of friends and myself were sitting outside during a late night Memorial Day BBQ when we noticed an object in the sky. Earlier that evening, several thunderstorm fronts had passed over the neighborhood. The sky was sparsely populated with clouds at the time of the sighting and the moon appeared in the south. We were sitting in the backyard and I noticed something catch my eye. I got the attention of my friends who were sitting next to me as I pointed at the sky and asked what the object was. The object appeared to be 40-50 feet above the ground and just above the trees in the backyard. It was moving north and appeared to be curving towards the ground. The speed was not blindingly fast, but was quick enough to move out of our view of sight within 4 seconds. The object appeared to made of light, like a comet, but didn't emit light like a lantern or lamp. There was no sound. The tail end of the object resembled the trail of a comet; the color at the end was orange. One of the witnesses said the orange tail of the object was shaped like a triangle. After the object had passed from our view, only four of us outside had actually seen the object. This report is pieced together from our brief discussion concerning what we had witnessed. The object resembled what I imagine a low flying shooting star would look like."],"Viewing Distance":"Unknown","Object Features":"Undisclosed"}