{"map":"<A HREF = \"http://maps.google.com/maps?q=35.077734,+-85.053293(23569)&iwloc=A&hl=en\"> mufon case (23569) map </A>","Weather Factors":"Unknown","Tags":"City","Log Number":"US-05312010-0028","Region":"Tennessee","Sighting Duration":"01:00:00","Date of the Event":"05/31/2010 10:20 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Boomerang, Sphere, Star-like, Triangle, Other","Disposition":"Unknown","trends":["There have been 2 other sightings in Ooltewah","There were no other sightings in Ooltewah on or around May 31st 2010"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Summary":"Saw Several UFOs Jet Across the Sky at High Speeds","Date Submitted":"05/31/2010 11:56 UTC","Object Features":"Unknown","Longitude":"-85.053293","Country":"United States","Case Number":"23569","Latitude":"35.077734","Source":"MUFON","divs":["Sighting DetailsWe received a call from a friend to look outside at some odd objects in the sky. We (my friend and I) went outside to look, but we couldn't see anything, so we drove out to where our friend was. On the way we noticed the object he was talking about. It was amber colored and somewhat star-like with two lights on the side and eight small lights flashing around them in a circular formation. Upon arriving at our friend's location, we noticed a large star-like object that was NOT the one we had seen before. It had lights at the bottom and two beaming lights on the side. It quickly vanished. Afterward, we noticed several more, approximately 6, star-like objects with flashing lights. Two of which we could barely make out the actual ship body, which was triangular. As we were leaving and they had vanished, we noticed a massive white-blue light appear in the sky, seemingly out of nowhere, and it began advancing toward us at high speeds. As it was directly over us, it was silent and then turned on some sound-cloaking device that was pseudo-plane-like. It had two blue lights at the side of it and its central light, which was white, cast an aura over the object. It hastily made its way across the sky toward the original object's destination. The body of the object was sort of crescent-like, but at the same time boomerang-ish."],"files":["/var/www/straped/mufon/html2text/23569.html.txt","/var/www/straped/mufon/org/23569.html"],"City":"Ooltewah"}