{"Tags":"City","Region":"California","Date Submitted":"06/01/2010 03:09 UTC","files":["/var/www/straped/mufon/html2text/23571.html.txt","/var/www/straped/mufon/org/23571.html"],"Viewing Distance":"Unknown","Object Shape":"Saturn-like, Star-like","Latitude":"39.516605","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Oroville","Summary":"Oddly deep red star stands still, starts moving, mimicking airplane but not quite.","Object Features":"Unknown","Case Number":"23571","map":"<A HREF = \"http://maps.google.com/maps?q=39.516605,+-121.554889(23571)&iwloc=A&hl=en\"> mufon case (23571) map </A>","divs":["Sighting DetailsI was outside checking my towels on the line at around 11pm on May 31 '10 to see if they were dry. I usually look at the stars to see if I can spot a planet when a deep red star caught my eye. It was the only thing visible in the sky and I thought to myself \"that is way too red to be a planet\". I'd never seen anything so red in the sky, it almost made me afraid. All of a sudden, it started moving slowly, taking the path the airplanes do around my house. I watch them when I'm out at night, but this one was different. It's blinking seemed to try and mimic the airplanes, but it was round and moved differently. I always see planes blinking from the bottom, but all of it was flashing. It's like it was trying really hard to move slowly and blink at the right times, it's hard to explain. I followed it until it was out of my sight. I know it wasn't an airplane because it stood still in the air for ten to fifteen seconds not \"signaling\", just a deep red. It was hypnotizing. I lost sight of it because my neighbor's trees got in the way. I now am on Mufon writing down my \"sighting\". It was just about two minutes, I didn't have a camera on me, and I was confused. Society makes you feel wrong for seeing one so maybe I'm trying to convince myself I didn't see what I saw. I've had a legitimate sighting before when I was around 12 in the early 2000's so I'm not as choked up as one would be. It's a little upsetting that it happened again, I just feel uncomfortable and nervous and wish I hadn't seen anything. Anyway, thank you for your time. PS, My brother was riding home from a friend's house and told me after I told him what I saw tonight that he noticed a bright light in the sky that didn't seem to belong there. Don't know if this helps, it could have been the same thing I saw, we're both good at spotting planets and airplanes and he said it didn't look like either. Just thought I'd add that in."],"Object Flight Path":"Stationary,Hovering then path","Source":"MUFON","trends":["There have been 4 other sightings in Oroville","There were no other sightings in Oroville on or around March 31st 2010"],"Longitude":"-121.554889","Weather Factors":"Unknown","Date of the Event":"03/31/2010 11:00 UTC","Log Number":"US-06012010-0002"}