{"Date of the Event":"05/28/2010 12:00 UTC","Date Submitted":"06/01/2010 11:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.805731,+-87.946114(23574)&iwloc=A&hl=en\"> mufon case (23574) map </A>","Case Number":"23574","Longitude":"-87.946114","Region":"Illinois","Object Features":"Undisclosed","Tags":"City","Latitude":"41.805731","Log Number":"US-06012010-0005","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/23574.html.txt","/var/www/straped/mufon/org/23574.html"],"City":"Clarendon Hills","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Base ship with smaller craft flying around DuPage and Cook County","Country":"United States","divs":["Sighting DetailsThe first object spotted was the smaller craft. I would say it was about the size of 3-4 Ford Explorers. It had four distinct lights: 3 red in a row along a leading edge and 1 green. I first observed this object moving in different directions in the night sky. Changing directions and altitudes. Then a larger object appeared that was lit underneath with white lights but I could not determine the size of this object other than to say it was large. These two objects at time flew separately and at times in formation. At one time both disappeared from sight going east. After about 15 minutes the larger object appeared in the west going east. As I followed it going toward the lake I witnessed the smaller object detaching from the larger object and going to the northwest. The next night, Saturday, these two objects appeared again. The smaller of the two was the most visible over time. At one time in the observation the smaller object appeared to be hovering over Schaumberg (a guess) and from where I was it was a small dot and appeared to be oscillating from red to green. Near the end of the viewing on Saturday I got my best look at the smaller vehicle as it passed from the west to the east in front of me. The smaller one was behind the bigger object seeming to be flying in formation. As they headed east the smaller one got closer and closer to the larger object and at one point either docked or was taken aboard or something of that nature as there no longer was two objects but just the larger one. It continued east until it was out of site. It appeared to me that what I saw was a base ship that launched a smaller vehicle to move about a region and then dock to move unto some other location."],"Source":"MUFON","trends":["There have been 3 other sightings in Clarendon Hills","There were no other sightings in Clarendon Hills on or around May 28th 2010"],"Object Flight Path":"Path with directional change,Path then hovering","Object Shape":"Boomerang","Disposition":"Unknown"}