{"Longitude":"-81.694119","divs":["Sighting DetailsDriving my kids home from a school function Friday afternoon approx. 3:30 pm. Driving on a side street going home I looked up and right above the trees I saw a black triangle shaped object kind of floating above the trees. At first I thought it to be a kite or balloon but it was odd in movement and in shape, as I continued to drive the object was going in our direction. I said what is that do you see that?? My kids were kind of freaked out by it. At the corner of my street is a factory with a 4-5 story high chimney, this object went around the chimney and kinda started hovering by the tree line. I had my camera with us for the school event and so I started snapping pictures. It started to move away from where we were parked, so we got in the car and started chasing it. We followed it down a street of industrial factories, and I pulled into a lot with a clear view of where this thing was \"hovering\" I got out the car and snapped a few more pics and tried to take video of it. I called a few of the workers over who were looking at me like I was crazy and wondering what I was doing there, until I showed them the object in the sky. They were all looking at the object and wondering exactly what it was we were looking at fly slowly across the sky. It stopped and seemed to be hovering over a shopping plaza, and I got my kids back in the car and tried to chase it down by time I got to the shopping plaza, (which is only a five minute drive from where we were at) It was long gone. Very weird, my daughter and I both though we saw it slightly change shape and it was very odd. Never ever saw anything like this before ever!!!"],"Summary":"black solid small 3 d shaped triangle looked as if it changed from triangle to pyramid","Object Flight Path":"Hovering then path,Path then hovering","trends":["There have been 47 other sightings in Cleveland","There were 2 other sightings in Cleveland on or around May 28th 2010","This sighting has never been favorited.",""],"City":"Cleveland","map":"<A HREF = \"http://maps.google.com/maps?q=41.506175,+-81.694119(23579)&iwloc=A&hl=en\"> mufon case (23579) map </A>","Latitude":"41.506175","Disposition":"Unknown","Weather Factors":"Unknown","Log Number":"US-06012010-0010","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"None","Date of the Event":"05/28/2010 03:30 UTC","Country":"United States","Region":"Ohio","Case Number":"23579","Date Submitted":"06/01/2010 09:12 UTC","Viewing Distance":"21-100 Feet","Source":"MUFON","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/23579.html.txt","/var/www/straped/mufon/more/23579_submitter_file1__100_2729.JPG","/var/www/straped/mufon/more/23579_submitter_file2__100_2728zoom.jpg","/var/www/straped/mufon/more/23579_submitter_file3__100_2727.JPG","/var/www/straped/mufon/org/23579.html"]}