{"Country":"United States","Viewing Distance":"Unknown","Weather Factors":"Windy, Snow","trends":["There has been one other sighting in Yukon","There were no other sightings in Yukon on or around January 31st 1950"],"Case Number":"2357","Object Shape":"Unknown","Date Submitted":"01/31/1950 12:00 UTC","Region":"Yukon","Log Number":"","Object Features":"Undisclosed","Longitude":"-97.753634","Tags":"City","files":["/var/www/straped/mufon/html2text/2357.html.txt","/var/www/straped/mufon/org/2357.html"],"Object Flight Path":"Unknown","City":"Yukon","Date of the Event":"01/31/1950 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsThe story happened in 1950 , the second Tuesday of February near Yellow knife inthe Canadian Yukon District. My aging parents have given me a tape that wastaped in 1968 by the witness. He was dying of cancer he said and wanted to tellhis story before he died. He had spent the last 18 years afraid of theconsequences of telling his story. He felt they were monitoring him and playingwith his memory. My parents too were afraid to do anything with the tapes. Butnow it is up to me to tell the story before my parents are both dead. Dad isdying right now. Mom is in a home but doing well.This is an up close encounter. Five men showed up on his door step . And afterhe got over the fact that they were green head and neck with baby hands hesettled down to accompany them in his own home through to Friday morning. Otherthan a jaw bone attachment TMJ that is different than us they looked like usexcept with evidence of pockmarked skin and in one instance of scarred facialtissue and ears. They wore earthy clothes though. It was 56 degrees below zeroand they had some kind of quickly put together suit of a fabric that looked likeit came from an old car aphostery. Jacket, with and invisible and soundlesszipper pants pull on and boot with some metal attached that they wouldactivate by touching...perhaps foot warmersThey came in smelling like a burned out motor. With boxes of equipment to becalibrated. They had a magnifying loops on their heads with devices that theypulled down to help them work on the devices. Almost like computerizedschematics. One had contact lenses. called bug eye They all had dentures. Oddhuh Anyway there is a lot more information on this tape. INterested I am lookingfor a screen play writer. I am not shy to say I think we have a dollar makerhere. Thanks Vivian"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.512182,+-97.753634(2357)&iwloc=A&hl=en\"> mufon case (2357) map </A>","Sighting Duration":"01:59:00","Disposition":"Unresolved","Summary":"1950 visit near Yellow Knife","Latitude":"35.512182"}