{"Object Flight Path":"Path with directional change","Country":"United States","Latitude":"35.05199","Date Submitted":"06/01/2010 12:17 UTC","Summary":"Diamond and Triangle UFOs seen crossing paths","Object Features":"Unknown","Tags":"City","Object Shape":"Diamond, Triangle","Weather Factors":"Unknown","trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around May 28th 2010"],"City":"Chattanooga","Disposition":"Unknown","Date of the Event":"05/28/2010 10:15 UTC","Log Number":"US-06012010-0006","files":["/var/www/straped/mufon/html2text/23575.html.txt","/var/www/straped/mufon/org/23575.html"],"Case Number":"23575","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.05199,+-85.3007(23575)&iwloc=A&hl=en\"> mufon case (23575) map </A>","divs":["Sighting DetailsOn the night of Friday, May 28, I was scheduled to play in a friend's band in Chattanooga, TN. The show was scheduled for about 10 pm, so we decided to get together for a practice beforehand. We met, practiced, and as we were leaving I looked at my watch, which said 10:08 (we were late). There were a total of 5 of us, but we traveled in two cars to carry the equipment. Three in one car, two in another. I was in the car of three, and as were were driving south down North Market St. in Chattanooga, I looked out the left passenger window to see if it might look like rain and noticed something unusual. There were three lights in a perfectly triangular arrangement. The rear two were bright white with hints of yellow, and the front light was red. It seemed to be at about the altitude of a normal plane, but seemed to be altering its course somewhat, making unusual turns. As it passed over our car, I called attention to it and told my friends to look at out the other window (right side) it as it passed over. We all then looked out the other side, and saw another strange object, this one diamond shaped. It consisted of 4 very bright lights in a diamond formation and was flying quite low--about the level of a search helicopter. My friend immediately pulled over, and we all got out of the car to watch these two objects. Upon first reaction, I thought the object resembled some sort of lantern on fire or an unusual type of fireworks display, but it became clear in seconds that is was neither. The diamond kept gliding and the triangle passed over it, though much higher in th sky. Both objects were completely silent, which was the most chilling aspect, as the diamond was so low to the ground, perhaps just over the treetops. It is difficult to say how large it was, or how to compare it, but I'd say it may have been about like a car turned vertically, floating in the air. As they kept moving, their orientation must have changed or certain lights must have gone out, because the diamond at one point suddenly became two very bright lights side-by-side and began rising in altitude. Though it was dark, I knew the general direction it was heading and it appeared to be going toward Signal Mountain, about 10-15 miles away. The triangle continued to travel as well, and as it continued, the two whitish back lights disappeared and only the front red light remained visible as it traveled away from us. I suppose it is possible that it could have been a red tail light of some sort? Both objects eventually disappeared, the diamond rising constantly in elevation until they were out of sight. The three of us stood there in disbelief, and for the remainder of the evening, none of us could shake the images. We told numerous people once we reached the club and their reactions have prompted me to make this report (the first I have ever made). This was certainly the most unusual thing I have ever seen and never seen anything that even resembled either object."],"Region":"Tennessee","Viewing Distance":"101-500 Feet","Longitude":"-85.3007","Source":"MUFON"}