{"Object Shape":"Fireball, Sphere, Star-like","Log Number":"US-06012010-0008","Object Features":"Patterned Surface","Date of the Event":"06/01/2010 12:00 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/23577.html.txt","/var/www/straped/mufon/org/23577.html"],"trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around June 1st 2010"],"divs":["Sighting DetailsI went to bed approx 12:40. My window faces west. I had the blinds closed but a flickering light caught my attention. I went to the window & saw what I thought to be a satellite that looked like a star. I watched it for a while to discern what it was & if it was moving. The object was bright & was far above the tree line. I saw light beam down from the object just below it & a ring of circles of light & then it was back to just the object again. It did this several times. I also saw light radiate from it & lighting up the sky in one direction from the object as if it put on its headlights. Approx 15 minutes went by & the object was just at tree line & then disappeared behind the trees. It moved irradically with quick movements & then just hover. It moved from side to side & up & down. It seemed to move so that it would not be noticeable unless you were watching it. I went & got my binnoculars. I noticed another bright star in the west but higher up. I looked through my binnoculars & saw a yellow sphere & it was spinning in one direction from down to up. As it turned I saw it was covered in brighter yellow circles of light. It was like a burning radiating tiny planet only it was not a natural made object. I could only see this detail with the binnoculars. This moved in the same way but remained in the same general area for the duration of time I watched it. For about a half hour then I went to bed. I've been seeing these objects that I describe as mimicking stars for 20 plus years but I have never seen a spinning yellow light sphere or the detail I saw through binnoculars. It must have been closer then the ones I viewed in the past. I would imagine it is very large up close. I feel disturbed by seeing this up in the night sky as people sleep & wonder what it is & what it is doing. It alarms me that this is taken place covertly. It is obvious to me that our government & the technology we have would detect this & that alarms me that our own world governments remain covert as well. But I was able to just go right to sleep after all this. I thought I wish it wasn't right above my home. I woke up this morning & it was heavy on my mind so I did an internet search & for the first time I am reporting it. It was just incredibly bizarre to see what I saw through binnoculars. Sorry I don't have a camcorder."],"Viewing Distance":"Unknown","Date Submitted":"06/01/2010 01:10 UTC","City":"Westminster","Case Number":"23577","map":"<A HREF = \"http://maps.google.com/maps?q=39.837813,+-105.030315(23577)&iwloc=A&hl=en\"> mufon case (23577) map </A>","Region":"Colorado","Source":"MUFON","Latitude":"39.837813","Longitude":"-105.030315","Summary":"spinning sphere of yellow light hovering & moving","Object Flight Path":"Hovering then path","Disposition":"Unresolved"}