{"Log Number":"US-06012010-0009","Source":"MUFON","divs":["Sighting DetailsFirst silver object was straight up but slightly west, 30-40k ft altitude and stationary, then moed behind clouds. Further NW another object stationary then took off to NW, looked like it was tumbling and flashing; refleting light, not illuminating. Went behind clouds. Third object seen slightly to the north, eventually went into clouds. Then 5 objects appeard slightly to the northeast. much higher, perhaps 60-70k ft altitude. They appeared to be dots of flashing light. Moved off to the north in a formation. Then a ninth object, which looked elongated, seemed to be falling straight down out of the sky, no tumbling motion. Went below the cloud cover and was south of the others. All this over metro, downtown Phoenix: 75th Avenue and Thomas Road. More than myself witnessed this. I called Dr. Lynne Kitei, the employer of my fiance. She then called Stacey Wright and Jim Mann of Phoenix MUFON. Stacey called me back and I reported all the above to her, verbally. I do not have a computer to report this to MUFON, so I gave permission to Stacey to document and report this sighting. (I, Stacey Wright, am the typist here)."],"Disposition":"Unknown","Date Submitted":"06/01/2010 08:22 UTC","Object Features":"Unknown","Country":"United States","Case Number":"23578","City":"Glendale","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around June 1st 2010"],"Object Shape":"Boomerang, Sphere","Weather Factors":"None","Sighting Duration":"Undisclosed","Summary":"9 silver/flashing objects in sky above metro Phoenix","Tags":"City","Object Flight Path":"Other","Viewing Distance":"Over One Mile","Region":"Arizona","files":["/var/www/straped/mufon/html2text/23578.html.txt","/var/www/straped/mufon/org/23578.html"],"Date of the Event":"06/01/2010 01:30 UTC","Latitude":"33.548312","Longitude":"-112.179827","map":"<A HREF = \"http://maps.google.com/maps?q=33.548312,+-112.179827(23578)&iwloc=A&hl=en\"> mufon case (23578) map </A>"}