{"Object Shape":"Oval","Longitude":"-118.239225","Summary":"During return of American space probe, white object followed behind the proble at a disance in the dark sky.","Source":"MUFON","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around November 30th 2007"],"Date of the Event":"11/30/2007 08:00 UTC","Object Features":"None","divs":["Sighting DetailsI had heard that an American spaceprobe would be returning to make a landing in Florida. I went outside to see the spaceprobe as it flew over Los Angeles to the south and towards Florida. As I watched, I saw a round white object of about the same size following the space probe and pacing it. I was surprised and thought I would only be seeing the returning spaceprobe or space rocket in the dark sky. The spaceprobe was very high so the second object might have not been an airplane. In fact, the second white object looked very much like the returning spaceprobe as it paced the returning rocket or spaceprobe returning from space and orbiting the round Earth. The spaceprobe would then fly eastward from the Los Angeles sky area and to the return or home base at Cape Caneveral, Florida. As I recall, the date was probably early 2008. The two objects then sped to the east and disappeared from view. I was standing outside my home on the front lawn at around 8:00 PM during the year 2008. Los Angeles, California. When I heard about the returning spaceprobe, I went outside and stood on the grass and looking towards the south to see the returning spaceprobe announced in the Los Angeles Times newspaper. As I stood watching, I suddenly noticed at a distance a second white object following the returning American spaceprobe and moving at the same speed until the two disappeared and moving towards Florida to the east direction. The thought came to my mind later that perhaps the second 0bject was an airplane pacing the spaceprobe. But the returning spaceprobe would have been very high in the atmosphere. The entire incident was very puzzling and nothing was mentioned later in the Los Angeles Times newspaper about the two objects. I telephoned the Griffith Park Observatory in Los Angeles, and they did not know what the second returning or pacing object was that I saw in the evening sky in early 2008."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.055604,+-118.239225(23587)&iwloc=A&hl=en\"> mufon case (23587) map </A>","Region":"California","Date Submitted":"06/02/2010 12:29 UTC","Tags":"City","Latitude":"34.055604","Viewing Distance":"Over One Mile","Disposition":"Unknown","Log Number":"US-06022010-0007","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"23587","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23587.html.txt","/var/www/straped/mufon/org/23587.html"],"City":"Los Angeles"}