{"Object Features":"None","Region":"Utah","Object Flight Path":"Straight-line path","Log Number":"US-06022010-0002","Viewing Distance":"Over One Mile","Object Shape":"Triangle","Disposition":"Unknown","Date of the Event":"06/20/2002 10:00 UTC","Summary":"A triangular shape crossed the clear night sky with no marking lights and no noise. It blocked out the stars behind it and was only visible because it was slightly lighter than the night sky.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.364118,+-111.73854(23582)&iwloc=A&hl=en\"> mufon case (23582) map </A>","Date Submitted":"06/02/2010 01:25 UTC","Weather Factors":"None","Country":"United States","divs":["Sighting DetailsI was visiting a friends home in Pleasant Grove, Utah. We were just off Main street around 300 south.(Downtown) I don't really know the exact date. I was outside on the front lawn talking to two friends. It was a beautiful clear night and we were looking at the stars and I noticed this shape. I tried to point it out to my friends but they could never find the shape. I looked away several times and was able to find it again fairly easily. Both my friends had complained about their poor eyesight but I had been tested previously and found to have extremely good sight. My first thought was that it was some type of aircraft. I don't know what it was so I will try to be factual from here on. A triangular shape crossed the clear night sky to the east, toward and possibly over, Mount Timpanogos. It had no marking lights and no noise. It blocked out the stars behind it and was only visible because it was slightly lighter than the night sky. It moved at a constant and steady rate of speed and moved in a straight line from south to north until it finally faded from view. Now it is difficult to tell the distance of things at night and when they are dark also. My impression was that it was at a cruising altitude similar to that of an airliner. Mount Timpanogos reaches about 12,000 feet (over a mile high off the valley floor) and I would say this had to be quite a bit higher. Now if this assumption is close to accurate I would say the size of this shape was maybe four times the size of an airliner at that same distance and was moving about three times faster, based on a casual comparison to the planes seen during the daytime. After the object faded from view I made a few suggestions about what it could have been and noted that it had no marking lights. I mentioned that it was traveling in what I thought to be a commercial flight path and I wouldn't think the military would be doing exercises there. It was a curious and interesting side note to the evening."],"City":"Pleasant Grove","Longitude":"-111.73854","files":["/var/www/straped/mufon/html2text/23582.html.txt","/var/www/straped/mufon/org/23582.html"],"Case Number":"23582","Latitude":"40.364118","trends":["There have been 2 other sightings in Pleasant Grove","There were no other sightings in Pleasant Grove on or around June 20th 2002"],"Sighting Duration":"Undisclosed","Tags":"City"}