{"Case Number":"23586","files":["/var/www/straped/mufon/html2text/23586.html.txt","/var/www/straped/mufon/org/23586.html"],"Disposition":"Unknown","City":"Seattle","Tags":"City","Object Shape":"Sphere","Date Submitted":"06/02/2010 11:30 UTC","divs":["Sighting DetailsI was walking through Woodland Park during twilight on about July 4, 1947. At the time, I was a 22-year-old student at the University of Washington in Seattle to the east of Woodland Park. The time was early twilight with a clear sky. For some reason, I happened to look up and saw a white bright oval object dropping down from the twilight atmosphere. The object suddenly made a very sharp 90-degree turn to the horizontal and then sped at high speed south along Puget Sound until it disappeared to the south towards Mount St. Helens. There was no sound, and the object had a round oval shape. I was very surprised at seeing the white object in the twilight sky. Woodland Park was on a high bluff overlooking Puget Sound with the Olympic Mountain Range to the west. This happened soon after the report by pilot Kenneth Arnold of his sighting of nine silvery \"flying saucers\" over Mount Rainier, Washington, June 2q4, 1947. I thought that perhaps this object was one of the nine flying saucers or UFOs seen by Kenneth Arnold on June 24, 1947. On nearby Mount Adams, Washngton, at the same time of 3:00 PM on June 24, 1947, prospector Fred Johnson said he also saw some of the same nine saucers seen by Kenneth Arnold over Mount Rainier. During this same time period, other witnesses saw the UFOs over Seattle and Frank Ryman took a photo of a saucer over the Seattle area on July 4, 1947. The Kenneth Arnold June 24, 1947, sighting is described in the 1952 book by Kenneth Arnold and Raymond Palmer, THE COMING OF THE SAUCERS. The book also described the nine flying saucers seen by United Airlines pilots E.J. Smith and Ralph Stevens and stewardess Martie Morrow while they were flying near Boise, Idaho, July 4, 1947. Over the years, I puzzled over my Seattle sighting on about July 4, 1947, and wondered if the bright white object could have been one of the nine flying saucers seen by pilot Kenneth Arnold and prospector Fred Johnson on June 24, 1947, and by Smith and Stevens and Morrow on July 4, 1947."],"Source":"MUFON","Country":"United States","Viewing Distance":"Over One Mile","Latitude":"47.61295","Weather Factors":"None","Date of the Event":"07/04/1947 07:00 UTC","trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around July 4th 1947"],"Sighting Duration":"Undisclosed","Longitude":"-122.322921","Log Number":"US-06022010-0006","Summary":"In Woodland Park, I looked up and saw a bright object dropping down from the twilight sky..","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.61295,+-122.322921(23586)&iwloc=A&hl=en\"> mufon case (23586) map </A>","Region":"Washington","Object Flight Path":"Path with directional change"}