{"files":["/var/www/straped/mufon/html2text/23599.html.txt","/var/www/straped/mufon/org/23599.html"],"Summary":"While putting out trash on the night of May 27, 2010 shortly after 10 P.M. my wife and I noticed a large unusual ball of white light hovering over Capri Pass to the northwest of us.","trends":["There have been 5 other sightings in Marco Island","There was one other sighting in Marco Island on or around May 27th 2010"],"Region":"Florida","Log Number":"US-06032010-0002","Object Shape":"Circle, Oval, Saturn-like","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"05/27/2010 10:15 UTC","City":"Marco Island","Longitude":"-81.706962","Weather Factors":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=25.950006,+-81.706962(23599)&iwloc=A&hl=en\"> mufon case (23599) map </A>","Country":"United States","Latitude":"25.950006","divs":["Sighting DetailsShortly after 10 P.M. on Wednesday night, May 27, my wife and I were putting the trash cans out to the street when we noticed an unusual large round large and bright whitish objcet hovering over Capri Pass off to the northwest of our house. We got out our binoculars and watched it for about fifteen minutes. We then called our neighbors on W. Pago Pago and asked them to go out and see if they could see what we were watching. It was round and about 3 times the size of the moon. It had colored lights that pulsed horizontally around it in horizontal lines. It had white lights running up and down vertically, and also seemed to have white spheres jutting off it going up and down. It was somewhat transparent too. There appeared to be two objects at times that moved slightly apart and then close together. There was no noise. It did not resemble any kind of aircraft or derigible. It dropped down lower for a short time, then moved sideways for a quick dart. With the binoculars it seemed like you could see inside of it. It finally backed up and disappeard at about 11:15 p.m. We took a digital photo, but our camera was not strong enough to capture a clear image. Our neighbors on W. Pago Pago watched it with us for awhile. We all saw the exact same thing as we comared discriptions while watching it through binoculars."],"Case Number":"23599","Date Submitted":"06/03/2010 09:55 UTC","Disposition":"Unknown","Sighting Duration":"01:15:00","Viewing Distance":"101-500 Feet","Source":"MUFON","Tags":"City"}