{"Country":"United States","Tags":"City","Case Number":"23598","Summary":"Only venus shining in west, bright star like object moves slow from SE to overhead and stop and seems to be star.","map":"<A HREF = \"http://maps.google.com/maps?q=33.3136,+-111.83405(23598)&iwloc=A&hl=en\"> mufon case (23598) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around June 2nd 2010"],"Longitude":"-111.83405","divs":["Sighting DetailsI actually went out to look for UFO's after reading a Tucson report the other day. Tonight just after sunset Venus only star really visible...low in the west. A bright slow moving light on the eastern (and a bit south) horizon (about 15-20 degrees above horizon) moved west and north - toward my location. It traveled slowly - I can'tsay how fast but it took about 5 minutes to travel the distance. It took several minutes to arrive alomost completely over my head. It was too slow and high for a plane. And, planes don't stop overhead. It seemed to \"pick\" a location overhead...as though settling in or something..little wobbles of movement and then...bam, it doesn;t move again and it tracks with the stars! I tried to take video but it is too jumpy, best is I could pull stills and compare time stamp to location....definately will get a better tripod and not bother zooming in - too far away...just track it's motion..so hopefully. There is no realdefinition in the object but la bright light, it must be very high up. By 8:35 it was stopped for a few minutes and totally seemed like a star. I was hoping others might watch the sky towards Queen Creek..low around 8-20 till 8:30 pm and see if perhaps it is some kind of satellite... I left the camera on the whole time, so even though it is jumpy and hard to see travel I am pretty sure I didn't substitute a star for the moving object..as there were almost no other stars visible until a good 15 minutes after this began.... It was actually pretty weird and no one to see with me."],"Latitude":"33.3136","Disposition":"IFO","Region":"Arizona","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/23598.html.txt","/var/www/straped/mufon/org/23598.html"],"Source":"MUFON","Object Shape":"Star-like","Object Features":"Unknown","Weather Factors":"None","City":"Chandler","Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"06/03/2010 01:14 UTC","Log Number":"US-06032010-0002","Date of the Event":"06/02/2010 12:00 UTC"}