{"Object Shape":"Diamond, Square, Rectagular","City":"Friendswood","Summary":"Certainly Military Experimental Aircraft (but still want to know what it was)","Weather Factors":"Unknown","Longitude":"-95.204517","trends":["There have been 5 other sightings in Friendswood","There were no other sightings in Friendswood on or around June 3rd 2010","This sighting has never been favorited.",""],"Case Number":"23608","Disposition":"IFO","Region":"Texas","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/23608.html.txt","/var/www/straped/mufon/more/23608_submitter_file1__UFO-june-3-10MUFON.jpg","/var/www/straped/mufon/org/23608.html"],"Date of the Event":"06/03/2010 01:05 UTC","Object Features":"Insignia, Wings, Other","Viewing Distance":"Unknown","Log Number":"US-06032010-0011","Tags":"City","divs":["sighting detailsabout 1:05 am june 3, 2010 severe thunder \\ lightning storm moving in from the northwest and i saw a single plane like bluish light moving through the very bad lightning and watched it wondering what the heck a plane was doing flying directly through the storm. the storm had to be at least 10 miles away and the light i first saw moving through it was behind it coming towards my direction, but it came on very fast. fast enough that before i realized it had gotten closer i could see something that at first appeared to be a triangular shape or diamond shaped outline against the approaching storm clouds. it looked like it stopped and i guess made a complete 90 degree turn and then flew right over my head. as it flew over i could distinctly see it was a rectangular shaped craft and see the lines of it's construction as well as markings underneath (couldn't quite make the markings out but they looked like something an aircraft would be marked with). in the center of it i could still make out the bluish light and could lightly see what looked like red squares in each corner and still faintly make out the square outline of the craft but if i hadn't been so curious about seeing a 'plane' flying through a bad lightning storm it pretty much completely blended in with the sky. doubt anyone else would be able to make it out unless they spotted it by chance and were watching. it was fast and silent. couldn't estimate how high up it was since i am not sure what type of aircraft you could compare it to but judging by how high it was coming through the storm i'd have to say pretty big for me to see that much detail as it went overhead. bigger than any kind of aircraft i have ever seen. when i realized i was looking at something strange i went to get my cell phone to take a picture or something but it was way gone. last heading towards the direction of galveston bay. i'm sure it was military. confident of it. just had a familiar kind of 'feel' to it as it went overhead. would love to know what it was though, and would like them to explain how they got that kind of technology in the first place."],"Country":"United States","Source":"MUFON","Latitude":"29.528599","map":"<A HREF = \"http://maps.google.com/maps?q=29.528599,+-95.204517(23608)&iwloc=A&hl=en\"> mufon case (23608) map </A>","Sighting Duration":"00:02:30","Date Submitted":"06/03/2010 07:20 UTC"}