{"Region":"Pennsylvania","Summary":"I saw two lights in the sky that appeared to be on fire and traveled like small airplanes.","Tags":"City","Source":"MUFON","Disposition":"Insufficient Data","trends":["There have been 3 other sightings in Bryn Athyn","There were no other sightings in Bryn Athyn on or around May 29th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.13993,+-75.066166(23605)&iwloc=A&hl=en\"> mufon case (23605) map </A>","Viewing Distance":"Unknown","Log Number":"US-06032010-0008","Object Flight Path":"Path with directional change","Object Features":"None","Country":"United States","City":"Bryn Athyn","Latitude":"40.13993","divs":["sighting detailsi went out to a parking lot after my friends wedding and saw what appeared to be at airplane flying overhead at what looked like 1000+ ft. it appeared to be flying fairly slow. i heard no engine sound but that might be expected. the odd thing is that the light was unmistakably a fire. i could see the flickering or the flame. there were no other strobe\\marker lights that would normally be on a plane. i pointed it out to a few others in the parking lot and no one had a viable explanation. i remember hearing about an incident similar to this where people called into a local police station and it turned out to be parachutists trailing something on fire. this object did not apear to be descending. it was making slight course changes though as if someone was piloting. i watched this object for about 5-7 minutes as it slowly got farther and farther away. just when i was about turn away a second object came over the trees at about the same altitute\\position as the first. it seemed to follow the first object but with a mile or two separation. this second object was exactly like the first with a single light that appeared to be a fire. i am a private pilot and long time astronomer. i have seen some strange things in the sky before but nothing like this. i would love to know if there is any explanation or if anyone else spotted these objects :) ~ z ~"],"files":["/var/www/straped/mufon/html2text/23605.html.txt","/var/www/straped/mufon/org/23605.html"],"Object Shape":"Fireball","Date of the Event":"05/29/2010 09:30 UTC","Sighting Duration":"Undisclosed","Longitude":"-75.066166","Weather Factors":"Unknown","Case Number":"23605","Date Submitted":"06/03/2010 01:19 UTC"}