{"Country":"United States","City":"Fort Collins","Date of the Event":"12/14/2008 07:00 UTC","Viewing Distance":"Unknown","Longitude":"-105.077463","Weather Factors":"Unknown","Date Submitted":"06/03/2010 12:23 UTC","divs":["Sighting Details I had returned from going snowboarding and was retrieving gear from my car and taking it to my apartment. I was walking toward my place and noticed something moving in the sky to my left. I was facing East, the moon was rather full and bright, and the cloud cover was not heavy but rather light with lots of open sky. Upon seeing the movement, I focused my view toward the object and tracked it as it moved through the sky. It seemed to be moving at cloud level as it appeared to flash in and out of the clouds. I assumed it was a plane but the speed of the object peaked my interest, I was just hoping to see what sort of jet this was. As it moved toward the bright moon, it broke through into the luminescence and was illuminated. I can only describe it as a bullet shape. It left no contrail or other type of trail, it simply was moving through the sky. I recall a sharpish point and a flat backside. As it broke into the light of the moon, I recall being impressed by the size and look. It just seemed sleek and shiny. The object continued along heading South, it moved at a rate that was much too fast for any commercial plane. I heard no engine sounds or anything. I watched as long as I could and it quickly moved out of my line of sight. I remember immediately thinking that this was really odd but my first thought was sort of military craft. It just seemed so different than any of the current designs that are utilized for flight by current technology, made my think that this was not a product of conventional design. Whoever or whatever it was, it was moving fast as heck and made no noise at all."],"Object Shape":"Bullet, Missile","Region":"Colorado","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/23603.html.txt","/var/www/straped/mufon/org/23603.html"],"Object Flight Path":"Undisclosed","Latitude":"40.59367","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around December 14th 2008"],"Sighting Duration":"00:00:15","Tags":"City","Summary":"Object Racing Across Sky","Log Number":"US-06032010-0006","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.59367,+-105.077463(23603)&iwloc=A&hl=en\"> mufon case (23603) map </A>","Case Number":"23603","Source":"MUFON"}