{"files":["/var/www/straped/mufon/html2text/23606.html.txt","/var/www/straped/mufon/org/23606.html"],"Date Submitted":"06/03/2010 02:14 UTC","Log Number":"US-06032010-0009","Summary":"Extremely bright stationary light that seemed to sometimes split into 2 objects. Light would get extremely bright then dim down.","divs":["Sighting DetailsAs I was watching television at approximately 9:45 pm, I noticed what seemed like an extremely bright star in the sky out of the window (facing northwest). As I just kept an eye on it over a few minutes it remained stationary keeping with my thought that it was just a really bright star, but then I thought that was odd, since the sky was completely cloudy and I could not see any other stars. As I continued to watch it seemed at times to split into 2 lights and then merge back into one. The light then got really bright, then dimmed down to just a little pinpoint of light and then got really bright again for maybe a minute. Then it quickly dimmed down and disappeared. All of the lights were off in my house and we don't have any lights on the outside of the house besides the front porch light. The television was on, but it is on the same wall as the window that I was looking out, so it couldn't have been a reflection from the tv. I don't know why but I just kept thinking as I watched it was \"I see you\". After it disappeared, I watched that part of the sky for bit, just to see if it was just a star that looked weird, but there was nothing there that I could see because of the clouds."],"Object Shape":"Star-like","Region":"Oregon","Case Number":"23606","Longitude":"-118.079039","Sighting Duration":"Undisclosed","Date of the Event":"06/02/2010 09:45 UTC","Latitude":"45.328777","Object Flight Path":"Stationary","Tags":"City","Object Features":"Unknown","City":"La Grande","map":"<A HREF = \"http://maps.google.com/maps?q=45.328777,+-118.079039(23606)&iwloc=A&hl=en\"> mufon case (23606) map </A>","Disposition":"IFO","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","trends":["There has been one other sighting in La Grande","There were no other sightings in La Grande on or around June 2nd 2010"]}