{"Case Number":"23612","map":"<A HREF = \"http://maps.google.com/maps?q=41.828379,+-71.407114(23612)&iwloc=A&hl=en\"> mufon case (23612) map </A>","Longitude":"-71.407114","Object Flight Path":"Undisclosed","Source":"MUFON","Log Number":"US-06042010-0003","Object Shape":"Cylinder","Region":"Rhode Island","divs":["Sighting Details I was walking on a back road next too the Qouset naval base and I look toward a abandon house off towards the naval base and saw a Cylinder type ship with port windows across the cylinder and aliens were looking out the port windows. I was amazed that this happen. I felt that i was seeing this. I said nobody would believe me. Years went by but I keep this a secret too myself I thought that if I said anything to any one that they would call me nuts. Even now i think this could have been a weird dream! I can't say I was real! I have no proof! But I if others are willing to come forward guess it time for me also. I was 25yrs.old when I saw this craft! Now I 59 years 0ld and married and have grand children. maybe this was just time too say something,or maybe it just had too be said like I said likely it was on my mind all these years but since all this is being talk about I can say something. Others things have happen that I not able to talk about yet! But maybe if I hear about others happening that are the same maybe I can come out say it to you. One thing for sure I read the bible and it says angels came too earth and mated with our women and gave them childen !! Who am I too say Its a lie when the word of God say so! Thank you for reading this! Hope this help you on your Quest for the truth! P.S. please keep this private thak you."],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"06/04/2010 08:44 UTC","Tags":"City","trends":["There have been 27 other sightings in Providence","There was one other sighting in Providence on or around November 30th 2002"],"Date of the Event":"11/30/2002 12:00 UTC","files":["/var/www/straped/mufon/html2text/23612.html.txt","/var/www/straped/mufon/org/23612.html"],"Latitude":"41.828379","Country":"United States","Summary":"I saw the Craft and the aliens take off !","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Providence","Disposition":"Hoax"}