{"Source":"MUFON","Latitude":"41.348667","Log Number":"US-06042010-0005","Date of the Event":"06/03/2010 07:10 UTC","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/23614.html.txt","/var/www/straped/mufon/org/23614.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.348667,+-80.082282(23614)&iwloc=A&hl=en\"> mufon case (23614) map </A>","Sighting Duration":"Undisclosed","City":"Sandy Lake","Longitude":"-80.082282","Summary":"Disc hovering over commercial jet, then flew up","Object Features":"Unknown","Disposition":"Insufficient Data","Region":"Pennsylvania","Weather Factors":"Unknown","trends":["There have been no other sightings in Sandy Lake","This sighting has never been favorited."],"divs":["Sighting DetailsI was sitting on a porch looking south and noticed an object flying above and close to a commercial jet airplane heading northeast. This immediately drew my attention. I am a private pilot and never have seen anything fly so close to a commercial plane. I thought it might be a military aircraft, but it was disc shaped and left no contrail like the commercial jet. The sky was mostly sunny with a few high clouds and the commercial jet contrail was very visible. I stood up to get a closer view and called over two of my relatives also on the porch to look. They both saw the object. We watched the object hover above the airplane, then ascend at about a 70 degree angle out of view. After we all drew pictures of what we saw and talked about it to the relatives that weren't on the porch (each taking a turn to describe it). The consensus was that the object was a disc and very shiny either white or metallic (the white plane looked dull in comparison); the disc flew tipped slightly on one end; the disc maintained a consistent speed and altitude above the airliner for at least 20 seconds; the disc then ascended at about a 70 degree incline and appeared to rise faster than the speed it traveled over the airliner; the disc didn't leave a contrail either over the airliner or when it accelerated as it was rising. We tried to think of all explanations for what the object could have been: a weather balloon, a military jet, etc. and could find nothing that fits."],"Country":"United States","Case Number":"23614","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"06/04/2010 10:34 UTC","Object Flight Path":"Path with directional change"}