{"Object Features":"Unknown","Log Number":"US-06042010-0004","Object Shape":"Boomerang, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.58872,+-105.077403(23613)&iwloc=A&hl=en\"> mufon case (23613) map </A>","Date Submitted":"06/04/2010 09:06 UTC","Longitude":"-105.077403","Region":"Colorado","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"06/03/2010 04:50 UTC","Summary":"3 objects that changed from bright metallic white to black in formation","divs":["Sighting DetailsI was driving from Mulberry and Lemay in Fort Collins to the Waterglen housing development off of I25. The sky was very cloudy and I was looking in my rear view mirror at the clouds above the mountains behind me. Some of the clouds were dark and some were bright white. When I turned left into neighborhood, I had a view of the western sky. That is when I noticed 3 white objects in the sky. They were closer than an airplane and well below the clouds. Then they seemed to flip end over end in formation and turn black with a bright white edge or outline. They were distinctly separate but in near perfect formation. My daughter said they were birds because of flight formation. My son thought it was a military air show. I was thinking what the heck is that. Maybe hang gliders? But they were moving from South to North across the western sky at the same altitude and not getting lower. They seemed to be flipping end over end changing from bright reflective white against the dark clouds to the outlined black. The shape of each individual object was kind of boomerang but they were all 3 together in the shape of a triangle. They moved rather slowly and we watched them until I pulled into my driveway. The neighbor was walking out of his house, so I stopped him and asked \"What the heck is that in the sky\" It took him about 10 seconds to locate what we were seeing. He had no idea what it could be either. We laughed about it being UFOs. We watched this for about 5 minutes until they disappeared behind the houses into the North Western sky. They never got closer or higher. They just seemed to vanish. Immediately I went inside and posted this on my facebook page. I wanted to document what I saw. Then I started to look on the internet for sightings in Fort Collins. A couple of them matched my description, but on different dates. I am left wondering \"What the heck was that?\" Maybe if I was another day, someone else will have reported it and I wont feel crazy anymore."],"Source":"MUFON","Latitude":"40.58872","files":["/var/www/straped/mufon/html2text/23613.html.txt","/var/www/straped/mufon/org/23613.html"],"trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around June 3rd 2010"],"Weather Factors":"Light","City":"Fort Collins","Object Flight Path":"Straight-line path,Other","Case Number":"23613","Disposition":"Unknown"}