{"Country":"United States","Source":"MUFON","City":"Northampton","Latitude":"40.686208","Disposition":"Insufficient Data","Object Features":"Window(s), Patterned Surface","Sighting Duration":"00:15:00","Region":"Pennsylvania","Date Submitted":"06/04/2010 05:55 UTC","Object Flight Path":"Undisclosed","Tags":"City","Date of the Event":"05/26/2010 12:00 UTC","trends":["There has been one other sighting in Northampton","There were no other sightings in Northampton on or around May 26th 2010"],"Log Number":"US-06042010-0009","Longitude":"-75.49685","divs":["sighting detailswhile watching tv i saw a light coming from far off at first i thought it was helicopter. as it got closer the object went from white light to off green glow then dark with frontal glow. i got off the couch to go outside thinking it was helicopter to hear the sound. there was no sound it flew in straight line coming at me while looking at it in the alley, no side to side movement just straight and silent. this is 2nd time in 3 years this has occurred. this object was about 4-5 hundred feet wide and about in center 150ft. thick nose to tail it was so low i could have thrown a rock and hit it. i'am deeply concerned about this.there were planes coming and going to the south out of allentown airport and not one changed course as this object continued right under them. this is no joke i am serious.my dog didn't even bark at it he went back to the door scared. i have tried to contact people about this and have had no luck in doing so. i could see the frontal 4 windows and the full bottom of this greyish craft flying over perfectly and immediately sketched the craft on paper. this is the second time in 3 years on a cloudless night. i don't know what it was but it wasn't military. sincerely [cms\\tg\\pid]"],"Viewing Distance":"Unknown","Case Number":"23618","files":["/var/www/straped/mufon/html2text/23618.html.txt","/var/www/straped/mufon/org/23618.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.686208,+-75.49685(23618)&iwloc=A&hl=en\"> mufon case (23618) map </A>","Object Shape":"Triangle","Weather Factors":"Unknown","Summary":"flew north to south at approximately 100 feet off ground silent and huge."}