{"Region":"Pennsylvania","Date of the Event":"06/01/2010 10:38 UTC","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"23622","files":["/var/www/straped/mufon/html2text/23622.html.txt","/var/www/straped/mufon/org/23622.html"],"Object Shape":"Star-like","Tags":"City","Weather Factors":"None","Summary":"Light flying over my house going NNW for about a minute after passing over head bright flash of light and it is gone.","Viewing Distance":"Over One Mile","Date Submitted":"06/04/2010 09:51 UTC","divs":["sighting detailsover the past several nights my wife and i have seen multiple lights over our house in the 10 pm to 11 pm time frame. the two that stand out are on saturday night 5\\29 around 10:30 pm two bright lights moving from the south to north looking very high and fast where flying exactly parallel but with a large gap between them. they where flying the same speed and in unison for about a minute and then the left hand light made an immediate 60 to 75 degree turn while the other light continued on the straight course it was on. both faded from site in less than a minute. the second event happened on tuesday 6\\1 at 10:38 pm a similar light as described above was flying over my house heading nnw. i know the time and direction because i had my phone for the time and digital compass. it passed over the valley in about a minute and was past my house when there was a bright flash and it disappeared. on both nights all the objects looked the same and appeared to be very high with similar speed and no noise. 1. in both cases we where at our house in our pool. 2. being on a landing path for greater pittsburgh and allegheny county airports and having many fly over routes over my house i notice planes and have seen numerous objects fling over this area so we watch the sky at night when outside. 3. no opinion of object simular to seeing space station but not the same. does not give the impression of a plane of any kind i have seen. 4. desribed above. 5. seeing the object we where curious and and more so after seeing it's behavior. 6. desribed above"],"Longitude":"-80.033828","Latitude":"40.3319","Object Flight Path":"Straight-line path,Path with directional change,Other","Log Number":"US-06042010-0013","trends":["There have been 6 other sightings in Bethel Park","There was one other sighting in Bethel Park on or around June 1st 2010"],"Object Features":"None","Source":"MUFON","City":"Bethel Park","map":"<A HREF = \"http://maps.google.com/maps?q=40.3319,+-80.033828(23622)&iwloc=A&hl=en\"> mufon case (23622) map </A>","Disposition":"Unknown"}