{"Sighting Duration":"Undisclosed","Case Number":"23625","files":["/var/www/straped/mufon/html2text/23625.html.txt","/var/www/straped/mufon/more/23625_submitter_file1__Lightinsky.jpg","/var/www/straped/mufon/org/23625.html"],"Viewing Distance":"Unknown","Date of the Event":"06/04/2010 12:00 UTC","Disposition":"Unknown","Object Shape":"Circle, Sphere, Star-like","Object Features":"Undisclosed","Longitude":"-85.754106","Summary":"Bright white light. Watched it disappear. This was no star.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.258745,+-85.754106(23625)&iwloc=A&hl=en\"> mufon case (23625) map </A>","Date Submitted":"06/05/2010 04:35 UTC","divs":["Sighting DetailsMy sister-in-law called at 10:17 pm and said that my son (who was staying the night) had come running in the house saying \"I just saw a UFO land on top a star!\" Typical type of thing you'd hear from a boy. Anyhow, being the skeptical yet loving aunt she is, she went outside because he demanded everyone to look at what he was seeing. Sure enough, she found what they saw odd enough to call and ask us if we could go out and take a look and see if we saw it too. We saw what she had described,but being the skeptics we are, we initially wrote it off as the \"north star\" simply because it was much larger than any other light in the sky (other than the moon) and it was bright white. But after observing for a minute, we realized that it not only emanated a glow around it like no other, but that it actually progressively was moving across the sky; not in such manner that you could see it abruptly move but that it changed position as we stood still over about a 10 minute timespan. The size remained constant for about the 10-15 minutes that my husband,our friend and I viewed it until it moved \"away\" from sight. I stayed on the phone with her as we continued to try and figure out what it was, but once it actually disappeared, we were completely convinced that this was nothing ordinary. It had a different kind of glow...a bit \"hazier\" and didn't \"twinkle\" like a star but did seem to have movement or character for lack of a better term. It was brite white and moved on to the WNW sky until it was just...gone. Anyhow, I've never seen anything like it. What the heck was this??!! Look at the picture from the cell phone. The 2 red lights you see on the right side actually are the \"bottom\" of the pic; that was just some glare from something below...not part of what was in the sky. But what the heck is that white light?"],"Object Flight Path":"Undisclosed","City":"Louisville","Log Number":"US-06052010-0002","Weather Factors":"Unknown","Tags":"City","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around June 4th 2010","This sighting has never been favorited.",""],"Region":"Kentucky","Source":"MUFON","Latitude":"38.258745"}