{"City":"Ocean City","Summary":"Small object with super erratic flight characteristics","Date Submitted":"06/04/2010 09:23 UTC","files":["/var/www/straped/mufon/html2text/23620.html.txt","/var/www/straped/mufon/org/23620.html"],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"Maryland","Weather Factors":"Unknown","Log Number":"US-06042010-0011","Case Number":"23620","map":"<A HREF = \"http://maps.google.com/maps?q=38.342163,+-75.081926(23620)&iwloc=A&hl=en\"> mufon case (23620) map </A>","Country":"United States","Longitude":"-75.081926","Latitude":"38.342163","divs":["sighting detailsi should start with some info about me. i am a licensed commercial pilot and very familiar with aviation in general. on the day in question i was seated on a bench at the mini-golf place on 68th street in ocean city. since i was not actually playing i was looking around when i saw what i can only describe as a short vertical cylinder, dark and from time to time slightly shiny. it appeared to be a good distance from me but i could not make out its size. the object was behind a light pole on location which i used to reference its movements. the objects movements were so radical that as a pilot i can say it was not a plane. it was way too stationary for that. it was not a helicopter as it moved much to fast and with attitude changes that would not fit a rotor-craft flight characteristics at all. the objects movements were similar to some insects and humming birds as far as its super fast changes of direction. i wanted to make sure it was not an object attached to some form of line and just \"flopping\" in the wind. i ruled this out as it was not reproducing the same movements over time as such an object normally does in my experience. thanks to the light pole, i could have judged the speed of the object but since i could not tell how far away it was, i could not triangulate this correctly. if it was just on the other side of the pole it would have moved about 15 - 20 feet in maybe 1\\10 of a second, it is was 100 away... well you get the point, i really could not say. i was able to observe this object stay roughly in the same area for about 12 minutes when it just vanished. it did not fly away, it just totally disappeared."],"Tags":"City","Disposition":"Unresolved","Object Features":"Undisclosed","Object Flight Path":"Other","Source":"MUFON","Date of the Event":"04/30/2010 12:00 UTC","Object Shape":"Cylinder","trends":["There have been 16 other sightings in Ocean City","There were no other sightings in Ocean City on or around April 30th 2010"]}