{"Object Features":"Undisclosed","Date of the Event":"06/05/2010 12:00 UTC","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around June 5th 2010"],"Disposition":"Insufficient Data","Region":"Pennsylvania","Log Number":"US-06062010-0001","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting Details At approximately 10pm I was sitting on the back porch talking to my friend. a bright orange flash appeared behind him and I alerted him. The light itself had a strange fiery glow to it that haloed the sky around it. The whole time the light was steady but pulsed slowly brighter, then dimmer. The object hovered for a moment, then proceeded to rise. It made very erratic maneuvers, and at one point stopped in mid air for a few seconds made a sharp right then a tight left at a speed I have never seen a plane make before (I don't live too far from Avoca airport and have seen planes my whole life). After a few more zig zag motions, it took a curved path left, giving up on the sky bound path it was on. At this point I was able to get a fairly good look at it. It was defiantly circular (but the light halo gave it a slightly elongated shape), with 1 row of lights (4 or 5)that stayed a steady orange and 1 light that kept flaring up. It then flew behind a cloud and never came back out. This lasted approximately 2 and a half, 3 minutes. Less then 5 minutes later another appeared rising VERY slowly off the horizon off the left, moved towards the direction of the first one (my right), stopping several times along the route. It the took the same course as the first but started to (dim?) out. The section of sky it was in was clear and you could easily see the stars in the sky. By the time it got to the same clouded area it looked like a star, but also had a slight lazy zig zag pattern like the first. It dimmed out completely before it reached the cloud. I have never seen anything like that before in my life. Besides myself and my friend, his girlfriend, his niece, and his mom all saw it."],"Weather Factors":"Light","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Summary":"2 Flying fireballs in the sky over Scranton, Pennsylvania","City":"Scranton","files":["/var/www/straped/mufon/html2text/23634.html.txt","/var/www/straped/mufon/org/23634.html"],"Source":"MUFON","Date Submitted":"06/06/2010 12:07 UTC","Latitude":"41.413079","Country":"United States","Object Shape":"Bullet, Missile, Circle, Disc, Fireball, Flash, Sphere, Unknown","Longitude":"-75.657372","Tags":"City","Case Number":"23634","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.413079,+-75.657372(23634)&iwloc=A&hl=en\"> mufon case (23634) map </A>"}