{"Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in North Aurora","This sighting has never been favorited."],"Region":"Illinois","Weather Factors":"Unknown","Country":"United States","Date Submitted":"06/18/2003 09:30 UTC","Log Number":"","Longitude":"-88.327295","Object Flight Path":"Stationary","Tags":"City","Object Shape":"Other","Summary":"an eyedropper the size of a bus","Object Features":"Other","City":"North Aurora","Sighting Duration":"00:05:00","Date of the Event":"06/18/2003 09:30 UTC","Case Number":"2363","files":["/var/www/straped/mufon/html2text/2363.html.txt","/var/www/straped/mufon/org/2363.html"],"Disposition":"Unknown","Latitude":"41.80614","map":"<A HREF = \"http://maps.google.com/maps?q=41.80614,+-88.327295(2363)&iwloc=A&hl=en\"> mufon case (2363) map </A>","Source":"MUFON","divs":["Sighting DetailsIt was about 930 am. I was driving down back roads en-route to a customer. Its aroad Ive travelled daily for almost 10 years. I was in a jeep with the top down.Doing about 45 mph, in a line of about 5 cars. The road is very rural, a fewhouses scattered along recently built lots of undeveloped woods and fieldsaround. I was south bound on Deer Path road, just north of Oak Street. I wasmaybe a half mile from the Orchard road toll plaza on I88.At this particular point the road bends sharply and we have to reduce speed. Inotice a greenish black object hovering motionless in the sky about 200 feet inthe air, over a field that runs between Deer Path and Orchard. It was maybe 50yards to the East of me. The line of cars continues around the bend and the 3cars ahead of me start to speed up. I continued to slow down and kept watchingthe object. I didnt stop tho...curiosity killed the cat.Out of the corner of my eye, I see the cars ahead of me brake..as if the driverscould also see it. It looked like it wasnt built for passengers. It looked likemore of a probe or something. It was huge. It looked like it was probably thesize of a school bus. The best I can describe is it was like an eye dropperstanding on end. it was tall and thin with a big bulbous head on top.The Headwas shinny and smooth, but the rest of it was bumpy...like a skeletal frame withappendages running down one side. It didnt move or make a noise. The line ofcars continued on, and I lost sight of it for a few seconds, behind some trees.A few seconds later, I turned East on Oak, and had a great view of the field,but the thing was gone.Im 45, and Ive lived around air bases...Vance in Enid, OK...Carswell In Tx. Iknow air craft. It wasnt a helicopter, or an ultra lite, or a weather balloon. Iknow what it wasnt.Ive seen some kooky lights in the sky in my day, but this is the first up closeday light sighting Ive ever had, so I thought Id report it.Let me know what you think."]}