{"Source":"MUFON","Tags":"City","Object Shape":"Bullet, Missile, Flash, Square, Rectagular, Star-like, Other","Weather Factors":"Unknown","Disposition":"Unresolved","Country":"Denmark","Object Features":"Unknown","divs":["sighting details1: i was standing with a few friends sitting on a bench in a local park, smoking cigarettes and talking, and just doing what friends do. 2: one of my friends told me to look up to the sky, and she pointed out the first object. the next time, i spotted it my self, the third time she pointed it out to me. the fourth time, i just saw a quick, shooting star like object moving very fast, before vanishing. the fifth i spotted my self. 3: the first object, i thaught was a satelite, as it was moving across the sky, getting shinyer and brigther as it moved on, and then faded out. it was going at same speed during the time i saw it, slow, but not too slow, it could look like it was in orbit. the second object i believed was nothing but a shooting star. the fifth, i dont really know what it was, i have never seen anything like it before, and i am 100% it was not a plane, as the lights was not flashing as fast as they do on a plane, and it changed directions in such a way no man made airplane \\ space craft can. 4: the three first object was like a star getting brighter and brighter before fading out. it moved from south east to north west. it probably went very fast, as it was far away. it took perhaps 1 minute before it had crossed the sky. the fourth object \\ shooting star was just a bright light going very fast, and was gone at the blink of an eye. the fifth object was just lights flashing every 8-10 secounds. it did not move in a straight line, but shifted from place to place every time it made a flash. the flash was bright, white\\yellowish. and when it did not blink, and if you watched caarefully, i could see a shadowlike square moving around, in different directions. 5: me and my friends was not sure what to believe, the first 3 object, my friend got very excited, i was not quite so excited at the first objects, as i thaught it were simply satelites. when the \"shooting star\" came, i felt a bit nervous about the whole thing. but i did believe it still was a simple shooting star. the fifth one made me a little scared, but glad to have seen something like it. 6: the first 3 objects faded out, the shooting star was gone in the blink of and eye. and the flashing object just vanished at one point.."],"City":"Copenhagen","Date of the Event":"04/13/2010 12:00 UTC","Date Submitted":"06/06/2010 12:10 UTC","Object Flight Path":"Straight-line path,Path with directional change","Summary":"5 different seightsings in a couple of hours.","Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in Copenhagen","There were no other sightings in Copenhagen on or around April 13th 2010"],"Region":"Capital Region of Denmark","files":["/var/www/straped/mufon/html2text/23635.html.txt","/var/www/straped/mufon/org/23635.html"],"Case Number":"23635","Sighting Duration":"Undisclosed","Longitude":"12.568337","Log Number":"DK-06062010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=55.676097,+12.568337(23635)&iwloc=A&hl=en\"> mufon case (23635) map </A>","Latitude":"55.676097"}