{"Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.276337,+-118.778782(23637)&iwloc=A&hl=en\"> mufon case (23637) map </A>","Longitude":"-118.778782","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Disposition":"IFO","Latitude":"34.276337","Viewing Distance":"Over One Mile","Case Number":"23637","Date of the Event":"06/04/2010 10:35 UTC","Object Features":"None, Unknown","Country":"United States","Region":"California","Summary":"Double Size of Avg Star and 4 Times Brighter Then Avg Star","divs":["Sighting DetailsI was sitting out front of my house having a cigarette. The shooting star caught my eye, I stood up real fast to try to get a view. A few seconds (Aprox. 2 secs) in the exact location of what I thought was a shooting star poped back on to a white light that was aprox. twice the size of a avg star and four times brighter. The first thought that came to my mind of how it was moving was like a fire fly. The object looked the same distance as the stars because it was so far away. The object made a complete circle patter on the sky which let me know it could not be a shooting star and then did a sharp turn and disappeared. A couple days earlier during the day time I saw a plane doing some real sharp turns with no noise, I dismissed it thinking it was just a stunt plane but the place it appeared was the same as the object I saw at night. I always thought I would be scared out of my mind if I saw a UFO but surprisingly I was excited and wish the it stuck around longer to watch. Being paranoid I checked the time to see if I lost any, thankfully I did not."],"trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around June 4th 2010"],"files":["/var/www/straped/mufon/html2text/23637.html.txt","/var/www/straped/mufon/org/23637.html"],"City":"Simi Valley","Weather Factors":"Unknown","Object Shape":"Circle","Date Submitted":"06/06/2010 01:22 UTC","Log Number":"US-06062010-0004","Tags":"City"}