{"Object Features":"None","files":["/var/www/straped/mufon/html2text/23646.html.txt","/var/www/straped/mufon/org/23646.html"],"Region":"California","Date Submitted":"06/06/2010 07:13 UTC","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.617182,+-121.848286(23646)&iwloc=A&hl=en\"> mufon case (23646) map </A>","divs":["Sighting DetailsAt 2245pm I was in my backyard(chasing away a skunk) when a bright emerald green light caught my attention. It stood out against the sky and the street lights. I initially thought it was a plane, but then noticed the light disappear and then reappear 2-3 times.This light switched between green and bright white,which peaked my suspicion. So i moved to the front of the house, and aligned the light to the peak of a neighbors house. This reassured I could verify the movement of the light more precisely. I watched this light for approx. 10 min. moving quickly around the sky in a southern direction,closer toward the monterey bay area. As i was observing this green light, a brilliant saphire-purple colored light appeared to the west(right) of the green light. It moved in all directions,altitudes. As like the first, the light would disappear, then reappear except not changing colors. I watched this for a few more minutes, when it dropped in altitude and headed toward the green light,then disappeared. There was no movement for maybe 5 minutes, when i noticed the saphire-purple light reappear in a more westerly direction. I followed it as it dropped in altitude(following it over another neighbors roofline)then headed in a westerly direction over the bay and out of eyesight. This lasted from 1045pm to 1105pm.I just wished i had another person to experience this with...not a skunk. Keep looking up!"],"Case Number":"23646","Sighting Duration":"Undisclosed","Date of the Event":"06/05/2010 10:45 UTC","Source":"MUFON","Disposition":"Insufficient Data","Summary":"Moving lights over Monterey area...","Country":"United States","City":"Sand City","Log Number":"US-06062010-0013","Longitude":"-121.848286","Object Shape":"Fireball, Sphere","Object Flight Path":"Straight-line path,Path with directional change,Unknown","Weather Factors":"None","Tags":"City","Latitude":"36.617182","trends":["There have been no other sightings in Sand City","This sighting has never been favorited."]}