{"Region":"Oklahoma","City":"Seminole","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.2287,+-96.667253(23641)&iwloc=A&hl=en\"> mufon case (23641) map </A>","Object Flight Path":"Stationary,Path then hovering,Other","Object Features":"Unknown","Latitude":"35.2287","Log Number":"US-06062010-0008","Longitude":"-96.667253","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 5 other sightings in Seminole","There were no other sightings in Seminole on or around May 26th 2010","This sighting has never been favorited.",""],"Weather Factors":"None","Source":"MUFON","Case Number":"23641","Object Shape":"Circle","Date Submitted":"06/06/2010 10:29 UTC","files":["/var/www/straped/mufon/html2text/23641.html.txt","/var/www/straped/mufon/more/23641_submitter_file1__P1030191.JPG","/var/www/straped/mufon/more/23641_submitter_file2__UFOpic252610.JPG","/var/www/straped/mufon/org/23641.html"],"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI woke up early to and went to the kitchen sink to get a drink of water and saw the super bright light that at first I thought was the moon. The object lowered to almost ground level then illuminated the area in the woods all around it. We live in a home that is built on the side of a hill and the light was right on top of the hill where we live. After a few minutes I noticed that a beam of light was shining towards the north west and it stayed in that area for approx 3 min. The object then suddently shined a beam of light to the southeast area. The other area that had been illuminated in the opposite direction was then dark. The \"moon\" doesn't shine light in different directions. I woke up my husband and by the time I got back to the laundry room door window to show him what I was witnessing the light had dimmed. It was almost like they were watching me and knew I had gone to get another witness or something. He went back to bed half asleep.... and then is when it started shining a bright light in the two different direcitons (at different times). I woke him up again and he came and looked at it but was so sleepy he just said oh..it's the moon. I pointed out to him that we could only see one side of the tree's that was all lit up and he just said he was going to bed. I watched the light until it disappeared. It appeared to fade then just disappear. The woods are heavy behind our house up on top of the hill and when this object was illuminating the area all the tree's you could see very good. It was scary..I kept going from one window to another window to get a better look at it and trying to get my camera to work. Hopefully you have had someone else in Oklahoma that saw this object. Whatever it was it was huge. There was no noise at all. It was a bright white light but big and you couldn't see any outline. I was looking at it through a lot of tree's so it was just a large large light. The funny thing about it and the timing I thought might have something to do with the fact that I had started burning some brush piles next to our driveway that is right on the south of where this object was seen the day before. The fire had caught an old oilfield rubber hose that was very long on fire and it had burned very slowly all night. I wondered if this from the air could have sparked the objects attention. The next morning when I went up to look at the area where I'd seen the object I could tell that the rubber hose had continued to burn all night very slowly. The spot where the object was seen is a large open area where we had bulldozier work done the day before to clean up an old oil well site. There was fresh dirt and bulldozier tracks and trac hoe tracks and I only saw one little area that looked funny. It was a half circle with ridges prescisly spaced. I don't know but the track hoe could have made this impression in the dirt. I did take a few pictures of the dirt. During the sighting that early morning when I tried to take pictures my camera's battery was dead. By the time I got it half way charged I only got a few pictures and none showed the bright light, only one picture showed anything unusual and it shows 2 red lights in the upper right hand corner. This was my experience and what I saw."],"Disposition":"Unknown","Date of the Event":"05/26/2010 12:00 UTC","Summary":"Bright light looked \"moon like\". Moved from above treeline & dropped to near the ground. Illuminated whole area beneath then shined beam of light to the northwest then to the east."}