{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.639195,+-89.391808(23647)&iwloc=A&hl=en\"> mufon case (23647) map </A>","Tags":"City","City":"Undisclosed","Object Shape":"Circle, Other, Unknown","Summary":"Flying object, pulsating lights, hovering in sky","Source":"MUFON","Weather Factors":"Unknown","Case Number":"23647","Log Number":"US-06062010-0014","Sighting Duration":"00:05:00","divs":["Sighting DetailsA family member woke up somewhere between 11pm and midnight, she doesn't remember the exact time. She claimed to hear loud planes flying back and forth in the sky and didn't know what was happening. Because when planes come into Chicago they turn around over the lake, at first she thought it was that. But this was different. They were loud, right outside, and flying back and forth. I was sleeping in the other room and heard them as well (though I assumed they were helicopters), but brushed it off and went back to sleep. I just assumed it was military craft or something of that nature. Anyway, she said that she got up to look out the window and, when she did, the noise from the planes stopped and all she saw was this bright light that looked like it could be another moon; it was hovering over lake Michigan. There were light rays pulsating from it - white and yellow. She could not make out the shape of the object because the light was so bright but she thought it might be circular. She said it was just hovering there and then shone right in her face. At this point she claims to have become very frightened and, for some reason, went back to sleep. She then forgot about this entire event until tonight when she said the memory just came back to her. Weird! I thought maybe it could have been some kind of military project, but who knows."],"Longitude":"-89.391808","Region":"Illinois","files":["/var/www/straped/mufon/html2text/23647.html.txt","/var/www/straped/mufon/org/23647.html"],"Date of the Event":"06/04/2010 12:00 UTC","Object Flight Path":"Undisclosed","trends":[],"Disposition":"IFO","Latitude":"40.639195","Object Features":"Undisclosed","Date Submitted":"06/06/2010 10:57 UTC","Country":"United States"}