{"map":"<A HREF = \"http://maps.google.com/maps?q=47.66475,+-117.416447(2364)&iwloc=A&hl=en\"> mufon case (2364) map </A>","Longitude":"-117.416447","Object Shape":"Sphere","Country":"United States","City":"Spokane","Weather Factors":"Unknown","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around July 31st 1962"],"Object Flight Path":"Straight-line path","Date of the Event":"07/31/1962 11:00 UTC","Log Number":"","Tags":"City","Region":"Washington","divs":["Sighting Detailsthis is a 40 year old memory.My friend and I were going to sleep in the front yard of the farm house where Ilived about 5 miles S.E. of the city of Spokane WA.Some time around 1100 wenotice a number of round lights in the sky.As I recall they were solid colorseither red green or blue and they were glowing. The motion seemed to be random.They would travel in a straight line for several miles then stop for a fewminutes then go off in another direction. from our vantage point one appeared todecend across the far end of our farm 12 mile or so slowed, then seemed todisappear in the trees of the Dishman Foot Hills a mile or so away. We never sawit again. I dont remember what time the incident ended. We were about 11 yearsold and I think we eventually fell asleep.Early on I called the Police and I recall that the answering officer saidsomething like ya ya weve been getting a lot of phone calls. An hour or so laterwhen we thought we had just watched one land,I called again to report what wehad seen. This time the Officer seemed quite excited and he said that the AirNat. Guard had been notified. We never saw any military planes.I dont relate this story very often, but at about the age of 19 someone relatedwhat I believe to be the same occurance to me.I also remember that we counted atleast 27 of these lights. There are other details that I might relate, but Idont trust my recollection of them.I am just relating what I am pretty sure of.Alot of people MUST have seen this.I would like to know."],"files":["/var/www/straped/mufon/html2text/2364.html.txt","/var/www/straped/mufon/org/2364.html"],"Latitude":"47.66475","Sighting Duration":"01:59:00","Date Submitted":"07/31/1962 11:00 UTC","Object Features":"Undisclosed","Source":"MUFON","Case Number":"2364","Disposition":"Unknown","Summary":"Lights over Spokane","Viewing Distance":"Over One Mile"}