{"Date Submitted":"06/06/2010 11:15 UTC","Case Number":"23649","Log Number":"US-06062010-0016","Tags":"City","Longitude":"-92.40434","Sighting Duration":"Undisclosed","Object Shape":"Cylinder, Other","Date of the Event":"06/05/2010 10:29 UTC","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=37.856984,+-92.40434(23649)&iwloc=A&hl=en\"> mufon case (23649) map </A>","City":"Richland","Object Flight Path":"Other","Summary":"Ghost Hunting and took a picture of a possible UFO. Also heard a loud constant humming noise at another cemetery","Region":"Missouri","files":["/var/www/straped/mufon/html2text/23649.html.txt","/var/www/straped/mufon/more/23649_submitter_file1__pictureofareabeforeufoappeared.JPG","/var/www/straped/mufon/more/23649_submitter_file2__lorinbeachufophoto.JPG","/var/www/straped/mufon/org/23649.html"],"Latitude":"37.856984","Source":"MUFON","Object Features":"Other","trends":["There have been no other sightings in Richland","This sighting has never been favorited."],"Viewing Distance":"20 Feet or Less","Weather Factors":"Lightning, Light","Country":"United States","divs":["Sighting DetailsOn the evening of Saturday June 5th our paranormal group decided to do a investigation in a cemetery near Richland Missouri in Pulaski County. It was just the group leader, his wife, and myself that night. We were having the usual investigation and were at first glance getting a lot of orbs, with a couple of really cool face pictures. While at the cemetery I saw a shooting star shoot straight down. The night was clear with some clouds in the distance producing heat lightning. My friend was using a camera that had an infra red attachment. He has a better camera then I do that is 10megapixel. We spent about 45 minutes at this place then moved on to the next cemtery down a series of dirt roads. While there all three of us noticed a constant humming noise at this cemetery. It was not the interstate as when you live by a road there are occasional breaks in the noise. We finished up the investigation at the second investigation and headed back to the group leader's house. We uploaded our pictures to our respective computers and procedded to go through the evidence right then and there. About approximately ten minutes into the review of evidence. I hear \"What the hell is that?!?\" coming from the group leader. I got up and, his wife got up from the computer desk and headed over to his desk and looked at an unusual object hanging in the sky among the trees. This was unlike anything I had ever seen before. We realized that this photo was taken in the first cemetery. The picture that was taken in the same spot and in the general same direction before had no such object in it. It was invisible to us. While we were in that spot we had to be no more then 25 feet from the object and the group leader speculates that the object was hovering about in the tree tops. Observing us. Also noticed in other photographs are humanoid looking faces with two black stripes painted upon their cheeks. It is also worth noting that the group leader and his wife did a previsit to the graveyard about two weeks ago. When we arrived he commented that their looked to be several dirt patches that were not there previously. Were the aliens investigating us investigating the cemetary? Did they follow us to the other cemetary and was that the contant humming we heard? We may never know the true answer."]}