{"Tags":"City","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Latitude":"35.602545","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.602545,+-82.549405(23656)&iwloc=A&hl=en\"> mufon case (23656) map </A>","Log Number":"US-06082010-0001","Object Shape":"Disc","Case Number":"23656","Longitude":"-82.549405","Object Features":"Dome, Other","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around November 17th 2009"],"City":"Asheville","divs":["Sighting DetailsThe night I saw the objects, I was up late observing the Leonid meteor shower. Not looking for any sort of unusual flying objects, I had seen earlier meteors with the usual Leonid characteristics (bright fireballs, ion trails). Soon high clouds began to cover the Northern sky where I saw the earlier fireballs. I was in a track and field complex observing the shower, so I lied down on the paved running track to get a better plane of view for later meteors. I lied down there for a while, and around 1AM the meteors began to pick up in amount. Some of the meteors were like regular shooting stars and were faint, but others had bright white colored fireballs. During this peak in meteor activity is when I caught movement out of the corner of my eye at the zenith of the night sky. At first I thought it was a few meteors, but the \"objects\" never faded, didn't have ion trails, and were moving too slow. Curious at this point, I looked directly at the faint objects and discovered that they were flying in an equilateral triangle formation. My next conclusion were that the \"objects\" were either landing lights on an aircraft or birds, but there were no blinking lights, distant jet engine noise, or flapping wings. At this point I realized I was looking at genuine UFOs. With my curiosity turned from the Leonids, I focused my complete attention to the 3 UFOs. As I did I realized that these UFOs weren't just points of light, but actual flying objects with depth! I could see that they were bronze colored and appeared to be glowing against the night sky with a light similar to the dying orange sparkle of an incendiary. The objects were circular from my point of view as I was looking at their underside, and had grooves in them similar to a plate or phonograph record. I saw no windows in the objects. I assumed that they were lenticular shaped in profile since I saw no antennae or spikes protruding from them, and how they resembled a plate. I continued to track them across the night sky, being sure to remember what groups of stars they moved across and what heading the UFO's were taking. The UFOs passed through the zenith of the night sky and flew in between the constellations Perseus and Auriga. I also noted how the objects were moving almost directly North to South. This movement is very similar to something called a polar orbit, which I found very unusual. The entire event lasted approximately 2 minutes as the 3 lens-objects flew through the night sky. The objects neither took off at high speed, nor hovered. They maintained a constant velocity throughout the time I saw them. As the objects moved toward the southern horizon, they began to be drowned out by brown light pollution, but before they disappeared the UFOs performed one last maneuver. In the southern sky, while maintaining the same velocity as the others, one of the objects broke from the equilateral triangle formation and flew in a more southeasterly direction. The other two UFO's simultaneously maintained their previous positions in the \"triangle\" and continued in their southerly trajectory. I also noted that when the object pulled away, it neither pitched nor rolled like a conventional aircraft. Shortly after these maneuvers were completed, the light pollution became too much and I lost site of the objects near the horizon. I felt no \"presence\" when I saw the UFOs, didn't see any beings, or had the perception of lost time. I saw three unusual craft under some form of intelligence, perform maneuvers that are impossible for conventional aircraft at such a low altitude. In my logical opinion, I saw something truly unusual that needs to scientifically explored further."],"Region":"North Carolina","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Straight-line path","Summary":"During peak activity of Leonid meteor shower, 3 lenticular bronze objects were seen flying in an organized formation.","Date Submitted":"06/08/2010 01:18 UTC","Date of the Event":"11/17/2009 01:00 UTC","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/23656.html.txt","/var/www/straped/mufon/org/23656.html"]}