{"map":"<A HREF = \"http://maps.google.com/maps?q=40.61013,+-75.483573(23650)&iwloc=A&hl=en\"> mufon case (23650) map </A>","files":["/var/www/straped/mufon/html2text/23650.html.txt","/var/www/straped/mufon/org/23650.html"],"Case Number":"23650","Date of the Event":"06/04/2010 08:20 UTC","Summary":"Black metal object with fire around it on the bottom.","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Latitude":"40.61013","City":"Allentown","Log Number":"US-06072010-0001","Object Shape":"Other","Longitude":"-75.483573","Region":"Pennsylvania","Country":"United States","Tags":"City","Source":"MUFON","Disposition":"Unknown","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around June 4th 2010"],"divs":["Sighting DetailsFriday the 4th of June. My husband and I was watering our plants in the backyard. When we finished, while my husband was putting the water hose away I looked up in the sky and saw this strange object. I couldn't tell what it was. I could see it very clear, but I didn't know what it was. I called my husband and asked him if he knew what this thing was. He looked at it and couldn't tell what this flying thing was. We were a little creeped out about it. This thing was black and it was made of metal. The object had flames shooting out from the bottom and sides of it. This thing didn't make any noise. I also noticed it had some sharp points to it. This object move very slow in a horizontal pattern in a Northeast direction. It keeped moving to the point that we lost sight of it in the clouds. I first thought it was space debris falling from the sky. My husband said that it didn't fall from the sky, this thing moved in a way that falling debris wouldn't move. It moved like something was in control of it. I e-mailed the Newspaper to see if anyone else made any reports on this object, but never got a response. I checked the newspaper to see if they wrote anything about this thing and nothing was ever mentioned in it. I was wondering if you can look into this and see if anyone else saw this thing or if there's a resonable explaination to what this was."],"Date Submitted":"06/07/2010 09:43 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown"}