{"trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around June 6th 2010"],"Latitude":"39.100906","Disposition":"Unknown","divs":["Sighting DetailsI was at a Kansas City Royals game on Sunday afternoon. Around 2pm I just happened to look up in the sky and saw a small white object floating slowly from north to south. It had 4 star like looking objects that were in a diamong form aroung it. One above, one below and one on each side that were moving with it. Then about 4 0r 5 minutes later tghe 4 star objects were out in front to the north of the object and 5 to 6 more stars were scattered around it in no apparent order. They all slowly just moved to the north until they were no longer visible from the stadium. I told my wife to look up at it and she saw it as well. I seen other people in the stadium pointing at it as well. I had sunglasses on which made the star looking objects more visible. When i took them off they werent as easy to view. The main object was easily seen with or without the objects. I was very amazed and had no idea what it could have been. I watched the news and looked on the internet to see if anybody else had seen it and talked about it, but nothing was ever mentioned. My wife jsut said it was \"strange\" but didnt get as worked up as I did. I told her she was probably one of them. She gave me a dirty look."],"Summary":"1 white round object with 4 stars in a diamond shape surrounding the UFO. Stars then moved and 6 more were near.","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23652.html.txt","/var/www/straped/mufon/org/23652.html"],"Object Features":"Unknown","Log Number":"US-06072010-0003","Object Flight Path":"Straight-line path","Date Submitted":"06/07/2010 03:23 UTC","Weather Factors":"Unknown","Tags":"City","Country":"United States","Object Shape":"Circle, Star-like","Region":"Missouri","Case Number":"23652","City":"Kansas City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.100906,+-94.575767(23652)&iwloc=A&hl=en\"> mufon case (23652) map </A>","Longitude":"-94.575767","Source":"MUFON","Date of the Event":"06/06/2010 12:00 UTC"}