{"divs":["Sighting DetailsThis was not a normal light. In over 50 years, I've never seen any light in the sky this bright. It is not the moon, reflection off the cloud, or the Luxor Hotel beam. Any ideas what this was are welcomed, to satisfy my curiosity. Details: I was on my cell long distance and went out on my porch when I saw it. I was astonished and in awe, and told my son what I was seeing and to hold on while I got the camera. I got back on the phone and put him on speaker while I took the video. It was hard to stare at directly, but I took the video anyway. I went back in the house after about 4 or five minutes, plugged my phone back in the wall and when I came back outside, it was gone. FYI, I witnessed two star-like objects in the June of 1973 over Big Sur, Cali., that stopped and sped away at a great speed. No one believed me and they ALL thought I must have been high or crazy in those days. I've been looking up in the sky ever since. I even wrote a poem: \"I know I done seem me some stars, that moved and stopped and sped away, and I know Earth ain't the only place God put some folks to stay.\""],"Log Number":"US-06072010-0005","Source":"MUFON","Longitude":"-115.171366","Latitude":"36.118846","Date Submitted":"06/07/2010 09:12 UTC","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around January 19th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Case Number":"23655","Object Features":"None","Tags":"City","Date of the Event":"01/19/2009 02:15 UTC","Object Shape":"Sphere","Object Flight Path":"Path then hovering","Country":"United States","files":["/var/www/straped/mufon/html2text/23655.html.txt","/var/www/straped/mufon/org/23655.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.118846,+-115.171366(23655)&iwloc=A&hl=en\"> mufon case (23655) map </A>","Sighting Duration":"Undisclosed","Summary":"Extremely Bright Light - over 5 minutes it remained in the same spot.","City":"Las Vegas","Region":"Nevada","Disposition":"IFO"}