{"Country":"United States","Source":"MUFON","Object Shape":"Other","City":"Bethlehem","Weather Factors":"Medium","Object Features":"Other","Case Number":"23653","Object Flight Path":"Straight-line path","Summary":"BLACK METAL OBJECT WITH POINTS TO IT AND FLAMES SHOOTING OUT FROM IT","Longitude":"-75.367958","Date Submitted":"06/07/2010 04:37 UTC","trends":["There have been 21 other sightings in Bethlehem","There were no other sightings in Bethlehem on or around June 4th 2010"],"Log Number":"US-06072010-0004","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.629172,+-75.367958(23653)&iwloc=A&hl=en\"> mufon case (23653) map </A>","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Latitude":"40.629172","divs":["Sighting DetailsOn Friday the 4th around the time of 8:00 or 8:30 my husband and I was in the backyard watering our plants. While my husband was putting away the water hose I happen to look up to the sky and notice this black metal object in the sky. This thing had fire shooting out and around it. It glided in a horizontal pattern. I told my husband to look at this thing and tell me what he thinks it is. He of course, didn't know what to think. It wasn't too far away that you couldn't tell what you were looking at and it didn't make any noise. This thing didn't have any wings to it. I had mentioned to my husband that maybe it was space debris falling down. He then said that this thing was moveing in a way that didn't look like something falling. It just glided. We felt a little creeped out by this thing. I also noticed it had some sharp points on it. I tried to contact via e-mail our local newspaper to see if they had anyone else reporting this and they never got back to me. I've been watching and reading the newspaper and nothing was reported. I would like to know if anyone else saw what we saw."],"Date of the Event":"06/04/2010 08:20 UTC","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/23653.html.txt","/var/www/straped/mufon/org/23653.html"],"Sighting Duration":"00:06:00"}