{"divs":["Sighting DetailsIt was beautiful winter day and there was not a single cloude in the sky.I was on my balcony with my mother,actually she was on the balcony and I was standing at the balcony door and we were talking about something.At one point I've noticed something very bright,glowing in the sky,so I went out to the balcony to see what it was.I knew it wasn't the sun because I could see the sun setting far away from that object,and this object was just sitting still in silence above the sea,in front of the mountain,it didn't move at all.Then it blinked two or three times and it disappeared.Before it disappeared,when it blinked I couldn't see any object like it was dematerialized (if that's the right word).Actually,at one point I went back to my apartment to look at the clock,for some reason I wanted to know the exact time of this event.By the time I came back,the object was gone. I think my first reaction was curiosity,I kept my eyes on that object,I even tried not to blink.I knew I'm witnessing something extraordinary,but I also think my curiosity was mixing with caution,because I didn't know what to expect and in the same time I was calm.It was a mixture of all those feelings.I was just so sorry that I didn't have a camera,but since that day I try to always have my camera with me."],"Country":"Croatia","Log Number":"HR-06082010-0003","Source":"MUFON","Date of the Event":"01/21/1999 05:10 UTC","Summary":"A large very bright glowing ball","Tags":"City","Region":"Primorje-Gorski kotar","files":["/var/www/straped/mufon/html2text/23658.html.txt","/var/www/straped/mufon/org/23658.html"],"Case Number":"23658","Weather Factors":"None","Disposition":"Unresolved","Date Submitted":"06/08/2010 03:38 UTC","Object Flight Path":"Stationary","Object Features":"None","Latitude":"45.32848","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been no other sightings in Rijeka","This sighting has never been favorited."],"City":"Rijeka","Object Shape":"Fireball","Longitude":"14.436405","map":"<A HREF = \"http://maps.google.com/maps?q=45.32848,+14.436405(23658)&iwloc=A&hl=en\"> mufon case (23658) map </A>"}