{"Tags":"City","Source":"MUFON","Region":"Oregon","Longitude":"-122.668307","Latitude":"45.530652","Object Shape":"Sphere","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"Unknown","Summary":"Gray Orb Flashing Brightly","divs":["sighting detailsi decided to submit this after reading a report submitted on the 6th in about a sighting in oregon. on the morning of june 5, i was filling up at a gas station just north of the wa\\or border. i looked up and a bright flash caught my eye. it was a gray orb that flashed a bright, white light in groups of 3 (spaced about 1\\8 second apart then 1 second between groups). it was making movements no plane could make (very fast n\\e\\s\\w movements). i told several people to look at it, including my wife. 3 of us watched for several minutes then it abruptly disappeared. no one ventured an explanation although we all concluded it was most certainly not an airplane. my best guess is that it was a mylar balloon although there are several reasons why i don't think this is the case: the flashing came in 3s very evenly spaced apart, it didn't move like a balloon, (its moves seemed deliberate - backtracking at points) and the size to speed ratio seemed off (too fast and high to be as big as it was). i didn't have my camera but, to be honest, it wouldn't have looked like much if i did snap a photo. i wouldn't submit this if i did not see the previous report describing exactly what i saw, the same day, near the place i saw it."],"Date Submitted":"06/08/2010 04:53 UTC","files":["/var/www/straped/mufon/html2text/23661.html.txt","/var/www/straped/mufon/org/23661.html"],"Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Log Number":"US-06082010-0006","Case Number":"23661","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around June 5th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.530652,+-122.668307(23661)&iwloc=A&hl=en\"> mufon case (23661) map </A>","Date of the Event":"06/05/2010 12:00 UTC","City":"Portland"}