{"divs":["Sighting DetailsI am white with a Navajo wife living on the Navajo Reservation. For many years I have heard many stories about Satan's Butte - all stories revolve around UFO's and Snakes. While I believe in the likelihood of UFO's - I never really believed in something this close to our home. A week ago I was outside at 9:46pm and looked toward Satan's Butte and saw a spaceship hovering above the butte. (The butte is about three miles away.)I ran into the house and grabbed my sister-in-laws camera and my binoculars. I could not get a clear picture but watched the UFO cylindrical sphere with red blinking lights descend into the butte. Two days later the even repeated - I yelled to my unbelieving wife but by the time she got outside it had already descended. Last Friday we went to Flagstaff and I bought a \"good\" camera. Last night at 10:46pm we both witnessed the UFO - I took pictures and now have a witness and pictures! My wife admits she thought I was seeing things but I took pictures and she watched through the binoculars. The Navajo are a reticent people but talk amongst themselves - they have seen this many times over the years."],"Country":"United States","Date Submitted":"06/08/2010 04:20 UTC","Disposition":"Unknown","City":"Greasewood","Summary":"Third time this object has descended in Satan's Butte this week","Weather Factors":"Windy, Light","map":"<A HREF = \"http://maps.google.com/maps?q=35.522512,+-109.857338(23660)&iwloc=A&hl=en\"> mufon case (23660) map </A>","Longitude":"-109.857338","Log Number":"US-06082010-0005","Latitude":"35.522512","Date of the Event":"06/07/2010 10:46 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23660.html.txt","/var/www/straped/mufon/more/23660_submitter_file1__DSCN0328.JPG","/var/www/straped/mufon/more/23660_submitter_file2__DSCN0329.JPG","/var/www/straped/mufon/more/23660_submitter_file3__DSCN0330.JPG","/var/www/straped/mufon/org/23660.html"],"Tags":"City","Region":"Arizona","Object Shape":"Circle","Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Greasewood","This sighting has never been favorited."],"Viewing Distance":"21-100 Feet, Over 1 Mile","Sighting Duration":"00:08:06","Case Number":"23660","Object Features":"Dome"}