{"Viewing Distance":"Over One Mile","Region":"England","Case Number":"23670","Log Number":"GB-06092010-0005","Summary":"Orange lights near RAF Lyneham","map":"<A HREF = \"http://maps.google.com/maps?q=51.558169,+-1.780679(23670)&iwloc=A&hl=en\"> mufon case (23670) map </A>","Tags":"City","Date of the Event":"04/15/2010 12:00 UTC","Object Shape":"Sphere","Latitude":"51.558169","Object Features":"Unknown","divs":["Sighting DetailsI am an aircraft engineer at RAF Lyneham and this event took place while working a night shift. I was out on the aircraft pan performing an aircraft servicing with some colleagues and i noticed some orange lights in the sky just above the buildings south-west of where i was standing. There were 3 lights at first with another 2 or 3 appearing a few minutes after.I alerted one of my colleagues an we both stood and watched them, trying to apply logic to what they could be. They just seemed to hang in the sky, not moving around at all. The last lights to appear were the first ones to disappear, leaving just the first lights. then the original 3 lights disappeared around 2 or 3 minutes after. The objects were slightly smaller than the moon and a similar colour to sodium street lamps but in a location where there are no street lamps and too high. I know what aircraft flares look like and these were too large and too long lasting. there were also no helicopters in the area that night. I am a sceptic generally but these objects were like nothing i've seen before and watching them was unnerving to the point where i had a shiver going up my spine. I have since seen a video on Youtube, from a local resident, that shows almost identical objects in around the same area, but seemingly at a higher altitude. This video was recorded maybe a year or more earlier."],"City":"Swindon","Longitude":"-1.780679","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23670.html.txt","/var/www/straped/mufon/org/23670.html"],"Weather Factors":"Unknown","Object Flight Path":"Stationary","trends":["There have been no other sightings in Swindon","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United Kingdom","Date Submitted":"06/09/2010 06:00 UTC"}