{"Country":"United States","Longitude":"-122.838748","Log Number":"","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/2367.html.txt","/var/www/straped/mufon/org/2367.html"],"Summary":"Two Wingshaped Flying Objects","map":"<A HREF = \"http://maps.google.com/maps?q=45.362227,+-122.838748(2367)&iwloc=A&hl=en\"> mufon case (2367) map </A>","Object Shape":"Boomerang","Source":"MUFON","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","City":"Sherwood","Latitude":"45.362227","Date Submitted":"11/30/1981 12:00 UTC","Disposition":"Unknown","divs":["Sighting DetailsFor many years in my present chronological lifetime, I made it a habit to lookinto the skys, with my naked eyes and with binoculars, in a wide varity oftimes, places and weather conditions.Remember, this incident was yrs ago, so I cant give nor do I remember exactdates, times, nor cloud altitude.In this particular instance, I was on my front porch, just off of 99E and acrossthe highway from Roamers Rest Tavern, as well as a gas station just across thedriveway from my house. The set of three houses in this little spot is no longerthere now. However, I believe the gas station still is. It was night, but Idont remember what time. Tho, it was quite dark, so it must have been at least afew hours after sunset. I think it was a bit cool out and it may have been latespring, maybe autumn. As was my habit, I looked up into the sky, right above methis time. It was partially cloudy with large patches of clear sky. Uponlooking up, I clearly saw, right above me, two black wing-shaped flying objects. They were flying low in the sky, going north, about the height and speedpassenger jet planes would when coming in for a landing, when viewed from atleast 5-6 miles from a major airport. These two wings were flying in very closeformation, so close it looked like their wingtips could touch if they moved anycloser. The one on the right was a little ahead the one on the left. Therewere no lights save for those along the wing edges, possibly six on each craft.The lights were white, with a steady glow. There were no blinking wing lights atthe tips, there were no tail lights, body lights and headlights, blinking orotherwise, as a passenger jet would have, even viewed from this position andaltitude. They made absolutely no noise. Even above the roar of highway trafficI could hear airplanes and it wasnt particularly too noisy at this time. Thecraft were slightly different in wing angle from each other. There was no trailof any kind coming from either craft. I did not let my gaze waver from them asthey continued their flight north. The craft on the left then moved slightlyahead of the one on the right and then they both disappeared into the cloudcover. This whole incident lasted for about a minute. I was quite calm, yetwith a quiet fasination. After all was said and done, I raced indoors,excitedly telling those inside that I just just seen a UFO. They were a bitbemused, yet happy for me, but not one body raced out to see. I guess, as isusual i"],"Weather Factors":"Unknown","Region":"Oregon","Date of the Event":"11/30/1981 12:00 UTC","trends":["There have been 4 other sightings in Sherwood","There were no other sightings in Sherwood on or around November 30th 1981"],"Tags":"City","Case Number":"2367"}