{"files":["/var/www/straped/mufon/html2text/23678.html.txt","/var/www/straped/mufon/org/23678.html"],"Date Submitted":"06/09/2010 03:47 UTC","Case Number":"23678","Tags":"City","trends":["There has been one other sighting in Welch","There were no other sightings in Welch on or around August 1st 1976"],"Longitude":"-81.581911","Summary":"about 2'-6\" wide 2 foot tall .disc shaped . glowing . no lines or letters","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.437191,+-81.581911(23678)&iwloc=A&hl=en\"> mufon case (23678) map </A>","Source":"MUFON","Date of the Event":"08/01/1976 03:15 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","City":"Welch","Object Features":"Unknown","Log Number":"US-06092010-0012","Region":"West Virginia","Object Shape":"Disc","Disposition":"Unknown","Viewing Distance":"21-100 Feet","divs":["sighting detailsdogs woke me up at three a.m. looking out back door looking up small hill at dogs barking .seen glowing object zig-zaging thu the trees coming down the hill . zig ziging about two feet off ground came to fence rose up over fence back down. zig zaging to within 25 feet stoped. my dad came from behind me stood looking at this . object zig zags back up hill up over fence back down zig zaging up though trees out of site. whole time dogs in a fenced in dog lot barked unstoped. the object moved slowly.took about 12 min. to go about 100 yards out of site.we talked about this sighting till daylight went up the hill to top with dogs was a opening where loggers once worked years ago. the dogs ran around barking in this clearing\\ buy we saw nothing.i was 14 at the time my dad never talked about this much he passed away last year. at the time we thought this was a probe of some kind an a bigger ship was in the clearing i guess ill never know but we saw a small glowing object that night has any one else seen a object like this. there was no sound coming from the object just loud barking"],"Latitude":"37.437191","Weather Factors":"Unknown"}