{"map":"<A HREF = \"http://maps.google.com/maps?q=34.077811,+-117.935153(23676)&iwloc=A&hl=en\"> mufon case (23676) map </A>","Date of the Event":"08/20/2000 12:00 UTC","divs":["Sighting DetailsMy condo faces the west. My wife was upstairs, I was downstairs. My wife yelled to me, \"Look at that!\" I looked out the patio door and saw three bright lights to the west. They were at a 45 degree angle, not very high in the sky, about a mile away. They were very close and silent. They were in a triangle formation (one at the top two below). The lights were equal size and brilliance. I stared at them for a couple of minutes. Suddenly, all three lights moved south about a quarter mile and stoppoed. The left bottom light flew west at a tremendous speed parallel to the earth and out of view. The other two lights stayed in place. After a minute or two, the third light returned as fast as it left. it stopped in place without a sound. All three lights move dnorth to their original position. The top light flew straight up at an unbeleivable speed until iy became as small as a star and disappeared into space. Me and my wife were yelling and screaming in excitement the entire time. Next, the other two lights, one at a time, took off int the same direction as the first and diappeared into space. I knew the object was a UFO. No sonic boom. Some time later, the news reported the objects as UFO's at the Military Air Show and showed them on TV \"once.\" I waited to record the next news broadcast. Never heard it again. Can't find anywhere."],"Summary":"Three seperate bright lights","Log Number":"US-06092010-0010","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23676.html.txt","/var/www/straped/mufon/org/23676.html"],"City":"West Covina","Case Number":"23676","Viewing Distance":"Unknown","Region":"California","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"06/09/2010 01:26 UTC","Object Shape":"Circle","trends":["There have been 7 other sightings in West Covina","There were no other sightings in West Covina on or around August 20th 2000"],"Longitude":"-117.935153","Country":"United States","Latitude":"34.077811","Disposition":"Unknown","Tags":"City","Object Features":"Undisclosed","Source":"MUFON"}