{"City":"Atlanta","Region":"Georgia","Date Submitted":"06/10/2010 01:00 UTC","Source":"MUFON","Disposition":"Unknown","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/23689.html.txt","/var/www/straped/mufon/org/23689.html"],"Case Number":"23689","Summary":"Circular object with 8-10 lights beneath it hovering in one spot near busy intersections in Atlanta , Ga.","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"101-500 Feet","Log Number":"US-06102010-0006","Tags":"City","Date of the Event":"06/09/2010 08:36 UTC","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Longitude":"-84.381632","Latitude":"33.751405","map":"<A HREF = \"http://maps.google.com/maps?q=33.751405,+-84.381632(23689)&iwloc=A&hl=en\"> mufon case (23689) map </A>","Object Features":"Unknown","trends":["There have been 95 other sightings in Atlanta","There was one other sighting in Atlanta on or around June 9th 2010"],"divs":["sighting detailswe were traveling in a car heading north onto the ramp of i-75\\85 north from peachtree road. i was sitting in the passenger seat of the car and noticed lights in the sky. that caught my attention. i looked above and saw a circular metal dome shaped craft with 8 -10 bright lights beneath it. it was about 8:45 p.m and not dark yet so it was clearly visable. the only problem was that we were traveling at about 60 mph and could not pull over on such a busy highway onramp to re-look at it. i noticed it was odd because it was not attached to any poles or towers. i thought at first maybe they were lights from a tower, however when i focused on it again, i clearly saw that it was not. the object seemed to be about 200 feet in the air to the right (from my perspective), of a 4 -5 story building. it was not very far up in the air, i thought maybe it was a blimp at first but once i focused on the object i saw the lights pulsating in a little and back out. it was just hovering not moving at all. it was very clear and because we could not stop the car, it was lost from my field of vision. we drove back about an hour later and it was gone. unfortunately i didnt go through my purse to get my phone-camera and take a picture because i didnt think about it at that exact moment, and i didnt want to take my eyes off of it. especially because i was trying to point it out to my friend driving the car, but he couldnt see out of my window that far up, and drive safely at the same time."]}