{"Source":"MUFON","Longitude":"-79.385323","Tags":"City","Weather Factors":"None","Latitude":"36.590342","City":"Danville","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.590342,+-79.385323(23680)&iwloc=A&hl=en\"> mufon case (23680) map </A>","Date of the Event":"06/08/2010 08:00 UTC","Summary":"Star like blurry red green and blue lights around center objects moved in relation to pulsed lights","Log Number":"US-06092010-0014","Country":"United States","Viewing Distance":"Unknown","Case Number":"23680","Object Shape":"Star-like, Triangle","Object Features":"Unknown","Region":"Virginia","trends":["There have been 7 other sightings in Danville","There was one other sighting in Danville on or around June 8th 2010"],"Date Submitted":"06/09/2010 05:36 UTC","Object Flight Path":"Path with directional change","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/23680.html.txt","/var/www/straped/mufon/org/23680.html"],"divs":["Sighting DetailsThis is the third (3rd) time this was seen. But his time there were several obejects and the same thing the night before. At first looking up at the objects they seems to move back and forth in a straight line. Looking throung binoculars the obects jerked, fade in and out and moved iradic. Looking at he what appeared to be the farthest object below it appeared 2 dimmer objects and in the area between the 3 could be seen a faint triangle object. I could not tell how far away these were no reference at night. Several large jet aircraft came into the area above and seemed to pay no mind to the UFO's but the jet aircrat came baack from a different direction still seeming to not pay attention to the UFO's. I was in my yard getting out of my car when I looked up at the stars and saw these objests. After viewing thes objects for I while I felt afraid. I came out side through the night looking up and the objects still there. I noticed that around where we live seems very quiet and Eerie, something is really wrong here. My wife also has seen these objects and perhaps they will be back tonight. I think they are watching us for some reason if they do how up I will repot this again but it is cloudy now and may remain so all night. There is an airport nearby but nothing as large as the jets that passed over could land or take off there reminds me of living on an airbase when we were kids as the airplays sounded like military jets. I got up around 3Am to see if the objects were still there they were I watched for a while and retired for the rest of the night maybe tonight I can see them again. I wonder if anyone else around my area has seen these? I also wonder if they are remote controled or piloted by inteligent beings?"]}