{"Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.257205,+-85.754946(23683)&iwloc=A&hl=en\"> mufon case (23683) map </A>","Longitude":"-85.754946","Log Number":"US-06092010-0017","Date of the Event":"12/31/1968 12:00 UTC","Region":"Kentucky","Object Shape":"Disc","Country":"United States","Case Number":"23683","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/23683.html.txt","/var/www/straped/mufon/org/23683.html"],"divs":["Sighting DetailsAs a child in Ft. Knox, KY, rather I was in 4th and 5th grade, I woke in the early morning hrs in my bunkbed. For some reason. Then I had the inclanation to go to the window that looked out back behind the Army housing. As I stood there at the window I saw a disc shape object, quiet, land in the field behind our Army housing. Next thing I knew I was waking up in the morning. At breakfast, i remember telling my mom and my sisters and brother about it and was very anxious to finish breakfast and go check it out, the area I saw it. My mother said, \"not till after breakfast\". I went out and ran to the spot where other kids were looking at the ground where a round \"dead grass\" circle was. I said,\"thats where something landed last night and they all started laughing at me. I dismissed all this. We moved back to SC and in later yrs had UFO sightings. Right off an Army base where we lived. Skip to adulthood in the Navy, 79-85. 22-28 yrs old. Married, 24-25 yrs old and my exwife had found a \"bb\" like object in my lower right leg. In my shin just above my ankle. There were times and instances of lost time that to this day, I cannot account for. I had gotten out of the Navy and had a bread route in Charleston, SC, living in Summerville when she found it, the bb. You could role it around in my leg but it would not leave that spot it was in. Skip another 10 or so years. Florida, divorced, living in SWFL, 1990. In the Navy reserves, St. Pete., Desert Storm duty in Mayport, FL. Had weird experiences with dreams, waking up with cold liquid running down my throat. Odd.. Move to 2007, auto accident that almost kills me. In the hospital for 45 days. Released, recovering since. Had quite a bit of damage but am managing okay. I noticed that the \"bb\" in my leg is gone. Just feels like a scoop mark where it was and now have one behind my right earlobe. I plan on having it removed and biopsy conducted. I'm putting this out in responce to NC female who has had this going on since she was five. You are not alone and, neither are we all, here on Earth. God Bless. J"],"City":"Louisville","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around December 31st 1968"],"Source":"MUFON","Object Flight Path":"Other","Date Submitted":"06/09/2010 10:12 UTC","Disposition":"Unknown","Summary":"landing","Weather Factors":"Unknown","Tags":"City","Latitude":"38.257205"}