{"Log Number":"US-06112010-0006","files":["/var/www/straped/mufon/html2text/23698.html.txt","/var/www/straped/mufon/org/23698.html"],"Country":"United States","Weather Factors":"None","Tags":"City","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","City":"Louisville","Longitude":"-85.753126","Summary":"Bright sphere moves under its own power","Date Submitted":"06/11/2010 04:28 UTC","Object Flight Path":"Hovering then path","Latitude":"38.253665","map":"<A HREF = \"http://maps.google.com/maps?q=38.253665,+-85.753126(23698)&iwloc=A&hl=en\"> mufon case (23698) map </A>","Disposition":"Unknown","divs":["sighting detailsi was taking a break from work and standing under a covered viaduct facing 5th st. (east) in downtown louisville, ky at 10:10 am june 10, 2010. i looked up in the sky (east) and saw a brilliant white sphere\\orb in the sky. the location was b\\w 2 downtown towers (pnc tower and aegon tower). i noticed the object b\\c it shown against a very blue sky, in b\\w 2 airplane contrails. at first i thought it was a light refraction off of a plane or a light shining off a mirror. the object moved side ways left to right, then up and down, almost as if it was floating in the sky. the color of the orb never changed, bright white. the object \"hovered\" for approx. 15 seconds, then shot off to the east at a fast pace. upon seeing the object, i wanted to grab a witness and ask them to verify. i felt that what i saw was indeed under its own control or intelligently controlled. at best i can estimate the height at 10 - 15,000 ft. it was a clear day, no clouds in the sky minus the contrails. this made viewing the object very easy. during the viewing i mostly felt curious, even waving my arm to the object to come closer. i came outside on june 11 at the same time to see if i could see the object again. it did not reappear."],"Region":"Kentucky","Date of the Event":"06/10/2010 10:10 UTC","Case Number":"23698","Sighting Duration":"Undisclosed","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around June 10th 2010"],"Object Shape":"Sphere"}