{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.261233,+-95.990218(2369)&iwloc=A&hl=en\"> mufon case (2369) map </A>","files":["/var/www/straped/mufon/html2text/2369.html.txt","/var/www/straped/mufon/org/2369.html"],"Region":"Nebraska","Case Number":"2369","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/22/2003 12:00 UTC","Sighting Duration":"00:05:00","Date of the Event":"06/22/2003 12:00 UTC","Latitude":"41.261233","Summary":"Formation 3 Lights, 5 Discs then 5 Discs again, 1","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWent outside to get boots from my truck. Looked up and saw at first what Ithought was a satallite moving SSE to NNW and then realized there were 3 uniformlights moving at a high rate of speed in uniformity. I watched them until theywere to the north horizon. Looked back up and saw a formation of 5 aura hazedwhite disc shape obects traveling at a high rate of speed following the sametrajectory as the first set of lights. Ran in the house and yelled to 2 otherswhat I was seeing and ran back outside. Looked up an saw a 2nd group of 5 aurahazed white discs moving at the same rate of speed and trajectory. The twoothers ran out and I pointed the group of lights out to them. The group oflights still moving formed a V pattern and then regrouped into a cluster. Theother 2 went back in. Fascinated, I keep looking up hoping to see more. About1 minute later, a single whiteredish light went by...same trajectory and speed.Dont know how to figure my long and latt for the report sorry. I heard nonoise. I have always beleived in UFOs and wanted to see one. I know what ameteor, shooting star, satellite, commercial airliner, airplane or helicopterlook like moving across the night sky. I also know that when I looked straightup what I saw was not anything I have ever seen before. I have read watchedmany UFO reports, videos, pics etc... for many years. I know what I saw andwhat I saw were UFOs, 14 of them. I hope others report the same sightings forthe same night for this area."],"trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around June 22nd 2003"],"Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unknown","Object Shape":"Disc","Object Features":"Other","Log Number":"","Longitude":"-95.990218","City":"Omaha"}