{"Object Flight Path":"Straight-line path","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.676883,+-111.890628(23697)&iwloc=A&hl=en\"> mufon case (23697) map </A>","Longitude":"-111.890628","City":"Scottsdale","Disposition":"Unknown","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around May 23rd 2010"],"Weather Factors":"None","Tags":"City","Latitude":"33.676883","Log Number":"US-06112010-0005","files":["/var/www/straped/mufon/html2text/23697.html.txt","/var/www/straped/mufon/org/23697.html"],"Object Shape":"Sphere","divs":["Sighting Details My family and I were visiting some friends in North Phoenix for the Memorial Day weekend. It was about 90 degrees, crystal clear with a very slight breeze. We were all in the pool when I saw a large very bright sphere floating over the top of Lookout Mountain moving east. It was approximately 500' above the top of the mountain puting it at about 1500' above us. I jokingly pointed and said \"UFO\". Everyone laughed and we tried to think of anything else it could be. A silver Mylar balloon, too big. A hot air Balloon, no basket, too shiny. Definately not a plane or helicopter. We settled on a bunch of silver Mylar balloons tied together. My issue was that it was too big to be balloons. It moved very smoothly and was completely unaffeced by wind. It traveled in a perfectly straight line and did NOT appear to gain altitude as a balloon would. It didn't appear to have any lights but reflected the sun like a mirror. Given the location of the home we were at, the object was visible for 15 to 20 minutes. It traveled east north east. We could see the object reflecting sun light when the object had to be 20 miles away. We could see it travel over the Tonto National Forest mountain range (love Google Maps). No way any number of Mylar balloons would be visible at that distance. We ultimately lost sight of it when it dipped below the horizon."],"Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Summary":"Highly reflective sphere approx 20' to 30' in diameter.","Case Number":"23697","Date of the Event":"05/23/2010 04:00 UTC","Sighting Duration":"Undisclosed","Date Submitted":"06/11/2010 04:21 UTC"}