{"Object Features":"Dome","Longitude":"-154.483482","Tags":"City","divs":["Sighting DetailsThis is second hand information and the adults who witnessed this are probably long gone. Details are sketchy, but the witness claims there are a few people who have corroborated the story. As told to me by a the adult who was a child at the time: --- It was night time and few folks stepped outside to witness some lights in the sky. They turned out to be beams coming from two saucer shaped objects hovering over the Mendenhall glacier. They appeared to be scanning down at the glacier. They must have been over the area for a good 20 minutes while folks looked on. One elderly neighbor observed it with his telescope and confirmed mater of factly that it was a UFO. No sound and nothing that resembled a helicopter. It was watched until all of a sudden the 2 craft just instantaneously speed of in opposite directions. --- I was more shocked at who was telling me this story since it seemed way out of character so I didn't pay enough attention to the date and times. The witness was about I'd say 10 years old at the time (now mid 50's) and it was definitely dark outside. Maybe early morning hours. Anyway, I'd be interested to know if there are any more living witnesses to back up this story."],"Country":"United States","Summary":"2 UFO's over the Mendenhall Glacier witnessed by many, 1 with a telescope","files":["/var/www/straped/mufon/html2text/23694.html.txt","/var/www/straped/mufon/org/23694.html"],"Log Number":"US-06112010-0002","Date of the Event":"Unknown","Viewing Distance":"Unknown","Disposition":"Insufficient Data","trends":[],"City":"Undisclosed","Source":"MUFON","Weather Factors":"None","Object Shape":"Disc","Sighting Duration":"Undisclosed","Date Submitted":"06/11/2010 01:30 UTC","Object Flight Path":"Stationary,Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=63.591053,+-154.483482(23694)&iwloc=A&hl=en\"> mufon case (23694) map </A>","Region":"Alaska","Latitude":"63.591053","Case Number":"23694"}