{"Source":"MUFON","Viewing Distance":"101-500 Feet","Object Shape":"Chevron, Triangle","Longitude":"-79.437799","divs":["Sighting DetailsI was debating on setting up one of my telescopes for a little astro-photography session. While looking towards Antares in Scorpius to judge the seeing conditions I saw what at first appeared to be an airplane. I am within a mile or two of the local airport so I see planes all the time. What caught my attention was the red flash you usually see on the planes tail. Once I glanced over to it I saw a blue glow all around it with a red light in the middle. It really looked like a gas burner you see on stoves flipped over and flying through the air. The blue glow part of it however seemed more like it was contained somehow in a very uniformed pattern and the middle was more an orange color that flashed red on occasion. The blue was really attractive and reminded me of the blue sparks you see from high voltage power line's when they bump each other and cause a spark. The red light in the middle flashed once more and the whole object was gone. It appeared to be very close to the flight path from the airport and was heading in a northerly direction. It was over a nice bunch of trees before it vanished and did not seem to be more than 500 - 1000 feet off the ground. It made no noise whatsoever and I stood still for a few minutes afterwords trying to rationalize what I just saw. Before coming in a real plane happened to fly over so I was able to rule it out as being plane but it also assisted me in estimating its size. I would say it was about 4 times the size of the single engine small planes that fly from the airport, both in length and width. most of the planes are Cessna's but there are a couple of gulf-streams jets that fly from there too and it would have been about twice the size of the gulf stream. I drew a picture as soon as I came in and attached it in hopes someone has seen something similar."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.095692,+-79.437799(23706)&iwloc=A&hl=en\"> mufon case (23706) map </A>","Weather Factors":"None","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/23706.html.txt","/var/www/straped/mufon/more/23706_submitter_file1__ufo1.jpg","/var/www/straped/mufon/org/23706.html"],"Date Submitted":"06/12/2010 01:36 UTC","trends":["There have been 3 other sightings in Burlington","There were no other sightings in Burlington on or around June 12th 2010","This sighting has been favorited 1 time.",""],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Summary":"Blue Flames like Triangle Shaped Object Disappeared in thin air","Region":"North Carolina","Latitude":"36.095692","City":"Burlington","Disposition":"Insufficient Data","Tags":"City","Case Number":"23706","Log Number":"US-06122010-0004","Country":"United States","Date of the Event":"06/12/2010 11:48 UTC"}