{"files":["/var/www/straped/mufon/html2text/23707.html.txt","/var/www/straped/mufon/org/23707.html"],"Object Shape":"Star-like","Case Number":"23707","Sighting Duration":"00:15:00","divs":["Sighting DetailsWell I get off work at 11:00 P.M. and tend to look at the stars and other celestial bodies, as I am a amateur astronomer and know my way around the sky a bit. I have seen many strange objects here in Oregon in our crystal clear night sky, tonight was a bit stranger than usual. It was 11:10 and I was on the north side of HWY 97 facing the road coming out of my work just south of Bend, OR. I took a look up at the stars and saw what I thought to be a satellite or the I.S.S. However it could not be the space station due to the fact that it travels east to west... and this was a blueish colored object that was almost directly south and moving towards the east. Also it could not be a satellite since it instantaneously stopped and began to move west, and started to perform perfect counter clock-wise circles. After that it began to zig-zag in various directions and more circles which felt to me to be almost as if it were dancing in a way. It broke all the basic laws our aircraft are based upon, and looked as if it were just outside the atmosphere. I watched this \"dance\" for about 10-15 minutes and would have continued to until a local sheriff came by and asked if I needed help. I left and pulled off on the next Highway exit and got out to see it was still there, I tried to get home and get my binoculars but it had gone when I got back to my place. I felt it was there for me to see, that is the only way I can describe it."],"Country":"United States","Log Number":"US-06122010-0005","Summary":"Blueish star-like object seen south of bend performing counter-clockwise circles and zig-zagging","Object Flight Path":"Path with directional change,Other","Viewing Distance":"Over 1 Mile, Unknown","Region":"Oregon","Object Features":"Unknown","Longitude":"-121.30965","Tags":"City","Source":"MUFON","Weather Factors":"None, Does Not Apply","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=44.062053,+-121.30965(23707)&iwloc=A&hl=en\"> mufon case (23707) map </A>","Latitude":"44.062053","Date of the Event":"06/11/2010 11:10 UTC","trends":["There have been 20 other sightings in Bend","There were no other sightings in Bend on or around June 11th 2010"],"City":"Bend","Date Submitted":"06/12/2010 04:49 UTC"}