{"Date of the Event":"06/10/2010 08:00 UTC","Object Shape":"Sphere","Viewing Distance":"Unknown","trends":["There have been 95 other sightings in Atlanta","There was one other sighting in Atlanta on or around June 10th 2010"],"Disposition":"Unknown","Region":"Georgia","divs":["Sighting DetailsStanding outside taking puppy out and pulsating light above caught my attention. At first I thought it was just an airplane but as I watched it there were no wings and no other lights as planes have and it was way too low to be a plane, and the light made it clear that it was a perfect sphere. Then I thought maybe helicopter but my husband came out and said it couldn't be, there was no sound and the light was not anything explainable.The pulsing was a very intese white light then to nothing. It continued moving South west very slow and the pulsing was continuous. I noticed a smaller light hovering underneath that didn't appear to be attached. At a certain point it slowly traveled more to the left, and change in path too hard for a plane to do, over the tree line at a field behind my house. Then it moved even more over to the left and seemed to hover in that area for a few moments and then it was gone. We were constantly moving to maintain a clear view and there is no way this was explainable. The light underneath never moved,it was with the object the whole time. Sadly my phone was in the house and I didn't want to take my eyes off it, not sure if I should beleive what I was seeing. There was lightening in the distance. And I could see stars although in our area there were some clouds. We did confirm the diffenece with several airplanes that passed at different times and there was a total difference. Where we are locATED We can see the shapes and lights of planes easily, and there is always sound, with this there wasn't and it moved in odd ways and disappeared without decending."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.757635,+-84.378902(23701)&iwloc=A&hl=en\"> mufon case (23701) map </A>","Date Submitted":"06/11/2010 09:18 UTC","Country":"United States","Log Number":"US-06112010-0009","Case Number":"23701","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Longitude":"-84.378902","Latitude":"33.757635","Tags":"City","Sighting Duration":"00:08:00","Object Features":"Other, Unknown","Source":"MUFON","Summary":"Large pulsating white sphere","City":"Atlanta","Weather Factors":"Lightning, Light","files":["/var/www/straped/mufon/html2text/23701.html.txt","/var/www/straped/mufon/org/23701.html"]}