{"City":"Vail","Weather Factors":"None","Log Number":"","Date of the Event":"06/21/2003 06:33 UTC","Case Number":"2371","Object Features":"None","divs":["Sighting DetailsI am a MUFON member and work as a security guard at the Vail Valley MedicalCenter. I had just gotten home from work at 630PM and was going back to my truckwhen I looked up and saw the object. Being a MUFON member and having had UFOsightings in the past I often scan the skies. I noticed a round object thatappeared about the size of a 18 BB at arms length. It was silverywhite in colorand was moving slowly to the southeast, away from me. At one point it appearedto slow to a stop, before continueing to the southeast where it eventuallyfaded. I did have a chance to grab my 35mm camera and took two pictures usingthe telephoto setting, which unfortunately is not real powerful. At first Ithought it might be a large balloon, and as there was no appreciable wind at thetime I could not be sure. There were a few wispy clouds that did not appear tobe moving while I watched the object. About 20-30 minutes after my sighting thewind did pick up and I could see wispy clouds moving to the northeast, at aright angle to the direction I saw the object going. Duration of the sightingwas about 5-6 minutes from 633PM to 638PM."],"Source":"MUFON","Summary":"Sighted a silverywhite round object in daylight","Country":"United States","Disposition":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"39.640264","Date Submitted":"06/21/2003 06:33 UTC","Sighting Duration":"00:05:00","trends":["There have been 13 other sightings in Vail","There were no other sightings in Vail on or around June 21st 2003"],"Longitude":"-106.374196","files":["/var/www/straped/mufon/html2text/2371.html.txt","/var/www/straped/mufon/org/2371.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.640264,+-106.374196(2371)&iwloc=A&hl=en\"> mufon case (2371) map </A>","Tags":"City","Region":"Colorado","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}