{"Case Number":"23712","Weather Factors":"Windy","Date Submitted":"06/12/2010 07:05 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around June 6th 2010"],"Sighting Duration":"Undisclosed","Date of the Event":"06/06/2010 11:00 UTC","Object Flight Path":"Hovering then path","Country":"United States","files":["/var/www/straped/mufon/html2text/23712.html.txt","/var/www/straped/mufon/org/23712.html"],"Summary":"witnessed an orb or sphere shaped object hovering below the clouds","divs":["Sighting DetailsAt 11:00 am my daughter and I decided to eat at the china buffet by walmart (near eastgate mall rt 32). Upon entering the parking lot I noticed a round object hovering in the distance. It seemed odd because it was about the same hight as the lightposts in the parking lot but the lights on them were all square. I pointed out the object to my daughter and asked if she could tell what it was.I parked the truck and we got out and continued to observe it. It was pretty windy that day coming out of the norwest to the south east. The path of the object was in a northern direction. it was below the clouds and the wind didnt seem to have an affect on its speed or direction. The sphere was a fairly large object but moving rather slowly. there were no contrails from a jet and it was too large to have been a prop type plane. At times it seem to get very light in color till you almost couldnt make it out then it would become darker and more visible.we continued watching it until it was out of view from where we were. I called the clermont county airport and sheriffs dept to see if anyone else had spotted this. Niether of them had recieved other reports.I asked the person with whom I spoke at the airport if it could have been a possible hot air balloon..he said it would be unlikely for the wind conditions..I didnt notice a gondola on the sphere anyway. He said it could have been a large plane. I didnt see any wings, fuselage etc. I didnt have a camera with me just my cell phone so no picture was taken."],"City":"Cincinnati","Object Features":"None","Longitude":"-84.50435","Region":"Ohio","Object Shape":"Circle, Sphere","Log Number":"US-06122010-0010","map":"<A HREF = \"http://maps.google.com/maps?q=39.104548,+-84.50435(23712)&iwloc=A&hl=en\"> mufon case (23712) map </A>","Latitude":"39.104548","Tags":"City","Disposition":"IFO"}