{"Tags":"City","City":"Memphis","Object Shape":"Circle, Disc, Oval, Sphere, Star-like","Disposition":"Unknown","Country":"United States","Object Features":"Other","Weather Factors":"Unknown","divs":["sighting details in mid-november 10pm of 1964, i was asked by my mother to take out the garbage. i went out back and i noticed a bright white full moon above. i look closer and i noticed it had uniform whiteness so i could not see the shade of white or grey that made the \"man in the moon\" face. it was equally as bright as the normal full moon, bright enough to create a moon shadow. i looked around and i noticed another moon bright orange rising over my neighbor's house to the east across the street as i looked from the backyard thru the side yard to the front. it had the features that created the man on the moon so i felt it was the real moon. i looked above again and stared at the white full moon for a few minutes the it made a rapid ascent in the sky. as it rose it became smaller until it appeared to look like a bright star, then dim star, then disappeared into space. it reminded me of the star of bethleham when it was at high altitude. i was only seven when i witness the ufo i call the moon of memphis. i had a good memory of the event so when i grew up and joined the air force as a navigator, i was able to analyze the event better with my aviation experience. i estimated that the moon of memphis was at twenty thousand feet and was about ten acres in size. i developed this information from watching the ascent of the moon of memphis and remembering that it also passed through some high cirrus clouds that i estimated was at sixty thousand feet. at twenty thousand feet it would have taken four 747 aircrafts parked in a circle to cover the area of the moon of memphis ufo thus creating a ten acre size estimate. when i saw it above me it was exactly the size of the real full moon when seen high in the sky. [cms\\tg\\pid] capt usaf \\ lt uscg retired"],"Case Number":"23721","Log Number":"US-06132010-0002","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23721.html.txt","/var/www/straped/mufon/org/23721.html"],"Longitude":"-90.046656","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Date of the Event":"11/15/1964 10:00 UTC","Latitude":"35.203847","Date Submitted":"06/13/2010 02:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.203847,+-90.046656(23721)&iwloc=A&hl=en\"> mufon case (23721) map </A>","trends":["There have been 62 other sightings in Memphis","There were 3 other sightings in Memphis on or around November 15th 1964"],"Region":"Tennessee","Summary":"Full moon in appearance rose up to be bright star then disappeared in sky","Viewing Distance":"Over One Mile"}