{"divs":["Sighting DetailsAbout midnight, sat down on side of bed to go to bed. Noticed a yellowish light beam - such as a car turning around would project - shined on the house. No way is that possible I thought and got up to see. Saw a blue-white light glowing from overhead...and flashing....like heat lightning. Could not see the sky directly due to an overhanging balcony in the way. Wondered why the \"heat lightning\" stayed so long in that one place...and began watching the flashing white orbs out my window. Knew they were w-a-y too large for fireflies, I kept trying to figure out what they were as they blinked off and on. The overhead blue-white glow was also off and on again and still seemed like heat lightning. It had rained earlier and would rain again, but it was not hot enough for heat lightning I figured. Still watched the orbs and they were floating 2nd floor high - where I was. They seemed to cover the 125-150 feet of the driveway out in front of the 2nd floor deck...about 20 of them flashing off and on and moving about a bit. Some a bit higher but mostly right in front of me. Surrounded by woods on all sides it was very dark. Wasn't sure how much cloud cover was involved but I noticed I could see the glow of the city lights over the mountain top. I just could not figure it out. Was a bit scared and alot confused at what was going on. Was wondering why my dog was not barking. Then I wondered if something had happened to him. Also, thought it may have been out of his line of sight from inside the garage. No sound. Just \"heat lightning\" sporadic flashes from above that corner of the house and those moving flashing white softballs...mostly at eye level with some seemingly a bit higher. One actually was a little farther out perhaps, but still close enough to be in the group. Decided to get a flashlight and go up one floor and step out onto that balcony to see if I could see people or anything. Noticed it was dark in back side of the yard as I passed the back door. Got upstairs and all I saw was dark. Nothing. Returned, none the wiser, to the second floor where I first witnessed this, closed the curtain and went to bed. Having recently lost a pet, for the next two days I tried to find information on pets that have recently died passing over to the other side. I was wondering if that was what I had witnessed, but too many lights, also too large actually to be pet souls as research suggested. I could find nothing close to that event in searching for information in that direction. Finally told someone after 3 days. They found online a similar happening to mine that had been reported on a UFO site last year. Light-bulb-moment: Having ruled out the pet transition theory, I now am searching for UFO information."],"Log Number":"US-06132010-0015","Object Features":"Undisclosed","Object Shape":"Flash, Sphere","Date Submitted":"06/13/2010 07:17 UTC","Source":"MUFON","Summary":"Flashing/floating white softball-sized orbs and blue-white lightning overhead.","trends":["There have been 7 other sightings in Hot Springs","There were no other sightings in Hot Springs on or around June 10th 2010"],"Case Number":"23735","Tags":"City","files":["/var/www/straped/mufon/html2text/23735.html.txt","/var/www/straped/mufon/org/23735.html"],"Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=34.531946,+-93.032586(23735)&iwloc=A&hl=en\"> mufon case (23735) map </A>","Disposition":"Insufficient Data","Longitude":"-93.032586","Weather Factors":"Unknown","Country":"United States","Date of the Event":"06/10/2010 11:59 UTC","City":"Hot Springs","Object Flight Path":"Undisclosed","Sighting Duration":"00:20:00","Latitude":"34.531946","Viewing Distance":"Unknown"}