{"Object Flight Path":"Straight-line path","Summary":"Bright white sphere. under clouds, traveling extremely fast from south to north.","files":["/var/www/straped/mufon/html2text/23731.html.txt","/var/www/straped/mufon/org/23731.html"],"City":"Thomaston","Date of the Event":"06/12/2010 10:45 UTC","Country":"United States","Sighting Duration":"00:00:03","Latitude":"32.891988","trends":["There has been one other sighting in Thomaston","There were no other sightings in Thomaston on or around June 12th 2010"],"Source":"MUFON","Log Number":"US-06132010-0011","Tags":"City","Disposition":"Unknown","Case Number":"23731","Viewing Distance":"Unknown","Object Shape":"Sphere","Object Features":"None","Weather Factors":"Unknown","Longitude":"-84.318085","Date Submitted":"06/13/2010 04:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.891988,+-84.318085(23731)&iwloc=A&hl=en\"> mufon case (23731) map </A>","divs":["sighting detailssitting in back yard, facing western sky, looking at stars, fairly clear weather, scattered clouds, but good visibility, 10:30pm. at 10:45pm, a very white bright sphere appeared to my left, in south sky, approx 45 degree angle looking up, and traveled to north. what got my attention, was the brightness, the tremendous speed it was going, no noise, in a straight line, no trail. it was under the cloud cover, as i observed it the entire time which was only approx 3 seconds to cover the distance from south to north across the entire sky. i knew it definately was not a jet, as the speed was tremendous, it was, i'd estimate at a height and size of a jet passing by, but way too fast. my thought was perhaps a satellite. any response to what you may think this was, will be appreciated. thank you. i also when i first noticed it, thought it was a falling star, or meteorite coming down, but there was no change of color, no trail, no deviation in its path. at that speed, could only think ufo. after it passed north to my right, it just disappeared into the sky. i sat for another half hour, and observed the sky, wondering if i should contact you, and if anyone else reported such a sighting. thank you for your time. (* deleted wit's name, sgonzalez\\cms)."],"Region":"Georgia"}