{"Disposition":"Unknown","Summary":"Hovering, large bright light in sky shrinks down to star size, flies briefly, shoots upward, disappears.","Region":"Oregon","City":"Portland","Case Number":"23746","Latitude":"45.525622","Object Features":"None","Viewing Distance":"Unknown","Log Number":"US-06142010-0006","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Object Shape":"Star-like","Tags":"City","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around June 13th 2010"],"Longitude":"-122.669067","Date Submitted":"06/14/2010 01:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.525622,+-122.669067(23746)&iwloc=A&hl=en\"> mufon case (23746) map </A>","Date of the Event":"06/13/2010 10:30 UTC","divs":["Sighting DetailsI was sitting in my backyard on the evening of June 13th, 2010. It was around 10:30 pm and a very clear night in Portland, Or. The stars had just started to come out as it gets dark later and later this time of year. It was a beautiful evening and my eyes were drawn to the sky. There is a lot of air traffic in Portland with the airport and I am quite familiar with the speed and looks of airplanes at night. There was the usual air traffic here and there: slow moving planes with their lights blinking and flickering in the distance. There was a pause in air traffic and the sky was calm. I noticed a small, star-like object out of nowhere moving very fast across the sky from the south heading north. I was facing east with the big dipper directly behind me. There was no special shape to it. It was not glowing in any way. There was no tail like a shooting star or comet. There were no lights at all. It wasn't blazing across the sky but moving at a steady, faster-than-a-plane speed. It soon went out of eye-view (trees,etc.). I thought it was interesting but kind of just shrugged my shoulders. About ten minutes later I saw the same thing. Again, I didn't see where it came from but it had the same flight pattern, flew fast across the sky, and disappeared from view. The object did not change direction while flying from its original path. After seeing it a second time, and eliminating all possibilities, I thought that I may be witnessing something here so I got a little more excited. My eyes were now glued to the sky in this area. Around 10:30-10:45 pm is when I could officially tell myself I witnessed a UFO. Looking up at the sky (SE direction) I saw an extremely bright light that had the appearance of the North Star only about 10 times brighter and much bigger. It was so bright I had to squint...AT NIGHT! My mouthed dropped as the massive glow shrunk down to the size (like a dimming light) of the two previous \"crafts.\" It streaked across the sky at the same speed as the others on the same flight path. This time before disappearing out of eye sight it deviated from its original northern path, started flying UP into the sky and literally disappeared; not out of eye-sight, it just vanished up into the sky. I felt overwhelmed with what I had witnessed but also extremely lucky. I felt very fortunate to have just witnessed the strangest, most exciting thing ever. Again, there were absolutely no lights flickering or blinking. It was not a shooting star or a comet. I know what those look like. No cigar or v-shape, etc. I am not a person that thinks any strange object in the sky is a ufo. I have never thought to having seen a ufo before nor have I reported anything like this before. My eyes will be glued to the sky in the nights ahead!"],"files":["/var/www/straped/mufon/html2text/23746.html.txt","/var/www/straped/mufon/org/23746.html"],"Weather Factors":"None"}