{"Case Number":"23745","City":"New York","divs":["Sighting DetailsMy friends and I were walking on New Dorp Beach, in Staten Island, New York (one of the five boroughs), and we looked up to stargaze, and instead see strange lights in a clear night sky. The pattern of lights was consistent with a tail light (color purple-ish), two wing lights (a strange white color), and a center light (red to green). What was most frightening to us was the sound- or rather lack of any. The bottom was black and sleek, almost as if it were an sr-71 blackbird, although current technology does not allow for flight ascending directly upwards and downwards, and does not allow for sudden almost sonic speeds. It seemed to slow as it was above us, the lights in the front became three white headlights, and it was followed by an obviously American military jet. This craft has been spotted in many different areas on Staten Island. It's one thing to run a military test run, but it's completely another to see a military jet actually chasing an unknown craft. I haven't the slightest clue whether it was of a terrestrial or extraterrestrial nature, but quite frankly it's been seen quite often. It was both wonderous and frightening, we were all mesmerized. We lost sight of the craft after it sped away in a curious diagonal pattern. I apologize for lack of any photographs, we figured that if it were military, the last thing college students want is to be investigated due to photos of military craft."],"Region":"New York","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-06142010-0005","Latitude":"40.588242","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/23745.html.txt","/var/www/straped/mufon/org/23745.html"],"Tags":"City","Disposition":"Unresolved","Date of the Event":"06/12/2010 12:00 UTC","Country":"United States","Summary":"New Dorp Beach fly over- low enough to see the bottom of craft.","Object Flight Path":"Undisclosed","Object Shape":"Other","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around June 12th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.588242,+-74.140301(23745)&iwloc=A&hl=en\"> mufon case (23745) map </A>","Date Submitted":"06/14/2010 01:20 UTC","Object Features":"Undisclosed","Longitude":"-74.140301"}