{"Longitude":"-117.913174","map":"<A HREF = \"http://maps.google.com/maps?q=33.843403,+-117.913174(23748)&iwloc=A&hl=en\"> mufon case (23748) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"06/14/2010 02:11 UTC","divs":["Sighting DetailsI was driving northbound on the interstate 5 with my father and girlfriend leaving a family get together. We were still in Orange County, just passing Disneyland when I noticed two very bright disc shape objects in the sky. They looked like a bright pink, not as bright pink as the sky around the objects. My first thought was these two objects were perhaps clouds, although there were no clouds at all in the sky. They looked to be about 500 yards between each other, both moving east. As we drove further down the highway they had become brighter and more disc like. It was at that point when we knew they were not clouds. We were watching these disc for about 7 minutes when the disc then moved west. One disc started approaching the moon it looked and when it had just passed the moon it slowly vanished and was completely gone which blew my mind. The other disc still appeared in the sky for only about two more minute when it started approaching the moon and then vanished like the other. At certain times it looked as if it had a fire type of trail behind it. I thought maybe it could be rockets but I have seen many rockets in my life and they were not like this shape and metallic color, and i have never seen any object in the sky vanish."],"Date of the Event":"06/13/2010 08:20 UTC","Disposition":"IFO","Object Shape":"Disc, Fireball, Oval","Log Number":"US-06142010-0008","Object Flight Path":"Path with directional change","City":"Anaheim","Tags":"City","Latitude":"33.843403","Source":"MUFON","Case Number":"23748","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around June 13th 2010"],"files":["/var/www/straped/mufon/html2text/23748.html.txt","/var/www/straped/mufon/org/23748.html"],"Country":"United States","Summary":"Two bright pink disc shape objects moving toward moon.","Region":"California"}