{"Date Submitted":"06/14/2010 02:24 UTC","Tags":"City","City":"El Paso","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around June 13th 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsIt was a ordinary Sunday night in El Paso Texas around 9:15pm and my father my brother and I were driving back home heading west.we were driving in the neighborhood area near home when My father then noticed a bright light in the sky and we all focused in on it. It was moving very rapidly through the sky way faster than any airplane or even jet could go and covered the whole sky from north to south in just a couple of seconds. As we watch it it began to get bright then dim much like pulsing I guess you could say then it began hover toward the south west area of town. As we watched trying not to lose sight of it a green beam began to beam at the bottom of it. I noticed at the bottom of it where the beam was the object appeared to be pointed more like a diamond. The object only had the beam out for about 3 seconds at the most and then just disappeared instantly. As we began to search for it it then appeared toward the west where it originally appeared. Then it raced across the sky to the north where it disappeared for good. As we arrived at some stop lights we noticed a border patrol helicopter that was unlit and following the path where the object seemed to fly through. We then raced home to try and see if we could get the object on video or binoculars.unfortunately there was no more activity in the sky but we all tried to believe what we just saw. We knew for sure it wasn't a airplane jet or helicopter or possibly some experiment from ft. bliss which is the army base here.I guess you could say this whole experience was like being in war of the worlds."],"Log Number":"US-06142010-0002","Sighting Duration":"00:04:00","Summary":"Saw a UFO race across the sky drop tractor beam and race back across sky and dissapears.","Source":"MUFON","Disposition":"Unknown","Latitude":"31.76111","Date of the Event":"06/13/2010 09:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.76111,+-106.485331(23742)&iwloc=A&hl=en\"> mufon case (23742) map </A>","files":["/var/www/straped/mufon/html2text/23742.html.txt","/var/www/straped/mufon/more/23742_submitter_file1__IMG_0364.JPG","/var/www/straped/mufon/org/23742.html"],"Country":"United States","Case Number":"23742","Object Flight Path":"Path then hovering","Object Shape":"Diamond, Disc, Star-like","Longitude":"-106.485331","Region":"Texas","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Features":"Undisclosed"}