{"Log Number":"US-06142010-0004","Disposition":"Unknown","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Cigar","Latitude":"45.878474","Date of the Event":"11/10/1975 12:00 UTC","Object Features":"Undisclosed","Source":"MUFON","Summary":"Daylight metalic strobe lights.","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in St Ignace","There were no other sightings in St Ignace on or around November 10th 1975"],"Region":"Michigan","Case Number":"23744","map":"<A HREF = \"http://maps.google.com/maps?q=45.878474,+-84.719168(23744)&iwloc=A&hl=en\"> mufon case (23744) map </A>","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23744.html.txt","/var/www/straped/mufon/org/23744.html"],"divs":["sighting detailsat about 8:00am i was traveling east on us2 just west of i75 just outside st ignace city limits. i saw what i thought was a low flying jet to my right (south). it interested me because there was no contrail. i turned left onto the service road that paralled i75 north. the object also turned and flew over i75 parallel to my car. the object matched my speed and i was able to observe that it was a cagar shaped matlic craft with a strobe light. i slowed down to get a better look at it but did not stop because i had my child with me. i looked away as i approched a curve when i looked back the craft was gone. at the time i had heard about ufo but did not know anything particular about them. i wasn't afraid but felt cautious. i called my mother and told her what i had seen. she said don't tell anyone. this was the same day that the edmond fitzgearld went down in the white fish bay in lake superior. i lived on campus at lake superior state college at the time and was working in st ignace. that evening i was listening to wsoo raido and began to hear reports of the sinking of the fitz. the raido announcer was also recieving reports of a ufo sighting near new burry michigan. the announcer became very excited and began to speculate as to wheather the ufo sightings and the sinking of the fitz were related. the reason i am reporting this now is that i have searched the internet for other sightings on 11\\10\\75 and have not been able to find any reports for that day and area."],"Date Submitted":"06/14/2010 10:52 UTC","Country":"United States","Longitude":"-84.719168","City":"St Ignace"}