{"Region":"California","files":["/var/www/straped/mufon/html2text/23749.html.txt","/var/www/straped/mufon/org/23749.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.068079,+-120.843935(23749)&iwloc=A&hl=en\"> mufon case (23749) map </A>","Summary":"2 discs hovering next to Highway 5 -taking turns going brighter and fading out, 1000 ft above and east of road. Daylight.","Object Shape":"Disc","Source":"MUFON","Latitude":"37.068079","Viewing Distance":"101-500 Feet","Object Features":"None","Log Number":"US-06142010-0009","Date Submitted":"06/14/2010 02:13 UTC","trends":["There have been 6 other sightings in Los Banos","There were no other sightings in Los Banos on or around December 20th 2002"],"Date of the Event":"12/20/2002 12:00 UTC","Weather Factors":"None","Tags":"City","Longitude":"-120.843935","Disposition":"Unknown","Object Flight Path":"Stationary","City":"Los Banos","Case Number":"23749","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsClose to Christmas in 2002 I and my 21 year old son (who was sleeping in the passenger seat) were traveling north on Highway 5 in California, coming up upon the turn off to Los Banos going west, still @ 40 miles from it. About 4:30 pm, still daylight. The sun was close to setting at that time and we were behind a set of low foot hills about 100-400 feet high on the west of the freeway. When I first spotted the discs a couple of miles ahead of me they were in the sunshine. My mind tried to match what I was seeing with any other known outlines of flying vehicles and they did not match anything I could come up with. I was amazed and curious as to why no one was stopping to look at them. I spotted 2 discs hovering above the highway on the east side, very close to the road, between 500-600 ft above. After about a minute of viewing them, I realized they were flying discs,as they did not look like any other thing I could recognize. For several miles I watched them taking turns fading in and out, continuing until I was going to drive right under them. By the time I reached them at 65 miles an hour both the roadway and the discs were in the early shade of the foot hills. Higher than that, it was still in sunlight. There was plenty of bright daylight left to see the whole scene. When I say brightening I mean that the whole disc got slowly brighter - not a single light fixture - and then the whole disc faded to the metalic look and the other one then lit up- they did not get too bright to look at - it was like they were on a reostat and it was slowly being turned on to about halfway. They were never really bright as if the sun was hitting them as when I first spotted them but more faded than that. I could not see that they were fading and lighting up until the shadow of the hills covered them. I awakened my son and asked if he saw them - which he did - and told him to look closely as we drove by and see if they were in any way teathered. He had good eyesight and unequivically said no, they were not teathered. He immediately went back to sleep and as soon as we had passed the spot I also completely forgot about them, until much later. The only reason I remembered is because I heard someone elses story about a similar happening to her the next day after I got to my destination. All of a sudden I realized that we had also seen that type of sighting only with 2 discs, one above the other and the lower one was slightly ahead of the other towards the road (but not directly over the road. The two were pretty much strattling each other) My son has never remembered the event. I don 't know if you want suppositions but I believe the fading in and out was sending out magnetic waves of forgetfulness so people kept right on driving instead of actually stopping along the freeway to gawk. The early shadow of the foothills just highlighted the brightening and fading of the discs. Not one other car on the freeway even slowed down to look at them."]}