{"Case Number":"23753","Tags":"City","Region":"Arizona","Longitude":"-112.068187","Object Features":"Undisclosed","Object Shape":"Circle","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date of the Event":"06/13/2010 03:45 UTC","files":["/var/www/straped/mufon/html2text/23753.html.txt","/var/www/straped/mufon/org/23753.html"],"Latitude":"33.456477","Disposition":"IFO","Summary":"White object in sky...followed by 3 objects leaving it.","City":"Phoenix","Sighting Duration":"Undisclosed","Date Submitted":"06/14/2010 08:23 UTC","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around June 13th 2010"],"divs":["Sighting DetailsI have been visiting with my wife her mother at St Lukes medical center for about a month now nearly daily. On Sunday June sixth I was walking around the hospital looking at the clouds while my wife and her brother spoke about there mother's health condition. I spotted very high in the sky a white \"round\" object acting as if it were caught in a dustdevil as it's movement was in a swirling pattern.It then flew down and then back to where I first spotted it.It looked to be a paper plate actually,but I knew it was very high and would have to be large,much larger than a piece of trash floating in the wind.It then started flying due north and I watched it disappear onto the horizon.It moved pretty quickly,but not much faster than a jet would move. Yesterday June 13 we were again at the hospital sitting outside smoking.My wife and father in law were talking for quite some time and I grew impatient and walked around the building to where I had seen the object the previous week.I looked up and at the same spot I saw what I thought was a military jet flying above my head,headed east,and right where I had seen it previously a white object was \"hovering in place.This time smaller and lower than the previous object.I watched this object head north just as the previous one had and walked quickly around the building.My wife noticed me looking up and I asked her if she saw it...at this time the object came close to entering a low hanging cloud and I saw an object appear to drop out of it and enter an entirely different flight path,followed by another.these two objects were much quicker than the first.All three flew into the cloud and did not reappear after 7 or 8 minutes.My wife claimed to have seen a total of 4 objects leave the first with one flying off in a blink of an eye.I had been looking down as I was walking down a step and perhaps missed this one... I would think the first object to be smaller than a sedan,but it's hard to tell.The clouds that day were low and the objects flew into the cloud."],"Country":"United States","Object Flight Path":"Hovering then path","Weather Factors":"Windy, Light","Log Number":"US-06142010-0013","map":"<A HREF = \"http://maps.google.com/maps?q=33.456477,+-112.068187(23753)&iwloc=A&hl=en\"> mufon case (23753) map </A>"}