{"Date of the Event":"06/14/2010 09:35 UTC","Disposition":"Unresolved","Latitude":"42.37803","Log Number":"GB-06142010-0010","Object Features":"None","City":"Cambridge","divs":["Sighting DetailsMyself and my sister were smoking a cigarette outside the front of our home, which is in north Hertfordshire facing due north, when we noticed what looked like a plane with a newly forming vapour trail* (we couldnt actually see the object creating the trail, but presumed it was a vapour trail) being illuminated by the setting sun, though thought it looked a bit weird, and didnt think anything else of it. We continued to watch it, and the 'trail' appeared to grow in size, and shorten, and sometimes break into several pieces, get brighter and dimmer, and change shape and direction. We looked over again at it a few minutes later and realised another had appeared behind it, followed by another, and then another, totalling four objects. We also observed a bright point of light that would appear and disappear at random within the middle of the 'formation'. It was at this point that i called my girlfriend, who live in Cambridge (about 30 miles north of where i was at the time), and asked her to look into the sky and see if she could confirm this for me, which she did. The sighting lasted about 20 minutes, before one by one the lights slowly dimmed and the disappeared. *The 'trail' started off as a point of light and slowly elongated, and then proceeded to change shape regularly, from a ball of light to a longer cigar shape, to two, then three, individual balls of light. This was one of the objects, all four behaved in a similar fashion."],"Date Submitted":"06/14/2010 05:48 UTC","Object Shape":"Cigar, Star-like, Other","trends":["There have been 17 other sightings in Cambridge","There were no other sightings in Cambridge on or around June 14th 2010"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23750.html.txt","/var/www/straped/mufon/org/23750.html"],"Country":"United States","Source":"MUFON","Case Number":"23750","Region":"Massachusetts","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-71.105203","Object Flight Path":"Path with directional change","Summary":"4 glowing objects with one bright light appearing at irregular intervals in between them.","map":"<A HREF = \"http://maps.google.com/maps?q=42.37803,+-71.105203(23750)&iwloc=A&hl=en\"> mufon case (23750) map </A>","Tags":"City"}