{"City":"Calabasas","map":"<A HREF = \"http://maps.google.com/maps?q=34.145033,+-118.657333(23752)&iwloc=A&hl=en\"> mufon case (23752) map </A>","Object Flight Path":"Undisclosed","Country":"United States","Disposition":"IFO","Case Number":"23752","Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["Sighting DetailsMy husband and I were driving on Fwy101 from Santa Monica area towards Ventura. When we were around Calabasas area, I saw a white object in the sky and pointed it to my husband. He was driving and asked me, \"Where? I can't see.\" I said, \"It's right there in front of us.\" The object was not so far from us, and it was recognizable. He kept saying, \"I can't see it.\" I said, \"Can't you see that?\" I kept pointing it and stared at it. Within 10 seconds, the object went transparent like a magic. I said, \"It disappeared!!!\" Our car has a window on the ceiling, and my husband opened the plastic slide. I looked up and tried to find the object, but it was gone. After that, we saw 3 or 4 airplanes going by. Then I saw a couple of birds. I could tell wether they were airplanes or birds, but the object I saw had no wings and went transparent. There were no clouds at all. At first, I was looking at an airplane, but there were no wings. I thought the object was moving towards 9 oclock. My husband said, \"Maybe you can see different dimentions now because I could not see it.\" This was the second time I saw UFO. The first time was just 2 weeks ago. May 30th.around 1:30 p.m, I was driving towards my house and I almost got home. There was a bright silver light in the clear blue sky. I looked up and within a second, it disppeared. I parked,got out of my car and looked around, but I could not see anything. I was very excited and told my husband."],"Date Submitted":"06/14/2010 06:50 UTC","files":["/var/www/straped/mufon/html2text/23752.html.txt","/var/www/straped/mufon/org/23752.html"],"Log Number":"US-06142010-0012","Object Shape":"Cigar","Viewing Distance":"101-500 Feet","Date of the Event":"06/12/2010 12:00 UTC","Region":"California","Summary":"White object disappeared in the blue sky at day time.","trends":["There have been 4 other sightings in Calabasas","There were no other sightings in Calabasas on or around June 12th 2010"],"Longitude":"-118.657333","Latitude":"34.145033","Tags":"City"}