{"Source":"MUFON","Object Shape":"Flash, Star-like, Unknown","City":"Mt Shasta","Region":"California","Date Submitted":"06/14/2010 09:50 UTC","Log Number":"US-06142010-0017","Latitude":"41.410367","Object Features":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.410367,+-122.28744(23757)&iwloc=A&hl=en\"> mufon case (23757) map </A>","files":["/var/www/straped/mufon/html2text/23757.html.txt","/var/www/straped/mufon/org/23757.html"],"Viewing Distance":"Unknown","Tags":"City","Longitude":"-122.28744","Summary":"Flashing bright lights that move around on the mountain.","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","trends":["There have been 6 other sightings in Mt Shasta","There were no other sightings in Mt Shasta on or around June 13th 2010"],"Sighting Duration":"04:24:27","Date of the Event":"06/13/2010 01:20 UTC","Case Number":"23757","Weather Factors":"Unknown","divs":["Sighting DetailsThe first time i saw the lights was a year ago when i would see them from my driveway while having a smoke. I first noticed a single bright flashing light that would light up on the mountain then once i would watch for a while i seen multiple lights that would move around the mountain . these lights are yellow white lights that flash very bright then go out then light up again repeatadly doing this while being in different places every time they flash up . a lot of people i hang out with have seen them. these lights could not be a star because there on the mountain and it couldnt be a fire so i dont know what it is. you can sit for hours and watch the lights are they will be flashing for probably all night . if you live in mount shasta and want to see the lights then look up at the mountain on a clear night late at night and look at the mountain for a while and you might see something amazing (note: i still see these lights a lot and just seen them the other night where me and my brother seen four parrelel lights flash up on the mountain then go out"]}