{"Date Submitted":"06/14/2010 08:31 UTC","Region":"Michigan","Object Shape":"Triangle","City":"Port Huron","Sighting Duration":"Undisclosed","Weather Factors":"None","Case Number":"23754","Summary":"Wife, daughter and I saw triangular UFO then experienced missing time.","Country":"United States","Log Number":"US-06142010-0014","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=42.978553,+-82.421494(23754)&iwloc=A&hl=en\"> mufon case (23754) map </A>","files":["/var/www/straped/mufon/html2text/23754.html.txt","/var/www/straped/mufon/org/23754.html"],"Latitude":"42.978553","Object Features":"Patterned Surface","Tags":"City","Disposition":"Unknown","Object Flight Path":"Path then hovering","Source":"MUFON","trends":["There have been 11 other sightings in Port Huron","There were no other sightings in Port Huron on or around July 31st 1983"],"Longitude":"-82.421494","Date of the Event":"07/31/1983 12:00 UTC","divs":["Sighting DetailsI believe it was in late summer early fall of 1983 at about 4:00 P.M. and my wife and oldest daughter(aged 5) were standing in the door when my wife looked startled at something. I went to the door and observed a triangular craft approaching Croswell Rd. It was heading straight for us. It was completely silent. I ran out to the center of the road at the same time as it reached the road. It was about 150 ft above me when in succession 3 balls of light left the nose of the craft on the left side circling under the nose. The first one headed for me. I ducked down to the right but it was very fast and must have touched my left shoulder. I woke up in my own bed shaking and afraid. My wife was sleeping soundly next to me. I noticed the clock read 2:00. I lay there and tried to tell myself that it was a dream. I went over the events of the previous day but could not remember what happened after about 4:00. Watching T.V. going to bed and could remember nothing. I did not get back to sleep that night. The next day I asked my wife what we had done or watched or talked about the night before but she flat out would not speak on the subject continuing to change the subject. I can't let it go and the feeling that it was not a dream persists to this day. I have believed in U.F.O's for most of my life. I've read too many books on the subject to count. Could I have manufactured this subconsciously from all I've read? I hope so because it is okay to believe in this stuff when it involves someone else. I would rather not find out this was real because this would open a whole other can of worms. If the experience was real then what happened during the missing time? If I found out, how would that affect me? How would it affect my relationships? Would I then experience a form of P.T.S.D. Would I find out about more events? Would I become paranoid that it might happen again? On another note, my sister has sworn that she has been taken many times. She has memories of having a hybrid baby placed in her arms and told that she needed to nurture it. She has many memories of telepathic conversations with grays. I don't know why, after all these years, I've decided to talk about this. Maybe because I'm hoping talking about it will somehow let me release it. Holding it in hasn't helped. I've always felt that I needed to tell somebody. Well,thanks for giving me a forum. Yours Gratefully, Reluctantly Curious Help"]}