{"Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/23751.html.txt","/var/www/straped/mufon/org/23751.html"],"Date Submitted":"06/14/2010 06:12 UTC","Weather Factors":"Unknown","Summary":"25-50 star-like objects, redish orange moving east to west.","Latitude":"26.648138","Tags":"City","Viewing Distance":"101-500 Feet","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around June 11th 2010"],"City":"Fort Myers","divs":["Sighting DetailsOn June 11, 2010 at approximately 11:00 PM, my girl friend and I witnessed 25-50 star-like redish orange lights moving east to west along the Caloosahatche River near downtown Fort Myers, Florida. We were located on our balcony in our high-rise condo. The objects had no sound associated with them. Duration lasted approximately 10 minutes - then they disappeared in clouds to the west. We did not know what they were but were positive that they were not conventional aircraft or helicopters due to no sound. (We often see and hear conventional aircraft on our balcony) Approximately 15-20 minutes after the event, we contacted Lee County Sheriff's Department non-emergency and reported incident and wanted to know if anyone else either saw or reported the objects. Non-emergency personnel indicated that there were no other reports at that time. We also contacted our local FOX new station for information and to also see if anyone else reported these objects but had to leave a message. We attempted to get photographic evidence of the event; however, due to our balcony being screened-in, we were unable to get clear pictures of the objects. We are very curious as to what the lights were and if anyone else noticed and reported the event. In short, we would like information on the event if there are other reports."],"Case Number":"23751","Region":"Florida","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=26.648138,+-81.868778(23751)&iwloc=A&hl=en\"> mufon case (23751) map </A>","Log Number":"US-06142010-0011","Object Features":"Unknown","Source":"MUFON","Date of the Event":"06/11/2010 11:00 UTC","Longitude":"-81.868778"}