{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.016817,+-94.456014(23761)&iwloc=A&hl=en\"> mufon case (23761) map </A>","Object Shape":"Circle, Sphere, Star-like","City":"Raytown","Object Features":"Patterned Surface","Date Submitted":"06/15/2010 12:16 UTC","Latitude":"39.016817","trends":["There have been 15 other sightings in Raytown","There were no other sightings in Raytown on or around June 14th 2010"],"Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsFirst, when leaving a home depot at approximately I noticed the most unusual cloud pattern in the sky. So unusual in fact that after making my purchase I came back into the store and called attention to it. At which time one of the clerks came out and took a picture of the event. It was magnificent. I then came home with my purchase and began to went into my home. after remaining in the house for approximately 45 minutes to an hour. I decided to go outside and gaze at the stars which has become a regular habit. I first went into my back yard and after several minutes, noticed nothing unusual. I came back into the house and heard the dog down stairs wanting to go outside. So I let him out and I went out with him. While waiting for him to finish his business, I began to star gaze again. At first I didn't notice anything unusual and then I looked toward where the unusual cloud formation was earlier, and there in the same general direction was an extremely bright star. it was so bright in fact it was a bit unsettling to look at. But I was curious as to what it was. I thought at first that it was perhaps venus or even some other planet. So I went back in the house and got my binoculars and gazed at the star through them. I want to be extremely clear and detail as to what I saw. First while looking at this intense light emiting from the star I noticed that the light from it started to dim and after about 20-30 seconds went completely out. I then tried to refocus my binocs and no longer saw a star like shape that was emiting light, instead the light from another source was now illuminating it. And It was HUGE! extremely huge and moving across the sky at an incredible rate for something its size. through the binocs at first glance it looked like a crescent moon in form and shape. but in the next few seconds changed from crescent to full moon in appearence. I could make out a lot of detail while observing it. But what I found interesting was that it was like this thing knew that I was watching it and began to turn off it light and assume the roll of a star of planet in the sky. Let me just state for the record that I no longer believe that aliens are here on this planet. I KNOW THAT THEY ARE! although I know that it will be difficult for me to prove unless or until they are ready to deal with such a savage and uncivilized culture such as ours then no matter how much they allow us to view them. It won't matter. They will continue to allow us to further corrupt ourselfs. Tonight gave me the feeling that they have always been around and we just don't take the time to notice them. this message is not just for mufon, but for them also because I also belive that somehow they monitor all major communications on this planet. Thanks for coming in peace."],"Viewing Distance":"Unknown","Log Number":"US-06152010-0002","Weather Factors":"Unknown","Summary":"It looked like a planet floating through our atmosphere.","files":["/var/www/straped/mufon/html2text/23761.html.txt","/var/www/straped/mufon/org/23761.html"],"Case Number":"23761","Date of the Event":"06/14/2010 12:00 UTC","Disposition":"Unknown","Region":"Missouri","Object Flight Path":"Hovering then path","Longitude":"-94.456014","Country":"United States"}