{"Object Flight Path":"Hovering then path","Latitude":"39.104326","Date Submitted":"06/15/2010 11:45 UTC","Disposition":"Unknown","Case Number":"23769","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsI am tbe assitant state director for Missouri MUFON. I was driving home from a MUFON meeting last night heading North on I-435 hear Raytown when I noticed a very large bright light in the sky North of my position and to my East at approximately 75 degrees off the horizon. This is close to the area called \"TV Hill\" where there are several large TV towers, and at first I thought it might be one of the lights on the towers, however, as I approached I noticed that the object was located before the towers and was too large and too bright to be one of those lights. It flickered on and off and was just inside the clouds, moving in and out of the clouds so I couldn't get a good look at the shape or structure, but it appeared by be round. Then, the object moved very, very fast (almost too fast to see) across I-435 to my left (West) and settled in to an area over Kansas City and again, just inside the clouds. This time it was located under Venus, which was barely visible through the clouds. The size was huge, it would take a DVD to cover it up held at arm's length. I probably watched it for a good three minutes while driving. It wavered around, and then appeared to take on a triangular shape just before I had to exit the highway on 23rd Street and head East away from it. Normally, I would have pulled over to the side of the road to get a better look or maybe a photo, but for some reason I just headed home."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.104326,+-94.571197(23769)&iwloc=A&hl=en\"> mufon case (23769) map </A>","Region":"Missouri","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around June 14th 2010"],"Date of the Event":"06/14/2010 09:40 UTC","City":"Kansas City","Log Number":"US-06152010-0010","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23769.html.txt","/var/www/straped/mufon/org/23769.html"],"Weather Factors":"Unknown","Country":"United States","Longitude":"-94.571197","Summary":"Bright large object moved over I-435."}