{"Object Features":"Undisclosed","Country":"United States","trends":["There have been 3 other sightings in Royse City","There was one other sighting in Royse City on or around June 14th 2010","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Summary":"Bright light hovering over city.","Weather Factors":"Unknown","City":"Royse City","Object Shape":"Star-like","Date Submitted":"06/15/2010 03:32 UTC","Longitude":"-96.330212","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI just entered a report yesterday regarding this star like light I have seen the last two weekends and again last night between 8:00 PM and 9:00 PM. Tonight I had my daughter who lives with me and my grand son out watching it with me. It stayed in one place it seemed like for an hour and yet you could tell it was moving but just not fast enough for us to see the movement. We were out in the front of our home and it was in the west sky up above the C shaped moon right above a neighbors house top however I could walk out back of our house and see it very clear because it took the next door house out of the way so it was a clear view. My daughter was outside trying to take a picture with her digital camera and she also looked through my binoculars and saw that it looked very bright but had a red glow around it. We also saw several flashing objects come from the same direction but not sure if they came out of the star like object. While I was out back of the house viewing it all of a sudden I saw like a spot light kind of transparent but yet bright round circle like light streak across the back yard above my yard yet almost in front of me as it streaked across it was almost like it was going to land somewhere in back of the house or in a neighbors yard but as it streaked across it disappeared. I did get a picture but the one here came from my phone camera and its very small right above the moon and looks like star. Maybe someone can take the pic and zoom in on it I am not sure but I got the pic anyway. It seems as long as we watch it it hangs around but each time I watch it to see if it will move away from us but it never goes anywhere until I go into the house then I go back out and once it had moved to the Northwest sky I stated last report that it was southwest but not knowing my directions I was told that it is northwest.. Last night it was gone when I went back out."],"Date of the Event":"06/14/2010 09:00 UTC","Disposition":"IFO","Latitude":"32.98492","Source":"MUFON","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.98492,+-96.330212(23764)&iwloc=A&hl=en\"> mufon case (23764) map </A>","Log Number":"US-06152010-0005","Tags":"City","Case Number":"23764","files":["/var/www/straped/mufon/html2text/23764.html.txt","/var/www/straped/mufon/org/23764.html"],"Viewing Distance":"Unknown"}