{"Longitude":"-86.153044","Date Submitted":"06/15/2010 10:26 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Indiana","Viewing Distance":"Unknown","Tags":"City","Latitude":"39.774736","map":"<A HREF = \"http://maps.google.com/maps?q=39.774736,+-86.153044(23778)&iwloc=A&hl=en\"> mufon case (23778) map </A>","Log Number":"US-06152010-0019","Disposition":"Unknown","City":"Indianapolis","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around July 25th 2009"],"divs":["Sighting DetailsMe, three of my sons, and a neighborhood friend were out in our fenced in backyard lighting fireworks. I noticed after about 30 minutes of being out there, multiple lights to the north of us. These lights traveled east at a somewhat fast pace. There were at least 6-8 of these light travelling together, and all were amber color. I didn't notice any streaking like you'd see with a meteorite or space junk when entering our atmosphere. As these lights moved eastward, we noticed a police helicopter about 10 blocks away. I found outlater that night that there was a shooting in the area we saw this helicopter. There is no reason that they would not have noticed this. Maybe you guys can look into who was flying the helicopter that night. I called a local news station, and the Lawrence police department the next day to see if other people reported the same thing, but according to whom I spoke to said that there was no report. To me that's impossible. Those lights were bright, and travelling over a very well populated area. These objects moved gracefully across the sky. I know for a fact that they weren't earthly aircrafts. Well that's it for now. This was the first time for me and my sons to witness something like this. To tell you the truth I felt afraid at first because the lights at first glance appeared to be coming our way, which would have been southward. But it's like they turned, but I really couldn't tell until they appeared to be going eastward."],"Case Number":"23778","Object Features":"Undisclosed","Country":"United States","Object Shape":"Fireball, Star-like","Summary":"Several lights streak across sky.","Date of the Event":"07/25/2009 10:15 UTC","files":["/var/www/straped/mufon/html2text/23778.html.txt","/var/www/straped/mufon/org/23778.html"],"Weather Factors":"Unknown","Source":"MUFON"}