{"Date Submitted":"06/15/2010 06:07 UTC","Log Number":"US-06152010-0016","files":["/var/www/straped/mufon/html2text/23775.html.txt","/var/www/straped/mufon/org/23775.html"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Circle, Egg, Oval, Sphere","divs":["Sighting DetailsThis took place 10 minutes after my first ever UFO sighting reported previous. I got into work, told a coworker about what I had seen. She thought it was fun, and I was excited to tell someone. While I got ready to start working, I kept looking out the windows (facing east) hoping to see something else. After that much creepy excitement, it's normal to \"want it again.\" I didn't expect to see anything. I thought it was a plastic grocery bag at first - there have been two that the wind has brought up to our floor. This wasn't collapsed, and moving with the wind, it was full and floating straight up. I called my coworker over to have a look. I estimate the object was 2-3 blocks away. It looked like an opaque white jellyfish without tentacles - think of an upside down \"U\" that's closed at the bottom and more plump. It rose into the air, then slowed down, not hovering, but not rising as fast. Other opaque, white, smaller globes appeared and circled around it. I saw 4 of these \"pursuers\" during this event. They raced around the larger orb and were noticeably faster than it. The orb began to move south. The smaller globes chased it. It reminded me of small birds chasing a larger bird away from their nest. I looked for bird wings, but the shape of the globes didn't change during their movement. If they WERE birds, I would have seen SOME kind of change in shape as they beat their wings and turned. My coworker turned away and started back for her desk, telling me, \"I'm not looking anymore, I'm too creeped out.\" But she DID see them. The large orb moved south half a block, then, with one orb still chasing it, veered east towards MSU's campus and was gone in a second . . . faded out of sight. The small orb chasing it broke off it's chase and disappeared the same way. I looked back at the original location, and one last orb was rising into the sky where the original larger one initially was, and disappeared. I didn't have a camera with me, and my cellphone is old and doesn't have one that would've taken a usable picture. I felt excited and curious. I wasn't scared during this event."],"City":"Lansing","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 54 other sightings in Lansing","There was one other sighting in Lansing on or around June 10th 2010"],"Region":"Michigan","Source":"MUFON","Latitude":"42.733835","Country":"United States","Tags":"City","Object Features":"None","Summary":"Jellyfish with no arms being chased by white orbs.","Disposition":"Unknown","Case Number":"23775","Date of the Event":"06/10/2010 11:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.733835,+-84.549845(23775)&iwloc=A&hl=en\"> mufon case (23775) map </A>","Sighting Duration":"Undisclosed","Longitude":"-84.549845"}