{"Summary":"Brilliant White Cigar Shaped object in Broad Dayli","Case Number":"2378","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/2378.html.txt","/var/www/straped/mufon/org/2378.html"],"City":"Paducah","Disposition":"Unknown","Date of the Event":"05/21/2003 07:00 UTC","Region":"Kentucky","Object Shape":"Bullet, Missile","divs":["Sighting DetailsPaducah, KentuckyFirst a little background about me... I am a trained Quality AssuranceEngineerManager and have a sharp eye for detail. My vocation demands that I beexact in my portrayal of dimensions, directions, etc... I also have 3college-level courses in astronomy under my belt, and sure as heck know thedifference between Venus, swamp gas, known aircraft, and what I saw. And what Isaw was none of the three aforementioned items....About a month ago, my brother Scott called me out on the deck of my house in theback. He said, There is a UFO out here I went out as fast as I could, beingas I am disabled and dont move very fast, and looked where he was pointing.Here is what I saw.The object was approximately 12 to 34 as wide as a full moon. It was definitelycigar-shaped and brilliant white. It looked just like a fuselage of a jet withabsolutely no wings. It was traveling from about 030 deg NNE on a compass toabout 210 SSW, which is exactly perpendicular to my house as it is oriented. That is why I am so sure of the directional travel of the object I wouldestimate it was quite a ways up into the sky, about 3 to 5 thousand feet,although it is difficult to say with no other reference points. The object madeabsolutely no sound. The skies were clear blue. It was near 700 P.M. I firstpicked up the object at an inclination of about 80 degrees azimuth 030 andfollowed it for about 3 minutes until it was at about an inclination of 50degrees azimuth 210. At that point it flashed BRILLIANT WHITE, so bright I lostsight of the shape of the object. About five seconds later it flashed a secondtime identical to the first time. Then the object just disappearedI am enclosing a sketch of the object, but it really isnt very detailed as Ididnt see much detail other than the shape of the object itself. The sketchincludes the object shape, the relation of a full moon in size, and the size ofthe 2 bursts of light that the object made, in relation to the size of theobject."],"Country":"United States","Latitude":"37.083389","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.083389,+-88.600048(2378)&iwloc=A&hl=en\"> mufon case (2378) map </A>","Log Number":"","Object Flight Path":"Straight-line path","Sighting Duration":"01:00:00","Date Submitted":"05/21/2003 07:00 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","trends":["There have been 9 other sightings in Paducah","There were no other sightings in Paducah on or around May 21st 2003"],"Longitude":"-88.600048"}