{"Longitude":"-123.198863","files":["/var/www/straped/mufon/html2text/23788.html.txt","/var/www/straped/mufon/org/23788.html"],"trends":["There have been 8 other sightings in Ukiah","There were no other sightings in Ukiah on or around June 12th 2010"],"Log Number":"US-06162010-0009","Summary":"See flying 'stars' every night, not planes, these turn around, surge forward and stop.","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Weather Factors":"None","Date Submitted":"06/16/2010 03:10 UTC","Date of the Event":"06/12/2010 10:00 UTC","Case Number":"23788","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.152271,+-123.198863(23788)&iwloc=A&hl=en\"> mufon case (23788) map </A>","Latitude":"39.152271","City":"Ukiah","Tags":"City","divs":["Sighting DetailsEvery night that I lay outside in our field in the country I have been seeing flying 'stars'. First thought they were planes, but when showed to my husband, he said they weren't planes--planes don't fly like this. Now, the more time I am out there, the more of them I see. The night of the 12th of June was the longest and largest show I witnessed. There were so many 'shooting stars' that I lost count. But, that night as SOON as laid down to look up in the sky, immediately I started seeing the flying 'stars', when I first see them they are about as bright as the stars in the Big Dipper, then they fade to a faint star. Then after awhile, sometimes seconds, sometimes up to 5 minutes they vanish. Last night I was watching one for about 5 minutes and it stayed bright almost the whole time until about 4 min. in, it stops, and I MADE SURE that I did not take my eyes off of it for even a milisecond. It stopped in that spot for over a minute, & I thought I was going nuts, and then it finished descending and then disappeared completely. I saw one, 2 nights ago, split into 2 which flew in opposite directions. The same night one was flying dead South and in a split second was flying dead North. They will surge forward, zigzag around stars, sometimes they fly up to a star and 'bump' it and take off. June 13th, I saw one fly as fast as a meteor does. One time I was following one and it disappeared and outloud I started talking to 'myself' \"where are you\" over and over while looking in the area where it had disappeared, which was facing south, when all of a sudden I see 2 bright flashes in the west, I quickly turned to watch and it faded back to where it was before. The nights that I see muliple flying 'stars' like 3 at a time, I get these headaches that I have never in my life experienced. I have had one migraine in my life and didn't know you could have a headache worse then that, but this was 10X worse. The pain was so bad that I couldn't sleep, so I took a sleeping pill to knock me out, and when the pill wore off and I opened my eyes in the morning, I thought that I was going to throw up because my head hurt so badly. The headache lasted for over 24 hours."],"Region":"California","Object Features":"None","Country":"United States","Viewing Distance":"Over One Mile","Disposition":"IFO"}