{"Date of the Event":"10/31/2009 12:00 UTC","Source":"MUFON","Longitude":"-95.36391","Date Submitted":"06/17/2010 04:08 UTC","Summary":"2 white orbs with a third metallic object floating / dancing in between them.","map":"<A HREF = \"http://maps.google.com/maps?q=29.769293,+-95.36391(23797)&iwloc=A&hl=en\"> mufon case (23797) map </A>","Weather Factors":"Unknown","Case Number":"23797","Log Number":"US-06172010-0003","files":["/var/www/straped/mufon/html2text/23797.html.txt","/var/www/straped/mufon/org/23797.html"],"Object Flight Path":"Stationary","City":"Houston","Disposition":"Unknown","Tags":"City","Object Features":"None","Sighting Duration":"Undisclosed","Country":"United States","Region":"Texas","Latitude":"29.769293","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around October 31st 2009"],"Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was at the Wings Over Houston Airshow Oct 31 2009....the sighting occurred during the Blue Angels performance at around 3pm. Weather was sunny and clear with unlimited visiblity. During a formation loop, I first notice the two white orb like objects just beyond the Blue Angels at the apogee of the loop. These orbs where directly over the airfield and stationary. A third metallic object appeared in between the white orbs and seemed to fall in a tight spiral and then zip back up to repeat the downward spiral. I asked my father if he saw what I was seeing and he confirmed it. We discussed what if could be, but the altitude was too high and they remained stationary. More and more people in the crowd were starting to notice the objects too with one person even asking me if I knew what it was. I start to notice that alot of the people around us where pointing at the orbs and not even paying attention to the F-18s screaming by. I starting texting my mother about what I was seeing...maybe taking a about a min and in that time the metallic object was gone...but the white orbs remained.... I continued to watch and notice that the crowd had gone silent and people were packing up...it was a creepy feeling to think that maybe the prescence of these orbs where making people leave..but it was also at the end of the airshow....After about 10 min these orbs seem to jump in tandem further down the airfield....not move or float..but jump...first as in a line..then another jump diagnolly... I was responding to my mothers text when I looked up again and notice that only one orb remained and it had moved further down the field.... then it seem to drift further south till it was out of view..."],"Object Shape":"Sphere"}