{"divs":["sighting detailson 6\\15\\2010 i was traveling east on bastenchurry blvd between kramer and rose when i noticed to the northeast a very dim amber light in the sky traveling very fast from the west to the east. i saw this objest for a period of .04 seconds and from the time i spotted it to the time it dissapeared, it went about 30 degrese of my windshield. the object was traveling in a straight line and did not seem to ascend or decend. if i was to guess the size of the object i can only say that if i was to hold a pea at my extended reach and look at it, that would be it's size. i first thought that it might be a falling star but it was not bright. something interesting about the travel of this object is that it was close to the landing pattern of los angeles international airport. i witnessed commercial jets in patten flying from the east to the west yet this object was flying from the west to the east. i have lived in the area all my life and have never seen any aircraft flying against the landing pattern especially when aircraft are active. i was in the military and attached to a f-14 squadron and know this was not a military aircraft. no aircraft can travel at the speed that this object was traveling over a densely populated area."],"Longitude":"-117.89165","Object Flight Path":"Straight-line path","Latitude":"33.91948","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.91948,+-117.89165(23796)&iwloc=A&hl=en\"> mufon case (23796) map </A>","City":"Brea","Weather Factors":"None","Country":"United States","Date Submitted":"06/17/2010 03:56 UTC","Sighting Duration":"Undisclosed","Summary":"Dim lit with amber glow, fast mover over 600mph W-E over LAX approach pattern over Carbon Canyon no assect or decent in flight.","Date of the Event":"06/15/2010 09:20 UTC","files":["/var/www/straped/mufon/html2text/23796.html.txt","/var/www/straped/mufon/org/23796.html"],"trends":["There have been 8 other sightings in Brea","There were no other sightings in Brea on or around June 15th 2010"],"Tags":"City","Object Shape":"Teardrop","Viewing Distance":"Unknown","Region":"California","Log Number":"US-06172010-0002","Disposition":"Unknown","Case Number":"23796"}