{"Weather Factors":"Unknown","trends":["There have been 15 other sightings in San Clemente","There were no other sightings in San Clemente on or around March 31st 1996"],"Tags":"City","Source":"MUFON","Summary":"Under hypnosis I experience being abducted into a ship that resembled a flying saucer.","Object Shape":"Other","Object Flight Path":"Undisclosed","Log Number":"US-06172010-0008","map":"<A HREF = \"http://maps.google.com/maps?q=33.433863,+-117.609722(23802)&iwloc=A&hl=en\"> mufon case (23802) map </A>","Viewing Distance":"Unknown","Date of the Event":"03/31/1996 12:00 UTC","Longitude":"-117.609722","Region":"California","Country":"United States","divs":["Sighting DetailsUnder hypnosis by a trained Ph.D.Psychologist revealed an experience of abduction. It turned out I was taken into a spaceship that resembled a flying saucer and was operated on in my gut area to be certain that the melanoma skin cancer in that area was go. The gray looking, large headed aliens look like picture or cartoon I have seen of Aliens. What triggered this session was a very frightening event that happen about ten years previously. I had about ten year prior to this session a frighten event about midnight when I was about to dose off. I was not asleep or dreaming, I am fully alert to an intrusion. What scared me is a invisible force entered my bed room and was heading for my sleeping wife. I challenged it and when I did I felt like I was being sucked out of my bed by a very powerful vacuum. I yelled out the name Jesus, Mary and Josephs and it stopped. I did not wake my spouse and when I told her of the incident she had lost her voice. It puzzled me for about ten years when I asked a friend Psychotherapist to help me investigate through self-hypnosis. My hypnosis my have been influence by attending a lecture my the Harvard Professor who wrote a book on alien abductions. it all seemed very real to me and I was wondering if anyone else has had a similar experience?"],"Case Number":"23802","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23802.html.txt","/var/www/straped/mufon/org/23802.html"],"Date Submitted":"06/17/2010 06:21 UTC","City":"San Clemente","Disposition":"Unknown","Object Features":"Undisclosed","Latitude":"33.433863"}