{"map":"<A HREF = \"http://maps.google.com/maps?q=32.703722,+-103.12705(23800)&iwloc=A&hl=en\"> mufon case (23800) map </A>","Longitude":"-103.12705","Latitude":"32.703722","Country":"United States","divs":["Sighting DetailsI was experiencing a very sleepless night so at midnight I went to the kitchen to get a drink of water and was going to take a sleeping pill, but remembered I had to get up early and didn't want the hangover of a sleeping pill. It was too late as the clock on the stove read 12:03. As I was drinking the water I walked into a dining room which has glass doors to the back yard (North) and noticed a bright starlike object with yellow and red shimmering lights sort of hovering over my back wall about the middle of a pasture which backs up to our property. It didn't move for quite a while. I ran to get binoculars but could find only opera glasses which weren't of much help. At that time I watched it begin to move very slowly toward the west. I ran to look for binoculars elsewhere and looked out another window. About that time it disappeared. It just blinked off! Wne I first saw it I knew that it was not one of the lights that one can see from those windows. I thought, uh-oh. That might be a UFO. I mentioned to a neighbor today that I almost called her to see something but didn't because I didn't want to awaken them. she said it would have been all right as they were just getting home about midnight. I told her what I had seen and she replied, \"OMG! I think we saw the same thing coming home. I asked the girls in the car, \"What is THAT?\" She described it as having red and yellow lights too but thought it was much larger than i did. I couldn't go to sleep until around 3:00 AM June 17, 2010. I felt very uneasy and was afraid to go to sleep even though I did begin to feel tired. I don't remember dreaming after that."],"Region":"New Mexico","Viewing Distance":"Unknown","Date of the Event":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Tags":"City","Object Features":"Undisclosed","Date Submitted":"06/17/2010 03:42 UTC","Log Number":"US-06172010-0006","Object Flight Path":"Undisclosed","trends":["There have been 5 other sightings in Hobbs","There were no other sightings in Hobbs on or around"],"Summary":"After midnight a neighbor and I saw an object with shimmering red and yellow lights.","files":["/var/www/straped/mufon/html2text/23800.html.txt","/var/www/straped/mufon/org/23800.html"],"Case Number":"23800","City":"Hobbs","Object Shape":"Cross, Diamond, Star-like","Source":"MUFON"}