{"Tags":"City","divs":["sighting detailsi had just driven into the driveway and when i looked up in the sky i saw an airplane like i often do. this time i saw a very shiney oval silver object near the plane that kept slowly moving across the sky. i ran inside and grabbed my digital camera. when i returned, it had passed my house and was going further up in the sky. it still remained very shiney, however, i also now noticed a red blinking light surrounding the object. the shaped of the object became even more clear. it was oval. i have seen many helicopters and many many planes because my house is in the flight path of bush international airport. the silver shiney object was definitely not a plane. i ran in the house and got my husband to come and see this thing and he also saw it. we watched until it disappeared so high in the sky, approximately 3-4 minutes total.i was very excited because i have always wanted to see a ufo, but before,each time i think that i would see one, it turned out to be a plane or helicopter with blades or lights. they were never this silver or shiney.i think the first thing that really caught my attention was the fact that i didn't see bright lights, but the shiney silver. afterwards, i went to my computer to try and see what i had taken a picture of on my camera. only a couple of the pictures actually showed the object without them becoming distorted when making them larger. i was a bit disappointed because i wanted to see it much clearer in pictures. i will send what i do have.------------------------------------------ wit info deleted - sgonzalez\\cms."],"City":"Spring","Case Number":"23803","Log Number":"US-06172010-0009","Summary":"I looked up and noticed an airplane and near the airplane was a very shiny oval silver object that kept slowly moving across the sky.","Country":"United States","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Oval","Latitude":"30.08559","Date Submitted":"06/17/2010 10:53 UTC","Longitude":"-95.41268","map":"<A HREF = \"http://maps.google.com/maps?q=30.08559,+-95.41268(23803)&iwloc=A&hl=en\"> mufon case (23803) map </A>","Disposition":"IFO","Region":"Texas","Object Features":"Undisclosed","trends":["There have been 18 other sightings in Spring","There were no other sightings in Spring on or around June 17th 2010","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23803.html.txt","/var/www/straped/mufon/more/23803_submitter_file1__PICT0079.JPG","/var/www/straped/mufon/more/23803_submitter_file2__PICT0081.JPG","/var/www/straped/mufon/org/23803.html"],"Viewing Distance":"Unknown","Date of the Event":"06/17/2010 06:45 UTC","Source":"MUFON"}