{"Log Number":"US-06182010-0011","Object Shape":"Circle, Sphere, Star-like","Sighting Duration":"Undisclosed","Case Number":"23816","Weather Factors":"Unknown","Tags":"City","trends":["There have been no other sightings in Grace","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/23816.html.txt","/var/www/straped/mufon/org/23816.html"],"Longitude":"-111.730506","Object Features":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.576031,+-111.730506(23816)&iwloc=A&hl=en\"> mufon case (23816) map </A>","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"06/18/2010 06:40 UTC","Latitude":"42.576031","Region":"Idaho","Date of the Event":"06/18/2010 02:10 UTC","City":"Grace","divs":["Sighting Detailsthe sky was clear no clouds. we were outside working on a car when we heard a deep loud roar from a jet above the mountain range to the west. we love airplanes so we started looking for it. well we never spotted it but a few minutes after, we heard a strange huming pulsing noise coming from the northwest and we seen an all white jet like airplane fly across the sky. my family has a big military backgroound and i have a passion for military aircraft and this was nothing i have seen or heard before. then the noise changed to a propeller like sound after it passed. along the same flight path was a airliner following beside several miles away. now the wierd stuff begins. first i seen a star like object directly above where the white plane had flown over. it just stayed stationary like a star. i thought it was a star at first but a similar object sped toward it and soon as they met they started darting around at 90deg turns for a few seconds then one of them sped off to the east and disapeard. the other one gradually sped off to the northeast. then my dad and i seen a bigger object that looked like a round globe. it was heading northwest slowly then a second smaller globe appeard, buzzed by the larger globe, then came back and met up with it. as they both sped off to the northeast a long serpent like tail appeared behind the larger globe. then the tail disappeard a few seconds after. they both disappeard over the ridge of the roof. after that a 747 size all white plane flew very slowly across the top of the mountain range to the east. the first two objects looked like stars and the second two like white globes. there were no chemtrails or airliners in the sky exept the one we seen after the experience wich is an every day accurance. we were baffled because we never seen or heard anything like this before. the four objects didnt make any noise at all even though the first two seem to be going at a high rate of speed when they disappeared. this is the fourth experience we had with ufos in the area."],"Viewing Distance":"20 Feet or Less","Source":"MUFON","Country":"United States","Summary":"Four star like UFOs appear after mysterious all white jet with strange noise flew over."}