{"Latitude":"40.491458","Disposition":"Insufficient Data","trends":["There have been no other sightings in Aspinwall","This sighting has never been favorited."],"Country":"United States","divs":["Sighting Details09I live in Aspinwall, on the corner of Second Western, just outside the borderof the city of Pittsburgh, Pa..09Last night June 25 2003 I walked to the Waterworks Mall to get some things atGiant Eagle. I have to go in an easterly direction to get there. I left thehouse at 1043 P.M. on a trip that normally takes me 12 to 15 minutes. I got asfar as Brilliant Ave. and saw a car on Second making a very slow turn eitherinto a garage or Virginia Ave., about a block and a half away from where I was. I couldn92t tell what color it was, because it was night time. I didn92t think too much of it and continued my walk along Second. By the time I gotacross Lexington, another car turned into Second from Delefield, the next streetup, and drove very slowly, then turned up Lexington. Thinking it might be thesame car as before, it kind of raised my suspicions about their motives fordriving so slowly and circling around those few blocks. This car was red.I was just about to come to a driveway slope in the sidewalk and a low hangingbranch from a fir tree, so I had to be careful about where I was walking and hadto think about where I was going for a few seconds. I continued to walk, butturned to look at the car. Knowing I was coming up to the driveway slope Islowed down for a second as I looked at the car. Out of the corner of my eye Isaw a fairly bright light in the sky. I thought it might92ve been the satellite that can normally be seen from here pretty much everynight. The stars that I saw in the sky were not much more than pinholes in thefabric of the sky, but this light was about the size of 4 or 5 pinholes lumpedtogether and was dark yellow or light orange, instead of white or very lightblue, like the rest of the stars.It was almost directly above me,but behind me a bit and it seemed as if it wastraveling in the same direction as me, but I92ve noticed before that a93still94 object in the sky like a star will appear to be moving with me as long as Iam also moving, but as soon as I stop it93stops94, too. I wanted to get a better look at this light to see if it was movingand, knowing I was in danger of tumbling on the driveway slope, I turned my headfor a very spilt second, maybe half, or even a quarter of a second, to see whereI ws going, and stopped, and immediately turned back around to look at the lightagain to see if it had stopped moving with me and it was gone.From the distance it seemed to be, through the clearing of the trees above me, Iwould h"],"Longitude":"-79.904773","files":["/var/www/straped/mufon/html2text/2381.html.txt","/var/www/straped/mufon/org/2381.html"],"Object Features":"Undisclosed","Object Flight Path":"Straight-line path,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.491458,+-79.904773(2381)&iwloc=A&hl=en\"> mufon case (2381) map </A>","Region":"Pennsylvania","Tags":"City","Date Submitted":"06/25/2003 10:50 UTC","Source":"MUFON","Object Shape":"Undisclosed","Log Number":"","Date of the Event":"06/25/2003 10:50 UTC","City":"Aspinwall","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"Saw various objects vanish in the sky over the pas","Sighting Duration":"00:00:59","Case Number":"2381"}