{"Region":"Virginia","Case Number":"23811","Summary":"Sphere moving perpendicular to sun, from the direction of the sun, moving north east..","files":["/var/www/straped/mufon/html2text/23811.html.txt","/var/www/straped/mufon/org/23811.html"],"Object Shape":"Sphere","Date Submitted":"06/18/2010 05:03 UTC","Source":"MUFON","Disposition":"Unknown","Date of the Event":"06/18/2010 04:15 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsAfter I was done mowing my neighbors lawn today at 4:15 p.m., I went inside for a glass of water. After I drank it, I put on my sun glasses and went outside for a cigarette. I decided to look up for some sky gazing, despite the sun being the only thing hanging in the sky. The sun was shining behind a large maple tree in such a way that is was smothering the suns light, making it much easier to see, as it wasn't nearly as bright as it would have been if there had not been a tree in the way. Something caught my eye in the area of the sun, in what must have been a half centimeter from the outline of the sun. It moved steadily forward over my head toward the North East, away from and perpendicular to sun. It was faint, light gray and spherical, and as it moved away from the sun, it's back was illuminated by it's light. It moved only in a straight line. No contrails. No sound, though it was too high for me to be able to hear any. I eventually lost sight of it only to see two more of these things in the vicinity of the sun when I looked back. A little bit about where I live: I live in Centreville, VA, about a mile and a half away from the NRO (National Reconnaissance Office), which was less than a mile from my old High School, and about 5 miles from Dulles Airport. Being so close to the airport means we constantly have jumbo jets flying over our house to land. Any time of the day you can look up and see at least 6 aircraft in the sky, and many times even more. I am familiar with the flight patterns over my house having lived there all my life. There will always be airplanes flying at different altitudes and in different directions, but they tend to be the same flight paths, give or take. When I was a kid I was fascinated with airplanes and until my sophomore year of High School, I had planned to apply to Embry Riddle Aeronautical University, but my interests in aviation dwindled and I started to focus on writing and journalism. Needless to say I educated myself on ever sort of aircraft under the sun. If it is in the sky, I can name it for you. That being said, this object flew in flight path that I have never seen, in a direction I have never seen. It no wings, no tail, it was simply a sphere. I am shocked at what I saw. It was only 4:15 so it would have been impossible for me to mistake these as satellites. My area is directly under many flight paths, so I can't imagine them being weather balloons, seeing as they would be too much of an obstacle for incoming airplanes. If the sun had not been where it was, and I had not been where I was, I would never have seen these. If the tree was not there in front of the sun, it would have been way to bright for me to have seen them, even with sun glasses on. After all, what better place in the sky to hide than the one that would blind you, right? Who thinks to look at the sun?"],"City":"Centreville","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.845151,+-77.427837(23811)&iwloc=A&hl=en\"> mufon case (23811) map </A>","Longitude":"-77.427837","Log Number":"US-06182010-0006","Latitude":"38.845151","trends":["There have been 5 other sightings in Centreville","There was one other sighting in Centreville on or around June 18th 2010"],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Country":"United States"}