{"Summary":"Witnessed bright object hovering over the trees ( forest).","City":"Roscommon","Source":"MUFON","Disposition":"Insufficient Data","Latitude":"44.50488","Country":"United States","Date Submitted":"06/18/2010 06:29 UTC","Case Number":"23815","map":"<A HREF = \"http://maps.google.com/maps?q=44.50488,+-84.589428(23815)&iwloc=A&hl=en\"> mufon case (23815) map </A>","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Date of the Event":"10/15/1973 06:10 UTC","Object Shape":"Sphere","Log Number":"US-06182010-0010","Sighting Duration":"00:10:00","divs":["sighting detailsit was just about dusk, some light to the west and mainly dark to the east. lat \\long (lat 44.25.55.3182) (long. -84.30.3.2898) while driving between st helen and roscommon on old m76 we seen a very bright light hovering over the trees. i pulled over and got out of the car, i started walking towards the light, my wife was yelling at me to come back to the car. i was standing back from the tree line looking to the east and up, my wife was watching from the car. the ball of light suddenly moved to my right about 100 yards ( in less than the blink of a eye) staying at the same altitude. it stopped for a few minutes just hovering over the trees, it was lighting up the trees below it, never made a sound. suddenly it shot straight up and stopped again, faster than anything i've ever seen, it stayed a few seconds than shot straight up and vanished into the stars. absolutely the most captivating thing we have ever seen in our life time together, 37 years. it was witnessed by another couple on the other side of a curve looking back towards me. \"we believe\""],"Tags":"City","Weather Factors":"None","trends":["There have been 3 other sightings in Roscommon","There were no other sightings in Roscommon on or around October 15th 1973"],"Longitude":"-84.589428","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/23815.html.txt","/var/www/straped/mufon/org/23815.html"],"Region":"Michigan"}