{"Country":"United States","Summary":"I witnessed, along with my wife, a motionless, medium colored silver object, approx 30 to 35 ft. in diameter, approx. 800 to 1,000 ft. altitude in a clear cloudless sky. After several minutes it shot to the So.East at great speed.","City":"McAllen","map":"<A HREF = \"http://maps.google.com/maps?q=26.204697,+-98.220622(23822)&iwloc=A&hl=en\"> mufon case (23822) map </A>","Object Flight Path":"Stationary,Straight-line path","Weather Factors":"None","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in McAllen","There were no other sightings in McAllen on or around November 14th 2008"],"files":["/var/www/straped/mufon/html2text/23822.html.txt","/var/www/straped/mufon/org/23822.html"],"Date of the Event":"11/14/2008 06:11 UTC","Case Number":"23822","Log Number":"US-06182010-0017","Longitude":"-98.220622","Region":"Texas","Source":"MUFON","Object Features":"None","Disposition":"Unknown","Object Shape":"Oval","divs":["Sighting DetailsWhile travelling east down Farm to Market Road ( FM 676 ) just after sunset, toward the city of McAllen I noticed a large. The altitude of the object was aprox. 800 to 1,000 feet, I thought it was odd as it was sitting in the final-approach flyway for McAllen Miller International Airport and was not moving... The object was clearly visible and quickly directed my wife's attention to it and asked her what she thought it might be...after a few moments she replied she did not know and became somwhat ex greyish silver colored oval shaped object sitting motionless in the skycited. My wife as well as myself are highly trained aerial observers and have lived and participated many years in aviation programs ...I pulled over to the side of the road and we both watched the object for about a minute. It quickly shot off at great speed to the southeast toward the McAllen Airport just before a Continental Airliner approached for landing. I quickly called a good friend who works at the airport and asked if there had been any PIREPS or other reports of a brightly colored object to the northwest of the airport...He later called and said there were none. I later asked several other aviation friends if they had heard or seen anything strange in the late evening sky, northwest of the airport...they all replied NO !!"],"Latitude":"26.204697","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/18/2010 11:43 UTC"}