{"Object Features":"Undisclosed","Case Number":"23824","divs":["sighting detailssee video cigar shaped daytime sighting. while standing in my driveway in saratoga county, nys i saw a white capsule\\cylinder\\cigar\\tube with a darker band in the center on a slight diagonal...flying or cruising across the sky. it was absolutely silent, i ran to my truck where i keep my cameras loaded and ready to film because i am a long time skywatcher, i quickly zoomed in and captured this ufo. when zoomed, the picture gets a little shaky and through the view finder i thought i saw something else in the frame, and you will see in the video, that this capsule\\cylinder was being followed by a small unidentifiable small plane. i felt that this was the best capture yet of these commonly seen ufos that many other people are seeing from around the country as well as italy and russia. the distance was less than a mile and at a 500' elevation. to see more captures of the same or similar object....see [cms\\tg\\pid]. i have my theories based on my research, the question is what do you think?"],"Latitude":"42.655049","Country":"United States","Date of the Event":"04/30/2010 07:13 UTC","Region":"New York","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around April 30th 2010","This sighting has been favorited 1 time.",""],"City":"Albany","Weather Factors":"Unknown","Summary":"Video: Silent white cylindrical cigar shaped UFO daytime followed by small plane.","Sighting Duration":"Undisclosed","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=42.655049,+-73.752292(23824)&iwloc=A&hl=en\"> mufon case (23824) map </A>","Disposition":"Unresolved","Date Submitted":"06/19/2010 03:00 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/23824.html.txt","/var/www/straped/mufon/org/23824.html"],"Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-73.752292","Log Number":"US-06192010-0002","Tags":"City"}