{"Source":"MUFON","Summary":"Over a dozen white spheres in the sky over Leesburg, Virginia.","files":["/var/www/straped/mufon/html2text/23821.html.txt","/var/www/straped/mufon/org/23821.html"],"Log Number":"US-06182010-0016","Object Shape":"Circle, Sphere, Star-like, Other","divs":["Sighting DetailsMy family and I were taking a trip to Costco in Leesburg, Virginia @ 5:30pm for some shopping. We went to park and my wife happened to look into the sky and notice a strange looking \"white ball\" in the air. After we parked my family and I got out of the car and gazed at the sky for about 10 minutes. We started noticing dozens of white spheres floating in the sky popping out of nowhere. Some started moving from East to North and others moved from East to Northwest...within the flight pattern of Dulles Airport. At first, we thought the objects were balloons but because of the size of the objects, we knew it was something else. We wondered \"what was going on?\" Wondering whether or not they were drones... At least two of the spheres transformed into double spheres. One on top of the other. Some of the spheres had lights others twirled around. It almost reminded me of gliders twirling in the sky. All of the spheres were stationary for a few minutes and then started floating in different directions. After a few minutes of floating, some disappeared. (We didn't wait for all of the spheres to disappear before going into the store) We went into Costco to shop for a while and after we left, we went to the Starbucks across the street for some coffee. We sat outside and noticed that there were 3 or 4 more spheres in the sky. The time was around 6:15pm. My wife noticed what appeared to be a fighter jet flying very fast across the sky from east to west but no sound. We left to go home (about 10 miles from the Costco and Starbucks) and stayed outside hoping to see more of the spheres. Around 7:30pm we noticed one more double sphere, it floated in the sky for about 10 minutes and then disappeared."],"Viewing Distance":"Unknown","Tags":"City","Latitude":"39.116942","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.116942,+-77.555862(23821)&iwloc=A&hl=en\"> mufon case (23821) map </A>","Region":"Virginia","Case Number":"23821","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Leesburg","There were no other sightings in Leesburg on or around June 18th 2010"],"Country":"United States","Date of the Event":"06/18/2010 05:30 UTC","City":"Leesburg","Date Submitted":"06/18/2010 11:21 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-77.555862","Object Features":"Undisclosed"}