{"Longitude":"-83.068352","Source":"MUFON","City":"Warren","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Sphere, Star-like, Triangle","Latitude":"42.507954","Log Number":"US-06202010-0004","Country":"United States","divs":["Sighting DetailsI got off of work at 9:30 drove southbound on I-75 heading towards 14 mile exit in Troy. upon approaching adams or crooks rd ( I cant remember because I was in aw) I looked south east over the horizon of the freeway and noticed 2 sets of 3 orangish bright lights. They were to large to be stars I thought maybe it was some aircraft with lights on it. then to the left was another set and then another. The third set I couldnt tell if it was a set of 3 because trees were now in the way and lost sight for about 30 seconds. I called my brother who left the same work place around the same time but he didnt pick up. I called my wife and told her to go outside and look up in the sky and see if she could see anything. i came around the trees still going south and now the lights were in a straight line. I called up a coworker of mine and told him what I was seeing and I was describing how I was seeing a line of orbs or spheres (8 plus). and they were dissapearing from the left and right sides in sets until there were only 2 left. and then 1 of the 2 dissapeared and 1 remained. I was trying to locate a spot on the freeway to pull over by big beaver road and then the last one was dimming out. I could no longer spot it and called my brother and he picked up. I described what i was seeing and said that I was coming off an exit to observe the sky and hung up the phone. during that discussion with my brother, he was telling me how it might be some air show. I assured him it was not. I was now approaching the 14 mile exit and my brother calls me back and tells me he sees one of the obecjts I was talking about. he said that it was to the left of him but very low. umbrella like bright orange the size of his entire thumb. I told him are you sure your seeing the same thing because I saw them way smaller. at that moment he said it shot straight up into the sky so fast and dissapeared. he said there were helecopters in that area. I was so freaked out by the incident I went to a friends house who lives in Warren. Mi a couple of miles from the 14 mile exit. My friend was out in his front yard watering his plants and I asked him how long was he out here for he said I just came to the front of the house 5-10 minutes ago but he was in the back yard for a while. I kept looking up in the sky and told him I cant believe what I just saw. Before I said anything else, He said his son was screaming for him to come to the front of the house to see 2 comets in the sky. By the time he arrived they were gone. I then told him everything and to this moment I am in shock. I never believed I would see something like this. I am positive it was not flares or airplanes. It was too big and slow moving to be and airplane. I am ebarassed to call the police or local news. I came on the net hoping to see some news about it but didnt see any. I know there has to be at least a hundred or more people who saw it. You couldnt miss it from your vision on the freeway. It seemed like it was over macomb county or maybe even over the river. I google searched your site and hope you can make some use of this report."],"files":["/var/www/straped/mufon/html2text/23834.html.txt","/var/www/straped/mufon/more/23834_submitter_file1__UFO1.jpg","/var/www/straped/mufon/more/23834_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/23834.html"],"Disposition":"Unknown","trends":["There have been 14 other sightings in Warren","There were no other sightings in Warren on or around June 19th 2010","This sighting has never been favorited.",""],"Date Submitted":"06/20/2010 01:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.507954,+-83.068352(23834)&iwloc=A&hl=en\"> mufon case (23834) map </A>","Case Number":"23834","Region":"Michigan","Summary":"Triangular formation of 9 plus bright objects breaking formation and then dissapearing by sets.","Weather Factors":"Unknown","Object Flight Path":"Stationary,Path with directional change","Object Features":"None","Viewing Distance":"Over One Mile","Date of the Event":"06/19/2010 09:50 UTC"}