{"Tags":"City","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Date Submitted":"04/05/2003 08:30 UTC","Case Number":"2383","Object Features":"Patterned Surface, Wings","divs":["Sighting DetailsI had gone outside to smoke a cigarette and as is my habit, was looking up tosee the stars. This close to dusk the sky was not completely black but rather adeep purplishblack. I saw a large v-shaped object almost directly overhead. Theedges of the v had evenly spaced oblong reflector-type lights which only changedin intensity when passing over a ground light source such as a street lamp andthen they seemed to pick up the ground light. I believed it at first to behollow becouse it blended so well with the night sky until it crossed beneathand blocked out a group of stars. Then I could see that the body was - for nobetter way to explain it - wavery. I went in to get a digital camera but thecamera would not focusthe lens continued to move in and out as long as I tried to focus it on theobject. As it passed directly overhead, the lower 23rds of both wingtips foldedforwarded and now it looked like a giant w. I held up my hands trying to gaugewidth and distance. Im terrible at it but the craft appeared to cover a 12 - 14inch hand spread. It travelled slowly and made no sound and with the exceptionof the reflector-type lights along the edges, it blended perfectly with thenight sky. I couldnt understand why it wasnt falling out of the sky as slow asit was going and with the tips folded forward. I watched it until it passed outof sight.I had a compass on the keyring in my pocket and I tried to take a compassbearing but was unable to due to needle fluctuation until the object had passedout of sight. Then I was able to ascertain it was headed predominantly north. Icalled the Las Vegas police department to see if any one else had reportedseeing it and they connected me directly to Nellis AFB. The man at Nellis toldme not to discuss what I saw with anyone. I then told him I was not on drugs nordid I drink nor was I mentally impaired and that I knew what I had seen.Being afairly long term Vegas resident, I am familiar with the aircraft that fly out ofNellis and I told him it was not one of the experimental planes they send upsometimes and then he got more terse with me and told me he was advising me onceagain to not speak of this with anyone. Period. He asked no questionsshowed neither skepticism or surprise. I told him it was headed directly towardsthe base and I believe he knew exactly what it was I was talking about.I was also surpris"],"Disposition":"Insufficient Data","Region":"Nevada","map":"<A HREF = \"http://maps.google.com/maps?q=36.116846,+-115.167406(2383)&iwloc=A&hl=en\"> mufon case (2383) map </A>","Log Number":"","Latitude":"36.116846","Country":"United States","files":["/var/www/straped/mufon/html2text/2383.html.txt","/var/www/straped/mufon/org/2383.html"],"Date of the Event":"04/05/2003 08:30 UTC","City":"Las Vegas","Longitude":"-115.167406","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around April 5th 2003"],"Object Shape":"Triangle","Summary":"Saw V-shaped craft fly over house","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00"}