{"Latitude":"44.98162","map":"<A HREF = \"http://maps.google.com/maps?q=44.98162,+-93.497632(23835)&iwloc=A&hl=en\"> mufon case (23835) map </A>","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Region":"Minnesota","trends":["There have been 2 other sightings in Wayzata","There were no other sightings in Wayzata on or around June 19th 2010","This sighting has never been favorited.",""],"Date Submitted":"06/20/2010 06:06 UTC","divs":["Sighting DetailsWhen I first saw this object, I suppose it was about 9:00 PM. I had just finished taking a short walk down the street. And was walking up the steps to my house when the object caught my eye. I saw what appeared to be a particularly bright object brighter than the brightest stars cross the sky. It went from the south east to the north west (not exactly sure of the exact orientation, but this is approximate). It slowed down and stopped. Another object which was relatively smaller passed the object after it stopped in the sky. The smaller object continued past and started to turn redder and fainter. I went back inside my house and grabbed my telescope and told my brother and step brother what had happened. We stayed outside and waited to see if the object would move, but it didn't. It seemed like after it was done moving, it turned into what looked like an ordinary star. The object that stopped in the sky was still there, but since my tripod for my telescope was very short, I wasn't able to get a good view of what was in the sky. However, I laid on the ground and I was able to get a stable view. When I looked up in the sky, I saw a few things moving and my brother seemed to point out that the object that stopped in the sky was moving as well, but only slightly. The large object moved smoothly, but did not follow a straight path. I watched it curve a bit. Although a few of the trees in my yard somewhat blocked it, I was able to view it almost the entire time and it was only blocked by the trees for a few seconds. I watched it stop in clear, non-tree-covered sky. It didn't make any noise at all. I was a bit astonished when I saw it. After seeing the object, I watched it for about two hours and then I went inside because I was getting bit by mosquitoes. I believe it might still be in the same spot continuing to hover there. I have been watching the skies this evening and I have seen some other things that were a bit out of the ordinary, but that could be because I was hyped up about yesterday."],"Log Number":"US-06202010-0005","Disposition":"Unknown","Summary":"Bright oval shaped object flew across sky and stopped in mid air still hovering.","Object Shape":"Disc","Tags":"City","Country":"United States","Weather Factors":"Unknown","Date of the Event":"06/19/2010 09:30 UTC","Viewing Distance":"Unknown","City":"Wayzata","Source":"MUFON","Case Number":"23835","files":["/var/www/straped/mufon/html2text/23835.html.txt","/var/www/straped/mufon/more/23835_submitter_file1__PicturemadeinMSpaint.JPG","/var/www/straped/mufon/org/23835.html"],"Sighting Duration":"00:10:00","Longitude":"-93.497632"}