{"Tags":"City","Sighting Duration":"01:00:00","divs":["Sighting DetailsMy husband and I were at his parents cottage at Sauble Beach. It was Labour Dayweekend. It was a very warm and humid night, so my husband and I decided to godown to the beachon Lake Huron to go for a midnight swim. We entered the waterabout 6 blocks away from the main tourist area where we heard partying going on.There was no one near us either in the water or on shore that we could see. Wehad been in the water for maybe 10 minutes when there was a bright flash oflight. I awoke on the beach perhaps 30 min to an hour later.Have no reference for time. I was alone and naked. My bathing suit was gone andmy towel was on a picnic table near where I had left it. My husband was nowherein sight. I was very confused and somewhat frightened. I wrapped myself in thetowel and hurried back to the cottage which was about 4 blocks inland from thebeach. When the cottage came in sight I saw my husband sitting on a lawnchair onthe front deck of the cottage. I ran up to him and asked him what had happened,why did he leave me at the beach, and was generally just very confused andconcerned about the event. My husband seemed to come out of a daze and said hedidnt know anything about anything. He remembered going to the beach and gettinginto the water, seeing the light and then not knowing anything until I spoke tohim upon reaching the deck. We were both confused and concerned, but did notspeak about this much after. We did throw out the idea that we had had anencounter, but we were both responsible people with 2 childrenat that time andseemed both to be afraid of bringing the situation up. We have very casuallymentioned it once or twice since, but both have seemed to have the idea thatmaybe we didnt want to know the answer. I did tell my children as adults aboutitthey are now 29,24, and we had a daughter born the next year who is almost 19.The subject came up the other day because it has become a sort of family jokethat my youngest was the result of that encounter. She was born 10 months later and has an unusual mole design on her stomach. We are not serious about it. Iam writing to I guess tell the story. Maybe this whole event was just weird andbe forgotten, or maybe it has some signifigance. You decide. We are openmindedand would like to hear if you think there may be something to my story.Thanks.my husband and I are now separatedbut"],"City":"Sauble Beach","Weather Factors":"Unknown","Object Shape":"Other","Country":"Canada","Object Features":"Undisclosed","Longitude":"-81.266667","Date Submitted":"06/27/2003 09:11 UTC","trends":["There has been one other sighting in Sauble Beach","There were no other sightings in Sauble Beach on or around"],"Region":"Ontario","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2384.html.txt","/var/www/straped/mufon/org/2384.html"],"Disposition":"Unresolved","Summary":"Unknown encounter.","Case Number":"2384","Object Flight Path":"Unknown","Latitude":"44.633333","Date of the Event":"Unknown","Viewing Distance":"21-100 Feet","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=44.633333,+-81.266667(2384)&iwloc=A&hl=en\"> mufon case (2384) map </A>"}