{"files":["/var/www/straped/mufon/html2text/23846.html.txt","/var/www/straped/mufon/org/23846.html"],"Object Shape":"Circle","Viewing Distance":"501 Feet - 1 Mile","Region":"Oklahoma","Latitude":"36.158602","Country":"United States","Disposition":"IFO","Longitude":"-95.991325","Date of the Event":"06/19/2010 09:56 UTC","Date Submitted":"06/20/2010 03:06 UTC","Object Flight Path":"Straight-line path","Case Number":"23846","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around June 19th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.158602,+-95.991325(23846)&iwloc=A&hl=en\"> mufon case (23846) map </A>","Log Number":"US-06202010-0016","Source":"MUFON","Summary":"Group of approximately 12-15 circle white (some blinking) UFOs moving slowly over the Tulsa downtown, grouped together but with no discernible pattern, equidistant from each other.","Object Features":"None","divs":["Sighting DetailsMy husband and I were going to a music show at the Crystal Pistol Saloon in downtown Tulsa. The show started at 10:00 pm and we arrived in the parking lot across from the street the saloon was located on approximately 9:55 or 9:56. After I got out of the car and was shutting the door, I looked across the road towards the bar and happened to look up at the sky. The local bars there had two light beams shining up into the sky and rotating back and forth (they do this for advertising). Because these lights light up the sky, I noticed (as well as my husband after he got out of the car) about 12-15 (maybe even 20) of what looked like stars moving slowly across the sky. In fact, if my eyesight hadn't lingered for a moment, I would have just thought they were stars and walked into the bar and thought nothing of it. However, my eyes did linger on these objects and that is when I relised they were moving slowly in no discernible pattern, that is, some were closer to each other and some looked like outliers. However, they all remained equidistant to each other while travelling. I noticed some were blinking and some weren't. They had the brightness and whiteness of a star, not brighter and not whiter. However, my husband told me after the event that some of them had started glowing red. I myself did not notice this. After several \"what the hell is that\" exchanges between us, we both just stood transfixed at the sight. Then they were gone from the swath of sky they were in; it looked to me as though they entered cloud coverage and disappeared. However, my husband said that to him it looked almost like when they all crossed a certain line in the sky, they disappeared. He didn't feel like they went into cloud coverage, but rather that they shut their lights off or just disappeared. Unfortunately, there were no other witnesses to this, as the parking lot was empty and there was so much noise coming from the bars that we couldn't have yelled for people to look up. I have racked my brain trying to mentally discredit what I saw; but, I know that last night actually constituted my first actual alien craft sighting. Strangely enough, both my husband and I didn't feel the need to jump into the car and try to chase it or follow it (as I always imagined I would do in this scenario) but rather we felt calm, elated, almost surreal, and we both have commented that we don't feel like this will be our last sighting."],"Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","City":"Tulsa"}