{"City":"Darien","Object Flight Path":"Path with directional change","Object Shape":"Fireball, Star-like, Triangle","Sighting Duration":"00:01:30","Disposition":"Unknown","trends":["There have been 2 other sightings in Darien","There were no other sightings in Darien on or around June 19th 2010"],"Longitude":"-87.968804","Region":"Illinois","files":["/var/www/straped/mufon/html2text/23847.html.txt","/var/www/straped/mufon/org/23847.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.753008,+-87.968804(23847)&iwloc=A&hl=en\"> mufon case (23847) map </A>","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"06/20/2010 03:07 UTC","Date of the Event":"06/19/2010 10:45 UTC","Case Number":"23847","Latitude":"41.753008","Country":"United States","Log Number":"US-06202010-0017","Summary":"Five slow moving orange lights in the southwest sky. Began with a triangular shape moving south that eventually dispersed as one by one the lights disappeared.","divs":["Sighting DetailsIt was about 10:40 something at night when My band and I just got back to home base in Darien, IL. My van was parked backwards in the driveway, and we began to unload our equipment out of the truck. As I took out and set down my amplifier, I looked towards the southwest sky, where I saw right by the moon were five slow moving orange lights, gravitating towards the southern sky. They seemed to be in a delta triangle position. If I were facing south, they would be going from my right to directly in front of me. Originally, I had no idea what to think. Definitely not airplanes, but they way they were in position made me think of some type of armada. I immediately called the rest of the gang, who were all astonished to see the same thing. Within about 45 seconds, they left the triangle shape and began dispersing, and one by one they began to disappear, in the southern sky. WE followed them for about a minute thirty seconds tops. Almost immediately afterwards we heard loud boom like explosions. We attributed them to the Woodridge jubilee festival going on a town over."],"Object Features":"Unknown","Source":"MUFON"}