{"Weather Factors":"Unknown","divs":["Sighting DetailsWhile camping up near Geneva park near Grant Colorado, I got up around 3:30 to go to the bathroom (in the woods). I felt a bit anxious when I woke up. I noticed my brother who I was camping with was feeling a bit on edge too so we both decided to get some fresh air. The Milky Way was the brightest, most defined I'd ever seen it - it was an amazingly clear, crisp dark night with tons of stars. As I'm looking SW at the Galaxy belt I see an intense bright light out the corner of my eye toward the south come out of nowhere. It is brighter and larger than anything in the sky. Once I looked directly at it it appeared to be coming down toward me without any horizontal movement. It made no noise and it looked like it would if were a police helicopter shining it's spotlight straight down at you. I remember being stunned by this and wondering what was going to happen next. This lasted for maybe 8 to 10 seconds before the light dissipated to the brightness of a small, dim star. As the light dimmed it began to move NW in the sky as if it were a satellite. I followed it for about 20 seconds before it was no longer visible and faded away into the sky. I'm not sure what it could have been. I thought that maybe it could have been a satellite catching a very intense reflection of the sun. However, I've never seen or heard of a satellite stopping mid flight and then continuing on again impossible at those speeds. I have seen similar sightings before but this was a bit spookier than the others. Weird!"],"Date of the Event":"06/20/2010 03:30 UTC","Tags":"City","Longitude":"-105.661672","City":"Grant","Source":"MUFON","Object Shape":"Flash, Star-like, Other, Unknown","trends":["There has been one other sighting in Grant","There were no other sightings in Grant on or around June 20th 2010"],"Date Submitted":"06/20/2010 09:13 UTC","Country":"United States","Summary":"Bright flash out of sky.","map":"<A HREF = \"http://maps.google.com/maps?q=39.45971,+-105.661672(23853)&iwloc=A&hl=en\"> mufon case (23853) map </A>","Case Number":"23853","Latitude":"39.45971","Region":"Colorado","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/23853.html.txt","/var/www/straped/mufon/org/23853.html"],"Disposition":"IFO","Object Flight Path":"Hovering then path","Log Number":"US-06202010-0023","Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown"}