{"Sighting Duration":"Undisclosed","Region":"Florida","Source":"MUFON","Disposition":"Insufficient Data","Case Number":"23855","Object Flight Path":"Undisclosed","Country":"United States","Tags":"City","Latitude":"25.797969","files":["/var/www/straped/mufon/html2text/23855.html.txt","/var/www/straped/mufon/more/23855_submitter_file1__IMG_1129.JPG","/var/www/straped/mufon/more/23855_submitter_file2__IMG_1130.JPG","/var/www/straped/mufon/more/23855_submitter_file3__IMG_1131.JPG","/var/www/straped/mufon/org/23855.html"],"Log Number":"US-06202010-0024","Viewing Distance":"Unknown","Object Shape":"Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=25.797969,+-80.218739(23855)&iwloc=A&hl=en\"> mufon case (23855) map </A>","divs":["sighting detailsmy partner (*name deleted--sgonzalez\\cms) and i were sitting on the couch at home watching the opening of the series finally of the tudors at 9:05 pm est, when i spotted the first in a series of about 15 orange\\red glowing orbs. during the event several planes had departed miami international airport flying out of the airport from the west to the east. the first orb quickly passed by us flying in a se to w\\nw direction and disappered from site within 5 minutes. then about 15 minutes later the sky had filled with the same orbs, about 15 in total. the drifted to the south of us for about 10 minutes, then quickly departed in a w\\nw direction until they were no longer in view. we each took several pictures with our iphones, however little detail can be seen in the photos. the objects moved slowly and silent passed us and then appeared to increase in speed and quickly disappeared while traveling in a west\\north west direction. the only sounds in the sky were coming from the jetliners departing miami international airport which passed about 2 to 5 miles south and parallel of the ufos. the ufo's appeared in random groups of one, two's and three's and appeared to be flying at an altitude that matched the jetliners flying out of mia. we both felt calm, yet excited honored to witness something so beautiful and unique. all three images unfortunately show only a bright white ball of light with none of the details that we witnessed in person. the objects\\ufos are the small points of light, each photo show only one object which, in each photo, happens to be the single highest point of light. the balance of lights are from single story commercial buildings on biscayne blvd\\a1a and street lights."],"Object Features":"Undisclosed","Summary":"Multiple orange-red glowing orbs moving from SE and E toward the W NW.","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around June 20th 2010","This sighting has never been favorited.",""],"Longitude":"-80.218739","Date Submitted":"06/20/2010 11:57 UTC","Date of the Event":"06/20/2010 09:05 UTC","Weather Factors":"Unknown","City":"Miami"}