{"Date Submitted":"06/20/2010 08:01 UTC","Disposition":"IFO","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/23851.html.txt","/var/www/straped/mufon/org/23851.html"],"City":"Cumming","Weather Factors":"None","Country":"United States","Region":"Georgia","Date of the Event":"06/18/2010 11:00 UTC","Source":"MUFON","Tags":"City","Object Features":"Unknown","Longitude":"-84.134253","Latitude":"34.2164","trends":["There have been 14 other sightings in Cumming","There were no other sightings in Cumming on or around June 18th 2010"],"divs":["Sighting DetailsEach night I go out on our back deck to run the dog around the back yard before bedtime. On this particular evening, my 13 year old son was outside with me. I always take breaks to let the dog catch her breath and I look up at the sky when it's clear. This was a nice clear night with a semi-bright moon. I then noticed a small star that was slowly moving across the sky. (I say slowly, because it was so darn high in the sky and there was no darting action.)I told my son that it was way TOO high for any plane to fly and there were no flashing lights. I had him run inside to grab our binoculars, but by the time he came out it had disappeared. There was a low thin cloud that blocked my view for 5-6 seconds, but I could see another star through it. I was straining to keep my eyes on it until I got hold of the binoculars, but it was simply gone from sight. It must have only been 20-30 seconds that I watched it and I thought that maybe it was a satellite or something, but I don't think something like that would move so much. But what do I know, maybe it was a high-flying plane, this is the first time I am posting something like this."],"Log Number":"US-06202010-0021","Case Number":"23851","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.2164,+-84.134253(23851)&iwloc=A&hl=en\"> mufon case (23851) map </A>","Summary":"We witnessed a star moving across the sky.","Object Shape":"Star-like"}