{"Latitude":"33.837833","Region":"California","files":["/var/www/straped/mufon/html2text/23857.html.txt","/var/www/straped/mufon/org/23857.html"],"trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around June 20th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.837833,+-117.906134(23857)&iwloc=A&hl=en\"> mufon case (23857) map </A>","Object Features":"Undisclosed","Viewing Distance":"21-100 Feet","Weather Factors":"None","Case Number":"23857","Source":"MUFON","City":"Anaheim","Date of the Event":"06/20/2010 09:50 UTC","Disposition":"Unknown","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Summary":"Disc shaped object hovering over Willow Park.","divs":["sighting detailsmy wife, a family friend and my 6 year old nephew and i were heading home going westbound in anaheim ca. i noticed a row of bright light hovering over a park. i was shocked at the possibility this could be a ufo. i quickly told my wife and our friend to look up at the lights in the sky. it was a clear sky, we pulled over next to the hovering object about 100-150 ft away from it. we noticed this object was huge in size about 50-100 ft wide disk shaped and it had a ring of lights on the side of the craft with a red light in the middle of the ring of lights. it started moving northwest and the ring of lights started flickering one light after the other. we followed it for about 5 min trying to take pictures of it but our cellphone cameras were not good enough to take pictures. my 6 year old nephew started freaking out because he did not know what it was. all of the sudden the disk shaped object was gone. making no sound just disappeared. looking at the web we found a video filmed about a year ago 50 miles away from where we live. in this video this is the exact same thing we saw. sadly we could not take pictures or video. http:\\\\www.youtube.com\\watch?v=u4d1osmei9g&feature=player_embedded"],"Date Submitted":"06/21/2010 03:22 UTC","Object Shape":"Disc","Log Number":"US-06212010-0002","Longitude":"-117.906134"}