{"Weather Factors":"Unknown","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around May 25th 2010"],"Date of the Event":"05/25/2010 08:45 UTC","Longitude":"-79.374594","files":["/var/www/straped/mufon/html2text/23861.html.txt","/var/www/straped/mufon/org/23861.html"],"City":"Toronto","Source":"MUFON","Object Features":"None","Tags":"City","Country":"Canada","Summary":"Flaming orange orb witnessed by 4 people less than 50 feet away in full daylight.","Viewing Distance":"21-100 Feet","Object Flight Path":"Path with directional change","Disposition":"Unresolved","divs":["Sighting DetailsIt was a windless and clear evening. My daughter was on the back deck with her boyfriend and she frantically called me to come outside. There was a large bright, glowing orange orb was floating in the air below our neighbours tree line (<40 feet high). It was large - nabout 3 feet in diameter. At first I thought it was fireworks debris but there were no ashes trailing from it. I was worried that it was going to crash into one of the houses behind us and start a fire, I was going to call the fire dept. but after observing it for a while - it was obviously moving on its own - it didn't move the way you would expect burning debris to move. Then I thought it was a chinese lantern on fire, but this was very close - approx. 50 feet away and was no lantern. It was not open at the bottom. It was not perfectly round either, it was like a ball of orange gas with an irregular surface - I could see small flames all over the surface. It was totally silent. When my husband and I came out and saw it - it was traveling eastwards very slowly and at a slight downwards motion, but my daughter thinks it came down from the sky as it was descending when she first spotted it. This would explain why more people didn't report it. It \"floated\" for about 7 seconds (traveling about 50 ft) then it turned (about 200 degrees) to clear the large group of trees (i.e. to go around the trees). When it got to the back of the neighbours yard it took off in a straight line at a greater speed (30 MPH?) in between 2 houses. We knew we couldn't follow it as it was going too fast now. It was definitely burning some kind of fuel but what gas burns this tangerine orange colour? This was seen in a very densely populated urban neighbourhood. I think it may be some experiment in alternative energy (fuels). But I have no idea what it was. Apparently lots of people are seeing these orange orbs but no one knows what they are. We didn't get photos, too bad because we were closer than any other sighting I read about on the web. My daughters cell phone camera was right beside her and her boyfriend told her to take a picture but we were all too freaked out to take our eyes off of it. Feelings or reactions? I felt that I was witnessing a secret experiment. We are close to Lake Ontario with a US military base across the lake. I also think that maybe others reported this to the police or fire depts. But I don't have access to that information."],"Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=43.655846,+-79.374594(23861)&iwloc=A&hl=en\"> mufon case (23861) map </A>","Latitude":"43.655846","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Case Number":"23861","Log Number":"CA-06212010-0006","Date Submitted":"06/21/2010 09:25 UTC"}