{"divs":["Sighting DetailsIn total there were three of us. We were just west of Calgary, Alberta camping in a private area along the Elbow River. The walk to the river was ten to fifteen minutes from where we set up camp. Around 2am we decided to go for a walk to the river so we grabbed head lamps, a lantern and my friend's dog and headed towards the river. The walk from the camp to the river is spent walking through trees and thick brush 95% of the way to the river. The sky was unbelievable clear that night and we could see so many stars from horizon to horizon. Once clear of the brush we had a huge view of the sky. We noticed many satellites overhead and discussed trying to find out when the Space Station was flying overhead that night. The river had about 2 meters of fog on top of it and it was quite cool outside. The dog was not acting strange in any way, he seemed content to take a step or two into the river and then continue to meander around. All three of us were looking towards the sky but in slightly different directions, enough to cover at least 65% of the visible sky. It was very quiet when a pulse of light, the like of which I have never seen appeared to encompass us. It was quiet bizarre. It was as if there were an epicenter (like when you drop a pebble in a pond) right above us. The light wave moved away from the epicenter in all direction, 360 degrees. It was white and very intense. It was very strange because of the visible physical properties of it. It made it look as though the entire atmosphere was moved like a wave through water and it definitely had a 3D look to it. I currently study the properties of light in physics and radiology which made it clear to me immediately, that because of the 3D wave like nature of this event that it was some kind of strange occurrence or anomaly. The part I want to stress the most is the 3D water wave like nature of this light and the fact that it was directly over our heads. We felt odd after the pulse happened and when we returned to the camp we all felt a little different. From this point on we stayed in and around the camp for the night and around 10am we returned to the river to recover the dogs leash. We sat around for a bit but all three of us felt odd and we returned to the camp and relaxed in the sun for the afternoon. At no point do any of us recall seeing an object that could be distinguished from a satellite, and we only saw one plane fly overhead but it was before the pulse and it was very clearly an international flight heading away from Calgary. No noises were heard at any point before, during or immediately after the pulse. That is about all I can think of at this time. Thanks for taking the"],"Tags":"City","Object Flight Path":"Undisclosed","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around June 12th 2010"],"City":"Calgary","Weather Factors":"None","Sighting Duration":"00:00:05","Source":"MUFON","Country":"Canada","Case Number":"23862","files":["/var/www/straped/mufon/html2text/23862.html.txt","/var/www/straped/mufon/org/23862.html"],"Longitude":"-114.048852","Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=51.05003,+-114.048852(23862)&iwloc=A&hl=en\"> mufon case (23862) map </A>","Date Submitted":"06/21/2010 10:55 UTC","Latitude":"51.05003","Object Features":"Undisclosed","Disposition":"Unresolved","Date of the Event":"06/12/2010 02:00 UTC","Region":"Alberta","Summary":"Strange pulse of light.","Log Number":"CA-06212010-0007","Viewing Distance":"Unknown"}