{"Region":"Missouri","Date of the Event":"03/31/1985 09:00 UTC","Object Flight Path":"Unknown","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=39.103886,+-94.573347(2387)&iwloc=A&hl=en\"> mufon case (2387) map </A>","Longitude":"-94.573347","Summary":"Large Unexplaned light, Kansas City, MO","Case Number":"2387","Country":"United States","Viewing Distance":"101-500 Feet","Disposition":"Insufficient Data","Date Submitted":"03/31/1985 09:00 UTC","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around March 31st 1985"],"files":["/var/www/straped/mufon/html2text/2387.html.txt","/var/www/straped/mufon/org/2387.html"],"Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Sphere","Object Features":"Undisclosed","Sighting Duration":"00:05:00","Latitude":"39.103886","divs":["Sighting DetailsNOTE I know the Latitude, longitude isnt exactly what you were looking for. Idid the best I could with all the tools available to me via the internet.I was 5 yrs old living with my mother and grandmother at 7102 E 55th ST, KansasCity, Mo 64129. This property is 2 12 acers with two houses on a quite street. However I-435, a major Kansas City highway borders it on the east. It was about8 -830pm, and my mother and I were in our nightcloths and were sitting in achair on our portch cuddled up in my blanket looking at the stars. Suddenlywithout any warning or indication a very bright, but not light casting, palewhite light. There was no noise, no unexprected breaze. The Object was justabove the treeline no more than 500 yrds away.The light stayed there for 15 - 30seconds. The light then went out and a few seconds reapeared what would havebeen about 50 feet or more to the west left, a deep rich almost crimson red. Again the objects light remained lit for 15-30 seconds and then went out. Oncethe light went out the object was not visable. At no time was I, or my motherfrighten of what was happening I was just courious. Even though I was young Iknew what I was seening was not normal. I never again saw anything like it. Although my mother was present, and I almost certinly remember talking with heron how odd the thing we were witnessing was, she does not remember the event atall. When we went inside I remember that we told my grandmother what we hasseen. She too does not remember us telling her anything."],"Tags":"City","City":"Kansas City"}