{"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/23875.html.txt","/var/www/straped/mufon/org/23875.html"],"trends":["There have been 2 other sightings in Laguna Hills","There were no other sightings in Laguna Hills on or around June 20th 2010"],"Object Features":"Undisclosed","Log Number":"US-06212010-0020","Summary":"Driving home from parents house with my husband and son.","divs":["sighting detailsmy husband, my son adn i were driving home from my parents house on cabot road. my parents live about 5 miles away from our home. as we were about to turn left on paseo , i looked up in the sky adn noticed a disk flying with rotating lights...we have a lot of helicopters that fly over our house so i pointed it out to my husband, thinking \"this doesn't look anything like a plane or helicopter\" . he looked up and saw it and agreed that this was something he's never seen before. my son saw it too, but we donw played it to him, because we could tell it frightened him. we tried to follow it as it was actually in the sky on our way home to our house, but it disapeared behind some trees and we didnt see it again. i tried to capture it with my camera but you can not see anything on the video...too dark and too far away. while trying to find out if anyone had seen this object last night...i came across this utube video...this is what we saw: http:\\\\www.youtube.com\\watch?v=u4d1osmei9g&feature=player_embedded some people have comented that this video is a blimp with rolling letters....i wish it was that easy to explain away, but what i saw had symetrical round lights roatating around a disc shaped object."],"Object Shape":"Disc","Country":"United States","Disposition":"Unknown","City":"Laguna Hills","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.599444,+-117.699444(23875)&iwloc=A&hl=en\"> mufon case (23875) map </A>","Source":"MUFON","Longitude":"-117.699444","Date Submitted":"06/21/2010 08:55 UTC","Date of the Event":"06/20/2010 12:00 UTC","Case Number":"23875","Weather Factors":"Unknown","Latitude":"33.599444","Object Flight Path":"Undisclosed"}