{"files":["/var/www/straped/mufon/html2text/23883.html.txt","/var/www/straped/mufon/org/23883.html"],"Object Features":"Unknown","Source":"MUFON","Region":"Arizona","Object Shape":"Circle, Fireball, Flash","Log Number":"US-06212010-0028","trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around June 15th 2010"],"Sighting Duration":"00:03:00","Case Number":"23883","Latitude":"33.301197","Summary":"Orange lights in sky (Maricopa, AZ).","Longitude":"-112.423466","Tags":"City","Country":"United States","Date of the Event":"06/15/2010 08:54 UTC","Object Flight Path":"Other","divs":["Sighting DetailsOn June 15, 2010 at approximately 8:56 PM, Local time. My wife and I were in our vehicle traveling southbound on SR 347 (Maricopa HWY), between Riggs and Casa Blanca Roads. We were driving back home in Maricopa I observed two orange lights turning on and off. They were in the southern sky at approximately 30 degrees in the sky. The lights turned on very bright for a second. Then they would dim out, and repeat. They did this three times and then completely disappeared. They lights were at least 3 times the size of Venus. Approximately 5 seconds later, my wife spotted two lights appear to our right, southwest in the direction of Mobile. The lights were very bright and moving slowly, south along the Palo Verde Mountains. They appeared to be the same lights we had just seen. Both lights went behind the Palo Verde Mountains. Even though we could not see the lights we could see the orange glow over the mountain, as if there was a fire on the other side. Then the glow faded away. Me and my wife looked at each other and tried to figure out what we had just seen. We know it was not an Airplane, or a flare. I have served in the military and have seen illumination flares, and this was not one. I was not a shooting star, or an airplane. And it was not a planet or Star. We could not figure out a reasonable explanation."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.301197,+-112.423466(23883)&iwloc=A&hl=en\"> mufon case (23883) map </A>","Disposition":"IFO","Weather Factors":"None","Viewing Distance":"Unknown","Date Submitted":"06/21/2010 11:58 UTC","City":"Maricopa"}