{"divs":["sighting detailsi listen to all of the civil and military aircraft frequencies for ufo reports. for 30 years i have never heard nothing but while driving home to e texas from shreveport la. about a week and a half ago my receiver locked up on 124.575 or 128.575 \"will confirm frequency later\" and a pilot was talking about \"something that was glowing\". he told fwc that \"about 5 aircraft had reported it on the last frequency\". then some pilot made some type of crazy comment that i didnt understand. then a pilot made the \" twilight zone\" diddle over his mic. i never heard nothing else. im sure that you know how to find this stuff out with the air traffic control centers. im sure it was a dfw controller that was routing high altitude traffic and not a local shreveport la. controller. please let me know what or if you find out anything regarding this matter. im retiring in sept. and will be taking a field investigater course if one is needed in my area. i reside in e texas about 20 miles from shreveport la. but have property about 30 miles n of shreveport near plain dealing la . i am all over e texas and nw la. and would like a large area if possible. im so heavy into ufo's that im designing a type of camera system to watch the skies at all angles plus have a rotateable camera with zoom lens also. my cameras will be recording constantly where i can review the skies at any time. im a ham radio operator and have a dedicated 180 ft tower just for this system. right now im looking at whats available. i also want to purchase a professional cam corder to have with me while traveling. the dept store cameras wont do. im sorry for being late reporting this to you , but im sure theres a log regarding this incident somewhere at dfw . thanks , *wit's name deleted--sgonzalez\\cms)."],"trends":["There have been 16 other sightings in Shreveport","There were no other sightings in Shreveport on or around June 12th 2010"],"Tags":"City","Region":"Louisiana","Date of the Event":"06/12/2010 11:00 UTC","Source":"MUFON","Case Number":"23884","City":"Shreveport","Latitude":"32.532742","Log Number":"US-06222010-0001","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/23884.html.txt","/var/www/straped/mufon/org/23884.html"],"Date Submitted":"06/22/2010 01:13 UTC","Sighting Duration":"00:10:00","Disposition":"Unresolved","Viewing Distance":"Unknown","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.532742,+-93.747179(23884)&iwloc=A&hl=en\"> mufon case (23884) map </A>","Summary":"Aircraft reporting UFO to Fort Worth Center ATCC.","Country":"United States","Longitude":"-93.747179","Object Features":"Undisclosed"}