{"Object Shape":"Sphere","Summary":"a Lubbock Light in Posey, TX","Source":"MUFON","Date Submitted":"11/30/1975 05:30 UTC","Case Number":"2388","Tags":"City","Date of the Event":"11/30/1975 05:30 UTC","divs":["Sighting DetailsI was in my mothers car. It was early in the morning, still dark, and she wasinside getting the rest of us kiddos ready to go. The car was on but the enginewas not running. I was listening to the radio and watching the stars. All of asudden a globe colored reddish-orange flew over the roof of the car from theback to the front out over the cotton field. To me, it was the size of abaseball. I dont know the altitude of the object. It appeared to go over thefield at a descending angle and than stop some feet off the ground. Then it wasjust gone. There was no tail like with a meteor or comet. For a split second,I thought it was a falling star. Then I realized it wasnt and I remember fear. Bone chilling fear. The noise was like a whoosh as it went over head. Myfamily in the house didnt hear it, or at least wont admit to hearing it. Icouldnt move, which could have been the fear. Since this, I have weirdheadaches occasionally. Just an uncomfortable feeling, not really a pain, overmy left temple that sometimes shoots to the right. Sometimes its at the base ofmy skull. Id describe it as a feeling of fullness or pressure. On the back ofmy left hand I now have a circular gouge-like scar, about the size of one ofthose old Josephs Childrens aspirins.I also had an odd in experience in Puerto Rico while my husband and I werestationed there. I was being questioned about the name of my god. There wereother questions but I only remember definately that one. The entity questioningme was not like the typical alien. the head was outsized but not grotesquely,the eyes were dark and slanted, but not huge. The area lighting was dim, likeat a romantic restaurant. I was not restrained, I was lying down, things seemedgreyish. I was not in my bedroom. No fear, just an urgency to answer thequestions. Since the first experience, I have empathic episodes that I try toignore, but they usually turn out to be correct and its hard to ignore that.This may all be nothing, but I feel compelled to tell someone now. I have alsorecently had this longing to move from Texas to New Mexico and my head painshave been more constant than usual. From five to twelve a year to five totwelve a week."],"files":["/var/www/straped/mufon/html2text/2388.html.txt","/var/www/straped/mufon/org/2388.html"],"trends":["There have been no other sightings in Posey","This sighting has never been favorited."],"Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","Latitude":"33.482588","Log Number":"","Region":"Texas","City":"Posey","Sighting Duration":"00:05:00","Object Features":"Undisclosed","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=33.482588,+-101.710161(2388)&iwloc=A&hl=en\"> mufon case (2388) map </A>","Longitude":"-101.710161"}