{"Disposition":"Unresolved","Object Flight Path":"Undisclosed","Log Number":"US-06222010-0005","Longitude":"-76.869982","Case Number":"23888","Date of the Event":"06/21/2010 07:45 UTC","Object Features":"Undisclosed","Country":"United States","Weather Factors":"None","Tags":"City","Summary":"Large circular hole in clouds with vapors forming a cone.","City":"Watkins Glen","map":"<A HREF = \"http://maps.google.com/maps?q=42.385259,+-76.869982(23888)&iwloc=A&hl=en\"> mufon case (23888) map </A>","files":["/var/www/straped/mufon/html2text/23888.html.txt","/var/www/straped/mufon/org/23888.html"],"Date Submitted":"06/22/2010 08:52 UTC","Object Shape":"Cone","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"42.385259","trends":["There have been 3 other sightings in Watkins Glen","There were no other sightings in Watkins Glen on or around June 21st 2010"],"divs":["sighting detailslast night on june 21, 2010 at 7:40-8:05 i was out for a walk in schuyler county in new york, about 5 miles south\\souteast of watkins glen when i noticed a large circular hole formation in the clouds. the background light made the edge of the circle very distinct, and out of the entire area of the hole hung a gauzy, vaporous mass of stringy clouds. this vapor converged at a point about the distance of its radius below it. the clouds in the sky were fairly low-altitude clouds, and as i was walking along and watching this, i reasoned that it couldn't be a tornado or a whirlwind of some sort, because the strings were not spinning or twisted. and, it couldn't be rain, because it came to a point like a cone (though not a perfect one) hanging from the clouds. my first thought was of a report i saw on line recently of probably the same thing where in russia and china people took pictures on their cell phones of a very similar thing (except for these curious stringy vapors reaching down). i watched it for my entire walk, which lasted about 25 minutes, and it held it's shape for just about the entire time. as it drifted from west to east, the vapors remained in a funnel shape under the hole, but the point seemed to be trailing off to the west\\nortwest direction towards the southern end of seneca lake. eventually, it started to lose it's consistency and the vapor trail stretched farther and got thinnner, but the spot where it was in the sky did not convert to the same cloud type as those around it, and seems like it was having a hard time filling back in with similar surrounding clouds. i went in the house and told my wife about it and how it looked like the pictures i'd seen on-line of similar circular clouds. i'd wanted to get my neighbor to come out and see it, while i was walking past his house, but it looked like he wasn't home, and i didn't want to lose sight of it. i never thought it would happen within a half a mile of my house! finally, it wasn't until this morning when i thought that, perhaps the vapors were not drifting down from the hole in the clouds, but being drawn up into it! the actually didn't seem to descend or ascend, but were quite stationary. i don't have a cell phone or a digital camera or i might have caught a picture!!!"],"Region":"New York","Viewing Distance":"Unknown"}