{"Case Number":"23907","City":"Lisle","Date of the Event":"06/23/2010 02:40 UTC","Region":"Illinois","trends":["There have been 4 other sightings in Lisle","There were no other sightings in Lisle on or around June 23rd 2010"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.803241,+-88.066238(23907)&iwloc=A&hl=en\"> mufon case (23907) map </A>","Latitude":"41.803241","files":["/var/www/straped/mufon/html2text/23907.html.txt","/var/www/straped/mufon/org/23907.html"],"Tags":"City","divs":["sighting detailstaking an afternoon walk with my children, heading west on handley, and saw a \"black balloon\" in the sky. the time was approximately 2:40pm cst. this \"balloon figure\" was egg\\oval shaped at times and then also looked circular. at first, i thought it was a balloon (although it had not strings attached from it), but then it's shape changed and it kept going higher and higher into the sky (which was clear, except for some light, wispy cirrus clouds). i couldn't believe a balloon could go so high. so, i was trying to point it out to my almost 3 year old daughter, but she didn't see it. my son is 7 1\\2 months and was sleeping. the object's path was from south to north. a helicopter started coming closer to the object and the object stopped and went straight down through some clouds, so it was almost in line with the helicopter. helicopter continued on it's path and then about 30 seconds later a large airplane crisscrossed the helicopter's path. by the time the airplane came to where the black object and helicopter had been, i saw the black object start to go north and just disappear. i was calm, but hot (was 90+ degrees and humid), before the sighting. i am always looking in the sky, especially after my 2 previous ufo sightings, which have all happened during the daylight. this object was completely different than my other 2 sightings. after the object disappeared i starting \"seeing black spots that looked just like the object\" everywhere i looked. i rubbed my eyes and saw a few more, then it stopped. i was not dehydrated, i had just gotten done drinking an entire bottle of water."],"Disposition":"Unknown","Object Features":"None","Log Number":"US-06232010-0009","Longitude":"-88.066238","Date Submitted":"06/23/2010 04:44 UTC","Summary":"I saw a black object that looked similar to a \" balloon\" going higher and higher in the sky. As a helicopter approached, it stopped and went near it. An airplane came shortly after and object went north and disappeared.","Object Shape":"Egg, Oval, Other","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Windy"}