{"Viewing Distance":"101-500 Feet","Source":"MUFON","City":"La Porte","trends":["There have been 32 other sightings in La Porte","There were no other sightings in La Porte on or around June 22nd 2010"],"Case Number":"23905","Longitude":"-86.70889","Disposition":"Unknown","Tags":"City","Object Flight Path":"Straight-line path,Other","Date Submitted":"06/23/2010 12:59 UTC","Country":"United States","Region":"Indiana","Sighting Duration":"00:02:00","Latitude":"41.618107","Object Features":"None","divs":["sighting detailsi was outside on the phone and hung up when i finished talking. i turned around and seen this sphere shaped object come out behind a tree across the street from me and casually gain height diagonally to above treetop level across the street from where it emerged from. at first sighting i was stunned with my \"jaw opened\" when i overcame my being stunned in disbelief of seeing this object, i then became excited. as it gained altitude i noticed it was not emiting any light and was sphere in shape with flame emiting from the bottom. the flame appeared to be steady at times for a couple of seconds and then pulsate and was approximately 1\\8th inch in length. from its distance and altitude i am guessing it was aproximately 10 feet in diameter and had a crescent white form at the top. the object was mainly a dark gray in color. once above the trees it began an easterly dirction with about a 5 degree northern flight path and its rate of speed was slow around 5 to 10 miles per hour. i ran upstairs to grab my camera while it was still across the street from me and to tell my nephew (*name deleted--sgonzalez\\cms)to come downstiars not only to see this for himself but to get help with his cell phone. when we got outside the object appeared as a small dot in the distance and perhaps 3 blocks away. (*name deleted--sgonzalez\\cms)was still able to see the object as i pointed it out to him. my 35mm camera would not function. i could not take any pictures of the object until it was no longer visible, it was only then that my camera began to function normally again."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.618107,+-86.70889(23905)&iwloc=A&hl=en\"> mufon case (23905) map </A>","Summary":"Object was just above treetop level emiting flame.","Log Number":"US-06232010-0007","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/23905.html.txt","/var/www/straped/mufon/org/23905.html"],"Date of the Event":"06/22/2010 08:30 UTC","Weather Factors":"None"}