{"Viewing Distance":"Over One Mile","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Madaba","This sighting has never been favorited."],"Case Number":"23901","Country":"Jordan","map":"<A HREF = \"http://maps.google.com/maps?q=31.71954,+35.794109(23901)&iwloc=A&hl=en\"> mufon case (23901) map </A>","Date of the Event":"06/22/2010 10:30 UTC","Object Features":"Unknown","Longitude":"35.794109","Date Submitted":"06/23/2010 05:33 UTC","Summary":"A star like object, with a cone of light that disappeared gradually.","Log Number":"JO-06232010-0003","Latitude":"31.71954","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Cone, Diamond, Star-like","Region":"Madaba","files":["/var/www/straped/mufon/html2text/23901.html.txt","/var/www/straped/mufon/org/23901.html"],"divs":["Sighting DetailsWe were at our friend's farm, chilling at night. We were 7 people. The night was really clear and the stars were nice and few. One of my friends was sitting facing the event, and all the time she has been noticing a far away bright star from afar. She didn't pay much attention to it. Later we all started dancing and jumping. I went inside the farm house for a bit and everyone was busy laughing. when i walked out of the house, i was facing that star which at that point it got closer (not too close) and bigger. Then everyone stood silent watching. It had a bright white flash of light like a diamond, with some little of blue and green dots of light inside that flash. Then a cone of light extended from it. it stayed there for like a minute. and then the cone started disappearing and then vanished. We stayed there like amazed for a moment. No one thought of getting a camera and recording it because we were so amazed by the light and the cone of light that no one thought about it. It was like a very creepy feeling yet very amusing. We were in a farm that was about 30 minutes away from the city. And there were like open field of olive and other kinds of trees in front of us. So the light couldn't have been from a building. It couldn't have been a plane or anything like it since we didn't hear any noise form engines or anything. and a plane wouldn't just stay there standing in the middle of the air then disappear into no where. It was really weird and we thought about it and we decided that it might be a UFO. Since its cone of light disappeared gradually with no trace."],"Object Flight Path":"Stationary","City":"Madaba"}