{"divs":["Sighting DetailsI was sitting in my garden, warm night clear skies. I was looking to the south, there is a gap between my house and a large Conifer tree. At 22.25hrs. I noticed a fast moving object, midway between vertical and the horizon. I walked forward so that I could follow It's progress beyond the Conifer, the object was moving West to East. As I moved forward, some 30 feet, the object was moving fast enough that I had to move quite quickly to keep up. It was gone out of view quite quickly. It appeared to be trailing orange fire in, a, Stumpy delta way the top part of the delta a little longer than the lower, it made no sound that I could perceive. It only appeared to be two dimensional not three. My thoughts were that it was a meteor or asteroid passing through the upper atmosphere. I couldn't see any trail behind the object but it was, by now, getting dark. It was difficult to tell how large or small the object was but my perception was that it was quite large. I am 63 years old and have lived and studied aircraft since I was a lad but I have never seen such an object before, even in farnborough, the cradle of British aviation. The object dissappeared over the eastern horizon, it passed over in about 15 to 20 seconds. I'm convinced I spotted something out of the normal, not though, something unnatural."],"Source":"MUFON","Object Shape":"Fireball","Weather Factors":"None","Tags":"City","Date of the Event":"06/21/2010 10:25 UTC","Longitude":"-0.752615","Region":"England","map":"<A HREF = \"http://maps.google.com/maps?q=51.286894,+-0.752615(23903)&iwloc=A&hl=en\"> mufon case (23903) map </A>","City":"Farnborough","Date Submitted":"06/23/2010 06:32 UTC","Disposition":"Unresolved","Country":"United Kingdom","Summary":"Delta shaped, as if trailling flame.","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Case Number":"23903","files":["/var/www/straped/mufon/html2text/23903.html.txt","/var/www/straped/mufon/org/23903.html"],"Log Number":"GB-06232010-0005","trends":["There have been no other sightings in Farnborough","This sighting has never been favorited."],"Object Features":"None","Latitude":"51.286894","Sighting Duration":"Undisclosed"}