{"Region":"Arkansas","Viewing Distance":"Unknown","Object Shape":"Circle, Fireball, Sphere, Star-like","Longitude":"-92.662097","Latitude":"33.21125","Disposition":"Hoax","Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsThis is the first star, if that is what this is, that appears in the sky every night. As time progresses, it goes from white to multi-colored flashing and emitting orbs, beams, and moves eratically. Patience paid off when I kept watching and knew when and how to take these pictures. I also have videos that are needing to be examined by experts of the multi-colored object in these photos. That is in the process. Videos will be uploaded after that. The Videos are scary. Vivid and detailed. What ever this is, is not what we usually think of as a star. Get that if nothing else for now. My research shows this image as far back a 1970s. So, its been in out atmosphere for at least that long. Plenty of reports with mufon and the national ufo reporting center on JUST THIS. I waived at it and it moved up and down. They know I watch them every night. I swear that is not autokenisis or the other word for tricks on your eyes. This was such a pronounced up and down movement, and then nothing. I waived again before I went back inside. Again, it accknowledged with an up and down movement."],"Country":"United States","City":"El Dorado","Log Number":"US-06242010-0005","Object Flight Path":"Undisclosed","Source":"MUFON","Date Submitted":"06/24/2010 04:04 UTC","Date of the Event":"Unknown","Summary":"I can get pictures and video like these any night there are no clouds since 2008.","Tags":"City","trends":["There have been 7 other sightings in El Dorado","There were no other sightings in El Dorado on or around","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Case Number":"23917","map":"<A HREF = \"http://maps.google.com/maps?q=33.21125,+-92.662097(23917)&iwloc=A&hl=en\"> mufon case (23917) map </A>","files":["/var/www/straped/mufon/html2text/23917.html.txt","/var/www/straped/mufon/more/23917_submitter_file1__JAMES3.JPG","/var/www/straped/mufon/more/23917_submitter_file2__JAMES4.JPG","/var/www/straped/mufon/more/23917_submitter_file3__JAMES5.JPG","/var/www/straped/mufon/org/23917.html"]}