{"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/23910.html.txt","/var/www/straped/mufon/org/23910.html"],"Date of the Event":"06/22/2010 08:10 UTC","Object Features":"Other","trends":["There have been 19 other sightings in Gresham","There were no other sightings in Gresham on or around June 22nd 2010"],"Source":"MUFON","Object Flight Path":"Straight-line path","Longitude":"-122.425211","Region":"Oregon","Case Number":"23910","Viewing Distance":"Unknown","Date Submitted":"06/23/2010 06:21 UTC","Tags":"City","Summary":"Object going from north to south, rectagule in shape, spinning.","divs":["Sighting DetailsTook my dog out for a walk, palrtly cloudy evening still light outside. Across the sky from, north to south. More of a rectagule in shape. At first I thought that it was a baloon of some sort, but there was no string attatched. It looked hard like metal,non shiny and dark maroon in color. Spinning from top to bottom ,towards the south. A constant speed never wavering at all. Going a little higher as it moved along. Watched this all the time for the total of 10 minutes or more. Going higher and higher and still spinning. No matter how far away it was from me I could still see the object spinning. I fould that quit strange for it went for many miles and I could still see the object rotating. Clouds were passing behind it and you could see though the clouds and still see the object. I finally moved away from the spot that I was at to see if I could see it any further but by the time that I got up past these trees I could not recover the object in my line of sight. The object passed low in the sky in front of me, I was so mesmorized by it I couldnt take my eyes off of it. I was thinking if I did I would miss out on something happening. I only wish someone else was there to experience this with me. That wouls have been great. Another thing that I had noticed is that the wind was blowing from south to north, completely oppisite from the way the object was going. Prabably from 5 to 10 miles per hour, just a guess."],"Object Shape":"Square, Rectagular","Latitude":"45.506146","Sighting Duration":"Undisclosed","Log Number":"US-06232010-0012","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.506146,+-122.425211(23910)&iwloc=A&hl=en\"> mufon case (23910) map </A>","City":"Gresham"}