{"Sighting Duration":"Undisclosed","divs":["Sighting Details Me an my friend were traveling on rt1-9 next to the giant stadium in nj close to new york city. we were on our way to a night club it was around 9:00pm we were listening to the radio an laughing. as i looked up at a tall hotel i saw bright lights an from behind it a disk liked ufo shot up in the sky an just stopped an it did it again then circled around the hotel it did have lights i remember they were red green white.I do not remember if it was spinning it was fast very fast. That is what i was afraid of i have never in my life saw any thing that fast an could just stop out of no where like that. my friend noticed it when i said omg! look we were in total shock an very scared we actually pulled over on the busy highway so we did not crash. we couldn't take our eyes off it. when it went behind the building i looked ahead of us an mabey 6 to 7 other cars also pulled over to see this. we waited to see it come from behind the hotel but after that it was gone!it was in front of us for mabey 4 to 5 min. mabey the second i looked at the cars in front of us it took off? not sure. after that me an my friend started going back onto the highway we were scared did not know who to tell cause we were not from the area. an after the 911 in ny an us so close to it we thought mabey it was a goverment aircraft an did not want to get involved we actually turned around an did not go to the night club we were all dressed up an everything. we drove back home still in shock an told our family i went on the computer to see if any one had wrote anything or reported it but had no luck! i am sure that a couple people saw this that was driving that night on the highway or even staying in that hotel!"],"Tags":"City","Viewing Distance":"Unknown","Date of the Event":"03/25/2005 12:00 UTC","Latitude":"40.833989","files":["/var/www/straped/mufon/html2text/23916.html.txt","/var/www/straped/mufon/org/23916.html"],"Case Number":"23916","Longitude":"-74.097086","Region":"New Jersey","Object Flight Path":"Path then hovering","Object Shape":"Cone, Circle, Disc","trends":["There have been 2 other sightings in East Rutherford","There were no other sightings in East Rutherford on or around March 25th 2005"],"Weather Factors":"None","Country":"United States","Log Number":"US-06242010-0004","map":"<A HREF = \"http://maps.google.com/maps?q=40.833989,+-74.097086(23916)&iwloc=A&hl=en\"> mufon case (23916) map </A>","Object Features":"Unknown","Source":"MUFON","Summary":"I saw a UFO by the giant stadium in NJ circling a hotel.","Disposition":"Unknown","City":"East Rutherford","Date Submitted":"06/24/2010 12:00 UTC"}