{"Object Features":"Patterned Surface","Object Shape":"Triangle","Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=42.664675,+-81.214739(23929)&iwloc=A&hl=en\"> mufon case (23929) map </A>","Summary":"Black triangle.","trends":["There has been one other sighting in Port Stanley","There were no other sightings in Port Stanley on or around June 24th 2010"],"Latitude":"42.664675","Date of the Event":"06/24/2010 10:00 UTC","Case Number":"23929","Log Number":"CA-06242010-0017","Region":"Ontario","files":["/var/www/straped/mufon/html2text/23929.html.txt","/var/www/straped/mufon/org/23929.html"],"Date Submitted":"06/24/2010 10:52 UTC","Longitude":"-81.214739","Viewing Distance":"501 Feet - 1 Mile, Unknown","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","divs":["sighting detailsmy partner and i were hanging out at the beach, just listening to the water of lake erie and enjoying watching the moon and stars through binoculars. we were on our way off the beach to come home, and i kept watching the sky - when i noticed something hovering above one of the brightest stars - and flashing. i pulled out the binoculars again to see that it was a black triangle with three lights - one on each corner (i believe the lights were red, green, and white). it just sat in the air for about a minute and a bit more and then disappeared into thin air. looking at it, i felt slightly nervous so i wasn't quite sure it was benevolent. (to explain, almost a year ago, i saw six light orbs and a single ufo that made me feel so happy to see. i immediately felt whomever was in there was kind and loving, and i also just felt \"arcturians\", though i'd really had no prior experience\\contact with arcturians at that time.) i reckoned it was military, as i've heard many times black triangles are actually our crafts. i unfortunately didn't catch a photo of it - it was too far away, and we don't have the world's best camera. but i did see it through binoculars, and i can be quite a debunker, but there's no debunking what i saw in this one. definitely not an everyday thing."],"Source":"MUFON","Country":"Canada","Object Flight Path":"Stationary","City":"Port Stanley"}