{"divs":["Sighting DetailsNine people at a beach house near the Carolina Yacht Club in Wrightsville Beach, NC saw a ball of reddish orange light blinking erratically, silently in the distance over the ocean. A small white light appeared out of nowhere, close to the object, then they disappeared. Then about 2 minutes later, it reappeared and we saw it divide instantaneously into nine orbs, assembled into a horizontal V formation, after which it disappeared in a couple of seconds. There was no sound and no other aircraft around, and it was about 10 degrees over the ocean's horizon, about 1 to 2 miles away. We were all shocked and we all agreed that what we saw was not manmade. The movement was too fluid, and the speed at which it divided was extremely fast and yet controlled. The sighting was at 9:35pm, and then at 9:37pm. Shortly afterwards, we saw helicopters descending on the area over the ocean where we witnessed it. At around 11:45pm, two fighter jets flew by, parallel to the coast. Why were they flying so close to a residential beach town at that time of night? The next day, military helicopters flew up and down the beach all day long, nonstop."],"Object Flight Path":"Undisclosed","Longitude":"-77.796371","Source":"MUFON","files":["/var/www/straped/mufon/html2text/23924.html.txt","/var/www/straped/mufon/org/23924.html"],"Object Shape":"Circle, Sphere","Tags":"City","Summary":"Reddish orb dividing into nine distinct orbs in horizontal \"V\" formation over ocean.","City":"Wrightsville Beach","Country":"United States","Case Number":"23924","map":"<A HREF = \"http://maps.google.com/maps?q=34.208504,+-77.796371(23924)&iwloc=A&hl=en\"> mufon case (23924) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-06242010-0012","Object Features":"Patterned Surface","trends":["There has been one other sighting in Wrightsville Beach","There were no other sightings in Wrightsville Beach on or around June 22nd 2010"],"Sighting Duration":"Undisclosed","Date of the Event":"06/22/2010 09:40 UTC","Date Submitted":"06/24/2010 08:01 UTC","Disposition":"IFO","Latitude":"34.208504","Region":"North Carolina","Weather Factors":"Unknown"}