{"Summary":"Large UFO fireball star.","Object Shape":"Fireball, Star-like","Log Number":"US-06252010-0002","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/23931.html.txt","/var/www/straped/mufon/org/23931.html"],"Disposition":"Unknown","Latitude":"38.991458","Region":"Kansas","Longitude":"-94.668012","Source":"MUFON","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around June 24th 2010"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","City":"Overland Park","Date Submitted":"06/25/2010 12:42 UTC","Date of the Event":"06/24/2010 10:15 UTC","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","divs":["Sighting DetailsLarge UFO Fireball Star, flying low North East towards Kansas City, at approx 10:15 PM totally silent. I could believe how large or how low it was flying. Shorting after a small UFO that looked like a star, flew by North towards Kansas City. I was outside only about 10 minutes enjoying the full Moon and the stars on my balcony, when I saw this UFO. I called my husband, who happen to be at the lower level of my home on the phone. I could hardly get the words out for him to hurry up and come-outside. He just missed it as it flew over the tree tops. I had seen another UFO large star like on June 19th, and spotted other ufos in this area, though this one on the 19th was not as large as the one tonight. My whole family have witness these shooting star like ufos for months, in my area. They are usually small and the same size as the stars. They mostly appear on a clear night. For the most part they are no big deal to me, because, I have seen many of these small ufos...But tonight, this large UFO Fireball Star, that I saw was something totally unexpected!"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.991458,+-94.668012(23931)&iwloc=A&hl=en\"> mufon case (23931) map </A>","Case Number":"23931"}