{"Tags":"City","City":"Bangor","Object Shape":"Circle, Star-like","Source":"MUFON","Latitude":"40.872242","Longitude":"-75.203018","files":["/var/www/straped/mufon/html2text/23935.html.txt","/var/www/straped/mufon/org/23935.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsBetween the hours of 10 and 11:30 PM for the past two nights, I have been watching what can only be described as glowing white orbs. I have seen these on other occasions as well, however, these past two nights have been different. Other times these objects were at a very high altitude. On the evening of the 23rd I saw one that was at a much lower altitude. It was traveling W to E. No sound whatsoever as it passed over. No erratic movements. Seems to travel a fairly straight line. Even though it was lower than the others, it was still higher than commercial jets in flight. Went on MUFON website yesterday to see if anyone else reported similar objects. Someone from NJ reported a star like object at a low astitude. I am sure we probably saw the same thing. I live 10 mins. drive from the Delaware Water Gap. I don't know where in NJ this was witnessed. At any rate, on the 23rd I saw at least 4 of these. 1 low, the other 3 very highe up. Last night, the 24th, I witnessed at least 12 of these strange floating orbs of light. Once again, there was 1 that was much lower. This time it was traveling N to S. As far as speed is concerned, I would say they travel at least as fast as jets. Yesterday morning a huge helicopter went over my property. It followed the exact path of the lower orb. Interesting. Last night while observing these objects a small plane came by very low and moving very slowly. Got the eerie feeling that this is all connected. I should add that some of these orbs can only be seen with binoculars. Others can be seen with the naked eye. If I didn't look up with binoculars, I wouldn't ever know they were there. If not for fatigue and a very sore neck causing me to finally go indoors, I feel I could probably watch these things all night. These orbs are silent, and definitely not anything conventional or familiar. I've been a sky watcher for most of my 49 years and have seen other UFOS. None like the ones I've been seeing for the past couple of months. I simply don't know what they are. But, I do know what they aren't. Doubtful that I'm seeing 12 satillites in a period of an hour and a half! Sorry for the typos, but, I'm trying to get this reported while it is fresh in my mind, and before the business of everyday life distracts me as it should. It's easy to become obsessed with this when youv'e seen some of the things I've seen all my life, but in particular the last 10 years. I am already in contact with one of your investigators about my sightings. Felt the need to report the events of the last two nights on line for all who are seeing strange things in our night skies. For those who say, \"Why don't the UFOS just show themselves to everyone!\". They are. You just have to look. From my mountainside view........ICU2!."],"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.872242,+-75.203018(23935)&iwloc=A&hl=en\"> mufon case (23935) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in Bangor","There was one other sighting in Bangor on or around June 24th 2010"],"Summary":"Observed glowing orbs for past 2 nights.","Date Submitted":"06/25/2010 08:57 UTC","Case Number":"23935","Log Number":"US-06252010-0006","Disposition":"Insufficient Data","Country":"United States","Date of the Event":"06/24/2010 10:30 UTC","Weather Factors":"None","Object Features":"Unknown","Object Flight Path":"Straight-line path"}