{"Date of the Event":"06/24/2010 06:25 UTC","divs":["Sighting DetailsIn the last 7 days over the skies of hwy 92,near my house there is very bright yellow light that comes and stops about 6000 to 8000 feet high,this object dances and fly at incredible speed ,first i noticed early in the morning walking my dogs ,it comes from west to east, and then back east to west... , and now comes from others directions , but always stops at almost the same place and look like is watching from the sky, and start to drop and gain altitude and then flies away and disappear living no sight at all at speed hard to believe that is man made, and worst ...stays and stops in the air for so long... ,now is appearing late at night about 10 PM, in a different direction but visible from my neighborhood, every one that I show the event neighbors etc...they feel very weird saying they never see anything like that before. I do fly a lot, and I know the difference between airplane,satellites,helicopters,comets etc.. This one , is not! If you guys know anything about it , please let me know, and I will try to record the event and show later at the site,thanks for the help and support."],"files":["/var/www/straped/mufon/html2text/23937.html.txt","/var/www/straped/mufon/org/23937.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Star-like, Teardrop","City":"Woodstock","Log Number":"US-06252010-0007","Object Flight Path":"Undisclosed","Disposition":"IFO","Object Features":"Undisclosed","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=34.103117,+-84.517695(23937)&iwloc=A&hl=en\"> mufon case (23937) map </A>","Source":"MUFON","Longitude":"-84.517695","Country":"United States","Date Submitted":"06/25/2010 01:18 UTC","Latitude":"34.103117","Weather Factors":"None","Case Number":"23937","Summary":"A bright light star-like that moves like no other that I ever see it.","Tags":"City","Sighting Duration":"00:25:00","trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around June 24th 2010"]}