{"Longitude":"-76.853414","files":["/var/www/straped/mufon/html2text/23933.html.txt","/var/www/straped/mufon/org/23933.html"],"Sighting Duration":"00:00:06","Date of the Event":"06/24/2010 11:00 UTC","Disposition":"IFO","Viewing Distance":"Unknown","City":"Selinsgrove","Source":"MUFON","Summary":"Strange bright sphere with a reddish tail, later fast moving star.","Object Shape":"Fireball, Flash, Sphere, Star-like","Date Submitted":"06/25/2010 12:48 UTC","divs":["Sighting DetailsI was on the bank of the Susquehanna river with my friend. We had started going for a walk around 9:30 and reached the river at around 10:30, so the times on this are an estimate. The first place on the bank where we stopped, we laid on a paved area to rest after walking for so long, and watched the sky. Through the trees, I saw what looked like a white fireball. It was a very tight sphere with a long tail. I have no idea how far away it was, but from where I was lying it looked about as big as a pea in the sky. It was very pretty, and seemed to travel in a straight line before disappearing or burning out. We both saw it. We both seemed to almost want to suggest it was a shooting star, but we knew it was too bright, and it had an uncharacteristic red tail, so my friend guessed it was some sort of debris. Still, it was burning pretty brightly and had a distinct sphere shape, so that may not be the case. The most striking thing about it was the tail. We were both pretty impressed by it. Later we went swimming, and I saw what looked to be a rather white star descending quickly towards the horizon. Again, it moved in a straight line but it was a pretty small speck this time and had no tail. My friend didn't see it. I made a joke, something along the lines of \"there goes Buddy Holly,\" since it reminded me of the description his manager gave of the lights of his plane disappearing as it fell, but it was only a single light, not like the formation of lights produced by a plane. I've also seen strange electric-looking activity over the river a few months ago, but that may have just been an electrical storm, and I don't remember the event well enough to give an accurate account of it. Anyways, the sky over the Susquehanna river is beautiful, and I'll probably be out there skygazing a lot over the summer. My only response to these events is interest, they don't give me a bad or threatening feeling at all."],"Latitude":"40.805494","Weather Factors":"Unknown","trends":["There has been one other sighting in Selinsgrove","There were no other sightings in Selinsgrove on or around June 24th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.805494,+-76.853414(23933)&iwloc=A&hl=en\"> mufon case (23933) map </A>","Country":"United States","Region":"Pennsylvania","Log Number":"US-06252010-0004","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"None","Case Number":"23933"}