{"Longitude":"-82.932087","Date of the Event":"06/24/2010 09:45 UTC","Region":"Georgia","City":"Hartwell","Date Submitted":"06/25/2010 08:29 UTC","Object Shape":"Oval","Latitude":"34.352882","divs":["Sighting DetailsAt 9:45, I walked out to the front deck to smoke a cigarette. To my right, a bright object caught my attention. I look to the west and see a flying object, moving east north east at a fast pace steady speed. Then I hear the sound of a jet engine at full thrust. I look left and east of the object and see a passenger or cargo jet flying from the north to the south, south east, moving east to avoid this craft, I could not tell if the jet was moving up or down but it was trying to miss the object. I could see the red and green lights on each wing tip and the strobe lights of the jet. At that time I jumped back, grabbed the front door knob went inside and picked up the bushnell glasses, and rush back outside. I rest the field glasses against the vertical post on the deck. Now I see the unidentified object with much better vision. I can see clear a black air frame around the bright welding ark light, buy this time the craft is moving away to the east still looking at the craft I see the blackness surrounding it. Someone please tell me what I saw someone flying a jet dodged it I was not halusinating. I called Anderson county regional airport to report the guy said he heard nothing. was it the space station the space shuttle. Why did I see a jet try to dodge a space station or military craft. Why did it not have strobe lights why did it keep its course and a jet deviate from it's course to avoid someone has to know. This event took place in Hartwell G.A. not far from Hartwell dam on lake hartwell the craft was moving in the directon of anderson airport."],"trends":["There have been 2 other sightings in Hartwell","There were no other sightings in Hartwell on or around June 24th 2010"],"Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/23948.html.txt","/var/www/straped/mufon/org/23948.html"],"Case Number":"23948","Sighting Duration":"00:01:30","Summary":"Light bright as a welding ark 8 to 10 thou, altitude, west to east maybe 400 mph.","Country":"United States","Log Number":"US-06252010-0018","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.352882,+-82.932087(23948)&iwloc=A&hl=en\"> mufon case (23948) map </A>"}