{"Country":"United States","divs":["sighting detailsat 23:16, i had just checked the time on my cell phone when, looking at an airplane circling in the general area of the olympia airport, i noticed a bright venus-sized object appearing out of the west, having just passed some cloud cover. it steadily transversed the sky, remaining an unchanging blob of light until it vanished to the west past the top of the hill where cleveland avenue runs. according to my cell phone, which runs on at&t time and always seems a minute or two behind everyone else the sighting ended at 23:20. checked w\\heavens-above.com. according to the site, there was an iridium flare at 22:50 and another at 23:38, so that would seem to ruled those out as an explanation. when i got home about 12:40 am, the iss was over the pacific ocean roughly around hawaii, so that would seem to rule out that as an explanation. sunset was at 21:12. i understand the window for seeing satellites is about 45 to 90 minutes after the sun has gone down so that would place the time of my sighting a little more than a half hour outside that window as well."],"Region":"Washington","Date Submitted":"06/25/2010 03:22 UTC","Disposition":"IFO","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-122.905486","Case Number":"23941","map":"<A HREF = \"http://maps.google.com/maps?q=47.017009,+-122.905486(23941)&iwloc=A&hl=en\"> mufon case (23941) map </A>","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Tumwater","There was one other sighting in Tumwater on or around June 24th 2010"],"Latitude":"47.017009","Log Number":"US-06252010-0011","Object Features":"Unknown","Object Shape":"Star-like","Summary":"Venus-sized object at wrong time to be satellite, ISS or iridium flare","Date of the Event":"06/24/2010 11:16 UTC","files":["/var/www/straped/mufon/html2text/23941.html.txt","/var/www/straped/mufon/org/23941.html"],"City":"Tumwater"}