{"City":"Tinton Falls","trends":["There has been one other sighting in Tinton Falls","There were no other sightings in Tinton Falls on or around June 30th 1959"],"Latitude":"40.304277","Date of the Event":"06/30/1959 08:00 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.304277,+-74.100418(2394)&iwloc=A&hl=en\"> mufon case (2394) map </A>","Disposition":"Unknown","Tags":"City","Log Number":"","Country":"United States","Case Number":"2394","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2394.html.txt","/var/www/straped/mufon/org/2394.html"],"Region":"New Jersey","Longitude":"-74.100418","Sighting Duration":"00:05:00","Weather Factors":"Unknown","divs":["Sighting DetailsIt was during the summer of 1959 on a working farm now known as Dorbrook Park. My family lived and my father worked on the farm at the time of the sighting. The physical location of this site is adjacent to the Naval Weapons Station,Earle road and rail that runs from the main location in Colts Neck to Belford.At the time of the sighting, my sister, myself, father and mother along withseveral other people were sitting outside enjoying the pleasant summer eveningfrom the front yard of the house that we were living in. It was at this timethat we all simultaneously noticed what appeared to be a large shiney, silversphere due east of our location. The sphere was roughly following the directionof the Navy road, heading towards the main Ammunition storage facility located acouple of miles to the south of our location. The object was moving in a slowbut deliberate manner at an altitude must have been from 300 to 500 feet. Itsspeed was probably 40 to 50 mph. the object was also displaying about 10 to 15randomly blinking red and white lights. The majority of these lights seem toconcentrate rougly around the longitudinal plane of the sphere and appeared tobe separate from the craft itself. Each light seemed to blink at a rate ofmaybe once per second. It should be noted that the location of this farm now acounty park is within 4 miles of Fort Monmouth Army Communications andElectronics Command where radar was developed along with a number of otherinitiatives critical to the National Defense. Right after our sighting, myfather ran to a phone and attempted to call Fort Monmouth however, he could notget through at that time. He did not try again therefore, our sighting was notreported to the best of my knowledge.The sighting lasted only a few minutes as the sphere disappeared behind sometrees however, it can be safely assumed that its path did take it over theammunition depot itself. Of course there have been rumors for years that thefacility was used to store nuclear devices. In closing, years later I cameacross another witness observed what appears to be the same object however, heviewed it from the Navesink river on the River Plaza side. This location isalso on a direct line towards Belford sight of the Pier where the ammunitionships are loaded and is approximately 4 miles2B- from the farm where we observed the object."],"Summary":"NWS Earle - Daylight sphere - Colts Neck, NJ","Date Submitted":"06/30/1959 08:00 UTC","Object Shape":"Sphere"}