{"Source":"MUFON","Date Submitted":"06/26/2010 02:23 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/23959.html.txt","/var/www/straped/mufon/org/23959.html"],"Country":"United States","Tags":"City","City":"Bristow","map":"<A HREF = \"http://maps.google.com/maps?q=35.830633,+-96.391118(23959)&iwloc=A&hl=en\"> mufon case (23959) map </A>","Object Flight Path":"Hovering then path","Weather Factors":"None","Viewing Distance":"20 Feet or Less","Date of the Event":"06/20/2010 12:00 UTC","Log Number":"US-06262010-0007","Case Number":"23959","Longitude":"-96.391118","Region":"Oklahoma","trends":["There have been no other sightings in Bristow","This sighting has never been favorited."],"Latitude":"35.830633","Summary":"Bright orb light.","Object Features":"None","divs":["Sighting DetailsWe live in a 3 story house the front is glass all the way up 3 floors. I can see the stars every night as I am in bed. This nite I lay watching TV I saw a bright light hovering over the tree line , I noticed it and thought wow that star is bright. Then I thought it couldnt be a star its too low and if it were a plane it would crash in a min. As I watched TV I kept glancing at it every little bit. I saw it get real bright then dim. It was there more than 30 min. Then it started moving around so I had to keep looking through the trees to find it. Then it just moved off. About a day or 2 later as I was in bed watching TV a bright flash of light appeared in the glass it caught my attention as I looked I caught it moving to the left out of my sight. I thought I just saw a ghost a orb.I thought it was inside the window. It startled me and I kept my eyes fixed on the glass , then it came back across to the right I got a good look this time and saw it was on the outside of the glass.It was bright white and transparent almost. About twice or 3 times the size of a basketball. When I realized it was like dancing in the window and I really was seeing it. I threw back the covers and jumped up in the bed, it was only 15 feet at most from me. When I stood up in bed it was like it saw me too and just vanished. I would like to know what this was and if it has been seen before in this area."],"Object Shape":"Other","Disposition":"Unknown"}