{"Longitude":"-70.253166","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.670411,+-70.253166(23957)&iwloc=A&hl=en\"> mufon case (23957) map </A>","Case Number":"23957","divs":["Sighting DetailsIt was a little after 10pm and me and my boyfriend were in the kitchen making a late dinner. So we got the food going on the stove and my boyfriend decided that he was going to go outside and have a cigarette. He asked if I would come outside with him and I told him I was going to clean some of the dishes instead. About after a minute of him being outside he cracked the front door open and told me I needed to come out and look at something. A second after that he repeated himself and said that I needed to come out right at that moment and to come look at what he was seeing. I said \"okay, okay I'm coming!\" and ran out the door. As I stepped outside my boyfriend was looking straight to the sky and was pointing upward and told me to look. At first I thought it was a really bright star but then saw that it was moving and just immediately thought it was a jet. Right after that I saw the object in the sky did not have a stream line behind it, no blinking lights, and that it was moving at a very very fast speed-much faster than any jet could ever be. It looked like a star except it looked much larger and brighter than anything else in the sky and after another moment of examining it you could see that the object had three separate lights on it. I then ran back to the house and opened the door and yelled for my sister to come outside immediately. She ran out to see what the commotion was. As we watched the object flying through the sky we saw that it started to change course and started to curve to our left towards the North East coming from the West. While it was doing this the bright sphere's light pulsated to the point where it was so dim you almost lost sight of it but then became bright again right away. We could also tell that while the object was shifting course it was ascending upwards. The lights pulsated again and I decided to run into the house to grab my cell phone to see if I could capture any documentation. I came back out and my sister told me that the lights on the craft completely had went out and came back on when I got back outside. After another moment the lights pulsated again until it eventually disappeared into the sky. Mind you it was not that we lost sight of it through the tree line or anything it just disappeared into the sky at approximately 10:16 p.m. This is the first real sighting I have ever had. When I realized that this object was not a star or a plane my adrenaline was pulsing and it felt as if my heart was going to pound through my chest. A part of me was amazed and another part of me was frightened that it was going to turn back around. I was quit in shock to be honest. My boyfriend was shocked, amazed, and kind of excited about the sighting. My sister rather was very scared and somewhat emotional about the whole experience. I am not the type of person to just jump to conclusions but I know is that this was not a human object nor was it a star so what else could it have been???"],"Log Number":"US-06262010-0005","Latitude":"43.670411","Disposition":"IFO","Date Submitted":"06/26/2010 01:41 UTC","Date of the Event":"06/24/2010 10:12 UTC","trends":["There have been 17 other sightings in Portland","There were no other sightings in Portland on or around June 24th 2010"],"Object Flight Path":"Path with directional change","Region":"Maine","Object Features":"Other","Sighting Duration":"Undisclosed","Summary":"Round glowing star-like object that had three lights on it moving fast and had pulsating lights.","Weather Factors":"None, Does Not Apply","Country":"United States","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/23957.html.txt","/var/www/straped/mufon/org/23957.html"],"Source":"MUFON","City":"Portland","Viewing Distance":"Unknown"}