{"Object Flight Path":"Undisclosed","Latitude":"39.730268","Longitude":"-86.086185","Weather Factors":"Medium","City":"Beech Grove","Tags":"City","files":["/var/www/straped/mufon/html2text/23956.html.txt","/var/www/straped/mufon/more/23956_submitter_file1__DSCF3652.JPG","/var/www/straped/mufon/more/23956_submitter_file2__DSCF3679.JPG","/var/www/straped/mufon/more/23956_submitter_file3__DSCF3680.JPG","/var/www/straped/mufon/org/23956.html"],"Source":"MUFON","Country":"United States","Case Number":"23956","Sighting Duration":"Undisclosed","divs":["sighting detailsi was sitting on my patio, facing the north, when i saw a bright orange light. at first, i thought it was the headlights of an oncoming plane. it was slowing coming towards my position, getting bigger and bigger. i heard no noise. i was waiting for it to go past me to hear the engine noise and to see what exactly it was. i got my camera and was able to take several pictures. once it flew over me, i heard nothing and also all i was able to see was still a bright orange ball fly past silently. there was no apparent plane, helicopter, or any aircraft shape. i felt scared. i never have seen anything like this. the orange ball continued to fly in the same path when it made an angular direction change. it looked like an 40 degree angle up. it wasn't a slow change, it was an instant change of direction. it was the kind of direction change you see in video games. after that it just disappeared as it ascended up. since then, i have seen the same thing on 4\\29\\09 @ 10:13pm and on 6\\10\\10 @ 10:07pm. the first two pictures are from the 4\\22\\09 incident. the last picture is from the 4\\29\\09 incident. i zoomed in a lot on the 4\\22\\09 pictures. i didn't zoom in on the 4\\29\\09 picture. notice the angular shape of the 4\\22\\09 pictures! i was amazed when i looked at them, after the fact!"],"Object Shape":"Fireball","Date of the Event":"04/22/2009 07:49 UTC","trends":["There have been 2 other sightings in Beech Grove","There were no other sightings in Beech Grove on or around April 22nd 2009","This sighting has never been favorited.",""],"Summary":"Orange fireball moving through sky.","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.730268,+-86.086185(23956)&iwloc=A&hl=en\"> mufon case (23956) map </A>","Log Number":"US-06262010-0004","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Region":"Indiana","Date Submitted":"06/26/2010 01:39 UTC"}