{"trends":["There have been 2 other sightings in Ocean Shores","There were no other sightings in Ocean Shores on or around June 12th 2010","This sighting has never been favorited.",""],"Longitude":"-124.150105","files":["/var/www/straped/mufon/html2text/23950.html.txt","/var/www/straped/mufon/org/23950.html"],"Log Number":"US-06252010-0020","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.976529,+-124.150105(23950)&iwloc=A&hl=en\"> mufon case (23950) map </A>","Tags":"City","Sighting Duration":"01:00:00","Object Shape":"Other","Disposition":"IFO","Region":"Washington","Weather Factors":"None","divs":["sighting detailsi have photos and vhs tapes of: orbs ligt balls\\streaks mist ectoplasm flying \"fairys\" how i looked after an attack by unknown entities ufos lights \\ orbs flying around the room where i sleep and many other areas also diarys and log of a 2 month ufo sighting aliens ghosts demons as far as i can remember, this sort of paranormal activity first became noticable with me in 1992, washington state. it was ongoing. it calmed down in approx.2004 and i thought i was free from 'them'. i moved to ocean shores, wa. in 2008 and slowly became aware that \"they \" had slipped back into my life again. (*residence info deleted--sgonzalez\\cms). i live in an old building that used to be bo-jos deli and bait shop. the owners died and the upstairs was remodled into 2 apt. units. i live in apt.a on the 2nd floor. my walls are almost all windows with the ocean to the north, the canal to the south, and the bay to the west of me, so i have a great view. it is secluded. as of june 1, 2010 i spoted a ufo. since then i have seen them about 10-15 times this month. i also have some sort of entity that stares through my skylights nightly. also ghosts, demon faces, mist, silver rain, orbs,ectoplasm, pictures that form on my windows etc. it has been a month from hell for me. i have written my experiences down and have vcr tapes and photos of most everything that is happening here. it is all too much to write down here now. i wish someone would come and see what i have photographed and taped and read my story i wrote. i have no transportation right now so i am stuck here alone. i have a defective pelvis and can't walk far or i would walk right out of here. it's getting too creepy for me alone. you could no doubt come here in the evening and see some of this activity if you wish."],"Latitude":"46.976529","Country":"United States","Object Flight Path":"Straight-line path","City":"Ocean Shores","Case Number":"23950","Date of the Event":"06/12/2010 10:00 UTC","Viewing Distance":"Over One Mile","Date Submitted":"06/25/2010 10:22 UTC","Summary":"Ongoing UFO activty occurring since June 1, 2010 to now."}