{"Case Number":"23958","Object Flight Path":"Undisclosed","Date of the Event":"06/25/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/23958.html.txt","/var/www/straped/mufon/org/23958.html"],"Viewing Distance":"Unknown","Disposition":"IFO","Region":"Florida","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-06262010-0006","City":"Gainesville","Date Submitted":"06/26/2010 01:46 UTC","Source":"MUFON","divs":["Sighting DetailsLet me first start by saying I didn't know whether to post this on MUFON as I'm really not sure it's characteristic of a typical sighting. We were experiencing a typical Florida downpour with some occasional thunder and lightning, but nothing out of the ordinary. I'm not really sure whether we had lost power at this point as things got a little out of the ordinary. I was sitting in our living room with my family and we all heard a loud humming noise that carried with it a certain vibration indicative of a powerful energy source. It sounded like a transformer humming, but much, much louder. The sound lasted about 10 seconds and happened 3 or 4 times and was coming from what seemed to be directly outside the south side of our house. Our house is nowhere near a transformer. From where we sat during this, we were two rooms away from the exterior of the south side of our house, about 30 feet away. As the humming noise began again, I finally decided to walk to a room closer to the sound. Keep in mind it's summer around 6:45pm, so there was plenty of light outside, even though the storm had darkened it a bit. This room has blinds on the windows and as I approached the window the humming was still happening, but what was so odd, and the main reason for me posting this is, even with it being daylight, a bright bluish, neon looking light was being generated somewhere very close to the exterior of our house with such an intensity that it overpowered the natural light and created a bluish glow that shined through the cracks in the window blinds. It's almost as if it was dark outside and a car pulled up outside the window, shining it's headlights into the window. I pulled the blinds to the side and saw a powerful blue glow coming from the side of my house. The window I viewed it from did not have a direct view of the light source, but I did see it emanating around the corner. My house is a couple hundred feet from power lines, but they are in the opposite direction from where the light was coming from. Looking out the south facing window, the power lines are approximately 200 feet to the west and this light was definitely coming from the south east side of my house. The light source appeared to be generated within feet of the exterior of my house and couldn't have been more than 5 feet off the ground. There were no lightning strikes taking place while the humming noise and lights occurred, so I know it wasn't lightning. We don't have a transformer next to our house. The only thing over there is my AC unit. After the storm passed, I walked out there and there was no evidence anything had happened, and my AC was undamaged. I've lived in Florida most of my life and have seen some serious storms, but never, never have I seen a sustained blue glowing light shine through my window. With the amount of energy it must have taken to generate that light, I expected to either have major electrical damage or at least have black marks on my house, but there was nothing. By far one of the oddest experiences I've ever had."],"Latitude":"29.659284","map":"<A HREF = \"http://maps.google.com/maps?q=29.659284,+-82.320606(23958)&iwloc=A&hl=en\"> mufon case (23958) map </A>","Country":"United States","Tags":"City","Object Shape":"Flash","Object Features":"Undisclosed","Summary":"Blue humming light.","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around June 25th 2010"],"Longitude":"-82.320606"}