{"Object Flight Path":"Hovering then path","Region":"California","Object Shape":"Star-like","City":"Mt Shasta","Case Number":"23965","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Summary":"Yellowish-White Brilliant Star-Like Hovers straight to East","map":"<A HREF = \"http://maps.google.com/maps?q=41.408457,+-122.29111(23965)&iwloc=A&hl=en\"> mufon case (23965) map </A>","Date Submitted":"06/26/2010 02:03 UTC","Log Number":"US-06262010-0013","Tags":"City","Country":"United States","Object Features":"Unknown","Source":"MUFON","Longitude":"-122.29111","divs":["Sighting DetailsJust right after sunset hour and a brillant Venus appeared in west, I went outside in my front porch and ate my ice cream and all suddenly spot a twlight light through the lushy tall trees from my south view. Thought it was a star at first but it kept moving toward east at pretty fast speed in comparing to any airplanes I can know. Realized it must be appeared from nowhere at this moment when I saw it. Moreover, I live here for 14 years and never see such flying object toward to East, except any emergency flight routines. The flight shows no flash or blink at all. The flight gracefully hovered over the Mount Shasta and flied down as it traveled in East. Since I am deaf and can't tell if it emits any sounds. Though I am very observed person with well-educated background and have been familiar with any UFO sightings but this one finally I saw in real experience in 14 years in this area!! My emotion had no reaction at all toward this incident for I know that UFO sightings occurred in any part of this world everyday. But this is for a real! Historically Mt. Shasta had often UFO sightings in the past. However, this time finally it comes back! However, I keep checking for incoming any more activities in this area and try to capture them in video if possible."],"Date of the Event":"06/25/2010 10:10 UTC","Latitude":"41.408457","files":["/var/www/straped/mufon/html2text/23965.html.txt","/var/www/straped/mufon/org/23965.html"],"Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Mt Shasta","There were no other sightings in Mt Shasta on or around June 25th 2010"],"Disposition":"IFO"}