{"Object Features":"Unknown","Weather Factors":"None, Does Not Apply","Date Submitted":"06/26/2010 02:45 UTC","Date of the Event":"06/12/2010 04:15 UTC","divs":["Sighting Details I was on Ship Island, Ms. for a picnic. It was a clear day and I was with my wife. I was taking scenic pictures from under a covered decking. I never heard any other picnickers mentioning anything in the sky. It was on June 26th, 2010 (two weeks later) that I noticed something. While gazing at my picture I noticed something out of the ordinary. When I zoomed in I could see a triangle shaped object and a circular object in very close proximity to each other (it looks like they are practically touching from the angle of the photo). A second picture I have also shows something but not as discernable as the first. About the picture: I was using a Fujitsu digital Camera.I believe the settings were at 5 megapixel and I was slightly zoomed in when taking the picture. Near the upper center of the picture and above a very green pointy bush you'll see what appears to be a speck or something. If you zoom in you will see the shapes I describe. I think its fantastic that an innocent scenic picture turned out a possible UFO!"],"Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Circle, Triangle","Longitude":"-89.090466","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.36965,+-89.090466(23960)&iwloc=A&hl=en\"> mufon case (23960) map </A>","trends":["There have been 8 other sightings in Gulfport","There were no other sightings in Gulfport on or around June 12th 2010","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Log Number":"US-06262010-0008","Region":"Mississippi","Latitude":"30.36965","Disposition":"Unknown","Tags":"City","Summary":"Ship Island scenic picture. Didn't see UFO on the day. I saw the UFO a week later when reviewing picture!","files":["/var/www/straped/mufon/html2text/23960.html.txt","/var/www/straped/mufon/more/23960_submitter_file1__ShipIslandsceneryandpossibleUFO2010157.JPG","/var/www/straped/mufon/org/23960.html"],"Object Flight Path":"Unknown","City":"Gulfport","Case Number":"23960"}