{"Case Number":"2396","map":"<A HREF = \"http://maps.google.com/maps?q=39.438339,+-94.20411(2396)&iwloc=A&hl=en\"> mufon case (2396) map </A>","Region":"Missouri","files":["/var/www/straped/mufon/html2text/2396.html.txt","/var/www/straped/mufon/org/2396.html"],"Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Other","Longitude":"-94.20411","Tags":"City","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"07/01/2003 04:30 UTC","Log Number":"","City":"Lawson","Sighting Duration":"00:05:00","divs":["Sighting DetailsI was asleep on my couch and woke up. I looked out the window in my dining roomand saw a bright light in the distance. At first I thought it was a star butthen it appeared to be moving from side to side slightly and it was growingbigger. I then noticed some lights flashing to the sides of the brighter, whitelight. I figured it was just an airplane but the pattern was strange so got upfrom the couch and went to the door leading to our deck. I noticed the objectgetting much closer and it appeared to be very low to the ground. I turned offthe back porch light and stepped out onto the deck just in time to see it passover, I noticed what seemed to be an outline of a triangular shaped plane oraircraft but the entire bottom of the plane was lit up. I also noticed that forbeing so low, it made almost no sound, just a very faint rumbling sound. I ranback inside and out the front door. I had to step out onto our sidewalk to seethe aircraft as it went on by and noticed the lights on the back weresequentially flashing and different colors. I then went back inside.I pretty much figure it was just some kind of military plane but thought Id atleast let someone know.Thanks so much."],"trends":["There have been 2 other sightings in Lawson","There were no other sightings in Lawson on or around July 1st 2003"],"Weather Factors":"Unknown","Date of the Event":"07/01/2003 04:30 UTC","Latitude":"39.438339","Summary":"Silent, glowing triangle","Object Flight Path":"Unknown","Object Shape":"Triangle"}