{"Country":"United States","Weather Factors":"None","Object Shape":"Circle, Unknown","Sighting Duration":"Undisclosed","Case Number":"23964","Object Features":"None","Log Number":"GB-06262010-0012","Tags":"City","Source":"MUFON","Date Submitted":"06/26/2010 01:59 UTC","Disposition":"Unresolved","divs":["Sighting DetailsIt was a very nice sunny day here in Kettering, England, Uk. It was about 1800-1815 and the sun stays up till 2145 so visibility was very good. As I was driving I saw in the distance which i first thought was a plane, it went round in circle and then it disappeared. It was like some kind of reflection, it was very high in the sky, close to 1km above ground and 3 to 4 miles away from me. There were no clouds any where near the object. I kept driving and I saw this happened twice again, the reflection circled almost like it was a circle shape. and the reflection diameter was hugh. The object itself was not visible, i could see the sky right through it. the ufo was stationary high above ground. The reflection colour was in white, and the reflection was a rectangle shape circling the object, only the sun reflection gave it away. After the reflection, it was as if it wasnt there. the reflection rectangle size was about the same as the wings from a 747, one end to the other. I never lost sight of it, but after the reflection it was completely INVISIBLE, but it was still up there, the object was colourless. Because this was my first sighting, i didnt think much of it right after and continued driving, though i still wonders what that is. that there were something high above the ground wanted to remain unseen, possibly looking down on us. My feelings right now is could there be more of this around , i travelled the same stretch of road nearly everyday, i occasionly look up at where i saw the UFO. I think this is a very Cunning technology, whatever it is."],"files":["/var/www/straped/mufon/html2text/23964.html.txt","/var/www/straped/mufon/org/23964.html"],"City":"Kettering","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=39.698254,+-84.159427(23964)&iwloc=A&hl=en\"> mufon case (23964) map </A>","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Summary":"Camoflauged, transparent, see-thru UFO that was not visible in daylight.","trends":["There have been 7 other sightings in Kettering","There were no other sightings in Kettering on or around June 22nd 2010"],"Longitude":"-84.159427","Latitude":"39.698254","Date of the Event":"06/22/2010 06:01 UTC"}