{"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/23962.html.txt","/var/www/straped/mufon/org/23962.html"],"Date Submitted":"06/26/2010 08:45 UTC","Object Flight Path":"Straight-line path","Weather Factors":"None","Summary":"White orb makes appearance 3rd night in a row.","Object Features":"None","Log Number":"US-06262010-0010","Tags":"City","Longitude":"-75.204468","Case Number":"23962","trends":["There have been 13 other sightings in Bangor","There was one other sighting in Bangor on or around June 25th 2010"],"Latitude":"40.874842","map":"<A HREF = \"http://maps.google.com/maps?q=40.874842,+-75.204468(23962)&iwloc=A&hl=en\"> mufon case (23962) map </A>","Date of the Event":"06/25/2010 10:08 UTC","Object Shape":"Circle, Star-like","Country":"United States","City":"Bangor","Source":"MUFON","divs":["Sighting DetailsDecided to watch for the orbs that I reported to you yesterday. My husband and I went out onto the patio around 9:30 pm. At exactly 10:08 pm the bright white orb showed up. It traveled W to E staying right above the mountain. As usual no sound is heard. We estimated 5 to 10,000 feet. Moving about 200 mph. About the same speed as a jetliner. The higher elevation orbs were absent this time. However the orb that flies lower seems to be getting bolder. Again a small plane was in the area at the time of our sighting. Also numerous jets flying into the NJ and NY airports were going about their business. Being a Friday night, air traffic was heavy. However, all this activity didn't seem to deter this orb. This may sound strange.....It seems to want to be seen. We have noticed that our six year old Australian Cattle dog has been extremely anxious for the past few nights. She pants alot even though we have air conditioning on. Her anxiety begins before we even go outside. If I bring her out with me she keeps running into the woods as if on chase. She comes back after a couple mins. Even though I remain calm, she is on high alert the whole time. I will continue to report these sightings until they stop happening. As I said yesterday, I already have one of your investigators in contact with me. I am so grateful for this forum to share information with you and the public."],"Region":"Pennsylvania","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}