{"Object Features":"None","Date of the Event":"06/25/2010 11:04 UTC","Region":"Ohio","Object Flight Path":"Undisclosed","Date Submitted":"06/26/2010 02:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.758409,+-83.029064(23966)&iwloc=A&hl=en\"> mufon case (23966) map </A>","Log Number":"US-06262010-0014","Case Number":"23966","Source":"MUFON","Tags":"City","trends":["There have been no other sightings in West Portsmouth","This sighting has never been favorited."],"City":"West Portsmouth","Country":"United States","Disposition":"Unknown","Longitude":"-83.029064","files":["/var/www/straped/mufon/html2text/23966.html.txt","/var/www/straped/mufon/org/23966.html"],"Sighting Duration":"00:03:00","Summary":"Flashing UFO in Ohio River Valley.","Latitude":"38.758409","Object Shape":"Flash, Oval, Sphere","Viewing Distance":"Over One Mile","Weather Factors":"None","divs":["Sighting DetailsLet me try to set the stage for my \"UFO event.\" My family and I live in West Portsmouth, Ohio. My father has been in the VA Hospital in Hunnington for a few days, so my mother and I have been traveling back and forth for his stay. After yesterday's visit, I decided to drop my mother off at our home and go to work to pick up my pay check around 10:00 p.m. Friday night. Upon my return, I pulled into our driveway, got out of my truck, and something, I don't remember what exactly, made me think to look toward the sky. I approximate that what I saw was above Carl Perkin's Bridge and moving along the river towards Lucasville, Ohio. It was, as I remember, Oval to spherically shaped. It's hard to tell the exact shape because it seemed, against the dark night sky, to be 2-D rather than 3-D. Quickly, but I have to admit I hesitated because I didn't want to lose sight of it, I went inside the house to get my mother. I wanted her to confirm what I was seeing. She came outside, and sure enough, it was still traveling in the same area I had left it. My mom could see it too. Neither of us could think of what it might be. Often we've looked toward the sky and noticed planes overhead. But at the distance they fly above, they look like little bleeping lights. What we saw, was not a commercial airliner. Eventually, after we watched for a minute longer, the object continued to travel in line of the river toward Lucasville until it was no longer visible. My discription in depth: Imagine an apple core. The top and the bottom flared out... The middle area, I imagine must have been spinning quickly around the apple core axis, because it was slightly lighter in color. As it began to fade off into the distance, it would blink blues and reds...or more like, twinkle. As this is the end of my narrative, I must apologize for the constant use of \"it.\" If I knew what \"it\" was, for sure, without a doubt, I would try to be more conscious of my redundancy."]}