{"trends":["There have been 6 other sightings in Batavia","There were no other sightings in Batavia on or around June 26th 2010"],"City":"Batavia","Summary":"Orb appears out of cloud, and in blue sky, goes from grey to pure white and disappears.","Object Flight Path":"Straight-line path","Date Submitted":"06/26/2010 10:42 UTC","Log Number":"US-06262010-0022","files":["/var/www/straped/mufon/html2text/23974.html.txt","/var/www/straped/mufon/org/23974.html"],"Case Number":"23974","divs":["Sighting DetailsI was laying out at the pool with friends, I waqs looking at the clouds, Columbus type,noticed to holes punched into the clouds, were you could see blue sky. As I looked at the clouds, at about 11 0clock high, I noticed a brown comtrail that went into the clouds, actually it was well above the clouds,but just as I was looking a sphere grey in color appears from nowhere under the clouds, I watch it for a few seconds, (the size of a pea at 5 ft away distance wise it was apx 10 miles away, south of me going west.,) as it moved past the clouds into open blue sky, it changed white in color as the sun hit,I also saw like a gold color rim as it changed white. I watch it travel maybe 3 miles past the cloud going west, and as it changed colors it blink and I thought to myself it see's me. Just then it disappeared into the blue sky.Well I told my friends they said yeah right. About 1 minute later, still looking at the sky, out of nowhere and father west 12 oclock high, in pure blue sky I see what now looks like a meteorite falling from the sky apx 100,000 ft, it left a short white comtrail, it was falling several thousands of miles per hour,I saw a redish point size of a pixtel, I showed my friend he yelled that aint no jet going that fast, as it was falling it like turned the comtrail on and off then it stayed on, it then seemed to level off and head out towards Iowa, we could see it's pure white short comtrail. As we were watching I noticed a brown comtrail so high I couldnt make out what kind of jet it was, chasing after, ufo, but the speed of ufo was several times faster, this lasted about 3 mins until I couldnt see comtrail from ufo I saw it till it faded out of my eyesight. It seem like it came in at a 60 degree angle staying above the horizon,it was so fast. The moment I saw the Orb, I new it was a ufo,I was prepared to track it with eyesight but it disappeared, when I saw metorite I new it was the Orb,and it was getting out of here, then about a minute later jet appears. I think jet was after this thing and was the first comtrail I saw going east, and orb appears, and goes west. Under the clouds, while comtrail was well above clouds. Orb was apx 5-10 thousand feet high when I saw it. Afterwards I tried to evaluate what I saw, and I know what I saw was not man made.I am now reporting this to you, and hope you find some evidence of this."],"Sighting Duration":"Undisclosed","Date of the Event":"06/26/2010 03:22 UTC","Viewing Distance":"Over One Mile","Object Shape":"Circle","Longitude":"-88.304954","Region":"Illinois","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.859848,+-88.304954(23974)&iwloc=A&hl=en\"> mufon case (23974) map </A>","Tags":"City","Disposition":"Unresolved","Source":"MUFON","Country":"United States","Latitude":"41.859848","Object Features":"None"}