{"Weather Factors":"Unknown","Summary":"Very defined in colour as if it were painted in the sky like a black hole.","Tags":"City","Object Features":"Other","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/23971.html.txt","/var/www/straped/mufon/more/23971_submitter_file1__ufo073.JPG","/var/www/straped/mufon/more/23971_submitter_file2__ufo074.JPG","/var/www/straped/mufon/org/23971.html"],"Sighting Duration":"Undisclosed","Country":"Canada","Date Submitted":"06/26/2010 07:08 UTC","divs":["sighting detailshi my name is (*name deleted--sgonzalez\\cms), my son (**name deleted--sgonzalez\\cms) and i were going on a bike ride by the river to go fishing. so, we brought the camera in case we caught a fish or something else that was cool.after finding a turtle and taking pictures of it, we noticed it was getting late around 9:00pm so, we decided to leave. biking back on the path heading west i happened to turn my head to the north and saw this very distinct dark object in the sky which appeared over the church in the far distance(the higest peak in the city) approx 1-2 km away from us above the church but, it seemed further away than that and a few hundred feet high possibly a thousand. at first i thought it was a hot air balloon but, i've seen those before and i knew it wasn't that so, we watched it to see if it was moving but it didn't go up or down or side ways it appeared to be slightly pulsating in one spot,in arms length it would be the size of a larger asprine but smaller than a dime.after watching it for a few minutes i remembered i had my camera so i took two pictures zoomed in at 14 times but it still wasn't close enough to see good with the camera. i told my son we need to get closer to it to get a better picture! he didn't want to but, we decided to go to the fire hall to get closer apprx 1-1 1\\2 minute bike ride when we got there it was gone, nothing in the sky at all. my reaction was \"what the!!\" where did it go? i have seen this type of object before except a lot larger and in a different city but, this time i had a picture! to show what we saw."],"Source":"MUFON","Date of the Event":"06/06/2010 12:00 UTC","Latitude":"43.654666","Viewing Distance":"501 Feet - 1 Mile","Region":"Ontario","Disposition":"Unresolved","Case Number":"23971","Longitude":"-79.381984","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around June 6th 2010","This sighting has never been favorited.",""],"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=43.654666,+-79.381984(23971)&iwloc=A&hl=en\"> mufon case (23971) map </A>","City":"Toronto","Log Number":"CA-06262010-0019"}