{"divs":["sighting detailsat about 10:30, i was walking back to my house after locking up our trailer when i saw a bright light in the sky. it immediately caught my eye because it was very bright, but appeared--at first--stationary in the sky. it also had no blinking lights like a plane. at first i thought it might be satellite, but i've seen the space station pass by before, and this was not moving across the sky. it was a round ball shape, bright, mostly white but with a reddish\\orange hue. it moved slightly, but not in one direction. i went inside to get my wife, and we both saw it, smaller now, but in the same area. we both quickly recognized that it was not a plane, or a fireball, or a satellite. couldn't explain it's movement. we looked on the star chart, and it appeared in the area of the constellation bootes. it was to the south of the lesser star on the right side of arcturus, moving to the south. it then moved north, passing that star and drawing near coma berenices. it then turned west, then north again, getting smaller all the time, before finally hooking around to the west (but keeping in the general area of bootes) and disappearing at about 10:35. we heard no sound at all the entire time. when it first appeared, it looked about the same size as a bb held at arm's length, was about the size of a pinhead at arms length when my wife came out, stayed that approximate size for a minute or two, and then got progressively smaller until it disappeared. it had a definite round shape, bright but self-contained. the light was mostly continuous, but just before it disappeared, it seemed to pulsate a little, although we didn't notice a particular pattern. it was rather like an ember going out, and we had the impression that it was getting further away. there were no clouds."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/23989.html.txt","/var/www/straped/mufon/org/23989.html"],"Object Flight Path":"Path with directional change","Latitude":"45.307338","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.307338,+-122.966176(23989)&iwloc=A&hl=en\"> mufon case (23989) map </A>","Date Submitted":"06/27/2010 03:37 UTC","Viewing Distance":"Unknown","Disposition":"IFO","Object Shape":"Circle","Country":"United States","Region":"Oregon","Date of the Event":"06/26/2010 10:30 UTC","Log Number":"US-06272010-0012","Summary":"Bright light over Yamhill County, OR; appeared high in the sky around Bootes constellation, then disappeared.","Sighting Duration":"Undisclosed","City":"Newberg","Longitude":"-122.966176","trends":["There have been 3 other sightings in Newberg","There was one other sighting in Newberg on or around June 26th 2010"],"Object Features":"Unknown","Tags":"City","Case Number":"23989"}