{"Disposition":"Unknown","trends":["There has been one other sighting in Westwego","There were no other sightings in Westwego on or around June 25th 2010"],"Date of the Event":"06/25/2010 12:00 UTC","divs":["sighting details i was sitting in my back yard, getting ready to look at the at stars with my telescope.(i got one for christmas)..because, i have seen things in the sky before.i have never reported them.i was just getting set up. i noticed (what looked like a very bright star) going across the sky.it was going just a little faster than an airplane.from the south to the north, a lot lower than a plane would fly.i could see it very easy.i didn't have to use my telescope.it went north until it was gone from view..i was so excited i knew this was not an airplane. i want inside to get my binoculars (just incase).as soon as i walked outside something caught my eye to the north\\east. another one !! i watched it go all the way across the sky going east to west, it was in clear view. the weirdest thing,, when it got to the path of where the first one was 'it vanished'.it was like some one turning a light off. right after that happened. another one!! i was like oh my god. this is amazing..this one followed the same exact path of the first one, it did not vanish, it kept going until it was out of view. to the t 'literally'..the first and third followed a path like the top of a t and the second was like the bottom of the t ending right at the line of the top.all of this happened in 10 minutes time..i was freaking out, because after the first one i jokingly said a big \"hello.\"and then after the second and third ones,,i was like this is getting spooky.i had the feeling they were watching me too! or something was..i have been praying for gods help with the oil spill. and i asked for their help too. kind of. and i was like. ooooooooh what did i do? watch what you ask for. i cowardly went inside. lol. gonna charge my cam corder for tonight..and make sure im not alone.i noticed there are alot of people seeing these star looking ufo's lately. i live near an airport, they made no noise. i know this was not planes..i know this was not stars. what were they??? and my phone wasn't working at the time.. because my son tried to call me and all he got was a loud noise."],"Case Number":"23986","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"29.906039","Object Shape":"Star-like","City":"Westwego","Tags":"City","Date Submitted":"06/27/2010 01:40 UTC","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Log Number":"US-06272010-0009","Weather Factors":"Unknown","Longitude":"-90.142296","Summary":"South Louisiana,,saw 3 stars fly across the sky. A little faster than a plane. Brighter than brightest star..no blinking lights.","files":["/var/www/straped/mufon/html2text/23986.html.txt","/var/www/straped/mufon/org/23986.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.906039,+-90.142296(23986)&iwloc=A&hl=en\"> mufon case (23986) map </A>","Region":"Louisiana","Country":"United States"}