{"Region":"Illinois","Case Number":"23984","Country":"United States","Tags":"City","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around June 26th 2010"],"Source":"MUFON","Object Shape":"Circle","Weather Factors":"Unknown","Date of the Event":"06/26/2010 12:00 UTC","Summary":"White circle in Chicago night sky 6/26/2010.","map":"<A HREF = \"http://maps.google.com/maps?q=41.885464,+-87.626618(23984)&iwloc=A&hl=en\"> mufon case (23984) map </A>","City":"Chicago","divs":["sighting detailswhile attending the screening of indiana jones \"raiders of the lost ark\" at horner park (cpd)last night 6\\26\\2010. i noticed a white circular object in the sky, it appeared out of the western horizon, its line of flight was in a north-eastern direction. it travel at about the same altitude, it did not appear to zig-zag around. sitting at the base of the hill in horner park, i had a clear view of the night sky. my son and i watched it for about a minute or so when it flew into some high thin clouds in the north-eastern sky. i was amazing that we were able to see it for a few more seconds only due to how bright it was. my opinion is was not a plane or helicopter... the light imitating from the object was pure white, we saw saw it from three angles front-below-behind. plenty of o'hare flight traffic heading in eastern flight path, my guess is the had to seen it. later while standing line getting popcorn my son asked the person in front us did they see the bright light? the woman commented that she did. i checked the local news wires in chicago this morning no stories reported... i saw one posting from batavia for 6\\26\\2010, but what they described is not what we witnessed."],"Date Submitted":"06/27/2010 01:18 UTC","files":["/var/www/straped/mufon/html2text/23984.html.txt","/var/www/straped/mufon/org/23984.html"],"Latitude":"41.885464","Sighting Duration":"09:35:00","Viewing Distance":"Unknown","Disposition":"Unresolved","Log Number":"US-06272010-0007","Longitude":"-87.626618"}