{"Viewing Distance":"Over One Mile","Case Number":"23996","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.302818,+-122.965536(23996)&iwloc=A&hl=en\"> mufon case (23996) map </A>","Date of the Event":"06/26/2010 10:15 UTC","Latitude":"45.302818","Country":"United States","Object Features":"None","Date Submitted":"06/27/2010 11:24 UTC","Object Flight Path":"Path then hovering","Object Shape":"Teardrop","Source":"MUFON","trends":["There have been 3 other sightings in Newberg","There was one other sighting in Newberg on or around June 26th 2010"],"Weather Factors":"Unknown","Log Number":"US-06272010-0018","City":"Newberg","Summary":"Three independent objects move from west to east then climb out of sight.","Sighting Duration":"Undisclosed","Longitude":"-122.965536","divs":["Sighting DetailsThree objects were observed, each one separately. They all followed similar flight patterns. They were sighted initially in the west out of our window in the TV room. We were watching the TV. I jumped up and grabbed my camera and went outside. My wife followed me outside. They moved from west to east and became stationary at what appeared to us to be southwest of our position. Each object then appeared to climb in altitude slowly until disappearing out of sight. There were no discernible clouds in the sky although when the objects disappeared we both had the feeling they went into a cloud. I took still pictures and some moving pictures throughout the event. Time and date are stamped on each frame. At one point I took a photo of what I thought was one object only to discover when I imported it into the computer that there were three objects in the frame. The was no sound associated with their movement. All three objects appeared as candlelight type of color, a mix of reds, oranges, white. I noticed a bit of pulsing, especially in the white aspects of the objects. After the first object disappeared, an airplane came into view moving from the southwest to the northeast. It was much lower in the sky than the object was at any given point. But I remember shaking my head wondering if the pilot could have possibly NOT seen the object! The second object appeared before I got into the house after the first one disappeared. The third object was noticed after we got back in the house after the second object had disappeared."],"Tags":"City","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/23996.html.txt","/var/www/straped/mufon/org/23996.html"]}