{"map":"<A HREF = \"http://maps.google.com/maps?q=40.769489,+-111.885997(23995)&iwloc=A&hl=en\"> mufon case (23995) map </A>","Sighting Duration":"Undisclosed","Case Number":"23995","Date Submitted":"06/27/2010 10:58 UTC","Object Shape":"Circle","Log Number":"US-06272010-0017","Summary":"My second encounter with video.","Date of the Event":"06/25/2010 12:00 UTC","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around June 25th 2010","This sighting has never been favorited.",""],"Source":"MUFON","Weather Factors":"None","divs":["Sighting DetailsHello everyone. I came here the first time explaining the story how me and my family chased the UFO and I took those two disappointing photos. I will still remember that event however now I got some video of another sighting except this one wasn't superb like the first one, though I am sure I captured another UFO. This one is quite different as it appeared as a typical UFO that you see on YouTube. This looks like a classic UFO to me and if you look closely it appears that the UFO sways back and forth. Look at it a couple times after the edit than you will see what I am talking about. It is also heavily edited the reason why is because it was so bright outside that I couldn't see my LCD screen so it was hard to tell if I was capturing or not and I couldn't locate it perfectly until the last bit of the edit part of the video. When I lost it I thought that the object bolted but it appeared to go beneath the tree in my field of view and disappeared from my site. I should of checked it out closely by driving towards it if I could find it however I had to get ready to go to college that day and didn't have the time. So I wasn't really ready. Next time I plan to film it better and go full force and try to film the whole thing until I cannot see it. This is my second sighting of my life. If I had this camera before hand the first sighting would of been incredible. So I believe that something will happen soon and I want everyone to know that something out there exist."],"Disposition":"Unknown","Longitude":"-111.885997","Country":"United States","City":"Salt Lake City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Viewing Distance":"Unknown","Latitude":"40.769489","Region":"Utah","Object Features":"None","files":["/var/www/straped/mufon/html2text/23995.html.txt","/var/www/straped/mufon/org/23995.html"],"Tags":"City"}