{"Region":"California","Date Submitted":"06/27/2010 09:20 UTC","Date of the Event":"06/25/2010 08:12 UTC","Viewing Distance":"Unknown","Latitude":"38.435755","map":"<A HREF = \"http://maps.google.com/maps?q=38.435755,+-120.562792(23993)&iwloc=A&hl=en\"> mufon case (23993) map </A>","Object Features":"Unknown","Object Shape":"Star-like","Sighting Duration":"00:00:30","Summary":"Bright light moving briskly from west to east. No sound or flashing wing lights.","divs":["Sighting DetailsI was on my back deck, which essentially faces west. It was around 8:30 and I was enjoying the evening air and watching the stars come out. I was also enjoying a good cigar and a scotch. I'm in the Sierra foothills at about 3500'. From the west came a bright light moving briskly. Not super fast, but probably faster than a typical piston engine aircraft. It was twilight and a few stars were starting to become visible. This object was a bright light and I could see no other \"parts\". It was moving eastward and made no sound. There were no blinking lights and I could see nothing that would indicate an airplane of any sort. It disappeared behind the trees after about 8 seconds so I moved to the front of the house (east). It reappeared from behind the trees and continued on eastward. The light were definitely not a landing light. It remained the same brightness as it approached and as it left. There are no airports in this area. I would guess the altitude to be somewhere between 2000 and 4000 feet. The neighborhood was pretty quiet and I heard not sound whatsoever. That is why I decided to file this report. The included picture was taken earlier this month during the day. I tried to make it look like twilight, while showing the size of the light. The bottom of the picture is west-southwest. The top left is east-northeast. I did not see a \"disk\" shape. Just a very bright white light."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/23993.html.txt","/var/www/straped/mufon/more/23993_submitter_file1__EveningSky.jpg","/var/www/straped/mufon/org/23993.html"],"Weather Factors":"Unknown","Log Number":"US-06272010-0016","Longitude":"-120.562792","City":"Pioneer","Tags":"City","trends":["There have been 3 other sightings in Pioneer","There were no other sightings in Pioneer on or around June 25th 2010","This sighting has never been favorited.",""],"Disposition":"IFO","Case Number":"23993","Country":"United States","Object Flight Path":"Straight-line path"}