{"Latitude":"38.632602","map":"<A HREF = \"http://maps.google.com/maps?q=38.632602,+-90.194774(23998)&iwloc=A&hl=en\"> mufon case (23998) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"06/28/2010 03:19 UTC","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-90.194774","Tags":"City","files":["/var/www/straped/mufon/html2text/23998.html.txt","/var/www/straped/mufon/org/23998.html"],"Date of the Event":"06/21/2010 02:40 UTC","Object Flight Path":"Straight-line path","divs":["sighting detailsi was driving east on interstate 70 near w florissant ave when something in the northeast sky caught my eye. the object looked like a cigar and its altitude seemed low. its color blended in with the background clouds as white or grey. the movement of the object was not strange as it was level and straight during the entire sighting. what stood out is the speed at which it was traveling and its low altitude. i don't have a good feel for how far away the object was but it was definitely on the illinois side of the mississippi river below the intermittent cloud cover. i watched it cross about 120 degrees of the horizon in approximately 110 seconds, moving from nne to ssw until it faded into the background clouds behind the st. louis skyline. that is a speed of about 1 degree of sky covered per second so i rolled down my windows while trying to keep the object in view and did not hear a sonic boom. there is a lot of air traffic in that area that i see every day (landings\\takeoffs at lambert and st. louis city airport), and this object certainly stood out due to the speed, altitude, and heading (all the airports in the area are nw\\se runways and flyovers are much higher). as soon as i lost sight of the object i sent a text to my wife and the time of that text is 2:44pm cdt."],"trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around June 21st 2010"],"Case Number":"23998","Country":"United States","Disposition":"Unknown","Summary":"Light colored, low flying cigar, crosses majority of horizon in less than 2 min.","Region":"Missouri","Object Shape":"Cigar","City":"St Louis","Log Number":"US-06282010-0001","Viewing Distance":"Over One Mile"}