{"Country":"United States","Summary":"Big orange sphere shape darted behind the woods.","Disposition":"Insufficient Data","Case Number":"24003","Log Number":"US-06282010-0006","Date of the Event":"04/07/2010 08:52 UTC","Latitude":"39.640955","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24003.html.txt","/var/www/straped/mufon/org/24003.html"],"trends":["There have been 5 other sightings in Liberty","There were no other sightings in Liberty on or around April 7th 2010"],"Object Flight Path":"Undisclosed","Date Submitted":"06/28/2010 02:57 UTC","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=39.640955,+-84.923521(24003)&iwloc=A&hl=en\"> mufon case (24003) map </A>","Tags":"City","Object Shape":"Sphere","divs":["Sighting DetailsI was outside feeding the dogs. the sun had just gone down and it was beggining to get dark. i had opened a dogs cage and dumped some food in a bowl. once i closed the pen i had turned to pick up the water buket when some big, orange bright shpere shaped light caught my attention. i looked up just to catch the bright light dart behind the woods. the light was about a mile away from me but was still probably on the fenceline of my property. once the light disapeared everything was okwardly dark again. once i looked away from the woods i had noticed that i was very shaky. and suprised. i didnt know what to think exactly all though i had always been curious about ufos. i wasint quite sure what to call it. i never really told anyone. also i had talked to some freinds that live in a nearby town and they had also said they experienced something kind of like this on new years night. they had seen and heard something crash while riding their bikes they said they heard it hit the ground. the next day one of them went back to the place and had found a big imprint in the ground."],"City":"Liberty","Longitude":"-84.923521"}