{"map":"<A HREF = \"http://maps.google.com/maps?q=33.545712,+-112.176877(24000)&iwloc=A&hl=en\"> mufon case (24000) map </A>","City":"Glendale","Longitude":"-112.176877","Viewing Distance":"101-500 Feet, Unknown","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around June 23rd 2010"],"Date of the Event":"06/23/2010 09:17 UTC","Date Submitted":"06/28/2010 06:36 UTC","Object Shape":"Saturn-like, Star-like","Disposition":"Unknown","Weather Factors":"None","Region":"Arizona","Tags":"City","Object Flight Path":"Straight-line path","divs":["Sighting DetailsAt the time of the sighting, i was in my backyard. Before hand, i was searching for my brother within the house, but i could not find him. I decided to peak outside into my backyard through the back door. Simultaneously, i thought to myself, \"what a clear night to hunt for Ufo's... nah maybe tomorrow night\"; i have always been an Ufo fanatic. Seconds later, i heard the loud sound of metal clinging and a thump of weights falling when i saw my brother running to the house and calling my name to alert me that there was something weird in the sky. I ran outside with adrenalin pumping through my veins, hoping it was a sighting. To my surprise, it was a very bright like object similar to a star, Jupiter perhaps. It drifted across the sky slowly and directly above our heads towards the northeast. Immediately i believed it was an Ufo because the star did not have blue or red, or other blinking lights of any sort, which are found on identified aircraft, and it did not make a sound at all. The object must've traveled no faster than a normal Boeing 737 plane that Southwest Airlines uses to fly its civilians, for the object was only visible for about 3 minutes before it disappeared behind some trees and houses. Aside from getting an adrenalin rush, i felt sort of frightened but excited all at the same time. Several seconds after i saw the object, i ran inside my house to grab my phone, so that i can call and report the sighting to a small Ufo store in Sedona, Arizona; however, it was already late and no one answered my call. Unfortunately, i was not able to document the sighting media-wise as proof, as the camera on my phone has very poor quality and did not pick up the light emitted by the object."],"Case Number":"24000","Summary":"The object was bright in the night sky as if it were a star slowly drifting across the sky without a sound.","Country":"United States","Latitude":"33.545712","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24000.html.txt","/var/www/straped/mufon/org/24000.html"],"Sighting Duration":"00:03:00","Log Number":"US-06282010-0003"}