{"divs":["sighting detailsmoon of memphis ufo \\ a 1964 religious fatima at 10pm around mid-november of 1964 in memphis tennessee, i was asked by my mother to take out the garbage. i went out back and i noticed a bright white full moon above. i looked closer and i noticed it had uniform whiteness with well define circular outline but i was not able to see the shades of white or grey that made the man in the moon face. it was equally as bright as the real full moon, bright enough to create a moon shadow. i looked around and i noticed another moon that was bright orange. this other moon was rising over our neighbor's house to the east, as i looked through the side yard from the back yard to the front. it had the features that created the man in the moon, so i believed that it was the real moon. i looked above and stared again at the white moon for a few minutes, then it made a rapid ascent in the sky. as it rose, it became smaller and smaller until it appeared to looked like a bright star, then a dim star, then disappeared into space. it reminded me of the star of bethleham when it was at high altitude. i was only seven when i witnessed this ufo that i now call the moon of memphis. i had a good memory of the event so that when i was trained in the air force as a navigator, i was able to analyze the event better with my aviation experience. i estimate that the moon of memphis was at twenty thousand feet and was about ten acres in size. i developed this information from watching the ascent of the moon of memphis through some high cirrus clouds that i estimate was at sixty thousand feet. at twenty thousand feet it would have taken four 747 aircraft parked in a circle to cover the area of the moon of memphis ufo, thus creating a ten acre size estimate. when i saw it above me, it was exactly the size of the real moon when seen high in the sky. i believe the moon of memphis ufo was a fatima from god. when you take a through z and match it with 1 through 26, you can add up the letters of a word and get a sum number. for example israel adds up to 64, which made me think that the 1664 moon of memphis ufo had religious significance. where the moon of memphis came from or how it was created, was certainly a unique phenomenon of divine origin and purpose. it's appearance in 1964 hints that it had a religious intellectual mind. from voices, visions, and dreams that i experienced thirty three years later, i believe it had a message from god to humanity. god wanted humanity to be more reverent to all living beings and animals. the consciousness of each being or animal is precious and must be respected more. before animals are killed, they should receive anesthesia and be put into an unwakeable sleep. anything less is cruel, heartless, and unreverent to that being and god. humanity should find a way to eat without killing animals, but until then, we must not kill an animal while it is awake. treat innocent animals as you would like to be treated if you were in their place. the moon of memphis is proof that god does exist and we should obey his wish for us to be more kind to each living being and animals. [cms\\tg\\pid]"],"Summary":"A UFO called the Moon of Memphis is a Fatima of God.","Country":"United States","City":"Memphis","Region":"Tennessee","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"11/15/1964 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.210187,+-90.042006(24004)&iwloc=A&hl=en\"> mufon case (24004) map </A>","Object Features":"Undisclosed","Disposition":"Unknown","Longitude":"-90.042006","Object Shape":"Circle, Sphere","Latitude":"35.210187","Weather Factors":"Unknown","trends":["There have been 62 other sightings in Memphis","There were 3 other sightings in Memphis on or around November 15th 1964"],"Date Submitted":"06/28/2010 03:02 UTC","Tags":"City","Log Number":"US-06282010-0007","Case Number":"24004","files":["/var/www/straped/mufon/html2text/24004.html.txt","/var/www/straped/mufon/org/24004.html"]}