{"Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-06282010-0019","Disposition":"IFO","Latitude":"39.563057","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.563057,+-84.299797(24018)&iwloc=A&hl=en\"> mufon case (24018) map </A>","Date of the Event":"06/28/2010 09:00 UTC","Longitude":"-84.299797","Object Flight Path":"Stationary","Weather Factors":"Medium","Tags":"City","files":["/var/www/straped/mufon/html2text/24018.html.txt","/var/www/straped/mufon/more/24018_submitter_file1__6-28-10_Sunset010.jpg","/var/www/straped/mufon/more/24018_submitter_file2__GoingThrough.JPG","/var/www/straped/mufon/org/24018.html"],"Object Shape":"Circle, Sphere","Region":"Ohio","Country":"United States","Object Features":"Other","Date Submitted":"06/28/2010 11:26 UTC","Sighting Duration":"00:02:11","City":"Franklin","trends":["There have been 4 other sightings in Franklin","There were no other sightings in Franklin on or around June 28th 2010","This sighting has never been favorited.",""],"Summary":"Taking photos of sunset captured a shot of a plane flying through with vapor trail seen circle or sphere after uploading to my PC.","divs":["sighting detailsi am an amature photographer for a local news station. i generally take photos of weather related things & nature related things. as i was taking photos of this evenings beautiful sunset i caught through my lens a regular airline flying through the clouds leaving a vapor trail behind it and i thought it would make a nice shot. it was only after i uploaded it from my camera to my pc and then to the news website that i realized there was something odd in the photo. prior to placing the photo on the news website i cropped the photo just so i could see more clear the plane leaving the vapor trail through the clouds etc etc.. only after i uploaded it to the news site i realized something odd. just above the plane and vapor trail and to the left of the plane and vapor trail is a small white sphere or circle. initially i thought \" wow, is that a bird or what?\".. so i grabbed the original un-enhanced or(un-cropped) photo and tried to zoom in on it. i have been to this site before telling some pretty awesome stories of things that have happened in my area ( this tiny little city ) that my son's and myself have seen in the night sky.and one of your guys contacted me through email and wanted to speek with me over the phone. i declined the offer because i was afraid that the goverment might get downwind of it and hunt me down.i'de laugh usually if i didnt think that was so serious. but i do feel it is serious * so i keep my mouth shut about it all unless it's family.* i am not sure what this thing is i captured. nor did i even see it untill i downloaded it to the news site. and then i felt like an idiot for not noticing it prior to uploading it to the news site. it was still quite daylight out. the object is clearly as white as the plane and the vapor trail the plane was leaving behind. i tried to zoom in on it only to make it pixelate & worse off. i'm not sure what you guys might be able to do with the photo. i am handing you folks a copy to see what you think about it. ~sincerely, [cms\\tg\\pid]"],"Case Number":"24018"}