{"Latitude":"42.052296","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Weather Factors":"Does Not Apply","Source":"MUFON","divs":["sighting detailsthe following description is being reported by *(name deleted--sgonzalez\\cms)an iowa field investigator for mufon. on saturday, may 1,2010 between 8:30 and 9:00 in the evening,a witness while walking his dog, reported one of his many sitings that have taken place in the skies over rockwell collins. a star-like object, flying from the northwest to the southeast, went into a slow\\curved flight path to the northeast. at the same time, one passenger jet flew west near the flight path and a second passenger jet flying northease flew directly over the moving object. the star-like object was estimated to be between 10-15,000 feet while the passenger jets were estimated at 30,000. on thursday, may 6, 2010 the witness was once again out walking his dog and saw a star-like object flying at jet speed from the northwest to the southeast. it then disappeared into light cloud cover. in both of these sitings there was no sound nor were there any identification lights. the time of the second siting was about the same as the may 1st siting. the witness called the field investigator immediately after the siting while walking home with his dog. it should be noted that there is an airport close to rockwell collins and the witnesses daily walks with his dog have afforded many opportunities to watch aircraft of all types in the evening skies."],"Date Submitted":"06/28/2010 07:05 UTC","files":["/var/www/straped/mufon/html2text/24010.html.txt","/var/www/straped/mufon/org/24010.html"],"Tags":"City","Summary":"Repeated sightings of star-like objects continue in the vicinity of Rockwell Collins, the world's leading aerospace and defense company.","Date of the Event":"05/01/2010 08:30 UTC","trends":["There have been 2 other sightings in Hiawatha","There were no other sightings in Hiawatha on or around May 1st 2010"],"Country":"United States","Log Number":"US-06282010-0013","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=42.052296,+-91.673425(24010)&iwloc=A&hl=en\"> mufon case (24010) map </A>","City":"Hiawatha","Viewing Distance":"Over One Mile","Disposition":"Unknown","Object Features":"None","Longitude":"-91.673425","Case Number":"24010"}