{"Longitude":"-85.999779","Log Number":"US-06292010-0010","Summary":"They appear like stars and sit still for a while then they move in erratic fashions.","files":["/var/www/straped/mufon/html2text/24029.html.txt","/var/www/straped/mufon/org/24029.html"],"Case Number":"24029","Region":"Alabama","trends":["There have been 4 other sightings in Gadsden","There were no other sightings in Gadsden on or around June 24th 2010"],"Object Shape":"Diamond, Disc, Oval, Sphere, Star-like","Date of the Event":"06/24/2010 11:19 UTC","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change,Other","Date Submitted":"06/29/2010 04:28 UTC","divs":["Sighting DetailsEvery night me and my sons got out side to watch the sky. One night we started noticing lights racing across the sky but we knew they werent sattelites becasuse they would always return to there original positions and sit still.On several occasions we have noticed several getting together or grouping up and then star an eratic dance. I spot them fairly easy but it seems to be more of a grid network like there searching for something because there all over the sky not just in one location. I thought i was crazy there for a minute but i have friends and family that also sees them. But last night was the most i have seen at a time there were about ten to twenty and at one point there three really large orange orbs flying in a v sahaped formation at a high rate of speed. the lights don't appear to be in our atmosphere there simpily to high in the sky. But every night I lok for the big dipper and then turn to where it is to the back left of me and look up and thats usually the area that they originate from but recently they are just everywhere. It seems to start around 9pm cst through 4am cst. I was also noticing every now and then a red cone of light would explode out of them ( orb--<<<< ) it would last just a couple of seconds then dissapate. We also noticed a large orb hovering with sevral lights in the westeren sky."],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"None","City":"Gadsden","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Latitude":"34.022924","map":"<A HREF = \"http://maps.google.com/maps?q=34.022924,+-85.999779(24029)&iwloc=A&hl=en\"> mufon case (24029) map </A>"}