{"Sighting Duration":"Undisclosed","City":"Macks Inn Post Office","Region":"Idaho","divs":["Sighting DetailsMy sister and I were sitting around the firepit of my family's cabin, facing east. The sun had just gone down and the stars began to appear. I had been watching the sky all week, hoping to see the stars without major light pollution. I noticed, and pointed out to my sister, a very bright light slowly travelling north, maybe 2000 ft agl. Me being an aircraft mechanic and student pilot, was very puzzled. Why aren't are there any nav lights or a rotating beacon? Absolutely no sound what so ever. While explaining to my sister what we should be seeing (red and white nav lights, a rotating beacon and possibly strobes) the light turned east and flew away from us disappearing amongst the treetops. The intensity of the light never diminished, even when clearly flying away from us. My sister and I talked about what we had just witnessed. Minutes later I was able to show her 2 examples of what we should have seen. An aircraft travelling south-southwest rumbled past overhead.. We could clearly see all three nav lights and hear the drone of the prop. Even as it flew past we were able to see and hear a jet at altitude. We could clearly see the contrails and nav lights in the twilight. The next night my mom and my son accompanied me around the fire. I was explaining to my mom what my sister and I had seen the night before. Again I was able to show her an airplane flying across the night sky. Showing her the correct lights and sounds. Almost immediately we observed an indentical bright light travelling the same directions(north gently turning east)fly past. The light took the same flight path as the night before. No extra lights and no sound, just an intense light clearly under intelligent control. I reached for my digital camera and set it to movie mode, of course the batteries were dead from the numerous picture i had taken on vacation. Oh well.. We know what we saw!!"],"Tags":"City","Longitude":"-111.690797","Log Number":"US-06302010-0001","Country":"United States","Date Submitted":"06/30/2010 01:10 UTC","Source":"MUFON","Latitude":"44.335817","map":"<A HREF = \"http://maps.google.com/maps?q=44.335817,+-111.690797(24034)&iwloc=A&hl=en\"> mufon case (24034) map </A>","Summary":"Bright white light makes a right turn.","Object Features":"Unknown","Weather Factors":"Light","Disposition":"IFO","trends":["There have been no other sightings in Macks Inn Post Office","This sighting has never been favorited."],"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/24034.html.txt","/var/www/straped/mufon/org/24034.html"],"Case Number":"24034","Object Flight Path":"Path with directional change","Date of the Event":"06/25/2010 10:00 UTC","Viewing Distance":"501 Feet - 1 Mile"}