{"Longitude":"-87.518912","Disposition":"Unknown","Date of the Event":"06/29/2010 10:00 UTC","Region":"Indiana","Date Submitted":"06/30/2010 09:42 UTC","Sighting Duration":"Undisclosed","City":"Vincennes","divs":["Sighting DetailsI was at home one evening and thought I would step outside to check and see if everything was okay, I've seen a number of these triangles so I am pretty paranoid but curious. I looked to the east and saw what looked like a star low in the sky, it appeared to change colors from orange to red, and was slow moving. There were commercial jets in the area, but none of them could be seen unless they had blinking lights. I went inside and got our telescope and and camera tried to observe it the best I could. I could see two white lights (not flashing) on the front end of it, and a blue light (not flashing) on the corners (not the front corner) and a white flashing light on the bottom towards the rear, as it past, I estimated it to be travelling at around 50 mph and at an altitude of 500 feet. It made no sound whatsoever. The rear had yellow-gold pulsating lights. The object looked triangular, and I estimated it to be about half the size of a football field, its motion was from east-northeast to west-southwest. I attempted to take a picture of it but the object did not show up in the photo. I did get a little nervous, but like I said, I have seen these things before, this is the 6th time, so I was'nt scared. I lost sight of the object as it went behind a ridge with trees."],"Source":"MUFON","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around June 29th 2010"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=38.679589,+-87.518912(24038)&iwloc=A&hl=en\"> mufon case (24038) map </A>","Summary":"Blue and white and gold lights (some flashing) in triangle formation.","Object Shape":"Triangle","Country":"United States","Latitude":"38.679589","Case Number":"24038","Log Number":"US-06302010-0005","Object Features":"Patterned Surface","Viewing Distance":"101-500 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/24038.html.txt","/var/www/straped/mufon/org/24038.html"],"Weather Factors":"None"}