{"Disposition":"Hoax","Object Features":"Undisclosed","Object Shape":"Oval","Country":"United States","Source":"MUFON","Date of the Event":"06/15/1977 12:00 UTC","Summary":"This description is a series of stories that interconnect.","Log Number":"US-06292010-0011","Case Number":"24030","divs":["Sighting DetailsAround 1975, the music group ABBA daybued, singing their hit song \"Take a Chance on Me.\" They presented themselves as a religious group that worshipped Aliens. I believe the music group was from Switzerland or Sweden. The Alien species was also called ABBA. This religious cult, however, was based in Germany. They claimed that all you had to do was have your television on and call their name three times (ABBA, ABBA, ABBA) and they would come to you. You would know of their arrival simply by listening to your radio. Something wierd did happen. In 1977, the CIA told the music group that if in fact they were as legitimate as others had claimed, then produce an alien spacecraft. Thirty days later, a fully functional, fully equipped spacecraft landed in West Virginia. There was no one aboard. The local residents called it in to CIA headquarters, Langly Virginia. My Unlce was a command Sergeant major in the Air Force, stationed at Hampton's Air Force Base. The time was about 03:30-04:30 hhrs when he recieved the called. I was visiting in Virginia with him and my causins when my uncle awakened me and asked if I wanted to see a real spaceship. I asked him if we were going to the sight? He said no; we were going to the hanger where they were going to keep it. The craft came in not at Hampton's Air Force Base but Hampton's Army post. It was brought in peacies on flat bed trucks. I ask one of the drivers where is it and what was he carrying? He said it was the spacecraft brought in parts. Later, I was taken to hanger 18 of some area on hampton's Army post. There, a crew began assembling the craft. Another crew began testing the craft's computor parts, eletronics, et cetera. Before I left, it looked like it could be a spaceship. I believe later that summer (or perhaps during the Christmas holidays), my uncle brought me back to hanger 18, and took me on a few trips with him to Langly. The craft looked something like the starship Voyager (at least the saucer section). His unit was assign to langly Virginia as computor programmers, hackers, et cetera. The CIA would call for them whenever they could not figer out how to operate any of the spaceship's computer components. Less than a year later, the Air Force put out a moive called \"Hanger 8\" to throw off people. The moive was a fake, all with the exception of one Scene. I have also learned that if you really would like to get to the bottom of all this UFO crap, all you need to do is ask your friendly local Australian Aborigine. They calim to decend from aliens and can show you neat things. They have convinced me. There is a lot more to this story (e.g., ABBA's, Oracles, Voo Doo Priestesses, and even communism, as indicated in the moive \"Close Encounters,\" the first series). Apparently, it is all the same thing -- so called gifts given long ago from aliens, most of which I now believe. If you really would like to know more, you can call me at home. If not, then stop this fraudulent claim of UFO interest groups and alien hunters... please! An African American Tale Brian"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 8 other sightings in Hampton","There were no other sightings in Hampton on or around June 15th 1977"],"Weather Factors":"Unknown","Tags":"City","Region":"Virginia","Sighting Duration":"Undisclosed","Longitude":"-76.345222","Latitude":"37.029869","files":["/var/www/straped/mufon/html2text/24030.html.txt","/var/www/straped/mufon/org/24030.html"],"City":"Hampton","map":"<A HREF = \"http://maps.google.com/maps?q=37.029869,+-76.345222(24030)&iwloc=A&hl=en\"> mufon case (24030) map </A>","Date Submitted":"06/29/2010 05:26 UTC"}