{"City":"Undisclosed","files":["/var/www/straped/mufon/html2text/24031.html.txt","/var/www/straped/mufon/org/24031.html"],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Summary":"Red lights that moved quickly into row formation off Wrightsville Beach.","Disposition":"IFO","Source":"MUFON","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.763013,+-79.01716(24031)&iwloc=A&hl=en\"> mufon case (24031) map </A>","Sighting Duration":"Undisclosed","trends":[],"Longitude":"-79.01716","Country":"United States","Log Number":"US-06292010-0012","Date Submitted":"06/29/2010 05:42 UTC","Viewing Distance":"Unknown","Latitude":"35.763013","Object Features":"Undisclosed","Case Number":"24031","Date of the Event":"06/22/2010 12:00 UTC","Object Shape":"Bullet, Missile","divs":["Sighting DetailsMy husband just called me on the phone because he heard that someone else reported what we saw on Wrightsville beach last Tuesday night. We were both shocked--and I wanted to offer our support to collaborate the description that I just read online of the incident. My husband and I were staying at Cordgrass Bay on Wrightsville Beach with other family members. After our kids went to bed (sometime after 9), we went for a walk on the beach. We headed south, toward the pier. We were about halfway to the pier when some VERY strange lights appeared out over the ocean. A red light would go very fast (I mean REALLY fast) horizontally over the ocean, and then just dissappear. There was a group of some other people also walking on the beach in the surf, and they also stopped and watched the light. After a while, my husband and I said maybe it was military, so we kept walking. But the strangest lights happened about ten minutes later. A red light shot across the sky, divided into multiple lights that went really fast and abruptly stopped in the air and hovered in a formation. They they abruptly disappeard. It was very, very strange. I have never seen anything like it. We also saw the two fighter jets about 10-15 minutes later. We just assumed that the lights had something to do with them, but again, the lights did not act like normal missiles. I don't know how to explain them."],"Tags":"City"}