{"map":"<A HREF = \"http://maps.google.com/maps?q=29.764873,+-95.36836(24037)&iwloc=A&hl=en\"> mufon case (24037) map </A>","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","City":"Houston","Date of the Event":"10/15/1969 11:30 UTC","Latitude":"29.764873","Summary":"Single to multiple sightings","Case Number":"24037","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around October 15th 1969"],"Source":"MUFON","Sighting Duration":"02:00:00","Disposition":"Insufficient Data","Longitude":"-95.36836","Region":"Texas","files":["/var/www/straped/mufon/html2text/24037.html.txt","/var/www/straped/mufon/org/24037.html"],"Log Number":"US-06302010-0004","Date Submitted":"06/30/2010 09:23 UTC","divs":["Sighting DetailsThis event happened in 1969 when I was 16 years old. I was living in the Southeast side of Houston, Texas. The nights were much darker back then and the city lights were not as much of an issue as they are now. I have always been interested in UFO's and our family would spend many hours looking for satellites on clear nights. I am not sure of the date when this occurred but I think that it was in the early fall. I was in my front yard just looking around trying to find a satellite when I noticed one coming up from the Northern horizon. It was moving at a constant rate and was about as bright as a bright star. I thought it was cool and continued watching it. To my surprise, when it was directly above me, it stopped. I tried to continue watching it but my neck finally got tired and I looked away. It was so clear that night that when I looked back up I wasn't sure exactly which star it was. At this time, a friend of mine who lived across the street from me came over to visit. I told him what I had seen and he became very interested and decided to hang out with me. We continued watching around the sky looking for anything else. We occasionally looked up to see if the one that stopped was still there. The next thing that we saw came up from the opposite horizon about 30 minutes after the first one and it could have actually been a satellite since it passed directly overhead and continued until we could no longer see it. It looked identical to the first one. Then the big event occurred. About 45 minutes to an hour after the second satellite disappeared and from the same spot that it disappeared from, we saw four of them come up from the horizon. They were all exactly the same size and brightness. While they were moving toward the sky directly above us, they were doing tricks like flying circles around each other, they would fly apart and then zoom back together, one or two would stop and let the others go ahead and then they would instantly catch up with them. The next thing that happened let us know that the first one that I had seen a couple of hours ago was actually still there. As the group of four reached the sky directly above us, a fifth one joined them and moved off with them. It was like they were picking the first one up on the way somewhere. All five of them were kind of playing around as they flew off and finally disappeared. I have always wished that I had a telescope back then so that I might have been able to focus in on the one that was directly above me for a couple of hours. I am not sure what they were doing but I have always thought that they had been stationed around the country or Earth at the locations of big cities to observe. Although I have never had anything like this happen again, I have seen many satellites over the years. At least I think that they were satellites. Thank you."],"Object Shape":"Star-like","Object Features":"Unknown","Tags":"City"}