{"Log Number":"US-06302010-0006","files":["/var/www/straped/mufon/html2text/24039.html.txt","/var/www/straped/mufon/org/24039.html"],"Object Features":"Window(s)","Viewing Distance":"101-500 Feet","Longitude":"-87.527122","Object Shape":"Triangle","Country":"United States","Disposition":"Unknown","Region":"Indiana","divs":["Sighting DetailsOn January 4, 2000 at about 11 pm, my dad and I were heading to Vincennes for a boy scout meeting. As we were driving on highway 41 northbound, we could see a bright white light in the distance over the highway. As we got closer, we could begin to see a triangular shape to it. The sky was cloudy and it was nighttime, so the lights from Vincennes were shinning up onto the clouds and made them look tan-brown, but the UFO was about a mile south of Vincennes, and we were able to clearly see an actual triangular shape, it appeared to be either black or dark grey. The rear had 3 very bright white lights flashing from left to right and a panel of dimmer white lights that were pulsating on and off. We could see a white light at each of the 3 corners and a red flashing light more towards the rear not exactly in the center. The sides had, what I took, were circular windows with a bright white light inside the craft. When we drove direcly beneath it, there was no sound that we could hear, and definetely no thrust at all. I've been to over 10 airshows in my life, and have witnessed the vertical take off and landing \"Harrier\" which is very loud. We got to where we were going ( I do not remember exactly where) and we got out of the car, and we saw the object move very slowly over us (around 15 or 20 mph) and was about 500 feet in the air, then it banked to the right, stopped, and then accelerated off to the northwest at over 100 mph, and disappeared behind the trees and off into Illinois, without making a sound. I assume this was most likely the same object seen over southern Illinois early on January 5, 2000."],"Tags":"City","City":"Vincennes","Date Submitted":"06/30/2010 10:14 UTC","Object Flight Path":"Hovering then path","Source":"MUFON","Sighting Duration":"00:05:00","Weather Factors":"None","Summary":"Black triangle hovering over highway.","Latitude":"38.685839","map":"<A HREF = \"http://maps.google.com/maps?q=38.685839,+-87.527122(24039)&iwloc=A&hl=en\"> mufon case (24039) map </A>","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around January 4th 2000"],"Date of the Event":"01/04/2000 11:00 UTC","Case Number":"24039"}