{"Source":"MUFON","Region":"Minnesota","divs":["Sighting Details Bob and I were driving in my car home to Babbitt,after working in Ely-going slightly southwest on Hwy.21,a wooded road with alot of wildlife to be on the watch for..it was about 904 pm,the sun was still very well up and it was bright-I happened to glance up over the treeline,as I often do,and to the East-northeast saw what appeared at first to be a large jet airliner.What caught my attention was its size,shape,and colorbrightness.It was a flattened rectangle,like a cigar box viewed from the side,and VERY bright and reflective,not at all the dull aluminum tone of a plane.It was much too large to be a small plane,and it was hovering in place.We both were struck by the reflective nature of the craft,and its flight path-watched it for several minutes and slowed our own progress down alot on the road in order to get a betttter look-I was sayingdo you think we are seeing a UFO here,or is this something explainable We felt curious,but calm,not frightened.Tried to disceern if it was an old bi-plane,because of that rectangular appearance-but this thing was large,and truly hovering.Just when I told Bob to pull over so I could find my binoculars beneath the front seat,the thing shot off and out of view,toward the NE,gone in an instant-we both mentioned the feeling that it somehowknewwe were trying to get a closer look,because of how it dissapeared immediately upon my reaching for binoculars.It was gone,and we drove the rest of the way homeits a 14 mile trip from ely to babbitt-this happened about 8 mi.out of elyfeeling calm and even tired,didnt talk much.My 18 yr old daughter then reported seeing something very similar several days later,to me,which made me wonder all the more just what was this bright,reflective and hovering object-from what we could tell it must have easily been about the size of two 747s laid end to end."],"files":["/var/www/straped/mufon/html2text/2403.html.txt","/var/www/straped/mufon/org/2403.html"],"Summary":"A bright,platinum-colored rectangular object.","Case Number":"2403","Log Number":"","Longitude":"-91.94945","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=47.714537,+-91.94945(2403)&iwloc=A&hl=en\"> mufon case (2403) map </A>","Latitude":"47.714537","Object Features":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unknown","Object Shape":"Square, Rectagular","City":"Babbitt","trends":["There have been no other sightings in Babbitt","This sighting has never been favorited."],"Country":"United States","Object Flight Path":"Unknown","Date of the Event":"06/16/2003 09:04 UTC","Tags":"City","Date Submitted":"06/16/2003 09:04 UTC","Viewing Distance":"Over One Mile"}