{"Weather Factors":"None","divs":["Sighting DetailsI had just gotten new glasses that day and was sitting out on my deck and my wife was out in the yard with our dogs and enjoying the evening. I looked up and watching the stars when an especially bright star moved in a zigzag pattern. Thinking it way my eyes playing tricks on me, I called to my wife and had her watch the same star. She verified that it was indeed moving in a very erratic pattern. We continued to watch and this object would move rapidly in a northerly direction, stop, make a 90 degree turn and speed away, only to stop, then move at a very rapid rate again. It raced across the sky then perform a V pattern, then it would stop and be stationary for a few minutes then start the erratic movements again. This object started at about 70 degrees off the horizon and continued to rise during the time watched. I watched this off and on until 4:00 AM at which time it had climbed to being approximately 95 degrees off the horizon. I contacted friends here in the area who also watched this object for a time and saw the same thing I did. I also have a friend who lives approximately 200 miles to the east of me who is also a night owl and I contacted her via FaceBook and told her what I was seeing. At that time she went outside and saw the same object at the very same position in the sky and performing just as I described to her. I notified the police, who sent an officer to my address. He observed the object and it's movement. I am 62 years old and have never witnessed anything like this in my life, but rest assured I will be watching the skies more closely from this point forward. I do not have any video nor pictures of this incident as nothing I own for a camera is unable to take pictures in the dark. I do know what I saw and swear this to be true. The last time I saw the object was at approximately 4:00 AM just prior to going to bed.."],"Date of the Event":"06/29/2010 09:30 UTC","files":["/var/www/straped/mufon/html2text/24048.html.txt","/var/www/straped/mufon/org/24048.html"],"Source":"MUFON","Longitude":"-93.603436","Country":"United States","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Features":"Unknown","Latitude":"41.609545","Object Shape":"Unknown","Summary":"It was high enough it looked like a bright star.","Date Submitted":"06/30/2010 03:00 UTC","Case Number":"24048","Viewing Distance":"Unknown","Log Number":"US-06302010-0015","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=41.609545,+-93.603436(24048)&iwloc=A&hl=en\"> mufon case (24048) map </A>","Region":"Iowa","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around June 29th 2010"],"Tags":"City","City":"Des Moines"}