{"Log Number":"US-06302010-0009","Date of the Event":"06/27/2010 11:00 UTC","City":"Sandy","Tags":"City","Object Flight Path":"Path with directional change","Source":"MUFON","Object Shape":"Circle, Oval","Case Number":"24042","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Features":"Unknown","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around June 27th 2010"],"Latitude":"40.57634","Disposition":"Unknown","divs":["Sighting DetailsThis is the second time I have seen the same UFOs. The first time was in late May. Both events happened on a Sunday around 11:30 AM. I was getting in my car to take my brother to work when I saw a bright object in the sky. Since this was my second event I immediately stopped and looked and knew what I was looking at. I yelled for my brother and he came to see. He also saw the object. After a few minutes of it moving around in the sky we lost track of it. So we got in the car and started to drive when within 10 seconds I looked up and saw a group of weird objects (that looked exactly like the ones I saw in May) and said \"what are those?\" I almost instantly pull the car over and get out. My brother and I both get out and stare at them flying overhead. They seemed to be high up but it was hard to tell. As they moved they were moving around each other in a very elegant way. Then as they moved on further they started doing formations. One was a perfect \"Z\" shape formation. From that they went into a perfect line and moved off out of our view. The UFOs that were in a cluster were not bright like the first object I saw, but had kind of a darker color to them and the air around them looked distorted somehow. Though from there movements and such, to me it seems like the bright object I saw is the same as the cluster of objects I saw. My dad was in the air force and I have been around aviation my entire life. I do look up in the sky a lot. I have flown on airplanes since I was a kid and have been to many many airports. I know how to eliminate the possibilities. I know what I saw is unexplainable and is quite obvious a secret on the highest level. It was either humans in the craft or some other species. Anyway you look at it the lies are going so deep that it DOES affect to the core every man woman and child on this planet. I like to go with my gut, and my gut is telling me that if humans were in these craft then we wouldn't be seeing them because they would want to keep it secret and deny that they even exist."],"Date Submitted":"06/30/2010 11:33 UTC","files":["/var/www/straped/mufon/html2text/24042.html.txt","/var/www/straped/mufon/org/24042.html"],"Country":"United States","Summary":"I was getting ready to take my brother to work and was putting my daughter in the car. I saw a bright object in the sky. A few minutes later my brother came outside and thats when we both saw a cluster of about 10 UFOs doing many different formations.","Region":"Utah","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.57634,+-111.850192(24042)&iwloc=A&hl=en\"> mufon case (24042) map </A>","Sighting Duration":"Undisclosed","Longitude":"-111.850192"}