{"Date Submitted":"06/30/2010 01:23 UTC","Object Features":"Unknown","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"06/30/2010 12:00 UTC","Summary":"Sound only!","Latitude":"41.438838","Region":"Nebraska","Country":"United States","Disposition":"Unknown","Case Number":"24046","Object Flight Path":"Unknown","Log Number":"US-06302010-0013","trends":["There have been 3 other sightings in Columbus","There were no other sightings in Columbus on or around June 30th 2010"],"files":["/var/www/straped/mufon/html2text/24046.html.txt","/var/www/straped/mufon/org/24046.html"],"Source":"MUFON","City":"Columbus","map":"<A HREF = \"http://maps.google.com/maps?q=41.438838,+-97.357011(24046)&iwloc=A&hl=en\"> mufon case (24046) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was hoeing in the garden when this sound came from the sky to the west but high. At first it sounded as if it was a jet engine possibly in distress. So I tried to find it. It was a wobbly heavy vibrating sound that incereased until as it was straight overheaed it got so loud it was as if my head was in a metal five gallon bucket and there were huge sterio speakers either side making the noise. That is how loud and how echoy AND UNCOMFORTABLE it was. My head and ears were actually vibrating very hard to it. You could feel it in the ground through your feet and in your body. I tried to cover the sun with one then both hands but still could not see the source at all. THE DOG VANISHED that had been there a moment ago. He was under the barbque when I went in. As it moved to the east souteast it waned till it was finally gone. There were no trails in the sky. The whole episode only lasted for about twenty seconds or less. It was really odd and extreamly loud. Whatever was making that noise was fast and hummed with a warble. The actual sound was like standing beside a huge machine that was vibrating ready to explode! I came in and got on the laptop right away to do this report, and as I sit here now my ears are ringing. I asked my wife who has far better hearing that me if she heard it. She was sitting in the farmhouse watching TV and did not hear a THING."],"Weather Factors":"None","Longitude":"-97.357011","Object Shape":"Unknown"}