{"Date of the Event":"04/03/2010 11:00 UTC","Tags":"City","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around April 3rd 2010"],"Region":"Indiana","City":"Vincennes","Object Flight Path":"Path with directional change","Log Number":"US-06302010-0023","divs":["Sighting DetailsAt around 11 pm on April 3, 2010 I stepped outside to get some air, and I looked to the south and noticed a orange orb like light near the horizon. I ran inside and grabbed my cell phone and the digital camera, and came back outside, and saw that it was gone. So I waited for about 3 minutes, and it reappeared to the south-southwest as an orange orb, then it disappeared again, but just shortly after, reappeared, this time much closer. I watched it get closer, less than a mile now, as the orange light dimmed and I started to see three white lights in a small triangular formation with a red blinking light in the center, when it was directly over me, I could just barely make out an actual shape to the object (triangle), and this time, I could actually hear a low decible humming sound, though very faint, when the object started to move away from me in a northerly direction, I did not notice any other lights on it, none on the rear, I attempted to take a picture, but it did not show up. I got on my cell phone and called 911 and let them know that a strange light in the sky was headed towards Vincennes."],"Summary":"My 3rd triangle UFO.","Object Features":"Unknown","Date Submitted":"06/30/2010 07:30 UTC","files":["/var/www/straped/mufon/html2text/24056.html.txt","/var/www/straped/mufon/org/24056.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.681509,+-87.527402(24056)&iwloc=A&hl=en\"> mufon case (24056) map </A>","Source":"MUFON","Country":"United States","Disposition":"Unknown","Viewing Distance":"Unknown","Object Shape":"Triangle","Case Number":"24056","Latitude":"38.681509","Weather Factors":"None","Sighting Duration":"00:10:00","Longitude":"-87.527402"}