{"Date Submitted":"06/30/2010 09:23 UTC","Tags":"City","Date of the Event":"05/11/2009 04:45 UTC","Longitude":"-80.800154","Country":"United States","Case Number":"24059","map":"<A HREF = \"http://maps.google.com/maps?q=28.619549,+-80.800154(24059)&iwloc=A&hl=en\"> mufon case (24059) map </A>","Object Features":"Appendage(s)","Source":"MUFON","divs":["Sighting DetailsI didn't know it at the time I took this photo, but there was a disk shaped object just above the treetops as I was driving, as I returned from watching the Space Shuttle Atlantis launch from my vantage point in Titusville. The launch occurred May 11, 2009 at 11:44 A.M. I had never been there before, so my companion and I wandered around the Titusville area for several hours in the shuttle traffic. Finally, it was getting late and I meandered to find a highway which would take us back to the Orlando area. I have no idea where I took the shot, except to say I had been working my way westward in the Titusville area, and in an area totally foreign to me, followed my instincts and managed to find my way, somehow. The strange object captured in pixels was positioned at tree level and was not opaque, but rather kind of transparent, with a bluish color, which was most intense around the edges. The view of the trees which seemed to be directly behind the object seem distorted, as if the object affected my view of the trees. I have never heard of such an observation, and am wondering if there are records of this type of phenomenon."],"Object Shape":"Disc","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","City":"Titusville","files":["/var/www/straped/mufon/html2text/24059.html.txt","/var/www/straped/mufon/org/24059.html"],"Object Flight Path":"Stationary","Summary":"I discovered a strange disk shaped anomaly in a 14 month old photo.","Sighting Duration":"Undisclosed","Region":"Florida","Log Number":"US-06302010-0026","trends":["There have been 9 other sightings in Titusville","There were no other sightings in Titusville on or around May 11th 2009","This sighting has never been favorited.",""],"Latitude":"28.619549"}