{"Source":"MUFON","Object Shape":"Triangle, Unknown","divs":["Sighting DetailsAt approximately 11:30 PM Eastern time on November 20, 2009 near Vincennes, IN, I stepped outside to get some fresh air, I decided to go pet our cats, and I looked to the southeast and noticed what appeared to be an orange orb off in the distance, so I my curiousity caused me to keep my eyes on it, but as it approached slowly, the orange orb like light dimmed, and a bright white spot light came on, and was shinning on the ground, I ran inside and grabbed our telescope to see if I could make out any details. As I came back out, it was really close, less than a mile away, it appeared to be anywhere from 500-1,000 feet above the ground and moving at about 50 to 100 mph. I set up the telescope and was able to find it (it is very difficult to follow moving objects in telescopes), I could see three white lights (not flashing) in a triangle formation, and a red blinking light between the center and rear. But then it started make strange manauvers, it appeared to bank to the right and actually roll completely upside down and then roll back over (did not make a 100% roll manauver). I'm not sure how many times it did this, but it was alot. It also decended 50 or 100 feet several times and then ascend back to the altitude it was at, almost in the blink of an eye. There was no sound at all, even though it was almost directly overhead, it banked over to the left and the back to the right and continued northbound in a straight bath towards Vincennes. I ran inside to grab my camera but when I came back outside, it was gone. I did strongly think it might have been an aircraft having problems, but considering how it decended and ascended almost instantly, gives me very little doubt it was any aircraft that I know of."],"Summary":"Triangle UFO (possibly damaged).","Case Number":"24055","Weather Factors":"None","Sighting Duration":"00:10:00","Longitude":"-87.527162","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around November 20th 2009"],"Date of the Event":"11/20/2009 11:30 UTC","Region":"Indiana","Object Flight Path":"Path with directional change","Tags":"City","Disposition":"Unknown","Log Number":"US-06302010-0022","map":"<A HREF = \"http://maps.google.com/maps?q=38.679739,+-87.527162(24055)&iwloc=A&hl=en\"> mufon case (24055) map </A>","files":["/var/www/straped/mufon/html2text/24055.html.txt","/var/www/straped/mufon/org/24055.html"],"Latitude":"38.679739","Country":"United States","Object Features":"Unknown","Viewing Distance":"Unknown","City":"Vincennes","Date Submitted":"06/30/2010 06:52 UTC"}