{"Sighting Duration":"00:05:00","Country":"United States","Object Shape":"Cigar, Teardrop","Object Features":"None","Disposition":"IFO","Region":"California","Object Flight Path":"Straight-line path","Log Number":"US-06302010-0018","Weather Factors":"None","Latitude":"33.957469","trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around June 29th 2010"],"Date Submitted":"06/30/2010 04:45 UTC","Summary":"At about 1:30 pm pst I took my normal position on top of the hill and began to eat my lunch. I noticed a silver metallic object in the sky traveling from east to west.","files":["/var/www/straped/mufon/html2text/24051.html.txt","/var/www/straped/mufon/org/24051.html"],"Case Number":"24051","map":"<A HREF = \"http://maps.google.com/maps?q=33.957469,+-117.392856(24051)&iwloc=A&hl=en\"> mufon case (24051) map </A>","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-117.392856","Date of the Event":"06/29/2010 01:45 UTC","City":"Riverside","Source":"MUFON","divs":["sighting detailsi was just on my lunch break from work when i witnessed an object in the sky over riverside, ca that i have no explanation for. as i sometimes do, i parked my vehicle on a hill here in grand terrace that overlooks the railroad line that runs from riverside to colton. as most of you already know, i am a huge train geek, and during my lunch i sometimes either walk to this vantage point, or dive, so that i can watch trains go by while i eat. at about 1:30 pm pst i took my normal position on top of the hill and began to eat my lunch. while i was sitting there thinking about some of my recent interactions with fans and fellow authors about the now controversial dvd release of \"destroy all planets\", i noticed a silver metallic object in the sky traveling from east to west. as the object passed by, i noticed that it seemed to reflect the sunlight and i didn't notice any wings. i thought that this was an odd angle to view an airplane, which is what i assumed it was. i also noted that i hadn't ever seen a plane at this low altitude in this area of the sky before. upon further investigation, i also noticed that this, 'plane', didn't seem to have a tail fin. it looked about the same size a commercial jet, oval in shape, larger in the front tapering towards the tail. as the object traveled to about 3\\4 of the way across my point of view it simply vanished. now when i say vanished, i mean it disappeared, slowly, like someone turned it off. i sat in place for another ten minutes surveying the sky for the object and could not locate it anywhere in the heavens. the sky is bit hazy today, but there are no clouds, or anything else for that matter, for this object to have flown into. it just disappeared right in front of my eyes. in my estimation, the objects flight path would have been directly over riverside."]}