{"Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/2405.html.txt","/var/www/straped/mufon/org/2405.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.108345,+-117.289765(2405)&iwloc=A&hl=en\"> mufon case (2405) map </A>","trends":["There have been 17 other sightings in San Bernardino","There were no other sightings in San Bernardino on or around February 20th 1998"],"Date Submitted":"02/20/1998 04:02 UTC","Latitude":"34.108345","Source":"MUFON","Region":"California","Case Number":"2405","Country":"United States","Date of the Event":"02/20/1998 04:02 UTC","Sighting Duration":"00:05:00","Longitude":"-117.289765","Object Features":"Other","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change,Unknown","Weather Factors":"Unknown","City":"San Bernardino","Disposition":"IFO","Summary":"My 1998 UFO observation","divs":["Sighting DetailsI was going south bound on Medical Center Drive in San Bernardino, CA on my wayto band rehearsal when I noticed to off to my left a shiny metallic object.The irony leading to this event is that I had spent two years studding thissubject do to the reason that I had very memorable experience at the age oftwelve which would fall under the category of an encounter of the second kind.Anyway, as an added note, this was an extremely clear day, I mean you could readthe licenses off an airplane if you know what I mean. Honestly, I had beenpreparing myself for this so I was pretty calculated in recording the event.It was 402 p. m on February 1998, I observed a shiny metallic craft proceedingin a NE direction, from which time I had pulled into the middle turning lane inorder to track the craft more accurately. Almost immediately after this time thecraft became obscured in the trees, so I turned east in order not to lose sitethe craft. I came to the end of the street to find the craft had made a rightangle turn and headed back in a southern direction and It had slowed down andstarted to just putt around.This lasted to 404 and 50 seconds and then it went up at a 35 degree angle anddisappeared. The craft was oval shaped with a red beacon type light on top. Themost amusing part of this sighting was thiswas one the most clearest days I canremember and there was plenty of people outside walking around but no one waslooking up, and this thing was only about a 800 to 1000 feet up...amazing"],"Tags":"City","Log Number":""}