{"Country":"United States","Longitude":"-90.182436","trends":["There have been 2 other sightings in Alton","There were no other sightings in Alton on or around June 29th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.892254,+-90.182436(24058)&iwloc=A&hl=en\"> mufon case (24058) map </A>","Object Shape":"Circle, Star-like, Other","Object Features":"None","Disposition":"Unknown","Latitude":"38.892254","divs":["Sighting DetailsI was sitting out in my backyard last night (June 29th, 2010) looking up at the sky and around 10:14 pm when I noticed a light in the south east sky that came out of no where, the odd thing was that you could not see the light until it started getting brighter and brighter after it reached a bright illumination it would gradually fade back out to the point that you could no longer see it. Then about 45 to 120 seconds it reapeared in the exact same way, but this time it had moved what I would say was about 50 feet down and slightly left. After it faded out the second time it reappeared once again in the same way but this time it had moved upward and to the right and had traveled an even farther distance than the first time (you could not see the object move at all), then it proceeded to fade out yet again. Then it appeared again this time almost straight down what seemed about 40 to 50 feet. It continued to keep this up for 6 to 7 times each time it would relocate continuing to have moved a large distance with no set time between each appearance. After 6 or 7 times I never saw it again."],"Tags":"City","Date of the Event":"06/29/2010 10:17 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:12:00","Case Number":"24058","Date Submitted":"06/30/2010 09:07 UTC","Object Flight Path":"Stationary","Summary":"Evolving light that you could not see, it would get brighter and brighter when it reached a certain point it would fade out to nothing, then did the same but had moved and did this about 6 times.","Weather Factors":"None","Source":"MUFON","City":"Alton","files":["/var/www/straped/mufon/html2text/24058.html.txt","/var/www/straped/mufon/org/24058.html"],"Log Number":"US-06302010-0025","Region":"Illinois"}