{"Source":"MUFON","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Log Number":"US-06302010-0021","Tags":"City","Object Features":"Unknown","Summary":"18 glittering red ovals/circles rising from horizon about 2 minutes apart, usually 2 about 20 seconds apart.","files":["/var/www/straped/mufon/html2text/24054.html.txt","/var/www/straped/mufon/org/24054.html"],"Latitude":"43.427308","trends":["There have been 3 other sightings in West Bend","There were no other sightings in West Bend on or around June 26th 2010"],"Region":"Wisconsin","Sighting Duration":"Undisclosed","City":"West Bend","Disposition":"Unknown","divs":["sighting detailsstanding on our pier on little cedar lake just looking at the stars, we were looking north and saw a glittery red oval\\circle rise above the tree line, we thought it was a plane but there was no sound, within about 20 seconds a second one rose up behind it. they slowly rose and went west up into the sky towards a large black cloud and could not see anymore due to it being too far away. we watched and ended up seeing at least 18 of these over the coarse of 20 minutes prior to going into the house (there could have been more but the mosquitos were getting too bad) like i said we intially thought these were planes but there ended up being too many of them and it was silent. we would see one rise and then another would shortly follow and they would all follow the same path of floating up into the sky while going west. there seemed to be about a minute and half wait before we would see the next one rise and then one follow in about 20-30 seconds. they all looked alike. there is no airport in the area and then we considered if they could have been some sort of weather balloon. there were 6 of us tht witnessed this and none of us have ever seen anything like it. they all seemed to have the same pattern and float up and rise very controlled and at the same speed. we were all excited by it and also baffled since we could not figure out what this could be and are unsure who to ask."],"Country":"United States","Longitude":"-88.181088","Case Number":"24054","Date of the Event":"06/26/2010 10:10 UTC","Weather Factors":"Unknown","Object Shape":"Oval, Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.427308,+-88.181088(24054)&iwloc=A&hl=en\"> mufon case (24054) map </A>","Date Submitted":"06/30/2010 06:47 UTC"}