{"Object Flight Path":"Stationary,Straight-line path","Latitude":"42.662846","Country":"United States","Object Features":"Unknown","Tags":"City","Case Number":"24069","Sighting Duration":"Undisclosed","Log Number":"US-07012010-0006","Region":"Michigan","Date Submitted":"07/01/2010 12:44 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.662846,+-83.145542(24069)&iwloc=A&hl=en\"> mufon case (24069) map </A>","Summary":"Bright gold white.","trends":["There have been 10 other sightings in Rochester Hills","There were no other sightings in Rochester Hills on or around June 30th 2010"],"divs":["Sighting DetailsWe were going to the local fireworks. As we were walking south, to the south east, we noticed golden glowing object. It was rather stationary at first, as we watched a plane fly past it just to the west. At first we though it was a planet, then it moved, and became stationary again. There was a helicopter in the air, flying over n around watching the traffic, yet the object was higher then the heli. Both the plane and the helicopter were heard, plane faintly due to the crowds, heli more audible. Though the light let out no sound what so ever. We all were joking with each other that the aliens might be intrested in the fireworks, but after a couple of mins, we were more intrigued in the object then humored. This was not a natural light, and we kick ourselves for not bringing a camera. We had to peel our eyes from the sky, and find a place to sit in the madness of all the crowds. By the time we found a spot, the object was gone. The Heli was still in the area, plane had traveled off into the distance, and the sky was back to its normal self."],"files":["/var/www/straped/mufon/html2text/24069.html.txt","/var/www/straped/mufon/org/24069.html"],"Disposition":"Unknown","Date of the Event":"06/30/2010 09:30 UTC","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-83.145542","City":"Rochester Hills","Weather Factors":"Unknown"}