{"Tags":"City","Country":"United States","Date Submitted":"07/01/2010 03:52 UTC","Object Features":"None","Weather Factors":"None","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=43.16253,+-77.601042(24072)&iwloc=A&hl=en\"> mufon case (24072) map </A>","Object Shape":"Circle","divs":["sighting detailsmy friend *(initials deleted--sgonzalez\\cms)wanted to take me to this cool bar called marge's right on the beach in rochester ny. the bar is an old house, the size of the bar is about the size of a bedroom, but the real reason people go there is for the scene outside. its a very chill bar, where you can go to the backyard of the bar, grab a lawn chair and find a spot on the beach. up till that point, i have never been there but heard a lot about it, so we went. got some beers, and went straight to the back. we were sitting on the beach, and i was taking it all in. it was decently crowded but not packed. the night was beautiful, not a cloud in the sky, and the sun was almost going down. not only 5 minutes of being there that i put my head back, looked straight up and saw 2 circled ufo's fly right above me. they were side by side, and the right one looked like it was trying to go faster than the other (almost like 2 cars racing on the street). i looked over to *(initials deleted--sgonzalez\\cms) and was about to say something but before i could even get it out i decided not to say anything. they were gone, and i didnt know what to say. i could not believe what i saw. the flying objects appeared to be complete circles, same size, and their color was the actual color of the sky at the time which was a yellowish white. (almost like they had camouflage). when i realized they were gone, i looked around to see if anyone else noticed what i saw, but it looked like no one did. my heart was pounding, and i was trying to put together in my mind what just happened. i thought maybe they could have been stealths(ive never seen any fly) but they were going way to fast, and like i said, the right one seemed to be racing with the left one. i know this happened a year ago but i havent been able to stop thinking about it. the flying objects seemed to be on an actual route almost like they use it all the time. i now live in west hollywood, but i recently talked to one of my old co-workers (who i told about the incident before) and she told me that her friends were there one night just a few weeks ago, and both saw ufo's. she explained their experience not the same as mine, but they saw lights over the lake(lake ontario). i wish i didn't wait this long to report this, and i wish i went back to marge's before i moved out west, but i wish i could go back. because i swear, if you sit out there one night, someone might see the samething, i swear that the flying objects seemed like they were on a direct path (almost like they use it all the time). flying straight north right over lake ontario into canada."],"Date of the Event":"07/17/2009 07:00 UTC","Latitude":"43.16253","Region":"New York","Source":"MUFON","Summary":"2 UFOs flying straight over Lake Ontario (Almost looked like it was a route).","City":"Rochester","Object Flight Path":"Straight-line path","Longitude":"-77.601042","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around July 17th 2009"],"files":["/var/www/straped/mufon/html2text/24072.html.txt","/var/www/straped/mufon/org/24072.html"],"Sighting Duration":"Undisclosed","Case Number":"24072","Log Number":"US-07012010-0009","Viewing Distance":"501 Feet - 1 Mile"}