{"Region":"Washington","Object Shape":"Star-like","Source":"MUFON","Weather Factors":"Unknown","City":"Redmond","Longitude":"-122.121512","Log Number":"US-07022010-0001","Country":"United States","Case Number":"24079","Object Flight Path":"Straight-line path","Disposition":"IFO","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=47.673988,+-122.121512(24079)&iwloc=A&hl=en\"> mufon case (24079) map </A>","Tags":"City","Summary":"Bright white star like.","Date Submitted":"07/02/2010 02:37 UTC","Object Features":"None","Date of the Event":"06/26/2010 10:35 UTC","trends":["There have been 3 other sightings in Redmond","There were no other sightings in Redmond on or around June 26th 2010"],"files":["/var/www/straped/mufon/html2text/24079.html.txt","/var/www/straped/mufon/org/24079.html"],"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsA Friend and i were standing outside talking when i noticed what i thought was a plane going over head as is passed over it stayed a bright light,I did not see the body of a plane.It seemed to twinkle or sparkle , It was beautiful bright white star like.It was the size of a golf ball when held out at arms length,I said there is no sound , and my friend noticed that it seemed to move like a mouse(Mini zizag and pauses).It was moving in a northerly direction perpendicular to the rising full moon. I think The ISS was coming from the north west that night. What ever it was it was beautiful. I was so excited that i ran inside and grabbed a couple of women to come see. They were perplexed and couldn't say what it was,one was sure it was a satellite. I completely disagreed . I know what a satellite looks like and that was not it. I walked my friend back to her car and saw a light coming from the direction of the object's path.I was so excited , but i noticed the light was different it was a little yellowish and then saw that it was a plane .It was nice though, to have something to compare the object to."],"Latitude":"47.673988"}