{"Object Features":"Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=43.08971,+-73.783065(24077)&iwloc=A&hl=en\"> mufon case (24077) map </A>","Region":"New York","Latitude":"43.08971","divs":["sighting detailscigar\\cylinder\\capsule video capture silent daytime clear sighting multiple events. this was filmed on june 3, 2010 at 7:48 pm in wilton, ny...saratoga county on northern pines rd and is one of several captures of this capsule type ufo that i see repeatedly and could also be classified as cigar shaped or cylindrical. in 1998 *(name deleted--sgonzalez\\cms) fort ticonderoga, ny sighting with video capture next to church steeple was on the cover of many ufo magazines. this flying tube has been captured by many people who post on you tube from around the world and can be seen on my yt channel cosmicdramaqueen the playlist is called ufo cigar cylinder capsule tube . i was driving home when i stopped to admire the wild flowers in a field on northern pines rd, i was contemplating picking some while i listened to the birds...and then i saw the familiar flying white tube, so i hopped back to my truck, grabbed the camera and filmed this one for a long time. elevation was well under 5000' and was approximately 1\\2 to 3\\4 of a mile with in view. i was facing east and it was flying from the south heading due north. i had this ufo in my sites for so long and because i captured this on several occasions, i got a little bored, so i panned out to show the field and then resumed the filming as it angled away towards the north east. many people will \"hang on\" to the idea that this is a plane....nope...absolutely silent...no wings...no tail....watch the video closely from beginning to end and you too will see that the lack of wings and tail section is not an optical illusion. i will continue to report and share in the disclosure process because if we wait for an official announcement....well, we could possible wait another 60 years. it is we, the people who have to accept the reality that ufos are real and are here... and then help the one's who are too afraid to understand this reality! peace to all beings."],"Source":"MUFON","Object Flight Path":"Path with directional change","Country":"United States","Summary":"Cigar/cylinder/capsule video capture silent daytime clear sighting multiple events.","Disposition":"Unresolved","Object Shape":"Cigar, Cylinder","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-73.783065","Weather Factors":"None","Date Submitted":"07/01/2010 10:57 UTC","City":"Saratoga Springs","Log Number":"US-07012010-0014","Case Number":"24077","Tags":"City","trends":["There have been 6 other sightings in Saratoga Springs","There were no other sightings in Saratoga Springs on or around June 3rd 2010","This sighting has been favorited 2 times.",""],"Date of the Event":"06/03/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/24077.html.txt","/var/www/straped/mufon/org/24077.html"],"Sighting Duration":"Undisclosed"}