{"Sighting Duration":"00:11:00","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.892449,+-118.301892(24074)&iwloc=A&hl=en\"> mufon case (24074) map </A>","City":"Gardena","Source":"MUFON","Object Features":"None, Unknown","Object Shape":"Bullet, Missile, Circle, Sphere, Other","Summary":"Driving north on Main St. I noticed long trails on something flying, stopped & took pictures from 2 angles.","Tags":"City","Region":"California","Log Number":"US-07012010-0011","files":["/var/www/straped/mufon/html2text/24074.html.txt","/var/www/straped/mufon/more/24074_submitter_file1__Object6-22-10809PM.JPG","/var/www/straped/mufon/more/24074_submitter_file2__SDC10741.JPG","/var/www/straped/mufon/more/24074_submitter_file3__SDC10761.JPG","/var/www/straped/mufon/org/24074.html"],"Case Number":"24074","Disposition":"IFO","Latitude":"33.892449","Longitude":"-118.301892","Country":"United States","Object Flight Path":"Straight-line path","trends":["There have been 5 other sightings in Gardena","There were no other sightings in Gardena on or around June 22nd 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was driving my car north on Main St going to work, I passed under the 405 fwy and noticed a flying object with two trails coming from the rear of it. I could tell it was far away. I stopped to take a few pictures and decided to drive up a bit more for a better view point. At one point a plane much closer to me fly's past in my pictures (perfect!) This was while the sun was setting. I wear glasses so it was hard for me to see what I was looking at. however it flew directly over head and lost its trails only to become a glowing red dot. After that I lost track of it. It sure confused me. And whats more I have seen it closer before this around LAX while on the 405. And still could not figure out what it was. I would love to know as I took good pictures of it at 10.2MP, I had to use full digital zoom to get the closer shots of it. I felt normal, excited to catch it on camera finally. The shock came when i zoomed in on it. I would guess it was something launched in to space. But I am not an expert and its weird to have THIS type of air traffic around LAX.. I am not sure what the object was when I first saw it, hence the pictures, and I have seen it to objects like it before in different places around the south bay area. The object remained on a steady course the whole time. It went from over the pacific ocean east towards me and then over me going east and fading from my line of sight. I lost track of it after its trails vanished and it turned in to a small red dot in the sky."],"Date of the Event":"06/22/2010 08:08 UTC","Date Submitted":"07/01/2010 08:00 UTC","Weather Factors":"None, Windy, Does Not Apply"}