{"Weather Factors":"Unknown","Summary":"Two UFOs observed with light flashes.","Date of the Event":"07/01/2010 12:00 UTC","Sighting Duration":"Undisclosed","Region":"California","City":"Ridgecrest","trends":["There have been 11 other sightings in Ridgecrest","There were no other sightings in Ridgecrest on or around July 1st 2010"],"divs":["Sighting DetailsIt was a busy night star gazing as I saw numerous unusual sky phenomena between Scorpio and Corona Borealis. All this took place between 9 p.m. and 10:30 p.m. local time. Around 9 p.m. I went out for my evening star gazing and watching the satellites go by. I live in a small town so this is exciting :-) At the start I saw what I can only describe as flashes of light in the sky. The flashes of light looked like a flash from a camera. Then I observed what I thought was a satellite until the satellite went from moving from a northern to southern direction to veering to a southwesterly direction. Satellites do not normally change their directional course as they can not. They always move in the same direction without veering off course. This satellite seemed to be dark gray in color and was silhouetted against the night sky. I saw this with my naked eye. Then I saw the similar flashes of light again. After this I saw another \"satellite\" that was moving across the sky. This time the satellite stopped, then let off a \"pouf\" of periwinkle to white color, then moved again. I observed through binocs what seemed to be a lighted object with periwinkle and white lights. This satellite then moved and faded away. Approximately a half hour later this same satellite reappeared towards the southwest portion of the sky and repeated the same set of movements and colorations before fading out. I saw the flashes of light each time before the bluish white satellite reappeared. I checked Heavens Above and could find nothing that might fit what we saw. Perhaps you can find something. None of this stuff was close. It was all probably just inside the earth's atmosphere at a good guess."],"Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-07022010-0005","Disposition":"IFO","Object Shape":"Circle, Star-like","Country":"United States","Object Features":"Unknown","Case Number":"24083","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/24083.html.txt","/var/www/straped/mufon/org/24083.html"],"Latitude":"35.630436","Date Submitted":"07/02/2010 10:38 UTC","Source":"MUFON","Longitude":"-117.667807","map":"<A HREF = \"http://maps.google.com/maps?q=35.630436,+-117.667807(24083)&iwloc=A&hl=en\"> mufon case (24083) map </A>","Tags":"City"}