{"Viewing Distance":"Unknown","Tags":"City","Latitude":"53.428544","Case Number":"24088","files":["/var/www/straped/mufon/html2text/24088.html.txt","/var/www/straped/mufon/org/24088.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.428544,+14.552812(24088)&iwloc=A&hl=en\"> mufon case (24088) map </A>","Date Submitted":"07/02/2010 03:45 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","trends":["There has been one other sighting in Szczecin","There were no other sightings in Szczecin on or around June 28th 2010"],"Summary":"Many orange glowing spheres.","divs":["Sighting DetailsI was walking about in my home and looked west out towards the nice sunset. I live a short distance from the German border. I saw a super bright orange light. It was NOT a flare. It appeared to be coming over from Germany. Then there were 5-6 more orange spheres appearing out of thin air. There were no clouds in the sky. I thought it was someone who was letting some flaming ball of fire attached to helium balloons. Then they started to move towards my home. They seemed to be just drifting in the sky. But they moved closer together then farther apart- just like it was a choreographed event. They lasted for about 5 minutes then faded out. Then to my surprise, there were another 10 or so of the same objects emerging from the same area and doing the same thing as the previous spheres. I was reading \"Event ID 24087\" and I saw the same thing for sure. I was observing through my 16x binoculars and didn't make out any certain shape. The elevation of the spheres would be possibly 300-500 meters AGL. There was no noise emitted from the spheres at the time of viewing. There was little to no ambient noise in my location."],"Object Flight Path":"Undisclosed","Object Shape":"Sphere","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"06/28/2010 12:00 UTC","Longitude":"14.552812","City":"Szczecin","Sighting Duration":"Undisclosed","Country":"Poland","Log Number":"PL-07022010-0010","Region":"Zachodniopomorskie"}