{"Latitude":"44.311634","City":"Augusta","Object Flight Path":"Undisclosed","Region":"Maine","Date of the Event":"07/01/2010 10:30 UTC","Log Number":"US-07022010-0016","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-69.77343","Summary":"Large star like object with second smaller one moving in -- then off in another direction.","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=44.311634,+-69.77343(24094)&iwloc=A&hl=en\"> mufon case (24094) map </A>","Tags":"City","Weather Factors":"Unknown","Disposition":"IFO","Date Submitted":"07/02/2010 09:32 UTC","divs":["Sighting DetailsI was taking my puppies out last night about 10:30 pm and discovered someone had turned off my motion detector porch light. As I was waving my arm in front of the light not realizing that it was off, I noticed a bright star-like light in the south eastern sky. It was bigger & brighter than any other stars that I have ever seen and caught my attention for that reason. I live about 20 miles from the city of Augusta in the foot hills of the mountains, and so with out any background light this anomoly was very clear and noticeable. When I was watching this bright light, a smaller star like light came from the southern sky, moved right up to the first light, then flew at a very rapid speed off at what seemed like a right angle into the northern sky. There was no sound other than the normal night sounds. I got very anxious and switched on the porch light, when I turned it back off both star like objects were gone. I hurried the dogs in the house, and several times I checked out of the window facing the same area, but saw nothing more out of the ordinary. It or they were gone. I grew up as an air force brat living on military bases and have never seen any kind of flight vehicles that could maneuver with such speeds and at such changes in angles, in total silence. This event happened so quickly I did not have time to even think of photographing it. I always thought these kind of things happened in the big cities, not in rural Maine where we only have a couple of buildings with 10 stories."],"trends":["There have been 7 other sightings in Augusta","There were no other sightings in Augusta on or around July 1st 2010"],"Object Features":"Undisclosed","Case Number":"24094","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24094.html.txt","/var/www/straped/mufon/org/24094.html"]}