{"Summary":"White blinking object, almost identical to the recent sightings in Cleveland, Ohio.","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","City":"Washington","Date of the Event":"07/02/2010 10:15 UTC","Date Submitted":"07/03/2010 01:07 UTC","Sighting Duration":"Undisclosed","Longitude":"-83.027272","Viewing Distance":"Over One Mile","Disposition":"IFO","trends":["There have been 2 other sightings in Washington","There were no other sightings in Washington on or around July 2nd 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.730266,+-83.027272(24099)&iwloc=A&hl=en\"> mufon case (24099) map </A>","Object Features":"Undisclosed","Latitude":"42.730266","Case Number":"24099","Weather Factors":"None","Object Shape":"Circle, Diamond, Flash, Oval, Star-like","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/24099.html.txt","/var/www/straped/mufon/org/24099.html"],"Source":"MUFON","divs":["Sighting DetailsIt started the night on July 1st , 2010. Me and my girlfriend were driving down Vandyke rd. Heading back to my house when I seen this really bright shiny like star in the sky. It was very weird to me because it was out and bright before any of the stars are usually visible. At first my girlfriend \"who was pretty skeptical at first\" tried to convince me it was a helicopter or an airplane. We stopped driving and noticed it was moving in a slow and different way then any airplane or helicopter Ive ever seen has. It would sit still in the sky flashing on and off, sometimes glowing a faint pigment of red or green, and if you concentrated there were blatant light sources emitting from this object. When we got home I rushed outside to check it out. During this time I was amazed to see how clear and vivid this object was. It was not like anything I have ever seen in my entire life. This unknown object the first night was tricking with my mind because of the way it would sit still in the sky for 15-20 minute periods at a time. It was also very low in comparison to a airplane etc. Then it would move in really unpredictable ways, up and down, left and right, sometimes it would even move up and down almost like the tower does in Toronto, Canada. The object flashed on and off sometimes more then others for the entire sighting. When I seen it the first night I was really excited and in complete aw. I have never witnessed anything like this. The first night my girlfriend, myself, and my mother both seen the object. I went online and checked out the sightings in Cleveland, Ohio, and to my surprise it was almost the same exact shape and behavior as the sighting in the video. I then knew this was not something to ignore. The video from the sightings in Cleveland said the UFO had been seen ten nights in a row, so on July 2nd, 2010, I had the urge to look for it again. Once again before any other stars were out. In the same direction as before, was this very bright, glowing object. This time I knew something was not normal about this thing. I watched it again when I got back home and to my surprise this time it seemed much closer then before. It was really high at first, and towards the end of the sighting it disappeared in the horizon or landed it was hard to tell really. This time unlike the night before, I had called my father who knows a lot about astronomy, him and my step mother drove over and so did my sister and others. About twelve of us stood outside and all agreed this object was a phenomenon. There was much more activity then the night before. The object moved a lot more then the previous night, and its movements were more random and inhumane. When watching this object, you could almost make out little small moving lights, moving around the object in weird patterns, like they were attached to it. Also when the object moved and flashed, it was very obvious that it was not that high in the sky, it was much much more lower then commercial airplanes, I would say it was mainly about the height as personal \"small\" airplanes usually fly. The object flashed a bunch and started to lower in the horizon almost as if it were hovering above the tress and getting lower. It is now 1:00am July 3rd, and the object has been out of sight since 11:30 eastern time. While me and my friends and family watched this object, we were convinced that someone else had to have seen it. If anyone else reports this same sighting, I would not be surprised, it was very clear, noticeable, and obvious. I plan on looking in the skies tonight and tomorrow, since its been two nights in a row now. If possible, have someone look tomorrow, I have a strong feeling it will be there again. Anyways if you feel I have left out any important details you can feel free to contact me by phone or email."],"Log Number":"US-07032010-0004","Region":"Michigan"}