{"Object Features":"None","Date of the Event":"07/02/2010 04:30 UTC","Object Flight Path":"Hovering then path","Latitude":"38.044264","Weather Factors":"None","Longitude":"-84.496946","Region":"Kentucky","divs":["sighting detailswas on my deck, clear sky,i looked in the skt to see if any planes were crossing my view when i saw a shiny flashing object in the air and figured it was a balloon very high in the sky. i watched it and it soon passed a stationary object which was a dull, dim, silver, similar to high flying aircraft, however, it was stationary and very difficult to see. i retrieved the binoculars to get a closer look at both objects, but the shiny object that i assumed was a baloon was not visable any longer. i scanned that area for the dull object and found it with the binoculars. it was bright and silvery and appeared to have wings once infocus with the binoc's. my son and i both watched the stationary object for 30 min before moving on to fishing. i am an avid stargazer and aviation enthusiast. one thing i did find unusual was that the sky was absent of commericial air traffic that i could see. i will sit on my deck and watch the planes with the binoc's, this gives confirmation to my wifes claims that i don't have a life. i saw it at se direction looking straight up and the se at about 70-80 degrees. i tried to record it with my camcorder but that bootleg piece of *(word deleted--sgonzalez\\cms) didn't reach out enough. i did not have any remarkable reaction to the object, i was glad that my son saw it as well"],"City":"Lexington","Summary":"Silver object.","map":"<A HREF = \"http://maps.google.com/maps?q=38.044264,+-84.496946(24091)&iwloc=A&hl=en\"> mufon case (24091) map </A>","Country":"United States","Object Shape":"Cone, Cross, Disc","Tags":"City","Disposition":"Unknown","Log Number":"US-07022010-0013","Case Number":"24091","Sighting Duration":"Undisclosed","Date Submitted":"07/02/2010 06:04 UTC","files":["/var/www/straped/mufon/html2text/24091.html.txt","/var/www/straped/mufon/org/24091.html"],"Source":"MUFON","Viewing Distance":"Unknown","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around July 2nd 2010"]}