{"Object Flight Path":"Path with directional change","Object Features":"Dome","Region":"Louisiana","Case Number":"24093","Date Submitted":"07/02/2010 09:13 UTC","Weather Factors":"None","Tags":"City","Country":"United States","Summary":"It was a dull stainless steel color, about 12-15 feet in diameter and was about five feet tall.","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Junction City","This sighting has never been favorited."],"Source":"MUFON","Viewing Distance":"20 Feet or Less","Object Shape":"Disc","Date of the Event":"07/15/1977 11:50 UTC","divs":["Sighting Details I was headed home after leaving my girlfriends house.At a distnace I noticed what appeared to be a very bright falling star. IN a moment I noticed the sky appearing to light up in the distance. Suddely I saw that the woods were getting very bright a short distance away. In a moment I realized that everything had gotten bright. The entire area had become like daylight. I looked up above my vehicle and noticed an object hovering . It wasn't spinning but was moving the same speed I was moving. I stucki my head out the window to get a better look and realized that it was not making any sound. At that time it was about it was about 200 feet high. I began to speed up and was followed and the object got lower. After about one-half mile it got down to about 30 feet above my vehicle. The object shinned a very bright light on me which made me unable to see for what seemed like only a short time. As the light went out I was able to see the bones in my hands and arms for a split second. I looked and saw the object hovering beside my vehicle about 3 feet above the ground. IN the blink of an eye it went up and out of sight. I went into town and didn't see anyone. I went home and awakened my mother to tell her. She was concerned because it was almost 3 pm. in the morning. The trip from my girlfriends home took about 10 to 12 minutes. I had experienced a loss of time and I also remember experiencing some vomiting after I got home."],"Latitude":"33.01375","Log Number":"US-07022010-0015","map":"<A HREF = \"http://maps.google.com/maps?q=33.01375,+-92.725158(24093)&iwloc=A&hl=en\"> mufon case (24093) map </A>","Longitude":"-92.725158","City":"Junction City","files":["/var/www/straped/mufon/html2text/24093.html.txt","/var/www/straped/mufon/org/24093.html"],"Disposition":"Unknown"}