{"Longitude":"-73.861216","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.85941,+-73.861216(24101)&iwloc=A&hl=en\"> mufon case (24101) map </A>","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around July 2nd 2010"],"Weather Factors":"Unknown","Region":"New York","City":"New York","Object Flight Path":"Path with directional change","Object Shape":"Star-like, Other","Summary":"A dim satellite looking object moved across the sky, north to south and veered east before disappearing from sight.","Latitude":"40.85941","Date of the Event":"07/02/2010 09:42 UTC","Case Number":"24101","files":["/var/www/straped/mufon/html2text/24101.html.txt","/var/www/straped/mufon/org/24101.html"],"Sighting Duration":"Undisclosed","divs":["sighting detailsi went outside of my house as i do most nights to survey the night sky as i usually do in good weather. i look for anything moving such as meteors, comets, etc.... hoping to see a ufo someday. as i looked up, i saw at about one third of the distance toward the eastern horizen, a very dim object that i thought was a satellite, moving very fast from north to south and veer off to the east before disappearing from view. this took about 3 to 4 seconds. there was no trail so it could not have been a meteor. i have seen plenty of meteors and i know this was not one. it wasn't a bird. it moved to fast. i would say it had to be moving at about 2,500 to 3,000 mph. this is just a guess. it also was not a jet plane. i was in the naval air arm and i would know if this was a jet plane. no noise, no jet trail, moving very fast. i think i finally saw a ufo. my feelings were: what the heck....and i stood there looking for something more...and there was nothing more. i kept looking up for about three more minutes and saw nothing more. it was like a complete letdown. i then went inside to tell my wife what i just saw. i thought about what i just saw and then thought about getting in touch with stanton friedman. after a while, my wife went on the internet and brought up his site. it referred me to your mufon site. *wit's name deleted--sgonzalez\\cms."],"Object Features":"Unknown","Source":"MUFON","Country":"United States","Tags":"City","Disposition":"IFO","Log Number":"US-07032010-0006","Date Submitted":"07/03/2010 02:25 UTC"}