{"Object Features":"Undisclosed","Sighting Duration":"00:02:00","Country":"United States","Summary":"Petaluma ranchlands: Enormous translucent wing with two lights on each end low over house.","Latitude":"38.239517","Region":"California","Weather Factors":"Unknown","divs":["Sighting DetailsI've not come forward before, but the poor people who lost their dog fleeing this thing is just too close to what I saw on the evening of June 9th at 9:30pm as I turned off of Stony Point Road onto Pepper Road. As I turned onto Pepper Road, I noticed an object hovering motionless in the sky to my left and two or three pastures in front of me. It looked about the size of a helicopter and was fairly high up at the altitude that one would expect to see a helicopter flying, but it had no flashing lights and no red or green. It looked like a close collection of three bright whitish-orange lights just hovering. I've seen strange lights driving through there before, so I had the thought 'Well, if you're a UFO, then flash.' Immediately after thinking that thought, the object descended at rapid speed directly towards me. Needless to say, I was quite startled by its approach. It went from looking like a collection of lights, to looking like a translucent enormous wing with a bright light on each end. The closer it got, the wider apart the lights became, although the lights stayed connected in relation to one another, as if on the tips of a straight wing. As it got to about tall tree level over Pepper Road, it banked hard like a conventional plane would do, but at a rate that no plane could do. It turned over the trees and cattle ranch at the intersection of Jewett and Pepper Roads and moved west. As it turned and departed, I could see the lights against the western sky which was still a deep turquoise after sunset. If it had been a conventional aircraft, I would've seen it silhouetted against the lighter sky and I would have heard engines. I heard nothing, and at best I saw something translucent between the two lights, as if it was an enormous wing. When it banked, it was three times the size of the rancher's house and was very low in the sky. If that rancher had been looking out his window, he would've had the same experience as the family in the 03July2010 event id 24103 had. He would've thought an enormous craft with two bright lights on it was going to hit his house. I sped up to follow the craft, but a two-decker several axle livestock truck was lumbering through the intersection of Jewett and Pepper Road, so I had to stop and wait for it. By the time I got to the west side of the rancher's house and out to open pasture again, I could see no sign of the object. I'm not a nut. I'm a PhD scientist and I know that I saw something incredible. A friend has suggested that I saw lights reflecting in my windshield, but Pepper Road is dark. There are no lights to reflect. No cars were behind me or to the side of me. The only vehicle nearby was the livestock truck that was perpendicular to me and far ahead of me when the event occurred."],"Log Number":"US-07032010-0013","files":["/var/www/straped/mufon/html2text/24108.html.txt","/var/www/straped/mufon/org/24108.html"],"Date Submitted":"07/03/2010 04:25 UTC","Tags":"City","City":"Petaluma","map":"<A HREF = \"http://maps.google.com/maps?q=38.239517,+-122.628432(24108)&iwloc=A&hl=en\"> mufon case (24108) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-122.628432","Object Shape":"Boomerang","Case Number":"24108","Source":"MUFON","Date of the Event":"06/09/2010 09:30 UTC","trends":["There have been 11 other sightings in Petaluma","There were no other sightings in Petaluma on or around June 9th 2010"],"Disposition":"Insufficient Data"}