{"Source":"MUFON","Object Flight Path":"Path with directional change","Disposition":"Unknown","divs":["Sighting DetailsMy Son-inlaw and I were on the front porch talking and watching the neighbor's down the street and west of our house shooting off some fireworks. I saw from the corner of my eye a bright orange light ball that I briefly thought was another firework but it was moving slowly and appeared to get larger and closer. I watched it for a moment then asked my Son-inlaw to look at it. He looked and said \"What the Hell!\" We just stared at it in awe. We were stunned both of us thinking this can't be a UFO. Maybe a flare, but it wasn't hovering and smoking like one. It was moving from the West To East very slowly and silently. Not a meteor because it wasn't coming down from the sky, no flame or smoke trail and was moving too slow. As it got closer like the size of a streetlight or maybe a little smaller than a basketball at arms length, we could tell it was glowing like it was on fire, no flames but burning like the sun surface. I started yelling inside of the house for my husband and 30yr old son to hurry and come outside fast. The object then took a turn and headed southeast picking up speed. By the time my son got outside it was a little smaller than a baseball at arms length before a tree blocked his veiw. He tried to run down the street to see it but it was already gone. I went in to watch the 10 o'clock news, sure that someone else had seen it. Nothing. Neither did it show up in the paper or morning news. Someone else had to have saw something that big in the sky on fire. But I haven't heard anything. I hate to be the first one to report it because I'm not good at est. how many miles it was away or how big it is but maybe everyone is like me waiting for someone else to report it so they can say \"Yea, I saw it too.\""],"files":["/var/www/straped/mufon/html2text/24106.html.txt","/var/www/straped/mufon/org/24106.html"],"Log Number":"US-07032010-0011","Weather Factors":"None","Case Number":"24106","trends":["There have been 2 other sightings in Princeton","There were no other sightings in Princeton on or around June 28th 2010"],"Region":"Indiana","Summary":"Large orange sphere shaped object appeared to be on fire like the sun but no flames coming off of it or smoke trail, silently moving slowly from west to east then accelerates, turns southeast, dissapears.. ABSOLUTELY NOT A PLANE!","Longitude":"-87.556003","Tags":"City","Date Submitted":"07/03/2010 04:10 UTC","Object Features":"None","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.353084,+-87.556003(24106)&iwloc=A&hl=en\"> mufon case (24106) map </A>","Viewing Distance":"Unknown","City":"Princeton","Object Shape":"Circle, Fireball, Sphere","Date of the Event":"06/28/2010 09:30 UTC","Latitude":"38.353084"}