{"Country":"United States","Source":"MUFON","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date of the Event":"07/04/2009 07:45 UTC","City":"Hoboken","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/24109.html.txt","/var/www/straped/mufon/org/24109.html"],"divs":["Sighting DetailsI don't know why i'm doing this...I promised myself not to do it but i have read of so many people that have experienced this phenomena that i feel that i must do it....July 4th 2009: This year Macy's is going to show off with fireworks on the west side of the Hudson river...As i live in in a building that faces up the skyline of New York City i have invited some friends to come over for a party so they can see the fireworks. It's 7:45 am not later than 8:10 when i wake up to clean my apartment for the party. I slide the curtain to the sides so i can start cleaning the windows when i suddenly see this object just above the city of Hoboken....At first i thought it was a ballon and from my point of view it looked like a diamond shaped object...i ran to get my binoculars and called my roommate so he can witnessed for himself(By that time he didn't believe in Ufo's) I was in shocked when i see this : A triangle shaped object, moving clockwise, on every tip it had like a hole, the edges were off rounded, dull gray color. I would estimate that the size of this airship was the same like a helicopter to a small plane...Hard to tell..i observed for about 10 mins and it moved in a straight line through the city until i lost the sight of it...It had some kind of mist of heat wave around it , if i can call it that way...The most weird thing is nobody reported it this and it was early in the morning...No newspaper, no tv,etc...There were some comercial planes by the time of the sighting in the area....I must say that last year there were plenty activity of Ufos in the NY city area...spheres coming out from clouds, shadowed ships that fly at speed light,,,Orbs coming out from ground zero,etc....I had another sighting with another of this ships a couple of months later...Please look up the sky, something is happening in our backyard and the sad thing is we don't even realize that is happening here....In our BACKYARD...."],"Latitude":"40.74635","Object Shape":"Triangle","Log Number":"US-07032010-0014","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"New Jersey","Longitude":"-74.022643","Date Submitted":"07/03/2010 04:45 UTC","Case Number":"24109","map":"<A HREF = \"http://maps.google.com/maps?q=40.74635,+-74.022643(24109)&iwloc=A&hl=en\"> mufon case (24109) map </A>","Summary":"Triangle shaped airships do exist.","trends":["There have been 7 other sightings in Hoboken","There were no other sightings in Hoboken on or around July 4th 2009"],"Tags":"City"}