{"City":"Naperville","Tags":"City","Summary":"Three red balls of light that formed a straight line, then triangular shape.","Disposition":"Unknown","divs":["Sighting DetailsMy husband and I were watching t.v. when I looked out our 3rd floor apartment window and spotted a red ball of light approaching from the west. It moved slowly, then stopped in midair. At that point, I went out onto the balcony to watch and I called my husband to come take a look. He grabbed a small pair of binoculars and then we saw another red ball of light from the same direction approaching slowly, rising from behind the distant tree line. It moved next to the ball of light and stopped in midair also. I then saw a third red ball of light approaching from the same direction moving slowly. It moved in line with the other two balls, forming a straight line. Then the furthest ball to the left, moved to the top of the other two balls to form a triangle shape with the one ball on top and the other two underneath. The bottom right ball then moved up to join the top ball, as did the other bottom red ball. They formed a straight line again and then started to move away after what seemed like only a minute. The lights suddenly dimmed until we couldn't see them any more, as if they just vanished. We looked at each other in astonishment and tried to conclude every reasonable explanation until we couldn't come up with one."],"Log Number":"US-07032010-0015","trends":["There have been 6 other sightings in Naperville","There were no other sightings in Naperville on or around June 30th 2010"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"Illinois","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.788483,+-88.144239(24110)&iwloc=A&hl=en\"> mufon case (24110) map </A>","Country":"United States","Date Submitted":"07/03/2010 05:19 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/24110.html.txt","/var/www/straped/mufon/org/24110.html"],"Latitude":"41.788483","Case Number":"24110","Longitude":"-88.144239","Date of the Event":"06/30/2010 12:00 UTC"}