{"Object Features":"Unknown","Object Shape":"Star-like, Other","Object Flight Path":"Straight-line path","Case Number":"24115","Date of the Event":"07/03/2010 10:35 UTC","Summary":"After watching fireworks saw an orange light moving slowly from west to east, 3 minutes later reappearred northeast to southeast.","files":["/var/www/straped/mufon/html2text/24115.html.txt","/var/www/straped/mufon/org/24115.html"],"Weather Factors":"Unknown","Longitude":"-78.799474","divs":["Sighting DetailsAfter watching a fireworks display in Brockway, PA on July 3rd; myself and 6 family members were sitting on a porch deck. A relative said - Look, a UFO. We looked and noticed an orange light moving through the sky from west to east slowly. It moved in a straight line, but slower than an airplane which made us keep watching it. It was mentioned that we should get binoculars, but thought it was now too far away. We watched it move at the same speed in a straight line for about 2 minutes and then it seemed to fade and disappear in the distance. I thought perhaps in the smoke from the fireworks. Approximately 5 minutes later I was walking to my car and my relative said there it is again. He got binoculars from his vehicle and then handed them to me. It took me about 15 seconds to get the light focused. When focused I saw 5 orange lights in a pentagon pattern. At first, I said the lights were in a star pattern. My cousin noted that it seemed to ne zig-zagging. After about 45 seconds the lights again faded. We continued to watch the sky , but the light did not reappear."],"Country":"United States","Sighting Duration":"00:08:00","trends":["There has been one other sighting in Brockway","There were no other sightings in Brockway on or around July 3rd 2010"],"Latitude":"41.249228","map":"<A HREF = \"http://maps.google.com/maps?q=41.249228,+-78.799474(24115)&iwloc=A&hl=en\"> mufon case (24115) map </A>","Source":"MUFON","Viewing Distance":"Unknown","City":"Brockway","Tags":"City","Date Submitted":"07/03/2010 11:45 UTC","Disposition":"Unknown","Log Number":"US-07032010-0020","Region":"Pennsylvania"}