{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.649203,+-93.211174(24124)&iwloc=A&hl=en\"> mufon case (24124) map </A>","City":"Branson","Summary":"Orange in color, flicking as if one fire, but with sphere shape, moving.","Sighting Duration":"00:05:00","Object Features":"Undisclosed","Date Submitted":"07/04/2010 04:57 UTC","files":["/var/www/straped/mufon/html2text/24124.html.txt","/var/www/straped/mufon/org/24124.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"36.649203","Log Number":"US-07042010-0007","Date of the Event":"07/03/2010 08:30 UTC","Country":"United States","divs":["sighting details*wit's identifying info deleted--sgonzalez\\cms. myself and my partner were patroling in the same car when in the eastern sky i noticed the object which appeared to be stationary approx. 30 degrees above the horizon. at first i thought it may be a local medivac helicopter which is stationed in our city. also there were several fireworks being set off in the area. after pointing it out to my partner, we stopped and observed. after a few moments it started moving toward us slowly traveling east to west. it then turned and began heading north at an upward angle. as we began following it i got my cell phone and tried to capture video. at this point it was already to far away to be caught on camera. it continued on a northern course, picked up speed and altitude then very quickly disapeared. it never changed color and no sound was heard coming from it. there was no becon lights and no hard structure to the object. it almost looked like an oriental paper balloon with fire flickering inside it. however, it was far to large and accelerated extremely fast. at the time of this report, i am not aware of anyone else seeing it although, several people were outside during that time. hopes you find this report helpful. **wit's name deleted--sgonzalez\\cms."],"Disposition":"IFO","Object Flight Path":"Undisclosed","Object Shape":"Other","Case Number":"24124","Region":"Missouri","trends":["There have been 13 other sightings in Branson","There was one other sighting in Branson on or around July 3rd 2010"],"Tags":"City","Longitude":"-93.211174"}