{"Object Flight Path":"Stationary","City":"England","Summary":"Different giant triangle in Bournemouth sky.","Sighting Duration":"00:02:30","Latitude":"52.355518","Date Submitted":"07/04/2010 06:02 UTC","Country":"United Kingdom","Region":"England","Object Features":"Unknown","Date of the Event":"07/03/2010 10:30 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Triangle","Longitude":"-1.17432","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=52.355518,+-1.17432(24126)&iwloc=A&hl=en\"> mufon case (24126) map </A>","trends":["There have been no other sightings in England","This sighting has never been favorited."],"Case Number":"24126","Log Number":"GB-07042010-0009","Source":"MUFON","divs":["Sighting DetailsI was walking in the Bournemouth Square park, around 10:30 PM, walking in the direction of the beach. Suddenly I looked at the sky, and I saw a way shining orange light; I kept looking at it, and then two more of these lights appeared, forming like a real big triangle in the sky. I tried to picture it with my Sony Cybershot camera, but the lights didn`t appear in the picture, they were still in the sky, but they didnt appear in the picture. Then the two lights who came later suddenly disappeared, they didnt fly away, they just dissapeared. The other light stayed there fore few seconds more, then it just disappeared like the others. The park was kind of busy, but nobody would seem to notice these lights. When I noticed what I was seeing, I didn`t get really frightened, because it was like, not so close to me, but my stomach started turning around, and I started feeling different, strange, inquiet, because I just didnt expect to see such an object. After I saw it, I tried looking at the sky for some more time, to see if it would come again, but it didnt. I really need to explain that it was not a giant triangle like the ones the UFO Hunters show on TV, it was way different. MUch bigger, and it would not make any moves, just appeared and disappeares, like if tne light were turned off."],"files":["/var/www/straped/mufon/html2text/24126.html.txt","/var/www/straped/mufon/org/24126.html"],"Viewing Distance":"Unknown"}