{"trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around June 17th 2010"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.059801,+-83.165068(24129)&iwloc=A&hl=en\"> mufon case (24129) map </A>","Case Number":"24129","Tags":"City","Disposition":"Unknown","Object Features":"Dome","Date of the Event":"06/17/2010 03:30 UTC","Latitude":"30.059801","Region":"Florida","Longitude":"-83.165068","Source":"MUFON","Object Flight Path":"Path with directional change,Other","Date Submitted":"07/04/2010 01:01 UTC","City":"Mayo","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/24129.html.txt","/var/www/straped/mufon/org/24129.html"],"divs":["sighting detailsi was returning from town and noticed a shiny object that kept flying (circuling )in and out of a wispy white cloud. it was gold and then silver reflecting the sunlight from the afternoon sun. this lasted about 5 minutes in all. i do not think it was an aircraft because the craft was making to tight of a circle in and out of this cloud. i was on route 51 going south about 5 miles out side of town. there was no trafic. i slowed so i could observe the cloud and the shiny disk more clearly. the road has overhanging trees and i would loose sight of the cloud and disk ocasionally. the disc was about the size of a pencil eracer. on a straight of way i first noticed the activity, all i had to do was lift my eyes just a degree or two to see the reflection of the alternating gold or silver or sometimes half gold(on bottom) and silver (on top).. at first i thought the reflection might have been from an airplane but this object was circuling to tightly to be an aircraft going through this perticular cloud. the cloud was not a large one but seemed to be surrounding the object or the object was staying close to the cloud for concelment. the cloud was white with gray tones in the center and was wispy on the outer edges.the object only came out of the cloud once that was when it was silver and gold together. it was almost as if it were observing me or something else. i was curious and would speed up to get to a location where i could see the cloud and disc again. before i got to the final straight of way on my way home i lost sight of the object. the cloud seemed to be there but i never saw the object again. to *(name deleted--sgonzalez\\cms) case # 24127 i have seen a saucer shape exactly like yours out of my living room window back in january or feburar this year.it was on a cloudy stormy day also."],"Weather Factors":"Unknown","Log Number":"US-07042010-0012","Country":"United States","Object Shape":"Circle, Disc, Oval, Sphere","Summary":"While returning from town I noticed a shiny object in the sky circuling through wispy white clouds in the sky."}