{"map":"<A HREF = \"http://maps.google.com/maps?q=51.089235,+-115.342514(24122)&iwloc=A&hl=en\"> mufon case (24122) map </A>","Date Submitted":"07/04/2010 02:22 UTC","City":"Canmore","Case Number":"24122","Date of the Event":"07/04/2010 05:30 UTC","Weather Factors":"Unknown","Region":"Alberta","Disposition":"Unresolved","Tags":"City","trends":["There has been one other sighting in Canmore","There were no other sightings in Canmore on or around July 4th 2010"],"Summary":"White object in sky.","Sighting Duration":"00:01:30","Latitude":"51.089235","Object Shape":"Star-like","Longitude":"-115.342514","Object Flight Path":"Stationary","divs":["Sighting DetailsToday my father and I witnessed a ufo. We were sitting on our deck facing north around 5 pm. We were discussing contrails as we watched a few planes fly above us. We noticed that some of planes did not have contrails and some of them did so we tried to understand the science behind this. Immediately after this conversation a plane flew above us which had a contrail. The plane and the contrail looked normal to us, I believe the plane was a commercial jet, maybe a 747. There was what looked like a white circle shaped flying object at the end of the contrail and we both noticed it right away. The contrail dispersed but the object remained and stayed stationary for the duration of the sighting which lasted a minute and a half. It was almost a clear day with a few clouds here and there and the sun was still out. The object appeared to be as high as the plane and we did not notice it until the plane flew overhead. The object could have been there prior to the arrival of the plane but it is uncertain when exactly it was visible. It had a defined shape to it and it appeared to be very small because it was so high up. It is important to note that it was very windy with clouds passing above us very quickly. I lost sight of the object when I went to tell the rest of my family what we were witnessing. I could not find the object again but my father says it remained still before disappearing."],"Object Features":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24122.html.txt","/var/www/straped/mufon/org/24122.html"],"Source":"MUFON","Log Number":"CA-07042010-0005","Country":"Canada"}