{"trends":["There have been 16 other sightings in Easton","There were no other sightings in Easton on or around July 3rd 2010","This sighting has never been favorited.",""],"City":"Easton","Summary":"Orange spheres over Easton.","Case Number":"24128","Source":"MUFON","Object Shape":"Sphere, Triangle","files":["/var/www/straped/mufon/html2text/24128.html.txt","/var/www/straped/mufon/more/24128_submitter_file1__formation.jpg","/var/www/straped/mufon/org/24128.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.694542,+-75.214032(24128)&iwloc=A&hl=en\"> mufon case (24128) map </A>","Object Features":"Unknown","Tags":"City","Longitude":"-75.214032","Disposition":"Insufficient Data","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"07/04/2010 12:02 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:10:00","divs":["Sighting DetailsI was driving east on the 2700 block of William Penn Highway in Palmer Township. About a mile away from the light at 25th and William Penn I noticed 10-15 Orange spheres that appeared to be hovering some distance above the Easton Hospital sign. They almost appeared to be radio tower lights on top of a mountain, as they were arranged in two triangular formations, something almost like a hill line. But as I am familiar with the area I knew there is no mountain or anything taller than the sign on the hospital in that direction. As I stopped at the light, I noticed that they were actually moving, fairly rapidly. I made the turn onto 25th st north at this time and tried to keep visual contact with them. As I looped back around I could not find the formation anywhere in the sky. A rough description of the formation is attached. Also immediately after noticing these I posted to facebook, and friends of mine have confirmed the sighting."],"Log Number":"US-07042010-0011","Country":"United States","Region":"Pennsylvania","Date of the Event":"07/03/2010 10:19 UTC","Latitude":"40.694542","Weather Factors":"None"}