{"Summary":"We saw 2 hovering spheres above our house in daylight followed by a cigar.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.092809,+-118.319131(24132)&iwloc=A&hl=en\"> mufon case (24132) map </A>","Region":"California","Log Number":"US-07042010-0015","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"34.092809","Object Shape":"Cigar, Circle, Sphere","City":"Los Angeles","divs":["Sighting DetailsSo a week prior to my sighting, there was another sighting by my friends in almost the exact same place above our house. There were multiple witnesses to the first sighting that I did not see. So on July 1st at approximately 4 p.m. I stepped outside my house to smoke a cigarette. I was actually thinking about the sighting my friends had the week before and started to look around in the skies. I spotted something almost directly overhead and starred at it for a few seconds and grew excited. I screamed for my friend who lives next door to come out and take a look because he had seen this the week before. I asked him if this is what he and the others had seen the week before. He said yes very excitedly that I was seeing it. As we stared at the object we noticed a similar object move in from behind it. The second one began circling around the first. I asked my friend for his binoculars so I could get a better look. It was totally frustrating because I could not find the objects through the glasses even though my friend was able to. These are cheap glasses with no adjustable range. My friend stated to me what we were seeing 2 sphere like objects with one seemingly dancing around the other one. At this point we probably had been watching the objects for about 15 minutes. My friend walked away for a moment and to me what appeared to be a cigar shaped object appeared. The 2 spheres seemed to be following it. After looking up for another minute or 2 the objects just simply vanished. I have no idea what we saw but I can tell you without a doubt this was not an airplane or helicopter. I know you hear about single eyewitness accounts but to have so many people see the same thing at the same time, there has to be something to it. I also took pictures of the objects but they were so high up I am not sure if you be able to see the objects or not. This is very very exciting to me. I was so bummed that I wasn't around the week before to share the encounter with my friends. The objects they saw were in gthe skies for over 2 hours in the same place."],"Case Number":"24132","Date Submitted":"07/04/2010 03:23 UTC","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/24132.html.txt","/var/www/straped/mufon/org/24132.html"],"Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 1st 2010"],"Weather Factors":"None","Date of the Event":"07/01/2010 12:00 UTC","Longitude":"-118.319131","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path,Path then hovering"}