{"Disposition":"IFO","Source":"MUFON","Latitude":"34.951211","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.951211,+-94.63717(24131)&iwloc=A&hl=en\"> mufon case (24131) map </A>","Date of the Event":"01/03/2010 09:30 UTC","Longitude":"-94.63717","Summary":"It was three lights in the shape of a triangle moving slowly across the sky.","Case Number":"24131","Tags":"City","Object Shape":"Star-like, Triangle","Country":"United States","trends":["There have been no other sightings in Howe","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/24131.html.txt","/var/www/straped/mufon/org/24131.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting in the living room with my mother when my dad rushed through the front door and told us to come outside and hurry. When we came out my dad pointed to the object. It was three orange lights the size of stars in the sky. It was way too big across to be an airplane and it wasn't making any noise. It was hard to tell if it was three seperate objects or one big object; although the lights seemed to move across the sky in perfect unison. The object was on the horizon moving south to north. It was moving at about the speed of an airplane. I only saw it for about a minute before a neighbors tree blocked our view of it. Then I saw one light appear before the rest of the object was blocked by clouds on the horizon. It may have been chinese laterns but that doesn't explain how they were moving in perfect unsion. The object stuck to the same flight direction until it disapeared. I thought about reporting it to the police but I figured it would sound kind of stupid to call a police station the day before the 4th of July saying, \"Hey, there's some weird lights in the sky!\""],"Viewing Distance":"Over One Mile","Log Number":"US-07042010-0014","Region":"Oklahoma","Object Features":"Unknown","City":"Howe","Date Submitted":"07/04/2010 03:20 UTC"}