{"Date Submitted":"07/04/2010 11:36 UTC","Source":"MUFON","trends":["There has been one other sighting in Hellertown","There were no other sightings in Hellertown on or around July 4th 2010"],"Longitude":"-75.340735","files":["/var/www/straped/mufon/html2text/24142.html.txt","/var/www/straped/mufon/org/24142.html"],"Latitude":"40.579544","Date of the Event":"07/04/2010 10:30 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.579544,+-75.340735(24142)&iwloc=A&hl=en\"> mufon case (24142) map </A>","Log Number":"US-07042010-0025","Region":"Pennsylvania","Object Flight Path":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Object Shape":"Fireball, Sphere","Object Features":"Undisclosed","divs":["Sighting DetailsMe,my wife and kid were driving back from a picinic when I noticed ten people standing out of saucon valley grill pointing in the sky. Figuring they were lookin @ fireworks so I looked up to. I saw no fireworks but I saw 3 orb like fireballs in a triangle shape in the sky. I was curious(naturally) so I drove faster to a nearby parking lot were I pulled over so we could get out to figure out what they were.once we pulled over we saw two more flying overhead. They were about the size of a quarter and there was also a plane in the sky(alittle higher than the orbs).they seemed to flicker alittle but had no trails behind them. we watched them go over the mountain and out of sight. I then called my mother who lives kinda in the direction they appeared to be traveling to tell her to look for them. around 11pm when I got home I acually called the bar that I saw the people looking into the sky to ask them if they saw them too. The bartender told me that they saw the same thing I saw and one hovering over the houses too. I've always wanted to see something like this but everytime I think I see something I can disclaim it quickly. Not the case with this sighting. Definately something I can not explain."],"Case Number":"24142","Sighting Duration":"Undisclosed","City":"Hellertown","Summary":"Fireballs moving through sky but they had no trails behind them."}