{"divs":["sighting details my wife , step son and i were outside in the driveway lighting some fireworks enjoying the evening of the forth at home. during a break in between lighting various fireworks my wife says \"look! what is that?\" i immediatly looked up and seen a huge orange ball moving extreamly slow, almost a hover, or drift. this object was not flaming but appeared to be almost a moltent like, or lava color..... i guess that would be the best way to describe the light form that it was emitting. we all stared at the object and watched it for a few minutes as it drifted \"southeast ward i beleive\" it was headed toward the michigan \\ indiana boarder, or near the town of new buffalo, mich. the object was big at first. so much so that we thought it was an airplane on fire.\"but no flames\".... just orange like lava or a huge smolder. we watched and watched as it drifted away and got smaller. it was moving sideways across the sky from left to right. it did not travel in a straight line the object went up and down a little bit. it slowly became smaller as it moved away. from start to finish it went from about the size of an upclose aircraft on fire and we watched it drift and become smaller, and smaller to the size of a penny coin and then smaller to nothing. we all stood dumbfounded and kept asking eachother what was that? tossed around ideas, but nothing could explain it. it was not fire works and we were not drinking. the neighbors were outside they may have also seen it. we havent yet asked them. we came in the house and called the michigan city police department and expressed our concern and also asked if they had any reports of an aircraft on fire. they said it was not a plane and thats about it. we do not feel as if the call was taken as seriously as it should have been."],"Summary":"SLOW MOVING OBJECT. As big an an aircraft on fire. \"NOT FIREWORKS!!!!!\"","Date of the Event":"07/04/2010 09:45 UTC","Latitude":"41.710999","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.710999,+-86.88616(24144)&iwloc=A&hl=en\"> mufon case (24144) map </A>","Disposition":"Insufficient Data","Longitude":"-86.88616","City":"Michigan City","Source":"MUFON","Case Number":"24144","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Weather Factors":"Unknown","Object Features":"Other, Unknown","Sighting Duration":"Undisclosed","Region":"Indiana","Country":"United States","Date Submitted":"07/04/2010 11:39 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/24144.html.txt","/var/www/straped/mufon/org/24144.html"],"Object Shape":"Circle, Disc, Fireball, Other, Unknown","Log Number":"US-07042010-0027","trends":["There have been 15 other sightings in Michigan City","There were no other sightings in Michigan City on or around July 4th 2010"]}