{"Log Number":"US-07042010-0024","Object Shape":"Chevron, Diamond, Sphere","Date of the Event":"07/04/2010 09:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.443628,+-75.339927(24141)&iwloc=A&hl=en\"> mufon case (24141) map </A>","Country":"United States","Case Number":"24141","Summary":"Low orange bright objects. One moving SW to NE followed by two moving W to E.","Object Flight Path":"Straight-line path","City":"Quakertown","Tags":"City","Disposition":"IFO","Weather Factors":"None","Date Submitted":"07/04/2010 11:34 UTC","Object Features":"None","divs":["sighting detailsmy wife and i were at the quakertown fireworks, sitting in a soccer field. just after the fireworks ended,approx.9:56 pm, we noticed a brightly lit orange object just to our east. it was at 1000 to 1500 feet, traveling initially in a nne direction, then heading more easterly, and moving at roughly 100 knots,however...it's speed seemed to vary somewhat. we watched until this vanished from our [clear] view into our ene. approx. 4 minutes later as we were walking nw to leave the fields, we saw two more of the same type of objects coming from the w. and heading e. these objects passed us to our n not more than 1 to 1 1\\2 miles. our view was completely unobstructed. the first of these two objects appeared to be identical to the previous that we had seen. the next object behind, and following it,was clearly yellower, but otherwise the same. they also moved at the same speed and altitude as the first, but in a completely different direction. we watched these as they disappeared to our e.....just like the first. it was absolutely clear out, we had a perfect view, and these things were very close. i thought the only possible common explanation might be lanterns.......however..they moved much faster than than the prevailing breeze....0-5knots at ground.....and collectively, they were moving in different directions. also......no nav lights.....no anti-collision lights...no sound...and they appeared to be the same color and brightness from all of the angles that we viewed them...as if the were eminating light from the entire surface. i am an experienced ocean sailor, flight enthusiast, and have worked outdoors for 30 years. i have no explanation for what we saw."],"trends":["There have been 12 other sightings in Quakertown","There were no other sightings in Quakertown on or around July 4th 2010"],"Source":"MUFON","Longitude":"-75.339927","Region":"Pennsylvania","Latitude":"40.443628","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24141.html.txt","/var/www/straped/mufon/org/24141.html"]}