{"City":"Louisville","map":"<A HREF = \"http://maps.google.com/maps?q=38.261175,+-85.749966(24143)&iwloc=A&hl=en\"> mufon case (24143) map </A>","Longitude":"-85.749966","Summary":"Luminescent orange sphere that flew in a straight line, pulsed out, pulsed on, disappeared.","Weather Factors":"Unknown","Date Submitted":"07/04/2010 11:37 UTC","Country":"United States","Viewing Distance":"Over One Mile","Log Number":"US-07042010-0026","divs":["Sighting DetailsWhile watching neighborhood fireworks, my children came running up to the group and said they are watching a \"falling star\". We walked around the side of the house to investigate what we assumed were fireworks, and to our surprise, we watched a luminescent orange sphere low in the sky, coming from the East and then heading North across the sky. The object was moving quickly in what appeared to be a straight line, covering miles. There were no blinking lights that would identify it as a plane or helicopter, and there was no sound emanating from the object. It pulsed bright orange and then the light went out. It then came back on again, and then went out suddenly. We were very surprised because we knew it wasn't a plane or fireworks. About 30 minutes later, the same light appeared around the general location where we first spotted it, and it followed a straight line again across the sky. It was still a bright orange color, and once again made no sound. The lights were larger than those on a plane. It traveled across the sky and once again disappeared from view. It was not following the typical plane flight patterns that go over our neighborhood."],"Object Features":"Unknown","Sighting Duration":"00:03:00","Disposition":"Unknown","Latitude":"38.261175","Object Shape":"Sphere","Date of the Event":"07/04/2010 10:00 UTC","files":["/var/www/straped/mufon/html2text/24143.html.txt","/var/www/straped/mufon/org/24143.html"],"Tags":"City","Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"24143","trends":["There have been 67 other sightings in Louisville","There were 5 other sightings in Louisville on or around July 4th 2010"],"Region":"Kentucky"}