{"divs":["Sighting DetailsAt approximately 11:00 PM on July 2, 2010, I stepped outside and decided to look up at the stars, but I looked over to the east-northeast and saw a red light off in the distance just above the horizon, it was not flashing, it was hovering just above the horizon, then it disappeared, I also noticed that the light on the cell phone tower about a mile to our east was not flashing, so either that was a coincidence or the UFO had an effect on the flashing cell phone tower light. The next day (July 3rd) at about 9:30 PM me and my cousin were riding our bicycles down our road, as we were riding, we were facing east, when we noticed the same exact light, and the cell phone tower light was not flashing. But we came up to a turn, and the corn blocked the view so we could not see it anymore. Later that night, my cousin had gone home, but it was about 11:00 PM that same night, and me and my parents decided to go outside and look around for anything unusual, this time i had my camera in my hands and ready to go. Thats when we could see the light re-appear to the east again, I immediately turned on the camera and tried to take the best photos of it as I could, then I switched the camera into video mode, and shot some video of it and I was able to capture the object disappear on video. The camera we have tends to not take very good photos of objects up close, they usually get blurry, but I still have that image just incase I need it (I still have the video too). The photo has two lights, the red light is the UFO, the green light is a light at someones house."],"trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around July 2nd 2010","This sighting has never been favorited.",""],"Date Submitted":"07/04/2010 11:41 UTC","Case Number":"24145","Object Shape":"Star-like","Country":"United States","Source":"MUFON","Longitude":"-87.520762","Disposition":"Unknown","Weather Factors":"None","Summary":"Red light appears from July 2-3, 2010, comes on for 10 seconds and goes off for 30 mintutes.","Tags":"City","files":["/var/www/straped/mufon/html2text/24145.html.txt","/var/www/straped/mufon/more/24145_submitter_file1__picofredufo.jpg","/var/www/straped/mufon/org/24145.html"],"Latitude":"38.684359","Date of the Event":"07/02/2010 11:00 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=38.684359,+-87.520762(24145)&iwloc=A&hl=en\"> mufon case (24145) map </A>","Viewing Distance":"Unknown","Region":"Indiana","City":"Vincennes","Log Number":"US-07042010-0028"}