{"files":["/var/www/straped/mufon/html2text/24148.html.txt","/var/www/straped/mufon/org/24148.html"],"Case Number":"24148","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Log Number":"US-07052010-0001","Longitude":"-74.827235","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around July 4th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.16466,+-74.827235(24148)&iwloc=A&hl=en\"> mufon case (24148) map </A>","Object Shape":"Cigar, Fireball, Sphere","Object Features":"Undisclosed","Tags":"City","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2010 12:00 UTC","City":"Levittown","divs":["Sighting DetailsI was looking out my window approx 11:30pm watching some of the nearby fireworks, and I saw coming towards me over my house just over the tree tops approx. just a little smaller than a bowling ball a sphere shaped orange fireball with a white glow around it just floating thru the sky and then I saw another one about 30 seconds later seem to follow this one but then never came over the tree tops , just saw the orange glow and it must have turned and went another direction. Over the Levittown area near Pennsbury High School. My daughter told me about 2 hours previous she saw exactly the same two fireballs. Over Levittown, near Levittown Pky approx 9:00PM. No sounds, just floating like it was a fire enclosed in a white mist. Earlier around noon of July 4th, by Oxford Valley Mall and Target on Rt 1, Langhorne I saw what I first thought was an airplane but it didn't have any sound, wings or anything just a silver cigar shaped object floating very slowly in the daytime sky. I was waiting at the light and looking forward and saw it. Floating lower than where I see planes fly."],"Summary":"Orange fireball looking sphere just floating thru the sky.","Source":"MUFON","Date of the Event":"07/04/2010 11:30 UTC","Region":"Pennsylvania","Latitude":"40.16466","Disposition":"Hoax"}