{"Longitude":"-73.047656","trends":["There have been 15 other sightings in Waterbury","There was one other sighting in Waterbury on or around July 4th 2010"],"Object Flight Path":"Path with directional change","Country":"United States","Summary":"Several objects seen over Connecticut, Naugatuck Valley.","Viewing Distance":"Unknown","Case Number":"24151","Log Number":"US-07052010-0004","files":["/var/www/straped/mufon/html2text/24151.html.txt","/var/www/straped/mufon/org/24151.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.561112,+-73.047656(24151)&iwloc=A&hl=en\"> mufon case (24151) map </A>","Latitude":"41.561112","Region":"Connecticut","Weather Factors":"None","Disposition":"Unknown","Date Submitted":"07/05/2010 12:30 UTC","Object Shape":"Star-like","Date of the Event":"07/04/2010 10:20 UTC","City":"Waterbury","Source":"MUFON","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsI encouraged my family to come outside to check out the stars from our backyard because the sky was clear and brilliant with many stars. While gazing at the sky, on several occasions, we would see what initially appeared to be a star move across the sky, what was most captivating was that the objects changed direction very easily & at times made jerky movements as they moved along. We watched many of these objects continue until they were out of sight, though some would seem as if perhaps they ascended because they would appear smaller until they were out of view. These objects did not flash or move like airplanes, in fact we had seen many airplanes during that time and clearly the objects were much higher and smaller than airplanes. The way these objects traveled was abrupt and the duration of time they would move suggested that these objects moved at a very high speed and covered a great distance in a short period of time. We saw a total of 12 objects during an 1.5hrs. The objects just kept coming, it was surprising and exhilarating it proved to me that there is plenty of activity up in space and the fact that my entire family saw it was awesome. July 4 2010"]}