{"Region":"Pennsylvania","Object Features":"Unknown","Case Number":"24155","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24155.html.txt","/var/www/straped/mufon/org/24155.html"],"Viewing Distance":"Unknown","Latitude":"39.954465","Source":"MUFON","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around July 4th 2010"],"divs":["Sighting DetailsMe and my mom and dad were sitting on our back porch just enjoying the July 4th holiday. Our backyard is very dark with no lights on so it's very easy to see the sky. I was just sitting and I turned and looked in front of me in the sky and I saw what I thought to be a star. I realized that it wasn't because it was much more bright and much closer than a star would be, it was hard to tell but it almost looked like it was above the house like 10 houses up the street. It just stayed in one spot but I stared at it since it just seemed odd looking to me. I asked my mom to get up and look up and she saw it as well. At that point it started to move right and then backtracked and headed left at a steady rate and then just dissapeared. We thought it was weird and sat back down. About 2 minutes later I noticed another light in the same spot I had saw the other and as I stared I realized it was getting brighter like the last one I had seen. I called to my mom again and she looked and spotted it too. Let me reiterate it was extremely bright. I had my dad look too and he could see it, that's saying alot on how bright and how close it was because he has sight problems and can't even see the stars in the sky at all. I could see it was staying in one spot but I could see it moving a little bit like trying to hover in one spot and then it proceeded to move left again. At this point it went dim and started to pulse a much dimmer light at a constant rate as it moved. My dad had trouble seeing it as this point. Of course we didn't have our camera since my sister had taken it with her to the shore. We got out the binoculars and it was hard to see anything because the light around it just made it blurry when looked close up. We followed it as far as we could before we lost sight of it behind trees. Very weird and unexplainable to me. There were other planes in the sky at this point so I could compare to them and it was nothing like them, the lights weren't the same, it was much bigger or at least closer than the planes by far. It didn't make any noise either, we can hear planes when they go by and we heard absolutely nothing, the fireworks had ceased too so it was completely silent in our backyard. We sat out there for another half hour and never saw anything after that. Very cool in my book."],"Date Submitted":"07/05/2010 01:04 UTC","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Log Number":"US-07052010-0008","Disposition":"IFO","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.954465,+-75.161879(24155)&iwloc=A&hl=en\"> mufon case (24155) map </A>","Date of the Event":"07/04/2010 12:00 UTC","Object Shape":"Oval, Star-like","City":"Philadelphia","Summary":"Bright star like object in sky moving around.","Country":"United States","Longitude":"-75.161879"}