{"Source":"MUFON","Object Shape":"Disc, Flash, Oval","Object Flight Path":"Undisclosed","Log Number":"US-07052010-0012","Date Submitted":"07/05/2010 02:00 UTC","Tags":"City","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Jasper","There were no other sightings in Jasper on or around July 4th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.833848,+-87.273375(24159)&iwloc=A&hl=en\"> mufon case (24159) map </A>","Object Features":"Undisclosed","Latitude":"33.833848","Sighting Duration":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24159.html.txt","/var/www/straped/mufon/org/24159.html"],"divs":["sighting detailsmy girlfriend,my cousin's wife,cousin's two small children,and i were lighting firecrackers (note:only the kind that bang,no lights.) in a field beside my grandparent's house...we live in the country,surrounded by family..the sky is very dark at night,and no fireworks were being shot for at least a couple miles..we heard none and saw no other lights that could have been produced by fireworks (just wanted to get that out of the way). i was sitting on the ground looking up towards *(name deleted--sgonzalez\\cms),my cousin's wife,when i saw a greenish orange (thats the best way i know how to explain it,i have no idea how to fully describe the color..very strange) flattened oval shaped light zip across the sky horizontally. it moved in a straight line at first,gaining no altitude...and it was very large,much bigger than any plane or helicopter ive ever seen...anyway,i shouted \"look!\" and *(name deleted--sgonzalez\\cms)and my girlfriend **(name deleted--sgonzalez\\cms)turned to look where i was pointing and it flashed again...**(name deleted--sgonzalez\\cms)described it as looking like a lightbulb under a lampshade,like a glow coming from inside...we all watched as it sort of doubled back on its path and flashed again. i asked everyone what they thought it was and no one had an answer..all agree though that it couldnt have been fireworks or any kind of aircraft we've seen...i'm not saying it was alien,just unidentifiable. i decided to report this (it happened about two hours ago) in hopes that someone might come across it who either witnessed the same event or something similar. my email address is blake_rollo@yahoo.com i dont mind anyone sending me replies to this query"],"City":"Jasper","Longitude":"-87.273375","Region":"Alabama","Date of the Event":"07/04/2010 11:00 UTC","Summary":"Green/yellow/orange flash very high up flew in semi circle much higher than treetops very large.","Country":"United States","Case Number":"24159"}