{"Tags":"City","Weather Factors":"Unknown","Summary":"Fleet of 12-15 orange orbs in formation","Date of the Event":"07/04/2010 09:45 UTC","Date Submitted":"07/05/2010 12:52 UTC","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.24788,+-83.610644(24154)&iwloc=A&hl=en\"> mufon case (24154) map </A>","Object Features":"None","Object Flight Path":"Straight-line path","Source":"MUFON","Country":"United States","Object Shape":"Fireball, Sphere","trends":["There have been 12 other sightings in Ypsilanti","There were no other sightings in Ypsilanti on or around July 4th 2010"],"Disposition":"IFO","divs":["Sighting DetailsMy neighbors and I were lighting fireworks at dusk to celebrate the 4th of July, on the southwest side of Ypsilanti near Ann Arbor. My landlord was the first to see the objects approaching from the southwest. He said \"We're being invaded\" and drew our attention to the sky. I looked up and saw 6 orange orbs moving across the southern sky from southwest to northeast. My first reaction was that they must be some type of fireworks. But more of them continued to appear from behind a cloud, moving silently at a speed and altitude comprable to airliners. I didn't get an exact count but I estimate I saw 12-15 objects total, including one that was trailing far behind the others. I tried to get video on my iPhone but the exposure was too low and the objects were not very bright. I can best describe them as looking like orange signal flares, but flares don't move like aircraft. They didn't move erraticaly in any way. They just kept a steady, straight course in a fixed cluster formation. They are similar to other lights that had been seen in Arizona several years ago. They passed behind another cloud and I didn't see them again. I wasn't scared because they didn't appear threatening in any way. The children (ages 6 through 12) got excited but didn't seem scared. I imagine that, given the date and timing of the sighting, there are widespread eyewitnesses of this event, as many people happened to be outdoors looking at the sky at the same time. I hope someone got some more quality video than I did."],"Viewing Distance":"Over One Mile","Latitude":"42.24788","Longitude":"-83.610644","Sighting Duration":"00:02:00","City":"Ypsilanti","Log Number":"US-07052010-0007","files":["/var/www/straped/mufon/html2text/24154.html.txt","/var/www/straped/mufon/org/24154.html"],"Case Number":"24154"}