{"Sighting Duration":"00:05:00","Source":"MUFON","Latitude":"41.374444","Date Submitted":"07/05/2010 02:28 UTC","Tags":"City","Weather Factors":"None","Longitude":"-81.635303","Case Number":"24166","Object Flight Path":"Undisclosed","Date of the Event":"07/04/2010 10:10 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.374444,+-81.635303(24166)&iwloc=A&hl=en\"> mufon case (24166) map </A>","Region":"Ohio","Object Features":"Undisclosed","divs":["Sighting DetailsMy two friends and I were driving on I-77 south, 2 miles before the pleasant valley exit, when I looked through my sunroof and saw the UFO which was the size of a dime. It was hovering at helecopter height but made no sound. It stayed stationary directly above me for some time. It had a clear circlular shape with an orange glow around the whole craft. At the center was a bright red light. As I exited the highway and came to a stop at the traffic light, I saw the object move slowly then quickly vanished as I took my eyes off it breifly, it only had seconds to move far enough for me to no longer see it. Note that as the distance between me and the object grew, less of the orange light was visible. Also its glow lost the perfectly circular shape as the light was only visible on the bottom half of the object due to the angle that I was observing the now disk shaped object. The red light was only visible directly under the craft. It only took a short distance for it to disappear. During the encounter, the object stayed relativly close to my postion, which was close to a large electrical sub-station. All three people in the car agree on the caracteristics and did not have characteristics of a helicopter, plane, blimp, etc."],"Disposition":"IFO","trends":["There have been 2 other sightings in Independence","There were no other sightings in Independence on or around July 4th 2010"],"Summary":"Glowing orange circle at helecopter altitude stationary then moving","City":"Independence","files":["/var/www/straped/mufon/html2text/24166.html.txt","/var/www/straped/mufon/org/24166.html"],"Object Shape":"Circle","Log Number":"US-07052010-0019","Country":"United States"}