{"Object Shape":"Disc, Fireball, Sphere","Source":"MUFON","Longitude":"-86.067371","Country":"United States","trends":["There have been 19 other sightings in Peru","There were no other sightings in Peru on or around July 5th 2010"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Case Number":"24167","Date of the Event":"07/05/2010 01:30 UTC","Latitude":"40.762693","Object Flight Path":"Straight-line path","City":"Peru","Disposition":"IFO","Log Number":"US-07052010-0020","Object Features":"Appendage(s)","Summary":"Orange fireball, silent, traveling in straight line East-Northeast.","Date Submitted":"07/05/2010 02:30 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.762693,+-86.067371(24167)&iwloc=A&hl=en\"> mufon case (24167) map </A>","Region":"Indiana","files":["/var/www/straped/mufon/html2text/24167.html.txt","/var/www/straped/mufon/org/24167.html"],"divs":["sighting detailsi was pulling up behind my house when i saw an orange light in the sky coming in my direction, being the fourth of july night i assumed fireworks. it didn't fade, explode or change directions, i live by an air base so i thought strange plane at this point, i shut off my car and music and got out to listen to see if it made a jet noise, it was probably within a half mile of my location at this point. no sound whatsoever! i was freaked out at this point and ran inside to grab my wife to see it too to make sure i wasn't crazy, by the time we got back outside it was traveling away from us, she was blown away-she also saw four silver\\white legs equidistant around the center which was an orange, glowing spinning sphere. it went east-northeast not more than 1500-2000 ft off the ground, about 45 sec to 1 min speed horizon to horizon. it disappeared behind some trees and we couldn't get in location to see it anymore. we were amazed and in disbelief at what we saw. i got on here and saw others around the country saw the same thing and had to share."],"Tags":"City"}