{"Longitude":"-122.483289","Summary":"Rapid then slow moving object similar in appearance to a star suddenly brightened and changed color.","Date of the Event":"07/04/2010 10:44 UTC","files":["/var/www/straped/mufon/html2text/24164.html.txt","/var/www/straped/mufon/org/24164.html"],"Object Shape":"Star-like","Disposition":"Unknown","Sighting Duration":"00:01:30","map":"<A HREF = \"http://maps.google.com/maps?q=37.615945,+-122.483289(24164)&iwloc=A&hl=en\"> mufon case (24164) map </A>","Weather Factors":"None","trends":["There have been 6 other sightings in Pacifica","There were no other sightings in Pacifica on or around July 4th 2010"],"Region":"California","Object Features":"None","Case Number":"24164","Tags":"City","City":"Pacifica","Country":"United States","Source":"MUFON","Latitude":"37.615945","Log Number":"US-07052010-0017","Date Submitted":"07/05/2010 02:24 UTC","divs":["Sighting DetailsI was viewing neighborhood fireworks from my backyard. I saw a rapidly moving object which looked similar to a star in appearance. The object was at an extremely high altitude and alternating speeds from fast to slow. The object's travel path was slightly curved. While curiously viewing the object, it suddenly stopped, became tremendously bright similar to a camera flash, and changed colors from white to red. After two or three seconds, it resumed its star-like appearance and continued to travel in its curved path at varying rates of speed. Upon viewing the object for an additional thirty seconds or so, it abruptly disappeared. As soon as the original object disappeared, another star-like object appeared and was traveling in the opposite direction at varying rates of speed. I proceeded to view this object for approximately thirty seconds before it traveled out of my sight. The entire encounter lasted for about a minute and a half. My wife was witness to the second object which I saw. I must admit that I became a bit spooked when the object flashed because it appeared to flash in my direction even though it was so far away. Definately not fireworks. The objects were in view for a long time, and they were very high in the air. Definately above the level of any planes that we would ever see flying overhead."],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path"}