{"Country":"United States","Latitude":"43.002011","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/2416.html.txt","/var/www/straped/mufon/org/2416.html"],"Sighting Duration":"00:00:59","Summary":"Manlius New York Sighting","Date of the Event":"07/03/2003 08:25 UTC","Log Number":"","Weather Factors":"Unknown","trends":["There has been one other sighting in Manlius","There were no other sightings in Manlius on or around July 3rd 2003"],"Source":"MUFON","Region":"New York","Object Shape":"Oval","divs":["Sighting DetailsOn July 3rd at approximately 835 pm on Broadfield Road in Manlius N.Y. My cousinand I observed a wingless oval shaped object traveling from East to West forapproximately 15-20 seconds overhead ,before it went behind the areas trees. Theangle of observation was from approximately 85 degrees to 50 degrees relative tothe horizon. The relative comparative size of the object was equal to the sizeof an aspirin tablet held at arms length. The object appeared to metallic andwas a dark copper color and appeared to reflect the setting suns rays and as aresult it had gold highlighting. The object emitted no sound or contrail. Theobjects speed was approximately the same as commercial jet airliner at a mediumhigh cruising altitude. The night was clear except for a few cirrus cloud wisps,which the object was visually below. After the sighting we stayed out side forsome time hoping we would see the object again which we did not, however uponleaving at 1000 pm we observed a white light traveling a very high speed fromSouthern to Northern direction in the western sky, which covered the wholevisible sky in approximately 5 seconds and then disappeared.09Report filed with FAA Hancock airport Syracuse with the above details."],"Disposition":"IFO","City":"Manlius","Date Submitted":"07/03/2003 08:25 UTC","Longitude":"-75.976863","Case Number":"2416","map":"<A HREF = \"http://maps.google.com/maps?q=43.002011,+-75.976863(2416)&iwloc=A&hl=en\"> mufon case (2416) map </A>","Tags":"City"}