{"Case Number":"24163","Object Shape":"Fireball","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/24163.html.txt","/var/www/straped/mufon/org/24163.html"],"Object Flight Path":"Straight-line path","Country":"United States","City":"Arlington Heights","Log Number":"US-07052010-0016","map":"<A HREF = \"http://maps.google.com/maps?q=42.09346,+-87.979586(24163)&iwloc=A&hl=en\"> mufon case (24163) map </A>","Source":"MUFON","trends":["There have been 4 other sightings in Arlington Heights","There were no other sightings in Arlington Heights on or around July 3rd 2010"],"Latitude":"42.09346","divs":["Sighting DetailsI was attending the horse races with my family and the races were over and the fireworks were about to start. They wait for it to be dark before they start the fireworks and someone I was with my wife girlfriend said hey look a ufo or something like that. The three of us looked and it was no plane because its right by Ohara airport in chicago and the planes were coming in with the firework show I though they or looked like at times a couple of the planes could get hit. Anyway we saw it three time moving the same speed as a plane(maybe a little slower) but it looked orange or yellow in the middle sorrounded by a oranger color almost like a fireball or flame it moved across the sky in the same location three time in a total of 10 mins I saw it for the third time. I was too busy trying to show and tell other people and whatching it that I didn't think about a phone picture it would of looked like crap anyway.... If it was an alien race should they be smart enought as not to make it so obvouise to know its a ufo or just enough to show the people with an open mind"],"Summary":"A fire looking object flying by 3 times.","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-87.979586","Date of the Event":"07/03/2010 09:15 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","Region":"Illinois","Weather Factors":"Unknown","Date Submitted":"07/05/2010 02:15 UTC"}