{"Object Shape":"Oval, Other, Unknown","Case Number":"24174","Country":"Canada","Longitude":"-84.34009","trends":["There have been 6 other sightings in Sault Ste. Marie","There were no other sightings in Sault Ste. Marie on or around April 13th 2006","This sighting has been favorited 1 time.",""],"Region":"Ontario","Sighting Duration":"Undisclosed","divs":["sighting detailson april 13, 2006 i was sitting on my couch and had my camera beside me because the day before i was driving home from picking my 2 boys up from school when i saw a silver,shiny, disc shaped craft hovering over the water( st mary's river) not moving at all. i slammed on the brakes and just starred at it. in disbelief i asked the boys who were 6 and 9 at the time if they were seeing what i saw. the boys said mom is that a ufo. at that point i knew i was not going crazy and they were seeing what my eyes were. it was not that far from us it was about 150 feet infront of us and as wide as the road. the road ends at the water with my street going vertical to the water.the disc was so shiny like aluminum or even crome. it had no seams , windows or doors, just solid shaped as a disc, like a horizontal oval. the next night on april 13, 2006 is when i saw something in my front yard and i actually got many pictures and a video of it(a short video). i have not wanted to come forward with this because i am an upstanding member of my community, i coach sports and don't want to be thought of as a nut case. but i cannot stop thinking about what happen ed to me that night and i need to share my evidence to prove that they really do exist and i have many different pictures from many different times. i will share my evidence with you but i am not comfortable dicussing what happened to me after i took the pictures(not yet anyway) and i want to forget it. although i want to share every piece of evidence i have with you. the pictures in my front yard were of lights (they were red and white and i think with brightening the pictures you can see part of a craft and honestly i think of the being . it looks just like the pictures that everyone describes them of with the big head and about 4 feet tall. to see this in the pictures you need the brighten and magnify them as the pictures were taken at night through my front window. i have had several encounters, so have my parents.in the 1950's my great uncle *name deleted--sgonzalez\\cms who is 87 now was fishing on a lake with a friend and watched as a ufo disc shaped land on shore and he said he saw two beings in silver suits get out and take samples of the water and the soil before he hurried to get to shore. before he is gone i hope that someone documents what happened to him as well.to get back to april 13, 2006 the lights were so bright that it seemed like spot lights shining in through the window while i was watching t.v.there was no sound at all. it's like it landed on my front lawn. my front lawn has large pine trees all along the front. the moon is on the pictures so you can judge size. i was so scared but i knew what it was when i pulled the blinds back to look because of what had happened to me the day before. it sounds crazy to even tell this but this is true and people need to know what is happening and that they are around us everyday. any way i have so much more to tell, but this is enough for now. if you would like more information, please contact me because i feel what i have experienced is more than most and my family has other personal experiences on top of my own. i am not he best at describing things , i hope this is good enough. i will try to send my pictures with this. i could only send 3 i hve more pictures that go with this."],"Disposition":"Unresolved","Viewing Distance":"21-100 Feet, 101-500 Feet","Tags":"City","Source":"MUFON","Latitude":"46.527358","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.527358,+-84.34009(24174)&iwloc=A&hl=en\"> mufon case (24174) map </A>","files":["/var/www/straped/mufon/html2text/24174.html.txt","/var/www/straped/mufon/more/24174_submitter_file1__DSCF0911.jpg","/var/www/straped/mufon/more/24174_submitter_file2__DSCF0912.jpg","/var/www/straped/mufon/more/24174_submitter_file3__DSCF0913.JPG","/var/www/straped/mufon/org/24174.html"],"Date Submitted":"07/05/2010 05:12 UTC","Object Features":"None","Date of the Event":"04/13/2006 10:50 UTC","Log Number":"CA-07052010-0027","Summary":"I saw lights outside my front living room window, I grabbed my camera and started taking pictures and short video. The lights were like helicopters were shining in with no sound, I think I have pictures of craft and beings.pictures must be magnified.","Object Flight Path":"Stationary,Other","City":"Sault Ste. Marie"}