{"City":"Vancouver","map":"<A HREF = \"http://maps.google.com/maps?q=45.647078,+-122.659956(24173)&iwloc=A&hl=en\"> mufon case (24173) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/24173.html.txt","/var/www/straped/mufon/org/24173.html"],"Country":"United States","Source":"MUFON","Tags":"City","divs":["sighting detailsaround 11:25 pm on july 4, 2010 i was inside my house looking at fireworks from our front window when i noticed multiple reddish- orange\\white objects (12-18) at varying levels of altitude traveling in a general northeast to southwest direction. they caught my attention as they did not disappear immediately, as fireworks do, and there were multiple distinct objects. i observed them for 1-2 minutes. they were traveling in direct relationship with each other. they were neither fireworks, flares, weather balloons or aircraft that i could identify. i then called my husband to look at them and he ran outside and he could not identify them either(he is an airline captain). we watched as the group flew in loose formation at different altitudes. my husband got a camera out of the house but was unable to get a picture of them. as he was attempting to take pictures, a small airplane started flying over our house in a south\\southwest direction towards portland international airport and as it approached the group of objects, from our line of sight, the objects started to independently blink out until they had all disappeared. a military neighbor ran over to our house and said he saw them from the corner of his eye and could not determine what they were. the objects did not reappear. all of our reactions were that we had seen a group of ufo objects. we were not happy that we were unable to get pictures of them before they blinked out. there was a feeling of unreality of our actual sighting and we are still processing those feelings."],"Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Latitude":"45.647078","Disposition":"Unknown","Object Shape":"Diamond","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2010 04:02 UTC","Region":"Washington","Weather Factors":"Unknown","Case Number":"24173","Log Number":"US-07052010-0026","trends":["There have been 54 other sightings in Vancouver","There were 2 other sightings in Vancouver on or around July 4th 2010"],"Longitude":"-122.659956","Summary":"12-18 reddish-orange/white objects traveling in uneven formation NE to SW.","Date of the Event":"07/04/2010 11:25 UTC"}