{"Date Submitted":"07/05/2010 05:48 UTC","City":"Cleveland","trends":["There have been 47 other sightings in Cleveland","There were 2 other sightings in Cleveland on or around July 4th 2010"],"divs":["Sighting DetailsI was waiting to watch the Cleveland fireworks begin last night on the shores of Lake Erie when suddenly a large red fireball appeared 5000' to the west of my position at an altitude about 800'. The craft just seemed to appear in the burst of a residential non-commercial firework. Initially catching my eye because it looked stationary and not moving. It looked 40 to 60 feet or more across, circular in shape, solid red in color with a hint of white. Much like the running lights of a boat with the anchor light behind as if approaching you from the port bow. I estimate the fireball was half the size of my pinkie fingernail at an arms length away at first. There was also a commercial type aircraft further off to the west when I noticed the strange light. The other aircraft was traveling north to south with strobe and aviation lights working at an altitude of roughly 2000'. I mentioned to the others that also observed this, FAA regulations would require the craft to have proper lighting as did the more distant aircraft. The fireball object slowly approached flew nearly directly overhead then sort of blinked before it completely disappeared at about 700 yards or so to the east. The craft remained red in color as it passed overhead, but, seemed to shape shift from circular to a thimble shape before it vanished. Several people in my immediate vicinity noticed the craft yelling out \"look it's a UFO\" and \"that was really abby normal\" I was at Wendy Park located next to the Whiskey Island Marina just west of the mouth of the Cuyahoga River very near Downtown Cleveland. I believe several hundreds of other people may have witnessed this as well, the incident occurred at 9:56 pm."],"Latitude":"41.505825","files":["/var/www/straped/mufon/html2text/24175.html.txt","/var/www/straped/mufon/org/24175.html"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Region":"Ohio","Tags":"City","Country":"United States","Case Number":"24175","map":"<A HREF = \"http://maps.google.com/maps?q=41.505825,+-81.690209(24175)&iwloc=A&hl=en\"> mufon case (24175) map </A>","Log Number":"US-07052010-0028","Disposition":"IFO","Sighting Duration":"Undisclosed","Summary":"Large red fireball appeared 5000' to the west at an altitude 800' flew nearly directly overhead then suddenly vanished about 700 yards to the east.","Object Features":"Other, Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Fireball","Date of the Event":"07/04/2010 09:56 UTC","Source":"MUFON","Longitude":"-81.690209"}