{"Region":"Kentucky","Log Number":"US-07052010-0023","Date of the Event":"07/04/2010 12:00 UTC","Object Flight Path":"Path with directional change,Path then hovering","Country":"United States","files":["/var/www/straped/mufon/html2text/24170.html.txt","/var/www/straped/mufon/more/24170_submitter_file1__UFO2.jpg","/var/www/straped/mufon/more/24170_submitter_file2__UFO3.jpg","/var/www/straped/mufon/more/24170_submitter_file3__ufo6.jpg","/var/www/straped/mufon/org/24170.html"],"Object Features":"Other, Unknown","Latitude":"38.258555","Longitude":"-85.754726","map":"<A HREF = \"http://maps.google.com/maps?q=38.258555,+-85.754726(24170)&iwloc=A&hl=en\"> mufon case (24170) map </A>","Source":"MUFON","Date Submitted":"07/05/2010 03:06 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 67 other sightings in Louisville","There were 5 other sightings in Louisville on or around July 4th 2010","This sighting has never been favorited.",""],"Case Number":"24170","Tags":"City","divs":["Sighting DetailsI was at a concert on Louisville's watefront. (1,000's in attendance)(Kentucky-side, facing Idiana on Ohio river) It was sundown and music was definitely in full swing. I guess because it was fourth of July many people were looking up at helicopters or planes flying into SDF airport. I forget which one of us noticed it, but my boyfriend and I saw what seemed to be a red-orange glowing craft. Burning, moreso than glowing like a light. It was at a very high altitude but you could tell it was moving east at an incredible rate. It didn't jump around or go from point A to B in a snap as some people describe sightings. But it wasn't hovering either. You could just tell that it was way higher than a plane would be around an airport but moving across the sky as a whole super-fast. I imagine this thing was actually very huge to scale. As we were on our way to the port-o-john's, we noticed others saw the exact same thing. Then, following it with our feet and our eyes, we noticed 2 others way further east up-river. It seemed as though they were rotating around eachother and us, and then disappeared into the sunset. Like you could blink your eye and they were no more! I got super excited to see my first UFO as well as my boyfriend as we are firm believers and further more skeptical of government cover-ups. As excited as I am, i also feel betrayed as the government cannot seem to open up and that we do want to meet them!!!"],"City":"Louisville","Viewing Distance":"Over One Mile","Object Shape":"Chevron, Fireball, Star-like","Summary":"Orange glow, slightly white in middle, up at great altitude, but moving extremely fast."}