{"Tags":"City","Log Number":"US-07052010-0035","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.353159,+-88.834547(24182)&iwloc=A&hl=en\"> mufon case (24182) map </A>","Date Submitted":"07/05/2010 10:11 UTC","Case Number":"24182","Longitude":"-88.834547","Region":"Illinois","divs":["Sighting DetailsA group of us were in a yard having just watched the local fireworks when a neighbor pointed to the sky and asked, \"what's that?\" We were in a 3 acre open field facing south toward the Illinois River. There was a glowing orange light moving from the South-southwest to the North-northeast. It was silent, at appr: 5k alt and speed was approximately 150mph. We thought it might be a remaining incindiery from the fireworks, except for the speed and the fact that the light burned steady. There was some discussion as to chinese lanterns, but the speed was too much. Winds were only gusting up to 16 or 17mph. About 30 seconds later another transited along the same vector but on a slightly different path parallel to the first one. This second one was viewed by the entire group. I watched it disappear to the horizon maintaining it's altitude and speed. Finally, there was a third one that did the same thing. My neighbor claims he saw a fourth one prior to everybody noticing the other three, but I did not witness it. My neighbor also claims that he could make out a dome shape above the light, but I couldn't discern a shape. I'm a combat veteran and have seen just about everything that there is in the sky. I've seen tracer fire, flares, combat aircraft, ballistic devices, etc. I can come up with no comparison for what I witnessed."],"Country":"United States","Object Features":"Undisclosed","Latitude":"41.353159","Date of the Event":"07/04/2010 12:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Ottawa","There were no other sightings in Ottawa on or around July 4th 2010"],"Summary":"Several fast moving orange lights moving at appr 5k altitude.","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24182.html.txt","/var/www/straped/mufon/org/24182.html"],"City":"Ottawa","Object Shape":"Unknown"}