{"Object Shape":"Circle, Fireball, Sphere","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"07/04/2010 09:15 UTC","Case Number":"24186","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Murfreesboro","Tags":"City","Summary":"Bright (glowing) orange light moving slowly in a straight line across the sky, then changing direction - disappeared, then re-appeared.","Date Submitted":"07/05/2010 10:58 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.849551,+-86.38877(24186)&iwloc=A&hl=en\"> mufon case (24186) map </A>","Latitude":"35.849551","divs":["Sighting DetailsMy girlfriend and I were enjoying the fireworks display in my subdivision.(located on Indian Park Dr in Murfreesboro, TN) There were a lot of fireworks being set off by a lot of people who live around me. But this was CERTAINLY NOT a firework. A bright orangish circular light appeared, moving in a straight line above the apartment complex, then made a 90 degree turn until moving slowly out of sight. We both looked at each other with the same expression and said what in the world is that? My girlfrend said she thought it looked like a plane on fire. But it looked like it was moving too slow and made no airplane or helicopter noise. I was sorta freaked out to say the least and my girlfriend was too. We continued to watch the fireworks and about 10-15 minutes later, the same light re-appeared! I told my girfriend to keep it in her line of sight and I ran into my house and grabbed some binoculars. While looking through the binoculars, I really couldn't make out any more detail other than it was a big orangish glowing light moving slowly in the sky. The light finally started to dim. Only when the light was out completely, was I then able to see the actual full shape and size of the object. This sent chills through my body. It was a deep dark, much larger black sphere, circular in shape. The actual size of the sphere made the orange light look small in comparison to the full shape of the object. I watched it through the binolculars until it went behind the rooftops of the apartments across the street. Entire incident lasted from around 9:15pm - 9:40pm CST approx."],"Longitude":"-86.38877","Object Features":"Undisclosed","Country":"United States","Log Number":"US-07052010-0039","Region":"Tennessee","Weather Factors":"Unknown","trends":["There have been 18 other sightings in Murfreesboro","There was one other sighting in Murfreesboro on or around July 4th 2010"],"files":["/var/www/straped/mufon/html2text/24186.html.txt","/var/www/straped/mufon/org/24186.html"]}