{"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Disposition":"Unknown","Source":"MUFON","Log Number":"US-07052010-0037","Case Number":"24184","Summary":"Red sphere with halo around it making horizon to horizon pass from east to west over Omaha.","divs":["sighting detailswe live in omaha, and have a close afb, offut, or the hq for strategic air command for the us air force, so naturally i thought it was a plane\\jet. well as it come closer the red blob, mistaken for blurry jet lights was now spherical, or at least circular, to high and nothing behind it for dimentional aspects, but it looks like a type of red plasma like fire in the center of a ring like a dull corona, and it was moving at top speeds based on the appearance of it's altitude making a full horizon to horizon pass in about 20 seconds, but this was not a satellite, it did not make a curved pass like a satellite would following the earth's orbit, this was inside the orbit and actually appear to stop for a second. omaha has a lot of celebratory activity the days leading up to and on independance day. without being exagerating, there were so many firework displays from private citizens, that all of the metro area look like it was under a dense fog advisory...but it was all just firework smoke. this occured on the 3rd, and 4th, and i thought it was a firework after i knew it wasn't an aircraft, and got the neighborhood out to confirm i wasn't being fooled by a prank, or my eyes deceiving me. this was my 3rd encounter, the first being 15 years ago when i saw a grey\\white sphere with no markings or lights over tucson arizona during daylight after looking directly above me."],"Region":"Nebraska","files":["/var/www/straped/mufon/html2text/24184.html.txt","/var/www/straped/mufon/org/24184.html"],"Object Shape":"Sphere","Object Features":"None","trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around July 3rd 2010"],"Country":"United States","Date of the Event":"07/03/2010 08:30 UTC","City":"Omaha","Longitude":"-95.989878","map":"<A HREF = \"http://maps.google.com/maps?q=41.257003,+-95.989878(24184)&iwloc=A&hl=en\"> mufon case (24184) map </A>","Tags":"City","Date Submitted":"07/05/2010 10:18 UTC","Sighting Duration":"Undisclosed","Latitude":"41.257003","Viewing Distance":"Over One Mile"}