{"files":["/var/www/straped/mufon/html2text/24196.html.txt","/var/www/straped/mufon/org/24196.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.049604,+-86.462388(24196)&iwloc=A&hl=en\"> mufon case (24196) map </A>","City":"Lebanon","Object Shape":"Other","Tags":"City","Summary":"HUGE orange balls of light moving across Lebanon, IN.","Region":"Indiana","Weather Factors":"Unknown","divs":["Sighting DetailsI was over at my friends house in Lebanon, IN for a cookout and 4th of July fun. No drinking or booze of anykind was allowed. We (around 20 friends)all moved our chairs out to the street at 10PM because we could see the fireworks from there and didn't have to mess with the traffic afterwards. After the firworks were done, one of our friends was sitting on a blanket by the street, and she just happened to look directly East and said what is that. The fireworks lasted 20 minutes over Lebanon, IN so it was around 10:20 PM. It was huge reddish-orange ball of light moving from the SW to the NE..It was more orange than red but had a slight reddish tint. I mean it was huge. We dismissed it as a I don't know thing and shot some more fireworks. Then another one, then another one following the same path. Seemed they were in a line formation. One of them seemed to circle the town as we watched it but then it seemed to follow the others in a North East direction. The speed seemed to be just crusing speed, whatever that would be for something like this. We then said, maybe it is Chinese lanterns but when they hopped around in a up and down altitude dance and one circled the town, we didn't think any lanterns could do that. They were completely silent. There were 4 in total and whatever it was seemed very interested in what was going on over the town. If these were in fact Chinese lanterns then they were the size of a big-butted hot air balloon if not bigger and certainly had maneuver capabilities. Just another something that we can't explain."],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Log Number":"US-07052010-0048","Latitude":"40.049604","Case Number":"24196","Viewing Distance":"Unknown","Date of the Event":"07/04/2010 12:00 UTC","Source":"MUFON","Country":"United States","Disposition":"Insufficient Data","Object Features":"Undisclosed","Date Submitted":"07/05/2010 11:52 UTC","Longitude":"-86.462388","trends":["There have been 4 other sightings in Lebanon","There were no other sightings in Lebanon on or around July 4th 2010"]}