{"Log Number":"US-07052010-0043","Object Shape":"Square, Rectagular","Object Features":"Unknown","trends":["There has been one other sighting in Streamwood","There were no other sightings in Streamwood on or around July 4th 2010","This sighting has never been favorited.",""],"Country":"United States","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.030023,+-88.173238(24190)&iwloc=A&hl=en\"> mufon case (24190) map </A>","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"07/05/2010 11:32 UTC","Weather Factors":"Unknown","Case Number":"24190","Region":"Illinois","divs":["Sighting DetailsAround 10:45 pm on July 4, 2010 we had three separate objects fly overhead. We had finished our fireworks display about 20 minutes earlier. There were 10-12 people who all saw the lights. Across the street another 4-5 people saw it as well. One person said it was a hot air balloon with the burners lit. We quickly shot that thought down. The sightings were a few minutes apart. The first object flew in from the SW going east by NE. I would say at a height of 2000-3000 ft up.Air speed was 300 -400 MPH based on what a single engine plane appears to be flying over head. It was two three times faster then that. No noise was heard. In about 30 seconds we could not see it anymore. I contacted the local police department via 911 and asked if anyone else was reporting what we where seeing. They stated no. About two to three minutes later, another light came in from the south and turned and followed the path of the first one. I called the police again and said we just saw another light exactly like the first one. They asked if we wanted an officer dispatched and we said yes. Again, we heard no sound from the object. Hot air balloons don't turn 90 degrees like the second object. We all were like what are these things. Everyone was watching them until it just disappeared out of sight. A few of us gathered in the street talking about it. When the third object appeared; this one came in from the South by Southeast. It flew to the same area as the first two objects and changed direction following the path of the previous two. I pulled out my cell phone and got 3 pictures one very bright. One showing the object smaller and further away and the last; it just looks like a red orange dot in the sky. The police showed up around 5 minutes later. The officer was a women who appeared she did not want to be bothered with us. I told her we saw three objects and they all headed east. she said she just came form that way and saw nothing. I said by time you got the call they probably were over Lake Michigan already. She made no official report. I believe in what I saw, everyone saw the same thing. I guess I was the most excited by it. No fear it was like whoa cool. They just flew off until we could no longer see them. Each time we watched them for 15-30 seconds. I have no cable to take the pictures off the phone so I had to email them to myself I hope they are clear."],"files":["/var/www/straped/mufon/html2text/24190.html.txt","/var/www/straped/mufon/more/24190_submitter_file1__ufo.JPG","/var/www/straped/mufon/more/24190_submitter_file2__ufo2.JPG","/var/www/straped/mufon/more/24190_submitter_file3__UFO3.JPG","/var/www/straped/mufon/org/24190.html"],"Latitude":"42.030023","Longitude":"-88.173238","City":"Streamwood","Summary":"Three bright orange reddish rectangular objects seen by 12-15 people.","Disposition":"Unresolved","Date of the Event":"07/04/2010 10:45 UTC"}