{"map":"<A HREF = \"http://maps.google.com/maps?q=39.599022,+-75.742982(24199)&iwloc=A&hl=en\"> mufon case (24199) map </A>","City":"Newark","Source":"MUFON","divs":["sighting detailsmy boyfriend and i were sitting on our back deck watching the fireworks (newark, de)around 10:15 p.m. then all of the sudden we looked up and heading in a northerly direction were these 2 triangluar orange lights. at first i thought them to be ashes or something to that effect from fireworks but my boyfriend said there is no way b\\c of the way they were flying in too exact of a formation. there was no sound, no blinking lights like it could have been planes. he went inside and i was sitting there watching the sky and a single one flew over. tried to get a picture, but nothing came up on the screen. again it was heading in a northerly direction. about 5 minutes later 2 more went by in the same direction. to both of us they seemed to be small triangluar lights orange in color and my boyfriend seems to think the bottom of the first 2 were like a bright red. it was the strangest thing i ever saw and have ever experienced. just seems like they flew over the house and then seemed to disappear once they got a little further away from where we were. to be honest, i don't know what to think, i can't explain it. the boyfriend who does believe in other life, believes they were ufo's."],"Object Flight Path":"Straight-line path","Object Shape":"Triangle","Country":"United States","Viewing Distance":"101-500 Feet","Log Number":"US-07052010-0049","trends":["There have been 11 other sightings in Newark","There were no other sightings in Newark on or around July 4th 2010"],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/24199.html.txt","/var/www/straped/mufon/org/24199.html"],"Sighting Duration":"Undisclosed","Case Number":"24199","Weather Factors":"None","Longitude":"-75.742982","Date of the Event":"07/04/2010 10:34 UTC","Tags":"City","Date Submitted":"07/05/2010 12:54 UTC","Latitude":"39.599022","Disposition":"IFO","Summary":"5 orange triangle lights went by last night and then sort of disappeared.","Region":"Delaware"}