{"divs":["sighting detailsat approximately 2300hrs on the night of july 4, 2010 in dickson, tn: i was at a friends house for the evening visiting. we were in the backyard at approximately 2300hrs and one of my friends noticed something in the sky. when i looked up i seen an object in the sky coming from the west\\southwest at a very slow rate of speed. it almost seemed to be \"floating\" and appeared to be very low, maybe 1500-2000ft elevation. the object was traveling towards us, or east\\northeast. it appeared to be almost directly above us, then gradually turned back heading northwest. the object was amber or orange in color, and seemed to be sphere shaped. there were no apparent flashing lights, it was just one glowing light. no sounds were associated with this object, it was silent. no other aircraft were observed. i knew as soon as i had seen it that i was seeing something i had never seen before, beyond a shadow of a doubt. i have in the past seen objects in the sky and wondered what they were and was able to identify them. i am familiar with satellites, helicopters and other such various aircraft. it was clearly none of those. as for the size it was approximatley three to four times the size of the planet venus in the early evening sky. it made no sudden movements and was very smooth and slow."],"Source":"MUFON","Object Flight Path":"Path with directional change","Object Shape":"Oval, Sphere","Longitude":"-87.38779","City":"Dickson","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.077005,+-87.38779(24206)&iwloc=A&hl=en\"> mufon case (24206) map </A>","Summary":"Orange in color. slow moving, low elevation. smooth movement, no sudden movement or side to side.","Log Number":"US-07052010-0056","Region":"Tennessee","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"07/05/2010 02:19 UTC","Case Number":"24206","files":["/var/www/straped/mufon/html2text/24206.html.txt","/var/www/straped/mufon/org/24206.html"],"Weather Factors":"None","Tags":"City","Object Features":"None","Latitude":"36.077005","Date of the Event":"07/04/2010 11:00 UTC","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Dickson","There were no other sightings in Dickson on or around July 4th 2010"]}