{"Date Submitted":"07/05/2010 02:14 UTC","divs":["Sighting DetailsMyself (father) and family and friends,7 total were in front yard shooting aerial fireworks along with neighbors across the street from us. We will in a friendly competition to see who had the biggest, most showy aerial firework. We had been lighting up the sky for 40 minutes or so prior to the sighting. It had been raining and the sky was totally overcast with a low ceiling of clouds. I was about to light so more aerial shots as we were in the middle of our celebration and I saw a bright orange sphere or ball of light coming toward us from the southwest to the northeast. Had it continued it;s course it would have traveled over and slightly in front of us. Since it was orange and had no red or green nav lights or strobes, I knew it was not a normal aircraft. It was below the cloud ceiling i would guess about 1500-2000 ft. in height moving slowly towards our location and displays. I said to my group , hey look at the ufo and everyone looked at the craft coming . I had a bright flashlight in my hand and in hopes of luring the craft closer I aimed it at the craft and turned it on and off several times in rapid succession. To my disappointment instead of luring it closer it changed direction from sw to ne to a west direction and accelerated in speed and grew smaller in light as it flew off into the cloud deck to the west. The glow or light if this craft was as bright as a landing light on a private airplane coming directly at you at its brightest."],"Longitude":"-95.988525","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=36.156792,+-95.988525(24204)&iwloc=A&hl=en\"> mufon case (24204) map </A>","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around July 4th 2010"],"Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Object Features":"Undisclosed","Case Number":"24204","Summary":"Red glowing sphere.","files":["/var/www/straped/mufon/html2text/24204.html.txt","/var/www/straped/mufon/org/24204.html"],"Date of the Event":"07/04/2010 11:00 UTC","City":"Tulsa","Object Flight Path":"Undisclosed","Latitude":"36.156792","Log Number":"US-07052010-0054","Disposition":"Unknown"}