{"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-117.390696","Object Flight Path":"Straight-line path","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.958609,+-117.390696(24214)&iwloc=A&hl=en\"> mufon case (24214) map </A>","files":["/var/www/straped/mufon/html2text/24214.html.txt","/var/www/straped/mufon/org/24214.html"],"Tags":"City","Case Number":"24214","Country":"United States","Latitude":"33.958609","Region":"California","divs":["Sighting DetailsI was sitting in a coworker's office, in the Riverwalk area, with my husband having a discussion. As we talked and laughed, I looked out of the window, behind her and saw a white, circular object float across the sky. It was large enough that I could see it clearly and it was a circle with undefined edges, almost like a puff or a dandelion, but BIG. It was distinctly not a cloud, however. As there were none in the sky. The sky was blue, clear and the sun was bright, at the time. I cannot give specifics, numberwise, on its size, distance from me or distance from the ground. I just know I saw something. Something that was not a disc, triangular or rectangular. It was circular. I was facing North and the object moved slowly towards the East-towards the direction of the 15 Freeway, in a linear path. It was not darting about, and it was not lightening fast. It was slow and consistent. The experience didn't last long. I remember thinking it was a large dandelion, though it didn't dance on the wind, but then the object flickered and vanished. Though my view was unobstructed, I moved to my right, looking further to the left of field of vision, to see if I could see it further along. It was nowhere in sight! I stopped speaking mid-sentence and my jaw dropped. I was confused because things don't just disappear before your eyes. I may have managed to mumble, \"What's that?\" or some semblance thereof. I know I nearly cursed when it disappeared because I didn't understand what had happened. Looking at my face, my coworker turned to look out the window, but it was gone! I explained what I saw, and though it is unthinkable, they knew I definitely saw something. Thinking back, the cirlce simply appeared in my view. I only tracked it visually for a quick moment. I wondered if anyone else saw it. Were there people outside, who had a better view? I've been waiting to hear something on the news, or read something online and now I've found this site, so I'm reporting it. UFO's in Riverside, who would ever have thought they were actually REAL?"],"trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around June 22nd 2010"],"Log Number":"US-07052010-0064","Source":"MUFON","Date of the Event":"06/22/2010 02:21 UTC","Sighting Duration":"Undisclosed","Object Shape":"Circle","Weather Factors":"None, Does Not Apply","Date Submitted":"07/05/2010 04:00 UTC","Summary":"It was a white circle that stood out against the blue sky.","City":"Riverside","Object Features":"None"}