{"Longitude":"-81.029414","Object Shape":"Circle","Tags":"City","files":["/var/www/straped/mufon/html2text/24212.html.txt","/var/www/straped/mufon/org/24212.html"],"trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around July 3rd 2010"],"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"34.00876","Object Flight Path":"Straight-line path","Country":"United States","divs":["Sighting DetailsWhile shooting fireworks with friends, I noticed a bright orange orb travelling across the sky. I pointed it out to the others who also saw it. I thought it was a \"luminaria\" or ballon-type firework or perhaps a parachute flare. The object seemed to be only 1-2k feet in altitude, and therefore not large. As the object travelled across the sky in a general ESE to WNW direction, I realized there was no wind to carry a balloon or parachute flare--the remnants of our firework mortars fell directly back to earth without drifitng away as would have happened with any breeze. The object made no sound and did not flicker or strobe, but instead glowed brightly so that a bit of an aura or \"haze\" surrounded the object. We watched the object until it travelled too far away to be observed. At no time did we discern any change in direction or speed or altitude. The event was not frightening, but was more of a curiousity. I felt that with an optical device or better ambient light it might have been possible to better identify the object. I would not have reported this except that I found so many other reported sightings of similar objects for this weekend...perhaps something in this report can help corroborate of determine a cause for the phenomenon."],"City":"Columbia","Disposition":"Unknown","Date Submitted":"07/05/2010 03:14 UTC","Date of the Event":"07/03/2010 09:20 UTC","Log Number":"US-07052010-0062","Weather Factors":"None","Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=34.00876,+-81.029414(24212)&iwloc=A&hl=en\"> mufon case (24212) map </A>","Case Number":"24212","Object Features":"None","Summary":"Glowing orange orb.","Viewing Distance":"501 Feet - 1 Mile"}