{"divs":["Sighting DetailsI was looking out the east window of my house at the fireworks and I noticed an orange light in the sky, at first I thought it was burning amber from a spent firework by the light remained constant and traveled from east to west. I grabbed my pair of binoculars and went outside to look at the object as it past over the house. As it did the light from the object began to dim down. I followed as long I could until the light was gone. However the fire works were illuminating the sky and I was able to see the outline of the object and looked up again threw my binoculars. It was a circular shape, gray colored. No identifiable markings were on this objects. No flashing lights or those red and green marker lights planes use. Then the object disappeared into the western sky. I then went inside for a bit only to come out again to lock my car, when I saw the object again coming the west going east. I observed for a few minutes then I ran back inside the house to get my father so I had a another witness to this. We then saw two more objects of the same kind in the northern sky moving east to west and then another object of the same kind came from the south was heading north. I have no clue what these objects were, I am not ruling out the possibility it was fireworks or some kind of airplane. However these objects were not behaving like fireworks or conventional aircraft."],"Longitude":"-96.677569","City":"Lincoln","Date Submitted":"07/05/2010 04:19 UTC","Tags":"City","trends":["There have been 42 other sightings in Lincoln","There were 2 other sightings in Lincoln on or around July 4th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.814822,+-96.677569(24215)&iwloc=A&hl=en\"> mufon case (24215) map </A>","Date of the Event":"07/04/2010 09:00 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/24215.html.txt","/var/www/straped/mufon/org/24215.html"],"Case Number":"24215","Country":"United States","Object Shape":"Fireball, Sphere, Star-like","Sighting Duration":"01:00:00","Weather Factors":"None","Region":"Nebraska","Source":"MUFON","Object Features":"None","Latitude":"40.814822","Summary":"Lincoln lights.","Disposition":"Unknown","Log Number":"US-07052010-0065","Viewing Distance":"Over One Mile"}