{"Object Flight Path":"Undisclosed","Summary":"High altitude star-like moving object.","Object Shape":"Star-like","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting Details I was out back of the house on our deck relaxing after fire works and smores. It was quite and no planes were visible. I do live approx 45 min from Pittsburgh airport but there was no visible traffic. On the 2 of July i went out back at night around 11pm to have a smoke and i looked up as i often do and i saw a star-like object move north-south in a straight line for almost the entire sky and then fade out. That was only the second time i have seen that in 10 years. Saw one in florida 10 years ago do same thing. So on the night of the 4th i decided to look up to see if i could find any more and sure enough at a maximum altitude i saw one moving west to northeast but it faded out quickly this time. not more than ten minutes later i saw another moving in same direction and it faded out just as quick. I love to watch the night sky and have never seen anything like this. Their altitude is what makes this very weird because there so high up u can hardly seem them and they blend in like a star if they were to stop it would just look like a star sitting still but because they move it's the only reason i noticed them. I know other people have witnessed this same thing and are shocked at first just like i was. I have no idea what the shape is because of the altitude and of coarse the was no sound either. The objects do not change color, speed or direction but do appear to change altitude because they fade in brightness. I do not believe i have witnessed planes , shooting stars, and i do not believe i am seeing satilites with the naked eye that dissapear. Would love to here a solid explanation. Thankyou"],"Date Submitted":"07/05/2010 02:51 UTC","Case Number":"24211","trends":["There have been 2 other sightings in Steubenville","There were no other sightings in Steubenville on or around July 4th 2010"],"Tags":"City","Region":"Ohio","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Latitude":"40.36979","Country":"United States","Date of the Event":"07/04/2010 11:47 UTC","Disposition":"IFO","City":"Steubenville","Weather Factors":"Unknown","Log Number":"US-07052010-0061","Longitude":"-80.633964","map":"<A HREF = \"http://maps.google.com/maps?q=40.36979,+-80.633964(24211)&iwloc=A&hl=en\"> mufon case (24211) map </A>","files":["/var/www/straped/mufon/html2text/24211.html.txt","/var/www/straped/mufon/org/24211.html"]}