{"Weather Factors":"Unknown","Disposition":"Unknown","Date Submitted":"07/05/2010 04:23 UTC","City":"Grand Rapids","Region":"Michigan","Log Number":"US-07052010-0066","Object Shape":"Star-like","Case Number":"24216","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had gone outside because the neighbors had been shooting off fireworks and I wanted to see what house they were coming from because they had hit my car the night before and melted a hole in the side of the bumper. I was visiting my grandmothers condo which in a rural area. When I went outside I took a moment to look up at the stars as I come from the metro detroit area and the sky is much brighter and clearer then I am used to. I was struck by a very bright star that was in a straight line of my sight. I gazed at and around that area and noticed that the star that caught my eye was moving! I wasnt sure if it was just my eyes playing a trick on me. It didnt move like a satellite which moves in a straight line. It almost looked like a top in the sky. moving in little circles. Then it would jump from here to there. I called my boyfriend on the phone and just sat in the driveway looking up in amazement. It looked like it was dancing in the sky. It mostly stayed on one area--staying sort of still then would move a little to the left, right, up, down. Then It started to move more to the south(it was in the eastern sky)then back to where I saw it before. It moved from more infront of me to more ontop of me. It did this for a while. It jumped around like a bug or something, then would move in a loop pattern. I just sat there with my mouth open-after about an hour of this thing moving around it just poof--disappeared. I am not sure what this was. All i know is I never saw a star move like that. I have seen satellites before and they move in a fairly straight line--this thing seemed to hover in one area--and then move here and there--then back to where it was. When I lost sight it just pop! was gone--and i was watching it very closely"],"Date of the Event":"07/04/2010 11:15 UTC","Latitude":"42.966409","files":["/var/www/straped/mufon/html2text/24216.html.txt","/var/www/straped/mufon/org/24216.html"],"Object Flight Path":"Path with directional change","Tags":"City","Longitude":"-85.676933","Summary":"Very erratic star like object.","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.966409,+-85.676933(24216)&iwloc=A&hl=en\"> mufon case (24216) map </A>","Viewing Distance":"Unknown","Source":"MUFON","trends":["There have been 45 other sightings in Grand Rapids","There was one other sighting in Grand Rapids on or around July 4th 2010"],"Country":"United States"}