{"Date of the Event":"07/05/2003 04:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2421.html.txt","/var/www/straped/mufon/org/2421.html"],"Country":"United States","Disposition":"Unknown","Tags":"City","Summary":"two ufos sighted over rend lake,illinois on july 5","Sighting Duration":"00:05:00","Case Number":"2421","trends":["There have been 3 other sightings in Benton","There were no other sightings in Benton on or around July 5th 2003"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.003046,+-88.917658(2421)&iwloc=A&hl=en\"> mufon case (2421) map </A>","City":"Benton","Log Number":"","Date Submitted":"07/05/2003 04:00 UTC","Latitude":"38.003046","Viewing Distance":"501 Feet - 1 Mile","Region":"Illinois","Longitude":"-88.917658","Object Flight Path":"Straight-line path","divs":["Sighting Detailsour family was at south Marcum beach near Benton, Il for my daughters 7thbirthday on the 5th of july swimming and awaiting the fireworks display laterthat night.While we were at the playground area watching an airplane carryingthree skydivers climb to about 3500 they were passed over at aprox 15,000 by twoobjects traveling north, the opposite direction. When one of my friends askedWhat is that, I first thought they were a couple of gulls flying together.Uponcloser examination, we noticed there were no wings and the objects were glowingor shimmering and they had a shape like a propane tank.The light from theobjects was a very pure white, and was unlike any we had ever seen. The objectscontinued to stay parallel to each other moving north at a steady speed. Wewatched the objects travel due north untill they were lost in the distance, atotal of aprox.two minutes. We were totally amazed at the sighting andimediately began to inquire among the people in the area. It appears that mostpeople were watching the skydivers. Hopefully some other people witnessed thephenomenom. We noticed how we were recieved when we said we saw a UFO, so we didnot make a big deal about it."],"Object Shape":"Oval","Weather Factors":"Unknown","Object Features":"Undisclosed"}