{"Longitude":"-81.393713","Object Shape":"Blimp, Bullet, Missile, Circle, Sphere","City":"Gilbert","trends":["There has been one other sighting in Gilbert","There were no other sightings in Gilbert on or around January 8th 2009"],"Latitude":"33.924312","Summary":"Green glowing ball of light.","Log Number":"US-07052010-0071","Sighting Duration":"Undisclosed","divs":["Sighting DetailsDriving down the road \"peach festival road\" heading to a friends house in gilbert,sc in my dads truck me an a friend alone no other cars....a green glowing ball came over the tree line and started to go up then darted back down almost like it was getting closer to us then turned extremely fast and hard alomst like it would have made a pinpoint turn an at a extremely high rate of speed it went so far up in the sky it disappered out of my view. Me or my friend didn't say anything until about 30 seconds later I asked \"did u see that\" he then replied \"u mean that glowing green thing\" I said yes an he said \"then yes\" we then laughed until we realized we had mo idea what that could have been the speed an sharp turning of that glowing object was almost unimagaineable. Its like it didn't turn but instead stoped on a dime and changed directions imediatly. We both to this day tell people we both saw the same thing at the same time. We were completely sober an don't do drugs....just 2 people that know what we saw. When I first saw it I thought it was small but as I kept watching it seemed to be larger an further away then I first thought....maybe as large as a city bus?"],"Tags":"City","Weather Factors":"Unknown","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date Submitted":"07/05/2010 04:59 UTC","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/24221.html.txt","/var/www/straped/mufon/org/24221.html"],"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Case Number":"24221","map":"<A HREF = \"http://maps.google.com/maps?q=33.924312,+-81.393713(24221)&iwloc=A&hl=en\"> mufon case (24221) map </A>","Date of the Event":"01/08/2009 12:00 UTC","Region":"South Carolina"}