{"Viewing Distance":"Unknown","divs":["Sighting Details Wile Sky Watching ,Comeing from the East going North a Glowing Red Sphere. I started heading North on Chesterfield Road from 24 Mile Road doing 40MPH when we could see It Over the top of the Car. We Stopped got out and looked at It (First Street on the East). It Looked Mushroom shape (No Sound) Not a Hot Air balloon Then I saw It was More then Just a Round Ball of Light. It Looked Like It was Going to Land as It was getting Bigger when It disappeared In the West Sky. We Saw It for 5 Mins. Then we drove up to the Burger King on 23 Mile Rd, Chesterfield Mi. Saw a Red Glowing Ball going from South to North. It did not look the Same as the Red Glowing Mushroom In the Sky. If MUFON were a App. on Cell Phones .Every Cell Phone User Would Be a Eye to the Sky. #1:I agree to the release of my contact information to third parties as part of the investigation into my report of a UFO sighting. #2:I do not agree to the release of my contact information to third parties as part of the investigation into my report of a UFO sighting. #1 and #2 Is the reason a lot of people dont report. It should say \"I agree to the release of my contact information to MUFON\" or \"I do not agree to the release of my contact information to any one but MUFON\""],"Latitude":"42.66281","Case Number":"24226","Object Features":"None","Country":"United States","Summary":"Red glowing mushroom in the sky.","Region":"Michigan","files":["/var/www/straped/mufon/html2text/24226.html.txt","/var/www/straped/mufon/org/24226.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.66281,+-82.842421(24226)&iwloc=A&hl=en\"> mufon case (24226) map </A>","trends":["There have been 2 other sightings in Chesterfield","There were no other sightings in Chesterfield on or around July 4th 2010"],"Object Shape":"Sphere, Unknown","Tags":"City","Date Submitted":"07/05/2010 05:33 UTC","Log Number":"US-07052010-0075","Date of the Event":"07/04/2010 10:45 UTC","Disposition":"IFO","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Chesterfield","Longitude":"-82.842421","Source":"MUFON","Object Flight Path":"Straight-line path"}