{"files":["/var/www/straped/mufon/html2text/24224.html.txt","/var/www/straped/mufon/org/24224.html"],"Object Flight Path":"Straight-line path","Case Number":"24224","Country":"United States","Tags":"City","Longitude":"-73.102431","divs":["Sighting DetailsMy mother and I were in our living room, standing at the front door, watching our neighbor's small fireworks display. She saw something unusual and asked me what I thought it was, so I looked to where she was pointing, and was baffled by the red-orange orb floating towards us. At first we thought it might be a plane, because it was smoothly floating through the air. However, its constant, intense light wasn't blinking. Perhaps, we thought, it might be one of the fireworks or a flare. However, the light was traveling horizontally towards our home, and not straight into the air. Its light didn't diminish in intensity, nor did it explode, have a trail of any kind, or make any sort of noise. Spellbound by this unusual orb, we watched it slowly follow a precise path over our roof. For about two seconds it was close enough for us to notice how strangely the light behaved--it seemed to shimmer and be comprised of various colors. It wasn't exclusively red-orange; I noticed flashes of pink and green within the light. I ran to get my digital camera but, when I returned, found that the battery was dead. Frustrated, I put the camera down and followed my mother to the back of the house, out onto the back deck where we watched it continue its path over us, toward the neighborhood behind ours. It was eventually obscured by pine trees. We never heard it make a single sound. We went downstairs to get my father, then back upstairs to the front door. My mother pointed out a SECOND orb (that looked exactly the same as the first one) as it made the EXACT SAME path over our house that the first orb had. In desperation--wanting SOME shred of tangible evidence--I hooked up the old family camcorder and plugged it in so it wouldn't have to rely on its battery. However, a camera that had been working just fine when I'd pulled it out a month or two earlier was starting to behave strangely and shut off sporadically. By the time I'd actually got it to turn on, the object had gone to the back of the house again, where my mother and father watched it from the deck. I gave up on the camera, but not in time to join them to watch it disappear behind the trees like the first. We saw fireworks and planes in the sky on the night of July 4th 2010, but these two objects couldn't be classified as either. In retrospect, my mother and I wonder if they weren't two separate objects but were, in fact, part of a larger object. Their identical path and behavior seem to hint they may have been somehow attached."],"Object Shape":"Fireball, Sphere","Object Features":"Undisclosed","Source":"MUFON","Log Number":"US-07052010-0073","Sighting Duration":"00:04:00","trends":["There has been one other sighting in Milton","There were no other sightings in Milton on or around July 4th 2010"],"City":"Milton","Disposition":"IFO","Summary":"Two orange-red orbs pass over house.","Weather Factors":"None","Region":"Vermont","Date Submitted":"07/05/2010 05:18 UTC","Date of the Event":"07/04/2010 09:10 UTC","Latitude":"44.64447","map":"<A HREF = \"http://maps.google.com/maps?q=44.64447,+-73.102431(24224)&iwloc=A&hl=en\"> mufon case (24224) map </A>","Viewing Distance":"Unknown"}