{"Region":"California","Sighting Duration":"00:05:00","divs":["Sighting DetailsI was driving across town to meet some friends at a go-kart racetrack. There wasa new video arcade which had opened up nearby, and I decided to check it out.Because of this, I took a route I normally wouldnt have. After leaving thearcade I turned east on Shields Ave from going northbound on Blackstone Ave. AsI approached the onramp for freeway 41 approx. 14 mile east of Blackstone Ave, Isaw a pulsating light through the space between the underside of the onramp andthe road beneath. I didnt think much of itthat year the police had stepped up its nightly helicopter patrols. As Iapproached the onramp, I noticed the light wasnt moving, it was a little toobright, and there werent any other lights pulsing rhythmically along with itlike aircraft lights. I tried my best to watch it as I drove up the onramp. Itbegan to slowly move northbound, as did I. I remember at that point I wasmerging on to the freeway only going 20 MPH. I continued to watch it. I was atthe top of the overpass and my car was almost parallel with the object. At firstI drove slowly so I could watch this thing as I was driving. I had to watch itthrough the passenger-side window, so it wasnt very easy. Then I remembered Iwas on the freeway, so I decided to speed up a little. The slope of the freewayat that point declines a bit, with trees lining the top of the embankment. As Iapproached the point where the trees would get in the way of me seeing theobject, I noticed what looked like red pinpoints of light started falling out ofit. They fell maybe 10 feet, then began swirling upwards back towards theobject. I saw this for maybe 5 seconds, then the trees got in the way. I almostslammed on the brakes and shoved it into reverse... on the freeway That wasimpossible, so I decided to step on it and get off of the freeway the firstchance I got. I continued northbound on freeway 41 to the Ashlan Ave exit, about12 to 34 mile from where I initially saw the object. I turned east on AshlanAve. At first I couldnt see the object, as there were apartment buildings in theway. I drove maybe 500 or so feet and caught sight of the object again. Theobject at this point was slowly moving away from me to the east-southeast. Itwasnt moving parallel with any of the streets and it was still pretty low to theground, so I decided to find a clear place to watch it fly away. I felt therewas no way I could have followed it at that pointand besides, I was late for my meeting with my friends. I pulled into asupermarket parking lot at the corner of Ashlan and Fresno St. I watched it fo"],"trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around August 31st 1995"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.753927,+-119.765406(2422)&iwloc=A&hl=en\"> mufon case (2422) map </A>","Source":"MUFON","Longitude":"-119.765406","Disposition":"Insufficient Data","Summary":"strobing light near freeway overpass","Weather Factors":"Unknown","Date of the Event":"08/31/1995 08:00 UTC","Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2422.html.txt","/var/www/straped/mufon/org/2422.html"],"Object Shape":"Other","Date Submitted":"08/31/1995 08:00 UTC","Latitude":"36.753927","Country":"United States","Case Number":"2422","Object Flight Path":"Unknown","City":"Fresno","Viewing Distance":"101-500 Feet","Log Number":""}