{"Country":"United States","Region":"California","Summary":"UFO and Rockville Crop Circles Attn. Mr. Ruben Uri","Viewing Distance":"Over One Mile","Sighting Duration":"00:10:00","Date Submitted":"05/31/2003 02:00 UTC","Log Number":"","divs":["Sighting Details It was about 2 in the morning a couple of weeks ago that I was at Rebeccas house in Citrus Heights, California. I stepped out onto her balcony she lives on the 2nd floor in an apartment complex for a cigarette. The lights inside the house were turned on but the lights outside on the porch were turned off. The ambient lighting outside was dim. After lighting my cigarette I looked up at the stars in the direction of the big dipper. Thats when I saw a dull yelloworangish light moving across the sky. It was the size of a medium brightness star and was already in motion when I looked up at it. At the time I first saw it it was just above the four stars that make the dipper portion and was moving leftwards. It passed between the two lower stars that make the handle. Once it passed between those two stars it vanished completely. The entire time that I saw the object in motion before it vanished was about 3 seconds.I thought it was a plane or helicopter flying at a high altitude maybe10,000-15,000 ft. but it didnt seem right. First the object was movingperpendicular to my line of vision. I shouldnt see the landing lights that wellfrom the side. Besides, the light singular that I saw was a dullyellowishorange, not the yellowishwhite lights that Ive seen on landing planes. And secondly, there were no bluered indicator lights on the object.After the light vanished I continued watching in that general directionwondering what it was. About a minute later, while scanning the big dipper, Isaw a flash of light a little bit to the left but I didnt see the exact locationof the flash. It was as bright as a bolt of lightning far away, but of coursethere was no bolt, just the flash. I couldnt pinpoint the exact location of theflash but it seemed to come from a little to the left of the big dipper, justunder the handle part.I was a bit excited at this time so I called Rebecca to the back porch to tellher about it. She came out and I described what I saw in detail. As I wastelling her we both watched the sky in that direction. In the space of 5-7minutes that we talked about it, and while looking up at the big dipper, we bothsaw a flash of light, 2nd time for me, 1st time for Rebecca.Rebecca saw the flash directly but I only caught it out of the corner of my eye. Rebecca described it as a dull yellowish flash, as she told me, It was like adying flashlight... Yellowishorange in color.We continued to watch the sky for awhile but nothing else happened. No doubt Iwas ex"],"Tags":"City","Weather Factors":"Unknown","Object Features":"Undisclosed","Disposition":"Insufficient Data","Object Shape":"Undisclosed","files":["/var/www/straped/mufon/html2text/2423.html.txt","/var/www/straped/mufon/org/2423.html"],"City":"Citrus Heights","Source":"MUFON","Date of the Event":"05/31/2003 02:00 UTC","Case Number":"2423","Longitude":"-121.272141","Latitude":"38.710705","map":"<A HREF = \"http://maps.google.com/maps?q=38.710705,+-121.272141(2423)&iwloc=A&hl=en\"> mufon case (2423) map </A>","trends":["There have been 9 other sightings in Citrus Heights","There were no other sightings in Citrus Heights on or around May 31st 2003"],"Object Flight Path":"Straight-line path,Unknown"}