{"Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","Region":"California","Object Shape":"Triangle","Case Number":"24234","Summary":"Triangle - 2 orange dots, one red.","Latitude":"38.735015","City":"Placerville","files":["/var/www/straped/mufon/html2text/24234.html.txt","/var/www/straped/mufon/org/24234.html"],"Disposition":"Insufficient Data","Date of the Event":"07/04/2010 12:00 UTC","Country":"United States","Longitude":"-120.797426","divs":["Sighting DetailsAt the time, I was with my family watching the fireworks as anyone else would have been doing on the 4th of july. The fireworks ended quickly due to being in mountains of Placerville, california. We had decided to wait a bit to see if they would do any thing else and while looking in the night sky, I noticed a triangular figure in the sky with 2 orange circles and a red one. I thought it was a plane at first, but I looked at it closer and could tell it wasnt a plane, the shape was too small and it seemed to be not as high as a plane would fly. The object basically just kept going and I only was able to see it for a maximum of one minute. I told my family what I thought I saw and they said I was probably seeing things....I wasnt seeing things I saw what I saw. The object dissapeared behind the trees and it seemed to be heading south from where we were. I didnt get any pictures, but I didnt think it would have mattered cause maybe it was just a plane but after seeing the news and hearing that so many people saw the same thing in other states, I had to tell."],"Sighting Duration":"00:01:00","Source":"MUFON","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.735015,+-120.797426(24234)&iwloc=A&hl=en\"> mufon case (24234) map </A>","trends":["There have been 5 other sightings in Placerville","There were no other sightings in Placerville on or around July 4th 2010"],"Date Submitted":"07/05/2010 08:26 UTC","Log Number":"US-07052010-0083","Weather Factors":"Unknown"}