{"Latitude":"36.1871","Date Submitted":"07/05/2010 10:18 UTC","Object Shape":"Boomerang, Other","Tags":"City","Sighting Duration":"00:00:15","Region":"Nevada","Date of the Event":"07/05/2010 03:50 UTC","files":["/var/www/straped/mufon/html2text/24239.html.txt","/var/www/straped/mufon/org/24239.html"],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","City":"Las Vegas","Object Flight Path":"Straight-line path","Disposition":"IFO","Longitude":"-115.295612","map":"<A HREF = \"http://maps.google.com/maps?q=36.1871,+-115.295612(24239)&iwloc=A&hl=en\"> mufon case (24239) map </A>","Country":"United States","divs":["Sighting DetailsDriving East down the road I noticed a large white, what I thought was an aircraft or glider, heading away from us at my 1 o'clock position about half a mile from us and it looked to be about 500 feet from the ground. I watched it for a little over 10 seconds. Then I turned right onto Buffalo from Celo Vista. When I looked back up after looking at the stop light it was gone. My daughter then noticed the same object in about the same location from us about one and a half miles up the road before we turned onto Charleston Blvd. She watched it for about 5 to 10 seconds, and asked me if that is what I had seen, and then it disappeared before I could see it. She described the exact same thing to me that I had seen. She said it was huge, solid and white with a bend in the middle and showed with her hands about how much of a bend it was. There were no clouds anywhere in the sky, and there was an airplane about 10 miles to the south. This is not the first UFO I have seen in this area, but it was not like any other I had seen. The size was quite a bit bigger than any other I had seen, and it was the second closest one I have seen. The size of it and the fact that it disappeared so quickly was what was so impressive about it."],"Case Number":"24239","Summary":"Approximately the size of 4 to 5 747's in length. White solid object with about a 5 degree bend in the middle of it. Looked like a giant glider headed toward or away from us.","Weather Factors":"None","Log Number":"US-07052010-0087","Source":"MUFON","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around July 5th 2010"]}