{"Disposition":"Unknown","Weather Factors":"None","Date of the Event":"07/04/2010 10:15 UTC","Viewing Distance":"Over One Mile","Object Shape":"Circle, Fireball, Sphere","Object Flight Path":"Straight-line path","Log Number":"US-07052010-0085","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2010 08:50 UTC","City":"Pekin","Case Number":"24236","Latitude":"40.571859","map":"<A HREF = \"http://maps.google.com/maps?q=40.571859,+-89.635148(24236)&iwloc=A&hl=en\"> mufon case (24236) map </A>","trends":["There have been 7 other sightings in Pekin","There were no other sightings in Pekin on or around July 4th 2010"],"divs":["Sighting DetailsFrom 9:30-10pm july 4,2010 Three neighbors and myself were watching city fireworks from home,around 10:15pm, after the display was over one friend noticed a bright orange orb like object moving straight south to north. I believe the weather was fair this evening,but we could see it from nearly horizon to horizon in about 30 sec.,or it moved behind unseen clouds to the north. Its distance was pretty far, like if I held my hand out and \"put my fingers around it\", was about the size of a marble. But grew a bit bigger as it moved closer to overhead. At this point I could see that the center of the object was darker orange than the rest. As I said,no sound, no trail that could be seen. I am sure this was not fireworks. It traveled much to far and fast in a what seemed like straight line. One other note, the cities fireworks display had already ended, and their display is NE of my location. I'm not sure if my friends want to speak out or not, so I cannot reveal their names, but will encourage them to do so. I reported this to the local law,they said they no other reports at that time. And I e-mailed our local meteorologist on this, he said he had not found any scheduled meteor showers or anything, but would look into it."],"Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/24236.html.txt","/var/www/straped/mufon/org/24236.html"],"Summary":"Bright orange undulating orb, moving south to north, nearly horizon to horizon, no sound, no trail.","Source":"MUFON","Region":"Illinois","Longitude":"-89.635148"}