{"Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsIt was the 4th of july. The time about 11:30 pm. My wife and I were sitting outside relaxing, talking about the family grill out we just had. I saw off in the distance 2 orange lights one above the other flying very low in perfect unison. These lights appeared to be 2 seperate craft because of the distance between them. They were moving at a speed similar to a propeller driven plane. If these were common aircraft, they were flying dangerously close together at night. I was looking toward the north and it seemed like these lights were heading towards me. The lights were very low in the sky and as they appeared to get closer the lights started to seperate from each other. The lights went below the houses and tree line off in the distance. I never did see the lights reappear. My wife saw this as well. The duration of the sighting was about 1 minute. These lights were not blinking or strobing. They were constant in color and intensity. I did not hear any sound. When I first saw the lights I instantly felt that it was not a normal sight and I could not take my eyes off of them. As the seconds ticked by watching it I was eliminating posibilities of what it could be in my head. After it had disappeared from veiw and thinking about what it could have been, I told my wife it may have been 2 military helicopters flying together. At work today I told my coworker about my sighting because it was still on my mind. I did not plan on reporting my sighting but after looking at the ufo tracker map and reading several other very simialar reports I got the chills and felt like I had to spend a few minutes and make one."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.524728,+-84.388586(24241)&iwloc=A&hl=en\"> mufon case (24241) map </A>","Country":"United States","Tags":"City","Log Number":"US-07052010-0089","Disposition":"IFO","Latitude":"39.524728","Summary":"2 orang /yellow orbs flying low, about same speed as a small plane, one on top of the other.","trends":["There have been 13 other sightings in Middletown","There were no other sightings in Middletown on or around July 4th 2010"],"City":"Middletown","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Weather Factors":"Unknown","Case Number":"24241","Date of the Event":"07/04/2010 11:30 UTC","files":["/var/www/straped/mufon/html2text/24241.html.txt","/var/www/straped/mufon/org/24241.html"],"Object Flight Path":"Straight-line path","Date Submitted":"07/05/2010 11:02 UTC","Object Features":"Undisclosed","Longitude":"-84.388586","Region":"Ohio"}