{"Source":"MUFON","Object Flight Path":"Unknown","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsIndian Island, Old Town ME. Driving homeMy wife, my son and I were driving home around 730 pm. when my son of 10 hadpointed to a bright light hovering around 70 feet in the air. It was bigger thenany star or planet in the skyline. I pulled the car immediately over and theobject changed from a single bright light to about 12 or 14 pinpoints of whitelights in sets of two all along the side of the object. It was long andseemingly sausage shaped or even cylidrical. The Twilight made the object barelyvisible, it was like nothing any of us had ever seen before. It seemed to besomewhat transparent or using its surroundings to blend in. I quickly turned offthe car and rolled down my window to listen for any sounds like helicopters orairplanes since there is an USAF refueling base within 25 miles south oflocation of sighting. There is also an airport in Old Town for local flyersnorth about a couple of miles. The three of us observed there was no sound atall, not even the sound of insects or wind. The object then started to move awayand up in to the sky, starting very slow, and then to an extreme accelerationleaving a somewhat transparent vapor trail that quickly diminished behind it. Itwas no more then a second or two before it was completely out of sight. Thewhole occurence was maybe a minute long. My son expressed an urgency for us toleave as it sped off and out of sight. I unknowingly felt the same urgency.Since that night, my son has aquired an obsession to know what it was since ithad not made any sound and moved off at such a high speed, like it had noticedthat we had stopped and noticed it. He also pointed out that there were noblinking or strobing lights like the small planes and helicopters that we seeregularly around this area all hours of the day and night. I was unable to tellhim what it was. We have since then found at least four people that have saidthey have seen the same thing on different occurences and one that same eveningat a different location further up the Penobscot river at an earlier time."],"Longitude":"-68.651698","trends":["There have been no other sightings in Old Town, Indian Island","This sighting has never been favorited."],"Country":"United States","Log Number":"","Case Number":"2424","map":"<A HREF = \"http://maps.google.com/maps?q=44.953679,+-68.651698(2424)&iwloc=A&hl=en\"> mufon case (2424) map </A>","Tags":"City","Latitude":"44.953679","Summary":"Changing from light to cylinder craft","Disposition":"Unknown","Object Features":"Window(s), Other","City":"Old Town, Indian Island","Date of the Event":"04/13/2003 09:04 UTC","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/2424.html.txt","/var/www/straped/mufon/org/2424.html"],"Sighting Duration":"00:05:00","Weather Factors":"Unknown","Region":"Maine","Date Submitted":"04/13/2003 09:04 UTC"}