{"Date of the Event":"07/05/2010 12:00 UTC","Summary":"Basketball looking glowing orange object, initially appearing to be some kind of aircraft.","files":["/var/www/straped/mufon/html2text/24240.html.txt","/var/www/straped/mufon/org/24240.html"],"Disposition":"Unknown","Tags":"City","Longitude":"-86.246587","City":"South Bend","Viewing Distance":"101-500 Feet","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around July 5th 2010"],"Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.691731,+-86.246587(24240)&iwloc=A&hl=en\"> mufon case (24240) map </A>","Log Number":"US-07052010-0088","Case Number":"24240","Object Shape":"Circle, Fireball","Date Submitted":"07/05/2010 10:27 UTC","Region":"Indiana","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsDuring a fireworks display around 10:00 on 07-04-2010, a co-worker pointed to a glowing circular object in the sky. I disregarded it as being some sort of airplane that was flying low. It did not make any noise, and kind of faded out into the sky, which was different that anything I have ever seen. Early in the morning at around 2:00, I exited my vehicle at the back of my employers facility, and saw what appeared to be an aircraft in the southern sky. It looked a little odd-there is an airport nearby and I assumed it was an airplane, or the Air Angels flying in. I watched for approx. 5 min, as it came closer. It looked like an orange glowing basketball, and was moving at a fairly good speed, making no noise. It travelled from south to north, then went in a northeastern direction, and like the previous object, faded into the night sky. Two of my co-workers saw this as well. I later talked to a friend to see if he had seen the object, and he told me that about a week ago while he was on vacation, he saw a glowing object in the south sky. It caught his attention because he thought that an airplane was on fire. He ran to get his wife, and when they came back outside it was still there. It then faded away into the sky."],"Object Features":"None","Latitude":"41.691731"}