{"Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Undisclosed","Date Submitted":"07/05/2010 11:09 UTC","Date of the Event":"07/05/2010 12:00 UTC","Summary":"Fast fly over Toronto.","Tags":"City","Latitude":"43.656226","Region":"Ontario","Log Number":"CA-07052010-0090","Case Number":"24242","Longitude":"-79.377324","Sighting Duration":"00:00:01","Object Shape":"Diamond, Sphere","City":"Toronto","Object Features":"Undisclosed","divs":["sighting detailsthere was a power outage (no electricity) and i decided to go for a walk and take a few pictures. it was about 7pm and the sun was going down, and the available light was not much for the ground but the sky was still quite bright. i decided to take a few pictures but to make them work i decided to make multiple exposures and produce hdr image later. the camera can be set for bracketed exposure, and when set for high-speed multiple captures, when the button is pressed the shutter fires automatically 3 times in about a second, capturing 3 separate images at different exposures. when i was developing the images i noticed something strange on the least exposed frame, and soon after that i found it on the mid-exposed frame (on the brightest frame all of the sky was overexposed and it would have not been possible to show there). the images are taken in the sequence mid-exposure, low, high. the object looks spherical or diamond to me, on the mid-exposure it is on the left side of the sun and shows reflection from it, on the right side is shows the illumination from the sun, but the reflection is not that noticeable. pictures were taken at 6:54 pm - toronto. p.s. first picture is b\\w as i had to lower the exposure manually for the object to be seen (and the colours were very off after i had to do that). the original images are in raw (encrypted and signed) format."],"files":["/var/www/straped/mufon/html2text/24242.html.txt","/var/www/straped/mufon/more/24242_submitter_file1__UFO_1.jpg","/var/www/straped/mufon/more/24242_submitter_file2__UFO_2.jpg","/var/www/straped/mufon/more/24242_submitter_file3__UFO_zoom.jpg","/var/www/straped/mufon/org/24242.html"],"Disposition":"Unresolved","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=43.656226,+-79.377324(24242)&iwloc=A&hl=en\"> mufon case (24242) map </A>","trends":["There have been 136 other sightings in Toronto","There were 3 other sightings in Toronto on or around July 5th 2010","This sighting has never been favorited.",""],"Viewing Distance":"Unknown"}