{"trends":["There has been one other sighting in West Columbia","There were no other sightings in West Columbia on or around July 4th 2010"],"Country":"United States","files":["/var/www/straped/mufon/html2text/24250.html.txt","/var/www/straped/mufon/org/24250.html"],"Tags":"City","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.993487,+-81.073982(24250)&iwloc=A&hl=en\"> mufon case (24250) map </A>","Case Number":"24250","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Viewing Distance":"21-100 Feet","Log Number":"US-07062010-0001","Latitude":"33.993487","divs":["Sighting DetailsWe were outside shooting fireworks when we first saw the ball of light. At first we discredited it just thinking it had to be something with the fireworks. But then about 15 mins later it came right back but this time moved forward and backwards. We couldn't believe what we were seeing. About 20 mins later we drove right down the street to the local McDonalds and as we were in the drive through we saw it AGAIN!!!! Not only did we spot it but so did the McDonalds employee...we held the line up just watching the object until it disappeared. When we got home we decided to go \"looking\" or \"hunting\" the object to see if we could spot it again. We were able to spot the object 4 additional times at different locations around the house. When we first left the house we decided to go back to McDonald's to see if we could find in and sure enough it showed back up! We were able to follow it for approximatly 1.5 miles until we lost it in the trees. We continued to ride around and saw it just appear then disappear. Another time it appeared, shot across the sky at a VERY fast speed and then disappeared. We were about to head home when we spotted it again, it hovered for about 1-2 mins then disappeared. I know what I saw was not a firework, sky lantern or anything normal that can be explained. Maybe if I just saw it once I would question myself but with us searching for it and seeing it as many times as we did, it is undeniable! I know this is going to sound crazy but I feel like the object knew we were watching it. It seemed as soon as we started talking about it it disappear would shortly. I'm not crazy I have 4 additional witnesses."],"Weather Factors":"None","Disposition":"Unknown","Date Submitted":"07/06/2010 12:20 UTC","City":"West Columbia","Longitude":"-81.073982","Object Features":"Unknown","Source":"MUFON","Date of the Event":"07/04/2010 10:00 UTC","Summary":"Bright ball of orange light.","Region":"South Carolina"}