{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/24256.html.txt","/var/www/straped/mufon/org/24256.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.17413,+-86.777103(24256)&iwloc=A&hl=en\"> mufon case (24256) map </A>","Date Submitted":"07/06/2010 12:57 UTC","City":"Nashville","Summary":"Circular shaped with a bright orange non-blinking light underneath.","Case Number":"24256","trends":["There have been 72 other sightings in Nashville","There was one other sighting in Nashville on or around July 5th 2010"],"Date of the Event":"07/05/2010 08:45 UTC","Longitude":"-86.777103","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Shape":"Circle","Latitude":"36.17413","Region":"Tennessee","Log Number":"US-07062010-0007","Tags":"City","Object Flight Path":"Path with directional change","divs":["Sighting Details Monday night, July 5th at approx. 8:45p.m.,my girlfriend and I were walking in Lenox Village, a fairly new residential area off of Nolensville Road in South Nashville. It was a beautiful, clear night and the stars were just beginning to dot the sky. As we walked, I noticed a bright light coming from the south heading north. I thought it was a helicopter. We stopped to look as it got closer. Only then did we realize that there was no engine noise. It was totally silent. When the object got close enough to us, approx. 1000 yards to the east, and flying at the height and speed of a small plane, we could see a faint, dark circular shape with a bright orange ball of light underneath. The light looked to be attached to the object. As it passed us, it started heading in a more northeast direction. Suddenly, the orange light disappeared and we saw the dark circular shape stop it's forward motion and descend from the sky beyond the treeline, and out of our view. We both got pretty excited about what we had just witnessed and continued walking. A minute or two later, I mentioned that I would love to see that again and looked over my right shoulder in the direction where I first saw the light. Incredibly, there was another. Exactly the same. It followed the same path and we watched the orange light go out and the dark circle go down behind the trees in the same area. Well, we were both blown away. We decided to sit on a nearby bench and keep an eye out for more. After about 10 minutes we watched as a REAL helicopter, noisy as hell BTW, flew into the area and seemed to be looking for something. We left after a few more minutes of watching. We don't know what it was that we saw. I just know that I had never seen anything like it before."],"Weather Factors":"None","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Appendage(s), Unknown"}