{"map":"<A HREF = \"http://maps.google.com/maps?q=41.563002,+-73.042876(24252)&iwloc=A&hl=en\"> mufon case (24252) map </A>","Source":"MUFON","Region":"Connecticut","Disposition":"Unknown","divs":["Sighting DetailsI initially witnessed these same objects on July 4, 2010 and so decided to see if I could see any on this night. Indeed, after about 30 minutes I observed a bright star-like object move in a random pattern across the sky. Several more followed from almost every direction possible over a period of approx 2 hrs for a total of 8 objects. However, two significant events occurred. The first being when several objects in the sky began to flash (white light) from different points in the sky, as if it were a form of communication? The second when one of these objects emitted a bright flash, directly east from it appeared as if something exploded as there were two bright flashes which lingered momentarily prior to fading. I was excited yesterday, as was my family. Now, it's overwhelming, this is not anything I expected or feel comfortable with, it's difficult to explain - just crazy but I know what I saw and I'm more than concerned and this is out of my element. I'm reporting it because I know it has to be impossible that someone else would NOT have seen it too! I do not have a high powered camera but did catch something odd on camera, I don't expect it to be a bombshell but at this point who the heck knows"],"Object Flight Path":"Path with directional change","Log Number":"US-07062010-0003","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"07/05/2010 09:00 UTC","files":["/var/www/straped/mufon/html2text/24252.html.txt","/var/www/straped/mufon/org/24252.html"],"Summary":"Several objects seen over Naugatuck Valley.","Object Shape":"Star-like, Unknown","Latitude":"41.563002","Object Features":"Unknown","Longitude":"-73.042876","trends":["There have been 15 other sightings in Waterbury","There was one other sighting in Waterbury on or around July 5th 2010"],"Tags":"City","Viewing Distance":"Over One Mile","Case Number":"24252","Date Submitted":"07/06/2010 12:37 UTC","Weather Factors":"None","City":"Waterbury"}