{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.133284,+-80.079899(24263)&iwloc=A&hl=en\"> mufon case (24263) map </A>","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/24263.html.txt","/var/www/straped/mufon/org/24263.html"],"Tags":"City","divs":["sighting detailsmy wife and i started watching the iss 2 years ago everytime it passed over our area. on sept. 13, 2009 as i was setting up a telescope my wife told mw she was watching to lights at sattlelight height desending in a south westardly direction. i didn't look right away but when i did these two objects were about at approximately one thousand feet and desending at an unbelievable speed. they leveled out at about 200 feet and flew over our two pine trees in the front of our house. they procedded to jockey in an up and down manner in a southwestard direction. they were both oval shape with a cut out section in the rear. they had a corrigated appearance with a dirty white lighted section on the bottom that didn't emit a glowing light but showed an inner-light. they were 10 to 12 feet in diameter and 2 to 3 feet wide. these objects made no sound, none. we watched these two objects for about 5 to 7 seconds before they dissappeared. we both sat there speechless for about 15 to 20 minutes before we sais to each other what was that? did you see what i saw? will anybody believe us? the following day my wifes best friend told my wife she saw two lights desending from the northeast to southwest over lake erie, before my wife told her of our sightings that very night. i am an air force and army veteran and i never saw any aircraft fly at a speed and ease these two crafts flew. i have seen the x-15\\x-18-f-4 phanthoms\\ u-2\\sr-71 fly and they couldn't keep up with these objects. ten months later i am still in awh of what i saw that night."],"trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around September 13th 2009"],"Region":"Pennsylvania","Case Number":"24263","Date Submitted":"07/06/2010 07:24 UTC","Object Features":"Undisclosed","Latitude":"42.133284","Date of the Event":"09/13/2009 08:30 UTC","Object Shape":"Oval","Viewing Distance":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-80.079899","City":"Erie","Source":"MUFON","Log Number":"US-07062010-0014","Summary":"Two oval cut off in rear, from NE to SW, from satelite height down to 200Ft."}