{"Weather Factors":"Light","Disposition":"Unknown","Longitude":"-122.184556","Summary":"Brilliant orange/red spheres.","Viewing Distance":"Unknown","Region":"Washington","Object Features":"None","files":["/var/www/straped/mufon/html2text/24260.html.txt","/var/www/straped/mufon/org/24260.html"],"Date of the Event":"07/04/2010 10:30 UTC","trends":["There have been 4 other sightings in Bonney Lake","There were no other sightings in Bonney Lake on or around July 4th 2010"],"Latitude":"47.182406","Sighting Duration":"Undisclosed","Case Number":"24260","Tags":"City","Date Submitted":"07/06/2010 05:25 UTC","City":"Bonney Lake","Country":"United States","Object Flight Path":"Path with directional change","divs":["Sighting DetailsMy wife and I were sitting on the lawn watching the fireworks at our buddies place. When at 10:27:12 I noticed a Bright Red glowing spherical object in the Northwest Sky. At first I thought it may of been a helicopter or plane flying into Sea-Tac airport. I was sort of fascinated at because I thought it odd that the craft was not using normal aviation beacons and the craft appeared to be stationary and pulsating from Red to Orange. All of a sudden the craft moved from stationary to a horizontal left and then went stationary again. I grabbed my wifes attention and pointed out the object to her which now appeared to be moving away from us and in a horizontal circular motion (clockwise). The craft then pulsated and increased it's altitude vertically. The craft appeared to begin to fade in and out as if flying thru low level clouds but then it appeared bright and then it faded out and disappeared all together. I made the comment to my wife, that was exactly what happened last 4th of July at my parents house at about 10ish in the evening (also reported the sighting to mufon). She made a wise crack and I down played her as I turned around the craft suddenly reappeared to the left of a tree (My wife pointed out the re-appearing this time) bright red and then bright orange and it moved slowly behind the tree in a left to right direction. When the craft re-emerged from behind the tree it continued it's horizontal movement in a very slow yet steady direction of east to west it was flashing Red Orange then it began to fade out then it just disappeared all together. Well I thought that was the end of it as I sat down in my chair roughly 45 seconds later I noticed in the southwest skyline at about tree level the craft had re-appeared again. this time brighter and larger it was moving from a southerly to northerly direction it went behind the tree line and then it raised up above the tree line and faded out all together. I checked the time at the end of the event and marked it at 10:36:42pm. I am going to take a photo with descriptions of where the object(s) were in the sky and I will submit them for viewing."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.182406,+-122.184556(24260)&iwloc=A&hl=en\"> mufon case (24260) map </A>","Log Number":"US-07062010-0011","Object Shape":"Sphere","Source":"MUFON"}