{"Object Features":"Unknown","Region":"New York","files":["/var/www/straped/mufon/html2text/24266.html.txt","/var/www/straped/mufon/more/24266_submitter_file1__ufo_map.png","/var/www/straped/mufon/org/24266.html"],"Viewing Distance":"Unknown","Case Number":"24266","Sighting Duration":"00:02:00","divs":["sighting detailsaccording to google maps, this is the location we were viewing from: http:\\\\maps.google.com\\maps?q=40.90435,-72.527876&num=1&t=h&sll=40.904966,-72.528359&sspn=0.00433,0.006899&ie=utf8&ll=40.904966,-72.528359&spn=0.00433,0.006899&z=17 to begin: there were 2 separate sightings from the same vantage point about 15 minutes apart. myself and a few friends and family members decided to go to the west landing beach on peconic bay and swim while viewing the fireworks. from the beach you could see at least 10 different displays of fireworks. it wasn't possible to see the sunset from where we were, but you could see the sky in the northeast getting red from it. we were looking wnw or nw when we first saw the ufo. there was a line of clouds maybe about 30 degs above the horizon. otherwise the sky was pretty clear. the ufo was just above this line of clouds from our vantage point. we then were able to view it for a minute or so as it traveled to the east, skirting the top of the cloud line, and then we couldn't see it anymore. it didn't go into the clouds or anything - we just couldn't pick it out of the sky anymore. i have no idea how far away it was, but it seemed to move pretty quickly. attached is a map with my best guess as to the location of the ufo while we viewed it. 15 minutes or later, a similar thing happened. a ufo appeared in pretty much the same location as before, traveled at a similar speed along a similar trajectory, and disappeared from view in a similar place. however, this one was shaped differently. to describe the ufos: both looked like shadows, or a darkening of the sky. to view them you sometimes had to look away from them and see them with your peripheral vision. another way to describe it would be if someone was using the clone stamp tool from photoshop in real time as we were watching. it was a darkening\\blurring that was different from the surrounding sky area. we probably wouldn't have noticed it if it hadn't been moving. the only difference between the 2 sightings were the shapes. the first ufo was more cigar or line shaped and the second was round. all in all, there were 5 people who saw them in my group. i think the reactions of everyone were along the lines of, \"that was weird and cool!\""],"Source":"MUFON","Log Number":"US-07062010-0017","Date Submitted":"07/06/2010 09:39 UTC","Latitude":"40.874819","trends":["There have been 3 other sightings in Hampton Bays","There were no other sightings in Hampton Bays on or around July 4th 2010","This sighting has never been favorited.",""],"Summary":"Fireworks over Peconic Bay. Two sightings about 15 minutes apart - looked like a shadow.","Country":"United States","Date of the Event":"07/04/2010 08:45 UTC","Disposition":"Insufficient Data","Tags":"City","City":"Hampton Bays","map":"<A HREF = \"http://maps.google.com/maps?q=40.874819,+-72.516149(24266)&iwloc=A&hl=en\"> mufon case (24266) map </A>","Object Shape":"Cigar, Circle","Longitude":"-72.516149","Object Flight Path":"Straight-line path","Weather Factors":"None"}