{"Viewing Distance":"20 Feet or Less","Longitude":"-70.755303","divs":["Sighting DetailsOn July 3rd I was in the town of Portsmouth, N.H. watching the fireworks. When the fireworks got over I walked into town with some friends to meet other friends. I had sat down at a table in the center of town at a local coffee shop. It was a busy night as always. I was talking with a couple of people, when I looked up and saw this red glowing object. It looked to me a red balloon and the spot light from the church in town was shining off it, but the spot light was facing the other direction away from it. I kept looking at it and it was no doubt a red glowing object. The light was too big to be a plane flying by, plus it had no blinking lights of any kind. I pointed it to a friend and said what the heck is that, do you see that. He said he sees it and we pointed out to someone else. The other person we pointed it out to stated that its a UFO. They didn't say \"oh its a plane or anything else\", but a UFO. I watched it float past the buildings until it went behind some taller buildings. It stayed in the same direction and came back into view from around the buildings. I went and sat back down, because I didn't want people to think I was wierd. I got up 2 mins. later with a friend, because we were going home. He asked me where it was. I could still see it, but way further away. I pointed it out and then just stopped watching it. It was probably over the Atlatic ocean by then. The red glowing object that I had seen was just floating by like a balloon, no odd movements. The funny thing is, is that I have seen the same type of glowing object last year and I thought it was bizzare. It was just about the same time on July 3rd after the fireworks. I was in a different part of town. I have seen some odd things around July 3rd and 4th. I notice that alot of people have reported orange or red glowing objects on this website from different areas of the US. That interests me, Thank you."],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"New Hampshire","Case Number":"24265","City":"Portsmouth","files":["/var/www/straped/mufon/html2text/24265.html.txt","/var/www/straped/mufon/org/24265.html"],"Sighting Duration":"Undisclosed","Log Number":"US-07062010-0016","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=43.077125,+-70.755303(24265)&iwloc=A&hl=en\"> mufon case (24265) map </A>","Country":"United States","Tags":"City","Source":"MUFON","Date of the Event":"07/03/2010 10:20 UTC","Disposition":"IFO","Object Features":"Unknown","Summary":"Seen red glowing object above buildings at low alttitude moving west to east. Thought it was a red balloon with the light reflecting off it. As it moved into darker areas, I could see it was glowing.","Latitude":"43.077125","Date Submitted":"07/06/2010 09:34 UTC","trends":["There have been 11 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around July 3rd 2010"]}