{"Summary":"Really bright red/orange orb","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Features":"Unknown","Date of the Event":"07/03/2010 09:30 UTC","Date Submitted":"07/06/2010 12:07 UTC","Log Number":"US-07062010-0023","trends":["There have been 3 other sightings in Sellersburg","There was one other sighting in Sellersburg on or around July 3rd 2010","This sighting has never been favorited.",""],"Tags":"City","City":"Sellersburg","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=38.401912,+-85.749364(24272)&iwloc=A&hl=en\"> mufon case (24272) map </A>","Country":"United States","Disposition":"Unknown","Longitude":"-85.749364","Source":"MUFON","Case Number":"24272","Latitude":"38.401912","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path then hovering","divs":["Sighting DetailsI am resending since I am not sure if something went wrong the first time. I had gotten home from work @ 7:35 and I had to mow and trim my yard. I got that done and I decided to water the brown spots in my yard due to the lack of rain lately. I looked up in the sky (approximately somewhere in between 9:30 to 10:30 pm) Fireworks was being let off in the area here and there. At first I thought it was a firework coming closer. Then I thought that is taking too long to burst. It kept getting closer and then I thought it was a helicopter or something on fire and it was going to crash. Then it kinda just started hovering. It didn't make a sound and at times the light would go completely out but you could see the object in the sky just sitting there and then it would start glowing again really bright. I took a video with my digital camera. It is a canon with a 14x zoom on it. I did zoom in but didn't get the video when it was at it's closest. You can see the corner of my house on the right when the video starts and the I zoomed in. The video doesn't do this object justice.When it left it just got a little further away and disappeared. I am not a person that has believed in ufo's and would love to find a logical explanation for this, but I can't think of one. I didn't know where to report this or I would have done it that night. I found this resource on wikipepia."],"files":["/var/www/straped/mufon/html2text/24272.html.txt","/var/www/straped/mufon/org/24272.html"],"Object Shape":"Circle, Fireball"}