{"Log Number":"","Longitude":"-88.139806","City":"Long Lake","Region":"Illinois","Country":"United States","Tags":"City","Sighting Duration":"01:00:00","Latitude":"42.381132","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2427.html.txt","/var/www/straped/mufon/org/2427.html"],"Weather Factors":"Windy","Summary":"Mom What are those","divs":["Sighting Details1. I cannot remember why I had gone outside that night. This was so many yearsago. I just remember seeing these what I thought were strange lights hoveringover what was known as Holiday Hill, a skiing hill in Ingleside. I was at firstconcerned because my little brother, I knew, was over there that night skiingwith his friends.2.It was getting late and I wanted to know if the Park was closed yet. Theywould turn the lights off on the slope when they were done for the night, butthey were still on when I looked out over the trees I could see the glow in thesky overhead.....3. I didnt know what I was seeing. I kept looking, thinking, What the heck ISthat and What the heck ARE those lights because we lived so far out of the city. a few of our friends had small aircraft and I thought maybe they had gottentogether and were buzzing the Hill for a lark. I really didnt know. That wouldhave been an expensive lark, but you never know, right4.When I couldnt figure out what they were I went inside and got my Mom. Isaid, Youve gotta come and see this, Mommy. You arent gonna believe it Shecame back outside with me and together we stood on our stoop for a few minutesand now SHE was asking, What the hell is that. I told her I thought she couldtell me, because I sure didnt have a clue. So we stood there, watching, everyonce in a while saying, Wow. Just, Wow. And then she went inside and got thebinoculars so we could get a better look. It was a crystal clear night. Therewere no clouds. It was windy and cold. We stayed outside at least an hour,both of us now sitting on the stoop bad for your butt, I know.... but we couldntstop watching these lights playing in the sky. We were excited because wethought what we were seeing were real live ufos. We werent scared. We reallywere excited because it was the only explanation we could come up with.5.There were at least three of them, in my recollection. We never saw a shape,they were at least two miles away. We only saw the blue-white lights of them. And they appeared to be playing in the lights from the Hill. They would hover,they would like leap-frog over each other. Dart out away to the North and comeback, lower and raise. Sometimes line up in a straight line north to south. Sometime"],"Object Shape":"Undisclosed","Case Number":"2427","Date of the Event":"10/31/1970 10:00 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.381132,+-88.139806(2427)&iwloc=A&hl=en\"> mufon case (2427) map </A>","trends":["There has been one other sighting in Long Lake","There were no other sightings in Long Lake on or around October 31st 1970"],"Source":"MUFON","Date Submitted":"10/31/1970 10:00 UTC","Object Flight Path":"Unknown","Disposition":"Unknown"}