{"Date of the Event":"06/16/2010 11:00 UTC","Object Shape":"Flash, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.684543,+-80.107155(24279)&iwloc=A&hl=en\"> mufon case (24279) map </A>","Viewing Distance":"Unknown","Log Number":"US-07062010-0030","trends":["There have been no other sightings in Cranberry Twp","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/24279.html.txt","/var/www/straped/mufon/org/24279.html"],"divs":["Sighting DetailsWe saw an odd light in the sky driving home. It seemed too bright for a star and caught our attention. We both thought we saw it move erratically and wanted to stop and watch it. We pulled into a parking lot so we could better see if it was moving, or a star or maybe plane. We originally both saw the light move but upon watching it, it stayed still like a star. We watched it for a few minutes then it blinked out until we saw nothing. We were about to leave when the light blinked back in as a steady bright yellowish color slightly to the left and moving rapidly. We saw a second light it was moving towards and we assumed one was a plane. When the lights got close, the solid light starting strobing and the strobing light become solid as if they switched light patterns. We unfortunately did not record the light blink out but we did record them moving and changing lighting patterns. We watched both fly off normally as if they were only planes but we both saw it move off a straight line unlike any plane we have seen before. We would really like our video analyzed because when we were watching it, it looked as if one light stopped and waited for the other before following the same flight path."],"Longitude":"-80.107155","Region":"Pennsylvania","City":"Cranberry Twp","Case Number":"24279","Object Flight Path":"Hovering then path","Latitude":"40.684543","Weather Factors":"Unknown","Summary":"Watched a light blink out and return then move quickly past another flashing light","Source":"MUFON","Object Features":"None","Date Submitted":"07/06/2010 02:03 UTC","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City"}