{"divs":["Sighting DetailsI'm afraid to go public or provide more then a general description of events. I have been in contact with a cluster of metalic luminescent spheres that respond to my laser. So far in the last 2 weeks they have returned at least 4 different days. They move in unison with six spheres in total. They approach as close as 500 feet. Some of them will flash brilliant in my direction with a series of flashes. The brighter of the spheres which are of different size seems to direct the other spheres. I'm not sure if I will make more then this written report as I don't want create a public spectacle and I'm concerned that if I make it public they will not return. I'm going to borrow a camcorder and provide video evidence to this site in the near future. Im absolutely sure they will return again. They stay in my vision until my laser pointer batteries start fading. Last night was the closest they came to my position on the ground. I work for the Feds and don't want to receive any attention in this matter but I also want to ask your viewing audience what they would do in my situation. If I talk to my friends I wonder if they will tell others. If I mention any more I wonder if the government will get involved. I have heard that a radar detector can pick up tones so I want to try and record the tones. I believe the government already knows and tries to debunk or intimidate. I'm sorry I dont want to mention any more at this time. Im an avid star gazer and had an amazing sighting in 1973 that changed my life. Now that Im in my 50's I have finally got the confirmation I needed and maybe that's all that matters. Best wishes and don't stop looking up."],"Log Number":"US-07062010-0021","Object Shape":"Sphere","Region":"Oregon","Case Number":"24270","Disposition":"IFO","Longitude":"-120.552991","trends":["there have been no other sightings in n\\a","This sighting has never been favorited."],"City":"N/A","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24270.html.txt","/var/www/straped/mufon/org/24270.html"],"Latitude":"43.807173","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"07/06/2010 11:05 UTC","Country":"United States","Date of the Event":"07/05/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.807173,+-120.552991(24270)&iwloc=A&hl=en\"> mufon case (24270) map </A>","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Summary":"Ongoing contact..."}