{"Date of the Event":"06/17/2010 11:10 UTC","Object Features":"None","Object Shape":"Sphere","Tags":"City","City":"Cameron Park","Disposition":"Unknown","Source":"MUFON","Region":"California","trends":["There have been 3 other sightings in Cameron Park","There were no other sightings in Cameron Park on or around June 17th 2010"],"Longitude":"-120.986164","Country":"United States","files":["/var/www/straped/mufon/html2text/24275.html.txt","/var/www/straped/mufon/org/24275.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Summary":"Sphere/highly polished silver/Est 39-40 feet in dia.","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07062010-0026","map":"<A HREF = \"http://maps.google.com/maps?q=38.674573,+-120.986164(24275)&iwloc=A&hl=en\"> mufon case (24275) map </A>","Weather Factors":"None","divs":["Sighting DetailsThursday morning, about 11:00 I took a break from yard work, kicked back on the patio, looking at nothing in general, when I saw it. At first I thought it was a metallic balloon, but then realized it was going to straight and to fast. Besides, there was no wind. There was a silver globe, which I estimate to have been about 4,000 ft. high going from WSW to ENE at a high rate of speed. It took about 4 seconds to traverse my field of view, which I estimate to be maybe 60-70 degrees. I think that would have made it 1000-1500 mph. I(Maybe you can do the math) It was extremely bright, like highly polished silver, enough so that even with the sun behind it, it was sill highly reflective. Then, another object flew over, coming from the northwest (from over the house) in a large arc back to the south. It looked like a fighter aircraft, but it made no sound. Then it disappeared over the hill behind my house. The whole sequence took less than 15 seconds. If the objets were at the same altitude, and military jet was of the normal size, I estimate the globe to be 30-40 feet in diameter."],"Date Submitted":"07/06/2010 01:40 UTC","Case Number":"24275","Latitude":"38.674573"}