{"Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=34.732109,+-86.580154(24277)&iwloc=A&hl=en\"> mufon case (24277) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"More orange lights in the sky (Huntsville/Madison Alabama!).","divs":["Sighting DetailsWas watching fireworks display across the street from my neighborhood. And suddenly noticed a kind of dim orange light, which at first I thought that the folks across the street had accidentally set the telephone pole on fire with their fireworks. But, then I noticed that the orange light which I was seeing, was \"moving\" !!! I did not think it was anything other than a lantern floating in the sky. It eventually disappeared.. It was moving very very slowly. Then, about 10 mins later, a whole stream of them, about 6 total, were coming from the opposite direction behind me, about the same height in the sky. All orange, and not very bright. Again, I thought it was just some group of people who bought some kind of new firework or lanterns that you light and release into the sky on 4th of July. They moved very slowly, and in a straight line, all same distance from each other. Then, as they appeared, they disappeared in the opposite order. I again assumed that logically, they burned out (being lanterns). Well, this morning, I was trying to look around for local news articles for others like me who had seen these.. There was nothing. A guy at my work, said he saw them too, and also believed they were lanterns or something. Then, I saw on Youtube about several other sightings of the exact same thing! And another sighting from my town as well! So, I'm still not sure what they were, but I am very curious. Are there fireworks or lanterns people light and send into the sky for July 4th? I haven't heard of such things... From looking at the realtime UFO map on this site, it's clear that I am not the only one who has seen this exact same phenomenon. Hopefully, others will come forward and tell their accounts."],"Longitude":"-86.580154","Object Shape":"Fireball, Sphere","City":"Huntsville","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"34.732109","Tags":"City","Weather Factors":"None","Source":"MUFON","trends":["There have been 17 other sightings in Huntsville","There were 2 other sightings in Huntsville on or around July 4th 2010"],"Disposition":"Unknown","Date Submitted":"07/06/2010 02:05 UTC","Case Number":"24277","Log Number":"US-07062010-0028","Date of the Event":"07/04/2010 10:15 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/24277.html.txt","/var/www/straped/mufon/org/24277.html"],"Object Flight Path":"Straight-line path"}