{"Summary":"Dull red/orange lights made several passes over or near our home.","files":["/var/www/straped/mufon/html2text/24281.html.txt","/var/www/straped/mufon/org/24281.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.060608,+-85.889703(24281)&iwloc=A&hl=en\"> mufon case (24281) map </A>","Viewing Distance":"Unknown","Date Submitted":"07/06/2010 02:37 UTC","divs":["Sighting DetailsMy wife, I and at least one grandchild saw teardrop shaped dull orange or red lights fly over and near the field behind our home while we were doing fireworks for our grandchildren between 10 and 11 pm on the 4th. We live in southern Bartholomew County, Indiana. My wife saw a total of 4 passes of the object(s) fly by one at a time. The objects appeared to come generally from the west or southwest travelling toward the north or northeast. The flight paths seemed to curve slightly toward the north as they passed our location. One went past us on its way north-northeast, but then looped back and made a second pass over us before heading back generally to the north. After my wife called the lights to my attention, I was able to observe one carefully as it travelled from southwest to north: Dull red or orange color, the color and brightness appearing to be more or less constant; From my vantage point, about 1.5 to 2 x the size of Venus as it appears at dusk right now; Teardrop shaped, tapering to the top; I first saw it 50 to 60 degrees above the southwest horizon, moving steadily to 80 to 90 degrees above western horizon as it travelled overhead turning toward the north; In my view for 1 to 1.5 minutes; Looking intently, I made out no strobes or marker lights; I heard no prop or jet noise - no noise of any kind (my wife remarked about this regarding all 4 passes she saw); It appeared to vanish in the haze some distance to the north of our location. We live in the flight pattern of Camp Atterbury and see many helicopters and other military aircraft in the local airspace nearly every night. I have occasionally seen what I believe to be military craft flying without strobes or marker lights, perhaps simulating combat missions. When my wife initially told me what she was seeing, I thought it was probably military. However, I have not seen military or civilain craft flying so silently, displaying this dull orange-red color. If it was military, it did not look or sound like anything I have seen before in our area. Also, it did not follow the typical Atterbury flight pattern. It was all a bit eerie."],"Object Shape":"Teardrop, Triangle","Country":"United States","Weather Factors":"Unknown","Latitude":"39.060608","trends":["There have been no other sightings in Jonesville","This sighting has never been favorited."],"Object Features":"Undisclosed","Source":"MUFON","Region":"Indiana","Longitude":"-85.889703","Object Flight Path":"Undisclosed","Date of the Event":"07/04/2010 10:40 UTC","City":"Jonesville","Disposition":"Unknown","Tags":"City","Sighting Duration":"00:15:00","Case Number":"24281","Log Number":"US-07062010-0032"}