{"Object Shape":"Star-like","Country":"United States","Sighting Duration":"00:02:00","Disposition":"IFO","Region":"Massachusetts","Source":"MUFON","Latitude":"42.269893","Longitude":"-71.795693","Date of the Event":"07/03/2010 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.269893,+-71.795693(24288)&iwloc=A&hl=en\"> mufon case (24288) map </A>","Viewing Distance":"Over One Mile","Object Features":"Unknown","Log Number":"US-07062010-0039","Tags":"City","City":"Worcester","files":["/var/www/straped/mufon/html2text/24288.html.txt","/var/www/straped/mufon/org/24288.html"],"Date Submitted":"07/06/2010 05:07 UTC","Case Number":"24288","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Summary":"Star-like object approached, south to north. Flared-up brightly. Faded a bit. Continued on path up and away. Stopped. Zig-zagged.","Weather Factors":"Unknown","divs":["Sighting DetailsOn the 3rd of July around 10:15 p.m.-ish, we (7 of us family members) were lighting some tame fireworks in our driveway. Lots of other folks in the area were doing the same, as it was 4th of July eve. I said to my 10 yr. old son, \"We should've checked to see if the ISS was due by.\" But we didn't want to break away from the fun to come inside and check the computer. After watching the show for a few minutes (maybe 15 or so), on what was a totally clear night with lots of stars and the Big Dipper overhead, my son said \"Look, mom, I think it's the ISS!\" Coming toward us from the South heading due North (which isn't a usual flight path for the Space Station in our area, I thought) was a bright, non-blinking, silent, star-like object, just like the ISS, but much lower in the sky. However, when it got almost directly overhead, it flared up extremely brighter for a few seconds, almost like a searchlight, but with no sound whatsoever. It then dimmed back to the brightness it was originally spotted, and it seemed to travel at a faster rate than it's first approach, continuing North, but all at the same time getting dimmer and dimmer, perhaps climbing higher and higher(?), in maybe 3-5 seconds. Then it came to a complete stop! Seemingly \"next to\" a star and looked just like a faraway dim star. But then it started moving again toward the North! After a few seconds my eyes lost sight of it, but my exuberant 35 yr. old nephew was able to keep his eyes on it the entire time and said it was now \"zig-zagging\"! He was completely intrigued and serious, freaking out. Then it was completely gone from his view. My 10 year old son, my 35 year old nephew, and my 40 yr. old self (all of whom were straight as arrows at the time) witnessed most of the objects display, while the handful of other people in the driveway only witness it approaching and getting bright for a few seconds before rising in a straight North trajectory. Plus, they were too busy enjoying the fireworks and sparklers to take the time out to observe what the 3 of us had. I contacted my local MUFON director directly with this as I was hoping for an easy explanation for it. Not sure if satellites of any kind maneuver in the same manner? But he thought not..."],"trends":["There have been 18 other sightings in Worcester","There were no other sightings in Worcester on or around July 3rd 2010"]}