{"Latitude":"41.582132","Object Features":"Undisclosed","Tags":"City","trends":["There have been 5 other sightings in West Des Moines","There were no other sightings in West Des Moines on or around July 2nd 2010"],"Weather Factors":"None","Source":"MUFON","Object Flight Path":"Straight-line path","Longitude":"-93.703912","map":"<A HREF = \"http://maps.google.com/maps?q=41.582132,+-93.703912(24287)&iwloc=A&hl=en\"> mufon case (24287) map </A>","files":["/var/www/straped/mufon/html2text/24287.html.txt","/var/www/straped/mufon/org/24287.html"],"Sighting Duration":"00:01:00","Object Shape":"Sphere","Log Number":"US-07062010-0038","Region":"Iowa","divs":["sighting detailsmyself, my wife, and two of my friends witnessed this event. we were all in\\around my friends backyard pool. my friend anton first noticed the object heading towards us from the south. it was traveling northbound along i-35. anton spotted the object on the southern horizon, so we got a good look at it as it flew all the way from the southern to the northern horizon in about a minute. the house is right off of i-35, so it flew right over us. at first it just looked like a black sphere, as it got closer we saw a constant orange light on the bottom (not blinking). the object was flying at approximately 2000 ft. it was going about the same speed as a passenger jet, but was completely silent. we are in the landing path of the des moines airport and there are frequently jets flying at this altitude, and it is always very loud. the object appeared to be about the size of a two story house. the object moved from the southern horizon to the northern horizon and out of sight in about one minute. afterwards, we all tried to rationalize what it could have been. my friends dad was in the air force for over 20 years, so we called him and told him what we saw. he said it sounded like either a secret government aircraft or a ufo."],"Date Submitted":"07/06/2010 04:51 UTC","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Date of the Event":"07/02/2010 07:00 UTC","Country":"United States","City":"West Des Moines","Case Number":"24287","Summary":"Black sphere with orange light on bottom flying silently at low altitude. (~2000 ft, ~400-500 mph)."}