{"Sighting Duration":"Undisclosed","Longitude":"-94.434104","files":["/var/www/straped/mufon/html2text/24280.html.txt","/var/www/straped/mufon/org/24280.html"],"Country":"United States","Summary":"Dim red light appeared over SSE Fort Smith, AR. No blinking lights at all, no sound, light was only on front side of object. Moving roughly about 3-400mph.","Disposition":"Unknown","divs":["sighting detailsa dim red, non-flickering light appeared over sse fort smith, ar. i saw it at first when it just appeared out of nowhere. i was looking into the sky to see fireworks, and at first it stood still for about 10mins. i didn't watch it the whole time as i figured it was a slow burning firework or a plane light at the top of a radio tower (but briefly wondered why it wasn't going on & off as usual). after some fireworks happening around the area, i saw it still in the same location still. then suddenly it started to move toward us. it also caught the attention of my mother in law. what was strange to me was that it had no blinking lights at all, no sound for its speed, the light that we did see until it passed us was only on front side of object, and it was very stealthy. it had to have been moving at around 2-300 miles per hour. we have an airport and military jets flying in an out. we are used to seeing planes. this didn't move like a plane, unless the military was testing. it was about the size of a f-16, maybe a bit wider and bulker. we could not determine a color except black (darker than night\\dusk sky). it moved from sse to nnw direction, covering 15-20 in 5mins (3-400mph). it passed right over us and we didn't even hear the sound of wind friction. me and my mother-in-law saw it, but it was so silent and dark that two other possible eye witnesses couldn't even see or hear it to try to locate it with their eyes. but we were pointing at it. sadly, we did not have video or camera handy."],"Latitude":"35.354536","Tags":"City","Object Shape":"Boomerang, Other, Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"Oklahoma","Object Features":"None, Wings","Case Number":"24280","City":"Arkoma","Log Number":"US-07062010-0031","Date Submitted":"07/06/2010 02:23 UTC","trends":["There have been no other sightings in Arkoma","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.354536,+-94.434104(24280)&iwloc=A&hl=en\"> mufon case (24280) map </A>","Date of the Event":"07/04/2010 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path"}