{"Country":"United States","Log Number":"","Object Flight Path":"Stationary","Region":"Colorado","Source":"MUFON","Sighting Duration":"00:00:00","files":["/var/www/straped/mufon/html2text/2428.html.txt","/var/www/straped/mufon/org/2428.html"],"Weather Factors":"Unknown","Disposition":"Unknown","Summary":"3 lights in triangle formation over mountains","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.764143,+-105.21603(2428)&iwloc=A&hl=en\"> mufon case (2428) map </A>","Date Submitted":"07/11/2003 08:50 UTC","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around July 11th 2003"],"Tags":"City","divs":["Sighting DetailsI was at Coors Brewery on break on the North side of the building on somestairs. I was just enjoying the evening light as it was fading in themountains and scanning the horizon. To the Northwest I saw 3 lights in atriangular formation the brightness was unlike a street light that has theappearance of shards radiating from it...these lights were brilliant and clearwhite. I could not believe what I was seeing, just sitting there in thedistance, because I had always wanted to see a UFO, but there was no doubt in mymind, I was fixated. I stared at them for about a minute and they winked out...just gone...even though I could see nothing but 3 lights I wanted to look somemore.....all of a sudden there were bursts of rapid firing light and shortlythere were several objects that streaked off in about a 30-45 degree angle fromwhere I saw the three lights, it was almost like watching ships in star trekgoing into warp,,,,it was amazing....I called to a mechanic in the room behindme to come out, we saw nothing but there was a jet that appeared to be ofstealth origins flying low over the mountains without lights heading in thegeneral direction of my sighting the mechanic then left.....then far far off inthe distance there were lights winking on and off.. I returned to work at 910pm.If someone else saw something last night too, would you let me know please."],"Object Shape":"Other","Date of the Event":"07/11/2003 08:50 UTC","City":"Golden","Object Features":"Undisclosed","Longitude":"-105.21603","Latitude":"39.764143","Case Number":"2428"}