{"map":"<A HREF = \"http://maps.google.com/maps?q=33.058956,+-108.751692(2429)&iwloc=A&hl=en\"> mufon case (2429) map </A>","Object Features":"Other","Latitude":"33.058956","Log Number":"","Date Submitted":"07/11/2003 05:15 UTC","Country":"United States","divs":["Sighting DetailsI was driving my car east to west between Lordsburg, NM and Safford, AZ alongI-10. I had just crossed the State line when a very violent thunderstorm wasmoving from west to east in the I-10 corridor. Lightning, high winds,thunderhead clouds. Following a thunderhead south of I-10 over the ChiracuahaMountains was a perfectly symetrical round hole in the cummulus cloud layerbehind the storm. I could see at least two other apparently perfectly roundholes in the cloud layer to the northwest and north, north of I-10, at greaterdistances. The hole to the south was, for estimating purposes, 4 miles south ofthe highway it could have been more and at least two or three miles indiameter--extremely large. As I drove east and watched the hole, after I hadgone through the storm, instantaneously an apparently perfectly round sphereslower 66 per cent appeared in the hole extending at least 3,000 below the cloudlayer, perhaps 500 off of the ground. It was grey, somewhat luminescent, withmist shrouding it. I watched it for about thirty seconds. A green fireball shotout of the sphere traveling in a direct line from the sphere east to west andaccelerated out of view within two or three seconds on a slightly inclinedplane, upward. As I was watching the sphere it vanished instantaneously I wouldsay became invisible again because I saw no motion with the sphere as itappeared or disappeared. It was hovering, no sounds that I could hear, no highspeed vibration. The hole in the cloud continued moving slowly in a west southwest direction, south of I-10 for at least 20 minutes at which time the holeslowly refilled with clouds until it was one continuous cloud layer.My first impression of the object was that it was huge and wasnt a flying disc.There were no secondary effects of the sighting to me or to the vehicle I wasdriving.Im interested if anyone else reports it. It happened yesterday afternoon."],"Weather Factors":"Windy, Lightning, Rain, Light","City":"Buckhorn","trends":["There have been no other sightings in Buckhorn","This sighting has never been favorited."],"Disposition":"Unknown","Object Shape":"Sphere","Summary":"South East Arizona Very Large Sphere","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Region":"Arizona","Tags":"City","Sighting Duration":"00:30:00","Date of the Event":"07/11/2003 05:15 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2429.html.txt","/var/www/straped/mufon/org/2429.html"],"Case Number":"2429","Longitude":"-108.751692"}