{"Log Number":"US-07062010-0045","Object Shape":"Circle, Fireball, Oval, Teardrop","Viewing Distance":"Unknown","Region":"Alabama","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.213181,+-87.567864(24294)&iwloc=A&hl=en\"> mufon case (24294) map </A>","City":"Tuscaloosa","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Other","divs":["Sighting DetailsOn July 3, 2010 I first saw the object. At Lake Burton, in the mountains of Clayton, Georgia, every year there is a fireworks show on Billy Goat Island. After the finale of the fireworks, my cousin and I noticed a round, oval-like flame flickering in the sky. I thought it was a burning plane and was hit by the fireworks. But, then it started to maneuver around left to right, up then down some, for about 2 minutes. Then, it went directly up into the sky slowly and disappeared, almost like the \"flame\" in it had went out. Then, tonight, July 6, 2010, my mother noticed the object out the window. I ran out and identified it as what I saw the other night. This time, there were 3 of them, but all came out at different times. The first one (9:46pm) stayed to the right of the sky and went up. The second one (9:51pm) was in the middle of the sky and went up. Finally, the last one was in the far left of the sky, coming out from behind one of the mountains. It was very large and very orange and bright and we could see a \"flame\". We got binoculars and I looked and it appeared to be shaped like a hot air balloon but more oval and teardrop like which was white. It looked like the flame was surrounded by an orb or halo of translucent white which held the flame. It went straight up and disappeared."],"Longitude":"-87.567864","Case Number":"24294","Date of the Event":"07/06/2010 09:33 UTC","Latitude":"33.213181","Summary":"Orange flamelike.","Date Submitted":"07/06/2010 10:43 UTC","files":["/var/www/straped/mufon/html2text/24294.html.txt","/var/www/straped/mufon/org/24294.html"],"Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 2 other sightings in Tuscaloosa","There were no other sightings in Tuscaloosa on or around July 6th 2010"],"Disposition":"Insufficient Data"}