{"Case Number":"24299","Country":"United States","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=35.398545,+-97.593387(24299)&iwloc=A&hl=en\"> mufon case (24299) map </A>","Region":"Oklahoma","Object Flight Path":"Undisclosed","Object Shape":"Unknown","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around June 6th 2010"],"Date Submitted":"07/07/2010 12:18 UTC","divs":["sighting detailswitness contacted our state director -marilyn carlson- by phone on june 8th in the evening about lights dancing erratically to the north of his house. these lights appeared june 6,7,8,and 9th at different times and different durations. marilyn went by his house on june 10th in the evening and watched the sky with night vision and also just eyesight but witnessed no light's, although 6 awac's planes flew over close by. (tinker air force base is not very far away). the witness had taken hd video of the light's on a number of occasion's during the night's in question but with the ambient lights (street light's and neighbor's porch light's), the quality was not very good (this sighting was in the middle of a neighborhood). i went over to the witnesses house the next night friday the 11th in the evening and watched the sky for approx 1 1\\2 hour's to no avail also. marilyn and i both were asked inside to view the video he had made. witness stated he would make a copy for us but after 4 request's to do so, he hasn't produced it yet. i talked to him again this evening and he reports he hasn't seen the light's again although he still checks on it often. the video showed white light's, size could not be determend, dancing left, right, up and down intermintinelly(sp) about 30 degrees above the horizon, pretty much due north. he said to the naked eye, they had color's that kept changing and also out of the cameras view (he had it on a tripod which was a good thing) farther up maybe 50-60 degree's above the horizon there more of the light's dancing around off and on. i find this case interesting for the 4 night's in a row these things showed up but again very inconsistant. the witness also had some neighbor's across the street look at them when they got home on the 6th, and they also saw the object's(?) and were baffled at what they might be. rick gardner fi"],"Weather Factors":"None","Date of the Event":"06/06/2010 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Oklahoma City","Log Number":"US-07072010-0001","Object Features":"Louvres","Summary":"Errattic lights.","Latitude":"35.398545","files":["/var/www/straped/mufon/html2text/24299.html.txt","/var/www/straped/mufon/org/24299.html"],"Source":"MUFON","Longitude":"-97.593387","Tags":"City"}