{"trends":["There have been 4 other sightings in Mundelein","There were no other sightings in Mundelein on or around July 4th 2010"],"Viewing Distance":"Unknown","Region":"Illinois","divs":["sighting detailsthe event occurred on july 4th at approx. 9:15 pm (central standard time). i was standing by our parked car awaiting the fireworks display to start in mundelein, illinois. i looked up into the sky towards the west and noticed a orange-red sphere (ufo) with flashing lights traveling at a high rate of speed (similar to an airplane) with no sound emitting from the object. i was with my fiancee and her daughter and we were able to directly observe the ufo for approx. 3 minutes (went it completely got out of our range of vision). we captured the event on a camera phone. unfortunately, the quality of the picture is poor since my fiancee's daughter was quite nervous and her hand was shaking most of the time. in actuality, the ufo was traveling at what appeared to be a constant speed and in a straight line (from west to east). i apologize in advance to those who will watch the video since i yelled out several expletives while taping the ufo. this was a unique and amazing experience to all of us. there were many, many people in the vicinity who also witnessed this ufo. this was because the place we parked was filled with family \\ people who were waiting for the fireworks display to start. http:\\\\www.youtube.com\\watch?v=1vut7v1ywo8"],"Object Shape":"Sphere","Date of the Event":"07/04/2010 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.263079,+-88.003965(24291)&iwloc=A&hl=en\"> mufon case (24291) map </A>","Disposition":"Unresolved","Date Submitted":"07/06/2010 07:37 UTC","Case Number":"24291","Tags":"City","Country":"United States","Log Number":"US-07062010-0042","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","Latitude":"42.263079","files":["/var/www/straped/mufon/html2text/24291.html.txt","/var/www/straped/mufon/org/24291.html"],"Longitude":"-88.003965","City":"Mundelein","Sighting Duration":"00:03:00","Summary":"Orange-red sphere with lights flashing traveling at high rate of speed.","Object Flight Path":"Undisclosed"}