{"Viewing Distance":"Unknown","Region":"Ohio","trends":["There have been no other sightings in Put-in-Bay","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/24293.html.txt","/var/www/straped/mufon/more/24293_submitter_file1__0703100939.jpg","/var/www/straped/mufon/org/24293.html"],"Longitude":"-82.828583","Sighting Duration":"Undisclosed","Latitude":"41.637573","Date of the Event":"07/03/2010 10:30 UTC","Disposition":"IFO","Tags":"City","divs":["Sighting DetailsMe and my wife spent the Fourth of July weekend visiting Put-in-Bay, Ohio. On Saturday, July 3rd, 2010, we were riding our bikes toward the Perry's Victory Monument. It was approximately 10:30 am, Eastern time, and the Monument was directly to our East. The morning sun was extremely bright, and the skies were perfectly clear. The sun was directly behind the top of the structure when we rode by, so I stopped to take a picture. It was very peaceful and quiet at this time. The top of the tower was glowing from the sun behind it. I took a picture with my digital camera, although it was very hard to see what I was shooting because of the intense sunlight. When I got home, I transferred the pictures from our trip to my computer in order to print them. When I printed the picture of the Monument, I noticed something in the air behind it, about half-way up on the right side. I didn't think much of it until I looked very close. Then I looked at it on the computer, and I zoomed in as far as I could. I saw a very distinct, metallic, steep-angled, saucer-shaped flying object. It was very startling. I remember having to squint whenever I looked in the direction of the Monument, and my attention was focused on the glowing top, so I did not notice the object when I took the picture, only when I printed it out. And, like I said above, it was a very quiet and peaceful time of the morning, and me and my wife made a note of how quiet it was at that time (no airplane or helicopter noises). If you need any other info from me about this event, just let me know."],"Date Submitted":"07/06/2010 10:30 UTC","Case Number":"24293","Object Features":"Undisclosed","Summary":"Object noticed on photo of Perry's Victory Monument.","Country":"United States","City":"Put-in-Bay","map":"<A HREF = \"http://maps.google.com/maps?q=41.637573,+-82.828583(24293)&iwloc=A&hl=en\"> mufon case (24293) map </A>","Object Flight Path":"Undisclosed","Object Shape":"Saturn-like","Log Number":"US-07062010-0044","Source":"MUFON","Weather Factors":"Unknown"}