{"City":"Kinsale","Weather Factors":"Unknown","Object Shape":"Fireball","Summary":"3 balls of yellow light made different arrangements blinked out two minutes came back exact spot did it again only 4th came up and all came together did it again.","Tags":"City","trends":["There have been no other sightings in Kinsale","This sighting has never been favorited."],"Date of the Event":"07/04/2010 09:30 UTC","Viewing Distance":"Unknown","Region":"Virginia","Latitude":"38.033474","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.033474,+-76.58077(24298)&iwloc=A&hl=en\"> mufon case (24298) map </A>","Object Features":"Undisclosed","Log Number":"US-07062010-0049","Object Flight Path":"Undisclosed","Case Number":"24298","Longitude":"-76.58077","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/24298.html.txt","/var/www/straped/mufon/org/24298.html"],"Date Submitted":"07/06/2010 11:44 UTC","Country":"United States","Sighting Duration":"00:12:00","divs":["Sighting DetailsOn July 4th Me, my husband and two friends walked across my field to watch some fireworks off in the distance. After watching for about 15 minutes, we all suddenly noticed 3 distinct balls of Light yellowish in appearance. We all debated exactly what they were for a minute when they formed a triangle then they formed a line then they all came together and blinked out. About two minutes later, they appeared again in the exact same spot in the sky this time they repeated the the same thing again except this time a fourth one rose up directly underneath the three and joined them and blinked out. The first appearance lasted almost 5 minutes then a two minute gap and and another 5 minutes for the second appearance.There was not any way these were fireworks or planes they were moving with intelligence they were no blinking lights they were light bright yellow fireballs with a slight blue tinge on three sides of each. They were approximately 400-500 feet up much higher than any of the fireworks which were much closer. They were just south of ST. Marys at the end of the Potomac River almost at the Mouth of the Chesapeake Bay. We absolutely all agreed these were not planes nor were they fireworks. I was hoping to God that someone had taken a Video of them it being the 4th of July. We were looking at the fireworks they were much closer in proximity to us these were much higher than the fireworks and were stationary in the sky until they started making formations.The movements were slow and deliberate they formed a triangle and then a line they moved all together into one. Both times it was repeated except the second time a Fourth one rose up from Below all 3 and joined them. It was the a little scary it was not normal. We kept asking eachother if we were all seeing the same thing. We made a pact not to forget what we saw I don't think I will ever forget it."]}