{"Object Flight Path":"Straight-line path","Country":"United States","Case Number":"24307","Weather Factors":"None","Longitude":"-80.125536","Summary":"I saw a luminous/oblong object in the night sky over the Miami Beach area that slowly floated N-NW about a half a mile inland and less than a half a mile away from me.","Object Features":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24307.html.txt","/var/www/straped/mufon/org/24307.html"],"divs":["sighting detailsi apologize to everyone for taking so long to give in my personal report. i am a mufon field investigator for the miami area and on march 12, 2009 at 10:25 p.m. i had my own personal ufo encounter. i was crossing back accross the street to my townhouse after going to a convenience store for a pack of cigarettes.i live on (*partial address deleted--sgonzalez\\cms) and as you go east on it, it then becomes the \"96th street broad causeway\" which is over water and about a half a mile inland from miami beach\\bay harbour area. as i looked in both directions, east and west for on coming traffic i saw a very unusual oblong object luminous and glowing just over the broad causeway in the east. puzzled by what i saw i continued to cross the street but instead of going in my home i continued to walk as fast as i could to get a closer look at this object. i was sure that if i just got a closer look i know i would be able to identify this object. i thought i might be looking at the side of a blimp or possibly an oblong balloon. there were definately odd things about it. it floated slowly, about 20 mph in a steady north by northwest direction heading into a residential area called \"keystone point\". it was completely silent. there was no writing, drawing or numbers on it. it had a definate luminous outline against the back drop of the dark night sky on it's bottom half and around the front and back ends. it was the upper half that i could not get a clear description of. it appeared unevenly sloped on top and seemed to narrow halfway down towards the tail end. there was a red light on the upper half, on top, mid center. there was another red light on the bottom half again, mid center. it's surface appeared to have silvery white metalic tiles that shimmered in the night sky. they were more apparent on the upper half and side and were shimmering in the night as if the object was reflecting bright lights off of it as though it were sitting in the middle of a football stadium and was covered in bright flood lights. i watched it for five minutes. it appeared about a thousand feet long and 200 feet high at it's highest point and about 1000 feet up. good year + met life denied it was there's. i discussed the object at length with (**name deleted--sgonzalez\\cms), representing good year blimp. he stated that their blimp had already landed that night by 9:00 pm and was in the lauderhill area, not near me. he said the two red lights would have been beackon lights and it sounded like it was some sort of an \"airship\" but what kind he did not have a clue. it was not the other blimp by metlife because i would have seen the large snoopy dog logo on the side had it been there's. i had a clear, unobstrucked view of the object, taking my eyes off of it for only one second to see if anybody else was walking on the street, seeing what i was seeing. i was alone. when i realized that there was no logical explanation for what i was looking at that night i stopped dead in my tracks until it floated out of view."],"Sighting Duration":"00:05:00","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=25.796184,+-80.125536(24307)&iwloc=A&hl=en\"> mufon case (24307) map </A>","Region":"Florida","Date Submitted":"07/07/2010 03:38 UTC","Tags":"City","Date of the Event":"03/12/2009 10:25 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Miami Beach","Latitude":"25.796184","Object Shape":"Blimp, Other","trends":["There have been 8 other sightings in Miami Beach","There were no other sightings in Miami Beach on or around March 12th 2009"],"Log Number":"US-07072010-0009"}