{"Tags":"City","City":"Fishersville","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24303.html.txt","/var/www/straped/mufon/org/24303.html"],"Region":"Virginia","Latitude":"38.099023","map":"<A HREF = \"http://maps.google.com/maps?q=38.099023,+-78.969192(24303)&iwloc=A&hl=en\"> mufon case (24303) map </A>","Date Submitted":"07/07/2010 12:56 UTC","Longitude":"-78.969192","Country":"United States","Date of the Event":"07/04/2010 10:58 UTC","divs":["sighting detailsthe family was having a 4th of july cook out in my mother's back yard. there were 14 adults present and we were watching neighbors shoot off fireworks in the area. my brother said, \"what is that?\". he was looking at the sky to the southeast. we all saw what he was looking at and it was an orange glowing orb, bigger than a star and almost appeared to be on fire. it was traveling silently from southeast to northwest and seemed to slow and hover when it was midway in the sky. my sister had been taking pictures and quickly aimed her camera towards it and took a short video. we made the obvious guesses to what it was; a weather balloon, venus, a kite, fireworks, but none seemed to fit this behavior.it moved slightly faster than a plane, but it was much bigger and had no blinking lights. as it started moving again towards the northwest the glowing diminished and it seemed to get smaller. then it was gone. there was puzzlement and curiosity while we were watching it and then immediately after a sense of \"wow\" and \"that was creepy\\weird\". there was some joking and speculation if it was a ufo. no one we have spoken with observed it, but we were pretty awed to see other reports of similar objects across the country on the same date."],"Viewing Distance":"Unknown","trends":["There has been one other sighting in Fishersville","There were no other sightings in Fishersville on or around July 4th 2010","This sighting has never been favorited.",""],"Object Shape":"Sphere","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Case Number":"24303","Object Features":"Undisclosed","Log Number":"US-07072010-0005","Summary":"Orange glowing orb.","Disposition":"Insufficient Data"}