{"Case Number":"24304","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.627479,+-89.770958(24304)&iwloc=A&hl=en\"> mufon case (24304) map </A>","Object Shape":"Disc","City":"Wisconsin Dells","Log Number":"US-07072010-0006","divs":["Sighting DetailsIt's an old story of mine. Happened to me when I was working for summer as student in Wisconsin Dell, WI area in Summer of 2003. Event happened in early calendar summer at night (around midnight) on some night of probably late July or maybe early August. Night was kind of bright thanks to a bright full moon. At late night (probably before midnight) I wanted to get some fresh air and decided to have a lonely ride in my car. I took my car from home (we were living between Lake Delton and Wisconsin Dells) and traveled at night through Broadway (in Wisconsin Dells), then leaving Wisconsin Dells downtown area behind and taking right turn on some highway (from google maps i think it was Route 16). I have traveled a couple miles East and then pulled over to small local dirt road (on left) ending in the middle of a corn field. I stopped the car, shut engine off and enjoyed the beautiful view of the bright full moon in front and above me while sitting in car (kind of in the middle of corn field it was). I kept my windows rolled down and enjoyed the warm summer breeze. I smoked a cigarette and at some point I noticed something odd. The sky got a little brighter than it was before, for some reason I started having a very strong urge to leave this place quickly, started looking around (nobody around, only seen maybe one or two cars passed on highway far behind me) and I noticed it got dead silent in this place. then i noticed it. it was the moon!!! and actually it couldn't be the moon, because it was located now in a different spot on the dark sky, I also believe it appeared bigger to me than a while ago (couple minutes it takes to smoke a cig). not really knowing why it scared the hell out of me. Immediately started the car and backed out of that corn field to highway shoulder and rammed on the gas pedal, I remember looking in the rear view mirror and seeing the \"moon\" now behind me while it was supposed to be on my right! geeeez ... accelerated like crazy and as fast as i could I started traveling back in Wisconsin Dells downtown direction. For a few minutes I was having this very very scary feeling that the \"moon\" was chasing me (maybe it was only trying to scaring me off who knows)... it all lasted maybe 10 minutes. once left the Route 16 the feeling went away, everything returned to normal. Moon was were it was supposed to be and there was nothing scary anymore. I will remember that feeling for a very long time."],"trends":["There have been no other sightings in Wisconsin Dells","This sighting has never been favorited."],"Summary":"What looked like a full moon above the corn field moved and was chasing me shortly.","Longitude":"-89.770958","files":["/var/www/straped/mufon/html2text/24304.html.txt","/var/www/straped/mufon/org/24304.html"],"Region":"Wisconsin","Date of the Event":"07/15/2003 12:00 UTC","Tags":"City","Date Submitted":"07/07/2010 01:25 UTC","Country":"United States","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"43.627479","Weather Factors":"Unknown","Disposition":"Insufficient Data","Source":"MUFON"}