{"Source":"MUFON","Viewing Distance":"Over One Mile","Log Number":"","Weather Factors":"Unknown","Sighting Duration":"00:10:00","Latitude":"41.002968","trends":["There have been no other sightings in Bartonsville","This sighting has never been favorited."],"City":"Bartonsville","Longitude":"-75.28035","Country":"United States","divs":["Sighting DetailsExact Location from Geocode.com410139.839N751632.484WWe four of us were sitting at my friendsWitness3 pool in his backyard when Ilooked up at the clouds and saw an object sitting between, but below the clouds.I looked for a moment thought it was a baloon and perhaps some sky divers, butthey did not fall. I said whats that, everyone else looked up. My girlfriendWitness2 said there were nine smaller pinpoint very bright light emittingobjects around the larger object. I personally saw about six after lookingclosely. I was calm, but amazed to see the objects. I asked my friend Witness 3if he had binoculars, he ran in and returned with two one 10x50 which I used,and the other unknown. The object through the binoculars appeared to be deltoidshaped with no discernable markings but emitting light at the top. It wasfloating from west to east, no sound. The smaller objects were in groups or 2, 3or 4 nearby the mother ship, moving independently, sometimes passing near thelarger object. My girlfriend Witness 2 said she saw one small object dissappearinto the larger object. The smaller objects moved about in a rather randomfashion, almost seemed as if they were on vacation, playing with each other,having fun. The objects were slowly moving away to the east, then went behindsome trees. I went to the front yard but the objects were gone from sight.I may be able to get the other witnesses to respond when an if you want toqeustion us."],"Disposition":"Insufficient Data","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.002968,+-75.28035(2430)&iwloc=A&hl=en\"> mufon case (2430) map </A>","Object Features":"Undisclosed","Object Shape":"Other","Date of the Event":"07/13/2003 06:15 UTC","Case Number":"2430","Object Flight Path":"Straight-line path","Summary":"Mother ship with nine bright pinpoint objects","Date Submitted":"07/13/2003 06:15 UTC","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/2430.html.txt","/var/www/straped/mufon/org/2430.html"]}