{"Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.632372,+-90.192304(24302)&iwloc=A&hl=en\"> mufon case (24302) map </A>","Region":"Missouri","files":["/var/www/straped/mufon/html2text/24302.html.txt","/var/www/straped/mufon/org/24302.html"],"Log Number":"US-07072010-0004","Date of the Event":"07/04/2010 10:13 UTC","Object Shape":"Sphere","Disposition":"IFO","Tags":"City","Summary":"Three orange spheres fly over while shooting fireworks.","trends":["There have been 74 other sightings in St Louis","There was one other sighting in St Louis on or around July 4th 2010"],"Country":"United States","divs":["Sighting DetailsI and four other friends were in my backyard particpating in the neighborhood Fourth of July celebrations in south St. Louis city. At 10:13 someone yelled out, \"What's that!\" and pointed up at a 45 degree angle across the main street by my house. We could all see what looked like an orange pumpkin or basketball floating from our left to right. Quickly another one appeared. They were traveling in a roughly SE to NW direction, silent. It appeared that the bottom of the objects where a brighter orange than the rest of it, which appeared to have ridges as a pumpkin or basketball might. There was wind going in an E to W direction on the ground, but fireworks did seem to indicate that above ground the wind was more SE to NW. The two objects floated mostly by our location, but went VERY straight along a 5 degree incline. It was as if they were on a \"rail\" in the sky as they did not quiver nor alter their speed AT ALL during the time we could see them. When the two had mostly passed by, a third one came along the same route. The first two dimmed and went away while yet keeping the 5 degree incline. The third object got brighter as it went in the distance until I finally stopped looking at it. I got pictures but they were small and jiggly and didn't show anything definitive. They could have been Chinese lanterns, though I haven't yet found any sold in our area with the shape these had. It was also quite strange that none of the three orange spheres changed the pace at which they flew by, although the wind was not so constant, nor seemingly as strong as these objects were flying fast. While I understand that it seems most reasonable to figure that the objects were Chinese lanterns, it was not normal for three objects to fly in the wind at a constant rate of speed and incline, for the first two lanterns to \"burn out\" and yet increase in altitude as they burned out - and for the last one to increase its light intensity the further it got away. None of that is natural, so the lights were unidentified as far as some of us were concerned. Ironically, last July 4th 3 orange \"flames\" flew by in the same general path as this year's, although last year the two witnesses agreed that the three lights literally looked like three licks of flames, orange fire WITHOUT containers."],"Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","City":"St Louis","Longitude":"-90.192304","Object Features":"Undisclosed","Latitude":"38.632372","Date Submitted":"07/07/2010 12:56 UTC","Case Number":"24302"}