{"divs":["Sighting DetailsThis is a copy of the siting as reported to another site: I witnessed something today along with my dad. We saw a large redish orange light in an arc shaped trajectory over southeast Michigan. I'm in Woodhaven and I could see it starting from the northeast and it was heading to the west of where I was. It was heading in an arc and couldn't see it after it disappeared behind the houses. It must have been very low to go behind the houses with it seeming to be so close, unless it was VERY large and far away. It was either glowing or burning a red-orange color.It was not a steady light and it was not blinking like a plane either, more of a flicker or pulse like a fire. My dad kept saying how it looked like a hot air balloon that was on fire to him. Also it was moving way to fast to be a blimp. We could not figure out what it was. I'm not sure the exact time but it was around dusk. The sun was down but it wasn't completely night either. I just found this email on the website when I was looking for news reports. I figured it was a meteor or something and others must have seen it. I live near an airport (grosse ile) and a hospital that very often has helicopters and I can honestly say I've never seen anything look like this before. Also the helicopters are very loud and this was not making any sound from what I could tell. I wanted to get some film of it but at the rate it was going I knew I wouldn't be back in time with the camera before it went behind the houses out of my view also I was like a deer in the headlights watching it anyway. Living near an airport and hospital I see things in the sky all the time. I've never seen anything lit like this. The color, and intensity was all wrong compared to any plane I've seen."],"Date of the Event":"07/06/2010 12:00 UTC","Summary":"Red-ish orange large fire ball moving east to west.","Disposition":"IFO","Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","Region":"Michigan","Case Number":"24309","map":"<A HREF = \"http://maps.google.com/maps?q=42.13893,+-83.241595(24309)&iwloc=A&hl=en\"> mufon case (24309) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24309.html.txt","/var/www/straped/mufon/org/24309.html"],"City":"Woodhaven","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Object Shape":"Fireball","Country":"United States","Longitude":"-83.241595","Date Submitted":"07/07/2010 05:04 UTC","Latitude":"42.13893","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Woodhaven","This sighting has never been favorited."],"Log Number":"US-07072010-0011"}