{"divs":["Sighting DetailsAt around 21:35 US Central Time I left my home for an evening walk around the neighborhood. I stopped briefly to speak with a neighbor who passed in his car, and then resumed my walk. The street I was on runs north-west to south-east for a short distance and then curves to a north to south orientation. As I rounded the curve headed due south, I received a text message from my son who was at work. The text message arrived at 21:46. I read the message and slipped my phone back in my pocket. As I did so, I looked up into the southern night sky and immediately noticed two points of light which I initially thought were stars. They were not blinking or flashing, were white in color, and were stationary, at about 35 degrees above the horizon. The lights were side by side, and parallel to the horizon. Within a few seconds of seeing them, the points of light began a slow rotation to an orientation vertical to the horizon, with one above the other. The rotation took about 3-5 seconds. After moving to the vertical orientation they stopped and remained motionless for about 5 seconds. By this time I had stopped walking and was standing stationary, in awe of what I was witnessing. After remaining motionless in the vertical orientation for about 5 seconds, the two lights began moving in opposite directions, the bottom towards the east and the top towards the west, and an incredible rate of speed. It only took 2-3 seconds for the lights disappear behind the trees on the eastern and western horizons. I was startled and a little frightened by what I witnessed. I am an avid night sky watcher and I am familiar with what airplanes and helicopters look like in the night sky. The lights I saw were neither, nor were they meteors or satellites. The objects were obviously very far away, and to move the distances they moved in just a few seconds means they were moving incredibly fast."],"Object Flight Path":"Path with directional change","Disposition":"Unknown","trends":["There has been one other sighting in Bridge City","There were no other sightings in Bridge City on or around July 6th 2010"],"Region":"Texas","Log Number":"US-07072010-0015","Object Features":"Undisclosed","Latitude":"30.026698","Date Submitted":"07/07/2010 10:46 UTC","Object Shape":"Star-like","Case Number":"24313","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.026698,+-93.842216(24313)&iwloc=A&hl=en\"> mufon case (24313) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Longitude":"-93.842216","Source":"MUFON","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/24313.html.txt","/var/www/straped/mufon/org/24313.html"],"Date of the Event":"07/06/2010 09:46 UTC","Summary":"Two star like objects parallel to the horizon rotated to an orientation vertical to the horizon then separated at a high rate of speed.","City":"Bridge City"}