{"City":"Pittsfield","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.456784,+-73.238482(24312)&iwloc=A&hl=en\"> mufon case (24312) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Star-like","trends":["There have been 17 other sightings in Pittsfield","There was one other sighting in Pittsfield on or around July 7th 2010"],"Viewing Distance":"Unknown","Date Submitted":"07/07/2010 10:36 UTC","Weather Factors":"None, Does Not Apply","Disposition":"IFO","Region":"Massachusetts","Country":"United States","Latitude":"42.456784","Object Flight Path":"Path with directional change","Log Number":"US-07072010-0014","Summary":"Speed and distance was amazing.","Date of the Event":"07/07/2010 11:23 UTC","divs":["Sighting Detailsi had decided to take my vacation on the 4 of july and this year go camping at tolland state forest in mass. it was a tuesday night around 11:30pm the heat was scorching all day long and the night wasnt any better .it must have been 85 degrees at 11pm . just before i call it a day i usually grab my binnoculars and look at the stars. my binnoculars are made for looking at the stars they are 80*100 power . being in the woods camping is great for star watching because it pitch black .anyways i started watching what i thought was a satelight moveing slowly across the sky and out of boardem i started to watch .within 3 seconds there was a bright flash of wight light ,the brightest light i ever seen come from what i thought was a satelight. it wasnt just the light that amazed me it was the speed and distance all at once. the only way to discribe it is as if you are watching a shooting star except the star doesnt stop it just keeps going across the sky,and then take a left turn going that fast. it was amazing to watch. there was a time when i use to look for these things ,and it was nice this one came to me ."],"Longitude":"-73.238482","Case Number":"24312","Source":"MUFON","Object Features":"None, Unknown","files":["/var/www/straped/mufon/html2text/24312.html.txt","/var/www/straped/mufon/org/24312.html"]}