{"Log Number":"US-07072010-0013","divs":["sighting detailsin my driveway watching fireworks display to the west of our home, put on by our village. my wife notice the lights described below which appears behind us. at a distance of approximately 4-5 miles and approximately 2500-3000 ft. above the ground, my wife and i observed 10 rusty orange lights in sky west of my home travelling nnw. there was one lead light and several hundred yards behind it there was a second light. a thrid and fourth light were several hundred yards behind the second light there were two lights at the same elevation but were offset to the left and right of the line of travel. (if you were to draw a line between the 2nd light and the two lights behind it would form a triangle.) additionally there were 6 other lights behind the two off-set lights (3rd and 4th light), again travelling at the same speed and elevation and in a straight line as measured from the lead light. the last 5 or so lights were spaced closer together than the lead for lights. please note the spacing between the first and second and the second and third\\fourth lights were approximately the same distance. the light continue travelling to the nnw and all \"blinked out\" at the exact same spot in the sky. please note that the \"blinking out\" was not due to them reaching a point where you couldn't see them any more. they were readily seen and at a point in the sky, just blinked out and could been easily seen just prior. as a result of this sighting my \"feelings\" were unchanged. i am believer in ufos and carefully observed the lights. the curious thing about this observation was how each light maintained the exact same speed, elevation and how the lead lights were spaced what appeared to be the exact same distance from each other and how they all \"blinked out\" at the same spot in the sky."],"Longitude":"-88.233568","Date of the Event":"07/03/2010 09:40 UTC","Object Features":"Undisclosed","Disposition":"Unresolved","Date Submitted":"07/07/2010 10:00 UTC","Case Number":"24311","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","City":"Cary","Summary":"Series of orange lights at same elevation travelling NNW.","map":"<A HREF = \"http://maps.google.com/maps?q=42.220788,+-88.233568(24311)&iwloc=A&hl=en\"> mufon case (24311) map </A>","Object Flight Path":"Undisclosed","Latitude":"42.220788","Region":"Illinois","trends":["There have been 7 other sightings in Cary","There were no other sightings in Cary on or around July 3rd 2010"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24311.html.txt","/var/www/straped/mufon/org/24311.html"],"Source":"MUFON","Object Shape":"Sphere","Viewing Distance":"Unknown"}