{"Object Features":"Unknown","City":"Port St John","Case Number":"24310","divs":["Sighting Detailsabout 5:15-5:33 AM on January 7th I stepped outside this morning and looked up into the sky towards the west and observed a bright star...it was a beautiful night, and I can see the milky way very clearly it was nice! My attention then turned to this star and something dim appeared underneath it. I thought to my self, my eyes are adjusting and Im seeing all the dim stars now! Well this dim star, started to get brighter like an incoming plane and as I acknowlege the oddity of the fiery orange color it started to move north. The light would dim in and out...It went from bright orange to completely disappearing...I thought to myself...perhaps a strange a funky plane? However the dimming and the brightening was very random, even the intensity was random. It was going from south to north...But my impression of it was that it was very very high in the atmosphere covering a lot of ground much because it had the speed and movement very much like a satellite, so I thought oookay it's must be a satellite. Finally when It dimmed out yet again...it did not reappear where I assumed it would...(the line...rather than keeping in a straight line...reappeared in a totally different part of the sky (moved my direction east)...then back to where is was before...(then moved farther west) and got brighter and moved towards my east again...at this point. I got scared and went back in...i wanted to wake up my brother to see all the activity in the sky. (around 5:20ish) I went back out and it either was out of my viewing range or that it disappeared. More details: A minute later we saw the typical satellites making their usual orbits(white color, did not flicker and moved in a linear line)...and at the same time a pair of satellites made their way across the sky as well. I am putting this detail in because they made for a good observation to how different this fireball was to a typical satellite. I added these details so that maybe this can give a better time frame and location in the sky. Also if your were to look at this star where I first noticed the fireball underneath it and scan your eyes towards the south you would see orions belt."],"map":"<A HREF = \"http://maps.google.com/maps?q=28.476944,+-80.788611(24310)&iwloc=A&hl=en\"> mufon case (24310) map </A>","Longitude":"-80.788611","Region":"Florida","Latitude":"28.476944","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date Submitted":"07/07/2010 07:14 UTC","Tags":"City","Summary":"Flickering fireball.","Country":"United States","files":["/var/www/straped/mufon/html2text/24310.html.txt","/var/www/straped/mufon/org/24310.html"],"Date of the Event":"07/07/2010 05:18 UTC","Source":"MUFON","Weather Factors":"None","Object Shape":"Fireball, Star-like","trends":["There have been no other sightings in Port St John","This sighting has never been favorited."],"Log Number":"US-07072010-0012"}