{"divs":["Sighting DetailsMyself, my fiance, and two of our friend were on whitehorse beach. we had missed the fireworks and decided to stay on the actual beach, and just hang out and look at the stars. we saw many shooting stars, planes and satellites, but some time between maybe 11:00 and 1:00am our friend brought our attention to something moving in the sky. he had been watching it for a few minutes by then and said something to the effect of \"check out that star, it's moving really weird. do you guys see that?\" when i spotted it. i thought it could possibly be a satellite because it was floating across the sky as they do, only a bit brighter, as if it were reflecting the stars around. as i continued to watch it pass under one star, just on the other side of it, the object stopped, then crossed back under the star, then up, back down and sort of moved in sections around this one star. after a couple of minutes it continued in it's original direction and sort of faded out of sight like it was going higher in the atmosphere. all of us were very excited because none had EVER seen anything move like that in the sky. i consider myself a logical person and there is no way that this was any man made craft that the public has knowledge of yet."],"Summary":"Star like object stopped, backed, went up and down then flew up into atmosphere.","Latitude":"41.963506","Log Number":"US-07072010-0023","Object Shape":"Star-like","Case Number":"24321","Longitude":"-70.658442","Region":"Massachusetts","Country":"United States","Object Features":"None","Date Submitted":"07/07/2010 06:07 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24321.html.txt","/var/www/straped/mufon/org/24321.html"],"trends":["There have been 15 other sightings in Plymouth","There were no other sightings in Plymouth on or around"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.963506,+-70.658442(24321)&iwloc=A&hl=en\"> mufon case (24321) map </A>","Object Flight Path":"Path with directional change","Date of the Event":"Unknown","Source":"MUFON","City":"Plymouth","Disposition":"IFO","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Over One Mile"}