{"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Country":"United States","Tags":"City","Date of the Event":"02/15/1977 12:00 UTC","Region":"New Jersey","Object Features":"Dome, Window(s)","Latitude":"40.902599","Weather Factors":"None","Object Shape":"Disc","Source":"MUFON","Log Number":"US-07072010-0025","files":["/var/www/straped/mufon/html2text/24324.html.txt","/var/www/straped/mufon/org/24324.html"],"trends":["There have been no other sightings in Boonton","This sighting has never been favorited."],"Disposition":"IFO","Case Number":"24324","Longitude":"-74.407097","map":"<A HREF = \"http://maps.google.com/maps?q=40.902599,+-74.407097(24324)&iwloc=A&hl=en\"> mufon case (24324) map </A>","Date Submitted":"07/07/2010 06:47 UTC","Summary":"Gold disc at tree top level, silent, port holes visible, rotating lights around it.","divs":["Sighting DetailsI was 14 years old, my mother was driving. It was winter and dark at the time. We were driving Route 287 North towards Boonton. Near bridge on 287 North near Boonton Resevoir(Jersey City Resevoir officialy known as). People were stopped on highway looking at gold disc shaped object at tree top level, it was very detailed, silent, rotating lights, the thing that really struck me was the port holes were clearly visable. Other witness's were present maybe 15 people, it was also in the Daily Record at the time. The craft was visable about 15 minutes, after which it silently zoomed off a great speed. My mother said to me it was some type of Russian plane, I said I doubt that! I did not feel scared just amazed! What was weird, after that incident, I had a dream at home that a face was staring at me in my bed, oval head large black eyes, it seemed very real I was scared to death! never had that again, today the face i saw is known as an grey alien. Also after that my mother and I were chased by a man in a gold dodge scamp around Boonton he had dark glasses and looked sraight ahead I told my mother to drive to Boonton police station then he left chasing us."],"City":"Boonton","Viewing Distance":"21-100 Feet"}