{"files":["/var/www/straped/mufon/html2text/24322.html.txt","/var/www/straped/mufon/org/24322.html"],"Latitude":"39.961515","Country":"United States","Summary":"My First UFO Experience, Late @ Night & Alone at the End Of My Driveway; A Truly Life-Altering Experience...","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.961515,+-75.154289(24322)&iwloc=A&hl=en\"> mufon case (24322) map </A>","Region":"Pennsylvania","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"10/04/2008 12:00 UTC","Sighting Duration":"00:30:00","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around October 4th 2008"],"City":"Philadelphia","Tags":"City","Disposition":"Insufficient Data","Longitude":"-75.154289","Date Submitted":"07/07/2010 06:10 UTC","Log Number":"US-07072010-0024","Weather Factors":"None","divs":["Sighting Details\"yo man. its mike. rick's friend. you remember me. well, im writing you right now, cause im freakin out cause i just experienced the most unexplainable thing thats ever happened to me, and with our background knowledge and our better understanding to whats actually out there, i figured you'd be the only one who would hear me out and not think im nuts instead. ok... so i was driving back from going to blockbuster wanting to rent tapes, and it was closed, and i forgot to get cigs, so i have to go back out to get them, but besides that point, the trip was basically useless. so im about to pull in my driveway, and i notice weird lights in the sky. at first, i thought it was an airplane, cause it had blinking lights of blue and red, but dismissed that idea when i noticed how impossible the movements it was making. and as i was looking at it, though, watching it almost flying around, stopping for a minute and moving again to the next spot, i dunno if it was a trick of my eyes, or what, but i could've sworn i saw a very thin beam going down to the ground for a few seconds. at the moments when it was stopped. now, i know right now, i sound insane, but i swear man, i've never seen a ufo before, but this genuinely is true!!! i would never ever lie about something like this, if you ask anybody who knows me, they can tell you im the most honest person they know. anyways, so i started freaking out, and parked at the end of my driveway, in the middle of the street, just amazed at what i was witnessing. and wondering if it could see me. and i actually was speaking out loud to it, as if i was talking to it as if it were a person, \"can you see me?\" and when i said that, it slowed down and stopped for a minute, and then it went white and moved back as it blinked out. and i was like, \"HOLY ****, OMG!!!\" and i stayed for a minute and noticed it above the trees which i was at first looking at it between. it seemed to be traveling across the sky, closer to where i was. this is when i really started to get the adrenaline pumping cause it was almost as if it was responding to me. so i slowly pulled in my driveway while watching it coming closer in the sky, and i parked and got out. now, here was my chance to see if i could hear anything, that way, as impossible it may have seemed at the time, i was thinking, maybe it was a helicopter. so, i was standing outside watching it get closer, and then finally passing me by slowly overhead, and continuing. no sound whatsoever as it glided smoothly in the sky, still with that light pattern (which was very unique also) of blue and red. the scarier thing?? as i watched it passby overhead, i saw another one doing the same from the opposite direction, over from behind me!! i looked in the sky closer and noticed a few of them!!! one or two doing that weird beam thing i said before!!! i was having a panic attack by then, ran inside. my mind was racing!!! and of course, i know it of course could be extraterrestrial, but my mind clicked with a scarier thought... that it could be some kind of top secret ****** up government ****!!!! anyways, i went on my back porch for a minute trying to find them again, but i didnt see them. im about to go out to the driveway again, cause thats more open sky, and see if i can find one again. (cont'd., but no other information provided)...\""],"Case Number":"24322","Object Shape":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown"}