{"Weather Factors":"Unknown","trends":["There have been 67 other sightings in Louisville","There were 5 other sightings in Louisville on or around July 4th 2010","This sighting has never been favorited.",""],"Date Submitted":"07/07/2010 06:52 UTC","Longitude":"-85.754286","Summary":"Orange glowing round basketball looking type object.","map":"<A HREF = \"http://maps.google.com/maps?q=38.260085,+-85.754286(24325)&iwloc=A&hl=en\"> mufon case (24325) map </A>","Tags":"City","Source":"MUFON","Region":"Kentucky","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Disposition":"Unknown","Object Features":"Undisclosed","City":"Louisville","files":["/var/www/straped/mufon/html2text/24325.html.txt","/var/www/straped/mufon/org/24325.html"],"Date of the Event":"07/04/2010 10:00 UTC","divs":["Sighting DetailsWe were outside for fireworks in our neighborhood on July 4 2010 in Louisville KY. I didnt have the camera at first and did not capture the first one I seen. I went and got camera and another one appeared again. I appeared to be round and orange in color and glowing. It made no sound and moved from the south towards the north. It eventually disappeared either out of my line of sight behind trees and such or just disappeared. I could not really tell. When zoomed in on my camera it appeared to have pits and crators like the moon. On one side it looked like there was a hole or mouth so to speak. It appeared with the naked eye to look as if it had a ring around it or was glowing. In the video I took it does not look that way. Had no clue what it was other than an object I had never seen before. I thought at first maybe it was the embers from a firework left over but it never disappeared like those do. Then I realized this is something more. The color was close to how the end of a lit cigarette would look in the dark.It was moving steady in one direction. No jumping around. The video I took which will be attached looks as if its moving but its more of trying to stablize the camera after zooming than anything. It did travel in more of a straight line moving south to the north but it did not jump up and down or anything."],"Latitude":"38.260085","Object Flight Path":"Undisclosed","Case Number":"24325","Log Number":"US-07072010-0026","Object Shape":"Circle, Sphere"}