{"Longitude":"-122.307721","Summary":"i heard a low buzzing sound (like a very deep bass) so i went outside to see what it was. i saw the object and grabbed my camera. i took two pictures before it flew away. i dont think it noticed me.","Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24338.html.txt","/var/www/straped/mufon/more/24338_submitter_file1__firstpic.jpg","/var/www/straped/mufon/more/24338_submitter_file2__secondpic.jpg","/var/www/straped/mufon/org/24338.html"],"divs":["Sighting Details1-I was in the kitchen getting a snack. 2- i heard a low buzzing noise(like a lawn mower but not as choppy and much lower) so i went outside to my back yard to see what it was. it was a noise i have never heard before. 3- i had no clue at all!! at first i was kind of frightened, but then i realized it might be a UFO so i grabbed my camera and a tripod. 4- it looked like a saucer. classic UFO. it slowly moved parallel to me. the time it took me to take the two pictures was about 10-15 seconds if that helps you calculated the speed. it seemed quite far away, but i have no clue how far. 5-i was kind of scared. kind of weirded-out. i felt kind of nauseous. 6- it flew away. i was about to take a third picture, but it was gone before i could take it. it was the fastest i have ever seen anything accelerate in my life. sorry i left everything anonymous, i just dont feel comfortable with strangers knowing my information."],"Latitude":"47.82563","City":"Lynnwood","Weather Factors":"Unknown","Object Shape":"Blimp, Circle, Disc, Oval, Saturn-like, Sphere","Object Features":"Dome","Viewing Distance":"Unknown","Sighting Duration":"00:00:20","Region":"Washington","Date Submitted":"07/07/2010 10:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.82563,+-122.307721(24338)&iwloc=A&hl=en\"> mufon case (24338) map </A>","Log Number":"US-07072010-0037","trends":["There have been 9 other sightings in Lynnwood","There were no other sightings in Lynnwood on or around January 7th 2008","This sighting has never been favorited.",""],"Country":"United States","Disposition":"Hoax","Case Number":"24338","Date of the Event":"01/07/2008 10:23 UTC","Tags":"City"}