{"Weather Factors":"Unknown","divs":["Sighting DetailsWe were up at clatterin kist about to do a ceremony to celebrate the full moon.On the way to the kist we noticed bright white orbs through the trees no, notwhere the moon was. We first noticed the object after lighting a bright orangecandle and seeing a light blinking exactly the same colour over on the suiehill. We at first thought it was a mast, or car lights, but it soon becameevident that the movements and flashing pattern were too erratic for either ofthese, also too big to have been car lights at that distant. We both feltintense fear, and a sense of being watched and not welcomed. It was a veryuncomfortable feeling. The lights moved all over the hill, in front of both theforest and above the tree line, occasionally appearing in the sky above thehill. To the naked eye they appeared to flash on and off, then again in anotherposition, but through binoculars were observed to move while flashing. Theyappeared in random sequence, and would remain lit for several seconds beforeflashing off. The colours changed between red and yellow although size remaineduniform and the number of objects increased from 1 to 4. The feeling of beingwatched and the sense of hostility increased, and as the number increased therewas a sensation of being closed in on, so we left the area as quickly andquietly as we could. When we returned to the car, the headlights seemed verydull and the night extremely dark with the moon low above the horizon. When weleft the vicinity of the suie hill, the lights brightened immediately, the skybecame lighter and more like a summers night, and the moon rose almostinstantly. On calm reflection, we realised that there are no masts on that hill,and no habitation."],"files":["/var/www/straped/mufon/html2text/2433.html.txt","/var/www/straped/mufon/org/2433.html"],"Viewing Distance":"Over One Mile","Latitude":"-34.147935","Country":"Australia","Sighting Duration":"01:00:00","Object Flight Path":"Unknown","Case Number":"2433","Disposition":"Unresolved","City":"Rhynie","Log Number":"","Object Features":"Undisclosed","Object Shape":"Undisclosed","Date Submitted":"07/14/2003 11:50 UTC","Longitude":"138.690062","Summary":"Red and amber coloured lights flashing and moving","trends":["There have been no other sightings in Rhynie","This sighting has never been favorited."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-34.147935,+138.690062(2433)&iwloc=A&hl=en\"> mufon case (2433) map </A>","Region":"South Australia","Tags":"City","Date of the Event":"07/14/2003 11:50 UTC"}