{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Log Number":"US-07082010-0003","Object Flight Path":"Straight-line path","Object Features":"None","Sighting Duration":"00:02:00","Case Number":"24344","Region":"New York","Source":"MUFON","Latitude":"44.707107","Longitude":"-73.447252","map":"<A HREF = \"http://maps.google.com/maps?q=44.707107,+-73.447252(24344)&iwloc=A&hl=en\"> mufon case (24344) map </A>","divs":["Sighting DetailsI was standing outside a friends house in the country; about to smoke a cigarette and staring at the stars (not looking for a U.F.O. or anything like that). As i watched to the west i noticed a strangely bright white light to the west; that i first thought was simply the i.s.s. ; i then noticed a plane to the south that appeared to be flying west, and that is also when i noticed the red blinking lights that are common to see. I looked towards the other light in the west and noticed it wasn't blinking, and thought, \"well maybe its a helicopter or something\" . i realized i could hear the plane to the south making noise but not this. it flew in a pretty much straight line from west to east, only swaying slightly from either optical illusion or from winds pushing against it. it also seemed to fly around the speed that i have seen other planes and aircraft fly at, (quicker than a car, but nothing overly fast. The especially and pretty much only really weird or strange thing that seemed to happen was after it went passed me to the east the intense brightly lit object, seemed to have faded like somebody turned down a light that is hooked to a dimmer switch. The light faded down slowly until the only thing left of the view was the tiniest little pin prick off red in the sky. So for all technical purposes this fit the definition of a U.F.O. as I cant identify it. It was flying, and I presume it is some sorta object. But in my heart i believe it was a man made craft and I'm just curious as to what it is I saw earlier tonight. So again quick summary; 1. Object emitting BRIGHT white light came from west heading east. 2. While flying passed I didn't notice any other lights including the common blinking lights. 3. After passing me and continuing east for a couple seconds, the bright white light faded out and possibly faded into a solitary pinpoint of red light. 4.The entire time it seemed to travel in a straight path, (until the light faded) after which I couldn't find it anymore. 5.As I said in the beginning, my purpose of being outside was to smoke a cigarette and check out the stars, and it was a perfectly clear night. 6. Being in the country, I gad a very clear unlit view of the sky. Really curious as to what this is. Thank You."],"files":["/var/www/straped/mufon/html2text/24344.html.txt","/var/www/straped/mufon/org/24344.html"],"Tags":"City","Summary":"Bright white light from west suddenly faded in east.","Object Shape":"Diamond, Star-like, Triangle, Other, Unknown","Date of the Event":"07/07/2010 12:00 UTC","Date Submitted":"07/08/2010 04:05 UTC","Country":"United States","trends":["There have been 2 other sightings in Plattsburgh","There was one other sighting in Plattsburgh on or around July 7th 2010"],"City":"Plattsburgh","Disposition":"Unresolved","Weather Factors":"Unknown"}