{"Viewing Distance":"Unknown","Object Features":"Undisclosed","City":"Charlotte","Longitude":"-84.828201","map":"<A HREF = \"http://maps.google.com/maps?q=42.570228,+-84.828201(24347)&iwloc=A&hl=en\"> mufon case (24347) map </A>","Date Submitted":"07/08/2010 07:05 UTC","Latitude":"42.570228","Date of the Event":"07/08/2010 04:20 UTC","Object Flight Path":"Undisclosed","Case Number":"24347","Object Shape":"Fireball, Sphere","trends":["There have been 3 other sightings in Charlotte","There were no other sightings in Charlotte on or around July 8th 2010"],"Region":"Michigan","Summary":"I saw what I believe was a UFO early this a.m.","divs":["Sighting DetailsAt approximately 4:20a.m,not being able to sleep and bored with FaceBook I stepped out onto my deck to potty my beagle,Bob and to smoke a cigarette and check the weather. I found a clear and star-lit sky, not at all hazy considering the high humidity. I am located about 2 miles west of the town of Charlotte and the deck faces south. As I looked about the sky I noted a reddish object do-south about 30-45 degrees above the horizon and approximately 12-15 miles away which I initially suspected was a star or planet, though on closer inspection this object was in motion.It was definitely headed do-north toward me though it sort of \"bounced\", right,left,up,down and when it had covered maybe half of that 12-15 mile distance it turned sharply to the east and I lost sight of it in the trees surrounding my yard and I was not able to catch sight of it again. I kind of stood there for a second digesting what I had just seen and remarked to the dog,\"I think we just saw a UFO\". I was not fearful but maybe a bit anxious as I hurried Bob and myself back into the house where I tried,unsuccessfully to go back to bed and sleep."],"Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/24347.html.txt","/var/www/straped/mufon/org/24347.html"],"Disposition":"Unknown","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-07082010-0006"}