{"Date Submitted":"07/08/2010 01:11 UTC","files":["/var/www/straped/mufon/html2text/24342.html.txt","/var/www/straped/mufon/org/24342.html"],"Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Unknown","Log Number":"US-07082010-0001","Sighting Duration":"Undisclosed","Disposition":"IFO","Tags":"City","Summary":"Very shiny object roughly 50,000 Ft. randomly moving around no specific flight plan??","map":"<A HREF = \"http://maps.google.com/maps?q=34.064471,+-118.121188(24342)&iwloc=A&hl=en\"> mufon case (24342) map </A>","divs":["sighting detailsi was at my old residence where i grew up in city terrace a small suburb just east of los angeles and north west of monterey park ca. a friend of mine (*name deleted--sgonzalez\\cms) asked me if i had noticed the object? i asked what he was talking about and he pointed out the object to me which at first looked to be a mylar baloon?? but did not move from its position at all nor get smaller as when a baloon does as it goes up and away gettting smaller and smaller until gone. this shiny object (could not make out shape)was just staying in the same place for at least 5 mins until it moved toward the north west in a diagnol motion? not like a plane more like a video game?? i thought maybe a satelite? out of position? but all satelites move in mostly the same pattern. this did not. once again the object moved in an awkward manner. moved back to its original spot in the sky but in a round about way. not taking a direct path but making straight turns horizontally and vertically?? i only wish i had a good camera!!! i asked another friend that was there and she to confirmed what we were seeing was indeed there. there was about 6 of us there. we even called nbc to report it. but no luck. they did not hear of anything. this went on for at least 45mins??? then it just disappeared?? then around 10 mins later my friend (*name deleted--sgonzalez\\cms) the person who showed us the object in the first place was on the other side of the 10 fwy and saw it again headed toward down town la. i told him that i was going to report it. so there it is."],"Object Flight Path":"Undisclosed","City":"Monterey Park","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","Longitude":"-118.121188","Date of the Event":"07/06/2010 12:00 UTC","Latitude":"34.064471","trends":["There have been 6 other sightings in Monterey Park","There were no other sightings in Monterey Park on or around July 6th 2010"],"Case Number":"24342","Region":"California"}