{"Sighting Duration":"Undisclosed","Object Shape":"Cylinder, Sphere","files":["/var/www/straped/mufon/html2text/24343.html.txt","/var/www/straped/mufon/more/24343_submitter_file1__IMG00340-20100705-1811.jpg","/var/www/straped/mufon/org/24343.html"],"Date Submitted":"07/08/2010 02:03 UTC","Date of the Event":"07/05/2010 06:11 UTC","Weather Factors":"Unknown","Latitude":"32.529062","Summary":"I noticed something odd in a photo I had taken.","Log Number":"US-07082010-0002","City":"Shreveport","Region":"Louisiana","Longitude":"-93.748709","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.529062,+-93.748709(24343)&iwloc=A&hl=en\"> mufon case (24343) map </A>","Source":"MUFON","Object Features":"Undisclosed","Case Number":"24343","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was just getting into the car, coming out of the grocery store. I looked out the front window on the passenger side and noticed a beautiful cloud with sunlight illuminating from behind it. Instantly i took my phone out and got a quick snapshot just as the car started to back out of the parking space. I always take pictures of the clouds an skies as it is a beauty to me, but it wasnt until last night I looked back at that picture and randomly zoomed in on two sections of it. Once at the top right corner of the photo where there appears to be a faint cylinder shaped object, and another in the upper left center area of the photo where I noticed a spherecal object. Not once did I notice these objects when taking the picture. I wondered if I had caught some unidentified object or objects on my picture. Immediately I zoomed around the entire photo looking for birds in which i could compare the objects to. Finding what looks to be birds in the lower left central area of the photo, I analysed and compared an honestly I cant tell. I don't know how far up the objects are, if they are moving or if there was any sound. Unfortunately the software on my laptop wont allow me to sharpen it enough to make out exactly what the objects could be. And Im certainly no photo analyst to begin with. Not for sure what this could be or if its anything unusual at all, but if so I hope it will help out on the search for evidence of extraterrestrial life."],"Tags":"City","trends":["There have been 16 other sightings in Shreveport","There were no other sightings in Shreveport on or around July 5th 2010","This sighting has never been favorited.",""],"Disposition":"Unresolved"}