{"Date Submitted":"07/08/2010 01:18 UTC","Date of the Event":"06/19/2010 01:30 UTC","Longitude":"-2.57991","Source":"MUFON","divs":["Sighting DetailsIt was a Saturday afternoon, I was in the garden preparing some metalwork for spray-painting. I happened to look up at the clouds to gauge if there was a chance of rain and I caught a glimpse of something flying high up in the clouds, moving in and out of the clouds. I can't seem to use binoculars properly so I thought I'd use my digital camera on full zoom to see if I could see anything. We get a lot of peregrine falcons around this area so to me it was a perfect chance to catch one in flight as I already have a few pictures of one in my garden feeding. Anyway, with the camera on full optical zoom which is only 3x on a Kodak MD41, I only just managed to see something on the lcd screen, the sky was bright so my eyes were nearly closed and streaming because of the light, I clicked the button and took the picture. I let my eyes recover for a minute and then went inside to view the picture, which is when I noticed that what I had captured appeared to a mettalic disc. I was very excited. I quickly went back outside but there was nothing visable in the sky. After that I was in no state to complete my project for the day. I have never seen anything like this before or after that day."],"Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=51.459513,+-2.57991(24356)&iwloc=A&hl=en\"> mufon case (24356) map </A>","Viewing Distance":"Unknown","Object Features":"None","Sighting Duration":"00:05:00","Region":"England","Object Shape":"Disc","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24356.html.txt","/var/www/straped/mufon/more/24356_submitter_file1__100_0661.JPG","/var/www/straped/mufon/org/24356.html"],"Disposition":"Unresolved","Case Number":"24356","Log Number":"GB-07082010-0014","Object Flight Path":"Unknown","trends":["There have been 11 other sightings in Bristol","There were no other sightings in Bristol on or around June 19th 2010","This sighting has never been favorited.",""],"Latitude":"51.459513","Tags":"City","Summary":"Mettalic disc in the clouds.","City":"Bristol"}