{"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Disposition":"IFO","Latitude":"43.220058","Case Number":"24357","Region":"New York","Object Features":"Undisclosed","Summary":"Object was dark and following route 31 from Medina toward Middleport, NY.","City":"Medina","Source":"MUFON","Object Shape":"Unknown","divs":["sighting detailsi was approximately 1\\8 to 1\\4 of a mile from route 31 just west of medina, ny in an alliance church parking lot. time was approximately 7:00pm. i noticed a white light going on and off approximately twice the height of the telephone poles following route 31 west. it appeared to be a helicopter at first, but as it got closer i noticed that the light was not flaring out like a search light - it appeared more like a laser. every time a car would approache where it was, the light would go out. i continuted to watch it as it cam right across from me, and there was a small red light that appeared to go in a circle underneath it. at the times that the white light was on, i could see part of the bottom of the craft and it looked like a dark metal with geometric patterns. i could hear the cars on route 31, but i could not hear the craft. i recently retired from a state government job and am a professional with two graduate degrees. i am also a vietnam era usaf veteran and have been on both sac and mac bases. what bothered me about this craft was that i could not identify a propolsion system. i didn't hear anything at all. it's edges were a bit...hazy ...almost like watching the air over something hot. it also appeared to shift a bit from side to side, but the light remained stable. hard to describe. i never did see the complete shape as it was dark out and the craft would probably not even be seen if it weren't for the red circling light and the white laser type light. my guess is that it would have been approx. the size of a bus and was moving at approx 15 20 mph. i've been around large balloons and they still make noises from heating the air inside the balloon. this craft made no noise at all, and just followed the road. i waited until i retired to post anything on my experience. if anyone knows what this thing was, feel free to contact me. i thought it might have been a stealth military craft, but i knew people in the air force at the time this happened and they told me that none of the craft that they knew of was completely silent."],"Tags":"City","Longitude":"-78.386968","Sighting Duration":"Undisclosed","Date of the Event":"12/31/1988 12:00 UTC","Log Number":"US-07082010-0015","Date Submitted":"07/08/2010 01:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.220058,+-78.386968(24357)&iwloc=A&hl=en\"> mufon case (24357) map </A>","trends":["There have been no other sightings in Medina","This sighting has never been favorited."],"Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24357.html.txt","/var/www/straped/mufon/org/24357.html"]}