{"Disposition":"Unresolved","City":"Chicago","Latitude":"41.887154","Object Shape":"Circle, Fireball","Tags":"City","Country":"United States","divs":["Sighting DetailsFor the SECOND year in a row, we ( about 15 of us) were enjoying fireworks on July 4th 2010 near Midway Airport in Chicago and witnessed an orange flare flying object. Last year we saw the same thing but I think like many poeople, we were in denial. I jokingly told the group that maybe we would see it again. Sure enough.. at around 9:07pm, we saw the same thing. Organ flare flying object which we know for a fact was NOT a plane, especially since there was no sound. Although already dark, there was a tad bit of light in the sky and once the object passed right above us to the point where we did not see the orange light, we clearly saw the grey, circular object pass us by. We couldn't believe that we saw this again. We took footage on an Iphone and the orange colored objects looks just like all of the other sightings and footage shown. There are ALOT on sightings on this night ( look up on youtube). The strangest thing is that they are all around the same time ( between 9pm and 10pm). Anyway, after all of us agreed that what we saw was a UFO, about 20 minutes later we saw another one, this one being a little further than the one that passed right above us the first time. What is going on? Many people across the world witnessed the same thing. How can the authorities miss this ?? Why on 4th of July? Some of the footage I see on youtube had as many as 10 at a time? Are they planning on invading our planet?"],"Source":"MUFON","Summary":"Saw orange glowing object twice...once at around 9:07, the other about 20 min later.","Region":"Illinois","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Log Number":"US-07082010-0017","Date Submitted":"07/08/2010 04:21 UTC","Viewing Distance":"Unknown","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around July 4th 2010"],"Weather Factors":"Unknown","Date of the Event":"07/04/2010 09:07 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.887154,+-87.624918(24359)&iwloc=A&hl=en\"> mufon case (24359) map </A>","Longitude":"-87.624918","Case Number":"24359","files":["/var/www/straped/mufon/html2text/24359.html.txt","/var/www/straped/mufon/org/24359.html"]}