{"divs":["Sighting DetailsI took photographs of Mt. Hood in several locations on my way to the base of Mt. Hood. I used one of the photographs as my desktop photo and noticed an object in the distance. I didn't notice these objects in my photographs until 2 weeks later. I looked closer and there are 4 consecutive photographs that have object(s) (DSC07897 - DSC07900). The first 3 photographs have one object, the last photograph has 2 objects. The photographs are 5, 11, 16 seconds apart. Note: Response to the 6 points: 1.) I was with a colleague taking photographs of Mt. Hood. We stopped at several scenic points while we were traveling to the base of Mt. Hood. 2.) I didn't notice the objects at the time I took the photographs. Not until I used a photograph as my desktop did I notice an object. 3.) I thought it was a plane or a helicopter or a bird. 4.) Looking at the photographs with only a few seconds between the photographs, it traveled distances quickly. 5.) At first I felt intrigued. As I looked at the photographs closer I became a little more excited. 6.) Question doesn't apply. My exact location is not known by me since this was my first time in Portland. With land markers in the photographs one could determine my excat location."],"Object Features":"Undisclosed","Source":"MUFON","Summary":"Photographs taken show UFOs.","Country":"United States","City":"Mt Hood Parkdale","Tags":"City","Disposition":"Unknown","Date of the Event":"06/21/2010 03:34 UTC","Case Number":"24352","files":["/var/www/straped/mufon/html2text/24352.html.txt","/var/www/straped/mufon/more/24352_submitter_file1__DSC07898.JPG","/var/www/straped/mufon/more/24352_submitter_file2__DSC07900.JPG","/var/www/straped/mufon/org/24352.html"],"Region":"Oregon","trends":["There have been no other sightings in Mt Hood Parkdale","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.268817,+-121.514735(24352)&iwloc=A&hl=en\"> mufon case (24352) map </A>","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"45.268817","Sighting Duration":"Undisclosed","Log Number":"US-07082010-0011","Date Submitted":"07/08/2010 10:16 UTC","Longitude":"-121.514735","Object Shape":"Circle"}