{"Longitude":"-87.5662","Object Flight Path":"Straight-line path","Source":"MUFON","divs":["Sighting Detailswe were sitting on a balcony with freinds...watching the fireworks that were going on around us...We were out in the country...and we could see in all directions ....When I had noted a orange light coming from the south over the Ohio river heading north in a straight line...I took it to be a helicoptor...saying that it was probably the news channel taking arial pictures of the fireworks....it went over head past the house... About 5 minutes later my husband said..hey there is that orange light again how did it get back where it started so soon? Again we watched the orange light from the south heading north in a straight line coming overhead us...Our attention was fully on this orange light...As it got closer it was certain that it was shaped as a huge ball and the color remained a bright orange.....it was very high...there was no noise...and as it started to go over the house...it started to fade out..I stared at it as if not to miss anything...and could definately see that it was the shape of a ball....My husband ran to the front of the house to keep his eye on it...but the object dissappeared by the time he ran to the front yard..which reaally disappointed us... Little Ed our freinds 10 year old son...asked me what was that orange ball? I told him ..you just saw something quite remarkable...An unindentified flying object..I was amazed the rest of the eveing,,,and still am."],"Disposition":"Unknown","City":"Evansville","Region":"Indiana","Date of the Event":"07/04/2010 10:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.972859,+-87.5662(24368)&iwloc=A&hl=en\"> mufon case (24368) map </A>","Latitude":"37.972859","Log Number":"US-07092010-0002","Summary":"Orange ball in sky making no noise.","Tags":"City","Object Shape":"Sphere","Object Features":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around July 4th 2010"],"Case Number":"24368","Country":"United States","Weather Factors":"None","Sighting Duration":"00:08:00","files":["/var/www/straped/mufon/html2text/24368.html.txt","/var/www/straped/mufon/org/24368.html"],"Date Submitted":"07/09/2010 01:18 UTC"}