{"Date Submitted":"07/08/2010 09:46 UTC","files":["/var/www/straped/mufon/html2text/24364.html.txt","/var/www/straped/mufon/org/24364.html"],"Object Features":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 7th 2010"],"Source":"MUFON","divs":["Sighting DetailsMe and my girlfreind were traveling south on highway 87 towards yankee stadium in the Bronx,NY and right above our vehicle approaching from the right side of the car were two very big and bright white lights. After noticing the lights moving slowly towards us I looked up saw that the craft was triangular in shape and either black or dark grey. When the craft passed over our car I can see that from the back there was 3 white lights in a row and they were steady. There was no other color lights on this craft and none of the lights blinked. When I first saw the lights I thought maybe it was a large airplane flying slow and low but the two lights in front were spaced apart way too far! and living in Westchester County NY and not far from Westhester County Airport I no what airplanes look like!! Furthermore, The craft made no noise from what I can tell. I had my window down very excited and my head hanging out and looking up. We lost sight of the object because we were driving on the highway going south and the object was headed north above us! As a young man I witnessed first hand the westchester \"boomerang\" spotted throughout the hudson valley and I have also seen a triangular craft before at close sight in the summer of 1991."],"Summary":"Large silent triangular craft one exit from Yankee stadium.","Date of the Event":"07/07/2010 09:15 UTC","City":"New York","Weather Factors":"Unknown","Country":"United States","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.85337,+-73.857006(24364)&iwloc=A&hl=en\"> mufon case (24364) map </A>","Region":"New York","Case Number":"24364","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Longitude":"-73.857006","Viewing Distance":"Unknown","Latitude":"40.85337","Log Number":"US-07082010-0022","Tags":"City","Sighting Duration":"Undisclosed"}