{"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"07/04/2010 11:20 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/24367.html.txt","/var/www/straped/mufon/org/24367.html"],"Date Submitted":"07/09/2010 12:36 UTC","Region":"Indiana","Summary":"4 or 5 OBOLs form a vertical line while 4 others swirl out to the west.","map":"<A HREF = \"http://maps.google.com/maps?q=40.493517,+-86.132183(24367)&iwloc=A&hl=en\"> mufon case (24367) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Circle","divs":["Sighting DetailsI took my dogs out to do their business at about 11:15 to 11:20 P.M. I noticed some locals shooting off fireworks in the neighborhood North of me. I am on the Southwest side of Kokomo and was looking due North. This is when I noticed the 4 or 5 orange balls of light hanging in a somewhat vertical formation in the Northern sky, at about a 45 degree angle from the horizon. I also noticed several other slightly smaller OBOLS just West of these, swirling out in such a way that the whole formation reminded me of the big dipper. I fully expected the OBOLS to drift down and dissipate as I assumed they were part of one of the fireworks. It didn't take long for me to realize these were no fireworks. The lights were more orange than red, perfectly round and continued to hang in the same position for at least the 15 minutes that I was outside with the dogs. It slowly dawned on me that these things looked exactly like, and probably were, the same things I had witnessed on several occasions back in March and April of 2008. Same color, same shape. Except the ones in 2008 didn't last nearly this long. I finally took the dogs back into the house and stopped looking at them. I remember thinking, \"they must have come back to watch the fireworks.\" These were NOT fireworks and definately not sky lanterns. They were much larger than even the brightest planet visible at this time of the year. Possibly 4 times the brightness of Venus."],"Object Features":"Undisclosed","Log Number":"US-07092010-0001","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around July 4th 2010"],"Disposition":"Unknown","City":"Kokomo","Case Number":"24367","Weather Factors":"Unknown","Latitude":"40.493517","Longitude":"-86.132183","Country":"United States","Source":"MUFON"}