{"files":["/var/www/straped/mufon/html2text/24361.html.txt","/var/www/straped/mufon/org/24361.html"],"Object Features":"Unknown","Viewing Distance":"Unknown","Region":"Illinois","Country":"United States","Weather Factors":"None","Date of the Event":"07/05/2010 01:05 UTC","City":"Harrisburg","Disposition":"Insufficient Data","Case Number":"24361","Longitude":"-88.532677","trends":["There have been 13 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around July 5th 2010"],"Object Shape":"Star-like, Other, Unknown","Log Number":"US-07082010-0019","Summary":"Bright star like object moving from north to south changing color and shape.","Sighting Duration":"Undisclosed","Latitude":"37.740051","Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=37.740051,+-88.532677(24361)&iwloc=A&hl=en\"> mufon case (24361) map </A>","Tags":"City","Date Submitted":"07/08/2010 06:16 UTC","divs":["Sighting DetailsStepped out on my porch checking on my cats, I walked to the edge of my sidewalk (west side of my house), I turned and faced north when I saw a very bright star like object coming my way slowely. Upon first sight I thought it was a very bright planet, but then realized it was moving. As it came closer, the brightness dimmed to almost an amber color and it seemed to be wabble...I thought to myself, uhoh...here we go again, for I have been observing unusual things in the sky for a couple of years now. There were no blinking lights, I listened closely for any sound it would make, but there was none. By the time the object passed overhead, it had dimmed down to the tiniest dimmest light, but still visible, It had also come to a stop. Then all of sudden, A bright blink of light appeared where the dim light had been, first one blink...white in color, then a red blink right beside it, THEN what appeared to be a white blink in front of the object and another behind it...making it look like an elongated object, then it started to move to the southeast at a faster steadier pace. About 3 minutes later, a military helicopter flew over going the same direction. I just want to add that nearly everynight since April, the ufo sightings have been picking up around here...just like last year. I have made a number of reports, I havent been able to pick any of this up on film or camera, but I have been feeling very compelled to draw these things I have seen. I have also been having strange dreams. About a month ago, my boyfriend and I were being followed by several strange crafts while we were out taking a moonlit drive, no drugs or alcohol were involved. There was some time lost."],"Source":"MUFON"}