{"Weather Factors":"None, Unknown","Object Shape":"Other","City":"Inkocopah","trends":["There have been no other sightings in Inkocopah","This sighting has never been favorited."],"divs":["Sighting DetailsMe and my friend went to a concert in San Diego and after we were driving backto the Imperial Valley. We were just listening to music and talking about theconcert and just being loud when all of a sudden we just stopped talking andthen i saw something in the air. at first i didnt know what to make of it. ididnt say anything about it until about 15 seconds later. i asked Brian if hehad seen that and he said that he did. i wanted to stop the car so we can see itbetter but i decided to just keep going because there was no place to pull over.this is what i saw i saw this spider-like type of aircraft. thats the best wayto describe it. it had just a little body on the top like a spider has and ithad what looked like thin legs coming down and each leg had some lightsconnected to the leg. i can draw it out for you if youd like. Brian saw the samething too. i just called him earlier to verify what he saw and he said exactlywhat i wrote. he also added something that i didnt see. he saw what looked likea kite top. i guess i was a little to excited to see it that i didnt pay muchattention. i was just in shock that i saw this. feel free to get in touch withme through e-mail and me and Brian will try to answer any of your questions.Thank You,Raul Felician xkillaklownx@lycos.com"],"Latitude":"32.766614","Disposition":"Unknown","Sighting Duration":"00:00:59","Summary":"saw a spider-like type of aircraft","Log Number":"","Tags":"City","files":["/var/www/straped/mufon/html2text/2437.html.txt","/var/www/straped/mufon/org/2437.html"],"Date of the Event":"02/12/2003 11:45 UTC","Case Number":"2437","Object Flight Path":"Straight-line path","Source":"MUFON","Object Features":"Other","Country":"United States","Longitude":"-114.589776","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=32.766614,+-114.589776(2437)&iwloc=A&hl=en\"> mufon case (2437) map </A>","Date Submitted":"02/12/2003 11:45 UTC","Region":"California"}