{"City":"Toms River","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 13 other sightings in Toms River","There were no other sightings in Toms River on or around June 26th 2010"],"Tags":"City","Latitude":"39.959529","Source":"MUFON","Country":"United States","Date of the Event":"06/26/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/24376.html.txt","/var/www/straped/mufon/org/24376.html"],"Longitude":"-74.189579","Case Number":"24376","Log Number":"US-07092010-0010","divs":["Sighting DetailsThese 4 bright lights had the appearance of a hockey stick.Unable to determine weather it was a solid object.This hockey stick(or possible triangular shape other wittiness believed they saw) It was seen over the Barneget Bay looking west at about 35* in but unable to determine distance. For 3 nights it remained in the same area of sky Then on the third night a smaller less bright light moved slowly to the main object.It really looked as If It was swallowed-up or perhaps entered the object.... Next the hockey stick of the four bright lights slowly faded and the object was gone.... A truly amazing sight.There must be others that observed this.I don't know if this is a sighting your origination considers a possible follow-up. 1.Sitting on my neighbors deck talking, gazing out over the night sky (Incidentally I don't believe any witnesses were intoxicated) 2.We never saw this formation of lights in the sky.What made it stand out from the rest of the sky was the fact they remained in one location.It was obvious due to the movement of stars etc. 3.Four very bright stars that we never saw in the night sky Pryor to event. 4.The 4 bright lights remained in the same sky location,apparently hovering in a fixed position. 5.Feelings amazement and perhaps It could have been non-terrestrials 6.The lights faded out and it was goon.I want to add the weather conditions were clear and cloudless ......... Thank You...."],"Object Shape":"Boomerang, Diamond, Triangle, Other","Date Submitted":"07/09/2010 01:38 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.959529,+-74.189579(24376)&iwloc=A&hl=en\"> mufon case (24376) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"New Jersey","Disposition":"Insufficient Data","Summary":"4 very brights, stationary, 3 in a row, 4 light down at angle. Pattern seen several nights."}