{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24373.html.txt","/var/www/straped/mufon/more/24373_submitter_file1__Image2.jpg","/var/www/straped/mufon/org/24373.html"],"Log Number":"US-07092010-0007","map":"<A HREF = \"http://maps.google.com/maps?q=27.911616,+-82.782544(24373)&iwloc=A&hl=en\"> mufon case (24373) map </A>","Object Features":"Undisclosed","City":"Largo","Sighting Duration":"00:00:03","Disposition":"Insufficient Data","divs":["sighting detailsi was sitting outside enjoying one of the rare evenings with low humidity and great starshine for a summer's night in florida. viewing toward the east and scanning the constellations that were unusually bright for this time of year, i focused on scorpio to the south\\southeast. after a few seconds of viewing scorpio, i wondered if sagitarrius was above the horizon yet. as i moved my view more to the southeast suddenly a large bright yellowish green circle appeared out of nowhere. it was high in the sky and just east of scorpio trailing a short streak of silver-white plume moving straight northward with incredible speed. and then disapeared just as suddenly. the total viewing lasted approximately three seconds. i orginally thought i had witnessed merely a common meteor. but, after further thought, a meteor the size of this object would have left a much larger trail and made a brilliant flash of light upon disintergration. if it were a meteor it's size alone would have lent it to trail completely across the sky. and the object just vanished with no final event. no flash, explosion or anything. it just switched off and disappeared. as an armchair astronomer this event consummed only about three degrees or so of the ecliptic. note: the attached image does not represent the actual sky chart background for here last night. however, my drawing is as close to scale as i can get it."],"Case Number":"24373","trends":["There have been 2 other sightings in Largo","There were no other sightings in Largo on or around July 8th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Latitude":"27.911616","Region":"Florida","Object Shape":"Circle","Date Submitted":"07/09/2010 10:43 UTC","Tags":"City","Longitude":"-82.782544","Date of the Event":"07/08/2010 09:20 UTC","Country":"United States","Object Flight Path":"Undisclosed","Source":"MUFON","Summary":"Somenthing entered our atmosphere and then disappeared."}