{"Source":"MUFON","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"07/09/2010 05:28 UTC","Log Number":"US-07092010-0006","Latitude":"40.719753","files":["/var/www/straped/mufon/html2text/24372.html.txt","/var/www/straped/mufon/org/24372.html"],"Case Number":"24372","map":"<A HREF = \"http://maps.google.com/maps?q=40.719753,+-74.001673(24372)&iwloc=A&hl=en\"> mufon case (24372) map </A>","Country":"United States","Summary":"Orange spheres \"10-15\" hovering in place for five minutes then moving east and disappearing behind trees.","Weather Factors":"Unknown","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around July 4th 2010"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-74.001673","Date of the Event":"07/04/2010 12:00 UTC","Object Shape":"Sphere","divs":["sighting detailsi was driving eastbound on the long island expressway and was looking at fireworks to the north. i noticed 10 to 15 bright amber\\orange orbs of light. the lights were perfectly round in shape. i immeidiately thought wow those are cool fireworks.. then i pulled off to the side of the highway and just kept watching them ,i managed to get three pictures with a proffesional canon 20d dslr using my 300mm lens , :note, i actually had time to reach into the back seat grab my camera select wich lens i should use attach the lens select my camera setting's, and the subjects were still hovering?? at the time of the photo's the objects started dispersing and slowly dissapearing one by one.. i have never seen anything like this in my life and i was trying to make sense of it for days and days?? what kind of objects stay in the sky like that are just hovering ? and mostly why did they move in different directions? i was thinking maybe flares? but the wind would have made all of the fireballs move at the same rate in the same direction.. at first all of the orbs were in a group spread out over what seemed to be a mile or so then they all just drifted in different directions at all different speeds ,some moved away fast ,while others hovered , then three past me traveling east and just vanished? ? i am freaked out , i am an avid astronomer and see moving things in the sky all the time, i have quite large telescopes and always come to a solution that is in the end is\"man made\" this was way beyond just a light in the sky ,it was close to me, two planes flew over it right as it happened \"1\" 747, and \"1\" small cesna-172, theese objects were not anywhere near flight altitude ,i fly with my brother on occasion he is a lisenced pilot, i also noticed that others on long island saw the same thing on the same day ,\"at the same time\"!!! please email me if you also saw this or if you want more information and pictures.. ---> [email address removed]"],"Region":"New York","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","City":"New York"}