{"Summary":"I observed a starlike object speed across the horizon then make two right angle turns and returned back across the horizon arcing as it ascended.","Weather Factors":"Unknown","Object Shape":"Oval, Star-like","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"07/09/2010 02:37 UTC","Latitude":"39.961855","Case Number":"24379","Object Features":"None","Viewing Distance":"Unknown","Log Number":"US-07092010-0013","divs":["Sighting DetailsIt was arond 3:45 a.m. on July 9,2010 I was sitting in Simons playgrond in East Germantown,PA. and just happened to glance up at the sky westward and noticed that one of the stars seemed to be pulsating. At first I thought that it might be Venus or a satellite moving across the horizon towards the north when it started moving rapidly across the sky. I know it was not a airplane by the rate of speed and altitude when the object made a right angle turn downward and then another right angle turn south and never changed it's rate of speed. As the object got about halfway back across the sky where I initially noticed the object, the object turned upward in an arc like turn while it ascended to where the object appeared as a little point of light instead of the bright star I originally thought that it was. It pulsated 4 or 5 times and then descended as quickly as it ascended back down to about the level in the sky where it started from. At this point I'm losing it because this can't be happening and to make sure that I'm not crazy, I pulled out an L.E.D light I had in my pockect and started flashing it at the light and the light maved towards my direction and aligned itself with my position, this is when I noticed a second starlike object to the first objects left begin to move across the sky in a loop the loop type fashion so I started flashing the L.E.D. at this object also and it seemed to respond by stopping, descending and pulsating in accordance with each flash from my light. To my astonishment the first objecttraversed the horizon in a triangular direction which as far as I know convetional aircraft can not do. I must have played this game of flash and pulsate until dawn. As the dawn approached both objects seemed to ascend and as they became small points of light in the sky they were joined by a third light. The morning sky became brighter and the the objects appeared to fade into sky. I found myself thinking that I must be losing my mind and why am I witnessing this by myself, nobody is going to believe this. I found myself wishing that whatever it was that I saw, if it is extraterrestrial and they were trying to communicate with me, why won't they come on down? I plan to be in the same place around the same time to see if I was just seeing things or was my mind playing tricks on me! This time I will bring my video camera to record anything that takes place. Here's to hoping I'm not crazy."],"Disposition":"Insufficient Data","City":"Philadelphia","files":["/var/www/straped/mufon/html2text/24379.html.txt","/var/www/straped/mufon/org/24379.html"],"Date of the Event":"07/09/2010 04:40 UTC","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around July 9th 2010"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=39.961855,+-75.161099(24379)&iwloc=A&hl=en\"> mufon case (24379) map </A>","Longitude":"-75.161099","Source":"MUFON","Country":"United States"}