{"Object Flight Path":"Straight-line path","Sighting Duration":"00:00:59","divs":["Sighting DetailsThis was my first sighting and it took place between 345-350 am July 17, 2003over Rt. 70 in Cherry Hill NJ in the sky above 3 Executive Campus. I work thenight shift and had just finished eating a quick ramen meal. I usually bring myown bowlutensils for my meal since theyre not provided at the work place. AfterI was done I brought the bowl out to my car and put it inside since I couldntfit it in with the other items in my bag. As I was leaving the car I just stoodtransfixed for a moment admiring the stars on a fairly clear night and thinkingof how massive and amazing the universe really is. Immediately after thinkingthat, I had a sudden instinct to look directly at a northeast area of the sky. At first I hadnt noticed much, but then a moment later I noticed what lookedlike a dim blueish star, moving across the sky at a slow speed. At first Ithought it could be a plane maybe, but there were no flashing lights and thisobject had a steady blue glow, was very very high up, silent, and apeared to bedisguising itself to appear as a star. Im not sure what gave the blueish glow,or if it was simly a reflection of moonlight off this object. It was quitesmall in size from where I was standing, so I estimated it to be between 11-30feet, possibly larger and was possibly many miles into the atmosphere It lookedto be about the same size a small star appears As I watched the object, itmoved across the sky about a hundred feet at a slow steady speed. In my head atthat moment I thought to myself Is this really a ufo Im seeing At the verymoment that thought came into my head the object stopped, then instantlypulsatedExpanded into a spherical ball of pure brilliant white light roughtly 20times the size it was before. It held that form for about 1 second, duringwhich, I heard myself say Whoaa It then returned to its previous color andshape small blueish star. It continued to travel along at the same rate asbefore for about 3 seconds more, then accelerated to incredible speed in thesame direction and vanished into space"],"Date Submitted":"07/17/2003 03:45 UTC","Latitude":"39.926813","Disposition":"Unknown","Object Features":"Unknown","Longitude":"-75.024631","Object Shape":"Unknown","City":"Cherry Hill","Viewing Distance":"Over One Mile","Date of the Event":"07/17/2003 03:45 UTC","trends":["There have been 7 other sightings in Cherry Hill","There were no other sightings in Cherry Hill on or around July 17th 2003"],"Log Number":"","Country":"United States","Tags":"City","Region":"New Jersey","Summary":"Saw blue glowing craftwhite ball of light","map":"<A HREF = \"http://maps.google.com/maps?q=39.926813,+-75.024631(2438)&iwloc=A&hl=en\"> mufon case (2438) map </A>","Case Number":"2438","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2438.html.txt","/var/www/straped/mufon/org/2438.html"]}