{"Region":"California","Case Number":"24386","files":["/var/www/straped/mufon/html2text/24386.html.txt","/var/www/straped/mufon/org/24386.html"],"Viewing Distance":"501 Feet - 1 Mile","City":"Alamo","Log Number":"US-07092010-0020","Summary":"Three very large aircraft which hovered over Hwy 680 at low altitude for approximately 30 seconds-1 minute.","divs":["Sighting DetailsI was going southbound on hwy 680 in the dusk hours, but while there was still plenty of day light. This was a daylight sighing. Although it was years ago, I remember it very vividly. There were three very large oblong shaped aircraft hovering over the freeway and a little East of the freeway. I was driving a car, and actually pulled over into the emergency lane, got our of my car and watched until they disappeared, which they did one at a time, the closest one being the last to disappear. Their departure was sudden and instantaneous, as if they vanished, but prior to their departure, they shot out what I can only refer to as \"sections of light\", about the size and shape of telephone poles, in rapid succession, towards the ground. The craft were enormous. There was no audible sound associated with this sighting. Many other cars were on the freeway. I was the only one who stopped, but I know others saw them too. I am requesting a contact from you to let me know if you know of others who saw the same thing. Thank you."],"Disposition":"Insufficient Data","trends":["There have been 2 other sightings in Alamo","There were no other sightings in Alamo on or around November 30th 1980"],"Tags":"City","Object Features":"Undisclosed","Latitude":"37.850203","Country":"United States","Weather Factors":"None","Longitude":"-122.032184","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=37.850203,+-122.032184(24386)&iwloc=A&hl=en\"> mufon case (24386) map </A>","Source":"MUFON","Date of the Event":"11/30/1980 12:00 UTC","Date Submitted":"07/09/2010 10:22 UTC","Object Shape":"Unknown","Sighting Duration":"Undisclosed"}