{"Date Submitted":"07/18/2003 10:30 UTC","Latitude":"35.092941","Tags":"City","Object Features":"Wings","Sighting Duration":"00:05:00","Viewing Distance":"501 Feet - 1 Mile","Case Number":"2439","divs":["Sighting DetailsMy boyfriend and I were sitting in our back yard. I was looking up at the skywatching the stars and looking for satelites. I was looking straight up in theair, when I saw a translucent triangle come over the view of the house. It wasodd looking, something I had never seen before. As I said, it was translucent,and it was moving in a straight linefrom south to north at a great speed maybe 4times as fast as any jet Ive seen. When I say translucent, that is hard todescribe. It was glowing, and there were parts that were completely see through,and parts that seemed half there, and these areas moved and swirled.maybe lookedsimilar to some sort of gasses flowing and glowing. As it moved it seemed as ifyou could see the air around it moving in this fashion also, but maybe at adifferent density. It was triangular shaped, but the corners were slightlyrounded not sharp corners. It seemed to glide using the two points of thetriangle almost as if they were wings of a bird gliding through the sky. And itdid glide quite gracefully. the third point of the triangle was in the back. Theobject appeared to be about twice as big as a jet. When I saw this I tried totell my boyfriend, but was in such awe, that it took me a few seconds torespond. Like my body tried to respond, but couldnt quite for a few seconds. Ifinally pointed it out to my boyfriend who saw it clearly, but only for a fewseconds before it dissapeared. It was as if it just got out of sight. the wholething happened quite quickly, as the object was moving FAST. I was in awe. Mywhole body tingled with chills, and I began to cry."],"Summary":"translucent glowing flowing triangle that glided V","files":["/var/www/straped/mufon/html2text/2439.html.txt","/var/www/straped/mufon/org/2439.html"],"Object Shape":"Triangle","City":"Albuquerque","Source":"MUFON","Date of the Event":"07/18/2003 10:30 UTC","Log Number":"","Object Flight Path":"Straight-line path","Disposition":"Unknown","Longitude":"-106.642187","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=35.092941,+-106.642187(2439)&iwloc=A&hl=en\"> mufon case (2439) map </A>","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around July 18th 2003"],"Weather Factors":"Windy, Unknown","Country":"United States"}