{"map":"<A HREF = \"http://maps.google.com/maps?q=42.32348,+-83.169384(24391)&iwloc=A&hl=en\"> mufon case (24391) map </A>","Log Number":"US-07102010-0001","Object Flight Path":"Undisclosed","Object Shape":"Other","Longitude":"-83.169384","Object Features":"Undisclosed","Viewing Distance":"Unknown","divs":["sighting details1. where were you and what were you doing at the time? looking at the sky, watching the fireworks. 2. what made you first notice the object? became distracted from the fireworks when a large light moving northward appeared. 3. what did you think the object was when you first noticed it? it looked like a shooting star. 4. describe the object and its actions and motions. the single light transitioned into a series of little lights shaped in a crescent with an orange light in the middle that flickered at times. the object moved eastward, behind the house, low in the sky. when it turned around the house, the series of small lights were no longer seen, but rather, the object took shape as a finned or winged, cigar-shape with a square tail. the rounded-tip fins\\wings almost looked see-through and out of proportion (too small and swept back), relative to the size of the subject object. the object continued to travel very slowly and low and somewhat tilted. 5. describe your feelings, reactions and actions, during and after sighting the object. it was foreboding: it didn't make a sound, which was most curious. 6. how did you lose sight of the object? it proceeded westward out of sight."],"Summary":"Unidentified object seen over Dearborn, Michigan 7/3/10 PM.","Source":"MUFON","trends":["There have been 7 other sightings in Dearborn","There were no other sightings in Dearborn on or around July 3rd 2010","This sighting has never been favorited.",""],"Date Submitted":"07/10/2010 12:12 UTC","Region":"Michigan","Country":"United States","Case Number":"24391","Tags":"City","Sighting Duration":"Undisclosed","City":"Dearborn","Date of the Event":"07/03/2010 10:20 UTC","files":["/var/www/straped/mufon/html2text/24391.html.txt","/var/www/straped/mufon/org/24391.html"],"Latitude":"42.32348","Weather Factors":"Unknown","Disposition":"Unknown"}