{"divs":["sighting detailsnot the first time i have seen this astonishing and amazing site. i was walking my dog and happened to glance up. i noticed a large venus size and shape orb...that was beneath the clouds. it was moving slowly eastward. suddenly..it abruptly turned south and then went straight up to star level and faded away within 2 seconds. i estimate it went from in our atmosphere to outside our atmosphere in 2 seconds. in other words...it went 80,000 to 120,000 feet in 2 seconds...without one sound. no emissions...no chemical trails. i have lived near o'hare airport my entire life and know full well what a plane looks like. this was not a plane. it was under the clouds, and it changed directions...so it was not a satellite, either. if people would look up to the skies every now and then between 9:00 pm to 11:00 pm in the midwest...i am sure you will see it...and you will agree...it is not from earth. i highly doubt the military would be testing anything with that extreme speed right near the highly populated suburbs of chicago. i have seen this blue-white orb moving along before...even closer than tonight...and i am now convinced that it is not only under intelligent control, but i am convinced that whatever it is that i was lucky enough to see again...is definitely not from earth. nothing we have could have chased that thing down. i wonder if radar caught it, but i have no idea...and i probably will never know if someone is\\was tracking this thing. i posted this to share information, but also in hopes that by some freak chance...someone around here looked up into the sky at the same spot i did...and saw the same thing. again...that would not be the first time for that, either. other people in illinois have reported this same thing...to this very site. why did i get to see it? my answer is because i tend to look up at the sky more than most people do. look up between 9:00 pm and 11:00 pm and you just might see it, but good luck sleeping after. you will be up half the night wondering what you just witnessed. if i had my video camera with me...it would be so hard to zoom in and get a good shot of it...but i will keep trying. it was too quick to get the angle on it...even if i had a camera. be on the lookout in the midwest...blue white orb. looks like venus but it is moving."],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Summary":"White Orb at close range...turns south and then straight up.","Region":"Illinois","Longitude":"-87.832719","Object Flight Path":"Path with directional change","Object Features":"None","Date of the Event":"07/09/2010 10:45 UTC","Case Number":"24393","Tags":"City","City":"Park Ridge","files":["/var/www/straped/mufon/html2text/24393.html.txt","/var/www/straped/mufon/org/24393.html"],"Source":"MUFON","Latitude":"42.012541","Log Number":"US-07102010-0003","Disposition":"Unresolved","Country":"United States","Date Submitted":"07/10/2010 12:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.012541,+-87.832719(24393)&iwloc=A&hl=en\"> mufon case (24393) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Park Ridge","There were no other sightings in Park Ridge on or around July 9th 2010"],"Object Shape":"Star-like"}