{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.632102,+-90.194404(24399)&iwloc=A&hl=en\"> mufon case (24399) map </A>","Latitude":"38.632102","Disposition":"Unknown","Region":"Missouri","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/24399.html.txt","/var/www/straped/mufon/org/24399.html"],"Country":"United States","divs":["sighting detailsearly afternoon at lambert field\\st. louis -- military jets taking off. not unusual at lambert field - east to west. however, the noise from jets became so frequent and intense . . . it sounded as if they were circling the area. we (my mother and i) thought a jet was in trouble. i then saw an object, similar to a jet, flying from south to north. very low, clear and distinct. (i was facing east toward lambert field - which is approximately 1\\4 mile away) the \"jet\" did not appear to have wings - - i can only describe it as \"jet like\". so strange in appearance, it stunned me. (oddly enough, we were on screened porch\\watching birds - with binoclulars handy). by the time i thought to grab binoclulars it was gone. i cannot even begin to describe this thing. a jet without wings...an extended section between \"cockpit\" and \"tail\" like a helicopter. i was just stunned. soon after this craft passed, activity\\noise from military jets ceased. living close to lambert, we have seen all kinds of aircraft and we are used to the noise (commercial, military, etc) i can only say i was stunned by the appearance of this craft. (the unusual noise, the flight path, the appearance of the object) unlike most ufo reports that claim no noise was heard from the craft - - in this case, there was so much noise from military jets...there is no way i could tell if this craft was silent or not. it was almost like there was some kind of chase\\grid search going on."],"Longitude":"-90.194404","City":"St Louis","Weather Factors":"Unknown","Tags":"City","Object Features":"Other, Unknown","Object Shape":"Other, Unknown","Summary":"Similar to jet - but not identifiable.","Date of the Event":"07/09/2010 01:30 UTC","Log Number":"US-07102010-0009","Date Submitted":"07/10/2010 04:27 UTC","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around July 9th 2010"],"Case Number":"24399"}