{"City":"Brazil","Tags":"City","Log Number":"US-07102010-0008","Region":"Indiana","divs":["Sighting DetailsI stepped out to have a late night cigarette break in front of my home at approximately 2:15 a.m. After about 2 or 3 minutes, I happened to glance up in the sky just to look at the stars,when I noticed a very strange saucer shaped craft flying pretty low to the ground.It had a very unusual sequencing light on the front, which lit up from left to right. It started as a blue color than gradually turned to red, and repeated. It also made no sound whatsoever,I could also see what appeared to be a brightly lit window of some sort on the side of the craft emitting a yellowish light.After it flew over at such a slow speed, i knew if it was an airplane it would have fell out of the sky.Because it was at an almost stand still in the air. About 5 minutes later I saw an identical craft which was also silent, following almost the same flight path. Needless to say I was pretty shook up after seeing the second identical craft.I have never seen anything even remotely close to this in the sky, I lost sight of the object after a couple minutes as it glided out of sight over my home."],"trends":["There have been 7 other sightings in Brazil","There were no other sightings in Brazil on or around July 10th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.526042,+-87.116945(24398)&iwloc=A&hl=en\"> mufon case (24398) map </A>","Case Number":"24398","Weather Factors":"None","Object Shape":"Disc","Longitude":"-87.116945","Summary":"Looking up into the sky at roughly 2:15 A.M. I noticed a disc shaped object with a sequencing blue to red light flashing across the front of the craft. Also it was traveling at a speed so slow that an airplane would have fell to the ground. Made no sound","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/24398.html.txt","/var/www/straped/mufon/org/24398.html"],"Viewing Distance":"101-500 Feet","Date of the Event":"07/10/2010 02:15 UTC","Date Submitted":"07/10/2010 02:44 UTC","Disposition":"Unknown","Latitude":"39.526042","Sighting Duration":"00:02:00","Source":"MUFON","Country":"United States","Object Features":"Window(s)"}