{"Log Number":"US-07102010-0010","Weather Factors":"None","Disposition":"Insufficient Data","Country":"United States","Date Submitted":"07/10/2010 05:11 UTC","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around July 10th 2010"],"Region":"Florida","Object Features":"None","files":["/var/www/straped/mufon/html2text/24400.html.txt","/var/www/straped/mufon/org/24400.html"],"divs":["Sighting DetailsI awoke early, about 4AM, looked out a North facing window of my home, and observed a very bright, strobing, light. From point of observation, object was about 5 degrees in elevation at a heading of about 345 to 355 in azimuth, relative to North. Range was estimated to be about 2 to 2.5 miles from point of observation. Observation was made at ground level (sea level), approximately 400 feet from Tampa Bay (this object was in Weedon Island state preserve). Shape of object could not be determined due to the object strobing white, then changing color to orange, then red, then back to white, and then repeating this color shift. Object has been observed now for about 45 minutes and the St Petersburg FL police has been notified of the sighting. Size of of object could not be accurately determined due to low light conditions (night time), however, it is estimated to be approximately 100-200 feet in diameter. Object drifts slowly in a primarily North-South motion (relative to itself (North-South not true North-South)), and moves (drifts) no more than one hundred feet if an imaginary central datum point was set. Drifting could also be described as being random in pattern when the object varies from the North-South plane of motion. Object also emits smaller strobing objects primarily of orange and red color, and has these objects strobe out from the main body no more than a distance of 100 feet (staying relatively close). These smaller strobes are illuminated for less than 2 seconds from the time of it being strobed from the main body. After this time these smaller strobing bodies extinguish and do not re-illuminate. End of report. In response to your numbered questions: 1-just awoke and as a practice look outside for anything abnormal. 2-bright flashing light 3-first a plane, but not in flight path, and, no sound. 4-described as requested in main paragraph above. 5-feeling was normal; nothing odd. 6-object extinguished."],"Source":"MUFON","Sighting Duration":"00:45:00","map":"<A HREF = \"http://maps.google.com/maps?q=27.782566,+-82.63764(24400)&iwloc=A&hl=en\"> mufon case (24400) map </A>","Object Shape":"Flash, Sphere","Longitude":"-82.63764","Latitude":"27.782566","City":"St Petersburg","Viewing Distance":"Over One Mile","Case Number":"24400","Date of the Event":"07/10/2010 04:23 UTC","Object Flight Path":"Hovering then path,Other","Tags":"City","Summary":"Semi stationary, strobing, color changing light; very bright"}