{"City":"Allen Park","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis could very well have been a plane or some other type of known aircraft, but I have lived near Detroit Metro airport all my life and this did not look like a plane. I can't say much about what I saw, but just want to see if anybody else saw this same object. It was silver, cigar shaped and moved like the speed of a plane, but something was different about the trajectory and fluidity of this objects movement. I really wanted to say it was a plane, but I could not come to that conclusion. Also, this made no sound as all planes do and was not coming from the airport or into the airport. This object was moving from north to south. I saw this object while I was riding my bicycle in which I do daily. I have seen hundreds if not more planes over the years and this one caught my eye as just being different. Again, something just seemed different about this object. It moved move smoothly than the average plan. Honestly, it was a little too far to determine what it was, but looked different. The feelings I felt were just normal for I could not determine what it was exactly. I would of felt different if I knew for a fact of what it was 100%. I took a camera phone picture of it, but was a very bad one. If I was in a car I would have followed it from north to south, but on a bicycle I would have had no chance. Just want to see if anybody else saw this object."],"Weather Factors":"Unknown","Disposition":"Unknown","Longitude":"-83.203038","Source":"MUFON","Log Number":"US-07102010-0014","Region":"Michigan","Case Number":"24404","trends":["There have been 3 other sightings in Allen Park","There were no other sightings in Allen Park on or around July 9th 2010"],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Country":"United States","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.263908,+-83.203038(24404)&iwloc=A&hl=en\"> mufon case (24404) map </A>","Date Submitted":"07/10/2010 08:14 UTC","files":["/var/www/straped/mufon/html2text/24404.html.txt","/var/www/straped/mufon/org/24404.html"],"Object Shape":"Cigar","Summary":"Object seen in Allen Park.","Latitude":"42.263908","Date of the Event":"07/09/2010 12:00 UTC"}