{"divs":["Sighting Detailsmy family and i decided to go camping at tonkin springs reservoir over the weekend of the fourth. The first night we got there i had a feeling that a animal was watching us, but went to bed and didnt think anything of this.Woke up the next morning with the same feeling my dog was looking off in the distance something was over there. later on that night i was fishing off the bank i was going to walk to the other end and had a bad feeling that something was down there so i didnt go over there. About 2 hrs. later i told my daughter to get my camera so i can take a picture, i took the picture of the mountains and then viewed it and the first thing i saw was a (moon) and another one in the distance i said there is no moon to night so i took another pic. nothing all the clouds are the same took with same setting all pic. are taken a minute apart. The one with the moon has something standing there its the blue color. when u look at it on my camera it comes out in almost a 3-D effect. He is wearing a vest and u can see his whole body perfect. There has been 6 other people who has seen the same guy in the circle. It scared me we slept in the truck that night.I showed my husband and friends that next day we all think that its a ufo it is something for sure. That would be awesome if it was a ufo if you could get back to me that would be great."],"Sighting Duration":"Undisclosed","Date of the Event":"07/03/2010 08:41 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24411.html.txt","/var/www/straped/mufon/org/24411.html"],"trends":["There has been one other sighting in Eureka","There were no other sightings in Eureka on or around July 3rd 2010","This sighting has never been favorited.",""],"Country":"United States","Weather Factors":"Unknown","Region":"Nevada","Disposition":"Insufficient Data","Date Submitted":"07/10/2010 05:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.512486,+-115.96078(24411)&iwloc=A&hl=en\"> mufon case (24411) map </A>","Longitude":"-115.96078","Source":"MUFON","Case Number":"24411","Log Number":"US-07102010-0020","Tags":"City","City":"Eureka","Object Shape":"Circle","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Latitude":"39.512486","Summary":"Took pic and it was there."}