{"files":["/var/www/straped/mufon/html2text/24413.html.txt","/var/www/straped/mufon/org/24413.html"],"Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Date of the Event":"11/28/2009 12:15 UTC","Source":"MUFON","divs":["Sighting DetailsI was in my family's car, in the rear seat on the left side. I was looking out the window of the car, approximately 100 miles south of a town in thr southern portion of Connecticut, which either puts me in southern New York or northern New Jersey, and I was looking at the sky, and from behind a cloud that was to my right, a black, metallic sphere about the size of a marble, possibly a penny, flew out from behind the cloud and for several seconds was in plain view before flying behind some trees and apparently disappearing. My first thoughts were probably something along the lines of, \"Holy crap! A black sphere is floating across the sky at high speeds!\" Pretty much, this was a sphere that was black and metallic. It had no blinking lights or moving parts, nor did it have any trails coming off of its back. It was shiny too, almost to the point of being as bright as the sun, but it could have been reflecting the sun's light off of its metallic surface. If flew in a straight line from the clouds to the trees, and disappeared, either by landing, some sort of cloaking device, or maybe it just went behind the car. I spent about fifteen minutes looking for any other of these objects (none of which I found) and afterwords attempted to tell a couple close friends, who asked if I was joking, like if I were to say yes they would call me crazy and hit me over the head with the nearest available object. I have not given my address and phone number because I am 15 (almost 16) and my parents have no clue this ever happened, and if they did know, they would either think I was crazy or take it too seriously and spend hours interviewing me about it. It's not that I don't like interviews, but they aren't fun when they are from a dad who works at an air base and thinks he knows everything about air vehicles and a mom who works with slightly insane people on a daily basis. If the contact information is vital, please send me an email explaining why, and I will give it to you. I'm sorry this report got to you so late, simce after 7 or 8 months, there probably is not much evidence supporting this sighting other than my words."],"Date Submitted":"07/10/2010 07:54 UTC","Object Shape":"Circle, Sphere","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.720723,+-73.998413(24413)&iwloc=A&hl=en\"> mufon case (24413) map </A>","Object Features":"Undisclosed","Summary":"Black shiny sphere soars across sky.","Region":"New York","Longitude":"-73.998413","Country":"United States","Log Number":"US-07102010-0022","Viewing Distance":"Unknown","City":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around November 28th 2009"],"Weather Factors":"Unknown","Sighting Duration":"00:00:07","Latitude":"40.720723","Case Number":"24413"}