{"Object Shape":"Oval","Date of the Event":"03/31/1975 12:00 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.199802,+-87.030841(24416)&iwloc=A&hl=en\"> mufon case (24416) map </A>","Disposition":"Insufficient Data","Longitude":"-87.030841","Date Submitted":"07/10/2010 08:51 UTC","files":["/var/www/straped/mufon/html2text/24416.html.txt","/var/www/straped/mufon/org/24416.html"],"Country":"United States","Case Number":"24416","Tags":"City","City":"Pulaski","Latitude":"35.199802","Viewing Distance":"Over One Mile","Object Features":"None","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Region":"Tennessee","Summary":"Oval/round shape mostly white with blue & yellow shimmery halo.","Sighting Duration":"Undisclosed","Log Number":"US-07102010-0025","Source":"MUFON","divs":["Sighting DetailsAs a teenager, I was diagnosed with migrane headaches, so I would go down to the creek bank and write poetry, songs, or just read. One day, while on the bank of Richland Creek, I looked up to see where the sun was in the sky, but saw what looked to be two (2) suns, one a little higher in the sky and to the right. I remember getting up and climbing the bank to the railroad tracks, then up another slope to get on level ground, all the while looking back over my right shoulder at the two suns. When I hit the gravel, I looked back once to make sure it was still there and ran to get my Dad. They knew something was wrong and called him over the loudspeaker, but wanted to know what was wrong. As I started to tell them, I was heading to the door, just as my Dad appeared. I told them all to come out and look at the two suns, there was my Dad and two other employees. I then ran home to tell my Mother and she too came outside. I got on the telephone and called my Grandparent's house and told everyone to go outside; I called my friends too (we all lived within less than a mile of one another. No one knew what it was, so I called our Radio Station, WKSR, in Pulaski, TN and talked to Mr. Nate Street, who broadcasted it over the radio. At about 15-20 minutes later, the object suddenly just zoomed away toward what I would say was Lawrenceburg. I searched the skies, but could not find it anywhere. By then other people has started calling in about something flying through the air toward Lawrenceburg back toward the Lewisburg area and throughout Pulaski. I called WKSR back to find out if they had any idea what it was and they said they would call Red Stone Arsenal in Huntsville, AL. The next day at school, everyone was talking about the flying saucer or whatever it was. Some people reported hearing a \"whooshing sound\" over their houses and people outside said something \"wizzed\" through their area. The next day or two, WKSR, reported that the base in Huntsville said it was a WEATHER BALOON. There is no way, no way that thing could have been a balloon; ballons don't just stand totally still in the air without going up or moving. This thing flew so fast, it was hard to imagine just how fast it may have been going. The other thing that has always puzzled me is I don't know how long I was on the creek bank. I have no idea, except that my Mom asked me where I was for so long. At the time, it never occurred to me. Anyway, it soon was lost in time and not talked about. For everyone but me. I have a lot of loss time that cannot be accounted for. I was in the 10th grade when I saw the object but never knew anyone else had complained of missing time, but me. For years I had what doctors called \"cluster headaches,\" then termed \"vascular headaches\" when I moved to Nashville, TN back in the early 1980s. I often had blackouts, winding up in very strange places, like arising from hedges on the college campus I attended, or walking down a road on the other side of my hometown. When I moved to Nashville, I continued to have the blackouts which scared me because my daughter was around two or three, and I would wake up with her trying to wake me up off the floor where I had fallen or sitting next to me because I had had a blackout. She and her Dad witnessed many days of my screaming into pillows because my head would hurt so bad. I had missing time and cannot account for my whereabouts from around 1975 until around 1998 after I was in a near fatal car wreck. I was semi-comatose for about 10 months and thank my then husband for caring for me, along with other family and friends (Thank you all for your help, if you read this, you'll know who you are). One day while I was trying to sit up, my nose started to bleed profusely. My husband got a towel and tissue to stave off the blood, but it poured right through the towel, so he helped me to the kitchen sink and was about to call the ambulance, when all of a sudden, I started hollering that there was something in my nose and it hurt so bad, the blood was pouring down the sink drain and all of a sudden we hear a 'metallic' clink, clink going down the drain. I told him to get it or take the pipe a loose, but it was too late. He did take the 'u' trap out but there was only blood, nothing else. Soon after, my nosebleed subsided and we both looked at each other and wondered what it could have been. We speculated that it may have been a bond fragment dislodged during my wreck, but I shook my head and said \"No way\" that was metallic and no one could ever tell me any differently. It took me a couple of years to regain my mobility and somewhat regain strength through physical therapy and plastic surgeries. Afterwhich, I had no more missing time and my pharmaceuticals for my 'vascular' headaches disappe, along with my blackouts and missing time. The weirdest thing is that whenever I have openly told someone about my experience, they too have encountered a UFO in some form or fashion. It's like we are total strangers and for some reason after just exchanging pleasant conversation, the subject just seems to come up. I have often sit outside and mentally asked them to come back and get me. I don't know why, but I still look in the sky to find them. During 2007, while picking up my kids from music school, on two separate occasions, both on a Monday evening around 6:45 p.m. each time,on our way home on I65 South, we saw three lights in the distance, spaced at least a mile or more across (from the interstate all the way across to Franklin Road, slowly moving toward the south. I pointed it out to my children and they both agreed that no plane would be flying that low or was that big. The second time we saw it, it took a slightly different route and I tried to follow it as far as I could but it veered toward I24 east as if headed for Smyrna or Murfreesboro. I drove up a hill and we watched until it was out of sight. I told the kids we could not have been the only ones to see it, but there was no news about the strange lights on the news or radio. We know what we saw, but don't know what it was."],"trends":["There have been no other sightings in Pulaski","This sighting has never been favorited."]}