{"files":["/var/www/straped/mufon/html2text/24420.html.txt","/var/www/straped/mufon/org/24420.html"],"Log Number":"US-07102010-0027","Case Number":"24420","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.967721,+-122.619033(24420)&iwloc=A&hl=en\"> mufon case (24420) map </A>","Date of the Event":"07/09/2010 08:55 UTC","Viewing Distance":"Unknown","City":"Clearlake","Summary":"!","Source":"MUFON","Latitude":"38.967721","Region":"California","Tags":"City","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Longitude":"-122.619033","Weather Factors":"Unknown","divs":["Sighting DetailsI have been watching lights here in Hidden Vlly for months now. I wrote a few weeks back about the \"hidden vlly crop circles'. The lights are everywhere, they \"try\" to look like they are reflections in windows. They are not stationary, they are sometimes white, light blue but mostly golden. EVERYWHERE I travel I see them...and much more. For the last month at the same time nightly, I see a ball of light arrive over the valley. It will then appear like a large star and will then emit smaller lights, almost like sparks. This \"star\" is not stationary, if you watch it closely you can see it moving. Most of the colored lights try and mimmick reflections in windows, but there are beautiful ones that cruise the hills around here as well. Four nights ago I saw something really crazy...these very bright lights were atop what looked like a radio tower flashing almost a dozen lights all night long! Why is nobody else noticing??!! I watch balls of dim lights cruise the sky around the valley every night. I see bright star like lights hovering around my neighbors houses every night. One night I was peeking thru the blinds at a light in our garden that kept darting up to try to see in our kitchen window!!! If they see you notice them they will go out. (the small ones) OMG!! I can go on...and on and on. This sounds so damn crazy. It is crazy! I need somebody to come out for the night and watch this craziness with me. My brother did once but I really think he is afraid. He won't come back :) During the day I see these white blobs cruising the hills, sometimes they are on the roofs, sometimes I see white posts where they wern't the day before and then gone the next day only to be back the next afternoon! I see them in the trees. There are these tiny light sources that also try and mimmick light reflections at night. They are not stationary either, although I think they try to be. You can tell they are not reflections, they have a VERY bright inner light that glows. I see them on man made things and sometimes watching me through the tree branches. One night I saw the most amazing thing! there were dozens of these golden orbs on the ground, just sitting there pulsating...glowing. I have seen so much these past months I cannot remember everything off hand. It took alot of prayer for me to come forward again. I NEED AN AGENT TO COME AND SPEND THE EVENING WATCHING THIS CRAZINESS WITH ME!!!I cannot keep it inside anymore, it is eating a hole in my stomach. PLEASE CALL ME SOON~"],"Object Shape":"Star-like","trends":["There have been 11 other sightings in Clearlake","There was one other sighting in Clearlake on or around July 9th 2010"],"Object Features":"Undisclosed","Date Submitted":"07/10/2010 10:55 UTC","Country":"United States"}