{"Log Number":"US-07112010-0006","Weather Factors":"Unknown","Longitude":"-122.653146","trends":["There have been 54 other sightings in Vancouver","There were 2 other sightings in Vancouver on or around July 4th 2010","This sighting has never been favorited.",""],"divs":["sighting detailsi was at my cousins house to join in celebrating the 4th of july. everyone took a break from lighting fireworks and all but 2-3 adults and 4-5 children moved into the garage. after a couple of minutes one of the adults hollered to come out and look at these lights, they are really cool. nobody went out to see and after another minute or so he hollered come on you guys, you gotta see this. i looked out and saw all the kids and adults staring into the sky. finally i went outside and asked what are you talking about. the adults pointed to the sky and aked what are those, we've never seen anything like that. i looked up to see what appeared to be 10 or so bright lights traveling across the sky. about 1\\2 of them were brighter and seemed to stay in the same pattern. while the others were not staying in pattern with the brighter ones, they did not venture far from formation. at first i thought they were some kind of illumination flare, but when i noticed they were not descending, i ran in and grabbed my camera. about the time i got my camera in working order and snapped a picture, a light airplane came into sight and was flying towards the lights when all of sudden it was like the lights dissapated, disappearing in various directions. i was very excited about what i had just seen and thought the other pictures i snapped as the formation dissapated contained nothing until i downloaded them off my camera and magnified them on my computer. none of us knows for certain what it was we saw that night, but the photos show it was definitely something none of us had ever seen before."],"Object Features":"Undisclosed","Source":"MUFON","Country":"United States","Region":"Washington","files":["/var/www/straped/mufon/html2text/24427.html.txt","/var/www/straped/mufon/more/24427_submitter_file1__1stpicship.JPG","/var/www/straped/mufon/more/24427_submitter_file2__2ndpic.JPG","/var/www/straped/mufon/more/24427_submitter_file3__ship5.JPG","/var/www/straped/mufon/org/24427.html"],"Object Shape":"Oval, Square, Rectagular, Star-like","Case Number":"24427","Date Submitted":"07/11/2010 05:18 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"07/04/2010 11:30 UTC","Summary":"Saw group of 15 or so bright objects moving across sky from NE to SW.","Latitude":"45.645738","map":"<A HREF = \"http://maps.google.com/maps?q=45.645738,+-122.653146(24427)&iwloc=A&hl=en\"> mufon case (24427) map </A>","City":"Vancouver","Object Flight Path":"Undisclosed"}