{"Viewing Distance":"Unknown","Summary":"White light passing overhead.","Disposition":"IFO","Date of the Event":"07/10/2010 12:00 UTC","Longitude":"-77.04989","map":"<A HREF = \"http://maps.google.com/maps?q=42.146332,+-77.04989(24429)&iwloc=A&hl=en\"> mufon case (24429) map </A>","trends":["There have been 2 other sightings in Corning","There were no other sightings in Corning on or around July 10th 2010"],"Weather Factors":"Unknown","Country":"United States","Log Number":"US-07112010-0008","Object Flight Path":"Path with directional change","divs":["sighting detailsmy wife and i were at a lookout that over looked the valley. we had watched the sunset and were simply enjoying the view. at one point, i noticed a faint red light straight overhead. it was difficult to see, but both my wife and i saw it as it moved north, slipping behind a cloud. i didn't think too much of it as many planes pass overhead at night (there is a regional airport below in the valley.) once the sun had completely gone, we were busy trying to spot venus, which was bright above the opposing hill to the nw, and mars and saturn. suddenly, from the area over where vesus was, we saw a white light that looked much the same as venus - bright and very white. the light crossed the valley, passed overhead and continued south, at which point the white light faded, leaving that same faint red light we had seen earlier. i watched the red light until i could no longer see it. now, there are a lot of planes in the sky at night. the following are the contrasts to the planes. - planes fly in a steady rular-straight line. if you watch and then close your eyes, you could anticipate where it will be. the light we saw \"wandered.\" it's direction and velocity varied as it passed. - as a plane passes overhead, you eventually see the various lights associated to a plane: flashing lights on wings and\\or nose and tail. the light we saw was a constant venus-bright light, no matter which angle you viewed it from. one bright white light with nothing flashing."],"Object Features":"Unknown","Latitude":"42.146332","Tags":"City","Object Shape":"Unknown","Date Submitted":"07/11/2010 09:32 UTC","files":["/var/www/straped/mufon/html2text/24429.html.txt","/var/www/straped/mufon/org/24429.html"],"Source":"MUFON","Case Number":"24429","City":"Corning","Region":"New York","Sighting Duration":"Undisclosed"}