{"Country":"United States","Viewing Distance":"Over One Mile","Object Features":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.59047,+-122.389355(24426)&iwloc=A&hl=en\"> mufon case (24426) map </A>","Date Submitted":"07/11/2010 04:22 UTC","Date of the Event":"07/08/2010 07:29 UTC","Longitude":"-122.389355","Sighting Duration":"Undisclosed","Disposition":"IFO","Case Number":"24426","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24426.html.txt","/var/www/straped/mufon/more/24426_submitter_file2__4ufosmarked.jpg","/var/www/straped/mufon/more/24426_submitter_file3__CIMG2470.JPG","/var/www/straped/mufon/org/24426.html"],"divs":["Sighting DetailsOn July 8th 2010, as I was walking my dog at a nearby park, I noticed the sunbeam coming above a cumulus cloud. It was an unusual sight, so I quickly took a picture. Then I decided to do a video of it. I did not notice any ufos during the video capture. The following day when I checked my video footage, I couldn't believe what I saw. There was , Not One, but Four UFOs. I am not sure exactly what I have here. AT first I thought, maybe they're just insects. But they are way up there near the clouds. Perhaps someone with experience in this matter can confirm if its real anomolies or Not. Answers: 1. At a park,walking my dog. 2. I did not notice the objects until reviewing of footage the following day. 3. Insects flying. 4. Three of the objects flew linear while the other, haphazardly. 5. My feelings excitement but was in astonishment and disbelief. I wanted to share it right away, via Flickr and YouTube. I wanted to see if someone can confirm it real or not.But when I uploaded it, the video playback quality was poor. 6. I did not noticed them during the video capture."],"Source":"MUFON","Summary":"Four ufos in a video footage I made of an interesting sunbeam and cumulus cloud","Log Number":"US-07112010-0005","City":"Redding","trends":["There have been 39 other sightings in Redding","There were no other sightings in Redding on or around July 8th 2010","This sighting has never been favorited.",""],"Object Shape":"Circle, Disc, Sphere","Latitude":"40.59047","Tags":"City","Region":"California"}