{"Sighting Duration":"Undisclosed","Case Number":"24433","Summary":"Round, amber/orange.","Source":"MUFON","Viewing Distance":"Unknown","Region":"Michigan","Date of the Event":"07/10/2010 10:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.615135,+-83.919795(24433)&iwloc=A&hl=en\"> mufon case (24433) map </A>","Object Features":"Undisclosed","Date Submitted":"07/11/2010 12:08 UTC","Country":"United States","Disposition":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24433.html.txt","/var/www/straped/mufon/org/24433.html"],"Tags":"City","City":"Howell","Object Shape":"Sphere","Object Flight Path":"Undisclosed","trends":["There have been 20 other sightings in Howell","There was one other sighting in Howell on or around July 10th 2010"],"divs":["Sighting DetailsAt around 10:40- 10:45pm on 7-10-10 my brother, his girlfriend, county offical, my son and I were on the back deck.My brother turned his head and said look at that, what is it? I walked to the rail and looked over in the direction he was looking.There was a round object amber in color, moving not very fast for sure not as fast as a plane. As we stood watching another 1 came, then at about the same distance apart as the first 2 another one. I walked to the driveway to see which way it was going. It travel west and shot out of sight. The other 2 were not to be seen. About 15 mins later friends came over from neighbors bonfire and we said we thought we saw 3 ufo's. They saw them too,just said that it was very weird.We couldn\"t have been the only ones that saw these,{at least 10 people that I know of.} It was low enough that anyone traveling on I96 could have seen them also. A friend said that last weeek he seen the same thing in Fowlerville , and my son said that he seen the same thing when he was on Thomason Lake last week. They didn't say how many they saw last week at one time and I didn't think to ask. Very weird like they were pulsating? Guess we would like to know if anyone else saw them."],"Longitude":"-83.919795","Log Number":"US-07112010-0012","Latitude":"42.615135"}