{"Source":"MUFON","Weather Factors":"None","Longitude":"-0.372882","Summary":"Bright star like pulsating flash of light UFO.","Object Flight Path":"Path with directional change","Date Submitted":"07/11/2010 10:55 UTC","Log Number":"GB-07112010-0009","Country":"United Kingdom","Object Shape":"Disc, Flash, Star-like","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=50.81787,+-0.372882(24430)&iwloc=A&hl=en\"> mufon case (24430) map </A>","Case Number":"24430","files":["/var/www/straped/mufon/html2text/24430.html.txt","/var/www/straped/mufon/org/24430.html"],"Region":"England","Sighting Duration":"00:02:14","Latitude":"50.81787","Disposition":"Unresolved","Object Features":"None","trends":["There has been one other sighting in Worthing","There were no other sightings in Worthing on or around July 10th 2010"],"City":"Worthing","Date of the Event":"07/10/2010 11:30 UTC","divs":["Sighting DetailsDown in the south of the UK where I am, you don't see many cloudless, clear nights, so I thought I would watch the stars and see if I could spot a UFO. I started my watch at around 11PM, After 30 mins of sitting there, around 11:30 pm I saw what looked like a star, I did a double take as it was moving at an incredible speed. It had the same light as a star, and for all intents and purposes would of been mistaken for one, except that during it's movement, an enormously bright light emanated from the UFO as if it had blown up!! , the light stayed on for 30 seconds before pulsating and then finally fading back to the normal star like light it had been in the beginning. The only thing I can liken it to, is a dark room and a light is gradually brightened from one bulb, finishing in a bright finale like an explosion The UFO was, all the time I was watching it, moving at a very fast speed. It then shot out of view past the window frame, and I lost sight of it. The sky was perfectly clear, during those first 40 mins before 11:30 PM , I had seen shooting stars, birds and aircraft , and this UFO was none of those. It was not a comet either. The UFO was a navigating at tremendous speeds whilst the light changes were taking place. Unfortunately I did not grab my camera, because this UFO was so high up and my zoom is rubbish it would not have registered anything except a bright blurry light."],"Tags":"City"}