{"Longitude":"-104.868523","files":["/var/www/straped/mufon/html2text/24438.html.txt","/var/www/straped/mufon/org/24438.html"],"Tags":"City","Region":"Colorado","Weather Factors":"None","Date of the Event":"07/08/2010 09:30 UTC","Country":"United States","Log Number":"US-07112010-0017","Viewing Distance":"Unknown","Summary":"\"Boomerang\" sighting Centennial, Colorado.","Object Features":"None","Source":"MUFON","trends":["There have been 16 other sightings in Centennial","There were no other sightings in Centennial on or around July 8th 2010"],"Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","City":"Centennial","map":"<A HREF = \"http://maps.google.com/maps?q=39.585765,+-104.868523(24438)&iwloc=A&hl=en\"> mufon case (24438) map </A>","Object Shape":"Boomerang","Disposition":"Unknown","Date Submitted":"07/11/2010 02:16 UTC","Latitude":"39.585765","Case Number":"24438","divs":["Sighting DetailsI wes sitting on my deck drinking coffee. I noticed a bright object in the NW sky about 60 degrees above the horizon. It was still and appeared to brighten periodically. I observed it for several minutes as it stood still. it started slowly moving toward the SE. I followed the object using 8X32 binoculars. It appeared to be boomerang shaped, thicker in the middle back side, and was at very high altitude. I would estimate the altitude at >100,000 feet. My altitude estimate is based on the amount of binocular focus adjustment that I had to make to get the object into focus, above that normally required to focus on cross country commercial jets traveling at 35,000 feet. I would estimate its size as equal to or greater than a commercial airliner. When I had the object in focus, it appeared that it slowly rotated about once every 5-10 seconds, as it moved forward. It reflected the sunlight more or less brightly as it rotated. The surface was metalic and white to orange in the color reflected. As it progressed toward the more intense sunlight of the SE and nearby trees, I lost contact."]}