{"Case Number":"24437","Sighting Duration":"Undisclosed","Date of the Event":"07/10/2010 12:00 UTC","Viewing Distance":"Unknown","trends":["There have been 11 other sightings in Clearlake","There was one other sighting in Clearlake on or around July 10th 2010"],"Latitude":"38.966241","City":"Clearlake","Object Shape":"Other","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/24437.html.txt","/var/www/straped/mufon/org/24437.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.966241,+-122.624373(24437)&iwloc=A&hl=en\"> mufon case (24437) map </A>","Date Submitted":"07/11/2010 02:09 UTC","Tags":"City","Log Number":"US-07112010-0016","Summary":"There was another electrical looking tower where there isn't supposed to be one that was pulsating very bright lights on the hill in front of my house.","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Region":"California","Longitude":"-122.624373","Disposition":"Insufficient Data","divs":["Sighting DetailsThis is my third report, so much is happening that it is hard to remember everything. Lastnight I awoke a little after midnight and as usual looked out my window to see what is going on with all these crazy lights in our little valley and on the hill in front of my house was an electrical looking tower where there isn't supposed to be one, it was pulsating very bright white lights. I watched it for awhile but since I am experiencing these strange lights nightly for months, I soon went back to bed. The usual lights I have previously described were there as well. But in my last report I forgot to mention that when I have been out of town I have experienced the same usual lights...I have seen them in Stockton, Cobb Mtn and up in Fortuna, Ca...The large one hovering in the night sky that looks like a large star, the large ones that are either golden, white, or light blue that look like crosses and also look like their reflecting off windows. Sometimes they are but on a recent visit to my sister's I found out differently. I took the dog out @ 1am and noticed the large golden cross looking lights that looked like they were reflecting off windows in the church across the street. I hadn;'t been there in a while so I thought the church had built additions. When I went out in the morning where I had seen the 'reflecting' lights it was just open field! There were 8 of them. I also forgot to mention these stationary lights that are white and look like a bug or something. There are always about a dozen of them in the night sky, in every town I have visited lately. You can tell they are not stars, they are not satelites as they are just a few hundred feet from the rooftops. They are here everynight and I feel they are just watching... Well, I certainly hope somebody else here in Hidden Valley Lake will come forward and share their experiences. Until next time..."]}