{"map":"<A HREF = \"http://maps.google.com/maps?q=38.817341,+-94.924957(24439)&iwloc=A&hl=en\"> mufon case (24439) map </A>","Object Features":"None","Country":"United States","Weather Factors":"None, Does Not Apply","City":"Gardner","Tags":"City","Summary":"Silent orange sphere, only lit on 'front' side, seemed to rotate vertically from the rear view.","Source":"MUFON","Object Flight Path":"Straight-line path,Other","Date Submitted":"07/11/2010 04:01 UTC","Date of the Event":"07/09/2010 10:30 UTC","trends":["There have been 9 other sightings in Gardner","There were no other sightings in Gardner on or around July 9th 2010","This sighting has never been favorited.",""],"Latitude":"38.817341","Region":"Kansas","Disposition":"Unknown","divs":["Sighting DetailsI was standing in my back yard smoking a cigarette as my visiting parents were going to sleep and wife was putting the dog in the laundry room for bed. I saw a bright orange sphere that somewhat resembled a glowing hot air balloon or 'clouded flame' moving from the East. It was too bright to be a plane headlight and there were no blinking lights as a plane would have. As it approached it peaked my interest as it seemed too low for an airplane and I knew if it was I should hear something. Not wanting to take my eyes off it I tried calling my wife with my cell phone to see if she had her phone nearby at 10:31 PM CT to have her come look. I then turned on my phones camera and took a picture at 10:33 PM CT. I watched it pass, and as it was moving away to the West with a very slight (barely noticeable) southern curve there was more of a faint bluish glow on the back side, not bright light like the front, and I could see somewhat of a counter-clockwise vertical rotation. i snapped 2 more pictures at 10:34 PM CT in the general direction with my phone, I couldn't see the object but could pinpoint the area based on the lights on the ground. Before it moved off I ran inside to see if the wife was busy to come look, but took too long and it was gone by the time we went back out. At 11:04 PM CT I was in the driveway making sure the cars were locked and smoking one more cigarette before bed. Straight up I saw 2 small very distant white lights following almost in tow of each other moving South to North. I would have written it off as a satellite if there was only one but being 2 I was unsure. Once again I snapped another picture in the general direction but haven't reviewed that photo yet. Today my wife was curious and 'googling' what I told her and made me want to fill this out. The first picture I added is the front view. The 2nd was trying to capture the rear view. The 3rd image I added a circle around the general area I think I remember it being. Hopefully you have some better photo software and can see more than I can."],"Case Number":"24439","Longitude":"-94.924957","Log Number":"US-07112010-0018","Object Shape":"Egg, Sphere","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24439.html.txt","/var/www/straped/mufon/more/24439_submitter_file1__34199_1543873919387_1311161340_1517822_743653_n.jpg","/var/www/straped/mufon/more/24439_submitter_file2__36429_1543873839385_1311161340_1517820_265129_n.jpg","/var/www/straped/mufon/more/24439_submitter_file3__36429_circleadded.jpg","/var/www/straped/mufon/org/24439.html"],"Viewing Distance":"Unknown"}