{"Log Number":"US-07122010-0002","Region":"California","trends":["There have been 4 other sightings in Alameda","There were no other sightings in Alameda on or around July 11th 2010"],"Country":"United States","Latitude":"37.765206","files":["/var/www/straped/mufon/html2text/24449.html.txt","/var/www/straped/mufon/org/24449.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.765206,+-122.241636(24449)&iwloc=A&hl=en\"> mufon case (24449) map </A>","Source":"MUFON","Object Shape":"Circle","Longitude":"-122.241636","Weather Factors":"None","City":"Alameda","Object Flight Path":"Straight-line path","Object Features":"Unknown","Tags":"City","Summary":"Fleet of UFOs seen over San Francisco/Bay Area.","Sighting Duration":"00:15:00","divs":["sighting detailsi went out into my backyard at around 18:00 hours today, 7\\11\\2010 to smoke a cigarette. it was a beautiful clear warm day with around 10 knot wind blowing from the north with no visible clouds. i first started seeing this unknown white circle craft(s)last summer. the frequency of sighting increased towards late summer\\fall, almost every weekend, but not much in the winter due poor weather. the craft usually hovers and starts to move very very slowly through the skies, some seen at different altitudes (10,000-15,000 feet). they sometimes travel horizontally and sometime vertically until i can no longer see them. my wife and i have once witnessed 3 crafts of different color, 2 traveling in different directions and 1 craft just hovering with very little movement. today i decided to sit in a shaded area with open view of the sky to enjoy my cigarette. as i was enjoying my cigarette, i decide to look up to see if i might have a chance of seeing this unusual crafts and got a shock of my life. instead of seeing my usual single craft, i saw a fleet of 27-30 white circular crafts traveling in northerly direction very slowly in an elongated formation with no pattern, some in close formation and others far apart. after recovering from the shock of seeing so many crafts, i ran into the house to get my wife to witness what i had just saw. i told her to sit next to me and look up and see if she was seeing the multiple circle objects that seems to be hovering 11,000-15,000 feet in the sky which she confirmed she was seeing. i see many different types of known aircrafts due to our home being close proximity to oakland and san francisco airport, but these crafts were circular with no visible fuselage or wings like normal aircrafts. we heard no usual noise that is made either by a piston or jet engine and we ruled out balloons because they were traveling north where the wind was blowing from. it took about 15 minutes for these crafts to travel out of our sight."],"Date Submitted":"07/12/2010 12:12 UTC","Viewing Distance":"Over One Mile","Case Number":"24449","Disposition":"Unknown","Date of the Event":"07/11/2010 06:10 UTC"}