{"Weather Factors":"Does Not Apply","Date of the Event":"07/10/2010 09:25 UTC","files":["/var/www/straped/mufon/html2text/24443.html.txt","/var/www/straped/mufon/org/24443.html"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=38.941831,+-105.157589(24443)&iwloc=A&hl=en\"> mufon case (24443) map </A>","Summary":"Bright object changes direction, disappears behind small cloud and does not reappear","City":"Divide","Log Number":"US-07112010-0022","Source":"MUFON","Object Features":"Undisclosed","Latitude":"38.941831","Date Submitted":"07/11/2010 05:48 UTC","Country":"United States","trends":["There has been one other sighting in Divide","There were no other sightings in Divide on or around July 10th 2010"],"Longitude":"-105.157589","Viewing Distance":"Unknown","Object Shape":"Circle, Star-like","Tags":"City","Sighting Duration":"00:00:03","divs":["Sighting DetailsI was up at Mueller State Park at 9:25 p.m. the night of the 10th. The sky was reasonably clear to the East with dark clouds to the West. I was standing facing North talking to someone when I looked up at the Northeastern sky and saw a large, bright, fast moving object. It was perfectly round, a little bigger than the size of Venus, but it did not \"sparkle\" or \"twinkle.\" It was moving very fast and make a quick, wobbling movement to the right before correcting itself and disappearing behind a very small cloud. I expected it to come out from behind the cloud, but it did not. It's just like it stopped behind it or fazed out. Someone mentioned that the ISS was going to fly by and I thought that maybe that's what I saw, but then the ISS flew by about an hour later. It was moving a lot slower that the object I saw and was a different color. The ISS was orange or amber and the object I saw was white, possibly slightly pink. Also, the ISS moved in a straight line, while the object I saw jerked very suddenly to the right. I don't know of meteors doing this movement and it was odd that it did not reappear behind the cloud. Unfortunately, due to the speed of the object, I only saw it for about 3 seconds, but it was long enough to ascertain color, shape, speed and movement."],"Region":"Colorado","Case Number":"24443","Object Flight Path":"Path with directional change"}