{"Weather Factors":"Unknown","divs":["sighting detailson the evening of july 9,2010, i was sitting in my garden and resting. this was about 8:20 in the evening. i looked to the west and noticed a hovering red light that i thought was helicopter leaving the area. we have helicopters leaving from ball hospital in muncie, indiana near here and they fly over our house from time to time, coming and going.i didn't think much about this light until i looked over to the same spot and it had yet to leave. i looked to see if it was moving, either towards us, or away. i realized that it appeared to be stationary,noted that it was reddish\\orange and was hovering. i called my husband in his shop to come out to see this light . we got our binoculars out and tried to focus on the object. it was hard to keep a focus on it as it was vibrating\\oscillating. it was in the air over chesterfield ,indiana for about 25 minutes total. it had gone a little more west, faded, then came back, hovered and while my husband was out in the road looking at it, it basically disapppeared. i didn't have any particular feelings when i saw this. just being inquisitive about why a light would be in the area and stationary for such a long time. this is the first time we have seen anything like this in our area."],"Object Flight Path":"Undisclosed","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/24440.html.txt","/var/www/straped/mufon/org/24440.html"],"Country":"United States","Disposition":"Insufficient Data","Summary":"I noted that a light of undetermined shape, red in color stayed in sky for about 25 minutes over Chesterfield, IN.","Case Number":"24440","Sighting Duration":"Undisclosed","Log Number":"US-07112010-0019","Viewing Distance":"Unknown","City":"Anderson","map":"<A HREF = \"http://maps.google.com/maps?q=40.10983,+-85.677294(24440)&iwloc=A&hl=en\"> mufon case (24440) map </A>","Date Submitted":"07/11/2010 04:24 UTC","Object Features":"Undisclosed","Latitude":"40.10983","Source":"MUFON","Tags":"City","Longitude":"-85.677294","Region":"Indiana","Date of the Event":"07/09/2009 08:43 UTC","trends":["There have been 12 other sightings in Anderson","There were no other sightings in Anderson on or around July 9th 2009"]}