{"Case Number":"24453","map":"<A HREF = \"http://maps.google.com/maps?q=40.75006,+-74.026513(24453)&iwloc=A&hl=en\"> mufon case (24453) map </A>","Latitude":"40.75006","Source":"MUFON","Date Submitted":"07/12/2010 01:59 UTC","trends":["There have been 7 other sightings in Hoboken","There were no other sightings in Hoboken on or around July 12th 2010"],"Region":"New Jersey","Weather Factors":"None","Log Number":"US-07122010-0006","files":["/var/www/straped/mufon/html2text/24453.html.txt","/var/www/straped/mufon/org/24453.html"],"divs":["Sighting DetailsI saw Two Ufo's in the space of a few hours. The first i saw from my window looking west towards NYC, I saw a Bright light moving west towards Manhattan. It was Moving slowly and was like a bright Star, looked at it through binoculars and it looked like a star, there were no flashing or red lights on it, saw it for about 20 sec's then i lost view due to a tree outside my window. I always see plains going by my window and the NEVER fly in the direction it was going, also there were two other plains flying at the same time, you could see the red flashing lights on them. That was at 21.44pm on July 11th. The second was at 1.43am on the 12th July. was outside having a smoke looking at a clear sky, was out for about a minute and saw a bright light fly through the sky at low altitude towards Jersey city heights. It was to low to be a shooting star and looked like a missile fly trough the sky, only lasted a second. got goose bumps when i saw it.was no sound from it and reminded me of a meteorite but was way to low. Going back out to see if i can see anything else and i will keep you updated. Thanks"],"Object Shape":"Star-like","Sighting Duration":"00:00:02","Disposition":"Unknown","Longitude":"-74.026513","Country":"United States","Object Features":"None","Summary":"Saw two in the space of a few hours.","Object Flight Path":"Straight-line path","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/12/2010 01:43 UTC","City":"Hoboken"}