{"Tags":"City","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/24456.html.txt","/var/www/straped/mufon/org/24456.html"],"Sighting Duration":"00:05:00","trends":["There has been one other sighting in Point Pleasant","There were no other sightings in Point Pleasant on or around July 12th 2010"],"City":"Point Pleasant","Latitude":"40.083171","Longitude":"-74.068193","Summary":"Object that resembled a star moving in erratic zig-zags but moving from east to west.","Date Submitted":"07/12/2010 04:44 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","Country":"United States","Region":"New Jersey","Object Features":"Unknown","Weather Factors":"Unknown","Case Number":"24456","Date of the Event":"07/12/2010 01:00 UTC","divs":["Sighting Details1. Since 3 nights ago when drinking with family, Objects that resemble normal stars have moved from East to West with great speed in zig-zag patterns that do not resemble those of orbital satellites. Tonight and the previous night (July 11th), I was compelled to observe, un-intoxicated, to validate what I saw and dismiss the objects which I had seen. Astonished, I observed several star-like objects move in ways that are unexplainable these past few days all of them moving erratically but moving east to west generally. 2. I first noticed these objects when I was staring at the sky and noticed movement. 3. I first thought the object was a satellite or perhaps even the ISS but then the object began moving in a fashion unlike anything I have ever seen. 4. (12th) After star-gazing, when movement was first detected, the Star like object was moving steadily from east to west but darted to the left of my field of vision and then to the center several times before disappearing well before reaching my observable horizon. 5. Feelings - Confusion and Amazement. 6. Object Disappeared - Did not move over the visible horizon although might be attributed to light pollution."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.083171,+-74.068193(24456)&iwloc=A&hl=en\"> mufon case (24456) map </A>","Object Shape":"Star-like","Log Number":"US-07122010-0009"}