{"City":"Undisclosed","Object Shape":"Circle, Other","Object Flight Path":"Undisclosed","Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=41.212012,+-77.184855(24459)&iwloc=A&hl=en\"> mufon case (24459) map </A>","trends":[],"Case Number":"24459","Country":"United States","Disposition":"Insufficient Data","Latitude":"41.212012","Date of the Event":"07/11/2010 12:00 UTC","Viewing Distance":"Unknown","Region":"Pennsylvania","Date Submitted":"07/12/2010 11:01 UTC","Log Number":"US-07122010-0012","Summary":"Saw a round object similar to the moon through binoculars in the afternoon in a blue sky. Object then flattened and quickly went north and out of site.","files":["/var/www/straped/mufon/html2text/24459.html.txt","/var/www/straped/mufon/org/24459.html"],"divs":["Sighting Details I was lying outside with my wife on a blanket. It was a sunny Sunday afternoon with few clouds. I think the time was around 4:00 PM. I star gaze at night sometimes with my binoculars or my telescope. I just thought I would lay out and look up in the daytime with my binoculars because I know at night I can see far more stars with them. While looking I saw what at first glance looked like the moon. (what I am describing in terms of my thoughts happened in split seconds) I then realized it couldn't be the moon because I hadn't seen it with the naked eye and it was too small through the binoculars. I believe the moon was not in an observable phase at that time, though I am not sure. It can be best described as having the appearance of a light bulb unlit. The bottom right hand corner of the sphere seemed to be darker. Through the binoculars, its size was about the size of a pea held out at arms length.(that's why I thought I was looking at the moon at first). It did not move when the binoculars moved so I deduced it was not a spot on the lense. I commented to my wife that I was seeing something different when it suddenly flattened, brightened, and 'shot' to the north. It wasn't moving when I first saw it. I lost sight of it as it went behind trees and never saw it again. I am my own harshest cynic. I have seen things before but was always able to explain them. This I cannot. I am a minister and I do not drink. I live in SW Pennstylvania east of Pittsburgh. The experience has left me very curious."],"Longitude":"-77.184855","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed"}