{"Country":"United States","Object Flight Path":"Unknown","Case Number":"24455","Source":"MUFON","Summary":"UFOs showed up in two of my photos.","map":"<A HREF = \"http://maps.google.com/maps?q=32.286232,+-104.095773(24455)&iwloc=A&hl=en\"> mufon case (24455) map </A>","Longitude":"-104.095773","Date Submitted":"07/12/2010 03:25 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","divs":["sighting detailsi was taking photos one afternoon of some beautiful thunderclouds that were building. i took aprx 12 photos. when i downloaded them i found a strange object in two different photos. i did not see them when i took the photos. one is in the top center of the photo and appears as maybe something flat and dark. the other one is also dark but the end of it looks different. it appears to be going into the cloudbank on the left. i was zoomed in on these clouds as far as my zoom goes, i think 10x. i don't know what they are but maybe you can figure it out, i hope so. i am also sending a photo i took about 6 years ago. i was taking pictures of my horses in the pasture and i did not see anything in my camera lens at the time i took the photos. i don't know if you are intersted in something that long ago but it i think it might be worth it. it looks like some kind of vapor trail or something trailing the object. thank you for your time and i hope we get some answers. [cms\\tg\\pid]"],"trends":["There have been no other sightings in Loving","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/24455.html.txt","/var/www/straped/mufon/more/24455_submitter_file1__DSC00463.JPG","/var/www/straped/mufon/more/24455_submitter_file2__DSC00489.JPG","/var/www/straped/mufon/more/24455_submitter_file3__scan0066.jpg","/var/www/straped/mufon/org/24455.html"],"City":"Loving","Object Shape":"Disc, Triangle","Log Number":"US-07122010-0008","Disposition":"Unknown","Object Features":"Unknown","Latitude":"32.286232","Region":"New Mexico","Date of the Event":"06/06/2010 12:00 UTC"}