{"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Region":"Missouri","Sighting Duration":"00:10:00","City":"Brussels","Object Features":"Undisclosed","Date Submitted":"07/21/2003 09:27 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.949494,+-90.588731(2445)&iwloc=A&hl=en\"> mufon case (2445) map </A>","Latitude":"38.949494","divs":["Sighting DetailsMy wife and I were on the front deck stargazing, as this is our hobby on clearnights. We look for satellites, the ISS, shooting stars and etc. and arefamiliar with our night sky.On Sunday evening, July 21st, 2003, we observed 3 different cellestialphenomenon that we could not readily explain. The first was initiallystationary to the west, about 80 - 85 degrees above the horizon, and seemed tobe simply another star in the sky. It started moving toward the southwest,getting dimmer, and dissapearing into the starlit sky, not to the horizon, mindyou, but seemingly into deeper space.A few minutes later, we noticed what I first thought was a satellite, movingfrom west to east at a rapid pace, traversing the sky from horizon to horizon inabout 45 seconds, and I would have disregarded it as such, but an aircraft withstrobes redgreen moved below it to give us a better reference, intersected thepath and obscured it for a brief moment...the altitude seemed to me to be toolow for a satellite but too high for an aircraft. I spent 14 years of my Navycareer as an aviator, and have a pretty good idea of what is normal behavior forairborne objects and what is not. I believe the speed to have been much slowerthan a satellite but much faster than an aircraft.The third object hovered for a considerable period of time, in about the samearea of the sky as the first object, was visible for about 10 minutes, thensimply disappeared.I was intrigued by our observations, as we have spent many a night looking atthe stars, and havent seen anything at all like what we observed last night. Iwill continue to report as we observe other phenomenon.Note We own 5 dogs, and they were all unusually disturbednervous during thetime we were viewing the objects. It may have been the excited tone of ourvoices as we discussed what we were seeing."],"Case Number":"2445","trends":["There have been no other sightings in Brussels","This sighting has never been favorited."],"Object Shape":"Undisclosed","Disposition":"Insufficient Data","Tags":"City","Log Number":"","Longitude":"-90.588731","Weather Factors":"Unknown","Date of the Event":"07/21/2003 09:27 UTC","Summary":"Bright Lights Stopping, Moving Again, High Altitud","files":["/var/www/straped/mufon/html2text/2445.html.txt","/var/www/straped/mufon/org/2445.html"],"Source":"MUFON"}