{"trends":["There have been 7 other sightings in Hoffman Estates","There were no other sightings in Hoffman Estates on or around July 10th 2010","This sighting has never been favorited.",""],"Object Features":"Unknown","Source":"MUFON","Latitude":"42.069992","Date Submitted":"07/12/2010 03:42 UTC","Viewing Distance":"Unknown","Case Number":"24462","divs":["Sighting DetailsI was driving home with my Wife & Son after a birthday party and was driving West on I-90. We were slowing to a stop near road constructon near Elgin when I noticed the lights (six in a line to the West) in the sky to our left (South) and pointed them out to my Wife. At first I thought it was just planes in a landing pattern going to O'hare until we noticed that they were solid orange, flickered like fire and had no other noticable lights. At this point my heart was racing and I had my wife (she was visibly worried)call my Father (who is usually in bed listening to news radio at this time) to see if he heard anything about this. (I grew up near O'hare Intl. Airport and have worked next to it for the past 14 years and am familiar with seeing the sky filled with approaching planes with their landing lights etc... and these were not the same.) My next thought was that maybe these lights were a type of flare, but they were steadily moving East and did not appear to be decending. After a couple of minutes we slowly started moving with traffic again as the last object moved past and behind us where I lost sight of it as it went over some light clouds. I have attached a sketch that I made in photoshop."],"Longitude":"-88.1134","files":["/var/www/straped/mufon/html2text/24462.html.txt","/var/www/straped/mufon/more/24462_submitter_file1__UFO-071010.JPG","/var/www/straped/mufon/org/24462.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.069992,+-88.1134(24462)&iwloc=A&hl=en\"> mufon case (24462) map </A>","Date of the Event":"07/10/2010 09:15 UTC","Country":"United States","Weather Factors":"Unknown","Object Shape":"Fireball, Sphere","Sighting Duration":"Undisclosed","Log Number":"US-07122010-0015","City":"Hoffman Estates","Tags":"City","Disposition":"Unresolved","Summary":"Orange flickering flame.","Region":"Illinois","Object Flight Path":"Straight-line path"}