{"Source":"MUFON","Date of the Event":"07/09/2010 12:00 UTC","Sighting Duration":"00:00:04","Summary":"Dull orange, translucent triangles. 5or 7 of them. No sound. Heading due east. Speed unknown.","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.3892,+-83.293297(24460)&iwloc=A&hl=en\"> mufon case (24460) map </A>","Object Shape":"Triangle","Log Number":"US-07122010-0013","Date Submitted":"07/12/2010 11:17 UTC","Tags":"City","Latitude":"42.3892","trends":["There have been 2 other sightings in Redford","There were no other sightings in Redford on or around July 9th 2010"],"City":"Redford","Longitude":"-83.293297","Viewing Distance":"Unknown","Case Number":"24460","Country":"United States","files":["/var/www/straped/mufon/html2text/24460.html.txt","/var/www/straped/mufon/org/24460.html"],"Disposition":"Unknown","Object Features":"Other","divs":["Sighting DetailsI was standing in my driveway,between my house and my neighbors house trying to quiet their barking dog.I looked up into the sky and noticed some strange movement.Luckily I had my glasses on because with out them,i'm sure I wouldn't have noticed them because of the fuzzy,translucence nature of them.I had to really look hard and focus,to try to make out what I was looking at.My first thought was that I was looking at a formation of high flying fighter jets heading due east.There were either 5 or 7 soft,glowing,translucent,orange triangles that made no sound whatsoever.Then just as I realized that this is something strange,they either disappeared,or flew out of my sight.It all happened so fast,I can't say for sure.I can't say for sure whether I was looking at numerous triangled shaped objects in a triangle formation, or one triangled shaped object with triangled shaped lights at its edges.The movement of them was very strange!The best way that I can describe their movement,was that they looked like something gliding underwater,just near the surface,when what you're looking at looks somewhat distorted because of the movement of the water.After,I was quite excited about what I saw.I watch the sky many nights,and I know i've never seen anything like this."],"Region":"Michigan","Weather Factors":"Unknown"}