{"Disposition":"Unknown","Region":"Texas","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"07/12/2010 05:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.35334,+-95.292802(24465)&iwloc=A&hl=en\"> mufon case (24465) map </A>","Source":"MUFON","Object Features":"Undisclosed","Object Shape":"Fireball","Date of the Event":"07/10/2010 09:25 UTC","Longitude":"-95.292802","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around July 10th 2010","This sighting has never been favorited.",""],"Summary":"Red-orange fireball over Tyler, Texas.","Weather Factors":"Unknown","divs":["Sighting DetailsI, my sister, and my two sons saw something over Tyler, TX around 9:25 PM on July 10, 2010. The sky was not completely dark yet. My sons and I were in the pool. I put my head back to dip my hair into the water... when I saw a bright red glow approaching from the distance. One of my sons saw it at the same time, and we both said \"What is THAT?\" It was traveling at the speed of a plane, and as it approached.. my younger son and I saw something behind the glow... almost like a parachute shape, but translucent looking. My son said it looked like a glare on something behind the light. But then that shape went away, and all we saw was a red fireball. By this point, it looked like a plane on fire. My older son called for my sister to come outside. We stood in shock.. it looked like a plane in flight that was in flames. We could see the burning flicker of flames. We were scared because we thought it was a plane on fire and we were just waiting for it to fall... and my mind was thinking, \"How can a plane still fly if it's on fire?\"... but it continued on in the distance until it could no longer be seen. Once it was gone, we realized that it could not have been a plane because there was no noise. It was completely silent. Once the reality hit that we had not seen a plane on fire, we knew it was a UFO... and I wished I'd looked at it as one from the beginning. There were NO OTHER reports of this to the local news station when my sister called, and no one else I know saw it. People keep saying it was a weather balloon or hot air balloon that we must have seen. Yeah right. I've seen both, and this was neither. A hot air balloon has no forward propulsion, and it was so close that we would have seen the balloon. Two things we noted... 1. It followed the same path that planes had flown from over us earlier. 2. We noticed what looked like the remains of a thick jet stream breaking apart over us shortly afterward. We did not get a good picture, because my son did not find the phone in time. By the time he got it, the object was in the distance... just before it disappeared from sight. When I enlarge the photo it is too distorted. The sky was darker by then, and it looks pixelated. There is only a red dot."],"Case Number":"24465","City":"Tyler","Object Flight Path":"Straight-line path","Log Number":"US-07122010-0018","Latitude":"32.35334","files":["/var/www/straped/mufon/html2text/24465.html.txt","/var/www/straped/mufon/more/24465_submitter_file1__IMG00591-20100710-2113.jpg","/var/www/straped/mufon/org/24465.html"],"Country":"United States","Tags":"City"}