{"Log Number":"US-07122010-0022","Longitude":"-85.915904","Tags":"City","Summary":"Balls of \"flame\" floating over Loon Lake.","files":["/var/www/straped/mufon/html2text/24470.html.txt","/var/www/straped/mufon/org/24470.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.140007,+-85.915904(24470)&iwloc=A&hl=en\"> mufon case (24470) map </A>","Weather Factors":"None","Date of the Event":"07/03/2010 10:30 UTC","Object Flight Path":"Undisclosed","Disposition":"IFO","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Fireball","City":"Irons","Object Features":"Undisclosed","Case Number":"24470","Date Submitted":"07/12/2010 08:24 UTC","Latitude":"44.140007","trends":["There have been no other sightings in Irons","This sighting has never been favorited."],"Region":"Michigan","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn Saturday, July 3rd I was camping at Loon Lake in Irons, Michigan. We had taken the pontoon out on the lake to watch the fireworks after sunset, which was around 10pm. The fireworks started normally, and then after only a few minutes they stopped. After a few minutes I looked to my left and saw what looked like an orange ball of flame float over the trees and follow a straight line across the lake, disapearing into the sky on the other side. It was traveling at pretty fast pace, like a plane in the sky would, but it had no blinking lights, just a round orange glow. Shortly after it disapeared, I looked back to my left, and from the exact same spot in the trees came another one of the exact same size, which followed the exact same path as the first, disapearing into the same area of sky on the other side of the lake. When that one had disapeared, I looked back to my left and another one came out of the trees! It too followed the same path. Half-way through this one's travel the fireworks started back up again, and it looked like it floated in the area where they were exploding, but it was not effected, so I thought maybe it was floating higher than the fireworks were. After this one there were no others for about 15 minutes. Then as the fireworks were nearing their finale, one more took the same path as the other three. Everyone on the pontoon was very confused and we spent more time trying to figure out what the UFO could be than watching the fireworks. Afterwords, we asked a few other lake residents and some of them said they were helium balloons with candels in them, but I've always known helium to be combustable, and I didn't think a helium balloon would travel the same path without lifting higher into the sky and eventually popping. I'm still not quite sure what it was, but it definitely made for an interesting fireworks show."],"Source":"MUFON"}