{"Region":"Ontario","Object Features":"None","Longitude":"-75.884855","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.479331,+-75.884855(24479)&iwloc=A&hl=en\"> mufon case (24479) map </A>","Latitude":"44.479331","Country":"Canada","Summary":"Bright star like object in sky moving quickly from north to south emitting no noise.","divs":["Sighting DetailsMy partner and I went outside on our porch to close and put away our BBQ. As we were near the front door of our house my partner noticed a bright star like object moving in the sky. When she alerted me I thought it was a lightning bug (because I immediatly knew I wasnt looking at a shooting star, helecoptor or any other aircraft), because we have a lot of them in our yard, however I quickly discounted this because lightning bugs dont fly way up in the sky and they continuously flash a greenish light for about a second or two at one time. The object I saw was a constant light except it dimmed briefly like someone turned a dimmer switch, and when it dimmed it was for 2 or three seconds. I couldnt belive my eyes and almost wanted to look away, but I couldnt. This object was moving at a high rate of speed across the sky from North to South there were no flashing lights like on normal aircraft, no noise was emitted and the object dimmed for a few seconds then became bright again while still travelling in the same direction started to fly for lack of better words all goofy like, it slowed then dipped down then came back up. After doing this a few times it straightened out and continued on its course from North to South, dimmed once more, then brightened and eventually just went behind some large pine trees in our yard and disappeared from view."],"Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"CA-07132010-0007","Tags":"City","files":["/var/www/straped/mufon/html2text/24479.html.txt","/var/www/straped/mufon/org/24479.html"],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"07/13/2010 09:51 UTC","Object Flight Path":"Path then hovering","trends":["There has been one other sighting in Mallorytown","There were no other sightings in Mallorytown on or around July 7th 2010"],"Object Shape":"Star-like","Sighting Duration":"Undisclosed","City":"Mallorytown","Date of the Event":"07/07/2010 12:00 UTC","Case Number":"24479"}