{"Weather Factors":"Unknown","Tags":"City","Summary":"Very high up bright silver stationary cigar/blimp like object.","files":["/var/www/straped/mufon/html2text/24477.html.txt","/var/www/straped/mufon/org/24477.html"],"Longitude":"-79.254099","City":"Toronto","Date of the Event":"07/04/2010 04:45 UTC","Object Features":"None","Object Shape":"Blimp, Cigar","Viewing Distance":"Over One Mile","Case Number":"24477","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.778399,+-79.254099(24477)&iwloc=A&hl=en\"> mufon case (24477) map </A>","Log Number":"CA-07132010-0005","Sighting Duration":"00:05:00","Object Flight Path":"Stationary","trends":["There have been 136 other sightings in Toronto","There were 4 other sightings in Toronto on or around July 4th 2010"],"Date Submitted":"07/13/2010 05:48 UTC","Country":"Canada","Region":"Ontario","divs":["Sighting Details My stepfather and I were driving home from the store when I spotted a very bright, high up silver 'object' that I first thought was a plane with a banner trailing behind it until I realized how high up it was , didn't appear to have any wings and was STATIONARY. I pointed it out to my stepfather who was driving and he too thought it was very odd. It was very bright silver and there were absolutely NO clouds in the sky (the clearest sky I've seen in a long time) so the object stood out like a sore thumb and we were studying it for about five minutes, long enough to realize it was not moving AT ALL, or if it was, incredibly slowly. Mulling over what it might be, a blimp came to mind as it was stationary and very silver, but it was too thin and incredibly high up... I estimate at the height it was, about the size of three 747's in length, slightly pointed ends and in between a blimp and cigar shape... longish, rather than cylindrical like a cigar or bulbous like a blimp. Area spotted.... on the drive from Midland and Kingston rd. along Kingston, to Birchmount rd and Kingston rd. South-South-West over lake Ontario. Because there were no clouds it made it difficult to estimate HOW high up, just that it was very very high. At a stoplight by Birchmount+Kingston, our view was blocked from the object by a tree for about 10 seconds and when we were past IT WAS GONE!! There was no way to miss it, there was NOTHING else in the sky, not even the odd contrail and like i said... it WAS stationary and very hard to miss in an empty sky as it was reflecting bright silver. It left no trace of it being where it was, or where it went and I scanned the sky for a good ten minutes more to no avail. I hope SOMEONE else corroborates this sighting as I would like confirmation other than my stepfather who is rather skeptical of any possibility of things not man-made even though he clearly saw it and remarked how odd it was. Sorry no photos as I do not own a cell phone... would not matter anyways as a telescope or high powered binoculars would have been needed for detail."],"Latitude":"43.778399","Disposition":"Unresolved"}