{"Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","divs":["sighting detailsthis is the first time that i see anything of this nature over the skies. i was standing on the subway outdoor platform for the 7 train in woodside, queens (61 st\\woodside stop) waiting for the train, there were only a few people on a very long subway platform, i was alone. i could see plenty of airplanes taking off and landing, it was a clear, sunny day. suddenly i spotted what appeared to be from a distance an air balloon, but was was unusual is how steady the speed was. the altitude of the object was somewhere between the airplanes that were taking off and the airplanes that were landing, not too high, about the altitude you see helicopters flying at. i would say that it was about 4 miles or less away from la guardia airport. as it got close i closer i could make out a shinny metallic sphere with what appeared to be its own radiance around it coming from the east at moderate speed at a low altitude, at that point it looked like a metallic sphere and not a balloon, the size was comparable to a small airplane but without any wings or visible doors, just a big metallic ball. suddenly the sphere comes to a complete stop for about 10 seconds and then shots back the way it came from at about triple the original speed and looking like it had some kind of invisible force moving it, the speed was extremely even. as the number 7 train arrived i got on it and kept on observing the object as it speed away until i could no longer see it. i'm wondering if you have any reports for the queens, nyc area around that date, until today i never was able to talk to anybody that saw the object or tell what it was, it was extremely unusual. i hope this helps somehow."],"Weather Factors":"None","Longitude":"-73.897206","Object Flight Path":"Undisclosed","Log Number":"US-07132010-0017","map":"<A HREF = \"http://maps.google.com/maps?q=40.752435,+-73.897206(24489)&iwloc=A&hl=en\"> mufon case (24489) map </A>","Sighting Duration":"Undisclosed","Case Number":"24489","files":["/var/www/straped/mufon/html2text/24489.html.txt","/var/www/straped/mufon/org/24489.html"],"Disposition":"Unresolved","Summary":"UFO right next to La Guardia Airport in Woodside, Queens.","trends":["There have been no other sightings in Woodside","This sighting has never been favorited."],"City":"Woodside","Object Features":"Undisclosed","Country":"United States","Region":"New York","Latitude":"40.752435","Date Submitted":"07/13/2010 04:32 UTC","Date of the Event":"03/31/2009 11:30 UTC","Object Shape":"Sphere"}