{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON","Case Number":"24482","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/24482.html.txt","/var/www/straped/mufon/more/24482_submitter_file1__ufoline.jpg","/var/www/straped/mufon/more/24482_submitter_file2__ufotriangle.jpg","/var/www/straped/mufon/more/24482_submitter_file3__phonepic.jpg","/var/www/straped/mufon/org/24482.html"],"Tags":"City","Country":"United States","Disposition":"IFO","Region":"Michigan","divs":["Sighting Details bright red lights ascend in a line and form triangle, disappear and return. LOCATION IN SKY: From below tree line up to the southerly sky. APPEARANCE: Very large, bright, red lights. Last night I got a call from a friend who has never believed in the existence of ufo's. He told me him and his girlfriend had seen a legitmate ufo, not explainable any other way. He described it as bright red lights, ascending from below the treeline and rising up into the sky before forming a triangle and then disappearing. Fifteen minutes later he called me, as they had returned. I went onto my roof and obvserved the lights, facing the south. My girlfriend and my sister were also witnesses on the roof with me. First I saw only a few lights, they slowly ascended vertically until there were at least six (I estimate, I didn't count exact, or get a photograph). They rose slowly and eventually formed a triangle before they slowly dimmed, one at a time, and disappeared. The appearance of the lights was a bright red, and must have been large in size judging by my estimated distance, minimum of 5-10 miles away, possibly further. They rose very slowly, and not in a perfect linear line as a plane would climb as it gained altitude. They seemed to exhibit a fixed x-y position relative to the ground, only increasing their z position (altitude). They formed into a triangle, and then began to disappear. These were not any kind of aircraft I've seen a human have. The detroit metro airport is nearby in that direction, as well as the monroe nuclear facility. My friend witnessed the sighting prior to ours and the when we saw on the roof. Our positions are roughly 4 miles apart at most. I've included digital sketches of the two forms the ufo's took."],"Summary":"Six fiery glowing orbs rise and form triangle, then disappear.","Date Submitted":"07/13/2010 12:02 UTC","Object Shape":"Circle, Fireball, Sphere, Unknown","Latitude":"42.37617","Date of the Event":"06/13/2010 10:30 UTC","City":"Livonia","map":"<A HREF = \"http://maps.google.com/maps?q=42.37617,+-83.34736(24482)&iwloc=A&hl=en\"> mufon case (24482) map </A>","Object Features":"Unknown","trends":["There have been 16 other sightings in Livonia","There was one other sighting in Livonia on or around June 13th 2010","This sighting has never been favorited.",""],"Log Number":"US-07132010-0010","Longitude":"-83.34736","Sighting Duration":"00:05:00"}