{"map":"<A HREF = \"http://maps.google.com/maps?q=37.985578,+-122.023823(24483)&iwloc=A&hl=en\"> mufon case (24483) map </A>","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"Witnessed a star like object floating across the sky from northwest to southeast over the SF Bay Area.","City":"Concord","Source":"MUFON","Latitude":"37.985578","Case Number":"24483","files":["/var/www/straped/mufon/html2text/24483.html.txt","/var/www/straped/mufon/more/24483_submitter_file1__001.JPG","/var/www/straped/mufon/more/24483_submitter_file2__002.JPG","/var/www/straped/mufon/org/24483.html"],"Longitude":"-122.023823","Date Submitted":"07/13/2010 01:23 UTC","Weather Factors":"Unknown","Date of the Event":"07/11/2010 07:05 UTC","Region":"California","Log Number":"US-07132010-0011","Tags":"City","Country":"United States","divs":["sighting detailson the evening of sunday, july 11th at approxiamtely 19:05 hours i was in my backyard enjoying the nice evening with my wife and young daughter. my 20 month old loves planes, and was oogling a jet flying over head. i joined her in her oogling when i noticed this bright star in the early evening sky. this time of night was too early for a star\\planet to appear so i began to observe it for further tendancies. the object was high in the sky so no great details are visible. i did point it out to my wife for concurrence. not knowing what the object was peaked my curiosity, and as i watched it i noticed it was slowly floating from the north to the south. the intensity of the white light being given off by the object ebbed and increased, and occasionally shown a bright orange, similar to flame. however no smoke was present. upon seeing the orange flame like color my curiosity really peaked and i wished i had binoculars. i then thought of my camera and took two fairly poor quality photo's (see attached) hoping through the zoom i might gain some details. as you see in the photo's not much is determinable. eventually, the object reached a point with which it had drifted beyond my vision. i suspect it was a ballon but it seemed too large to be a general group of ballons, and too small to be a high altitude ballon. i don't know who to contact to find out what, if anything, was in the area at this time and day."],"trends":["There have been 20 other sightings in Concord","There were no other sightings in Concord on or around July 11th 2010","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other","Disposition":"IFO"}