{"Object Features":"None","Date of the Event":"07/12/2010 12:00 UTC","Sighting Duration":"Undisclosed","Summary":"Pics captured as object flew above my house.","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown","Latitude":"37.960108","Longitude":"-120.414945","files":["/var/www/straped/mufon/html2text/24487.html.txt","/var/www/straped/mufon/more/24487_submitter_file1__P7120045a123z.jpg","/var/www/straped/mufon/more/24487_submitter_file2__P7120061abc.jpg","/var/www/straped/mufon/more/24487_submitter_file3__P7120060abc.jpg","/var/www/straped/mufon/org/24487.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.960108,+-120.414945(24487)&iwloc=A&hl=en\"> mufon case (24487) map </A>","Tags":"City","trends":["There have been 4 other sightings in Jamestown","There were no other sightings in Jamestown on or around July 12th 2010","This sighting has never been favorited.",""],"Object Shape":"Boomerang, Bullet, Missile, Circle, Fireball, Flash, Oval, Sphere, Square, Rectagular, Star-like","Log Number":"US-07132010-0015","Date Submitted":"07/13/2010 02:31 UTC","Region":"California","Case Number":"24487","Disposition":"Unknown","City":"Jamestown","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path,Path with directional change","divs":["Sighting DetailsI submitted a compilation of pics yesterday, although the video with what i felt were the best captures didn't upload. The system saying that a virus was detected, which is odd in and of itself. I am submitting these pics from last night. My camera is an old digital olympus C-2100 ultra zoom. 2.1 mp at 10X optical zoom. AS each pic is cropped the clarity wanes a bit. The center object in these pics as I observe them (using a magnifying glass also) appears like greys to me. Could very well be an overactive imagination, but I don't think so. To the observer on the ground at the time of taking these pics this appears as the lights of an aircraft flying through the sky. Complete with sound and all but the lighting patterns are not typical of what i understand about aircraft lighting. Also this is a nightly occurrence over my home. Thanks for looking. P.S. I have over 2000 still pics of this high strangeness all captured from my front yard and am willing to get them to whomever may want them for benefit of figuring out what they are Also as opposed to looking like a materially made vehicle they appear holographic or light based the the ground observer. As the pics are developed some density seems to be at the core of each image"],"Country":"United States"}