{"files":["/var/www/straped/mufon/html2text/2449.html.txt","/var/www/straped/mufon/org/2449.html"],"Date of the Event":"07/23/2003 10:35 UTC","Log Number":"","City":"Cottage Grove","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Sighting Duration":"00:10:00","divs":["Sighting DetailsI was outside watching the stars, lying on the hood of my dad92s car in the driveway. I was talking to a friend on the phone at the time. Isaw a satellite traveling northward across the sky. Later, I thought I wasanother satellite. This observation was reached by the luminosity of the objectand it rate and direction of its travel. The object appeared as one bright,whiteyellow ball of light. Having lived under busy commercial air routes for myentire life, and being an amateur aircraft expert, I readily identified theobject as not being commercial air traffic. The object was traveling in anEastern direction, coming from the West. Suddenly the object stopped. Itstarted to move again, but on a different course. The object was soon almostdirectly overhead. As the object was overhead, it rapidly flew in circles,zigzag patterns, and hovered. During the aerobatics, I noticed that the objecthad a hazy halo surrounding it and it left a short, hazy trail behind it as itmaneuvered. After a few minutes of said displays, the object started movingrapidly north. Suddenly reversing directions, the object began travelingsouthward. It was at this time that I noticed the object was not one whitelight, but three distinct lights composing one object, or very tight formation. The lights were colored green, red, and white. These are the colors used oncommercial aircraft, but the did not appear in the correct configuration to besuch an aircraft. As the object sped southward toward the horizon, it stoppedbriefly. At this time, the object split into three different white lights in atriangle formation. As soon as the object had completed this transformation, itdisappeared at incredible speed to the Southeast. From the high altitude andspeed the object was traveling, I knew that it was not a helicopter orcommercial airplane. By the aerobatics that I saw, I also knew that it was nota fighter jet, or either of the previously mentioned types of aircraft. I amconfident in this conclusion because I have been an aviation enthusiast for mostof my life. I have observed all type of aircraft, military and civilian. Ihave lived under major air routes for my entire life and I consider myself agifted aircraft spotter."],"Weather Factors":"Unknown","Case Number":"2449","Longitude":"-92.943822","Date Submitted":"07/23/2003 10:35 UTC","Region":"Minnesota","Object Flight Path":"Straight-line path","Latitude":"44.827745","trends":["There has been one other sighting in Cottage Grove","There were no other sightings in Cottage Grove on or around July 23rd 2003"],"Disposition":"Unknown","Tags":"City","Object Shape":"Other","Country":"United States","Summary":"Strange light display over suburban Minnesota","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.827745,+-92.943822(2449)&iwloc=A&hl=en\"> mufon case (2449) map </A>"}