{"trends":["There have been 4 other sightings in Anderson","There were no other sightings in Anderson on or around July 6th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path,Path then hovering","City":"Anderson","Viewing Distance":"501 Feet - 1 Mile","Latitude":"34.505339","Longitude":"-82.644333","Source":"MUFON","Log Number":"US-07132010-0023","Object Shape":"Sphere, Square, Rectagular, Triangle","divs":["sighting detailsafter looking on-line: gamma mind technique & remote viewing, went outside;was kinda tingling(awareness), looked up and saw an orange round light approaching, it stopped, i looked down just a second, looked back up, it was gone. figured it was plane with landing lights, and checked if it was headed away( should've seen red, green and strobe lights), nothing. then noticed ( around 9:30 pm) two white lights (brighter than stars)that were to the sse from me and at about 40\\45 degrees from horizion, that were too level; and were blinking as if signaling each othet. so went and got my camera(kodak easyshare z612) and tripod, set it up and put it on video mode, did 1st. filming, then did 2nd. video( one that i'm sending, then made 3rd. one. after start video,zoomed in and was astonished to see what i was seeing. on 2nd. vid, went to get wife to confirm what i was seeing. as i was away lights seemed to close distance by about half and 'nosed down'.?the left light seemed to blink more then the right one. i thought that it was just a rectangle shape, but after watching vid. seemed that it was 2 tr3b's(black triangle)sitting beside each other( seemed like it was watching me)! on video, then noticed red lights in 'back' of craft(s).also halfway into video a plane files into view between lights and my postion. made last vid.(3rd.) just a few seconds long and had to get ready for work, so went inside and downloaded videos into computer. was amazed when i checked it out( had not seen red lights with eyes outside), also did not know it had moved closer by half,and 'nosed down'. a few days before was taking pics of clouds and found a black triangle(blurred as if moving very fast), in one picture. in 2007, my wife took a pic of very intense lighting storm and upon looking on computer, there was disc with lights around rim about 1\\3 from top of an oak tree at the edge of our field, as if it was 'climbing 'up nd out of field( it was about 20 to 30 ft in diameter. also have a pic of what looks like a 'portal'(slide zone), that looks like a 'compass'(4 points,north, south, east, west) somtime in 2007."],"Date Submitted":"07/13/2010 09:07 UTC","Tags":"City","Disposition":"Unknown","Date of the Event":"07/06/2010 09:30 UTC","Sighting Duration":"Undisclosed","Object Features":"None","files":["/var/www/straped/mufon/html2text/24495.html.txt","/var/www/straped/mufon/org/24495.html"],"Weather Factors":"None","Region":"South Carolina","Country":"United States","Summary":"Saw two white lights (too level) blinking to each other.","Case Number":"24495","map":"<A HREF = \"http://maps.google.com/maps?q=34.505339,+-82.644333(24495)&iwloc=A&hl=en\"> mufon case (24495) map </A>"}