{"Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering,Other","Tags":"City","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/24499.html.txt","/var/www/straped/mufon/org/24499.html"],"Summary":"18-20 'craft seen over Central Indiana.","trends":["There have been 61 other sightings in Kokomo","There was one other sighting in Kokomo on or around July 13th 2010"],"Longitude":"-86.126403","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"40.488297","Log Number":"US-07142010-0002","Weather Factors":"Unknown","City":"Kokomo","Sighting Duration":"Undisclosed","Case Number":"24499","Disposition":"Insufficient Data","Date of the Event":"07/13/2010 10:00 UTC","Date Submitted":"07/14/2010 12:28 UTC","Object Shape":"Circle, Oval","Source":"MUFON","divs":["Sighting DetailsAt 10:15 p.m. EST, 3 of us were in a backyard and noticed a bright white light flying away from us going south. It would get dimmer, then get noticeably brighter. It did this several times and then got dimmer and disappeared right before our eyes. It didn't fly into clouds, it didn't go behind trees, it just vanished. Later,at approximately, 10:49 p.m. EST(I looked). At first we saw 2 craft coming in opposite directions, then flew out of sight. They had multiple, different colored lights that would blink in a pattern never before witnessed. Lights at all four ends or sides of the craft would blink, then a line of lights across the middle would blink, then light up all at once, constantly changing patterns. They were red, blue, white, orange, and green. There was no sound at all. A short while later, we saw three coming in from different directions. One flew over us, then went into full reverse, then started going up as if ascending in the atmosphere. It ascended, getting smaller and smaller, until it was out of sight. The other two flew in close proximity to each other. Flying in opposite directions, but came very close to each other, closer than I've ever seen aircraft or planes fly over central Indiana and I'm 42 years old. After this sighting, we saw craft all throughout the rest of our time outside. Sometimes we would see one, sometimes two, usually two, but only saw three at once that one time. All together, I would say we saw between 18-20 craft. Sometimes they would be low, sometimes so high you could barely see them. They would sometimes fly fast, sometimes slow. There was no rhyme or reason to their flight pattern or the pattern of the blinking lights, however, the one that ascended did blink in a more steadier pattern than the others. This started @ 10:49 p.m. EST until we didn't see any for awhile and went into the house at @ 12:00 p.m. EST."],"Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=40.488297,+-86.126403(24499)&iwloc=A&hl=en\"> mufon case (24499) map </A>"}