{"Latitude":"39.016007","Weather Factors":"Unknown","Date of the Event":"07/04/2010 09:50 UTC","Longitude":"-94.460884","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24492.html.txt","/var/www/straped/mufon/org/24492.html"],"Object Features":"Undisclosed","Disposition":"Hoax","Log Number":"US-07132010-0020","Country":"United States","Summary":"15 unknown craft in all observed by three people at the same time.","map":"<A HREF = \"http://maps.google.com/maps?q=39.016007,+-94.460884(24492)&iwloc=A&hl=en\"> mufon case (24492) map </A>","Viewing Distance":"Unknown","Object Shape":"Boomerang, Circle","Region":"Missouri","Case Number":"24492","City":"Raytown","trends":["There have been 15 other sightings in Raytown","There were 2 other sightings in Raytown on or around July 4th 2010"],"divs":["Sighting DetailsUnfortunaly I have always seen the craft throughout my life starting at age five, then twentyfive and now at 55. What is strange is that I am now being allowed to view them up close with other witnesses, and thank God for that because everyone that I tell thinks that I'm crazy. I however must admit that I am in fact a bit obcessive. Let me clarify that statement by stating that once I notice or get involved in something, it become difficult to stop it. I think that some might call that obcessive compulsive. but this condition can reap some beinfits or rewards. When I first noticed these objects in the sky I couldn't stop looking for them. I have now seen so many that it has become unimportant to report them. which is why I am writing this. I want the world to know about them, but because I believe that they pose a threat, but because I think that most people find them extremely interesting to observe. It becomes overwhelming. They have now begun to come to my home. my mother who temporarily lives with me saw one of these circular object in the front yard a day ago. She stated that at first when she noticed it, it was glowing and stationary moving only side to side and up and down in small bits. And then suddenly without warning it disappeared. I explained that I have seen the object that she described and that they seemed to exhibit simular characteristics. and that what she described was normal. I have seen some of them up close (within 100 feet) and that they don't seem to pose a threat at this time. They seem to be as curious about us as we are about them. so far they seem to be trying to establish a rudimentary launguage with me. So I am trying to build trust with the ones that are bold and courageous enough to come close. My mother thinks that this is risky behavior, but I feel that it is worth the risk, Mufon wish me luck. I have several videos of these object and a probe like object which I will not submit to you guys. But I want you to know that They are out there!"],"Tags":"City","Date Submitted":"07/13/2010 07:48 UTC"}