{"Log Number":"US-07132010-0021","Viewing Distance":"Unknown","Region":"New Jersey","Tags":"City","Case Number":"24493","Disposition":"Insufficient Data","Source":"MUFON","Date of the Event":"10/10/2004 02:50 UTC","Latitude":"41.088611","Country":"United States","Date Submitted":"07/13/2010 08:48 UTC","trends":["There have been 3 other sightings in Mahwah","There were no other sightings in Mahwah on or around October 10th 2004"],"Object Shape":"Triangle","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"Triangle shaped object with blue white and red lights on the bottom side, same as the triangle, traveling 30 to 40 mph towards the top and over the Sheraton Hotel. 50 feet above my hotel window at 2:50am on 10/10/04.","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/24493.html.txt","/var/www/straped/mufon/org/24493.html"],"divs":["Sighting DetailsI was staying at the Sheraton Hotel in Mahwah, NJ on the 18th floor on Oct. 9th through the Oct. 10th 2004. Being in a stange room, I had a hard time falling asleep, constantly watching the clock. At 2:50am Oct. 10, 2004, I noticed a light through my large bay like room window. I thought it was a very tall building with a blinking light for the airplanes passing over head. But, as I was looking at this tall building light, it began to move towards my direction, at a slow pace, maybe 30 to 40 miles per hour. As it came closer I thought it was a helicopter or a small plane, but then I noticed the triangle shape with red, white and blue lights blinking on the bottom side, the same trianguler pattern. I became nervous and bewildered. It was as if it saw me watching because it went directly over the hotel only some 50 to 60 feet above my hotel window. I saw it plain as as day and did not sleep for the rest of the night. I have a photographic memory of the object in my memory and I will never forget it for as long as I live. Anyone I told, simply laughed and changed the subject. But I tell you....on the my life......this is a true story. God is my witness."],"Weather Factors":"Unknown","City":"Mahwah","Longitude":"-74.144167","map":"<A HREF = \"http://maps.google.com/maps?q=41.088611,+-74.144167(24493)&iwloc=A&hl=en\"> mufon case (24493) map </A>"}