{"Disposition":"Hoax","Region":"Missouri","Case Number":"24501","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Undisclosed","Latitude":"38.632782","files":["/var/www/straped/mufon/html2text/24501.html.txt","/var/www/straped/mufon/more/24501_submitter_file1__2010071219140001.jpg","/var/www/straped/mufon/org/24501.html"],"Date of the Event":"07/12/2010 07:14 UTC","Longitude":"-90.194844","Tags":"City","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around July 12th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","City":"St Louis","divs":["sighting detailsin st. louis at 7:14 pm i was sitting with my back to a window having a conversation with *(name deleted--sgonzalez\\cms), 25 years old. his face suddenly changed to a look of surprise while talking with me and sat back and said \"what was that?\" he described seeing a white object, possibly a white sphere with a trailing tail, zip out diagonally from behind a tree out the window behind me and shoot up into the sky. he doesn't think it was a firework because it moved much too fast, and was too \"perfect\" in its shape and tail and trajectory. he thought it could have been some sort of \"craft,\" but knows it was not a conventional craft. it was enough for him to say that it was the first time he's ever seen an unidentified flying object, by definition. a facsimiie is attached to this report, made with a picture taken within 10 minutes of the actual sighting, so the picture's conditions are essentially as they were when *(name deleted--sgonzalez\\cms) saw the object over my right shoulder out the window. ironically, *(name deleted--sgonzalez\\cms) mother saw what she describes as the first unidentied flying object she ever saw while on the way over to my house last september, 2009. also in that same month, about two weeks later, she and i heard and felt an explosion outside my home while inside, as did my neighbors in their homes. my next door neighbors said they saw a large white ball of light that appeared over the street for the duration of the explosion sound that was felt and heard by us all."],"Summary":"White teardrop appears to zip from ground to sky.","map":"<A HREF = \"http://maps.google.com/maps?q=38.632782,+-90.194844(24501)&iwloc=A&hl=en\"> mufon case (24501) map </A>","Log Number":"US-07142010-0004","Weather Factors":"Unknown","Object Shape":"Teardrop","Date Submitted":"07/14/2010 12:46 UTC","Sighting Duration":"00:00:01"}