{"Latitude":"42.285932","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.285932,+-87.831996(24500)&iwloc=A&hl=en\"> mufon case (24500) map </A>","Object Flight Path":"Undisclosed","City":"Lake Bluff","trends":["There have been 3 other sightings in Lake Bluff","There were no other sightings in Lake Bluff on or around July 13th 2010"],"Case Number":"24500","files":["/var/www/straped/mufon/html2text/24500.html.txt","/var/www/straped/mufon/org/24500.html"],"Region":"Illinois","Object Features":"Undisclosed","Date Submitted":"07/14/2010 12:40 UTC","divs":["Sighting DetailsMy girlfriend and I were talking when I realized it was 9pm. We had a sighting several nights ago at 9pm and have been trying to head outside every night at that time and watch the skies. We had missed it the last two nights. Tonight, we stepped outside and within a minute a bright white light showed up, northeast of my position. Above it, a Plane was at an incline with FAA lights blinking and I could see its wings clearly. I grabbed my binoculars and watched the object fly across the sky at a slow, steady pace. It had no blinking lights and the object itself was so illuminated that you couldn't see it's shape or any detail. It looked like Venus does when it's closest to earth. Due to the path that it took, I saw at least 180 degrees of the object and yet I saw no details or edges. The intensity of the light stayed consistent as it flew over the back of the building behind my parking lot and out of my vision. The whole sighting lasted about 3 minutes. I have had numerous sightings from the same location and this is by far the most intriguing. The pilot of that plane HAD to see something and I watched about a dozen more planes fly through over the next several minutes. I'm located close enough to several airports (O'hare, Midway, Milwaukee) to see some of their traffic and am an avid sky watcher. I know what a plane looks like, what helicopters look like, even what Potentially Hazardous Asteroids look like as they burn up in our atmosphere... This was different. I was very excited during this sighting and have had a hard time calming down. It was as if we walked outside at the exact right moment to have that experience."],"Object Shape":"Circle, Disc, Oval","Log Number":"US-07142010-0003","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Longitude":"-87.831996","Viewing Distance":"Unknown","Summary":"Bright white light flew NW-SE slowly. Watched through binoculars.","Weather Factors":"Unknown","Date of the Event":"07/13/2010 12:00 UTC","Disposition":"Unresolved"}