{"Tags":"City","trends":["There have been 5 other sightings in Hinesville","There were no other sightings in Hinesville on or around July 13th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=31.848237,+-81.589095(24519)&iwloc=A&hl=en\"> mufon case (24519) map </A>","Log Number":"US-07142010-0022","Date of the Event":"07/13/2010 10:10 UTC","Viewing Distance":"101-500 Feet","Longitude":"-81.589095","Disposition":"Insufficient Data","Date Submitted":"07/14/2010 09:32 UTC","Object Features":"Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24519.html.txt","/var/www/straped/mufon/more/24519_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/24519.html"],"City":"Hinesville","Country":"United States","Latitude":"31.848237","Weather Factors":"None","Summary":"Large white light traveling slowly and very low and then took off upward.","Sighting Duration":"00:01:05","Case Number":"24519","Object Shape":"Sphere","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","divs":["Sighting DetailsIt was 10:00 pm on July, 13 2010. Me and my wife went out side to look at the stars again just before we get ready for bed. to the west we saw an air plane flying south east. after watching it for about 4 minutes i had noticed a ball of white light heading due south from the north around the north star (Polaris) at first glance since it was so low and bright i thought it was a helicopter but there was no noise. and it looked like it was only about 300ft off of the ground and was moving very slowy. i would say it was going about 12 mph almost like it was floating. being completely amazed i of course forgot to grab my camera but as it flew over our house i got a good look at it. it was about 200 ft in diameter and was emitting a white light from its spherical center. it had four rotating rings around it that were definately matalic looking and were roatating pretty fast. after 1 minute and 5 seconds it shot up wards into the sky until it was a dim ball of light and then disappeared completely. my wife quickly checked the time and it wass 10:10 pm. so it would have appeared at 10:09.Its location was 31 degrees north by 81 degrees west. i have provided a ruff and quick sketch of the object from what i could see."],"Region":"Georgia"}