{"Object Shape":"Diamond","City":"Portland","Date of the Event":"02/20/2010 04:22 UTC","Tags":"City","divs":["Sighting DetailsReturning from a nightime fishing trip in my truck, my wife and I noticed a strange, yet familiar collection of pulsing lights above our neighborhood. My wife was dozing in the passenger seat, but I was wide awake from the driving and made sure to get a good look at the craft. I was approaching my street and coming down from the sky, hovering near our house was the UFO. It appeared to fly upward upon our approach and I drove right below it at about 500 ft as it flew north. As it went over us I made a point to look with my head out the window and made note of as many details as possible. The description is included as a sketch attachment. The colored design on the belly was neon-like illuminated and pulsed the exact colors that I often noted on other nights watching what i called \"tricky stars\". The ones 30 degrees from the horizon that didnt follow the path of the night sky... The blinking ufo ultimately took its position in the night sky with the other stars... PLEASE USE THIS REPORT AS THE PRIMARY....I ACCIDENTALLY SENT THE FIRST PREMATURELY."],"Object Features":"Undisclosed","Latitude":"27.877246","Summary":"A pulsing red, blue, white, and yellow object briefly hovered very low near the house then flew up into the stars and remained stationary.","Sighting Duration":"Undisclosed","Log Number":"US-07142010-0018","Region":"Texas","Weather Factors":"Unknown","Viewing Distance":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.877246,+-97.32388(24515)&iwloc=A&hl=en\"> mufon case (24515) map </A>","files":["/var/www/straped/mufon/html2text/24515.html.txt","/var/www/straped/mufon/more/24515_submitter_file1__ufoohio.JPG","/var/www/straped/mufon/org/24515.html"],"Country":"United States","Date Submitted":"07/14/2010 06:05 UTC","Case Number":"24515","trends":["There have been no other sightings in Portland","This sighting has never been favorited."],"Longitude":"-97.32388","Source":"MUFON","Object Flight Path":"Undisclosed"}