{"Longitude":"-109.54641","Region":"Utah","Latitude":"38.578356","Weather Factors":"Unknown","Case Number":"24516","Tags":"City","Summary":"Bright sphere moving from north to south.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was about 9:40pm MDT when I stepped out on my back porch for a cigarette when I noticed a bright light through the slats of the deck above me. My first thoughts was that it was a star because it was bright and to big for an airplane. I noticed it was moving because it was appearing and disappearing through the slats on the deck. I then climbed the steps to ground level and knew for sure this big, bright orb or sphere was certainly moving and at a good clip. I ran inside for my binoculars(yes the batteries were dead in my digital camera) and ran back out and managed to focus on the object before it disappeared behind the clouds. The object was a very bright orb or sphere that was very large in size. I noticed no tail like those on meteorites or \"shooting stars\". One other thing I did notice was there was a plane traveling west to east at the same time the object was moving from north to south. The plane had to have seen it because the plane did cross its path very shortly after the object moved into the clouds. My sighting was very similar to the one described in case #: 24512"],"City":"Moab","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/24516.html.txt","/var/www/straped/mufon/org/24516.html"],"Date of the Event":"07/13/2010 09:40 UTC","Log Number":"US-07142010-0019","Object Flight Path":"Straight-line path","Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=38.578356,+-109.54641(24516)&iwloc=A&hl=en\"> mufon case (24516) map </A>","Date Submitted":"07/14/2010 07:08 UTC","Object Features":"None","trends":["There have been 13 other sightings in Moab","There were no other sightings in Moab on or around July 13th 2010"]}