{"Object Shape":"Star-like","Tags":"City","City":"Buena Vista","Date of the Event":"07/13/2010 09:50 UTC","Viewing Distance":"Unknown","Log Number":"US-07142010-0013","Country":"United States","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Region":"Colorado","Longitude":"-106.124879","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=38.851778,+-106.124879(24510)&iwloc=A&hl=en\"> mufon case (24510) map </A>","Latitude":"38.851778","trends":["There have been 2 other sightings in Buena Vista","There were no other sightings in Buena Vista on or around July 13th 2010"],"divs":["Sighting DetailsI take my dog out about 10PM every nigh. A month ago I took her out and was looking up and saw a star-like object and it was moving. I thought it was a satellite but it was moving faster. When it made a perfect 90 degree turn it was obvious it was military or something else. The turn radius was not a \"standard rate turn\" as defined by the FAA. I watched it go out of site. Then another came and did the same maneuver. Those sightings were not reported to MUFON. I wasn't sure if they were military or not. Last night at I took my dog out early. When I cam back in and laid down I saw an object out my window. At first I thought of Jupiter. But it was to far north. Jupiter comes up in the SE. It also was not a bright as Jupiter. The object was 30 degrees off the horizon and N 60 degrees. As it was sitting still I guessed it's distance in relation to the mountains to be about 30 miles. I got my binoculars and then it started to move north and dim. I tracked it for about 15 seconds as it dimmed and went out of site. There were no aircraft lighting. This was not a conventional airplane. They don't sit still! It was not a helicopter. Helicopters do not accelerate that quickly. This object was like the sighting in Norway which has the movie attached. Reported from N38.58.169 W106.13.166"],"Summary":"Very bright then dimmed when it began to move.","Date Submitted":"07/14/2010 11:48 UTC","files":["/var/www/straped/mufon/html2text/24510.html.txt","/var/www/straped/mufon/org/24510.html"],"Case Number":"24510"}