{"Date of the Event":"05/15/2003 10:30 UTC","City":"Fort Walton Beach","Summary":"Flying Police Car or UFO","Tags":"City","Country":"United States","Weather Factors":"Fog","Object Shape":"Oval","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI am a licensed light airplane pilot. I was standing in my driveway, my backpropped against my van on the night of May 15, 2003 watching the progress of thelunar eclipse through binoculars. A shape I at first thought had wings andflashing a row of extremely bright red, blue, green, and white lights across itsfront surface flew into my binoculars field of view. I had never seen anaircraft display the lights I saw on this thing. I wanted to believe it was ahelicopter or airplane, both very common around here, but the thing was notlighted like the military aircraft that usually orbit Hurlbert Field, a USAFinstallation with a North-South oriented runway about three miles to the west ofmy home. Aircraft display a green position light on the starboard wing tip, ared position light on the port wing tip and a white lamp on the tail. Sometimesthere are flashing red anti-collision lights on the upper and lower fuselagesurfaces. Sometimes the machine might display flashing blue-white xenon strobelights on the wing tips and tail, but this thing displayed an apparent row oftightly grouped, rectangular, multi-colored lights along its leading edge. Mostunusual.All the lights flashed on simultaneously in three quick pulses that repeatedafter about two beats. The object moved steadily from southeast to southwest atabout 50 to 75 miles an hour.It had passed below the moon, which was then in mid-eclipse, and I tracked itwith binoculars for about four to six seconds. Then I watched it move alongwithout the glasses. At first I thought it was an airplane. It was low becauseit passed in front of me from left to right and then disappeared from viewbehind a nearby horizon of housetops and trees in the west.But the strangest thing about it was that it made absolutely no sound, none,nothing. Not a hum, not a buzz, not a whine, roar or whistle, not anything. Itwas perfectly silent.I judge it to have been traveling at a 15 to 20 degree slant from me and about12-mile distant at an altitude of 500 to 800 feet. As it passed, the coloredlights flashing on it were powerful enough to be reflected and diffused by themoisture in the air. The light also dimly reflected off the pavement andhouses. It was very low. It moved in a straight line and disappeared behindroof tops and trees in the west. It had one small, steady, white light showingon"],"Latitude":"30.426801","files":["/var/www/straped/mufon/html2text/2451.html.txt","/var/www/straped/mufon/org/2451.html"],"Object Features":"Wings","Longitude":"-86.614981","Log Number":"","Case Number":"2451","trends":["There have been 24 other sightings in Fort Walton Beach","There were no other sightings in Fort Walton Beach on or around May 15th 2003"],"Object Flight Path":"Straight-line path","Sighting Duration":"00:00:59","Region":"Florida","Date Submitted":"05/15/2003 10:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.426801,+-86.614981(2451)&iwloc=A&hl=en\"> mufon case (2451) map </A>","Disposition":"Unresolved"}