{"Sighting Duration":"Undisclosed","Date Submitted":"07/14/2010 09:14 UTC","Latitude":"44.388873","trends":["There have been 9 other sightings in Cadillac","There were no other sightings in Cadillac on or around July 13th 2010"],"divs":["Sighting DetailsAt about two a.m. Wednesday morning July 13, 2010, my husband and I were laying in bed talking. We have large windows at the foot of our bed. As we chatted I noticed what appeared to be a falling star. Not that there was a falling movement to the object but it appeared to come closer to us. This is the movement that caught my attention and made me get out of bed to take a closer look. Upon closer examination, I noticed the somewhat rapid yet slow zig zag movement of an object in the sky. As the object turned there appeared many lights in a row along the side of the object. I'm not sure of the exact shape of the object but I'm going to say it was triangle with a bit of elongation to it. At first I thought it to be a falling star, then a plane, then a helicopter. However, the longer the object stayed in the sky, I began to realize it couldn't be 'normal' aircraft. I told my husband, he fetched his camera and we walked out onto our deck to look closer. It stayed the same for about twenty minutes. We observed the object while comparing it to the other stars in the sky. We both came to the same realization that this had to be a UFO. We continued to watch the object when, to be honest, I was immediately scared when I realized the object I was looking at couldn't be 'normal' aircraft. I then went into a stage of curiosity followed by worried then by \"I don't want to believe this is really happening\" . It was at this point that I decided it couldn't be anything so I was going to ignore it and I went to bed. Only problem is, I can't stop thinking about what we seen. Thus, my reason for sending you this information."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.388873,+-85.345495(24517)&iwloc=A&hl=en\"> mufon case (24517) map </A>","Disposition":"Unknown","Date of the Event":"07/13/2010 02:00 UTC","Case Number":"24517","Region":"Michigan","Country":"United States","Log Number":"US-07142010-0020","files":["/var/www/straped/mufon/html2text/24517.html.txt","/var/www/straped/mufon/org/24517.html"],"Tags":"City","Source":"MUFON","Summary":"Slow zig zag moving object with strand of lights hovering in sky.","Object Shape":"Bullet, Missile, Triangle, Unknown","City":"Cadillac","Longitude":"-85.345495","Object Features":"Unknown","Weather Factors":"None","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"501 Feet - 1 Mile"}