{"Date of the Event":"07/13/2010 09:10 UTC","Region":"Arkansas","Viewing Distance":"Unknown","Weather Factors":"None","Object Flight Path":"Straight-line path","Object Shape":"Star-like","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24529.html.txt","/var/www/straped/mufon/org/24529.html"],"Date Submitted":"07/15/2010 09:14 UTC","Case Number":"24529","Latitude":"34.50947","Summary":"Starlike object slowly moved across horizon.","Country":"United States","City":"Hot Springs","Log Number":"US-07152010-0004","Sighting Duration":"00:05:00","trends":["There have been 7 other sightings in Hot Springs","There were no other sightings in Hot Springs on or around July 13th 2010"],"Object Features":"Unknown","Disposition":"Unknown","Tags":"City","Longitude":"-93.04919","divs":["Sighting Details I had gotten home from work about an hour earlier. I had eaten a late dinner and had taken a bath. At around 2045 my wife went to bed and about 5 minutes later the dogs started barking and acting up. I stepped outside the back door to smoke a cigarette and check to see if anything was running our cows or raiding the chickens. I didn't see anything out of order, and the dogs stayed in the driveway, instead of chasing anything out of the pasture. The past month we had several bats that would feed over the pond at dusk. While finishing my cigarette I decided to scan the sky to see if I could see any bats before the light faded. In the north east sky I noticed a bright star or planet, low on the horizon, just above the trees that line a ridge that runs in that direction. I then looked up in the sky to see if there were any other stars visible. I remember seeing another star and thinking that it wasn't near as bright as the first star. I then looked back and noticed that the first star had moved from it's initial location. I then noticed that it was slowly moving, almost floating, in a south east direction. It appeared to be one bright light, blue at first, it then turned white and then settled on an orange color. The light did not blink or pulsate. It was definitely not a plane's lights or a shooting star. I could not determine the size, but I did notice that although it was making no noise the dogs continued to act up and bark. I then went inside and woke my wife up and had her come outside. She could also not identify what the object could be. She then turned the air conditioner off, so she could verify that it was making no noise. It then slowly floated in a straight line, with no apparent changes in altitude until it went over the ridge and we lost sight of it. I went inside and looked at my watch, it was 2110. I also noticed that the dogs had settled down after I went back outside to look at the sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.50947,+-93.04919(24529)&iwloc=A&hl=en\"> mufon case (24529) map </A>"}