{"Object Shape":"Circle, Star-like","Tags":"City","Weather Factors":"Windy","Date Submitted":"07/15/2010 12:17 UTC","Longitude":"-93.710249","Country":"United States","files":["/var/www/straped/mufon/html2text/24525.html.txt","/var/www/straped/mufon/org/24525.html"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/14/2010 03:15 UTC","Log Number":"US-07152010-0002","Sighting Duration":"Undisclosed","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.533013,+-93.710249(24525)&iwloc=A&hl=en\"> mufon case (24525) map </A>","Region":"Minnesota","City":"Aitkin","Latitude":"46.533013","Case Number":"24525","Object Features":"None, Unknown","Summary":"White orb like object moving in sky...would get bright and fade.","Source":"MUFON","trends":["There has been one other sighting in Aitkin","There were no other sightings in Aitkin on or around July 14th 2010"],"Object Flight Path":"Hovering then path,Straight-line path","divs":["Sighting Details My family and I were vacationing at our cabin in Aitkin,MN (central MN). During the early morning hours on 07-14-10 I was awakened to a loud thump which I thought was a branch landing on the cabin. I discovered it was the bathroom door slamming from the wind. It was 3:15 am and I was up so I let the dogs outside. The night sky was full of stars like it always is up there. When I looked up in the sky to the southwest I saw a bright object which I first thought might be a star or planet. When the object began to fade and disappear I noticed that the wind would die down. I then saw it appear again and become brighter. When this happened I noticed that the gusts of wind would pick up. The object, what I could only describe as circular or orb like, sat above the tree tops and I thought maybe something was reflecting in the sky. When I moved away from the trees closer to the lake I could see that the object was independent of anything else. It was in the sky and appeared lower than any of the stars around it. The object started to move in almost a side to side motion but straight and not pendulum like. As I stared at it, it probably moved a few yards back and forth and then settled again. At this point I woke up my wife through the bedroom window of the cabin in order to get confirmation of what I was actually seeing. She looked outside the window and told me she saw it and that she also saw it moving. I told her to keep an eye on it while I got my binoculars from my car. When I looked at the object through binoculars I did not notice any other shape around it, only a bright white light. I then noticed that the object started to fade again and disappear with only the stars left behind it. The wind again died down when the object faded. While I continued to look where the object was I noticed that it began to reappear and become brighter again and the wind gusts started up. This time the object moved across the tree tops a short distance and stopped again. I had set up a lawn chair and began watching the object through binoculars as it sat in the sky. My wife joined me and watched it move. When it faded again and the wind stopped she decided that it made her a little too nervous so she went back inside. I then got my wifes cell phone to try and record the object as is reappeared again and the wind picking up. Due to the quality of the phone and camera it didn't show much. The object appeared as a small speck on video and oddly enough looked red. I remained outside for about forty five minutes watching it move back and forth and continue to fade and get brighter. When I went back to bed I could still see the object through the window until I saw it fade away again around 4:05am. Just to note, there were no sounds of helicopters and I am not sure if a drone would produce that much wind while hovering or why one would be there. I am not a skeptic but like to weigh the facts. I have been a LE officer for 14 years and have never seen anything like this. From what I saw in the sky I know it was nothing I have seen before. Just thought I would share the experience. Thanks."]}