{"Object Shape":"Other","Sighting Duration":"00:30:00","Latitude":"45.00475","Longitude":"-92.877777","Log Number":"","Date Submitted":"09/27/1980 08:30 UTC","Date of the Event":"09/27/1980 08:30 UTC","files":["/var/www/straped/mufon/html2text/2452.html.txt","/var/www/straped/mufon/org/2452.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.00475,+-92.877777(2452)&iwloc=A&hl=en\"> mufon case (2452) map </A>","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Other","Viewing Distance":"101-500 Feet","Region":"Minnesota","City":"Lake Elmo","trends":["There have been 4 other sightings in Lake Elmo","There were no other sightings in Lake Elmo on or around September 27th 1980"],"Case Number":"2452","Country":"United States","Object Features":"Undisclosed","divs":["Sighting DetailsUfo encounter with missing timeThis happened about 23 years ago on our way to hudson wisconsin from the eastside of St Paul, I and a friend were travelling east on 94 from the east side ofSt Paul this trip normally takes 30 minutes max it was about 8.00 pm when weleft roccos resturant on the east side to go to hudson harbor resturant to pickup some supplies my friends dad, who owned both places. we were apporx 5 mileseast of st paul when I noticed a light hovering in the sky I said lets get acloser look so me and my freindhe was driving pulled off on a dirt road to thesouth approx 14 mile off the road and stopped we were right under the light itwas about 200-250 feet above the car and we sat there for a while when all of asudden it shot over the highway to the north and when it did this it was so fastthat all we could see was a light trial and then shot back over our car it didthis approx five times shooting around the sky leaving light trails and alwaysreturning back above our car we both just sat there amazed at what was happeningwe could not beleive it.we sat there for approx 10-15 min observing this strangelight in the sky then it shot out and became five lights if you pictured a staron the american flag with its five points there was a light at every point ifyou can picture this with the car in the center. then all of a sudden it becameon light and shot straight up as fast as ever and was gone just leaving a trailof lights as it shot away. well we both decided to get out of there. and go tohudson and pick up our stuff. the strangest thing was yet to come when we gotthere we walked downstairs to the prep kitchen and it was 10.15 pm this was sowierd because this trip is 20-30 min max and we were on the side of the road 15-20 min max well we did not know what happened to the other time it was missing Idonot remember anything more happening to us but there was for sure at least anhour of missing time. giving my self extra for how long ago it happened. I raninto my buddy about six months ao he does not remember anything about it. thisis extremly bizarre because I rememeber it all it makes me think i am a littlecrazy but I know what happened and this was for sure a true event"],"Summary":"UFO WITH MISSING TIME","Tags":"City"}