{"Region":"Georgia","Viewing Distance":"Unknown","Case Number":"24527","files":["/var/www/straped/mufon/html2text/24527.html.txt","/var/www/straped/mufon/org/24527.html"],"Latitude":"31.231293","map":"<A HREF = \"http://maps.google.com/maps?q=31.231293,+-84.210461(24527)&iwloc=A&hl=en\"> mufon case (24527) map </A>","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Camilla","This sighting has never been favorited."],"Source":"MUFON","Summary":"My brother and I were walking to the bus stop and it appeared above the tree line.","Date of the Event":"09/30/1976 07:30 UTC","divs":["Sighting DetailsOn a cool I think fall day my younger brother and I were walking down our lane to the bus stop. I say lane because our house sat back down a dirt lane from the main street.As we rounded a curve in the road I felt that something was behind us up high...it wasn't that I heard it, it was a feeling as if I could feel a pulsing,humm. I turned and looked up at the tree, which was a huge grand Oak tree. An there was a thing that was spinning on the outer edge but the higher center part seem to be still. It was shiney, but I was looking trying to understand what I was seeing. I was looking for wires something to make what I saw make sense as to how could this just be spinning in mid-air standing still.I didn't see anything...I heard a voice say to me in my head \"Come with us,\" I just said in my head \"No,I have to stay with my brother,\" I could not see leaving him down that road alone. I was not afraid or anything it was very surereal. It started to move away...it seem to bend the light because it started to close in on itself and look like the sky and clouds as it moved away not far from where it hovered and I could tell it just seem to take off real fast as it changed to look like the sky. My brother and I just turned around and started walking to catch the bus, I looked back I think once and pulled him closer so they wouldn't try to come back and take him away. WE NEVER TALKED ABOUT THIS ALL THESE 30 PLUS YEARS, I DIDN'T RUN TO THE BUS DIVER AND TELL HIM.I NEVER SAID ONE WORD TO MY PARENTS. But this December of 2008,I was having to have major surgery and my family came to ******* because things didn't look good for me.The only person I ever told my story to was my then 15yr.old son. When my family and I were all sitting in my den he said to me \"Mom, ask Uncle **** now about it.\"I felt ashamed...what if this was something I made up in my head...then my brother said to me \"I KNOW WHAT YOU WANT TO ASK ME...DID WE SEE THAT ...,\" I STARTED TO CRY ALL THESE YEARS I THOUGHT THIS WAS SOMETHING VERY CRAZY SOME HOW I MADE UP IN MY HEAD AND MY EYES HAD PLAYED A SICK JOKE ON ME...BUT YOU CAN'T TELL PEOPLE YOU SAW SOMETHING LIKE THIS...NO WAY IN HELL THIS WOULD BE BELIEVED........I ASKED MY BROTHER TO JUST TELL ME WHAT HE REMEMBERED IT IS JUST THE WAY I SAW IT COMPLETELY. I SAW A METAL SHINEY THING THAT SEEM TO BEND LIGHT IT WAS OVAL AND SEEM TO GET LARGER AFTER IT STOOD STILL WITH JUST THE OUTER PORTION SPINNING REALLY FAST.IT SEEM TO GET SMALLER AND BEND THE LIGHT TO LOOK LIKE THE SKY AND CLOUDS JUST LIKE A CAMILLION WOULD. A LOT OF PEOPLE SEEM TO THINK THESE EVENTS THAT ARE REPORTED ARE JUST BY CRAZY WHITE PEOPLE LOOKING FOR ATTENTION, BUT I'M A SANE BLACK WOMAN AND THIS HAPPENED, WHY WE SAW IT, WHY THEY WANTED ME, I HAVE NO CLUE BUT IT DID HAPPENED AND I WILL TAKE A LIE DETECTOR TEST TO PROVE IT TO ANYONE,THIS FACT WILL GO WITH ME TO MY GRAVE...."],"Country":"United States","Log Number":"US-07152010-0004","Date Submitted":"07/15/2010 01:08 UTC","Sighting Duration":"Undisclosed","Longitude":"-84.210461","Object Features":"Undisclosed","Object Shape":"Disc, Oval","Weather Factors":"Unknown","Disposition":"Insufficient Data","City":"Camilla","Tags":"City"}