{"map":"<A HREF = \"http://maps.google.com/maps?q=34.174821,+-86.843612(24533)&iwloc=A&hl=en\"> mufon case (24533) map </A>","Disposition":"Insufficient Data","City":"Cullman","Date of the Event":"07/14/2010 09:30 UTC","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"07/15/2010 12:13 UTC","Object Features":"Unknown","Summary":"1 large round object with multi color fast strobe lights and 3 smaller objects moving at incredible speed with 2 red lights.","divs":["Sighting DetailsLast night I took my dog out for a walk as usual.I was looking up at the stars like I always do here in the country because there are no street lights to interfere.In the south I saw a very large object moving north. It was round and had several multi colored fast blinking lights.I told my room mate to come out and look at this.We could not believe what we were seeing.I tried to find a logical excuse for it but I could not.I see planes here all the time and am very familiar with how they look at night. It was not a plane,meteor,satellite or anything even remotely resembling anything like that.As it got closer we noticed it was making a humming sound.When it was in the northern sky suddenly there was another object with two bright red lights moving at an extreme speed toward it from the west.Then another object with two red lights coming from the east moving at an unbelievable speed went past it and made an abrupt u-turn and went towards the large round one.By this time the round one was not visible because of a tree.AT this time another red one or possible one of the other two came from the east and suddenly disappeared in the west.I have never seen anything like this in my life. Hopefully if I ever see it again I'll have my camera ready."],"Object Shape":"Circle, Unknown","Longitude":"-86.843612","Latitude":"34.174821","Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/24533.html.txt","/var/www/straped/mufon/org/24533.html"],"Source":"MUFON","Country":"United States","Region":"Alabama","trends":["There have been 2 other sightings in Cullman","There were no other sightings in Cullman on or around July 14th 2010"],"Log Number":"US-07152010-0009","Case Number":"24533","Weather Factors":"Unknown"}