{"Tags":"City","Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Weather Factors":"Unknown","Date Submitted":"07/15/2010 11:33 UTC","files":["/var/www/straped/mufon/html2text/24548.html.txt","/var/www/straped/mufon/org/24548.html"],"City":"Mackinaw City","Date of the Event":"07/15/2010 10:14 UTC","divs":["sighting detailsdriving n\\e to local iga to pick up ice cream. noticed two glowing red\\orange objects in the sky over the mackinaw bridge. cloud cover was approx. 20,000 with sporadic patches. no discernible wind speed. the objects were approx. 8-10,000 feet up. i pulled off the side of the road in front of the recreation center and exited the van to observe. cell phone camera yielded no detail. for approx. 5 minutes i watched the objects at even length intervals from one another. they began to rotate counter clockwise at a n\\w angle. shifted appro. 60 degrees. the forward object began to dwindle in size disappearing behind what i thought might be a small cloud. i momentarily lost track of them. entered my van again and drove to the fort parking lot at the beach and at the base of the mackinaw bridge to observe over the water without obstruction. i picked up one of the objects again, larger and brighter than before at a lower altitude, perhaps 5-6,000 feet. it was hovering over head for approx. 2 minutes and began to move s\\w with a finger guided pace of approx. 12 inches in 12 seconds or 30 degrees. it began to ascend at an angle and rapidly accelerated upward and out of sight. there was no sound."],"Viewing Distance":"Over One Mile","trends":["There have been 6 other sightings in Mackinaw City","There were no other sightings in Mackinaw City on or around July 15th 2010"],"Disposition":"Unknown","Log Number":"US-07152010-0024","Country":"United States","Case Number":"24548","Region":"Michigan","Sighting Duration":"Undisclosed","Summary":"2 red/orange globes moving in tandem over the Mackinaw Bridge either separating in oposing directions or uniting into one.","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=45.782319,+-84.719546(24548)&iwloc=A&hl=en\"> mufon case (24548) map </A>","Latitude":"45.782319","Longitude":"-84.719546"}