{"Disposition":"IFO","Country":"United States","files":["/var/www/straped/mufon/html2text/24545.html.txt","/var/www/straped/mufon/org/24545.html"],"City":"Anaheim","Region":"California","divs":["Sighting DetailsWhen I retired for the evening I found it hard to sleep. Then I heard a sudden loud high pitched sound in my bedroom, and outside. The sound reminded me of the planet Venus somehow. I got up on my elbow trying to make ends-meet of where the sound was coming from (the source of the sound), but I could not. Finally the sound got slowly dimmer, as though an object outside was slowly moving away. The sound got dimmer in my bedroom, until silence. The next morning I looked at my CASIO solar calculator and to my complete surprise I saw on it: -PPP1000000 to the power of 14. The 2 last Ps were separately underlined. I have no idea what it means, as I bought that calculator 6 months ago, and it never did anything like that. It is a new $14 calculator I bought at Office Depot. The number of digits on the code exceeded the calculators maximum by 2 digits. I could never figure out how to work any of the buttons, besides the number buttons and the basic math tool buttons. It has Pi and all kinds of buttons that I never use or don't work. I immediately contacted MUFON Headquarters, and reported the incident. They were supposed to get back with me in 48 hours, but never did. Thank you."],"trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around July 11th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Summary":"High pitched sound then finding a code or formula the next morning on my calculator","Object Shape":"Unknown","Case Number":"24545","Object Flight Path":"Undisclosed","Latitude":"33.842003","Object Features":"Undisclosed","Date Submitted":"07/15/2010 09:51 UTC","Source":"MUFON","Sighting Duration":"00:03:30","Date of the Event":"07/11/2010 11:25 UTC","Log Number":"US-07152010-0021","map":"<A HREF = \"http://maps.google.com/maps?q=33.842003,+-117.905344(24545)&iwloc=A&hl=en\"> mufon case (24545) map </A>","Tags":"City","Longitude":"-117.905344","Viewing Distance":"Unknown"}