{"Region":"Ohio","Log Number":"US-07152010-0016","Source":"MUFON","Summary":"It was hovering for several minutes then took off like it got shot out of a gun.","Date of the Event":"08/21/1977 09:30 UTC","Latitude":"41.508795","Weather Factors":"Unknown","City":"Cleveland","Date Submitted":"07/15/2010 08:37 UTC","Longitude":"-81.694309","files":["/var/www/straped/mufon/html2text/24540.html.txt","/var/www/straped/mufon/org/24540.html"],"Object Shape":"Triangle","Sighting Duration":"00:10:00","Disposition":"Unknown","Object Features":"Unknown","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around August 21st 1977"],"Tags":"City","Case Number":"24540","map":"<A HREF = \"http://maps.google.com/maps?q=41.508795,+-81.694309(24540)&iwloc=A&hl=en\"> mufon case (24540) map </A>","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","divs":["Sighting DetailsI was a teen-ager and I was finishing up cutting the lawn (I still lived with my parents). It was dark but I was on my dad's lawn tractor (it had driving lights). Something caught my attention up in the sky. It was dark out but starry. I could see what looked like lights in a triangle shape that were not the same color as the stars. They were orangish. I thought it was a helicopter, as whatever it was, it was stationary. I made a few more rounds in the yard and kept looking at the object. The more I thought about it the more I realized that it was not a helicopter as there were no flashing lights, let alone no red or blue lights. I started to get freeked out and shut off the lawn mower to try and hear the object; it made absolutely no noise. I knew that my parents were sitting on their back porch talking with our next door neighbors. I ran around to the back of the house and got all 4 of them to come out into the back yard so they could see what I saw. We were all looking at the object and speculating as to what it could be then it just took off. I don't mean that it slowly moved away, it rocketed across the sky in a few seconds and never made any noise at all. It's flight path was due north. Nothing was ever said in the news about its appearance. We all fiured it was not from this earth."]}