{"Region":"Ontario","Sighting Duration":"00:30:00","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/24546.html.txt","/var/www/straped/mufon/org/24546.html"],"Country":"Canada","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=45.43069,+-75.694593(24546)&iwloc=A&hl=en\"> mufon case (24546) map </A>","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around July 15th 2010"],"Source":"MUFON","Latitude":"45.43069","Date of the Event":"07/15/2010 09:35 UTC","Summary":"2 lights hanging for half an hour.","divs":["Sighting DetailsI was out in my back yard having a cigarette when my youngest son pointed out 2 lights in the clouds.At first i thought it was search lights coming from the market area or even from the Blues festival till the thicker clouds partially covered the lights. So i was running all the possible causes in my head still thinking this should have a logical explanation till one of the lights took off heading east at high speeds crossing the horizon within seconds.The second light made a check mark movement as it also left at high speeds leaving me in a state of what i can only describe as euphoria. I didn't get any photos for the only camera i own is on my phone and phone cameras take crappy pictures at any distance.My wife also saw these.There was no sound.Also when they left, the one heading east went through a clear patch of sky but was still fuzzy like a lit up cloud.I think that's all of it but if i remember anything else i will post it.I am really excited with this citing i have seen strange things before like satellites chasing each other but this was my closest citing which from what i can tell was just above the lower cloud ceiling."],"Longitude":"-75.694593","Object Shape":"Sphere, Other","Case Number":"24546","Log Number":"CA-07152010-0022","Tags":"City","Date Submitted":"07/15/2010 10:26 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Ottawa"}