{"Disposition":"Unresolved","Object Features":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/2454.html.txt","/var/www/straped/mufon/org/2454.html"],"Object Shape":"Undisclosed","trends":["There have been no other sightings in Greater London Dagenham","This sighting has never been favorited."],"Log Number":"","Case Number":"2454","Date of the Event":"07/26/2003 03:10 UTC","Country":"United Kingdom","Longitude":"0.14743","Object Flight Path":"Stationary,Other","Weather Factors":"Unknown","City":"Greater London Dagenham","Region":"England","map":"<A HREF = \"http://maps.google.com/maps?q=51.53889,+0.14743(2454)&iwloc=A&hl=en\"> mufon case (2454) map </A>","Sighting Duration":"01:59:00","Tags":"City","Summary":"Bright light, star like, with a smaller glow eithe","divs":["Sighting DetailsI couldnt sleep and could hear neighbours arguing. I looked out of my bedroomwindow and saw this bright light which initially looked like a big bright star.I then realised it appeared to have a smaller light either side of the mainlight. I studied it harder and thought it may have been a police helicopter,which sometimes hover, but there was no sound I could associate with itconsidering it was quite close. I went to get my binoculars and on closerinspection the lights either side of the main light could have been a glow frominside the object or of its engines. I could not make out a shape. The objectremained static, occasionally wobbling from side to side - as if there may havebeen turbulance. I observed it for approximately 1hr. 40mins.except for a briefbreak to get a hot drink. I wanted to see if it would wait until dawn, which itdid. I noticed it had moved further West and appeared to have gained height, asif to remain subtly in the background as dawn broke. Even with the lighter skyit was still difficult to make out what shape it may have been, but it didappear to have an auro the shape of a ball, though this may have just been thelights causing a distortion. It was noticable, the object had gained considerbleheight just before aeroplanes resumed their flight times. It moved more in thelast 20mins that I observed it, but the movement was so subtle it was hardlynoticable. It disappeared at 0448 hours. I remember thinking to myself, surelythe pilots could see it if I couldLastly, I should add, some days before thissighting I had seen the same object in the same part of the sky in the earlyhours of the morning and just dismissed it as a police helicopter, even thoughthere was no sound which I would have expected at that distance."],"Viewing Distance":"Unknown","Latitude":"51.53889","Date Submitted":"07/26/2003 03:10 UTC"}