{"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Latitude":"43.657726","Summary":"Very bright round dot (or spot). Very high in the sky.","Object Shape":"Sphere","Case Number":"24558","Disposition":"Unresolved","City":"Toronto","Log Number":"CA-07162010-0010","trends":["There have been 136 other sightings in Toronto","There were 4 other sightings in Toronto on or around July 16th 2010"],"Sighting Duration":"00:00:07","Region":"Ontario","Object Features":"Undisclosed","divs":["sighting detailsi went out for a break at work to the back deck (second floor) of our office. i'm a birder, amateur astronomer, i'm also into entomology, aviation and meteorology...so i'm pretty well versed with objects in the sky (day or night) and am always looking up to see what i can see. standing on the deck looking up at some seagulls and a jet going by i saw a bright white dot at a very high altitude about 60 degrees up from the western horizon about 15 degrees north of me. it looked very reflective (bright) with no contrail, no sound, no tail etc...just a bright white round dot. it was travelling w\\sw very fast and dissapeared suddenly about 30 degrees north of the eastern horizon just a bit south of me. it took 7 seconds to cross 50% of the sky. it was not burning\\burning up, like a meteor, it was a very clear, white dot of light. it didn't twinkle or oscillate, or deviate from it's course. it went across the sky too fast to be a high jet or satellite...and way too slow to be a meteor. also to high to be a bird. since i'm used to looking at satellites, birds, planes, insects, clouds and stellar objects, i'm pretty good at judging distance, altitude, speed etc. this object was hard to judge though because it was small and very high...if i had to take a guess i'd say it was 50,000 ft up (at least 10,000 ft above the cirrus clouds). the sky was mostly clear with a few cummulus clouds and a few very high, thin, cirrus clouds. when it disappeared in the eastern sky, i could not tell if it just blinked out (disappeared) or if it possibly just became obscured by the cirrus clouds (which were pretty thin\\wispy in that spot in the sky). [name removed\\cms\\tg] toronto"],"Date Submitted":"07/16/2010 02:56 UTC","Date of the Event":"07/16/2010 11:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.657726,+-79.378164(24558)&iwloc=A&hl=en\"> mufon case (24558) map </A>","Country":"Canada","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/24558.html.txt","/var/www/straped/mufon/org/24558.html"],"Source":"MUFON","Longitude":"-79.378164"}