{"City":"Windsor","trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around July 10th 2009"],"Log Number":"CA-07162010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=42.301756,+-82.984055(24553)&iwloc=A&hl=en\"> mufon case (24553) map </A>","Region":"Ontario","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"A shape, white in colour suddenly moved (flew) in the air, seemed to glow bluish.","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"Unknown","Tags":"City","Date of the Event":"07/10/2009 03:30 UTC","Viewing Distance":"21-100 Feet","Date Submitted":"07/16/2010 05:13 UTC","Latitude":"42.301756","Case Number":"24553","Object Features":"Unknown","Disposition":"Unresolved","Country":"Canada","Object Shape":"Cylinder","Longitude":"-82.984055","divs":["Sighting DetailsIt happened very quickly.I was fascinated and astonished.I was sitting on balcony in backyard having a cigarette.I watched the UFO fly by and disappear behind,yet above tree in backyard.I then went inside.About two-three minutes later,my son(then 15) and his friend came running into the apt. from outside .they were quite scared and said they had just seen a strange light near the front yard gate,which seemed to be following them.I then shared with them what I just saw and I stated that I was going back outside.They were frightened and refused to come with me,though I was only going back to balgony.I was not scared but fascinated and intrigued.It was dark outside and the light from the object was quite bright and even seemed to glow from white to bluish to extra glowing around it.It travelled very fast.It may have lasted 10 seconds but could've been more like 5-6 seconds.now that I write this I am still fascinated and realize for the first time that my son's sighting of the light thing ,must of been what I saw;except I now only realize it must have changed course to go to front yard area.Wow.I believed what I was seeing was something rather extraordinary,a ufo of some sort.I have never seen anything like it before or since.It was cylinder in shape ,approximently 1-2 meters in length(though that too may have changed during the course of it's flight across my vision),and was about the size of a mountain bike tire-say,26 cm.Or perhaps a bit smaller,must of been about 30 ft away from me but in the air above where I was sitting and about 30-40 ft in air.It disappeared behind the tree."],"files":["/var/www/straped/mufon/html2text/24553.html.txt","/var/www/straped/mufon/org/24553.html"]}