{"Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"06/16/1972 11:03 UTC","Date Submitted":"07/16/2010 01:02 UTC","divs":["sighting detailsok. i've never done anything like this before,so bear with me. i think it might have been around june of 1972( truthfully im not sure about the exact date,but i think it's close. i had an early interest in astrology,so one late, and very clear night i was laying on my grandmothers barn watching for meteors.from my point of view i could see practically from horizon to horizon, except for a few trees that were tall enough to distract my veiw. as i was lookng i saw a bright spherical light that kind of looked like a star but much brighter than the planet venus and moving quite oddly. it suddenly appeared just above the horizon(i think western)and moved from horizon t horizon passing directly overhead,except it wouuld move roughly 10 degrees almost in an instant then make a huge \"u\" shape just as quick then again com to an instant stop. im guessing the top of th u about 20 degrees and from top to the bottom of the \"u\" about thirty degrees. it repeated this same pattern until it disappeared at the opposite horizon. over the years i've had an interest in astronomy, so i understand some physics and understand inertia. i know this could havent been man made because anything moving like that wouuld destroy itself. i have only told a few friends and family about this over the years. the main reason im reporting this now is that i would like to know has or did anyone seen this? then about 2 years later i experienced missing time while driving,however i dont know if these events are connected. i know to a lot of people would be skeptical,so please respond, i just need some closure after all these years. sincerely, *(wit's name deleted--sgonzalez\\cms)."],"Log Number":"US-07162010-0008","Summary":"I was laying on the top of my grandmother's barn watching for meteors on a perfectly dark and clear night.","Case Number":"24556","Tags":"City","Object Shape":"Sphere, Star-like","Viewing Distance":"Unknown","Disposition":"Unknown","Source":"MUFON","Country":"United States","City":"White Bluff","map":"<A HREF = \"http://maps.google.com/maps?q=36.115959,+-87.219061(24556)&iwloc=A&hl=en\"> mufon case (24556) map </A>","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/24556.html.txt","/var/www/straped/mufon/org/24556.html"],"Weather Factors":"Unknown","Longitude":"-87.219061","Region":"Tennessee","trends":["There has been one other sighting in White Bluff","There were no other sightings in White Bluff on or around June 16th 1972"],"Latitude":"36.115959"}