{"Date of the Event":"07/15/2010 12:00 UTC","Object Flight Path":"Undisclosed","Log Number":"US-07162010-0012","Case Number":"24560","Object Shape":"Fireball, Star-like","City":"Independence","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Independence","There were no other sightings in Independence on or around July 15th 2010"],"divs":["Sighting DetailsLast night I seen a bright light in the Eastern sky, and moved from to the South Eastern sky. Then back to where it was. A group of my friends seen it too.. And on the way home, walking on Gun Club Road, I kept a close eye on it, and by the time I got home it was brighter then ever. Of course when your in total darkness anything in the sky get brighter. But when it moved it was a slow moving, and then back to its original course but faster. It was brighter then any Star in the sky, it was a very bright, and had a Orange type tale. Air Tragic control at PDX said nothing was reported, however, it does not explain the fact that both Myself, and Forty Six friends of mine seen the same thing. We were all having a quit little party, no drinking, and no drugs. I was thinking that something out of the ordinary, I new it was not a star at all, and it wasn't there the day before. At least I didn't notice it. I'm not a skeptic, I do believe there is intelligent life out their, and I have seen something when I was child in Massachusetts. As far as loosing sight of it, I never lost sight of it til I decided to go to bed, and then checked it out on the Internet. I found find out that is was reported??"],"Longitude":"-123.179156","Source":"MUFON","Country":"United States","Date Submitted":"07/16/2010 03:51 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.85589,+-123.179156(24560)&iwloc=A&hl=en\"> mufon case (24560) map </A>","Summary":"Bright light in eastern sky over Oregon.","files":["/var/www/straped/mufon/html2text/24560.html.txt","/var/www/straped/mufon/org/24560.html"],"Disposition":"Insufficient Data","Weather Factors":"Unknown","Latitude":"44.85589","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Oregon"}