{"Object Flight Path":"Undisclosed","City":"La Puente","divs":["Sighting DetailsIt was too hot so we (husband, son, mother-in-law & neighbor)sat outside on lawn chairs just talking trying to cool off. My son was getting frustraded from the heat so I said to him to look up at the stars with me (trying to get him to change his focus) but he wasn't interested and went off to ride his scooter. My husband and I just sat there with our head tilted back looking up and I said (light-hearted), \"what if those arn't stars and are ufo's watching us?\" No one commented, we all just sat star gazing. It was about maybe 7-8 min. since my comment when my husband said excitedly, \"LOOK AT THAT ONE! IT'S SPEEDING ACROSS THE OTHER 2 PASSING THEM UP!!!\"(meaning stars) we all stood and looked up and could clearly see this one bright \"star\" go across the sky passing 2 other stars until making a complete stop. My son asked what it was and we told him it was a falling star so not to scare him and asked him to go inside to check on his sleeping sister. Once my son was not around we all started talking about what we had seen. It was definately not a falling star...it did not dissipate. It went from one spot to another without loosing it's brightness. It definately got our attention so now we were all staring up into the sky wondering if those really were stars we were watching so now my light-hearted question seemed more intense. I don't know how much time went on from one sighting to the next (we remained outside for maybe 20 mins. or so) but I can say that we did see a total of 3 \"stars\" at different times and areas of the night sky and each one zoom from one point to another, across the sky! We also noticed there were 3 brighter stars very far apart from eachother but formed a triangle if you were to connect the dots. I couldn't tell what the distance was only that they looked as if they were as far up as stars are. We would have loved to remain outside but our parenting duties called us in! By the way, this is the second sighting I've had I just never reported the 1st one which was in North Whittier, CA in 2006. This would have to be a whole other report!"],"Disposition":"IFO","Sighting Duration":"Undisclosed","Latitude":"34.021361","Date of the Event":"07/15/2010 12:00 UTC","Case Number":"24567","Source":"MUFON","Longitude":"-117.941408","Region":"California","Weather Factors":"Unknown","Log Number":"US-07162010-0019","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/24567.html.txt","/var/www/straped/mufon/org/24567.html"],"Object Shape":"Star-like, Unknown","Viewing Distance":"Unknown","Summary":"We were star gazing when we realized they weren't stars!","trends":["There has been one other sighting in La Puente","There were no other sightings in La Puente on or around July 15th 2010"],"Date Submitted":"07/16/2010 08:24 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.021361,+-117.941408(24567)&iwloc=A&hl=en\"> mufon case (24567) map </A>","Country":"United States"}