{"Date Submitted":"07/16/2010 04:50 UTC","Log Number":"US-07162010-0013","Country":"United States","Viewing Distance":"21-100 Feet","Source":"MUFON","Object Flight Path":"Hovering then path","Object Shape":"Circle","Disposition":"Insufficient Data","trends":["There has been one other sighting in Tell City","There were no other sightings in Tell City on or around November 30th 1986"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.951445,+-86.767766(24561)&iwloc=A&hl=en\"> mufon case (24561) map </A>","Region":"Indiana","Summary":"Glaring light came into my window..no sound...it was a ball of light in the sky.","Case Number":"24561","Longitude":"-86.767766","Object Features":"Unknown","Date of the Event":"11/30/1986 12:00 UTC","files":["/var/www/straped/mufon/html2text/24561.html.txt","/var/www/straped/mufon/org/24561.html"],"Tags":"City","Weather Factors":"None, Does Not Apply","City":"Tell City","divs":["Sighting DetailsIt light up the entire room...I awoke and went to the window and saw a stationary ball of light to my left..and it stayed there for a few seconds and then it went up and over toward the river with a stream of light behind it and disappeared. About a month later it happened again the same way...others did see this around the city because we heard a news cast on the radio about reports of the light that morning...both happened sometime before daybreak in the early morning hours around 2:00 or 3:00 AM. The second time it happened I was looking out the window and don't really remember going to the window but I guess I must have just jumped up out of bed and ran to it right away. The second time it was head on and shining right at me. We lived at that time on a big hill above the river...I have lived on the river all my life and know for a certainty it was not a barge search light and it wasn't a helicoper...no sound. That is all I can remember about it other than to me it was peaceful and I wasn't afraid."],"Latitude":"37.951445","Sighting Duration":"Undisclosed"}