{"Object Shape":"Other","Summary":"While moving in my new apartment I saw a beautiful object come out of the sky.","Source":"MUFON","Longitude":"-117.907834","Disposition":"IFO","Country":"United States","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24569.html.txt","/var/www/straped/mufon/org/24569.html"],"Case Number":"24569","Tags":"City","Date of the Event":"03/31/1988 10:30 UTC","divs":["Sighting DetailsWhile I was unpacking and putting away my things from my other next door apartment complex I took a break in my living room. As soon as I sat down I looked out my upstaires living room window and saw a pendulum shaped object come out of the sky very quickly and stop about 400 feet from me. It was very beautiful possessing all the colors of the rainbow. It looked like a ball with a stick coming from it on the top. The ball quickly spun in one direction, and the stick in the opposite direction. It acted like a pendulum with very fast motions. I saw it for 3 seconds when it flung out and in one very fast motion disappeared into space. The ball of the object was 3 feet in diameter, and the stick was about 7 feet long. I saw UFOs every night in my area since 1986. I photographed them, and filmed them. The upload below shows 26 of the objects I photographed. A lot of it looks like lamp lights, but if you compare the lights with background and with each other you can clearly see they are not all lamp lights. One photo looks like smoke. Maybe it is, but I do not remember taking it, and how can its shape be from a natural cause? Sorry, but the photos are old, and a little corrupted. However it is all I have to offer you."],"Region":"California","Date Submitted":"07/16/2010 08:49 UTC","Latitude":"33.842753","Object Features":"Undisclosed","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around March 31st 1988","This sighting has never been favorited.",""],"Sighting Duration":"00:00:03","map":"<A HREF = \"http://maps.google.com/maps?q=33.842753,+-117.907834(24569)&iwloc=A&hl=en\"> mufon case (24569) map </A>","City":"Anaheim","Log Number":"US-07162010-0021","Object Flight Path":"Undisclosed"}