{"Longitude":"-105.546814","files":["/var/www/straped/mufon/html2text/24563.html.txt","/var/www/straped/mufon/more/24563_submitter_file1__ufovisit.jpg","/var/www/straped/mufon/org/24563.html"],"Case Number":"24563","Object Shape":"Sphere","trends":["There have been 15 other sightings in Moose Jaw","There were no other sightings in Moose Jaw on or around July 16th 2010","This sighting has never been favorited.",""],"Latitude":"50.397343","Log Number":"CA-07162010-0015","divs":["sighting detailsfeeling selfless and sad, i stepped outside under a clear night sky. raised both my arms up toward the sky and willed for the 'light' to show up. i was now in tears and in a moment, the ufo silently floated over me. i than felt relieved and reassured, that everything will be ok. i was sad because, i came across a documentary clip on youtube about the sad story of how humane societies (dog pounds) put an end to animals lives when they don't think they'll be adopted. i wished that no living thing would have to endure such suffering, sadness, and pain. when the ufo came to my calling, i tried remote viewing my location and projecting that thought\\information to the sky; intended for the ufo that had visited me numerous times in the past. however, before the ufo came by, one quick flash in the sky appeared. the flash looked like it was high up in the atmosphere. i didn't pursue or bother to get a camera, as i was selfless and only concerned for the well being of others. as it past over out of sight, i looked down and closed my eyes to ease my sadness. than went to sleep. today, i'm telling you this story."],"Source":"MUFON","Summary":"Feeling selfless and sad, I stepped outside under a clear night sky.","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"07/16/2010 06:26 UTC","Disposition":"Unresolved","Object Features":"Undisclosed","Country":"Canada","Region":"Saskatchewan","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","City":"Moose Jaw","map":"<A HREF = \"http://maps.google.com/maps?q=50.397343,+-105.546814(24563)&iwloc=A&hl=en\"> mufon case (24563) map </A>","Date of the Event":"07/16/2010 03:00 UTC","Sighting Duration":"00:02:00"}