{"files":["/var/www/straped/mufon/html2text/24562.html.txt","/var/www/straped/mufon/more/24562_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/24562.html"],"Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=50.455952,+-104.598527(24562)&iwloc=A&hl=en\"> mufon case (24562) map </A>","Sighting Duration":"00:00:20","Case Number":"24562","Date Submitted":"07/16/2010 05:43 UTC","Viewing Distance":"Unknown","Longitude":"-104.598527","trends":["There have been 10 other sightings in Regina","There were no other sightings in Regina on or around July 11th 2010","This sighting has never been favorited.",""],"Summary":"Flash of light spontaneously appears shortly after looking out the window.","Object Shape":"Flash, Sphere, Star-like","divs":["sighting detailsi was in the front right passenger seat of a car travelling at approximately 100 km\\h. at the time we were heading south on the road where the ufo sighting occurred. it was nighttime at exactly 22:40 -06:00 cst when i spontaneously have a look out the window toward the clear sky. a second later a flash of bright white light appeared. this synchronized 'phenomena' has happened to me before and i do not consider it to be a coincidence any more. i said out loud, \"wow, that's incredible.\" and the driver (my dad) said, \"what is?\". i shrugged my shoulders and said it was just a shooting star. i didn't say it was a ufo that happens to \"appear\" and \"approach\" me from time to time. it's a subject that i'd prefer not to talk about to family members and friends all the time, despite the frequent 'visits' of ufos. every time i'm visited by these ufos, i get a sense of relief and joy. although, some time after such events, i'm reminded not to be so naive, as to think i am summoning or have a guardian for that matter. i must remember my intuition and remain in the balance by keeping myself aware of technological, scientific, psychological, military and intelligence community capabilities. note: - the light appeared stationary and above the city. however, it is possible it was just outside city limits, as that was where we were heading. - the sighting reminded me of my visit to a job fair. i remarked to a city air port radar operator, \"how about those ufos?\". he laughingly replied, \"too much paperwork.\" and his supervisor looked caught off guard. sincerely"],"Latitude":"50.455952","Tags":"City","Object Features":"None","Log Number":"CA-07162010-0014","Object Flight Path":"Stationary","Date of the Event":"07/11/2010 10:40 UTC","Region":"Saskatchewan","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"None","City":"Regina"}