{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.102207,+-75.912514(24572)&iwloc=A&hl=en\"> mufon case (24572) map </A>","Case Number":"24572","Log Number":"US-07162010-0024","Tags":"City","Latitude":"42.102207","files":["/var/www/straped/mufon/html2text/24572.html.txt","/var/www/straped/mufon/org/24572.html"],"Summary":"Unknown object going across sky.","Object Flight Path":"Straight-line path","Region":"New York","Viewing Distance":"101-500 Feet","Object Features":"Appendage(s)","Longitude":"-75.912514","Object Shape":"Blimp, Cigar, Oval, Saturn-like","Date of the Event":"07/16/2010 08:00 UTC","divs":["Sighting Details It was in my backyard, I spotted an extremely large bird. I ran inside and back out with the camcorder to get video of the bird, but I was too slow. The bird was just out of sight as I returned. (This thing was giant, but thats another story.) My commotion brought my girlfriend out to the yard, she was trying to help me spot the bird when she noticed a weird \"something\" flying. At 1st glance I thought to myself \"just a helicopter\", less than 2 seconds later I knew I was wrong, but could NOT figure out what it is. After looking at the video I still can not figure out what it could be. It flew very slow, i heard nothing coming from it at all, it seemed to be moving along at a constant rate. It was very windy out, the bird i spotted was \"kiting\", i do not believe this object could be a balloon floating along at all, it is not a plane or a helicopter. Once I realized i had no idea what i was looking at i became shaky, nervous. In my mind i thought my god its like videos on the internet.I think i was in shock, perhaps just getting over it. I did my best to video tape it, I had great difficulty seeing it in the viewfinder of my camcorder, so I was often catching it as it got out of view, but there are a (very) few very good closer frames in the video. I apologize for the poor quality of the video overall. I stayed outside until my camera battery died, then came inside uploaded it (from sony handycam, using sony picture package software to video capture it from the camcorder to the PC), then reported it here to MUFON. You can see my last sighting of the object in the video, it flew over the hill behind our house and the roof of our house blocked it from sight. The only thing ive done to this video itself is as follows. Recorded it using sony handycam digitial 8 Uploaded video from camcorder via video capture to pc using sony picture package software that came with the camcorder. recompressed the video using virtualdub and divx fast motion codec."],"Country":"United States","Disposition":"Unknown","Source":"MUFON","City":"Binghamton","trends":["There have been 14 other sightings in Binghamton","There were no other sightings in Binghamton on or around July 16th 2010","This sighting has never been favorited.",""],"Date Submitted":"07/16/2010 10:52 UTC","Weather Factors":"Unknown"}