{"Tags":"City","Object Features":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-123.183084","Region":"California","Date Submitted":"07/16/2010 11:17 UTC","Country":"United States","divs":["sighting detailsi was watering plants at the end of a long hot day and venus has been out so vividly, i assumed it was venus until it started to move. i watched it as it was real bright and no sound and low, about 500'. i was to tired to relly react much other than to verbally tell it to come down and help us(people). i stood up when it came over head and i just watched it until it turned and changed to a reddish\\orange color.i knew it was real low as a turb-prop plane flew over-head.i first saw it in the w.n.w. and it traveled in a s.s.e. direction,then it turned and went s.it flew over me,and my house.i live in the mountains and you can see everything at night.thats it. this is my official 2nd ,barred none sighting in my life the 1st was when i was about 22-23 yoa.back then i had one come real,real close and it messed me up in the head for quite awhile,this one didn't bug me at all, i guess age has a part in that fact."],"files":["/var/www/straped/mufon/html2text/24573.html.txt","/var/www/straped/mufon/org/24573.html"],"Latitude":"40.554311","Disposition":"Insufficient Data","trends":["There has been one other sighting in Hayfork","There were no other sightings in Hayfork on or around July 13th 2010"],"City":"Hayfork","Summary":"Bright Venus colored light,in fact I thought it was Venus as I was working and it started moving from the N. to the S.E. and it came over head and turned and changed color as it turned and slowing moved away.","Object Shape":"Circle, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.554311,+-123.183084(24573)&iwloc=A&hl=en\"> mufon case (24573) map </A>","Log Number":"US-07162010-0025","Case Number":"24573","Date of the Event":"07/13/2010 09:45 UTC","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown"}