{"Object Shape":"Boomerang","Object Features":"Undisclosed","Latitude":"42.570197","map":"<A HREF = \"http://maps.google.com/maps?q=42.570197,+-114.453791(24577)&iwloc=A&hl=en\"> mufon case (24577) map </A>","Region":"Idaho","Date of the Event":"07/15/2010 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/24577.html.txt","/var/www/straped/mufon/org/24577.html"],"Sighting Duration":"00:00:15","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07172010-0002","Case Number":"24577","trends":["There have been 9 other sightings in Twin Falls","There were no other sightings in Twin Falls on or around July 15th 2010"],"Weather Factors":"None","Disposition":"IFO","Date Submitted":"07/17/2010 12:34 UTC","Source":"MUFON","divs":["Sighting DetailsAt around midnight on July 15, 2010, my 14 year old daughter and her 14 year old friend were sitting in the hot tub in our backyard. They were talking and looking at the sky and both witnessed this object at about the same time. The night was clear with a quarter moon and the stars were very bright. This object flew over them from southeast moving northwest. They only watched it for about 10-15 seconds and became scared and came into the house. What they saw and described to me was a boomerang shaped object oriented with the point forward and the two tails toward the back. It had a series of 7-8 illuminated brownish orange orbs along each tail. She could see stars between the two tails so it was apparently open space. My daughter felt that the orbs were not quite perfectly aligned. The object made no sound and it flew in a straight line. The size was difficult to estimate at night. She felt that the speed was about what you would expect of a low flying jet aircraft. She felt the altitude was far less than what a commercial jet would fly (30,000 to 40,000 ft) and maybe something closer to what a high flying bird or small aircraft would fly, maybe 500-2000 ft. Both of the girls were frightened because this was unlike anything they had seen before. They came into the house and woke my wife. By the time she went outside it was out of sight. We are about 75 miles from Mountain Home AFB but rarely see any of their aircraft. We have sparse commercial air traffic but know what the high flying passenger jets look and sound like. We considered that it might be a flock of geese, ducks or pelicans but just didn't seem plausible because we are a long way from any river or lake and don't see them during the day not to mention that they wouldn't appear illuminated."],"Longitude":"-114.453791","City":"Twin Falls","Object Flight Path":"Straight-line path","Summary":"Illuminated boomerang object in Southern Idaho.","Tags":"City"}