{"Source":"MUFON","Region":"Kentucky","trends":["There has been one other sighting in Jeffersontown","There were no other sightings in Jeffersontown on or around July 13th 2010"],"Summary":"Bright light traveling at slow rate of speed crossing the sky from NW to SE","Latitude":"38.204056","Weather Factors":"Unknown","Case Number":"24574","Object Flight Path":"Straight-line path","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/24574.html.txt","/var/www/straped/mufon/org/24574.html"],"Date Submitted":"07/16/2010 11:52 UTC","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Unknown","City":"Jeffersontown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn the evening noted above I had been on my back deck looking at the planets through my telescope with two of my neighbors . After seeing Venus and Saturn my neighbors returned home. At Approximately 10:15 I witnessed a bright light coming out of the NW. It was moving at a slow rate of speed, something like a small single engine plane. The thing that was odd was the light on the craft was very bright white and there were no red or green navagation lights or any flashing lights at all. I went inside the house and got my wife and daughter to come see it. I also got a small pair of binoculars to see if I could more easily identify the craft. I could not make out any defining shape or markings. The white light was too bright. We watched as the craft moved across the sky and finally out of site behind a house down the street. The craft never changed speed or direction that we could tell and it had no sound at all, it was a very quite evening. Many small planes fly over our neighborhood and we know the sounds they make. My daughter and I discussed what we had seen and agreed that we had seen the same thing on the night of June 25 while walking at night through the neighborhood. On that evening we told our neighbors about what we had seen and they said they had seen something similar to our discription of the object a week earlier."],"Log Number":"US-07162010-0026","Date of the Event":"07/13/2010 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.204056,+-85.557953(24574)&iwloc=A&hl=en\"> mufon case (24574) map </A>","Country":"United States","Longitude":"-85.557953"}