{"Case Number":"2457","Tags":"City","trends":["There have been 2 other sightings in Coshocton","There were no other sightings in Coshocton on or around July 18th 2003"],"Disposition":"Insufficient Data","Date of the Event":"07/18/2003 12:00 UTC","Region":"Ohio","Sighting Duration":"00:30:00","files":["/var/www/straped/mufon/html2text/2457.html.txt","/var/www/straped/mufon/org/2457.html"],"Object Shape":"Undisclosed","City":"Coshocton","Date Submitted":"07/18/2003 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.272015,+-81.859576(2457)&iwloc=A&hl=en\"> mufon case (2457) map </A>","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Summary":"Shock and Awe","divs":["Sighting Details I tried to report this already, but I filled out a long summary and tried to submit to 2 different places and it didnt work. I got pissed off and decided no one would get to know. Then I read an article today about MUFON so I figured I would try one more time.I went out to smoke a cigarette at my parents house. I looked up over the roofand there were orange streaks going across the sky. I was immediately in shockbecause this was just unbelievable. I never imagined it would happen to me. Sothese lights which are hard to describe were orange and looked pretty much likemeteors. But they werent because I saw like 100 in 1 minute or two. They weregoing in all directions, very fast. The trails looked almost like a tracer. They were going so fast I could not focus on them. They were all the same sizeand shape. As I said they looked like orange shooting stars going in alldifferent directions kind of like a spider web but not quite.As I said Ive written this before and I dont even know if it will work this timeso Im not writing as much. This is nothing that can be explained if I coulddraw it I would.Any way I stood in shock for about what seemed five minutes and ran in and gotthe phone. I called my sister because she would probably be up. She was but Idont remeber what we discussed I think it went like MEI see UFOs HERWow. Theywere still going so I decided to run in and wake up whomever was going to comedown the fastest. My dad did and I said come fast. He kinda did, but when wegot out there there was nothing. Then a white light went from the bottom to thetop of the viewing area. Then another. I asked him if he saw it he said yes,but after talking to him Im not so sure. He said they were birds. But he didntsee the orange light show so I would have to disagree.I probably forgot a bunch but I still remember quite vividly what happened.The next night I went out to look again. Saw some strange things but they couldhave been bats or something. But one thing stood out. There was a light besidea star, but I had been staring at the sky and I couldnt remember that star. Itappeared to be sitting still By the way there was lightning that night then as Iwatched it it moved slowly and then faded very quickly as it sped off. I couldhave been mistaken on this one. It could have been a"],"Log Number":"","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-81.859576","Object Flight Path":"Straight-line path","Latitude":"40.272015"}