{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/2459.html.txt","/var/www/straped/mufon/org/2459.html"],"Object Flight Path":"Straight-line path","Country":"United States","Object Shape":"Other","Summary":"Cigar Shaped UFO in North Carolina","Viewing Distance":"501 Feet - 1 Mile","Case Number":"2459","Date Submitted":"08/06/1999 05:30 UTC","divs":["Sighting DetailsI had been on a trip visiting my elderly mother in Jacksonville, North Carolina. I was now on the return trip back to my home in Chesapeake, VA. It was in theafternoon, and I was driving between Richlands and Kinston N.C., northbound, atabout 50 mph. The area was rural farmlands, with a 30 to 50 ft. treeline oneither side of the main asphalt roadway. Occassionally. I passed farms and openfields on either side of the road. The road also rose and dipped in the shallowhills in this area. I was looking down the road, straight ahead, when a silveryobject came from behind the treeline to my right and flew straight across theroad, about 100 to 150 ft. above it. The object was Cigar-shaped, with a bulletshaped point on the front. The back top 13 of it was shaped like a long fin,although it had no moving parts on it. I got the impression this area couldhave been a crew area, or possibly for propulsion, although there was none. Itwas smooth, silvery, with no markings, no windows, or other external metalfittings or marks. It did not make any noise, and did not exhibit any externalpropulsion no exhaust, no propellers. I have never seen anything like thisbefore or since....it was simply amazing I did not have the sense that it wasanything produced by man. It dissappeared behind the treeline to my right. Itried to speed up and see if I could get to an open field which might give me abetter sight line on the object, but there were only trees ahead on my left andI never saw it again. I have no idea what it was. I estimate its size at 50ft. in length, and very aerodynamic in shape."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.89933,+-77.546634(2459)&iwloc=A&hl=en\"> mufon case (2459) map </A>","Log Number":"","trends":["There has been one other sighting in Richlands","There were no other sightings in Richlands on or around August 6th 1999"],"Weather Factors":"Unknown","Object Features":"Other","Latitude":"34.89933","Sighting Duration":"00:00:59","Date of the Event":"08/06/1999 05:30 UTC","Disposition":"Insufficient Data","Region":"North Carolina","Tags":"City","Longitude":"-77.546634","City":"Richlands"}