{"Object Features":"Unknown","divs":["Sighting DetailsI just stepped outside onto my porch for some air & to gaze into the stars. I started glancing around though the sky and to the South West of my porch, I noticed a Red glowing object. It was not a plane or helicopter because there were no flashing lights or movement. The object was steadily hovering. As I continued to view the object, I quickly noticed it was much brighter and larger than a star would appear. About a minute into viewing the Red Glowing object, I noticed 2 small blue balls of light which came from below the glowing object. 1 of the balls of light quickly dropped down and I could not see where exactly because of a neighbor's trees. The 2 ball of light remained beside the Red Glowing object. About 30 seconds later, the second ball dropped quickly downward. And again, I could not see where it went being blocked by the neighbor's trees. Not much longer after that, the Red Glowing object quickly flew downward. As if it was trying to hide after being spotted. The downward movement was not a free fall by all means, it was a very quick downward decent. I lost visual of the Red Glowing object after it feel below my site of view under the neighbor's trees. I quickly ran inside to grab my camera in hopes I could catch it lifting off from where ever it may of landed. I stayed out side for another 45 minutes but never saw the object again. I was in complete shock seeing it from the first moment to the last moment. Even while continuing to wait for it's reappearance, I knew exactly what I witnessed. This was not a comet, plane, helicopter or even a flare. I've witnessed them all during day & night, what this was could not be compared to what I witnessed. I almost got the sense it knew it was being watched. When the thought of grabbing my camera came across my mind, that's when the object started its quick decline."],"Disposition":"IFO","Longitude":"-117.433098","Country":"United States","files":["/var/www/straped/mufon/html2text/24598.html.txt","/var/www/straped/mufon/org/24598.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Sighting Duration":"00:03:00","Weather Factors":"Unknown","Date Submitted":"07/17/2010 09:03 UTC","Region":"California","Source":"MUFON","City":"Fontana","Log Number":"US-07172010-0022","Summary":"Red glowing object, brighter than a star.","Latitude":"34.094444","Case Number":"24598","Date of the Event":"07/17/2010 03:33 UTC","trends":["There have been 16 other sightings in Fontana","There were no other sightings in Fontana on or around July 17th 2010"],"Tags":"City","Object Shape":"Fireball, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=34.094444,+-117.433098(24598)&iwloc=A&hl=en\"> mufon case (24598) map </A>"}