{"Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/24592.html.txt","/var/www/straped/mufon/org/24592.html"],"Latitude":"38.588939","Date Submitted":"07/17/2010 01:46 UTC","Tags":"City","Object Shape":"Other","divs":["Sighting Details At approximately 3p.m. out of my Southeast facing office window I observed a copper colored brightly flashing object larger than a planet and slightly elongated moving into the top of a line of pine trees. It was much brighter than anything I have ever seen in the day light which is what drew my attention. The object moved laterally to my left behind the tree tops, emerged on the other side, and began a slow vertical ascent. I pointed this out to several co workers. My boss also took note of this as a very unusual looking object. He hurried outside to get a closer look, and I followed shortly. When I arrived in front of the building in addition to my boss, were two other co workers who were out smoking at the time. All four of us were now oberving the strange object in braod day light. It was not like anything any of us have ever seen. In the time it took me to go downstairs and outside, it had risen higher into the sky and was now almost directly over head. In a completely cloudless crystal blue background there was no reference for the altitude or size of the object. Smaller pieces appeared to be breaking away and falling rapidly. This effect was noticed at least three different times. After approximately ten or fifteen minutes of maintaining a relatively stationery position, it appeared to begin falling. You could almost see a tumbling type effect and it began to get substantially larger. At this point I made a run for my phone with the intention of getting a picture. I told another friend of mine in the office about it on the way to my desk. He headed outside while I found my phone. By the time I came back the object had fallen below the tree line although the fifth witness did observe the object before it went out of sight. My boss actually jumped in his car and took off in attempt to locate the point of impact. It is tough to estimate how near or far this may have been without the ability to get a feel for the altitude. There is also no way of knowing if the object was purely reflecting light, or giving off it's own. It was remarkably bright in the light of day, and at no point did it ever go completely dim the way an airplane does when its angle in relation to the sun changes. It also lacked a consistent shape. As earlier stated, it first appeared oblong, and seemed to change. I believe we were probably seeing it from different angles. I have not seen any local news coverage so far, and was hoping you have encountered similar reports. I would love an explanation of what this may have been!! Joseph D Schaefer"],"Disposition":"IFO","Log Number":"US-07172010-0017","Weather Factors":"None","Viewing Distance":"Unknown","Longitude":"-89.990382","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"I saw a very bright object out of my office window. Myself and four co workers ran outside and oserved for fifteen minutes.","Case Number":"24592","trends":["There have been no other sightings in Fairview Heights","This sighting has never been favorited."],"Date of the Event":"07/16/2010 03:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.588939,+-89.990382(24592)&iwloc=A&hl=en\"> mufon case (24592) map </A>","City":"Fairview Heights","Source":"MUFON","Region":"Illinois"}