{"Region":"California","Latitude":"33.843793","Sighting Duration":"00:00:12","City":"Anaheim","Object Flight Path":"Undisclosed","Longitude":"-117.905904","Summary":"A comet like object I saw 2 times within 2 weeks.","Object Features":"Undisclosed","Date of the Event":"06/23/1993 05:30 UTC","Case Number":"24595","Object Shape":"Fireball","Log Number":"US-07172010-0019","map":"<A HREF = \"http://maps.google.com/maps?q=33.843793,+-117.905904(24595)&iwloc=A&hl=en\"> mufon case (24595) map </A>","Disposition":"IFO","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24595.html.txt","/var/www/straped/mufon/org/24595.html"],"Tags":"City","Date Submitted":"07/17/2010 07:20 UTC","Country":"United States","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around June 23rd 1993"],"Weather Factors":"Unknown","divs":["sighting detailsi was a comet type object 2 times within 2 weeks. the first time i saw it i was putting on my jacket to go out in front of my living room window in my apartment that is upstaires. i saw about 500 yards away a comet like object traveling southward for about 7 seconds. it turned westward and up into space disappearing. then 3 seconds later a very beautiful round object appeared in the same area. it looked like a very precious shiny stone, as it hovered for about 7 seconds then very quickly disappeared in the area where the comet object did. two weeks later i was walking home from the library approaching a field where railroad tracks used to be nearby where i live. i looked up, and saw that comet object only about 200 yards away. it was traveling westward at about 15 mph for about 7 seconds. it filled a quarter of the sky. it turned out into space with its vaperous tail completely following it. this object looked exactly like a comet. it was pure white with a perfectly rounded head, and vaperous tail. i do not know why the object was not broadcasted on television or at least on the radio. i saw this object many times before after the above. the info is basically the same, so there is no sense in disclosing those sightings. thank you. *(wit's name deleted--sgonzalez\\cms)."],"Source":"MUFON"}