{"files":["/var/www/straped/mufon/html2text/24600.html.txt","/var/www/straped/mufon/more/24600_submitter_file1__LPIC1509.JPG","/var/www/straped/mufon/more/24600_submitter_file2__LPIC1510.JPG","/var/www/straped/mufon/more/24600_submitter_file3__LPIC1511.JPG","/var/www/straped/mufon/org/24600.html"],"Summary":"Two orange lights.","Case Number":"24600","Latitude":"52.143819","Region":"England","Disposition":"Unresolved","trends":["There have been 4 other sightings in Bedford","There were no other sightings in Bedford on or around July 18th 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsOn the morning of the 18th of July at approx. 1:47am, i was in my living room and decided to go outside for a cigarette. It was later than i usually go to bed as my 15 week old daughter was having trouble getting to sleep. As i lit the cigarette i noticed 2 orange lights in the distance far away from the rooftops. Today was the first day of a bi-yearly festival so i thought it was a couple of fireworks going off. I thought i'd keep my eye on them as the fireworks should of finished at 11pm and it looks like people were still letting them off. The first thing that struck me was the silence, i live close to where the festival is taking place and the fireworks earlier in the night where like artillery going off in my back garden. These lights were silent and after several seconds they were still in the air and not making the usual whistles or exploding. Quite unusual, i dismissed them as fireworks but they were moving closer so i thought they were airplanes as there's an airport in the next town from us. As i kept watching i noticed they were not airplanes either. They were moving far too fast and were far too bright. When airplanes pass over they are very slow and usually 2 or 3 red blinking lights and a constant white one. The 2 objects where moving VERY fast and where bright orange. It's hard to estimate a speed, but comparing it to airplanes passing overheard at say 600mph after flying for 20-30 minutes, these objects where flying about 3000-4000mph. They covered the night sky in about 30 seconds. They couldnt of been fireworks as the festival is about 1.5-2 miles away and even though i could see and here the fireworks vividly, i've never known fireworks to travel that high up and that distance before now. Both objects where flying fast and high, one of them sped up as to catch up with the other. After seeing them fly flawlessly straight for two minutes, the one catching up seemed to turn and then both of them sped up faster and disapeared within the blink of an eye. My first thoughts were curiosity over what i thought they might be, then intrigue of finding out they aren't what i thought. When i realised what they weren't i started to think about what they could be. It didn't even occur to me that they could be anything unidentifiable until they got about halfway across the sky, i felt excitement over witnessing it but somehow i over-rided my awe and ran inside to get the camera. I'm still feeling a little excited even now. It was a pitch black night with only a few clouds in the sky, it had rained a little earlier in the day but cleared up in the afternoon. The only way i can describe them where two very bright orange lights, i couldn't see what shape or size they where. But compared to air traffic, they seemed like they were not as high up, but where moving extremely fast. I watched them for approx. 2 mins before i ran inside and picked up my digital camera which took about 20 seconds maximum. They were still there when i returned outside and managed to take 3 photos, i witnessed them for a few more seconds before one of them increased speed and changed direction slightly. Then both of them increased speed and disapeared. They didn't disappear over rooftops, they just seemed to of gone up. I only managed to get one clear shot of the two orange lights. The 2nd seems to show an outline. The 3rd didn't seem to capture anything but i've included it anyway."],"Date of the Event":"07/18/2010 01:50 UTC","Country":"United Kingdom","Object Flight Path":"Undisclosed","Longitude":"-0.459771","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=52.143819,+-0.459771(24600)&iwloc=A&hl=en\"> mufon case (24600) map </A>","Date Submitted":"07/17/2010 09:27 UTC","City":"Bedford","Weather Factors":"Unknown","Object Shape":"Unknown","Tags":"City","Log Number":"GB-07172010-0024","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown"}