{"Source":"MUFON","Disposition":"IFO","Summary":"Large fireball falling in the sky, like meteor, but not burning out, however, splitting.","map":"<A HREF = \"http://maps.google.com/maps?q=39.517258,+-84.389416(24607)&iwloc=A&hl=en\"> mufon case (24607) map </A>","Object Shape":"Fireball","Object Features":"Unknown","Log Number":"US-07172010-0031","Viewing Distance":"Over One Mile","Longitude":"-84.389416","Weather Factors":"Unknown","Country":"United States","Region":"Ohio","City":"Middletown","files":["/var/www/straped/mufon/html2text/24607.html.txt","/var/www/straped/mufon/org/24607.html"],"Object Flight Path":"Other","divs":["Sighting DetailsMy husband and I were driving home on Maud Hughes Road at approximately 9:45 p.m. heading north. We saw a large fireball in the sky. We thought maybe it was a meteor, but it was continuing to burn strong and bright. The fireball then split into two large fireballs. After dropping a little, another split until there were four but dropping slowed and now they were floating and hanging, \"winked\" out, but lit back on again. (the fire) til they appeared to either land or burn out. Because of trees and unable to see further, we were not sure where they were, could not see any fire or bright lights in the distance as though anything had landed. It was a falling ball of fire that slowed and later hung and floated, controlled equally each of the fireballs. All were uniform. I was very excited. I thought maybe it was something from the Dayton Airshow. My husband, agreed. I also considered, as did my husband, at first a plane crashing to the ground. It entered my mind that we were being bombed, never heard any explosions, and the fireballs stopped falling. We were anxious to get home and watch the news, look on the internet, but saw nothing. I believe there will be some explanation and I am very curious."],"Sighting Duration":"Undisclosed","Date of the Event":"07/17/2010 09:45 UTC","Date Submitted":"07/17/2010 11:31 UTC","trends":["There have been 13 other sightings in Middletown","There were no other sightings in Middletown on or around July 17th 2010"],"Tags":"City","Case Number":"24607","Latitude":"39.517258"}