{"Country":"United States","divs":["Sighting DetailsIt's about 105 degrees or more so I was swimming in my pool around 7pm when I looked up at the sky and saw what I thought was a white balloon at first. I thought that because it is very bright with the sun still way up above the horizon and there was this bright white light going across the sky from south to north in my full view. Since I just reported a sighting of a bright light last month, June 27th, one in the morning 1am and the second that same day around 9:35pm. This bright object moved steadily across the sky and it appeared very close to me. It did not waver around like a balloon would so my mind began to accept it that it was not. As I was watching it going north I told myself that if it kept going I would attribute it as some sort of silent brightly lit satellite or plane or something. But what it did next is what convinced me it was not a balloon or any other earthly thing. First it was silent with no red lights flashing or any lights flashing. I noticed also that the craft wasn't going so much North as it was going higher into the sky. So it appeared to slow down but was still moving. It went higher into the sky and appeared like a star with the sum reflecting on it except that the bright light surrounded the celestial as opposed to having one side brighter than the other. It continued higher and higher and I could still see it until it just looked like a disappearing star in the sky. It never finished it's direction north but went away, appearing like it was but really just going higher until it disappeared. It definitely was not a balloon because there was no wind to speak of and only a gentle breeze once in a while. I know something is happening because I can feel it, I've had more visions of it lately and I have a sense of expectations of seeing them and experiencing them even more. I also have the sense that they are going to take me away, which I welcome actually. Well, that's all. A bright starlight in a very well lit sky because it was early evening with the sum up, shining and HOTTER THAN HELL! Peace and Love"],"Source":"MUFON","Object Shape":"Star-like, Unknown","Object Features":"None","City":"Redding","Weather Factors":"None, Light","Date of the Event":"07/17/2010 07:00 UTC","Latitude":"40.59114","Date Submitted":"07/17/2010 10:45 UTC","files":["/var/www/straped/mufon/html2text/24604.html.txt","/var/www/straped/mufon/org/24604.html"],"Summary":"A bright light crosses Redding sky","Longitude":"-122.386485","Object Flight Path":"Straight-line path","Case Number":"24604","Region":"California","Log Number":"US-07172010-0028","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.59114,+-122.386485(24604)&iwloc=A&hl=en\"> mufon case (24604) map </A>","trends":["There have been 39 other sightings in Redding","There were no other sightings in Redding on or around July 17th 2010"]}