{"Case Number":"2460","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.346102,+-94.872471(2460)&iwloc=A&hl=en\"> mufon case (2460) map </A>","Object Shape":"Undisclosed","Source":"MUFON","Sighting Duration":"00:10:00","Region":"Missouri","Weather Factors":"Unknown","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Maryville","There were no other sightings in Maryville on or around July 19th 1994"],"Object Flight Path":"Unknown","Date of the Event":"07/19/1994 10:37 UTC","Tags":"City","Latitude":"40.346102","divs":["Sighting Details1. Sitting at Mozingo Lake star gazing and talking.2. Witness 3 made a comment that what looked like a star directly above usappeared to be rotating in small circles.3. A star that was shimmering due to heat waves comming off of the earth.4. During the sighting I was personally excited and scared at the same time.The other two witnesses were both alarmed upset during the sighting and begancrying. We immediately left the area after the sighting and went home.5. All three witnesses watched the star for approx. 5 min. and all agreed thatit was just a star, however, it did appear to be rotating in very small circles. We all agreed that it was due to heat waves. The conversations then went backto what ever we were talking about and just looking at the stars. Approx.5minutes later witness 3 again made the comment that the star was moving in smallcircles. All three witnesses then moved to the back of the car and beganwatcing the star. We all watched the star for approx 1-2 min. and agreed thatit was possibly moving in small circles. The star then began to move in astraight line across the sky, in a SE direction, much like a satalite forapproximatly 5 sec. All three witnesses saw this and made various comments,like are you seeing this. Witness 2 became very alarmed. The star thenstopped, very briefly less then 5 sec. and took off again at approximately a 35degree angle, at the same speed traveling in a westerly direction. After 3-5sec. the star again stopped and changed dirctions this time heading in a NEdirection.6. This time we observed the star move and begin to accelerate, actually leavingtail like a shooting star. The object accelerated off the horizon and acctuallyappeared to go at a upward direction. I cant even imagin how fast it was movingwhen it took off."],"Log Number":"","files":["/var/www/straped/mufon/html2text/2460.html.txt","/var/www/straped/mufon/org/2460.html"],"City":"Maryville","Summary":"Moving star changes directions3 times and shoots o","Date Submitted":"07/19/1994 10:37 UTC","Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-94.872471"}