{"Case Number":"24609","Latitude":"33.205347","Disposition":"Insufficient Data","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24609.html.txt","/var/www/straped/mufon/org/24609.html"],"Region":"California","Object Shape":"Unknown","City":"Vista","Date of the Event":"07/17/2010 06:00 UTC","Source":"MUFON","Object Features":"Undisclosed","Summary":"Blinking or flipping motion bright against sky.","Country":"United States","Longitude":"-117.234166","map":"<A HREF = \"http://maps.google.com/maps?q=33.205347,+-117.234166(24609)&iwloc=A&hl=en\"> mufon case (24609) map </A>","Viewing Distance":"Unknown","Log Number":"US-07182010-0001","Date Submitted":"07/18/2010 12:23 UTC","trends":["There have been 11 other sightings in Vista","There was one other sighting in Vista on or around July 17th 2010"],"Weather Factors":"None","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was looking at the moon while seated on my backyard deck when a bright object to the west of the moon appeared out of nowhere and appeared to stay stationary for a few seconds then move eatsward and stop one more time briefly. I yelled for my adult son and daughter to come out and see this event. The object then started to move very slowly eatward and my son and daughter came out onto the deck at that time to witness it moving eastward. The object almost appeared to be rotating but was so high in the atmosphere we could not tell if rotating or flipping back and forth. From our perspective it seems this object was huge and possibly in space even though it was light out. We all observed the object move very slowly for a matter of minutes and then disappear. We know the characteristics of satellites and aircraft and this was neither. I observed it appear out of nowhere and stop twice and we all observed how slow it moved. It appeared to me to be in the shape of a flat panel. Distance and heighth was to great to be accurate on shape. It wa very bright and that wasn't due to reflection of the sun to the west."]}