{"Weather Factors":"Unknown","Object Features":"Unknown","Object Shape":"Oval","Latitude":"38.836402","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.836402,+-104.818663(24611)&iwloc=A&hl=en\"> mufon case (24611) map </A>","trends":["There have been 106 other sightings in Colorado Springs","There was one other sighting in Colorado Springs on or around September 14th 2001"],"Disposition":"Unknown","Region":"Colorado","Object Flight Path":"Path with directional change","City":"Colorado Springs","Tags":"City","Longitude":"-104.818663","Country":"United States","Date Submitted":"07/18/2010 01:03 UTC","divs":["Sighting DetailsI was working at a local wal-mart as a shopping cart attendant, in Colorado Springs, CO. I was outside, awaiting my relief so that I could go home. It is imperative here to mention that the date was shortly after 9-11, and most air traffic was grounded, and this town is a big military town, so they extended their grounding a few days, and the day of this sighting was during their no-fly period. So I can absolutely be sure this was not a commercial plane, but I am not ruling out the possibility of secret military craft. As I was waiting for my relief, I glanced at the mountain range, and when I did, I noticed a small silver ball come gliding over the store, make an arc in front of the mountain range, and stop to the north of the store. As I was watching the silver ball, another red one showed up from the direction of Denver. It stopped parrallel to the silver one, and they both faded in and out for a few minutes. They than began to switch positions, and I don't mean by moving. I mean they would fade completely out, and than re-appear, but in each others position. In other words, the red one would be were the silver one was, and the silver one would be were the red one was. This continued for a few minutes, and than they faded completely out of sight."],"Date of the Event":"09/14/2001 03:10 UTC","Sighting Duration":"00:05:00","Summary":"a small silver ball came over the store I was working at, and stopped over in front of the mountain range, another red one came from the direction of Denver and stopped on the other side of the silver one. They both began to fade in and out","Log Number":"US-07182010-0003","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24611.html.txt","/var/www/straped/mufon/org/24611.html"],"Case Number":"24611"}