{"Longitude":"-71.612779","Viewing Distance":"Over One Mile","City":"Westborough","Date of the Event":"06/19/2010 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.276862,+-71.612779(24616)&iwloc=A&hl=en\"> mufon case (24616) map </A>","Country":"United States","Date Submitted":"07/18/2010 08:39 UTC","Latitude":"42.276862","Region":"Massachusetts","Summary":"I can only describe this object as a red bar.","divs":["Sighting DetailsWhile sitting outside with my girlfriend my attention was drawn to a helicopter that was flying directly towards us at a low altitude and at a high rate of speed from the east. The Sky was overcast and the clouds were very thick. No view of blue sky in any direction. As I was viewing the chopper I saw a strange thing just to the left of the chopper and most likely at a higher elevation ( I say this because the chopper pilot did not react to the object) I saw a single Red bar in the sky. It was sitting motionless and parallel to the horizon. It was not saucer shaped nor did it have rounded edges but it was definitely there considering I rubbed my eyes to make sure it was not something generated by my own eye. It was there all right and all I could say was \"what the hell is that??\" My girlfriend could not see it because of the size and duration ,it really was not easy to capture visually. I only saw it when the moving chopper passed by the stationary object that I literally can not identify. As I was trying to direct her vision in the right direction it just blinked out, gone to leave me pondering what I had just seen. I have read many a ufo reports in my life and I have seen just a few strange things but this is one for the books as far as im concerned."],"Object Features":"None","Log Number":"US-07182010-0008","Object Shape":"Square, Rectagular","Disposition":"Unknown","Case Number":"24616","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24616.html.txt","/var/www/straped/mufon/org/24616.html"],"trends":["There has been one other sighting in Westborough","There were no other sightings in Westborough on or around June 19th 2010"],"Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Stationary"}