{"Object Shape":"Diamond","Log Number":"","Longitude":"-73.910998","map":"<A HREF = \"http://maps.google.com/maps?q=40.894085,+-73.910998(2461)&iwloc=A&hl=en\"> mufon case (2461) map </A>","Sighting Duration":"00:05:00","Country":"United States","Latitude":"40.894085","Object Features":"Insignia","Date Submitted":"11/30/1977 01:00 UTC","Summary":"Saw Kite-Shaped Shaped Craft","City":"New York","Tags":"City","divs":["Sighting DetailsI was about 14 years old and I remember it was a Sunday afternoon - I dontremember the exact month but I guess it was January or February because it wascold out, but it was a beautiful sunny day - not a cloud in the sky. I wassitting on my bedroom windowsill on the ground floor of an apartment buildingand was just basically just sitting looking out the window toward woods whichlead down to the Hudson River and across from that the Palisades are visible. SoI was across the street from the woods. All of a sudden I saw an object appearin the distance...at first I thought it was a kite because it had the same shapefrom far away, and the strange thing was that from the moment I saw it, eventhough it was relatively far away, I felt like everything was moving in slowmotion - kind of like when you are in a dream and are being chased but findyourself unable to run...it was a strange feeling...as the object got closerwhich it did rapidly I saw it as clear as day above the building across thestreet - it was huge and white and diamond-shaped and had a large red insigniaof a bird on it - the birds head was turned to the left and the wings werefacing down. There was no detailing on the insignia at all, it was just in thesilhouette of a bird. As soon as it disappeared from my view because it movedpast my line of vision from the window I snapped out of it and was startled tosay the least although surprisingly I was not scared at all, just excited. Iran into the living where my parents were having guests over and announced muchto their dismay I had seen a UFO which of course no one believed...and it wasstrange because I remembered everything with crystal clarity after it happenedbut as the day went on the memory faded, like when you wake up from a dream andyou remember it perfectly but later on the memory is clouded. My first thoughtwas to dismiss it as a hallucination, but a few months later I saw an article inThe National Enquirer,of all places, I believe, about a couple in Indiana whohad seen the EXACT SAME THING - they even drew it, which scared the Hell out ofme because there was no mistakign what I had seen. So if people hundreds ofmiles away had seen it too I knew I wasnt crazy. Not long after, my family wasdriving to Chicago to visit relatives. We were on a stretch of Route 80 inPennsylvania at about 330 am when my sister and I were awakened by my parentsshouting...it seems a saucer shaped craft had been hovering in front of t"],"Case Number":"2461","Date of the Event":"11/30/1977 01:00 UTC","Source":"MUFON","Region":"New York","Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/2461.html.txt","/var/www/straped/mufon/org/2461.html"],"Weather Factors":"Unknown","Disposition":"Insufficient Data","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 30th 1977"]}