{"files":["/var/www/straped/mufon/html2text/24618.html.txt","/var/www/straped/mufon/org/24618.html"],"Sighting Duration":"Undisclosed","Summary":"Mass U.F.O sighting above my house.","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around November 17th 1972"],"Viewing Distance":"Unknown","Case Number":"24618","Object Shape":"Egg","Date of the Event":"11/17/1972 12:00 UTC","Object Features":"Undisclosed","Log Number":"US-07182010-0010","City":"Louisville","Disposition":"IFO","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was at work in the upstairs of my home when my friends (around ten or twelve of them), started screaming and hollering for me. there was a very erie electrical storm, all lightning but no thunder or wind, and when I got outside I saw at least 15-20 spherical orbs flying very low in formation. In the center of each orb there was a brilliant light. very bright lights came from the center of them, with colors like I'd never seen before. They started to 'power down' the lights. Then some of them took off into the sky. one landed or at least appeared to. the others seemed to just be following the storm. as the lights were dimming, I could see that they were not exactly spherical but more like misshapen eggs. And they were see-thru. I felt like crying and laughing at the same time!!! I have always believed in the extraterrestrial and to witness this was one of my greatest moments in life. I wish i could've taken a picture with my phone but I'd left it upstairs. Won't leave home without it from now on. Called the news but they seemed uninterested. The objects would sometimes stop and start, sometimes appearing to be frozen in space."],"Source":"MUFON","Latitude":"38.261795","Weather Factors":"Unknown","Date Submitted":"07/18/2010 11:00 UTC","Longitude":"-85.752306","Tags":"City","Region":"Kentucky","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.261795,+-85.752306(24618)&iwloc=A&hl=en\"> mufon case (24618) map </A>"}