{"trends":["There have been 2 other sightings in Plattsburgh","There was one other sighting in Plattsburgh on or around July 5th 2010"],"Date of the Event":"07/05/2010 01:30 UTC","Disposition":"Unresolved","Tags":"City","Case Number":"24614","City":"Plattsburgh","Longitude":"-73.446222","Object Flight Path":"Stationary,Path with directional change","Latitude":"44.700807","Region":"New York","Country":"United States","Weather Factors":"None","divs":["Sighting DetailsNorth Country, New York. Early morning 5th of July, I'm relaxing in my hot tub enjoying the southern view of the night sky when I notice that Venus has what appears to be a \"twin\" nearby. After about 10 minutes I notice that this twin begins to move in a north-east direction. My first thought was this is a low flying satellite passing over because of its brightness. However, as it continued to travel NE it got brighter and brighter. At its brightest it then turned gently due East remaining bright for another 20 seconds and then it just kind of faded away as if it was turning off its one very bright light. (Notice I said light and not lights) I estimate the altitude of this flying bright white light at about one hundred thousand (100,000) feet up at a speed of nine hundred (900) mph. There was absolutely no sound of any kind. No emissions of any kind. No sonic boom, no UFO whiny sound, no jet engine, no helicopter wop-wop, no propeller engine sound... just errie silence and wondering WTF I had just observed. To this day my gut feeling tells me I either witnessed an Alien spacecraft of some kind or this was a sign from God telling us that they or he exist. How can this star-like bright object just float there disguising itself as just another star in the sky for at least 10 minutes then make itself noticeable when it began to move? That's the question I ask myself... why did it move? Was it trying to communicate with us? I wouldn't have been the least suspicious that Venus had this twin nearby unless it moved. Now I'm a believer in something heavenly but what should it be.... UFO or GOD?"],"Summary":"4th of July UFO.","files":["/var/www/straped/mufon/html2text/24614.html.txt","/var/www/straped/mufon/org/24614.html"],"Log Number":"US-07182010-0006","Source":"MUFON","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Features":"None","Date Submitted":"07/18/2010 03:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.700807,+-73.446222(24614)&iwloc=A&hl=en\"> mufon case (24614) map </A>"}