{"Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Carrier Mills","This sighting has never been favorited."],"Disposition":"Insufficient Data","Object Shape":"Disc, Sphere, Other, Unknown","Tags":"City","Case Number":"24625","Region":"Illinois","Date Submitted":"07/18/2010 04:04 UTC","Longitude":"-88.632833","Latitude":"37.684216","files":["/var/www/straped/mufon/html2text/24625.html.txt","/var/www/straped/mufon/org/24625.html"],"City":"Carrier Mills","Source":"MUFON","Viewing Distance":"Unknown","Summary":"Round object appeared, fluorescent white disk.","Object Features":"None","Sighting Duration":"Undisclosed","Log Number":"US-07182010-0017","map":"<A HREF = \"http://maps.google.com/maps?q=37.684216,+-88.632833(24625)&iwloc=A&hl=en\"> mufon case (24625) map </A>","Date of the Event":"09/15/2003 09:45 UTC","Weather Factors":"None","Country":"United States","divs":["Sighting DetailsStanding on front porch of house, looking south by southwest, appeared flourescent white round disk the size of the moon, stationary, no strobing lights or anything like that...just solid bright white light. Dimmed down to a bright grey, then went from bright grey to medium grey, at that point, I saw the surface of this thing, it closely resembled the texture of orange peel. Then it dimmed down to a darker grey, to real dark grey, then began moving in a southwest direction. When I first saw the round disk, I thought it was the moon, til I looked directly east and realized the moon was in that position in the sky. It was a full moon that night. Then I looked south again, compared the object to the size of the moon, realized the object was larger than the moon. Approximately 300 ft. in diameter, hard to estimate how high up it was. Just before this happened, me and a friend were joking about boarding a space ship if it landed in the front yard, and we would travel to other galaxies. I guess it was hearing our conversation. If you need any more info, you can call me. Thanks"]}