{"Viewing Distance":"Unknown","Log Number":"US-07182010-0015","Case Number":"24623","Summary":"Lika a pole with two round lights moving around the pole.","Longitude":"-117.810092","Object Features":"Other","divs":["Sighting DetailsI was playing tennis with my partner (who is a scienctist), and i was facing North when I spotted a very bright light in the sky. I asked my partner if he could identify the object in the sky. He noticed that the object was moving from West to East at a very low speed, but quite high. Then all of a sudden the object stop moving and just stood there for a while. Then it started to move toward our direction and the lights were getting brigther. My partner ran inside his home and grabbed his binoculars. A minute later when he return, we noticed that the object had started to move back to the West for a short while and stop. At that point we were able to see the object with our binoculars and noticed that it looked like a pole standing up with two bight lights around the pole, which one kept changing direction from the top of the pole to the bottom of the pole. All this lasted approximately 30 minutes. The object proceeded to move West and disappeared into the horizon. Several months back we were also playing tennis when I noticed a sphere in the same area in the sky traveling from East to West at a high rate of speed. At that time I was playing tennis with two partners who are PHd's and they were not able to identify the object."],"Weather Factors":"Unknown","trends":["There have been 6 other sightings in Yorba Linda","There were no other sightings in Yorba Linda on or around July 18th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.892276,+-117.810092(24623)&iwloc=A&hl=en\"> mufon case (24623) map </A>","Object Shape":"Square, Rectagular, Star-like","Tags":"City","Date Submitted":"07/18/2010 03:35 UTC","City":"Yorba Linda","Latitude":"33.892276","Source":"MUFON","Date of the Event":"07/18/2010 10:30 UTC","Object Flight Path":"Path then hovering","Disposition":"Unknown","Region":"California","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24623.html.txt","/var/www/straped/mufon/org/24623.html"],"Country":"United States"}