{"map":"<A HREF = \"http://maps.google.com/maps?q=39.668504,+-121.331288(24622)&iwloc=A&hl=en\"> mufon case (24622) map </A>","Date Submitted":"07/18/2010 03:35 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Insufficient Data","Log Number":"US-07182010-0014","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Disc, Oval","Summary":"Two campers witness two craft perform unusual acts.","Object Features":"None","City":"Berry Creek","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Weather Factors":"None","Latitude":"39.668504","files":["/var/www/straped/mufon/html2text/24622.html.txt","/var/www/straped/mufon/more/24622_submitter_file1__ufosketch.png","/var/www/straped/mufon/org/24622.html"],"Region":"California","Country":"United States","divs":["Sighting DetailsAt approximately 2330 hrs on Thursday, July 10th 2010 my cousin and I were finishing our BBQ dinner at our campsite in the mountains of Berry Creek, CA. We heard a thunder-like sound and a single, bright, red light flew overhead. My cousin and I are both Iraq combat veterans and the sound did not sound like any fighter plane or aircraft we were familiar with. The sound was very brief, unlike the sound of an aircraft flying overhead. The red dot stopped above a mountain ridge and held position, then several yellow lights appeared around the red light and began moving in sequence as if they were spinning. After holding position for a couple of minutes, am identical light formation appeared to the left of it. The first craft held the same position as the second craft performed maneuvers impossible for a conventional aircraft to achieve; the craft was able to move vertically and laterally without the pattern of lights changing. Unsure of what the objects were but convinced that they were not possibly any aircraft we could identify, both my cousin and I retrieved our rifles from our truck and continued to keep visual contact with the two unknown objects. We continued to watch the second craft perform its maneuvers for the next couple minutes while the first one stayed in place with both of them seemingly staying at the same range from us; after around 10-15 minutes, both craft vectored apart laterally and disappeared from our vision as they flew away from us into the distance."],"Case Number":"24622","trends":["There have been no other sightings in Berry Creek","This sighting has never been favorited."],"Longitude":"-121.331288","Date of the Event":"07/15/2010 11:30 UTC","Source":"MUFON"}