{"Object Features":"None","Region":"Nebraska","Sighting Duration":"00:06:00","Source":"MUFON","City":"South Sioux City","Log Number":"US-07182010-0025","Object Flight Path":"Straight-line path","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/24633.html.txt","/var/www/straped/mufon/org/24633.html"],"Summary":"6-8 people witnessed with me a red to orange orb pass over head for about 6min in duration.","Viewing Distance":"Over One Mile","Date Submitted":"07/18/2010 06:51 UTC","Disposition":"Unknown","Longitude":"-96.4121","divs":["Sighting DetailsWhile lighting fire works one of my children noticed something moving in the sky that was abnormal. My wife and the others took notice while i continued to light firworks, a few minutes after the initial sighting my wife said \"hey terry theres your ufo\" kinda of making fun of me i stop to look and was astonished by what i was seeing the other adults with me also stop what they were doing to see. It was moving along in the eastern sky from north to south right over south sioux city NE, it was most likely above the missouri river which is about 3miles from my home. I Was reddish orange and seemed to pulsesate growing brighter and dimming at a steady pace like breahting. I watched for min called for my daughter to get my camera phone from the house , which she did but by time she came out it was too far gone to see. I dont believe my phone would have produced a quality image any how. The object never took off super fast it just went steady along untill it was not visible any longer. I had not giving it much that thought anymore untill yesterday 7-17-10 when my daughter and her cousin were googling 4th of july ufo sightings , they came to me and showed me that there had almost identical sightings all over the country and even in britian and new zealand, to me this could have been dismissed easily had not been that all the footage i saw and what i have read is almost identical to our experience. Pretty intriguing"],"Case Number":"24633","trends":["There has been one other sighting in South Sioux City","There were no other sightings in South Sioux City on or around July 4th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.465951,+-96.4121(24633)&iwloc=A&hl=en\"> mufon case (24633) map </A>","Tags":"City","Date of the Event":"07/04/2010 09:15 UTC","Latitude":"42.465951","Weather Factors":"Unknown","Country":"United States"}