{"Date Submitted":"07/18/2010 10:05 UTC","City":"Huntley","Longitude":"-88.428142","Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24636.html.txt","/var/www/straped/mufon/org/24636.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.16808,+-88.428142(24636)&iwloc=A&hl=en\"> mufon case (24636) map </A>","Summary":"Very small black object moving slowly across the western sky.","Weather Factors":"Unknown","Date of the Event":"07/18/2010 08:45 UTC","Object Shape":"Cone, Circle, Diamond, Oval, Sphere, Teardrop, Triangle, Other, Unknown","Tags":"City","Case Number":"24636","Region":"Illinois","divs":["sighting detailsi was looking out a west-facing window towards the just fully set sun and noticed an almost invisible black object moving across the sky near venus. the size\\distance was hard to gauge, but seemed fairly far, at least hundreds\\thousands of feet if not miles. i continually kept my gaze on it having to sometimes re-focus using my peripheral vision as it moved out of sight. it seemed to disappear completely about halfway across my field of vision near to where the moon was in the southern sky, but due to the difficulty in keeping track of it it could have simply faded from visual. it didn't move fast or erratically, just in a lazy\\constant\\straight nnw to sse trajectory. there were no obvious lights, though at times i could see very faint, erratic and randomly placed white lights but it could have been a trick of the eyes since it was hard to see. definitely didn't appear to be a jetliner or passenger plane. may have been a high-flying bird, stray balloon, or low-flying satellite. identification was essentially impossible. the shape was difficult to make out, at times seeming like a circle\\oval\\sphere then a triangle\\diamond, i attributed this difficulty once again to its size\\distance and not necessarily any shape-shifting property."],"Latitude":"42.16808","Log Number":"US-07182010-0028","trends":["There has been one other sighting in Huntley","There were no other sightings in Huntley on or around July 18th 2010"],"Object Features":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown"}