{"Case Number":"2463","Object Shape":"Undisclosed","Object Features":"Undisclosed","City":"El Cajon","Date of the Event":"07/28/2003 10:17 UTC","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around July 28th 2003"],"divs":["Sighting DetailsI,Bud Harper was sitting outside,in front yard when I noticed what I thought wasa falling star brighter than usual.The object seemed to be falling from right toleft at aprox.40 to 45 deg.As it fell I said to my wife look,look,and as sheturned to look the object seemed slow just a bit and make a noticible roundedturn to the right and proceeded to fall in E.S.E direction and at a less steepor flatter angle,aprox.12 to 15 deg.My Wife didnt have time to see it.By thetime I told her to look 3 seconds had elapsed and it turned sped off was another2 seconds. It was only slightly overcast as I could see some of the brighteststars. Addtionally on 7-29-2003 at aprox. 2330 hours Witness 2 and I were againsitting out front,and this time He says for me to look.As I turned I didnt seeanything. So he describes a very similar occurance as the night before,andwithin no more than 30 seconds he yells there it is again and I turn to see thelight speeding off to a N.E.direction.This second sighting on the second nightby me was aprox.80 to 90 deg.to my left at aprox.1000 O-CLOCK posistion.AsWitness 2 describes second sighting , He says object appeared to make a almostcomplete circle. We concurred that had the lightjudging by its size andbrightnessbeen regular aircraft weed have heard noise,and the speed We witnesseddidnt seem possible at all."],"Source":"MUFON","Sighting Duration":"00:00:59","Country":"United States","Longitude":"-116.962527","Tags":"City","Latitude":"32.794773","Weather Factors":"Unknown","Date Submitted":"07/28/2003 10:17 UTC","Log Number":"","Disposition":"Unknown","Region":"California","Summary":"East San Diego County Night Sightings","files":["/var/www/straped/mufon/html2text/2463.html.txt","/var/www/straped/mufon/org/2463.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.794773,+-116.962527(2463)&iwloc=A&hl=en\"> mufon case (2463) map </A>","Viewing Distance":"Over One Mile","Object Flight Path":"Unknown"}