{"Tags":"City","Latitude":"33.207737","Object Features":"Undisclosed","Country":"United States","Object Shape":"Other","Object Flight Path":"Undisclosed","Date of the Event":"07/18/2010 12:00 UTC","trends":["There have been 11 other sightings in Vista","There was one other sighting in Vista on or around July 18th 2010"],"Date Submitted":"07/18/2010 11:23 UTC","files":["/var/www/straped/mufon/html2text/24639.html.txt","/var/www/straped/mufon/org/24639.html"],"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"California","divs":["Sighting DetailsYesterday I saw and reported the strange sight to MUFON that I had experienced. I decided that I would sit out on my deck at the same time today. I had sat down for no more than 5 minutes when an object appeared to the east of the moon slightly below it this time. It just appeared out of nowhere. I called for my daughter to come see it again. Her friend also observed it. This time the object was moving from east to west at a very slow rate. We observed it for approx. 30 minutes! My son has a hunting scope that we took out this time and got a very good view of the object. To me it appeared like the top of a jellyfish when i first observed it through the scope and to my daughter it looked like half of a circle with indentations on the bottom portion. My final observation was when it was westward and about to be obscured by the trees adjacent to our house the it then appeared to be in the shape of a cylinder. It followed the same route as the object we saw yesterday but in the opposite direction. What is this! My wife also came out and observed it, so thus far I have four other witnesses. Please if you are local look in the direction of where the moon was yesterday and today which is in a mid southerly direction at the same time tomorrow and hopefully you to will see this. I wish I had a high resolution video camera so I could capture it on video but I don't. But if anyone reading this does please look in the direction of where the moon will be or had been on the previous days and hopefully with professional equipment to find out what this object is. Now I am starting to get weireded out about these events. I really didn't think I was going to see it again."],"Summary":"Jellyfish shaped minus the tentacles to cylindrical when it was at another position.","Log Number":"US-07182010-0031","map":"<A HREF = \"http://maps.google.com/maps?q=33.207737,+-117.237856(24639)&iwloc=A&hl=en\"> mufon case (24639) map </A>","City":"Vista","Source":"MUFON","Longitude":"-117.237856","Case Number":"24639"}