{"Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24638.html.txt","/var/www/straped/mufon/more/24638_submitter_file1__P7187954(2).JPG","/var/www/straped/mufon/org/24638.html"],"Log Number":"US-07182010-0030","Object Flight Path":"Undisclosed","Sighting Duration":"00:04:00","City":"Durham","divs":["sighting detailsa strong storm system rolled through the raleigh\\durham area of nc tonight and wiped out power in parts of durham for about two hours. within minutes of the power being turned back on, we saw a bright orange light slowly emerge from horizon of the woods and travel over our neighborhood. it was making no sound and as soon as it hit a certain height in the sky immediately started to move faster. within a minute the orange light had become smaller, flashed twice and disappeared. if you held a silver dollar in the sky with your arm straight it would be an approximate size. i was wondering if you have any insight into what this could be. there have been numerous reported sightings of orange balls just light this, sometimes during storm systems and sometimes during meteor showers. we tried taking the best pictures we could. our neighbors saw the same thing and were visibly distraught. there was no visible tail coming from the light. when we magnified the pictures we saw something very interesting. it looked like there was one orange light and two red lights under it. however that could have been the movement of the camera."],"Country":"United States","Case Number":"24638","Summary":"Orange orb through night sky.","Viewing Distance":"Unknown","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around July 18th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=35.995983,+-78.895039(24638)&iwloc=A&hl=en\"> mufon case (24638) map </A>","Latitude":"35.995983","Object Shape":"Saturn-like, Triangle, Other","Object Features":"Undisclosed","Date of the Event":"07/18/2010 09:40 UTC","Disposition":"Unknown","Date Submitted":"07/18/2010 11:16 UTC","Region":"North Carolina","Weather Factors":"Unknown","Longitude":"-78.895039"}