{"Country":"United States","Disposition":"Insufficient Data","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24643.html.txt","/var/www/straped/mufon/org/24643.html"],"Date of the Event":"07/19/2010 01:33 UTC","Object Shape":"Cigar, Cylinder, Diamond, Teardrop","Log Number":"US-07192010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=26.127586,+-80.233104(24643)&iwloc=A&hl=en\"> mufon case (24643) map </A>","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsNot first time I've seen something in the sky recently. This was especially odd. I would move my chair to block it out of view and it would move to come right back into sight. I didn't want to see this thing. I am getting a good video camera soon... This white light would remain in one spot. But would move as I moved. I would place a palm tree in front of it and it would quickly move back to where I could see it and begin flashing the top with red lights and then the bottom with red lights. Gave me goose bumps. I have seen crazy weird things in the sky over the last month. Scariest being two events. One, seemed to be a missile chasing a object and then both just vanished. It seemed the missile object was incinerated. Broken down into its basic elements, because it had a strange, light rain-like drizzle falling to my rad after it was gone. 2nd, a odd shadow , shot across the sky in a very quick movement. Directly over my home. There was black helicopter flying around my house, in a \"grid pattern, I use that term loosely\" a few days after, with green, red and blue lights. Never seen a helicopter with green or even blue lights before! I have seen and experienced some odd things. And I hate whatever decided to show \"this\" to me. Because when I try to tell my family what happen it is like a joke. So I pretend I'm messing around so they don't think I am loony. Happens over Plantation, Fl(right beside Ft.Lauderdale)"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"Florida","Object Features":"Other, Unknown","Sighting Duration":"Undisclosed","City":"Plantation","Case Number":"24643","Latitude":"26.127586","Tags":"City","Longitude":"-80.233104","Date Submitted":"07/19/2010 01:50 UTC","trends":["There have been 6 other sightings in Plantation","There were no other sightings in Plantation on or around July 19th 2010"],"Summary":"White light. Top and bottom flas red lights. Non moving"}