{"Log Number":"US-07182010-0032","Summary":"A UFO and what appears to be a star dancing with each other.","files":["/var/www/straped/mufon/html2text/24640.html.txt","/var/www/straped/mufon/org/24640.html"],"Disposition":"Insufficient Data","Weather Factors":"Unknown","Date Submitted":"07/18/2010 11:33 UTC","Source":"MUFON","Country":"United States","Object Shape":"Star-like","City":"Rogers","Region":"Arkansas","Sighting Duration":"Undisclosed","Latitude":"36.339","Date of the Event":"07/18/2010 12:00 UTC","divs":["Sighting DetailsOkay, I was standing outside watching the sky like I do every night, watch a few star like ufo go by (or what I assume are ufo) when a thought jumped into my head. What if I some UFO's dancing? I somewhat chuckled to myself at the idea. I was staring at the ground pondering on it when I decided to look up. At that exact moment I see a ufo dancing with a star. I call it dancing beacause the star and the ufo were moving in a circle in such a fashion that it was like watching two people waltz from a birds eye veiw. They were rotating closer and further away from each other in a counter clockwise circle until they reach the head of the constellation Draco. The UFO departed from the star sending it in the opposite direction; toward its original resting place. The UFO went to the center of Draco's head and went up into space dissapearing in the blink of an eye. The star slowly went to where it NOW resides. I came inside and immediately brought up google earth. I zoom in on draco and come to find out that the star that was dancing with the UFO was actually the foot of the constellation Hercules. I am utterly amazed and astonished at what I just witnessed. My initial thought was \"How come I thought of a UFO dancing then actually saw one?\". Im still not entirely sure. Was the UFO bending the light of the star? causing it to dance with it in a counter clockwise fashion or did the star actually MOVE? Im quite baffled at what I saw and if anyone has any comments or questions you can reach me at Kataklyzm0@yahoo.com And to all you UFO hunters out there. GOOD LUCK AND KEEP YOUR EYES ON THE SKIES!"],"Tags":"City","Viewing Distance":"Over One Mile","trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around July 18th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.339,+-94.109617(24640)&iwloc=A&hl=en\"> mufon case (24640) map </A>","Object Features":"Unknown","Longitude":"-94.109617","Object Flight Path":"Path with directional change","Case Number":"24640"}