{"Latitude":"39.961265","Weather Factors":"Unknown","Log Number":"US-07192010-0001","Summary":"Bright light near Phila airport.","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=39.961265,+-75.155399(24642)&iwloc=A&hl=en\"> mufon case (24642) map </A>","divs":["sighting detailson the eve of sat 07\\17\\10 i went outside to have a last cig before going to sleep. i went out approx 12:30 - 12:45 am (on sun 07\\18). as i was smoking, and listening to the ambient noise i looked up to notice that the night was pretty overcast. the stars in the night sky were very muted. upon looking east, i saw 1 light that was very bright, unlike the rest of the sky. as i was looking at this light i realized that it seemed very low. it was very far away, but i would guess it's position to be very near phl airport. in my novice opinion, i would say the altitude was approx 5000ft. i watched it for approx 45 minutes to 1 hour, and went to bed just past 1:30am. the light remained motionless the entire time (although occasionally seemed to move side to side, but i attribute that to my tiredness & 47yo eyes). there was no sound at all. curiously i only saw one plane during the whole time, which was heading north at very high altitude. even at high altitude, i could still faintly hear the plane, and even made out the blinking light a few times. i watched the light for 45 minutes or so, hoping i would see some movement but never did. i went to bed troubled because it's brightness in the sky seemed so out of place. i have been checking the sky all night tonight, and although very overcast, it is now 24 hrs later, and there is nothing in that position at all."],"Date of the Event":"07/19/2010 01:00 UTC","Viewing Distance":"Over One Mile","Longitude":"-75.155399","Source":"MUFON","Object Features":"Unknown","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around July 19th 2010"],"Case Number":"24642","City":"Philadelphia","Date Submitted":"07/19/2010 01:22 UTC","Disposition":"IFO","Tags":"City","Sighting Duration":"01:00:00","Country":"United States","files":["/var/www/straped/mufon/html2text/24642.html.txt","/var/www/straped/mufon/org/24642.html"],"Object Flight Path":"Stationary","Region":"Pennsylvania"}