{"Case Number":"24648","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/24648.html.txt","/var/www/straped/mufon/org/24648.html"],"Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-82.138852","Date Submitted":"07/19/2010 06:44 UTC","Viewing Distance":"Over One Mile","Weather Factors":"None","Object Shape":"Circle, Disc, Star-like","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=29.196099,+-82.138852(24648)&iwloc=A&hl=en\"> mufon case (24648) map </A>","Country":"United States","Summary":"Rotating, flashing, star descends and hovers over western Florida sky nightly.","Disposition":"Hoax","Source":"MUFON","divs":["Sighting Details At approximately 8pm every night (except on cloudy nights), a star like image descends from space very quickly and hovers in the western sky. Moves erratically and flashes white in different directions while a red, green, blue or gold light flashes on top occasionally. Sometimes it releases smaller balls of light from below and they shoot off out over the woods in various colors of their own. These smaller ones grow in size as they get closer and continue to hover over the surrounding woods around us while the first one descends out of sight. While the first one is high in the sky, planes fly behind it and I have driven my car 14 miles and have been able to get behind it as well. I have also been chased by it, as I have been driving on various roads such as Rt.40. However, when I have tried to get a picture or just stop and observe it vanishes in the blink of an eye. 1) Since this occurs almost every night, I stand in my driveway or on my back steps and wait for it. Watching it to see if anything changes. 2) Noticing the object is not a problem for anyone in my neighborhood because; we live in such an open area with not many trees. It was the brightest thing in the sky at the time and moving slowly downward. 3) I thought it was a helicopter at first. However, upon continuous watching, it releases others from below. 4) Erratic behavior. 5) All the while during the viewing of the object, my feelings are of want and desire for friendly confrontation. 6) Losing sight of the object is easy. It goes far enough below tree line and or vanishes on the spot. Also in the past few nights, glowing yellow orbs have been seen floating through the trees approximately 500 to 1000 feet from my home. In the west but, many more in the east. Some other colored orbs have been spotted wondering above treetops. Causing dogs that live in that area to howl and whine excessively. All sightings are witnessed by myself and others of my household."],"Log Number":"US-07192010-0007","City":"Ocala","Object Flight Path":"Path then hovering","Latitude":"29.196099","trends":["There have been 21 other sightings in Ocala","There were no other sightings in Ocala on or around July 1st 2010"],"Date of the Event":"07/01/2010 08:00 UTC"}