{"Date Submitted":"07/19/2010 09:47 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Case Number":"24650","Tags":"City","Log Number":"US-07192010-0009","trends":["There have been 4 other sightings in Yadkinville","There were no other sightings in Yadkinville on or around July 17th 2010"],"Summary":"I saw this object located at app 10 o'clock in the sky east of me and it moved back and forth and up and down.","Longitude":"-80.655538","Object Flight Path":"Stationary,Other","Object Features":"None","Source":"MUFON","Latitude":"36.135811","map":"<A HREF = \"http://maps.google.com/maps?q=36.135811,+-80.655538(24650)&iwloc=A&hl=en\"> mufon case (24650) map </A>","Disposition":"Unknown","Weather Factors":"None","Date of the Event":"07/17/2010 02:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/24650.html.txt","/var/www/straped/mufon/org/24650.html"],"Object Shape":"Cylinder, Other","divs":["Sighting DetailsIt was app 2 AM in the early morning on sat 7-17-2010 at my home. I had let one of my dogs outside to relieve herself. I had walked out on the front porch and then out beside the house on the north side and just stood there looking for her and enjoying the night air. I had not turned any lights on because I like to look at the stars at night and while looking to the east of my house at an app 45degree angle in the sky when I saw this object blinking, or at least that is the best way I can describe it. At first glance I thought it was either a plane or a planet because it was much larger than a star. I stood there watching it for a few minutes and determined it was not a plane because it was stationary, then it started moving, back and forth and up and down. The object was shaped like a barrel with a smaller barrel at the top and has more than one color of lights on it. The size of the object was app twice the size of the eraser on a lead pencil. This went on for app and I will say 20m minutes because I felt like I had been there for some time as my legs were getting tired from standing still. I thought about getting my cell phone and trying to take a pic of it and went back on the porch and let my dog in the house. After I let her in I decided to see if it was still there so I walked back across the front porch and out beside the house and looked up again and it was still there. This time it was larger than before but still seemed very far away, how far I would not like to guess because I have no way of estimating. If someone were to ask me to guess and let's say the object was the size of a 747 I would say it was maybe 10 miles away. This time something was different, as I stood there watching it there were some strong feelings of dread that came over me and also like I was being watched. This was a little unsettling so I just went back inside and didn't go back out. I checked the next night at app the same time and nothing was there so, whatever was there the night before was no longer visible. I do not drink or do drugs so for me to imagine this is not probable. I do not know what it was, only that it was not an airplane or a planet because of the way it moved and because it was not there the next night so due to those two reasons the plane and planet are ruled out. One of you staff may contact me if you would like to do so, but please do that between 9:00AM and 4:30PM monday thru friday."],"City":"Yadkinville","Region":"North Carolina"}