{"files":["/var/www/straped/mufon/html2text/24659.html.txt","/var/www/straped/mufon/org/24659.html"],"Object Flight Path":"Straight-line path","Case Number":"24659","Sighting Duration":"Undisclosed","Date of the Event":"11/30/2002 12:00 UTC","Longitude":"-71.279058","Summary":"Not Provided","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsWe were traveling south on Route 95 just before exit 4 in Massachusetts on our way back to RI from a day in Boston. It was about 9pm when we noticed some lights in a V formation traveling west to east over the highway. My first thought was that they were military jets of some sort. However the formation was not very tight and looked a bit sloppy if I had to say. There were about 5 objects that from our perspective were orange lights that had a bit of a sparkle to them. I ruled out a satellite or planes as the way they were moving seemed odd and were below the clouds. I pulled over in a rest area and got out to get a better look ( there were four other people in the vehicle that also saw this.) The formation of 5 began to diminish in luster and blinked out or faded away. Then two more trailing those came over the tree line aprox 60 degrees from the horizon - there wasn't any sound. I took a video with my blackberry and was able to capture one of these objects. The quality is not too good but it appears to flash or sparkle - not like any aircraft I've seen ( the moon is also in the video). About three more came over the tree line and traveled to the west before they too faded out (all object were moving rather slowly). Almost like when a satellite moves out of the sunlight. It was very weird to see this and I immediately thought of how similar it looked to video I've seen of the phoenix lights. the color of these lights were orange and steady - in that they didn't blink like an airplane. I'm not sure what these objects were, but they seemed very out of the ordinary."],"Log Number":"US-07192010-0018","map":"<A HREF = \"http://maps.google.com/maps?q=41.951184,+-71.279058(24659)&iwloc=A&hl=en\"> mufon case (24659) map </A>","City":"Attleboro","Disposition":"Unknown","Object Shape":"Flash, Star-like","Latitude":"41.951184","Tags":"City","Region":"Massachusetts","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"07/19/2010 06:59 UTC","Source":"MUFON","trends":["There have been 8 other sightings in Attleboro","There were no other sightings in Attleboro on or around November 30th 2002"]}