{"divs":["sighting detailsat about 8:30 on monday, july 12th, 2010 myself and several others witnessed 4 to 6 bright red lights in the sky. we were camping at lake rudolph campground in santa claus, indiana. we had just come from the camp ground's ice cream parlor and were enjoying a cone. while we were walking away, the lights appeared in the sky above the tree line, at about 30 to 40 degrees inclination from the horizon. the lights appeared as if from nowhere. at first glance they appeared to be radio tower lights, but they were moving. they also disappeared and then reappeared. these lights hovered, but moved slightly in several directions, including left to right and up and down. they looked similar to flares, but when they reappeared after dimming, and moved in many directions, that thought went away. i felt a bit perplexed. the lights didn't fit any description of what i expected to see in the sky at that time. i was confused by what i saw, as where those witnessing the event with me. i hadn't thought about it again until today, when a co-worker told me he was camping not far from us in a different campground, at the same time. he also witnessed the lights as he was leaving a nearby amusement park (about 1\\2 mile from my location). i watched for 2 or 3 minutes. my wife, who also saw the lights dismissed them as radio towers and walked on. i did not stay and watch them, but when i got back to my camp sight, several hundred yards from the ice cream stand, the lights were still there. at that point, i tended the fire and visited with my family. rather than lose sight, i lost interest in watching them, as they persisted. i do not know at what point they disappeared or moved off."],"Log Number":"US-07192010-0010","Date of the Event":"07/12/2010 08:30 UTC","Object Flight Path":"Path with directional change","Summary":"Several bright red lights appeared one after the other in the SW sky.","Latitude":"38.120054","City":"Santa Claus","Source":"MUFON","Object Shape":"Fireball, Oval, Sphere","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.120054,+-86.914161(24651)&iwloc=A&hl=en\"> mufon case (24651) map </A>","Region":"Indiana","Longitude":"-86.914161","Case Number":"24651","Object Features":"None","Weather Factors":"Unknown","Date Submitted":"07/19/2010 09:52 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/24651.html.txt","/var/www/straped/mufon/org/24651.html"],"Viewing Distance":"Unknown","Disposition":"Unknown","trends":["There have been no other sightings in Santa Claus","This sighting has never been favorited."],"Tags":"City"}