{"trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around July 18th 2010"],"Latitude":"41.886114","Object Flight Path":"Undisclosed","City":"Chicago","Longitude":"-87.627398","Tags":"City","Source":"MUFON","Log Number":"US-07192010-0017","Object Shape":"Sphere, Triangle","Date Submitted":"07/19/2010 05:52 UTC","Sighting Duration":"Undisclosed","Region":"Illinois","files":["/var/www/straped/mufon/html2text/24658.html.txt","/var/www/straped/mufon/org/24658.html"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","divs":["sighting detailssitting on 2nd story balcony of a friend's condo, with 3 other individuals, having a conversation. planes in the o'hare (ord) holding pattern were passing by every few minutes. an object caught my eye, much lower in my field of vision than the planes, and moving in the opposite direction of the typical o'hare bound jet. immediately, i recognized it as not being an airplane, as it was spherical, and chrome\\metallic, very bright from the sun. it also had a triangular \"halo\" shape around it. i felt like my eyes had a hard time focusing on it, which was a strange sensation. it almost appeared fuzzy around the edge of its shape. it seemed to move fairly quickly, but very smoothly. there were quite a few puffy clouds in the sky, and it stayed in front of the clouds as it passed by, so it seemed close, maybe 5-10 blocks away. from what we could tell it was not more than a few hundred feet in the air. it did not appear to be very large. i shouted out \"what is that?\", and one of my friends was able to see it as it passed by as well, and gave almost the same description of the object afterward. our other friend did not have her glasses and could not see it. it traveled on a north east trajectory, and disappeared behind the building. it was actually moving away from o'hare, and toward lake michigan or a northerly direction. another friend, who was not there, later asked if it could have been a mylar balloon. i did not think this could be the case because of the fact that it did not waver or flutter, and traveled on a perfectly straight path, beside the fact that it had the previously mentioned optical effect of being hard to focus my eyes on. we had been watching the planes pass by for a while, and this was in stark contrast to what i saw as far as objects in the sky. i felt somewhat befuddled by what i just saw, especially that there were so many jets nearby, and this was quite obviously not a jet, and not a balloon either. it was not anything common. my friend who did see the object had a racing heart, she actually made me touch her chest because her heart was pounding so hard."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.886114,+-87.627398(24658)&iwloc=A&hl=en\"> mufon case (24658) map </A>","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"Metallic sphere with triangle outline passed by, low altitude, over NW area of Chicago city proper.","Date of the Event":"07/18/2010 06:01 UTC","Case Number":"24658"}