{"Object Features":"Unknown","Longitude":"-82.900673","Sighting Duration":"Undisclosed","Summary":"Spherical and orange pulsing with clouds and lightning.","Case Number":"24655","Date Submitted":"07/19/2010 02:29 UTC","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=40.425227,+-82.900673(24655)&iwloc=A&hl=en\"> mufon case (24655) map </A>","Log Number":"US-07192010-0014","Disposition":"IFO","trends":[],"City":"Undisclosed","Country":"United States","Tags":"City","Date of the Event":"07/16/2010 10:40 UTC","files":["/var/www/straped/mufon/html2text/24655.html.txt","/var/www/straped/mufon/org/24655.html"],"Latitude":"40.425227","divs":["Sighting DetailsMy girlfriend had left for town to pick up some dinner, and called me on the way back, very shaken. She said she was seeing something weird in the south sky. I went out onto the back porch to see if I could see it as well and I could. It was huge. It was a large spherical object with what seemed to be clouds around it. It was orange and there were flashes from what looked like lightning. I quickly checked local weather radar and the lightning map, there was NOTHING on it within 200 miles of us. It stayed in the same place over the ridge of the valley we live in. The wind was blowing and there was not another cloud in the sky, but this didn't move. It was for the most part stationary for about an hour and then moved away from my location heading southeast. I thought at first that it must have been a lightning storm, but the way it just hovered in place and pulsed orange and flashed blue I discarded that idea. I talked to her on the phone asking her questions till she got back. She saw the object the whole drive back to the house after leaving town. She said she saw it above a corn field moving following the road for awhile. She impressed upon me the size of the object being larger than one of the huge barns out here. I would love confirmation of what I had seen whether it was just an electrical storm or if it was a UFO. Tried to get video but by the time I thought about it, the object had finally moved down past the ridge. I have not heard any other people around here talk about it, but it was out in the country after 10:30 at night. (see military and black helicopters all the time out here)"],"Source":"MUFON","Region":"Ohio","Object Shape":"Fireball, Sphere","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet"}