{"files":["/var/www/straped/mufon/html2text/24665.html.txt","/var/www/straped/mufon/org/24665.html"],"Latitude":"46.789612","Region":"Minnesota","Country":"United States","Object Flight Path":"Path then hovering","Viewing Distance":"Over One Mile","trends":["There have been 16 other sightings in Duluth","There were no other sightings in Duluth on or around July 18th 2010"],"City":"Duluth","Longitude":"-92.097425","Object Features":"Undisclosed","Disposition":"IFO","Log Number":"US-07192010-0024","Case Number":"24665","Object Shape":"Star-like","Weather Factors":"Unknown","divs":["Sighting DetailsAfter noticing what looked like a flash bulb (approx 6 flashes over ten minutes) style star anomoly in the western sky on Saturday night, I returned to our deck Sunday evening around 11pm to chat with my wife and gaze in the same general direction between Venus and the moon. After a few minutes I noticed what I always think to be just a run of the mill satellite dot moving perhaps 25 degrees above the moon on a slow path that would take it on a trajectory just above Venus. After a minute or so it became too dim to follow (when it was about halfway between the moon and Venus). So I essentially lost interest and went back to my conversation with my wife. When all of the sudden, slightly to the left of where I lost sight of this \"satellite,\" an extremely bright white light much like a distant flashlight with gathering intensity and size (almost like it was pointing at us from space) gained illumination for about five seconds before dimming gradually and generally moving toward Venus until it dimmed completely out of sight near the location where the original \"satellite\" type dot vanished completely. I actually wasn't even going to post this, but I noticed the nearby sighting in Iowa(250 miles?) that had shockingly similar characteristics as our sightings and occured this weekend in the same western sky (I think). Though the Iowa sighting seemed to have a longer intense light duration than my strange observances this weekend. I will be out again tonight 7-19-10 looking west to the same location to see what pops up and will report any findings here."],"Date Submitted":"07/19/2010 11:32 UTC","Summary":"Ultra intense white light star drifting and dimming in the western sky","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"07/18/2010 11:20 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=46.789612,+-92.097425(24665)&iwloc=A&hl=en\"> mufon case (24665) map </A>"}