{"trends":["There have been 17 other sightings in Cedar Rapids","There were no other sightings in Cedar Rapids on or around June 13th 2003"],"Source":"MUFON","Tags":"City","Date Submitted":"06/13/2003 10:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.97788,+-91.665623(2466)&iwloc=A&hl=en\"> mufon case (2466) map </A>","Region":"Iowa","divs":["Sighting DetailsI was riding in our car on our way home. I was listening to my cd player and itstarted to skip. Our interior lights dimmed in the car so i took off myheadphones and the radio station had started to switch and be inaudible. Icaught a bright light out of the corner of my eye and i saw this red disc justhovering over the corn like a signal light, only it didnt move. I was curiouswhen i first saw it, i knew it wasnt supposed to be there, and during the timethat i saw it, a calm came over my body. i wanted to tell everyone else in thecar, but i couldnt open my mouth or take my eyes off of the disc. i was alittle afraid to know what i wanted to say and not be able to say it, buticouldnt bring myself to say anything. The craft didnt move, it was like a redorbe and it just hovered over the field. I really didnt lose sight of theobject, it faded into the night. I know it sounds cheesy, but it started tomove farther and farther out of the air until it just disappeared. Afterwards,I was afraid sometimes to sleep at night, it wasnt paranoia, but a feeling thati was being watched, which is why it took me so long to report this, but i needan answer. i want to know that im not alone and i want the dreams i have to goaway. please help me understand what i saw that night and why i couldnt sayanything to anyone else in the car."],"Longitude":"-91.665623","Sighting Duration":"00:30:00","Object Features":"Undisclosed","Disposition":"Hoax","Date of the Event":"06/13/2003 10:40 UTC","Object Flight Path":"Straight-line path","Log Number":"","Country":"United States","Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile","Latitude":"41.97788","Summary":"i cant believe what i saw","files":["/var/www/straped/mufon/html2text/2466.html.txt","/var/www/straped/mufon/org/2466.html"],"City":"Cedar Rapids","Weather Factors":"Unknown","Case Number":"2466"}