{"trends":["There has been one other sighting in Brackettville","There were no other sightings in Brackettville on or around March 31st 2008"],"City":"Brackettville","Object Features":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Summary":"this object or light was spotted on a google earth image taken on 3/31/08","Tags":"City","divs":["Sighting DetailsI was scanning the west Texas land in Leona Ranch for hunting properties to purchase when I came upon this weird object in the imagery. The latitude is 29.505872 degrees. The longitude is -100.334474 degrees. It is a bright white circular light. Very intense. It measures about 26 feet in diameter. It has a pinkish hue around the white light that turns to neon blueish color. The diameter of the blue glow is measured as approximately 60 feet. It appears to be over a patch of trees. When I zoom in as much as possible, I cannot see through the light. I thought it might be reflection off of a parabolic reflector or something, but there is a house about 500 feet away and if they were to place a reflector, there seems to be plenty of open space closer to the house and not in the trees. it is a spooky looking image. What the hell is that!!!!???? This image is there for everyone to see, but I bet it will disappear soon.. It is the strangest thing I have seen in years of examining satellite photos on Google.... Someone let me know what they think!! I don't know how to attach the image, but if you go to Brackettville, Texas and then, go to the lat and long I have given, you will find it. Super weird, man!"],"Date Submitted":"07/19/2010 11:50 UTC","Case Number":"24666","Object Flight Path":"Stationary","Date of the Event":"03/31/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.310512,+-100.417856(24666)&iwloc=A&hl=en\"> mufon case (24666) map </A>","Latitude":"29.310512","Viewing Distance":"Unknown","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/24666.html.txt","/var/www/straped/mufon/org/24666.html"],"Country":"United States","Region":"Texas","Log Number":"US-07192010-0025","Disposition":"IFO","Longitude":"-100.417856"}