{"Object Flight Path":"Stationary","Log Number":"CA-07202010-0006","Date of the Event":"07/20/2010 01:30 UTC","Object Features":"Undisclosed","Summary":"I woke up in the night, saw a flash of blue light and saw a shape in the sky outside my window.","Case Number":"24672","Object Shape":"Saturn-like","Weather Factors":"Unknown","Region":"New Brunswick","Latitude":"45.96538","Sighting Duration":"Undisclosed","divs":["sighting detailsi was sleeping in my bed, and i thought i had been lying there for hours but come to find out after, it was actually only 1:30am. anyways, i'm having a normal dream, which i can remember. all of a sudden, in the dream, there was a really loud repetitive pounding drumming. it took me a while to notice it, but when i did i thought 'this isn't right, this doesnt make sense in my dream'. so it is at this point that i wake up (or so i think). the drumming is coming from only one side of the room, the side with the door, so i turn my head to look. i don't see anything so i turn my head back toward my window on the opposite wall. i'm definitely awake at this point, and i no longer hear the drumming. when i look at my window i see a flash of blue light. my blinds are closed, but the light is bright enough that i can see through them, and i can see something floating in the sky outside my window. the object looks like a thick dark line with a haze around it. it goes dark again, but now there's a shadowy figure\\shape drifting into my room from the window. it is getting closer and closer to me, and i am starting to panic, but i can't move because it feels like something is pushing on my back. i felt pinned to my bed. it gets close enough that i can touch it, and finally i'm able to pick up a pillow and swat at it. it then just dissipates into nothing. at first i felt confused by the drumming, and then i felt terrified by the moving figure. i'm not sure what this was, but i have never experienced anything like this before."],"Tags":"City","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/24672.html.txt","/var/www/straped/mufon/org/24672.html"],"Country":"Canada","trends":["There have been 8 other sightings in Fredericton","There were no other sightings in Fredericton on or around July 20th 2010"],"Viewing Distance":"21-100 Feet","Date Submitted":"07/20/2010 10:52 UTC","City":"Fredericton","Longitude":"-66.638015","map":"<A HREF = \"http://maps.google.com/maps?q=45.96538,+-66.638015(24672)&iwloc=A&hl=en\"> mufon case (24672) map </A>"}