{"Weather Factors":"Unknown","City":"Titusville","Object Features":"Patterned Surface","divs":["Sighting Details I was walking my dog at about 1030 p.m. and looking at the stars while waiting for my dog to do his business when I noticed a bright star-like object in the NW sky that seemed like it was moving. I watched for about twenty minutes before taking my dog inside. It moved closer during that time. I got a pair of binoculars and continued to watch from my back deck. I steadied the binoculars by leaning against a deck pillar. The object was in the NW sky and looked crescent shaped and indeed was moving in a random pattern with a trail of rainbow colors. It moved extremely fast and with bizzare whips and turns, very similar to a child with asparkle action. It was probably more than 30,000 feet up as we live in a rural area on top of a mile high mountain in western PA. It was higher than most of the airplane flight paths. After I had watched it for more than half an hour, I noticed another UFO in the Northern sky, lower than the first, more Northly direction. It was fainter, but with deffinent movement and a round white shape. I couldnt tell if it was one small UFO moving rapidly from right to left or a large UFO with pulsating white lights along its center. I observed both UFOs together, but they didnt seem to be communicating together. The one in the NW sky was moving about erratically, while the one in the North sky seemed more stable a hovering. I oberved them for a total of about 45 minutes. I came in the house and went to bed, hoping that whatever they were that they would stay aloft and away. The next morning I didnt feel well for a few hours and I am very healthy and rarely feel sick. I did feel better by the afternoon, but wondered if anything had happened that I didnt remember."],"Latitude":"41.627004","Country":"United States","Tags":"City","Log Number":"","Case Number":"2467","Date of the Event":"07/30/2003 10:31 UTC","Source":"MUFON","Region":"Pennsylvania","Disposition":"Insufficient Data","Longitude":"-79.673663","Object Shape":"Boomerang","Sighting Duration":"01:00:00","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.627004,+-79.673663(2467)&iwloc=A&hl=en\"> mufon case (2467) map </A>","trends":["There have been no other sightings in Titusville","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/2467.html.txt","/var/www/straped/mufon/org/2467.html"],"Date Submitted":"07/30/2003 10:31 UTC","Summary":"Two UFOs in North Sky","Viewing Distance":"Over One Mile"}