{"Date of the Event":"07/19/2010 08:20 UTC","trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around July 19th 2010"],"Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Bullet, Missile, Sphere, Square, Rectagular, Star-like, Other, Unknown","Log Number":"US-07212010-0003","Sighting Duration":"Undisclosed","Summary":"Driving on 405N Fwy with friend, both see starlike object with rectangular? tail.","divs":["Sighting DetailsMy good friend and I were driving N. on the 405 FWY near Torrance area passing Crenshaw Blvd. I was driving, I noticed a bright star like object. it had a white rectangular tail of some sort that seemed to go out of the atmosphere. I am confused by what I saw and have seen it in the area multiple times. In different areas, at different view points. I submitted GOOD photos of what I had seen before. I wish I could have take photos of this. It starts out looking like a small cloud like object, then almost looks like a needle with slight ovular a loop in the top end. It eventually gains a bright star like point and all together vanishes. If someone else saw this please contact me, I wear glasses, but this I saw clearly multiple times. It was a tiny bit cloudy but did not hinder visibility. I would estimate it was high, but low enough to where driving down the freeway I was able to \"swing\" around it a tiny bit. I would have to guess it came from the north west towards the south east and then curved up in to space. I am familiar with all sorts of helicopters and aircraft and it was nothing like them. It was not stars, or weather phenomenon either. At one point It looked like the star was the tip of something in our atmosphere. In a since it is almost more bizarre to me than if I had a close encounter. And since I have seen it more than once I feel like its teasing me now. My friend who is educated and knowledgeable like me could not figure out what it was either. I will keep my eye out for it again and try to take more pictures of the phenomenon. I marked partially cloudy, but it was slightly cloudy. It always it overcast heading in towards LAX. We were going to Fry's Electronics. -Chris"],"Country":"United States","Weather Factors":"None","Source":"MUFON","Longitude":"-118.334339","Latitude":"33.838339","Disposition":"IFO","City":"Torrance","Object Features":"Patterned Surface, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.838339,+-118.334339(24684)&iwloc=A&hl=en\"> mufon case (24684) map </A>","Date Submitted":"07/21/2010 01:55 UTC","files":["/var/www/straped/mufon/html2text/24684.html.txt","/var/www/straped/mufon/org/24684.html"],"Case Number":"24684","Region":"California"}