{"Log Number":"","Weather Factors":"Unknown","Longitude":"-81.651151","Tags":"City","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around November 30th 1951"],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/2468.html.txt","/var/www/straped/mufon/org/2468.html"],"Date Submitted":"11/30/1951 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.337114,+-81.651151(2468)&iwloc=A&hl=en\"> mufon case (2468) map </A>","Region":"Florida","City":"Jacksonville","Object Features":"Other","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsI was with four other sailors standing watch at the naval air station inJacksonville fl, in the year 1952 .I was the first one to see a light travelingat tremendous speed coming from Jacksonville fl. direction. Then the other threespoted it. It was traveling from N to S and stoped over the naval air station.There was no slowing down , just a sudden stop. The object hovered over thenaval air staion for about 15 seconds. It then either shot straight out or justdisappeared. I think it shot straight up or out. While it was hovering you couldsee a dark spearhead in front of a dim yellow light. I could indentify everyaircraft on the airstaion at that time and this was unlike any thing I had everseen. Two navy Phantom jets the old vintage were scrambled at the same time ofthe appearance. There was a feeling that the base was being probed in the 15seconds it hovered. If I were to guess at the speed before a dead stop , I wouldsay it was traveling at least 6000 miles an hour. Just a guess but the altitudewas about 10000 feet. I do not get excited over anything , which allowed me toobserve without emotions. I know now there is somethin beside us in thewonderful universe. I would not believe UFO reportsif I had not seen this with my own eyes. This incident was reported to thecontrol tower, their reply was that it was just a weather balloon .I am an old timer now and would like to take an interest in this kind ofresearch. Are there any clubs or any thing I can join. My wife is deceased andI have plenty of time on my hands. Thank You"],"Latitude":"30.337114","Case Number":"2468","Sighting Duration":"00:05:00","Object Flight Path":"Unknown","Summary":"black spearhead object over jax air base in fl. b","Object Shape":"Triangle","Date of the Event":"11/30/1951 11:00 UTC","Country":"United States"}