{"Case Number":"24686","Latitude":"29.799754","Region":"Texas","Country":"United States","Longitude":"-98.72589","Source":"MUFON","City":"Boerne","trends":["There has been one other sighting in Boerne","There were no other sightings in Boerne on or around July 19th 2010"],"Viewing Distance":"Unknown","Weather Factors":"None","Disposition":"Unknown","Date Submitted":"07/21/2010 11:25 UTC","Log Number":"US-07212010-0005","Object Flight Path":"Path with directional change","Object Shape":"Boomerang","Date of the Event":"07/19/2010 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.799754,+-98.72589(24686)&iwloc=A&hl=en\"> mufon case (24686) map </A>","Summary":"Silver or titanium , 2 or more lights on bottom.","divs":["Sighting DetailsI set up my telescope for the first time to get a close look at the moon. I was doing my adjustments to see the craters I was using 25mm lens(which shows the whole moon). at that moment this Space craft ( I call it space craft because I could identify it very easily so it wasnt a UFO) It entered my view and when it reached the middle of my lens, it made a complete U turn banking left and when it turned I could see the whole surface of it very clear. thanks the light that moon was creating I could actually see the whole craft in detail. It was the best seconds of my life that I came to accept the fact that Extraterrestrials are here. It was not a satellite. I know the difference between a satellite that enters your lens from right side and crosses at a very high speed and exits your view. this thing was shaped like a boomerang and it was silverish titanium kind of color or material. I could see 3 lines that were dividing the whole craft in 3 pieces. I know what I saw and I dont know if anyone else encountered what I saw and the detail I saw. I consider myself to be one of the luckiest persons alive who actually saw it in detail. I assure you that the craft was below the atmosphere. When I see a satellite on telescope they are just a tiny little black dot travelling at a very high speed. The craft that I saw wasnt travelling more than maybe 200mph. which is very slow for any craft thats in the air. Especially when it entered the U turn, it slowed down quite a bit. I think if any aircraft slows that much in our technology it will stall and just fall out of the sky. because We do not have the technology to use to overcome the gravity. but this craft obviously wasnt limited by our gravitation. If you need any more information on this encounter you can contact me anytime."],"files":["/var/www/straped/mufon/html2text/24686.html.txt","/var/www/straped/mufon/org/24686.html"]}