{"Viewing Distance":"101-500 Feet","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/24682.html.txt","/var/www/straped/mufon/org/24682.html"],"Log Number":"US-07212010-0001","Longitude":"-87.520657","Summary":"Bright orange globe.","Object Features":"Unknown","Region":"Indiana","Object Flight Path":"Straight-line path","Case Number":"24682","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Dyer","There were no other sightings in Dyer on or around July 20th 2010"],"Disposition":"Unknown","Source":"MUFON","Date of the Event":"07/20/2010 12:00 UTC","Latitude":"41.500012","City":"Dyer","divs":["Sighting DetailsMy daughter was outside and seen something in the sky that was too bright and not moving like a plane. she called me outside and I looked to the north west at this bright round orange object moving off to the east. It looked as though it moved in a straight line and when it hit a certain spot to the east it would get dim and disappear. I was going to call the police but it was gone. I called my mom and brother who live in Calumet City, IL to tell them. My first reaction was to pamic and run back in but I was captivated and curious as to what it was. As I was telling them, my duaghters noticed it was coming around again. Same way. Same path. as soon as it hit the same spot to the east it got wouldget dim and disappear. My mom and brother could not see it as it came around again. My mom told me to call my sister who lives south of me in Cedar LAke, IN to see if she could see. So I am telling her that the moon is south of me and the Big Dipper is North of the moon. She finds the area and all of a sudden my older daughter says its coming around again. Same way. Same path. At the same time my sister on the phone gasps and asks what it is. We watched as it followed the same path and diappeared off at the same point on the east. It did not return and we watched for another 30 min. I saw it pass about 4- 5 times in total and my sister saw it once. Very strange. No noise. Very bright orange and would get dim and disappear at the same point in the sky. Always appeared from the northwest heading to the east. Not extremely high in the sky- was above tree top. Sky tonight was clear. Still very shocked and curious to see what it was. Searched google and seen multiple accounts over Chicago and Indiana since July 1st about the same time. Very bizarre. Was searching for orange lights over northwest Indiana for todays date and pulled up the other accounts. I lost sight of the object over the same eastern point in the sky. After 4- 5 passes it didn't return."],"Sighting Duration":"Undisclosed","Date Submitted":"07/21/2010 12:32 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.500012,+-87.520657(24682)&iwloc=A&hl=en\"> mufon case (24682) map </A>","Country":"United States"}