{"Viewing Distance":"Over One Mile","Source":"MUFON","Sighting Duration":"00:02:00","Disposition":"Unresolved","Longitude":"-0.121115","Date Submitted":"07/21/2010 05:02 UTC","Region":"England","City":"London","Date of the Event":"12/24/2008 12:00 UTC","Country":"United Kingdom","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/24685.html.txt","/var/www/straped/mufon/org/24685.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.511399,+-0.121115(24685)&iwloc=A&hl=en\"> mufon case (24685) map </A>","Tags":"City","divs":["Sighting DetailsIt was December 24th 2008 also known as Christmas eve it was around midnight. I remember the date so well because it was when my brothers wife told everyone she was pregnant. while both of our families were at midnight mass in a church in Twickenham, London, England. Me, my brother and three other relatives were standing outside talking when I looked up at the clear dark sky and in the distance I saw a formation of small white dots close to each over one behind another. first I thought they were just stars then I noticed they were all moving at a fair speed in one direction. There was around 5-8 lights.They were very noticeable because the sky was so clear with no stars or clouds. Then I said to my brother look at them lights moving what are they. we stood there for a few minutes looking but we couldn't figure out what they were when suddenly the lights started to vanish starting from the leading white dot going to 2nd and so on until they were all gone. At the time I thought it was weird but I didn't think much of it then as time went on I started seeing these UFO documentaries on TV and in one of the programmes they were talking about UFO sightings and there was this one report of a row of small white lights moving in the dark sky over new Mexico that's when I started thinking I saw UFOS but I didn't no what to do with this information until now"],"Case Number":"24685","Weather Factors":"None","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around December 24th 2008"],"Object Features":"Unknown","Latitude":"51.511399","Log Number":"GB-07212010-0004","Object Flight Path":"Straight-line path","Summary":"A row of white dots in the sky."}