{"Date of the Event":"11/18/2009 12:00 UTC","Longitude":"-108.80877","Region":"Colorado","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=37.660781,+-108.80877(24680)&iwloc=A&hl=en\"> mufon case (24680) map </A>","files":["/var/www/straped/mufon/html2text/24680.html.txt","/var/www/straped/mufon/org/24680.html"],"Source":"MUFON","Country":"United States","Case Number":"24680","divs":["Sighting DetailsThis is not the first encounter, nor the last by all means. In fact, since November of 2009 I have not only sighted, by estimate, over a thousand of these spheres of all sizes in a single event, but also encounters with beings. I assume MST is mountain stantard time for the US. I did check sphere, however the first one may have been rectangular, or a rectangular opening. Previous to this event, I had not noticed any UFO's; I did have encounters with invisible beings displaying mass, intelligence, and a good grip on American english. Up to the November event, I assumed I was in a technology test area for invisibilty, and I assumed the invisibles were humans in suits just dicking with me. Way too much to write about here, so I will move on to the November 2009 event. Please understand I have been reluctant to tell this to very many folks for good reason; the whole sequence of events for the last two years has made me quite sure I do not understand as much about the physical and spiritual creation as I thought I did. To begin, the event is a 3 day sequence. Tuesday the 17th around 9:30pm I stepped out the back door to have a cigarette. I had just lit it and was looking to the west when I saw a large emerald green meteor streak across the sky from NNW headed SSW and appeared to land in Southeastern Utah or Northeastern Arizona. While I was still in the wow mode, I glanced to the south and spotted two human looking beings in dark suits with what looked like helmets on, walking next to the woods about 50 feet away. They stopped when I said, \"Cool tech. You ought to share it with me\". They hustled off like they were surprised I saw them. The next morning there was one mention on the early news about the meteor. The next night, the 18th, I stepped out about 9:30pm to have a cigarette when a little girl with long blonde hair, in a light dress, no coat, and no shoes came skipping up the sidewalk toward me with a little blonde boy in short pants, no coat, and no shoes running behind her, and a man at the end of the sidewalk by the shed just standing. The sidewalk is about 50 feet long. The temperature was in the high 30's F and there was patchy snow on the ground. The little girl and the little boy came right up to me and they both smiled and the little girl waved, or I realized later was pointing up. Neither one said a thing when I asked where their coats and shoes were and if they needed help. The little girl did wave at me then, turned around and skipped back down the sidewalk with the little boy right behind her. They stopped by the man and I asked again if I could help them and no one answered. I crushed my smoke and stepped in the house and locked the door and sat down. I was kinda weirded out for about three minutes before my concience took over and I decided they were vagrants and I ought to give them food and clothing and maybe lodging until I found out more. I put my coat back on, went outside, walked down to the end of the sidewalk where they still were standing, but the man had moved off about 20 feet. I asked them again if they needed help, but they shook their heads in a side to side 'NO' motion and kept trying to sign to me. They obviously weren't deaf, but they would not or could not speak to me, while they kept motioning and signing trying to get me to understand something. The man just stood off motionless and silent. I don't how long this went on while they would look questioningly at each other, then go through another round of motions and signs while I made numerous wrong verbal guesses. I was pretty sure they had to be freezing their buns off by this time because I had thermal underwear and a heavy coat on, and I was getting chilly. Finally the little girl looked really frustrated, kinda leaned back with arms out, and palms up motioning with a Ta Da, Here it is, will you look up you bonehead, LOOK! I did finally to see a rectangular opening closing on a huge craft that took up most of the sky just before clouds enveloped it then disappeared. The sky and the stars took on a way different look than I had ever seen. The little girl, the little boy, and the man remained, and the little girl seemed to be the one most responsible for communicating with me. The only time the man made any move was when I pulled out my cell phone for more light to see what the little kids were trying to communicate me and the little girl kinda startled for a moment before she realized I wasn't a threat. Things got really weird from this point forward. I began to reason how to do a valid reality check on myself if I had slipped into cartoonland madness. I knew my fingers, toes, and nose were getting cold. I was more afraid of madness, than anything that was happening. In fact, I reasoned that this episode was making alot of sense even though it was exceeding anything I had ever heard of happening, or even imagined as far as what might be possible in this realm of existance. Continuing: They got so tired of asking about their physical comfort and the cold, different kinds of clothes appeared on them and they seemed to getting impatient with me. Did say getting weirder? Three more little kids began appearing and disappearing while they morphed into animals I had never seen. They got me to realize they wanted me to lay on my back on the sidewalk and watch the sky. When I did all disappeared but the man, and he changed position while keeping his distance. At this point, spheres began appearing from near Orion and getting larger and larger as some would stop right above me, then take off in varied directions, some disappearing as they went, some changing color and pattern schemes, but still spheres, while others positioned themselves like sentries. I watched this for I don't know how long(I quit counting after 300), but I knew I was getting hypothermic and had to go in and get warm. It was almost 1:00am by this time. The event doesn't end here, and the next day was equally unexpected, but I have things I have to do right now. I will relate more if folks are genuinely interested. I have hundreds of still photos also."],"Disposition":"Unresolved","Latitude":"37.660781","Log Number":"US-07202010-0013","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"07/20/2010 06:08 UTC","Tags":"City","Object Shape":"Sphere, Square, Rectagular, Unknown","Object Features":"Patterned Surface, Other","Summary":"3 main beings and 4 more less definite. At least several hundred spheres displaying different lighting and invisibility.","City":"Cahone","trends":["There have been no other sightings in Cahone","This sighting has never been favorited."]}