{"map":"<A HREF = \"http://maps.google.com/maps?q=37.964802,+-121.2876(24690)&iwloc=A&hl=en\"> mufon case (24690) map </A>","files":["/var/www/straped/mufon/html2text/24690.html.txt","/var/www/straped/mufon/org/24690.html"],"Weather Factors":"None","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Case Number":"24690","Longitude":"-121.2876","divs":["sighting detailsat about 10:30 pm i went out side to watch fire works. i looked up to the west and saw a orange\\yellow glow in the sky comming at me from the west heading east at about 1000 to 1500 feet high. it made no sound and as it went over my house it blinked out and then back on then out again. after it went out i could see a disc like shape with kind of a see thru glow around it as it disappered to the east. then a few seconds later another one came over and it did the same thing as the first this happend 4 times within just a few minutes. i called my wife out and she saw 3 of the 4 objects also. when the 4th object went over we saw a small plane above it comming from the southwest to the northeast the plane crossed over the 4th object and it blinked out sooner than the other 3. after it was over we talked about what we saw and both agree that they were not choppers or planes or fire works they seem to have controled movments and made no sounds. over the next couple of nights i saw similar object in the sky but a lot higher up."],"Region":"California","Object Features":"Unknown","Date Submitted":"07/21/2010 05:53 UTC","Disposition":"Unknown","City":"Stockton","Latitude":"37.964802","Object Shape":"Disc, Fireball","Tags":"City","Country":"United States","Date of the Event":"07/04/2010 10:30 UTC","Summary":"4 fireball objects one after another same flight path low in the sky over my house.","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 25 other sightings in Stockton","There were no other sightings in Stockton on or around July 4th 2010"],"Log Number":"US-07212010-0009"}