{"files":["/var/www/straped/mufon/html2text/24698.html.txt","/var/www/straped/mufon/org/24698.html"],"Sighting Duration":"Undisclosed","Summary":"Green fireball.","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Date Submitted":"07/22/2010 02:26 UTC","Disposition":"Unknown","Country":"United States","City":"Payson","Longitude":"-111.318936","Source":"MUFON","Latitude":"34.234608","Region":"Arizona","Date of the Event":"07/21/2010 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.234608,+-111.318936(24698)&iwloc=A&hl=en\"> mufon case (24698) map </A>","Object Shape":"Fireball","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMy wife and I were sitting outside with friends. We were facing south towards the Mazatzals. We saw a low flying green fireball with a tail move quickly in a downward angle moving from east to west. Unfortunately, our friends had their backs to the event. We stammered, trying to say something to them, but couldn't articulate fast enough. It was quick, maybe 3 seconds in duration. It didn't seem to originate too far up from the ridge across from our house; it was like a meteor, but extremely bright even with a fairly bright moon and distinctly bright green. The color and brightness is what caught our attention. The green fireball went behind the ridge to our south. My initial reaction was to brace for an impact, the way you might imagine in a movie, a boom and cloud of dust. As I attempted to describe it to our friends, the hair on my arms came up. I stood and watched the sky where the event happened and saw the blinking lights of a low flying helicopter not too long afterwards. About 15 minutes after the event my son and I drove not too far down a back road hoping to see something. Only lightning in the distance. When we got home, I Googled \"low flying green fireball in the sky\" and looked at the Wikipedia entry. I showed my wife the artist's rendition of the green fireball. She remarked, \"that's it.\""],"Weather Factors":"None, Medium","Log Number":"US-07222010-0003","trends":["There have been 5 other sightings in Payson","There were no other sightings in Payson on or around July 21st 2010"],"Case Number":"24698"}