{"Country":"United States","Weather Factors":"None","Longitude":"-99.158832","trends":["There have been 6 other sightings in Cross Plains","There were no other sightings in Cross Plains on or around July 19th 2010"],"Region":"Texas","files":["/var/www/straped/mufon/html2text/24696.html.txt","/var/www/straped/mufon/org/24696.html"],"Object Shape":"Other","Object Flight Path":"Stationary,Path with directional change,Other","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"Unknown","divs":["sighting detailsi was working on a privacy fence in my yard in cross plains. i stepped on a step ladder to cut off the top of a post, and something in the sky caught my attention.i saw orange colored lights in the southeastern sky. there were three or four.i was squinting and trying to focus, on what i was seeing. they were disappearing and popping back up.i stuttered to the three people working with me, to look at the lights. i told my wife to go get a camera, but we just stood staring thinking they would vanish if we stopped looking. there were three at one time i remember, and they were in a triangular shape, far from each other. each one would have two more lights flip on beside it, making three lights in a horizontal line. we watched them for about fifteen minutes and they were gone. i predict it was between eight and nine pm., because the sky was that darker blue color right before nightfall. we were just about to call it a day, when we noticed the lights. i have heard people talk about these same lights, mostly seen out of sabanno\\pioneer in between cross plains and rising star, for the past decade now. seen time and time again. some people seeing them three times or more over the years. i have seen these same type of lights on youtube.i never thought they were making it up. i just never could buy into it, until i seen it with my own eyes. i seen where somebody reported seeing it driving on 183 near brownwood and got out of the car and watched it."],"Object Features":"Unknown","Summary":"Seen orange colored lights in the sky southeast of Cross Plains, Tx. 07-19-2010.","Latitude":"32.131449","map":"<A HREF = \"http://maps.google.com/maps?q=32.131449,+-99.158832(24696)&iwloc=A&hl=en\"> mufon case (24696) map </A>","Tags":"City","Case Number":"24696","Log Number":"US-07222010-0001","City":"Cross Plains","Date of the Event":"07/19/2010 08:00 UTC","Date Submitted":"07/22/2010 12:49 UTC","Source":"MUFON"}