{"Region":"Florida","Latitude":"26.761732","Source":"MUFON","Log Number":"US-07212010-0012","Summary":"I was on my way home from town, when I saw a brite lite in the sky I watched it 4 awhile when friend had noticed it she pulled over 2 take some pictures then we continued home.","divs":["Sighting DetailsI noticed a brite lite in the sky @ around 9Pm july,7 2010 while my friend & I were on our way back from town.I continued @ watch it as we were stopping by my father inlaws house upon pulling out of the drive way I noticed it was still there. my girl friend didnt notice it untill we got on loblolly rd were she had decided 2 pull over & start taking pictures on her cell phone camera. we continued 2 watch it all the way home when we arrived I got my camera out & started taking pictures atfer I took like 33 pics I went inside 2 see what I got I have a pic of a craft that looks like it was flying right @ me I also have side view of that same craft. I continued 2 go outside periodicaly an taking more pics each time this went on till I went 2 bed.All the pics I took that nite the object was always a differant shape & brite ness. I now have about 200 pics on my camera & about 50 or more of them have something in them.I am continueing 2 take pictures 4 as long as I can i was just out a few minutes ago & got more pics my sithing is still on going & its not an every nite occurence but it has been pretty regular since that first nite.I have been trying 2 contact your organization by phone because I am computer illiterite,& I would like 4 someone 2 return my calls so I can get my story out there. I cant send u pics because I dont know how im suprisied I got this far.I know that wat I saw was real cause I didnt have any idea of what it could be untill I saw my pictures & they speek 4 themselves & they are quite amazing & I think u all will be very astonished when u can see them 4 yourselves. Sincerly,Wendy Kastner"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.761732,+-81.438409(24693)&iwloc=A&hl=en\"> mufon case (24693) map </A>","City":"LaBelle","Date of the Event":"07/07/2009 09:00 UTC","Object Flight Path":"Stationary,Path with directional change","Object Features":"Dome, Wings","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Date Submitted":"07/21/2010 09:30 UTC","trends":["There have been no other sightings in LaBelle","This sighting has never been favorited."],"Tags":"City","Longitude":"-81.438409","Object Shape":"Boomerang, Fireball, Sphere, Star-like, Triangle, Other","Sighting Duration":"Undisclosed","Case Number":"24693","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/24693.html.txt","/var/www/straped/mufon/org/24693.html"]}