{"Weather Factors":"Lightning, Light","Source":"MUFON","Date of the Event":"08/01/2003 01:30 UTC","Region":"Illinois","Summary":"Red object spotted in southern sky - not Mars","divs":["Sighting DetailsI had gone to watch the lighting from storms to our south and east beforeheading to bed. Something to the west of the storms in the southern sky caughtmy eye. It was red in color, and I thought it was Mars at first, because I hadcaught something on the news about it being out. However, I soon realized thiswas not the case.First, the lightning should have overcome the light from the object for a splitsecond. It did not.Second, the sky was totally overcast. No stars or other celestial bodies werevisibile.Third, the lightning illuminated the sky enough to clearly show that the objectwas below the cloud base.The two kickers really made me think it was a UFO1. The object was usually a pretty steady red in terms of color and theintensity of its light. However, on two occasions, after watching it for acouple minutes, its light dimmed to nothing for about two or three seconds, thenreturned to its original brightness. After about five or six minutes, theobject dimmed to no light, and the light did not return. The dimming and comingback of light was not in a regular pattern whatsoever.2. The object did not move at all. It appeared to just stay put in onelocation. Aircraft moves and has some sort of lights that blink or faderegularlythis most certainly did not.During the sighting, I became somewhat scared as noted in the survey above,mostly because I had never seen anything like it and quickly realized that itwasnt what I thought it originally was. Something so unfamiliar is unnerving. After the object disappeared I watched for about 30 more seconds, and it didntreturn, I went to bed, still feeling a bit frightened. I did get a restfulnights sleep, however.If you wish to contact me, please use my email address, rather than my phonenumber. Thanks"],"Sighting Duration":"00:10:00","City":"Galena","Log Number":"","Object Shape":"Undisclosed","Latitude":"42.416674","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/2470.html.txt","/var/www/straped/mufon/org/2470.html"],"Object Flight Path":"Stationary","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.416674,+-90.429017(2470)&iwloc=A&hl=en\"> mufon case (2470) map </A>","Disposition":"Unknown","Date Submitted":"08/01/2003 01:30 UTC","Tags":"City","Country":"United States","Case Number":"2470","trends":["There have been 2 other sightings in Galena","There were no other sightings in Galena on or around August 1st 2003"],"Longitude":"-90.429017"}