{"Source":"MUFON","Date Submitted":"07/22/2010 01:44 UTC","Summary":"Taking pics, sunset at Lake Grapevine, didn't see anything with eyes, but after looking at pics later, saw what looked like comet, but weather guy said it wasn't and said it was a ufo","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Latitude":"32.942522","Country":"United States","Tags":"City","Longitude":"-97.076125","City":"Grapevine","trends":["There have been 6 other sightings in Grapevine","There were no other sightings in Grapevine on or around May 30th 2010","This sighting has never been favorited.",""],"Disposition":"Unknown","Object Shape":"Bullet, Missile, Cigar, Fireball","Case Number":"24707","Weather Factors":"None, Does Not Apply","divs":["Sighting DetailsI was at Grapevine Lake to take some sunset photos on May 30, around 8:20. I didn't see anything with the naked eye, but later when I got home, I noticed what looks like a shooting star or comet. There is nothing in the first picture, then the next it looks like one is coming straight down and another going across towards the sun, north to south. The one coming straight down disappears and there is only the one larger one in better view. It wasn't a quick streak and then gone...it moved slowly in my opinion and it is definitely not a plane. I have a series of at least 10 to 15 pics from beginning to see it until it it cross over the sun and gets distant and I quit taking the pics. I sent the photos to the local weather guy, and he said it was nothing he'd seen and it wasn't a comet or shooting star, and he said it was a ufo, to contact the National Weather site. I did and they said it was nothing they could identify and to contact you. I am uploading the first picture where you can see the 2, with are in the upper to mid right side of the photo...above the shelter roof and the better of the 2 pics middle and ending. I can send more photos if you are interested. I am curious to see what you think. It's not a plane and it is long, no wings or tail. The photos are not on a long exposure at all, it bracketed the light on some...one I made b & w to see better."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24707.html.txt","/var/www/straped/mufon/more/24707_submitter_file1__DSC_2742.JPG","/var/www/straped/mufon/more/24707_submitter_file2__DSC_2750.JPG","/var/www/straped/mufon/more/24707_submitter_file3__DSC_2753.JPG","/var/www/straped/mufon/org/24707.html"],"Log Number":"US-07222010-0012","Date of the Event":"05/30/2010 08:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.942522,+-97.076125(24707)&iwloc=A&hl=en\"> mufon case (24707) map </A>","Object Features":"Unknown","Region":"Texas"}