{"Source":"MUFON","Summary":"A series of large red glowing spheres or discs floating over my home","Latitude":"40.150194","Object Shape":"Disc, Sphere","Country":"United States","City":"Stahlstown","files":["/var/www/straped/mufon/html2text/24716.html.txt","/var/www/straped/mufon/org/24716.html"],"Region":"Pennsylvania","trends":["There have been no other sightings in Stahlstown","This sighting has never been favorited."],"Disposition":"Unknown","Date Submitted":"07/22/2010 11:53 UTC","Object Flight Path":"Path then hovering","Weather Factors":"None","Case Number":"24716","divs":["Sighting DetailsAt approximately 1:00 a.m., I went outside and I saw a series (approximately 15) of glowing red orbs that appeared as if they were coming up from the ground in a wooded area in Stahlstown. It seemed like they were duplicating near the ground in the wooded area. They then floated in formation about 1,000 ft. (approx.) above and over my home (from North to Southwest). They made no noise, no flashing lights, just huge, glowing red orbs (like the photo of the Illinois sighting on that same date). After they passed over the home silently, they seemed to go up into the atmosphere and they disappeared. I have never seen anything like this in my life! I then found out that there were other sightings in Westmoreland County (near Irwin) on that same date. I had no camera or binoculars on me as I wasn't expecting to see such a thing. It was definitely \"not of this world\"...I wouldn't have been a believer of UFO's until I saw it myself. Once I started investigating it further, I am 100% convinced that I am seeing what others saw. The photo that best describes what I viewed (in awe!!) was the photo posted on this website from the Illinois sighting that same evening. I'm a believer now! I try to stay outside each evening to see if I see any further sightings. I live in an isolated area where I have an excellent view of both the Northern and Western sky."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.150194,+-79.33319(24716)&iwloc=A&hl=en\"> mufon case (24716) map </A>","Tags":"City","Object Features":"None","Date of the Event":"07/10/2010 01:00 UTC","Log Number":"US-07222010-0020","Longitude":"-79.33319","Viewing Distance":"101-500 Feet"}