{"Date Submitted":"07/22/2010 09:27 UTC","Summary":"My friend was driving to work and called me as he saw it hovering over the field.","files":["/var/www/straped/mufon/html2text/24713.html.txt","/var/www/straped/mufon/more/24713_submitter_file1__0721002243.jpg","/var/www/straped/mufon/org/24713.html"],"trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around July 21st 2010","This sighting has never been favorited.",""],"Tags":"City","Case Number":"24713","map":"<A HREF = \"http://maps.google.com/maps?q=41.083473,+-85.130141(24713)&iwloc=A&hl=en\"> mufon case (24713) map </A>","Weather Factors":"None","Longitude":"-85.130141","Object Flight Path":"Hovering then path","Latitude":"41.083473","Disposition":"Insufficient Data","Sighting Duration":"00:10:00","Object Features":"Other, Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-07222010-0017","City":"Fort Wayne","Date of the Event":"07/21/2010 09:47 UTC","Object Shape":"Triangle","Country":"United States","divs":["Sighting DetailsOn July 21 my friend called my cell phone at 9:47, and said: \"you won't beleive it but i'm seeing what i'm seeing. There's a huge black triangle with lights on its sides about half mile away from me, about the size of football field, just hovering in the air\". He doesn't beleive in anything, so it was not like him to make it up. After i said that he's joking etc, i asked him a few questions. He seemed pretty shocked and sounded very unusual. So from the information i got from him, it was a black triangle the size of football field, not moving or making any sound, about as high up in the air as a hospital helicopter would fly. There was no light on the bottom ( i asked if there was after looking at pictures online), just the 3 lights on the sides. It was about 20 feet thick. He've never heard about a UFO of this kind. Tried taking a picture but it was too dark and too far. He was also running late for work so didn't stop to watch what is going to happend, just drove by it. He said he was looking at it as was talking to me on the cell phone. To add to the describtion, he said it wasnt really all black. It was more like metal, he could see shades on the sides. But it was still dark. He's still pretty shocked and doesn't want to talk about it much, and havn't told many people about what he saw."],"Region":"Indiana","Source":"MUFON"}