{"Summary":"Not out of the ordinary I been seeing these things for the past 15 years.","Object Features":"Undisclosed","Longitude":"-84.033453","Object Flight Path":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Unknown","Case Number":"24711","divs":["Sighting Details Well the first time I seen one of the objects I was about 15 or so and these paticular craftes are spherical balls of light possibly a disc thats actually emitting light its hard to tell. The las time was about a month ago I was driving north on M 52 when I spotted it. It was a solid ball of light not like a plane which has individual flashing lights. We tryed to pursue the object but it was flying just above the trees and it seems to manuver almost perfectly for being so close to the trees. It was about 35 to 40 ft wide and about 10 feet high. We managed to keep up but it shot at least 10 miles ahead of us in a matter of seconds. No afterburner and no sound.It was gone so fast after traveling so slow over the trees. The most extreme encounter I had was in 1999. A friend and I were about 5 miles from the most recent sighting . We were on sylvan road in manchester mi. we were heading south down a winding hill and we could see bright lights in the distance maybe a half a mile ahead. They we on the left side of the road and as We got closer I realized they were coming from the sky. At first I thought helicopters but the lights were to close together. When we got within 500 feet I realized it was actually a ufo scanning the woods for something but as we approached the lights went off and the craft shot verically into the sky.It was about 300ft long with huge spotlights on the bottom. we have also seen huge triangle shaped crafts. Along with strange military planes who also seem to be searching 4 something."],"Log Number":"US-07222010-0016","map":"<A HREF = \"http://maps.google.com/maps?q=42.151468,+-84.033453(24711)&iwloc=A&hl=en\"> mufon case (24711) map </A>","Sighting Duration":"Undisclosed","Latitude":"42.151468","Country":"United States","Region":"Michigan","trends":["There have been 5 other sightings in Manchester","There were no other sightings in Manchester on or around June 24th 2010"],"Weather Factors":"Unknown","Date of the Event":"06/24/2010 10:00 UTC","City":"Manchester","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24711.html.txt","/var/www/straped/mufon/org/24711.html"],"Date Submitted":"07/22/2010 06:41 UTC","Object Shape":"Sphere"}