{"Sighting Duration":"00:00:10","Tags":"City","Object Features":"None","Latitude":"34.055818","Summary":"Round metalic object flew by airplane.","Viewing Distance":"101-500 Feet","Region":"Arizona","files":["/var/www/straped/mufon/html2text/24714.html.txt","/var/www/straped/mufon/org/24714.html"],"City":"Undisclosed","Country":"United States","Date Submitted":"07/22/2010 09:51 UTC","Case Number":"24714","trends":[],"Object Flight Path":"Straight-line path","Longitude":"-111.088591","Object Shape":"Sphere","Date of the Event":"07/21/2010 03:40 UTC","Log Number":"US-07222010-0018","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.055818,+-111.088591(24714)&iwloc=A&hl=en\"> mufon case (24714) map </A>","Disposition":"Unknown","divs":["Sighting DetailsI was on a US Airways flight returning from the Illinois. I am not sure where over AZ we were but, the plane was over Arizona as we were preparing for landing. My guess some where in NE AZ would be the most likley route from Illinois. Anyway, I was looking out the window ( I usually request window seat) as I like to do as I love to fly. The view is absoluteley amazing. So, I was looking out the window when I first noticed the object flying close to the plane. I was surprised to see something that close to a airplane in flight. I could not take my eyes off of it until I could not see it throught the window anymore. It moved across the sky just below the plane and off the right side moving in a straight line from the front of the plane to the rear along the right side of it. At first I thought another plane was flying by but, I quickly realized that was not another plane. It was a round ball shaped object. I saw the object for about 5-10 seconds but it seemed a little longer. Almost like time slowed but, I know it could not have happened. Now, I realize the plane I am in is flying approx 3-600 miles per hour but, the object appeared to either be stationary or about the same speed. I am not exactly sure. The object was a shiney metallic ball shaped object. I did not see any engine or windows in the traditional sense but, it was in the air and I could clearly see the object. The object was very shiney silver metallic. Looking at the object I could not see any sheet metal or rivets or any other markings that might identify it. It just looked like one solid object. It looked like it could have been the approximate size of a vehicle. Perhaps the size of a SUV. I am not sure how close it was to the plane but, it appeared to be very close maybe a 100 or 200 yards from the plane maybe less. I cannot be sure as I am not a expert in distances in the air but, it was definetely close. When the object had left my view from the plane window I looked to the two people sitting next to me and asked if they saw anything. Neither did. I just sat there tyring to figure out what I just happened. Then the plane landed. I got off and went home."],"Weather Factors":"None"}