{"Log Number":"US-07232010-0010","Date of the Event":"07/22/2010 12:00 UTC","Longitude":"-76.944646","map":"<A HREF = \"http://maps.google.com/maps?q=34.68715,+-76.944646(24726)&iwloc=A&hl=en\"> mufon case (24726) map </A>","Object Features":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON","Date Submitted":"07/23/2010 03:04 UTC","City":"Emerald Isle","Object Flight Path":"Other","Tags":"City","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Emerald Isle","There was one other sighting in Emerald Isle on or around July 22nd 2010"],"Case Number":"24726","Region":"North Carolina","Country":"United States","divs":["Sighting DetailsI was fishing with a couple friends and my 2 sons on the beach. At about 10pm one of my friends jumped from his chair and yelled.. \"did you see that, did you see that!\" Please tell me Im not the only one that saw that\". He told me he had just seen 2 bright orange lights high in the sky. They only stayed on for about 5 seconds and then just disappeared. Our other friend also saw it but myself and my sons did not. I sat down in one of the other chairs and started to watch the sky. The moon was very bright and the beach and skies were fairly light. My 2 friends stood near their fishing poles. I had asked him where exactly they had seen the lights so I could focus my time on that area. They told me it was to the left of the moon and pointed to a star as reference. It was about 5 minutes after that that I was setting there watching when all of a sudden 6 lights in a triangle shape came on. The lights were very very bright and orange. It was almost as if they were illuminating or glowing. They were pointed in my direction as if it were coming my way. I had yelled to my friends to look up in the sky. My one friend looked up and saw the lights and said it was almost exactly what he had seen a few minutes earlier only they were in a different part of the sky. They were to the left of the moon. Then they just disappeared as quickly as they had appeared. Im 100% positive that this was not any sort of conventional aircraft. It was almost surreal and seemed that it had changed locations from the first time it was seen. We sat there for the rest of the night (appx another 2 hrs) observing and hoping to get some photos. It did not make another appearance."],"files":["/var/www/straped/mufon/html2text/24726.html.txt","/var/www/straped/mufon/org/24726.html"],"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Summary":"Triangle shaped bright orange lights over the ocean.","Latitude":"34.68715","Disposition":"IFO"}