{"divs":["Sighting DetailsMy boyfriend and I went outside on an evening in October in order to try and catch a glimpse of the International Space Station as it was supposed to be visible that night over Lake Erie. We were looking towards the sky over the lake which is north of our home. We didn't see the space station (as we found later that evening that we went out a day early according to the news reports), but we did see 'something' that we still cannot explain to this day. As we were looking overhead, there was a a boomerang-type shape that flew across the sky, heading north towards the lake. I cannot estimate how far away from the ground it was, but it was close enough to determine that it was not a plane or helicopter flying at such a low altitude (we do live near enough to Cleveland Hopkins Airport and the metropolitan hospitals and are familiar with the types of aircraft in the area). It was a very quick, arched, fluid flight path. There was no noise, nor any lights. It's hard to explain, but it seemed to glow, but it wasn't lit up. It was like a grey contrast to the sky. It flew silently overhead heading towards the lake. We lost sight of it once it reached the treetops. We both asked one another if each had witnessed it and when we went back inside, we both drew what we thought we had seen and we drew the same shape. I don't know if this was a UFO or not, but we can honestly say we have never seen anything like it, nor have seen anything like it since."],"trends":["There have been 8 other sightings in Lakewood","There were no other sightings in Lakewood on or around September 30th 2009"],"Latitude":"41.484493","Summary":"Went outside to see if we could see the International Space Station as it was to be visible at this time.","Tags":"City","Source":"MUFON","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date Submitted":"07/23/2010 12:05 UTC","Sighting Duration":"00:00:05","Object Flight Path":"Straight-line path","Date of the Event":"09/30/2009 12:00 UTC","Region":"Ohio","Log Number":"US-07232010-0005","Country":"United States","Case Number":"24721","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=41.484493,+-81.792911(24721)&iwloc=A&hl=en\"> mufon case (24721) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/24721.html.txt","/var/www/straped/mufon/org/24721.html"],"Longitude":"-81.792911","Weather Factors":"None","City":"Lakewood"}