{"Country":"United States","Longitude":"-81.586065","Date of the Event":"07/22/2010 09:55 UTC","Summary":"Me and my wife saw an amber light slowly flying over the house and we got a picture and video of it.","City":"Hinesville","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.851397,+-81.586065(24731)&iwloc=A&hl=en\"> mufon case (24731) map </A>","Disposition":"Unknown","Latitude":"31.851397","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Georgia","Tags":"City","Case Number":"24731","Object Features":"Undisclosed","Date Submitted":"07/23/2010 09:29 UTC","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/24731.html.txt","/var/www/straped/mufon/more/24731_submitter_file2__ufo22july2010.jpg","/var/www/straped/mufon/org/24731.html"],"Weather Factors":"None","divs":["Sighting DetailsMy wife and i went outside to see if we could catch any more of these strange lights that we have been seeing since January and sure enough as soon as we went outside we saw a bright amber colored light about 2000 feet above our house heading from the north west toward the south east from the region where the constelation sagitarius is located. It was 2155 at night and the skies were clear. I told my wife to run inside and get my flip video camera and i recorded its path. to the naked eye it was pulsated a bright amber light, but through my camcorder it was pulsated red, green, blue, and white. it lasted for 12 min and 58. and there were a two air planes in the area heading north east a little lower than the object around 2208. my wife took a couple of pictures of it and when you zoom in on the picture it looks realy interesting. a small patch of clouds came out of nowhere heading south west and covered the object after they cleared out 5 min later the object was gone."],"Log Number":"US-07232010-0015","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Hinesville","There were no other sightings in Hinesville on or around July 22nd 2010","This sighting has never been favorited.",""]}