{"Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=23.11938,+-82.386977(24734)&iwloc=A&hl=en\"> mufon case (24734) map </A>","Country":"Cuba","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"05/08/2005 12:00 UTC","Object Shape":"Circle","City":"Havana","Log Number":"CU-07242010-0001","Sighting Duration":"00:01:00","trends":["There has been one other sighting in Havana","There were no other sightings in Havana on or around May 8th 2005","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/24734.html.txt","/var/www/straped/mufon/more/24734_submitter_file1__DSC03245.JPG","/var/www/straped/mufon/more/24734_submitter_file2__DSC03246.JPG","/var/www/straped/mufon/more/24734_submitter_file3__DSC03247.JPG","/var/www/straped/mufon/org/24734.html"],"Summary":"Avistamiento puntos 3 luminosos en cielo (Habana Cuba)","Latitude":"23.11938","divs":["sighting detailsestabamos de vacaciones en la habana cuba cuando fotografiabamos para el recuerdo, en eso fotografiamos hacia el cielo solo para captar con la camara un edificio con una antena al fondo, se hicieron varias tomas consecuentes (envie una foto antes y una despues del avistamiento. fue hasta tiempo despues que vi en la foto dsc03246 que en la partesuperior derecha aparecen 3 luces y considero que es un caso para investigar. envio estas fotos a ustedes que se dedican a esto y espero que les ayude en sus investigaciones. ahora se preguntaran porque si el avistamiento fue en el 2005 y hasya ahora les envio las fotos,pues resulta que el motivo es que estaba viendo un programa en discovery chanel de su institucion (mufon) que se encargan de esta investigacion y quice compartir este suceso. bueno es todo, espero que sea de beneficio esta informacion. cualquier informacion adicional que necesiten con todo gusto les puedo ayudar,les dejo mi correo electronico: saludos cordiales, *(wit's name and email address deleted--sgonzalez\\cms)."],"Date Submitted":"07/24/2010 12:11 UTC","Longitude":"-82.386977","Case Number":"24734","Object Features":"Undisclosed","Region":"Havana"}