{"divs":["Sighting Detailsthis is a \"follow-up\" report to my july 18th report. light #1: has changed its nightly course a bit, and tonight, i was in amazement of something it did. i admit i had my camera outside with me, but forgot my tripod. i use it when i record so that the camera is steady - it is easier to see the object move when the camera is not moving- i like doing my light videos that way... but anyways, i forgot the tripod and could kick myself for it right now... i am still blown away by this... well i was watching the light while outside, i usually do this every night - but i noticed tonight that its path was a little off of what it usually is... so while watching it - i saw an approaching airplane that was headed right towards it, i watched, totally stunned, totally forgetting my freaking camera was in my hand!!! well as i was watching this airplane getting closer, it moved, the light moved! it moved up quickly and stopped, it moved out of the way of the airplane... the airplane did not change its course it still kept going straight and it flew right under it... after it passed, the light moved back to where it was and proceeded along its route --- i am still ... WOW... the airplane flew under it!!! it moved out of the airplanes way! i am amazed. i am so mad at myself for not getting that, i came in and told my boyfriend and he just shook his head at me and was reminding me i did have my camera out there with me... i felt like such an ass!!!!!!!!!!!!! i watched the light till i couldn't anymore and as it was almost out of my site it changed in color to a firey orange. it is usually all white with some mild flicker of color, but it does it so it blends with the white. light #2: also seemed different tonight, its not as bright as it usually is, and is moving a little more sporadically, in circles, small circles. i tried to video it but of course my camera only has a 3x zoom, which is crap for this stuff... other lights: i have still been seeing them, just not as many. new light a: there was a new light out there tonight, it flew parrallel with a few airplanes, for only a few feet and then would stop. it seemed like it was pretty close to them too. new light b: i saw another new one tonight, it was as bright as lights 1 & 2, and this one dimmed and almost dissapeared when an airplane got near it. i could still see it, just not as good, i lost it after the plane when by it. i filed out one of these reports already, i am interested in someone coming out so i can point out what i am seeing, so it can be investigated. i was contacted by a mufon rep. via email, i replied several times asking him to call me and have not received a phone call. so i would still like a phone call. i have spotted so many of the things that are like lights 1&2 and am interested in posibly being able to find out what they are. years ago, i saw one out back in the sky in glen burnie. i got in my car to see if i could find it. i did, it was hoving above the power plant on ft smallwood rd. so please i want someone from mufon to come and investigate, i just want to stay anonymous."],"Date Submitted":"07/24/2010 02:31 UTC","Tags":"City","Weather Factors":"Unknown","Longitude":"-77.167278","Date of the Event":"07/23/2010 09:45 UTC","trends":["There have been 2 other sightings in Taneytown","There were no other sightings in Taneytown on or around July 23rd 2010"],"Summary":"Light in the sky moved for airplane.","City":"Taneytown","Disposition":"IFO","Latitude":"39.660047","Object Flight Path":"Hovering then path,Other","Case Number":"24736","Sighting Duration":"Undisclosed","Log Number":"US-07242010-0003","Viewing Distance":"Unknown","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/24736.html.txt","/var/www/straped/mufon/org/24736.html"],"Object Features":"Unknown","Region":"Maryland","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.660047,+-77.167278(24736)&iwloc=A&hl=en\"> mufon case (24736) map </A>"}