{"Latitude":"38.756164","Region":"California","Log Number":"US-07242010-0009","divs":["Sighting DetailsI stepped out on my back patio after having a psychic experience. Something told me I would see the craft with the being I had just been in contact with telepathically. Sure enough there was a high flying bright object moving at a very high rate of speed. Given the altitude and speed the craft had to have very, very large, perhaps a mile wide or more. Telepathic communication is new to me. I started being contacted several weeks ago by the one we used to call Jesus (that was never his real name). He has changed his name to Sananda, he is the one called the warrior king from ancient cultures, aka Archangel Michael represented by the planet Mars in ancient mythology. These beings downloaded into my awareness the proper way to model how ions are made from the vacuum of space. I have been writing physics papers these last few weeks. Before I began receiving these downloads I was a nurse administrator. Now I have been retained to write a paper to explain some issues bothering NASA since 2008. I am now a paid theoretical physicist though I have no background in physics. I attended the Natural Philosophy Alliance last month and spoke with many presenters there. I was able to teach them many things they had not considered though they were on the right track with aether physics. One of them, John Milewski PhD wants to make me a partner in his firm that applies his own model for magnetic light to gold extraction. I explained to him the physics of alchemy, anti-gravity and zero point free energy (zero spark or moving parts and zero input needed). John knew enough to know the physics I showed him are for real so now I have a new career. The point of telling you this is that we are being upgraded as a species. We passed the tests and hardships of duality and will rejoin our genetic families from many other worlds very soon. I'm sorry I do not have a camera other than my Iphone, it could not make out the craft against the bright moon light it was speeding towards last night. I thought you should know that many orbs are being spotted around Sacramento valley these days in broad daylight. Just type Sacramento Orbs or Roseville, Loomis Rocklin orbs, its getting very busy around here these days. Be in love and peace. The good guys rule the space we are entering"],"Date Submitted":"07/24/2010 07:27 UTC","Weather Factors":"Unknown","Summary":"High and fast moving craft, very bright.","map":"<A HREF = \"http://maps.google.com/maps?q=38.756164,+-121.281246(24742)&iwloc=A&hl=en\"> mufon case (24742) map </A>","files":["/var/www/straped/mufon/html2text/24742.html.txt","/var/www/straped/mufon/org/24742.html"],"Sighting Duration":"Undisclosed","Longitude":"-121.281246","Country":"United States","Object Shape":"Unknown","Object Flight Path":"Undisclosed","City":"Roseville","Object Features":"Undisclosed","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","Case Number":"24742","Disposition":"Insufficient Data","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around July 23rd 2010"],"Date of the Event":"07/23/2010 12:00 UTC"}