{"Source":"MUFON","Sighting Duration":"01:00:00","Country":"United States","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/24747.html.txt","/var/www/straped/mufon/more/24747_submitter_file1__IMG_0569.JPG","/var/www/straped/mufon/more/24747_submitter_file2__IMG_0570.JPG","/var/www/straped/mufon/org/24747.html"],"City":"Santa Ynez","trends":["There has been one other sighting in Santa Ynez","There were no other sightings in Santa Ynez on or around July 24th 2010","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Object Shape":"Cross, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=34.614431,+-120.079868(24747)&iwloc=A&hl=en\"> mufon case (24747) map </A>","Object Features":"Unknown","Object Flight Path":"Stationary","Summary":"Three lights in Southern Californina Sky.","Weather Factors":"Unknown","Log Number":"US-07252010-0003","divs":["Sighting DetailsMy girlfriend and I were camping at Upper OSO campground near the Santa Barbara Ranger Station in the Los Padres National Forest. That night, we we had both commented on how bright the moon was, so that had been on our mind. At approx 2:00am, my girlfriend awoke and noticed that she couldn't see the moon anymore. While she was taking a few seconds to look for it and realize that the moon had gone out of our view behind a ridge, she also saw an interesting combination of lights in the sky Southeastern sky and woke me up to see it also. There was one larger bright light in the center with two smaller and equal lights on either side and two slightly smaller lights on the top and bottom. The top and bottom lights were on a skewed axis, so all five lights together looked like an off angle cross (see second image). All five lights were brighter than any star in the sky. To each side (horizontally) there were slightly expanding (like cones on each side) rays glowing outward. The lights appeared static, at least for the 10 or so minutes we looked at it. We got a few pictures with a decent point-and-shoot digital camera, but it was through our tent mesh. We had no clue as to what they were, although I did mention to her that in that direction was Point Mugu and Point Hueneme. Since it wasn't moving relative to our line of sight, it's possible that it could have been moving away from us, i.e. some type of rocket launch."],"Longitude":"-120.079868","Date Submitted":"07/25/2010 02:56 UTC","Date of the Event":"07/24/2010 12:00 UTC","Region":"California","Tags":"City","Case Number":"24747","Latitude":"34.614431"}