{"Latitude":"28.041595","Object Shape":"Sphere","Summary":"UFO was starlike in appearance and very brilliant bright blue in color.","Longitude":"-81.947304","Object Flight Path":"Stationary","Case Number":"24741","Country":"United States","Sighting Duration":"Undisclosed","City":"Lakeland","Date Submitted":"07/24/2010 07:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.041595,+-81.947304(24741)&iwloc=A&hl=en\"> mufon case (24741) map </A>","Log Number":"US-07242010-0008","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around June 9th 2010"],"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsAt 11:00PM I was taking my cousin Mike home. We left my house at exactly 11:00PM. As we passed by a field near my house, I always look up and see if anything is up there. Never, until June 9th was there. As I looked in the sky I saw 3 helicopters in a triangular formation more of an obtuse formation, If I'm using that term correctly, One helicopter was farther away than a normal triangle. At any rate, I slowed down to get a look at them, seemingly strange they were just sitting there as we have no airports around this area that I am aware. The nearest airport I know of is in South Lakeland, some 20 miles away. Realizing something may be up, I noted the time as 11:02pm. I Made a U-turn on a nearby street and as I came back to the stop sign to turn back right to see them again, I looked across the street and in the sky was the brightest \"star\" I'd ever seen! I noted it's position as being directly across of the field in which I observed the 3 helicopters. As I returned to the field at exactly 11:03 in which I saw these 3 helicopters they were nowhere to be seen or heard. I know this because no traffic was in the area that late at night. I got out of my truck which I had turned off and listened keenly for the \"chop\" of the helicopter. I did not hear it. These mysterious helicopters were simply gone, and not heard. Out here in this area you can hear tires screeching on Interstate 4 which is some 4 miles away. I should have heard something. Leaving the scene at the field disappointed I headed back south to take my cousin home. I traveled west on Marcum Road and looked for the \"star\" but did not see it, the time then was 11:18pm. I looked farther away and saw a red in color \"orb\" or \"sphere\" which was far away enough to be over the Gulf of Mexico but very high in the sky. The Gulf of Mexico from here is approximately 60 miles. That is the last I saw of anything. Excitement was a feeling I got from seeing everything happen that night. Another feeling I got was strange, it hit me hard too, the feeling was as if I were in a \"crossfire\" of sorts. The thought I had was these 3 helicopters were defending air space from this brilliant blue object. I am a believer. I called it an \"otherworldly standoff\"."],"Object Features":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Region":"Florida","Date of the Event":"06/09/2010 11:02 UTC","files":["/var/www/straped/mufon/html2text/24741.html.txt","/var/www/straped/mufon/org/24741.html"],"Disposition":"Insufficient Data"}