{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.924936,+-83.251502(24744)&iwloc=A&hl=en\"> mufon case (24744) map </A>","Weather Factors":"Light","Case Number":"24744","Latitude":"37.924936","Object Features":"Unknown","Date Submitted":"07/24/2010 10:58 UTC","Log Number":"US-07242010-0010","Summary":"Bright circular object at high speed and high altitude going south to north.","Date of the Event":"07/20/2010 10:00 UTC","Object Shape":"Circle, Star-like","files":["/var/www/straped/mufon/html2text/24744.html.txt","/var/www/straped/mufon/org/24744.html"],"Country":"United States","Region":"Kentucky","Tags":"City","City":"West Liberty","divs":["Sighting DetailsAt the time of the sighting,I was at home standing on my porch calling my dog. I live far out in the country and there is no real ambiant light. Although there was a half-moon it was quite dark as it was covered by a thick cloud cover. While waiting for my dog I looked up to admire the stars. At this time I noticed a bright disc or circular object at a very high altitude and at a high rate of speed traveling in a south to north direction. At first I thought it was just a plane but as I watched I began to realize that it was very high up and moving at a much faster rate of speed than I have observed conventional or military aircraft at various altitudes. My second thought was that it could be a satelite. I discounted this as it didn't seem to be that high and I didn't think a satelite would be moving that fast if in orbit. I further dismissed a meteor as it left no vapor or fire trail as it mantained a constant level flight. The brightness of the object's light was also constant. There were no flashing lights, strobes or anything of that nature. After a couple of minutes it disappeared behind a bank of clouds and did not re-appear. I hesitated reporting this sighting as I am not given to thinking that every light in the sky is a UFO but I could come to no other logical conclusion. I'm a retired military veteran with 34 years of combined service and have flown in many types of aircraft all over the world and am familar with most all military aircraft."],"Object Flight Path":"Straight-line path","Source":"MUFON","Longitude":"-83.251502","Disposition":"Unknown","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in West Liberty","There were no other sightings in West Liberty on or around July 20th 2010"]}