{"Case Number":"24755","Log Number":"US-07252010-0011","Object Features":"None","trends":["There have been 4 other sightings in Madison","There were no other sightings in Madison on or around July 4th 2010"],"divs":["Sighting DetailsOn the 4th of July, 2010 we had a fireworks display take place at a local park in Madison, Al. The fireworks started around 9:00 pm and lasted till about 9:30 pm. My wife and I and a few hundred other local folks were at this fireworks show. My wife and I had parked our car in a parking lot at one of the local business in Madison on the West side of the park. About 9:15 pm two red lights came in from the East at about a 100 to 150 ft in the air, no sound, circled the fireworks display to the North, the two lights maintained a set distance apart of about 50 to 75 feet; no craft was visible. The red two lights flew between us and the firework shells exploding in the background. As the two red lights turned back toward the east the two lights turned into only one and proceed East and maintained the same altitude. The lights never changed colors, maintained a bright red color. The lights which did not flash throughout the event. During the event I commented to others at the parking area that \"I would give $20.00 to anyone that could tell me what that was.\" This whole event from beginning to end lasted at best 120 to 180 seconds."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.707918,+-86.745962(24755)&iwloc=A&hl=en\"> mufon case (24755) map </A>","Summary":"Two red lights.","Object Shape":"Other","Region":"Alabama","files":["/var/www/straped/mufon/html2text/24755.html.txt","/var/www/straped/mufon/org/24755.html"],"Object Flight Path":"Path with directional change","Latitude":"34.707918","City":"Madison","Sighting Duration":"09:15:00","Date of the Event":"07/04/2010 09:15 UTC","Weather Factors":"None","Date Submitted":"07/25/2010 11:13 UTC","Viewing Distance":"101-500 Feet","Country":"United States","Longitude":"-86.745962","Disposition":"Unknown","Source":"MUFON"}