{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.918703,+-87.890628(24756)&iwloc=A&hl=en\"> mufon case (24756) map </A>","Tags":"City","Object Features":"None","Region":"Illinois","Latitude":"41.918703","Sighting Duration":"Undisclosed","Longitude":"-87.890628","Date of the Event":"07/25/2010 08:12 UTC","Country":"United States","Summary":"Cluster of six sphere-like objects in a formation.","files":["/var/www/straped/mufon/html2text/24756.html.txt","/var/www/straped/mufon/more/24756_submitter_file1__38160_141239492567454_100000442116170_288549_4922331_n.jpg","/var/www/straped/mufon/org/24756.html"],"Disposition":"Unresolved","Case Number":"24756","divs":["Sighting DetailsI was walking to Walgreens with my wife and my 6 year old son to run an errand for my mother-in-law. As we were walking and chatting, My son was asking me what I thought this thin, whispy cloud looked like. I responded that it looked like a bird to me and I continued to scan the sky. As we crossed the road and passed beside the new Northlake Police Station, I glanced up and saw the formation. I said out loud \"What is that?\" My wife and son looked up and we saw a group of six sphere like objects in the sky, they were in a loose formation, but were also kind of spinning around each other. We stopped walking and took note of this group of objects as they were traveling about 50-70 feet above the tree tops. My son was very excited about the sighting and exclaimed that they seemed to be illuminated, to which my wife concured. We thought it might be a cluster of balloons, but they were traveling against the wind and were illuminated by both the sun and the objects themselves. We watched them as they traveled over the tree's and eventually disappeared behind some tree's and houses. My wife and son were both very excited and we talked about it and compared notes of the sighting. I tried to get photos or video, using my cell phone, but by the time I got my camera ready, it was over. I took photos of the area and the trees on our return trip to be used in any comparison. We are hoping someone else might have seen this extraordinary cluster of objects too!"],"City":"Northlake","Date Submitted":"07/25/2010 11:33 UTC","Source":"MUFON","Viewing Distance":"21-100 Feet","Weather Factors":"None","trends":["There have been 4 other sightings in Northlake","There were no other sightings in Northlake on or around July 25th 2010","This sighting has never been favorited.",""],"Log Number":"US-07252010-0012","Object Shape":"Sphere"}