{"Summary":"Strangest object I've ever seen in my life.","Source":"MUFON","Longitude":"-74.595091","map":"<A HREF = \"http://maps.google.com/maps?q=40.630753,+-74.595091(24753)&iwloc=A&hl=en\"> mufon case (24753) map </A>","files":["/var/www/straped/mufon/html2text/24753.html.txt","/var/www/straped/mufon/org/24753.html"],"Object Flight Path":"Path with directional change","Case Number":"24753","Viewing Distance":"Over One Mile","City":"Bridgewater","Date Submitted":"07/25/2010 10:12 UTC","Object Features":"Wings, Unknown","Latitude":"40.630753","trends":["There have been 2 other sightings in Bridgewater","There were no other sightings in Bridgewater on or around July 24th 2010"],"divs":["Sighting DetailsMy girlfriend and I were coming from seeing Inception from the AMC Theaters in Bridgewater, NJ We were talking about dreams and aliens as we made it pass the first intersection of Commons Way and Prince Rodgers Ave. We proceeded onto Prince Rodgers ave for about one minute when my girlfriend noticed something in the sky. She said to me \"what is that\". I didn't know what she was looking at so I said, \"those are buildings\". She said to me \"no not those, that thing in the sky right there.\" I turned my head for a second and could not believe what I saw. As we approached the red light at the intersection of Prince Rodgers ave and North Bridge St. I noticed an object in the sky coming from the Somerville, NJ area. This object appeared very low to the ground, I am aware normal aircraft must be approximately 6 miles above the surface to be legally in our airspace. What was even more peculiar was the object was silent. I am highly aware that planes, helicopters, and blimps produce a specific sound depending on their altitude. Now the image of this object is rather bizarre. It had a flat bottom portion that consisted of way more than 25 lights. They would flash in a specific random sequence, turn off for a second or two, turn back on and begin flashing again. They were also accompanied by a blue light on the side. It was very hard to tell the depth and true image of the top portion of the object, but it had one nonetheless. For a moment I thought maybe it was a blimp, but the speed of this object exceeded that of a blimp. As the light turned green, I made a right turn onto North Bridge Street. However, I was going in the opposite direction because I was low on gas and had to get home so I could not keep up with it. So I pulled over and made a quick stop at the nearest bank. I parked and realized we were directly below the object but it didnt stop, being underneath this thing we just gazed at its lights and their bizarre sequence as it passed overhead. Eventually it passed behind trees that blocked my sight of it and I lost the object. Me and my girlfriend both sat in shock not knowing what we just saw and realizing not a single person would believe us at all. Fear seemed to summon within me for I was afraid of what I saw and could not explain it or why I was able to see it. If someone were to approach me on the 23rd and said to me, \"do you believe in aliens\" I would have said not really, I mean we may not be alone but who really knows. But now, I'm pretty much a firm believer that we are not alone and that they are here with us every day hiding in plain sight. Also it was quite odd to me that on my way back home to Somerville, NJ. I just wanted to keep driving around for a bit so I went down to our Main St. and to my confusion there were a lot of cops following each other as if they were trying to find something. I eventually made a right turn onto Davenport St. and went home. For those who do not believe in UFO's, I just want to say one thing. I once was just like you. I also want to add - The path of the object, It was coming straight then it slowed down turned alittle bit but turned back on its path. It was like watching someone not be able to make up their mind. It was weird because I know planes and helicopters all make wide turns, these turns were fairly quick."],"Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"07/24/2010 10:19 UTC","Weather Factors":"None","Log Number":"US-07252010-0009","Region":"New Jersey","Object Shape":"Square, Rectagular"}