{"Object Flight Path":"Straight-line path","Date of the Event":"07/25/2010 09:30 UTC","Source":"MUFON","Object Shape":"Fireball, Star-like, Other","Tags":"City","Region":"Massachusetts","City":"Cambridge","Log Number":"GB-07252010-0006","Date Submitted":"07/25/2010 05:27 UTC","Country":"United States","Longitude":"-71.100553","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsI was inside my home haveing a meeting with a fellow employee my wife and other friend went out back so to have some tea to leave some privesy in regards to a fellow employee. after about 20 minits or so my wife frantically called me to come and see something up in the sky.i ran to the window and could not understand what i was seeing.as they kept asking me to or what that was we were seeing with all the background i have in civil and military aircraft experience with in a job related nature.i asked my coworker to come out quickly to see what we were all seeing. as i came out the back garden my wife and frinds were frantically trying to ask me what is that . what i saw was. a flashing orange and then changeing to a solid red without flashing object about several thousand feet up. the reason i say this it was cloudy and overcast with 2 prominent layers of clouds with about a 1000 feet or so between them. this object to me! seemed about the size of a VW bettle in size moveing under the cloud line from about the north north west going south south east. at a speed of 200 mph. or slightly faster. the wind at the time was a light breeze if that at ground level. this object was seen by me when it was about the half way point from horizon to it vanished just befor reaching the orizon into a cloud back south south east from my direction. this object did not make any sound what so ever.and its intensity did not change in brightness the whole time i was watching.some of the other people in the area in thier back gardens were head talking about this also. so i know it was seen by at least 10 or so more then us 4.knowing the military aircraft in the area . as i work on the miltary base of RAF Lakenheath a US air base. this was strange to me as like i said duration of event and the lack of any sounds and it was below the cloud line well below left out any satilite or possible space station flyby. this i though needs to be reported and so here it is as fact"],"Sighting Duration":"00:04:20","files":["/var/www/straped/mufon/html2text/24750.html.txt","/var/www/straped/mufon/org/24750.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.37626,+-71.100553(24750)&iwloc=A&hl=en\"> mufon case (24750) map </A>","trends":["There have been 17 other sightings in Cambridge","There were no other sightings in Cambridge on or around July 25th 2010"],"Case Number":"24750","Summary":"Orange changing to red every 4 8 secounds, some flicker some not.","Latitude":"42.37626","Object Features":"None","Disposition":"Unresolved","Weather Factors":"Unknown"}