{"Date of the Event":"07/25/2010 11:30 UTC","Object Flight Path":"Path with directional change","Date Submitted":"07/26/2010 06:38 UTC","divs":["sighting detailsi was out on the balcony enjoying the evening with my boyfriend, it was a cloudy night - when we looked up and saw 3 illuminated, nickle-sized spheres in the sky. they were moving across the sky in a triangular formation and then suddenly split into individual orbs and just as quickly come back and rejoin almost merging into a single form --all in a matter of seconds!! this went on back & forth, back & forth for at least 15 minutes. they were lit up as though they were being projected onto the base of one gigantic cloud that dominated the sky, to the point were my boyfriend joked that there was a probably a ship in that cloud. i really wanted to think that this was maybe a light projection coming from a machine but i could not identify a link\\anchor leading to a location on the ground. also, their behavior changed suddenly; they were first sweeping across sky within an area of 200ft but they suddenly covered more territory and it looked as , though they were getting closer to right above our heads when we got spooked they almost instantly raced across the sky out of view!!!!! i did not have a good feeling about this at all and had witnessed the exact same thing happen in the sky last year at a previous location!!"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.30163,+-71.067605(24769)&iwloc=A&hl=en\"> mufon case (24769) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around July 25th 2010"],"Longitude":"-71.067605","Country":"United States","Object Features":"None","City":"Boston","Case Number":"24769","Weather Factors":"Fog, Medium","Latitude":"42.30163","Summary":"3 rapidly moving spheres in the sky in Boston.","Viewing Distance":"101-500 Feet","Tags":"City","Disposition":"Unresolved","Log Number":"US-07262010-0012","Object Shape":"Circle, Sphere","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/24769.html.txt","/var/www/straped/mufon/org/24769.html"]}