{"Country":"United States","files":["/var/www/straped/mufon/html2text/24768.html.txt","/var/www/straped/mufon/org/24768.html"],"Longitude":"-119.412242","Object Features":"Undisclosed","Disposition":"IFO","Case Number":"24768","Date of the Event":"07/24/2010 10:30 UTC","Object Flight Path":"Straight-line path","City":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"07/26/2010 05:30 UTC","Summary":"Stars moving at a rapid speed from different directions.","Sighting Duration":"Undisclosed","Latitude":"36.784851","Viewing Distance":"Over One Mile","Object Shape":"Fireball, Flash, Star-like","divs":["Sighting DetailsIt was Friday night and as a family we decided to go outside and look at the stars in the sky. It was a very clear night and we where able to see almost every star that night. As long as I can remember, I had always been able to spot certain stars that move rapidly. You have to stare at it to distinguish if it is a stable star or if it moves. Reason for that is because they camouflage along with the rest of the stars in size and color. So that night we where all looking up at the sky and took out our telescope. To my surprise I seen a star move that was very close to one of the shinier stars in the sky. It started moving upwards from my direction as if it were riding along earths outer layer. It was getting smaller and smaller in size as it moved farther away from our point of view. After 8 to 10 minutes I turned around to start looking towards another direction and I spotted another one along with my younger son next to me. At that point the rest of the family had gone inside. I really don't know what these objects are, since I mentioned before I have seen these numerous of times on a clear sky. At first when I was 16 or so, I immediately assumed that they were UFO's and thought it was pretty amazing that I had such a discovery. Over the years I have come to think that perhaps they may be new satellites that the government has launched. Sometimes I also like to assume that they are special jets that fly and practice at night time. Altough a thought comes to me about how quickly these star look-alike objects fly so quickly and sometimes in a count of 4, from different directions. At one time I seen one come from North, and after 10 min another from east, south, and west. It seems strange but never thought of reporting anything as people might debunk me into \"it's nothing\". One strange thing I seen on Friday the 25th of July 2010, is that when it started heading out of my view it somehow got brighter as if it shined a light and then went back to it's normal light activity. What could this be? All I see is star looking figures that move rapidly on a clear sky. I would like to know if anyone has also reported this so they can give me a piece of mind. I will have a camera next and hope it can catch the distance in the camera of the star like object."],"Log Number":"US-07262010-0011","trends":[],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.784851,+-119.412242(24768)&iwloc=A&hl=en\"> mufon case (24768) map </A>","Tags":"City"}