{"Longitude":"-76.604229","Case Number":"24760","Object Shape":"Sphere","Viewing Distance":"Over One Mile","City":"Baltimore","Region":"Maryland","Disposition":"Unknown","Date Submitted":"07/26/2010 05:17 UTC","Date of the Event":"07/25/2010 03:00 UTC","files":["/var/www/straped/mufon/html2text/24760.html.txt","/var/www/straped/mufon/org/24760.html"],"Summary":"4 large spheres moving west to east at high rate of speed.","divs":["sighting detailsabout 3 am i saw a sphere appear to the west of baltimore, traveling east at a high rate of speed. 3 other spheres followed at different elevations, all moving acoss the sky towards the east. all 4 disappeared quickly once past baltimore. conditions were no to low wind, clear sky, no clouds, almost a full moon visible to the west. i contacted 911. the operator said they were coming from the airport. i told her these were not lights, but had mass\\objects. she agreed that they were not lights but the airport was using something to help planes land. her explaination makes no sense. perfect flying conditions, 3am in the morning,helping planes land where???, in the atlantic ocean??? these spheres were heading out to the water. also, the airport is southwest of my sighting. these objects moved directly west to east. unless the airport is using some kind of new hologram technology, there is no way for these objects to have been projected in mid air. no clouds to bounce a strobe, flood or other light off of. if the airport is using this new technology, why haven't there been any reports on it?"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Tags":"City","Object Features":"None","Country":"United States","Latitude":"39.299315","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around July 25th 2010"],"Log Number":"US-07262010-0003","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.299315,+-76.604229(24760)&iwloc=A&hl=en\"> mufon case (24760) map </A>","Source":"MUFON"}