{"Case Number":"24778","Disposition":"Unknown","Object Shape":"Disc, Oval","Summary":"Disc in Phoenix.","Source":"MUFON","Longitude":"-112.067207","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.451807,+-112.067207(24778)&iwloc=A&hl=en\"> mufon case (24778) map </A>","Log Number":"US-07272010-0002","Sighting Duration":"00:15:00","Latitude":"33.451807","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 27th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Tags":"City","Date Submitted":"07/27/2010 12:39 UTC","Region":"Arizona","City":"Phoenix","Date of the Event":"11/27/2009 04:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Object Features":"None","files":["/var/www/straped/mufon/html2text/24778.html.txt","/var/www/straped/mufon/more/24778_submitter_file2__ufo-inverted.jpg","/var/www/straped/mufon/org/24778.html"],"divs":["Sighting DetailsMy cousin and I were waiting out side my Mom's house but she was running late. We both witnessed a strange object just floating in the sky. At first I thought it was a bird just floating and catching a drift of wind because it was windy that day. I pointed it out to my cousin and he said exactly how I was feeling \" wierd! \". We watched it for a minute while it made weird movements and then flew south faster that any plane or bird for that matter could move. It reappeared a few minutes later and this time I had my cell phone turned to the photo function and took a few pics. It then headed west out of sight leaving both of us feeling really wierd and confused. We were both saying to each other \"what the #*@~ was that!\" In one of the pics there is an airplane and the UFO which helps with the sizing of the object. When viewing this pic the zoom feature must be used. Look above the patch of blue sky for the disc shaped object to the right of the airplane. I even inverted colors on the other pic and you can clearly see something was there..and it wasn't a bird or another airplane."],"Weather Factors":"None"}