{"Object Flight Path":"Stationary","Region":"Indiana","Sighting Duration":"01:59:00","Longitude":"-87.164169","Object Features":"Undisclosed","Date of the Event":"12/15/1987 04:35 UTC","Object Shape":"Disc","Date Submitted":"12/15/1987 04:35 UTC","Weather Factors":"Unknown","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=38.129216,+-87.164169(2477)&iwloc=A&hl=en\"> mufon case (2477) map </A>","Latitude":"38.129216","Disposition":"Unresolved","trends":["There have been no other sightings in folsomville","This sighting has never been favorited."],"Summary":"a strange hunting trip","Tags":"City","files":["/var/www/straped/mufon/html2text/2477.html.txt","/var/www/straped/mufon/org/2477.html"],"Viewing Distance":"101-500 Feet","City":"folsomville","Country":"United States","divs":["Sighting Detailsit was sometime in dec. 1987 or 86 Im not real sure, but thats pretty close. Mygirlfriend at the time was working at a local hospital in the X-ray dept. Shewas on call that night and got called in at about 330 a.m., It was late bowseason for deer and I decided I would take her to the hospital and then pick herup after she got of work that morning. I dropped her off and then went to myhunting spot outside of town about 4 miles ne of boonville,IN. I arrived at myhunting spot on crowville rd. about 415a.m. As I did every morning when I wenthunting I stopped and got a big cup of coffee. I was sitting there for about anhour listening to the radio for a weather forecast when I noticed that the radiowas getting static. i looked around in the ski for an approaching storm when Inoticed a bright disc shaped object to the SE side of the roadway. It was overthe woods that I intended on going in when it got closer to sun up. The objectwas moving from the SE to the SW at a very slow speed. The object looked morelike a giant mirror reflecting the images from below. I thought to myself whatan excellent camoflage. i didnt notice any light flashing or any colored lights,it just reflected the lights from the nearby mine and the few streetlights downthe road I was parked on when it passed over the roadway. I could till that itwas flying low and very close in front of me becauseI could see through thebranches of some large trees in front of me. The object moved silently about200ft away in front of me. it moved to the right of the roadway anddissappeared behind some trees on the SW side of me. I remember being verynervous at this point almost scared feeling. I didnt like the fact that Icouldnt see it anymore. I sit their in the car and looked nervously around forthe object. I dont really remember what happened next other than the next thingI know it is daylight and I am now standing out in the woods in a small clearingstaring up at the sky through the trees. This was really weird I stood therethinking to myself what in the hell just happened, the last thing I remember Iam in the car and now I am standing a quarter-mile in the woods. I will neverforget how quiiet it was in the woods at that momemt, usually the birds are sing"],"Source":"MUFON","Case Number":"2477"}