{"Source":"MUFON","Log Number":"US-07262010-0017","Sighting Duration":"Undisclosed","City":"Ely","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.112566,+-114.7425(24775)&iwloc=A&hl=en\"> mufon case (24775) map </A>","Date of the Event":"10/31/2009 12:00 UTC","Longitude":"-114.7425","Case Number":"24775","divs":["Sighting DetailsMy wife and I were in the parking lot of the local supermarket (Gormans now Ridleys)and watched a very large and very bright sphere move across the night sky and at a pretty fast pace for the distance it was at. The object was extremely bright and moving across the sky from right to left from our position in the parking lot. 1. My wife and I had just finished shopping at the super market. 2. I noticed it due to its very large shape and brightness compared to any anything I have ever scene. It was also moving at a constant steady but fast pace. 3. By its size and brightness I new it was not an aircraft from either the military or civilian industry. 4. I would need to stand in the parking lot to be sure but I believe it was moving from South to North. 5. My wife was pretty excited about seeing it. At the time I new it wasnt anything from this world. But what could I do? I just stumbled upon this sight so this is about it. 6. The object continued along its course never deviating from its path and flew out of sight. I would say it maintained a constant altitude. 7. A few nights later I was in Butte, Montana and was describing what my wife and I had seen with another Field Engineer when the same type of object comes out of the South and is traveling at about what looked like the same speed, direction and with the same light intesity as what I had seen a few nights before. The other Engineer who was pretty sceptical at first looked at it and we watched it until it also traveled out of sight. He looked at me and said \" I dont know what that was\"."],"Latitude":"39.112566","Summary":"Just a very large, very bright sphere crossing the night sky.","Country":"United States","Date Submitted":"07/26/2010 10:55 UTC","Disposition":"IFO","Tags":"City","Object Features":"None","Region":"Nevada","Object Shape":"Sphere","trends":["There have been 9 other sightings in Ely","There were no other sightings in Ely on or around October 31st 2009"],"files":["/var/www/straped/mufon/html2text/24775.html.txt","/var/www/straped/mufon/org/24775.html"]}