{"Date of the Event":"07/25/2010 05:46 UTC","Latitude":"40.214256","Region":"Pennsylvania","Log Number":"US-07262010-0015","Object Shape":"Sphere","divs":["Sighting DetailsMe and my friend were driving on a road that leads to Rt. 11 one of the main roads in our town. I'm a regular sky watcher so i'm always looking up. We drove through a patch of trees and when we emerged i looked up into the sky and saw a bright dot just sitting there, at first i thought it was a star..but it was way to early for stars to be seen ( it was around 5:45 pm) This all happened very fast but after further inspection i noticed that the Spherical object was reflecting the sunlight so i assumed it was metallic. It was very obvious to me that this was neither a plane nor a helicopter, just a metallic sphere sitting about 500-1000 ft up in the air. As me and my friend were driving and looking at the object it started to fade. We drove through another patch of trees and when we emerged it was gone. I have NO DOUBT that this was an object that cannot be explained. If it was a plane i would of seen it when i emerged from the trees. There was no trail following the object. I parked my car about 2 minutes after seeing the sphere and scanned the skies for it again. But i didnt see anything, no planes, no nothing."],"Summary":"Metallic sphere hovering then dissapearing.","Date Submitted":"07/26/2010 09:25 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/24773.html.txt","/var/www/straped/mufon/org/24773.html"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.214256,+-77.008588(24773)&iwloc=A&hl=en\"> mufon case (24773) map </A>","Longitude":"-77.008588","Sighting Duration":"00:01:00","City":"Mechanicsburg","trends":["There have been 5 other sightings in Mechanicsburg","There were no other sightings in Mechanicsburg on or around July 25th 2010"],"Object Flight Path":"Undisclosed","Case Number":"24773","Country":"United States","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Source":"MUFON","Tags":"City"}