{"Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Undisclosed","Longitude":"-94.570027","Date of the Event":"06/26/2010 09:43 UTC","Log Number":"US-07272010-0008","Object Shape":"Circle","Latitude":"39.104936","divs":["Sighting DetailsThis is for the members of mufon everwhere. I want you all to know that the beings and crafts are real. I have seen them from afar and close up approximatly 5 th 10 feet away. They have allowed me to photograph them, video them and see more of them than I care to. I wouldn't mind if there had been more witness other than my mother, granddaughter, and wife. I have personally seen these things in downtown kc, and over my house. Last week one of these things flew or foated right over my head. I had been watching the skys that night and saw nothing. convinced that nothing was going to happen this night, I decided to go inside. Just as I reached to open the storm door I turned and looked once more toward the street and gazed up toward the tree in my front yard. At the top of the tree I was shocked to see an object that was tranlucent in color, comming slowly toward me. I at that moment walked away from my door, down my sidewalk and into the driveway, never taking my eyes off this thing. It was approximately 15 to 20 feet in length, had no wings pinkest,red in color. It had a strange glow, almost hypnotic as it came down over the tree in front of me then came lower to the ground approximately 5 to 10 feet above my head. Then it stopped. It just paused right above my head for what seem like an eternity which was really only about ten seconds then move in a continual straight line, but before it ascended above my home I shouted out \" What are You?' It never responded or reacted and just continued to float over the trees in the back yard and on toward the next block and upward. Now I just want them to stop flying over my home without cause. If these creatures are trying to figure a way to communicate with us then I would suggest a better of going about it would be to acknowledge that they are here. State their purpose. and then move on. This is getting tiresome. It is making the few friends that I have think that I need psycological help and perhaps I do, but the facts stil remain the same. I have seen these things all of my life from age 5 until the present. Mufon I don't want to tell your people how to do their job, but all they have to do is to look up. Thank God that the creatures don't appear to be violent or hostile. At this point they only seem to be observing. At first these things scared the (\"#$%) out of me, but after showing themselves so many times I have become acustomed to them even though each of them I seen is different with exception to the glowing balls which have been different in size, color, luminences, and intensity What I have realized after submitting several sightings is that I believe that even MUfon personell had doubts about the sightings And I don't expect your members to believe me but what I ask is that you keep looking up. They're there! Be safe."],"Region":"Missouri","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/24784.html.txt","/var/www/straped/mufon/org/24784.html"],"Viewing Distance":"Unknown","Date Submitted":"07/27/2010 05:07 UTC","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around June 26th 2010"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.104936,+-94.570027(24784)&iwloc=A&hl=en\"> mufon case (24784) map </A>","Summary":"There have been too many to count.","Tags":"City","City":"Kansas City","Case Number":"24784"}