{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Longitude":"-114.283968","Log Number":"US-07272010-0009","Summary":"Myself and *(Wit's name deleted--CMS/sg) observed more ships than I could count. Many hrs. missing. Smaller ships attached to very large craft at about 5am and left atmosphere.","Tags":"City","Region":"Arizona","Disposition":"Unknown","divs":["Sighting DetailsMyself and a friend were living on a ranch 70 miles due east of Parker,AZ. It was late in November, 1981. About a week before Thanksgiving. After a long day of work on the ranch we thought we would take a drive to the back of the ranch. It was dusk and the sun was setting fast. we drove to the top of the levy which surrounded the ranch headquarters to protect it from flash floods. From the top of the levy we had a clear view of the whole valley. The vallet is about 15 miles long and 8 miles wide. There was a small stream which ran at base of the levy along the outside of the compound. As we sat in the truck I looked out the window to the east and saw a light in the distance. At first I assumed it to be a small aircraft. Having completed aviation ground school and 20 hrs. of flight training I was naturally interested in what kind of aircraft it was. I pointed out the craft to my friend who did not pay it much attention. That is until I pointed out the erratic movements it seemed to be making. We got out of the truck and stood on side facing east. We stood there trying to figure out what kind of aircraft it could be. Having been to many airshows, flown a couple of small airplanes and a small helicopter, I kept trying to figure out what kind of craft it could be. That is when the craft started doing manuevers that no conventional aircraft I knew of could do. Moving staight up 5000 feet. A sudden dead stop and straight back down in the fraction of a second. Able to to fly the length of the valley in less than a second. After watching for about 15 minutes I looked to the north end of the valley. THere were more of these crafts. It was now dark and within 30 minutes there were so many ships I could not count them. They were small orbs. Brightly lit. Incredible manueverability. They appeared to be about two and a half feet in diameter. I believe these crafts to be a multi-functional device used for surveying and exploration mapping. After observing for about an hour I pointed ouy to my friend that all of the animals were silent. You could not hear anything. The silence was deadening. No frogs, coyotes, nothing. Not normal for a nite in Arizona. At this time the nite fades out. There are many hours missing from my memory. The next thing I remember is looking to the north end of the valley. I grabbed my friends arm and said look while pointing at a ship. Its size would would make a modern aircrat carrier look small. As it passed behind the mountain on the east side of the valley, it was so large only a third of the ship was hidden from view. In comparison to the mountain the craft had to be at least 4000 feet long. it flew south along the east side of the valley until it was in the southeast corner of the valley. It stopped, hovering about 2000 feet off of the ground. At this time, in a matter of a split second all of the small orbs came to a complete halt then in less than the blink of an eye attached themselves to the mother ship. We looked at each other in awe then looked back at the ship. While we watched this large craft shot straight up and out of the atmosphere in a split second. We looked at each other in disbelief. WE then went back to the house and sat there in a daze trying to take in what had just happened. Would not trade this experience for anything."],"Object Shape":"Blimp, Cigar, Circle, Cylinder, Fireball, Oval, Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.155756,+-114.283968(24785)&iwloc=A&hl=en\"> mufon case (24785) map </A>","Date of the Event":"11/13/1981 07:00 UTC","Weather Factors":"None","Date Submitted":"07/27/2010 07:40 UTC","Viewing Distance":"20 Feet or Less","Object Features":"Window(s), Other","Case Number":"24785","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"34.155756","files":["/var/www/straped/mufon/html2text/24785.html.txt","/var/www/straped/mufon/org/24785.html"],"Source":"MUFON","City":"Parker","trends":["There have been 14 other sightings in Parker","There were no other sightings in Parker on or around November 13th 1981"]}