{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24789.html.txt","/var/www/straped/mufon/org/24789.html"],"Date Submitted":"07/27/2010 01:33 UTC","Date of the Event":"07/27/2010 01:30 UTC","Tags":"City","Region":"Oregon","trends":["There have been 19 other sightings in Klamath Falls","There were no other sightings in Klamath Falls on or around July 27th 2010"],"Object Features":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=42.232437,+-121.77287(24789)&iwloc=A&hl=en\"> mufon case (24789) map </A>","Latitude":"42.232437","City":"Klamath Falls","Case Number":"24789","divs":["Sighting DetailsAfter an eventful day of thunder and lighting here in Klamath Falls, OR it had become very humid so about 1:00am I'd decided to step outside to cool off before I went to bed. Our front door faces east I glanced towards the north and noticed a very bright star but lower than any other stars and way brighter. As I observed this weird star I noticed it got brighter and dimmer than I was seeing red with in the flashing lights. I decided to go get my 18 year old daughter to come check it out. She was baffled by it too and noticed that it was moving very fast to the left and right and than up and down but very fast short movements. We decided to get my husband out of bed to witness what we were seeing. When we all came back outside it had moved up and to the right about 3 feet both ways, we could tell by the telephone poll and our neighbors shop but as we stood and watched it just kept moving up and down and back and forth from its main position. My husband and I had witnessed something like this when we lived in WA about 16 years ago but there was 3 of them. He said it looked like what we saw than a UFO. We only watched it for about 15 more minutes and got too tired to observe it any longer. Now I wish I would have watched it longer. I didn't take any pics I don't have a good enough camera."],"Object Flight Path":"Stationary,Path with directional change,Path then hovering","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Star-like shape but way lower than any other stars and brighter with flashing white, red, blue lights.","Log Number":"US-07272010-0013","Longitude":"-121.77287","Object Shape":"Star-like","Viewing Distance":"Unknown","Country":"United States"}