{"Summary":"Orange/red tubular object appearing and reappearing over approx 30 min.","City":"Hilton Head Island","files":["/var/www/straped/mufon/html2text/24786.html.txt","/var/www/straped/mufon/org/24786.html"],"trends":["There have been 2 other sightings in Hilton Head Island","There were no other sightings in Hilton Head Island on or around November 30th 1984"],"Sighting Duration":"Undisclosed","Date of the Event":"11/30/1984 12:00 UTC","Country":"United States","Viewing Distance":"101-500 Feet","Latitude":"32.223516","Log Number":"US-07272010-0010","Region":"South Carolina","Weather Factors":"None","divs":["Sighting Detailsapprox year 1985 on hilton head beach, SC., next to the holiday inn. time approx 12:30 to 1:00 am. this not an exact time, or even year. and i am asking my friends that i was on vacation with and had mentioned this event to if they can remember the year. myself and a girl both witnessed together a tube-like object. approx. 6 other people were also on the beach at that time that i noticed. i am not sure if they were noticing this event or not at that time. the others were scattered starting about 75 yards and more away from us down the beach. by our eye view without optics, the tube like object seemed to be approx 2.5 feet long with a 3 inch diameter with an intersecting inward slanting tube about approx 6 inch long and 3 inch same diameter tube at the rear of the object. the sky was mostly clear above us, and some cloud cover out over the ocean maybe a mile away. the object seemed to hover in the same locations. over the holiday inn to the left of us facing the ocean. the object seemed to hover about 3 hundred yards or so over the holiday inn. then after maybe five minutes later it would just appear near the cloud cover over the ocean in front of us. then it would come towards the beach almost over us. it was a very sharp image. the object seemed to every so often appear and reappear at somewhat the same points staying on what seemed the same plane or elevation. there were not any following beams to track this object. all we both could say to each other is what was that?"],"Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path","Object Shape":"Cigar, Other","Tags":"City","Case Number":"24786","map":"<A HREF = \"http://maps.google.com/maps?q=32.223516,+-80.750288(24786)&iwloc=A&hl=en\"> mufon case (24786) map </A>","Longitude":"-80.750288","Date Submitted":"07/27/2010 10:19 UTC","Object Features":"None"}