{"Object Features":"Undisclosed","Region":"Kentucky","Latitude":"37.093912","Source":"MUFON","Country":"United States","Summary":"Weird dream that my son had - possible abduction?","Tags":"City","Date of the Event":"06/10/2010 06:00 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy son came to me early in the morning over a month ago in my house crying and scared. He rarely dreams or tells me about it anyway... This particular morning, he came to me visibly upset telling me he dreamed about aliens. I would never take him serioulsy normally but this morning and the way he acted made me listen. He began to tell me that (in his dream) he woke up and a little gray men took him with them out the door and took him on their ship. The gray men had big black eyes and when I asked about the nose he pushed his up, and into his face, I'm thinking to make it look like there wasn't much of one except for holes, maybe? I asked him about their hands and he said their fingers looked long like sticks. He said the ship was silver with yellow, green and white lights. He said it was a ball with a ring around it...He said they took him to the moon. He told me they were talking in whispers and he remembered them telling him to \"Stay.... stay with us.\" He kept repeating that. He said he was scared and told them to take him home to Mommy. I know that people can be influenced as well as children by television and whatnot, but I'm nearly 100% positive that he has not seen any show where a detailed account of an abduction has been explained. I have been watching everything I can on abductions since he came to me and it really sounds eerily similar to an alleged account of. He is a truthful child. He had just turned 5 and I can always get the truth from him. He sounded totally legit. I know it could have been a dream but isn't that how some people remember? I've never heard him come and tell me a dream so vividly and detailed. I thought it should be my duty to report this and if anything else happens, I will definitely report again. Thanks for even taking the time to read this. RMA"],"files":["/var/www/straped/mufon/html2text/24796.html.txt","/var/www/straped/mufon/org/24796.html"],"Viewing Distance":"20 Feet or Less","Date Submitted":"07/27/2010 07:42 UTC","Log Number":"US-07272010-0020","Case Number":"24796","Disposition":"IFO","Longitude":"-84.594308","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.093912,+-84.594308(24796)&iwloc=A&hl=en\"> mufon case (24796) map </A>","trends":["There have been 3 other sightings in Somerset","There were no other sightings in Somerset on or around June 10th 2010"],"City":"Somerset","Object Shape":"Saturn-like, Unknown","Weather Factors":"Unknown"}