{"Date of the Event":"07/05/2010 01:30 UTC","Date Submitted":"07/27/2010 03:44 UTC","divs":["sighting detailswe had a bbq for 4th of july, then went to a friend's house. when we got back home (after midnight) i was putting some things away (lawn chairs, etc) at about 1 a.m. & just looked up at the night sky to admire the stars, & to the east (at about a 45 degree angle saw an aircraft in the sky). as i viewed this aircraft i could not determine whether it was a plane, helicopter, or military vessel. it caught my attention, because it was so low...the airport isn't too far from us, but usually we don't see plane flying that low around here. so, i watched it for about 2 min. it seemed to move or maybe hover. it had 2 white lights & one red one in the middle of the 2 white lights. as i watched, it seemed to be getting closer, but not like a plane. i found this a little strange, but dismissed it at first as maybe military tests (since we have a military base near by)it wouldn't be that unusual. when i heard about what others saw that night, i am sure i saw it. i don't own a t.v. & don't watch the news, it's depressing. i just surf the internet for the info i want to hear about. so 2 days ago, i put in google (alien sightings in clovis) and mufon\\jeffery popped up. thats when i decided to contact you. there was also an incident back in 2004. at my mom's house, where i am now...my bf & i were sitting on the back of his oldsmobile, looking up at the sky & just conversating. we looked up & there was this steath like triangle shaped aircraft. it made no noise whatso-ever. was dark, no lights at all, & passing right above us. slowly, almost like it was hovering. i didn't report it because i just figured it was military, lemoore airforce base isnt too far from us."],"Country":"United States","Case Number":"24792","Region":"California","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"36.826758","Summary":"Hovering or moving very slowly, in the distance. Quiet, large, & bright.","trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around July 5th 2010"],"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.826758,+-119.694759(24792)&iwloc=A&hl=en\"> mufon case (24792) map </A>","Disposition":"Unknown","Longitude":"-119.694759","Viewing Distance":"Unknown","City":"Clovis","Weather Factors":"Unknown","Log Number":"US-07272010-0016","files":["/var/www/straped/mufon/html2text/24792.html.txt","/var/www/straped/mufon/org/24792.html"]}