{"Summary":"I woke up in the morning and started to take pictures of the morning sky.","Region":"Ontario","Object Features":"Undisclosed","Object Shape":"Circle, Egg, Sphere","Latitude":"43.662126","Tags":"City","Case Number":"24799","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI woke up at around 11 am and decided to take my camera to take pictures of the morning sky. I live on the 20th floor of a building, so i have a very good view if the surrounding area. The sky was completely clear at the time and there were no planes or other identifiable objects in sight. the sky was simply just clear blue. no clouds either.I, unfortunately, took only 2 pictures as i didn't see the point in wasting the memory of my camera on empty blue sky. on that same day, it was at around 5:00 pm that i decided to look through the pictures on my camera for anything strange i might have captured that i didn't see before. i do this regularly because i am already a strong believer in the UFO phenomenon. so, to my surprise, i actually got a picture of something i couldn't explain. the object in the picture seemed to be VERY far away and yet pretty big. i say this because even though the distance between me and the object was huge, you could still see the object with some length of detail. at the time, my cameras zoom was set to x6.0 . the camera i was using was a full HD 1080p sony(13.6 mega pixels). sure enough the picture was in very good quality. as i said before i did NOT see a single thing in the sky while i was taking the pictures. this all the information i have. please, if you can, analyze the picture and get back to me with the results. i will provide the 2 original pictures, the THIRD picture will be an enlarged copy of both of the originals put side by side."],"Date of the Event":"07/27/2010 11:30 UTC","City":"Toronto","files":["/var/www/straped/mufon/html2text/24799.html.txt","/var/www/straped/mufon/more/24799_submitter_file1__DSC05111.JPG","/var/www/straped/mufon/more/24799_submitter_file2__DSC05112.JPG","/var/www/straped/mufon/more/24799_submitter_file3__Screenshot2010-07-27at9.16.04PM.png","/var/www/straped/mufon/org/24799.html"],"Object Flight Path":"Undisclosed","Source":"MUFON","Country":"Canada","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.662126,+-79.377894(24799)&iwloc=A&hl=en\"> mufon case (24799) map </A>","Log Number":"CA-07272010-0023","Longitude":"-79.377894","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around July 27th 2010","This sighting has never been favorited.",""],"Disposition":"Unresolved","Date Submitted":"07/27/2010 09:28 UTC","Viewing Distance":"Unknown"}