{"Date of the Event":"07/21/2010 10:45 UTC","Date Submitted":"07/27/2010 09:08 UTC","Sighting Duration":"Undisclosed","Log Number":"US-07272010-0021","map":"<A HREF = \"http://maps.google.com/maps?q=33.608572,+-112.293169(24797)&iwloc=A&hl=en\"> mufon case (24797) map </A>","Longitude":"-112.293169","files":["/var/www/straped/mufon/html2text/24797.html.txt","/var/www/straped/mufon/org/24797.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Summary":"Round, green light with green halo/aura completely surrounding it.","Source":"MUFON","Tags":"City","Region":"Arizona","Disposition":"Unknown","Latitude":"33.608572","Country":"United States","Case Number":"24797","Object Flight Path":"Straight-line path","Object Shape":"Circle, Sphere","Weather Factors":"None","City":"Sun City","trends":["There have been 2 other sightings in Sun City","There were no other sightings in Sun City on or around July 21st 2010"],"Object Features":"None","divs":["Sighting DetailsI am a firefighter and I was on duty on Wednesday, July 21, 2010 when I saw the object. Three of our four crew members (myself and two others) were walking through the desert area just behind our fire station, catching scorpions when one of the guys said,\"woah, woah, woah!\" I thought he saw a snake or something on the ground, so I looked all over the ground by my feet and he started to tap me and pionted up to the southwest sky. He wasn't able to talk. He just motioned to the sky. I looked up and caught about a half to three quarters of a second of a round, green light with a green halo light surrounding it. It flew horizontally across the sky, from east to west, at the same altitude throughout its duration, at an extremely high rate of speed, making no sound at all and dissappeared when it reached the southwest sky. The other two guys saw at least 2-3 seconds of its flight before it disappeared. It didn't go behind anything. It just disappeared completely. Coincindentally, Luke Air Force base is southwest of our fire station. I see jet planes and various aircraft constantly flying over and around our station all the time. They have conventional lights and strobes on them. This green craft was like nothing I have ever seen before fly in the sky around my station. I have seen tons of ufo videos and footage in my life. I am pretty savy when it comes to ufos and their flight patterns. This was similar to lots of ufo pics I have seen before and had similar rates of speed than them too. It is a topic that I am very interested in, but this isn't wishful thinking when I saw this since all three of us saw the same thing. The funny thing is that we, at the fire station frequently talk about ufos and aliens on a regular basis. Needless to say, we were excited but not too terribly surprised since we do believe that these things really do exist. All we need now is for our government to acknoledge and admit to the public that they exist since they already know anyway. If they did come out with the truth, most people would be as surprised as they were when Liberace and Ricky Martin came out of the closet(we all saw that coming...lol). I would like to remain anonomous."]}