{"Case Number":"24805","Object Flight Path":"Straight-line path","Log Number":"US-07282010-0002","Longitude":"-85.970317","Latitude":"41.689324","trends":["There have been 12 other sightings in Elkhart","There were no other sightings in Elkhart on or around February 15th 2010"],"Source":"MUFON","Region":"Indiana","Object Shape":"Triangle","Tags":"City","Date of the Event":"02/15/2010 04:45 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/24805.html.txt","/var/www/straped/mufon/org/24805.html"],"Summary":"Black triangle had red light at each corner.","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.689324,+-85.970317(24805)&iwloc=A&hl=en\"> mufon case (24805) map </A>","Date Submitted":"07/28/2010 06:54 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","City":"Elkhart","divs":["Sighting DetailsI was leaving for work in the morning about 4:45 a.m. and was looking up at the stars before I got in my vehicle (it was very clear sky's). That's when i noticed a red light moving in the sky at very high altitude. At first I thought it was a satellite that's when I noticed two other red lights and it was a black (or some other dark color) triangle. I know that sounds weired but it was a black triangle and had red lights at each corner. The reason I know it was a triangle instead of three individual lights was as it moved across the sky the object blocked the lights of the stars behind it. Focusing on the object harder you could see the body of the object as well. The object was at high altitude and was heading due east at very high speed. From the time I first saw the object until I couldn't see it anymore was about 15 to 20 seconds. No plane is going to shoot across the sky at that altitude in 15 seconds. This has been definitely one of the coolest things I have ever seen. I don't know if it was military in nature or something else, but I would love to find out."],"Viewing Distance":"Unknown","Disposition":"Unknown"}