{"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.373248,+-82.685474(24804)&iwloc=A&hl=en\"> mufon case (24804) map </A>","Date of the Event":"Unknown","Latitude":"28.373248","Disposition":"Insufficient Data","Longitude":"-82.685474","Viewing Distance":"Unknown","Date Submitted":"07/28/2010 02:23 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Hudson","There were no other sightings in Hudson on or around"],"Country":"United States","Region":"Florida","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Hudson","Log Number":"US-07282010-0001","Tags":"City","Summary":"Please read below, way too much to try to explain here. im really sorry.","files":["/var/www/straped/mufon/html2text/24804.html.txt","/var/www/straped/mufon/org/24804.html"],"Case Number":"24804","divs":["Sighting DetailsI am not compfortable doing this but after tonight I cant deny this crap any more. There is entirly to much information for me to type here. What I need to talk with someone about has been going on for three weeks and twice before tonight i was able to get someone to witness what i was and although they clearly saw it with their own eyes, they both said the same thing ... as long as it stayed in the sky they didnt care. tonight was more activity than i could handle so i called a friend and asked if i could pick her up. i really thought by the time i did and returned to my house there would be nothing to see but i was way off. i would have been happy if she simple witnessed the smallest thing so i would know i wasnt going crazy but i got way more than that. with me tonight at my side my friend and i witnessed more than i have yet.i dont understand why this is not all over the place. it can not be just me and who ever i show. i have not seen any triangles or any of the craft objects i am reading about and what i am witnessing is far away but its been more and more activity each night for three weeks now so i cant imagine its going to stop now. i dont want this to go public and i dont want a bunch of people here but i really want to have some one who can tell me what the hell is going on cause im not crazy and something big is happening. im so embarrassed to even be writing this but i just cant act as though this isnt important any more. these are not planes or helicopters ... they can not do what we saw over and over repeatadly and these are not stars cause stars dont turn green, red, and orange or white...the lighter color looks orange some times and sometimes white. planes cant hover or go in one direction and instantly go in the opposite direction, no turn around at all. planes done hover and move up and down and although helicopters do more similar moves, they dont move like this and more importantly, they all to my knowledge make noise. i dont understand why no one else is noticing this other than maybe the majority of what im watching at first glance some look like a star unless you watch it and at a glimpse some could be planes, again, unless you watch it. stars dont change color and they dont get supper bright one second and all but disappear the next then glow dark and light...move around but you have to realy watch it to see and then lower them selves all the way down into the horizon. yes, i know how this sounds. im so grateful to have picked my friend up to night and have her witness all that she did. what on earth is happining. someone with knowledge to this kind of thing really needs to see this. please do not make ant of this public, i want no connection to this. im embarrassed, scarred, and stressed out over this."]}