{"Disposition":"IFO","Object Shape":"Star-like","Sighting Duration":"Undisclosed","City":"Ottertail","Latitude":"46.425516","Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsAs the sun was down but still light to the west, I saw a bright star like object looking west from north side of ottertail lake MN above the treeline but it was many times larger than any star. Caught my eye through back porch doors and just hung above the trees. Thought object could have been more than 10 miles in the distance. Was stationary. I ran outside to get a better look and it went from a bright multi colored star like object with spikes out in the distance then turned into a small pin like blue light with blue halo around it. Flickered twice and then slowly went dim. Sighting was approx. 30 seconds. I heard a jet in the area. turned around to go back in the house and a low flying jet almost went right over my house approx 2-3k ft.?? Jet looked like had three white lights on it (one in front and one one each wing). I could not see nav lights on it. Jet was heading east and then banked north slowly and then gone. Jet was moving slow and was not very loud. I did not have my digital video camera with but went inside to load my cannon with film and put on my 300mm zoom. My camera will be ready if I see it again. I bet there are others who saw this happen and hope to hear more about it."],"Log Number":"US-07282010-0003","Object Features":"Undisclosed","trends":["There have been no other sightings in Ottertail","This sighting has never been favorited."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.425516,+-95.557264(24806)&iwloc=A&hl=en\"> mufon case (24806) map </A>","Longitude":"-95.557264","Case Number":"24806","Date of the Event":"07/27/2010 10:05 UTC","Region":"Minnesota","Weather Factors":"Unknown","Summary":"Large star like with spikes and then turned blue dot with halo.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24806.html.txt","/var/www/straped/mufon/org/24806.html"],"Date Submitted":"07/28/2010 11:46 UTC"}