{"Source":"MUFON","City":"Fort Worth","Country":"United States","Region":"Texas","Summary":"Shining Bright light(s) in the Western Sky (not the planets)","Object Features":"Unknown","trends":["There have been 128 other sightings in Fort Worth","There was one other sighting in Fort Worth on or around July 28th 2010"],"Disposition":"IFO","Date of the Event":"07/28/2010 10:09 UTC","Object Shape":"Circle, Sphere, Star-like, Unknown","Latitude":"32.728969","Viewing Distance":"Unknown","Longitude":"-97.31943","map":"<A HREF = \"http://maps.google.com/maps?q=32.728969,+-97.31943(24819)&iwloc=A&hl=en\"> mufon case (24819) map </A>","Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24819.html.txt","/var/www/straped/mufon/org/24819.html"],"Date Submitted":"07/29/2010 12:06 UTC","Log Number":"US-07292010-0001","Tags":"City","Object Flight Path":"Straight-line path","Case Number":"24819","divs":["Sighting DetailsI was driving I30 West when I noticed a VERY bright star(I thought) in the western sky not far above the horizon. I watched it the entire time going west - it wasn't moving, and it appeared that no lights were blinking. As I continued west, it became slightly brighter. I went home to Benbrook, picked up my nephew & his 10x50 Binoculars and went back to get a better look. We went the direction of Weatherford (west of Fort Worth, pulled over to an area and it had moved even lower on the horizon. It appeared as Multiple orange lights moving DIRECTLY west. Whatever this was, had to be moving very slow for it to still be on the horizon. Also - we noticed more aircraft activity to the west - but did not notice any military aircraft and at one point my 18 year old nephew saw a quick light blue flash go from east to west over our heads (this could have been a shooting star - but we are unsure). The orange lights eventually moved further west towards the horizon until it was out of site at 10:44pm (CDT). We immediately wanted to report this - and the only spot I knew to do this would be MUFON. We searched the news but did not see anything. As bright as this was - there will DEFINITELY be more people discussing this. Please let us know what you find out. I do not have a photo, as my kid had busted her camera. Great timing."]}