{"Latitude":"36.003961","Sighting Duration":"Undisclosed","Date Submitted":"07/28/2010 06:42 UTC","Disposition":"Insufficient Data","Log Number":"US-07282010-0011","Longitude":"-96.106406","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMe and my neighbor were sitting outside by the pond, we had a fire going in our fire pit. It was about 1:am, we were looking at the stars, it was a calm clear night. There was no storms forecast in the area. All of a sudden we saw a large cloud like thing that was coming toward us from the north, it was perfectly straight across the bottom, as large a football field, it looked like rolling waves, we both jumped up and said a storms coming, we got to put this fire out. As soon as we stood up it had already gone over us and was gone, we looked to the south looking for it, but didn't see anything. We both just stood there for a few minutes looking at each other. We said \"wow that was weird\" so we just sat back down then our fire starting flattening down and going circles. We didn't feel any wind or hear anything. Whatever it was it was really fast. I've never seen anything like it. Ever since I have been watching tv for anything about ufos. It left a big impression on me and my neighbor, we still talk about from time to time. Whatever it was it did not look normal."],"Date of the Event":"09/29/2008 12:00 UTC","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Sapulpa","There were no other sightings in Sapulpa on or around September 29th 2008"],"Summary":"Large rolling cloud that looked like tidal wave, perfectly rectangular shape.","City":"Sapulpa","Tags":"City","Object Features":"Undisclosed","Object Shape":"Square, Rectagular","Case Number":"24814","Region":"Oklahoma","files":["/var/www/straped/mufon/html2text/24814.html.txt","/var/www/straped/mufon/org/24814.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.003961,+-96.106406(24814)&iwloc=A&hl=en\"> mufon case (24814) map </A>"}