{"Weather Factors":"None","Object Shape":"Triangle","Object Features":"Unknown","Region":"Ontario","Object Flight Path":"Other","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.985038,+-81.243198(24816)&iwloc=A&hl=en\"> mufon case (24816) map </A>","Latitude":"42.985038","trends":["There have been 32 other sightings in London","There were no other sightings in London on or around June 15th 1998"],"Date of the Event":"06/15/1998 10:00 UTC","Summary":"Witnessed a wedge-shaped object pass directly over my apartment building","Sighting Duration":"Undisclosed","Log Number":"CA-07282010-0013","files":["/var/www/straped/mufon/html2text/24816.html.txt","/var/www/straped/mufon/org/24816.html"],"Case Number":"24816","divs":["Sighting DetailsDATES AND TIMES ARE APPROXIMATE One Saturday night, after my brother had bought his first laser-pointer, we were on the 5th floor balcony of my apartment building trying to see how far away we could see the beam. The last of the sunset was fading from the sky when my brother decided to go inside. I waited outside to see if I could see the beam on a cloud. The first cloud I saw appeared to be over the downtown area and seemed to be illuminated by the lights of the city. I tried the laser on it, but couldn't see anything. So, I looked up, closer to my location. I could see stars, but no other clouds. I leaned out from my balcony to look up and see if there were any clouds straight up. No luck. That was when I noticed that there was a wedge-shaped section of the night sky obscured above the building. From the part I could see, it appeared that whatever was up there was mostly blocked from my view by the balconies above. I tried aiming the laser-pointer at the object with no effect. I went to get my brother to show him what I saw, but it was gone when I got back. AREA CONTAINS A MILITARY BARRACKS(3 BLOCKS AWAY), RAILROAD TRACKS (LESS THAN 100 METERS AWAY), AND AN AIRPORT (2 TO 3 KILOMETERS AWAY)"],"Country":"Canada","Source":"MUFON","City":"London","Disposition":"Unresolved","Date Submitted":"07/28/2010 09:10 UTC","Longitude":"-81.243198","Tags":"City"}