{"Object Features":"None","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Latitude":"35.033477","map":"<A HREF = \"http://maps.google.com/maps?q=35.033477,+-110.690327(24813)&iwloc=A&hl=en\"> mufon case (24813) map </A>","files":["/var/www/straped/mufon/html2text/24813.html.txt","/var/www/straped/mufon/org/24813.html"],"Country":"United States","Case Number":"24813","Tags":"City","Summary":"Round, hovering, flickering such as a flame but emitting no light around it just directly from the center source.","Date Submitted":"07/28/2010 05:00 UTC","Weather Factors":"Windy, Lightning, Rain, Heavy, Light","City":"Winslow","Sighting Duration":"00:15:00","trends":["There have been 5 other sightings in Winslow","There were no other sightings in Winslow on or around July 27th 2010"],"Disposition":"Unknown","Object Shape":"Fireball","Source":"MUFON","Region":"Arizona","Object Flight Path":"Path with directional change","divs":["Sighting DetailsIt was about eight thirty in the evening, my fiancee and I had decided to get on top of our roof to view the lightning from an oncoming storm from the east. We had been up there for a good thirty minutes before anything was actually noticed. We were discussing an aspect of our wedding, she was sitting the same direction as I towards the east, but looking at me to the south. I noticed that she was kind of staring off past me into the distance. It was another minute before she says anything. \"Do you see that?\" she asked me. I look to where her eyes are gazing. My first thought was that it was a street light, the orange yellow light it emitted \"I have no clue, what is that thing?\" I ask out loud. We watch in silence for another moment. It is hard to describe the movement of the object. A kind of slow smooth gliding or hovering. I remember clearly that the movement was very smooth, unlike an aircraft. My heartbeat quickens and I am suddenly very anxious. I say,\"Maybe a helicopter?\" \"No, the light is different and there is no sound.\" she tells me. Whether it was from the cool wind or from the realization that I had no explanation for this, the hairs all over my body were standing on end. It made its way from the airspace above downtown closer then subtly shifted directions towards the east and soon the light faded in the distance. I suddenly noticed something else, \"That's odd\" I say,\"it was going against the wind straight into that storm.\" We had been so submerged in watching the object we realized only then that we hadn't even thought of getting a camera or phone to call my mom, whom could have seen it very clearly from where she lives on the outskirts of town. I contacted her and one of my friends to tell them what we had just seen, still very excited at this encounter. It was through my friend I came here to share this story that still amazes me."],"Log Number":"US-07282010-0010","Longitude":"-110.690327","Date of the Event":"07/27/2010 09:15 UTC"}