{"Source":"MUFON","Viewing Distance":"Over One Mile","Weather Factors":"Windy","Case Number":"2481","Country":"United States","Longitude":"-120.000969","map":"<A HREF = \"http://maps.google.com/maps?q=35.313579,+-120.000969(2481)&iwloc=A&hl=en\"> mufon case (2481) map </A>","Date Submitted":"08/01/2003 09:10 UTC","Region":"California","trends":["There have been no other sightings in California Valley","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Latitude":"35.313579","Object Shape":"Oval","Object Features":"Undisclosed","City":"California Valley","Log Number":"","Sighting Duration":"00:10:00","Summary":"Unidentfied Flying Event over California Valley","divs":["Sighting DetailsDeparted San Luis Obispo at 1545 hours for California Valley. Enroute conditionsinclude partly cloudy skies and humidity arriving at Kern Cattle and Landcampground due south of Soda Lake at 1800 hours while several thunderstormsystems tracked east toward Fresno.Weather system did not produce lightening however thunder was noted untilsundown.Throughout the evening until estimated 2210 hours, we tracked air traffic alongthe Los Angeles to San Francisco north to south corridor, noting distinct andfamilar engine noise and strobing. Likewise, we watched the northwestern sectorof our sky noting 3 metoroid entries. My colleague then called my attention tothe West on our visual horizon.I noted an object unrelated to current air traffic patterns flying due east downthe center of California Valley at an altitude estimated between 18,000 to25,000 feet. Object velocity was not relative to any above airborne traffic andacoustical signature sounded a few decibels under a normal aircraft engine.Likewise, object continued due East at an unusual velocity without typicallynoted strobing safety lights. Object was estimated yellow in continous colorthroughout flight path to the East. Neither did object jerk or weave.Moreover, at first glance, object presumption was military. However, object didnot sound like an aircraft on military afterburner. Its acoustical signature eg.doppler effect did not match, ie. short sound like tail as object moved acrossline of sight track.Initial reaction was calm due to 20 years of seeing and hearing various militaryaircraft. However, as visual tracking continued, reaction changed to excitementand apprehension. Object behavior did not meet normal operating aircraftcriteria ie. safety strobing and acoustical signature.Object simply faded from visual due East tracking.Moreover, approximately 10 to 15 minutes later around 2235 hours, anotheranomalous event occured at 70 to 80 degrees off the horizon. We were trackingsatellites throughout the evening then observed an unusual geometeric pattern of3 objects tracking again West to East.Formation geometry was triangular moving half the speed of observed object.Geometric object lights were steady white much like earlier observed satellites.Again, emotional response ranged from calm to excited and apprehensive due toproximity of earlier event. Eventually, object faded from visual tracking dueEast of California Valley."],"files":["/var/www/straped/mufon/html2text/2481.html.txt","/var/www/straped/mufon/org/2481.html"],"Disposition":"Insufficient Data","Date of the Event":"08/01/2003 09:10 UTC","Tags":"City"}