{"Summary":"I was sitting in my family room when I noticed what a bright light in the north east sky.","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Object Shape":"Saturn-like","Region":"Illinois","Weather Factors":"None","Longitude":"-87.628378","Source":"MUFON","divs":["Sighting DetailsIt was Sunday on a warm July night. About 10:00 pm I was sitting in my family room watching TV with my wife. When I looked out the window and I noticed a very very brilliant bright gold light in the north east sky. At first I thought it was a star. I believed it was too bright to be a star, especially on a night with a full moon. I thought perhaps it was a low flying airplane. Starring out the window for a while, it was not moving like a plane. My wife asked, what are you looking at? I said there is something out there. I called my wife to take a look. She went and got out our telescope 25 x 100 skymaster.. The gold light was positioned at 2:00 in the sky. When I looked through the telescope I was astonished see what looked like a dark crescent shape craft with different colored red and blue lights that outlined its shape and bright gold light off center. I asked my wife to take a look and she verified the same craft. It was moving, almost floating very slowly from the north east to the south west. We both felt unsettled and anxious, Like it was observing. This sighting lasted for an hour and half before we went inside leaving the craft in the sky starring down. The longer we observed the more creeped out we got and felt compelled to go inside. It was the first time we both have ever seen anything like that before. The next night Monday on the 28th I went out with my wife at about 9:30pm and it was there again. I thought perhaps we misidentified it the night before. With the naked eye it looks like a star but when we used the telescope it was a craft of some kind. On the next night, Tuesday the 29th, it was very clear night and the craft was not there. Afterwards we tried to think about else could it have been, not a star, not a plane, or comet , meteor, satellite, astroid. I can not figure it out. I went on the MUFON site and saw a very similar photo of a crescent shaped UFO taken in 1987 in Illinois."],"Latitude":"41.883794","Country":"United States","Date of the Event":"07/27/2010 10:00 UTC","Viewing Distance":"Over One Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.883794,+-87.628378(24815)&iwloc=A&hl=en\"> mufon case (24815) map </A>","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around July 27th 2010"],"City":"Chicago","files":["/var/www/straped/mufon/html2text/24815.html.txt","/var/www/straped/mufon/org/24815.html"],"Sighting Duration":"Undisclosed","Date Submitted":"07/28/2010 08:32 UTC","Object Features":"Patterned Surface","Log Number":"US-07282010-0012","Case Number":"24815"}