{"Country":"United States","Region":"Alabama","Disposition":"Unknown","divs":["Sighting DetailsWell, I was looking in the sky towards where the sun sets because I was watching for the meteor shower... there was a bright light in the sky that I assumed was a planet. I got my binoculars and realized that this thing that is suspended in the sky has a red light... then I told my wife to come look and I was thinking my eyes were playing tricks on me, but she looked throught the binoculars and saw the red light too. Anyhow, I watched it and watched it and it was basically \"setting\" like the stars or sun, but the thing with this is there was a point where the bright white light turned off and all you could see was the red light and then a few seconds later, the red light disappeared as well. I watched this thing disappear in the clear sky and I walked around my house to look and it was just simply gone. I walked back around the the back porch where I was originally and before I got up the stairs my wife told me that its' back... I was amazed!! I knew for a fact now that this thing was not a planet, but something up there that was just sitting still enough to \"set\" as the earth rotated. It got on down near the horizon and appeared to now be blinking white and red, but that could have been because it was so far away. It did disappear and reappear one more time before I decided it's too far away to even watch anymore. I had thought maybe it was the space station, but I've heard that it travels across the sky at a high rate of speed... this thing I saw simply was not moving at all."],"Weather Factors":"None","Summary":"Bright light (looked like planet) with a red light on it.","Source":"MUFON","Object Shape":"Unknown","Tags":"City","Case Number":"24828","map":"<A HREF = \"http://maps.google.com/maps?q=33.526111,+-86.79865(24828)&iwloc=A&hl=en\"> mufon case (24828) map </A>","City":"Birmingham","files":["/var/www/straped/mufon/html2text/24828.html.txt","/var/www/straped/mufon/org/24828.html"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Latitude":"33.526111","Object Flight Path":"Undisclosed","Sighting Duration":"00:45:00","Date of the Event":"07/28/2010 10:00 UTC","Longitude":"-86.79865","Log Number":"US-07292010-0010","Date Submitted":"07/29/2010 10:14 UTC","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around July 28th 2010"]}