{"Source":"MUFON","City":"Murfreesboro","Object Flight Path":"Straight-line path","Weather Factors":"Does Not Apply","Longitude":"-86.38257","files":["/var/www/straped/mufon/html2text/24825.html.txt","/var/www/straped/mufon/org/24825.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.847461,+-86.38257(24825)&iwloc=A&hl=en\"> mufon case (24825) map </A>","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.847461","Date Submitted":"07/29/2010 03:39 UTC","Summary":"There were 4 of us that happened to be hanging out at the time of the event, I happened to be facing North West when I spotted a round pulsating orange light moving slowly (much slower than a prop plane).","Object Features":"None","Sighting Duration":"00:02:00","Case Number":"24825","Date of the Event":"07/04/2010 11:30 UTC","trends":["There have been 18 other sightings in Murfreesboro","There was one other sighting in Murfreesboro on or around July 4th 2010"],"Log Number":"US-07292010-0007","divs":["Sighting DetailsI live in a town home in Murfreesboro, TN. We know most of our neighbors in fact two of our good friends live right next door. It was the night of the 4th we were all hanging out outside in front of our town home watching fireworks being shot into the sky by our neighboring apartment complex which is a huge college apartment complex. So needless to say there were plenty of fireworks for us to watch while we chatted amongst ourselves. There were 4 of us that happened to be hanging out at the time of the event, I happened to be facing North West when I spotted a round pulsating orange light moving slowly (Much slower than a prop plane) and moving off to the North East from my position. This orange globe looked to be rather large based on its altitude. I would estimate it to be about as big as a compact car. Looked to be about 400 to 700 feet off the ground and traveled silently flickering almost like a campfire. This means that the intensity of the orange light being emitted by this object changed constantly giving it a \"globe containing a fire\" type of effect. My neighbors walked down the street to help keep it in view so that the apartments next to our location did not prevent us watching it. But then it just turned off its light, and just as quick as it had begun it ended. I have never contributed to the mufon database although I have had many encounters watching the skies over the years. I was casually looking at the mufon UFO activity map and noticed after reading the other 10+ accounts that many people witnessed the exact same thing all over the country that same night of July the 4th 2010. So I thought it is almost my duty to confirm this by adding our report."],"Object Shape":"Sphere","Tags":"City","Country":"United States","Region":"Tennessee"}