{"Viewing Distance":"Unknown","Case Number":"24823","City":"Bothell","Object Features":"Undisclosed","Summary":"2 bright lights in the sky looked like stars. Were stationary for at least 30 seconds and then shot off in a instant, like a bullet. one, then the other. Fast as bullet- just gone.","Date Submitted":"07/29/2010 03:08 UTC","Tags":"City","Date of the Event":"06/14/1993 12:00 UTC","Log Number":"US-07292010-0005","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/24823.html.txt","/var/www/straped/mufon/org/24823.html"],"Latitude":"47.76232","divs":["sighting detailshi there, glad that i can share my story with some researchers like you guys. so this takes place around 1993, i have had this incident tattooed on my brain ever since, it still amazes me. so i was about 13 when this happend, it was a dark clear night, coming back from the store with my mom in her mini van. we turned down a long road near the house on our way home, basically i instantlly noticed these 2 what appeared to be \"stars\" in the sky directly ahead in the distance, but they were way brighter than the other stars around them, and one was right above the other.(if you stick your arm out and hold a bic lighter in your hand thats about how far apart the objects appeared to be) they caught both of our attentions. it really stood out seeing these really bright stars and the other stars were not gleaming like these balls of light were. so we are driving and are about 30 seconds or so down this road, the lights still just look like unusually bright stars, right about then the light on top just shot away to the right and into infinity like it was shot out of a sling shot, just from sitting still to blinding speed and gone in less than a second. then the bottom light shoots off just as fast in the same direction as the other one. it was crazy! my mom said \"did you see that\"?? she was shocked and puzzeled. we got home about 5 minutes later and i was out on the deck right away looking for more lights,excited from what we just witnessed but saw nothing else that evening. havent had a sighting since then but hope i am lucky enough to have another. please contact me with any questions. - *(wit's first initial deleted--cms\\sg)."],"Object Shape":"Star-like","Weather Factors":"Unknown","Longitude":"-122.205404","Disposition":"Insufficient Data","trends":["There have been 2 other sightings in Bothell","There were no other sightings in Bothell on or around June 14th 1993"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.76232,+-122.205404(24823)&iwloc=A&hl=en\"> mufon case (24823) map </A>","Source":"MUFON","Region":"Washington","Country":"United States"}