{"Country":"United States","Case Number":"24826","files":["/var/www/straped/mufon/html2text/24826.html.txt","/var/www/straped/mufon/org/24826.html"],"City":"Fort Worth","Summary":"Huge Bright Orange Moving Sphere","divs":["Sighting DetailsI had just arrived home from the store and was outside in my apartments parking lot putting together something in my work van. I was looking in the sky because I always do in hoping I'll see a UFO, and I seen the big orange bright star-like object in the sky. I just assumed it was probably Venus or something like that, and let me mention this is not the first time I've seen this, but the first time it actually made me have goosebumps as I'll explain. Anyways, my girlfriend came outside on my apartment balcony (on 2nd floor) to see what I was doing and I said \"Look at that, its a UFO!\" joking, because she makes fun of my new profound interest in UFOs and the possibility of Alien Life and thinks I'm just crazy. Anyways, I go back to work in my van, it's probably 10:00-10:30pm now and I look back up at the orange sphere star in the sky and notice that it's not really sphere shaped. My eyes were a little off and hard to adjust from the light I was working with in my van to the night sky but I'm positive if looked at through a telescope, this thing was not just sphere shaped, nor a star. I think I'm just trying to make myself see something else than what it really is and go back to working, but constantly looking up in the sky everywhere because I keep catching glimpses of lights in the sky, only to find out its just airplanes coming from DFW airport. Then I turn my attention back to this orange star thing and notice that this thing has moved from where I originally seen it. It's only been 15 minutes since I told my girlfriend to check it out, its 10:45pm now, and I had noticed some actual stars in the sky near this object before and they hadn't moved so I knew something was up then. I called my girlfriend on my cell and said \"hey that thing is moving! Come out here and see\" She then came out and seen it and wasn't all that excited about it and just said \"it's just a airplane, it's not a UFO! People are going to think your crazy out here just staring up in the sky\" I then knew she wasn't going to be my witness and I have no idea how she thought this thing was a plane. It had no sound, no blinking lights, and if it was a plane, it would have been long gone by then, not just hovering. She goes back inside and I'm fixed on watching this thing. Then out of no where, something flies by at high speed passing the Orange Sphere, also no sound and had red blinking lights all over it. I then started seeing the Orange Sphere slowly move right and down. I was thinking maybe the night sky was just moving like normal but the same stars I was looking at was in the same spot. Another 10 minutes pass and the Orange Sphere is now ducking below the tree line, almost completely out of sight, just peeking at me through two telephone poles, and then, gone. I was now convinced I had just saw something strange and hoped it was a UFO. I come back inside my apartment and get on the internet to google about the Orange Sphere on tonights date and WHADDYA KNOW....OTHER PEOPLE SEEN IT AS WELL! I then proceeded to see how I could report it, and here I am! Sorry no pictures or video, will have camera on me next time! Also during this whole sighting, about the time this Sphere started to move, it seemed like a storm was coming in from the East. It got real windy and clouds were coming in but then all the sudden stopped?!? Airplane my left foot!"],"Viewing Distance":"Over One Mile","Weather Factors":"Windy","Disposition":"IFO","trends":["There have been 128 other sightings in Fort Worth","There was one other sighting in Fort Worth on or around July 28th 2010"],"Longitude":"-97.31422","map":"<A HREF = \"http://maps.google.com/maps?q=32.731079,+-97.31422(24826)&iwloc=A&hl=en\"> mufon case (24826) map </A>","Object Features":"Unknown","Latitude":"32.731079","Date of the Event":"07/28/2010 10:00 UTC","Object Shape":"Circle, Fireball, Sphere, Star-like","Tags":"City","Log Number":"US-07292010-0008","Source":"MUFON","Sighting Duration":"01:00:00","Region":"Texas","Date Submitted":"07/29/2010 04:32 UTC","Object Flight Path":"Hovering then path"}