{"Disposition":"Unknown","Weather Factors":"Windy","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.693863,+-111.99905(24830)&iwloc=A&hl=en\"> mufon case (24830) map </A>","divs":["Sighting DetailsMy wife \"T\" and I were sitting on our deck facing west around 8:40 pm. There is always a lot of air traffic in this west view so we are used to jets coming and going from Salt Lake International airport, which is to the north. Something a little odd caught my attention just after the sun went down but before it got all the way dark. I spotted a very black sphere in the west, and it wasn't moving. It just hung in the sky in that exact spot for about 3 minutes. My wife said,\"It's just a plane.\" I said,\"If it's a plane then why is it not moving and where are it's lights?\" She noticed then that it wasn't moving and we started to get excited. I ran inside the house to get my binoculars and when I returned my wife, who had kept the object in view said, \"It's gone now.\" I looked with my binoculars where I had seen it before and it seemed to be gone but after a cloud moved past I could see it again. It was very black, reflecting no light whatsoever. I've never seen anything like it. There was a lot of wind and clouds. I could see it again when the clouds thinned out but within a minute or so after that it was gone. The oddest thing about it was that it stayed in the same spot in the sky this whole time. If it had been a balloon of some sort it would have had to move in the wind. This black sphere never moved but stayed fixed in this position the whole time it was in our field of view. So then since we could not see it anymore we sat back down on the deck and discussed what we had seen. After about 5 minutes my wife went inside for something and I was still on the deck sitting in my chair when something very big swooped silently over my head and I saw its dark shadow out of the corner of my eye. At first I thought it was a big bird because I could not see it clearly but something had definitely flown over my head so fast that I could only see the shadow of it as it passed. I ran to the other side of my deck but I couldn't see anything. It really seemed far too big to be a bird. We don't get eagles or any other kind of big birds in the city. It was completely silent. \"OK,\" I thought to myself,\"Now I finally have something to report to MUFON!\" Unfortunately this whole sighting was in the near dusk so pictures would have been impossible, but my wife and I definitely saw this very black sphere fixed in the sky. It kind of reminded me of a black hole, the way it just stayed there as clouds moved in front of it and in back of it with the wind and it didn't move at all. I could make a sketch but it would just be a black ball or sphere with no lights or markings."],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/24830.html.txt","/var/www/straped/mufon/org/24830.html"],"Log Number":"US-07292010-0012","Case Number":"24830","Longitude":"-111.99905","Object Features":"None","Object Flight Path":"Stationary","Region":"Utah","Date Submitted":"07/29/2010 10:32 UTC","Latitude":"40.693863","Date of the Event":"07/29/2010 08:40 UTC","Summary":"We saw a black sphere hanging in the western sky. It didn't move at all and was eventually obscured by clouds.","City":"West Valley City","trends":["There have been 12 other sightings in West Valley City","There was one other sighting in West Valley City on or around July 29th 2010"],"Object Shape":"Circle","Country":"United States"}