{"Disposition":"Insufficient Data","Sighting Duration":"00:00:10","Object Shape":"Oval","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/24839.html.txt","/var/www/straped/mufon/org/24839.html"],"Date Submitted":"07/29/2010 06:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.777726,+-86.152184(24839)&iwloc=A&hl=en\"> mufon case (24839) map </A>","Region":"Indiana","Weather Factors":"Unknown","Log Number":"US-07292010-0021","Longitude":"-86.152184","Source":"MUFON","Case Number":"24839","Country":"United States","Summary":"Strange, fast moving lights spotted just above tree level near Indianapolis.","Latitude":"39.777726","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around July 29th 2010"],"City":"Indianapolis","divs":["sighting detailslast night\\early this morning around 1:47 a.m., myself, my niece and my nephew spotted a strange object heading westward over the indianapolis skyline. we were heading northeast in my car on state road 67 north, and we were about 3 or 4 miles from i-465 (a loop that surrounds the city). the indianapolis international airport is only about 5\\6 miles from the location where we spotted the object, so it is not unusual to see aircraft flying around this area. the object we spotted, however, was flying in the direction of the airport and was dead ahead of us. at first, i thought it might be an airplane. but... i noticed very quickly that this did not seem like an airplane. i immediately pointed this out to my niece (age 12) and my nephew (age 17) -- \"look at that guys...\" and they looked up... what we saw were two white lights, spread apart quite aways, flying very quickly in a very straight line (if it was an airplane landing, it obviously would have been coming down at an angle). it most likely was over a mile away from my best guess... and from what we could tell, it seemed to be very close to \"tree top level.\" the sighting lasted less than 10 seconds. it was moving very fast. some more details: -- it was cloudy (it had just rained about an hour before) -- the white lights seemed to be rectangular to me, but i am not certain -- my best guess is the two white lights were on one craft, and the lights were not 2 separate craft. -- my nephew said he saw it flash 5 times and disappear. this i did not notice -- i think the \"flashing\" can be attributed to it disappearing behind trees (?) -- my niece said she notice an oval shape around the lights (my nephew and i did not notice this). she mentioned it was similar to seeing the \"moon's shadow\" during a crescent moon. i've checked online to see if anyone else has reported seeing this, but i've not found anything."],"Object Flight Path":"Undisclosed","Date of the Event":"07/29/2010 01:47 UTC","Object Features":"Undisclosed"}