{"Weather Factors":"None","Source":"MUFON","Date of the Event":"07/15/1998 12:00 UTC","Object Shape":"Star-like, Other","trends":["There have been 32 other sightings in London","There were no other sightings in London on or around July 15th 1998"],"divs":["Sighting DetailsIt was a summer night when I lived in London, Ontario on the 5th floor of an apartment building with a balcony facing west. My roommate and his cousin stepped out onto the balcony for a cigarette and saw something in the sky. They called my friend and I out to see what they were seeing. The 4 of us witnessed 6 bright white lights arranged in a hexagon formation. I didn't know what the lights were, but they seemed to bright to be aircraft approach lights. The formation appeared to be far from us and at least 10 times the size of a full moon. We turned on the radio and the local station was reporting getting calls from all up and down Highway 401 from London to Windsor. At this time, I was sent to the 11th floor to get our friend's roommate so he could see it, too. When I returned to my apartment, the lights appeared to have sunk beyond the horizon like the setting sun, leaving only the top 4 lights visible. We watched until all 6 were gone below our line of sight. The radio announced the next day that the lights witnessed over Southern Ontario were American Fighter jets doing practice manuevers. I have witnessed landing lights on aircraft approaching London International Airport from that balcony. I've seen spotlights from military and police helicopters from that balcony. Now, if the radio report is to believed, I've seen lights brighter than landing lights on aircraft moving very slowly away from me."],"Viewing Distance":"Unknown","Object Flight Path":"Stationary","Country":"Canada","Region":"Ontario","Sighting Duration":"Undisclosed","City":"London","map":"<A HREF = \"http://maps.google.com/maps?q=42.987308,+-81.240478(24847)&iwloc=A&hl=en\"> mufon case (24847) map </A>","Latitude":"42.987308","Log Number":"CA-07302010-0006","Longitude":"-81.240478","Date Submitted":"07/30/2010 02:25 UTC","Tags":"City","Disposition":"Unresolved","Case Number":"24847","Summary":"6 bright lights in a hexagon formation sinking beyond the horizon.","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/24847.html.txt","/var/www/straped/mufon/org/24847.html"]}