{"Date Submitted":"07/30/2010 08:46 UTC","Latitude":"40.65129","Tags":"City","Object Flight Path":"Straight-line path","Region":"New York","Object Features":"Undisclosed","Disposition":"IFO","Country":"United States","City":"New York","divs":["Sighting DetailsI and my boyfriend were on a seventh story roof in Bensonhurst, Brooklyn, NY watching fireworks on july 4th night. It was between 10:30 and 11pm and the fireworks were dying down. My boyfriend asked me if the pieces of fireworks could reach us and I told him the were too far away (at least 10 city blocks away was the closest any firweorks were being set off). Then a little later he pointed at something that appeared to be on fire moving toward us and asked me if that might reach us. We first began to back across the roof thinking it was a piece of flaming debris, even though there were no fireworks going off anywhere near us. It took me a few seconds to realize it wasn't falling and wasn't fireworks. We stood still and waited for it to pass over head. It looked just like a perfect orb of fire. It had no tail and was not obstructed by any clouds or fireworks. It was silent and glowing orange, did not flash. It moved at a constant speed directly overhead. It was closer than stars, seemed much closer than a plane. It was silent and moved in a straight line. It did not get bigger or smaller and did not appear to be falling. We followed it until it disappeared far into the sky in the distance. I have seen MANY fireworks of all types throughout my life including flares, parachute fireworks and duds and partially-exploded mortars, this WAS NOT fireworks. I have lived under the JFK flight paths my entire life. This WAS NOT a plane of any kind. No running lights and no sound. It took almost a minute to pass over us, so we got a good look at it. It seemed perfectly round and like it was on fire but much closer than a star. It was not something that you sometimes see come through and burn up in the atmosphere like meteorites or meteor showers (I have seen many). It was constant in its speed and altitude and was not something falling to earth. As close as it was within the atmosphere, if it was just a piece of something in the atmosphere I would have expected it to fall towards Earth. Some force kept it eleveated and travelling horizontally. I have never seen anything unexplainable in the sky before this. Neither in the city or Catskill mountains where I frequently visit my family. Seeing a UFO was the furthest thing from our mind on that 4th of July. I felt absolutely crazy trying to explain this to my family until I went online and saw that I was not alone."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.65129,+-73.9452(24844)&iwloc=A&hl=en\"> mufon case (24844) map </A>","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Case Number":"24844","Date of the Event":"07/04/2010 10:30 UTC","Longitude":"-73.9452","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around July 4th 2010"],"files":["/var/www/straped/mufon/html2text/24844.html.txt","/var/www/straped/mufon/org/24844.html"],"Object Shape":"Circle, Fireball, Sphere","Log Number":"US-07302010-0003","Source":"MUFON","Summary":"Orange sphere, perfect orb of fire, no tail, slow moving, steady light (no flashing).","Sighting Duration":"Undisclosed"}