{"Source":"MUFON","Object Features":"Unknown","Case Number":"24849","Region":"Washington","Date of the Event":"07/11/2009 11:10 UTC","Latitude":"47.717598","files":["/var/www/straped/mufon/html2text/24849.html.txt","/var/www/straped/mufon/org/24849.html"],"divs":["Sighting DetailsMy wife and I work at home on computers in Lake City, a suburb in north Seattle. As we make our own hours, it is not uncommon for us to work late. We decided to take a break and a walk at 11PM. We walked out of our apartment and decided to walk East toward Cedar Park, a neighborhood of nice middle class homes. We arrived at Lake City Way, which is usually very busy with traffic as it is the main roadway leading to northern communities. It was a clear, still night and the stars were were visible. No cloud in the night sky. As we crossed the 4 lane roadway, I glanced up at the sky above and saw what, at first, I thought was a satellite. It was a white glowing light in the sky moving northward. Almost immediately I realized that there were three lights arranged in a triangle, with one being at the point of the northward direction that the lights were moving. In the next moment I realized that the sky was being blacked out between the triangles. This realization was accompanied by the realization that this was an object and that it was not high in the sky, but right over our heads. My background in architectural study, perspective drawing, and mechanical drawing among other skills at perspective, allowed me to take site off the trees and the buildings next to us to estimate the height of its flight, which was about fifty feet. I instantly alerted my wife and she looked up, but, at first focused on the stars. I grabbed her arm and quickly said, \"It's lower. The moving lights, Look!\" When she saw what I was pointing to, she gasped. We were stunned and discussed the object as it glided absolutely silently over us as about three to four times the speed of cars that pass down Lake City Way. The speed limit being 40 MPH. As we watched and discussed the object, we realized it had a glowing morphing red light centered between the triangle of lights. By morphing, I mean it shifted its shape continuously, but remained contained in what seemed to be a defined space in the center of the object. An odd point that we later discussed at length was that the light source, that is the points of light, were like like none either of us had ever seen. That is, the light seemed to emanate from the points but had no source. More like a glow of light without the center being bright. Like, but not the same as fluorescent light. Backing up in my narrative of events a bit, as the object flew north, it came to a main intersection at 145th St, we were on 140th st, the object turned left, or west, at the intersection, with such a sharp turn as to seem to defy the physics of inertia. There was zero banking or slippage through the air. It turned as if it were on the ground, with none of the normal compensations necessary to overcome velocity in flight. I don't say that it defied physics, only that it turned in a way that did not make sense to our minds, so quick and shape and sudden, with no air drag or resistance of any kind. Once the object made the turn, it accelerated at what I can only describe as rocket speed. Completely silent, it made the sudden burst of energy and velocity increase toward the direction of Lynnwood, a city northwest of Seattle. We discussed the object at length that night, but were cautious about sharing our experience at first. A month later, we ran into our upstairs neighbor and her husband. She is a mother with five children, a nurse and a very responsible and grounded person. In our hallway chat, she mentioned that she saw the current UFO movie playing at the theater that night. I asked her about the movie, making small talk, and she informed me that she had a new interest in UFOs because in June, her and a friend, another mother, were crossing Lake City Way one night and saw a black triangle fly down Lake City Way, heading northward. When she described the object her and her friend saw, it matched the description of what we had seen. A final point needs to be addressed. That is that as hard as this is to explain, we all felt as if the object was oddly like a projected image, but solid at the same time. This object, in no way, could have been projected, yet it had qualities reminiscent of a projection. Very odd. We would like our name withheld from the public in general, as we have seen how people are viewed and treated when they have revealed similar experiences. The members of MUFON, may, however contact us if they desire. We make no claim as to the origins of the object. We are just reporting what we saw. Now it's over a year later and we have not been able to shake the experience. Thank you for providing this forum."],"Longitude":"-122.283737","Log Number":"US-07302010-0008","map":"<A HREF = \"http://maps.google.com/maps?q=47.717598,+-122.283737(24849)&iwloc=A&hl=en\"> mufon case (24849) map </A>","Disposition":"Unknown","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Date Submitted":"07/30/2010 02:44 UTC","City":"Seattle","Object Flight Path":"Path with directional change","Tags":"City","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around July 11th 2009"],"Country":"United States","Summary":"A silent black triangle with lights flew fifty feet over my and my wife's head.","Weather Factors":"Unknown"}