{"Log Number":"US-07302010-0007","Tags":"City","divs":["Sighting Detailsmany years have passed since my \"sighting\", but I'm curios to see if other have had a like experience. I was on a summer camping trip with a group of boys. The camp director had a cabin on Lake Chesuncook in the wilderness around Baxter State Park in Maine. There was a small village nearby, mostly summer cabins, but also one home that served as a bed-and-breakfast and was also the residence of the village's only year-round residents. Anyway, one night some of us decided to canoe across the lake and spend a night on one of its small islands. The island was roughly 50 by 30 feet, with a few pine trees. While settling in for the night, looking at the night sky, suddenly appeared a glowing, bright, light blue fireball. I saw it move from the top of the trees (or so it seemed)a few yards or so laterally, and then it was gone. It scared me (I was 12 years old). I asked aloud, \"Did anyone else see something?\" \"I did,\" another kid said, nervously. I saw him some years later and asked him if he remembered the fireball. He never forgot it. It was rather large. It looked to be a yard or two wide, about 20 or so feet in the air. Of course, it might have been much higher and therefore been much larger. At any rate, if it had been a meteorite and blazing hot (it looked like blue fire), we should have heard it hit the water. It just appeared and disappear just as fast. This was only about one or two seconds. I've never forgotten it either. Years later, when I was a counselor on the same Maine trip, I told my story to another counselor. He then told me that the owners of the bed-and-breakfast told him a story that one evening, while getting into bed, a bright blue light lit up their room, apparently coming from a source outside. That's all I remember of the story. Has anyone had a similar experience, have a theory about what I might have seen?"],"Weather Factors":"Unknown","Country":"United States","Date Submitted":"07/30/2010 02:31 UTC","City":"Chesuncook","Disposition":"IFO","Object Flight Path":"Straight-line path","Region":"Maine","Date of the Event":"07/29/1977 12:00 UTC","files":["/var/www/straped/mufon/html2text/24848.html.txt","/var/www/straped/mufon/org/24848.html"],"Object Shape":"Fireball","Sighting Duration":"00:00:10","Longitude":"-69.4095","Object Features":"None","trends":["There have been no other sightings in Chesuncook","This sighting has never been favorited."],"Case Number":"24848","map":"<A HREF = \"http://maps.google.com/maps?q=46.060318,+-69.4095(24848)&iwloc=A&hl=en\"> mufon case (24848) map </A>","Viewing Distance":"20 Feet or Less","Latitude":"46.060318","Summary":"Dayglo light blue fireball passed over.","Source":"MUFON"}