{"Weather Factors":"None","Source":"MUFON","Case Number":"24846","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Oklahoma","divs":["Sighting DetailsThis incident happened at our home. My husband and children were sitting at the back porch table enjoying the evening. A stormfront had brought in cooler evening air. Directly east of where I was sitting on my back porch was my neighbor's house behind our home. I was starring off really at nothing, directly above their roofline. Into my line of vision came a light. An orange light. It looked like fire, however it is rising. Momments later I realize its suspended in air and it is continuing to rise. Now I can't be sure on its size or how far off it was. But I'll make the guess that it is less than a mile away and at its altitude, the size of a vehicle. Now when I say it looked like fire, I'm saying it was fire. I actually saw orange and yellow flames licking at each other. Like if you were to suspend a bonfire in the air. The flames were contained to a rounded shape and didn't 'streak' as it moved upward. It rapidly gained altitude, straight up from its location. At this point I know that I have to get my husband to see this. Luckily he was walking back outside and I point to it and say, \"Look! it looks like fire\" By this time it was high up there. Higher than a helicopter flies but lower than the commercial airline planes that fly over our house on their descent into the airport. He agrees that it looks like fire, but by this point the distinct look of flames has become more of a shimmer. As we are watching, it makes an obvious acceleration to the east towards Claremore. We watched it until it was completely out of our vision. This entire incident happened in less than 2 minutes."],"Summary":"Orb shaped fireball ascended from field area. Rose to a considerable altitude then headed east until no longer visible.","Object Features":"None","Latitude":"36.40022","Country":"United States","Date Submitted":"07/30/2010 11:39 UTC","trends":["there have been no other sightings in owasso\\collinsville","This sighting has never been favorited."],"Disposition":"IFO","City":"Owasso/Collinsville","Date of the Event":"07/25/2010 09:10 UTC","Object Flight Path":"Path with directional change","Log Number":"US-07302010-0005","Longitude":"-95.877596","files":["/var/www/straped/mufon/html2text/24846.html.txt","/var/www/straped/mufon/org/24846.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.40022,+-95.877596(24846)&iwloc=A&hl=en\"> mufon case (24846) map </A>","Object Shape":"Fireball"}