{"Source":"MUFON","Viewing Distance":"Unknown","City":"Belleville","Summary":"White (silent?) cigar shaped object at average travel speeds.","Country":"Canada","divs":["Sighting DetailsI was BBQing behind my house in a hay field yesterday around 5:00 pm. The hay field is developed for camping grounds and about half the field has been cut with a lawnmower. Me and another camper were sitting in lawn chairs near the BBQ, unfortunately drinking some beers. I suddenly heard a private airplane (a small one) flying from east to west, fairly low and relatively loud. When I looked up at the private plane, I noticed a white object flying several feet above the private plane, and the white object was going from west to east. They did not appear to be parallel with each other though. If the white object was making a noise, it was over powered by the lower flying private plane. The white object (may have been a light grey color or something) did not appear to have wings. It litterally appeared to just be a cylinder or cigar although the object was at a significant height and the wings may have been difficult, if not impossible to view from my point. When i seen this object, I stared for about 30 seconds before pointing it out to my drunken camping buddy. He was able to hear and see the private plane, but I just couldn't get him to focus enough to see what I was seeing. I pointed out a small cloud to him which he was able to find, and the object was slightly under the cloud (from our ground view) but I couldn't get him to see it. Eventually, as I continued to point out the object, it continued flying east at a uniform speed until it was too small and far away to see myself. It is in my opinion, this object was simply a commercial airliner which was flying too high to be heard, or to distinguish any descriptive features on it. Regardless, I am not 100 percent, or even 99.99 percent sure that this was an airplane. ...Previous Encounters: Me, my mom (RIP), and my neighbor seen a strange hovering light moving to slow to be conventional aircraft, and was to quiet (cant remember, but I think it was silent) to be a helicopter, and this was at night; around 10-11ish pm. The object hovered in the camping field I mentioned earlier and hovered over and past my house in a southern direction. I called my neighbor as soon as I seen it and he was over in about 2 mins (lives 400 meters away). I met him outside where we watched this thing up close. It had bright white lights (i think) but the one thing I remember for sure is the earthly structure of this craft. It appeared to have a crane like structure to it (only an iron (looked like iron) frame with no exterior). The object may have been approx 20 meters by 20 meters (irregular shape). Hovered 100 feet off ground approx in the camping field then moved over my house southerly and hovered in a field across the road where we got a good look at it. Then it continued moving south but started to curve south west and UP! Wish I had more details."],"Log Number":"CA-07302010-0004","trends":["There have been 5 other sightings in Belleville","There were no other sightings in Belleville on or around July 29th 2010"],"Latitude":"44.210109","Region":"Ontario","Tags":"City","Date Submitted":"07/30/2010 08:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.210109,+-77.369562(24845)&iwloc=A&hl=en\"> mufon case (24845) map </A>","Disposition":"Unresolved","Longitude":"-77.369562","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24845.html.txt","/var/www/straped/mufon/org/24845.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Cigar","Date of the Event":"07/29/2010 12:00 UTC","Case Number":"24845"}