{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.974878,+-116.862936(2484)&iwloc=A&hl=en\"> mufon case (2484) map </A>","Log Number":"","Region":"Idaho","Tags":"City","Date Submitted":"08/01/2003 11:30 UTC","files":["/var/www/straped/mufon/html2text/2484.html.txt","/var/www/straped/mufon/org/2484.html"],"Sighting Duration":"00:30:00","Case Number":"2484","Disposition":"Unknown","Summary":"We Are Not Alone 4 Triangular Craft Seen 8-1-03","Object Shape":"Triangle","Viewing Distance":"Over One Mile","Source":"MUFON","Latitude":"44.974878","Weather Factors":"Unknown","Date of the Event":"08/01/2003 11:30 UTC","divs":["Sighting DetailsHello to all and this thread is about an observation that is REAL and happenedto me this weekend in hells canyon idaho on friday night just before 1200midnight just after setting up camp at Oxbow reservoir on the snake river innorthwestern idaho.IB4ve always watched the night sky just like others on this forum looking forcomets and craft and have seen many single bright objects that have performedodd things such as move across the sky and then stop and sit there and twinklelike a star as if to fool anyone or anything looking up.This time is different and has profoundly changed me forever.On friday night on august 1st, 2003 at just before midnight, my girlfriend, herdaughter and myself rolled in to Oxbow Idaho and set up camp at the copperfieldRV park which is donated and cared for by Idaho Power for touristB4s and local folk to enjoy and use for fishing and various other summer timeactivities for a small over-night fee. I know this area extremely well. It hassuperb viewing for astronomers as well as itB4s elevation is at 3500 feet and there are no city lights near this remotelocation.I specifically went there to relax, fish and enjoy the stars as It is a favoriteplace of mine to go and do just that.On this night, the skies were clear and dark and perfect for looking up as themilky way was highly visible and the stars numbered into the trillions itseemed.We had just sat down and were facing east from this location which is located atprecisely the 45th parallel and were looking up and saying wow, look at all thestars.There was a small amount of icewater left in my water bottle as I fixed my eyeson a point of light at about 65-70 degrees up and to the east that caught myeyes immedeately.My full attention was on it as it grew brighter from its first pin-prick ofbrighter and whiter than normal appearance. I watched in shock as it grew andfell out of the sky at us and then exploded into a flower of 3 triangles and 1diamond on its side, all the while, I was now screaming do you see that Oh myGodAt This point, I had stood up and walked around the picnic table andapprehensively walked towards it as if to try to change my view while in shockto make sure it was really what we were seeing.It was real.Now, as these things reached an altitude of what IB"],"Object Flight Path":"Unknown","Object Features":"Undisclosed","City":"oxbow oregon","Longitude":"-116.862936","trends":["There have been no other sightings in oxbow oregon","This sighting has never been favorited."]}