{"Object Features":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Latitude":"64.318056","Country":"Canada","Weather Factors":"Unknown","Date Submitted":"07/30/2010 11:43 UTC","Date of the Event":"12/27/2009 12:00 UTC","divs":["Sighting DetailsHi, While unleashing my dog in my front porch area, I noticed a bright light shining in the window. I immediately went outside where I saw a large, very, very, very bright sphere lighting up everything. It even outshone the nearly full moon. It at first looked like it was larger than the moon; it was hanging a little down and to the right of the moon when it was in the southern night sky. It looked like a huge, super bright, turquoise coloured light shining ball. It was so bright that it appeared larger than the moon, then I realized its intense luminosity made its diameter appear larger. The actual object was about the same size as a quarter or dollar piece held at arms length. It did not seem to be any farther up than 10,000 ft. Its brightness lit up areas that would otherwise be cloaked in shadow, but while this object hung in the sky above, there was light enough to read a newspaper article. IT was a very surreal experience. Then, after all of 2-3 seconds, it headed south moving at astonishing velocity. After remaining outside for a while to watch for more activity which did not occur, I went in to tell my wife. I'm sharing this now because of all the other similar sightings recently reported."],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"CA-07302010-0011","Source":"MUFON","Case Number":"24852","trends":["There have been no other sightings in Baker Lake","This sighting has never been favorited."],"Object Shape":"Sphere","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/24852.html.txt","/var/www/straped/mufon/org/24852.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=64.318056,+-96.0175(24852)&iwloc=A&hl=en\"> mufon case (24852) map </A>","Summary":"Large, very bright, super fast, turquoise sphere.","Sighting Duration":"Undisclosed","Longitude":"-96.0175","City":"Baker Lake","Region":"Nunavut","Tags":"City"}