{"Disposition":"Insufficient Data","Source":"MUFON","Latitude":"40.377206","trends":["There have been 3 other sightings in Estes Park","There were no other sightings in Estes Park on or around May 31st 1988"],"Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Flight Path":"Straight-line path","Object Shape":"Undisclosed","divs":["Sighting DetailsI was standing outside talking with a friend around 1230 at night and I wasfacing the south-west skies looking over Sprague Lake at the Glacier CreekStables in Estes Park Colorado. I always looked at the night sky because it isso clear in the mountains you can see everything but, that night I noticed alarger, brighter star right above the treeline that kinda glowed in a white-ish,yellow light. Because of the unusual coloring I kept checking the skyline inbetween conversations when I noticed another identical light right next to thefirst and they both continued hovering over the treeline. When I saw the secondlight, I did not take my eyes off them at that point. It was almost as if theycould tell I was watching them because after watching them both for only a fewseconds more that at the same time they flew straight up into the night sky likeshooting stars only they went straight up instead of accross or down like ashooting star and then they disappeared into the atmosphere. I was filled witha feeling of nervousness and excitement because I live for experiences like thatand feel that I was very lucky to have witnessed a rare sight like that and nomatter if people belive me or not, I love to tell that story. Oh, by the way, Ialso have a picture taken through my telescope of a sonic boom in front of afull moon. You can actually see the vapor trail in the space sky as the craftmade a u-turn to go in the other direction. If you are interested in seeing it,please e-mail me back at quadhoppers@toast.net and I will scan it and send ityour way. That picture has caused a lot of controversy with military personnelso I do not freely share it."],"Summary":"Sigting in Estes Park","Case Number":"2485","files":["/var/www/straped/mufon/html2text/2485.html.txt","/var/www/straped/mufon/org/2485.html"],"Sighting Duration":"00:05:00","Weather Factors":"Unknown","Date Submitted":"05/31/1988 12:00 UTC","Longitude":"-105.521665","map":"<A HREF = \"http://maps.google.com/maps?q=40.377206,+-105.521665(2485)&iwloc=A&hl=en\"> mufon case (2485) map </A>","Date of the Event":"05/31/1988 12:00 UTC","Object Features":"Undisclosed","Country":"United States","City":"Estes Park","Log Number":""}