{"Log Number":"US-07302010-0010","Source":"MUFON","Longitude":"-71.050473","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/24851.html.txt","/var/www/straped/mufon/org/24851.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.360381,+-71.050473(24851)&iwloc=A&hl=en\"> mufon case (24851) map </A>","Region":"Massachusetts","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around April 17th 2007"],"Date Submitted":"07/30/2010 08:14 UTC","City":"Boston","Case Number":"24851","Object Shape":"Oval","Object Features":"Patterned Surface","Date of the Event":"04/17/2007 02:30 UTC","Summary":"Saw half of what seemed like an oval with indentations under it and many circles in different shapes under it.","Weather Factors":"Unknown","Tags":"City","Latitude":"42.360381","Disposition":"Unknown","divs":["Sighting DetailsIt was the middle of April. It had been a very rainy month. I was sleeping when I hear a loud noise which I thought was thunder and I saw a flash of light as I woke up from the loud noise, I was happy and got up to open the window to hear the rain. I looked from the blinds ad to my surprise nothing, all was calm. my neighbors lights were out but I made the big mistake of looking up at the sky. I live on the third floor of an apartment complex and the roof is right above me. On the roof I saw this hugh craft some of it was just out that I cuold see right under it from my window. It did not seem to have its lights on and very quiet. I saw its oval shape with indentations or something like rims under and many circls and different shapes like balls under it. I moved away from the window in a way that I just wanted to hide under the covers. As I am going around my bed the strange being walks right in to my bedroom and stands at the door blocking my path and I almost bump into it. I face it with my back towards the bed and move backwards slowly as high as I can get to the top of my bed. It is looking at me and I at it. Around maybe 3 and half feet, strange metalic suit the coverd its whole body, 2 arms and two legs and some kind of mesh covering its face. I did see whar seemed to be large eyes but no mouth or nose and I could not tell if it was male or female. In its right hand it has an instrument with a long needle. It mde me feel like I was powerless to do anything. When it did not communicate with me I decided to talk to it. these were my exact words ,please dont hurt me. As I said those word it came right at me, I felt a grab and I blacked our when I woke up It was morning and I was on the left side of the bed, I sleep one the right side. Ever since this happpened I keep my bedroom door closed, I always kept it open. It is something that I have always believed in but never thought it would happen to me. What it did to me, if I was taken or what ever it wanted it got it in my bedroom I can not for the life of me remember. I only remember from the moment I heard the noise it matbe was the landing on the roof to the moment it came towards me and grabed me"],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Country":"United States"}