{"Latitude":"34.278657","Source":"MUFON","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around July 30th 2010"],"City":"Simi Valley","Log Number":"US-07312010-0001","Country":"United States","Case Number":"24853","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.278657,+-118.773382(24853)&iwloc=A&hl=en\"> mufon case (24853) map </A>","Region":"California","Disposition":"IFO","Object Flight Path":"Path with directional change","Date of the Event":"07/30/2010 10:15 UTC","Longitude":"-118.773382","Date Submitted":"07/31/2010 02:54 UTC","Object Features":"None","Summary":"Fireball travelling across the sky at high speed, changing direction then moving up and out.","Object Shape":"Fireball, Flash, Sphere, Star-like","divs":["Sighting DetailsMy girlfriend and I were at a friends house sitting in the front yard when we saw a what appeared to be a bright orange ball of fire, moving across the sky from west to east. My instant reaction was shock because it was moving fast, like a meteor, but it was staying parallel to the horizon. We all stood up to watch it as it traveled for about 30 seconds then it slowed and sharply changed direction, moving up and away from us, southerly out over the Pacific ocean. We continued watching it for another minute or so until it shrank and just went dark. I assume it moved to far away for us to see it anymore. I have NEVER seen anything like this. It was not a plane, satellite, weather balloon or bottle rocket. It spooked me to the point that I felt driven to search online for an answer, which is how I came to find this site. Though it looked like fire in color, there was no flickering or embers to be seen, but more of a quick pulse. This was without question, some kind of controlled object because its course was deliberate in change of direction and movement. I am torn emotionally between fear and excitement. Do you have any reasonable explanation for what we saw?"],"files":["/var/www/straped/mufon/html2text/24853.html.txt","/var/www/straped/mufon/org/24853.html"],"Weather Factors":"None","Viewing Distance":"Over One Mile"}