{"City":"Denham Springs","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-90.956212","Disposition":"Insufficient Data","Object Shape":"Teardrop","Date Submitted":"07/31/2010 07:17 UTC","files":["/var/www/straped/mufon/html2text/24866.html.txt","/var/www/straped/mufon/org/24866.html"],"Date of the Event":"07/28/2010 11:15 UTC","Log Number":"US-07312010-0014","Region":"Louisiana","Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","Case Number":"24866","Summary":"Loud humming sound then low flying lighted object moving over house. 30 - 40 ft above tree line.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.486856,+-90.956212(24866)&iwloc=A&hl=en\"> mufon case (24866) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Denham Springs","There were no other sightings in Denham Springs on or around July 28th 2010"],"divs":["sighting detailsmy husband and i were sitting on the patio at 11:15pm and heard the sound approaching. we both asked, \"what the heck it that?\" at the same time. a loud humming, similar to but not exactly like the sound made my an electric car or hover craft sounds you hear in the movies. neither of us have ever heard anything like it before. it became louder as the object drew near, then we saw the following rush over our house at about 30-40 feet above the tree line. it was about 3 times the size of a news\\traffic helicopter. rounded in the back with 3 bands of yellow\\golden light running horizontally. the light was more of a glow. it appeared to elongate towards the front of the object, with white lights at the front end. again, a glow rather than a light bulb look. all we could see was the area illuminated by the glow, so the object could have been perfectly round or oval, with only the lighted parts visible. not really sure, as we only saw it for 4 to 5 seconds. the area around the glow seemed to be a dull, gray metalic substance. my son-in-law says the way i drew the object looks like one of those little fish crackers. i keep asking myself if we both saw an optical illusion of some sort, but the sound it made was \"out of this world\" and we were facing opposite directions and saw about the same thing. neither of us has ever seen anything like this before and it's been difficult to wrap my mind around it. hopefully, someone else has seen something similar."],"Latitude":"30.486856","Country":"United States"}