{"files":["/var/www/straped/mufon/html2text/24869.html.txt","/var/www/straped/mufon/org/24869.html"],"Case Number":"24869","Object Features":"Other","divs":["Sighting Detailsat approximately 7:15 i went to the local gas station on broadway in farmington new mexico, after getting gasoline and paying for it i went inside to get a snack and visit with the 2 gentleman i met at that gas station weeks prior. we stepped outside for a cigarette at 7:41 p.m. and i noticed an odd triangular shape coming across the sky about 200-500 ft off the ground. i was frozen in a trance on this and my friend said \"dude do you see that\". i answered \"thank god its not only me who sees this\". it seemed to have split into 2 objects or perhaps the second became visible as it was passing us.i grabbed my camera phone to take a picture but the object began a vertical assent to approx 10k ft. once it climbed to that hieght it hovered there for about 10 minutes we kept looking up at it until it disappeared into a dark gray storm cloud. i am still creeped out about this as i have never experienced anything like this and the picture i took with my mobile phone is just a gray screen with nothing in the picture.i came back to the hotel and imediately logged onto facebook and asked a friend about UFO's and was recommended to this website to report as the experience was still fresh in my mind. i was skeptical of the Aztec new mexico lore of UFO's until now....."],"Region":"New Mexico","Log Number":"US-07312010-0017","Longitude":"-108.209146","Country":"United States","Viewing Distance":"101-500 Feet","Object Shape":"Diamond, Triangle","trends":["There have been 4 other sightings in Farmington","There were no other sightings in Farmington on or around July 31st 2010"],"Tags":"City","Date of the Event":"07/31/2010 07:41 UTC","Latitude":"36.733158","Date Submitted":"07/31/2010 10:46 UTC","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Disposition":"Insufficient Data","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.733158,+-108.209146(24869)&iwloc=A&hl=en\"> mufon case (24869) map </A>","Summary":"Wierd unidentifiable object in Farmington, New Mexico.","Sighting Duration":"00:15:00","Weather Factors":"None","City":"Farmington"}