{"Sighting Duration":"00:02:00","City":"Prescott","map":"<A HREF = \"http://maps.google.com/maps?q=34.545304,+-112.462342(24861)&iwloc=A&hl=en\"> mufon case (24861) map </A>","Case Number":"24861","Tags":"City","Country":"United States","Object Shape":"Triangle","Source":"MUFON","Region":"Arizona","Date Submitted":"07/31/2010 02:27 UTC","Object Features":"Other","Date of the Event":"01/15/2005 07:10 UTC","files":["/var/www/straped/mufon/html2text/24861.html.txt","/var/www/straped/mufon/org/24861.html"],"Object Flight Path":"Straight-line path","Weather Factors":"None","Summary":"Sighted UFO west of house between 7 and 8 pm.","Longitude":"-112.462342","Latitude":"34.545304","Log Number":"US-07312010-0009","trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around January 15th 2005","This sighting has never been favorited.",""],"divs":["sighting detailsi was home alone looking out of my living room windows when i saw a movement out of the corner of my right eye. i looked to my right which would be west\\northwest, and saw a brilliant light behind thumb butte which is across the valley from me. as i watched, an object came out from behind thumb butte that was like nothing i have ever seen before. it was flying towards the south just above the prescott forest. from my viewpoint, it looked like it was approximately 15 to 20 feet above the tree line approximately 3 miles away as the crow flies. at first, i thought that it was a comet flying parallel to the ground. however, as the object continued flying south, i realized that a comet would not be flying as slowly as the object was. also, it didn't look like it was burning up as most asteroids and comets would do after entering out atmosphere. i would guess that the object was not going any faster than 100 miles\\hour; maybe not even that fast. the shape of the object was similar to a triangle, except it was on it's side. the lines of the object were clearly defined. the center of the object was pure white with blue color at the edges. the back of the object in the middle had flames coming out almost like those from a rocket engine. the object continued flying in the same direction until out of sight. only then, did i think about my binoculars which weren't readily available. as i stated above, i've never seen anything like this object, but i'm very sure it was not any kind of aircraft currently flying in the skies, now. i also realized that the object must've been flying over the forest further to the west than i at first thought because i did not see any commotion from the people that live near the edge of the forest in that area. the object must not have made much noise or the people near the forest would've heard it and called 911. one last comment, this object was not in a saucer shape and had no round edges. after it disappeared from sight, i got goosebumps all over. i'm attaching a rather crude drawing of what i saw. please forgive my lack of artistic ability."],"Viewing Distance":"Over One Mile","Disposition":"Unknown"}