{"Log Number":"US-07312010-0015","Tags":"City","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/24867.html.txt","/var/www/straped/mufon/org/24867.html"],"Object Features":"Patterned Surface, Other, Unknown","Viewing Distance":"Unknown","Summary":"Ten celestial sightings within one month in Shasta County.","Date of the Event":"07/30/2010 11:24 UTC","divs":["Sighting DetailsThis is not a report of one sighting but EIGHT (8), sightings since my first report of the June 27th sightings reported here. I'm not going to file 8 more reports and in fact I'm seeing them so many times that it is becoming redundant, and expected, for me to see them now. I KNOW FOR A FACT that something is happening, going on and it is constant now! I reported sightings on the 27th of June and on the 17th, both in plain sight, one in the dark of early morning and night, and the 17th sighting at 7pm with the sun up and the sky bright blue. Both SPECTACULAR! Most of these sightings are of the FLASH of LIGHT that INCREASES in BRIGHTNESS before cloaking or disappearing or camouflaging itself or just plain disappearing. These are the ones that start out as a moving star that looks like a star until it begins moving. Then the light becomes EXTREMELY BRIGHT with almost a blue center from the light which is bright white before dimming completely out. Several of these were witnessed by someone else. Here are the dates all in July: 5th-witnessed, 20th-witnessed, 27th, 29th and 30th-witnessed. The one last night (30th) had two separate events happen... three really and I'll explain later. All of these sightings are happening between 11:15pm to 11:45pm nightly. These next sightings are the craft, celestial form, rectangular, oval or diamond shaped ones. These are becoming frequent too. July 26, at 8:12pm I saw a rectangular shaped object way up in the sky. I perceived it to be very high up perhaps 20,000 ft or more. A person was with me but did not look fast enough to see it. This object flew steadily then a bit faster and went behind a cloud as if to hide from me. Once it went behind the cloud it never came out the other side and must have gone back out into space. This was daylight still and a muggy day with clouds forming or formed. July 28th, approximately 8:15 although I am not sure of the time, I was out on the lake with friends and I had the feeling I would see something out there. At that time, I thought I saw what was a jet plane \"going to the northwest\" as some of my friends later said. But as I looked closely to it I could see that the jet form was a facade or really some kind of shadowing so that if a casual, asleep individual looked at it it would just appear as a plane. This craft was huge and not so high up as before so I could see it clearly. It was white in color but in the shape of a large rectangle. As I was about to tell the others they wanted to know what I was looking at but then this large craft started to move OUTWARDS, turning itself into a small star because of the distance so that only one other of the people on board saw it as it was moving away and dimming out. Then of course I already reported the 17th sighting which occurred 7pm. That particular craft was either diamond shape or perhaps oval . . . I just cannot tell because of its luminosity and movement, and the SHOCK and AWE state that I was in. There is no doubt I will see the flashing lights at 11:30pm again tonight and if I were to stay out at night around 6 to 9:30 pm I would see the bright and different shaped celestial or UFO'S! Last night's vision was the flashing light then, almost immediately after seeing it I looked up because I heard a small plane engine but what I saw was a large craft that was very lit up, with swirls or shadows making it look strange. It sounded like a plane but it sure did not appear as one. After the \"plane\" disappeared from site we saw some kind of dark shimmer or movement where the two celestials, crafts or whatever, would have come together. I don't know what to make of this but truly there is something going on and I cannot believe that NO ONE KNOWS ABOUT THIS. Unless I see something even MORE SPECTACULAR than what I have already experienced I will not report anymore. I mean, what's the point? No one is going to do anything about it anyway. However I am taking this message out to all that will listen in the way I feel they want me to communicate it. I can draw detailed sketches if needed because even when I have camera in hand it happens so fast that I cannot capture an image or it doesn't let me at all. Alright... that's it folks,,, believe it or not! Peace and Love"],"Latitude":"40.58959","Object Shape":"Diamond, Square, Rectagular, Star-like, Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.58959,+-122.382855(24867)&iwloc=A&hl=en\"> mufon case (24867) map </A>","Date Submitted":"07/31/2010 07:17 UTC","Case Number":"24867","Weather Factors":"Unknown","Region":"California","City":"Redding","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-122.382855","trends":["There have been 39 other sightings in Redding","There were no other sightings in Redding on or around July 30th 2010"]}