{"Log Number":"","divs":["Sighting DetailsThe restaurant was a rectangular building sitting on a eastwest axis. The frontdoor of the restaurant, where we came out, faced south. A road ran east-west infront of the building.My friend and I had just closed up the restaurant and were walking to my car. It was about 1130 at night. The car was parked right next to the building onthe east side. A light in the sky, directly above and slightly north, caught myeye and I looked up, thought it was a street light, and continued walking. ThenI realized that it couldnt be a street light. The closest street lights were atleast 200 feet east and 75 feet west of us, both lights being on our right sideas we faced east. Everything behind the retaurant, going north should have beendark and unlit.When I looked up again, I could make out a big 100-125 feet triangular shapedobject, with three white lights, hoovering in the sky, slightly above treetoplevel, and I called to my friend to look up. I could see its silhouette againstthe clear sky, and could make out that it was a dark color. I dont remember ifit was dull or shiny.The object faced east, I guess. There was one light on this end, and one lightat each of the other two corners. All of the lights were white and bigger thana fifty-cent piece but not as big as a folded dollar bill. I remember thinkingthat I could see why I thought it was a street light. It was the same color andbrightness, and it took a few seconds for me to realize what I was looking at. I dont remember what kind of light they cast, but it was enough for me to seethe object pretty clearly.My friend and I watched it hoover for a couple or three minutes, then it startedmoving east, toward the Intercoastal Waterway, which was about 1 mile from us. We stopped at the railroad tracks 100 feet from the restaurant, watched itapproach, then began following it.We followed it all the way to the water, driving about 10-15 mph. We beat it tothe water by 4 or 5 minutes, then watched it approach. It kept a steady speedand height from the time it first started moving to when we lost sight of it. We watched it go out over the water on its way to Topsail Beach, directly east.There were no boats or barges on the water. There was a trailer park near wherewe parked, but we didnt see or hear anyone else. We didnt see any other trafficeither, but it was late at night, and it was a rural area.My friend and I went home afterwards, thinking it was a pretty cool thing wedseen, but, for some reason, not feeling like it was a big deal. Strange,because we w"],"Sighting Duration":"00:30:00","Case Number":"2487","Region":"North Carolina","Date Submitted":"11/30/1976 11:30 UTC","Disposition":"IFO","Weather Factors":"Unknown","trends":["There has been one other sighting in Hampstead","There were no other sightings in Hampstead on or around November 30th 1976"],"Summary":"Triangle with Three White Lights","Longitude":"-77.710548","City":"Hampstead","Object Flight Path":"Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.367594,+-77.710548(2487)&iwloc=A&hl=en\"> mufon case (2487) map </A>","Object Shape":"Triangle","Date of the Event":"11/30/1976 11:30 UTC","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","Latitude":"34.367594","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2487.html.txt","/var/www/straped/mufon/org/2487.html"]}