{"Latitude":"30.316577","City":"Conroe","trends":["There have been 10 other sightings in Conroe","There were no other sightings in Conroe on or around March 15th 1978"],"Source":"MUFON","Country":"United States","Disposition":"Unknown","Date Submitted":"08/01/2010 07:29 UTC","Viewing Distance":"101-500 Feet","Tags":"City","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.316577,+-95.448051(24888)&iwloc=A&hl=en\"> mufon case (24888) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24888.html.txt","/var/www/straped/mufon/org/24888.html"],"Longitude":"-95.448051","Object Shape":"Cigar, Disc","Weather Factors":"Unknown","Log Number":"US-08012010-0016","Summary":"My mother and I witnessed a disc shaped object float over our street and hover in a field behind our house.","divs":["Sighting DetailsAlthough I'm not certain of the precise date, the event definitely occurred on a Tuesday, as I recall watching a television program just before it happened that aired at 8 pm on Tuesdays back in 1978. It was in early March, on a cool, crisp, clear night, and despite our being in an area thick with trees, the sky was quite visable due to the time of year (before the trees had budded out.) My brother and I were watching TV in the den at one end of our house. Our parents were at the other end reading. For whatever reason, my brother was drawn to the window and opened the curtains to peer into the darkness. This is when he first saw the object that evening. He told me to come to the window to have a look, and he then went to get our parents. In the night sky, above the trees, I saw a circular formation of orange lights that slowly rotated, following our street as it drifted away from our house. It was difficult to estimate an approximate size, but I would guess the diameter of the circle formed by the lights to be about forty or fifty feet. I thought at first that it was perhaps the Goodyear blimp, a somewhat common sight in southeast Texas at the time, as Goodyear had a blimpbase only about twenty miles to our south. My mother came into the room and looked out anxiously to see what it was. My father, however, stayed at the other end of the house, not curious in the least bit. I was ten at the time, and my brother was six. My mother immediately wanted to investigate the lights, so she and I went out to the back yard to see if we could still see anything. My brother didn't come with us, as I think he was considered too young, and neither did my disinterested father. My mother and I went to the back fence to look into an open field that sat behind us. The treeline at the rear of that field was a good 500 feet away, so we had ample space to view it if it were to go that direction. It did, fortunately, and we both got a stellar view of the object. From our vantagepoint, we saw what appeared to be a disc-shaped craft, as indicated by a bank of orange lights at the base and an outline of lights of various colors on the top of it. The lights, as my mother recounts with unassailable detail, didn't radiate in typical incadescent \"Christmas tree\" colors. Rather, she remembers them to be very similar to the halogen or LED lights of the present day. I don't know if this technology was around in the late seventies, but if it was, we certainly hadn't seen any of them. The lights didn't blink, as they might if the object had been an earth-bound aircraft. They were solid and not really bright, which would account for my mother's non-technical description of them. Another strange characteristic of this object was its eerie silence. Neither of us heard any typical engine sounds emenating from it, like what would come from a plane, helicopter, or even the Goodyear blimp. The only sound it seemed to make was a soft swooshing, reminiscent of a dishwasher in its rinse cycle. (I don't remember this as well as my mother does, so I'm just relaying this bit from her.) When we first saw it in the field, the object was still slowly floating just above the treeline from left to right, but it soon stopped moving laterally and more or less parked itself about 100 feet above the ground. During the remainder of the encounter, the object hovered a few feet above the trees. My mother and I stood there mesmerized by this thing, watching it for maybe ten minutes and pondering what it could possibly be. I distinctly remember us discsussing how it reminded us of \"Close Encounters of the Third Kind\", which had come out only the summer before. Soon after this, we witnessed what turned out to be the highlight of the whole night. As we watched the object hover there before us, our eyes caught sight of a small bright red point of light steadily moving across the starry sky from one end of the horizon, above the trees in our yard, across the field and towards the craft. As it approached the craft, we noticed another red light coming from the opposite direction, and still another, until four red balls of light converged on the object from different parts of the sky. One by one, these red balls slowed and moved in towards the object, stopping just above it, and then descended into the top of it, until all four had dissappeared. My mother mentioned that these were possibly scout ships coming back to the mothership after a reconaissance mission, which sounded pretty plausible to me! We waited for the object to start moving again, but nothing happened for a few minutes. Suddenly, as if it sensed us observing it, the object activated two white spotlights on opposite ends of the craft, and the lights criss-crossed several times, focusing on the field between us and it. After this startling display , my mother felt like we might be pressing our luck staying there, so we headed inside with the object still sitting above the trees. I remember wanting to remain there until it left, but being only ten, I had little say in that decision. Upon hindsight, my mother regretted our going back in the house before it departed, as we never saw it again after that night. She now wishes we had waited at least a few more minutes to see what its next move would be. I later suggested we might've avoided an abduction by leaving when we did. That apparently didn't happen, as the thirty minutes or so that elapsed while we were outside were accounted for by the fact that my father and brother didn't seem to feel like we were gone too terribly long. Additionally, I returned to the den to catch the TV show following the one on at the time we left the room. A short while later, my brother told everyone that this evening was not the first time he had seen the object. He had observed it sitting above the same treeline the night before while looking out my parents' bedroom window after having felt somehow compelled to do so. When asked why he didn't mention seeing it the previous night, he didn't have an answer. As for my father, he says he believes we all saw what we saw, but he still thinks a more earthly explanation exists, which is why he never bothered to have a look that night. (Personally, I think it was simply a case of the reading chair being too comfortable.) We all agree that he missed out on the most extraordinary experience of our lives. Had this event occurred today, we most certainly would have documented it with video. I tried to find out if it had been witnessed by anyone else in our immediate area, but none of our neighbors saw it (or so they say.) I wish my mother and I had had the presence of mind to get our neighbors next door to come out and see it for themselves, but it didn't occur to us at the time. Maybe that was just as it was meant to be, a special experience only a selected few are allowed to have in their lives. For that, we are honored. My mother and I tend to be a bit greedy in this regard, however, because both of us would absolutely welcome another chance to see this craft or another in our lifetimes. It is a topic of conversation on many visits, especially in March, when we quietly celebrate the anniversary of what we feel to be our greatest moment together as mother and child, second only to my birthday, but a close second at that!! Thank you for the opportunity to share my story with you. Hopefully, it will be of some use to you in your investigation. Please feel free to contact me for any other details, as it is entirely possible something else might come to mind that I failed to mention here. I would be interested to know if there are any reports of sightings around that time in my area that might coraborate my account. If so, please let me know. Thanks again!!"],"Object Flight Path":"Path with directional change,Path then hovering","Case Number":"24888","Date of the Event":"03/15/1978 08:00 UTC","Object Features":"Unknown"}