{"Summary":"I was driving to work on 6/24/2010. I was driving south toward Cincinnati on Route 4 (Dixie Hwy).","Disposition":"Insufficient Data","City":"Cincinnati","map":"<A HREF = \"http://maps.google.com/maps?q=39.110238,+-84.50209(24892)&iwloc=A&hl=en\"> mufon case (24892) map </A>","Case Number":"24892","Source":"MUFON","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around June 23rd 2010"],"Date Submitted":"08/02/2010 12:12 UTC","Viewing Distance":"Over One Mile","Latitude":"39.110238","divs":["sighting detailsi was driving to work on 6\\24\\2010. i was driving south toward cincinnati on route 4 (dixie hwy). the weather was sunny, hot and humid and there was no cloud in the sky. it all happened when i approached a stop light. it was still light out. i noticed a bright sphere in the sky flying under the moon. at first i didn't think anything of it until i realized how fast it was moving. in less than a minute it traveled below the moon on the left side of it and flew under it to the right side. once a again i was stopped a a red light when i saw this. then it did something unexpected.. i completely stopped moving. then dropped in the sky at a 60 degree angle (approx) then dropped straight down at a 90 degree angle. then it vanished. at first i thought it was just an airplane with the sun refecting off it, but it was about three times the size, and it moved faster than any airplane i have seen. i am a navy vertern and i have seen many jets flying and what they can do. i am basing the size on the porportion in size compared to the moon. and once again there was no clouds in the sky and it was still light out. this all happened while i sat at a red light."],"Object Flight Path":"Path then hovering","Log Number":"US-08022010-0001","Date of the Event":"06/23/2010 09:06 UTC","Object Features":"None","Longitude":"-84.50209","Region":"Ohio","Country":"United States","Weather Factors":"None","Object Shape":"Saturn-like","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24892.html.txt","/var/www/straped/mufon/org/24892.html"],"Tags":"City"}