{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.32783,+-111.087981(24896)&iwloc=A&hl=en\"> mufon case (24896) map </A>","City":"Undisclosed","Summary":"Green and white light with orange fire/ jet flying very low, then just dissipated.","files":["/var/www/straped/mufon/html2text/24896.html.txt","/var/www/straped/mufon/org/24896.html"],"Tags":"City","Latitude":"39.32783","Country":"United States","Case Number":"24896","Date of the Event":"07/25/2010 04:15 UTC","Viewing Distance":"Unknown","Longitude":"-111.087981","Disposition":"Unknown","Object Features":"None","Region":"Utah","divs":["Sighting DetailsJuly 25, 2010: After driving with my family from Colorado Springs, Colorado for around 12 hours, I had pulled off the road about 20 miles west of Delta, Utah on HWY 50. It was 4:15 a.m.. As I turned off my truck, my oldest son, and my girlfriend woke up. I was getting ready to take some of our things out of the cab of the truck, to make for more sleeping room, when I noticed what looked to be a low-flying airplane. I saw white with green lights moving easterly parallel to the highway. The trajectory seemed to be headed downwards around 10 to 15 degrees. I thought it was strange for an airplane to be flying at that time, in the middle of nowhere, but I just wrote it off as normal until a huge, orange jet-fire, for lack of a better description appeared from the back of the lights. The jet appeared very long. It didn't look like flames, but like a torch, or something. I don't recall any acceleration of the lights, but it just sort of dissipated, and was gone. There was no sound. I asked my girlfriend, and my son if they had seen this, and they saw the same thing. I don't know if it could have been a meteor, or any other describable object, but the jet-fire tells me it wasn't. A week later I asked my son and girlfriend to draw what they saw, and all of our drawings were pretty much the same."],"Weather Factors":"None","Object Flight Path":"Straight-line path","Date Submitted":"08/02/2010 01:46 UTC","Log Number":"US-08022010-0005","trends":[],"Object Shape":"Fireball, Oval, Other","Sighting Duration":"00:00:30"}