{"trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around July 27th 2010","This sighting has never been favorited.",""],"Disposition":"Hoax","Summary":"Possible message or code in sky.","Country":"United States","Longitude":"-94.569677","Source":"MUFON","Object Shape":"Square, Rectagular, Unknown","divs":["Sighting DetailsI was taking pictures of the sky and after loading a few into the computer, I noticed what looked like little color coded blocks, after enlarging them I notice how they reminded me of hieroglyphics I've seen in some pictures. They look like symbols arranged in a triangle. I have no idea why they came out this way, but I was curious as to what you think. My camera was aimed upward and slightly southwest. Although I have approximately 3 to 4 pictures aimed in different directions I still got the same or simular results, which was kind of strange and when I alligned the pictures up the objects were in the exact same position in the photos. checked the lens for dirt or debris and found none. I did'nt want to submit this one at first thinking that perhaps maybe it is a camera malfunction, but after wiping and rechecking the len and getting simular results, I thought that perhaps I should. It could mean something or nothing at all. But we won't know until everone get a look at it. So here it is."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.108806,+-94.569677(24890)&iwloc=A&hl=en\"> mufon case (24890) map </A>","City":"Kansas City","Object Features":"Undisclosed","Tags":"City","Latitude":"39.108806","Date of the Event":"07/27/2010 01:29 UTC","Region":"Missouri","Log Number":"US-08012010-0018","Object Flight Path":"Undisclosed","Case Number":"24890","Viewing Distance":"Unknown","Date Submitted":"08/01/2010 09:42 UTC","files":["/var/www/straped/mufon/html2text/24890.html.txt","/var/www/straped/mufon/more/24890_submitter_file1__003.JPG","/var/www/straped/mufon/more/24890_submitter_file2__004.JPG","/var/www/straped/mufon/more/24890_submitter_file3__005.JPG","/var/www/straped/mufon/org/24890.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}