{"Object Features":"Unknown","Summary":"Three star-like UFOs moving slowly and stopping.","City":"Albuquerque","divs":["Sighting DetailsMyself and three of my friends were outside a house smoking cigarettes. I was gazing up at the sky and noticed a point of light slowly moving. My first impression was that it was a plane, but it was not blinking and it was moving slowly. I get my friends' attention and point it out. They too first thought the same thing as I, then thought maybe it was a satellite. It was not moving like a satellite either. It then stopped and turned from going north to east and approached a second ufo. They approached each other and one went westward and up while the other continued and seemingly entered a lower cloud which was lit up by light pollution. It dropped out of the cloud and disappeared. A few minutes later in the southern portion of a sky a bluer ufo (the others were pale and twinkly) started moving northeasterly. This one moved very slow. It moved directly west of us and stopped \"in front of\" a group of actual stars. It seemed to dim a bit and remained there. We got tired of straining our necks and eventually it faded out too. I think the UFOs are trying to resemble stars. When they are motionless and if you happened to look up you would never notice any difference. And they were moving slow so if you just happened to look up you wouldn't even notice it moving! They have to be doing this on purpose and personally, I think its genius."],"Latitude":"35.089641","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24894.html.txt","/var/www/straped/mufon/org/24894.html"],"Date of the Event":"08/01/2010 10:25 UTC","Sighting Duration":"00:07:00","Case Number":"24894","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08022010-0003","Longitude":"-106.648857","Tags":"City","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around August 1st 2010"],"Object Shape":"Star-like","Weather Factors":"Unknown","Region":"New Mexico","Date Submitted":"08/02/2010 01:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.089641,+-106.648857(24894)&iwloc=A&hl=en\"> mufon case (24894) map </A>","Country":"United States"}