{"Log Number":"","City":"HOUSTONSPRING","Case Number":"2489","Object Features":"Undisclosed","Object Shape":"Unknown","Summary":"Aberrational NoisesHums Electrical Disturbances","files":["/var/www/straped/mufon/html2text/2489.html.txt","/var/www/straped/mufon/org/2489.html"],"Latitude":"31.970129","Region":"Texas","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.970129,+-99.893423(2489)&iwloc=A&hl=en\"> mufon case (2489) map </A>","divs":["Sighting DetailsYoull probably disregard this report. Nothings been sighted though weve lookedfor it. Over the past couple of weeks weve experienced several occurrences ofstrange low humming sound that elevates to a low rushroar that simply goes onfor too long. Sometimes the lights dim or there are power failures. Theres asort of electric feeling in the airbirdssquirrels get agitated and have been more aggressive of late following theoccurrence. At nite, strange, almost musical beeping sounds, this on only oneand the above reported occcassion. We were awakened from sound sleepinsects were much agitated and loudlights flickered. Heard low roarrumble for 20 minutes. Seemed to come and go. We live in heavily wooded area of north houston and are near BushIntercontinental Airporthave lived there 12 years and disregard aircraft noises, we dont really hearthem anymorethey are background noise. Ive run out to check the sky on occasion, but wehave such a small piece of sky its almost pointless. Whatever happened Sundaya.m. was close. Too low to be an aircraft and didnt have the usual directionalquality of an aircraft. Only reporting this for your records and in the eventyouve gotten similar such reports. Thanks"],"Date of the Event":"08/03/2003 02:30 UTC","Date Submitted":"08/03/2003 02:30 UTC","Disposition":"Unknown","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been no other sightings in HOUSTONSPRING","This sighting has never been favorited."],"Longitude":"-99.893423","Object Flight Path":"Unknown","Sighting Duration":"00:30:00","Viewing Distance":"Unknown","Country":"United States"}