{"Source":"MUFON","Date Submitted":"08/02/2010 09:55 UTC","Case Number":"24907","Object Shape":"Circle, Sphere","Latitude":"30.828799","City":"Fort McKavett","Object Flight Path":"Path with directional change","Summary":"Bright luminous orange shape in the sky, like moon but larger","map":"<A HREF = \"http://maps.google.com/maps?q=30.828799,+-100.101017(24907)&iwloc=A&hl=en\"> mufon case (24907) map </A>","Date of the Event":"07/03/1966 10:30 UTC","trends":["There have been no other sightings in Fort McKavett","This sighting has never been favorited."],"Country":"United States","files":["/var/www/straped/mufon/html2text/24907.html.txt","/var/www/straped/mufon/org/24907.html"],"Object Features":"None","Log Number":"US-08022010-0015","Tags":"City","Disposition":"Unknown","Weather Factors":"None","Region":"Texas","divs":["Sighting DetailsThis event happened sometime in the summer of 1967, probably in July or August. It's been a while so I do not remember the month as well as I do the specific event. I had been to a week long Boy Scout camp with a lot of my fellow scouts in Harlingen, Texas which is in far south Texas. We had chartered a bus for the trip. The week long trip was almost over and on Sunday night we returned by bus to our home camp, Camp Sol Mayer, near Menard, Texas which is in the western part of the state. We lived in San Angelo which was still another 100 miles or so away. We disembarked from the bus and threw our gear in a '57 Chevy owned by one of the older boys. (I was 16 at the time.) I remember some of the boys had dug up one of those big round wooden poles that support guard rails on the road side and drug it on to the bus along the way. Don't ask why. I think you have to be a teenager to understand things like that. We helped them unload it and then got in the '57 for the final leg of the trip home. We drove two or three miles on Farm to Market 864, which is where Camp Sol Mayer is located, and then turned west on Highway 190. We were tired and no one was talking much although there were four of us in the car. We listened to KOMA from Oklahoma City on the radio. I was sitting in the back seat on the drivers side. My friend in the seat beside me first commented on how big and bright and orange the moon was that night. We each bent down for a look through his window and concurred thinking it was strange. A few seconds later,I noticed a normal looking moon on my side of the car. We all checked it out and then turned our attention to the one on the passenger side. It looked like some celestial object, far off in the sky but much larger and brighter than I had ever seen the moon and very orange. It did not show the \"man in the moon\" markings of craters we had all come to know. We kept looking at it, talking about it and wondering what it could be. It did not move, get brighter or dimmer. It did not change in any way - it remained in the same part of the sky appearing, as I said, to be a celestial body. After about fifteen minutes, we turned north on Highway 2084 which took us on to Christoval and then San Angelo. When we made the turn, we realized the object had been much closer to us than we had thought and traveling at a speed matching ours. It kept going west. We watched it recede in the distance for another five to eight minutes until it was just a small speck in the western sky. Abruptly, it divided into three different colored lights, each shooting off in a different direction until they all disappeared. This part was much like one of the UFOs in Speilberg's \"Close Encounters\", but I saw it for real years before the movie came out. The next morning, the local newspaper had an article about numerous UFO sightings all over the Midwest. I said earlier that this was in 1967 when I was 16 and I think that is correct. The importance of details like dates have paled in comparison with the actual experience. It is possible that it was 1966 and I was 15. Perhaps cross checking with Midwest UFO sightings in those summers would verify the date. Regardless of the year, it has been over 40 years since I witnessed that event and I have never come up with an explanation which satisfies me. To this day, I do not know what it was."],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-100.101017"}