{"Weather Factors":"None, Does Not Apply","trends":["There have been 39 other sightings in El Paso","There was one other sighting in El Paso on or around August 2nd 2010"],"Longitude":"-106.483051","files":["/var/www/straped/mufon/html2text/24909.html.txt","/var/www/straped/mufon/org/24909.html"],"Date Submitted":"08/03/2010 04:21 UTC","Summary":"Multiple star-like events over 1.5 hrs in and around Big Dipper Constellation","Source":"MUFON","Case Number":"24909","Disposition":"Unknown","Tags":"City","Date of the Event":"08/02/2010 10:55 UTC","divs":["Sighting DetailsI was walking outside with my brother through the front door which faces east south-east as he was leaving to go home. As he was entering his vehicle, he asked what planet was above the Big Dipper, above the \"pot\" area which is formed by four stars and attached to the handle. I looked up, which was to my north west and noticed a star-like object in the position he described but knew it could not be a planet since it was well above the elliptic. It was not moving but it's star-like appearance along with the four other stars formed a pentagon shape. A few seconds later or so, we both witnessed it just fade away. We could hardly believe what we saw. After a few minutes he proceeded home after we also had seen a couple of meteors. A few minutes later, I had told my wife and some other family members of what we saw and the meteors so they came outside. What we saw after some minutes later were three meteors in just a few seconds streak across the sky from like south to north and one of them from east to west. We kept looking at the night sky and I looked towards the Big Dipper again, and very soon, within about two minutes, I noticed another star-like object, but this time it was just below the handle of the Big Dipper and next to the upper left star of the \"pot\" of the Dipper. And this time it was moving very slowly diagonally towards the right and below. By then, my family also saw it, to include one of my nieces. I and they could hardly believe it and I quickly had my wife call my brother since I could not keep my eyes off what I was seeing. He and his wife came over immediately but by then it had disappeared again. He lives only about five minutes from my home. By this time, we continued watching the area, and were particularly focused in the Big Dipper area. We all then saw star-like objects again in and around the Big Dipper area. We saw them with the unaided eye and with three binoculars. The star-like objects were moving slowly but were also changing in color and direction and in some cases, large directional and angle shifts. Each time they faded away or simply vanished. The time line began around 10:55 pm when we saw the 1st star-like object - witnessed by two family members as noted above. 11:10pm - saw three meteors 11:11 - 11:15 pm - saw star-like object moving through Big Dipper diagonally as noted above. Witnessed by three family members. 11:26-11:38 pm - star-like object (s) around Big Dipper that was witnessed by seven family members. 11:45 - \"shooting star\", meteor through Big Dipper 11:56 - star-like object near third star in handle of Big Dipper proximal to the \"pot\". witnessed by seven 11:56 pm - 12:00 am - something moving up or shooting up from same third star as described above. Noticed by two family members 12:00 am - another meteor to right of Big Dipper. 12:06 am - something moving up, star like object, from between the 2nd and 3rd star of handle. 12:15 am - meteor through the center of Big Dipper from SE to NW direction. 12:25 am - meteor through handle of Big Dipper. This is the best of my recollection. The times are quite accurate as I instructed one family member to record time of star-like objects and or meteors noted."],"Object Features":"None","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Log Number":"US-08032010-0002","Region":"Texas","Latitude":"31.76213","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"El Paso","map":"<A HREF = \"http://maps.google.com/maps?q=31.76213,+-106.483051(24909)&iwloc=A&hl=en\"> mufon case (24909) map </A>","Country":"United States"}