{"trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around July 31st 2010"],"Log Number":"US-08022010-0013","files":["/var/www/straped/mufon/html2text/24905.html.txt","/var/www/straped/mufon/org/24905.html"],"Summary":"Bright white intense light turning very faint blue green.","Country":"United States","divs":["Sighting Details My wife and I were sitting outside Saturday night, on our patio, which faces West. The sky was mostly clear, but there were low scattered clouds moving in from the coast. I had just finished lighting the fire pit, and sat down to take off my shoes. My wife was talking about how wonderful the weather has been, I was looking at the sky thinking what a beautiful evening it was, when I noticed a flash behind a group of clouds to the south west !! The object in question appeared from behind the clouds , and moved at a modest speed heading North it gained in intensity \"brighter than Venus has been\". I thought at first it was a meteor, because it was extremely bright, but there was no trail that is usually associated with a meteor or shooting star . The event was very quick, it went from super bright white, and then very quickly, dimmed to what appeared to be a very faint almost Neon blue light, and then I lost sight through the trees and clouds. My wife never saw the object because of the trees behind her, and by the time we both hopped up to look over the trees it was gone. I don,t think it was a satellite, I have watched satellites cruise over many times, and I have never seen one light up like this object did. I was pretty exited about what I had seen! This is the third time in my life I have seen something unexplainable to me."],"Source":"MUFON","Region":"California","Date Submitted":"08/02/2010 06:40 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City","City":"Oceanside","Object Shape":"Flash, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=33.20122,+-117.374783(24905)&iwloc=A&hl=en\"> mufon case (24905) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Case Number":"24905","Disposition":"Insufficient Data","Weather Factors":"Does Not Apply","Longitude":"-117.374783","Date of the Event":"07/31/2010 10:00 UTC","Latitude":"33.20122"}