{"Sighting Duration":"Undisclosed","Longitude":"-118.972079","map":"<A HREF = \"http://maps.google.com/maps?q=37.648546,+-118.972079(24906)&iwloc=A&hl=en\"> mufon case (24906) map </A>","Disposition":"Insufficient Data","City":"Mammoth Lakes","Date of the Event":"06/30/2010 10:35 UTC","Date Submitted":"08/02/2010 07:26 UTC","Source":"MUFON","Country":"United States","Object Features":"Unknown","trends":["There have been 2 other sightings in Mammoth Lakes","There were no other sightings in Mammoth Lakes on or around June 30th 2010"],"Log Number":"US-08022010-0014","files":["/var/www/straped/mufon/html2text/24906.html.txt","/var/www/straped/mufon/org/24906.html"],"Weather Factors":"None","Object Shape":"Star-like","Case Number":"24906","Object Flight Path":"Straight-line path","Latitude":"37.648546","Viewing Distance":"Over One Mile","Summary":"High altitude/extremely fast object which disappeared.","Region":"California","Tags":"City","divs":["sighting detailsi parked my vehicle for the night (having finished my shift), got out, and then stopped to look at the night sky. the stars are absolutely incredible here in the mountains. i wanted to orient to the milky way and pick out constellations and stars (a good way to relax).. when i noticed something moving across the sky. i often notice planes at night, so i did my own checklist - speed? flashing white\\red light? approx. altitude? direction? well the direction was off. most often in this area, planes travel from the east towards the west. this \"craft\" was traveling from the north towards the south, slightly east of the eastern sierra mountains (not on top of them) on a direct, straight course - no zig zags; not stationary; no acrobatics. i could not discern the shape because it was so high up; there was no flashing light, only a continuous white light. it looked just like a pinprick star in the night sky, only moving. and it was moving much faster than an airplane. as i watched it, and thought that it might be a ufo, i decided to reach out with my mind. i focused on it and thought, \"who are you?\" a moment or two later it disappeared. like someone had hit a \"stealth\" switch. i looked ahead of its intended direction - nothing. i looked where it had been - nothing. i couldn't find it! and there had been no change; no light change, etc. just gone. (i posted this happened in july; it could have been late june. i'm sorry, i didn't write down the date.)"]}