{"Region":"Colorado","Object Shape":"Cross, Cylinder, Unknown","Case Number":"24904","Latitude":"39.558221","Date of the Event":"07/30/2010 01:04 UTC","Tags":"City","Log Number":"US-08022010-0012","Date Submitted":"08/02/2010 06:31 UTC","Summary":"5 objects captured on high resolution camera/ phone flying with a formation of jets approx. 30-40,000ft","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.558221,+-105.775477(24904)&iwloc=A&hl=en\"> mufon case (24904) map </A>","Object Flight Path":"Unknown","divs":["Sighting DetailsI notice a formation military jets (x6) flying south to north over Green mountain res. in summit county.took a picture as they pass over head, hit save and proceeded to look at the picture, pressing the zoom to see if the jets would be visible. As I zoomed in on the first set of vapor trails I imediately noticed an object inbetween the jets and turned the phone around to make sure there wasn't any dirt on ther lens, which there was not. I proceeded to zoom in to the maximum setting. The figure a appears to be much larger then the jets. I also noticed four other objects,two inbetween two other jets and two that seemed to be trailing behind one jets vapor trail perhaps a mile or two behind. All objects apprear to have the exact same shape, no vapor trails and all have sun glaring off of them. None of this was visible to the naked eye, as there several of us watching them as they passed over head (the jets);I had to move under a canopy to cut out the suns glare in the photo. By the time I had realized what was in the photo, the jets had already passed over Green mountain to the north. One other thing to mention,I took the photo because it was unusual to see jets flying formation so high in altitude, but I was told by a friends who were on a boat that they had noticed approx. 6 more jets further to the west."],"trends":[""],"Source":"MUFON","Disposition":"Unresolved","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/24904.html.txt","/var/www/straped/mufon/more/24904_submitter_file1__BobCellPictures7-31-10005.jpg","/var/www/straped/mufon/more/24904_submitter_file2__BobCellPictures7-31-10005.jpg","/var/www/straped/mufon/more/24904_submitter_file3__BobCellPictures7-31-10.jpg","/var/www/straped/mufon/org/24904.html"],"Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-105.775477"}