{"Log Number":"US-08022010-0009","Region":"Wisconsin","Case Number":"24901","Disposition":"Unknown","Latitude":"43.081892","Source":"MUFON","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around June 30th 2010"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Summary":"About mid-July I looked out my second floor apt window. I saw what I thought was a star, but it very bright and low in the sky.","Sighting Duration":"01:35:00","Longitude":"-89.39268","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.081892,+-89.39268(24901)&iwloc=A&hl=en\"> mufon case (24901) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/24901.html.txt","/var/www/straped/mufon/org/24901.html"],"Country":"United States","divs":["Sighting DetailsAbout mid July at approximately 845pm, I saw what I thought was a star, but it was to bright and low in the sky. After watching it for about 5 minutes, I noticed red,green,blue, and white lights slowly blinking around it. The next time I looked out the window the object was slightly closer. Lights were blinking one on one off, then a large rotating white light, like a light house. This went for approximately another hour. At approximately 940pm the object started moving towards me. It had what looked like a smaller version of the space needle, the upper half of the object was kind of olive drab color, like military fatigues. The bottom was like you cut a golf ball in half , with a red circle painted on it. The red circle were lights though, and the white surface had what appeared like divits. The object made no noise at all. This has been happening every night at the same time for almost 3 weeks. Some nights the object would move toward me, and some times in the object would move in opposite direction, away from me. When first started seeing this object I didn't know if it was a star, or a satelite."],"Weather Factors":"Unknown","City":"Madison","Date Submitted":"08/02/2010 03:50 UTC","Object Shape":"Star-like","Date of the Event":"06/30/2010 08:45 UTC"}