{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.702541,+-114.625272(24908)&iwloc=A&hl=en\"> mufon case (24908) map </A>","Weather Factors":"None","City":"Yuma","Object Shape":"Circle, Fireball, Star-like","Object Flight Path":"Stationary,Path with directional change","Log Number":"US-08032010-0001","Summary":"Arizona lights off of I-8 from Phoenix into Yuma.","divs":["Sighting DetailsMy husband and I were driving tonight on I-8 heading home back to Yuma. I noticed a flashing orange light at a distance in front of us and started to take notice. As we both watched we noticed more of the same lights come on. I counted at times, a total of 6. They were all bright orange in color and they would either flash on and off, flash simultaneously or completely stay off for a while. A few would stay on for about a min or two and then completely go dark. They lit up the whole sky. However, you could mistake them for a star because they had no movement. (for most part) They were stationary. When they would move, they were never the same formation. Some did stay really close together, like 2 together and the rest far away. One would be down low, two up high together, and another to the right. These orange lights when they would flash, I would have to describe it as a sparkler, when you wave the fire in the sky and it leaves a trail. That's what these lights did. When they would move, you could see the light behind it slowly fade. There were also white lights that you could explain as \"dancing\" as I have just read other reports. They would start off close together and spread far apart. There were lots of white lights at times and other times just two blinking at a time. We watched these lights for about an hour. There were just too many to be any sort of plane or helicopter. And again, they stayed stationary and sometimes we had to just watch and wait until they would turn on again. The sky would be black. These lights are unexplainable, like nothing we have ever seen!!! I started looking on my husbands phone on the internet and he jumped and said, \"oh! There they are!\" By this time we were almost home and the lights were behind us. He saw 3 right in the sky in front of him up high. They turned on - 1, 2, 3. And that was it!!! I did try to record it from his video camera on his phone but it was way too dark to capture them and sometimes they stayed so faint you could barely see them. You had to wait for them to \"ignite\" and then you could really see them!"],"files":["/var/www/straped/mufon/html2text/24908.html.txt","/var/www/straped/mufon/org/24908.html"],"Case Number":"24908","Date Submitted":"08/03/2010 02:31 UTC","Disposition":"IFO","Longitude":"-114.625272","Country":"United States","Viewing Distance":"Unknown","Region":"Arizona","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around August 2nd 2010"],"Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"08/02/2010 10:00 UTC","Latitude":"32.702541","Source":"MUFON"}