{"map":"<A HREF = \"http://maps.google.com/maps?q=39.954535,+-75.159929(24919)&iwloc=A&hl=en\"> mufon case (24919) map </A>","Tags":"City","Disposition":"Insufficient Data","Date of the Event":"04/13/2008 03:45 UTC","Object Features":"Other","divs":["Sighting DetailsAfter noticing some strange diamond-shaped and crescent-shaped objects @midnight, I decided to keep watching. Suddenly, from a high altitude, I saw this row of four lights beaming bright descend and then come to a complete stop. There was enough moonlight to make out the superstructure; it was a double parabolic object with a significant bulge in the center. It was only @2000 feet from my top floor apartment, which faces East toward New Jersey, near the Delaware River.These were bright solid oval lights;two white and two orange; a pair on each side of the center line.It did not move for the five minutes I observed it until I closed my blinds. I was completely baffled by the sight of something as big as two or three aircract carriers suspended in midair.I then realized I was beinf backlit by my TV set in the window and thought they might see me; so I got scared, closed the blinds, shut off the TV, took my sleeping pill and went to sleep. I had attempted a video using my Sony Handycam, but realized the next day that I forgot to press the red Record button; I must have been spooked to do such a stupid thing since I knew how to take videos and in fact had taken some that same day.I probably should have stayed with the viewing, but I was getting tired.I also probably should have gone out to the train station area that it was over and signaled it with a flashlight and maybe it would have come down and I could have boarded it; I was very interested in the anti-gravity mechanism.But I then got caught with an overwhelming sense of fear and checked that."],"Sighting Duration":"Undisclosed","Case Number":"24919","Object Flight Path":"Path then hovering","Source":"MUFON","Date Submitted":"08/03/2010 06:35 UTC","Weather Factors":"Unknown","Region":"Pennsylvania","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Latitude":"39.954535","Longitude":"-75.159929","Summary":"Saw a double parabolic-shaped object descend from high altitude.","Log Number":"US-08032010-0012","files":["/var/www/straped/mufon/html2text/24919.html.txt","/var/www/straped/mufon/org/24919.html"],"Object Shape":"Other","City":"Philadelphia","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around April 13th 2008","This sighting has never been favorited.",""]}