{"Object Features":"Unknown","Tags":"City","Latitude":"39.380372","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around July 31st 2010","This sighting has never been favorited.",""],"Weather Factors":"Heavy, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=39.380372,+-104.85369(24914)&iwloc=A&hl=en\"> mufon case (24914) map </A>","Date Submitted":"08/03/2010 03:01 UTC","Summary":"Perfectly squared horizontal cross shape in humongous cumulonimbus clouds over Castle Rock, Parker, CO.","Region":"Colorado","Longitude":"-104.85369","Case Number":"24914","Object Shape":"Cross","Disposition":"Hoax","divs":["sighting detailsok, i'm not certain it was a ufo causing the unique cross formation in a humongous cumulonimbus cloud over castle rock and park, co on saturday, july 31, 2010...but this is a description of what my husband and i saw... while driving home from a movie, heading west on founders parkway, stopped at the first stoplight west of i-25, as i looked up at the horizon filled with a multitude of humongous shimmering, luminescent cumulonimbus clouds, i said, \"look at that!!\" \"that\" was a perfect horizontal parallelogram - just above the horizon - (holding my hand at arm's length the height was about the size of my thumb nail and the width about 8\") and a perfect vertical parallelogram starting approximately 2\\3 the width to the right...making a horizontal cross shape...(the height with arm outstretch was about 4\" and the width the same thumb nail size) i've attached an image i created that is very similar to the one we saw. and, you could see clear blue sky through the cross shape in the cloud. i asked for my husband's cell phone to take a snapshot and just as i was about to take it's picture the stoplight turned green and we had to proceed. i asked him to make the first right hand turn, but we couldn't due to traffic. by the time we were able to see the exact location again, about 2 minutes later, the cross formation was gone. my husband thinks the wind could have done it, however, i've never heard of horizontal and intersected vertical parallelograms with 90 degree corners at the intersection with blue sky showing in the middle of huge, deep clouds before! i've tried searching the internet for other notifications regarding the cross formation to no avail. i'm just glad my husband actually saw it, too!"],"Log Number":"US-08032010-0007","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"07/31/2010 01:33 UTC","files":["/var/www/straped/mufon/html2text/24914.html.txt","/var/www/straped/mufon/more/24914_submitter_file1__07-31-10ImageinCloudReplication.png","/var/www/straped/mufon/org/24914.html"],"Country":"United States","City":"Castle Rock","Object Flight Path":"Other","Viewing Distance":"Over One Mile"}