{"Summary":"Dull Orange glowing vertical cylinder","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2491.html.txt","/var/www/straped/mufon/org/2491.html"],"Country":"United States","Case Number":"2491","Latitude":"30.771173","Object Flight Path":"Straight-line path","Region":"Florida","Date Submitted":"08/09/2003 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.771173,+-86.560588(2491)&iwloc=A&hl=en\"> mufon case (2491) map </A>","Longitude":"-86.560588","Sighting Duration":"00:30:00","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Log Number":"","divs":["Sighting Details1. The object was sighted from my back yard hovering silently above a near-byAMFM Radio Broadcast Tower two blocks West of my house.2. I had to let the dogs out before I left the house for work oa 0430 in themorning. I must leave at 0500 hours in order to arrive at work before 0600hours. So I just happened to look up towards the West when this object caughtmy attention.3. At first I thought it was a partial moon or half moon but I quicklydiscounted that by the vertical cyninder shape of this object.4. I only had 20-25 minutes to observe this object before I had to leave thehouse for work, so I really didnt have much time to gather a reaction or feelingas to what I saw.5. The object was a dull orange glowing vertical cylinder that hovered about 500ft. above a near-by Commercial Radio Broadcast tower approxiamately 2 blockswest of my house. The object moved slowly up and down and from side to side. Itwas also emitting or fireing off small globes of white light at radom fromvarious directions. You didnt see a trail as these lights were fired off butonly saw them when they flashed at various distances from the crafts, so theywere definately not marker strobe lights or navigation lights.6. I lost sight of the object only when I had to depart my house to go to myjobe site.PLEASE PLEASE DO NOT USE MY NAME I wish to remain anonmis, as I have a SecurityClearence and work for The Air Force. I know definetly I would loose my job andmy security clearence if my identity were to be revealed."],"City":"Crestview","trends":["There have been 6 other sightings in Crestview","There were no other sightings in Crestview on or around August 9th 2003"],"Object Shape":"Cylinder","Tags":"City","Date of the Event":"08/09/2003 04:30 UTC","Weather Factors":"Unknown"}