{"Viewing Distance":"Unknown","Summary":"High Altitude Bright Lights Overhead","trends":["There have been 10 other sightings in Napa","There were no other sightings in Napa on or around July 24th 2010"],"Sighting Duration":"Undisclosed","Latitude":"38.309922","Disposition":"Insufficient Data","Region":"California","Object Features":"Undisclosed","Date Submitted":"08/04/2010 03:07 UTC","Date of the Event":"07/24/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.309922,+-122.294989(24924)&iwloc=A&hl=en\"> mufon case (24924) map </A>","Case Number":"24924","files":["/var/www/straped/mufon/html2text/24924.html.txt","/var/www/straped/mufon/org/24924.html"],"Object Shape":"Star-like","Weather Factors":"Unknown","Tags":"City","Log Number":"US-08042010-0002","City":"Napa","Country":"United States","Object Flight Path":"Undisclosed","Longitude":"-122.294989","divs":["Sighting DetailsI was observing the Milky Way and the clear night sky (no moon) at about 10pm when I noticed a bright light appear almost directly overhead. It was a continuous light for some 15 seconds, no flashing lights to indicate an aircraft; it was more like a bright star. There was no sound associated with the light. Then it just stopped. It did not fade out or move, it just stopped shining. There were no clouds that evening and no moon. About 5 to 7 minutes later the light appeared again in the same area, stayed illuminated for a few seconds and was out again. I did not see it reappear for the 15 minutes I remained outside. I know it may sound a rather pedestrian sighting, but in my 20 years of living in the country far from the light pollution of the city I have never seen anything like this. Had there been cloud cover I could maybe dismiss it as a plane or satellite (actually it was much too bright for a satellite compared to the ones I have seen in the past) making an intermittent appearance through the clouds. But even a conventional aircraft would have covered significant distance in that 5 to 7 minute interval. I sensed this was out of the ordinary when it first appeared. I will keep looking."],"Source":"MUFON"}