{"Latitude":"45.148577","map":"<A HREF = \"http://maps.google.com/maps?q=45.148577,+-93.151612(24925)&iwloc=A&hl=en\"> mufon case (24925) map </A>","Log Number":"US-08042010-0003","Case Number":"24925","Disposition":"IFO","divs":["sighting detailsi was driving down lexington\\lake drive to go to my buddies trailer home and suddenly a very random large vibrant display of fireworks began to erupt suddenly a couple streets down. as i was paying attention to the fireworks, a couple of lights caught my eye in the sky, they were a very exuberant red and blue glowing alternating lights, not flashing like an airplane or helicopter would. this ''ufo'' was in the sky for at least a couple minutes slowly gliding on by apass my head. suddenly within a minute or so after the accurance, a helicopter with a spotlight went chasing after it in the same direction the craft was going. i know what i saw was not an everyday flying craft. it slowly hovered across the sky at about the height maybe a news helicopter would report a police chase. this ''ufo'' was so close to the ground that i even had the chance to snap a photo of the vibrant lights on my phone. it most certainly was a floating disk that went across the sky. and i am now a believer. this accurance happened 8-3-10 9:30pm it is extremely hard to see on my phone but when the photo is zoomed up like 300% you can actually see the circle body form of the craft around the lights!"],"Longitude":"-93.151612","Date Submitted":"08/04/2010 09:03 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24925.html.txt","/var/www/straped/mufon/org/24925.html"],"Object Flight Path":"Straight-line path","Summary":"2 very vibrant lights, 1 red 1 blue, and 1 white light.","Tags":"City","Source":"MUFON","Region":"Minnesota","Date of the Event":"08/03/2010 09:35 UTC","trends":["There has been one other sighting in Circle Pines","There were no other sightings in Circle Pines on or around August 3rd 2010"],"Country":"United States","Object Shape":"Circle, Disc, Oval","Object Features":"Undisclosed","City":"Circle Pines","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed"}