{"Latitude":"37.965062","Country":"United States","Longitude":"-121.28866","divs":["sighting detailsafter seeing 4 objects on the 4th and 2 on the 23rd from our back yard as reported in earlier reports my wife and i decided to go out side of town to get away from city lights just to see what we could see so we went out to the delta about a mile north of paradise point marina on the levee. at about 10pm i saw orangeish colored lights coming from the south heading northwest they seemed to be south of the marina hard to say how far it was but they were low in the sky and moving slowly. it looked like they may have been by the port of stockton which was about 10 miles from us. my wife also seen these objects there were 6 total they seemed to be about a 1\\4 mile apart as they came northwest. they all did a slow wide turn to the west and then back south towards tracy. we were watching them thru binoculers until we could not see them anymore. there was no flashing lights you could see the street lights of the marina very clear and they seem to be about the same size and a few inches higher than the street light from our view point. maybe nothing but it did seem strange."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.965062,+-121.28866(24929)&iwloc=A&hl=en\"> mufon case (24929) map </A>","Summary":"6 objects south of marina.","City":"Stockton","Log Number":"US-08042010-0007","trends":["There have been 25 other sightings in Stockton","There were no other sightings in Stockton on or around July 30th 2010"],"Date of the Event":"07/30/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/24929.html.txt","/var/www/straped/mufon/org/24929.html"],"Disposition":"Insufficient Data","Region":"California","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Oval, Other","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"08/04/2010 12:13 UTC","Case Number":"24929"}