{"Object Flight Path":"Straight-line path","divs":["Sighting Detailsi was on my back steps looking up at Orin's belt star cluster and watched a air plane dissect it saw the normal making lights and at normal jet airliner speeds about three Min's later i saw off to the south and east of Orin's belt the unknown object then it crossed crossed Orin's belt in less than a min could see a darker area in front of a the object with a bright glow at the rear there was no standard air line lights could not distinguish the real shape due to its height at least 50.000 feet if not a bit higher ,the sun had not started to raise yet, but i don't think it was a satellite ass the light was coming off the south end of the object not the eastern facing side as i could make out a darker area in front of the glow of the rear of the object ,but not enough light to make out the real shape of the object and the rear was bright than an air-force jet with full afterburner engaged. it kept its course till i lost it in the tree line at the edge of my property . if i had to guess it was traveling at 3,000 to 5,000 miles per hour as to what it was i cant say but it wasn't any jet i have ever seen as one no running lights and two , it was too bright of a light to have been the afterburners of a military jet moving at least 10 times faster than most jets due that i see and wasn't landing lights 5 Min's after i saw a meteorite streak from south to north at a slower speed by at least half the speed the object was moving"],"Case Number":"24920","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/24920.html.txt","/var/www/straped/mufon/org/24920.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.657427,+-94.44009(24920)&iwloc=A&hl=en\"> mufon case (24920) map </A>","Object Features":"Unknown","Disposition":"IFO","Viewing Distance":"Over One Mile","City":"Anderson","Weather Factors":"None","Summary":"Saw a light move across Orion's Belt moved the distance in less than a min.","Log Number":"US-08032010-0013","Latitude":"36.657427","trends":["There has been one other sighting in Anderson","There were no other sightings in Anderson on or around August 3rd 2010","This sighting has never been favorited.",""],"Tags":"City","Region":"Missouri","Date Submitted":"08/03/2010 08:31 UTC","Object Shape":"Unknown","Date of the Event":"08/03/2010 05:05 UTC","Longitude":"-94.44009"}