{"Case Number":"24927","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"37.962442","Longitude":"-121.28807","City":"Stockton","divs":["sighting detailsmy wife and i were in the back yard watching the sky at 10pm on the 23rd. we were doing this because we had seen 4 objects fly over our house on the 4th so we have been spending more time watching the skys. coming from the west we saw this orange\\yellow i said like fireball in other report but it was more like hot metal flying low about 500ft moving to the east as it come over it blinked out and back on again then out you could see a kind of see thru grey glow sphere shape around it as it moved east we saw what looked like a disc shape inside the glow we watched it until we lost sight of it in the eastern sky. about a min later another one came over at the same place in sky it looked the same as the first and did the same thing as the first. they made no sound no sharp turns just went in a straight line in sky. i tryed to take a photo of second one with my cannon powershot a400 camera as it was right over us but it would not take. maybe just me i don't know never had problems before but after it past i was able to take 3 photos but all you can see is a very small dot in the photos. sence then we have seen alot of movement in the sky that do not seem to be planes or satelites very high up. what we have been seeing does not scare us it just makes us want to know what they are and what they are doing."],"Tags":"City","Summary":"2 objects about a min. apart low over house.","Object Shape":"Disc, Fireball","Country":"United States","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.962442,+-121.28807(24927)&iwloc=A&hl=en\"> mufon case (24927) map </A>","Log Number":"US-08042010-0005","trends":["There have been 25 other sightings in Stockton","There were no other sightings in Stockton on or around July 23rd 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/24927.html.txt","/var/www/straped/mufon/more/24927_submitter_file1__ufo7-23-10002.JPG","/var/www/straped/mufon/more/24927_submitter_file2__ufo7-23-10004.JPG","/var/www/straped/mufon/more/24927_submitter_file3__ufo7-23-10.JPG","/var/www/straped/mufon/org/24927.html"],"Date of the Event":"07/23/2010 12:00 UTC","Region":"California","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"08/04/2010 10:52 UTC"}