{"Date of the Event":"08/04/2010 12:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24928.html.txt","/var/www/straped/mufon/org/24928.html"],"Case Number":"24928","map":"<A HREF = \"http://maps.google.com/maps?q=47.548493,+-122.631689(24928)&iwloc=A&hl=en\"> mufon case (24928) map </A>","Longitude":"-122.631689","Region":"Washington","Latitude":"47.548493","Tags":"City","divs":["Sighting Detailswell, a little after midnight i went on my back porch to smoke a cigarette and i was watching the stars when i noticed an object that was about the same distance away as a satellite i had seen the night before, only this new object changed both speed and direction though i should point out the satellite the night before appeared to travel significantly faster,and was consistent in speed and direction. after 10 min of watching the object it suddenly disappeared. then, later that night, around 2:30 i was outside again and a really bright object i thought was a star(i had seen it earlier and didnt notice any movement) began pulsating(which i at first thought was just atmospheric distortion)strangely and after a few minutes it began to move! and while it moved i would notice strange flashes around the object. the object appeared to be a great distance away, an though i definitely noticed its movement, i would wonder if it really was moving because it would stay in the same general area of the sky, with long periods of holding still. but i will tell you i wouldn't have reported it unless i was positive of its movement. i witnessed it move around in the same general area of the sky and every time it did it was accompanied by a couple smaller objects that moved independently and there would be strange flashes around all three objects. there was also 2 star-like objects that exhibited the same behavior, they would chase each other around and have the same strange flashes around them, though these 2 objects did not stay in the same general area, they traversed the sky. i also noticed 3 or 4 shooting stars the same night but they where completely unrelated. i must also stress that all the anomalous things i saw last night appeared very far away, out of the atmosphere and farther then the satellite i had seen the night before( i say that because with the exception of the really bright object the stayed in the same general area, the satellite was larger and moved much quicker across the sky, and stayed in a straight line and consistent speed.) the first object seemed the closest but disappeared, the 2 objects chasing each other never left the night sky but seemed farther away than the first object and thus smaller. the object i thought was the most far away was the large bright light i mistaken for a star at first, it seemed slow because of the distance, with short bursts of acceleration. none of the objects traversed the entire night sky extremely quickly but i believe that was because of the distance at which i was seeing the objects."],"Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-08042010-0006","Date Submitted":"08/04/2010 10:59 UTC","Country":"United States","Sighting Duration":"Undisclosed","City":"Port Orchard","Object Features":"Patterned Surface, Unknown","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Shape":"Flash, Sphere, Star-like, Triangle","Summary":"Night time mass UFO sighting.","trends":["There have been 6 other sightings in Port Orchard","There were no other sightings in Port Orchard on or around August 4th 2010"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}