{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/24922.html.txt","/var/www/straped/mufon/org/24922.html"],"Longitude":"35.098691","Case Number":"24922","divs":["Sighting Details I my sister and my cousin went out to smoke, then my sister looked to the sky and tell us to look too.We saw a small triangle and orange light around. First i said that is a moon, but my sister said that it mast be in a different form we watched it 5 minutes and then its disappeared. We start to talk about this and then my cousin said that its may be a UFO. We continued watch the sky and then after some thing like a 10 minutes it came back.When its came back it was much higher and disappeared after a minute. when its came back again it was some thing like a 15 minutes later and its moved to left and its became to be more white some time nothing will change after that its disappeared again, when its came back its moved right and now it was only oval shaped light than its start to turn around itself my count thought she was imagining it she asked if we sow it too, we sow. Then the light became stronger and we sow two small circles and around them light. Then its began to move toward us, we began to fear and ran to home.When we came home we told to my father what we sow, he didn't believed us so he came with us out side to see it. When we came back it was same thing like a7 minutes later and it wasn't there we wait but it didn't come back. Was it a real UFO?"],"Disposition":"Unresolved","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.014331,+35.098691(24922)&iwloc=A&hl=en\"> mufon case (24922) map </A>","Viewing Distance":"Unknown","Country":"Israel","Region":"","Latitude":"33.014331","Tags":"City","Sighting Duration":"00:40:00","Object Shape":"Circle, Triangle","trends":["There has been one other sighting in Nahariyya","There were no other sightings in Nahariyya on or around August 4th 2010"],"Summary":"It was a small orange triangle high in the sky after some time it dissapeared then came back and started moving.","Log Number":"IL-08032010-0014","Date of the Event":"08/04/2010 01:30 UTC","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"08/03/2010 10:50 UTC","City":"Nahariyya"}