{"Region":"Missouri","Source":"MUFON","divs":["Sighting DetailsMy son, sister in law, and her friend were driving heading north from south of Whiteman AFB here in Knob Noster, MO between 1 and 2 in the morning. All three observed a bright light in the sky towards the base that they observed for what they said was about 5 min. They thought it was military as we live close to the base, but as they got closer they observed it cross over the highway D at a rather low altitude then when they came even with it, it flew over the car making NO NOISE and landed in a field just north of base property, but still south of Knob Noster Proper just outside city limits. My son watched the entire event as he was not the driver and described it as a rotating X with several lights. They got scared and continued to drive into town and passed 2 or 3 police cars heading that direction moving fast. After informing me of what they had seen I went out there with my other son and his friend and observed nothing. No ufo, no police. But did notice that the base had several helicoptors operating do flyovers over the base, which is unusual. They normally only fly the helicoptors during daylight hours. We have lived here in Knob Noster for 20 years and have seen every kind of military aircraft known fly into the base here. What they saw and what they described landing did not have the flight characteristics or appearance of any other military aircraft ever observed by us. This lead us to go out the next evening (Aug, 4) to see if we could see anything that night. I will submit my personal report seperately."],"Log Number":"US-08042010-0011","Country":"United States","trends":["There have been 3 other sightings in Knob Noster","There was one other sighting in Knob Noster on or around August 2nd 2010"],"Viewing Distance":"21-100 Feet, 101-500 Feet","City":"Knob Noster","Disposition":"Unknown","Weather Factors":"None","Object Shape":"Cross, Disc","files":["/var/www/straped/mufon/html2text/24933.html.txt","/var/www/straped/mufon/org/24933.html"],"Date of the Event":"08/02/2010 01:45 UTC","Date Submitted":"08/04/2010 04:30 UTC","Latitude":"38.76848","map":"<A HREF = \"http://maps.google.com/maps?q=38.76848,+-93.551366(24933)&iwloc=A&hl=en\"> mufon case (24933) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Case Number":"24933","Longitude":"-93.551366","Tags":"City","Summary":"Son, sister-in-law, and friend observed UFO while driving for about 5 min. before watching it land next to the road just outside city limits of Knob Noster, MO.","Object Flight Path":"Hovering then path,Path with directional change"}