{"Source":"MUFON","Summary":"Equilateral black triangle hovered over home in New Orleans LA at 3AM CST for approximately 20 minutes in Fall of 2005.","Object Flight Path":"Hovering then path","Disposition":"Unknown","trends":["There have been 5 other sightings in Metairie","There were no other sightings in Metairie on or around October 1st 2005"],"Weather Factors":"Unknown","Region":"Louisiana","City":"Metairie","Object Shape":"Triangle","Case Number":"24934","Longitude":"-90.149082","Viewing Distance":"101-500 Feet","Latitude":"29.988382","Tags":"City","divs":["Sighting DetailsAfter hurricane Katrina hit New Orleans, the city was closed for about a month. By late September I was back at my home in Metairie, LA for the first time since the storm. In early October electricity was finally restored making it possible to live in the house while I gutted it. There were few people living in their homes, so that at night the city seemed desolate. On my block, there were only 2 other homes (out of perhaps 30) with anyone living in them. Throughout those Fall months there were numerous helicopter sorties in & out of the city, most occurring during daytime hours. Helicopters of all types were in the mix - Coast Guard helos, Chinooks, Blackhawks, Hueys, even an Osprey. I would work all day, pulling drywall out & flooring, breaking up tiles... a complete gutting job. I wouldn't get to bed until the early morning hours. One night, at about 3 AM, I heard the sound of an aircraft slowly approaching my home. But it was unlike any other helicopter I had heard up until then. I hadn't fallen asleep yet, so I laid there listening to it as it came closer. Finally, it seemed as if it came to a stop as it got above my house. It just hovered there. For about 10 minutes I laid in bed listening to it & wondering why it was no longer moving. I also tried to discern what type of aircraft it was since the sound was unrecognizable. It put out a low bass tone, similar to a powerful car stereo subwoofer. It was making my body vibrate from the strength of the sound. Additionally, it was putting out a very high pitched whine, like that of a Dremel multi-tool. But the whine was even more high pitched, as if it were a 50k RPM Dremel (normal Dremels are 10k RPM). The Osprey aircraft were similar sounding but not quite the same. I decided to get out of bed, and shoo it away if I could. I was very tired from a hard day's work and I was beginning to get annoyed. When I stepped outside, in my boxers & t-shirt mind you, I walked out to the street. There was no one else around. Most of the street lights were still out from the storm. I looked up, and there above my home was what certainly seemed to be a flat black triangle shaped object. On each corner were glowing sections that glowed a blueish white. There were no other lights on the object. The lights at the tips of the triangle were not like spotlights. They were more like very bright LEDs (the light emanated out equally in all directions). For 10 more minutes (now a total of 20 minutes) I stood there looking at it trying to make out what it was. I didn't get a camera since I didn't think 'UFO' at first. It was about 150 feet over my home. It seemed to be about 100 feet long on each edge. (About half the size of my house in total volume.) My first thought was perhaps it was a 'Super Osprey'. So I looked between the lights trying to make out some kind of structure. I looked at the large 30 foot high Magnolia tree in front of my home, to look for rotor wash. There was none. I shaded my eyes trying to block out the glare, in hopes of seeing something besides the triangular shape... and still nothing. Between the lights seemed to be a flat solid and dark object. There was no motion anywhere that I could see (no rotors, no wings, no cockpit). Finally it started moving away slowly (20 mph) toward Lake Pontchartrain. I watched it for another few minutes. I went inside and I thought about it for a while trying to work out what it might be. I gave up and went to bed. I thought about it very little from then on since I could never find a plausible explanation. If it were some secret US military aircraft, why hover it 150 feet over the street in a major city? If it were an alien spacecraft, then why hover it 150 feet over the street in a major city? If it were a foreign military secret aircraft... why invade US airspace? If I was mistaken because of the glare, it would have had to be a very very large Osprey. It would also have had different proportions from the Osprey aircraft we know about, because of the equilateral nature of the shape. It wasn't until about 2 years later that I happened across a TV show about UFOs. On that show people talked about seeing black triangles. I'm as certain as one can be that a black triangle UFO is what I saw above my home that night. What it is, I have no clue. But it was triangular, equilateral, appeared to be black, had 3 glowing ends & capable of hovering."],"Sighting Duration":"Undisclosed","Date of the Event":"10/01/2005 12:00 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.988382,+-90.149082(24934)&iwloc=A&hl=en\"> mufon case (24934) map </A>","Log Number":"US-08042010-0012","Date Submitted":"08/04/2010 06:15 UTC","files":["/var/www/straped/mufon/html2text/24934.html.txt","/var/www/straped/mufon/org/24934.html"],"Country":"United States"}