{"Log Number":"US-08042010-0016","Viewing Distance":"Unknown","Country":"United States","Disposition":"Unknown","Tags":"City","Object Shape":"Circle","Object Flight Path":"Path with directional change","Summary":"I was sitting on my back deck looking at the sky & clouds. I then spotted the object between two trees. The object was about 45 degrees up from the horizon.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.17625,+-96.058755(24938)&iwloc=A&hl=en\"> mufon case (24938) map </A>","trends":["There have been 2 other sightings in La Vista","There were no other sightings in La Vista on or around August 4th 2010"],"Source":"MUFON","Case Number":"24938","files":["/var/www/straped/mufon/html2text/24938.html.txt","/var/www/straped/mufon/org/24938.html"],"Latitude":"41.17625","City":"La Vista","Longitude":"-96.058755","Region":"Nebraska","Object Features":"None","Weather Factors":"None","Date Submitted":"08/04/2010 08:43 UTC","Date of the Event":"08/04/2010 06:43 UTC","divs":["Sighting DetailsI was sitting on my back deck, which is attached to the back of my home. The deck entrance is accessed from the dining room. At about 6:43 I noticed a round object moving from North to South. The object was at about 45 degrees above the horizon. I went into the house to get my binoculars, which took about five seconds since they were just inside the sliding patio door. I located the object a second time and I was able to see it between the tops of two trees. One of the trees is about 60-65 feet tall and the other tree is about 45 feet tall. The space between the tops of the trees is about 20 feet. The object was observed again between the two trees. From my vantage point the object was about 20 feet below the top of the tallest tree and about 5 feet below the shorter tree, which put the object at about a 45 degree angle. There were not commercial or military jets in the area. I live about 7 miles from Offutt Air Force Base. The object was not an airplane, or a weather balloon. It had no wings, made no noise, left no contrail. I would estimate the altitude at about 15 - 25 thousand feet. The sky was mostly clear with a few cumulus clouds. The sun was about 45 minuets from setting and the object was reflecting the sunlight and through the binoculars I could see that it was silver, like polished metal. It was traveling a bit slower than a commercial jet or military jet. After the object went behind the second tree I could no longer see it and it did not reappear on the other side of the second tree. My conclusion is that it must have changed directions after I could no longer see it."]}