{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.963002,+-121.2895(24931)&iwloc=A&hl=en\"> mufon case (24931) map </A>","Date of the Event":"08/03/2010 09:00 UTC","Object Features":"Unknown","Longitude":"-121.2895","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsLast night my wife and I went outside in our back yard to see if there was a chance we could see the northern lights that the news had been talking about. I know I have made a lot of reports to MUFON since the 4th of July but we keep see these objects flying over our house. At 9pm I saw a light moving thru the tree in our front yard and as it came into view at the top of the tree I saw it was the same orangish hot metal looking object that we have seen in the past (4 on July 4th and 2 on July 23rd and maybe 6 from a differant view point on the 30th of July). I told my wife look there is another one. The object was about 500ft up coming from the west heading east.It looked to be about the size of a suv. As it came over the house this time it slowed and almost came to a stop. It then went stright up and got dimmer as it went up. It looked like it went up about 500 to 800 ft higher than it was. Again we could see a kind of see thru glowing grey sphere around the object and what looked like a disc shape inside. It then started moving east again and we watched it until we could not see it anymore. I took photo but I can not keep camera still so all you see is zig zag lines of light. I will keep trying when and if we see more. I don't know if this means anything but I felt fine before the sighting but right after sighting I had a need to go to the bathroom real fast and my stomach was knoted up for about a half hour after then I was fine my wife had no problems. We do not know what these things are or what they are doing but we seem to be seeing a lot of them. They do not seem to be of this world."],"Source":"MUFON","Summary":"1 object same as earlier reports low over house.","Date Submitted":"08/04/2010 01:39 UTC","Disposition":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"California","City":"Stockton","trends":["There have been 25 other sightings in Stockton","There was one other sighting in Stockton on or around August 3rd 2010","This sighting has never been favorited.",""],"Country":"United States","Object Shape":"Fireball, Oval, Sphere","Latitude":"37.963002","files":["/var/www/straped/mufon/html2text/24931.html.txt","/var/www/straped/mufon/more/24931_submitter_file1__8-3-2010ufo001.JPG","/var/www/straped/mufon/more/24931_submitter_file2__8-3-2010ufo002.JPG","/var/www/straped/mufon/more/24931_submitter_file3__8-3-2010ufo003.JPG","/var/www/straped/mufon/org/24931.html"],"Weather Factors":"None","Log Number":"US-08042010-0009","Sighting Duration":"Undisclosed","Case Number":"24931"}