{"Source":"MUFON","Tags":"City","Longitude":"-78.716113","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.489152,+-78.716113(24944)&iwloc=A&hl=en\"> mufon case (24944) map </A>","Latitude":"40.489152","Country":"United States","Date of the Event":"07/25/0001 03:45 UTC","Case Number":"24944","Log Number":"US-08042010-0022","divs":["sighting detailsi was leaving late in the night, 3;30 am, to go on vacation and was only on the highway for 2min when i saw a green light in the sky. i could see that it was spinning b\\c the light was rotating and could make out a small disc shape. it was pretty far away and the way it moved was strange. it flew very fast at first i thought it was a meteor, but it flew straight then down towards earth. my fiance was in the passenger seat and witnessed it as well. she started to freak and actually cried a lil, i also felt that urge and barley held it in. the feeling after seeing it is so hard to describe but it was fear and fascination. the way it was moving and the colors ment it had to be a craft of some sort but judging by the speed it couldnt have been anything human. where it flew down was about 2miles away and was in an area that is woods in between towns. it only lasted about 5 seconds and i could have easily mised it. i am glad my fiance saw it as well b\\c she would have never believed me. there was nothing in the papers about anything in the sky so what could it b. i never doubted other life than on earth, i mean think about the universe, how huge it is and think if a civilization had a million years of evolution more than us. i believe!"],"Viewing Distance":"Unknown","Date Submitted":"08/04/2010 11:58 UTC","City":"Ebensburg","Weather Factors":"Unknown","Summary":"Spinning green light very fast that flew straight then dived to ground.","Region":"Pennsylvania","Object Features":"Undisclosed","Object Shape":"Circle","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Ebensburg","There were no other sightings in Ebensburg on or around July 23rd 0001"],"files":["/var/www/straped/mufon/html2text/24944.html.txt","/var/www/straped/mufon/org/24944.html"]}