{"Weather Factors":"Unknown","divs":["Sighting DetailsWell i was leaving my uncle's house around 10:30pm central time. I made my way to I-20 heading west, as soon as I found my lane trying to get into the middle lane , I immediately noticed the light directly in front of me well above the horizon but not high enough for me to have to peek up out of my windshield. Not wanting to be a bad driver I asked my girlfriend and brother what is that ? They responded looks like an airplane so by then i had reached my exit to head south on 360 on the overamp i took another glance at it and said are sure thats a plane it has no blinking lights none of the signs that screams im an airplane ! i then tell them stressing \" keep your eyes on it dont loose it \" it only takes 7 minutes to get back to my house exiting off of 360 i turn west on to my road. And the object was perfectly positioned in between the trees down the street, now that i had focused in on it and the trees are moving past me i was asking my brother and girlfriend if it was moving, no one could tell because of the cars movement. So i pulled over next to a junior high facing west behind the school I parked and turned off the car i was really excited and anxious to get some references to make some decision as to what it could be. Well i got it cause it was right over the tree line and sure enough it's movements were little left , then up ,little right , back up , freeze , at one time it started coming back towards the south east but watched it gain altitude a bit and resume course back north west. Overfilled with a rush i hopped back in the car went straight for my ladder and got on the roof with my brother we observed this light change it's colors by swirling a red from our left to our right followed by periods of orange then white it stayed a steady course for over a half an hour in between it would go dim then go out completely then reappear. I thought to myself after it had reappeared this is the real thing i point at all the planes and stars around for comparison all flights that go into DFW Airport come over and around my house i saw three planes make there way across the sky and disappear before i even lost sight of the object over the trees no telling how long it was there it was 10 til midnight when i went inside the house to collect my thoughts it wasnt till the next morning that i wondered if anybody else saw it and thats when i ran across this site"],"Log Number":"US-08042010-0019","Viewing Distance":"Unknown","Disposition":"IFO","Date Submitted":"08/04/2010 09:00 UTC","files":["/var/www/straped/mufon/html2text/24941.html.txt","/var/www/straped/mufon/org/24941.html"],"City":"Fort Worth","Latitude":"32.733339","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Source":"MUFON","Case Number":"24941","Region":"Texas","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around August 2nd 2010"],"Date of the Event":"08/02/2010 10:42 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.733339,+-97.3135(24941)&iwloc=A&hl=en\"> mufon case (24941) map </A>","Longitude":"-97.3135","Summary":"An orangish sphere slowly moved northwest across Dallas/Ft. Worth swirling bright red and white light around its surface.","Object Flight Path":"Undisclosed"}