{"files":["/var/www/straped/mufon/html2text/24945.html.txt","/var/www/straped/mufon/more/24945_submitter_file1__angelcloud2.jpg","/var/www/straped/mufon/more/24945_submitter_file2__angelcloud1.jpg","/var/www/straped/mufon/more/24945_submitter_file3__angelcloud.jpg","/var/www/straped/mufon/org/24945.html"],"Date of the Event":"07/30/2010 07:30 UTC","Case Number":"24945","Object Flight Path":"Stationary,Hovering then path,Path with directional change","City":"Fort Wayne","divs":["sighting details\"a\" and i were going down bluffton road headed south by quimby village plaza. she saw a cloud formation that looked like an angel but could not get a good picture from where we were at. *(wit's name deleted--sgonzalez\\cms) was using her cell phone to take the picture,so i pulled into the parking lot and drove over to where we could both get a better view. we both stared at the cloud formation in wonder as she started taking some pictures.the clouds looked like an angel holding a scepter with smoke coming out of the end. it could have been 5 to 10 minutes that we sat there and maybe 15 seconds worth of pictures. she took the pictures as soon as we parked by the restaurant. we sat there for a few minutes and then went home. she wanted to download the pictures into the computer as soon as we got home,but it did not work out that way. as soon as we awoke saturday morning she downloaded the pictures,wow what a surprise, we looked at each other in amazement.we saw an orb shape, just above the scepter and one above the light fixture in the background. as you look at the scepter you can see what appears to be a cone shape coming out of the end of scepter and going into the sky.the orb grows in size but the one above the light does not, at one point the orb moves from side to side and moves into the cone. you can see from the photo what appears to be some sort of orangish-colored disc with the orb that has moved into the cone. then the orb fades into the sky and reappears and when it reappears its brighter and larger in size and the smaller one by the light has disappeared. if you look closer at the picture you can still see the cone coming from the end of the scepter.to our surprise you can see an orangish- colored disc also, close to the top of the page within the cone. those were the only pictures we took because the formation began the dissapate. we have several more photos of the ufo than what are allowed to be sent here. they are all time-stamped and taken within seconds of each other in order. the ones sent in are the last 3 photos taken."],"Latitude":"41.081743","Sighting Duration":"Undisclosed","Region":"Indiana","Longitude":"-85.137871","Log Number":"US-08052010-0001","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around July 30th 2010","This sighting has never been favorited.",""],"Weather Factors":"None","Object Shape":"Cone, Sphere, Other","Date Submitted":"08/05/2010 12:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.081743,+-85.137871(24945)&iwloc=A&hl=en\"> mufon case (24945) map </A>","Tags":"City","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Summary":"Saw a UFO while taking a couple of pictures of a cool cloud formation that looked like an angel."}