{"trends":["There have been 3 other sightings in Knob Noster","There was one other sighting in Knob Noster on or around August 3rd 2010"],"Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/24940.html.txt","/var/www/straped/mufon/org/24940.html"],"Latitude":"38.77172","Region":"Missouri","Object Features":"Undisclosed","Country":"United States","Case Number":"24940","Weather Factors":"Unknown","City":"Knob Noster","Longitude":"-93.551136","Object Shape":"Chevron, Triangle","Tags":"City","Date Submitted":"08/04/2010 08:57 UTC","divs":["Sighting DetailsAfter hearing of my younger sons encounter the night before, my older son, his friend, and myself went to the same place outside of town to see if we could see anything. We got there at about 9 pm just as it was getting dark. Skies were very clear and could many aircraft flying for miles around us. We were predominately looking west out of Whiteman AFB and the town of Knob Noster. After about 15 min. i stood up from my chair to look around and noticed two planes flying together at low altitude approaching from the east, over by Sedalia. The two planes continued west to a point souht of the base then turned 90 deg. to the north at which point they started gaining altitude. I originally thought they were on approach but they should have been descending not ascending. they continued to a point just north of the base and the town at which point they made another 90 deg. turn to the east. The boys had been looking in this direction and had noticed nothing. When the planes made their turn to the east i looked almost directly up and a little north out in front of them a fair distance and noticed a huge dark triangle or chevron shaped object with 3 pale orange lights (NOT A B2 BOMBER) heading to the east almost directly over 50 hwy at medium to high altitude. The object made ZERO noise. The two planes sped up and gained on the object and it was obvious that they intended to follow. The object then sped of slowly and stayed out in front. We could see very well and followed the progress of both the object and the planes as they flew east to a point somewhere north of Sedalia and perhaps beyond.The two planes had very bright flashing lights like most of the military aircraft here at the base. The airplanes disengaged at that point and we followed their progress back to the base where they landed. It wound up being two A 10 Warthogs. Looking back towards the north side of the Sedalia lights we noticed several aircraft flying at medium altitude with the same distinctive bright flashing lights. The object was no longer visible at this point. At this point the three of us were on the phones telling various people of what we had seen. My son's friend called his girlfriend who lives in Knob Noster and told her we saw a UFO at which point she told him that she had just seen one above the trees just on the southside of town. She described the exact same object that we saw without Matt having told her what our object looked like. After about ten minutes a few more high schoolers showed up along with one of their mothers. After another 5 min. I was pointing out to her where we had seen it and spotted another one coming from the west but farther north than the first. This one appeared to be following a plane instead of being followed. They continued to almost the exact same spot north of Sedalia as the first. At this time we noticed between 10 and 14 aircraft stacked at different altitudes at this spot. The object appeared to split in two with one part going north and one part going south, but it was very far away at this point and hard to tell exactly what we were seeing. We then observed a plane leave that area and head in our direction where it immediately landed. Another A 10. Then we observed two more leave that area heading west in our dirction where they also landed. Two more A 10's. Then the same thing, then two more A 10's. For a total of seven. While all this was going we noticed 2-3 helicoptors orbiting a large area west of the base, roughly over Knob Noster State Park. Having lived in Knob Noster for the last 20 years, i can say that it is very unusual for helicoptors to be operating here at the base during night time hours, but i have seen it. Maybe only once or twice though. After another hour or two we noticed no more planes north of Sedalia, no more helicopters. Then roughly half an hour after all that died down a B2 came in on approach, did a couple of touch and go's, then finally landed. Not standard practice at this base in my opinion. Touch and go's are normally done back to back to back with small orbits. Have never seen a B2 come from somewhere distant, do a couple touch and go's then land. If they have been somewhere doing something, they simply land and taxi. All aircraft landed without the flashing landing strip lights being on which is also unusual. Normally when the aircraft are landing the base has the blue flashing landing lights on. They did turn them on for about 30 seconds between the A 10's but then turned them back off and left them off. Also while this was going we noticed ZERO commercial aircraft in the air. We had been seeing them, but after the first object we saw no more till perhaps 230 am. Then we saw them in every direction. Just an observation. We are going back out tonight."],"Summary":"Observed military aircraft chasing triangle shaped object at medium altitude for roughly 5 min. then observed second object following aircraft.","map":"<A HREF = \"http://maps.google.com/maps?q=38.77172,+-93.551136(24940)&iwloc=A&hl=en\"> mufon case (24940) map </A>","Date of the Event":"08/03/2010 09:30 UTC","Log Number":"US-08042010-0018","Disposition":"Unknown"}