{"Weather Factors":"None","Longitude":"-117.90534","Disposition":"IFO","Summary":"Silent dark V-shaped object.","Case Number":"24949","Latitude":"33.976124","Tags":"City","Log Number":"US-08052010-0005","trends":["There have been no other sightings in Rowland Heights","This sighting has never been favorited."],"Date Submitted":"08/05/2010 04:00 UTC","City":"Rowland Heights","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24949.html.txt","/var/www/straped/mufon/org/24949.html"],"Object Shape":"Other","Object Features":"Other","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.976124,+-117.90534(24949)&iwloc=A&hl=en\"> mufon case (24949) map </A>","divs":["Sighting DetailsMonday night a friend and I were out on my driveway talking and star gazing when my friend Robin saw something to the West of us approaching along a straight contolled path traveling in an Eastern direction. At first I could not see what he was talking about in the night sky. When he told me to look straight up and that it was about to pass above my car as the reference point I saw it. The night sky was very clear dark. The object was a distinct V-Shape, very dark in color making absolutely no sound. It appeared to be dark grey, just slightly lighter than the sky making it visible to us. It blended in very well, but due to the color difference we could see it clearly once we could locate it and follow it with our eyes. The shape was the only distinct characteristic. The surface looked lumpy not smooth like a stealth bomber. I thought it was flying pretty low in comparison to the many planes that pass over my house on a regular basis as they approach LAX. It flew at a constant speed, which didn't seem very fast, so we were able to track it for a couple of minutes before we lost sight of it. As the city lights caused the sky to be lighter further to the East the craft blended in completey leaving us to loose sight. The UFO had no lights, and the shape was a much tighter V then the shape of the B-2 stealth. I assume it was a military plane of some sort, but the scarry thing is, I don't really know what we saw."],"Date of the Event":"08/02/2010 10:30 UTC","Country":"United States","Region":"California","Sighting Duration":"Undisclosed"}