{"Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"24943","trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around August 4th 2010"],"Summary":"4 cigar UFOs within half an hour right above my house!!!","Date Submitted":"08/04/2010 11:16 UTC","Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=36.33599,+-94.115067(24943)&iwloc=A&hl=en\"> mufon case (24943) map </A>","divs":["sighting detailsi was standing outside helping the family with yard work. it was about 8:00 pm, still pretty bright out. i happen to look up and see a cigar ufo off in the distance heading west. it was already really far away so it dissapeared out of sight fairly quick. i was curious, but since it was already gone i just dissmissed it. then about not even 5 min later, right above my house heading south-east another one appears moving slowly through the air. i was astounded for that was the second one i had seen today. not to mention the one above my house last night. anyway, as the second cigar ufo vanishes into the south-eastern horizon i start to wonder why i've seen so many in a short time. as i'm deep in thought i see another cigar ufo heading in the exact opposite direction of the second one. this would be the third cigar ufo. i get the bright idea, considering this one was fairly low in the sky, to whistle and wave my arms in the air at it. i continue this, getting more loud in volume untill the front end of it lights up bright red as if saying \"hello! i'm waving back at you!\" and just as this happens another cigar ufo appears only a couple hundred feet behind the the third one. they are on the same path in sky. this fourth one is following the third with strange precision. this whole event just quite literally blow my mind. as a ufo hunter, i've learned that cigar ufo's are a pretty rare occurence, but in the past two days i've seen 5!!!!! i have a picture that i can't post on here because i want to enlarge it for a better veiw. if you have any questions or comments please contact me at [email deleted\\cms\\tg] or my home phone number [phone number deleted\\cms\\tg]. i will also be doing a sketch of the pattern and behavior of the ufo. to all you ufo hunters out there \"good luck and keep your eyes on the skies!\""],"Log Number":"US-08042010-0021","files":["/var/www/straped/mufon/html2text/24943.html.txt","/var/www/straped/mufon/org/24943.html"],"Weather Factors":"Unknown","Tags":"City","Object Features":"Window(s), Patterned Surface","Latitude":"36.33599","Date of the Event":"08/04/2010 08:15 UTC","Country":"United States","Longitude":"-94.115067","Object Shape":"Cigar","Disposition":"Insufficient Data","City":"Rogers","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile"}