{"Sighting Duration":"01:59:00","Viewing Distance":"Over One Mile","Longitude":"-96.638883","Case Number":"2494","Region":"Texas","Date of the Event":"01/22/1988 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.912624,+-96.638883(2494)&iwloc=A&hl=en\"> mufon case (2494) map </A>","Object Shape":"Sphere","Tags":"City","Log Number":"","City":"Garland","divs":["Sighting DetailsI was riding home with my friend Jeff Farr in his pickup truck. He asked mewhat was that light in the sky behind us, and I looked behind us and saw abright light hovering in the sky behind us. It would bend as the road bendeduntil we got to my brothers apartment. At first, I thought it was Jesus Christcoming to us. I was on cloud nine, I was so excited. I had been on vacation in1986 to Acapulco, Mexico. We, my mother and sister and I were staying at thePrincess Hotel. It was around the same time of the sighting, around 330 am and Icouldnt sleep so I had gone down to one of the swimming pools and laid down on alawn chair and just started talking to the sky. Saying things like If anyonecan hear me show me a sign I mean you no harm, I want to meet your people Iwant to go to your planet. Nothing ever happened that morning. When we saw thelight two years later I just knew it was because I had summoned them to come. Iimmediately ran upstairs to get my brother to come and see this huge brightlight. Jeff stayed downstairs in the truck. I ran into my brothers room andturned on his light and said, Bubba, Bubba, please get up and come out here andlook at this, I dont know what it is but you gotta see it its a huge light inthe sky He said, shut up and turn off the light. I said Bubba, please come outhere, I dont know what it is He said, Shut up youre going to wake up the ___damn neighbors now get out of here and turn off my light. I said _____ youthen, dont come out here and look at it, Im going back out here to see what itis When I got downstairs Jeff was still staring at it. I told him I needed somecigarettes so we drove up to the store at the corner. I tried to get the clerkat the store to come out and see it but he thought I was crazy too. So I jumpedback in the truck. The light was above us hovering, it had followed us andevery curve on the way to the store and back from the store it just followed andhovered. When we got back to my brothers apartment, there was my brotherstanding there in his houserobe just looking up star"],"Weather Factors":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2494.html.txt","/var/www/straped/mufon/org/2494.html"],"Country":"United States","trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around January 22nd 1988"],"Source":"MUFON","Summary":"All I can say that I saw was a light","Disposition":"Unknown","Object Flight Path":"Unknown","Latitude":"32.912624","Date Submitted":"01/22/1988 03:30 UTC"}