{"Source":"MUFON","Log Number":"US-08052010-0013","Sighting Duration":"00:33:00","trends":["There have been 3 other sightings in Keene","There were no other sightings in Keene on or around October 31st 2008"],"Country":"United States","Date Submitted":"08/05/2010 05:03 UTC","Weather Factors":"Unknown","Case Number":"24957","Viewing Distance":"101-500 Feet","Tags":"City","Longitude":"-72.272371","map":"<A HREF = \"http://maps.google.com/maps?q=42.939702,+-72.272371(24957)&iwloc=A&hl=en\"> mufon case (24957) map </A>","Latitude":"42.939702","files":["/var/www/straped/mufon/html2text/24957.html.txt","/var/www/straped/mufon/org/24957.html"],"Disposition":"IFO","Object Shape":"Triangle","Object Features":"Other","divs":["Sighting DetailsIt all started in the spring of 2006 when i found a new place to go 4 wheeling with my truck. I would go down by a little pond and just sit there with my wife at the time she showed me this place. and she called it creepy woods she had been going there for years she said she felt offten times something was'nt right about the place. and she was right! I could always sence the preasance. of something not animal and i knew it was'nt human and i was at peace with it.I just knew there was something.beoned anything i had ever seen. we would go down there almost every nite with the dogs to let them swim in the pond and there were many times the dogs would be skidish.and the sence of being watched was very strong. very few times did it seem right.the road geting to the pond is not maintained in the winter.we would stay out there until way after dark some times until 1-2 am she would not spend much time looking up into the sky but i did and when i saw lights moveing across the sky and flying low and no noise. I would tell her look and she would say what is it.I'd reply more importently why is that heilocopter following it. then she would say i want to go home and we would. this has ben going on for me for 2 and a half years.then on halloween eve. 2008 we decided to go drive around the woods. when we got to the power lines i looked to my left and said look at that about 1.5 miles out just above the power lines there was a bright light it looked almost like a star and i said noway it was following the power lines about 10ft. above the tree lineand moveing very slowly and when i looked past the light i could see 2 fighter jets in attack formation,they could have been f-16s from a base in the stae of vt. or A-10s from MA. when i first saw the light i stoped my truck and backed up to the edge of the power lines.and shut the truck off then we could ear a helicopter that cut in front of the light and went behind us it stayed at about our 7:00 O'colck and stayed there as the light got clsoer i could look into it and saw that it was 3 lights i could it was long and i could see 2 seperateers makeing it 3just behind and to the right and left there were 2 green lights. and i could make out the steel like cage around then they were about mid ship. and to the outer ends at the aft there were 2 red lights. with the same cage around them. it was a huge black triangle and all 3 corners were rounded it had to be atleast 60-80ft. each side i know this because i got out of my truck and got up into the backwhen it was at my 10 Oclock it slowed down even more so i could get a good look. it was a calm evening no breeze and the tops of the trees didnt even move. my wife wouldnt get out of the truck she said she couldnt move she was that scared,while this was going on i could here the heilocopter comeing around and when the ship was at my 1-O'clock it made a flat left turn. and at the same time the heilocopterwas at my 1-O'clock it was all black with no markings. it was so close i could make out the one pilot and when he saw me and he did he made an agresive hard left turn toward the craft it inturn jumped up like it was sitting on one corner and i could see that the top of the craft was flat and very smoth the whole craft was like black gunblueing not shiny not dull then the craft came down flat I could see the craft and heilocopter at the same time i didnt blink my eyes and the craft was gone and the heilo in slow persute.then we went down to where the road to creepy woods starts to the turn around i backed in and got out to relieve my self and befor i could get back into the truck we saw the heilocopter fly over our heads. we looked at each other and said at the same time this has happend befor many times in the last 2.5 years whether out at the pond or at the turnaround that heilocopter is always around and now we knew why.it was almost dark when we got to the turnaround, and as i was geting into my truck i said look at that straight ahead into the woods we could see the green and red lights but no head lights and it was very low. and as i was geting ready to start the truck. Ilooked up and out of my windshield and about 40-50ft. into the woods about 15-20ft. off the ground was a 4-5ft.diamiter orb and it was an amber color with the strangest lights inside it like lightening? from the time we left the power lines until we saw the orb. was about 2miles deeper into the woods. I knew and i was right it was just a matter of time and it is still going on out there, you can not just look at the sky you have to look at the ground and you can see the signs there everywhere. thank you for you'r time in this matter. we do know what we saw and I know they are still there and will be for some time to come.ps. after we saw the orb. we decided it was time to go home and we did"],"Summary":"I was driving through the woods as I always did and while going under some power lines I could see a low flying light it headed my way it was awsome.","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Keene","Region":"New Hampshire","Date of the Event":"10/31/2008 06:57 UTC"}