{"files":["/var/www/straped/mufon/html2text/24953.html.txt","/var/www/straped/mufon/org/24953.html"],"Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsI was out watering the front yard and looked up to the west and spoted a plane flying in southernly direction. The plane was crossing underneither what I suspect was Venus. The time was 9:35p (approx as I backed into the event time after). I was tracking the plane with my eyes when I spotted a light moving in the other direction but way further up. I thought this was possibly a satalite or something. After about 3 seconds the light disappeared completely. I then spotted a second light 10 degress lower to the horizon and about 5 degresss to the left, this light was moving much faster in a similar direction to the first. Then the first light appeared again stationary. then the second light changed direction with a sharp 45 degree angle to the west and took off at great speed. Both the first and second now stationary object disappeared. I called my daughter out to the firnt yard and we continued to scan the area of Venus but duid not see anything out of the ordinanry after a few minutes. I thought the entire event was strange and it left me with a sinking feel that I had just witnessed something unussual. I said to my daughter afterwards that I might have been witness to a UFO sighting."],"Date Submitted":"08/05/2010 11:24 UTC","Latitude":"45.499004","Source":"MUFON","Region":"Oregon","Longitude":"-122.863005","trends":["There have been 2 other sightings in Aloha","There were no other sightings in Aloha on or around August 4th 2010"],"Object Features":"Unknown","City":"Aloha","map":"<A HREF = \"http://maps.google.com/maps?q=45.499004,+-122.863005(24953)&iwloc=A&hl=en\"> mufon case (24953) map </A>","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"08/04/2010 09:35 UTC","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Case Number":"24953","Object Flight Path":"Stationary,Path with directional change","Summary":"I saw a couple of lights in the sky moving in impossible ways.","Log Number":"US-08052010-0009","Weather Factors":"Unknown"}