{"Country":"United States","trends":["There have been 2 other sightings in Gladstone","There were no other sightings in Gladstone on or around August 5th 2010"],"Object Features":"Undisclosed","divs":["Sighting DetailsThe aircraft was triangular, with a triangular light at each of the tips. It flew in from the south, heading north and made a slight banking maneuver but continued on it's course. It flew sooooo low, I really didn't even believe what i was seeing. It was absolutely silent but was very bright, but plain as day. I was standing In my driveway smoking a cigarette as I usually do about this time of night before bed, I like seeing shooting stars and lately, have noticed a lot of what appeared to be stars or satellites so I was just out watching like normal. The thing appeared out of nowhere and really almost gave me a heart attack. This thing was much faster than a plane flying overhead. It was so fast it appeared to leave tracers in its path. My heart about jumped out of my chest and I really don't even know what to think anymore, about anything! I called the FAA because that's the only thing I could think of, and the guy said he would get in touch with the local FAA or whoever and see what was going on. I am so freaked out right now, I really think I need to talk to someone or something, I just think they would think I was crazy for what I saw. I 100% know that I saw it. I have never beem more sure about anything before in my life. I even ran along the tree line so I could watch it for as long as I could. It just happened so fast, I had no time to do anything except for yell \"OH MY GOD! PLEASE TELL ME THIS ISNT HAPPENING AND THIS IS FAKE\" but I know it wasn't and infact, within a few short minutes, I saw an airplane flying in the vacinity of the craft almost as if they were up there looking for something, Please get back to me and tell me I wasn't the only one who saw that. There is no possible way that I was the only person in this whole state that was looking up at that time."],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Case Number":"24952","City":"Gladstone","map":"<A HREF = \"http://maps.google.com/maps?q=45.380676,+-122.594814(24952)&iwloc=A&hl=en\"> mufon case (24952) map </A>","Date Submitted":"08/05/2010 07:25 UTC","Log Number":"US-08052010-0008","Summary":"Gigantic compared to a plane in the sky, absolutely silent, flew extremely low and kept going until I couldn't see it anymore.","Tags":"City","Object Shape":"Triangle","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24952.html.txt","/var/www/straped/mufon/org/24952.html"],"Region":"Oregon","Latitude":"45.380676","Source":"MUFON","Disposition":"Unknown","Longitude":"-122.594814","Date of the Event":"08/05/2010 03:10 UTC"}