{"Source":"MUFON","Date of the Event":"07/06/2008 12:00 UTC","Region":"Oregon","Latitude":"45.151941","City":"Woodburn","Summary":"Large triangle shape with three white lights.","trends":["There have been 5 other sightings in Woodburn","There were no other sightings in Woodburn on or around July 6th 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Longitude":"-122.847392","Disposition":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"24958","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsAround 8pm on July 6th I noticed three white lights flying very low coming from the south in the direction of Gervias Oregon. I was very excited to see something so out of the ordinary, I immediately ran in my house to grab my wife, so she could witness the event, as we exited the house we immediately looked up and to our amazement the object flew directly over us. At this time we became concerned because of the altitude that the object was at but more important we were surprised to hear no sounds coming from the object. I am not sure on the dimensions of the object but I can say that it took about 15 to 20 seconds for the entire object to fly over us. The object had three white lights, one light on each end. We have notice a large amount of sky activity in our area. Since this event we have seen several objects that we consider unusual. In the area we live in we have a clear line of site, low city lights and open acres, ideal for sky watching. We have not spoken of this until today, but we believe it is of great significance."],"Date Submitted":"08/05/2010 05:20 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/24958.html.txt","/var/www/straped/mufon/org/24958.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Log Number":"US-08052010-0014","map":"<A HREF = \"http://maps.google.com/maps?q=45.151941,+-122.847392(24958)&iwloc=A&hl=en\"> mufon case (24958) map </A>"}