{"Summary":"Very fast blinking star shape with right side protruding out to sharp point. Every 3rd blink or so would project extra blinks of lights from the longest sharpest point.","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.396706,+-104.520944(24950)&iwloc=A&hl=en\"> mufon case (24950) map </A>","Log Number":"US-08052010-0006","divs":["sighting detailsmy husband & i were traveling nw on hwy. 285 n. of roswell, n.m. approx. 10 mi. or so out of town is when i saw this blinking star looking light. my husband was sleeping and it was approx. 1 a.m. at 1st thought it was a plane then realized was too low (above power lines) it was not moving. then i was trying to rule out in my mind perhaps it was a cell tower of some sort and then the flashes extended away from main star like flash of light, but just instantly there were 2 extra flashes beyond the main flash. as i drove closer the blinking light was consistant. when i was approx. 10 blocks away the blinking light shot at incredible speed towards us and as i watched it and looked out the window it appeared like a set of wings on a plane with two large lights on each side and a cone shape center. i tried to wake my husband by telling him i think i am seeing a ufo, but he did not wake up and as i slowed down it vanished. i looked in the rearview mirror and the sky was pitch black - no lights. i passed a semi truck shortly after and went another 30-40 miles and by this time the semi truck was probably a 1\\2 mile or more behind me. i looked in my rearview mirror and saw the semi truck headlights and that exact same star shape blinking light above the semi truck lights. i wanted to pull over to the side of the road when the object approached us earlier before i saw the light again above the semi, but realized we are out in the middle of nowhere, pitch dark and just had a weird feeling that this would not be in our best interest."],"Longitude":"-104.520944","Latitude":"33.396706","Object Features":"Dome, Wings","Region":"New Mexico","Case Number":"24950","City":"Roswell","files":["/var/www/straped/mufon/html2text/24950.html.txt","/var/www/straped/mufon/org/24950.html"],"trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around August 4th 2010"],"Tags":"City","Object Shape":"Flash, Star-like, Other","Disposition":"Insufficient Data","Date of the Event":"08/04/2010 01:00 UTC","Date Submitted":"08/05/2010 04:54 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed"}