{"Tags":"City","Object Shape":"Disc, Oval","Source":"MUFON","City":"Bardstown","map":"<A HREF = \"http://maps.google.com/maps?q=37.817738,+-85.463702(24955)&iwloc=A&hl=en\"> mufon case (24955) map </A>","Region":"Kentucky","Country":"United States","Object Features":"Patterned Surface, Unknown","Weather Factors":"Lightning, Rain, Light","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/24955.html.txt","/var/www/straped/mufon/more/24955_submitter_file1__DSC03373.JPG","/var/www/straped/mufon/more/24955_submitter_file2__DSC03374.JPG","/var/www/straped/mufon/more/24955_submitter_file3__DSC03375.JPG","/var/www/straped/mufon/org/24955.html"],"Longitude":"-85.463702","Date Submitted":"08/05/2010 01:47 UTC","Latitude":"37.817738","Date of the Event":"08/04/2010 12:00 UTC","Log Number":"US-08052010-0011","Disposition":"IFO","divs":["Sighting Details My Girl friend went outside to take some pictures of a storm coming in. She took three photos right within 1 minute of each other. I will post all three photos as a time line. The second photo has a faint circle in the middle of some rain in the distance, resembling the shape of the object in the third photo. In the third photo taken just mere seconds later there is a prominent object in the top right corner of the photo. The Camera use is a DSC-W80 Sony Cybershot, and the camera was set to auto focus. We have taken many thousands of pictures with this camera and never seen anything resembling a orb or strange object. I truly believe this object is real. The photos have been untouched. She went outside to take photos at around 6:30PM. After taking the pictures she loaded them to the computer to look at in higher resolution. She told em to come over and look at them and the object jumped out to me. She then was freaked out and started to call her mother to tell her. Looking at the object under high magnification does not resemble any flying object I have ever seen. It looks like a oval separated by rivets on on the top and bottom of the craft with a glowing orange-red light in the middle of the rivets. We have looked at these photos repeatedly now and cannot come to an answer. We are not sure what it is."],"Sighting Duration":"00:00:30","trends":["There have been 4 other sightings in Bardstown","There were no other sightings in Bardstown on or around August 4th 2010","This sighting has never been favorited.",""],"Case Number":"24955","Viewing Distance":"Over One Mile","Summary":"Taking pictures of storm and captured UFO."}