{"Tags":"City","Disposition":"Unknown","trends":["There have been 13 other sightings in Greensburg","There were no other sightings in Greensburg on or around August 4th 2010","This sighting has never been favorited.",""],"divs":["sighting detailslast night at 9:47 p.m. in decatur county , indiana (08\\04\\10 ) i was watching the cloud to cloud lighting that was caused by the solar flares when i spotted a light coming in that looked eerie , i immediately yelled for my wife, she ran out to join my on our upstairs balcony. it was steadily coming straight towards us, without a sound not following nor preceding....silent! but what i found the craziest was the feeling in my gut and back and legs, i felt vibrations internally i cannot begin to describe the feeling! anyway this thing is maybe 100-150 yards above the corn field and steadily heading directly over our heads we both look up in amazement and hold each others hands...the whole time my 3 yr old daughter standing in the doorway watching... as these lights moved closer, we both knew it wasn't a vehicle of any sort that we have seen before. brightest lights at it's point of direction , with a tiny blue light one either sides of the lead point and the eerie glow of the two corners that had lights but weren't as piercing as its head point. it was obviously triangle the background being illuminated by cloud 2 cloud lightning, this was a steadily approaching triangular craft that had 4-5 lights in the center that were illuminated in different grades of firey red, it did'nt spin at all like always imagined...so after it flew directly above our heads we ran out the other side of our place to watch it leave, it left as it came silent, and steady..."],"Date Submitted":"08/05/2010 05:56 UTC","Country":"United States","City":"Greensburg","Weather Factors":"Unknown","Latitude":"39.341572","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/24959.html.txt","/var/www/straped/mufon/more/24959_submitter_file1__stage1.jpg","/var/www/straped/mufon/more/24959_submitter_file2__stage2.jpg","/var/www/straped/mufon/org/24959.html"],"Case Number":"24959","Date of the Event":"08/04/2010 09:55 UTC","Sighting Duration":"00:00:30","Longitude":"-85.475161","Summary":"Triangle, silent, not spinning or fluttering as it comes near. 4-5 red lights at different intensity of red.","Object Flight Path":"Straight-line path","Source":"MUFON","Viewing Distance":"101-500 Feet","Region":"Indiana","Log Number":"US-08052010-0015","map":"<A HREF = \"http://maps.google.com/maps?q=39.341572,+-85.475161(24959)&iwloc=A&hl=en\"> mufon case (24959) map </A>","Object Shape":"Triangle, Unknown"}