{"trends":["There has been one other sighting in Filey","There were no other sightings in Filey on or around August 4th 2010","This sighting has never been favorited.",""],"Longitude":"-0.288724","files":["/var/www/straped/mufon/html2text/24962.html.txt","/var/www/straped/mufon/more/24962_submitter_file1__PIC_0321.JPG","/var/www/straped/mufon/more/24962_submitter_file2__PIC_0322.JPG","/var/www/straped/mufon/more/24962_submitter_file3__PIC_0323.JPG","/var/www/straped/mufon/org/24962.html"],"Region":"England","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsWhilst returning back to the campervan we saw a strange orange light in the sky, we thought that it could have been a plane, we then realised it wasn't, and then suddenly without any signs of a sudden manouver it flew up into the air and dissapeared into the clouds. In some amount of shock we made are way into the campervan and sat down, and then we noticed that another strange, brighter light had began to move in the same path as the other, almost as if it was following it and then as the previous object it flew up into the sky and dissapeared behind the clouds. After looking at the photographs that we had taken of the objects we noticed that there was a third strange red disc shaped object above the others. As the second orange object passed my wife's mobile phone lit up as if she was recieving a message or phone call, but nothing was on the screen. We then looked at the clock and noticed that it had lost 5 hours."],"map":"<A HREF = \"http://maps.google.com/maps?q=54.219506,+-0.288724(24962)&iwloc=A&hl=en\"> mufon case (24962) map </A>","Date Submitted":"08/05/2010 06:25 UTC","Disposition":"Unresolved","Tags":"City","Case Number":"24962","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"08/04/2010 09:15 UTC","Viewing Distance":"Unknown","Country":"United Kingdom","Sighting Duration":"00:01:00","Latitude":"54.219506","Object Shape":"Circle","Summary":"One orange light appeared and suddenly rose up into the sky, and the other followed its pattern.","Log Number":"GB-08052010-0018","City":"Filey"}