{"Object Features":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/24961.html.txt","/var/www/straped/mufon/more/24961_submitter_file1__ufosighting1999.JPG","/var/www/straped/mufon/org/24961.html"],"Case Number":"24961","Summary":"Sighting of an 11 light formations.","map":"<A HREF = \"http://maps.google.com/maps?q=14.576377,+121.08511(24961)&iwloc=A&hl=en\"> mufon case (24961) map </A>","Tags":"City","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Pasig City","There were no other sightings in Pasig City on or around October 31st 1999","This sighting has never been favorited.",""],"Longitude":"121.08511","Log Number":"PH-08052010-0017","Source":"MUFON","Object Shape":"Oval","Region":"Metro Manila","Date of the Event":"10/31/1999 12:00 UTC","divs":["Sighting DetailsIt was on October 31, 1999 at 9:00 pm when i sense that there is something coming from the skies and it was a strange feeling.. so from my curiosity i went outside our house and to my surprise i saw 11 oval orb-like light formations blinking in red and orange colors circling each other as it passes just a kilometer or in a very low altitude just like a plane landing in a runaway as it cruised just above the roof of our home.I immediately called my parents and my younger brother and together we witnessed the said sighting. And honestly we saw it coming towards our street.The UFO's just went on their distance until they disappeared to our sight. Since then i automatically believes in UFO's and extra terrestrial phenomenons. It happened so long ago but it still lurks in our memories-those light formations.During that time we don't possess video or a camera so attached with this report is my hand sketched drawing of what i saw. When the movie \"Sightings\" starred by Mel Gibson and Joaquin Phoenix.. the part of the scene when Joaquin Phonenix saw the same light formations we witnessed in the news he was watching. When you tube came along i searched other experiences and my whole curiosity about the history and origin about UFO's took place. note: I am now a fresh landed immigrant here in Winnipeg Manitoba."],"Latitude":"14.576377","Country":"Philippines","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"08/05/2010 06:22 UTC","City":"Pasig City","Weather Factors":"Unknown"}