{"Date of the Event":"08/05/2010 12:00 UTC","Log Number":"US-08062010-0001","City":"Stockton","Latitude":"37.966342","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.966342,+-121.28418(24968)&iwloc=A&hl=en\"> mufon case (24968) map </A>","files":["/var/www/straped/mufon/html2text/24968.html.txt","/var/www/straped/mufon/org/24968.html"],"Object Shape":"Unknown","Longitude":"-121.28418","Date Submitted":"08/06/2010 12:05 UTC","Region":"California","Summary":"Single bright light about 1000 to 1500ft from the ground and no sound.","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Tags":"City","Case Number":"24968","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsI was sitting outside having my morning coffee as usual. As it was getting light the only things you could see in the sky were the few remaining brightest stars and a quarter moon to the east and Jupiter to the southwest. By this time it is 5:30 in the morning. As I was sitting facing west I saw a bright light coming toward me over the roof tops and through the trees that I see to my west. To my direct west, on the northern side of the Port of Stockton, is I5 and the main channel to the Port of Stockton. I stood up to get a better view before it cleared the trees. It was a steady single bright light and there was NO sound. It was approximately 1000 to 1500 ft straight up. I truly expected it to be a plane but, with no sound I don't believe it was a plane. It also did not appear to have wings and it definitely did not have wing lights. No red or green only the single bright light. When I viewed it through the binoculars the light appeared to be on the bottom glowing forward. The light was so bright I could not make out the shape and when I started viewing with the binoculars it increased in speed and altitude. I see a lot of things at night but I never expected to see anything this early in the morning."],"trends":["There have been 25 other sightings in Stockton","There was one other sighting in Stockton on or around August 5th 2010"],"Object Features":"Undisclosed"}