{"files":["/var/www/straped/mufon/html2text/24967.html.txt","/var/www/straped/mufon/org/24967.html"],"Date Submitted":"08/05/2010 10:29 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Other","Weather Factors":"Unknown","divs":["Sighting DetailsI had a very bizarre childhood experience when I was 11, and it was also witnessed by two other people: My Dad, and my little sister. To put it plainly, we saw four semi-transparent beings with human-like appendages and heads flying in the sky maybe 10-12 feet above us one night in our frony yard in Yucca Valley California. We were walking to our car to go somewhere when they appeared. They seemed not to notice us and actually were playfully chasing each other around in the sky. It was almost as if they were made out of pure light. They were maybe 3-4 feet tall, had very little detail, and were randomly flying in no particular patterns. We watched them for maybe two minutes. They never got really close to us or tried to approach us. I know what you're thinking: Theatre spotlights or some kids playing with flashlights. But there were no light sources coming from below or above them...there were no beams of light coming from the ground to where they were floating. They were suspended in mid-air, and like I said were literally no more than 10 feet above our heads. My Dad and my sister still remember to this day that night, and most people can't offer an explanation for it when I tell them the story. I've researched many things since then to try to connect it with anything real. Ghosts, aliens, angels...I don't know what they were, but they did not look or act anything like these things. After a couple minutes they just vanished...literally winked out of existence. They seemed very benevolent yet very foreign, but the three of us felt like we weren't in danger. I just wanted to report it to you guys and wanted some answers that might explain that night. Thank You."],"Source":"MUFON","Country":"United States","Longitude":"-116.430785","Object Features":"Appendage(s)","Viewing Distance":"20 Feet or Less","Disposition":"Insufficient Data","City":"Yucca Valley","Region":"California","Latitude":"34.118554","Case Number":"24967","Object Shape":"Other","Summary":"4 human-shaped light beings above our heads.","Tags":"City","Log Number":"US-08052010-0023","trends":["There have been 6 other sightings in Yucca Valley","There were no other sightings in Yucca Valley on or around November 30th 1993"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.118554,+-116.430785(24967)&iwloc=A&hl=en\"> mufon case (24967) map </A>","Date of the Event":"11/30/1993 12:00 UTC"}