{"files":["/var/www/straped/mufon/html2text/24964.html.txt","/var/www/straped/mufon/org/24964.html"],"Source":"MUFON","Log Number":"GB-08052010-0020","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around August 5th 2010"],"Date of the Event":"08/05/2010 10:40 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsOn this night like every night I watch the sky for satellites or things. Looking straight upwards at time 22:40 I saw at hi-alt 3 satellite type objects moving north-n-e. Two of them where on a slight convergence route the other crossed their path going north. The two convergence objects; one of which was of a slightly faster than normal satalight speed, while the other was moving very fast and clean (3 or 4 times faster than a normal sat type object, no trails I was quit impressed with this fast object!. 10 mins later I caught a glimpse of a wing like object, this object was not as hi as the others.It was flying from same area of sky but towards the west,also much faster than an aircraft an equivalent size. It moved in a straight line for about 5 sec's then did a sweeping u-turn without dropping height. It went of in the direction of the 2 satellite-like objects. So 3 sat's and a wing like craft, no sounds or trails. The wing like craft had a slight orange glow as if lit up by the city's street lights, it was faint. I managed to view this wing with a low powered monocular. It was not a bird or a plane, the movement was not familiar. These objects had enough effect on me to prompt me to make this report."],"Latitude":"51.467749","Object Features":"None","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=51.467749,+-0.266794(24964)&iwloc=A&hl=en\"> mufon case (24964) map </A>","Longitude":"-0.266794","Summary":"Stright upwards at hi-alt I first saw 3 satelite type objects, then a wing like craft.","Object Flight Path":"Straight-line path,Path with directional change","Region":"England","City":"London","Object Shape":"Unknown","Country":"United Kingdom","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Date Submitted":"08/05/2010 06:51 UTC","Case Number":"24964"}