{"divs":["Sighting DetailsI had just finished putting my dogs in thier pen for the night and looked up into the sky above the treeline and saw an object made of several lights sortof hovering. I noticed the object because it seemed out of place in the night sky. This startled me so I walked back toward my house and the object slowly moved down behind the treeline. When it moved it did not move in straight lines or abrupt zigzags but more fluid, more like swimming than flying. When I first saw the object I thought it could be a plane or a chopper but I heard no noise and immediatly thought it was a UFO. After the object passed all the hair on my body stood on end. I came inside, told my wife what happened and got a flashlight. I went back outside followed our driveway all the way down to the gravel road (around 400ft). On the way I felt watched and started hearing owls and coyotes up in the hills around our land. I went back inside and got my revolver, loaded it and went back outside to take yet another look. I did not see the object again or hear the coyotes or owls. We live at the head of a hollow near Yatesville Lake."],"Case Number":"24969","Log Number":"US-08062010-0002","trends":["There have been no other sightings in Noris","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/24969.html.txt","/var/www/straped/mufon/org/24969.html"],"Disposition":"Unknown","Source":"MUFON","Summary":"UFO over treetop Lawrence County Kentucky.","Weather Factors":"Fog","Sighting Duration":"Undisclosed","Date Submitted":"08/06/2010 12:28 UTC","Longitude":"-82.719047","map":"<A HREF = \"http://maps.google.com/maps?q=37.997313,+-82.719047(24969)&iwloc=A&hl=en\"> mufon case (24969) map </A>","Region":"Kentucky","Tags":"City","Latitude":"37.997313","Object Features":"Unknown","Country":"United States","Date of the Event":"08/05/2010 11:40 UTC","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Object Shape":"Chevron, Circle, Disc, Unknown","City":"Noris"}