{"map":"<A HREF = \"http://maps.google.com/maps?q=45.500136,+-122.430201(2497)&iwloc=A&hl=en\"> mufon case (2497) map </A>","Log Number":"","Object Flight Path":"Undisclosed","divs":["Sighting DetailsWe were at Rooster Rock State Park watching the meteor shower on August 13tharound 230 AM. Though the full moonlight kept us from seeing too many meteors,we still were enjoying the view. We were all laying or sitting down with ourgaze facing northward. My brother, Kevin, said he saw a bright light. By thetime my eye caught it I saw a brief indigo reflection or flash to the right of abright dot, which was about as bright as a satellite. My brother, as he startedto look away, mentioned a type of satellite he thought that type of flashingindicated. Right when he looked down, however, our friend Erhan and I watched asit curved around changed directions from heading south to northwest. It movedabout the speed a satellite would in the sky. After a moment, it stopped andchanged directions again, this time back south. At least, I took that to besouth. In reality, because it was so high up, it looked like it was moving downand up with up being south. Then it stopped again and moved in a comparativelyvery slow circle in the sky. It did a similar pattern in terms of movementanother one or two times that is, changing directions and then doing a smallcircle. Eventually, it was too faded for us to see, though Erhan thought he sawit much closer to the north horizon about 30 seconds later. The whole incidenttook about five minutes. We were all calm, amused by the event. Later I wasquite excited because it was the first UFO Id ever seen"],"Sighting Duration":"00:05:00","Summary":"IndigoBlue light in sky during meteor shower","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/2497.html.txt","/var/www/straped/mufon/org/2497.html"],"Object Shape":"Undisclosed","Disposition":"Insufficient Data","Region":"Oregon","City":"Gresham","Country":"United States","Date Submitted":"08/13/2003 02:30 UTC","Case Number":"2497","Date of the Event":"08/13/2003 02:30 UTC","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-122.430201","Tags":"City","Object Features":"Undisclosed","trends":["There have been 19 other sightings in Gresham","There were no other sightings in Gresham on or around August 13th 2003"],"Latitude":"45.500136"}