{"Case Number":"24988","Sighting Duration":"Undisclosed","Date Submitted":"08/07/2010 08:10 UTC","Log Number":"US-08072010-0009","Viewing Distance":"Unknown","Country":"United States","Summary":"It was as bright as Venus in the south sky.","Region":"Florida","Latitude":"28.543086","divs":["Sighting Detailsit appeared in the south at near the same distance as an airplane might fly past the airport. it was round at first and it reminded me of a broach made of mother of pearl with a silver border around it. i spotted it first with only my eyeglasses later i used my binoculars it appeared to stand still for about a minute then it moved very slowly higher in the sky then it appeared to stop then it moved higher and to the west very slowly. during it's movement to the west it changed shape to more of a cigar shape. the light also became faintly colorful and appeared to vary the rainbow like colors from left to right. after several minutes it returned to a round shape. about a minute later it blinked out and although i continued to look i couldn't find it at all. i was with my wife and she did not see it at all but she has limited vision. at about 5 after 8pm i was able to locate venus in the west and way north of the object i had sighted. this sighting took place at my home on the front porch. my wife and i sit in our rocking chairs and enjoy the fresh air and the sunset every evening. we live near the airport and we enjoy watching the planes come in low as they head for the airport. i was really wishing for somebody else to spot it as well. but my neighbors were busy across the street trying to move a shed across the property. i was not excited at first but after i thought about it i did get excited my wife didn't appear to share my enthusiasm. since it was so close to the airport i wonder if they picked it up on their instruments."],"Longitude":"-81.376076","map":"<A HREF = \"http://maps.google.com/maps?q=28.543086,+-81.376076(24988)&iwloc=A&hl=en\"> mufon case (24988) map </A>","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around August 6th 2010"],"City":"Orlando","Disposition":"Insufficient Data","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24988.html.txt","/var/www/straped/mufon/org/24988.html"],"Tags":"City","Object Features":"Unknown","Date of the Event":"08/06/2010 07:50 UTC","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Cigar, Circle"}