{"Latitude":"36.622717","Date Submitted":"08/07/2010 01:49 UTC","Log Number":"US-08072010-0006","trends":["There have been 6 other sightings in Pacific Grove","There were no other sightings in Pacific Grove on or around August 6th 2010"],"Country":"United States","Object Flight Path":"Stationary","City":"Pacific Grove","Disposition":"Insufficient Data","divs":["Sighting Detailsi saw two triangles joined at one side and separated by about 30 degrees that were lighted and appeared just above the horizon near the moon. the fog was thin though the moon was misty looking. i could discern the entire shape of the moon. the circle of the moon was sharp but the body of the moon looked similar to how it would look through foggy glasses. the two triangles were to the left of the moon but much closer and not obscured at all by the fog. they were the color of orange juice. i watched long enough to make sure there was no movement, neither side to side or up and down. i tried to think of an explanation of what i was seeing. i thought it might be two backlit sails on a boat, but it was above the water horizon line and had no movement at all, no bobbing. there is an old light house that is sometimes in use, but this was not on the right sight line and had no flickering or similarity to the light from the light house. i watched about three minutes or so and then was overcome by fatigue and went to bed. i don't know what i saw, but i cannot identify it. my bedroom looks out over monterey bay over point pinos toward santa cruz. i see this view every night and have never seen anything like last night's sight."],"Longitude":"-121.908622","Viewing Distance":"501 Feet - 1 Mile","Summary":"triangles over monterey bay","Source":"MUFON","Case Number":"24985","Tags":"City","Weather Factors":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/24985.html.txt","/var/www/straped/mufon/org/24985.html"],"Object Shape":"Triangle","Sighting Duration":"Undisclosed","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.622717,+-121.908622(24985)&iwloc=A&hl=en\"> mufon case (24985) map </A>","Date of the Event":"08/06/2010 12:00 UTC"}