{"Region":"Utah","Latitude":"40.221053","Source":"MUFON","Log Number":"US-08072010-0008","divs":["sighting detailswhile watching some guys home movies of valley of the gods, utah on youtube (he was videotaping his vacation) i noticed something odd in his video (something seemed to dart across the screen, but it was too fast to distinguish--could've been dirt, a bird, or nothing). since i had just watched a show on ufos (ufohunters), i was curious what it was so i slowed down the video. when i did this, to my surprise, i found three consecutive still images (all that occur within 1\\10th of a second) of a very strange, unexplained object (see attachments). at first i thought there might be three different objects, but when i slowed the video down, it seemed more like one fast-moving object moving upward, changing direction (and possibly changing shape) all within a fraction of a second. note: the bright line in the middle of the images is sun glare. i've uploaded the pictures in consecutive order, as they appear in the video. could someone please explain to me what this is... or what it is not? thanks."],"Longitude":"-112.74441","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/24987.html.txt","/var/www/straped/mufon/more/24987_submitter_file1__UFOValleyoftheGods01.png","/var/www/straped/mufon/more/24987_submitter_file2__UFOValleyoftheGods02.png","/var/www/straped/mufon/more/24987_submitter_file3__UFOValleyoftheGods03.png","/var/www/straped/mufon/org/24987.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.221053,+-112.74441(24987)&iwloc=A&hl=en\"> mufon case (24987) map </A>","Viewing Distance":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"08/07/2010 04:35 UTC","Object Flight Path":"Undisclosed","Tags":"City","Summary":"Three clear pics of UFO over Dugway, UT.","Case Number":"24987","Disposition":"Insufficient Data","City":"Dugway","Object Shape":"Oval","Country":"United States","trends":["There has been one other sighting in Dugway","There were no other sightings in Dugway on or around June 1st 2009","This sighting has never been favorited.",""],"Date of the Event":"06/01/2009 12:00 UTC"}