{"map":"<A HREF = \"http://maps.google.com/maps?q=43.656216,+-79.373234(24981)&iwloc=A&hl=en\"> mufon case (24981) map </A>","City":"Toronto","Date Submitted":"08/07/2010 12:47 UTC","divs":["sighting detailsthis is my 3rd ufo sighting, once in 1975 with 6 other people (including my mother and sister), another 4 years ago with 5 friends, both times were observed for at least 25 minutes (40 minutes on the second sighting). this sighting, i knew it was coming, had been on my mind all day... i absolutely love the show ufo hunters, i think most of us who have witnessed a ufo want a voice... i'm not crazy. anyway, back to the story, i was watching cmt and out the reflection of the ontario college of nurse building (oh, i have a picture too!!!), yes i do! sorry, i'm so excited, holy ****. uhm, i saw this massive triangular reflection, moving very very slow, too slow for an airplane, then i stood up, as i was already at my window and i saw the entire ufo pass right over my building, very slowly i got a great look at it and then realized, take a picture, and i got one only on my blackberry, but there's no way in hell i'm the only person who saw this. i called 911 (twice, i was so friggen excited, they got pissed off). anyway, i've always known they exist and now i'm really seeing the interaction and appearances represent those of us who already know the trust. please, how vain to think we are the only ones here. so, i watched it move and almost hover about 200 feet above the ground, closest i've ever been, ever to a ufo. oh my god. it's so exciting, really, trippy too, i was blinking, really trying to observe, just taking in this huge ass triangle floating effortlessly (no sound< none< not a sound, no propulsion engine at all, something that big and no sound.... wow, out of this world and they're here alright. lol, sorry, rambling, uhm, the thing that was amazing about this one were the lights, and all 3 i have seen, all different, this one without a doubt the closest i've been to one yet ... although two psychics have both seen the first encounter with 45 minutes lost time as a possible abduction, i say cool to that if it happened, i have no recollection, but certainly lost time occured. this one, was only 1 minute and i managed to get a picture on my blackberry, and when zoomed, yes i got a picture this time< for real. uhm, back to the lights, they went straight across the one side, then a brilliant pattern, which played tricks on my mind it was like a circular ship then with triangles lighting up, then it looked triangular again, very shape shifting trippy eye work, but i know what i saw, it was that clear, and freakin low, low. wow, who else saw this? i haven't loaded the picture from my blackberry yet, but i will, you have my numbers if ya'll want to see it. thanks, [witness name removed\\cms\\tg]"],"Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"Canada","Date of the Event":"08/06/2010 11:53 UTC","Viewing Distance":"Unknown","Latitude":"43.656216","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around August 6th 2010"],"files":["/var/www/straped/mufon/html2text/24981.html.txt","/var/www/straped/mufon/org/24981.html"],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"Ontario","Object Shape":"Triangle","Longitude":"-79.373234","Summary":"40-60 feet wide, huge metallic but BRILLIANT illuminating orange/yellow lights.","Case Number":"24981","Tags":"City","Log Number":"CA-08072010-0002"}