{"Source":"MUFON","Country":"United States","Tags":"City","Latitude":"44.553021","Case Number":"2498","divs":["Sighting Details1 On my way home on a paved rural raod at 10pm at night.2Was looking at the Moon and the planet near it, easily visible.3 Thought both objects near planetstar may have been smaller stars until theybegan to move.Staye calm and tried to observe their pattern. Looked at my watch during theevent and memorized the time. Couldnt believe I finally saw something I couldntexplain. Listened for noise and there was none no engine sounds, etc. Looked forany signs of something like a vapor trail - none. Tried to count the seconds ittook for the objects to zig zag as they went away from the star by the moon thenacross the horizon and out of my sight. About 8-10 seconds.5 Objects were fairly close to each other but definately independent. They madean S pattern when going away from the Moon and the star near it. The S patternswere similar but not exact - each had its own path but they stayed in closeproximity to each other. After the S pattern was completed, they both wentacross the horizon approximately West from my point of view. The speed varied asthe went. I watched as long as I could see them. They were quite visible even asthey finally turned and went away from me into the distance.6 I simply couldnt see them anymore. I was able to follow them with myperipheral vision for a short time once they went into the distance."],"files":["/var/www/straped/mufon/html2text/2498.html.txt","/var/www/straped/mufon/org/2498.html"],"Log Number":"","Weather Factors":"Unknown","City":"Colton","Object Shape":"Sphere","Sighting Duration":"00:00:00","Region":"New York","Date of the Event":"08/13/2003 08:15 UTC","trends":["There have been no other sightings in Colton","This sighting has never been favorited."],"Date Submitted":"08/13/2003 08:15 UTC","Longitude":"-74.939506","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.553021,+-74.939506(2498)&iwloc=A&hl=en\"> mufon case (2498) map </A>","Summary":"Saw Two Orbs"}