{"trends":["There has been one other sighting in Glen Carbon","There were no other sightings in Glen Carbon on or around August 6th 2010"],"Case Number":"24984","Tags":"City","Longitude":"-89.975288","Country":"United States","files":["/var/www/straped/mufon/html2text/24984.html.txt","/var/www/straped/mufon/org/24984.html"],"Object Features":"None","Summary":"Saw an orange orb moving NE to SW across the sky.","map":"<A HREF = \"http://maps.google.com/maps?q=38.754451,+-89.975288(24984)&iwloc=A&hl=en\"> mufon case (24984) map </A>","divs":["Sighting Details I was driving north on Interstate 255, a little south of 270, when I saw a strange looking orange light in the sky off to the North East. I did a \"double take\" because it looked kind of weird, and then decided to pull off onto the side of the highway so I could get a better look. Got out of the car and watched as what looked like an orange glowing sphere moved slowly (much too slow for a meteor) across the night sky from the North East to the South West. After looking for a minute, I went and got a monocular out of my glove compartment, in order to be able to look more closely. The monocular helped some, but only to increase the magnification - it still looked like an orange, glowing sphere at about an altitude of roughly 1 to 2,000 feet, moving at about the speed of an airplane in the sky, but with no flashing red, white, or green lights ... just a glowing & slightly pulsating orange spherical appearance ... After watching for about 3 to 4 minutes the object became hard to see as it moved off in the distance to the South West ... in the direction of Columbia, Il."],"Source":"MUFON","Latitude":"38.754451","City":"Glen Carbon","Date Submitted":"08/07/2010 01:38 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"00:03:30","Disposition":"Unknown","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Region":"Illinois","Log Number":"US-08072010-0005","Date of the Event":"08/06/2010 09:13 UTC","Weather Factors":"Unknown"}