{"Date Submitted":"08/07/2010 01:51 UTC","divs":["sighting detailsi was sitting on a 2nd floor deck on the beach in ocean city, new jersey. it was dark and partly cloudy. i was watching and listening to the waves, when i noticed a circle of dim light on the beach a little to the left from directly in front of me. i was puzzled as to the source since there were no lights on, nothing overhead, truly no noticable source.it looked like it had to come from directly overhead. there was nothing there. a friend came out onto the deck and i pointed out the light. he saw it too and also could not imagine where it was coming from. then there was a huge spark from the center of the circle. we were both astonished- yes, we both saw it- yes we both saw and still see the circle of light. he then went inside to bed. i kept noticing the light on the beach again, i was looking at the waves when i saw a light under the water, very close to the shore. it moved slowly, i watched as it moved south for a few hundred yards then i didn't see it anymore. a few minutes later, the circle of light on the beach was gone. thats it! my sense\\guess is that it could be some sort of probe? since the source of light had to be coming from directly above the circle of light on the beach-there must have been something far above sending the light.i've never heard of an experience like this and was wondering if there are others? maybe this is not a ufo since we didn't see anything flying or even in the sky. it was without a doubt something very otherworldly. thank you for your response."],"Tags":"City","Object Features":"None","Case Number":"24993","Date of the Event":"08/04/2010 10:00 UTC","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Flash, Other, Unknown","City":"Ocean City","Country":"United States","Longitude":"-74.56671","Weather Factors":"None","Object Flight Path":"Other","Region":"New Jersey","Summary":"There was a circle of light on the beach, there was no observable source. While looking at it, there was a big spark, then just the light. Then I saw a light moving under the ocean, very close to the shoreline,then it disappeared.","map":"<A HREF = \"http://maps.google.com/maps?q=39.284616,+-74.56671(24993)&iwloc=A&hl=en\"> mufon case (24993) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/24993.html.txt","/var/www/straped/mufon/org/24993.html"],"Log Number":"US-08072010-0014","Disposition":"Unknown","trends":["There have been 3 other sightings in Ocean City","There were no other sightings in Ocean City on or around August 4th 2010"],"Latitude":"39.284616","Sighting Duration":"Undisclosed"}