{"Longitude":"-70.921471","trends":["There have been 2 other sightings in Peabody","There were no other sightings in Peabody on or around August 6th 2010"],"Date Submitted":"08/07/2010 11:12 UTC","Case Number":"24990","divs":["Sighting Details I was on a lounge chair in my backyard on the north side of the swimming pool. I was facing east and was in the shade cast by the tall bamboo behind me. Although there was no change in the light, I had a random thought that dark thunderclouds might be coming in from the west and looked up at the sky. A few seconds later I saw a silver disk travelling from west to east, in a straight line over my pool. At first glance I thought it was some kid's silver balloon that got loose but quickly realized it was no floppy, tinfoil balloon, but some kind of firm-surfaced metal. I focused in on it so I could remember as much detail as possible. It was shaped like a disk but also had a squashed egg type shape. The top and bottom were rounded and the sides were slightly rounded, like the shape of a Mento candy. There were no hard edges or seams, no puckers or variations of color or texture in the surface. It was totally smooth and reflective, the bottom of it turning darker as it passed over the green trees at the eastern end of the yard. I'm estimating that it was about 30 feet above the fully mature maple trees, so maybe 60 feet above ground. I got the impression that it might be 3 to 4 feet in diameter. Although it was breezy at the treetops, the disk moved in a straight line, with no side to side wavering or drifting from the wind, and no change in altitude. There was absolutely no sound emitting from it. After the disk had been in my sight for about 5 seconds I had the presence of mind to call out, \"Look up!\" to my husband, who was doing some yardwork about 20 feet behind me and to the right. Since he was to the right of the edge of the bamboo stand he had a clear view of the disk and looked up in time to see it just as it was going over the trees. His description of the disk corroborated mine. From the time I saw the disk to the time it travelled out of sight was about 8 to 10 seconds and I estimate that the distance it travelled in that time was about 50 to 60 feet. Using these estimates, the disk was travelling at about 3 to 5 miles per hour. Unfortunately there was no time to take a picture, even with my cell phone. Immediately following this sighting I felt glad to have finally seen something concrete and real because it left no doubt that these objects do exist. Then I started wondering whether the fact that they do exist was a good thing or not. Knowing that there is technology far advanced than that held by us here on Earth is a bit unsettling. From our own history we know what usually happens when a technologically advanced civilization meets a less advanced society. I can only hope that whoever is controlling these objects has a less aggressive nature than us humans. We told friends about the sighting but, of course, most of them just laughed it off and asked how much we had been drinking at the time (which, by the way, was not at all). We humans do laugh when we are nervous about something, and we don't want to hear about something that makes us uncomfortable. And the quickest way to shut someone up is to ridicule them. So our friends reactions are normal, but we know what we saw. I don't think our government could keep such technology a secret. Even if they could, if we had it, we wouldn't be fighting wars to get oil because we would have a better propulsion system already. So what we saw was an Object, that was Flying and is Unidentified...a UFO."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/24990.html.txt","/var/www/straped/mufon/org/24990.html"],"Log Number":"US-08072010-0011","Tags":"City","Weather Factors":"Unknown","Region":"Massachusetts","Object Features":"None","Viewing Distance":"21-100 Feet","Summary":"Disc travelled over my backyard in a straight line.","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"08/06/2010 02:40 UTC","Object Shape":"Disc","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.537533,+-70.921471(24990)&iwloc=A&hl=en\"> mufon case (24990) map </A>","City":"Peabody","Latitude":"42.537533"}