{"Country":"United States","Viewing Distance":"Unknown","Object Shape":"Square, Rectagular","Case Number":"24999","map":"<A HREF = \"http://maps.google.com/maps?q=32.719639,+-117.149085(24999)&iwloc=A&hl=en\"> mufon case (24999) map </A>","Object Features":"Undisclosed","Date of the Event":"08/07/2010 12:00 UTC","Tags":"City","City":"San Diego","Longitude":"-117.149085","Region":"California","Log Number":"US-08072010-0020","files":["/var/www/straped/mufon/html2text/24999.html.txt","/var/www/straped/mufon/org/24999.html"],"divs":["Sighting DetailsI awoke when I heard a car drive by, and its headlights flash, at 3 a.m. This was rather extraordinary in our sleepy little condo complex, so I got out of bed to check that nothing suspicious was going on (my bedroom window faces our street). I saw two cars, hood to hood, and then they backed up and drove away. One of the cars finally came around and someone got out, down the street. Meanwhile, something caught my attention in the night-sky - westerly, I believe. It was a very large bank of 4 rows (approximately) of bright white lights (sort of a square shape). This bank of lights was sitting above the horizon, and it did not move (I glanced at it for a few seconds, because I thought - well, maybe that's a UFO. And if Not, a very large light to keep planes from flying into it). When the light rows object didn't move, I got back into bed, and went to sleep. Basically, very tired, because it was so late. But I have never seen any lights like these, in that location in the 6 years I have lived here. And I am often gazing at the moon from this window."],"Latitude":"32.719639","Date Submitted":"08/07/2010 07:17 UTC","Source":"MUFON","Disposition":"Insufficient Data","Object Flight Path":"Stationary","Weather Factors":"Unknown","Summary":"Bank of bright white lights - 3 or 4 stories in height.","Sighting Duration":"Undisclosed","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around August 7th 2010"]}