{"divs":["Sighting DetailsFirst - I saw a very pure bright white light in the west sky fly out low out of nowhere at a very high speed and then it just disappeared. It flew in a very short concentrated semi circular angle. I did not think that much about it at the time and went about my business. I then went outside after going in and out of the house and sat down on the patio. I then to my left see something black right over the driveway. I look and see nothing. At the time I thought it was just a bird in flight that caught my eye and it is now gone. Then again something black pops up in the to the left of me and it looks black and round. It is low a couple hundred feet over the wires. It then disappears as I get up and look around the area front and back. I see nothing. Again - I sit down and see nothing - just enjoying the evening. Then to my surprise I then agian see this black round object hovering in the same spot as earlier. This time it just hovers in one spot as I stand up to look - it just hovers. Then this object starts to move very slowly - like it was taking its time. I stood there and watched as it went higher and higher very slowly. This object then as it moved up it just dissappered. I thought ok what the heck. I walked around and looked around and saw nothing. Then the object appears again and it is 10 times the size it was when I first saw it. This time it is slowly moving in a straight line and it is next to a wisp of a small cloud. The wisp of the small clould moves and reveals and large gold disc. It was completely flat. So now there is a large black sphere and large gold disc sitting in the sky next to eachother. I was in awe. Then as I looked the wisp of the cloud then moved and revealed another small black sphere. The objects did not move. Then they disappered and appeared in the same spot. Then I saw the smaller sphere start moving. When this happened I was looking up and from over my right shoulder I caught what looks like a flock of birds. They objects were wvey low and looked huge. They were what I can only describe as a Hostess fruit pie or empanada. Folded over circle with seams. These objects hovered in place and then started moving into a contolled foramtion. As this went on they got smaller and smaller as they hung around in the sky. Slowing dissolving one by one."],"Longitude":"-87.748608","Object Features":"Undisclosed","Latitude":"41.712666","files":["/var/www/straped/mufon/html2text/24997.html.txt","/var/www/straped/mufon/org/24997.html"],"Tags":"City","Log Number":"US-08072010-0018","Case Number":"24997","Viewing Distance":"Unknown","trends":["There have been 13 other sightings in Oak Lawn","There were no other sightings in Oak Lawn on or around July 31st 2010"],"Date of the Event":"07/31/2010 07:35 UTC","Date Submitted":"08/07/2010 04:21 UTC","Region":"Illinois","City":"Oak Lawn","Object Shape":"Disc, Sphere","Disposition":"Unresolved","Summary":"White light - orbs - disc.","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.712666,+-87.748608(24997)&iwloc=A&hl=en\"> mufon case (24997) map </A>","Sighting Duration":"Undisclosed"}