{"Source":"MUFON","Country":"United States","Latitude":"43.038959","Region":"New York","divs":["Sighting Details My other half and I were returning from one of our jobs and were coming down Barringer Rd In Ilion. We were aprox 3 to 4 miles up the road in the country area coming down into the village of Ilion. While driving he looked up and said What The Heck Is That. I looked up and in a distance this round shaped object was just sitting in the sky. Around the middle of it were white lights and it seemed to have a hazy glow around it which was orange-ish brown. I told him to hurry up and get closer to where this thing was so I could get some good pictures. It was 8 to 10 miles away, but CLEARLY visible from the top of the hill where we were. The object was in front of another hill which was across from the hill we were on. We drove down the hill, but there were trees all along the road blocking our view. We took another road to see if we could see it clearer but we couldn't find it afterwards. He is still trying to come up with a logical explanation but I know this object clearly resembled what my mother and I saw back in 1982"],"Weather Factors":"Rain","Date of the Event":"08/07/2010 02:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.038959,+-75.070436(24991)&iwloc=A&hl=en\"> mufon case (24991) map </A>","City":"Frankfort","Object Flight Path":"Stationary","Object Features":"Unknown","Summary":"The glowing object hovered over the Frankfort Schuyler Area","Longitude":"-75.070436","Object Shape":"Disc","Viewing Distance":"Over One Mile","Case Number":"24991","Log Number":"US-08072010-0012","Date Submitted":"08/07/2010 01:01 UTC","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/24991.html.txt","/var/www/straped/mufon/more/24991_submitter_file1__Thinginsky.jpg","/var/www/straped/mufon/org/24991.html"],"trends":["There have been no other sightings in Frankfort","This sighting has never been favorited."],"Sighting Duration":"Undisclosed"}