{"divs":["Sighting DetailsIt was 5am and I was trying to get back to sleep...Three friends and I were camping...they had just come into the tent. I had my Ipod on low but noticed some commotion with my friends and wondered what was going on. Just as soon as I was turning over I immediately saw a very beautiful bright glowing white light moving across the sky...Much, much bigger than a star but the same kind of color. It seemed to be very close...just over the trees above the tent. We had time to call to a few others outside to check this amazing sight out. It was mostly steady but changed pace maybe a couple of times. It was in sight for about 5 minutes and as it went over the trees the light from it was still so bright...I couldn't keep my eyes off it until it was completely gone. Our reactions varied but were similar...I didn't know what to think it was when I first saw it...I just knew it was beautiful. One friend was trying hard to come up with logical explanations of what it could be (besides a UFO), but there was no mistaking it for anything ordinary. Even he was stumped, and there was no resisting the fact that we had just witnessed something very wonderful and extraordinary! My feelings were very clear...I felt calm and peaceful, as well as happy and excited, when it was there. I didn't want it to leave! I was drawn to it. LOCATION: Willow Creek, California. Humboldt County."],"files":["/var/www/straped/mufon/html2text/25009.html.txt","/var/www/straped/mufon/org/25009.html"],"Date Submitted":"08/08/2010 04:16 UTC","Tags":"City","City":"Willow Creek","Region":"California","Log Number":"US-08082010-0003","Source":"MUFON","Case Number":"25009","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Willow Creek","This sighting has never been favorited."],"Latitude":"40.939577","Date of the Event":"08/07/2010 04:54 UTC","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Object Shape":"Circle, Fireball, Star-like","Summary":"Amazing and beautiful bright light moving slowly across the sky. Very close.","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.939577,+-123.631441(25009)&iwloc=A&hl=en\"> mufon case (25009) map </A>","Object Features":"Undisclosed","Disposition":"IFO","Longitude":"-123.631441"}