{"Weather Factors":"Unknown","divs":["Sighting DetailsI was on my balcony in my 4th story apt. I noticed a bright seemingly distant object that seemed to be high in the sky west of me. I used a building that was 3 blocks north west of my position as a point of reference. I thought the object was a star or planet at first because it was stationary, but It sparked my interest because it was pulsating with red blue and white lights like that of an airplane in the night sky, except that instead of flashes the lights seemed to revolving like a lighthouse beacon. I kind of made a mental note of this objects position and drew an imaginary line from the object that was at a very high altitude and the building underneath it. I went to call my wife so that she could come and take a look at it. We watched it together for about 30 minutes and my wife who was standing to my right said that it seemed to move right slightly. It didnt seem that way to me. Then after 30 minutes my wife went back inside and I decided to stay and continue watching. I had been standing this whole time and decided to sit down on the floor of the balcony. I had watched for about 2 minutes and then it seemed to move slightly right, so I stood and noticed that the object was indeed moving right and dropping altitude very slowly until it seemed parallel to the top point of the building's north side. It hovered there for about 2 minutes then disappeared out of sight. I called my wife back out to show her that it was definitely not a star or planet because of how rapidly it moved after being perfectly stationary for such along time. She was shocked because we had kind of assumed it was a star until it disappeared in the clear night sky. We tried to reason that it was helicopter but the object seemed to hovering at 50000 feet because it looked much higher then the airplanes that are visible at 35-38000 feet. Im not familiar with all types of air craft but I had heard that helicopters dont really fly at super high altitudes. Then we thought it was a hot air balloon with lights, but then we dismissed that because of how perfectly still it was for half an hour, beside the fact that somebody up there would need an oxygen tank for breathing at that altitude. At this point we were out of ideas and my wife went back inside. I stayed outside a while longer and scanned the sky hoping to see it pop up again but it didnt at which point I decided to look in the eastern direction. I then noticed the flashing blue light of an airplane and watched for a few seconds as it moved slowly across the sky. My view was perpendicular to its path. After watching it for a minute I saw an object that moved at an incredible speed east of my position but also gaining altitude as it crossed the path of the air plane which was flying south east at a lower altitude. It was a thick streak of bright powder blue that narrowed at the point furthest from me. It lasted a fraction of a second, at which point I got freaked out and went inside. Because of its color I tried to argue to myself that it could have been lightning but I have never seen horizontal powder blue triangular shaped lightning on a clear night."],"Date of the Event":"08/06/2010 12:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","Longitude":"-80.123486","trends":["There have been 8 other sightings in Miami Beach","There were no other sightings in Miami Beach on or around August 6th 2010"],"Object Shape":"Flash, Star-like","Log Number":"US-08072010-0026","Date Submitted":"08/07/2010 10:55 UTC","Country":"United States","Object Features":"Unknown","Summary":"Stationary object about the size of star as it appears in the sky but with very pronounced color changes and and flash expansions like that of a multi colored beacon, then began to start moving north west after 35 minutes of hovering and then disappeared","files":["/var/www/straped/mufon/html2text/25005.html.txt","/var/www/straped/mufon/org/25005.html"],"Case Number":"25005","Tags":"City","City":"Miami Beach","map":"<A HREF = \"http://maps.google.com/maps?q=25.794804,+-80.123486(25005)&iwloc=A&hl=en\"> mufon case (25005) map </A>","Latitude":"25.794804","Disposition":"Insufficient Data","Region":"Florida"}