{"Latitude":"33.842333","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/25008.html.txt","/var/www/straped/mufon/org/25008.html"],"divs":["sighting detailswent outside to smoke @ approx.00:35 hrs. 08\\08\\2010 and immediately noticed a fairly bright light in the e-ese sky at approx.40*-50* azimuth (by estimation...could possibly be slightly higher azimuth,but has been changing to some degree, with movement) and it caught my attention because of it's unusual movements. went inside to get my wife whom also observed this for awhile until she felt it time to return indoors. long story short, whatever this thing is, it moves in ways that no known aircraft possibly could, and is completely silent. doesn't seem to truly reflect movements of a balloon,yet cannot say for certain just what it (the source of the light) is, and thought it best to make notification to you in case other folks in this area might also have sighted this as well, or perhaps someone can explain it. observed from 00:35 to 01:00 and decided to come inside to make notification. am going to check now (01:19) to see if still in same general location in sky or not. ***still visible now at 01:20 but slightly higher azimuth (55-60*) and slightly more southerly than previous. motions are variable and sometimes slighlty rapid and jerky. am going out now to further observe. very interesting and compelling to watch! unfortunately we don't own any video equipment,and only cheap 110\\35mm cameras,but hopefully someone else in our area whom has proper equipment will notice it and get some footage or stills of this strange light. anyways,it's exciting to watch so i'm going back out to observe it more. approximate compass position would be (estimated) 110-140* (ese) and last azimuth as reported approx.55*-60*+."],"Source":"MUFON","Longitude":"-86.249892","Case Number":"25008","map":"<A HREF = \"http://maps.google.com/maps?q=33.842333,+-86.249892(25008)&iwloc=A&hl=en\"> mufon case (25008) map </A>","Country":"United States","Date of the Event":"08/08/2010 01:00 UTC","Object Flight Path":"Undisclosed","Disposition":"Unknown","Weather Factors":"Unknown","Summary":"Strange BRIGHT(moving) light in Eastern sky @ approx.40-50* azimuth.","Log Number":"US-08082010-0002","City":"Ashville","Tags":"City","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Ashville","There were no other sightings in Ashville on or around August 8th 2010"],"Date Submitted":"08/08/2010 02:29 UTC","Sighting Duration":"Undisclosed","Region":"Alabama","Viewing Distance":"Unknown"}