{"Disposition":"Unknown","Latitude":"37.848983","Date Submitted":"08/08/2010 09:56 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Region":"Kentucky","Country":"United States","Date of the Event":"08/31/1981 12:00 UTC","Viewing Distance":"Unknown","Log Number":"US-08082010-0006","files":["/var/www/straped/mufon/html2text/25012.html.txt","/var/www/straped/mufon/org/25012.html"],"trends":[],"Object Features":"Unknown","Object Shape":"Chevron, Disc, Triangle","Case Number":"25012","divs":["Sighting DetailsOne evening at about dusk in Sept of 1981 (I'm not sure of the day) I was riding around in my boyfriend's truck. We had graduated the previous year from high school. He had picked me up and as we were driving around deciding what to do for the evening he spotted a shiny disc like shape in the sky which appeared to be reflecting off the last rays of the setting sun, and pointed it out to me. It was just hovering in the sky about 10-15 stories high, over a field next to the grade school I attended when I was a child. We drove closer to get a better look and suddenly it shot off to our right; faster than we had ever seen anything move before. We immediately began trying to follow it and did succeed in following it to another open area by a shopping center. It seemed like it knew we were following it because it would slow down at times and we would \"catch up\" with it. This time it was closer to the ground and even though the sky had become darker, we got a better look at it. It was dark gray in color and shaped like a rounded chevron at times and at other angles it appeared to be a rounded triangle. We were trying to figure out if it could be an aircraft that was being tested by someone at Ft Knox, but after watching it move and hover a while vertically and horizontally we began to consider that it might be a UFO. After watching it for a few minutes, I began to feel very eery, like I was being watched and that someone or something was trying to assess what I was thinking. We rolled down the windows to see if we could hear anything but it seemed to emit no sound, The hairs on my arm began to stand up and I began to be fearful and began to quietly pray. As I prayed \"God please watch over us and keep us safe\" the object moved vertically and then sped off horizontally in a southward direction from Louisville. Immediately thereafter we saw three military jets fly over in formation in the direction of the object. I have never forgotten this incident and I never spoke with my boyfriend about it again. In fact he seemed so skittish about it that once it flew away he began talking about other things as if it never happened. I have only told this story to about 3 people as I didn't want someone to think I was nuts."],"Weather Factors":"Unknown","Longitude":"-84.266458","map":"<A HREF = \"http://maps.google.com/maps?q=37.848983,+-84.266458(25012)&iwloc=A&hl=en\"> mufon case (25012) map </A>","Summary":"It was gray and seemed disc like but also took the shape of a rounded chevron or rounded triangle at different angles.","Source":"MUFON","Tags":"City","City":"Undisclosed","Sighting Duration":"Undisclosed"}