{"Object Flight Path":"Unknown","Case Number":"2501","files":["/var/www/straped/mufon/html2text/2501.html.txt","/var/www/straped/mufon/org/2501.html"],"Summary":"Two puffs of smoke, dancing in the night","divs":["Sighting DetailsAt about 1250 am on 81703, I went to my backyard after being awaken by myneighbors party across the street. The sky was clear and the moon was shiningbrightly, and one star was very bright, I thought it might be Mars, since itscoming so close to Earth, but it didnt have a redish tint, so I looked aroundfor it. I spotted what looked like two puffs of white smoke towards the east, Ithought it might be a couple of clouds but one of them was wobbling, I thoughtmy eyes were playing tricks on me, since I was asleep a few minutes ago, so Istared a little longer, the second cloud wobbled too, I must be nuts, becauseboth were stationary, I decided to go to the front of my house to get adifferent angle away from the citrus trees. Still in the same spot, both objectsbegan to move upwards together, wobbling and circling around each other at anamazing speed, they would stop shortly and begin to move again in the samemanner. I called my neighbor Art, screaming for him to come out, by the time hecame out the objects were still climbing at about 80 degrees, but he could stillsee them wobbling and changing direction and circling each other, he was asexcited as I was. Art wears glasses so he couldnt see the objects once theyreached 90 degrees, but I have 2020 vision and I observed them for an additional5 minutes, very faint, still dancing around, moving away and toward each other,but very far away. I have always believed in others accounts of UFOs but this ismy first experience in my 43 years. Did anyone else observe this"],"Object Features":"Other","Disposition":"Unknown","Viewing Distance":"Over One Mile","Latitude":"33.804167","map":"<A HREF = \"http://maps.google.com/maps?q=33.804167,+-118.158056(2501)&iwloc=A&hl=en\"> mufon case (2501) map </A>","Region":"California","Sighting Duration":"00:30:00","Object Shape":"Other","Date Submitted":"08/17/2003 12:00 UTC","Country":"United States","City":"Long Beach","Longitude":"-118.158056","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around August 17th 2003"],"Date of the Event":"08/17/2003 12:00 UTC","Log Number":""}