{"Disposition":"IFO","Object Flight Path":"Stationary","Date of the Event":"08/07/2010 08:34 UTC","Object Features":"Unknown","Summary":"Extremely bright stationary light, then fades in and out.","Tags":"City","Region":"Arizona","divs":["sighting detailsfor approximately 1 week there has been an extremely bright to the west of my home. i first noticed it while driving home from the town of maricopa. it is bright enough to look like a large airliner flying toward you. my wife and i argued about it as that's what i thought it was, but then i realized that she was correct and that it wasn't moving. the light appears much larger than any other star in the sky. the light does not move and then without warning just suddenly blinks out. it then comes back two, or three times, within four to five minutes, before going out all together. i have never believed in the whole \"little green men\" thing, however i am at a total loss for an explanation. my entire family observed the strange sight last night. as previously stated this has been happening for approximately one week. also, i should say that i live out in the desert and my nearest neighbor is about 1\\4 of a mile from my home, so there are very few lights to interfere with observing the night sky. my family and i have lived at this location for more than a year and had never observed this light prior to a week before."],"Sighting Duration":"Undisclosed","Log Number":"US-08082010-0009","Country":"United States","Weather Factors":"None","Source":"MUFON","City":"Maricopa","Viewing Distance":"Unknown","Date Submitted":"08/08/2010 11:18 UTC","Latitude":"33.293117","Longitude":"-112.420856","trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around August 7th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.293117,+-112.420856(25015)&iwloc=A&hl=en\"> mufon case (25015) map </A>","Object Shape":"Flash, Other","Case Number":"25015","files":["/var/www/straped/mufon/html2text/25015.html.txt","/var/www/straped/mufon/org/25015.html"]}