{"Object Flight Path":"Straight-line path","City":"Auburn","Sighting Duration":"Undisclosed","Latitude":"38.897845","Source":"MUFON","Disposition":"Unknown","Summary":"3 separate objects with non-blinking blue/bluegreen lights all on the exact same flight path.","Tags":"City","Log Number":"US-08082010-0010","Country":"United States","Region":"California","Weather Factors":"None","Longitude":"-121.06801","Case Number":"25016","Viewing Distance":"Unknown","Object Features":"None","Date Submitted":"08/08/2010 11:42 UTC","files":["/var/www/straped/mufon/html2text/25016.html.txt","/var/www/straped/mufon/org/25016.html"],"Date of the Event":"08/07/2010 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.897845,+-121.06801(25016)&iwloc=A&hl=en\"> mufon case (25016) map </A>","Object Shape":"Disc, Other","divs":["Sighting DetailsThere was eight of us friends sitting out on the sidewalk in our neighborhood. We usually spend a great part of the evenings sitting back and looking at the stars and watching for satellites. At around 10:30 pm, a disc like object with a blue light in the center of the objects bottom side passed over. The blue light was brilliant like that of a blue L.E.D. The bottom of the object had a feint glow on it from the blue light. The object moved a high rate of speed in comparison to all the aircraft we normally see pass over...around 2x to 3x the speed of the average jet liner. The object was still visible after approximately 1-2 miles away after it had passed over. We were charged with excitement and while discussing what we had seen, someone noticed another one on the same path, this one was different, more blueish green in color and moving the same speed. To describe this object I would say that it looked like a long string of glow sticks, imagine this string of glow sticks being on something like a bungee, whipping in a circular motion from front to back and then back to front in the direction that it was traveling. This one was much more shocking to witness than the first...then in about the same amount of time that it took for the first one to go out of sight and the second to become visible, the third came into view. The third was very similar to the first, same speed, same blue light and flying flat and straight...now I did forget to mention before, there was absolutely no sound what-so-ever. With each pass we expected to hear the sounds of a jet engine, but nothing at all. The silence was especially surprising, considering the speed at which the objects were moving. There was a very slight breeze in the opposite directing that the objects were moving. One of the Gals in the group went inside here home and looked on the net to see if anyone else had reported anything and found that something that matched our description had been spotted the night before in another state and again in the previous month in New York."],"trends":["There have been 7 other sightings in Auburn","There were no other sightings in Auburn on or around August 7th 2010"]}