{"Viewing Distance":"Over One Mile","Tags":"City","Weather Factors":"None","Country":"United States","Case Number":"25011","files":["/var/www/straped/mufon/html2text/25011.html.txt","/var/www/straped/mufon/org/25011.html"],"Date Submitted":"08/08/2010 08:57 UTC","City":"Mayodan","Object Shape":"Fireball, Unknown","Region":"North Carolina","Date of the Event":"07/28/2010 10:15 UTC","Log Number":"US-08082010-0005","trends":["There have been no other sightings in Mayodan","This sighting has been favorited 1 time."],"Object Flight Path":"Unknown","Latitude":"36.41236","divs":["Sighting DetailsAt a little after 10, I noticed a very loud rumbling. I thought nothing of it, as I live next to a train tracks. There was a vibration in the house. And it lasted for about 20-30 seconds. Half an hour later, I checked my voicemail on my phone and there were two messages from my brother who lives 2 blocks away. He told me he heard the same rumbling and ran outside to see what it was. You see, there was no whistle, and had it been a train, there would have been a whistle, and that had just not occurred to me. He ran outside to see what it was and noticed a fireball flying approximately 40,000 feet up (admittedly, a guess) flying from zenith to horizon in 10 seconds. At that height, that seems too slow to be a meteor, but too fast to be a commercial airline. Upon explanation of this story to my wife, at about the same time 30 miles to the south in High Point, NC, she noticed the same rumbling. The object was flying south to north at an incredible rate of speed. It was all the talk at the local watering hole the next morning with no explanation. No mention was made of it on the local news. I'm looking for anyone with photographic evidence."],"Summary":"Loud rumbling progressing across the sky. Loud as a train, but flying.","Source":"MUFON","Sighting Duration":"00:00:20","Object Features":"Unknown","Longitude":"-79.966986","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.41236,+-79.966986(25011)&iwloc=A&hl=en\"> mufon case (25011) map </A>"}