{"Longitude":"-82.793373","map":"<A HREF = \"http://maps.google.com/maps?q=27.973063,+-82.793373(25014)&iwloc=A&hl=en\"> mufon case (25014) map </A>","Case Number":"25014","Weather Factors":"Unknown","Disposition":"Insufficient Data","Region":"Florida","Date of the Event":"08/07/2010 09:50 UTC","Object Features":"Unknown","divs":["sighting detailsi work near the clearwater\\st. pete airport. i was on the phone talking to my wife. from the south i saw an object in the air. i work near the airport and to see something in the air is not unusual. it was the speed that first caught my attention. next what caught my attention is that it was a sphere shape. sometimes you might see one of those mylar balloons in the air. they waver and change shape as they rotate. what i saw had a steady flight path and it did not change shape. it was high, just below the thunder clouds that were developing that day. i would estimate that it was traveling at about three times faster than most common aircraft i see in the area. it was dark colored and did not emanate any light. i said something about it to my wife on the phone. by the time i could comprehend what i was looking at it was gone. i had a camera on my phone but did not photograph it. i believe that i watched it for two minutes, from a pinpoint to an obvious shape flying by. i lost sight of it as it passed behind the building where i work."],"Log Number":"US-08082010-0008","City":"Clearwater","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around August 7th 2010"],"Object Flight Path":"Straight-line path","Tags":"City","Date Submitted":"08/08/2010 11:12 UTC","Country":"United States","Summary":"Sphere shaped object moving at a rapid rate over Tampa Bay.","Sighting Duration":"00:02:00","Source":"MUFON","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/25014.html.txt","/var/www/straped/mufon/org/25014.html"],"Latitude":"27.973063"}