{"Object Shape":"Sphere","trends":["There have been no other sightings in Râmnicu Vâlcea","This sighting has never been favorited."],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"VÃƒÂ¢lcea","Source":"MUFON","Date of the Event":"08/07/2010 11:06 UTC","Date Submitted":"08/08/2010 03:51 UTC","Weather Factors":"Unknown","Log Number":"RO-08082010-0004","divs":["Sighting DetailsI get called to the window of my apartment flat by my girlfriend and I see this bright sphere maybe 3-4 times brighter and larger than the brightest star in the sky. There was an overcast of clouds at the time so that's the first thing that caught my eye. At first I thought it was a meteor but it had a straight path (aproximately North to South). It was glowing a darker shade of yellow , as if it was on fire or something like it. It took about 1 minute to pass the entire sky shortly after it vanished glowing less and less. Aprox. 5 minutes after another exactly similar object crosses the sky in the exact same pattern and the exact same time. I managed to film the first and I'll try to upload it , I'm not jumping to any conlcusions I have no ideea what it might be , my guess was a missile but it could be anything. I shall check this sight regularly and if needed I shall contact you again. For now I'll just remain anonimous. *Note : I have no ideea if this light I was seeing was above or under the clouds , or who knows maybe even in the clouds. I'm mostly just curios if anybody else saw these. The movie is in MP4 format, filmed by my Nokia N95 phone. Cheers."],"Longitude":"24.375556","map":"<A HREF = \"http://maps.google.com/maps?q=45.104722,+24.375556(25010)&iwloc=A&hl=en\"> mufon case (25010) map </A>","files":["/var/www/straped/mufon/html2text/25010.html.txt","/var/www/straped/mufon/org/25010.html"],"Latitude":"45.104722","Case Number":"25010","City":"RÃƒÂ¢mnicu VÃƒÂ¢lcea","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Disposition":"Unresolved","Summary":"2 spheres passing the night sky, maybe 5 minutes apart.","Country":"Romania"}