{"Case Number":"25013","Object Features":"Undisclosed","Country":"United States","Object Shape":"Triangle","Tags":"City","trends":["There have been 3 other sightings in Richmond","There were no other sightings in Richmond on or around July 26th 2009"],"Date Submitted":"08/08/2010 10:15 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-08082010-0007","City":"Richmond","Object Flight Path":"Undisclosed","Latitude":"39.830937","Disposition":"Insufficient Data","Longitude":"-84.884258","files":["/var/www/straped/mufon/html2text/25013.html.txt","/var/www/straped/mufon/org/25013.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsRelaxing on our back patio \"Bird Watching\" with my wife, in the later part of July. The evening was very clear (low humidity), the sky was very blue in color and the clouds were white; perfect for bird watching. We were useing our Binoculars (7X35mm, 367ft at 1000yrds). Suddenly, my wife asked for me to look at an object in the sky, useing the bins. She believed it to be a large bird, after I had observed the object for about 2 minutes I handed the Bins. to her. After she watched the object for about 2 min., She handed back the bins., saying that she couldn't accept what she saw and went back into the house. To this day she will not talk about the incident. The object was black, but the material make-up had a differant texture than our aircraft, but the color was simular to our (US) stealth bombers; the shape was that of a pyramid and it turned slowly (clockwise), my left to right. As, I resumed watching the Pyramid (in total amazement), the object began to drift in an odd patern; moving downward and to my right or to its left. After about 10 to 15 minutes of observation, the object suddenly was gone. I immediatly thought of Star Trek or the SG1 series (Star Gate). It was really neat. I didn't feel threatened or ill at ease at the time, nor do I now. But, I only wish that we, as a race, could use our energies for the good of humanity; therefor, evolving to that form which would allow our species to one day travel into the cosmos. If I feel anything at all from this experiance, I would have to say \"Envy\"."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.830937,+-84.884258(25013)&iwloc=A&hl=en\"> mufon case (25013) map </A>","Region":"Indiana","Summary":"Observed a UFO in July of 2009","Date of the Event":"07/26/2009 12:00 UTC"}