{"Date of the Event":"10/26/2008 10:00 UTC","Object Features":"None","Summary":"I've had at least 3 or maybe 4 sightings all in Phoenix, Arizona.","Longitude":"-112.067717","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-08082010-0014","Object Flight Path":"Stationary,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.456077,+-112.067717(25020)&iwloc=A&hl=en\"> mufon case (25020) map </A>","files":["/var/www/straped/mufon/html2text/25020.html.txt","/var/www/straped/mufon/org/25020.html"],"Weather Factors":"None","Country":"United States","Sighting Duration":"07:00:00","Tags":"City","City":"Phoenix","Region":"Arizona","Case Number":"25020","Disposition":"Unknown","divs":["Sighting DetailsI have had atleast 4 different sightings outside my balcony in the state of Arizona facing the desert. I would usually get migraines after the event, and once I lost time ( I was sitting Indian style on my couch after a sighting around 10 pm and apparently passed out, only to awaken sitting upright, Indian style on my couch many hours later at 4:oo am.) Once i had awoken and my hair was such a mess, full of static and just so all over the place, that it has never been before nor since that day. I would also have dreams of flying inside my apartment and outside my apartment up into the sky. I will describe the different types of sightings below. 1. I saw red orb like objects flying high up in the sky that would hover at times and then suddenly accelerate away from each other. There were maybe two others blinking below them and they all seemed to be communicating with eachother. 2. i saw a silent, hovering rectangular type craft above me that had a series of green and red lights that beamed crisscross, and then I heard what sounded like a strong wind and just above my head coming in the opposite direction was a triangular craft that looked like dull metal, and it glided over my head and glided over the desert moving away from me for quite a while. it has 3 blinking lights. 3. My last sighting was a series of approaching star like objects that would stop in midair and illuminate more and more intensely, that it was very beautiful and I felt as though they were communicating specifically to me. There were 3 consecutive lights like this until they disappeared out of my viewing range behind my balcony. After the last sighting i had moved away from Arizona and have since then not seen anything in the sky again. I truly miss my sightings very much and my feeling towards them is very benevolent. I did report my sightings to the Arizona Republic newspaper each time."],"trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 26th 2008"],"Object Shape":"Chevron, Cross, Star-like, Triangle","Date Submitted":"08/08/2010 01:13 UTC","Latitude":"33.456077"}