{"Viewing Distance":"21-100 Feet","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.651246,+-117.683088(25021)&iwloc=A&hl=en\"> mufon case (25021) map </A>","files":["/var/www/straped/mufon/html2text/25021.html.txt","/var/www/straped/mufon/org/25021.html"],"Summary":"Disk smaller than a 747 that u can see inside threw the portals.d","Longitude":"-117.683088","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsI was in my backyard smoking and notice the sounds of plans and helicopters and when I looked up across the lake I saw lights that were moving to where I was, With the lights from the city i could see a disc shape that was black but it had lights that went around when to me looked like windows. It came about a 100 feet from me and could of been more than 200 feet up. As this aircraft approach me I could see the plans coming after it and with the and helicopter sounds I noticed when it was close to me it didn't make any sound and it went from comming my was to a perfect left at about 30mph and at that point I went to get my camera it went behind the trees by my house and as I was trying to get a picture it made another perfect sharp left turn, it went about 200 yards and than it vanished. The strang part was all the aircraft that night that seem to be chasing it because I am outside at night and never aircraft at all, let alone 4 or 5 that I heard and saw that night. For whatever reason I was able to get my camera to focus to take a picture, i have one of the best cameras you can buy so I am sorry it wouldn't take a picture."],"Date Submitted":"08/08/2010 01:57 UTC","City":"Lake Forest","Latitude":"33.651246","Region":"California","Case Number":"25021","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-08082010-0015","trends":["There have been 7 other sightings in Lake Forest","There were no other sightings in Lake Forest on or around June 27th 2010"],"Date of the Event":"06/27/2010 10:30 UTC","Object Features":"Window(s)","Object Shape":"Disc"}