{"files":["/var/www/straped/mufon/html2text/2502.html.txt","/var/www/straped/mufon/org/2502.html"],"Log Number":"","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Latitude":"44.083843","Object Shape":"Triangle","trends":["There have been 10 other sightings in Rapid City","There were no other sightings in Rapid City on or around August 12th 1993"],"Case Number":"2502","City":"Rapid City","Longitude":"-103.229215","Source":"MUFON","Region":"South Dakota","Disposition":"IFO","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Unknown","Sighting Duration":"00:05:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.083843,+-103.229215(2502)&iwloc=A&hl=en\"> mufon case (2502) map </A>","Summary":"Black triangle at night in skies of the Black Hill","divs":["Sighting DetailsMy wife and I were visiting the Black Hills around the end of the motorcyclerally, and were staying with a friend whose parents had just built a nice newhouse in a canyonnorth facing side west of Rapid City some 10-15 miles. We weresitting outside on the back porch enjoying the cool of the evening and had justcracked open our beers. Jordan, our host, got up to visit the restroom and onhis way, the power went out. We laughed as he stumbled in the dark and cursedout loud.I now wonder how he managed to hit his mark, but perhaps he sat thatone out My wife and I were listening to the porcupines grumbling at each otherwhen I commented that the wind was coming up. She asked how I knew, and I saidthat I could hear it in the treetops. I did find it odd that I could not see thetreetops moving, yet the wind sounded to be drawing closer. I got up and movedaway from the house, my curiosity piqued. The noise of wind was definitelygetting closer and louder. I cast my gaze upwards and to the east, the apparentdirection of the noise. In that instant I saw a large black triangle movingtowards us over the treetops. It was entirely unlit except for the reflectedglow of a partial moon. It appeared to be turning to the south-west and my wifeand I observed it until it vanished over the roofline of the house. Its apparentspeed was in the 250-350 knot range, not terribly fast, and just as a guess ithad a 180-200ft wingspan. My jaw gaped in astonishment, and my wife wasfrantically asking what that was. I had no reply for her, and was standing inwonderment when Jordan came out of the house. I related what had just occurredto him and he was at first incredulous, then miffed that he had missed out onseeing it. Some minutes latermaybe 3 or 4the lights came back on. Some minuteslater, lights further up the canyon were observed coming back on. Just as aninteresting side-note, the next morning, I was extensively questioned by Jordansfather about the event. He seemed very interested in my account, which is nottoo surprising when one understands that he is a lifelong pilot and a Colonel inthe Air National Guard, Special Assistant to the Adjutant General of SouthDakota, stationed at Ellsworth AFB, a SAC B-1 bomber base. He also consultedregularly at the Pentagon as part of his regular duties. Knowing all this, andhe having finished questioning me, I asked him directly if he had any knowledgeof what I had seen. His only reply was a small laugh and a BIG smile."],"Tags":"City","Date Submitted":"08/12/1993 12:00 UTC","Object Features":"Wings","Date of the Event":"08/12/1993 12:00 UTC"}