{"Case Number":"25027","files":["/var/www/straped/mufon/html2text/25027.html.txt","/var/www/straped/mufon/org/25027.html"],"Object Shape":"Triangle","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around August 8th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.962226,+-82.993404(25027)&iwloc=A&hl=en\"> mufon case (25027) map </A>","Date Submitted":"08/08/2010 10:04 UTC","Weather Factors":"Unknown","Log Number":"US-08082010-0021","Tags":"City","Sighting Duration":"00:02:00","Summary":"Silent triangle that flew directly over our truck then flew back the direction it came.","Disposition":"Unknown","Date of the Event":"08/08/2010 03:00 UTC","Longitude":"-82.993404","Object Flight Path":"Undisclosed","Latitude":"39.962226","divs":["Sighting DetailsMy Wife and I had traveled to Westerville Ohio to visit a friend who was having a house warming party. We left around 2:30 to travel home in the southern part of the state. Traveling down Interstate 71 somewhere between Morse rd and Hudson st I noticed a line of lights off to my right and out the front window of our truck. My first thought was that it was a plane that might be coming in for a landing... but that didnt seem right after a second or two and I asked my wife who was sitting beside me if she could see what I saw. She did see it and was soon as amazed as I was if not more so as I had to go back and fourth from observing and driving. The object changed from a line of lights to a pattern of 3 lights in the shape of a triangle as it got larger and closer to us. Soon I was unable to see the object, but my wife was still able to observe out her window. By this time we was both at a loss to explain what we seen. She put the window down and kept her eyes on it as I asked her what it was doing and what she thought it was as it got closer. She kept saying \"I dont know its weird\". I was thinking any moment that it would pass over us and i would be able to view it out my side window, but this did not occur. She soon had her head out the window and was gazing directly above us, and at this time she said \"I can see its outline againt the sky and its deffinetly a triangle with a light at each corner\" (It occurred to me at this point that we both had our digital cameras in the back seat from a wedding shoot we had done and I quickly told her to get a picture of it! She pulled herself back into the cab grabbed the camera(Nikon D5000) and stuck her head and right arm with camera back out the window again. She kept saying it wont focus and the camera says subject is to dark as I franticly asked about the camera and why she couldnt get it to work. At this time the Object changed direction and went returned the direction from which it came! I was asking her whats it doing now when she told me I looks like something just came out of it! she described this to me later as if it had dropped a very faint light the brightness of which was no more than the faintest star out that night but which traveled directly from below the object but lost sight of it before it would of been at ground level. By this point we was going through the many underpasses of 71 and downtown columbus and was unable to view the object any longer. The rest of the 2 hour trip home we talked about what we had just seen and the things that we wished we could of done diffrently, I for one wished I would of pulled over but thinking back I had thought about this but up till the time it was directly over us I thought it would continue its course to the south east and I would see It again and there would be better view of it. I have thought abut this alot today and the cant get it out of my mind and thats one reason I am reporting it here. Also to give a little info about myself. I am former military and have been around many aircraft and military bases.. and this wasnt anything I have seen before..Choppers..Jets..or flairs..! Also there was NO NOISE HEARD BY EITHER OF US! Also I asked her how big it was when it was directly over us and asked her to draw its size as it appeared to her. She said it was the size of the 8x10 piece of paper held at arms length! ...I know this doesnt show the height of the object or the size but it does show the clarity of the sighting and the visibility of the triangular outline. She also stated to me after asking that if she had to say what it was made from it would be a dark dull metallic and Definetly Solid!"],"Source":"MUFON","City":"Columbus","Region":"Ohio","Country":"United States","Object Features":"Undisclosed","Viewing Distance":"Unknown"}