{"trends":["There have been 4 other sightings in Coolidge","There were no other sightings in Coolidge on or around August 8th 2010","This sighting has never been favorited.",""],"Date of the Event":"08/08/2010 09:30 UTC","Date Submitted":"08/09/2010 02:52 UTC","Longitude":"-111.510344","Object Flight Path":"Path then hovering","Summary":"It looked like a star but was much different and moved erratically.","files":["/var/www/straped/mufon/html2text/25031.html.txt","/var/www/straped/mufon/more/25031_submitter_file1__080810_01A.jpg","/var/www/straped/mufon/more/25031_submitter_file2__080810_2.jpg","/var/www/straped/mufon/org/25031.html"],"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=32.980589,+-111.510344(25031)&iwloc=A&hl=en\"> mufon case (25031) map </A>","Object Features":"Other","Sighting Duration":"00:45:00","Source":"MUFON","Tags":"City","Region":"Arizona","Log Number":"US-08092010-0003","Weather Factors":"None","Disposition":"IFO","divs":["Sighting DetailsWe were watching the sky as relaxation. We noticed a triangular star-like object that would blink out after a few minutes and then move about 10 to 15 degrees to the east and then blink back on. We observed this for a period of about 45 minutes. Each time the object would blink out and come back extremely bright. Looking through the binoculars, the object had colors within it and smaller star like white objects 3 to the left and one to the right of it. The colors were as follows top was blue-green, middle was bright white, lower left was red, lower right was green. It appeared to move drastically and erractically to the south each time. Attached is a zoomed pic of what we saw. There was slight cloud cover, but it was not around the area where we saw the object. We have seen this object for several nights but had not noticed it moving the way it did this evening. Rather odd. May just be an anomaly, but thought we should report it anyway."],"City":"Coolidge","Country":"United States","Case Number":"25031","Viewing Distance":"Over One Mile","Latitude":"32.980589"}