{"Date Submitted":"08/09/2010 01:13 UTC","Weather Factors":"Unknown","Longitude":"-71.032828","Case Number":"25030","map":"<A HREF = \"http://maps.google.com/maps?q=42.391764,+-71.032828(25030)&iwloc=A&hl=en\"> mufon case (25030) map </A>","files":["/var/www/straped/mufon/html2text/25030.html.txt","/var/www/straped/mufon/org/25030.html"],"Disposition":"Hoax","Summary":"I was visited while I was trying to fall asleep.","Viewing Distance":"20 Feet or Less","Latitude":"42.391764","Object Shape":"Sphere","Object Flight Path":"Other","Object Features":"None","Country":"United States","City":"Chelsea","trends":["There have been no other sightings in Chelsea","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsWhen I went to bed my wife was already sleeping. As i laid there trying to fall asleep, I started hearing child like foot steps with shoes on. At the time my 2 year old daughter was in her crib sleeping which was located in the rear end of the Apartment and our bedroom was located in the front. I had my back toward the back of the the apartment. As I continued to hear these steps walking back and forth I was thinking that it could not be the baby because she could not clime out of the crib, much less put her shoes on and walk around the apartment. By now I was starting to worry because I couldn't figure out what the hell was going on, all I know is that I could hear the steps walk up behind me then turn around and walk away again. On about the third time I heard the steps come up to me and spotted. Within a few seconds I heard the voice of a young female tell me in Spanish, \"Roberto don't be afraid we are good spirits.\" At that point I panicked and tried to turn around to see what was going on but some kind of force was preventing me from turning around. I was scared but I was determined to see what was behind me. As I continued to struggled with all my strength I was able to look behind me and I saw what appeared to be two translucent spheres purplish in color havering over me. Now my fear turned to terror and I tried to turn around so I could reach out to my wife but again I was struggling with this invisible force. After what it seemed to be about 10 to 15 minutes, I was able to wake up my wife who got scared after I explained what had taken place. I then grabbed my kid and my wife and ran upstairs where my Mom lived. Although they identified themselves as spirits, I believe that I was visited by Aliens because when the voice spoke it was in Spanish, and my primary language is English. I also remember that I went to bed 1AM, and when we went to my Moms it was 3AM. And I strongly believe that something has watched over me for most of my life. I even have a foreign object in my had which is suppose to be the tip of a pencil and from what I've heard my body should have rejected the object."],"Date of the Event":"07/15/1977 12:00 UTC","Region":"Massachusetts","Log Number":"US-08092010-0002","Source":"MUFON"}