{"Weather Factors":"Does Not Apply","trends":["There have been 3 other sightings in Valley Springs","There were no other sightings in Valley Springs on or around November 30th 2004"],"Source":"MUFON","Case Number":"25032","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Green glowing cylinders 50 feet long covered in mist in a circular pattern with UFO passing thru it.","map":"<A HREF = \"http://maps.google.com/maps?q=38.196506,+-120.827303(25032)&iwloc=A&hl=en\"> mufon case (25032) map </A>","Region":"California","files":["/var/www/straped/mufon/html2text/25032.html.txt","/var/www/straped/mufon/org/25032.html"],"Date of the Event":"11/30/2004 10:00 UTC","Country":"United States","Disposition":"Unknown","Log Number":"US-08092010-0004","Date Submitted":"08/09/2010 03:17 UTC","divs":["sighting detailsi was sitting in my truck around 10 pm next to a 40 foot long aluminum storage container on my 3 acre property i had just sold. i was thinking about how i would have liked to have kept my lot but was buying out a partner on another house. i saw a flash of bright light and thought it was a plane crashing into the mountaintop where i was. i realized it was a series of glowing cylinders that was covered in a mist individually. the total area was twice the size of a house. the sound it made was a roar like niagara falls almost deafening even inside my truck. their was another craft that was entering the 'doorway' it was gold\\brown\\yellowish and reminded me of a broken mirror. the craft was shaped like a rugby football. i only saw the front half of the 2nd craft i believe from the reflective light of the first craft. the 2nd craft appeared to be floating and as it entered the doorway they both disappeared. the craft was directly in front of a former astronaut's house which i thought was an incredible coincedence. i asked him about it later and he said he did not know what i was talking about but showed no surprize, amazement, or suspicion which i thought was a very odd reaction to the wildest story he ever heard. i had been selling the lot and their were two dogs that barked at me constantly. but they were not barking then and i got out of my truck because i expected people to come outside to see what the commotion had been about but no one came outside and i am absolutly sure people would of came outside to see what the roar was about. there were about about 10 homes in visual sight. i think the dogs and people were put to sleep and the aluminim storage container made a barrier to keep me conscious. i have seen 3 other craft in the area. 2 sightings were a green glowing ball of light floating at sunset along the mountain tops. 1 was a flash of light in a figure 8 shape 10 pm when i was playing basketball in the dark. that only lasted 1 second but enough to see it slide as it tuned like it was on wet plastic. i have heard other stories of sightings in the area and believe it is a portal doorway to another place. a pilot told me of some very unusual experiences he had but do not want \"you know who\" to question me because i believe they are very aware of this area. i did see an description on a discovery in the egyptian pyrmids that remined me of this doorway and she described it as a symbol for a doorway into another dimension. but i could not find her website later."],"Latitude":"38.196506","Longitude":"-120.827303","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Window(s)","Object Shape":"Cylinder, Oval","City":"Valley Springs","Object Flight Path":"Stationary,Straight-line path"}