{"map":"<A HREF = \"http://maps.google.com/maps?q=38.906114,+-95.816097(25046)&iwloc=A&hl=en\"> mufon case (25046) map </A>","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Weather Factors":"None","trends":["There have been no other sightings in Auburn","This sighting has never been favorited."],"Date of the Event":"08/08/2010 08:30 UTC","Region":"Kansas","files":["/var/www/straped/mufon/html2text/25046.html.txt","/var/www/straped/mufon/org/25046.html"],"Longitude":"-95.816097","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","Log Number":"US-08092010-0018","Summary":"Cigar Shaped object passed over-head very fast and silent.","Source":"MUFON","Disposition":"Unknown","Latitude":"38.906114","Date Submitted":"08/09/2010 07:46 UTC","City":"Auburn","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Cone, Cylinder","divs":["Sighting DetailsIt was about 8:30 pm sunday, August, 8, 2010. I was sitting on my front porch, which faces west, having a cigarette and looking at the sky as I often do around sunset. Something caught my eye directly overhead, it was a large shiny cigar or cylinder shaped object and appeared to be going very fast traveling east to west. At first I thought it was just an airplane, but I quickly realised that I could not see any wings or hear any sound from it (and Auburn, KS is a small quiet comunity), so I thought it must be at a very high altitude, but it did not leave the usual con-trail that 767's and such leave at high altitude and looked to be twice the length, On top of that 767's that high up appear much slower and can usualy still be heard. The object continued west until I could not see it over the trees lasting about 1 min or less. Now here's the thing, most of us out here can tell 767 from a KC-135. The 190th Air Refuling Wing (The Kansas coyotes) opperates out of Forbes Feild about 7 miles north of here so air trafic is very common over here, mostly KC-135s and other military craft, I have seen or studied most all known aircraft and this had none of the usual characteristics, I don't claim to know what it was but I know what it was not, it was not a conventional airplane. If any one else in the area has seen this or photographed it I would like to hear about it."],"Case Number":"25046"}