{"Longitude":"-89.031776","Region":"Wisconsin","Summary":"Two distinct flashes directly in front of Moon.","divs":["Sighting DetailsDriving along highway 213 heading south and looking east I observed 1 flash over the setting Moon, low on the horizon. A few minutes later, I observed another distinct flash over the setting moon, almost in the same area. Flashes were not bright, but diffuse as if very far away. The light emitted seemed to be white. My first thought was satellites turning and catching some of the early rays of the rising sun, but the flashes were faint, medium in size and diffused. My second thought was military craft or maneuvers, or the flash of some space junk or rock entering earths atmosphere. However, I thought it was odd that there were two flashes in the same exact area, and right in front of the moon. I did not stop, but continued to observe the area, but did not see any other flashes. At the time, there were no airplane lights present anywhere to the east that I could observe, either before or 10-15 minutes afterward. I have never seen anything quite like that before and thought it was odd. I do spend a considerable amount of time stargazing and am familiar with many of the things that appear in the night sky. This was new."],"Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.508348,+-89.031776(25049)&iwloc=A&hl=en\"> mufon case (25049) map </A>","trends":["There have been 4 other sightings in Beloit","There were no other sightings in Beloit on or around August 7th 2010"],"files":["/var/www/straped/mufon/html2text/25049.html.txt","/var/www/straped/mufon/org/25049.html"],"Date of the Event":"08/07/2010 05:15 UTC","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","City":"Beloit","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"25049","Object Shape":"Flash","Latitude":"42.508348","Date Submitted":"08/10/2010 12:56 UTC","Disposition":"Unknown","Country":"United States","Log Number":"US-08102010-0002"}