{"Latitude":"37.967203","divs":["Sighting DetailsThis is the story of two college hallmates in late 1965 - early 1966. The two gals and their boyfriends had gone to an outlying small town to help a pastor. Upon their return to Springfield mid-evening they were traveling down a tree lined dark road. The two gals said that they all suddenly saw a bright light that hovered over their car - the car stopped dead, their watches died and the car radio died. It seemed like an eternity they said as they cowered in the car. The craft hovered over them for about a minute (?)and then wisked away. The car started as did their watches and the car radio. I had the impression of a disk shaped craft but don't rememer specifically. These two gals were anything but crackpots and were scared to ghostly shade of white while recounting the story. I never heard them speak of it again. Had one gal not been such a stable, logical and serious individual, I might have passed it off but the incident has popped up in my mind periodically. Recently, I was watching a History Channel program on UFOs and heard the name of your organization and contacted the Asst. State Director of Missouri MUFON - she said that even though it was old information there may have been other witnesses. Wish I had knowledge of MUFON before I moved from Denver, I might have been more involved. I'm coming back someday - hopefully soon as I find a job. Witnesses: (3 were planning to be missionaries and one a pastor) None of the witnesses were given to hysterics or fabication, so I have no doubt that they were telling the truth. Wish I could give you more precise information but it has been 40+ years - yet their frozen ghostly faces stay in my mind."],"Log Number":"US-08092010-0019","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.967203,+-91.826063(25047)&iwloc=A&hl=en\"> mufon case (25047) map </A>","Sighting Duration":"Undisclosed","Longitude":"-91.826063","Date Submitted":"08/09/2010 08:52 UTC","Viewing Distance":"20 Feet or Less","Tags":"City","Region":"Missouri","Date of the Event":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25047.html.txt","/var/www/straped/mufon/org/25047.html"],"Weather Factors":"Unknown","Summary":"Bright light that hovered over a car on a back roads highway.","Case Number":"25047","Source":"MUFON","trends":[],"Object Flight Path":"Hovering then path","Object Shape":"Unknown","Country":"United States","City":"Undisclosed"}