{"Country":"United States","files":["/var/www/straped/mufon/html2text/25041.html.txt","/var/www/straped/mufon/more/25041_submitter_file1__JULY31-2010010.EDITEDjpg.jpg","/var/www/straped/mufon/org/25041.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.296016,+-72.38453(25041)&iwloc=A&hl=en\"> mufon case (25041) map </A>","Case Number":"25041","Date Submitted":"08/07/2011 04:06 UTC","Log Number":"US-08072011-0079","Object Flight Path":"Straight-line path","Region":"Connecticut","Summary":"Four round red-orange objects 5 minutes apart.","Sighting Duration":"Undisclosed","divs":["sighting detailsdate: july 31, 2010 location: connecticut coastline overlooking long island sound. time: approximately 9:45 pm i was standing outside looking at the water and the sky, and noticed a large round red\\orange object in the sky moving from the east and traveling west. it appeared to have tear drop or flower petal shapes which pointed toward the center. it maintained the same speed until close to directly overhead, and then increased speed rapidly while moving to the west and climbing. as it seemed to gain altitude the size became smaller until it was out of sight. i went in to the house and got my digital camera and brought two other people out with me. about three to five minutes later the three of us witnessed the same thing. in all, there were four sightings almost exactly as described above. i was able to get a few pictures. only one came out well enough to see a discernable shape. the others were blurred due to my not holding the camera steady enough. the digital photo did not show the petal shapes, however it does show something like a red\\orange fireball."],"Object Shape":"Circle, Fireball","Date of the Event":"07/31/2010 09:43 UTC","Disposition":"IFO","Weather Factors":"Unknown","Latitude":"41.296016","Longitude":"-72.38453","trends":["There has been one other sighting in Old Saybrook","There were no other sightings in Old Saybrook on or around July 31st 2010","This sighting has never been favorited.",""],"City":"Old Saybrook","Object Features":"Patterned Surface","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City"}