{"divs":["Sighting DetailsAug 7, 2010 aproximately 8:30 pm My wife and I were in the park on the north side. She could not see the object with her naked eyes and never saw it. I described what I was seeing to her. Evening daylight, almost due east, a huge towering cloud with an anvil top that was discharging lighning. The cloud was glowing brightly at the top because of the setting sun. It was about 10 miles or more from us. I was looking at it with my highpower binculars and noticed a shinney black dot or oval shape appear right next to the cloud. It was located just above the middle of the towering storm cloud. It stayed it that position for maybe one minute then went into the cloud. It was in the cloud maybe thirty or forty seconds, then came out at the same position along side of the cloud. It stayed there for for over a minute, then moved off around the noth end of the cloud, turning to the north east and leasurly went that direction untill is was out of sight. Aug 8, 2010 about 9:00 We were at our favorite spot again in the park. I was getting dark and a extremely intense light started approaching us from the south west, It looked to be maybe a half mile away when it stoped and just stayed in the same position for what seemed like three minutes. Then it went out. It looked like it was only a hundred feet from the ground. We saw what looked like light aircraft pass by with their marker lights on just shortly aftward. They were slightly to the south of where the object was only at a higher altitude. Side note There was a NOTAM posted the the Dallas, Collin and some srounding areas were in a no fly zone for a period of time today Aug 9, 2010. The reason I received this NOTAM is because I fly RC Aircraft."],"Object Flight Path":"Undisclosed","Disposition":"IFO","Date of the Event":"08/07/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.198636,+-96.630022(25048)&iwloc=A&hl=en\"> mufon case (25048) map </A>","Case Number":"25048","Country":"United States","Object Shape":"Sphere","Log Number":"US-08102010-0001","City":"McKinney","Date Submitted":"08/10/2010 12:53 UTC","Weather Factors":"Unknown","Latitude":"33.198636","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around August 7th 2010"],"Summary":"Black sphere going in and out of thunder head cloud.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/25048.html.txt","/var/www/straped/mufon/org/25048.html"],"Object Features":"Undisclosed","Source":"MUFON","Region":"Texas","Longitude":"-96.630022"}