{"Source":"MUFON","Summary":"1 UFO splits into 2 and then little ones going in and away from it, then little ones disappeared, then the bigger one after a few minutes left too.","trends":["There have been 8 other sightings in Goodyear","There were no other sightings in Goodyear on or around April 28th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsWent outside to take pictures of a fire west of Cotton Lane, looking to the southwest I noticed a big, bright strobe,fast moving object, beyond and above Amazon.com warehouse towards the western end of the Estrella mountains. Its movements were very sporadic with the smaller lights being bright prism like. The smaller ones moved back and forth from the larger one as if playing tag with one another, while in various groups forming different patterns. It is difficult to explain due to the fact that it was like nothing I'd ever seen before. I do have an amateur video, taken myself, of that event, with my Sony Digital Handycam. If you are interested in the video, please come and see it, it is saved on my digital handycam and I'm afraid of losing the footage by transfering it to my laptop, as I'm not very computer savy. I have attached the 2 photos that I have. Thanks so much!!"],"Tags":"City","Object Shape":"Cross, Fireball, Flash, Sphere","Case Number":"25051","Log Number":"US-08102010-0004","map":"<A HREF = \"http://maps.google.com/maps?q=33.454306,+-112.349434(25051)&iwloc=A&hl=en\"> mufon case (25051) map </A>","Longitude":"-112.349434","Disposition":"IFO","Object Features":"None","Country":"United States","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","City":"Goodyear","Latitude":"33.454306","Sighting Duration":"Undisclosed","Date of the Event":"04/28/2009 10:15 UTC","Date Submitted":"08/10/2010 04:23 UTC","files":["/var/www/straped/mufon/html2text/25051.html.txt","/var/www/straped/mufon/more/25051_submitter_file1__1.JPG","/var/www/straped/mufon/more/25051_submitter_file2__2.JPG","/var/www/straped/mufon/org/25051.html"],"Weather Factors":"Unknown","Region":"Arizona"}