{"Viewing Distance":"Over One Mile","Object Shape":"Fireball","Weather Factors":"Lightning, Light","map":"<A HREF = \"http://maps.google.com/maps?q=33.250004,+-111.625299(25058)&iwloc=A&hl=en\"> mufon case (25058) map </A>","Summary":"Fireball let loose a smaller round orb","files":["/var/www/straped/mufon/html2text/25058.html.txt","/var/www/straped/mufon/org/25058.html"],"Longitude":"-111.625299","Sighting Duration":"Undisclosed","Log Number":"US-08102010-0011","Region":"Arizona","Date Submitted":"08/10/2010 11:10 UTC","Country":"United States","trends":["There have been 21 other sightings in Queen Creek","There was one other sighting in Queen Creek on or around August 5th 2010"],"Date of the Event":"08/05/2010 12:00 UTC","divs":["Sighting DetailsI had picked up my daughter (approx. age 25) from the hospital and was driving her home. Her friend (approx. age 25) was with us also. We stopped at a drugstore at the corner of Power and Queen Creek Roads to fill a prescription and as we started driving south down Power Road toward Ocotillo Road I saw a flash out of the corner of my eye. I looked to the left (east) and saw a fireball streaking across the sky, coming from the south. It had a short, fiery tail but no smoke or debris was present. The color was pure white with a bluish tinge. I thought at first it must be a meteor. There was no sound. A smaller white orb seemed to drip (drop?) from it and maintained a circular shape down to the ground; still no sound. The bigger fireball then seemed to be under power and veered off to the east, in the direction of Picket Post Mtn. It was under 10k feet in altitude and did not arc toward the ground but maintained a lateral trajectory. All 3 of us saw this display. I have seen meteors before and this was not a meteor. I am narrating this story to Stacey Wright of Phoenix MUFON; I give her permission to tell my story as I wish to remain anonymous. The weather was partly cloudy, no wind, lots of lightning. All 3 of us were highly excited and screaming inside the car. We couldn't believe it happened so fast and was then just GONE!"],"Object Features":"Unknown","Tags":"City","City":"Queen Creek","Source":"MUFON","Latitude":"33.250004","Object Flight Path":"Straight-line path","Case Number":"25058","Disposition":"Unknown"}