{"Longitude":"-4.312131","Tags":"City","Latitude":"51.85762","Country":"United Kingdom","Date Submitted":"08/10/2010 09:23 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"GB-08102010-0005","divs":["Sighting DetailsLying on my settee in the living room watching TV - curtains not drawn I suddenly saw what appeared to be about 9 large round orb lights slowly passing in the night sky, just above horizon level - they were moving in a \"V\" formation. I was so stunned - I jumped up and ran through the hall shouting to my partner Don to come and take a look - he rushed out with me to the sun room and they were still visible, we went out of the back door and watched - we could hear no noise, saw no flashing lights (it was a very still night - we live in a remote part of West Wales). The lights moved to a single file formation and simply disappeared, one after another - maybe into cloud, but there was no moon, so it was difficult to see if there were any cloud formations. Since this happened I have been trying to research what we saw, and am surprised to find that there have been other similar sightings. I would just like an explanation. It may well be that the military have secret craft that they take up and test - but I do not believe this was so. I still cannot stop thinking about it!! Unfortunately, I did not think of grabbing my camera - I would have had more than enough time to have taken photos."],"Disposition":"Unresolved","trends":["There has been one other sighting in Carmarthen","There were no other sightings in Carmarthen on or around August 2nd 2010"],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/25052.html.txt","/var/www/straped/mufon/org/25052.html"],"Region":"Wales","Object Shape":"Circle","Case Number":"25052","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"08/02/2010 10:15 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=51.85762,+-4.312131(25052)&iwloc=A&hl=en\"> mufon case (25052) map </A>","City":"Carmarthen","Summary":"Approx. 9 large round orbs."}