{"Log Number":"US-08122010-0008","trends":["There have been 2 other sightings in Lynden","There were no other sightings in Lynden on or around August 11th 2010","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","Summary":"3 bright lights passed over my head.","Weather Factors":"Unknown","Date of the Event":"08/11/2010 09:45 UTC","Case Number":"25077","files":["/var/www/straped/mufon/html2text/25077.html.txt","/var/www/straped/mufon/more/25077_submitter_file1__UFO_Render.png","/var/www/straped/mufon/org/25077.html"],"Source":"MUFON","Longitude":"-122.445527","Latitude":"48.949634","Country":"United States","Object Features":"None","Object Flight Path":"Hovering then path","Object Shape":"Triangle","Viewing Distance":"20 Feet or Less, 21-100 Feet","City":"Lynden","Region":"Washington","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=48.949634,+-122.445527(25077)&iwloc=A&hl=en\"> mufon case (25077) map </A>","Sighting Duration":"00:05:00","Date Submitted":"08/12/2010 09:10 UTC","divs":["Sighting DetailsI was waking home from work, looking at the night sky. I read in the news that 3 planets would be visible (Venus, Mars, Saturn). So I saw 3 bright lights to the East and assumed it was the planets. I watched them while I was walking and noticed that the lights were in fact quite close to me. I tried to figure it out and realized that the lights were hovering over a nearby gas station. They then proceeded to move above my head and beyond the trees. No sound was made from the craft. I feel like the craft was quite large (about the size of the gas station). As it passed over my head, it was also rotating. The rotation was quite slow, not even completing a full revolution before it passed beyond my view. Despite seeing this, I still don't believe in Aliens. But I remember thinking that I should not be seeing the object at all, because of my strong belief that extraterrestrials don't exist. I tried to rationalize it by thinking it may have been 3 airplanes in a close formation. However, stars were blocked out in the middle of the assumed formation, which led me to believe it was a ufo. Upon some research, it would appear that this \"black triangle\" ufo is a common sight. However, most sightings include a large light in the center of the object. This is not the case in my sighting. I have included a 3D render of the object as best to my memory. THIS IS NOT A PHOTOGRAPH. I will be outside at the same time tonight, with my camera ready. Although, I have high doubts of ever seeing it again."]}