{"Latitude":"41.584719","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.584719,+-87.491481(25073)&iwloc=A&hl=en\"> mufon case (25073) map </A>","trends":["There have been 8 other sightings in Hammond","There were no other sightings in Hammond on or around August 12th 2010"],"Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Case Number":"25073","City":"Hammond","Country":"United States","Region":"Indiana","Object Features":"Unknown","Date Submitted":"08/12/2010 02:08 UTC","Object Shape":"Circle","divs":["Sighting DetailsMe and my buddy were in my garage smokin some cigs, he got thirsty so we both went to go get some water. As soon as i opened the garage door and we stepped out, I looked up and saw a bright green circle zoom from above me to behind the treeline in front of me to the west. Right away i knew i had experienced a ufo sighting. My heart was pounding and i was so excited. I told my buddy what i had seen, he thought i was playing a joke on him so i made him stand there with me to see if we could see any more. Within five minutes, we had counted 6 or 7 ufos. The first one i saw was the bright green circle, it had vanished behind the trees in the west. After that, the other ufos were smaller or farther away, and they were all flying so fast it was hard to spot them out. But they came from all directions. They were all moving fast and curving upward. Me and my buddy saw one ufo at the same time, it zoom across the sky from north to south and had a yellowish light with a trail. All the others were seen by either me or him. But the smaller ufos had trails behind them and my buddy described one that was shining bright blue. They reminded me of shooting stars but couldnt have been because they were curving and turning every which way. i couldnt tell the shape of the smaller ufos but they gave off a bright white or yellow light. we only saw one green one and one blue one. I know what i saw. And my friend is my witness."],"Source":"MUFON","Summary":"Bright green light followed by smaller UFOs.","Disposition":"Unknown","Date of the Event":"08/12/2010 02:15 UTC","Log Number":"US-08122010-0004","files":["/var/www/straped/mufon/html2text/25073.html.txt","/var/www/straped/mufon/org/25073.html"],"Longitude":"-87.491481"}