{"Viewing Distance":"Unknown","Tags":"City","Object Features":"Undisclosed","Longitude":"-86.098623","Weather Factors":"Unknown","Latitude":"39.619838","files":["/var/www/straped/mufon/html2text/25070.html.txt","/var/www/straped/mufon/org/25070.html"],"Object Flight Path":"Undisclosed","Date of the Event":"08/11/2010 11:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.619838,+-86.098623(25070)&iwloc=A&hl=en\"> mufon case (25070) map </A>","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around August 11th 2010"],"Region":"Indiana","Summary":"Bright like a planet but doesn't blink like a plane.","Country":"United States","Log Number":"US-08122010-0001","divs":["sighting detailsi'm sitting outside with my best friend \"k\". just smoken a ciggerate. its about 10:30pm. we are just talking and i noticed this star. it was super bright. thought it was just a planet cuz none of the other stars i see in the sky are that bright. only planes get thats bright around my house. its wasnt blinking red or blue but it was orange and white. i thought oh its probly a blimp or a helocoppter or something else. so i shruged it off. that was the first time i had seen it. this happenes for the next few nights. over and over again around 10 to 11pm when i go to smoke. i didnt really think about it, untill recently, it just was always there.. so ive done alot of research, looked up alot of stuff on stars and the area the solar system is at. its not a planet. its not a plane. its not a satilate. so this was the only other concustion i could come up with. so i borrow my dads benockuarls. and i freak out. its nothing like ive ever seen before. it was shinny and was glowing orange and white. then out of nowhere it just dissapers. i was floored. ive never been this scared in my life. so i started talking to my friend *(name deleted--sgonzalez\\cms) about it. thing is.. he's been seeing it to. and so has my neighbors. so how is all these people near me seeing the same thing? so as i had said it dissapeared. the last 3 days i havent seen it. tonight, augest 11th at 10pm i go out to get a cigg, and there it is. and im scared it might actually be real. just sitting there watching me. ive never been this scared in my life. its still there too. hasnt moved yet. i think it knows im talking about it. what am i suppose to do?"],"Date Submitted":"08/12/2010 02:42 UTC","Source":"MUFON","Disposition":"IFO","Object Shape":"Circle, Other","City":"Greenwood","Sighting Duration":"Undisclosed","Case Number":"25070"}