{"City":"Redding","Case Number":"25076","Summary":"Over 15 sightings in Northen California in 6 weeks.","Weather Factors":"Unknown","Longitude":"-122.385775","Object Shape":"Cylinder, Square, Rectagular","Object Flight Path":"Undisclosed","Log Number":"US-08122010-0007","trends":["There have been 39 other sightings in Redding","There were 2 other sightings in Redding on or around August 11th 2010"],"files":["/var/www/straped/mufon/html2text/25076.html.txt","/var/www/straped/mufon/org/25076.html"],"Sighting Duration":"08:23:00","Date of the Event":"08/11/2010 08:23 UTC","Tags":"City","Object Features":"Undisclosed","Region":"California","divs":["sighting detailsyesterday august 11, 2010 at 8:23pm a large rectangular or possibly cylindrical object appeared in the sky moving northward. at first i thought it was a jet plane but then realized it wasn't as it moved differently and was white in color. there were colored light on this celestial object but it was not strobing at all. as it moved in a northward direction it did its usual flash of light indicating it's ready to go out of our atmosphere and it is exactly what it did. after the flash of star like light, it just moves in a straight out direction, not up or even curving upward but straight out on an angle, fading a little bit until it just turns into a star and disappears. i've had over 15 sightings since my first two of this year june 27th which i reported here but now i know that there is so much activity and if i were to watch every night, i know i would see them. this particular sighting was in bright daylight still. it was not dark although it was approaching dusk. i see these celestials day and night and mostly around the times of 8:30pm and also between 11 and 11:45pm i am writing more about these sightings on my blog at *(link moved to additional evidence section below--sgonzalez\\cms). . just trying to make sense of all this. i know there is lots of activity and there is a reason for it. be ready my friends."],"Date Submitted":"08/12/2010 08:57 UTC","Disposition":"Insufficient Data","Country":"United States","Latitude":"40.59608","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.59608,+-122.385775(25076)&iwloc=A&hl=en\"> mufon case (25076) map </A>"}