{"Object Flight Path":"Straight-line path","Object Features":"Unknown","City":"Mali Losinj","files":["/var/www/straped/mufon/html2text/25078.html.txt","/var/www/straped/mufon/org/25078.html"],"Summary":"Four shifting orange-red lights fly in strait line across the night sky.","Disposition":"Unresolved","Case Number":"25078","trends":["There have been no other sightings in Mali Losinj","This sighting has never been favorited."],"Tags":"City","Country":"Croatia","Date of the Event":"08/13/2010 01:10 UTC","Longitude":"14.470761","Sighting Duration":"00:00:03","Log Number":"HR-08122010-0009","Latitude":"44.530797","Region":"Primorje-Gorski kotar","Date Submitted":"08/12/2010 10:34 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.530797,+14.470761(25078)&iwloc=A&hl=en\"> mufon case (25078) map </A>","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsIt was little past 1am. I came to my house in Mali Losinj, Croatia and went to the balcony looking at the sky in hope to see a meteor. The date was 13th of August 2010 (according to the news the peek of meteor shower). The sky was clear with some thick storm clouds on the horizon to the west and lighter clouds closer to me west. After a few moments of gazing up I saw a group of four lights fly westward and disappearing behind clouds. The lights were orange-red color, not bright and not points but more like small circles (something like small discs of red-hot metal..even the color). At first they were in a square shape (like number 4 on a dice) 1 forward, 2 in the middle and 1 back. As they moved the shape became more elongated. It was night so I didn't see an actual object these lights belonged to, but if you draw four circles on a piece of paper and look at them from different angles you will get the idea of the thing I saw. The lights were very close together, all 4 in the area moon covers on the sky. When I saw them they were at NW, elevation about 60-70 degrees. They were flying in a strait line roughly from ENE to WSW. It all lasted for 2-3 seconds. I don't know how high they were, but they were very fast. There was no sound I could relate to this. My opinion is this a flying object with four engines on the more or less flat lower part that flew strait but did a rolling movement to the left. It didn't make any sound so it was either very high and in that case inhumanly fast and inhumanly big, or very low and in that case inhumanly silent and still very very very fast. I think it was not very high. My first impression was that it was some projection from land because it looked a bit like that red laser dot used for indication during presentations. I called my mother but it was long gone by the time she came to the balcony. It is possible that some other people saw this because it was announced in the newspapers that there will be a meteor shower so many romantic eyes must have been pointed upwards that night. I felt happy I saw something strange."],"Object Shape":"Diamond, Unknown"}