{"Longitude":"-2.795877","Country":"United Kingdom","Object Shape":"Flash, Star-like","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","divs":["Sighting DetailsWhilst watching the Persied meteor shower and as you do looking for meteors. I was watching it with my step mum and we both noticed a bright light comparable to that of jupiter but at this point jupiter was on the opposite side in the sky, noticing it we thought it was a meteor. But it was to bright and to slow. I ran in to get my Dad when by the time we got there it was but a faint red dot. The object orginated at about '13 Hours right acension' or in the south west it then moved whilst fading towards the north and fully faded at about '10 hours right ascention' or in the west moving from 'Hercules' towards 'Ursa Major'. After it reached the '10 hour mark' it then began to in short move under it's own influence power. It was not an atmospheric craft such a craft would've been obvious. Upon much thought not even space debris could've caused such a bright event and even if it was it could not have faded to such a dim magnitude. It was an exhilerating experience I had to get as many people to see it as possible. After about 3 minutes of flying about the '10 hour mark and 30 degrees up' it seemed to start buzzing like a fly around a light bulb and then instead of one faint red dot I saw 6 they all flew off except one which stayed and then flew over the otherside of the sky towards jupiter at which point I lost all sight of the object and was unable to point out anymore. And at about 00:13 another object in the same place it stopped at 10 hours and 30 degrees it flew back towards hercules got brighter and dissapeared."],"Region":"England","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25075.html.txt","/var/www/straped/mufon/org/25075.html"],"Summary":"Flash moving slow across sky fading to faint dot.","Date of the Event":"08/12/2010 11:57 UTC","Log Number":"GB-08122010-0006","trends":["There have been no other sightings in Crewkerne","This sighting has never been favorited."],"Sighting Duration":"00:16:00","City":"Crewkerne","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=50.883008,+-2.795877(25075)&iwloc=A&hl=en\"> mufon case (25075) map </A>","Latitude":"50.883008","Date Submitted":"08/12/2010 07:43 UTC","Tags":"City","Weather Factors":"Unknown","Case Number":"25075","Viewing Distance":"Unknown"}