{"Longitude":"-122.69487","divs":["sighting detailsmy family was in a trance, none of them have any memory of the encounter, but i do. i know it was a angel i talked to he had blonde hair and gray eyes. he told me do not fear, i replied i wasn't affraid. 4 -n 5 hours went by that i do not remember. then in 1994, i saw a show on television, it was called u.f.os over telaviv.. the u.f. o. i saw had a sign depicting the trinity the new jeruselum on the new world. eph - 2 verse 2 satan is the prince of the power of the air (atmosphere). the first heaven is air where the birds fly the second heaven are the stars in the night sky, the third heaven is where god resides. the little gray goomers with the big eyes are satan's demons. the c.i.a. and hollywood made up the name e.t.s, there are no such thing as aliens, but people being abducted, are only being taken vbecause they do not have the holy spirit abidding in them. if they have the holy spirit the demons know who jesus is and they will not take you. i know without a shadow of a doubt the lord and the angels have given me this information, i did not study it. if you come to the lord the demons can't touch you. what i am saying is the truth all of my information is in the bible. my name is [name deleted\\cms\\tg]. i grew up in silverdale, wa and i will gladly explain what i know to those interested. thank you"],"Date of the Event":"06/30/1958 12:00 UTC","Case Number":"25088","Weather Factors":"Unknown","Region":"Washington","Object Features":"Window(s), Other","Tags":"City","Source":"MUFON","Summary":"The Summer of 1958 My family and I had an encounter with a U. F.O.","Log Number":"US-08132010-0009","trends":["There have been 5 other sightings in Silverdale","There were no other sightings in Silverdale on or around June 30th 1958"],"Date Submitted":"08/13/2010 04:46 UTC","Country":"United States","Viewing Distance":"21-100 Feet","City":"Silverdale","Object Flight Path":"Hovering then path","Object Shape":"Cylinder","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25088.html.txt","/var/www/straped/mufon/org/25088.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.644539,+-122.69487(25088)&iwloc=A&hl=en\"> mufon case (25088) map </A>","Latitude":"47.644539"}