{"Tags":"City","Disposition":"Insufficient Data","Case Number":"25085","Source":"MUFON","Date Submitted":"08/13/2010 12:26 UTC","Object Flight Path":"Straight-line path,Path then hovering","Region":"California","trends":["There have been 39 other sightings in Redding","There were 2 other sightings in Redding on or around August 12th 2010"],"divs":["Sighting DetailsWhile I was on the cellphone with a friend I was in my back yard pool side when I was looking up at the starry sky. I then saw a moving star which I knew was one of the celestial's I have seen for almost two months now. This star moved northward at a semi fast pace when it brightened, like the others but this time it remained still or it stopped, brighter than it started out. Usually when they do this it gets ready to go out into outer space but this time it stopped brightly lit as if it was waiting for me to see it or ... it felt like it was looking back at me. I tried taking a snapshot with my cell phone but if you on it talking the camera wont function. SO I hung up on my friend and tried to take the snapshot but as I readied the camera it began moving outward. I can tell because I have seen over 15 of these craft over the course of two months and they go outward as the ship brightens. It seems that this is what it does just before it takes off... the propulsion maybe?? Anyway, this is daily now... I'll report later tonight about the sighting to come on Friday the 13th... it should be a doozy! Be on the lookout if you're in the Redding area. Look west all the way up and out to the northern sky."],"Date of the Event":"08/12/2010 09:45 UTC","Log Number":"US-08132010-0006","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Shape":"Star-like","Latitude":"40.58843","City":"Redding","files":["/var/www/straped/mufon/html2text/25085.html.txt","/var/www/straped/mufon/org/25085.html"],"Country":"United States","Object Features":"Undisclosed","Summary":"Moving star brightens, stops, waits then disappears.","Longitude":"-122.384995","map":"<A HREF = \"http://maps.google.com/maps?q=40.58843,+-122.384995(25085)&iwloc=A&hl=en\"> mufon case (25085) map </A>","Sighting Duration":"Undisclosed"}