{"Longitude":"-87.628798","Weather Factors":"Unknown","Object Features":"None","Tags":"City","Latitude":"41.884964","Object Shape":"Unknown","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around August 12th 2010"],"Source":"MUFON","Date Submitted":"08/13/2010 12:39 UTC","Region":"Illinois","divs":["sighting detailsi am on the phone with my brother,rounding the bend in my street when i see in the northern sky-about 9:30 position ( directly in my line of vision) what appears to be 5-6 what i assume to be small planes- each w\\ what appears to be 2 headlights each,of a red\\orangish color...a shimmery almost twinkly quality to the light,and they're in a vertical almost v formation... i say aloud \" what the hell is that?!\" . i stopped my car in the middle of the street to watch these things.. they appear to be stationary. i think of chinese lanterns ( i dunno why) and cell phone towers..( again,i dunno why) -as i watch these the lights shimmer\\twinkle and disappear-as if they went into a cloud bank. i pulled into my driveway-parked and rapidly got out-looking for these things-or the clouds....there were no clouds-or cloudbanks. i was excited-as i had just seen something unusual,but calm ...i did not experience the hairs on the back of my neck standing on end. i was\\am more curious as to what it was that i saw. i called fox lake police,lake county sherrif and the faa.the police and sheriff suggested it was meteor showers...what i saw was nothing like a metoer shower."],"Date of the Event":"08/12/2010 10:40 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"US-08132010-0002","Country":"United States","Object Flight Path":"Stationary,Unknown","Summary":"Vertical formation of 5-6 craft w/ orangy lights.","map":"<A HREF = \"http://maps.google.com/maps?q=41.884964,+-87.628798(25081)&iwloc=A&hl=en\"> mufon case (25081) map </A>","Viewing Distance":"Unknown","City":"Chicago","Case Number":"25081","files":["/var/www/straped/mufon/html2text/25081.html.txt","/var/www/straped/mufon/org/25081.html"]}