{"Tags":"City","Viewing Distance":"Unknown","Disposition":"Hoax","Weather Factors":"Rain","Latitude":"39.536253","Source":"MUFON","Longitude":"-119.807613","Date of the Event":"08/21/2003 01:30 UTC","trends":["There have been 65 other sightings in Reno","There was one other sighting in Reno on or around August 21st 2003"],"Object Features":"Undisclosed","City":"Reno","files":["/var/www/straped/mufon/html2text/2508.html.txt","/var/www/straped/mufon/org/2508.html"],"Summary":"the reptoids are back","divs":["Sighting Details For four years we have been under great stress because the military, and cia have been monitoring us constantly. They have cameras on us in every residence. Were being spyed on. We have had many illegal experiments done. My mother before I was born was part of something done to her, alien dna manipulation. Now I have advanced abilities, and so do my kids now. We have been attracting aliens for foue years. All kinds of species. They have been contacting us psychically, there has been wormholes, lizzards crawling up and down our walls. Greys constantly coming. We can sense, and feel ufo any where in the sky. They have been sending pulse beams into every residence. They have been using some sort of electrical thing on me almost every night. We have electromagnetic sensitivity, esp, paranormal past and present, psychic sensing, sense, feel, see what others cant. My son, and I can actually feel the shape of anyone using stealthinvisibility We can feel them touching our bodies. We have been able to be alert enough to see them place the room were standing in, and place it into their space. We can actually feel objects in their space. There is alot more. The military, and cia have been keeping us under deep surveilance because we attract many aliens. My guess is that we are the only way they can tell what the aliens are up to now. These agencies have been following us thru nevada, and california....This is the whole honest to gods truth. I, and my son both can read what the aliens want. That is whats throwing the military into chaos because of our advanced capabilities."],"Log Number":"","Region":"Nevada","Case Number":"2508","Object Shape":"Unknown","Country":"United States","Sighting Duration":"01:59:00","Date Submitted":"08/21/2003 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.536253,+-119.807613(2508)&iwloc=A&hl=en\"> mufon case (2508) map </A>","Object Flight Path":"Unknown"}