{"files":["/var/www/straped/mufon/html2text/25082.html.txt","/var/www/straped/mufon/more/25082_submitter_file1__CIMG6148.JPG","/var/www/straped/mufon/org/25082.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.345566,+-121.892916(25082)&iwloc=A&hl=en\"> mufon case (25082) map </A>","divs":["sighting detailsi was lying on a reclining chair in my back yard wondering if i could see the persid meteor shower (i didn't). i did see a few sattelites in the sky. i was lying on the shair for about 20-30 min and got up to face the back door when i saw a \"huge\" tringle of 5 lights with 1 additional light in front of it. the lights were very faint and did not flash. it seemed to be moving very quickly. i only saw it for a few seconds and it moved out of sight. i yelled for my wife to come but it had crossed the path of our house by then. my reaction was \"that cant be what i think it is!\" it was really very surreal. i've never seen anything like it. i tried to measure how big it was. if i held my arm fully extended, the object would appear about .75\" to 1\" wide by 1-1.5\" long. we have helicopters and airplanes flying around all the time but this was very faint, silent and seemed like it was big! also, i couldn't tell if it was solid or not (the area in between the lights was the same color as the sky - not darker). after i saw the object i drew a picture of the lights (not very exciting) and tried to measure how big i thought the craft was, by laying back in the chair and extending my arm\\fingers to guage the size. if i held my arm fully extended, the object would appear about .75\"-1\" wide by 1-1.5\" long (i revised the size down from the image attached). we have helicopters and airplanes flying around all the time but this was very faint, silent and seemed like it was big! also, i couldn't tell if it was solid or not (the area in between the lights was the same color as the sky - not darker). i really don't think it was a conventional airplane or helicopter, as i didn't hear anything. it was much larger than airplanes appear in the sky, the light was very dim and it crossed the sky quickly."],"Latitude":"37.345566","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around August 12th 2010","This sighting has never been favorited.",""],"Region":"California","Log Number":"US-08132010-0003","Date of the Event":"08/12/2010 09:30 UTC","City":"San Jose","Case Number":"25082","Weather Factors":"None","Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"08/13/2010 01:20 UTC","Summary":"Silent, \"large\", triangular outline of lights in the sky (5 lights in shape of triangle with 1 light in front of the triangle).","Longitude":"-121.892916","Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Triangle","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City"}