{"Sighting Duration":"00:05:00","Case Number":"2509","City":"Winston-Salem","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-80.236486","Country":"United States","Object Shape":"Unknown","Tags":"City","Date of the Event":"09/30/1989 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.10822,+-80.236486(2509)&iwloc=A&hl=en\"> mufon case (2509) map </A>","Latitude":"36.10822","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around September 30th 1989"],"Log Number":"","Object Flight Path":"Stationary","Summary":"flying disc take off","Disposition":"IFO","Source":"MUFON","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/2509.html.txt","/var/www/straped/mufon/org/2509.html"],"Object Features":"Window(s)","Weather Factors":"Unknown","Date Submitted":"09/30/1989 07:00 UTC","divs":["Sighting DetailsI have carried newspapers as a second job for over 25 years. I had stopped on myroute around 5am in Oct of 1989. I was facing east and noticed thick cloudshovering at ground level across the horizon in front of me. there appeared to bea bright light within the clouds. my first thought was this was in the generaldirection of some car dealerships and maybe it was one of the large spotlightsthat was left on. watched this for about 3045 seconds when suddenly the sky wasfilled with a tremendous amount of sparks. they filled the horizon and as thesparks went up, started to taper off. at the apex, the sparks died out and iwitnessed a saucer shaped craft hovering. I was so shocked, i jumped out of mytruck to get a better view. i cannot tell you how far away it was but i sawwindows, rectangular in shape around the middle of the craft. it stated to rotatin a counter clock wise direction, heade south. as it moved behind the tree linei remembered seeing an acquaintance that was walking on the street i had justturned off from. i turned around, raced back up to the streeet, and saw thisacquaintance, staring at the sky, with his mouth wide open. i pulled up and myrttold me to look in the sky,as to what was flying across it. i told him, hellmyrt, i saw it take off when i got to work that morning i called my best friend,a now retired winston salem policeman. he started joking about it and pooh poodme off. that same afternoon right after dinner he called and said, boy, i haveto apologize to you. i asked why and he said that the dept had received over 500calls that morning and day about bright lights in the sky that morning. I haveonly shared this story with a few close friends until i saw the show on UFO hotspots in the history channel today and thought this may be of interest to yourgroup."]}