{"Object Shape":"Circle, Oval","Date of the Event":"08/15/2010 07:00 UTC","Region":"Utah","Disposition":"Unknown","Case Number":"25109","Log Number":"US-08162010-0006","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25109.html.txt","/var/www/straped/mufon/org/25109.html"],"Weather Factors":"None","Object Features":"None","City":"Sandy","map":"<A HREF = \"http://maps.google.com/maps?q=40.57701,+-111.850672(25109)&iwloc=A&hl=en\"> mufon case (25109) map </A>","Longitude":"-111.850672","Object Flight Path":"Stationary,Path with directional change","Summary":"I first saw a bright reddish orange object flashing then looked to the left and saw a second object that was a vivid green color. While these 2 objects sat there I saw several more orb looking UFOs appear and watch. They eventually disappeared.","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsMy sightings started around 2 or 3 in the afternoon where I would see single UFOs just floating through the sky. A few hours later I starting getting ready to grill and then saw a green object that would go bright then dim over and over. I watched for about 2 minutes before I lost sight of it. So about 30 minutes after that (putting the food on the grill now) I I see another object that looks fairly close, (around 15,000) this object was a flashing a very vivid reddish orange color which would get brighter and dimmer over and over. As I am looking at this object I scan across the sky and see the same green UFO I saw early. It looked to be at the exact same height as the other UFO and they were in a direct line with each other a short distance away. These 2 UFOs were doing there flashing thing and did not move from there spots. As I am watching this I see a small red orb appear in the same part of the sky but it looked to be much higher. Again, this orb just appeared and sat there as if it were watching the other 2 UFOs. After about 3 more minutes I saw a total of 4 of the red orbs that were higher. As all this was happening I saw a white orb (looked just like the red ones except it is white) appear and move slowly across the sky through the paths of the 2 UFOs. This event took about 10 minutes and was extremely weird. My wife and 3 year old daughter witnessed it with me. My 3 year old says they looked like stars that sparkled, it was cute. Eventually after all the UFOs disappeared and moved off I saw a jet fly over where all the UFOs were. The jet was flying high but it looked small and had a single exhaust which to me fits an F-16. 5 minutes after the first F-16 flew by I saw another one fly by going the exact same way. That was the last thing I saw that evening."],"Latitude":"40.57701","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around August 15th 2010"],"Date Submitted":"08/16/2010 12:26 UTC","Country":"United States"}