{"Object Flight Path":"Undisclosed","Summary":"Pinpoint of light drops down, expands in burst of blue, fades as it makes 90 degree turn and moves like satellite.","files":["/var/www/straped/mufon/html2text/25105.html.txt","/var/www/straped/mufon/org/25105.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.129879,+-122.121103(25105)&iwloc=A&hl=en\"> mufon case (25105) map </A>","Log Number":"US-08162010-0002","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"00:00:30","Region":"California","divs":["Sighting DetailsWas watching the sky with my daughter and her husband on top of the haystack a little after 10pm and was commenting that it would be cool to see some plasma craft or a blue spiral. Within 5 minutes, what looked like a faint star directly above us drops towards us, flashes a bright blue in a circular shape (thus making it appear much bigger than it had been), and then proceeds to move west as it fades back into the small pinpoint of light it began as. We watched it fly west until it disappeared on the horizon. If it had not behaved in this manner, coming straight towards us and then make a sharp and fast 90 degree turn to the west, it would have been identical to watching a satellite traverse the sky. In fact, tonight we saw more than a dozen \"satellites\" up there, and most of them were very fast.... Before this sighting, perhaps half an hour earlier, two military jets were observed traveling at a casual pace and in formation towards the north. They were high up, but could be heard as well as seen. We don't usually get military aircraft up this way--but this is the fourth time since spring that we've seen them, and every time there has been a UFO report here on MUFON."],"Weather Factors":"Medium","Date of the Event":"08/15/2010 10:15 UTC","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-122.121103","Latitude":"40.129879","Disposition":"Insufficient Data","Case Number":"25105","City":"Dairyville","trends":["There have been no other sightings in Dairyville","This sighting has never been favorited."],"Country":"United States","Date Submitted":"08/16/2010 04:13 UTC","Object Shape":"Circle, Star-like, Other"}