{"Disposition":"Insufficient Data","Sighting Duration":"00:00:07","trends":["There have been no other sightings in Devore","This sighting has never been favorited."],"Object Flight Path":"Path then hovering,Other","Viewing Distance":"Over One Mile","Date Submitted":"08/16/2010 10:59 UTC","Longitude":"-117.410525","Country":"United States","Case Number":"25107","divs":["Sighting DetailsThis is a report I received from my daughter whom I shall refer to as Bink. She wishes to remain anonymous. During the concert Ozzy was playing the song Suicide Solution and the audience was looking at Ozzy. Bink glanced towards the Little Dipper at the time. A UFO appears away from the stage while everyone (she assumes) was watching towards the stage away from the UFO. This is the report directly. I collected the report as it was fresh in her mind. The shape was triangular with rounded tips. The color of the craft was a pale gray. The middle looking on edgewise was slightly rounded and thicker in the middle, which held 3 round lights in a line strobe-like. Colors were green, yellow and pinkish purple. The lights were like a strobe that blinked and flashed 3-5 times before it disappeared behind a tree that it fit behind. Bink said the distance was up higher than any conventional aircraft. The craft made no noise but it flew horizontally then flew up then hovered then shook as it left. Bink recognized that it was unlike anything she had ever seen before and she seen it as it was (a weird UFO). She has never seen anything like this before and it was the first thing she said to me when she got home that night with her Dad who didn't see a thing. She said \"Guess who just saw a freaking UFO\" were her words exactly."],"files":["/var/www/straped/mufon/html2text/25107.html.txt","/var/www/straped/mufon/org/25107.html"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.233492,+-117.410525(25107)&iwloc=A&hl=en\"> mufon case (25107) map </A>","City":"Devore","Log Number":"US-08162010-0004","Latitude":"34.233492","Source":"MUFON","Object Features":"Dome, Other","Tags":"City","Object Shape":"Triangle","Date of the Event":"08/14/2010 12:00 UTC","Summary":"Ozz Fest UFO seen over Devore.","Weather Factors":"None"}