{"Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25100.html.txt","/var/www/straped/mufon/org/25100.html"],"Disposition":"Unresolved","Longitude":"-71.107183","Region":"Massachusetts","Latitude":"42.37469","Object Features":"Other","Tags":"City","Date Submitted":"08/15/2010 01:24 UTC","divs":["Sighting DetailsI was sat on my bed with my blinds open at 11pm last night, out of the corner of my eye I spotted a red light out of the window. I got up and on closer inspection noticed another one come into view in exactly the same path the one before it had used. I stood at my window trying to make out what they were, at first I thought a plane, but there were no flashing lights to indicate this and the objet was travel much faster than that of a plane. by 11.15pm I had counted 18 of these objects all using the exact same path as the first one, they were all equal distances apart. I tried to video this but my camera phone would not pick it up. I was a little bit overwhelmed to be honest and quickly phoned my partner who was away at the time, I explained it all to him in detail. I managed to make out from three of the objects that they were trapezium in shape, After seeing the last one dissapearing over the housetops towards Peterborough, I was actually in a state of disbelief. I've no doubt in my mind these weren't military or chinese lanterns. Also not sure if this is connected in anyway, but roughly 10 minutes before the first object appeared all the streetlights outside my house went out and came back on after the first two objects had passed."],"Date of the Event":"08/14/2010 12:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Other","Summary":"18 red trapeziam shaped objects","map":"<A HREF = \"http://maps.google.com/maps?q=42.37469,+-71.107183(25100)&iwloc=A&hl=en\"> mufon case (25100) map </A>","Object Flight Path":"Straight-line path","Log Number":"GB-08152010-0005","Case Number":"25100","Viewing Distance":"Over One Mile","City":"Cambridge","trends":["There have been 17 other sightings in Cambridge","There were no other sightings in Cambridge on or around August 14th 2010"],"Weather Factors":"Unknown"}