{"Longitude":"-114.172103","map":"<A HREF = \"http://maps.google.com/maps?q=34.353772,+-114.172103(25118)&iwloc=A&hl=en\"> mufon case (25118) map </A>","Latitude":"34.353772","Weather Factors":"Unknown","Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Log Number":"US-08172010-0004","Tags":"City","Sighting Duration":"00:45:00","Country":"United States","Date Submitted":"08/17/2010 02:36 UTC","Object Shape":"Boomerang, Triangle","City":"Lake Havasu","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","divs":["Sighting DetailsMy wife and I were watching TV in our bedroom when our oldest son came in and told us to look outside at the sky.We got up and went out onto our balcony to see several, maybe 8-10 aircraft with extremely bright strobing lights on them.They were north of us flying EXTREMELY fast from east to west. Then once nearly out of sight they turned and came back towards the east. When flying from east to west we witnessed a bright red light ahead of the conventional aircraft. At one point the red light made an abrupt and complete stop and then changed directions flying back in the direction it came from. The other aircraft made their turns and began following. We lost sight of them , then within 30 seconds or so a triangle shaped object with a deep red light in the center came flying directly overhead from the direction the jets left in, followed minutes later by the group of jets again. The triangle shaped object made no sound as it flew overhead, yet we could hear the conventional aircraft as they flew by. Over the next several minutes the aircraft continued to maneuver around the airspace near the city at extreme speeds, my wife , son and myself all witnessed changes in speed (including full stops), direction and altitude which are not possible with currently known technologies. After 30-45 minutes the aircraft all flew over the horizon. This is not our first sighting here in Lake Havasu City. We had a very similar experience in May of this year, still my first thought was to try and rationalize the aircraft as being of a conventional nature. The feelings were excitement, fear and frustration at not knowing exactly what it was we were seeing."],"Summary":"Boomerang shaped craft making dramatic turns at extreme speeds.","files":["/var/www/straped/mufon/html2text/25118.html.txt","/var/www/straped/mufon/org/25118.html"],"Object Features":"Unknown","trends":["There have been 8 other sightings in Lake Havasu","There were no other sightings in Lake Havasu on or around August 16th 2010"],"Date of the Event":"08/16/2010 09:00 UTC","Case Number":"25118"}