{"Latitude":"37.768365","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/25117.html.txt","/var/www/straped/mufon/org/25117.html"],"Weather Factors":"Unknown","Country":"United States","Object Shape":"Other, Unknown","Date of the Event":"08/16/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.768365,+-120.843224(25117)&iwloc=A&hl=en\"> mufon case (25117) map </A>","trends":["There have been 7 other sightings in Oakdale","There were no other sightings in Oakdale on or around August 16th 2010"],"Case Number":"25117","Date Submitted":"08/17/2010 03:04 UTC","Region":"California","Longitude":"-120.843224","City":"Oakdale","Tags":"City","Log Number":"US-08172010-0003","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Summary":"It was a light bluish color could not see the shape of it.","Object Features":"Unknown","divs":["Sighting Details About 10:30 tonight went out to water the lawn facing the eastern sky was the light bluish object in the sky stood out as I continued to watch it it very slowly started to move my direction westerdly stop stay slightly back slightly forward. Then it started to move east climed in altitude then stated to really become active would rise lower forward backward side to side was really acting weird then at one point the light of the thing went out. It went out then after three or four minutes it flicked on then go off maybe for a minute or two the it was a steay flickering then it stayed on started moving again came down close to where it was going to be where I was going to lose sight of it the back up it looked like it was over the other end of town maybe two to three miles away. Its really hard to be sure how far it was but when it would lower it self it was brighter in all I watched it for a good twenty minutes I'm sure there had to be witnesses that saw what I saw the color of it alone made it stand out then ther movements very active."],"Source":"MUFON"}