{"Country":"United States","divs":["Sighting DetailsMy family is on a beach vacation to Navarre beach Florida. Last night my brother-in-law, my wife, and I were sitting on the back balcony watching the night sky and talking. Kevin my brother-in-law and I spotted some airplanes that were flying in circles. There were four of them in total but they were split into 2 groups. They would follow each other in huge patterns accross half of the sky. This was one of the planes that was to my left front the other plane appeared to just stop I can only assume that it started flying away from us but we could still see the light on it. The other plane that was with it started to circle by its self but it was moving alot faster then it was before. Where it get crazy is we hear a muffled boom noise over and over again about about 30 secs apart then we hear a quick 3 of the same noise instead of just one and it repeats for about 10 mins. While this is going on Kevin was looking in the other direction my wife and I seen a red ball fall out of the sky in the direction of the airbase. This is where the one airplane \"stopped\" moving and the other one put it in overdrive. I tell kevin and he turns around and about that time we see 8 more red balls fall out of the sky. What we seen is multiple red balls with defined edges falling so fast that it appeared to have a blur behind it. They disappeared when behind clouds and reappeared and then disappeared or hit the ground far away from us they could had went into the horizon or hit the ground or ocean far away. Each one lasted about 3 sec and were one after the other and some fell at the same time. The first one fell from left to right and the rest fell from right to left all seemed to be heading in the same direction. They started about halfway through the sky out of nowhere. The first one fell and there was a few seconds before the others started to fall. I just knew that the base was under attack because I thought that they were bombs or missiles being shot at the base but there were not any noises after they \"hit\". I never have seen a bomb or missiles so I don't know what they look like. After the red balls fell all but one of the planes went off the one that appeared to stay still went out of site and the other one just kept on flying the same routine it had before for a little while longer then it went off and we couldn't see it any more. We don't know what we seen but we are hoping that someone else that seen them and may know what they were and could shed some light on this for us. I will be back on my balcony tonight to see if it happens again."],"files":["/var/www/straped/mufon/html2text/25124.html.txt","/var/www/straped/mufon/org/25124.html"],"Log Number":"US-08182010-0003","Tags":"City","Date of the Event":"08/17/2010 11:30 UTC","Region":"Florida","Sighting Duration":"Undisclosed","City":"Navarre Beach","Date Submitted":"08/18/2010 11:18 UTC","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"Undisclosed","Object Shape":"Other","Weather Factors":"Windy","Source":"MUFON","Object Flight Path":"Straight-line path","Latitude":"30.381616","Summary":"Red balls of light fall","Longitude":"-86.853582","Disposition":"IFO","trends":["There have been 3 other sightings in Navarre Beach","There were no other sightings in Navarre Beach on or around August 17th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.381616,+-86.853582(25124)&iwloc=A&hl=en\"> mufon case (25124) map </A>","Case Number":"25124"}