{"Source":"MUFON","Object Features":"Undisclosed","Summary":"Bright light in sky in the east over Spanish Springs area. By Sparks Nevada. Caught my eye at 10:06 pm and was heading toward me. It went up down back to center then right and then left. Went into my house got my binoculars steady myself and saw a disk.","Region":"Nevada","map":"<A HREF = \"http://maps.google.com/maps?q=39.531223,+-119.805723(25121)&iwloc=A&hl=en\"> mufon case (25121) map </A>","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"07/15/2010 10:04 UTC","City":"Reno","files":["/var/www/straped/mufon/html2text/25121.html.txt","/var/www/straped/mufon/org/25121.html"],"Latitude":"39.531223","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around July 15th 2010"],"Log Number":"US-08172010-0007","Case Number":"25121","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"08/17/2010 11:51 UTC","Object Flight Path":"Undisclosed","divs":["sighting detailscall met at *(telephone number deleted--sgonzalez\\cms) and i`ll give you all the run down. called reno atc today the 17 th, and they have nothing on radar at that time from 10:06- 10:00. duration of sighting 4 four min. i`m a piolet and althogh not current i do understand night flying. it had (2) observiation windows in the craft one was red and the other green. thank you very much. i`m not crazy and i have drawn what i have seen. would love to fax it to you. thank`s. #1,taking my dog`s out to night time potty in my back yard. 2, the bright light coming towards me with some changes of intensity. 3. i thought it was an a\\c intersepting the reno ils system as they usually do to turn to their left for 16 left or 16 right. object was disk like with irratic motion`s of down to the ridge line then up higher that original altitude the back to center then right then left back to center then gone. all these manuvers were much to fast for a chopper or regular a\\c. 5, i was not affraid and today i feel lucky. 6,it just was gone vanished."],"Object Shape":"Disc","Longitude":"-119.805723","Country":"United States"}