{"City":"Texarkana","Object Shape":"Unknown","Disposition":"Hoax","Object Flight Path":"Straight-line path","Date Submitted":"08/28/1978 11:30 UTC","Log Number":"","Case Number":"2512","Sighting Duration":"00:05:00","divs":["Sighting Details when i was around ten or eleven years old,i was looking out the window of my room one night , looking for shooting stars. then i saw this roundish bright moving thing moveing slowly across the sky. i watched it for maybe 3 or 4 min. i think. then it speeded up in a upward way pretty fast. the next morning i told my folks. they just smiled saying , to much movies. soon afew more friends and family knew. then i told no one else about it. then the next night. i waited at the same window to see if i see it again. i waited for about two or three hrs. got tired and sleepy . my little brother was already sound asleep.i gone ahead and did the same and went to sleep . next thing i know, i awoke . my brother still asleep next to me . this something is on the bed with us,looking at me . now the bed is in the corner of the room under the window. imscared out my skin . if you ever been scared as a kid, you know the be verystill thing. thinking it wont see us or it go away. that is what i did .imscared, sweating. trying not to breath that loud . i try to move my hand whileunder the covers. hopeing that it not see my hand move twards my little brothersarm. i start to thump him on the arm, but he does not wakeup. so, i start topinch him on the arm, the side, or the leg, but he doesent wake up. so i stare,this thing stares back. next thing i know is, that its morning. now, when myfolks see my little brothers arm, side, and leg. they see the red marks and thebruses from the pinches i gave him trying to get him to wake up. after that, igot the belt put on my back side. pretty good to, for what i did to my brother.then i started to have these dreams , and my sences gotten better. strangethings started to happen to me.example . the dreams that i get is always in the same room everytime. the sameperson everytime. they keep showing me things. teaching me how to use them"],"Object Features":"Patterned Surface, Other","Summary":"roundish, bright moving object.","Longitude":"-94.028618","Tags":"City","files":["/var/www/straped/mufon/html2text/2512.html.txt","/var/www/straped/mufon/org/2512.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.450002,+-94.028618(2512)&iwloc=A&hl=en\"> mufon case (2512) map </A>","Latitude":"33.450002","Source":"MUFON","Region":"Arkansas","Date of the Event":"08/28/1978 11:30 UTC","trends":["There have been 4 other sightings in Texarkana","There were no other sightings in Texarkana on or around August 28th 1978"]}