{"Case Number":"25126","Object Flight Path":"Straight-line path","Disposition":"Unresolved","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around July 15th 2010"],"Country":"United States","Tags":"City","Longitude":"-105.21679","Date Submitted":"08/18/2010 01:36 UTC","Date of the Event":"07/15/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.759083,+-105.21679(25126)&iwloc=A&hl=en\"> mufon case (25126) map </A>","City":"Golden","Latitude":"39.759083","Object Features":"None","files":["/var/www/straped/mufon/html2text/25126.html.txt","/var/www/straped/mufon/org/25126.html"],"Viewing Distance":"501 Feet - 1 Mile","Summary":"3 white spheres traveling NW over Table Mountain in Golden.","divs":["sighting detailsi was driving, looking nw in direction of table mountain, around noon (no longer remember exact date). weather was sunny and warm. i saw 3 white spheres traveling nw over table mountain. they were flying very low, very slow, constant speed. they were very widely spaced apart in a triangular formation. they were identical in appearance and traveled at identical speed. at first i wondered if they were planes, but they were not plane-shaped. also, their speed, elevation, formation seemed to rule them out as planes. i can't see why planes would be doing that. also, they were close to nrel. since that is federal govt property, i don't know why multiple small planes would be allowed at low elevation there. note: i live in area, and have seen lots of small planes, military helicopters, and of course the paragliders on top of lookout mtn. these objects were not like any of those. also, they were travelling pretty much nw in a route that i have not seen planes\\helicopters take. i kept watching them as i drove, since i was driving in that direction. their speed, elevation, formation and appearance seemed unusual to me. i lost sight of them when they kept traveling nw and were eventually blocked from view by table mountain. the objects were spherical, whitish, and somewhat shiny (metallic). there were no lights, no wings, no landing gear, no copter blades, or other features apparent. i thought about taking a picture with my camera phone, but i knew the objects were too far away, would not have shown up. i didn't report it right until now. i have seen other ufos, other unknown things, and have had some unexplainable experiences. i have reported ufo sitings to mufon before, who responded with a great professional attitude. but my friends and family just laugh at me. that makes me depressed and feel like i shouldn't bother reporting things. but i decided to report this. unfortunately i no longer remember the exact time or date. also, there was lots of traffic around at the time (lunch-hour traffic), sunny skies, and they were very visible. i wonder if anyone else noticed them."],"Weather Factors":"None","Object Shape":"Sphere","Log Number":"US-08182010-0005","Region":"Colorado","Sighting Duration":"Undisclosed","Source":"MUFON"}