{"map":"<A HREF = \"http://maps.google.com/maps?q=48.121204,+-105.188545(25123)&iwloc=A&hl=en\"> mufon case (25123) map </A>","Latitude":"48.121204","Summary":"15 to 20 feet from UFO that started out at 10 to feet up and then it dropped to a few inches above ground.","Date Submitted":"08/18/2010 02:30 UTC","Longitude":"-105.188545","City":"Poplar","Date of the Event":"03/31/1976 04:30 UTC","Tags":"City","Country":"United States","Object Shape":"Circle, Disc, Oval","Sighting Duration":"Undisclosed","Object Features":"Other","files":["/var/www/straped/mufon/html2text/25123.html.txt","/var/www/straped/mufon/org/25123.html"],"Disposition":"Insufficient Data","Weather Factors":"None","Log Number":"US-08182010-0002","Region":"Montana","Object Flight Path":"Stationary,Straight-line path","Source":"MUFON","trends":["There has been one other sighting in Poplar","There were no other sightings in Poplar on or around March 31st 1976"],"Viewing Distance":"20 Feet or Less","Case Number":"25123","divs":["Sighting DetailsI was traveling west on U.S. Highway 2 from Poplar to Wolf Point, Montana at approximately 4:30 A.M. I can't remember the exact date now, but it was still dark. I was commuting to my job at the time.I was the only car on the road at the time. As I drove along, I noticed a red light in the distance ahead of me. It looked out of place and at first I thought it was the tail lights of a car.I nixed that idea because the red light seemed to be too high up to be tail lights. I then thought it might be the trailer lights on a semi-truck. I also nixed that idea because I realized it was only 1 light. It suddenly hit me for some reason that it was a ufo, because it was so strange. I suddenly got a feeling of excitement and I was quite happy at the thought of seeing a ufo. As I got closer to the ufo, I kept thinking to myself, \"Please don't fly off. I want to get up to you and see you\". I didn't speed up or slow down, because I was afraid if I did, it would suddenly fly away. Finally, I came up on the ufo and stopped approximately 15 to 20 feet from it. The ufo was approximately 10 to 12 feet in the air. I felt I could have gotten even closer, but I was afraid if I did it would take off. The whole area was lit up in a red light that was emitting from the craft. It wasn't a bright light, but rather a soft light. It was so surreal. The light wasn't coming from something like aircraft lights, but rather it seemed to be emitting from the outer shell of it. Try as I might, I couldn't see the craft itself, only the red light and what appeared to be a dark center. I started getting frustrated that I couldn't see the ufo, so I really concentrated and squinted my eyes at it. Finally I could make out the left hand side of it. I had to look through the light to see it. It appeared to be an oval shape about the length and height of a car. I remember thinking that there couldn't have been more than 2 occupants in it. The craft was perfectly suspended in the air without any hint of wavering. There was no sound and no apparent signs of propulsion. After staring at it for a few minutes, it suddenly dropped down to only a few inches above the ground. I believe the craft was a gray color at this time. It seems to me it had a wide belt around its middle and it had raised ribs with a possibility of what looked like nuts and bolts on the ribs. There were no apparent windows or doors of any kind. It then slowly took off to my left and down through a gully. I remember seeing its red light shining off the ground under it. The craft never wavered from its distance from the ground. If the ground rose, it rose. If the ground dropped, it dropped. When it got down to the bottom of the gully, the land opens up into a wide, flat stretch. This is when the ufo suddenly accelerated to a high speed and was into the horizon in only a couple of seconds. It left a trail behind it that reminded me of a tracer bullet. Even though it was traveling very fast, I had the impression it wasn't even trying to go fast. It came to an abrupt and immediate dead stop when it make it to the hills in the horizon. It then slowly floated off to the west, following the hills in the horizon. I sat there watching it for a couple of minutes when another car came up over the hill heading east from Wolf Point to Poplar. I was on top of the hill and a ways back. I now realize the ufo had dropped down and went down the gully, because it didn't want the other car to see it. I have no idea if the other car had seen anything at all. When the car went by me I just stared at it and it kept going. They must have seen something, but not like I did. The whole experience was totally surreal. I was never scared the whole time and I was quite excited and happy. I often wonder why the ufo let me get up to it and look at like that. Could it have somehow read my mind and felt nice to me? As a side note: A month or two later I was riding with my parents from Wolf Point back to Poplar. A bunch of cars were parked out in the burrow pit and a bunch of people were looking at Tule creek, which is down the hill from where I saw the ufo. I asked what were all those people doing there as it was quite unusual. My father than said he heard people talking about a ufo landing in the cat tails in Tule creek. Sure enough, there was an imprint in the cat tails that would have been the shape and size of what I had seen I never seen the craft again. It still haunts my memory every day. I couldn't tell you what it was, but I believe it was not of this earth."]}