{"trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around August 19th 2010","This sighting has never been favorited.",""],"Object Features":"None, Unknown","Country":"United States","Longitude":"-119.174862","Latitude":"34.207445","Case Number":"25137","map":"<A HREF = \"http://maps.google.com/maps?q=34.207445,+-119.174862(25137)&iwloc=A&hl=en\"> mufon case (25137) map </A>","Tags":"City","Date Submitted":"08/20/2010 04:27 UTC","files":["/var/www/straped/mufon/html2text/25137.html.txt","/var/www/straped/mufon/more/25137_submitter_file2__ufo1.jpg","/var/www/straped/mufon/org/25137.html"],"City":"Oxnard","Weather Factors":"None","Disposition":"IFO","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWas inside the house, went outside as the sun was starting to set to have a cigarette. As I look up I see a red flash streak the sky. This was not a shooting star I said to myself. So as I look up, I then see (2) very bright objects in the sky to the left of where I saw the red streak. I noticed they were sitting very low and very still..I watched it straight for 20 minutes with some recording here and there..then 1 light remained as I stayed and observed for a little over 2 hours and the object was still there until I decided to go inside the house to search the internet to see if there was any talk of our visitor...at first I thought this could either be a orbiting satellite (then I said no, because it was REALLY low), a very bright star (looked too big for a star, and if im not mistaken, I could have sworn the object would rotate colors)...my general feeling after witnessing a once in a lifetime experience was, is the world gonna end? and if it were in fact a UFO, wouldn't airspace controllers be the first to extract a team to access and observe the situation in the skies. lots of theories..."],"Object Shape":"Circle, Flash, Oval","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Log Number":"US-08202010-0001","Region":"California","Date of the Event":"08/19/2010 08:15 UTC","Summary":"Bright light that interchanged colors hovered for hours then disappeared."}