{"Object Shape":"Cylinder","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"25136","Date of the Event":"08/19/2010 10:00 UTC","trends":["There has been one other sighting in Fishersville","There were no other sightings in Fishersville on or around August 19th 2010","This sighting has never been favorited.",""],"Source":"MUFON","Region":"Virginia","Summary":"A hovering light that had bright flashes at the base, suddenly moved very fast and stopped again to hover. I grabbed the camera and when I zoomed in it appeared to be 2 orange balls fused together, again with some rotating flashing light at the base.","divs":["Sighting DetailsI was just getting out of the car after a trip to pick my son up from work. I was watching the sky because after seeing an orange orb on July 4th of this year, I guess I just started looking more. I saw a soundless light that didn't look like a star. It hovered and then moved swiftly a short distance. I went inside to grab the camera, hoping the batteries weren't dead and came back to film this light. There appeared to be flashes of light coming from the base of it. I zoomed in and it looked like 2 orange orbs fused together, again with a rotating, flashing light at the bottom. I thought to myself, \"Why me? Seeing 2 in one year, let alone a lifetime!\" It was still in the sky when I went inside to view my video of it. When I came back out 30 minutes later It was gone. I saw 2 planes flying in the sky and they didn't look like what I had seen."],"Latitude":"38.100963","City":"Fishersville","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/25136.html.txt","/var/www/straped/mufon/org/25136.html"],"Log Number":"US-08192010-0007","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Tags":"City","Longitude":"-78.968102","Country":"United States","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.100963,+-78.968102(25136)&iwloc=A&hl=en\"> mufon case (25136) map </A>","Date Submitted":"08/19/2010 10:49 UTC"}