{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.949286,+-74.12923(25144)&iwloc=A&hl=en\"> mufon case (25144) map </A>","Date Submitted":"08/20/2010 10:04 UTC","Latitude":"40.949286","Object Shape":"Flash, Star-like, Other, Unknown","Longitude":"-74.12923","files":["/var/www/straped/mufon/html2text/25144.html.txt","/var/www/straped/mufon/org/25144.html"],"Country":"United States","Disposition":"Insufficient Data","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Fair Lawn","There was one other sighting in Fair Lawn on or around August 20th 2010"],"Case Number":"25144","Source":"MUFON","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"08/20/2010 08:15 UTC","divs":["Sighting DetailsI'll report a more detailed description later but I must say it's like nothing I've ever seen. a covey of about half a dozen to a dozen ufos' are making incredible maneuvers across the sky at incredible speeds in what apeears to be a dogfight pattern. traveling thousands of miles an hour in presence of planes to the West of New York. Witnessed by me, my mother, and my friend ( a non-believer). I'm fascinated impressed and perpplexed. someone else must have reported this. I put the duration at 1hr. 20 mins but it is still going on! who knows how long it was last. I'll do more skywatching later. I'm sure th FAA and pilots MUST have reported these objects. Be back later for a more detailed report. Please follow up this is an incredible sighting. It is not spotlights, planes, helicopters or any other known object or machine I can think of. I just don't know what elsee to say. anyone else see this!? I attempted to take video and photos with my canon rebel T1I but they are either too far away or for some other reason, they do not show up on camera!"],"Summary":"covey of star like ufo's in \"dog fight\"","Region":"New Jersey","Log Number":"US-08202010-0008","City":"Fair Lawn"}