{"Object Features":"Undisclosed","Case Number":"25149","files":["/var/www/straped/mufon/html2text/25149.html.txt","/var/www/straped/mufon/org/25149.html"],"Weather Factors":"Unknown","Date of the Event":"08/21/2010 10:15 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=51.516759,+-0.122905(25149)&iwloc=A&hl=en\"> mufon case (25149) map </A>","Object Flight Path":"Path with directional change","Region":"England","Summary":"Saw 2 UFOs.","Country":"United Kingdom","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around August 21st 2010"],"Tags":"City","Log Number":"GB-08212010-0004","Date Submitted":"08/21/2010 09:56 UTC","Sighting Duration":"Undisclosed","Object Shape":"Cigar","City":"London","Latitude":"51.516759","Longitude":"-0.122905","divs":["Sighting DetailsI was walking my dog at around 10.15 on Saturday morning in Old Town, Clapham Common and we were less than five minutes from home. I love living under the Gatwick flight path because I get to watch planes every day. Ever since I was child I have always looked up. I was watching the new Boeing A380 with absolute delight, when I saw what I thought was another plane much higher and much farther away. I looked at it for a long time and decided that I couldn't see any wings or tail, and of course I had this rather large Boeing to compare it to. In fact, it had the shape of a cigar, it seemed to be white I did not see windows. I did my best to track it using the A380 as it continued on its route. I nearly lost it in the clouds and whilst searching it for it, I spotted a second object, it seemed to be similar to the first but was too far away for me to establish a shape. The first object came back into view and the second disappeared into the clouds. Just as the A380 disappeared from sight in the direction of Clapham Junction and Gatwick, I stopped a passer-by and asked her opinion, she took a while to find where I pointed but she confirmed that she saw both objects and that she didnt know what they were and continued on her way. What nailed it for me, was that at the start both plane and object were headed South but now the object had moved back and was headed North and then I lost sight of it. I'll be honest I am 38 and have been staring up at the sky since I was a child, I really love planes, and I had never seen anything but planes in the sky up until today, today, I saw something else."]}