{"City":"Sierraville","Object Shape":"Circle, Disc, Egg, Oval, Sphere, Other, Unknown","Disposition":"Unknown","Log Number":"US-08202010-0006","Source":"MUFON","Date Submitted":"08/20/2010 04:28 UTC","Sighting Duration":"03:00:00","Country":"United States","Tags":"City","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/25142.html.txt","/var/www/straped/mufon/org/25142.html"],"Date of the Event":"08/17/2010 04:10 UTC","Summary":"I didn't see it till it was too late.","Weather Factors":"None","Latitude":"39.589538","Longitude":"-120.36698","Object Flight Path":"Stationary","divs":["Sighting DetailsAll I know that it was a round shaped looking object and it was on a route in Sierraville in the middle of nowhere. I was driving after my friends left at around 1am and I had no idea why but I wanted to drive to Sierraville. There is nothing in Sierraville but farm land that is surrounded by mountains in a valley. I didn't even see it coming. All I know is that it appeared almost overhead of me and I saw a blinding light which caused me to stop. My car stalled but probably because I drive stick shift and stalled. Problem is that I couldn't start up again and I quickly looked at the clock and it read around 4:01am. And that's all I remember. I remember waking up and seeing that time was 4:18am. I lost 17 minutes. I doubt I was abducted but noticed that there was a house nearby. I think I was a witness to an abduction over there. I have no injuries or strange things poking around my neck or nose. But I can tell you that I was unconscious for 17 minutes. When I got home back to Truckee I went to bed and now when I think about it, I don't even know how I got home. I can recall all driving routes that I always take but this time I have forgotten. I'm going back out there but this time armed with cameras and a crew."],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=39.589538,+-120.36698(25142)&iwloc=A&hl=en\"> mufon case (25142) map </A>","Case Number":"25142","Object Features":"Undisclosed","trends":["There have been no other sightings in Sierraville","This sighting has never been favorited."]}