{"divs":["Sighting Details I went outside to smoke as I do everymorning with my dog and while outside normally sit and look around. This morning it was a clear blue sky over head not a cloud in sight. I saw what appeared as an object moving in the sky out of the corner of my eye. Looked over and what I saw for about a full 4 minutes if not longer was a white cylinderical object moveing in an oddly way. Seemed to look as if it was gliding threw the air. No sounds and No this was not a plane or blimp. I am sure of this as I could clearly see itin very good detail it had no back tail like a plane or wings. basically what it look like was a tube shaped object. It was solid white same as a ciggeratte if you were to cut off the filter. Exactly the same. Expect this was I would say estimating the distances much larger then a 747. It also had no nose shape in the front and there was no noise with the object it passed behind a tree at the same time it hit the roof section I saw it turn and head north. I ran back inside the house and headed to the front were I was sure to get a much better look at the object at that point but by the time I got there it was gone. When i first noticed it I thought it was a plane but the longer I look at it the more I noticed the detail of it and the movement was more like a balloon then a plane. But the ends on both sides where flat like a cut tube it would not make since for a balloon to have such a sharp cut on both ends."],"trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around August 20th 2010"],"City":"Miami","Date of the Event":"08/20/2010 07:21 UTC","Object Flight Path":"Path with directional change","Summary":"While in the backyard I saw a white cylindrical object slowly moving in SE direction.","map":"<A HREF = \"http://maps.google.com/maps?q=25.796579,+-80.217219(25140)&iwloc=A&hl=en\"> mufon case (25140) map </A>","Log Number":"US-08202010-0004","Disposition":"Insufficient Data","Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"00:04:00","Object Shape":"Cylinder","Source":"MUFON","Case Number":"25140","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/25140.html.txt","/var/www/straped/mufon/org/25140.html"],"Latitude":"25.796579","Longitude":"-80.217219","Tags":"City","Region":"Florida","Date Submitted":"08/20/2010 01:41 UTC"}