{"divs":["sighting detailstoday, friday august the 20th. 2010 i went to the beach with my daughter, i live at tijuana beaches just south of imperial beach california -->(important data). first pair of objects appeared about 12:34 san diego time, i know because i saw my mobile phone time; those were cigar shaped or maybe circular but as we saw them on a side perspective they appeared elongated with this particular glow by day. these objects traveled from west to east disappearing on the upper atmosphere eastbound, in other words the objects appeared over the sea about half a mile up and traveled east about 30 to 40 seconds to disappear above the upper atmosphere. the objects started to appear at that particular time on pairs sometimes three at most. i tried to spot them over the sea level wondering if they could come out of the sea water, but no, it seemed mostly they entered the atmosphere or suddenly appear at that particular height and traveled the mentioned path. about 5 to 6 months ago, my wife, her brother, my daughter and me were walking on the hills 3 miles south of the california border, this is south of san diego county on tijuana soil and spotted the same type of objects but closer, about 300 yards of where we were standing, they showed a yellowish glow it was about 5 pm and my brother in-law tried to photograph them both with his cell phone camera but couldn't be found within the picture taken. a very particular and attention calling circumstance is that on imperial beach and the whole san diego county there are many radars because of the bases located within u.s. soil, this is north of the border, but this objects seem to \"know\" they shouldn't fly over the u.s. side of the aerial space so they do their hole showing on the mex. side of the border.quite close to u.s. boundaries. as i wrote the objects they appeared in pairs or three at most some times just one and did the same flying path until they quit the heaven, so i counted about 23 on the elapsed time of 1 hour and 10 minutes, this was from 12:34 till 1:45 pm. i'm building a house on the mentioned hill 3 miles away from the u.s. border and my family and me have spotted different type of ufos daytime and night time, sometimes i believe i can spot them so often because there is a japanese owned speaker factory that makes speakers for many brands so they might have lots of magnetic devices to make the speakers (maybe). this is my first mufon report, but this one i had to write it because is the first time i see so much ufos on just one day, the most i've seen over here before this sight were about 7 on a v-shaped formation traveling the opposite path: east to west. i do declare this to be truth. [name deleted\\cms\\tg]"],"Date Submitted":"08/20/2010 11:06 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path","Log Number":"US-08202010-0009","City":"Imperial Beach","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"32.591754","map":"<A HREF = \"http://maps.google.com/maps?q=32.591754,+-117.105365(25145)&iwloc=A&hl=en\"> mufon case (25145) map </A>","Date of the Event":"08/20/2010 12:30 UTC","Disposition":"Unknown","Case Number":"25145","files":["/var/www/straped/mufon/html2text/25145.html.txt","/var/www/straped/mufon/org/25145.html"],"trends":["There have been 4 other sightings in Imperial Beach","There were no other sightings in Imperial Beach on or around August 20th 2010"],"Object Shape":"Cigar, Disc","Region":"California","Weather Factors":"Unknown","Object Features":"Other","Summary":"I was at the beach with daughter & we watched this UFOs in an elapsed time of 70 mins. & counted about 23.","Longitude":"-117.105365"}