{"Summary":"Triangular formation of lights","Log Number":"US-08202010-0007","City":"Santa Cruz","Country":"United States","divs":["Sighting DetailsI was lying on a bench outside of my house waiting to go out with some friends. I noticed a triangular delta shaped pattern of four lights approximately 5 degrees or so in apparent size passing overhead at the zenith. I didn't have much time to think about it but I believe that it blocked out the stars as it passed by. I watched the pattern fly along it's symmetry axis extremely rapidly. It crossed from the zenith to the local skyline which here is about 30 degrees up or so as we are at the bottom of a hill where it passed out of view. It flew much faster than the large jetliners which fly a similar approach path into San Jose. What really struck me about it was that it was absolutely silent, meaning it would have had to be extremely high or if a low flying aircraft be extremely quiet. If it was a formation of low earth orbiting satellites it was remarkable in the fact that it would have that particular arrangement, and it shouldn't have blocked out the stars. If it was some sort of experimental airship, I imagine it should be much noisier if it was flying low enough to appear that large and move that rapidly. It did not appear to display any other unusual characteristics other than it's apparent size and rapidity, nor did it deviate from an apparently straight flight path. This was my first and only UFO experience. As a professional scientist, a longtime amateur astronomer, and licensed pilot, I honestly never expected to see one. I remember being unnerved enough by it's appearance that I stood up and watched it as it flew, thinking that finally, I had seen something that had at least the tiniest possibility of being extraterrestrial. I remember a feeling of awe, humility, and curiosity at the same time. Although to this day I don't know what I saw, it gives me hope that the truth *might* be out there, after all."],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=36.981787,+-122.026346(25143)&iwloc=A&hl=en\"> mufon case (25143) map </A>","Sighting Duration":"00:00:15","Date of the Event":"06/13/2009 09:00 UTC","Region":"California","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around June 13th 2009"],"Object Features":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"08/20/2010 05:58 UTC","Object Shape":"Boomerang, Triangle","Latitude":"36.981787","Case Number":"25143","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25143.html.txt","/var/www/straped/mufon/org/25143.html"],"Viewing Distance":"Unknown","Longitude":"-122.026346","Weather Factors":"Unknown","Tags":"City"}