{"divs":["Sighting DetailsI took photos of Mt. Rainier from the scenic view point on highway 12 West on July 18 2010 at 1241 hours, which is a usual practice for me when I drive over White Pass to go fishing. I use the date time stamp on my photos so I know exactly when I have taken the pictures. My camera is a Canon PowerShot SX120 with 10x Zoom and is 10 mega pixels. I was using the auto focus at the time of the photos. I don't always get around to downloading my photos right away and today August 22 2010, I finally downloaded the photos stored on my camera. Two of the photos that I had taken within the same minute show an object (not visible to me at the time I was taking the photo and appears as a dot on photo) just North (right side in photos) of Mt. Rainier. A third photo within the same minute shows that the object is no longer visible. I first thought that it was a smudge on my screen until I zoomed in the photo and can see a solid object. I researched sightings in the area for July 2010 from the MUFON UFO tracker map and saw that there were numerous sightings and one specifically mentioned Mt. Rainier. I do not know for sure what this is but I would like to submit the three photos for review."],"Log Number":"US-08222010-0005","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=46.616201,+-121.662284(25157)&iwloc=A&hl=en\"> mufon case (25157) map </A>","Object Features":"Unknown","trends":["There has been one other sighting in Packwood","There were no other sightings in Packwood on or around November 30th 2002","This sighting has never been favorited.",""],"Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"None","Case Number":"25157","Tags":"City","Object Shape":"Circle, Oval","Region":"Washington","Country":"United States","Latitude":"46.616201","Summary":"Two toned - bright on top /dark on bottom oval or round in shape.","Date Submitted":"08/22/2010 02:49 UTC","Disposition":"Insufficient Data","Date of the Event":"11/30/2002 12:00 UTC","Longitude":"-121.662284","files":["/var/www/straped/mufon/html2text/25157.html.txt","/var/www/straped/mufon/more/25157_submitter_file1__IMG_0257.JPG","/var/www/straped/mufon/more/25157_submitter_file2__IMG_0258.JPG","/var/www/straped/mufon/more/25157_submitter_file3__IMG_0259.JPG","/var/www/straped/mufon/org/25157.html"],"City":"Packwood","Object Flight Path":"Unknown"}