{"Disposition":"IFO","Sighting Duration":"Undisclosed","Case Number":"25155","Object Flight Path":"Stationary","Date of the Event":"08/21/2010 11:45 UTC","Summary":"Reddish unmoving Chrismas tree/triangle like object in sky at night.","Longitude":"-96.893005","Viewing Distance":"Unknown","Latitude":"32.935894","Object Features":"Unknown","Log Number":"US-08222010-0003","trends":["There have been 3 other sightings in Farmers Branch","There were no other sightings in Farmers Branch on or around August 21st 2010"],"Object Shape":"Triangle","Date Submitted":"08/22/2010 01:42 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.935894,+-96.893005(25155)&iwloc=A&hl=en\"> mufon case (25155) map </A>","Weather Factors":"Unknown","Tags":"City","Country":"United States","divs":["sighting detailsi was in my backyard facing east and saw a bright reddish christmas tree\\triangle like silent & unmoving object in the sky. the moon was nearly full and quite bright. the stars\\planets were dimmed by the brightness of the moon but not this object. also there seemed to be a twinkling effect to the light from the object; i could not identify the shape of the discreet light sources in the triangle. i would say the predominant color of the light emanating from the object had an overall reddish tint but frankly i'm not great with colors. the object was visually well above the tree line. if i named an altitude i'd only be guessing. the moon seemed (in comparison to the overall sky) to be the size of a dime and the triangle of lights seemed to be as large as the moon which made me think it was not a natural object. i watched it off and on for about fifteen minutes right up until about midnight. it neither moved nor changed in brightness, shape or color. it also did not make any noise the entire time. also when i say christmas tree or triangle i do not mean to say i saw an integrated body or skin to the object. i just saw lights in a roughly triangular pattern."],"Region":"Texas","files":["/var/www/straped/mufon/html2text/25155.html.txt","/var/www/straped/mufon/org/25155.html"],"City":"Farmers Branch","Source":"MUFON"}