{"Viewing Distance":"Unknown","Log Number":"GB-08212010-0006","Date of the Event":"08/20/2010 01:51 UTC","Sighting Duration":"Undisclosed","Longitude":"-86.7954","Disposition":"Unresolved","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.528021,+-86.7954(25151)&iwloc=A&hl=en\"> mufon case (25151) map </A>","Summary":"Helicopters chasing UFOs for over 10 mins. I took photos and the chopper intimidated me by hovering very low over my house!","divs":["sighting detailsi was feeding my 7 month old son \"k\" at home, when from nowhere we suddenly heard the thunderous roar of military choppers near our house. i went out to see what the commotion was and then went to get my camera (i always film helicopters of the police\\military type to see what appears in the pics later). the choppers were about 2 streets away (300 yards) from my house. however when i started taking photos of the heli's one of them flew directly above our home! it was very intimidating to say the least. my girlfriend gemma suggested that the chopper pilots may have seen my camera flash and for some reason become annoyed by it. perhaps they dont appreciate been photographed. i took several photos and many of them had 'unknown quantities' in the frame. the one photo in particular though (attached) is astounding, it appears to show a ufo materialising! i dont know what to make of it. please check it out and let me know what you think. there was lots of dogs barking, which ive mentioned has happened before in similar episodes\\circumstances. regards [name deleted\\cms\\tg], wordsley, england."],"Date Submitted":"08/21/2010 02:21 UTC","Source":"MUFON","City":"Birmingham","Latitude":"33.528021","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around August 20th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Shape":"Other","Tags":"City","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Case Number":"25151","files":["/var/www/straped/mufon/html2text/25151.html.txt","/var/www/straped/mufon/more/25151_submitter_file1__SAM_4676.JPG","/var/www/straped/mufon/more/25151_submitter_file2__UFO_4668.JPG","/var/www/straped/mufon/more/25151_submitter_file3__SAM_4923.JPG","/var/www/straped/mufon/org/25151.html"],"Region":"Alabama"}