{"Disposition":"IFO","Weather Factors":"Does Not Apply","Object Features":"Unknown","Date Submitted":"08/22/2010 12:14 UTC","Log Number":"US-08222010-0001","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around August 19th 2010"],"files":["/var/www/straped/mufon/html2text/25153.html.txt","/var/www/straped/mufon/org/25153.html"],"Summary":"Hovering UFO three days in a row.","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"35.344428","Longitude":"-97.479663","divs":["sighting detailsactually on thurs. 8\\19\\10 in the west from my home there was a hovering boomerang shaped light in the sky, brighter than any i have seen it was about 9:45pm. i watched it for about 1 hour and it just hovered. i came back outside at about 11pm and it was gone. the next night i seen the same thing but only now it was east of me at about the same time. i watched it for only about 30 minutes this time. i came back out about 1 hour later and it was gone. today i am curious about this light so i go back outside at about the same time and not only did i see the light again..i see it both to the east and west of me. it seems miles away but i can tell it hovers from side to side. the one to the west this time is blinking and the one to the east is not, but none the less i can tell these are not stars. i am going back out right now to see if it is still there.....yes they are both still there, however the one to the east is a lot closer than previous and now looks a little disc shaped and the one to the west is farther away. i just was standing in my front yard watching this because they are so bright and odd i seen the same thing in hemet, ca when i lived there over 1 yr ago. i am starting to wonder if i am being watched from afar. if i am not someone is. i just hope it is some military experiment or something. my husband seen it also and we both think it is strange. this is not airplanes. they are far away but if i can see it from that far away it has to be huge. it looks like airplane pass under and aroung and even above these objects. i wish my camera worked but it is broke so i can't include pictures but if you come into my house area and look around you will see a ufo about 9:45 to after 11pm."],"Country":"United States","Date of the Event":"08/19/2010 09:45 UTC","City":"Moore","Object Shape":"Boomerang, Disc, Star-like","Case Number":"25153","Viewing Distance":"Over One Mile","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.344428,+-97.479663(25153)&iwloc=A&hl=en\"> mufon case (25153) map </A>","Tags":"City","Object Flight Path":"Stationary,Other"}