{"Weather Factors":"Unknown","divs":["Sighting DetailsI decided to go outside and lay down on my picnic table and look up at the stars like I normally do every so often. I've been doing it for years in hopes of seeing something. All these years, I've seen satellites, meteor showers and whatnot, but tonight was different. I was looking up and it happened so fast but, what looked like two bright balls of light or whatever seemed to just kinda appear out of nowhere and fly south of where I was looking up at. They were extremely high up, what appeared to be much, much higher than any plane that I've ever seen but possibly closer than a satellite but can't say for certain. Anyway, it was like, the second they appeared, they were already flying at thousands of miles per hour. There were two of them flying side by side at the exact same speed flying from where they appeared and flew south. And I mean, these things were hauling ass!!! Only in the view of the sky I could see for a out 5-7 seconds or so but I have to say, it was definitely one of the strangest things I've ever seen looking into the night sky. Would love to know if anyone else saw the same thing."],"City":"Tukwila","trends":["There have been no other sightings in Tukwila","This sighting has never been favorited."],"Region":"Washington","Latitude":"47.473988","Summary":"Two bright lights streaming across sky together","Longitude":"-122.260956","Object Shape":"Fireball, Star-like, Unknown","Log Number":"US-08242010-0001","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"IFO","Object Features":"Undisclosed","Case Number":"25166","Source":"MUFON","Object Flight Path":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.473988,+-122.260956(25166)&iwloc=A&hl=en\"> mufon case (25166) map </A>","Date Submitted":"08/24/2010 01:28 UTC","files":["/var/www/straped/mufon/html2text/25166.html.txt","/var/www/straped/mufon/org/25166.html"],"Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"08/23/2010 09:50 UTC"}