{"divs":["sighting detailsi was leaving my local supermarket and heading home. it was around 9:30 pm. after about a mile on a freeway i turned off onto a secondary road. taking a right and then an immediate left. as i turned right i saw a car in front of me going very slow. i then saw an object in the sky straight ahead of me. i appeared very bright red in color or orangish in the center and shimmering around the edges. i thought it might be a bright star or planet at first. it was bigger than either and it was closer and brighter. im guessing it was around 10,000 feet. big though! i pulled off of the side of the road and pulled out my iphone. i took a couple of pictures however i was in a panic and could not get a zoom in the shot. while taking 2 pictures one other car approached and saw the object as well. they saw me taking pictures and asked..what is that in the sky? i replied i have no idea its why i pulled off the road! we observed the object for a minute or so, and i was convinced it might have been a star that was being refracted throught the atmosphere. im an aviation enthusiast and i have alot of experience viewing aircraft night or day. this was no aircraft! all of a sudden the outer lights dissapeared. there was a single reddish to orange light left and it went straight up into the sky quickly until the light got smaller and smaller then finally dissapeared completely!after downloading the pictures from my phone and i zoomed in on the object it appears triangular.. amazing. i am curious if you recieve anyother reprts from charleston, wv. it should have been visible to alot of people in the city as i was just in the suburb and it was very bright. i was shaking driving home and i live just a few miles away. i have walked out and looking the sky from my home but no other sightings tonight. one you open the attachments..zoom in to see what i think is a triangle shaped object. *(wit's name deleted--sgonzalez\\cms."],"City":"Charleston","Region":"West Virginia","Case Number":"25161","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Date Submitted":"08/22/2010 11:59 UTC","Latitude":"38.35299","Object Flight Path":"Undisclosed","Object Shape":"Teardrop, Triangle","Summary":"Observed a bright Shimmering object above me after turning on a side road.","Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.35299,+-81.623023(25161)&iwloc=A&hl=en\"> mufon case (25161) map </A>","files":["/var/www/straped/mufon/html2text/25161.html.txt","/var/www/straped/mufon/more/25161_submitter_file1__UFOCharlestonZoom3.jpg","/var/www/straped/mufon/org/25161.html"],"trends":["There have been 13 other sightings in Charleston","There were no other sightings in Charleston on or around August 22nd 2010","This sighting has never been favorited.",""],"Longitude":"-81.623023","Disposition":"Insufficient Data","Log Number":"US-08222010-0001","Date of the Event":"08/22/2010 09:31 UTC","Country":"United States"}