{"files":["/var/www/straped/mufon/html2text/25169.html.txt","/var/www/straped/mufon/more/25169_submitter_file1__MOV04730_0001.jpg","/var/www/straped/mufon/org/25169.html"],"Region":"Illinois","Source":"MUFON","divs":["sighting detailstwo or maybe the same ufo flies over chicago for 10 minutes on 8\\23\\10 starting first at 4:24 pm cdt then reappearing at 4:30 pm flying in same noiseless slow pattern. the ufo was a slow moving bright star-like orb that shimmered like a diamond in the sun's light. i was in my backyard watching the sky. i have been filming this ufo phenomenon frequently for a year now. on mon 8\\23 a bright star first appeared east over downtown then slowly moved in a west south west direction. i filmed as if flew over for five minutes. then a second bright ufo orb appeared 1 minute later in the same spot it started and flew the same 5 minute long flight pattern but this time directly over my head. it then disappeared. sorry the video isnt great but ok it gets blurry and out of focus at times during the 10 minutes it leisurely flew across the sky but i wanted to report it because there were other similar reports of this on same date. not sure what these ufos are but they seem to be consistently over the same part of the sky in chicago. my youtube channel has similar recorded objects in the same part of the sky on different dates. not sure what it means but they are fun to watch. thanks for reading. peace watch 10 minute video at (link moved to additional evidence section below--sgonzalez\\cms)."],"Disposition":"Unresolved","Country":"United States","Date of the Event":"08/23/2010 04:24 UTC","City":"Chicago","Case Number":"25169","Latitude":"41.886214","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.886214,+-87.625118(25169)&iwloc=A&hl=en\"> mufon case (25169) map </A>","Object Features":"Undisclosed","Date Submitted":"08/24/2010 01:53 UTC","Weather Factors":"Unknown","Longitude":"-87.625118","Object Flight Path":"Undisclosed","Tags":"City","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around August 23rd 2010","This sighting has never been favorited.",""],"Object Shape":"Diamond, Sphere, Star-like","Sighting Duration":"Undisclosed","Log Number":"US-08242010-0004","Summary":"Shimmering daytime UFO slowly flies over Chicago 10 min HD video."}