{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 8 other sightings in Burlington","There were no other sightings in Burlington on or around August 21st 2010"],"City":"Burlington","Object Features":"Undisclosed","Date Submitted":"08/23/2010 06:19 UTC","files":["/var/www/straped/mufon/html2text/25164.html.txt","/var/www/straped/mufon/org/25164.html"],"Weather Factors":"Unknown","Date of the Event":"08/21/2010 12:00 UTC","Disposition":"Unknown","Tags":"City","Case Number":"25164","Latitude":"48.485282","Log Number":"US-08232010-0003","Object Shape":"Other","divs":["Sighting DetailsWas out in back yard watching stars. Started walking back to house but turned around for one last look and thats when I saw the object coming straight towards me about 80 ft. above me. Was shaped like a bell with amber color on top, blue in the middle and white on the bottom. Looked to be about 6 to 7 FT. wide and about 8 ft. tall, as bright as could be. I stood there watching this amazing object because I didn't want to miss any part of this. It kept coming right towards me then dipped down a bit and must of noticed me and that's when it disappeared. From as bight as could be to nothing. It just disappeared. It came from the south behind our house where the Skagit river is only about 5 blocks away from our house. I was in awe, excited and in wonder and shock. But when it kept coming straight towards me I became a little scared. But I was NOT going to move because this was a once in a life time thing to see. I became very upset and mad because it had diappeared. I wanted to see the whole thing fly over me.I have heard of USO's and the Skagit river is only 5 blocks from our house. I know that sounds a little far fetched but you never know. It was the best experience of my life concerning UFO's. I will never forget it! Oh yes ,when I first noticed it I had no idea what it was."],"Longitude":"-122.316788","map":"<A HREF = \"http://maps.google.com/maps?q=48.485282,+-122.316788(25164)&iwloc=A&hl=en\"> mufon case (25164) map </A>","Source":"MUFON","Country":"United States","Summary":"Colored bell shaped object about 80 ft. above. Got very close to me then must of noticed me and disappeared. Coming directly at me.","Viewing Distance":"Unknown","Region":"Washington"}