{"trends":["There have been 16 other sightings in Frederick","There were no other sightings in Frederick on or around August 8th 2010"],"Date of the Event":"08/08/2010 08:53 UTC","Case Number":"25168","City":"Frederick","Viewing Distance":"101-500 Feet","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Triangle of lights over swimming pool.","Weather Factors":"Unknown","Object Shape":"Triangle","divs":["Sighting DetailsI am writing this on behalf of my daughters: There were three girls involved in the sighting: my daughters which are 14 and 11 and there friend who is 12. They think the whole idea of UFO's are silly and have little to no knowledge on the subject. We were leaving the swimming pool and walking to the celler doors which are about 10 feet away. It was around 9 pm and was almost dark. We noticed a bright light on the ground in the middle of the yard and looked up. There were four really bright lights just hovering there, they were about the size of basketballs. There were three outer lights that formed a triangle and one in the middle. The lights were very bright and white; we could not make out any details of a plan, ships, etc... My sister handed me the digital camera (we had been taking underwater pictures in the pool, so we had the camera with us) and we took four pictures. There was no sound except for some kind if wishing noise when it took off. I'm not sure how long it hovered, seconds. Then it slowly drifted across the backyard toward the woods and then took off and was gone. As it took off it turned to the left and seemed to leave a trail of light for just a few seconds. We were very scared and are not sure what it was."],"Tags":"City","Latitude":"39.423489","Date Submitted":"08/24/2010 12:39 UTC","files":["/var/www/straped/mufon/html2text/25168.html.txt","/var/www/straped/mufon/org/25168.html"],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=39.423489,+-77.402451(25168)&iwloc=A&hl=en\"> mufon case (25168) map </A>","Disposition":"Unknown","Object Features":"Unknown","Longitude":"-77.402451","Region":"Maryland","Country":"United States","Log Number":"US-08242010-0003"}