{"Country":"United States","Source":"MUFON","Longitude":"-122.413936","Sighting Duration":"00:00:10","Tags":"City","City":"San Francisco","Object Flight Path":"Path then hovering","Viewing Distance":"Over One Mile","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around June 10th 2010"],"Region":"California","Disposition":"Unknown","divs":["Sighting DetailsI was in my backyard in Noe Valley district in San Francisco around 12:30am on June 10, 2010 and I was looking around at the garden. Sometimes I go out there at night and relax in the garden so this was normal for me. I was completely involved in looking down at the ground and my plants when something caught my eye in the sky to the south of me. I looked up and saw a large group of around ten dimly glowing red lights forming an uneven \"v\" pattern in the sky. When I say \"uneven\", I mean that they formed a v shape, but one side of the v extended out farther than the other. Picture like a check mark shape with the longer side on the right. It was completely silent and glided across the night sky from east to west. It didn't appear to be moving very quickly and I was confused because at first I just assumed it was the underside of a plane. I remember thinking that the plane I was looking at was in pretty crappy condition because its lights were burnt out on one end causing it to have a check mark shape instead of a full v. Then I realized it was not making any noise, and I started to get chills down my spine because I was quickly realizing that it was not a plane. I couldn't tell how high up in the sky it was, but I could tell that if it was a plane, it would have to be flying extremely low to be as wide as it was. It also most definitely would make loud noise. I felt like the floor fell out from under me. Then, as I was fighting to accept what I was seeing, something amazing happened to make me know without a doubt that what I was seeing was extraterrestrial. As the formation of lights slowly glided across the sky, the portion of lights which created the uneven, extended part of the v broke off from the rest of the lights. It spun rapidly in clockwise circles, shot off into space, and was gone. What now remained in the sky was a normal even \"v\" configuration of lights which had slowed its movement in the sky above me. Then it faded away and was gone. The glowing reddish orange lights just faded away, just like when you turn off a light on a dimmer switch slowly. The whole event lasted about 10 seconds. I stood there completely blown away. I am not a ufo nut or even ever think about the subject. This makes me change my perspective on a lot of different things in my life. I now know that we are not alone and there is at least one far more advanced species of life than us. I kind of feel privileged to have seen this."],"Weather Factors":"None","Object Features":"Unknown","Log Number":"US-08232010-0002","Case Number":"25163","map":"<A HREF = \"http://maps.google.com/maps?q=37.78405,+-122.413936(25163)&iwloc=A&hl=en\"> mufon case (25163) map </A>","Latitude":"37.78405","Date Submitted":"08/23/2010 04:24 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/25163.html.txt","/var/www/straped/mufon/org/25163.html"],"Date of the Event":"06/10/2010 12:00 UTC","Summary":"V shaped formation of reddish orange lights seen gliding over San Francisco, CA 6/10/10."}