{"Viewing Distance":"Unknown","Case Number":"25178","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.986191,+-84.371312(25178)&iwloc=A&hl=en\"> mufon case (25178) map </A>","Date of the Event":"08/24/2010 09:00 UTC","Date Submitted":"08/25/2010 07:20 UTC","Country":"United States","Summary":"Hovering directly over our house for at least 3 hours.","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Longitude":"-84.371312","files":["/var/www/straped/mufon/html2text/25178.html.txt","/var/www/straped/mufon/org/25178.html"],"Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Appendage(s), Other, Unknown","Region":"Georgia","City":"McCaysville","Object Shape":"Chevron, Circle, Cross, Sphere, Star-like, Triangle, Other, Unknown","Log Number":"US-08252010-0003","Latitude":"34.986191","divs":["Sighting DetailsI went outside just to get some fresh air & look at the stars and I noticed one was extremely bright. Well, then I noticed it was moving slightly. I kept watching and it didn't move like anything I've ever observed before -- planes go overhead often & even helicopters (some planes went by while this thing was around, & it was always still as they went by then started moving again once they were out of sight.) As far as the locomotion goes, it could be absolutely still, or in constant motion, it most often moved in small increments but sometimes crossed more distance and often circled back on itself almost like it was covering a grid or something? I called my sister outside and she brought a couple of pairs of crappy little binoculars we have, so we were able to get a little closer look. At times it was almost like an orb, then at others perhaps comprised of smaller lights in an almost triangular shape. Often, there were 'arms' or offshoots of light or that would have a light on the end. With this closer look, we could also see it was NEVER perfectly still even tho it appeared so with the naked eye. It was in constant motion - faster than anything man-made could possibly be in my opinion. At times it was almost like it was drawing shapes in the sky in such rapid movements we could almost see the circles & marks it made for a split second inscribed in light before our eyes caught up & they faded away. It was almost like it was dancing, lol. As strange as it was, it was beautiful. All the shifting, moving, lights that mostly appeared white, but sometimes I would catch hints of blues, greens, & reds in the mix. I'm very curious what it could be, because honestly I've never heard of any UFO that behaved in quite this way... We'll definitely be looking up to the sky tonight as well for any signs of anything unusual, just in case. Unfortunately we can't seem to get pictures as our digital camera does NOT like to work in dark lighting. : ("],"Disposition":"Insufficient Data","trends":["There have been no other sightings in McCaysville","This sighting has never been favorited."]}