{"divs":["sighting detailsi was up at the top of mt. hamilton in san jose with a friend taking some pictures of the night sky. we were looking to get photos of saturn and mercury. my friend had a constellation program on his phone that he pointed to the sky to find where we should look. while he was trying to set up the program we noticed a big bright star over the flight path in san jose. we looked at his phone to program, looked up and it was gone. we thought it must have been a plane. about 10 minutes later, my friend noticed a big bright \"star\" in the trees to the right and in front of the observatory. he then noticed it was moving. we walked out from behind the tree to look at the light in the clear and noticed then that the object was hovering from side to side in the same place\\same level. it then slightly and smoothly moved up, then came back down to its original location and continued to move from side to side. you can see this in the attached photo 6981. although you can not see it moving, you can tell when you magnify the picture that it is not a star and not a plane. in addition to this... when we arrived at the top of the hill before noticing the light object, i felt a presence to my right while exiting the car. i continued to feel the presence while on the hill side, but did not see anything. the next day, my friend sent me some of the pictures he took of me standing on the edge of the cliff looking out into the valley. in photo 6989 attached, you will see an orb with what looks like a blue light in the shape of a body standing in front of me to my right. it looks like the shape is mirroring the way i am standing. i was not afraid and felt safe the entire time. the light object was still hovering right in front of the observatory to our left when we departed 20-30 mins later. it was the first time i had ever seen anything like that and it was amazing :)"],"Date of the Event":"08/19/2010 12:00 UTC","Longitude":"-121.889706","Source":"MUFON","Weather Factors":"None","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/25174.html.txt","/var/www/straped/mufon/more/25174_submitter_file1__DSC_6989.jpg","/var/www/straped/mufon/more/25174_submitter_file2__DSC_6981.jpg","/var/www/straped/mufon/org/25174.html"],"Region":"California","Country":"United States","Tags":"City","Latitude":"37.343566","Summary":"Bright ball of white light hovering side to side.","Case Number":"25174","Sighting Duration":"00:20:00","Object Features":"None","Object Flight Path":"Stationary,Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=37.343566,+-121.889706(25174)&iwloc=A&hl=en\"> mufon case (25174) map </A>","Date Submitted":"08/24/2010 07:35 UTC","City":"San Jose","Disposition":"Hoax","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around August 19th 2010","This sighting has never been favorited.",""],"Object Shape":"Circle, Oval","Log Number":"US-08242010-0009"}