{"Date Submitted":"08/24/2010 02:00 UTC","Longitude":"-85.593304","Object Shape":"Sphere","Disposition":"Unknown","trends":["There have been no other sightings in Charlevoix, maybe Ironton","This sighting has never been favorited."],"Object Flight Path":"Stationary","Summary":"Saw large sphere low over south arm of Lake Charlevoix.","files":["/var/www/straped/mufon/html2text/25170.html.txt","/var/www/straped/mufon/org/25170.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.323784,+-85.593304(25170)&iwloc=A&hl=en\"> mufon case (25170) map </A>","Tags":"City","Viewing Distance":"Unknown","Country":"United States","Log Number":"US-08242010-0005","Source":"MUFON","Date of the Event":"08/15/2010 12:00 UTC","divs":["Sighting DetailsWhile visiting my in-laws at their cabin on Oyster Bay, I was out riding a kayak in Lake Charlevoix in the early evening. I had crossed the north arm of Lake Charlevoix almost to the entrance to Pine River, which exits into Round Lake, and then Lake Michigan. When I was about 100 yards from the old train trestle bridge abutments that flank the entrance to Pine River. I turned the kayak south to head back directly to Oyster Bay. It was a lovely evening, about 7:30 p.m., clear and warm, with little cloud cover. The Lake was a bit rough, with maybe 1 to 1.5 foot swells, but no white caps. Stiff wind from the west, I think, though I am no expert. As I turned, I noticed a large pinkish-silver sphere low over the trees way south near what I guessed was Ironton but not as far south at East Jordan. It just floated there. I thought at first it was a hot air balloon giving rides at a fair, but I watched it over 30 minutes it took me to row back to Oyster Bay, and although it appeared to shift location slightly, it never went up for down much. In order to try to place the object, I noted that if I held my hand at arm's length with my finger at the horizon of the Lake, the sphere was about my index finger's width above the horizon and seemed to be floating slightly to the left of the narrow center portion of Lake Charlevoix. It could have been father south than Ironton, but since I'm no sure how big it was, I'm not sure how far south it floated. I could block my view of the sphere with my index finger but not by much. It looked big. It was a solid, pink-silver color, not with any graphics like you would expect on a hot-air balloon. I tried and tried to spot a gondola, but could not see anything hanging below it. I wondered if it could be a Coast Guard weather balloon, because I know there is a Coast Guard station in Charlevoix. But if the sphere was tethered to a boat, I could not see it. Anyway, it was a clean sphere, not an upside down teardrop shape like you would expect to see in a weather balloon. It was actually rather beautiful, like a plain little pink Moon. As I paddled, I kept expecting it to disappear or to move. There were maybe two or three power boats visible on the Lake. None were remotely close to me, so although I wanted to hail a boat to see if anyone could confirm my sighting, I couldn't. Surely someone else must have noticed this thing. I raced back to the Bay in hopes of getting a better look with my binoculars, but I lost sight of the sphere behind the tree line there as I rounded the point going into the Bay. I even climbed onto the roof of the cabin to see if I could spot it from there. But it was still below the tree line, and by then it was getting dark, so I gave up. It occurred to me later in bed that I should have called the CG in Charlevoix to ask what it was or to call the local police to see whether they knew, but the next morning it seemed like it would be too silly to do so and I would just be laughed off as a kook. I have no idea what the sphere was, and I would be grateful to anyone who could tell me if it was merely a mundane object or some weather phenomenon. Someone else had to have seen it."],"Region":"Michigan","Latitude":"44.323784","Case Number":"25170","Object Features":"None","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Charlevoix, maybe Ironton"}