{"Summary":"White object seen apparently static at approx 10,000 Ft . broad daylight.","Object Flight Path":"Undisclosed","Longitude":"-1.792627","Viewing Distance":"Unknown","divs":["Sighting DetailsI was passenger in a car driving from Bristol to Reading and noticed an object that was apparently very white in colour. It did not seem luminous.it was in bright sunshine.there was light patchy, fluffy, cumulus cloud just below it and this could be seen passing by with the wind below the object. Although we were driving east, me and my sister witnessed this object which appeared to be static at what I would say was around 10,000 feet perhaps lower? at that height the object must have been about the size of a 737. My immediate thoughts were it must be a tethered balloon although this was way high and would have been a danger to other aircraft. the visibility was so good that I am certain there was no tether. The shape was unlike a blimp or airship and there was no motion that would be consistent, particularly in the strong SW wind. it did not bob or rotate or move with the crosswind. the shape was like a squished as in flattened figure of eight. lying on its side. so nearly cigar shaped but with a dip in the middle. we watched it as long as our eyes could focus on it from very close to what must have been about 3 miles away. I was frustrated I could not just pull over and watch it but we were on the motorway. I have seen a lot of aircraft in my time but this was odd. However it did not do any freaky manoeuvres, it was static."],"Disposition":"Unresolved","Country":"United Kingdom","Date Submitted":"08/25/2010 08:53 UTC","Latitude":"51.561599","Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"08/22/2010 12:00 UTC","City":"Bristol / Swindon","files":["/var/www/straped/mufon/html2text/25176.html.txt","/var/www/straped/mufon/org/25176.html"],"Tags":"City","Region":"","Log Number":"GB-08252010-0001","trends":["there have been no other sightings in bristol \\ swindon","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.561599,+-1.792627(25176)&iwloc=A&hl=en\"> mufon case (25176) map </A>","Weather Factors":"Unknown","Object Shape":"Other","Case Number":"25176"}