{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25175.html.txt","/var/www/straped/mufon/org/25175.html"],"City":"Overland Park","divs":["Sighting DetailsOn August 23rd 2010 at approximately 2140hrs, I ask my wife if she would like to go for a drive. It took us approximatley 10 minutes to get dressed and start the car. We decided to go for gas in Raytown at 87th street. After Paying for gas, I walked over and began to pump my gas. While Pumping I began to look around the sky and noticed in a distance a brightly illuminated star that hung low in the sky. I brought it to my wife's attention and suggested that we drive toward it. First we drove toward Overland Park Kansas and noticed that the star appeared to be moving. So we ajusted our direction to the South toward Butler Mo. As we got to Butler, we notice that the star appeared to be a bit north and west of our current position. So we again changed direction. Now driving toward Belton. Once we got to 166th street we turned east. While driving on 166th we stopped and pulled over because we noticed that the star was now dimming, and it was now comming in our direction. It seemed to have spotted us some how. While we sat there party on the sholder and half of my car still in the street this very large craft flew directly overhead turning it's extremely bright light completely off. Watching it fly over I marveled at how large it was. This night there was a full moon and I could see that it was trianglular in shape. as It was flying South Now headed toward Butler fast. We continued to keep our eyes on it as it turned its bright star like light back on and tried to drive in it direction again. Needless to say we couldn't catch it again. This Thing just sits in mid air for hours (atleast until we noticed it and began to drive toward it) What it was I couldn't tell you but it was but it wasn't a conventional air craft. I'v never seen anything this big! I know we have B2 Bomber2 in the area, but this was'nt that. I seen the B2 up close and this thing was 3 to 4 times as large. For those of you who saw it in Overland Park, I'm sure that this is not the first time anyone has noticed it. I've noticed it from Raytown MO, but this was the first time I decided to drive toward it to see what it was. I seriously think that perhaps now is the time to report any and all sightings. I'm not trying to panic anyone, but there is something really serious going on. I've got more strange pictures and videos than I really care to have. I hope that All (and I do mean all) these creatures are here for peaceful purposes. I should also mention that I was taking pictures of the moon the night before and I notice that there is something there that was'nt there before. Atleast not in any prior pictures that I have taken. Someone else out there knows whats happening without speculation and is either unwilling or unable to comment on these phenomena at this time. But mark my words, That day is comming!"],"Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"Large triangluar craft with extremely bright light front or center, blue lights at the rear.","Log Number":"US-08242010-0010","Object Features":"Other","Disposition":"Unknown","Longitude":"-94.662472","Region":"Kansas","Country":"United States","Object Shape":"Star-like, Triangle","Date of the Event":"08/23/2010 10:00 UTC","Latitude":"38.987948","map":"<A HREF = \"http://maps.google.com/maps?q=38.987948,+-94.662472(25175)&iwloc=A&hl=en\"> mufon case (25175) map </A>","Date Submitted":"08/24/2010 07:54 UTC","Case Number":"25175","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around August 23rd 2010"]}