{"Country":"United States","Log Number":"US-08252010-0007","Longitude":"-97.483203","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25182.html.txt","/var/www/straped/mufon/more/25182_submitter_file1__Unknown1.jpg","/var/www/straped/mufon/more/25182_submitter_file2__Unknown2.jpg","/var/www/straped/mufon/more/25182_submitter_file3__DSC05299.JPG","/var/www/straped/mufon/org/25182.html"],"Tags":"City","Object Shape":"Egg, Fireball, Sphere, Other, Unknown","Source":"MUFON","divs":["sighting detailsstrange light orange\\white color traveling in northeastern direction. i live in southwest okc\\moore. approximate time of sighting 10:05pm clear sky, no clouds. the object was a distance away and was approximately the size of a pea at arms length...went inside to wake up my wife but she did not come out in time. i ran back outside (didn't think about getting camera) and saw it getting considerably smaller and turned a bluish white color then went out. i live next to an international airport...and have seen all kinds of airplane lights, but this was different. it floated\\glided very different than a conventional airplane. this is the second time in the last year that i have seen weird lights. last year i saw a light directly west of my house just above the horizon..it looked like the light from a welding torch bluish white. observed it for several days and then it no longer appeared in the sky. as for the object observed tonight august 25, 2010. it was moving at a constant pace, and no sound was heard. i just went back outside and seen another object about 10 minutes ago. i took several photos of it(see photos). earlier today there were several black helicopters flying around and directly over my house. i took several photos of helicopters (see photos). perhaps they were doing exercises? i've only seen helicopters several times in the last 10 years. and never have i seen two small black helicopters side by side like today."],"Region":"Oklahoma","Object Features":"Undisclosed","Case Number":"25182","Date Submitted":"08/25/2010 11:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.348468,+-97.483203(25182)&iwloc=A&hl=en\"> mufon case (25182) map </A>","Date of the Event":"08/25/2010 10:05 UTC","City":"Moore","Latitude":"35.348468","Weather Factors":"Unknown","Summary":"Orange floating/gliding light.","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around August 25th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed"}