{"City":"Pullman","Log Number":"US-08262010-0002","divs":["Sighting DetailsThe SW of the full moon an object flashed into existence. MY friend and I had been driving along back roads of Asotin County, WA. As we crossed into Garfield County we stopped to use the restroom. We both noted how eerie it felt being where there were no lights or people (other than the full moon). Shortly after saying that the object appeared as an extremely bright white light (comparable to the moons brightness). At first we didnt really know what to make of it. And joked around that it may be an UFO. We both exclaimed as it started to bob back and forth; left to right in a downward arc. Stars tend to flicker because of atmospheric disturbances, this object didnt flicker at all. And the fact that it was moving side to side gave it away. I have never seen anything do that ever. I panicked a little bit and my friend and I got back in my car and drove back to his house. After dropping him off and noticing that the object was still there, I drove the 30 miles back to Pullman. As I pulled into my drive way and stepped out of my car I looked at the moon and the UFO was still there. By that time it was about 12:15am Thursday August 26th. I woke up my roommate to confirm what i was seeing and we both noticed that the object seemed to get smaller and change to an amber color. Right now I am in a state of shock, fear, thrill, anxiety all wraped into one. I never thought I would have seen a UFO in my life time. I love the paranormal and have been reading books, listening to podcasts since I was a young boy (podcasts are newer though). I actually was a member of MUFON for awhile. And i feel its important to make sure my sighting is out there. And see if any other people saw what I saw."],"Summary":"UFO suddenly appeared near the full moon. Bright white flash","Viewing Distance":"Over One Mile","Date of the Event":"08/24/2010 10:35 UTC","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=46.734744,+-117.177136(25184)&iwloc=A&hl=en\"> mufon case (25184) map </A>","Longitude":"-117.177136","Sighting Duration":"02:00:00","Tags":"City","Disposition":"IFO","Object Features":"None","Date Submitted":"08/26/2010 04:03 UTC","Region":"Washington","Country":"United States","Case Number":"25184","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/25184.html.txt","/var/www/straped/mufon/org/25184.html"],"trends":["There have been 3 other sightings in Pullman","There were no other sightings in Pullman on or around August 24th 2010"],"Object Shape":"Circle, Flash, Sphere, Star-like","Latitude":"46.734744","Source":"MUFON"}