{"Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","City":"Murphysboro","Object Features":"Unknown","Longitude":"-89.335089","Date of the Event":"08/25/2010 09:08 UTC","Case Number":"25185","Summary":"Bright, star-like orb, low in sky for three nights.","Region":"Illinois","files":["/var/www/straped/mufon/html2text/25185.html.txt","/var/www/straped/mufon/org/25185.html"],"Sighting Duration":"Undisclosed","Latitude":"37.764495","map":"<A HREF = \"http://maps.google.com/maps?q=37.764495,+-89.335089(25185)&iwloc=A&hl=en\"> mufon case (25185) map </A>","Tags":"City","trends":["There have been no other sightings in Murphysboro","This sighting has never been favorited."],"Disposition":"IFO","divs":["Sighting Details Beginning August 23rd, I was sitting on my couch, looked out my back window and noticed what looked like an reddish -hued star (western sky). However, it was larger than any other star in the sky, and was sitting very low, below the clouds, right at my tree line. It seemed to stay still and i ignored it for a while not really knowing what it was. 3 hours later, I checked it again and it was significantly higher and had moved farther south. Me and my friends came to the consensus it was most likely a weather balloon from the local university (considering the movement). We tried to take some pictures on our phones, but all we'd get is a dot of light...not much. The next evening (August 24th), when I saw it again in relatively the same place and time I assumed it was a weather balloon and didn't pay much attention...until yesterday, August 25th when , after seeing it for a third time in a row, in the same western sky, I decided to sit outside and watch this thing. My friend joining me, we sat and watched. The first thing we noticed was that it was indeed moving..up and south. The light(which was really all we could go off of) coming from the object, resembled a bright white orb, with red flashes or strobes emitting from the ends. Heres where it gets funky....after about an hour and a half of watching this thing (from about 9:15 to 10:45 pm) we noticed 3 (that we could see) military jets coming from the east (presumably from Scott Air Force base)...moving west towards the object. By the time they got to the object they were very far away, as all we could see was their lights flashing (indicating this object was quite large). They seemed to surround the object on one side (one above, one slightly below, and one to the side). After about 5 minutes of this, they proceeded to take turns circling the sky, one at a time, making passes at this object ( always passing underneath it). This lasted for almost an hour and in the process this object had moved even farther up and south. After the jets seemed to subside, we sat for another hour, watching the object, which continued its path up. Eyes hurting and tired, we went inside. As of 1:30 am when i looked out my window, the object was still there, that is when I reluctantly went to bed. I am determined to find out how it leaves, and am doing so tonight, if it is out again. All i can say is this: we live in a small town, the closest military base to us being Scott Air Force Base, and we are outside at night alot. We have never seen this many jets in one hour, let alone one evening, in the five years we've lived here. I would never normally report something like this, but this was the third night in a row this object was blatantly out there and I'm hoping maybe someone else caught it and possibly took a video of it."],"Date Submitted":"08/26/2010 11:04 UTC","Weather Factors":"Unknown","Log Number":"US-08262010-0003","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Stationary,Hovering then path"}