{"Case Number":"25191","Date of the Event":"08/06/2010 07:30 UTC","Source":"MUFON","Log Number":"US-08262010-0009","divs":["Sighting DetailsIt appeared in the south at near the same distance as a plane might fly past the airport. It was round at first and it reminded me of mother of pearl with a silver border around it. I spotted it first with only my eyeglasses later I used binoculars. It appeared to stand still for about a minute, then it moved very slowly higher in the sky. It appeared to stop, then it moved higher and to the west slowly. During it's movement to the west it changed shape to more of a cigar shape. The light became faintly colorful and appeared to vary rainbow like colors from left to right. After several minutes it returned to a round shape, about another minute it blinked out. I continued to look for it but couldn't find it at all. I was with my wife but she didn't see it at all, she has limited vision. At about five past eight o'clock pm I located Venus in the west and way north of the object I sighted. This sighting took place at my home on the front porch. My wife and I sit in our rocking chairs and enjoy the fresh air and sunset every evening. We live near the airport and enjoy watching the planes come low as they head for the air port. There was a light cloud cover that evening, the round object would disappear then reappear, then I would see it clearly."],"Region":"Florida","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=28.545206,+-81.370026(25191)&iwloc=A&hl=en\"> mufon case (25191) map </A>","Object Flight Path":"Path with directional change","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around August 6th 2010"],"Viewing Distance":"Over One Mile","Sighting Duration":"00:15:00","files":["/var/www/straped/mufon/html2text/25191.html.txt","/var/www/straped/mufon/org/25191.html"],"Date Submitted":"08/26/2010 10:36 UTC","Weather Factors":"None","Summary":"It was as bright as Venus in the south sky.","Longitude":"-81.370026","City":"Orlando","Tags":"City","Object Shape":"Circle","Disposition":"Insufficient Data","Latitude":"28.545206"}