{"Date Submitted":"08/27/2010 01:25 UTC","Disposition":"IFO","City":"Petaluma","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25193.html.txt","/var/www/straped/mufon/org/25193.html"],"Viewing Distance":"Unknown","Object Shape":"Star-like","Latitude":"38.234047","Case Number":"25193","Summary":"Big bright light moving then stopping several times heading south east","trends":["There have been 11 other sightings in Petaluma","There were no other sightings in Petaluma on or around August 26th 2010"],"Longitude":"-122.633822","Country":"United States","Log Number":"US-08272010-0001","Weather Factors":"Unknown","Region":"California","Object Features":"Undisclosed","divs":["Sighting DetailsWent outside the house with my two year old son at about 8 pm it was dark but the sun was still setting , I wanted to move the car across the street for the street sweeper in the morning and my son loves sitting shotgun when i have to move the cars so as i did a lap around the block i noticed a neighbor from down the street at the edge of her driveway looking up at something with binoculars, as i was driving i tried leaning forward and looking up but couldn't see what she was looking at. When I parked the car and got out with my son I looked up and there was a Big white light at first I thought it was a star but it was moving then my son was saying plane plane but it had no sound and didn't have the colored flashing lights. As I stood there and watched amazed it suddenly stopped for like 30 seconds then began moving again it did that two more times like it knew I was watching it. I felt nervous then excited and ran in the house to tell my father in law and without skipping a beat ran back out and it was gone. My wife thinks I am Crazy but I have never seen anything like that before in my life."],"Tags":"City","Source":"MUFON","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.234047,+-122.633822(25193)&iwloc=A&hl=en\"> mufon case (25193) map </A>","Date of the Event":"08/26/2010 08:00 UTC"}