{"Object Shape":"Circle, Oval, Sphere, Star-like","Weather Factors":"Unknown","Object Features":"None","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/25195.html.txt","/var/www/straped/mufon/org/25195.html"],"Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.567016,+-123.260444(25195)&iwloc=A&hl=en\"> mufon case (25195) map </A>","trends":["There have been 5 other sightings in Corvallis","There were no other sightings in Corvallis on or around August 28th 2010"],"Log Number":"US-08272010-0003","Date Submitted":"08/27/2010 02:39 UTC","Longitude":"-123.260444","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Region":"Oregon","divs":["sighting detailsi keep an ongoing list of my sightings, tonight i wrote this down as soon as it happened, i am submitting this because someone else has seen the same thing as me tonight a state away. thursday aug 28 2010 8:33pm 65deg. to the south se, moving north east. clear night i went out on front porch to have a smoke, i turned around to the south east and looked up, i saw a bright white light, the size of a car only round. the solid white \"orb\" was silent and moved from above corvallis, oregon (downtown) in an arching path towards the east\\north-east. i walked out into the yard to follow it as it got lower in the horizon. the light was only white and barely blinking at times if at all...more like it had a smaller white light on it that would blink fast a few times every 10 seconds or so, other times it was a solid bright light. the sighting lasted about 1 min. the altitude was within low aircraft range as far as i could tell. the sky was completely clear and the sun had set but it was not completely dark, i looked around and could only see a few stars starting to shine. the strange part besides being silent was that it only had the solid white light when i first saw it closer up and only started to barely blink when it was farther away, no colored lights on it at all. very bright, brighter then any star."],"Date of the Event":"08/28/2010 08:33 UTC","Latitude":"44.567016","Summary":"Bright light, not flashing, low in sky, not a plane","Sighting Duration":"Undisclosed","City":"Corvallis","Case Number":"25195","Object Flight Path":"Path with directional change","Country":"United States"}