{"files":["/var/www/straped/mufon/html2text/25196.html.txt","/var/www/straped/mufon/org/25196.html"],"Log Number":"US-08272010-0004","Object Shape":"Unknown","Disposition":"Insufficient Data","Date of the Event":"08/26/2010 12:00 UTC","Case Number":"25196","Tags":"City","Latitude":"36.781301","Object Flight Path":"Undisclosed","Source":"MUFON","divs":["sighting details my husband and i saw several of these flying objects going really fast, we could not make out what type of aircraft they were-- but they had weird flashing reddish\\whitish lights around them that seemed to pulsate, not like a regular airplane beacon with nose and tail light-- these lights were odd pulsating flashes going off and on all around the objects and the aircraft was traveling very, very fast, but traveled silently. we saw several groups of these craft in 1, 2 or 3 groups of lights traveling close together. we never saw anything like it before. we watched these things come and go for about an hour. we are wondering if these were from vandenberg afb?they sometimes send up unusual planes and things around here. we were in the back yard, at night, in the dark when we saw the odd reddish\\whitish lights pulsating in the sky. we never could make out any shape of the aircraft, but it was traveling very high, very fast, silent, and disappeared in the sky. we did not know what type of plane would have those kinds of lights, and we finally lost sight of them."],"Summary":"Several reddish flashing lights close together, some type of air craft, first sighting was 3 of them close together, and they traveled very fast, but there was no sound like a normal jet would have. Possibly some new aircraft from Vandenberg AFB?","Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","trends":[],"Date Submitted":"08/27/2010 03:03 UTC","Longitude":"-119.414962","Country":"United States","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.781301,+-119.414962(25196)&iwloc=A&hl=en\"> mufon case (25196) map </A>"}