{"Sighting Duration":"00:00:59","Tags":"City","City":"Kings Mountain","Viewing Distance":"21-100 Feet","Object Features":"Other","Country":"United States","Case Number":"2519","Date Submitted":"01/07/2003 01:24 UTC","Latitude":"35.245134","divs":["Sighting DetailsI WAS TRAVELLING SOUTHBOUND ON HWY 29 GOING SE MAKING SALES CALLS WHEN I SAW ACIRCULAR OBJECT ZOOM BY ME IN THE CORNER OF MY CARS WINDSHIELD. IT WAS A DULLSILVER DISC OVAL-DISTORTED WITH A SMALL, DULL, CIRCULAR YELLOW CENTER IN IT. THE WEATHER WAS EXCELLENT, SUNNY AND THE SUN WAS BEHIND ME SO IT WAS NOT AREFLECTION IN THE WINDSHIELD. IT HAPPENED SO FAST THAT IF I WAS NOT LOOKINGTHAT WAY, I WOULD HAVE NOT SEEN IT DRIVERS SIDE TOP CORNER OF WINDSHIELD. ITLEFT WHAT I CALLED A VIDEO STROBE ACROSS THE HORIZON FOR A SPLIT SECOND ANDTHERE SEEMED TO BE A INTERMITTENT VAPOR TRAIL IN THE SKY. IT SEEMED TO BE A 100FEET UP OR LESS AND MAYBE A 100 AWAY. I PULLED OVER TO GET A BETTER LOOK AND ITWAS LONG GONE. I STOPPED BY MY NEXT CUSTOMER AND THEIR GUARD IN THE GUARD TOWERDID NOT SEE ANYTHING. MY REACTION WAS, WHAT WAS THAT AND DID I SEE WHAT I THINKI SAW MENTIONED THIS TO MY BOSS THE NEXT DAY AND GOT LOTS OF RIDICULE...THATIS WHY I NEVER REPORTED IT. I CANT BELIEVE HOW MANY PEOPLE FIRST LAUGHED ATWORK WHEN I TOLD THEM WHAT HAPPENED. I THINK IT IS SCARY THAT SOMETHING LIKETHIS ROAMS THE SKIES AND THE GOVERNMENT WONT EXPLAIN IT OR DO SOMETHING ABOUTIT. I SAW WHAT I SAW. GEORGE DAVIS"],"Summary":"Grover, NC UFO","Date of the Event":"01/07/2003 01:24 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=35.245134,+-81.341194(2519)&iwloc=A&hl=en\"> mufon case (2519) map </A>","Log Number":"","files":["/var/www/straped/mufon/html2text/2519.html.txt","/var/www/straped/mufon/org/2519.html"],"Object Shape":"Unknown","Source":"MUFON","Region":"North Carolina","Longitude":"-81.341194","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Kings Mountain","There were no other sightings in Kings Mountain on or around January 7th 2003"],"Object Flight Path":"Straight-line path"}