{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/25192.html.txt","/var/www/straped/mufon/org/25192.html"],"Tags":"City","City":"Greater Sudbury","Source":"MUFON","Object Shape":"Triangle","Date Submitted":"08/26/2010 11:24 UTC","divs":["Sighting DetailsOn August 26th, 2010, K.H, S.T., J.A. and myself (J.C.) were walking from my house. We were walking to S.T.'s house and when we were on the corner of P and E, we looked up and saw two lights in the sky. They were fairly close and it looked like a helicopter.It seemed as if it was spinning then we could see the third dot and it was blue. It was so close you could see the metal of the triangle, probably only a couple hundred feet above us and it was as big as the moon in the sky. As it flew, it rotated slowly and it seemed to fly sideways. It did not make any noise. As we watched in amazement, a bright light flew directly towards it which, when it got closer to the object, was clearly a helicopter. It had it's spotlight on it and it seemed to try and hit the triangle. The helicopter fly and went made a turn which was wide and the triangle changed it's course suddenly towards the helicopter. They flew around each other for a few seconds. At this point I was running to get a better view and when I looked up one or both of the objects had some sort of sparks appearing all around it. It was as if it was being pelted by bullets but all over the object. It happened continuously for up to 10 seconds as they flew around each other. Everyone started shouting that it looked like it was going down. I called my dad and told him to look out his window in C C and he could see the action from there. You could not hear the triangle but you could hear the helicopter as it flew by. They flew away and they went out of sight. At this time we were at the corner of R and P street and a man and a kid got out of their car at their house beside us and they asked what was going on and they said they heard a low rumble seconds before in the car. My Dad called me back saying that aircraft was back and I looked toward C C and we could see and orb floating in the distance slowly. Then another light flying quickly towards the orb. It crossed it just nearly missing it again. The orb was near stopped then it rapidly started to turn towards the helicopter and gain speed. The helicopter flew away very quickly. They flew away in the distance and we never saw it again. About 10 minutes after the events we were walking up E by M street and a big plane flew over us and flew into the distance. Then another plane appeared out of nowhere and was blinking. It flew from above and very rapidly approached the jet. It almost reached the jet in a matter of seconds and the jet suddenly started changing its course drastically. It turned very slowly so it must have been big. Then they disappeared in the distance. There has been allot of planes flying over since and allot of sirens."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.49539,+-81.003(25192)&iwloc=A&hl=en\"> mufon case (25192) map </A>","Longitude":"-81.003","Country":"Canada","Case Number":"25192","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Date of the Event":"08/26/2010 09:15 UTC","Object Features":"Unknown","Latitude":"46.49539","Summary":"Battle in sky with helicopter, Shots witnessed, close-up view of UFO (200 feet, could see the metal).","Log Number":"CA-08262010-0010","Region":"Ontario","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 12 other sightings in Greater Sudbury","There were no other sightings in Greater Sudbury on or around August 26th 2010"]}