{"Object Flight Path":"Undisclosed","Case Number":"25206","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-83.397713","map":"<A HREF = \"http://maps.google.com/maps?q=42.692194,+-83.397713(25206)&iwloc=A&hl=en\"> mufon case (25206) map </A>","Log Number":"US-08272010-0014","Summary":"10,000-15,000 ft H. Bright light. Disappeared gradually then big flash and gone. From W to E.","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"08/27/2010 10:30 UTC","Date Submitted":"08/27/2010 11:02 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/25206.html.txt","/var/www/straped/mufon/org/25206.html"],"Source":"MUFON","Country":"United States","Latitude":"42.692194","Tags":"City","Region":"Michigan","divs":["sighting detailsthere used to be lights every night until last year. one time in late summer of 2007 or 2008, a great deal of lights put on a show above me at the old donelson elementary school yard. anyway, since early last spring i have been looking every night when i walk the dogs. tonight just as i was by the house, i saw a bright light to the west. there were three or four planes in the sky at different distances and heights. but, their lights were flashing. i watched this one to see if it was just turned at an angle that i could not see the lights. but, then a very familiar event happened as it's brightness began to fade. only three other times have i seen this, that as it faded, just as it went completely black it flashed very brightly like lightening in a cloud. but, the sky is absolutely clear tonight. then i came running into the house with goosebumps all over me telling my mom that i finally saw a light this year. this had been going on every summer since 2005. i really missed them. i figured it was like some states out west when they stayed for a while then just left. i reported how in sept. of 2008, a light traveling so fast that it was nothing conventional was being chased by two military jets. it was after this that the incidents began to stop. like i said, it had gone on every summer for years. as many as 5 or 6 a night. funny thing was they always stopped after 11:30pm. wierd but sooo coooll!!!! it travelled from the west to the east but only about 3\\4 of the way across the sky before flashing out. what i really want to know is if after all these lights in the sky above waterford, mi, did any one else see these, too? i mean, five years. (except for most of the summer of 2009 and up until aug of 2010). just let me know, thanks."],"City":"Waterford","Object Shape":"Star-like, Other","trends":["There have been 7 other sightings in Waterford","There were no other sightings in Waterford on or around August 27th 2010"]}