{"Object Features":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Case Number":"25202","Log Number":"CA-08272010-0010","Viewing Distance":"Unknown","Summary":"We saw 6 silver balls , 5 going in and out of clouds , 1 going up the river, sun was reflecting off them.","trends":["There have been 6 other sightings in Maple Ridge","There were no other sightings in Maple Ridge on or around August 26th 2010"],"Region":"British Columbia","Date of the Event":"08/26/2010 07:05 UTC","Latitude":"49.22201","Sighting Duration":"Undisclosed","Country":"Canada","Disposition":"Unresolved","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=49.22201,+-122.593249(25202)&iwloc=A&hl=en\"> mufon case (25202) map </A>","divs":["sighting detailsmy girlfriend stepped outside as we were getting ready to take my son to soccer practice, then she yelled at me \"quick come out here\" so i went out side and she told me she saw 5 shiney balls dancing in and out of the clouds. she pointed to where they were but they were gone , then i saw 1 come out of the clouds for about 3 or 4 seconds and go back in. she asked if she should get *(name deleted--sgonzalez\\cms)and i said \"yeah go get him\", and then another one came out of the clouds and was there for about 15 seconds before it went back in. this was at about 7:05 and it was still light out and you could see a silverish round ball with the sun reflecting off it, it was coming out of a low dark cloud that i estimate was 1\\2 mile away and about 1000 ft high. i had lots of time to look at this and study it and i could see it clearly. we were standing in our driveway looking east at these things. then my son came out with my girlfriend **(name deleted--sgonzalez\\cms)and we were trying to show him where we saw these things , but they were not there, then my girl friend looks south and sees one about 300 ft off the ground above the tree line moving east up the river and my son sees that one . there was another affect that we all saw , but i dont know how to explain it ... when we looked up at where these balls were in the sky , it looked like the sky was sparkeling ( as my son discribes it) but it was the whole sky and it wasn't really sparkles but almost more like we were all seeing stars or white specs. as what you would maybe see if you were blacking out , but way thicker and bigger then after about 1 minute the sky returned to normal for all of us. sorry i really don't no how to discribe this sparkle i dont know if it was in the sky, in the air, or in our eyes. if i had to pick one i would say it was in our eyes.iknow we all saw orbes in the sky moving on there own with sun reflecting off them but i couldnt tell if they were the size of a beach ball or small car."],"files":["/var/www/straped/mufon/html2text/25202.html.txt","/var/www/straped/mufon/org/25202.html"],"City":"Maple Ridge","Date Submitted":"08/27/2010 05:34 UTC","Longitude":"-122.593249","Source":"MUFON","Object Flight Path":"Undisclosed"}