{"Case Number":"25211","Weather Factors":"Windy, Light","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.527882,+-122.671767(25211)&iwloc=A&hl=en\"> mufon case (25211) map </A>","Region":"Oregon","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around August 27th 2010"],"Date Submitted":"08/28/2010 01:46 UTC","Log Number":"US-08282010-0004","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Longitude":"-122.671767","Date of the Event":"08/27/2010 09:00 UTC","Object Shape":"Star-like","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/25211.html.txt","/var/www/straped/mufon/org/25211.html"],"Latitude":"45.527882","Summary":"Portland, OR - Approx. 9 PM, bright pin-point of light seen cruising NE (in close proximity to airliner).","Disposition":"IFO","Source":"MUFON","divs":["Sighting DetailsSo I don't want to jump to any conclusions, but I can safely say I saw something strange tonight. It was just about 9:00 PM, and my family and I were just returning home from an outing in the gorge. While on I-205 southbound, I noticed it was quite a busy night for PDX; a good handful of aircraft landing lights speckled the southern and eastern horizons, and there was plenty of air traffic all over the city in general. When we exited the freeway and hit the residential area of Lents, a bright aircraft caught my attention and I decided to keep an eye on it. It was off to the south, where I'm used to seeing airliners come up and then bank east. Upon arriving home, I got out of the car and looked up; what I saw was an airliner, banking northeast overhead, with its landing lights glaring and wingtips flashing, the whining of its engine clearly audible. What I also saw was a bright, star-like point of light moving in roughly the same NE trajectory, not far from the starboard side of the plane. Now, if this was another plane, then it was dangerously close to collision with the other craft, and - while I'm not some expert on how ATC handles traffic, - it doesn't make sense to me why air traffic control would divert two landing planes so close to each other. But I'm confident that the second light was not a plane, because I noticed some strange qualities: it was one single light, no wingtips, no flashing whatsoever; its path was completely straight with no wavering (whereas virtually all other aircraft I see are turning in a slight curve); moving at roughly the same speed as an airliner, it was quite bright, almost fluorescent, and it moved either into or behind some light clouds, which changed its tint from a monochromatic bright white to a slightly bluer hue. After a few moments the light crossed paths with the plane and was therefor on the port side. It kept moving NE at the same speed until I lost it behind trees in the distance. Unfortunately, I don't have any photos. For the record, there wasn't much of a psychological involvement; it simply occurred to me that the light looked quite strange and out of place. In the interest of time, I will post this now. I understand there are some similar reports coming in. If MUFON requires any more details for investigation, I'd be happy to provide them."],"Country":"United States","City":"Portland"}