{"Disposition":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Charter Township of Clinton","There were no other sightings in Charter Township of Clinton on or around August 15th 1979"],"Latitude":"42.593848","Date of the Event":"08/15/1979 12:00 UTC","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Stationary","Source":"MUFON","Tags":"City","Longitude":"-82.912861","files":["/var/www/straped/mufon/html2text/25217.html.txt","/var/www/straped/mufon/org/25217.html"],"Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=42.593848,+-82.912861(25217)&iwloc=A&hl=en\"> mufon case (25217) map </A>","Summary":"My mother was walking our dog in the park across from our house, and came upon a landed UFO along with several beings which then engaged in conversation with her.","divs":["sighting details this is the encounter my mother had back in 1979\\1980 in st. claire shores mich at the playground\\ballfield by talbot st.&new york st.it was 7:00pm maybe 8:00pm,august or sept,she was 45 yrs old &i was 10 yrs old or so,and my sister was 16yrs old.my mother just recalled this past incident about 4 or 5 months ago,and told my sister the story,who then informed me of it this past july.it began that evening,my mother took our dog rocky out for a walk,she is never gone more than hour or so,but that all changed during this walk.after an hour i began to worry,imust have told my sister because she clearly remembers me being alarmed.here is the story my mother conveyed:while i was walking rocky across the park\\ballfield i noticed odd lights all different colors flashing on the ground,i thought it was strange that utility workers would be working at this time in the late evening.next i saw several who i thought were small children all around me.they did'nt look like normal kids though and then they began to talk to me,not through their mouths,but through their minds.i heard them clearly in my mind.the beings said why don't you come with us,and i said to where,and one of said to our craft right over there. i said no i'm busy why should i go with you,and they responded because we want to help you.then another being asked me what is that next to you?before i could answer one other being said thats her pet.then one of them said again come with us we want to help you,i told them if you want to help me you should go to washington.what is washington?one of them said.after that exchange my mother says she remembers very little.a note to the reader,i had an encounter in my yard when i was 7 or 8 years of age.a craft was hovering over our front yard and i saw 3 beings staring down upon me from inside the craft,which was about 60 or 70 ft above me.also my sister saw a ufo hovering near her while she was on her bike,she was 10 or 11 at the time,and it occured at talbot st and new york st also . our house is only 5 or 6 houses from new york st.today the house is still there,but nobody resides there yet.by the way my childhood friend & his family always told me & others that our house was haunted,because they saw bluish glowing or bluish orbs over our rooftop more than once back in the late 70's."],"Object Shape":"Chevron, Oval","City":"Charter Township of Clinton","Case Number":"25217","Object Features":"Patterned Surface","Region":"Michigan","Log Number":"US-08282010-0010","Date Submitted":"08/28/2010 01:02 UTC"}