{"files":["/var/www/straped/mufon/html2text/2521.html.txt","/var/www/straped/mufon/org/2521.html"],"Latitude":"38.935112","Date Submitted":"09/10/2003 09:00 UTC","Weather Factors":"Unknown","Case Number":"2521","Object Features":"Other","divs":["Sighting DetailsKevin and I were walking along the beach in Cape May, New Jersey from theLighthouse, walking North. I felt a stange sensation that someone was watchingus. I am a military brat so I can sense when I am being watched. I am usuallyright on the nose with people. As we reached the town near the beach, I lookedover to my left about 9pm EST and saw two red orange lights bigger then I haveever seen that quickly spread outwards into about 10 lights in each directionand then converged into two lights as if lining up and it got extremely brightin the sky and then there was a flash of sparklers that cannot be compared tofireworks and then disappeared. It looked very much like a calculated formation.I grew up on military installations most my life and understand seeingformations, but I have never seen anything like this ever. The lights were toobright to be planes and do not look like anything I have ever seen in the skybefore. They werent flares because I have seen every type of flare with myfather in the military and it was too high to be a flare and there was no trail.The lights were about about 8 times brighter then Mars. Shortly after theformation, the lights would show up singular or with three in formation neareach other and then blink out. On one occassion the light stayed on for a periodof just over a minute and then disappeared. My first reacton was fear andanxiety. I have a background in physics and was shocked to see what I saw. Icould not believe it. I have brothers who are pilots in the Air Force so thiswas very bizarre. Afterwards, I was still afraid and did not know what the hellthat was. I am a person of reason so this was a very bizarre thing to witness.The objects disappeared and did not appear for long periods of time. This lastedabout over 30 minutes."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.935112,+-74.906005(2521)&iwloc=A&hl=en\"> mufon case (2521) map </A>","Disposition":"Insufficient Data","Summary":"Cape May Red Light Formation","Log Number":"","Object Flight Path":"Straight-line path","Object Shape":"Unknown","Country":"United States","Region":"New Jersey","Date of the Event":"09/10/2003 09:00 UTC","Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"00:30:00","trends":["There have been 3 other sightings in Cape May","There were no other sightings in Cape May on or around September 10th 2003"],"City":"Cape May","Longitude":"-74.906005","Source":"MUFON"}