{"divs":["Sighting Details Last night we saw several UFO's over Clovis, CA. They were some type of aircraft, moving very swiftly, with pulsating red lights that also flashed to white. My husband and I watched from our back yard, the same place as we did last night. At 10:30 PM, we saw the first of 8 UFO craft in the Northern sky over Clovis. This time they seemed much farther away. They moved fast, were silent (unlike jets) and they went clockwise and counter clockwise from the N. sky until they were out of view. The craft were mostly single tonight and not in formations of 3. -- What we saw both yesterday and tonight was EXACTLY like the man shot in the Clovis video he did awhile back at 5AM, where he showed an aircraft that had pulsating lights which moved across the sky about tree level. What he shot was just like we saw last night and tonight! The sightings tonight started at 10:05PM and ended at 11:20PM.-- We could not make out the shape of the craft, just the pulsating lights they had. --Also, they were NOT lanterns sent up as a prank as one person recently suggested. They did not move slowly with the wind currents, but moved fast, against the wind. And the lights around them were bright,quivery,and pulsating, but not like the beacons that are on normal aircraft. We will look tomorrow night to see if there is any more activity. We don't have a video camera, but I wish someone else in Clovis would look up into the Northern sky tomorrow arount 10PM and see if they can't get some footage of this."],"Date of the Event":"08/27/2010 10:05 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Disposition":"Insufficient Data","Date Submitted":"08/28/2010 04:45 UTC","Latitude":"36.831768","Tags":"City","Summary":"Second sighting of red/white pulsating lighted aircraft over Clovis, CA.","Region":"California","Log Number":"US-08282010-0005","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Flash","Country":"United States","trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around August 27th 2010"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/25212.html.txt","/var/www/straped/mufon/org/25212.html"],"Longitude":"-119.698719","map":"<A HREF = \"http://maps.google.com/maps?q=36.831768,+-119.698719(25212)&iwloc=A&hl=en\"> mufon case (25212) map </A>","Case Number":"25212","City":"Clovis"}