{"divs":["Sighting DetailsOk so... i was watching the airplanes in the sky tonight between 9 and 10. Then i saw a bright star about half the size of the moon. It was sitting in the sky at low altitude kind of (20 degrees above horizon), not moving, just white color. For about 2-3 min. Then it started moving slow, then it moved higher and started flying fast, faster then airplanes, and i saw green red and white lights flickering, like some christmas tree. I can't tell what the shape was, but it was really big and got bigger when it was flying... THere were at least 10-15 lights all over, and sometimes it looked more like a triangle shape, sometimes like circle i can't tell. It was too far. After that i kept watching the sky... was wondering if i'd see anything else. And after about 10 min I looked to the right from my window (3rd floor) and i saw a single bright ball fly by super fast on the low altitude staying on the same level but zigzaging a little bit. I absolutely freaked out because that was closer then I would like to see anything like that. I jumped away from the window and closed blinds. I don't think anybody is going to hurt me or take. but that was a mind shock because it was nothing like anything else I've seen with my eyes and it was very close. If anyone else saw it please let me know! I'd really like to talk to somebody about this."],"Disposition":"Insufficient Data","Object Shape":"Circle, Diamond, Triangle","Longitude":"-122.328391","City":"Seattle","Log Number":"US-08292010-0003","Object Features":"Unknown","Region":"Washington","Date of the Event":"08/28/2010 09:39 UTC","Latitude":"47.60776","Case Number":"25227","files":["/var/www/straped/mufon/html2text/25227.html.txt","/var/www/straped/mufon/org/25227.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.60776,+-122.328391(25227)&iwloc=A&hl=en\"> mufon case (25227) map </A>","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Summary":"Bright light about half size of the moon stationary in the sky, then starts flying slow, then fast and changes colors.","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around August 28th 2010","This sighting has never been favorited.",""],"Viewing Distance":"101-500 Feet, Over 1 Mile","Tags":"City","Date Submitted":"08/29/2010 01:57 UTC"}