{"map":"<A HREF = \"http://maps.google.com/maps?q=44.427909,+-69.004663(25221)&iwloc=A&hl=en\"> mufon case (25221) map </A>","City":"Belfast","Latitude":"44.427909","files":["/var/www/straped/mufon/html2text/25221.html.txt","/var/www/straped/mufon/more/25221_submitter_file1__UFOpath.jpg","/var/www/straped/mufon/org/25221.html"],"Object Features":"None","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Region":"Maine","Longitude":"-69.004663","Summary":"Backward flying triangle.","Country":"United States","Date Submitted":"08/28/2010 09:13 UTC","Disposition":"Unknown","Case Number":"25221","Sighting Duration":"Undisclosed","Log Number":"US-08282010-0014","Date of the Event":"06/30/2005 12:00 UTC","divs":["Sighting DetailsMy brother, mother and I were swimming in June or July 2005 and it was mid afternoon. I am always looking up to see airplanes and i saw a black triangle that was flying backwards and it was silent and yelled over to my mom who then looked up and saw it she did not know what it was either. There were no lights of any kind it was pure black i cant stress how dark it was. and it looked like it had a ball in the center on bottom(tried to do it on paint but i could not get it to look right). We watched it for 5-10 minutes before it went behind the hill. it was not very high in the sky but higher than normal airplanes. We live in an area that has (i would call)moderate amount of air traffic 5-10 low airplanes daily, but this was flying way off the normal path, normal being Northeast(to airport) and Southwest (from airport) and this was going north west over the lake and nothing ever goes that way. i have not seen it sense or anything close to it. i included a pic of the path. i would have drawn it but i have no scanner so i used paint do sorry about the quality."],"Object Flight Path":"Straight-line path,Path then hovering","Object Shape":"Triangle","trends":["There have been 3 other sightings in Belfast","There were no other sightings in Belfast on or around June 30th 2005","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile"}