{"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.647002,+-83.286447(25224)&iwloc=A&hl=en\"> mufon case (25224) map </A>","City":"Pontiac","Sighting Duration":"01:13:00","Object Features":"Unknown","Longitude":"-83.286447","Disposition":"Unknown","Date Submitted":"08/28/2010 11:35 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","Tags":"City","Object Shape":"Oval, Star-like","Weather Factors":"None","trends":["There have been 16 other sightings in Pontiac","There were no other sightings in Pontiac on or around August 28th 2010"],"Region":"Michigan","Latitude":"42.647002","divs":["Sighting DetailsI looked onto the skies South Southwest and saw a light hanging in the sky. Their was no noise and object seemed to be floating then shot upwardon a curve real fast and stopped. It then started to very slow fall like a leaf or balloon going back and forth. Then it stayed still in the same spot for about 3-5 minutes before it slowly glided left and then right with an gliding movement. This went on for about an hour before another dim light joined it from the South and they seemed to be chasing each other. Then they would shoot up in a curve in the sky and drop fast and stop. They suddenly disappeared in Southern sky and a dark colored helicopter with blinking white light traveled from east to West. i could hear the helicopter blades in the sky. It continued on its track heading West and then disappeared from my view. Object appeared again at 11:24pm in the Southern sky gliding left to right then hovering while no difference in the dimness of object. The moon and one star in the East are very bright tonight. There is no noise from the object floating or gliding through sky. Lost sight of object at 11:30 pm in Southern sky behind trees and horizon. Didnt have camera to take photos of object and thought object was just a star when first sighted. It never changed color or brightness from dim white the whole time I spotted it. I caught it out the corner of my eye when I first saw it because of its erratic movements in sky."],"Summary":"Dull white light dimmer than stars in sky.","Date of the Event":"08/28/2010 10:45 UTC","files":["/var/www/straped/mufon/html2text/25224.html.txt","/var/www/straped/mufon/org/25224.html"],"Log Number":"US-08282010-0017","Case Number":"25224"}