{"Date of the Event":"08/27/2010 10:47 UTC","Viewing Distance":"Unknown","City":"Eaton Rapids","Country":"United States","Case Number":"25226","files":["/var/www/straped/mufon/html2text/25226.html.txt","/var/www/straped/mufon/org/25226.html"],"Sighting Duration":"00:15:59","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.509204,+-84.655814(25226)&iwloc=A&hl=en\"> mufon case (25226) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Region":"Michigan","Weather Factors":"Unknown","Date Submitted":"08/29/2010 01:32 UTC","Object Shape":"Fireball","Longitude":"-84.655814","Tags":"City","Source":"MUFON","trends":["There have been 2 other sightings in Eaton Rapids","There were no other sightings in Eaton Rapids on or around August 27th 2010"],"divs":["Sighting DetailsSo when I had to get my things for a night at a friends house I did what I normaly do. I looked around at the stars and tryed to find shooting stars. So I look and I look and I see a fireball shaped thing in the sky. I stopped and looked but then a car came by and I let it past. When I looked back at it it was replaced by at least ten more of the same thing. I got scared so I knowced on the door of the nearest house and an old man came out. I asked him what was in the sky and he didnt know what it was either. We looked at it and then they all just disappered from no where and that was that. I thought maybe it was some one sending out good wishes for the dead but then I see two humvees drive by me and a helichopper fly over in the direction of where the fireball things in the sky dissapered. I almost got hit so trust me when I said that there was no way I wouldnt have seen the design. Well once I hit the town i live in i asked if anyone else saw them and they said nothing. I even asked about the military veichles and they just looked at me odd like i was crazy. So I got my belonggings for the night at my friends and when I got half way there i heard sounds. It was from a fenced off power station that has been abbandoded for a long while. There are lights and strange static sounds and when I was about to go look to see what it was i heard something in the buches and I just booked it. So thats about it."],"Log Number":"US-08292010-0002","Latitude":"42.509204","Summary":"It came from no where and left just as fast. I saw some sort of army personnel following it.","Disposition":"Hoax"}