{"Viewing Distance":"Unknown","Object Shape":"Flash, Saturn-like, Star-like, Other","files":["/var/www/straped/mufon/html2text/25237.html.txt","/var/www/straped/mufon/org/25237.html"],"Disposition":"Unknown","Object Features":"Dome","Date Submitted":"08/30/2010 05:46 UTC","Log Number":"US-08302010-0003","Region":"Michigan","Case Number":"25237","City":"Clare","divs":["Sighting DetailsMy 6 year old daughter woke up at approx 3am, saying there were aliens out side, I sorta brushed her off, but had her describe them, thinking they were just stars or something. She said they were in the field next to us. I just told her it was fine, and go back to bed, and that I would check it out. (what every dad has to do right). So after a bit I went out side to check it out. I didn't really see anything other than Jupiter brighter than I'd ever seen before. But that was on the other side of the house, she couldn't have seen that. The only thing interesting was what I thought was Mars, about the right size flashing red. I went back inside. She was standing in the living room waiting for me. \"Daddy the aliens still out there\" I asked while I was out there. She said Yes. Now I knew for sure she had to just be seeing things. I had her draw me a picture. she drew the dome first, I thought she was going to draw a cigar type but then but a disk on the bottom. I've never heard of anything like that, maybe you have. I drew another and asked if that was it. The pic is not scanned or I would send it now. this happened less that 2 hours ago. Again I had her go back to bed, and told her it was fine and it would be ok. about 4:00am I checked on her, she was still awake. I had her point to where she saw this. She did and said there still out there. Now I'm getting freaked. What the heck is she seeing? I had her get up and told her were going outside. She didn't seem to want to, the whole time she was acting scared, which is very unlike her. As soon as we got out, she yelled there right there, all over the place, I'm like what are you seeing. \"they are small now, by the stars.\" I said you are just seeing stars. She said, no these ones are moving all over. I thought satellites. Then she pointed out what I thought was mars. \"See it flashing and it's moving. I had moved quite a bit in the half hour or so sense I had been out there. I had moved from one side of the tree to the other in a half hour? I had the moon and Jupiter as reference, they hadn't moved that much. And it was flashing, not like a plane or like a twinkle. The white always on behind the red flash. this all was to the east. I had asked her, she said that it had been close to the house and was much larger. and didn't know if what we were seeing was the one she saw close. about there being lost of them, I am understanding she thinks that all the other ones were above and could all have been on a bigger vessel, all she said about them was that they flashed. the lights on the smaller craft she said were almost of every color. red green yellow etc. and something about green and yellow at the same time. and said the dome was a yellowish green. I put her back to bed and googled this site. It's 5:20am and I'm going for another look. Then I'll report. 5:27 and I'm already back and I'm spooked. I went out, was looking around and noticed the moon and Jupiter had moved. and as I looked at Jupiter I noticed there was 2 of them. I thought where did that star come from? I didn't see it earlier. It was just as bright, and if you have seen Jupiter like this you know what I meen, you notice it. Now 2 of them? just as I thought that. The one that was not Jupiter began moving to the south and in about 10 seconds was gone. From the time I noticed it until the time it began to move was between 5 and ten seconds. Like it moved because I noticed it. this was bright white, almost a twin in every way to Jupiter. You know that feeling, like your being watched? That's how I feel right now. I'm still curious but nervous at the same time. That's how my daughter felt. If I had a sixth sense I'd say these things are up to no good, it's just my feeling. For perspective I'm a Christian and don't drink. I believe that this is possible. 1. because I've seen a metallic orb during the day before, and know for a fact what I saw and I've never seen humans create anything close to that. It was literally a ball of liquid mercury stationary in the sky for more than 15 min. i think that was 1998. Anyway If anything else happens, I'll write it down and get back with you, feel free to email me."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Latitude":"43.82204","Weather Factors":"Unknown","Summary":"Tall dome on top of disk, with flashing lights.","Tags":"City","Date of the Event":"08/30/2010 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.82204,+-84.762028(25237)&iwloc=A&hl=en\"> mufon case (25237) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-84.762028","trends":["There has been one other sighting in Clare","There were no other sightings in Clare on or around August 30th 2010"],"Country":"United States"}