{"Date of the Event":"08/26/2010 10:00 UTC","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"25233","Date Submitted":"08/29/2010 10:19 UTC","Log Number":"US-08292010-0009","Country":"United States","Object Flight Path":"Undisclosed","Disposition":"IFO","Weather Factors":"Unknown","Region":"Michigan","divs":["Sighting DetailsDriving north on Colwood Rd. (also known as Bay Port Rd.) in Huron county, near Bach, Michigan. Time was just before 10:00pm when I noticed first light straight ahead on my direction. The light appeared fairly bright, definitely noticeable, and of a white color, and was just west of the road. It was there for a moment and was gone. It was just below the window seal of the front window, and was not at eye level or at the horizon. My guess would be ~20 degrees off the horizon. First thought was it was a small plane, i.e. Cessna, making a night landing, and what I saw was the lights as the plane turned about. Shortly later I saw the same type of light just east of the road, and its behavior was the same. Shortly after this, I saw a series of 4-5 lights appear, starting just east of the road, and appearing in series westward. These were also fairly bright and of a white color. They were visible for a moment, and not long enough it see any motion to determine if they were falling, drifting, etc.. The series if 4-5 lights appeared 3 times, each time they appear to start closer to the road, and the 3rd ended just over or just west of the road. While driving, during the 2nd series, I believed two of the lights appear to come close to each other, but my vision was obscured by the trees in the area. It was during the 3rd series that I decided to pull to the side of the road to better observe, and attempt to hear any aircraft. I heard no aircraft while the window was down. I had previously turned my phone off as my reception was having problems, and turned it on in hopes of getting either images or movies of the event, but it never appeared again. The entire event may have been a few minutes. The time when I was observing the series of lights and decided to pull to the side was 10:00pm. I recall seeing the Big Dipper in the sky, just west of the road. All the lights had appeared pretty much appeared due north. It is possible that the event was a military training exercise, Selfridge ANG Base is less then 80 miles away, and I did observe military jets further north the next day in the afternoon. This was near Caseville, Michigan and would be 15 miles north of where I saw the lights. However I never seen flares on and off as quick as these. The lights were visible for a moment or two, but were not visible for any significant length of time, and did not appear to fade out, but simply disappeared."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.683073,+-83.355789(25233)&iwloc=A&hl=en\"> mufon case (25233) map </A>","Source":"MUFON","trends":["There have been no other sightings in Bach","This sighting has never been favorited."],"Latitude":"43.683073","City":"Bach","Summary":"Several bright lights, appearing in series and disappearing in series.","Object Shape":"Flash, Star-like, Other","files":["/var/www/straped/mufon/html2text/25233.html.txt","/var/www/straped/mufon/org/25233.html"],"Longitude":"-83.355789","Viewing Distance":"Unknown"}