{"Source":"MUFON","Case Number":"25231","trends":["There have been no other sightings in Acme","This sighting has never been favorited."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-08292010-0007","Latitude":"44.779158","Longitude":"-85.458186","Summary":"Saw flashing object approx 15 degrees above hoizon.","Tags":"City","Object Features":"Undisclosed","Date of the Event":"08/28/2010 11:18 UTC","divs":["Sighting DetailsMy wife,myself and two friends had just finished playing a couple of hands of cards when we all decided that we have had enough fun for the day. The two ladies went to the deck of the cottage where we were stayng to smoke a cigratte. After a few minutes on the deck my wife called to me and wanted me to observe something unusual in the low sky. She pointed it out to me and said \"Look at this thing it has strange colors\". She pointed it out to me and the first thing that was obvious to me was that it was emmiting more than one color. My friends had binoculars so it was the first thing I tried to get to. Once I focused on the object it appeared to me to be a pulsating object with the colors of red, white and green continuously at a rate of about 2-3 tenths of a second. When the light was white it looked to be triangular in shape. When they brought out their telescope to see if we could aquire a better visual description of the object it took a few moments to capture the object in the lense. My first look at it appeared to be the same as the binoculars had rendered. We continued to watch the object for an addition 15 miutes. Movement was minimal. Maybe 30 degrees west to east, with continual lights flashing. Total length of observation was approx 45 minutes. We were at the south end of Elk Lake. We then retired for the evening."],"Date Submitted":"08/29/2010 08:43 UTC","Region":"Michigan","Country":"United States","City":"Acme","Object Flight Path":"Undisclosed","Disposition":"Unknown","Sighting Duration":"00:40:00","files":["/var/www/straped/mufon/html2text/25231.html.txt","/var/www/straped/mufon/org/25231.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.779158,+-85.458186(25231)&iwloc=A&hl=en\"> mufon case (25231) map </A>","Object Shape":"Triangle"}