{"Date of the Event":"08/11/2010 09:00 UTC","divs":["Sighting DetailsA few weeks ago my mother and brother were heading over to a friend of the family's house when they noticed these three really bright lights hovering really low by the tree line. Upon the time of getting to a clearing the object came across an open field. My mother said that she pulled the car over so that my brother can get a picture with the camera. As my brother went to go take the photograph, the Object in the sky disappeared. Seconds later after the object vanished, two fighter jets flew over head as either being in pursuit or escorting the object. Since about April of this year, I myself have noticed stranger objects in the night time sky. I noticed on three separate occasions of seeing a solid glowing white to blue color object in the sky moving like a plane but moving away from my line of vision. Being a lover of Astronomy, I know what planes, satellites and meteors look like in the night sky. When a plane is coming toward your line of vision you see a solid white light until it gets closer you can start seeing the red and blue flashing lights. When the planes move away, you then just see the blinking red and blue lights until it fades off in the distance. The objects I have seen kept a bright solid glow to them even after moving away from my line of vision. There were no blinking red or blue lights, just a solid whitish blue object moving ever so quietly. I know it was not a meteor or satellite or a government issue weather balloon. I have been keeping an eye on the skies at night and hope that I can capture these objects in a photo or on a camera soon. I will keep you posted. Also, if whoever contacts me through this site, please give me an update if there are any sightings in my area so that I can help look into it. Thanks"],"trends":["There have been 9 other sightings in Franklin","There were no other sightings in Franklin on or around August 11th 2010"],"Log Number":"US-08302010-0001","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.624671,+-75.066621(25235)&iwloc=A&hl=en\"> mufon case (25235) map </A>","Case Number":"25235","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Summary":"Numerous sightings since April of 2010 with one happening two weeks ago.","Latitude":"39.624671","Object Features":"Unknown","Region":"New Jersey","Longitude":"-75.066621","Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"08/30/2010 12:21 UTC","City":"Franklin","files":["/var/www/straped/mufon/html2text/25235.html.txt","/var/www/straped/mufon/org/25235.html"],"Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Disc, Triangle, Other"}