{"Disposition":"IFO","Latitude":"33.604979","Viewing Distance":"Unknown","divs":["Sighting Details\"What I see looks almost like a Frisbee,\" she said. \"You see a several lights going around, and they're all symmetrical and lit up, and it just looks like an object in the sky.\" \"B-P\" is hesitant to call the string of lights in the sky UFOs, although she can't identify the flying objects. \"We've seen falling stars, all kinds of stuff out there because you're away form the city,\" she said. \"Anytime there's a meteor shower or anything, you can see it a lot better, but I've never seen anything like that.\" \"B-P\" said the pictures were taken by a single motion-activated game camera. The equipment wasn't moved, and it doesn't have a flash. Instead, it uses infrared. She said she has ruled out light posts or cell phone towers because the area is pretty empty. \"There's nothing back there but trees and sky,\" she said. \"There's no hills, no buildings, nothing back there. It's all flat.\" Timestamps on several pictures also show that the object hovered in the air for almost two hours. Whatever it is, she is now a little hesitant to go out to her deer blind alone. \"It's creepy,\" \"B-P\" said. \"I don't know if I want to be sitting out in my deer stand by my self anymore, hunting.\" Archer City, which is just south of Wichita Falls, is also close to Sheppard Air Force Base. The installation did not immediately return requests asking if it had planes up the night the pictures were taken."],"Longitude":"-98.624413","Tags":"City","Case Number":"25230","Source":"MUFON","Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=33.604979,+-98.624413(25230)&iwloc=A&hl=en\"> mufon case (25230) map </A>","Summary":"Disc shape object.","Sighting Duration":"Undisclosed","Country":"United States","City":"Archer City","trends":["There have been 2 other sightings in Archer City","There were no other sightings in Archer City on or around August 6th 2010","This sighting has never been favorited.",""],"Object Features":"Unknown","Date Submitted":"08/29/2010 04:16 UTC","Log Number":"US-08292010-0006","files":["/var/www/straped/mufon/html2text/25230.html.txt","/var/www/straped/mufon/more/25230_submitter_file1__MDGC0051.JPG","/var/www/straped/mufon/more/25230_submitter_file2__MDGC0052.JPG","/var/www/straped/mufon/more/25230_submitter_file3__MDGC0053.JPG","/var/www/straped/mufon/org/25230.html"],"Date of the Event":"08/06/2010 12:00 UTC","Weather Factors":"None","Region":"Texas","Object Flight Path":"Stationary"}