{"map":"<A HREF = \"http://maps.google.com/maps?q=40.805056,+-81.935143(25240)&iwloc=A&hl=en\"> mufon case (25240) map </A>","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"40.805056","Source":"MUFON","trends":["There has been one other sighting in Wooster","There were no other sightings in Wooster on or around October 19th 1973","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Date Submitted":"08/30/2010 12:49 UTC","Country":"United States","Log Number":"US-08302010-0006","Sighting Duration":"00:45:00","Tags":"City","Case Number":"25240","divs":["Sighting DetailsThe year was 1973,my friend and I had decided to go to the Skyline Drivein Theater near Wooster Ohio to see a couple of movies. It was mid October and the skys were clear cool and stary. I can say that I can't remember the movies that were shown,but I do remember the event of the evening. As we sat in the car I had noticed a bright dot about the size of a pencil eraser at about ten feet distance. The dot hung above the skyline of the city of Wooster. The dot tumbled top to bottom as if it were a ball rolling on the ground, as it rolled it changed colors of red,yellow,orange and a whitish blue.The color flashes reminds me of the crystals you see hanging on a automobiles rearview mirror that you see now. I would say that the dot looked to be approximately 1500 feet in the air. From my vantage point it was to the right of the screen as the screen faced the west south west. I continued to watch the movie,then I saw a flash in the sky which drew my attention,it was the ufo,and it was moving in a southward direction. I trained my eyes and watched it move across the sky and knew that it would soon be out of my sight line as the movie screen would block my view of it. I continued to look at the top and left of the screen to see if it would show up,and after a few minutes it did. The ufo stopped to the left of the movie screen at about the same distance and height as my first sighting,and it continued to do it's colorful tumbling motion. I never spoke to my friend of all this as they weren't a believer in such things and I always had a open mind. I was able to see the movie and the ufo as they both were in the same field of view. Then the ufo flashed in the sky and it again started to move toward the east doing it's colorful tumbling during it's travel.I fixed my eyes on it and decided to focus only on it. I rolled the driverside window down to see if I could hear if it made any sound. All I could hear was the speakers of the theater in the drivein. I thought now I know an airplane can not make these actions and it would be pretty late for helicopter traffic, not to mention the colorful tumbleing light it had.I eventually had to pivot my body to the left to see the ufo as it had traveled farther than my head could turn. My friend said what in the $&## are you looking at? I said this light in the sky,and my friend said WHATEVER!! I rolled up the window and thought to watch the movie to keep the peace.so I turned around to face the screen and started to watch the movie again. I turned my body around for a moment to see if the ufo was still there and the it was gone,only the stars remained."],"City":"Wooster","Summary":"Saw a star like dot that tumbled and changed colors continuously when stationary and while traveling.","Weather Factors":"None","Longitude":"-81.935143","Date of the Event":"10/19/1973 09:30 UTC","Region":"Ohio","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/25240.html.txt","/var/www/straped/mufon/org/25240.html"],"Disposition":"IFO","Object Shape":"Flash, Star-like"}