{"divs":["Sighting DetailsI was at Fords Ball Park in Hamilton, Oh. attending a softball game in which two co-workers and friend were playing. I left before the game ended and was walking up an incline toward the gravel lot where I was parked,when out of the corner of my eye to the left (west) I noticed a grayish blue object descending slowly and silently less than 100 yards from me. Iimmediately stopped near the top of the hill and blinked once in amazement at what I was seeing. This object was a solid disc shaped blueish, grayish color. I would estimate at arms lenghth the object was about the size of my hand. As it descended it wnet behind a row of trees on the south bank of the old Erie Canal. As it descended behind the trees it \"lit up\" white like a search light. At this time I could hear what sounded like the leaves and branches of the trees \"crackling\" as if they were being sered.By now the hair was standing on the back of my neck.The object continued to descend and the only place it could have gone was under the water in the canal. I thought \"What the hell did I just see\"! There were a few people in the lot but had there backs to the object. I didn't say anything, just got in my car and went home. The next day at work one of my friends that I went to watch play ball the night before approached me with a strange look on his face. I said , \"You saw it too, didn't you.\"! He said ,\"What the heck was that?\" I said,\" I don't know\". We never talked about it again."],"Disposition":"Insufficient Data","Region":"Ohio","trends":["There have been 5 other sightings in Hamilton","There were no other sightings in Hamilton on or around July 31st 1986"],"Object Shape":"Disc","Object Flight Path":"Straight-line path","Longitude":"-84.553596","City":"Hamilton","Tags":"City","Latitude":"39.407801","Case Number":"25243","Weather Factors":"None","Viewing Distance":"101-500 Feet","Log Number":"US-08302010-0009","Summary":"Silent metalic disc shape descended from west and disappeared in old Erie Canal.","map":"<A HREF = \"http://maps.google.com/maps?q=39.407801,+-84.553596(25243)&iwloc=A&hl=en\"> mufon case (25243) map </A>","Date Submitted":"08/30/2010 03:54 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25243.html.txt","/var/www/straped/mufon/org/25243.html"],"Object Features":"None","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"07/31/1986 10:15 UTC"}