{"Summary":"3 white spheres very high up being circled by a smaller 4th red sphere.","divs":["Sighting DetailsWhile performing maintenance on my vehicle in my driveway just before one o'clock in the afternoon, I raised my head to clean my sunglasses (hot day)and noticed three perfect white spheres high to the Northwest of my yard ,I would describe as possibly floating? Within moments my father came by and he also saw the spheres, by this time (about 5 min. had gone by) a perfect red sphere arrived and started circling the first much larger white sphere. It seemed to disappear and re-appear with rapid motion inside the first white sphere!? The whole encounter lasted about twenty minutes and gave me the time to run in and retrieve my 10X50 Tasco binoculars and observe them holding the binocs against the door of my truck to keep them steady.Not long after I lost all four in the treeline. The sky was almost cloudless, with the sun to my back We both feel very lucky to have seen these perfect objects and only noticed afterwards how many people I left frantic messages from my cell phone to run outside and look up to the northwest sky.."],"Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25246.html.txt","/var/www/straped/mufon/org/25246.html"],"Case Number":"25246","Disposition":"Unresolved","Region":"Massachusetts","trends":["There have been 9 other sightings in Northampton","There were no other sightings in Northampton on or around August 28th 2010"],"Log Number":"US-08302010-0012","Latitude":"42.3305","Date of the Event":"08/28/2010 12:45 UTC","Country":"United States","Object Flight Path":"Stationary,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=42.3305,+-72.632201(25246)&iwloc=A&hl=en\"> mufon case (25246) map </A>","Object Features":"None","City":"Northampton","Longitude":"-72.632201","Viewing Distance":"Over One Mile","Date Submitted":"08/30/2010 09:49 UTC","Tags":"City","Weather Factors":"Unknown","Object Shape":"Sphere"}