{"Sighting Duration":"Undisclosed","Region":"Oregon","Tags":"City","Object Shape":"Disc, Oval","trends":["There have been no other sightings in Depot Bay","This sighting has never been favorited."],"Weather Factors":"Unknown","Summary":"The object was not seen through camera lens when picture taken.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.808024,+-124.067355(25242)&iwloc=A&hl=en\"> mufon case (25242) map </A>","Date of the Event":"06/14/2010 08:38 UTC","Log Number":"US-08302010-0008","Disposition":"Unknown","City":"Depot Bay","Object Flight Path":"Unknown","divs":["Sighting DetailsI was standing on the second level deck of a time share condo at Westmark in North Depot Bay. We were right on the Pacific Ocean and I was taking a great many pictures of the ocean, birds, sea lions, and the sky over the three day stay. The object was not noticable when the picture was taken. In similiar photos where birds were in flight, they could be seen through the camera lens. The picture in question was looking southwest at the time. When I finished taking pictures that morning, I checked the pictures taken on the cameras viewing play back position. The object appeared in the upper left corner of the shot. I encreased the size of the photo and what appeared was not a bird or a plane. When I returned home to Junction City, Oregon the photos were down loaded to my desk top pc. Nothing has been done to the picture. It appears to me to be an oval disk of some sore being thicker in the center. No clouds were near it and the only sound we heard was the ocean. Small planes and helicopters were easy to identify. The used is an hp photosmard R847 8.0 mega pixels. Nothing like this object was seen in any of the other pictures taken of the sky on those three days. 194 total. I have printed the photo but I am having trouble attaching it to this message. Any suggestions?"],"files":["/var/www/straped/mufon/html2text/25242.html.txt","/var/www/straped/mufon/org/25242.html"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-124.067355","Latitude":"44.808024","Case Number":"25242","Date Submitted":"08/30/2010 03:43 UTC","Object Features":"Dome","Source":"MUFON"}