{"Weather Factors":"None","Date of the Event":"08/30/2010 08:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.964686,+-82.993054(25247)&iwloc=A&hl=en\"> mufon case (25247) map </A>","Longitude":"-82.993054","Disposition":"IFO","Region":"Ohio","Log Number":"US-08302010-0013","Sighting Duration":"Undisclosed","Summary":"Looking for the space station.","Tags":"City","City":"Columbus","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around August 30th 2010"],"Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsMy family and I were standing outside of my house at around 8:30 looking for the space station that was supposed to be visible tonight. We couldn't see anything so everyone went inside after a little while except for me. All of a sudden I saw this star-like light in the sky shooting up from the horizon and went to grab everyone because I thought it was the space station. The light is flickering in a reddish-orange color, and every now and then there will be tiny white flashes of light that appear around it and then vanish. My dad came out and we stood there watching it move up higher into the sky, when we realized it was moving in a really odd pattern, and thinking it may not actually be the space station. The only way I can describe it is the way a fly moves when its buzzing around, going back and forth and all around. After watching it move like this for a good 15 minutes, we concluded that it couldn't be the space station since it was only supposed to be visible for 3-4 minutes. It kept moving until it was straight up in the middle of the sky, and then it just stopped. My dad went back inside and I stayed outside watching it, and it would move back and forth every now and then, but for the most part it stays in the same area. I grabbed one of my friends to get another witness to make sure it wasn't just my eyes playing tricks on me, and he was able to see it moving as well, confirming the same times and directions it was moving as I was seeing it. I came inside to write this and to charge my camera to try and capture a video of it. When I went back outside, it had moved a little to the north, but it's still in the same general area. For it to move that quickly when we first spotted it in a matter of seconds, only for it to remain in the same area for almost 2 hours now tells me that it's not a star or any known aircraft. I wasn't able to get a video of it since it is too high up in the sky, but hopefully others have witnessed the same thing as I have."],"Object Shape":"Flash, Star-like","files":["/var/www/straped/mufon/html2text/25247.html.txt","/var/www/straped/mufon/org/25247.html"],"Case Number":"25247","Source":"MUFON","Date Submitted":"08/30/2010 10:08 UTC","Latitude":"39.964686","Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"Unknown"}