{"Object Shape":"Cigar, Square, Rectagular","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"08/30/2010 01:45 UTC","divs":["sighting detailswe were on our second night in halifax nova scotia, sitting on our condo balcony in lower water street, looking south at the sky between the buildings. we thought perhaps we were seeing some kind of fireworks or light display, when we saw the blue-green glowing light in the sky, but then noticed it did not move. then it pulsed slightly and seemed to drip down upon itself almost like a lava lamp, and then broke into three even sections before our eyes. it stayed in the exact same spot, however, and came back together several times, continuing to glow with an odd greenish blue light for ten full minutes. at the end of the event, it formed a ball of bluish green colored light and bounced up and down and all around very irratically. eventually, it grew smaller in size and dimmer in appearance until it was gone altogether. my husband and i are sceptical and would like to know what it was that we saw, if there is in fact an earlthy explanation. we did not feel scared but felt amazed and awed by the object. it was also very beautiful because its light was glowing and looked very unearthly. we knew it was not a plane or helicopter and since it seemed not to be affected by the intermittent clouds (or lack there of) it was hard to imagine it was any kind of projection from below -- like a prank. to project something, one needs a screen of clouds or another surface to use and there was no consistent cloud cover that night. we could easily see stars around the object but it was too elongated \\ bar shaped to be any kind of planet or star. since it was not moving and only seemed to pulsate and divide, it is hard to imagine it was any kind of human made craft."],"Object Features":"Unknown","Latitude":"44.652681","Summary":"Blue green laser-like, vertical cigar shaped stationary object in sky.","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Halifax","Date of the Event":"08/18/2010 09:30 UTC","Longitude":"-63.573532","Case Number":"25241","trends":["There have been 22 other sightings in Halifax","There were no other sightings in Halifax on or around August 18th 2010","This sighting has never been favorited.",""],"Region":"Nova Scotia","Source":"MUFON","Object Flight Path":"Stationary","Weather Factors":"Unknown","Country":"Canada","files":["/var/www/straped/mufon/html2text/25241.html.txt","/var/www/straped/mufon/more/25241_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/25241.html"],"Log Number":"CA-08302010-0007","map":"<A HREF = \"http://maps.google.com/maps?q=44.652681,+-63.573532(25241)&iwloc=A&hl=en\"> mufon case (25241) map </A>"}