{"map":"<A HREF = \"http://maps.google.com/maps?q=38.837372,+-104.811453(25253)&iwloc=A&hl=en\"> mufon case (25253) map </A>","Country":"United States","Summary":"Bright UFO emerging from the mountains in a lazy \"S\" shape trajectory over the city of Colorado Springs.","Longitude":"-104.811453","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around July 12th 2010"],"Sighting Duration":"Undisclosed","Object Features":"None","Object Shape":"Saturn-like, Star-like","Case Number":"25253","Weather Factors":"None","Latitude":"38.837372","divs":["Sighting DetailsI was sitting on my front porch at approximately ten PM when I noticed a bright star-like object approaching from the SW banking to its left to take a due north trajectory over the west side of the city. moving at approximately the same velocity as a private airplane it remained in my line of sight for at least 30 seconds. the further north it flew the more it began banking to its right arcing until it assumed a due south flight where it flew almost directly over head. during its northerly flight it disappeared for approximately 10 seconds then reappeared as brightly as it did when I first observed it. This took place as it flew over the vicinity of the United States Air Force academy. as it flew south overhead it made no sound, did not have navigation lights and it had the appearance of the flashing of an arc welder that is to say that it varied in intensity at times brighter than any other celestial body including Jupiter. within 10 seconds of flying overhead, its brightness intensified for a few seconds then abruptly and completely disappeared.From what I have seen previously in the skies over Colorado Springs the object certainly was identical to previous objects that I have seen overhead. this is how I recognizes the object to be another UFO. this is the third time I have witnessed this type of sighting with this type of object but it left me with a sense of awe as much as the first time I saw one. one last note... the city has five major military installations in and around it including NORAD in Cheyenne Mountain... this object emerged from the mountains in the vicinity just north of the NORAD installation."],"Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/25253.html.txt","/var/www/straped/mufon/org/25253.html"],"Object Flight Path":"Path with directional change","Log Number":"US-08312010-0004","Tags":"City","Date Submitted":"08/31/2010 10:20 UTC","Source":"MUFON","Disposition":"Unknown","City":"Colorado Springs","Date of the Event":"07/12/2010 10:00 UTC"}