{"Source":"MUFON","Object Features":"Unknown","Summary":"Bright star-like object seen executing high speed maneuvers in the skies over Columbia County, NY.","Date Submitted":"08/31/2010 01:58 UTC","files":["/var/www/straped/mufon/html2text/25252.html.txt","/var/www/straped/mufon/org/25252.html"],"Object Shape":"Star-like","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around August 28th 2010"],"City":"Albany","Weather Factors":"None","divs":["Sighting DetailsWe live on the east side of a lake in northern Columbia County in New York State. From where we are located, we have an unobstructed view of the western sky. On the night of Saturday August 28, 2010, the skies were clear with temps in the low 70's. At about 9:25 that evening, I went outside to get something out of my truck. We had been cooking and canning vegetables from our garden all day, and the house was quite warm inside. Noticing how pleasantly cool it was outside, I asked my girlfriend if she might like to come outside for a while to cool off. As we stood down by the water, chatting and looking at the house lights from across the lake, something caught my eye in the west northwestern night sky. At an elevation of about fifty degrees, a bright white star-like object had suddenly appeared, seemingly out of nowhere. Had this object been stationary, and not as bright, I might have mistaken it for just a large star. But it was not stationary. It was moving in a northerly direction at what appeared to be a very high rate of speed. After about three or four seconds from the time it first appeared, it executed a very tight, almost flat, 180 degree turn to the south, and after proceeding in this new direction for another three or four seconds, it just as suddenly seemed to \"turn off\" again, just like someone turning off a light switch, and became invisible to our eyes once more in the night sky. Please understand that when I used the word \"turn\", I am not speaking of any kind of a turn in the conventional way. This object, whatever it was, had managed to accomplish a complete and opposite change of direction in less than a second. It's speed remained constant throughout the entire manuver, and it's motion can only be described as \"fluid\". As we stood there in silence for perhaps fifteen seconds or so, trying to comprehend what this actually was that we had just witnessed, another bright white \"star\" \"turned on\" in the west southwestern sky. I took this to be the same object that we had seen before, as the size and light intensity were the same, as was it's elevation above the horizon. This time however, the same manuver that we had just witnessed was being repeated in reverse, with the object making another of those \"impossible\" 180 degree turns, and heading back to the north again before \"turning off\" once more. We stood there for several more minutes watching the sky, but it did not reappear again."],"Tags":"City","Date of the Event":"08/28/2010 09:30 UTC","Region":"New York","Country":"United States","Case Number":"25252","map":"<A HREF = \"http://maps.google.com/maps?q=42.655509,+-73.754702(25252)&iwloc=A&hl=en\"> mufon case (25252) map </A>","Longitude":"-73.754702","Object Flight Path":"Path with directional change","Sighting Duration":"00:00:30","Log Number":"US-08312010-0003","Viewing Distance":"Unknown","Latitude":"42.655509","Disposition":"Unresolved"}