{"Tags":"City","Weather Factors":"Unknown","City":"Los Angeles","map":"<A HREF = \"http://maps.google.com/maps?q=34.052234,+-118.239695(25251)&iwloc=A&hl=en\"> mufon case (25251) map </A>","Source":"MUFON","Longitude":"-118.239695","Log Number":"US-08312010-0002","Date Submitted":"08/31/2010 02:39 UTC","Object Shape":"Disc","Object Flight Path":"Undisclosed","Latitude":"34.052234","Region":"California","Object Features":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around August 18th 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was driving north on the 110 Fwy when I noticed a huge circular disc-shaped cloud very low over downtown LA. The strange thing was, there was not a single other cloud in the sky...typical alien mistake if you ask me, they are as imperfect as us with just fancier aircraft... Anyway, I have read several articles and seen photos of other cloud cloaked UFO's, Hence, I knew what I was looking at immediately when I saw it. Although I was driving, I reached into the back seat, grabbed my digital camera and snapped these pictures through the front window of my jeep. I took 4 pics, but these 3 are the ones that came out in focus. Zoom in on these pics. The closer you look the more it looks like a disc! The cloud cloaked UFO did not move at all. It simply hovered in place. I drove up the highway and went on my way so it was only in my sight for a few seconds before I was past and I didn't want to turn and take more pics and risk crashing on the freeway...no \"ignorant of human civilization\" Greys are going to ruin my day. My feelings? I wasn't that surprised, it's my 5th sighting and I am used to being \"in the ant farm\" now. Just like my first sighting of a transparent cloaked triangle with cloud in it on a clear night, these aliens messed up again by disguising themselves as a cloud on a cloudless day...morons. Humans Rule The Galaxy"],"files":["/var/www/straped/mufon/html2text/25251.html.txt","/var/www/straped/mufon/more/25251_submitter_file1__P1020539.JPG","/var/www/straped/mufon/more/25251_submitter_file2__P1020538.JPG","/var/www/straped/mufon/more/25251_submitter_file3__P1020541.JPG","/var/www/straped/mufon/org/25251.html"],"Summary":"Cloud cloaked UFO hovering over Downtown LA","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"08/18/2010 12:00 UTC","Case Number":"25251","Disposition":"IFO","Viewing Distance":"Unknown"}