{"Viewing Distance":"Unknown","divs":["Sighting DetailsI was driving back home from the Naval base on 32nd street along Harbor Drive towards downtown and I noticed a very bright orange-ish orb in the western sky. At first, I thought it was one of the airplanes making a landing at the airport, but it ended up just sitting there in the same spot of the sky for the majority of the drive. It wasn't until I made it home that it began to move which was a solid 30 minutes after I first spotted it. After it began to move it immediately got dimmer as it moved faster until it disappeared altogether. I know I described it as a \"orange\" orb, but that's mostly because orange was the primary color. The center of it was predominantly orange while the outside was constantly changing colors from blue to green to red, ect. It wasn't so much individual lights around the object that I could see as much as it was more of an \"aura\" around it. It shone very intensely as if it was molten, much too bright to be a Chinese Lantern. I was not able to get any pictures as I was driving and my phone camera is pretty terrible at night. I felt the need to report it after reading multiple reports of similar objects in the area recently."],"City":"San Diego","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around August 31st 2010"],"Tags":"City","Summary":"Large bright orange orb spotted in western San Diego sky.","Disposition":"Unknown","Longitude":"-117.155715","Country":"United States","Date of the Event":"08/31/2010 10:40 UTC","Object Shape":"Fireball, Flash, Sphere, Star-like","Case Number":"25255","Date Submitted":"09/01/2010 02:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.718449,+-117.155715(25255)&iwloc=A&hl=en\"> mufon case (25255) map </A>","Object Flight Path":"Undisclosed","Region":"California","Sighting Duration":"00:40:00","Weather Factors":"Unknown","Object Features":"Undisclosed","Log Number":"US-09012010-0002","Latitude":"32.718449","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25255.html.txt","/var/www/straped/mufon/org/25255.html"]}