{"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Hoax","Case Number":"25254","Longitude":"-80.220977","Object Features":"Unknown","Region":"Florida","files":["/var/www/straped/mufon/html2text/25254.html.txt","/var/www/straped/mufon/org/25254.html"],"Log Number":"US-09012010-0001","City":"Plantation","Date Submitted":"09/01/2010 12:13 UTC","Summary":"Object appeared after a few moments of looking into the sky.","Sighting Duration":"Undisclosed","Latitude":"26.121804","trends":["There have been 6 other sightings in Plantation","There were no other sightings in Plantation on or around August 29th 2010"],"Weather Factors":"Unknown","Object Shape":"Disc","Date of the Event":"08/29/2010 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.121804,+-80.220977(25254)&iwloc=A&hl=en\"> mufon case (25254) map </A>","divs":["Sighting DetailsSo you understand better this information. I have seen numerous 'objects'. I have filed two previous reports. One of which that caused some unwanted attention. (The red object staying in my line of sight) No matter how much effort I gave to move my seat into a position out of view. Without pointing my seat in the completely opposite direction in the sky... Since seeing these objects I was first afraid but have accepted(trying to) they have been there since before I became 'aware'. I have found myself asking to see them when I have had a bad or would just like some comfort. Either way they show up. Sometimes they will come very close and stop their \"ship\", possibly receiving my feelings. (If I become afraid they will move further away). Back to what happen. I was thinking it would be peaceful to see one right now. I look up (West ward in the sky) and One appeared. It was first far away but came closer... Occasionally when I see them or more so when I am asking to observe one, the lights in my vicinity will dim momentary... I have a question.. After I made two previous reports there have been helicopters after I have any close sightings.. There are now also extremely high flying aircraft that will fly in a grid around the perimeter of my house. With only a single flashing light, which makes them difficult to notice because they are at such a high altitude. Anyway, when those planes are there I am unable to make contact with them visually. 1. Backyard. Night 2.It began moving moved closer to the ground and stopped above me ( Not directly above me). Although that occurs. 3. I knew what it was. 4. Appeared in the western sky, moved easternly and came 'close'. 5. Peaceful, but alert. 6. It acceded back into the sky and went to its previous location of where I first noticed it."],"Tags":"City"}