{"Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"09/02/2010 04:03 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","City":"Crescent Bar","Region":"Washington","Object Shape":"Star-like","Case Number":"25267","trends":["There have been no other sightings in Crescent Bar","This sighting has never been favorited."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.204576,+-119.996166(25267)&iwloc=A&hl=en\"> mufon case (25267) map </A>","Latitude":"47.204576","Sighting Duration":"Undisclosed","Longitude":"-119.996166","Country":"United States","Log Number":"US-09022010-0004","Disposition":"IFO","Summary":"I didnt go look up at the sky till the little girls started to screaming UFO!","divs":["Sighting DetailsI was at our family condo in Crescent Bar just sitting on out on our covered porch enjoying the night. I was just people watching and relaxing when the family of 20 people out on lawn chairs where watching the stars and chatting amongst themselves.I heard gasping and screaming at first I didn't go look up till the little girls started screaming UFO! I hopped up and went to the edge of our porch looked up as all of us were and a silent star like UFO floated over at maybe 1300 ft or 1500ft,it was moving at about 30 to 40miles per hour.It was silent we all would have heard if it was a plane ,military planes fly over low sometimes training during the day but it is so loud you would jump out of bed so no its not a plane! It went over the surrounding mountains so didnt see it for longer than 30 secs.We were all just standing there like amazed,I was only there for two days and I saw a UFO so must be a hot spot.I looked on the map and Crescent bar is directly north of a military base.I can't wait to go back on vacation I'm gonna bring a video camera."],"Date of the Event":"06/15/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/25267.html.txt","/var/www/straped/mufon/org/25267.html"],"Viewing Distance":"Unknown"}