{"City":"Kenai","files":["/var/www/straped/mufon/html2text/2526.html.txt","/var/www/straped/mufon/org/2526.html"],"trends":["There have been 2 other sightings in Kenai","There were no other sightings in Kenai on or around September 12th 2003"],"Summary":"Moving Stars","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Undisclosed","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=60.554444,+-151.258333(2526)&iwloc=A&hl=en\"> mufon case (2526) map </A>","Region":"Alaska","Date Submitted":"09/12/2003 04:20 UTC","Longitude":"-151.258333","Latitude":"60.554444","Date of the Event":"09/12/2003 04:20 UTC","Sighting Duration":"00:30:00","divs":["Sighting DetailsThis was the strangest act of the moving stars you see very often up here inAlaska that I have EVER seen since first observing them May of 2000. Oneconstellation in particular completely was affected in that all the stars withinchanged their position in the sky almost at the same time, as if to bemechanically inclined to do so. Within nearly twenty minutes, I had observedeasily twenty moving stars mostly to the north of my location, some of whichbrightened so much they were hard to look at for a moment.I do kick myself in the ass for ever selling my videocamera now...as that wouldhave been some incredible footage. I have watched the moving stars in Alaska foryears now, and found myself almost scared at the amount of activity I was seeingat that moment because it was almost like we were being invaded in the sky and Iwas the only one noticing.The stars would head straight in one direction before ailing another star tostart moving itself, all creating a particular clockwise motion in the sky withtheir strange rotation, as if trading places in the sky. I just stepped out asecond ago just now, and there still are one or two moving stars right at thisinstant in the sky."],"Case Number":"2526","Disposition":"IFO","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Straight-line path","Log Number":"","Country":"United States"}