{"Date Submitted":"09/02/2010 06:43 UTC","Case Number":"25266","trends":["There have been 7 other sightings in Uniontown","There were no other sightings in Uniontown on or around September 2nd 2010"],"Region":"Pennsylvania","Object Flight Path":"Stationary,Straight-line path","Date of the Event":"09/02/2010 04:33 UTC","Latitude":"39.902616","Object Features":"Unknown","Longitude":"-79.708893","files":["/var/www/straped/mufon/html2text/25266.html.txt","/var/www/straped/mufon/org/25266.html"],"Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Cigar, Cylinder","Disposition":"Insufficient Data","Log Number":"US-09022010-0003","map":"<A HREF = \"http://maps.google.com/maps?q=39.902616,+-79.708893(25266)&iwloc=A&hl=en\"> mufon case (25266) map </A>","divs":["sighting detailsi took my dog out at about 4:30 am, and saw a strange light in the sky, i thought it might just be a star, though it looked something like a cigar or cylinder shape? anyway, i was tried, so i went back to bed, just laid down, that's when i saw a flash of green light, and a voice that spoke in some strange language that i never heard before? i couldn't move, i felt my dog up against me, but she never moved or barked? i tried very hard to move my arms and feet, but it was like having sleep paralysis, but i knew i was wide awake!? i definitely felt, and caught climpses of the presence of small shadowy figures in the bedroom? i knew i was trying to push them away from my face? i didn't feel as though i was in my bedroom anymore? the next thing i knew it was 6:04 when i woke up? i knew what happened wasn't a dream, because a little over an hour and 1\\2 had passed since i saw the light in the sky, and i had just laid back down in my bed, and then it was 6:04? this is the 7th time in my life that something like this has happened to me that i know of, there may be other times that i don't remember? it felt so very real, and the strange thing was, i didn't feel afraid? i don't know what the green light said to me in the strange language, though i think now i may have heard it before, hut i wasn't afraid of it somehow? it all felt so familiar, yet i can't remember what exactly just happened to me? i feel as though i have went through this many many times before? [name removed\\cms\\tg]."],"Tags":"City","Source":"MUFON","Summary":"I was walking my dog, saw a strange light in the sky, went back inside the house, went to bed.","Country":"United States","Weather Factors":"Unknown","City":"Uniontown","Sighting Duration":"01:30:14"}