{"map":"<A HREF = \"http://maps.google.com/maps?q=31.971259,+-99.897963(25278)&iwloc=A&hl=en\"> mufon case (25278) map </A>","trends":["there have been no other sightings in everman\\s.arlington\\mansf","This sighting has never been favorited."],"Object Flight Path":"Stationary","Longitude":"-99.897963","Region":"Texas","Case Number":"25278","divs":["Sighting DetailsFriday August 27th I went to sleep earlier then usual. I woke up feeling something was close to me and when I focused on what was above me,I got scared. I saw what appeared to be the bottom of a UFO. I must have been in the middle of it because I remember seeing the outer edge of it, almost like a half circle and it had blue,red, and green lights. It was hovering over me and all I can remember is feeling scared. When I saw it, I qwikly turned and grabbed my husband and he didnt wake up. I buried my head in his back and thought to myself \"dont take me\". Next thing I know my alarm is going off so I can go to work,and the thoughts of what happened lingered. I told my husband, and he laughed at me. I told a very trusted co-worker and she suggested I report it. Since this has happened I have been scared to go to sleep, and when I do sleep, its only for a few hours and then Im awake. I had almost convinced myself that what I saw was a dream until I looked on youtube under \"UFO sightings in TX\" and the same thing I saw was actually recorded by 1 person on the same night, and there was a comment from someone else about seeing a UFO in the mansfield area. How could a UFO be seen on the same night I thought I was dreaming of one? I have been debating all day rather I should write this, but tonight is Friday, and once again Im bothered and scared to go to sleep."],"Date of the Event":"08/27/2010 11:30 UTC","Object Features":"Unknown","Summary":"I woke up and saw it.","files":["/var/www/straped/mufon/html2text/25278.html.txt","/var/www/straped/mufon/org/25278.html"],"Sighting Duration":"01:00:00","Latitude":"31.971259","Date Submitted":"09/04/2010 12:27 UTC","Weather Factors":"Unknown","Log Number":"US-09042010-0002","Source":"MUFON","Country":"United States","City":"Everman/S.Arlington/Mansf","Disposition":"Insufficient Data","Viewing Distance":"21-100 Feet","Tags":"City","Object Shape":"Circle"}