{"Viewing Distance":"Unknown","Date of the Event":"04/30/2010 12:00 UTC","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around April 30th 2010"],"City":"Dallas","Summary":"A question","Log Number":"US-09032010-0005","Latitude":"32.805105","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-96.763363","Region":"Texas","Country":"United States","divs":["Sighting DetailsI am using this form because there was no contact info that I could find. This involves an unidentifiable metal implant found in the cheek of a family member. This was found by Parkland Hospital in Dallas Texas via XRay and MRI. This thing, whatever it is, was not something that we were ever previously told about nor was it anything associated with why he was receiving care at Parkland. They noted it several times and did not make any conclusions. Parkland made no mention of this thing to us or him. I discovered the reports of the implanted object after getting his medical files from Parkland for a private physician. The reports simply state there is a \"metalic foreign body present in the right cheek\". Oddly, the VA hospital in Dallas made no note whatsoever of the object in their MRI or XRay reports, yet there are numerous reports in the Parkland files. There is no wound accompanying the metal object. Our relative cannot feel it and did not know it was there. This was discovered in May 2010 after he fell at home and the EMTs took him to Parkland where extensive testing was done and then approximately four days later he was transferred by ambulance to the VA hospital in Dallas. He is retired now and over the years I have wondered many times if the military implanted something in his body. No, he never was in battle or explosions but his job in the military was Top Secret. I do know families of military guys who have said civilian hospitals found strange metal implants in such places as the mastoid area of their loved ones. We really don't know what to think about this or the UFO issues. We just want to know what this thing is and if anyone out there has any information on these implants. At this time we have no idea if it should be included in any surgical removal plan or not. He is old and physically frail now but his mind is clear as a bell, and of course we are wondering if that thing showed up in the films years ago and nobody said anything. I'd like to pull all those records. All of the other metalic items noted on the films such as clamps and wires from heart surgery were correctly and readily identified. Not that thing in his cheek. Please contact me if you have any info. I'd appreciate it very much. Thank you."],"Weather Factors":"Unknown","Object Shape":"Other","Tags":"City","files":["/var/www/straped/mufon/html2text/25275.html.txt","/var/www/straped/mufon/org/25275.html"],"Case Number":"25275","Date Submitted":"09/03/2010 09:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.805105,+-96.763363(25275)&iwloc=A&hl=en\"> mufon case (25275) map </A>","Object Features":"Undisclosed","Disposition":"Insufficient Data"}