{"Tags":"City","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around September 11th 2003"],"Object Shape":"Cylinder","divs":["Sighting DetailsI was driving home from work southbound on Loop 12 to spur 408 out of Irving TX.THe object was directly ahead of me above the road - the bright lights and sizeof the object were impossible to miss. I slowed down tried to determine if theobject was moving, but it was hovering in one place above the road. Iconsidered calling 911, but could not take my eyes off of the aircraft. It was acylinder shaped object hovering in a vertical position and was as large orlarger than a commercial airliner. It had one large round white light at thetop and one large round red light at the bottom. The lights were so bright thatit was difficult to see any other details about the craft. It hovered over theroad and then rotated clockwise until the red light was on top. It then movedto one side of the road and hovered again rotated to a horizontal position andthen back to a vertical position. It moved again to the opposite side of theroad and what appeared to be an arm or wing came out from the side of the craft. This had a red light on the end and smaller red lights pulsating in a circularmotion around it so that now the craft looked sort of L shaped. A white beam oflight shot out of the end of the arm and I could see it moving around on theground. The craft moved always in a horizontal fashion around and the beam wasshining around on the ground.During this time, traffic was slowed to 25-30 MPH because it appeared that wewere all watching. Some vehicles pulled over and some people were getting outof their vehicles. I kept driving slowly southbound and watched the entire way. As I traveled southward, the craft moved west out over Mountainview Lake.I lost sight of the object when the road goes through a hilly area I exitedonto I-20 just East of Grand Prairie. I estimate that I watched the object foranywhere from 5-10 minutes."],"Object Flight Path":"Straight-line path","Date Submitted":"09/11/2003 02:45 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.807638,+-96.90112(2527)&iwloc=A&hl=en\"> mufon case (2527) map </A>","Sighting Duration":"00:10:00","Latitude":"32.807638","City":"Dallas","Disposition":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-96.90112","files":["/var/www/straped/mufon/html2text/2527.html.txt","/var/www/straped/mufon/org/2527.html"],"Log Number":"","Date of the Event":"09/11/2003 02:45 UTC","Summary":"Large cylindrical aircraft","Object Features":"Undisclosed","Country":"United States","Case Number":"2527"}