{"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=42.412153,+-124.413254(25270)&iwloc=A&hl=en\"> mufon case (25270) map </A>","Country":"United States","Latitude":"42.412153","Tags":"City","files":["/var/www/straped/mufon/html2text/25270.html.txt","/var/www/straped/mufon/org/25270.html"],"Region":"Oregon","City":"Gold Beach","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Shape":"Boomerang, Flash, Triangle","divs":["sighting details1. 1030pm wed nt 1030pm 9\\\\2010. location tamms rd, ophir oregon. went outside of my rv to to turn off electric generator. as i was walking towards the gen i noticed a triangular object with 3 flashing lights and 3 long white lights connecting appear to be coming west to east over the pacific ocean. it started real high up in the sky. as the object got lower and closer it appeared to lose control. it performed many sharp fast dives,rises....i have video that requires enhancing that covers about an hour time with narration. after the first nine minutes of filming this i went into my rv and got my 5mw green laser pointer. i shined the pointer towards the object for about 45 mins. gave it the morse code signals. the object appeared top respond to my laser by changing direction and coming towards my location. the object appeared to make to almost to the coast line when it suddenly turned around and headed off at a high rate of speed. i will upload multi media videos from my cellphone. my friend also observed the same manuvers as i did. this went on until approx 12:15pm. i went to sleep then.. at about 1:30am or so i was awaken by a bright brilliant light shining into my rv, the white was a color that i have never seen on this planet. looked out my rv window pulling up the shade. it looked like a bright white object was sitting in this old mill parking area. so bright. i went out dressed in my shorts and by that time then object was up in the air about 500 feet above the ground. the white light almost looked like a force filed holding the large silverly object up in the air. watched it for a bit and went inside sooon there after the bright light was gone. hope it comes back this eve got my laser ready. ready to make first contact!"],"Date Submitted":"09/02/2010 09:17 UTC","Longitude":"-124.413254","Case Number":"25270","Source":"MUFON","Log Number":"US-09022010-0007","Sighting Duration":"01:45:10","Object Flight Path":"Straight-line path,Path with directional change,Other,Unknown","trends":["There has been one other sighting in Gold Beach","There were no other sightings in Gold Beach on or around September 1st 2010"],"Object Features":"Patterned Surface, Other, Unknown","Date of the Event":"09/01/2010 10:30 UTC","Weather Factors":"Unknown","Summary":"2 people watch object over Pacifc Ocean."}