{"divs":["sighting detailsthe witness called this in to me today and wants to remain anonymous. he went to bed at 12:30 am this morning and was awakened by a bright flash in the room like a camera flash. he opened his eyes and saw a small disc-like ufo in the corner of the room with a large dome on top of it with windows all around the dome. the disk was a light grey metallic color with black around the windows, it was lighted on the inside and there were no lights on the outside, except the one the kept flashing from the front of the vehicle. the witness watched the 12\" diameter craft move about the room from corner to corner, flashing the strobe-like light (he believes it is a camera of some sort), then it hoovered over his bed. he tried to remain as still as possible while shaking his wife and getting her to wake up. she also saw the craft just as it moved into postion near the foot of their bed. he noticed a very low humming sound. it then moved slowly forward and that is when they saw the tiny beings inside the craft looking out at them - they both sat up in bed and the beings looked surprised, then the craft took off very quickly towards the closet\\chimney area and dissappeared. they could not get a good look at the beings inside the craft, but the witness claims that they had large heads for their small bodies, and they looked humanoid. all he could see was a kind of grey skin color and he thinks the eyes looked more like human eyes, not large almond shaped eyes that are like the typical greys. later, after they had fallen asleep again, the witness again woke up and saw a white-gloved hand floating approximately 10\" above his head. he only saw this for a couple of seconds, then it dissappeared. he jumped out of bed to investigate but could find nothing in the room. the couple has seen similar things in the past."],"Latitude":"39.100916","Viewing Distance":"Unknown","Region":"Missouri","Weather Factors":"None","Summary":"Small UFO in house with alien beings in windows of craft","Date Submitted":"09/03/2010 04:30 UTC","Log Number":"US-09032010-0003","City":"Independence","Longitude":"-94.410917","Object Features":"Dome, Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=39.100916,+-94.410917(25273)&iwloc=A&hl=en\"> mufon case (25273) map </A>","Tags":"City","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around September 3rd 2010"],"files":["/var/www/straped/mufon/html2text/25273.html.txt","/var/www/straped/mufon/org/25273.html"],"Case Number":"25273","Object Shape":"Disc","Source":"MUFON","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"09/03/2010 01:30 UTC","Object Flight Path":"Path with directional change"}