{"Object Features":"Unknown","Tags":"City","Weather Factors":"None","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=47.011909,+-122.904386(25271)&iwloc=A&hl=en\"> mufon case (25271) map </A>","Viewing Distance":"Unknown","Log Number":"US-09032010-0001","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/25271.html.txt","/var/www/straped/mufon/org/25271.html"],"Sighting Duration":"Undisclosed","Longitude":"-122.904386","Region":"Washington","Date of the Event":"09/02/2010 07:55 UTC","Case Number":"25271","Country":"United States","trends":["There have been 7 other sightings in Tumwater","There were no other sightings in Tumwater on or around September 2nd 2010"],"divs":["Sighting DetailsWhile lounging outside, looked up and saw large airplane flying west to east. If due north on a level plane is 9 o'clock and due south on a plane is 3 o'clock and Hades is at 6, then the airplane was flying at about 11. While observing the airplane, I noticed what seemed to be an extra part hanging off of one of the wings and wondered if the plane was coming apart. Then the piece, which was not much larger than a dot, moved so that it appeared as if it were flying between the airplane's south (near) wing and its tail. That's when I realized it was a separate, flying object. As I watched the dot seemed to vanish for a moment and then I noticed it now flying just in front of the aircraft. They both then passed over the Cleveland Avenue hill extremely close together. I checked my watch, which read 7:56 PM. It seemed way to small to be a regular aircraft. The airplane's apparent length was slightly less than the diameter of a dime held at arm's length. The object flying around it appeared smaller than any of the engines. My emotional state can perhaps be best described as a lower-case wtf? If any reports of a large plane being buzzed come in for tonight, you've got ground corroboration."],"Source":"MUFON","City":"Tumwater","Latitude":"47.011909","Summary":"Small object seen dodging airplane.","Disposition":"IFO","Date Submitted":"09/03/2010 01:01 UTC"}