{"City":"Waikoloa Village","Weather Factors":"Unknown","Log Number":"US-09042010-0013","Region":"Hawaii","Latitude":"19.944956","Longitude":"-155.786068","map":"<A HREF = \"http://maps.google.com/maps?q=19.944956,+-155.786068(25289)&iwloc=A&hl=en\"> mufon case (25289) map </A>","Summary":"Star like thing drawing other smaller stars into it and then disappearing.","Disposition":"Unresolved","divs":["Sighting DetailsAbout eight weeks ago, as I was walking from my car, up the back driveway, to the hotel I work the graveyard shift at, I started noticing a number of lights in the sky encircleing our Big Island of Hawaii. They were all at the same height, all the same brightness and spaced evenly apart. I thought they might be satellites protecting us from any incoming missles. Sort of like an umbrella. OK with me I thought. Then, about two weeks ago there appeared a bright star-like object out over the ocean. I thought it could possibly be two satellites, one behind the other. It was a little higher in the sky then the \"umbrella lights\". Last week on my way into work I noticed that the bright star-like object was even brighter. As I was watching this thing get brighter, a cigar-shaped object with red lights approached the bright star-like object and shot a beam of light down on it, just like a tractor beam from a science fiction movie. Then the red-lighted object blinked out of sight. The bright star-like object dimmed but remained. Well, then tonight the bright star-like object got brighter again and one by one the umbrella satellite objects blinked out as they progressed closer to the bright star-like object. The bright star-like object then looked as if it were receeding away from where it was and as if someone gave a command to go to warp speed, it was gone. In the end there were no more lit objects that had originally caught my attention. No umbrella satellites, no red cigar-shaped object and no more bright star-like object, just black empty space. I felt releived, but angry that other people missed the whole thing."],"files":["/var/www/straped/mufon/html2text/25289.html.txt","/var/www/straped/mufon/org/25289.html"],"Case Number":"25289","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Shape":"Cigar, Flash, Sphere, Star-like","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","trends":["There has been one other sighting in Waikoloa Village","There were no other sightings in Waikoloa Village on or around September 3rd 2010"],"Object Features":"None","Date of the Event":"09/03/2010 08:06 UTC","Date Submitted":"09/04/2010 10:39 UTC","Tags":"City","Country":"United States"}