{"trends":["There have been 8 other sightings in Gary","There were no other sightings in Gary on or around September 3rd 2010"],"Region":"Indiana","files":["/var/www/straped/mufon/html2text/25281.html.txt","/var/www/straped/mufon/org/25281.html"],"Date of the Event":"09/03/2010 11:57 UTC","Object Shape":"Star-like, Triangle","divs":["Sighting Detailstriangle white center red tip blue tip greenish tips till going on be back i'm back it is 1254 am .the clouds finally covered them I went outside to get stuff out of the car before coast to coast started while outside i noticed what a call a flashy plane the ones that seem to do the chemtrails at night. It was in the southwest sky. Then I noticed that there were quite a few stars out,so I was looking at them and one seemed to be very bright and gigleing. I went in the house to get my binoculars It was really moving around I figured it was me I don't use them often I steadyed them on the front porch banister and focused It was a triangle bright white center blue tip red tip greenish changing color a little tip As soon as I saw it was clearly a triangle that was micro moving so it looked like it was kind of giggling like in the old movies when the rockets took off my car alarm went off and scaried the crap out of me for a sec. I went to get my keys checked the back door quickly and went back out maybe one minute. My car arlarm had turned off and my grandson was just getting out of his car he has to go past where my car is to get to his driveway I asked him and his girl friend if they herd my alarm. both said no so i told thenm what I saw my grandson look after some prompting.He said it looked like a triangle thats weird his girl friend looked after some coksing. she said it looked like a triangle. wh ile they were looking i saw another one to the northwest i watched it till the clouds covered it .when in at 1254 clouds came out of no where. my son came home at 110 I took him out the clouds were gone and they were both back only they had both moved alot because before they were almost right above two different trees. he saw them both got the same impression that he couldn't hold the binoculars still \"we all were that way\" when i looked the one in the northwest looked farther away put the same the one in the southwest looked like a white front kind of rounded with what looked almost like flames white front then red then blue like in the old flash gordon movies to show it was moving"],"Case Number":"25281","Tags":"City","Summary":"Bright pulsating star to naked eye rainbow triangle with7x50 binoculars.","Disposition":"Insufficient Data","Country":"United States","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","City":"Gary","Longitude":"-87.344047","Log Number":"US-09042010-0005","Latitude":"41.60134","Weather Factors":"None","Date Submitted":"09/04/2010 02:47 UTC","Source":"MUFON","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.60134,+-87.344047(25281)&iwloc=A&hl=en\"> mufon case (25281) map </A>"}