{"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["sighting detailsa couple of months ago, there was a report on mufon from someone watching webcam #1 from terme santa cesarea, italy, of interesting ufo sightings with photos attached. since that submittal, i've been watching the cesarea webcam and tonight the ufo's (or whatever they are) put on an incredibe show. to start, please know that the webcam the first reporter submitted (either in june\\july '10) was from cesarea webcam #1, and only recently did i learn there is another webcam, #2. after walking my dog this eve, i remembered (while it's still dark in italy) to see if there was any action going on there. as i rarely watch these cams after 4-5pm mountain time (or 2am in italy), i guess i was missing the real action which i watched tonight at 3:45+am italy time (or whatever the photos list as the exact time). as i found one youtube video of cesarea's #1 webcam w\\ some interesting ufo footage, i hope they put on tonight's footage as well. i downloaded approximately 80 photos from cam#2 tonight, and when you see the pics, you'll know why. and how is what is taking place at sta. cesarea is not hugh news? all i know is i'm off to santa cesarea first chance i get solely to watch this stuff with night vision goggles. so you know, the first photo will be a daylight pic of santa cesarea so you know there is nothing there which could explain these phenomena. and if you wish mufon, you may contact me for all of the pics i downloaded. the terme santa cesarea website for both webcams is: www.termesantacesarea.it lastly, watching the webcam tonight was a little frightening, as i've never seen anything like it in my life - even in a movie."],"Summary":"Simply unbelievable 2+ hr UFO show at Santa Cesarea, Italy.","Date Submitted":"09/04/2010 03:34 UTC","Latitude":"40.067506","trends":["There have been 4 other sightings in Minervino di Lecce","There were 3 other sightings in Minervino di Lecce on or around September 4th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.067506,+18.43848(25282)&iwloc=A&hl=en\"> mufon case (25282) map </A>","City":"Minervino di Lecce","Tags":"City","Log Number":"IT-09042010-0006","Date of the Event":"09/04/2010 03:30 UTC","Case Number":"25282","Country":"Italy","files":["/var/www/straped/mufon/html2text/25282.html.txt","/var/www/straped/mufon/more/25282_submitter_file1__SantaCesareawebcamdaylight.jpg","/var/www/straped/mufon/more/25282_submitter_file2__SantaCesarea10webcam.jpg","/var/www/straped/mufon/more/25282_submitter_file3__SantaCesarea12webcam.jpg","/var/www/straped/mufon/org/25282.html"],"Longitude":"18.43848","Object Shape":"Diamond, Star-like, Teardrop, Other","Viewing Distance":"Unknown","Region":"Puglia","Source":"MUFON"}