{"Region":"South Carolina","Viewing Distance":"Over One Mile","Disposition":"Unknown","Country":"United States","Weather Factors":"Windy","Summary":"myrtle beach sighting","Log Number":"","Date Submitted":"09/09/2003 10:30 UTC","Object Shape":"Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/2528.html.txt","/var/www/straped/mufon/org/2528.html"],"divs":["Sighting DetailsMy girlfriends and I go to myrtle beach every year in Sept. One of our favoritethings to do is sit on the beach in the late night and talk. It was the nightbefore the full moon which I believe was 909. We were talking and noticing howclose Mars was to the moon. I noticed a very bright orangish yellowish star Ithought over the ocean but it was too large to be a star. It was gone in about 1to 2 seconds it just seemed to go out. I asked my friends if they had seen itand of course they had not.We continued talking and in about 10 minutes later itappeared again and this time they both saw it. It would move behind acloud and then appear again over the horizion but this time to the left.Theamount of movement appeared to fast for any kind of airplane or flying object wewould be familiar with. Again it would move behind cloud cover and appear in adifferent location. then it just disappeared and we didnt see it again. none ofus had ever seen anything like it before and asked several people staying in thesame area if they had noticed anything. No one had and the local paper made nomention of it. We would love to know what it was and if we indeed saw somethingnot of our own making. I dont know my friends e-mail addresses"],"Latitude":"33.69325","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around September 9th 2003"],"Object Flight Path":"Other","Source":"MUFON","Longitude":"-78.884094","map":"<A HREF = \"http://maps.google.com/maps?q=33.69325,+-78.884094(2528)&iwloc=A&hl=en\"> mufon case (2528) map </A>","Date of the Event":"09/09/2003 10:30 UTC","Case Number":"2528","City":"Myrtle Beach","Object Features":"Undisclosed","Sighting Duration":"00:05:00"}