{"Summary":"Tiny 1-inch sphere/bubble seems to hide & definitely avoids capture.","City":"Helen","files":["/var/www/straped/mufon/html2text/25291.html.txt","/var/www/straped/mufon/org/25291.html"],"trends":["There have been 3 other sightings in Helen","There were no other sightings in Helen on or around August 16th 2010"],"divs":["Sighting DetailsOn August 16, 2010 I was in Helen Georgia while vacationing in the area. At around noon on a clear day with a slight breeze while window shopping alone, I noticed a strange looking bubble move past me and stop. It was about 4 feet off the ground and an inch in diameter. Even though it was strange looking, my initial reaction was to took around me to see if a child was making bubbles with soap and the circular part that dips into the soap then scatters the bubbles. There was no one around me by at least 50 feet. I turned back to look more closely at the bubble. It had not moved and was about 2 feet from me. The first thing I realized is that it was really nothing like a kids bubble although the size was the same. It appeared to be generally clear but to have something that looked dark inside of it to the lower right side. Around it's outside there was a wispy undulating haze that extended out about one to two inches all around. As I stared at it, and I should say now that the complete encounter lasted around a minute, it started to disappear and then quickly re-appear. The best description of what they really looked like is from the movie Predator with Arnold Schwartzenager. The alien was in the trees and you could really only see it's vibations when it moved. If you saw the movie, that was very close to what I saw. As a matter of fact, at the time, my mind immediately connected the images. I leaned forward to get a closer look and it moved about 6 inches away and stopped, and began to appear to shimmer out of focus and begin to disappear. Without moving I concentrated on what was left and I remember squinting my eyes and the vision became sharper and it came back to the same shape that it was. I took one small step toward it and again it moved another 6 inches away, stopped and began dissipating again. In order to bring it back into my vision, I had to move my head left and right. Somehow this brought out it's details other wise it would appear invisible. Again I thought of the Predator movie. I then took another small step toward it and again it moved away slightly and stopped and began shimmering. I recall at this time thinking that some kind of intelligent control was at work here. After coming back into full focus, I decided to try to catch it before it could get away. Without stepping forward, I cupped my hands and extended my arms until they were just under it and slowly brought them up until I was just a few inches under it. I recall that it made a slightly movement upward and either shot out of sight or just disappeared completely. I stayed in place for about a minute but never saw it again. I am 68 years old, don't drink, or take drugs, have very good eyesight and am not prone to hallucinations. My question to you is, has this type of encounter been reported before?"],"Region":"Georgia","Date Submitted":"09/04/2010 03:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.702964,+-83.726448(25291)&iwloc=A&hl=en\"> mufon case (25291) map </A>","Object Features":"Undisclosed","Sighting Duration":"00:01:00","Object Shape":"Sphere","Tags":"City","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States","Source":"MUFON","Weather Factors":"None","Latitude":"34.702964","Case Number":"25291","Date of the Event":"08/16/2010 12:00 UTC","Longitude":"-83.726448","Disposition":"Unknown","Log Number":"US-09042010-0015"}