{"Country":"United States","Disposition":"Insufficient Data","trends":["There has been one other sighting in Duryea","There were no other sightings in Duryea on or around August 30th 2010"],"Object Flight Path":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-75.762439","Object Features":"Undisclosed","Summary":"Green strobe/laser light lit up the car from above.","Date Submitted":"09/04/2010 09:07 UTC","City":"Duryea","files":["/var/www/straped/mufon/html2text/25296.html.txt","/var/www/straped/mufon/org/25296.html"],"divs":["sighting detailshi, my name is erica and i'm not sure exactly how to go about this, but here goes. last week my girlfriend told me a story about how a few days before she was driving down ransom rd. duryea pa. and she saw some green flash of light coming from the tree line. so she had me look it up because she believed it was some ufo or something because she said she could see the source of the light one second and then it was just gone. after i looked it up i came across a bunch of things about the \"green flash\" that comes from the sun at sun up\\down. until last night i thought that's what it had to be. well last night we were driving through ransom again(not in the same section) and in the complete darkness like right in front of us there was a green little bit of light, like a lazor pointer, and then we drove under it and it was like i don't even know how to explain it, it was almost like it expanded over the car or something and then it was gone. like a quick strobe light, of green all through the car. it was like it came from straight above us. i figured i should let someone know about it, it's the 2nd time it's happened. thanks for your time and sorry if this is just me being dumb."],"Object Shape":"Flash","Viewing Distance":"Unknown","Latitude":"41.351321","Source":"MUFON","Log Number":"US-09042010-0020","Date of the Event":"08/30/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.351321,+-75.762439(25296)&iwloc=A&hl=en\"> mufon case (25296) map </A>","Region":"Pennsylvania","Case Number":"25296","Weather Factors":"Unknown"}