{"trends":["There have been 4 other sightings in Rochester","There were no other sightings in Rochester on or around December 26th 1982"],"Summary":"Saucer shaped.","City":"Rochester","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Latitude":"43.307646","Date Submitted":"09/04/2010 12:24 UTC","Viewing Distance":"101-500 Feet","Longitude":"-70.966919","Country":"United States","Disposition":"Unknown","Region":"New Hampshire","Object Features":"Dome, Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=43.307646,+-70.966919(25290)&iwloc=A&hl=en\"> mufon case (25290) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/25290.html.txt","/var/www/straped/mufon/org/25290.html"],"Log Number":"US-09042010-0014","Source":"MUFON","divs":["Sighting DetailsI have contacted \"Mufon\" with my information a few years back, got NO responce from you. Also wrote a letter to Mr Friedman in Maine years ago recieved a form letter request to send $5.00 to him, his object was money, not mine. I called the Rochester Police dept,that same night, they said they had many call's of sighting's. Also called \"Pease Airforce Base, told me there was no active flight's on that night. Recienyly went to Rochester Police station and asked them about the report's they received on the sighting. was told by the dispatcher that the police do not keep record's that long.So I'm letting you know what happened that night, probably for the last time, I am 76 years old. My wife and I were driving up Rochester Hill Rd, heading south when I spotted the object just above a tree top on the west side of the road. I stopped the car and asked my wife if she saw it, said she did. I got out of the car and observed an upside down saucer shaped UFO with different color lights in a circle of windows. I can't remember why we didn't wait for it to leave but we didn't. It made no sound, did not move but it was there. WE proceded south on then Rte. 16, now Rte.108 saw it again over an area that used to be an out door theater, much further to the west .Again gong towards Madbury NH over the Spaulding turnpike overpass, . My family know's of our experience but we kind of kept it to ourselves for obvious reasons. Excuse the typos. Hope I described our experience as to what we saw, Hopefully I will hear from you"],"Object Shape":"Disc","Case Number":"25290","Date of the Event":"12/26/1982 12:00 UTC"}