{"Tags":"City","City":"Bolingbrook","Summary":"It looked like a very high flying military jet with a single com trail.","Region":"Illinois","Viewing Distance":"Over One Mile","Source":"MUFON","Disposition":"Unknown","Date Submitted":"09/04/2010 06:29 UTC","Case Number":"25295","divs":["sighting detailsmy wife was driving and i was her passenger as we were driving on i55 going west to the weber road exit. i was looking toward the front of the vehicle at the wispy clouds against the royal blue sky. when i noticed around the 1 o'clock position in the shy ahead of us. what i determined to be a jet fighter and its com trial. what i noticed was the speed at which the object was moving at. which i perceived as moving faster than normal across the sky. as the object moved almost 3\\4 of the way across in front of me i realized that what i was seeing was not what i had originally perceived. the chemtrail never got any longer or shorter and moved right along with whatever was creating it. in fact from my view all i really seen was this line in the sky moving along in front of me in a straight line. it size was approximately 1 1\\2 to 2 inches long and all moved together as one. when it went past a puff cloud and came out again it seemed to just stop there on the right side of the cloud and just hang there for 45 seconds or so before once again moving off to the right at its previous slow constant speed. it continued till it got to a cluster of clouds on my right and a tree came into view and blocked my sight for a second. just long enough for me to have lost sight of the object. i never was able to locate it gain after that."],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"09/04/2010 04:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.706282,+-88.061636(25295)&iwloc=A&hl=en\"> mufon case (25295) map </A>","Longitude":"-88.061636","Log Number":"US-09042010-0019","Country":"United States","trends":["There have been 3 other sightings in Bolingbrook","There were no other sightings in Bolingbrook on or around September 4th 2010"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Bullet, Missile","Latitude":"41.706282","files":["/var/www/straped/mufon/html2text/25295.html.txt","/var/www/straped/mufon/org/25295.html"]}