{"Date of the Event":"09/04/2010 09:25 UTC","Longitude":"-98.8999","Log Number":"US-09052010-0009","Object Features":"Unknown","Latitude":"32.757127","Summary":"Saw bright orange light WSW of Breckenridge, which turned red and disappeared.","Source":"MUFON","Weather Factors":"None","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=32.757127,+-98.8999(25307)&iwloc=A&hl=en\"> mufon case (25307) map </A>","Object Shape":"Circle, Disc, Oval, Star-like","Viewing Distance":"Unknown","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around September 4th 2010","This sighting has never been favorited.",""],"Region":"Texas","files":["/var/www/straped/mufon/html2text/25307.html.txt","/var/www/straped/mufon/more/25307_submitter_file1__DSC01976_crpd-SW.jpg","/var/www/straped/mufon/org/25307.html"],"divs":["sighting detailson saturday, 09\\04\\2010 at 21:25 hrs, i stepped out my back door and my attention was drawn to a bright orange light in the wsw sky. the object was just a few degrees above the horizon, which would put it right at the tops of the distant trees (over 900 ft. away). at first i assumed it was venus but the object began to rise in elevation, approximately 2 to 3 degrees. the object stopped it's ascent and i reach in the door and grabbed my camera, taking two shots. i then got my binoculars and looked at the light. the object was a bright white orange light and for all appearances i would have dismissed the object as venus. however, venus does not ascend from the west, nor does it move 2 degrees or more in 3 seconds. i also know what venus looks like, with the naked eye and through both binoculars and telescope. this did not look like venus. i called to my spouse who also looked at the light, saying \"it's venus.\" after saying that, within seconds the light turned red and disappeared completely. total viewing time: 10 minutes. i went back inside, pulled up an astronomy website, checked and saw that venus had set an hour earlier. i wrote a short report, attached the original photo and sent it off to mufon's director of research. he did not know what the object is either and confirmed that it wasn't venus. attached photo is a cropped version of the original i sent to *(name deleted--sgonzalez\\cms). i must add that my digital still camera will not focus on anything at night, unless the subject is unusually large and bright. it had no problem focusing on this light."],"Date Submitted":"09/05/2010 08:46 UTC","Disposition":"Unknown","City":"Breckenridge","Country":"United States","Case Number":"25307","Tags":"City","Sighting Duration":"Undisclosed"}