{"divs":["Sighting DetailsMy mother and I were in the car in an nearly empty parking lot leaving her office, where there is little light pollution. We were facing west and saw what we assumed was a plane, but it was orange in color and emanating a lot of light, it looked like an orange fireball. There is a small airport in town and we are used to seeing various small aircraft so we waited and watched so we could determine what kind of craft it was as it was in the flight range of a small aircraft. As we continued to watch as it travelled towards the east we noticed that it was making no sound. We watched as it made a sharp angle towards Lake Erie and then gradually it stopped emanating light and was just an orange ball then we could no longer see it. I called my sister to tell her that we saw a fireball in the sky and was on the phone with her for the rest of the duration. My mother and I were facing towards Lake Erie when we saw a flash in the sky, like a meteor. We turned to look in the original direction the fireball came from and saw another one coming in a similar path but this one seemed to be emanating even more light and was red, then it shifted colors to orange when it was overhead and continued towards the lake. We then saw a third fireball coming. I was scared so I told her to start driving home. At one point we looked back and two of the fireballs were stationary and stacked in a similar way as the Phoenix Lights. We lost sight of the objects as we went into town. Both of us are skeptics and trying to come up with a reasonable explanation. Neither of us has seen anything like this. They truly looked like fireballs. I have to think they are flares, but it was just too strange. My mother was not fearful but both of us felt kind of in shock."],"Tags":"City","Latitude":"41.919414","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Viewing Distance":"Unknown","Log Number":"US-09052010-0011","files":["/var/www/straped/mufon/html2text/25309.html.txt","/var/www/straped/mufon/org/25309.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.919414,+-83.39491(25309)&iwloc=A&hl=en\"> mufon case (25309) map </A>","Date of the Event":"09/05/2010 09:00 UTC","Summary":"Orange fireball moving towards lake followed by flash then 2 more fireballs, second changed color from red to orange.","Date Submitted":"09/05/2010 10:06 UTC","Region":"Michigan","Longitude":"-83.39491","Object Features":"Unknown","Weather Factors":"Unknown","Object Shape":"Fireball, Flash","Disposition":"Unknown","Sighting Duration":"Undisclosed","Case Number":"25309","Country":"United States","City":"Monroe","trends":["There have been 9 other sightings in Monroe","There were no other sightings in Monroe on or around September 5th 2010"]}