{"Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.231143,+-110.920979(25301)&iwloc=A&hl=en\"> mufon case (25301) map </A>","Longitude":"-110.920979","Country":"United States","Date Submitted":"09/05/2010 03:02 UTC","Summary":"Unknown light configuration over Tucson, Unable to identify.","City":"Tucson","Object Shape":"Unknown","Log Number":"US-09052010-0003","Source":"MUFON","Tags":"City","Region":"Arizona","Date of the Event":"09/04/2010 10:58 UTC","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 4th 2010"],"Case Number":"25301","Latitude":"32.231143","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25301.html.txt","/var/www/straped/mufon/org/25301.html"],"Viewing Distance":"Over One Mile","divs":["sighting details20100904 2258 mst tucson az i had stepped out onto the balcony of my apartment to get some air, watching the sky as i frequently do. i observed two bright red strobelights with one small green light (steady) between them. strobes were very slow, 1\\ second, alternating, left, right, left, right, both, right, left, right, left, both, repeat, which is what made me notice them in the first place. object apperared in mid air ssw and proceeded nw at moderate pace until disappearing behind apartment building, which was also closest point of approach. i at first believed it to be a military aircraft out of davis monthan afb, but the unusual light configuration made clear very quickly it was not and a-10, f-16, c-130, or c-17, or any other aircraft i routinely see flying in and out of dm. object appeared to be paralleling course of i-10. at cpa, obect was between size of birthcontrol pill at arms length and size of aspirin at arms length. i would estimate speed at 100 to 150 knots, altitude approximately 5000 ft agl. 5-10 seconds before cpa, i was able to hear very deep hum similar to turboprop aircraft, but bass rather than the usual tenor sound. object lights did not conform with any known light patterns of aircraft in my experience. i have been a sky watcher and aircraft aficianado since childhood, and am a student pilot on extended hiatus until finances improve. i was unfortunately, not able to determine the shape of the object, as the strobes were incredibly bright, creating a contrast with the dark sky which was impenetrable. however i was able to observe the object occlude stars twice along its flight path proving that it had some sort of mass and structure. this may have been some sort of military aircraft, perhaps a uav. still, it was unknown and flying, so i am reporting it. i would post pics except that when i ducked inside to grab the camerai found that the camera batteries were still in the charger at the time. oops! for some odd reason, i have been having just a little bit of an adrenaline reaction to this event, which is highly unusual for me. ps i will prepare a sketch of the scene and illustrate the objects course, however, i do not have time at the moment as i want to get this narrative downdown while it is fresh in my mind."],"Object Flight Path":"Path with directional change"}