{"Viewing Distance":"Unknown","Disposition":"Insufficient Data","City":"Mt Pleasant","Case Number":"25308","Weather Factors":"Unknown","Latitude":"40.157271","Summary":"Bright moving lights, flashed then dimmed.","Object Features":"Unknown","Log Number":"US-09052010-0010","divs":["Sighting DetailsI was just outside. I have been watching lots of activity lately but most of it can be explained as planets or plains. Once in a while I see something really interesting. Tonight was one of those nights. I was just outside admiring the sky and listening to a concert in the distance. When my eyes fell on a star-like object that moved slowly from my left or westerly, to my right. Then suddenly as a plane passed near-by (probably at a different altitude) it flashed a bright white light and just sort of \"powered up\" as I like to say. It satyed bright for a few moments then went dim. It didn't flash off like someone turned off a light but rather dimmed slowly like a candle. It moved until it reach the Cassiopeia constellation and stopped. It hung there like an ordinary star. THEN from the same area where the I first noticed the other one, a new flash appeared. It flashed on quickly then off again. It moved at a different angle, slowly, toward the southwest. It just kept going until I couldn't follow it anymore. I was pretty excited and just had to come in and report it. There has been a lot more activity lately but as I said before this was really unique."],"Object Shape":"Saturn-like, Star-like","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Date of the Event":"09/05/2010 12:00 UTC","Sighting Duration":"Undisclosed","Region":"Pennsylvania","trends":["There have been 6 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around September 5th 2010"],"Tags":"City","files":["/var/www/straped/mufon/html2text/25308.html.txt","/var/www/straped/mufon/org/25308.html"],"Longitude":"-79.53158","Country":"United States","Date Submitted":"09/05/2010 09:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.157271,+-79.53158(25308)&iwloc=A&hl=en\"> mufon case (25308) map </A>"}