{"Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=38.904292,+-77.032136(25304)&iwloc=A&hl=en\"> mufon case (25304) map </A>","files":["/var/www/straped/mufon/html2text/25304.html.txt","/var/www/straped/mufon/org/25304.html"],"trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around September 4th 2010"],"Disposition":"Unknown","Tags":"City","City":"Washington","Country":"United States","Latitude":"38.904292","Sighting Duration":"00:00:15","Date of the Event":"09/04/2010 10:05 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","Case Number":"25304","Object Features":"None","Object Flight Path":"Straight-line path","Longitude":"-77.032136","Source":"MUFON","Summary":"Orange luminous disc in DC.","divs":["Sighting DetailsI went out for a cigarette last night and sat down in a patio chair to look up at the stars. I caught what I thought was a falling star out of the corner of my eye, but when I focused on it, it was clearly much larger. With my arm extended, it would be about the size (and general shape) of an eraser on a pencil. At the same time, there was a spotlight that had been scanning the sky since before I went outside. When I saw the object, I first assumed that there was another spotlight and the image I saw was being distorted by fog or smoke or something. (There was no fog or smoke around. That's just where my brain went, for some reason.) The object was orange and luminous and almost completely round. There was a small indentation, wider than it was deep, that took up a fifth or so of the surface area. It moved in a steady, straight line (which is also why I associated it with the spotlight) and moved slightly slower than a falling star. There were some (cumulous?) clouds in the area and the object passed in front of the cloud and didn't seem to cast any light or shadow on the clouds. It seemed to be disc-shaped, but could have just as well been an orb. It was hard to tell in the night sky. It was silent. Even though I had a camera phone with me, I was too focused on figuring out what it was to think to take a picture. So, this orange, glowing, pencil eraser-sized object moved in a steady, straight line, a bit more slowly than a meteor, and passed between me and the clouds. I think it just moved beyond my field of vision, but it may have gone behind a more distant cloud. I was so perplexed by what I was seeing that some of the details didn't stick. At this point, I didn't think this could possibly be related to the spotlight, but I kept looking up to see if the orange object would reappear along the same flight path. That's about it. I went inside and decided that I knew what I hadn't seen -- plane, helicopter, satellite -- but had no idea what I had seen. I called my parents and they had no explanation for me and my father suggested I report it to MUFON. I did a little searching around hoping to see a similar report (and saw one, not too different in Indiana). In the end, I decided that my reporting it might encourage someone else to come forward and I'd be that much closer to figuring out what it was."],"Date Submitted":"09/05/2010 07:42 UTC","Region":"District of Columbia","Log Number":"US-09052010-0006"}