{"Date Submitted":"09/05/2010 10:56 UTC","Case Number":"25302","Latitude":"38.684269","Country":"United States","Object Flight Path":"Stationary","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around September 4th 2010"],"Summary":"Orange orb about 1,000 feet above the ground.","Disposition":"Unknown","Weather Factors":"None","Sighting Duration":"00:00:02","Log Number":"US-09052010-0004","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.684269,+-87.522632(25302)&iwloc=A&hl=en\"> mufon case (25302) map </A>","Object Features":"Unknown","Region":"Indiana","divs":["Sighting DetailsMy dad and I were watching tv in our living room with our front door open (north side of the house), since i've been seeing alot of strange objects lately, I've been really paying close attention to the sky. I just happened to look through the window on our front door and saw a bright orange light, im guessing around 1,000 feet above the ground, and appeared to be stationary. I jumped up off the couch and told my dad to come look at this, I had a camera in my pocket because we had some friends over earlier, but another reason i kept it with me was just incase if I witnessed another UFO I would have a camera with me. The object did not stay very long, maybe two seconds at the best. I got outside and the object was gone, so I waited, and waited, and waited, for about 20 or 30 minutes, then I decided to go back inside. About 20 minutes later, we were sitting in the living room watching tv, and I kept glancing over hoping to see the object again, and to my luck, I eventually saw it again, I flew off the couch and told my dad \"there it is again!\" and this time he saw it, he was not sure what it was either, it was not a flare because F16's usually practice dogfights over our house and sometimes they drop flares, they tend to move slowly and flicker, but this thing did'nt do anything like that. It was stationary and was a constant light, and it was visible about two seconds, but flares usually last longer than that, maybe 15 or 20 seconds, there were also no jets in the area at the time, so I'm not going to consider it a flare. Unfortunately, since the object lasted only a few seconds, I was'nt able to get any photos."],"Viewing Distance":"Unknown","Longitude":"-87.522632","Object Shape":"Star-like","Tags":"City","files":["/var/www/straped/mufon/html2text/25302.html.txt","/var/www/straped/mufon/org/25302.html"],"City":"Vincennes","Date of the Event":"09/04/2010 10:30 UTC"}