{"Disposition":"IFO","Object Flight Path":"Path with directional change","Case Number":"25313","Date Submitted":"09/06/2010 04:15 UTC","trends":["There have been 8 other sightings in Beverly Hills","There were no other sightings in Beverly Hills on or around September 5th 2010"],"Object Shape":"Sphere, Star-like","Latitude":"34.07912","Log Number":"US-09062010-0002","divs":["Sighting DetailsI am a chef in Los Angeles and this evening I was working the Food and Wine festival in Beverly Hills. At just after five I happened to look up at the sky and noticed a light formation of two separate orbs flying horizontal to one another. First I ruled out that they were not helicopters due to the altitude and not planes as there was still enough light in the sky to see any airplane outline. Slightly behind it I noticed a second set of identical lights flying in the same formation. As they flew straight the lights had a slight wobble to their flight path and my co-worker also said he noticed a sort of energy field surrounding the orbs, almost like a halo he stated. Upon reaching the middle of the sky the lights began to stop and between 6-8 new lights began appearing and began making formations in the sky. The formations appeared to be very geometric in nature and the lights continued putting on a spectacle for between 10-15 min. After that they disappeared. During and after the sighting I was absolutely freaked out because I had never seen anything like it."],"files":["/var/www/straped/mufon/html2text/25313.html.txt","/var/www/straped/mufon/org/25313.html"],"Date of the Event":"09/05/2010 05:03 UTC","Viewing Distance":"Unknown","City":"Beverly Hills","Summary":"6-8 lights creating formations in sky above Los Angeles.","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.07912,+-118.396866(25313)&iwloc=A&hl=en\"> mufon case (25313) map </A>","Longitude":"-118.396866","Tags":"City","Region":"California"}