{"Region":"North Carolina","files":["/var/www/straped/mufon/html2text/25319.html.txt","/var/www/straped/mufon/more/25319_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/25319.html"],"Sighting Duration":"Undisclosed","Latitude":"36.175415","Date Submitted":"09/06/2010 09:44 UTC","Disposition":"Unknown","Case Number":"25319","Source":"MUFON","City":"Walkertown","Country":"United States","Object Features":"Window(s)","Summary":"Rare: known aircraft in sky @ same time, daylight sighting of slim cigar shaped craft.","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date of the Event":"09/04/2010 06:45 UTC","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=36.175415,+-80.153101(25319)&iwloc=A&hl=en\"> mufon case (25319) map </A>","trends":["There has been one other sighting in Walkertown","There were no other sightings in Walkertown on or around September 4th 2010","This sighting has been favorited 2 times.",""],"Tags":"City","Viewing Distance":"Unknown","Longitude":"-80.153101","Log Number":"US-09062010-0008","divs":["Sighting Details-I was in front yard of my residence doing some weeding. Time around 6:45 p.m. Still daylight though sun was lowering. -I heard a small aircraft pass over and glanced up and observed a small single prop plane proceeding east, nothing out of ordinary. As it passed out of range a glint of sunlight caught my attention. It was at a rather higher altitude than the small plane which had just passed. -Initially it seemed to be a large commercial jetliner. Pretty much the shape of a standard fuselage. It shone brilliantly in the sunlight like polished aluminum. It was proceeding westward at a fairly stately pace. -I didn't think very much of it at first, even returned to my gardening. Then I realized that there was something unusual about this aircraft... it seemed to have no visible wings or stabilizer. I again looked up and sighted it to check out my impressions. Indeed, I was unable to discern any wings or stabilizing structures. No lifting surfaces. Long cigar tubular configuration. It emitted absolutely no sound my hearing could discern. Very brilliant reflective surface. No odd motion... it just proceeded along at a leisurely clip. Had a vague impression of a row of shapes along the flank not unlike standard passenger aircraft windows. May have been a white glow at rear of craft but no vapor trail. -I was not particularly emotionally affected during or after this event, only curious and somewhat dubious of my observational skills. However, I have since seen several jumbo jets at even higher altitudes and could still discern their wings and hear them. -The craft made no dramatic disappearance... simply faded into the distance."]}