{"Case Number":"25314","City":"Denver","Source":"MUFON","divs":["Sighting DetailsDriving East on 36th going home from the flatirons mall at about 9:20pm. I was following my significant other who at the time was driving in front of me. The object was circular and very bright. Appeared in the south east sky. When my eyes first gazed upon it it hadn't moved yet but after a second started to move very quickly across the sky to the east. It appeared to move from a higher position in the sky to a lower one. This did not function at all like an airplane, shooting star, satellite, or meteor. It went from one end of my windshield to the other in a matter of seconds and then disappeared. This was concerning at the time but upon arriving home I was distracted and quickly spaced what I had seen. It wasn't till last night when my significant other and I were talking that I remembered. She saw the same thing too and was alarmed at how odd it was. Neither of us necessarily believe in UFO stuff but this was just too weird. We both felt like we had seen something beyond normal. Any light you can shed to this occurrence??? Thank you kindly."],"Object Features":"Unknown","Date Submitted":"09/06/2010 11:52 UTC","Longitude":"-104.975053","Date of the Event":"09/03/2010 09:20 UTC","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around September 3rd 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.743324,+-104.975053(25314)&iwloc=A&hl=en\"> mufon case (25314) map </A>","files":["/var/www/straped/mufon/html2text/25314.html.txt","/var/www/straped/mufon/org/25314.html"],"Region":"Colorado","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Tags":"City","Log Number":"US-09062010-0003","Latitude":"39.743324","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Circle","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Driving east on 36th. Saw a bright circular light, appeared to be flying rather low. Shot across the sky very quickly but steady."}