{"Summary":"V shape boomerang with about 5 lights off I-10 on ground.","divs":["Sighting Detailsmy sister and I were driving through bapchule on the I-10 passing the shell gas station at about 3:50am when my sister woke me up and asked me what these two lights that were flying over the field directly next to the freeway. at first it was a green light on one end and a bright light on the other flying a house size above the field it then flew directly over us on the fwy where i saw the shape to make out a boomerang v shape no sound it was gliding; then it turned back around to the field and went right over it again and turned on i believe about 5 lights or so that were big and bright like a stadium light it was pretty big in length size maybe about 4 houses long and it flew very low to the field and up above the shell gas station and hovered over a building behind the gas station turned off all its lights except one star size light then it came back over to these houses by the field looked as if it landed next to them turned on all its lights again and the right corner light this time was orange right next to a house. I was really scared and did not want to find out what was in it lol so we just kept driving on the fwy debating to go back. there were alot of cars on the fwy at the time im sure they saw but ive seen no reports except one from sept 3rd on here that sounds like to be what we have seen. we dont know why this object would be flying directly next to the fwy in clear view of everyone and landing next to it. my sister said she thought she saw it drop something when the green light was on but we went back next day and to much crops to search in. it was the craziest thing we have ever seen being that it was right next to us on ground and flying over us and it was very big in size. whatever it was we hope to hear if anyone has seen this that night. we were thinkin about making a police report but figured they would just disregard our claim."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Object Shape":"Boomerang","trends":["There have been no other sightings in Bapchule","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/25315.html.txt","/var/www/straped/mufon/org/25315.html"],"Tags":"City","Case Number":"25315","City":"Bapchule","Viewing Distance":"21-100 Feet","Date of the Event":"09/04/2010 03:50 UTC","Country":"United States","Region":"Arizona","Date Submitted":"09/06/2010 04:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.136441,+-111.873193(25315)&iwloc=A&hl=en\"> mufon case (25315) map </A>","Log Number":"US-09062010-0004","Disposition":"IFO","Latitude":"33.136441","Object Features":"Undisclosed","Longitude":"-111.873193","Weather Factors":"Unknown","Source":"MUFON"}