{"Log Number":"US-09062010-0001","Country":"United States","Case Number":"25312","divs":["Sighting DetailsWhile driving home from Grand Rapids on US 131 just south of the Sand Lake exit, my wife and I noticed three red lights in a straight line northwest of our location. The near object was aprox. 80 degrees above the horizon and was by far the dimmest and was red in color. The center object looked to be two seperate light sources close together and was aprox. 45 degrees above the horizon orange shifting to red in color. The third object was just off the horizon and was as bright as the center object also red in color. I could not tell speed or direction of object travel but, as we were moving North at 70-75 MPH the objects seemed to be stationary because they drifted behind us out of our line of sight. My wife and I then made a u-turn at the Pierson exit and drove south, but were unable to locate the objects. At this time my wife noticed a flash like lightining in the distance southwest of our location. After returning to the Sand Lake exit we again made a u-turn and resumed our trip home going north. Nothing further was seen. The sky was obscured by clouds and no stars were visible at this time. There are several cell and radio towers near this location, but the objects we viewed were not toweres. I am a military veteran as well as a pilot and am currently employed as an aircraft mechanic so I consider myself well trained in the observation of flying aircraft and can say these objects did not apear to be flares or known aircraft lighting."],"Longitude":"-85.511794","Viewing Distance":"Unknown","Summary":"Three orange/red lights in trailing formation.","Latitude":"43.300762","Object Shape":"Fireball, Flash, Star-like","Date of the Event":"09/05/2010 09:50 UTC","trends":["There have been 2 other sightings in Sand Lake","There were no other sightings in Sand Lake on or around September 5th 2010"],"Weather Factors":"Unknown","Object Flight Path":"Stationary,Unknown","Object Features":"Unknown","Region":"Michigan","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25312.html.txt","/var/www/straped/mufon/org/25312.html"],"City":"Sand Lake","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.300762,+-85.511794(25312)&iwloc=A&hl=en\"> mufon case (25312) map </A>","Date Submitted":"09/06/2010 12:14 UTC","Source":"MUFON"}