{"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Arkansas","Object Shape":"Sphere","Log Number":"","Date Submitted":"09/13/2003 09:55 UTC","Date of the Event":"09/13/2003 09:55 UTC","divs":["Sighting DetailsI was at home watching a movie and I had the feeling that I should look outside, so I did. I saw a light that I thought was an aeroplane so I watched it for a few moments and realized that it wasn't a plane, so I asked my wife for the binoculars. It took a few moments for her to find them and when I had them I saw that what I was looking at was a sphere with octagon shaped lights reminded me of a solar panel in the shape there was one large flashing light that could be seen with the naked eye, but with the binoculars I saw that they all were flashing dimmer than the one larger one that changed color and position on the sphere. The dimmer lights seemed to be pulsating in different colors all over the sphere. I asked my wife for our video camera and believe that I have a tape of a segment of it. The 8mm camera that I have is old so it only has a 8 zoom. We watched the sphere for about 15 -20 mins. then it disapeared over the horizon. WE also saw a plane fly across the path of the sphere. It continued on a Western path in what appeared to be a straight line."],"Weather Factors":"None, Unknown","Summary":"sphere with octagon shaped pulsating lights on the","Source":"MUFON","Case Number":"2531","Disposition":"Unknown","Latitude":"34.40404","map":"<A HREF = \"http://maps.google.com/maps?q=34.40404,+-93.615067(2531)&iwloc=A&hl=en\"> mufon case (2531) map </A>","Longitude":"-93.615067","City":"Caddo Gap","files":["/var/www/straped/mufon/html2text/2531.html.txt","/var/www/straped/mufon/org/2531.html"],"Sighting Duration":"00:30:00","Object Features":"Patterned Surface, Other","Object Flight Path":"Straight-line path","Country":"United States","trends":["There has been one other sighting in Caddo Gap","There were no other sightings in Caddo Gap on or around September 13th 2003"]}