{"City":"Belfast","Sighting Duration":"Undisclosed","Weather Factors":"None","Source":"MUFON","Log Number":"GB-09072010-0003","Date of the Event":"04/30/2010 11:30 UTC","trends":["There have been 5 other sightings in Belfast","There were no other sightings in Belfast on or around April 30th 2010"],"Region":"Northern Ireland","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=54.607223,+-5.924118(25323)&iwloc=A&hl=en\"> mufon case (25323) map </A>","Tags":"City","Country":"United Kingdom","Summary":"Orange light moving steadily and quickly across the sky at quite a low altitude in an urban area which then disappeared","files":["/var/www/straped/mufon/html2text/25323.html.txt","/var/www/straped/mufon/org/25323.html"],"Case Number":"25323","Longitude":"-5.924118","Object Flight Path":"Straight-line path","Object Shape":"Fireball, Sphere","divs":["Sighting DetailsComing home from a concert across town, nearing 11pm, my friend and I drove home down the motorway following the slip road which would lead off to where we live. As we pulled onto the slip road I noticed an orange light from the corner of my eye, at first passing it off as the reflection of the orange streetlights on my window. Moving parallel to our car no more than 800ft off the ground and to our right. (We are right hand drive here in the UK) Shocked i alerted my friend to the ball of light, who said he had noticed it as well. It was travelling easily at about 35 miles per hour. The ball travelled along the Old Belfast Road, pretty much parallel to our direction so we decided to pursue, both excited and rather disturbed. I pulled in sharply at the side of the road and put the window down as my friend attempted to record it on his mobile phone but no avail. As the object moved on I pulled back onto the Old Belfast Road and continued to follow it until we arrived at a car park for the sports centre where we stopped quickly and jumped out but the object at this point - continuing on it's way - faded to black, although we could vaguely see it's silouhette against the sky for maybe a second after the orange disappeared. The object itself was definitely the size of a small car, and as we said, no more than 800 ft up. Lit up like an orange ball Unfortunately due to the speed at which we were travelling, the poor quality of our cameras and the haze of streetlights our footage didn't capture the object. When I returned home I told my parents about it, who were equally confused but could see that I was shaken by what I'd seen."],"Viewing Distance":"21-100 Feet","Date Submitted":"09/07/2010 07:50 UTC","Disposition":"Unresolved","Latitude":"54.607223"}