{"Summary":"Three star-like objects line abreast changing formation.","Object Flight Path":"Path with directional change","Date of the Event":"09/06/2010 11:11 UTC","Source":"MUFON","Log Number":"US-09072010-0001","Object Shape":"Sphere","Case Number":"25321","divs":["sighting detailsat 11:11 on 9\\6\\2010 i was sitting in my back yard in san francisco when i noticed 3 star like objects moving fast in line abreast formation at my 2 o'clock position moving se to nw at an undetermined altitude. as they passed my 12 o'clock (directly above me) they started weaving in and out of each other - the port object moved to the middle and the center object passed to the port side then they both moved back again. the starboard object maintained position - the amazing thing was that the distances between the center and port side objects changed dramatically and looked to almost collide. unfortunately i then lost sight of them behind a building. the total sighting was about 8 seconds. there was no sound. there were no navigation lights. i hold a commercial pilot's license and i'm convinced they were not aircraft. they were also moving very fast...faster than 250 knot's required in a tca - but they were not meteorites or shooting stars either. the formation flying was the thing that struck me most. amazing. interested if anyone else saw them...i am pretty awestruck. unfortunately, it happened too quickly to grab my video camera."],"Object Features":"None","Region":"California","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25321.html.txt","/var/www/straped/mufon/org/25321.html"],"Date Submitted":"09/07/2010 02:48 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:00:08","Longitude":"-122.411246","Latitude":"37.77804","City":"San Francisco","Country":"United States","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.77804,+-122.411246(25321)&iwloc=A&hl=en\"> mufon case (25321) map </A>","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around September 6th 2010"]}