{"Viewing Distance":"Over One Mile","Country":"United States","Tags":"City","Disposition":"Unknown","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Newton","This sighting has never been favorited."],"Object Features":"Window(s)","Latitude":"38.990877","map":"<A HREF = \"http://maps.google.com/maps?q=38.990877,+-88.162539(25322)&iwloc=A&hl=en\"> mufon case (25322) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"Illinois","Summary":"Flaring light that vanished and flared in sky. Also moved in an erratic motion.","Source":"MUFON","City":"Newton","Log Number":"US-09072010-0002","Object Shape":"Circle, Sphere","Date Submitted":"09/07/2010 03:21 UTC","files":["/var/www/straped/mufon/html2text/25322.html.txt","/var/www/straped/mufon/org/25322.html"],"Longitude":"-88.162539","Case Number":"25322","Date of the Event":"08/04/2010 02:34 UTC","divs":["Sighting DetailsI drive 300+ miles daily. This was a exceptionally late night that we got out to start work. I was on a rural backroad when I took a nature break. As I was out of the car I was looking at the clear night sky. As I was getting back in the car I was watching a bright light thinking it was the space station. Givng thought that we had humans in it and was admiring our race and that we accomplished that, the light went out. Being suprised I stood there and watched. 6 to 7 seconds later it lit up. It became very bright and it looked like a ball with a black stripe across the center. I continued to move in a counterclockwise motion in the sky. It got to about 1 on the clock and moved straight upwards. I watched it move all over for roughly 13 minutes. I left the area and drove to my final stop. I looked in the direction of the sky where it was and it was still there. I went in and got a nurse and she witnessed the same thing. I got out binoculars that i have in car. It then looked like a circle that was a ring with lights on the right side In a 3 toe pattern. I then went in and got a tech to come out and view also. I watched it again for over ten min before I had to leave, it was a 2 hour drive back for me."]}