{"files":["/var/www/straped/mufon/html2text/25320.html.txt","/var/www/straped/mufon/org/25320.html"],"trends":["There have been 4 other sightings in Lawrenceburg","There were no other sightings in Lawrenceburg on or around September 6th 2010"],"Weather Factors":"None","Date Submitted":"09/06/2010 09:48 UTC","Object Shape":"Blimp, Bullet, Missile, Cigar, Sphere","divs":["Sighting DetailsI stepped outside to have a cigarette, and noticed an extremely bright light in the WSW sky. Our home is located in the woods, but I could clearly see it through an opening in the trees. I first thought it was a planet. I used my Android phone and Google sky map software to check. It was not located anywhere near a planet. I then yelled for my Wife to come outside and look. She first said no, that she didn't want to. I stayed outside and watched it for a while. Then I went inside and kept watching it through the window in the front door. I kept telling her to come and look, and She finally agreed. We went onto the porch, Me, My Wife, My Daughter (6) and My Son (1). It was more \"cigar\" shaped than anything, but seemed to have a \"tail\" on the left (south) side. It also seemed to have a sphere on the right (north) side that seemed to be orbiting the front (right, north) side. We watched it for some amount of time, approximately 5 minutes. We did walk out into the yard to look for any other starts, as my wife was trying to dismiss it as a star. I told her there was no way it was a star, because you couldn't see ANY other stars in the sky. Also, that this was entirely too bright to be a star, and too large. She agreed, and said she wanted to get her camera to zoom in and look at it. When She came back into the Living room with the camera, she said it had no batteries. I told her they were on the charger, and she went to get them. I think she got busy doing something else, so I went to get the batteries myself. I put the batteries in the camera, went outside to zoom in and snap a few photos, and it was gone. I felt very uneasy, and went back into the house and locked the doors."],"Sighting Duration":"Undisclosed","Date of the Event":"09/06/2010 08:50 UTC","City":"Lawrenceburg","Object Flight Path":"Stationary","Disposition":"Unknown","Case Number":"25320","Object Features":"Other","Source":"MUFON","Longitude":"-84.893257","Summary":"Elongated, seemed to have a darker shape beneath it. Spherical shape orbiting it.","Region":"Kentucky","Tags":"City","Latitude":"38.045787","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.045787,+-84.893257(25320)&iwloc=A&hl=en\"> mufon case (25320) map </A>","Log Number":"US-09062010-0009","Viewing Distance":"Unknown"}