{"Object Shape":"Other","Log Number":"US-09072010-0014","Sighting Duration":"Undisclosed","Region":"Ohio","Country":"United States","Summary":"Comet like shape flashing across sky east to west then west to east horizontally.","Case Number":"25334","Disposition":"IFO","Object Flight Path":"Hovering then path,Straight-line path","City":"Mason","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25334.html.txt","/var/www/straped/mufon/org/25334.html"],"Longitude":"-84.266961","Latitude":"39.343926","map":"<A HREF = \"http://maps.google.com/maps?q=39.343926,+-84.266961(25334)&iwloc=A&hl=en\"> mufon case (25334) map </A>","trends":["There have been 5 other sightings in Mason","There were no other sightings in Mason on or around September 4th 2010"],"Weather Factors":"None","divs":["Sighting DetailsOn Sat. Sept 4th my husband, my son and I were traveling north on I-71 in Ohio about a few minutes before 9 p.m. near Kings Mills,Ohio when we saw a flash of light in the sky. It resembled a comet traveling west to east horizontally across the sky then disappeared then reappeared going east to west. Our first reaction was it was meteorites but then we thought about it and they usually don't go horizontally. Then about 15 to 20 minutes later as we drove thru Lebanon, Ohio north on St.Rt.48 about 9:10 p.m. we saw a group of 5 lights low to the west horizon toward Middletown, Ohio. The lights were just sitting in the sky in a sort of pentagon shape. They stayed still for a couple of minutes then they shifted their shape and 3 of the lights moved sideways. Then because we were driving the trees were in way and we weren't able to see the lights anymore. We checked the local news, tv and internet because we were in awe of what we saw and don't know what to make of it but we have seen nothing reporting strange lights that night. We also found out that friends of ours that were leaving the same party as us that night also saw the same type of lights above I-71."],"Object Features":"Unknown","Viewing Distance":"Unknown","Date of the Event":"09/04/2010 12:00 UTC","Date Submitted":"09/07/2010 10:52 UTC"}