{"Object Flight Path":"Hovering then path","trends":["There has been one other sighting in Englewood","There were no other sightings in Englewood on or around September 6th 2010"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/25335.html.txt","/var/www/straped/mufon/org/25335.html"],"Latitude":"35.424518","Log Number":"US-09072010-0015","Weather Factors":"Unknown","Case Number":"25335","Disposition":"Unknown","Object Shape":"Star-like, Other","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date Submitted":"09/07/2010 11:14 UTC","Tags":"City","Country":"United States","divs":["Sighting DetailsI was at the kitchen window which faces west, washing my hands. I was looking out, the light in the kitchen was off as I was just passing through. I noticed what I thought at first to be a big, bright star. Then I quickly noticed it changing colors. It was, in a constant rhythem, changing red, white, bluish green. So, I stared at it a moment. As I did, it moved suddendenly in a semi-circle like a backwards \"C\". I then yelled for my roommate to come look. When she got to the window, I told her to just look at that star. She said, \"It's changing colors!\". Then I told her to really watch it a moment. This time it moved left then up in a \"L\" type 90 degree manner, not the curved motion of before. We went outside to get a better look and just stared for about 20 minutes. When it would move I'd ask her, \"What did it do then?\" and she would answer \"move left\" or \"move right\" whatever it did. I did so, so that it would test that it wasn't just me thinking it was moving. She always saw it move the same direction and pattern as I did. I called my brother who was staying out at a friend's two counties NW of mine. He reluctantly went out to look and then got excited because he saw it flashing and dancing too. At this point it was around midnight and it seemed smaller, so I would assume further away. I went in for a bit and then come back out again at about 12:30 and it was way off. I could still see it flashing the colors but I barely could tell it was moveing and at this point it was so far away I could barely see it at all. It seemed to be further west. Another thing that I have trouble discribing, so bear with me, is that sometimes while it was close, it looked as though it was shining a light down to the ground. Much like a flashlight's light beam can be seen... it too had a light comming from beneath and shining down and out until it faded out to where it was not noticable. This \"shining down\" look was only there periodically. I don't know what to make of it, there was no noises. No engine sounds or humming. It was not three different lights flashing like a plane... it was one object changing colors. When I told my mother I likened the motions it had to the jerkiness of those \"claw\" machines. You move the claw left and right and forward and back... the motion is always fast, then stop, fast then stop. Like that. I got the feeling whatever it was was looking for something or at something. I can't imagine a plane moving like that or even ever seen a helicopter that could move as clean and quick like that... and like I said... it was one object in three colors not three lights on one object. I was never scared of it... it seemed too far away for that, but I was entralled by it and totally in awe. Eventually, it just got so small I had trouble seeing it. I imagine it keep \"going\". The whole ordeal took about a hour and a half... once again, not at all like a plane."],"Region":"Tennessee","City":"Englewood","Sighting Duration":"01:30:00","Date of the Event":"09/06/2010 11:20 UTC","Longitude":"-84.487429","Summary":"Star-like object moving left, right, up, down and constantly changing colors from red to white to a bluish green.","map":"<A HREF = \"http://maps.google.com/maps?q=35.424518,+-84.487429(25335)&iwloc=A&hl=en\"> mufon case (25335) map </A>"}