{"Region":"Utah","Latitude":"41.120207","Object Features":"Undisclosed","City":"Clearfield","Object Shape":"Flash, Star-like","Date Submitted":"09/07/2010 07:45 UTC","Log Number":"US-09072010-0011","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Longitude":"-112.024654","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.120207,+-112.024654(25331)&iwloc=A&hl=en\"> mufon case (25331) map </A>","trends":["There have been 3 other sightings in Clearfield","There were no other sightings in Clearfield on or around September 6th 2010"],"Case Number":"25331","Date of the Event":"09/06/2010 11:30 UTC","Summary":"We saw six lights appear by our apartments. they would make different formations.","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25331.html.txt","/var/www/straped/mufon/org/25331.html"],"divs":["Sighting DetailsWe were sitting on the porch and the lights just appeared and starting moving ..at first they were paired up two by two and then they moved into this shape thats in the video and some more show up and then leave ..they would also turn off their lights and reappear somewhere else..this is the second time we see them in a 2 month period..we have asked locals and they have no idea..we just moved here from the east coast. We live right next to the air force base but the way we were facing is not towards the base..there is a airport that way but we can hear the planes from that airport and these lights made no noise..they almost seemed like they were playing..We maybe thought they were parachuters but the way the lights would move up and down and disappear ruled that out. They looked just like a star shape. We lost sight of them because they just all went away..they didnt fly away just turned off the lights and were gone.I have videos of it but it wouldnt go through on this website..just email me and I can send them to you"],"Viewing Distance":"Over One Mile"}