{"Summary":"Eugene, Oregon abduction - It's frustrating dealing with aliens.","Object Features":"Undisclosed","Longitude":"-123.083524","trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around September 6th 2010"],"Date Submitted":"09/07/2010 04:30 UTC","Weather Factors":"Unknown","Latitude":"44.056759","divs":["sighting details i am a student here in eugene, oregon. i have my ged and i'm studying to become a computer programmer. (i used to work at subway) the events i'm about to describe to you are real, and i didn't make them up. about 2 years ago i started noticing subtle ambiguous coincidences on radio and other media happening. creatine in particular stood our as having weird effects. first let me tell you i've been a poster on aspiesforfreedom.org and i think theres a direct link between schizophrenia \\ autism and these so called alien abductions. i've actually studied a lot about the mental illness schizophrenia before the events took place. about a year and a half ago i was at home aligning crystals to my chakra centers for the heck of it. i wanted to see if these chakra points would do anything if i placed the stones on them. at this same time i was taking pregnenolone, dhea, and probably creatine as supplements. the first ufo sighting i had was after eating dinner at my house. i went outside and i saw a blue flash of light hit the ground a few feet in front of me. after i went back inside my house i hopped on facebook.com at about 8pm pacific time and i started hearing voices chanting someones name. i woke up the next morning and the person's name had changed. the next thing i did was report this event to mufon's ufo network. i know you're probably thinking \"hey he's nuts\" and i have been comitted to a mental hospital for this very reason. in fact i've grown to accept it as a mental illness despite having aliens wake me up at night in my dreams. let me tell you guys (it's not just sleep paralysis). if you've ever had the experience of waking up at night, and not being able to move then you know what sleep paralysis is like. well i'm here to tell you that it is not just sleep paraylysis like they're saying! don't believe the lies... anyway... back to the story. the voices first told me they were witches, then lucifer star of the morning, and then aliens. look all i know is that there strong and they're harassing me."],"Country":"United States","files":["/var/www/straped/mufon/html2text/25330.html.txt","/var/www/straped/mufon/org/25330.html"],"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=44.056759,+-123.083524(25330)&iwloc=A&hl=en\"> mufon case (25330) map </A>","Region":"Oregon","Object Shape":"Flash","Case Number":"25330","Date of the Event":"09/06/2010 12:00 UTC","Source":"MUFON","Log Number":"US-09072010-0010","Viewing Distance":"Unknown","Tags":"City","City":"Eugene","Object Flight Path":"Undisclosed"}