{"divs":["Sighting DetailsThis was the weekend of the Chicago Air and Water Show. The skies were bright for late afternnon and the weather was very good. I was at home with a broken ankle and was sitting in my den, facing West and my 83 year old mother was in the living room, next to where I was sitting. The living room faces West also. It was approximately 4:30 or a little later in the afternoon when suddenly the room I was sitting in became pitch black. I looked up and glanced out the window in front of me and it was pitch black outside also. My first and immediate thought was that this was a UFO. I don't know why I thought that? Suddenly, everything returned to daylight, as it was previously. I looked at the clock, but the time was no different. I thought perhaps my eyes were playing tricks on me, so I called into the other room and said to my mother, who was reading in there, \"What was THAT?\" I thought she would say nothing happened, but her answer confirmed my experience when she responded with, \"I don't know, but the whole room just went totally black for at least two seconds.\" We talked for a few minutes as we both wondered if perhaps one of the airplanes from the Air Show was returning to a base and flew overhead, maybe blocking the sun. But, neither of us heard any noise at all. And, we could not figure out how something could be so large as to block out the sun completely and turn a bright afternoon into the middle of the night for a few seconds. The next day, Monday August 16th, a friend stopped over who lives only about 4 miles away in Chicago. I asked him if the sky had turned black and he said, \"No\". There was nothing written about it in the news. I had experienced two very significant dreams of Alien contact back in the mid 1990's. But, I don't know if anything in those dreams are real. Yet with this, both my mother and I did experience a normal afternoon turn into total darkness without any noise or someone else confirming the experience. Again, the first thought that entered my mind for some unknown reason was UFO."],"City":"Chicago","Object Features":"Undisclosed","Date of the Event":"08/15/2010 04:30 UTC","Summary":"A nice summer's afternoon turned to night for a few seconds.","Sighting Duration":"00:00:02","Object Flight Path":"Undisclosed","Disposition":"Unresolved","Date Submitted":"09/07/2010 11:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.879834,+-87.628608(25336)&iwloc=A&hl=en\"> mufon case (25336) map </A>","Weather Factors":"Unknown","Latitude":"41.879834","Longitude":"-87.628608","Viewing Distance":"Unknown","Log Number":"US-09072010-0016","Tags":"City","Source":"MUFON","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around August 15th 2010"],"Region":"Illinois","Country":"United States","files":["/var/www/straped/mufon/html2text/25336.html.txt","/var/www/straped/mufon/org/25336.html"],"Object Shape":"Unknown","Case Number":"25336"}