{"Source":"MUFON","Object Flight Path":"Hovering then path","Object Shape":"Triangle","Case Number":"25339","Sighting Duration":"Undisclosed","Log Number":"US-09082010-0003","Region":"Louisiana","Date Submitted":"09/08/2010 02:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.951066,+-90.066732(25339)&iwloc=A&hl=en\"> mufon case (25339) map </A>","Country":"United States","Latitude":"29.951066","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/25339.html.txt","/var/www/straped/mufon/org/25339.html"],"City":"New Orleans","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Tags":"City","Date of the Event":"08/27/2010 07:00 UTC","Summary":"Top glowing red, blue, green, yellow, orange, white and amber to smaller lights at bottom of triangle.","Longitude":"-90.066732","Weather Factors":"Unknown","divs":["sighting details off our front porch\\ yard\\windows\\bedroom window @dusk- 12a.m. witnesses to date 10: [witnesses names moved to additional evidence section\\cms\\tg] starting 8-27-2010 we observed a star like object and watched it slowly sink behind the tree line. 8-28-2010 through last night 9-7-2010 we observed the star like object and realized that the twinkling light is on top of the triangular ship. the bottom lights are smaller and softly blink in an amber hue or antique white. the top light changes colors that rotate clockwise and in long\\fast patterns. the colors are: blue,red,green,orange,yellow,white and amber. the ship seems to have cloaking capabilities the stars behind the mass of the ship are blotted out sometimes, then at other times the triangle seems transparent. we have started to go out side every evening just as venus begins her rise the ship descends. the descent is not always in the same location but so far the object begins the descent in our south or western sky. we are north of lake ponchatrain and wonder if the ship is coming in from over the lake. my dad had a friend, a professor at our local university, he lived in a camp down south of here on the lakes pass. he often said he saw craft on the lake funneling water up into its belly while hovering over the pass. we hear these stories, but it now seems possible. last night the ship was really close. the air was heavy with humidity we could make out the top disco type light, but the tail(wing tipped) lights were barely visible and at least a city block apart. my neighbor sandy d., said \"that looks like a mother-ship.\" when i figured out how close the craft was i came inside and watched it out the window until it moved on @10:30 in a n\\w direction. the ship stays below 1,000 ft. and is completely silent. at times it is stationary and then sometimes the craft moves so slowly it is difficult to notice the movement. please if this is happening in other locations on our planet please leave a response for us to review. thank you.........."],"trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around August 27th 2010"]}