{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.811065,+-96.764423(25340)&iwloc=A&hl=en\"> mufon case (25340) map </A>","Tags":"City","Date of the Event":"11/30/1965 12:00 UTC","divs":["Sighting DetailsTwo versions which I believe to be connected. First version, which I recall as being late Spring or early Summer, probably between the years 1965 to 1967. I believe it was 1965. Five years old, I sat by myself in the back yard near the alley playing with Matchbox cars. My dachshund was beside me in the late afternoon. My dog alerted before I heard the sound of an engine above and to the south, out of view because of the house. Looking up as the sound increased, I saw a crop duster, a bi-plane, I think. The plane swooped down from over the roof of our two-story house and continued low as it flew northward. A cotton field was just a few hundred yards to the north, and as the crop duster (that is how I remember it-- a crop duster) went over head, deep red or blood-red pellets of various shapes and sizes fell on me and into the yard. Odd, but sometimes I recall them as horse-pill shaped lozenges, sometimes as red bands up to three inches long, and sometimes as clumps of course granules. I watched, amazed, and my mother soon opened the kitchen door leading into the garage. The main garage door already being open, she called out to me to come in-- somewhat alarmed. I told her I wanted to watch the plane, but she insisted, seeming to me to be unnecessarily alarmed. I had never seen a crop duster and we had just moved to this new home. I cannot account for my interpretation of the object being a crop duster, nor can I understand why I have no memory of going back outside to look at the red pellets. I so distinctly remember the pellets, but after collecting my toys and going inside, the matter seemed to be no longer of interest. That cotton field to the north was soon built-over by the expanding neighborhood and including Spring Creek Elementary School which opened for my second grade year in 1967. That school was the location of a second account supposedly involving me and told to me by the witness two or three years after the incident he recounted. About 1969, a classmate described what he remembered this way: Our class was out playing on the school playground at recess in about 1967. As he described the event, he asked if any of the several of us listening to him remembered the event (none did). He was particular surprised that I had not remembered it, because he claimed I had gotten in trouble for ignoring the teachers' panicked calls for everyone to come inside the school, instead, he said, I and a few others went toward what he described. He said that several students started pointing in the sky to the south of the playground and that the teachers noticed it as well. Initially, the many witnesses (a school yard full of students and teachers-- probably a hundred persons) thought a small plane, like a Cessna, was in trouble and trying to make a landing in the playground, so low was the craft. That might make sense given that a row of high-tension wire separated the playground from the wide, long and straight gravel road slightly to the west. Instead of it being a plane in trouble, the craft came to the southern edge of the playground no longer (if ever) appearing to have wings, and it nearly stopped to hover there. It made a very slow pass over the playground as the teachers tried to gather the students into the building. My friend said the teachers were panicking, but that at least some of the students were not. Then, he said some of us continued to watch the craft as numerous small metallic objects, maybe a little larger than silver dollars, dropped out of the larger craft and began to fly about over the playground. Some of these little disks were flying across the street and toward an old stock pond surrounded by trees which we called, \"Cobb's Creek.\" He seemed disturbed that no one recalled what he described and tried to prompt me to recall how I and a few others actually ran toward the craft hovering overhead and tried to find some of the small disks. The teachers, he said, were furious with me and the others who did this--as we were the last to come inside the school. He also said that after school, some of us went around in the \"Cobb's Creek\" wooded area looking for disks and none were found there or on the playground. Perhaps due to an unconscious connection, I perceive each story as having a duration of perhaps a little more than sixty seconds. In neither story do I know how the craft departed. The crop-duster I recall, disappeared from view in mere moments due my line of sight being hindered by the house across the alley, although the engine noise was audible while I remained outdoors. My impression of my classmate's account is that his craft made no noise at all-- because engine failure was an initial assumption in his recollection. My own analysis is that my crop duster and his story are the same. Between the dates of the two varying stories, I, inexplicably, became terrified of the part of my backyard near the alley-- worried about UFO's. For a few months, I would not go out there at night. During that same time, many of my classmates were fascinated by stories of UFO's and I did not understand their fascination, having never heard of such things before that time. I admit that some traumatic experience involving me is a viable explanation for my having a very tame memory compared to my friend's oddly similar story, given my inexplicable fear of UFO's and the back yard, which I in no way connected with the crop-duster. That I apparently had Post Traumatic Stress Disorder before a most obvious traumatic experience much later in my adult life has had me looking quite closely at these memories as well as the story told by my friend. Both craft in the two accounts were, at first appearance, taken as airplanes, both traveling from south to north and both dropping smaller items as they passed overhead. Both stories have the adult authority figure(s) standing at a door, calling out in what appeared to be unjustified concern. Both accounts have me resisting the call to come inside. I have a Master's Degree in Pastoral Theology (counseling), and nearly two decades of counseling experience as a parish priest. Some of my earliest memories include mystical, spiritual experiences-- typical of a person whose prayer life leans toward the contemplative. As a result, I have studied Carl Jung's theories including his concept that UFO accounts are often (perhaps even always) mystical visions of the post-modern culture. While my recollection of what may be the same event does not involve a UFO my recollection of the crop-duster is \"overly vivid--\" very much the sense that it was spiritual experience rather than an historical one. That my school mate recalled it as a collective experience but having to do with alien spacecraft is most intriguing. For precise location: Spring Creek Elementary in far North Dallas may be located via Google Earth. (32d 57' 23\"N 96d 46' 39\"W) and the playground along Meandering Way is where my friend recalled the event taking place. My own backyard experience is about 300 yards distant of that same location. What locals always called, \"Cobb's Lake\" and \"Cobb's Creek\" is now labeled \"Arapaho Park\" directly SW of the playground. My friend's story would be a CE1, my crop-duster I suspect would be FB4. While preserving my anonymity publicly, a researcher may contact me via my email (which is provided separately on this form) including any requests for third party sharing which I will consider individually."],"Viewing Distance":"21-100 Feet, 101-500 Feet","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around November 30th 1965"],"Disposition":"Unknown","Object Shape":"Cigar, Cross, Disc","files":["/var/www/straped/mufon/html2text/25340.html.txt","/var/www/straped/mufon/org/25340.html"],"Longitude":"-96.764423","Source":"MUFON","Date Submitted":"09/08/2010 04:08 UTC","Country":"United States","Object Features":"None, Window(s), Wings","Log Number":"US-09082010-0004","City":"Dallas","Latitude":"32.811065","Summary":"Small autonomus discs dropping from larger craft over school playground.","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Region":"Texas","Case Number":"25340"}