{"Weather Factors":"None, Does Not Apply","Sighting Duration":"00:00:07","Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsMy friend and I were outside in my yard at 10:01 PM when I noticed the object moving out of the corner of my eye. I immediately shouted for him to turn around and look too. I saw the object for about 5-7 seconds. He saw it for about 2-3 seconds. The object was first observed at about 15 degrees above the horizon at a geopraphical heading of about 350 degrees. It was moving in a downward curving trajectory until it disappeared in a fraction of an instant at about 10 degrees above the horizon. The object appeared about as bright or detectable as Jupiter rising in the East or Venus which had already set in the West. The object appeared to reflect a pinkish or yellowish orange glow that may have been caused by the Sun which had already passed over the horizon. The object appeared to be at a very great distance and therefore a very high altitude. It also would have been moving very fast and been quite large if it was at the extreme long range it appeared to be. My friend and I quickly noted all relative observations, time, heading, etc. We walked around the corner of the house to see Jupiter, at which time we estimated the luminosity to be very simular. We could not explain what we saw. I have many reasons I do not believe this was any type of known artficial or naturally occuring object. I cannot rationalize or justify it as such. I am a knowledgeable amatuer astronomer and aviation enthuiast. I have been watching the sky almost every night for the last forty years. I have seen all manner of craft, weather anomaly, and aerial and astronomical phenomenon. What we saw was none of the above."],"City":"West Columbia","map":"<A HREF = \"http://maps.google.com/maps?q=33.994697,+-81.072982(25344)&iwloc=A&hl=en\"> mufon case (25344) map </A>","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/25344.html.txt","/var/www/straped/mufon/org/25344.html"],"Country":"United States","trends":["There has been one other sighting in West Columbia","There were no other sightings in West Columbia on or around September 6th 2010"],"Object Features":"Unknown","Date Submitted":"09/08/2010 10:11 UTC","Summary":"Myself and an associate witnessed very distant object descend towards earth and vanish.","Object Shape":"Unknown","Log Number":"US-09082010-0008","Source":"MUFON","Latitude":"33.994697","Date of the Event":"09/06/2010 10:01 UTC","Longitude":"-81.072982","Object Flight Path":"Path with directional change","Region":"South Carolina","Case Number":"25344"}