{"Object Flight Path":"Straight-line path","Weather Factors":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/25343.html.txt","/var/www/straped/mufon/org/25343.html"],"trends":["There have been 6 other sightings in Waukesha","There were no other sightings in Waukesha on or around February 27th 2001"],"Date of the Event":"02/27/2001 11:30 UTC","Sighting Duration":"Undisclosed","Summary":"Black or dark gray triangle, no lights.","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=43.019788,+-88.229371(25343)&iwloc=A&hl=en\"> mufon case (25343) map </A>","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Source":"MUFON","Log Number":"US-09082010-0007","City":"Waukesha","Region":"Wisconsin","Object Features":"None","Tags":"City","Date Submitted":"09/08/2010 09:54 UTC","Latitude":"43.019788","Longitude":"-88.229371","divs":["Sighting DetailsI was driving home from a friends westbound on highway 59 in Waukesha. When I got near the intersection of highway 59 and Fox River Parkway I saw a black triangle traveling north by north east directly over the bridge crossing in front of me and I slammed on the brakes. I took a right turn on to Fox River Parkway going north and followed it until I reached Sunset Drive which I took a right turn and traveled east until I reached Sentry Drive and took a left turn going north until it turns into College Avenue going east until I reached Prairie Avenue and took a left and went north until I reached the intersection of Prairie Avenue and St Paul Avenue where I had to stop because it leads into a neighborhood and Waukesha Memorial Hospital. Being between 11 and 12 on a February weeknight there were no cars while I was following the triangle at about 40mph the whole time. There were no stoplights at these intersections in 2001 like there are today so I was able to keep up with it. I would have definitely kept following it if the streets made it able as it was going so slow. It was the most awesome thing I have ever seen, I was so excited that I had a hard time sleeping. I wish I would of reported it right away so that date would be exact. If you look at a map of Waukesha you can easily find the intersection of Highway 59 and Fox River Parkway to see the route I took."],"Case Number":"25343"}