{"Viewing Distance":"Unknown","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/25353.html.txt","/var/www/straped/mufon/org/25353.html"],"Summary":"Me and another person saw a craft/vehicle in the SeaTac airport landing path at night. It hovered, then traveled in the opposite direction of landing airplanes.","Log Number":"US-09092010-0007","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Federal Way","There were no other sightings in Federal Way on or around April 10th 1996"],"Tags":"City","Latitude":"47.331052","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"04/10/1996 10:00 UTC","Case Number":"25353","divs":["Sighting DetailsMy exwifes cousin \"M\" and I were driving to my home in a neighborhood I was raised in called Marine Hills which is under the flight path of SeaTac airport and also has excellent views of puget sound and Maury Island. I am very familiar with the sight or aircraft landing. Driving down a steep hill close to home I noticed a craft with an odd lighting formation. Its lights were different sizes forms and placement than standard commercial jets that were very common. It was also about half of the size of a jet. I pointed it out to Mark riding passenger. We both noticed that it was moving in the direction of other landing airplanes, but too slow for a commercial jet to stay up. I asked \"what is that?\" he said he didnt know. We were both very tense and drove for another 60 seconds before arriving home. there was a bright moon and sparse low clouds. I thought that moving in the car or maybe wind blowing the clouds created the illusion of floating. I got out of the car and got a better view of it and is was still in the same area! We were sure it wasnt an airplane and ran afraid toward the door. To confirm again that I wasnt seeing things, I stopped at the door before going in and focused on it in relation to the coulds for about 3 more seconds when it moved in the opposite direction. It was at this point that I got the best view of the lights. Unlike any aircraft I had ever seen, going up the side was a large thick red light that showed the side angled like a pyrimid with a flat top. convinced we ran inside and marveled over what we saw. we were amazed excited and scared. after 5 mins or so we peeked out the window and it was gone. I have since learned that Maury island is the location of the first UFO sighting in the 1940s so I thought my sighting may have more signifigance than a standard sighting so I felt I should report it. I dont have a sketch but would like to submit one soon. I have no pics or other physical evidence, but would love to know if Air traffic control or other pilots had any other evidence or testimony."],"Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=47.331052,+-122.308982(25353)&iwloc=A&hl=en\"> mufon case (25353) map </A>","Longitude":"-122.308982","Region":"Washington","City":"Federal Way","Date Submitted":"09/09/2010 08:35 UTC","Country":"United States","Object Shape":"Square, Rectagular, Other"}