{"trends":["There have been 5 other sightings in Peekskill","There were no other sightings in Peekskill on or around September 9th 2010"],"Country":"United States","Summary":"Starlight UFO in daytime, Eatern-Mid Hudson Valley, 6 to 7 AM from Taconic North.","Object Shape":"Star-like","divs":["sighting detailsdriving , going north on taconic, starting in millwood, weschester, starting the drive at 6am. at around the putnam\\westchester border i saw a bright, star-like object shimmering in the sunrise-lit sky. it was shimmering strongly, and it was low in the sky. it seemed to bright to and to low to be a star. due to twisting road,elevation changes, and tress, i lost sight. when returning to view (noted cloud on it's left, so knew where to look), it was gone. in putnam now, i had a clear view of sky. it seemed to appear in middle of view, where i knew it wasn't only seconds before. it was star-like, still, but not shimmering so much. big turn took it out of view. this object was in front of a cloud. dutchess. saw it again. it appeared when i turned a bend. it was in front of a small cloud. i saw it dim itself, hold a softer glow for a second, (or it went into the cloud), then it's light grew back to it's original brightness, then it either turned off it's light, dissapeared, or went behind the cloud. or a combination of those things. this is now 7:47, barely an hour since. i would like to say that i have seen similar things on this drive, always at the same time (sunrise). about 4 in 5 years. i got home with it on my mind. i turned the tv on and it was pre-set on \"investigation discovery\". it was airing a mufon investigation show of a philadelphia subburb. this meant to me that i should post this sighting. i have posted a sighting here once before. may i say btw, that your 'timezone' question on the form is the most redundant, inefficient, and annoying thing on for anyone who has to encounter it."],"Tags":"City","Region":"New York","Latitude":"41.295784","Weather Factors":"Unknown","Longitude":"-73.916806","Sighting Duration":"Undisclosed","Log Number":"US-09092010-0006","Date Submitted":"09/09/2010 07:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.295784,+-73.916806(25352)&iwloc=A&hl=en\"> mufon case (25352) map </A>","Object Flight Path":"Undisclosed","Date of the Event":"09/09/2010 06:25 UTC","Viewing Distance":"Unknown","Object Features":"Undisclosed","City":"Peekskill","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25352.html.txt","/var/www/straped/mufon/org/25352.html"],"Case Number":"25352","Source":"MUFON"}