{"Object Flight Path":"Straight-line path,Unknown","divs":["Sighting DetailsFirst, let me explain that this is an old experience, but one that I rememberwith absolute clarity as if it had happened only yesterday. Since the sightingincident, I have spent twenty years in the Air Force working at variousassignments involving operations and command and control of aircraft andsatellites. After my retirement in 1979, I worked with Lockheed Corporations,Ford Aerospace, and Martin Marietta as an engineer, or in a management capacityon various satellite programs and the Space Shuttle Program. After all theyears that have passed since the sighting and all my experience in the aerospaceindustry96 nothing has happened that would make my wife and I change my mind about thenature of what we saw that day.It was 1959 and in the month of March. My wife Pat and I had been married forthree months and both of us were barely over the age of eighteen. It was almostdusk and we were returning from a visit to a friends house to see the couple92s newly born baby. We were in South El Monte California. El Monte, at thetime was a small town of less than twenty thousand people located aboutseventeen miles east of the Los Angeles Civic Center along what is now I10. South El Monte was an area on the outskirts of El Monte proper that consisted ofmostly open fields, older homes and a few small farms. We were driving up PeckRoad with almost no other traffic around us. It was a clear day with verylittle cloud cover and the area street lights had not yet come on for the night. We first saw the vehicle moving slowly parallel to the road we were on andmoving in the same direction. It was very low, less than two hundred feet offthe ground and traveling over the power lines along the side of the road. Itwas circular in shape and about the size of a Boeing 707. The surface of thecraft was made of a dark metal that seemed to absorb all light and appeared tobe the flattest black imaginable. Around the saucer shape92s edge where white lights that flashed like sequential strobe lights. At thetop and center of the craft was a red light and in the same position on theunderside was a green light that remained constantly on. The lights, whilebright, did not reflect on the surface of the vehicle. At this time, we wereapproximately 50 yards from it and could hear no sound coming from it. Let meemphasize This was not just a strange light high in the sky, nor was it ablurred ball of light, or in any way organic. This was an actual, physicallyapparent vehicle obvious"],"Viewing Distance":"21-100 Feet","City":"El Monte","files":["/var/www/straped/mufon/html2text/2535.html.txt","/var/www/straped/mufon/org/2535.html"],"Weather Factors":"None, Unknown","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.068621,+-118.027567(2535)&iwloc=A&hl=en\"> mufon case (2535) map </A>","Sighting Duration":"00:10:00","Object Shape":"Disc","Summary":"Matte black saucer shaped craft with perimiter lig","Date of the Event":"02/28/1959 05:30 UTC","Latitude":"34.068621","Log Number":"","Disposition":"Unknown","Longitude":"-118.027567","trends":["There have been 7 other sightings in El Monte","There were no other sightings in El Monte on or around February 28th 1959"],"Case Number":"2535","Object Features":"Other","Country":"United States","Region":"California","Date Submitted":"02/28/1959 05:30 UTC"}