{"Source":"MUFON","Date Submitted":"09/10/2010 04:53 UTC","trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around September 8th 2010"],"Object Flight Path":"Straight-line path","Object Shape":"Fireball","Country":"United States","files":["/var/www/straped/mufon/html2text/25365.html.txt","/var/www/straped/mufon/org/25365.html"],"Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.28269,+-76.877038(25365)&iwloc=A&hl=en\"> mufon case (25365) map </A>","divs":["sighting detailsupon returning home that evening, my wife **(wit's name deleted--sgonzalez\\cms) described for me in detail an object she witnessed at approx. 10am et: she was seated outside in our yard reading the paper. sky was clear with few clouds. she was facing south and something caught her eye about 45 deg off the horizon, just above a tree in our front yard. the object, which she described as being like a meteor but bigger was moving on an approx. ne to sw track. duration was about 2 sec. color was described as brilliant white; no sound was heard. no trail was left behind. when asked to approximate object size at arms length **(wit's name deleted__ sgonzalez\\cms) referenced an \"o\" shape made by thumb and index finger (approx. 1\"). using arms length reference for distance travelled she held her arms approx 12\" apart. **(wit's name deleted--sgonzalez\\cms) and i frequently sit outside at night seek out meteors during heavy shower activity (such as the perseids, which peak around her birthday) thus viewing them is a regular occurence for her. she feels the motion of this object was not unusual in comparison to average night meteor observations but the evident diameter of the object was much larger. for this reason (size) we felt it merited reporting. (prior to submission, i have checked cms data for entire us with no similar reports having been received for 9\\8\\10 as of 9\\10\\10, 4:50pm et) ***wit's name deleted--sgonzalez\\cms."],"Viewing Distance":"Unknown","Summary":"Was likely rare daylight meteor - *Wit info deleted--SGonzalez/CMS.","Case Number":"25365","Object Features":"Undisclosed","Log Number":"US-09102010-0008","Latitude":"40.28269","Sighting Duration":"Undisclosed","Disposition":"IFO","Tags":"City","Longitude":"-76.877038","Weather Factors":"None","Date of the Event":"09/08/2010 12:00 UTC","City":"Harrisburg"}