{"Country":"United States","Weather Factors":"None","Log Number":"US-09102010-0006","Object Shape":"Star-like, Unknown","trends":["There have been 6 other sightings in Brick","There were no other sightings in Brick on or around October 15th 2008","This sighting has never been favorited.",""],"Summary":"Object moved very very very slow horizontal across sky.","Viewing Distance":"Unknown","Tags":"City","Region":"New Jersey","Disposition":"Unknown","Case Number":"25363","Sighting Duration":"03:00:00","divs":["Sighting DetailsEither on October 14 or 15, 2008, I took these pictures. I can not recall date but moon was full or near full that night. My camera is a Kodak Easy Share Z650 with 10X zoom. These pictures were taken in Brick, NJ at Vets Elementary School. At the time my daughters were cheerleading during a pop warner football game. In two of the pictures the ball of light, are lights for the football field. I took many pictures but only kept four. Many pictures came out blurry like picture three. At the time object looked like very very very very slow moving star, but it appeared to be at a close distance. Object first seen about 6:00 PM and object was still in area three hours later. Went home from game about 8:00 PM. Last looked at object about 9:00 PM from home. The camera I have can not combined night and sport functions. When enlarging with my camera I could not really tell what was in picture? My home is less than one mile from field and US Naval Base Earl is near our home (not sure of distance to base). If you have any ideas what is in picture, could you let me know one way or the other. Thank you for your time and possible interest."],"Date Submitted":"09/10/2010 01:55 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.066356,+-74.104016(25363)&iwloc=A&hl=en\"> mufon case (25363) map </A>","files":["/var/www/straped/mufon/html2text/25363.html.txt","/var/www/straped/mufon/more/25363_submitter_file1__100_1383.JPG","/var/www/straped/mufon/more/25363_submitter_file2__100_1384.JPG","/var/www/straped/mufon/more/25363_submitter_file3__100_1385.JPG","/var/www/straped/mufon/org/25363.html"],"City":"Brick","Date of the Event":"10/15/2008 06:00 UTC","Latitude":"40.066356","Longitude":"-74.104016","Object Features":"Wings, Unknown"}