{"Source":"MUFON","Date of the Event":"09/10/2010 02:10 UTC","divs":["Sighting DetailsI went outside for a smoke, and noticed a grouping of dim star-like objects that appeared to resemble, at that time, a condensed version of the big dipper. As I stared at it more, I noticed the flashes that were given off by the objects. Perhaps, I thought, this was atmospheric hazing and poor vision, but with more and more observation, I undoubtedly saw red and green flashes at uneven intervals. I was able to nullify the effects of any light pollution by holding my jacket up to block any ground based light. It became more apparent that many of the flashes were weaving around each other, and sometimes visibly accelerating away and out of sight. The flashes were also able to make hairpin turns, and it seemed like there was a game of tag being played. I have no frame of reference to how high up the flashes were, but in regards to an EXTREMELY clear night, they seemed a little dimmer than most stars you can only see on EXTREMELY clear nights. I would speculate on there being between 5 and 9 of these flashes, and they clearly moved around a slightly brighter and slightly bigger flash. I will be clear when I say that there were red and green flashes. In order for others to get an idea where in the sky this was, I will attempt to describe it in a very rudimentary way. I was standing looking due east. Let's say looking straight up is 12 o'clock, and looking towards the horizon is 3 o'clock... these craft were flying at barely 1 o'clock. I had no feelings toward seeing the craft, besides being certain that what I had seen were no stars or satellites. The only reason that I left the flashes was because there seemed to be no end to the maneuvers, I grew weary of straining my eyes, and I expected nothing more to happen besides the eventual cessation of activity."],"Object Features":"Undisclosed","Country":"United States","Longitude":"-84.765284","map":"<A HREF = \"http://maps.google.com/maps?q=43.604018,+-84.765284(25360)&iwloc=A&hl=en\"> mufon case (25360) map </A>","files":["/var/www/straped/mufon/html2text/25360.html.txt","/var/www/straped/mufon/org/25360.html"],"Date Submitted":"09/10/2010 02:45 UTC","Case Number":"25360","Object Shape":"Flash, Star-like","trends":["There have been 11 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around September 10th 2010"],"Latitude":"43.604018","Region":"Michigan","Weather Factors":"Unknown","Log Number":"US-09102010-0003","Summary":"Many flashes circling and departing central star-like object.","Disposition":"Unknown","City":"Mt Pleasant","Sighting Duration":"00:10:00","Object Flight Path":"Path with directional change","Tags":"City","Viewing Distance":"Unknown"}