{"Case Number":"25368","Weather Factors":"Windy, Light","trends":["There have been 11 other sightings in Key West","There were no other sightings in Key West on or around September 7th 2010"],"Region":"Florida","Date Submitted":"09/10/2010 10:02 UTC","Object Flight Path":"Stationary","Object Features":"Patterned Surface","City":"Key West","map":"<A HREF = \"http://maps.google.com/maps?q=24.563292,+-81.774531(25368)&iwloc=A&hl=en\"> mufon case (25368) map </A>","Source":"MUFON","Object Shape":"Oval","Country":"United States","Disposition":"Insufficient Data","divs":["Sighting DetailsShortly before 9am on September 7, 2010 one mile offshore north of Key West, Florida proper I witnessed a dark and indistinct object about four fingers (7-10 degrees) above the eastern horizon. I was seated inside my boat looking through the windows which wrap 270 degrees around the salon. A minute or two later I glanced back in the same direction taking note the object had not changed its spacial relationship to a stratus cloud low in the sky in that direction. Wind was calm and the few clouds in the air were moving very slowly. With regard to the geometry and the hight of stratus clouds and the apparent hight of the cloud and the object above the horizon, this suggested the object was either stationary or drifting in the wind at a similar hight as the stratus cloud in front of which it lied. It further suggested the object was less than a mile high and less then 10 miles from my location. It was indistinct further suggesting it was more than 3 miles away and therefore, at an altitude of more than 1,500 feet. Both area airports are located such that airplanes do not normally travel at that altitude and from that direction toward my location. Airplanes coming from the east, fly cross my view. Helicopters who remain that high in the sky have few reasons to hover. The unusually long duration of motionlessness suggested something interesting. For these reasons, I fetched binoculars and stepped outside. The object which I had seen from inside the boat and with out binoculars was also visible outside the boat. The view through the binoculars provided a much more detailed view of the object, consistent with an object more than 5 miles distant, but less then 10. The object had a distinct edge, no helicopter blades, and no wings. The object was slightly ellipsoid, nearly circular and grey in color with a contrasting shade of grey horizontal band one fourth its hight and located above the object's horizontal center. I continued to observe the object through the binoculars for more than five minutes. Occasionally glancing with out the binoculars. The object remained unchanged for the whole time of my observation. It did not move with respect to the clouds which were also not moving with respect to the ground for the period of observation. The object did not become smaller or larger and its visual definition did not increase nor decrease. I decided to climb to the fly deck where I could take a seat to continue my observation. The climb and taking a seat took less than a minute, I then scanned the sky around the stratus cloud which was behind the object. I could not find the dark object with my unaided eye. I scanned farther in both directions and higher in the sky and with the binoculars but was unable to identify any unusual object."],"Date of the Event":"09/07/2010 08:45 UTC","Sighting Duration":"00:10:00","Latitude":"24.563292","Log Number":"US-09102010-0011","Viewing Distance":"Over One Mile","Tags":"City","Longitude":"-81.774531","files":["/var/www/straped/mufon/html2text/25368.html.txt","/var/www/straped/mufon/org/25368.html"],"Summary":"Observed through binoculars, at a distance of 3 to 8 miles, a distinctly edged ellipsoid with a distinct and dark band."}