{"Case Number":"2537","Weather Factors":"Windy, Rain","files":["/var/www/straped/mufon/html2text/2537.html.txt","/var/www/straped/mufon/org/2537.html"],"divs":["Sighting DetailsAt 120 am Sept 15, 2003Driving Hwy 2 South 30 KM north from Airdre, Alberta Canada.Seen Ojbject depart from ground appoximately at an 25degree angle... thought itwas an airplane. Very bright colour gold crystal shiny bright light... likelooking directly into the sun. The ojbect stop then went 90 degrees west in aflash.. and stopped. I was personally scared... That is when I pulled over tothe side of the highway to watch the lights. Appox. 7 other cars and two semispulled over to watch this light as well. 2 north bound vehicals and 5 southboundvehicals stopped and pulled over. Hovered for over 20 minutes... Made only twomovements in the twenty minutes. left to right to right left. Never did losesight of the object. Watch for 12 hour as it flashed like a dimond or a brightflag . Lights spakled. Was too scared to leave my vehical to talk to otherwitness. Finally, My gut instinct told me to leave. The object was eitherdirecting or looking for something. Light flashshed in direct spots. Only onecolour. Very pretty colour and pure. There really are no any words to descripthe colour. I was embarressed and scared. I called the RCMP royal canadainmountain police to see if anyone called regarding an object in the sky.than I left. So far Ive come up with possible answers... a natural gas flare,In the old days they would use a bow and arrow to light a gas flare And or somenew technology of fire cracker. It wasnt something that flashed thandisappreared. It was a very pretty colour and was int he sky for a long time."],"Latitude":"53.933271","Log Number":"","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Longitude":"-116.576504","map":"<A HREF = \"http://maps.google.com/maps?q=53.933271,+-116.576504(2537)&iwloc=A&hl=en\"> mufon case (2537) map </A>","City":"30 KM North of airdre, Al","Country":"Canada","Date Submitted":"10/15/2003 12:00 UTC","Date of the Event":"10/15/2003 12:00 UTC","Summary":"dimond in the sky","Region":"Alberta","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:30:00","Source":"MUFON","Tags":"City","trends":["There have been no other sightings in 30 KM North of airdre, Al","This sighting has never been favorited."],"Object Shape":"Diamond","Disposition":"Unresolved"}