{"Date Submitted":"09/11/2010 08:45 UTC","Log Number":"US-09112010-0005","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around September 11th 2010"],"Date of the Event":"09/11/2010 03:15 UTC","City":"Glendale","Country":"United States","Longitude":"-112.179487","Viewing Distance":"Unknown","Weather Factors":"None, Does Not Apply","Object Features":"None, Unknown","Tags":"City","Object Shape":"Circle, Flash, Star-like","Disposition":"Unknown","Latitude":"33.547952","Source":"MUFON","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Summary":"Pinpoint of light resembling a star appeared from nowhere, thought it was an airplane on approach until it stopped moving and disappeared.","Region":"Arizona","divs":["Sighting DetailsI really don't know what I saw but I know it gave me chills! I've never given much credit to eyewitness accounts until I experienced this myself. Anyone who's anyone can distinguish an airplane or a helicopter at night...unless it's military you're going to see red and green lights and a flashing beacon light. Living in the west valley of Phoenix you can often look towards the Scottsdale area and see the bright landing lights of planes on approach to Sky Harbor. When I first saw this object it occurred to me that this might be what I was looking at. I'm not up on all of the scientific terms to describe the object's initial location so I will do my best using constellations, approximate angles to the ground, and \"clock\" angles. The following is what I witnessed. At about 3:15 am, which is about 2.5 hours ago right now, on Saturday, September 11, 2010 I stepped outside to have a smoke before going to bed. Our back patio faces to the north. We are approximately 2 miles southwest of Westgate City Center, University of Phoenix Stadium, and Jobing.com Arena. As I usually do when I'm outside at night I look to the sky star gazing and looking for the occasional shooting star. So as I'm turned slightly to the northeast I see a little pinpoint of light appear that was red in color and moving in a southeasterly direction...towards the airport. To put it in perspective the North Star was directly out our back door, roughly 30-35 degrees above the horizon with Cassiopeia slightly higher and to the west. The object was probably between 35 & 40 degrees above the horizon and at about the 1 o'clock position relative to the North Star. It was moving somewhat slowly but it seemed too far away to be on approach. Approximately a minute after I noticed it the red pinpoint was gone and in its place a slightly larger white light. At this point I'm thinking it must be a plane on approach and it only looked far away because it's a little 2 seat Cessna. It didn't take me long to change my mind as only a few seconds later the white light shrunk back to the red pinpoint. The object cycled from red pinpoint to white light several times, I want to say in 10-15 second intervals, as it continued moving in the same direction. Now I have no idea what to make of it. I thought there might be a possibility it was a satellite catching sunlight and reflecting it. However, I have witnessed satellites before as well as the shuttle and space station flying over when I lived back in Michigan. Satellites travel at tremendous speeds and traverse large areas of sky quickly, while this thing still hadn't made it to 3 o'clock position relative to the North Star. Again, my mind was changed...about 5 minutes after I first noticed the object it reverted back to a red pinpoint and stopped moving. It just sat there stationary like that for about 2 minutes when all of a sudden it turned to the white light again and continued moving. It went through I want to say 4 red and white cycles when it stopped again. This time it stayed stationary for a minute but it continued with the light cycles. After that minute passed it began to move back towards where I initially saw it! Right about at this point I'm thinking that perhaps it was a helicopter due to the starting and stopping as well as the possibility that the white light was a search light. The only thing that didn't make sense about this theory was that there was no beam reflecting on dust particles in the air and the white light was not independent of the entire objects movement...meaning it didn't appear that it could be positioned to shine backwards, it was fixed and moving as one with the red light. Eventually, it stopped moving again and stayed white for almost a full minute. When it turned to the red pinpoint again it continued moving for about 30 seconds, stopped, and then just seemed to fade out and vanish. This vanishing part is what convinced me to write this, I am positive that it was not a satellite or an aircraft that I am aware of! Unfortunately, I have no pictures or evidence, only my eyewitness account. If any part of me was skeptical before it's not anymore...I have no clue what I was observing for about 10 minutes!"],"Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/25376.html.txt","/var/www/straped/mufon/org/25376.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.547952,+-112.179487(25376)&iwloc=A&hl=en\"> mufon case (25376) map </A>","Case Number":"25376"}