{"Case Number":"25371","Longitude":"-87.670031","trends":["There have been 7 other sightings in Florence","There were no other sightings in Florence on or around September 10th 2010"],"Date Submitted":"09/11/2010 12:38 UTC","Latitude":"34.80285","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["Sighting DetailsI live in Sheffield, Alabama, and I've been seeing these things for quite awhile, but have only recently come to be alarmed. Every time I ever saw it, I thought it was Venus - probably because when it first started to appear, it matched up with Venus on my Google Sky Map. It always appears just very slightly south of the western sky at dusk and travels in an easterly direction. But don't get me wrong, it goes up and down and backwards and forwards the whole time...veeeeerrryy slowly. With no sound that I can hear, yet it has only been close enough to hear once, and then there was no sound either - I know because an airplane passed right before I saw it in the same place, and I heard the airplane loud and clear. One night I watched it for 30 minutes thinking it was coming toward me, but it ended up fading away, and I assumed it was heading the opposite direction. Later on, I started watching it with the binoculars, and that's when I noticed that it was flashing. It did NOT look like anything natural. After I witnessed the flashing for the first time, I seemed to notice the flashing more often, even without the binoculars. In the past couple months or so, I had gotten really involved in ufology and such, and they seem to be drawn to me now, which is terrifying, so I don't want anything to do with any of it anymore. Basically, 3 nights ago, I saw one flying by close enough to make out that it wasn't a plane, because a plane flew by right before I saw it. I actually tried talking to it with my mind, asking it to power up, (believe me, I know how weird it sounds) but to my disbelief, it actually started strobing HARD right before it disappeared behind the trees - almost like when a police car flashes its lights. I went inside and set the alarm, and when I hit the last button, a light behind me in the house flashed and I heard what sounded like a power surge. My whole body felt like it was electrified, and every hair stood up - this was the first paranormal experience I ever had. Later that night I had one of the realest dreams I've ever had that I was abducted, and when I woke up, I couldn't go back to sleep because I was so terrified. The next night, I saw it sitting in it's normal location when it first appears, and noticed that it WAS DEFINITELY coming towards me - so much so that I was so terrified of what I might see, I had to get up and go inside because I started having a panic attack and got nauseous. It was really strange. Later that night I had another dream that I saw like a mothership-like craft, which was also really unsettling, yet not as much so as the abduction dream. And by the way, all day this day and the day before I heard planes overhead CONSTANTLY, yet only saw one. Tonight, I watched it sit in its usual location and strobe like crazy. It came a little closer and then started to drop down behind my neighbor's house and fade out a bit. Later tonight, I went back outside, and it was in a completely different part of the sky, still strobing like crazy - red, blue, green, and white. This time, I also witnessed 3 tiny separate single strobe flashes in separate intervals, right after one another which seemed to be away from the craft and move in a counter-clockwise L shape going up to the craft - only 3 - flash, flash, flash, gone - but the craft was still there strobing crazily. I went so far as to ask my neighbor, who witnessed the same thing as well as my best friend who was in a neighboring town who could also see exactly what I was seeing. Neither could explain it. I also went so far as to call the local police station to report it and ask if anyone else had reported it, but they said no & they would walk outside and look. I also tried to call the local newspaper, but it was too late and they were closed. I'm really scared at this point, because I KNOW this is NOT NORMAL, and I just don't want to see it anymore. I just feel like it's watching me or something, and I just want to be left alone. Especially the bad dreams are the worst. If I have another dream tonight, I don't know what I'll do. I don't like it. There have been so many cases of this that obviously our government has to know, or either they are just completely retarded. I just don't like being kept out of the loop, and if there is something that I don't know that I don't even want to know, just please stop flashing it in my effing face every single night. I'm just tired of feeling like I'm going insane, because this is just getting ridiculous. Please explain to me what I am seeing. What is the most likely explanation? IS there one? Please get back to me as soon as possible, because I'm not really comfortable with this stuff anymore - I've given up all research on ufology and exopolitics because I just want things to go back to normal, but these things keep appearing EVERY single night. Sometimes I wish the air force would send jets and just shoot it down, but I feel like nobody knows it's even there except for my friend and neighbor who I personally made aware of it. Please help!"],"Tags":"City","Object Flight Path":"Path with directional change","Log Number":"US-09112010-0001","Summary":"Flashing strobe-like light (white, red, blue, green), happens EVERY night in western sky.","files":["/var/www/straped/mufon/html2text/25371.html.txt","/var/www/straped/mufon/org/25371.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.80285,+-87.670031(25371)&iwloc=A&hl=en\"> mufon case (25371) map </A>","Region":"Alabama","Object Shape":"Flash, Star-like","Weather Factors":"None","Country":"United States","Object Features":"Unknown","Sighting Duration":"01:00:00","City":"Florence","Date of the Event":"09/10/2010 12:00 UTC"}