{"Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=43.771251,+-103.591696(25374)&iwloc=A&hl=en\"> mufon case (25374) map </A>","Log Number":"US-09112010-0003","Object Shape":"Star-like, Other","Case Number":"25374","Date of the Event":"07/30/2010 04:30 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-103.591696","Date Submitted":"09/11/2010 03:57 UTC","Object Features":"Unknown","Weather Factors":"Does Not Apply","Tags":"City","Object Flight Path":"Hovering then path","Region":"South Dakota","City":"Custer","Country":"United States","divs":["Sighting DetailsLess than a wk. after the night sighting I have just reported (which did not have a witness other than myself, but another tenant in the apartment house I live in saw this one) there appeared out of the cloudless blue sky an object that seemed to be about fifty yards in front of us and about thirty-five ft. up. I was sitting on the ground level front porch out front. There was no sound that I could hear from the object. My estimation at its size could be very wrong, as I think it had a depth or length to it that I could not see beyond the front of it. It looked to be about twelve feet wide. It looked like there was silver fire about a foot and a half long shooting out from it all across it. Like I said in the description above, like the 'sparks' of sparklers, only a foot and a half in length, and much much larger generally, and all across what I thought then was the front of it, as the object was moving towards me. When I, rarely, see a UFO I try to see what there is about it that could be explainable as something mundane, and I did so with this, thinking, could it be some kinds of lights that I'm seeing, but it was obvious that it was some kind of, not flames, but flame or huge sparkler-like 'flames' coming from it. It came down at a slight, straight angle in my direction, though still fifty yards or so away, at the most, then it went sharply to its right and up. I began to go into the apartment house to get my camera, but after a few quick steps I thought, it'll probably be gone by the time I can get my camera, and I saw from my second-story window that it had gone. My reactions was amazement at such an unusual thing, and too, the 'flames' that were most of what I saw could have been on any side of it, I couldn't tell from which side or if from only one side, as they were towards me, from where I saw it, both when it was moving towards where I was and when it was ascending towards the side of where it had been. For a couple of seconds I thought I could see metal, silvery metal above and in back of where the 'flames' were, a foot or two in back of them and less than a foot 'above' the huge, sparkler-like 'flames.' It seemed very much an object that was there, and I feel sure it was, but there certainly was what seemed like a strangeness to it, probably because I had never seen anything like it. I think too, the way it appeared fairly near me and descended as it moved a bit closer, that it may have been checking me out, perhaps because of the sighting I had a few days earlier. I didn't really have a feeling about that, but it was something I was thinking a little later. In spite of the objects 'unusualness,' I was much less excited about it, though glad I saw it, than about the earlier sighting, but the guy sitting on the porch with me was very excited, to put it mildly. Excuse the long report. I guess I could make this report much briefer, but now that I have it, and exactly as it was, I will leave it."],"files":["/var/www/straped/mufon/html2text/25374.html.txt","/var/www/straped/mufon/org/25374.html"],"trends":["There have been 2 other sightings in Custer","There were no other sightings in Custer on or around July 30th 2010"],"Disposition":"Unknown","Latitude":"43.771251","Summary":"A bar of 'lights' in the air that were like sparklers' silver fire appeared about fifty yards away for about a minute or two."}