{"Latitude":"43.776621","Viewing Distance":"101-500 Feet","Date of the Event":"07/23/2010 09:30 UTC","Longitude":"-103.590916","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Custer","There were no other sightings in Custer on or around July 23rd 2010"],"Log Number":"US-09112010-0003","Object Features":"None","Sighting Duration":"00:05:00","Summary":"A 'star' crossed the sky and stopped about a thousand ft. up and \"signaled \" to me when I asked it to.","Region":"South Dakota","Case Number":"25373","files":["/var/www/straped/mufon/html2text/25373.html.txt","/var/www/straped/mufon/org/25373.html"],"divs":["Sighting DetailsI went outside for some cool fresh air for a few minutes, as I usually do once or twice in the evening. I also usually look up at the stars, the moon and any visible planets just to see them. As soon as I looked up this evening I noticed two stars 'close' together in the west, but the reddish-white one, at a much lower altitude, began moving fairly quickly, but at a steady rate, in my general direction. It was going much too slow for a satellite and much too fast for a plane. I could not hear any sound associated with it at any time. When it got to what I think was about 900-1000 ft. above me, and only about 50 ft. away horizontally, it stopped. It was there about four seconds when I thought to say, and did say, but not aloud, \"Please signal me if I am communicating with you.\" By \"you\" I meant any occupants of course. In a second the 'star' 'morphed' into a light-brown form six times the size of the star shape. The 'star' was no longer visible. The form was perfectly clear and with no lights on it. Perhaps it was lit from inside, though it did not have a transparent look about it. It was a basically round form, but not exactly spherical, it was longer and wider and round where it seemed to go out from where the 'star' had been, but more pointed at the other end. The form looked as if it had, or was of some kind of texture, rather than plastic or whatever. It stayed in that shape for about two seconds at the most, then was the star shape again. A few seconds later it began to move east again. It disappeared a little more than half-way through the eastern part of the sky. There were some clouds in that part of the sky, though they were barely visible. It was a fairly dark sky except for the stars in the western part of the sky at that time of night. The UFO might have gone behind a cloud, though I don't know that. When the UFO, for lack of a better name for it, as that is what it was technically and perhaps in the general use of the term, I don't know what else it could have been, but when it responded, if it was responding, to my request to it that it respond to me, I became fairly excited. It may be 'amateurish' to think and say so, but at the time and even more so later, I did become pretty damn excited about it -- though I didn't quit looking at it or jump up and down when I saw it do as it did. I did feel good about the fairly certain assumption that it had responded, especially for a couple of days after, and I still think it was neat that it or they appeared to do so."],"Tags":"City","Source":"MUFON","City":"Custer","Object Shape":"Star-like, Unknown","Object Flight Path":"Path with directional change","Date Submitted":"09/11/2010 02:22 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.776621,+-103.590916(25373)&iwloc=A&hl=en\"> mufon case (25373) map </A>","Country":"United States"}