{"Object Features":"None","Source":"MUFON","Object Flight Path":"Straight-line path","Latitude":"-29.850016","Region":"KwaZulu-Natal","Viewing Distance":"Unknown","City":"Durban","Weather Factors":"Windy, Light","trends":["There have been 4 other sightings in Durban","There were no other sightings in Durban on or around September 11th 2010"],"Country":"South Africa","files":["/var/www/straped/mufon/html2text/25378.html.txt","/var/www/straped/mufon/org/25378.html"],"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=-29.850016,+31.033061(25378)&iwloc=A&hl=en\"> mufon case (25378) map </A>","Disposition":"Unresolved","Date of the Event":"09/11/2010 03:57 UTC","Summary":"Triangular luminescent green with bright white lights at each corner.","Tags":"City","Longitude":"31.033061","Log Number":"ZA-09112010-0008","divs":["Sighting DetailsI was watching the daytime, 11th September 2010, occultation of Venus by the Moon from Durban, South Africa when the sighting occurred. It was overcast all morning and there was cloud when the occultation started at 14h43 local time. By 15h57 when Venus reappeared the Moon and Venus were clearly visible through my 8x32 binoculars. While scanning for the crescent Moon I saw just slightly east of the Moon a luminescent green, triangular object with bright star-like lights at each corner, almost directly overhead. It was somewhat smaller than the Moon. The object then slowly moved off in a southerly direction and disappeared after two or three minutes when I tried to view it with the naked eye. I couldn't see it without the binoculars. The distinctive green first caught my attention and distracted me from the Moon. My initial thought was that it was a microlight but on reflection it seemed far too high and I heard no sound. Not expecting anything else I was somewhat surprised at the sighting. After I lost sight of it I felt a little incredulous and yet disappointed that it had gone before I could track it further. Unfortunately I was alone at the time so had no one to verify it for me."],"Case Number":"25378","Sighting Duration":"00:03:00","Date Submitted":"09/11/2010 11:39 UTC"}