{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date of the Event":"09/11/2010 12:00 UTC","Date Submitted":"09/12/2010 01:15 UTC","files":["/var/www/straped/mufon/html2text/25388.html.txt","/var/www/straped/mufon/org/25388.html"],"City":"Beaverton","Object Features":"Undisclosed","Country":"United States","Summary":"Bright object hovers, then makes quick manuevers towards the ground.","Longitude":"-122.79588","trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around September 11th 2010"],"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-09122010-0005","Case Number":"25388","Latitude":"45.495562","Object Shape":"Cigar, Disc","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsComing home around 10pm on farmington road in beaverton my wife and kid and I were driving in the car when i noticed what at first i thought was a very low flying airplane until i noticed there was no blinking lights on it and it was sitting stationary over the road. I pointed it out to my wife. It was right in front of me so i was able to watch it while i was driving. The first thing i noticed was how bright it was, it was bright white. It swooped straight up in the air then the light would dim, the whole thing would dim out so all i could see was the dark outline of the craft lightly illuminated. Then it would get bright again and move straight up then sideways. My wife was watching it at one point and said \"oh my god i think its going to crash its coming right at us\" at that point i was busy trying to keep my eyes on the road because there was alot of traffic so i didnt see what it did at that point. When i looked up i saw it dim again then take off at a pretty fast speed towards the hills. We then lost sight of it. There was no way it was a plane, it was such a close sighting if it was a helicopter with a search light i would have heard it and like i said i saw it close up and from multiple positions there were no blinking lights at all on it. I guess what impressed us both the most was how it flew through the air going straight up and straight down and sideways and the way it went from completely bright white to no light within seconds. I wish it would have been during the day at that range i would have been able to see the craft that was a close sighting. I asked my wife later that night what she meant by \"its coming right at us\" and she said it swooped down and was coming right for us at one point then swooped back up into the air."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.495562,+-122.79588(25388)&iwloc=A&hl=en\"> mufon case (25388) map </A>","Region":"Oregon","Weather Factors":"Unknown"}