{"Object Features":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=25.666034,+-80.357827(2538)&iwloc=A&hl=en\"> mufon case (2538) map </A>","Tags":"City","Summary":"Triangular ufo in conjunction with near silent pla","Date Submitted":"11/30/2002 12:00 UTC","divs":["Sighting DetailsA foul odor eminating from the above apartment was keeping me awakeI was facing my computer when I heard a whispering sound. I opened the door tosee what it was and a gray non fighter aircraftlarger than a fighter flew overmy two story apartment at an altitude such that if I were standing on the roof Iwould have been struck by the plane. It made no more than a whisper. I sat outunder a tree it was late at night at the lakeside XII apartment complex and Iheard jet aircraft and I saw in the sky a large aircraft high in the sky with awing formation like a B-52. A few minuetes later a dark blue black triangularshaped craft appeared to my right flying at very low altitude - as I looked fromthe stern it flashed lights at me in a manner pardon the comparison reminicentof Close Encounters of the Third Kind. Note which may be taken with skepticismfor the past few years I have been involuntary involved in what I suspect is aninformationdisinformation campaign involving MJ-12 and my status as a mindcontrolled intelligence operative drafted into the service if what I have beentold by telepathy is true of the US Navy at the rank of Ensign and MAJIC-12. Idid meet NSA director W.E. Odom prior to the active phase of the operation and Igraduated from Yale College in 1998. Thank You for Your Patience -- I realizethis sounds quite odd."],"Viewing Distance":"21-100 Feet","Latitude":"25.666034","City":"Kendall","Source":"MUFON","Weather Factors":"Unknown","Case Number":"2538","Country":"United States","Object Shape":"Triangle","Region":"Florida","trends":["There have been 9 other sightings in Kendall","There were no other sightings in Kendall on or around November 30th 2002"],"Log Number":"","files":["/var/www/straped/mufon/html2text/2538.html.txt","/var/www/straped/mufon/org/2538.html"],"Sighting Duration":"00:00:59","Object Flight Path":"Straight-line path","Longitude":"-80.357827","Date of the Event":"11/30/2002 12:00 UTC"}