{"Object Shape":"Flash, Star-like","Summary":"Unidentified flying object.","Object Flight Path":"Hovering then path,Path with directional change,Other","files":["/var/www/straped/mufon/html2text/25386.html.txt","/var/www/straped/mufon/org/25386.html"],"divs":["Sighting DetailsIt was around August 7th 2010, here in Algeria, I am a Canadian and recently married to an Algerian, and this month has been the month of Ramadan so we are up all night, have coffee from 3-4am and then sleep most of the day. Our house is set high in the mountains overlooking the Mediteranean sea. Ramadan just ended September 10th, and during this period up until yesterday I, my husband and my sister-in-law are seeing something unexplainable appearing sporatically but the first time around 3:21 am. My husband and I were just looking at the sky, and talking, and my husband first noticed it, and said \"see there is something there\", and I looked to the west and saw this big white light, and it pulsed on and off, it appeared to be moving but floating like, it turned on a consistent white light, moved, then it turned off so it was completely unseen, and then it appeared again, in a different spot, doing the same thing, about 10 times, in the same area of the sky, with no other lights, no color, no sound, it was bigger then a star, and then it just stopped and disappeared, like as soon as it noticed we were watching it or something, and then it did not reappear that night. We outruled a plane, as I say, its not moving in a straight flying pattern, its eratic, and satellites apparently do not turn on and off like a light bulb. So the next night I watched and it appeared around 2 am, (again satellites apparently can't be seen at that time) directly in front of my door, far left SW of the little dipper, doing the same thing, and I watched it disappear and 5 minutes later it was back, in a different spot, the same size and brightness, no identifiable anything, other then being a circle of white light. it continued to do this off and on til after 4am, and I called my husband to see it, but as soon as he got to the door, it would stop. I didn't see it again for 4 days, and then again around 3 am I saw it, again my husband came to see and it stopped and just disappeared in a clear sky, it only flashed about 3 times. We both agreed we don't know what it is, and my sister in law came over and spent the night with me from the 6th of September on because my husband works in the Sahara, and on the 9th of September, again around 2 am, I saw it, in the same vacinity of the sky, turn on and off once, no strobing light at all, I called my sister to look, and it appeared closer, and did the same thing, flashed twice on and off very slowly, with seconds in between, the flashes are slow and then next thing it just is gone right before our eyes. A few nights later I saw it again, around 3 am, it flashed twice in different spots and when I called my sister, she came and it was gone. Last night September llth, 2010, it was 8:30 pm, the first time I have seen it that early, it did the same thing, in the same area, it turned on, and then its on for a few seconds, then it turned off, far left W to the little dipper, I called my sister to see, and she saw it with me, turn on once, in a different spot SE, diagonal from where it was, and then just vanish, again in a clear sky, all of these sightings. If it was a plane surely you watch it leave, planes have colored strobing flashing lights consistently, and makes a noise, and once they leave they don't just appear back, like appear, go, then come back bright as if it never left? This thing just turns on with consistent white light, and turns off with consistent darkness, one minute its moving the next it is in the same spot, the next it is gone, and the next it is back bright and in a different part of the sky within the same vicinity, disappearing at different times. I have not been able to photgraph it, its too far away for my phone to pick it up, but other people have seen it, though no one knows what it is. I am sure I will see it at some point again tonight, and frankly I wonder why me and what is this friggin' thing."],"Country":"Algeria","Source":"MUFON","Latitude":"36.988842","Object Features":"None","Weather Factors":"None","Log Number":"DZ-09122010-0003","Longitude":"6.458244","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Zitouna","There were no other sightings in Zitouna on or around August 7th 2010"],"Region":"Skikda","Date of the Event":"08/07/2010 03:21 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.988842,+6.458244(25386)&iwloc=A&hl=en\"> mufon case (25386) map </A>","City":"Zitouna","Date Submitted":"09/12/2010 11:22 UTC","Tags":"City","Case Number":"25386","Viewing Distance":"Unknown","Disposition":"Unresolved"}