{"Disposition":"Unknown","Weather Factors":"None","Country":"United States","Log Number":"US-09112010-0013","Longitude":"-120.447007","Case Number":"25383","Viewing Distance":"Unknown","Tags":"City","City":"Firebaugh","Region":"California","Date Submitted":"09/11/2010 10:39 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","Object Shape":"Cigar","Summary":"We observed 3 UFOs the night a Russian misfired missile passed over Mendota, Ca, my home town.","files":["/var/www/straped/mufon/html2text/25383.html.txt","/var/www/straped/mufon/org/25383.html"],"divs":["Sighting DetailsThat night we knew a misfired russian missle was to pass over California. A fear that it would crash onto one of the cities was frightening. My mother, ever practical, herded us outside. When we asked why, she simply said,\" If it crashes here, we'll see it, die together.\" While looking for the missile, we heard the radio tell us step by step where the missle was. When it was close to us mom had us look towards the north, and sure enough, we were relieved when it passed over. Later that night, time unknown, we were still looking up at night sky when someone said look at this. I don't remember who said it. The sky had 3 cigar shaped ufos. We thought they were blimps at first, but you could tell they had nothing above them. We moved over to the dark side of our home to get a better look. We had not heard about ufos, so there was no fear, just wonderment. The crafts made sharp turns and was quiet, no noise. The front and back ends were shaped like a helicopter window, but larger. There were windows around the entire crafts. We saw people looking out and moving about the ships. We could not see any details because all the windows were green. Looking at these soundless, right angle moving crafts is all I remember. We were amazed no one saw them, it was right at the time of packing season, and trains, trucks and even people talking could be heard. The sheds were 2 blocks from our old home. a side note: I'm the oldest of four, I was anywhere of ten to thirteen when this happened, my siblings are 4 to 7 years younger than I and remember smaller crafts coming out of the bigger crafts. I do not, neither does my mom. We did not forget the incident the following day, in fact it's all we talked about. We never felt fear, we just want to know is why were they there. Many sightings over the years have proven that Mendota, Ca. is ufo popular. I say this because we had a teacher who had worked at NASA, told us the hills, close by were a perfect place for a secret base. Many unexplained sightings have been said to fly towards those same hills. The question is, Why would ufos be interested in a missile that could possibly hurt many people."],"Date of the Event":"07/20/1967 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"36.860768","trends":["There have been 3 other sightings in Firebaugh","There were no other sightings in Firebaugh on or around July 20th 1967"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.860768,+-120.447007(25383)&iwloc=A&hl=en\"> mufon case (25383) map </A>","Object Features":"Dome"}