{"Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25381.html.txt","/var/www/straped/mufon/org/25381.html"],"Object Features":"Undisclosed","Date of the Event":"03/30/2010 11:50 UTC","trends":["There have been 3 other sightings in West Monroe","There were no other sightings in West Monroe on or around March 30th 2010"],"Tags":"City","Longitude":"-92.142805","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.519798,+-92.142805(25381)&iwloc=A&hl=en\"> mufon case (25381) map </A>","divs":["Sighting DetailsMy husband and I were driving home from a movie and it was almost midnight. We were very alert from all the caffeine in the diet cokes. There was no traffic; everything was very dark and quiet as I was looked up at a black sky with few stars. One very bright star could be seen in the upper right corner of the windshield. I pointed it out to my husband suggesting that maybe it was the North Star, which I had heard could be the brightest in the sky. As we both glanced at the star it moved in a horizonal blur to the left upper corner of the windshield on my husband's side, then stopped abruptly and hovered perfectly still for maybe 5 seconds. We were too shocked at the sudden movement to say anything. After 5 seconds it moved to the center on the identical horizonal plane in the sky, stopped suddenly without slowing and continued to hover perfectly still for another 5 seconds. Then it flew straight up until it was out of sight. Due to the speed, this \"star's\" movements took less than a second for each direction - left, right, and then straight up. My husband and I didn't speak for about 2 miles. To break the silence I asked, \"Did you see that?\" He replied, \"Yep.\" I said, \"Did that move like a jet or heliocopter to you?\" He replied, \"Nope.\" I followed with my last question - \"Do you think we saw a UFO?\" He says, \"Yep,\" and we finished the ride in silence. The object was so far away that it truly looked like a white star. It moved from one side of the sky, as seen through our windshield, to the other side in less than one second. It stopped suddenly without slowing. The best way to describe it is that it moved like a hockey puck in a ice hockey game. The perception of speed was the same, as well as the sudden stops and direction changes. The directional changes were perfect angles, no curves, and all happened that fast. Can a living thing be flying a craft that stops as if it hit a brick wall? Mmm... can a drone craft do that? Has our government the capability of building a craft that not only hovers, but goes forward, backward, and upward without turning or tilting? Jets have to make wide circles and heliocopters can't fly backwards. This craft was truly omnidirectional. Either our government is really very far ahead of public technology or it wasn't man-made. It certainly wasn't natural either."],"Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"At first I thought it was the brightest star in the sky.","City":"West Monroe","Disposition":"Unknown","Viewing Distance":"Unknown","Case Number":"25381","Object Shape":"Star-like","Region":"Louisiana","Latitude":"32.519798","Log Number":"US-09112010-0011","Date Submitted":"09/11/2010 06:39 UTC"}