{"Tags":"City","Date Submitted":"09/12/2010 02:28 UTC","Summary":"Turquoise sphere appears in west horizon and travels up and south east.","Region":"California","Longitude":"-118.236045","Object Flight Path":"Undisclosed","Disposition":"IFO","Case Number":"25384","City":"Los Angeles","Object Shape":"Sphere","divs":["sighting detailsi'm writing this for my wife. i was talking to her on the phone as i left work, and she was driving west in her car to park on a street next to our apartment in the mar vista area. within 5 minutes of the conversation, she interrupts to tell me she's looking at a strange object in the sky. it was a very bright turquoise colored sphere she noticed. it was brighter than any other star\\planet in the sky, at about the level that planes fly into the santa monica airport, which is very close to us. it was odd to her, because we are used to seeing planes come and go, and the light configuration was different. instead of the standard red light, blue light and white lights blinking, as found on planes and helicopters, the light was consistent and not blinking. it seemed to travel upwards as it got smaller, and then traveled very quickly across the sky south eastwards. there were planes in the area that she could hear, and she was able to compare relative speeds between the sphere and the planes. it was traveling much quicker than the incoming\\outgoing aircraft. there was no discernible shape associated with the light, it was just a sphere. she then watched it travel south east until she couldn't see it anymore. it started out the size of the light of saturn as it has been very prominent on the western horizon recently, and within a couple of minutes, she described it as looking like a 'pinhole' in the sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.055864,+-118.236045(25384)&iwloc=A&hl=en\"> mufon case (25384) map </A>","Object Features":"Unknown","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"09/09/2010 08:05 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 9th 2010"],"Log Number":"US-09122010-0001","Sighting Duration":"00:08:00","Latitude":"34.055864","files":["/var/www/straped/mufon/html2text/25384.html.txt","/var/www/straped/mufon/org/25384.html"]}