{"Tags":"City","Weather Factors":"Unknown","Sighting Duration":"00:05:01","City":"Concordia","Object Shape":"Fireball","Case Number":"25385","Latitude":"39.579895","Source":"MUFON","divs":["Sighting DetailsWe were behind a local restraunt talking to an employee in the ally when we seen the UFO. The night was very clear, not a cloud in the sky. The stars were bright. They orange color appeard and I noticed it first. I watched for a flash or any different color to see if it was a plane. But there was none. Only a orange ball(from the distance) I'd say it could of only been a few miles from us. Not that far away. Four orange lights moving north about as half as high as a normal commercial jet flies. Two of the objects were close together, Id say a few hundred of feet apart. Moving at a consistant speed them fading all in what it seems like the exact same part of the sky. And faded into the night with in a few seconds. Soon one more came and did the same, and as soon as that one disapeardin in the same part of the sky, another came and did the same. We were on main street and close to the building. So we couldnt see them South of main street. It looked like they were on the Western part of town or outside of town heading North. They glowed an orage color and did not flash, but were bright. We all got our phones out to take a picture or make a video. Our phones did not have the quallity to get any good pictures. Our friend did, but it was just a faint orange light in the darkness."],"files":["/var/www/straped/mufon/html2text/25385.html.txt","/var/www/straped/mufon/org/25385.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Straight-line path","Log Number":"US-09122010-0002","Date Submitted":"09/12/2010 04:39 UTC","Summary":"Orange light moving north. Total of 4.","Object Features":"Unknown","Date of the Event":"09/12/2010 01:00 UTC","Region":"Kansas","map":"<A HREF = \"http://maps.google.com/maps?q=39.579895,+-97.65288(25385)&iwloc=A&hl=en\"> mufon case (25385) map </A>","Longitude":"-97.65288","trends":["There have been 2 other sightings in Concordia","There were no other sightings in Concordia on or around September 12th 2010"],"Disposition":"Hoax","Country":"United States"}