{"Object Shape":"Circle, Egg, Sphere","Case Number":"25392","Longitude":"-89.977128","Object Features":"Undisclosed","Log Number":"US-09122010-0009","Weather Factors":"None","Date of the Event":"09/12/2010 01:50 UTC","trends":["There have been 4 other sightings in Collinsville","There were no other sightings in Collinsville on or around September 12th 2010"],"Object Flight Path":"Stationary","Latitude":"38.678147","files":["/var/www/straped/mufon/html2text/25392.html.txt","/var/www/straped/mufon/org/25392.html"],"Viewing Distance":"21-100 Feet","Sighting Duration":"00:10:00","Date Submitted":"09/12/2010 04:15 UTC","City":"Collinsville","Source":"MUFON","divs":["sighting detailsit was exactly 1:50pm when i was on my way to the motomart gas station on bluff road (157) in collinsville, ill. i was traveling east on horseshoe lake road when a bright silvery flashing caught my eye. there was no clouds and a bright blue sky with little wind. i looked up and saw the object and noticed that it was shinning brighter than any star would in the night sky. the object was stationary and not moving, but it was also flashing brighter than any strobe light would be on a plane, every half a second a bright white flash would appear. the object was above the bluff that runs along bluff road (157) when i got to the intersection of bluff rd and horseshoe lake rd i pulled over and watched the object for about 8 min. there was another truck pulled over across the street observing the object. after 8 min i quickly went to the gas station to buy the things i needed, before i entered i could still see the object. when i left the motomart store it was gone. please contact me if anyone else reported this object. thank you, [name removed\\cms\\tg] collinsville, ill"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.678147,+-89.977128(25392)&iwloc=A&hl=en\"> mufon case (25392) map </A>","Summary":"UFO shiny sphere about 1500-2000 feet high.","Disposition":"Unknown","Region":"Illinois","Country":"United States"}