{"Tags":"City","City":"Terre Haute","Viewing Distance":"Unknown","Latitude":"39.469453","Case Number":"25395","Longitude":"-87.408689","Object Shape":"Cigar, Disc","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-09122010-0012","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date of the Event":"08/28/2010 12:00 UTC","Date Submitted":"09/12/2010 06:59 UTC","Region":"Indiana","Summary":"Backing out of driveway and saw a silver object.","Country":"United States","files":["/var/www/straped/mufon/html2text/25395.html.txt","/var/www/straped/mufon/more/25395_submitter_file1__ufoshape.png","/var/www/straped/mufon/org/25395.html"],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.469453,+-87.408689(25395)&iwloc=A&hl=en\"> mufon case (25395) map </A>","trends":["There have been 22 other sightings in Terre Haute","There were no other sightings in Terre Haute on or around August 28th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","divs":["Sighting Detailswas home and left the house for something . we always park in the rear of the house and back out of the drive. I have done this for 10 years . as my truck was backing up I looked to my right as always to be sure no cars were coming and then look over to my left (west).only looking for another vehicle a mild silver shine caught my eye. It seemed to be far away at least 1 mile in which case would have made this object quite large. If to guess, maybe 500 feet across. It was smooth no noticeable markings,lights,windows or anything. the shape was like a disk with no raised areas or odd features. the top was the same as the bottom with very slight tapering of the ends . only way I can think to describe it is like two frisbees put together. when I looked that direction at first there was a slight hesitation due to the fact that i saw SOMETHING but then looked away only for a split second ,realized I HAD saw something that was not supposed to be there. I then quickly looked back and nothing was there at all . Nothing anywhere . I was intrigued slightly confused and within a few seconds started to feel a little nervous. I didn't know if was just mistaking it for something else or what. but after looking around the area again when I got back home I realized that I did not see a plane or anything i could explain. there was nothing around there that could have reflected sunlight or appeared to have that kind of shape . I truly belive I may have seen something amazing .What it was ,I would love to know ! I do belive strongly in the possibilities of alien tech. as well as the paranormal . We as a people and world in this universe are a pretty minimal speck. One has to believe there is something out there more advanced than us. GOD I HOPE SO !"]}