{"Disposition":"Hoax","Region":"Nevada","Weather Factors":"None","Log Number":"US-09122010-0007","Date Submitted":"09/12/2010 03:17 UTC","Object Shape":"Cigar","Object Features":"Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=36.119956,+-115.167546(25390)&iwloc=A&hl=en\"> mufon case (25390) map </A>","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 31st 2010"],"Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"36.119956","City":"Las Vegas","Date of the Event":"08/31/2010 09:00 UTC","divs":["Sighting DetailsI was driving east on Woodbury Rd. heading towards the Laughlin Bridge which goes over the Colorado River leading into Bullhead City, Arizona. I noticed the UFO heading West towards me on the right side of the road. I could not identify it as anything with which I was familiar suhc as a low flying plane or helicopter.It was very clear outside and the UFO was very close to my vehicle. It was a cigar shaped craft, all dark gray.I estimate it was approx. 40-50 ft. off to my left and no more than 50 feet off the ground. It appeared to be about 40 feet in length and no windows were visible that I could see. It was totally silent and no visible sign of a jet or smoke trail. After passing my car, I looked in my side view mirror as well as my rear view mirror. The craft had completely vanished and was no longer visible. I has my video camera in my car, but as I said, by the time I stopped to look, it was gone. I have had other UFO sightings in the past but nothing quite this close or as clearly visible as this one was. I have to say this sighting did not disturb me in any way, as I do believe that the universe is teaming with other life forms, many probably human like and I am not afraid at all."],"Case Number":"25390","Viewing Distance":"21-100 Feet","Longitude":"-115.167546","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Extremely close-up sighting while driving. Very clear view.","files":["/var/www/straped/mufon/html2text/25390.html.txt","/var/www/straped/mufon/org/25390.html"]}