{"Tags":"City","Sighting Duration":"00:01:00","Longitude":"-86.903346","City":"West Lafayette","Region":"Indiana","files":["/var/www/straped/mufon/html2text/25408.html.txt","/var/www/straped/mufon/org/25408.html"],"Date Submitted":"09/13/2010 10:03 UTC","Country":"United States","Object Flight Path":"Undisclosed","Log Number":"US-09132010-0008","Date of the Event":"08/15/2010 12:00 UTC","divs":["Sighting DetailsMy friend and I were just pulling in to his apartment building. As we stepped out of his car, I happened to glance upwards and see a very bright, white, and unblinking object slowly moving north across the sky. It was a fairly cloudy night and this coupled with light pollution from the town meant that few stars were visible. I pointed it out to my friend, who looked up and confirmed the object. Neither of us knew what it was but immediately agreed that it was not a plane, as it was not the well-known red and white blinking pattern of an aircraft but rather one single unblinking white light. Again I must stress how bright it was - by far the brightest light in the sky save the moon. Another thought that occured to me at the time was some sort of meteorite. There is a well known meteor shower visible throughout the midwest in early August, and I had seen a few shooting stars over the past couple of days. This object was unlike any meteorite I had ever seen. It moved slowly and remained visible for just under a minute before suddenly stopping and disappearing. My friend and I looked at each other, perplexed. I can't be sure, but my first thought upon seeing the object disappear was that it underwent some sort of rapid ascent, but I can't really substantiate this, and my friend said at the time that it simply vanished. Neither of us had seen anything like this before. We went inside and told our other friends who were, by and large, skeptical. They know my deep interest in UFO's and thought I was seeing things. My friend, however, has no such fascination and nonetheless had no explanation for what we saw. It was a bona fide Unidentified Flying Object."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"25408","Object Features":"Undisclosed","Latitude":"40.430269","map":"<A HREF = \"http://maps.google.com/maps?q=40.430269,+-86.903346(25408)&iwloc=A&hl=en\"> mufon case (25408) map </A>","Summary":"A very bright, white oval seen overhead travelling north. Visible for less than a minute before abruptly disappearing.","Source":"MUFON","trends":["There have been 7 other sightings in West Lafayette","There were no other sightings in West Lafayette on or around August 15th 2010"],"Object Shape":"Oval","Disposition":"Insufficient Data"}