{"Date Submitted":"09/14/2010 01:06 UTC","Object Features":"Unknown","City":"Ketchikan","Summary":"Multi-colored light/s hovering over/above the (roughly) southeast area of town; hasn't made much progress; altitude roughly maintained; erratic movement/zigzagging apparent.","files":["/var/www/straped/mufon/html2text/25417.html.txt","/var/www/straped/mufon/org/25417.html"],"Region":"Alaska","Latitude":"55.342222","Case Number":"25417","Longitude":"-131.646111","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 5 other sightings in Ketchikan","There was one other sighting in Ketchikan on or around September 13th 2010"],"Date of the Event":"09/13/2010 08:15 UTC","Object Shape":"Sphere, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=55.342222,+-131.646111(25417)&iwloc=A&hl=en\"> mufon case (25417) map </A>","Country":"United States","Source":"MUFON","Log Number":"US-09142010-0003","Weather Factors":"Does Not Apply","divs":["Sighting DetailsWe were standing on the balcony of our house in Ketchikan, Alaska. It's a clear night and my sister and I noticed an odd formation of multi-colored lights hovering over the southeast area of town. We noticed it at least 45 minutes ago and we've been observing it for about 45 minutes with binoculars. It's hard to determine the exact shape but it appears to be somewhat spherical, not making any apparent forward or backward progress, and it's maintaining a fairly steady altitude. We haven't seen anything like this before. Sometimes it appears steady then it zigzags erractically. The colors range from red, blue, yellow, white, purple, green. We haven't lost sight of the object. It appears to be a little bit smaller right now but it's still there and visible with the naked eye. Has anyone else reported this? Does anyone have any idea what it might be? We come from a family of pilots and this is defintetly odd."]}