{"Disposition":"IFO","Object Shape":"Circle, Sphere","Longitude":"-84.257226","Summary":"Extremely bright white light moving from west to east britghter and larger than local aircraft and sattelites no flashing or colored lights.","City":"Loveland-Madeira Corridor","Region":"Ohio","Object Features":"Undisclosed","Date of the Event":"09/12/2010 08:20 UTC","Viewing Distance":"Unknown","divs":["sighting detailson sunday (9\\12) at around 8:20pm i was out looking at the sky and enjoying the clear skies. the sun had set but there was still considerable light left and few stars were visible that i saw. looking northwest at about 35 degrees above the horizon i noticed a bright white circular light approaching from the west. the objects speed was consistent with the aircraft that i normaly see in the area so i assumed that it was the forward landing lights that i was viewing directly head on that made it seem so bright. as the object passed and proceeded away from my location the light never lost size or intensity. i did view the object wth my binoculars on it's approach, passing and leaving. doing this always reveals some part of the aircraft or any marking lights (red, green or flashing) but this time it did not and the light actually seemed to have a dark center but i am not 100% sure of that. i viewed the object for approx 1 minute until it was obstructed by trees. i only chose to report this based on the report of the same event date from indiana which sounds really similar but i don't know if the time frames work for this to be the same object."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.270748,+-84.257226(25413)&iwloc=A&hl=en\"> mufon case (25413) map </A>","files":["/var/www/straped/mufon/html2text/25413.html.txt","/var/www/straped/mufon/org/25413.html"],"Log Number":"US-09132010-0012","Date Submitted":"09/13/2010 11:25 UTC","Case Number":"25413","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 8 other sightings in Loveland-Madeira Corridor","There were no other sightings in Loveland-Madeira Corridor on or around September 12th 2010"],"Source":"MUFON","Latitude":"39.270748"}