{"Sighting Duration":"Undisclosed","Region":"Indiana","Date of the Event":"09/14/2010 08:49 UTC","Log Number":"US-09142010-0014","files":["/var/www/straped/mufon/html2text/25429.html.txt","/var/www/straped/mufon/org/25429.html"],"divs":["Sighting DetailsI went outside to smoke a cigarette and was looking at the sky because I saw some strange things the past few nights. I reported the airplane like thing last night... what was even more strange was after I reported it, I went back outside to smoke again and see if I could see anything else... when I was about to go outside I started feeling very nervous.. although I shouldn't have been.. not normal for me to be so nervous. I felt like someone was watching me. I went back inside cause I didn't like the feeling but I still even with my windows blinds closed and doors locked I felt very eery feeling. Then my dog started going nuts barking and growling and whining. He went and sat in front of the door and whined for about 20min. (note: my dog is deaf so couldn't have been from something he heard.) I then took him outside and he started sniffing around our front yard, whining and growling at the same time.. very unusual. We went back inside and he stayed by the door until my fiance got home and we went to bed. After that experience I thought I would watch the stars again tonight while outside smoking, and I just happened to see what I thought again looked like the north star but brighter and on the opposite side of the sky (towards the west). It had all the qualities of the north star but brighter and closer. It was not moving. I thought this was strange cause I haven't seen this bright of a star and there wasn't a star in that location last night. Then to the south I saw something that looked like a plane again without any blinking lights, moving across the sky, so I went inside to get my camera. I came back outside, with my 7 year old son, and tried to find the moving object again while recording on my camera. I couldn't get my camera to focus on it (this is just a regular canon digital camera.. not anything high tech so not very good quality) I did however get the camera to focus on the bright star like light to the east. I am uploading the video... it shows at about 1 min 25 sec in to the recording. This was about 10 minutes till 9pm Indiana daylight savings time. After a few minutes, I went back inside to put my son to bed. 10 minutes later after my son was in bed, I went back outside to look again but the light was gone!! I took a few seconds of video focused on the area where it had been. I am uploading this video as well. Well.. having trouble uploading the videos so I will try to attach them later."],"Longitude":"-86.151194","Date Submitted":"09/14/2010 11:27 UTC","City":"Indianapolis","Source":"MUFON","Disposition":"Unknown","Object Shape":"Circle, Star-like","Latitude":"39.776686","Tags":"City","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.776686,+-86.151194(25429)&iwloc=A&hl=en\"> mufon case (25429) map </A>","trends":["There have been 126 other sightings in Indianapolis","There was one other sighting in Indianapolis on or around September 14th 2010"],"Case Number":"25429","Summary":"Starlike bright white light - not moving, then disappeared","Country":"United States","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown"}