{"divs":["Sighting DetailsI love sitting out on my balcony on a clear starry night and look into the sky and just take in the beauty. I like to see falling stars or meteorites and I really like it when sometimes I observe what looks like moving stars. On the evening of Sept. 12th I was sitting on the balcony around 10:30PM and was doing my usual viewing of the sky. Then about 11PM I couldn't believe what I saw and am not exactly sure how to describe it. I live in the city and even though there on some lights around the area I can still get a very large view of the stars in the Eastern sky. So whatever this was showed up darker than the sky behind it. Tumbling is the best word that I can use to describe it, the event was very fast. I didn't see it land anywhere, just disappeared after about 15 seconds. Also noticed that it seemed to leave some sort of black trail behind it. My reactions was wow what did I just see. Everything that I have ever seen has always been illuminated against the dark sky, never have I seen a dark object."],"Case Number":"25421","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.981325,+-93.258946(25421)&iwloc=A&hl=en\"> mufon case (25421) map </A>","Date Submitted":"09/14/2010 11:13 UTC","Viewing Distance":"Unknown","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/25421.html.txt","/var/www/straped/mufon/org/25421.html"],"Object Features":"Unknown","Disposition":"Unknown","Longitude":"-93.258946","Log Number":"US-09142010-0007","Weather Factors":"Unknown","Date of the Event":"09/12/2010 12:00 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Minnesota","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around September 12th 2010"],"City":"Minneapolis","Tags":"City","Latitude":"44.981325","Summary":"Even though the sky was dark, I saw a darker rolling/falling object very fast across part of the Eastern sky."}