{"Disposition":"Unknown","City":"Portland","Case Number":"25420","divs":["Sighting DetailsI had left from work at about 10:00pm and was beginning my hour long ride home on my scooter. Shortly after leaving (around 10:10), I was driving west on marine drive nearing the 223rd st exit. As I approached the off-ramp, I noticed a unique light in the northern sky, and it was heading in my direction. What made the light unique was that it was circular in shape and moving back and forth across the front of the craft. It reminded me of the car \"kit\" from the television show 'knight rider' except for the fact the light was white and round. As it drew near (roughly 100 yards away), I could see the underneath of the craft. It seemed to have a triangular shape but rounded (basically there seemed to be no straight lines). The craft was also a silver color and absolutely had no visible means of propulsion. I didn't see any propellers or jet engines. Now the most incredible part of this experience was that the light seemed to help determine the direction the craft would head. The light stopped pacing back and forth and was stuck on one end for about 20 seconds. The craft started heading in the direction the light was facing, and soon the craft stopped and tilted forward as if the lights were this crafts eyes. I immediately realized what I was witnessing was something out of the ordinary and caused me to lose control of my scooter for a brief moment. While this happened the crafts light shot directly in my direction and then the craft slowly turned in my direction. By then I was so scared I focused on my driving, trying to figure out what to do and where to go, being that I was in an area with little traffic and little to none lighting. About 30-45 seconds passed without looking at this craft,(while heading south on 223rd), but once I turned my head assuming it'd be above me by then, it was gone. When i noticed the craft gone, I was coming to a light (possibly Sandy Blvd.) I will gladly provide further info if needed. Thank you"],"Tags":"City","Date Submitted":"09/14/2010 03:04 UTC","Sighting Duration":"00:08:00","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Log Number":"US-09142010-0006","Object Flight Path":"Hovering then path,Path then hovering","Summary":"UFO flew from north to south.","Region":"Oregon","Country":"United States","files":["/var/www/straped/mufon/html2text/25420.html.txt","/var/www/straped/mufon/org/25420.html"],"Longitude":"-122.675057","Latitude":"45.529052","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around September 13th 2010"],"Object Shape":"Cone, Teardrop","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.529052,+-122.675057(25420)&iwloc=A&hl=en\"> mufon case (25420) map </A>","Object Features":"Dome","Date of the Event":"09/13/2010 10:15 UTC","Weather Factors":"None"}