{"files":["/var/www/straped/mufon/html2text/25435.html.txt","/var/www/straped/mufon/org/25435.html"],"Object Features":"Window(s)","trends":["There have been 5 other sightings in Ketchikan","There was one other sighting in Ketchikan on or around September 14th 2010"],"divs":["sighting detailsas a follow-up to the report i submitted last night: we continued to observe the lights and i e-mailed the following update last night to cclift@mufon. mon, 9\\13: the larger multi-colored object we observed is still visible although it is somewhat smaller and appears to be a little further south of where we first observed it. since i submitted the report, we have observed multiple triangular or chevron shaped objects appear around the larger object. the three points of the smaller chevron shaped objects appear to be smaller versions of the larger multi-colored object and they appear to pulsate and dim more so than the larger object which remains fairly static in brightness. from 9:45 - 9:54 pm ketchikan, ak time two chevron shaped objects phased into view surrounding the larger object and \"pointing\" at it. two triangular shapes were at roughly 7 o'clock and 4 o'clock in relation to the larger object. at 10:03 we observed a third chevron appear at about 11 o'clock from the larger object. the third chevron was also \"pointing\" at the larger object. it is now 10:51 and the larger object is still visible...i discontinued observing shortly after 11 pm on 9\\13. tonight, 9\\14, we returned home at about 8:20 pm ketchikan time and observed the same multi-colored formation\\s. the largest one is situated more south\\southeast than last night but it is in the same general area, although it appears a little more distant\\smaller. there are a number of smaller multi-colored objects as well. we haven't seen the triangles form tonight. in addition, at about 8:30-8:35 pm we noticed a brilliant white object appear to the west of deer mountain...when we arrived home at about 8:20 pm tonight that object was not in the sky. my sister reminded me that she mentioned the brilliant white object last night but we were so wrapped up in observing the multi-colored object\\s that we didn't pay much attention to the white object. upon closer inspection tonight, the white object has a large brilliant light on the north side and it appears to have mass between the north end and what appear to be small windows further back towards the south end of it. overall, the shape appears to be flatter and more elongated than the spherical multi-colored objects. both objects are at roughly the same altitude and appear to be stationary. a group of four of our neighbors observed these objects with us tonight. one of our neighbors has lived in the area for a number of years and she says she's never seen anything like this. everyone agreed that these appear to be \"ufo's\" again tonight, the sky is clear and visibility is excellent. there appears to be less erratic movement than we observed last night. the objects remain clearly visible by the naked eye as i type this at 10:10 ketchikan, ak time."],"Region":"Alaska","Object Shape":"Blimp, Chevron, Circle, Sphere, Square, Rectagular, Triangle, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=55.350122,+-131.637001(25435)&iwloc=A&hl=en\"> mufon case (25435) map </A>","Case Number":"25435","Longitude":"-131.637001","Date of the Event":"09/14/2010 08:20 UTC","Latitude":"55.350122","Tags":"City","Weather Factors":"None, Does Not Apply","City":"Ketchikan","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Log Number":"US-09152010-0004","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Stationary","Summary":"Multi-colored lights & a super brilliant white object that may have windows.","Date Submitted":"09/15/2010 02:07 UTC"}