{"Region":"South Carolina","Date of the Event":"09/13/2010 10:45 UTC","Object Features":"Undisclosed","Object Flight Path":"Stationary,Other","Source":"MUFON","Longitude":"-81.960945","Date Submitted":"09/15/2010 12:08 UTC","Disposition":"Insufficient Data","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/25433.html.txt","/var/www/straped/mufon/more/25433_submitter_file1__UFO2.png","/var/www/straped/mufon/more/25433_submitter_file2__2.jpg","/var/www/straped/mufon/org/25433.html"],"Object Shape":"Cigar, Cross, Cylinder","divs":["sighting detailsit was around 10:45pm driving up a hill in a suburban area. a church sits right off the 4 lane road on the left at the top of the hill. i was in the passenger seat & looked up. what i saw was just pure confusion. my first logical thought was \"is that a plane going down?\" the object was completely & steadily vertical. simple, very uncomplicated plane\\cross type shape. vertical, cylindrical, 3 bright lights. shadowy aura, blurry background; almost computer pixel-y looking. more 2-d than 3-d, if that makes any sense. it was right above the church's roof. the driver did not want to stop so i kept looking in the rear view window, i could still see the 3 lights behind the trees as we headed down the hill. i convinced the driver to turn around,.. we returned & there was nothing out of the ordinary. it was gone. it was almost like an apparition, because we were so close to this thing- it was extremely confusing as to why neither me nor the driver could focus our eyes on it. everything around it was clearly there, but looking at this thing was just too much to process. it was very jerky, fast moving - but at the same time not moving at all; seemed very busy, the energy was busy. but it did nothing at the same time. i was too stunned & confused during\\afterward to even think of grabbing my camera out of my purse. -------- i drew a decent enough drawing on my computer via paint. (the pole with red lights in the background of my picture, behind the trees on the right, is a distant radio tower that i kept looking at, behind my object, to make sure i wasn't confused while looking at this mystery thing.) also added is a the only picture i can find posted by other people on another site that most matched what i saw. *note: again, i did not take the photograph i am attaching."],"Viewing Distance":"21-100 Feet","Log Number":"US-09152010-0002","Case Number":"25433","Latitude":"33.510703","Sighting Duration":"Undisclosed","Country":"United States","City":"North Augusta","map":"<A HREF = \"http://maps.google.com/maps?q=33.510703,+-81.960945(25433)&iwloc=A&hl=en\"> mufon case (25433) map </A>","Tags":"City","Summary":"Vertical/cylindrical/3lights/blurryaura/less than100ft away.","trends":["There have been 7 other sightings in North Augusta","There were no other sightings in North Augusta on or around September 13th 2010","This sighting has never been favorited.",""]}