{"Case Number":"25441","divs":["Sighting DetailsI had just met Dan Aykroyd last night, and we discussed shortly about UFO's in which he asked do u have any photographic evidence and i was like no but then i remembered hey i do have some evidence!, So he told me to report on forums when ever i see one or catch one on camera. So a few years back in 2007 i caught news from a local newspaper that a crop circle was found out on a farm in the St Greggor area of Saskatchewan. So the article stated that it was not the first time this happened on that particular farm and that the reporter that went to investigate was having difficulties with her cell phone which was registering dates of calls from the 1940's and also that her cell phones memory was erased. So I thought wow i need to go check this out. So a group of friend's and I travelled to this crop circle about 3 hours east of Saskatoon. We arrived about 7:30 pm and stayed about 2 hours just walking around in it and takeing pictures. Nothing out of the ordinary happened the cell phones were fine the only thing odd was that upon takeing pictures it seemed like the cameras energy was being drained. The battery level stayed steady but the flash was not working properly the pictures appeared darker then it was at that time of day. The time this has happened to my camera before was when i took a picture of a friend who had bike reflectors on so i am thinking weird what is screwing with my camera flash. After we left me and the other two passengers felt really exhausted which was also odd considering two of us had slept in quite long that day and me the driver is use to driving long road trips so it just can't be explained. Upon returning home I got on the computer to upload my pictures and i noticed in some of them there were objects in the sky that i did not see while i was out there, So i blew the pictures up and well you can see for yourself I have no idea what to think is that an object? save and zoom in on it they look cylinder. Also after returning home i couldn't help but feel really odd like i was being watched so i went to go camp over at my brothers house, and another thing most pictures were filled with orbs which i think were wheat particles mabye? Picture 1: is just to show you how dark the flash was making it look Picture 2: top left side is an object with a tail Picutre3: another object on top of the person."],"Object Features":"Unknown","Object Shape":"Cylinder","Region":"Saskatchewan","Latitude":"52.13838","Viewing Distance":"Unknown","Source":"MUFON","Summary":"Visited a crop circle, had problems with camera then came home to find objects in few pictures.","Country":"Canada","City":"Saskatoon","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=52.13838,+-106.646266(25441)&iwloc=A&hl=en\"> mufon case (25441) map </A>","Log Number":"CA-09152010-0009","Date Submitted":"09/15/2010 06:56 UTC","Date of the Event":"05/11/2007 07:35 UTC","Tags":"City","Disposition":"Unresolved","Longitude":"-106.646266","trends":["There have been 16 other sightings in Saskatoon","There were no other sightings in Saskatoon on or around May 11th 2007","This sighting has never been favorited.",""],"Weather Factors":"None, Light","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25441.html.txt","/var/www/straped/mufon/more/25441_submitter_file1__Picture024.jpg","/var/www/straped/mufon/more/25441_submitter_file2__Picture025.jpg","/var/www/straped/mufon/more/25441_submitter_file3__mesobject1.jpg","/var/www/straped/mufon/org/25441.html"]}