{"files":["/var/www/straped/mufon/html2text/25442.html.txt","/var/www/straped/mufon/more/25442_submitter_file3__PICT00123.jpg","/var/www/straped/mufon/org/25442.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.914194,+-88.308687(25442)&iwloc=A&hl=en\"> mufon case (25442) map </A>","Country":"United States","Source":"MUFON","Longitude":"-88.308687","divs":["Sighting DetailsThe sighting happened withing 3 days apart, sept 11, 2010 between 8-9pm and on Sept. 13 at 7:42pm. On Sept 11, 2010 (8:45pm) I was having a smoke out side with my girlfriend it was a clear night the stars were visible when I looked to the Northwest sky and seen a real bright red star just there in the sky, I look to the left and then right comparing it to all the surrounding stars, I told my girlffriend to take a look at that red star, when she said \"its not a star its moving\". to my shook it was moving and moving this way, I've seen many planes in this area and for the truth I deeply knew it wasn't a plane and ran for my camera. I was able to capture about 2 minutes of the star-light object heading from NW to SE bound. It was traveling fairly faster than a plane and I had a real tough time staying focus but was able to provide the following footage. The object didnt make a noise another self assuring proof it wasn't a plane that my 40 year old self has seen. It wasn't a Chopper also, they make noise. On Sept 13, 2010 (7:42pm) I was taking out the trash and poundering about the event of 2 nights ago I made sure to carry the camera in my poket just incase, and my gutsy feelings were on point, little a behold I looked up at about the same air space I seen the red star 2 nights prior, was the object again, i grab the camera and in attempt to film, I accidently snapped a pic and I then place the setting to the video and was able to record the 2nd video. Just like the first it was red and proceeded almost an identicle route as the 1st sighting. Same charters and again no noise, no flashing light and besides me no one else to prove my sightings except these videos."],"Weather Factors":"Unknown","Object Features":"Unknown","Case Number":"25442","City":"St Charles","Object Flight Path":"Hovering then path","Date of the Event":"09/11/2010 07:45 UTC","Date Submitted":"09/15/2010 07:42 UTC","Sighting Duration":"Undisclosed","Summary":"Red star like with a steady red glow.","Object Shape":"Star-like","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around September 11th 2010","This sighting has never been favorited.",""],"Region":"Illinois","Log Number":"US-09152010-0010","Latitude":"41.914194"}