{"City":"Helena","Log Number":"US-09162010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=46.603056,+-112.025331(25449)&iwloc=A&hl=en\"> mufon case (25449) map </A>","Summary":"Flashing red lights following fast darting white light.","Sighting Duration":"00:05:00","Date of the Event":"09/15/2010 09:30 UTC","divs":["Sighting DetailsMy boyfriend and i went out to our back porch to smoke. Our porch faces west. We were sitting on our steps when i noticed a dim red flashing light just above the west horizon. At first I thought it was a satellite. I watched it for a few seconds and realized it was moving to fast to be a satellite. I saw a white light appear and disappear 3 times forming a diamond shape with the red lights as the top point of the diamond. I thought it was a fleet of helicopters or planes flying in formation and very fast until the white lights didn't get any closer. I pointed it out to my boyfriend and we watched the red light move across the sky with the white lights flashing all around it. The red light came out of the west and moved toward the southern horizon then turned toward the northeast horizon, making a large U or horseshoe path across the sky before disappearing into the northeast horizon. It lasted about 5 minutes. About halfway through the event the object was turned at an angle where we could see multiple red lights (3-5 it seemed some were fainter than others).They formed a line. It was too dark to make out the objects shape. When the object changed its course (from southeast to northeast) it went into a part of the sky with less light coming from the horizon and we could see the white lights weren't multiple objects it was one object darting in all directions. It was leaving leaving trails that lasted a split second. It was extremely fast and was able to change direction and reverse instantly. It seemed like this red light was trying to follow or escort this fainter, faster, darting light. I was amazed and in disbelief. I love to watch the stars and I live in a fairly small town without many lights so I have a pretty good view of them from my house and an even better one a few miles out of town, I look at the stars very frequently, almost every night and I have never seen anything like this. My boyfriend was with me and saw the exact same thing i did. I'm still very confused and curious about what we saw. I don't think we're crazy but what we saw was not normal or believable. It might also be interesting to note that I live about 80 miles from the Maelstrom Air Force Base which is located in Great Falls, MT. It is a large base that controls nuclear missiles and has a large experimental synthetic aircraft fuel plant. Maelstrom AFB is located to the northwest of me which is the direction the lights were headed and disappeared."],"Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Country":"United States","Date Submitted":"09/16/2010 01:40 UTC","trends":["There have been 9 other sightings in Helena","There were no other sightings in Helena on or around September 15th 2010"],"Object Shape":"Flash, Other","Source":"MUFON","Longitude":"-112.025331","Region":"Montana","Latitude":"46.603056","Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Unknown","Case Number":"25449","files":["/var/www/straped/mufon/html2text/25449.html.txt","/var/www/straped/mufon/org/25449.html"]}