{"map":"<A HREF = \"http://maps.google.com/maps?q=44.251953,+-85.401162(2544)&iwloc=A&hl=en\"> mufon case (2544) map </A>","Summary":"CE1 in Cadillac, MI","Weather Factors":"Unknown","Date Submitted":"04/30/1983 10:00 UTC","files":["/var/www/straped/mufon/html2text/2544.html.txt","/var/www/straped/mufon/org/2544.html"],"Object Flight Path":"Undisclosed","City":"Cadillac","Case Number":"2544","Disposition":"Unresolved","Log Number":"","Latitude":"44.251953","Country":"United States","Object Shape":"Undisclosed","Sighting Duration":"00:10:00","Longitude":"-85.401162","Source":"MUFON","divs":["Sighting DetailsThis happened near Cadillac, Michigan in May 1983. I was with others from the Uof Michigan who were on a canoe trip. We were sitting around campfires about10:00 pm when I needed to see the area, in the dark, to water a tree! Therewere no roads or houses in this area, a clear cool night. Then suddenly I wassurprised by a bright white light, shining down at the tree-top level. It wasapprox. 10 feet in diameter, a disk, with solid light shining down from itsentire bottom. It made no sound, but moved a foot or two from side to side. Its light made many shadows through the trees and they, the shadows all moved,hence movement by the craft. It was about 250 feet away from me, and my friendswere behind me some 300 feet. As they were all new engineers, too theoryminded, I wasted no time going back to tell them to see. I walked slowlytowards the craft, through the woods. I was going to walk right into and underthe light. I never got closer than 100 feet. The light was so bright that Inever could actually see the craft itself. Also I was looking through trees,although thin. At about 100 feet away the craft stopped moving and simplydisappeared! The light went out and there was no evidence of it. When Iexamined the ground moments later. I watched this light for about 10 minutes. I was not drunk, or high, or crazy! I was 25 years old then. The forest consisted of thinly populated pine trees."],"Region":"Michigan","Tags":"City","Date of the Event":"04/30/1983 10:00 UTC","Object Features":"Undisclosed","trends":["There have been 9 other sightings in Cadillac","There were no other sightings in Cadillac on or around April 30th 1983"],"Viewing Distance":"Unknown"}