{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.854321,+-86.38149(25444)&iwloc=A&hl=en\"> mufon case (25444) map </A>","Region":"Tennessee","Longitude":"-86.38149","City":"Murfreesboro","Log Number":"US-09152010-0012","Weather Factors":"Unknown","divs":["Sighting DetailsAbout a month ago a friend of mine gave me a call and told me he was seeing a UFO in thesky in Lebanon where we both grew up, it being 1am on a week night I was asleep but he came to Murfreesboro where I live that next weekend and told me about it, it was a Saturday night and him being smoker went outside to smoke, within a matter of a couple mins he was yelling for me to come outside which I did, after going outside he persisted to tell me look, that's whAt I saw but lower. When I looked out in the sky (night time) I could see a light which I thought ok it's a light, he said watch chad, watch what it does. To my amazement it zipped left very fast then down then right and stayed there, after sitting down outside I realized this is wAs really happening. I am the type of person that has to see something to actually believe it but me being open minded knew there is a possibility. After about 30 mins of watching this light we could see as if it was almost searching for something.... Reason being we could see a light being shown outward from it and reflecting off the clouds. We then went to grab some taco bell, after getting back we went back outside on the back and it was no where in sight,. It's not every night I go outside and look ip but with alot of things on my mind lately I went outside around 930 which I happened to look up and here was this light again zipping in a fast motion left then up then down buy not in that order. I had enough and decided to email you guys."],"Tags":"City","Object Shape":"Unknown","Latitude":"35.854321","Country":"United States","files":["/var/www/straped/mufon/html2text/25444.html.txt","/var/www/straped/mufon/org/25444.html"],"Sighting Duration":"Undisclosed","Date Submitted":"09/15/2010 11:22 UTC","Viewing Distance":"Unknown","Summary":"2nd time seeing this, object quickly zips in movement fast and hovers.","Date of the Event":"09/14/2010 09:45 UTC","Case Number":"25444","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Disposition":"Insufficient Data","trends":["There have been 18 other sightings in Murfreesboro","There were no other sightings in Murfreesboro on or around September 14th 2010"]}