{"Viewing Distance":"Over One Mile","Object Features":"Unknown","Country":"United States","Date Submitted":"09/15/2010 05:27 UTC","City":"Phoenix","files":["/var/www/straped/mufon/html2text/25440.html.txt","/var/www/straped/mufon/org/25440.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.450467,+-112.066917(25440)&iwloc=A&hl=en\"> mufon case (25440) map </A>","Latitude":"33.450467","divs":["Sighting Details On April 28, 2010 in Mesa, AZ at 8:58PM, I went outside onto my porch to take a look around in the sky. Then I noticed a ball of light in the far distant bright and continuously lighted moving east horizontally and low in the sky at a slow pace. I was looking north-west in direction, and I estimate the distant from me to about 5-10 miles. This reminded me of the ball of lights I have previously seen flying in the sky many other times. I rushed inside the house to grab my camera, and I set the camera mode to night mode. I then rushed back outside, spotted the ball of light, and I took 1 picture while trying to hold the camera as steady as I could in just one position. Because of the building structure was beginning to get in the way of my view, I was only able to get one more picture of the ball of light. At the same time I noticed the ball of light, I also noticed something else flying around in that direction about maybe 1-2 mile away what may be a helicopter since I was able to see strobe lights flashing of it. I took 1 picture of that helicopter light after the ball of light event. Upon downloading the picture, you can clearly see strobe lights on the helicopter, but not on the ball of light object which lately I been calling it a globe UFO."],"Disposition":"Unknown","Tags":"City","Date of the Event":"04/28/2010 08:58 UTC","Object Flight Path":"Straight-line path","Case Number":"25440","Summary":"Ball of light resembling a globe","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around April 28th 2010","This sighting has never been favorited.",""],"Object Shape":"Circle, Sphere","Sighting Duration":"00:02:00","Weather Factors":"Unknown","Log Number":"US-09152010-0008","Source":"MUFON","Longitude":"-112.066917","Region":"Arizona"}