{"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Disposition":"Unresolved","Latitude":"45.51183","Summary":"High speed star that disappeared.","Source":"MUFON","Country":"Canada","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"09/16/2010 12:48 UTC","Object Shape":"Star-like","Log Number":"CA-09162010-0002","City":"Montreal","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/25448.html.txt","/var/www/straped/mufon/org/25448.html"],"Longitude":"-73.544682","divs":["Sighting DetailsI was having a barbeque late last night with some friends of mine. We were having fun and making some jokes on the wooden deck in my yard (and eating some really good ribs). My eyes were quickly drawn to the sky for a brief moment by what seemed to be a very bright star shoot across the sky at high speed. It was easily under cloud altitude and, interestingly, dissapeared abruptly after a couple of seconds. I involuntarily pointed up and said aloud \"Holy ****, did you guys see that?\" No one else had seen the 'star' except for myself, one of my friends was even kind enough to tease me a little about the sighting. The object was white and bright like a star except slightly larger and brighter. It traveled in a straight line heading east for the moment that I witnessed it. It was clearly below the clouds. the lowest clouds rest usually around 2000 meters above ground I believe, I would estimate this object was between 1000 and 1500 meters above ground. It dissappeared a moment after I looked at it, as if someone had flicked a light switch off. It made no sound. I was immediately excited about what I had seen, the first thing I thought of was that this was no star and that I may have witnessed something rare and special. I'm an amateur astronomer and I own a high powered telescope so I am very familiar with the sky at night. I am certain that this was not a shooting star. I have never seen something like that so low to earth at such a speed and instantly vanish this way before. Can you help me explore and maybe explain this phenomena? Thank you for your time. Unfortunately this event was so brief that I did not have the time to take any pictures. If you can find the time to contact me, I have left my e-mail address. N"],"Case Number":"25448","map":"<A HREF = \"http://maps.google.com/maps?q=45.51183,+-73.544682(25448)&iwloc=A&hl=en\"> mufon case (25448) map </A>","Region":"Quebec","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around September 14th 2010"],"Date of the Event":"09/14/2010 01:30 UTC"}