{"files":["/var/www/straped/mufon/html2text/25447.html.txt","/var/www/straped/mufon/org/25447.html"],"Region":"Oklahoma","City":"Beggs","Tags":"City","trends":["There have been no other sightings in Beggs","This sighting has never been favorited."],"Sighting Duration":"00:30:00","Longitude":"-96.070273","Object Flight Path":"Stationary,Hovering then path","Latitude":"35.742598","Case Number":"25447","Source":"MUFON","Date of the Event":"09/15/2010 08:15 UTC","Weather Factors":"Windy","Log Number":"US-09162010-0001","Country":"United States","Object Shape":"Disc, Flash, Star-like, Triangle","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.742598,+-96.070273(25447)&iwloc=A&hl=en\"> mufon case (25447) map </A>","Disposition":"Unknown","Object Features":"Dome","Summary":"3 red lights and 2 white lights that flashed in triangle form.","divs":["Sighting DetailsWe were watching a T.V. and i had remembered that my boyfriend still had to put the dogs in the barn for the night, so i reminded him. He was out there for about 5 minutes when i got a phone call from him telling me to come outside quick! he told me that there was a craft hovering above and he wanted me to see. I was on my way out but by that time it was gone. When he came in he was very overwhelmed with excitement and he actually drew me a picture of what he saw. After looking at the picture we browsed the internet to look up strange triangular lights in the sky. He then pointed one out that looked exactly like his drawing. I told him that we would wait for 30 minutes and then go back outside to see if it had come back. Once the 30 minutes were up i grabbed the camera and our phones just in case. As soon as we got outside my boyfriend immediately pointed out the same thing he saw earlier but it was farther away this time. So him and I both ran to get as close as we could to see the craft. I couldn't believe my eyes when i saw it. We tried taking a video or a picture but our zoom couldn't zoom in far enough and all we got was darkness. We stood outside watching the crafts every move for about 30 minutes. As we were watching, we could see that there were 3 red lights and 2 white lights. The white lights would flash as if it were at a slow pulse but had no particular rhythm to it. Every couple of minutes we would see multiple lights light up in a circular pattern that formed the shape of the craft and lit it up. It's motions were not big strides but small pacing horizontally from left to right. We could most definitely tell that it was no plane. It was more stationary rather than constant movement like a plane would do. It was as if it were hovering and trying to hide itself. When the craft left, it shot up vertically very very fast. My boyfriend also saw the same thing last Wednesday on the 8th of September 2010. And again, he tried to get a picture but it was just too dark to capture it light."],"Date Submitted":"09/16/2010 12:25 UTC"}