{"Country":"United States","Object Shape":"Star-like","Summary":"A star moving in circles right to left and staying still when commercial flights came by blending in with the night sky.","Sighting Duration":"Undisclosed","Weather Factors":"None","Date Submitted":"09/16/2010 03:06 UTC","Viewing Distance":"Over One Mile","Tags":"City","Source":"MUFON","Region":"Virginia","Log Number":"US-09162010-0011","map":"<A HREF = \"http://maps.google.com/maps?q=37.542985,+-77.432888(25459)&iwloc=A&hl=en\"> mufon case (25459) map </A>","Case Number":"25459","Date of the Event":"09/15/2010 10:00 UTC","Object Flight Path":"Other","Disposition":"Insufficient Data","trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around September 15th 2010"],"Latitude":"37.542985","Longitude":"-77.432888","divs":["sighting detailsover highway 60 approx. at the 288 crossing in midlothian va to the west. i was lookin at the stars when one takes off to the right dropded down a bit and circled back to the originale spot. it moved in very fast, short bursts. the light flickerd at times being brighter and duller at other times. i watched on and off for over 2 and a half hours on my third story deck. when commercial flights came through the object would stay moitionless. it was a relativley clear night. it was still there and still \"roving\" when i decided to go to sleep. if you read this and live in this area look up!! i know it sounds crazy but, on july 3rd 2010 my girlfriend and i saw 2 extreamly bright orange orbs up there heading north towards d.c. we reported that one to the police, *(names deleted--sgonzalez\\cms). the next day we was called and told that there was a slew of reports nearly identical to ours that night all up the east coast. i am a skeptic and it bothers me that i cannot explain all this away, but i will not lie to myself or anyone else about what my eyes see for themselves. i will be buying a video recorder this weekend, and i will keep at my side for now on when i go out at night."],"files":["/var/www/straped/mufon/html2text/25459.html.txt","/var/www/straped/mufon/org/25459.html"],"City":"Richmond","Object Features":"Unknown"}