{"Country":"United States","Region":"California","Disposition":"Insufficient Data","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.354108,+-121.955236(2545)&iwloc=A&hl=en\"> mufon case (2545) map </A>","Tags":"City","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/2545.html.txt","/var/www/straped/mufon/org/2545.html"],"Case Number":"2545","Longitude":"-121.955236","Sighting Duration":"00:30:00","Date of the Event":"09/16/2003 09:00 UTC","Date Submitted":"09/16/2003 09:00 UTC","City":"Santa Clara","Weather Factors":"Unknown","divs":["Sighting DetailsTues. evening96 Sept. 16, 200396 approx. 900PM PDT96 Temp. 65 approx.96 conditions clear skies, quiet, calm, with little to no wind.While in my backyard stargazing with my telescope Iwe observed a very brightapprox. magnitude2B1.093double-flashing94 pulse of light. This was observed 7 times in total over a 25min period in anarea of the sky covering approx. 10deg N to S and 5deg E toW and more or lesscentered on the star Altair, in the constellation Aquila.While targeting an area of sky near Altair through my telescopes telrad finderin order to start sweeping the sky to visualize the dumbbell nebula M27 I firstobserved the93double-flashing94 pulse of light approx. 1-2deg N of Altair. I initially dismissed thisobservation as being the effect of some sort of visual aberration or otherinconsequential anomaly. Approx. 1-2min later I observed the93double-flashing94 pulse of light again. This time it was located 1-2deg SW of locate were itwas first observed. At that time I went to the house to get my significant otherin hopes that she would also be able to witness this light confirm my previousobservations. Almost immediately upon returning to my telescope we both observedthe93double-flashing94 pulse of light, and it was observed again by both of us 2-3min later. Mysignificant other witnessed a third93double-flashing94 pulse of light, but I missed this one as I was looking elsewhere.Additionally, I witnessed 2 more93double-flashing94 pulses of light the last coming at 925PM PDT. These were seen alone as mysignificant other had returned to the house.Again, all of the observations were made in 10deg X 5deg area of the sky, over a25-30min period. The light itself was more or less pinpoint like that of a star,bright white to slightly bluish-white in color, and pulsed 2 times every time itwas observed. The best way that I can describe it is how we have been taught apulsar would look like. It did not appear to have any movement, either constantor random, but rather just pulsed in a different location of the aforementioned10deg X 5deg93box94. There was no sound associated with the light whatsoever, as it was anexceptionally quiet that evening.Of note both myself and my significant other also observed 2 separate satellitesthat evening one tracking W to E the other tracking N to S in addition to thisunexplained pulsing light. Upon referencing the website www.heavens-above.com Ibelieve that I have identified the satellite tracking W to E as the Cosmos 1943Rocket.There were no Iridium flashes, spacejunk, or other known satellite with a pat"],"trends":["There have been 12 other sightings in Santa Clara","There were no other sightings in Santa Clara on or around September 16th 2003"],"Object Flight Path":"Unknown","Summary":"unexplained pulsing light in the sky over the S.F.","Source":"MUFON","Object Features":"Undisclosed","Latitude":"37.354108","Log Number":""}