{"Case Number":"25458","Source":"MUFON","Latitude":"40.755656","Disposition":"IFO","Sighting Duration":"00:01:15","Tags":"City","Country":"United States","divs":["sighting detailsi was in the parking lot of a music venue on long island, tailgating with friends prior to the show, on the 3rd of july 2010. i had my cell phone out and was taking a picture of the venue and the sky at 7:00pm (note: not a single cloud in the sky). approx. 1 minute later (7:01pm) a typical commercial jet\\airplane (i.e. 747) appeared in the sky and was passing overhead. it looked cool in the all blue empty sky so i aimed my camera phone and took a pic. as soon as i pressed the shutter i saw in the corner of my naked eye (and on the screen of phone) a object approx. the same size as the tail of the 747, moving very rapidly from left to right, at least 2 - 3 times faster than the airplane. by the time i tried to take a second picture it was gone from view over the horizon. i wish i had my real camera instead of the 1 megapixel camera phone, but i am relieved to know i captured the object. i hope this can help ufology(gists) and it is added to a confirmed unidentified\\unexplained phenomenon of flying objects\\crafts. one other thing i would like to add is to me it appeared as if there were definitely 1 and maybe 2 round what appeared to be portholes you could just see with the naked eye. please any one interested in having this\\my photo analyzed, studied, researched, etc. i welcome you to contact me."],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"09/16/2010 01:46 UTC","Date of the Event":"07/03/2010 07:00 UTC","Object Shape":"Boomerang, Bullet, Missile, Disc","Longitude":"-73.587627","Log Number":"US-09162010-0011","files":["/var/www/straped/mufon/html2text/25458.html.txt","/var/www/straped/mufon/more/25458_submitter_file1__0703001900.jpg","/var/www/straped/mufon/org/25458.html"],"City":"Westbury","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.755656,+-73.587627(25458)&iwloc=A&hl=en\"> mufon case (25458) map </A>","trends":["There have been no other sightings in Westbury","This sighting has never been favorited."],"Region":"New York","Summary":"Taking a pic of a 747 flying overhead when I saw in the bottom corner of the screen an object (UFO) moving very fast it looked like it had 1 maybe 2 portholes!!","Viewing Distance":"Unknown"}