{"Latitude":"33.915869","Viewing Distance":"Unknown","Date Submitted":"09/16/2010 11:52 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Case Number":"25469","City":"New River","Log Number":"US-09162010-0017","Object Features":"Unknown","divs":["Sighting DetailsI was traveling northbound on I-17 with my Dad and Grandad, Dad was driving and Grandad was on the passenger side of the front seat and I was riding in the back seat behind Grandad. I was looking out the window on the right side of the car when some flashing lights caught my attention. When I looked at the lights I could see that there were two slow flashing lights on the rear of a triangle shaped object with three yellowish lights on each side that formed the triangle. The object appeared to be sitting still. It looked to be about a quarter mile away from the highway and about the size of a dime at arms length. I have no idea of its real altitude except that it looked really big and close. I only observed the object for about 1 minute before I lost sight of it because we could not pull over on the busy interstate and had to keep moving until it was out of sight. No one else saw the object. On the return trip home in the daylight, I looked to see if there were any towers or anything like that in the area where I saw the object and there was nothing like that in the area. I called my other grandad because he is an investigator with mufon and told him what I had just seen. He is helping me fill out this report."],"Object Flight Path":"Stationary","Country":"United States","Summary":"Large triangle shaped object, stationary with blinking yellowish lights.","Tags":"City","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25469.html.txt","/var/www/straped/mufon/org/25469.html"],"Longitude":"-112.135991","Date of the Event":"09/10/2010 08:15 UTC","trends":["There have been 2 other sightings in New River","There were no other sightings in New River on or around September 10th 2010"],"Object Shape":"Triangle","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.915869,+-112.135991(25469)&iwloc=A&hl=en\"> mufon case (25469) map </A>","Source":"MUFON"}