{"Log Number":"US-09162010-0014","Disposition":"Unknown","Object Features":"Unknown","trends":["There have been no other sightings in Monticello","This sighting has never been favorited."],"divs":["sighting detailshello im am\\was a skeptic,my fam and i were at lake cumberland ky,near connly bottom,looking at the milky way showing my daughters its wonders,we live in dayton ohio, light pollution makes it hard to see the stars, we go to the lake for its unobstructed view.,i have extra perfect vision and i had binocs,we seen a short line not a meteor in the center of the sky straight up,it looked like a line of light,one side of the line lower than the other,think of a line with a small angle in the middle,the ends seemed to switch,sounds weird i know,but im a scientific thinker,familier with regular obiting objects and meteors,this was not one of these,it was spellbinding,im a philosopher and i study relativity and quantum mechanicsim no dummy, the object seemed small in the sky but i know to see it like i did it was deep and huge,i dont know what to do im so exited,it was slowly moving in a very strange way,we seen it for 2 minutes it traveled west to east straight eastward motion.lost sight as it moved to the milky zone,my daughters also were witness. this is my first sighting after study of the sky for decades."],"Source":"MUFON","Longitude":"-84.849113","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.829794,+-84.849113(25466)&iwloc=A&hl=en\"> mufon case (25466) map </A>","Date Submitted":"09/16/2010 08:19 UTC","Case Number":"25466","Region":"Kentucky","Sighting Duration":"00:02:30","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/25466.html.txt","/var/www/straped/mufon/org/25466.html"],"Latitude":"36.829794","Summary":"Naked eye star gazing, I we seen what looked like a short or small line it seemed to be in deep space moving slowly, I've never seen any thing like it,","Object Flight Path":"Path with directional change","Date of the Event":"09/04/2010 11:00 UTC","Tags":"City","City":"Monticello","Country":"United States","Viewing Distance":"Unknown"}