{"Country":"United States","Case Number":"25463","Source":"MUFON","Object Features":"None","City":"Everett","Date Submitted":"09/16/2010 04:42 UTC","Object Shape":"Fireball, Star-like","Region":"Washington","Summary":"Planet (so I thought) moving vast distance over sky from a dead stop at sunset.","files":["/var/www/straped/mufon/html2text/25463.html.txt","/var/www/straped/mufon/org/25463.html"],"Log Number":"US-09162010-0011","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.982315,+-122.200219(25463)&iwloc=A&hl=en\"> mufon case (25463) map </A>","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"00:45:00","Date of the Event":"09/14/2010 07:00 UTC","divs":["sighting detailsi was at the local skatepark in everett wa. during sunset i took a break to watch the sky and see the first stars. then i saw what i figured had to be mercury (yellow\\ orange ish) but it was south by south-east from me, and it is supposed to be east. i thought it was strange and went back to riding my bike. a few minutes later i stopped again because it looked as though it had moved even more toward straight south of me. this time i went to a spot on the edge of the park and found a ledge and in the distance a tree and a building so i could see it change over time in the line of sight. i thought it could be a military helicopter that was closer than i imagined but far enough away for me not to notice it moving slightly as it hovered or whatever. then it crossed paths with the landing patterns of boeing and seattle-tacoma airport. a jumbo jet passed in front of the light a little after dusk and you could see how puny the lights of the jumbo jet were- at 35 miles away compared to this thing.... it moved another 15 degrees or so west and then it moved fast enough to be easily seen moving with the naked eye until it slowed again and stopped, where it dimmed out in position. it started about 30 degrees above the horizon at south by southeast of everett wa. it ended about 45 degrees above the horizon and almost dead south of me. about 45 minutes of total observation time. i thought it was a planet until i noticed how wrong its position was. if it was a helicopter, it had no faa lights and was brighter than the aircraft landing 2 counties south which were in front of it. if it was a chinese lantern, i would have recognized it immediately as our neighbors light them off all the time and i've watched them do it many times. chinese lanterns are only so bright and the last only so long, plus they move with the wind..."],"Tags":"City","Disposition":"Unknown","Latitude":"47.982315","Longitude":"-122.200219","Weather Factors":"None","trends":["There have been 30 other sightings in Everett","There were no other sightings in Everett on or around September 14th 2010"]}