{"City":"Raytown","Object Features":"Undisclosed","Case Number":"25468","trends":["There have been 15 other sightings in Raytown","There were no other sightings in Raytown on or around May 29th 2010","This sighting has never been favorited.",""],"Disposition":"Hoax","divs":["Sighting DetailsNow that I have become accustomed to going outside at all time of the night taking pictures I am really starting to achieve some results. At least I think so. While taking pictures of the stars east of my position. I turned west toward the side of my house and noticed an object floating near the tree on my side yard. It was glowing reddish orange and changing shapes. It was only there a couple of minutes from what I could tell. because it dissapeared. It looked kind of like a glow worm only in the air. there is something that I have noticed about some of the ufo's I've seen. They seem to have stelth abilities. What I mean by this is that a particular probe I saw once was apparently attached to another vechile. The reason I'm saying this, is because after examination of the video I noticed that the probe when launched appeared to be two circles of light, but after traveling a short distance in my direction I only saw one circle of light growing larger as it approached in my direction. This object however was only above my head about ten to fifteen feet and about two to three feet from the tree. I have no idea what it is and I,m tired of guessing. At first I didn't want you guys to investigate these objects for fear that they may be dangerous. But after being so close to two of them I think that they are mostly curious about us. These thing have really changed my opinion about the world and I hope that just the sight of these creatures will do the same for others."],"files":["/var/www/straped/mufon/html2text/25468.html.txt","/var/www/straped/mufon/more/25468_submitter_file1__100_1380.JPG","/var/www/straped/mufon/more/25468_submitter_file2__100_1381.JPG","/var/www/straped/mufon/org/25468.html"],"Object Flight Path":"Undisclosed","Longitude":"-94.454894","Object Shape":"Cigar, Cylinder, Other, Unknown","Country":"United States","Date Submitted":"09/16/2010 11:45 UTC","Log Number":"US-09162010-0016","Summary":"Reddish orange tube of light floating near a tree in my back yard.","Latitude":"39.012757","Viewing Distance":"Unknown","Region":"Missouri","Date of the Event":"05/29/2010 02:21 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.012757,+-94.454894(25468)&iwloc=A&hl=en\"> mufon case (25468) map </A>","Tags":"City","Source":"MUFON"}