{"Log Number":"US-09172010-0002","Longitude":"-116.960927","Object Flight Path":"Undisclosed","Country":"United States","Date Submitted":"09/17/2010 12:19 UTC","Object Shape":"Star-like","Region":"California","Object Features":"Undisclosed","Case Number":"25471","Viewing Distance":"Unknown","Summary":"Bright, steadily moving, star-like object during noonday, approaching high from the northwest, slowing to a stop overhead then diminishing upward 3 min. later.","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/25471.html.txt","/var/www/straped/mufon/org/25471.html"],"Tags":"City","Latitude":"32.797223","City":"El Cajon","Source":"MUFON","Date of the Event":"09/16/2010 12:10 UTC","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around September 16th 2010"],"divs":["Sighting DetailsI first noticed the UFO from an upstairs window with a panoramic view of the western and northern skies, which were clear with good visibility. At 12:20 p.m., I spotted a brightly luminous object steadily moving from the northwest toward the skies over my house, but at what seemed a fairly high altitude. My best \"guestimate\" about the distance it covered, from the point I first saw it to the point it disappeared, is perhaps 15 miles. I live near a small airfield (Gillespie Field, El Cajon), so I am accustomed to seeing light aircraft and copters from different angles an on different paths of approach; however, this object did not take on the recognizable shape of aircraft commonly seen over El Cajon. Although I expected it to become recognizable as a helicopter, instead it retained its star-like, spherical shape and intensified in brightness as it drew closer. After it glided eastward, I considered it might be a weather balloon, but it seemed to slow down and \"park\" in the skies almost directly overhead (very slightly northwest of me). I observed the object through windows with seamed panels and used these like cross-hairs to see if the object were wavering or if it were actually moving slowly away, but it wasn't. It just looked like it had come to a complete stop. There it remained, overhead, in the same stationary position, for about three minutes, where its general brightness and size resembled that of Venus (but, of course, against the bright blue of noonday). In the last thirty seconds or so, it faded from view but, once again, without moving in any direction. Rather, it seemed to diminish from the sky as if it were traveling upward and out of view. By 12:15 p.m., the event had ended. Sadly, I didn't have a camera within reach and didn't risk leaving to retrieve one in case I lost sight of the object; if it moved, I wanted to witness that as well. All I have is this eyewitness account, unfortunately. I'm hoping other people saw this \"broad daylight\" event and reported it."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.797223,+-116.960927(25471)&iwloc=A&hl=en\"> mufon case (25471) map </A>"}