{"Longitude":"-104.521884","map":"<A HREF = \"http://maps.google.com/maps?q=33.401836,+-104.521884(25476)&iwloc=A&hl=en\"> mufon case (25476) map </A>","Latitude":"33.401836","Object Flight Path":"Straight-line path","Tags":"City","Region":"New Mexico","Date of the Event":"09/16/2010 06:15 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsIt was about to rain last night so I decided to sit out on my balcony and read my book, enjoying the evening. The clouds looked pretty dark and ominous, so I took a closer look. This was just after 6 pm, maybe 6:15. I saw, then, under the cloud cover a dark object. I was startled, but tried to think as logically as I could. It appeared to be spherical in shape, but it was quite far away. I would say it was about the size of a pencil eraser if I was to hold that up to the sky. It was either black, or dark grey. As I watched I could see that it was rotating around a central axis. I know it wasn't a bird because it wasn't moving, at least not flying across the sky. It wasn't an airplane or a helicopter because there were no lights. It did move slowly through the sky....by the time I lost sight of it, it had moved from the north-east to the north-west. But it took about 10 minutes for it to move that far. I lost sight of it when I went inside, down the stairs, and out the front door to get a better look. I couldn't find it again. I did call my daughter out to see it, and she saw it as well. We both had feelings of awe and excitement. The only think I could think of that it might have been would be a balloon, but then again I don't think that is how a balloon would move, especially underneath the storm clouds."],"Object Shape":"Sphere","Log Number":"US-09172010-0003","Weather Factors":"Windy, Rain, Light","Source":"MUFON","Date Submitted":"09/17/2010 09:54 UTC","Country":"United States","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around September 16th 2010"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/25476.html.txt","/var/www/straped/mufon/org/25476.html"],"Sighting Duration":"Undisclosed","City":"Roswell","Summary":"I saw a dark sphere shape underneath the cloudcover. As I watched I noticed it wasn't moving around, but was rotating.","Case Number":"25476"}