{"City":"Caseyville","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"Reddish orange ball in sky seen in Caseyville, IL","trends":["There have been 4 other sightings in Caseyville","There were no other sightings in Caseyville on or around August 25th 2010"],"Disposition":"IFO","Weather Factors":"Unknown","Date of the Event":"08/25/2010 10:30 UTC","Latitude":"38.644136","Log Number":"US-09172010-0006","Longitude":"-90.024261","Object Features":"None","Region":"Illinois","divs":["Sighting DetailsI was on my way home, on Milburn School House Road in Caseyville, IL when I saw a HUGE reddish orange fireball like object in the sky. I saw it 2 nights in a row at about the same exact time each night. I was only about 3 minutes away from my house and was driving alone. There was one car on the road ahead of me. Scott Airforce Base is about 25 minutes away. I just went home. I did not pull over on the side of the road or drive closer to the object. I am not sure what 2 nights I saw the ball in the sky but it had to be between August 20 - 27th. Both times it was around 10:30pm - 11pm. I have previously reported 2 other UFO sightings to MUFON over the past couple years in this same exact area. There are 3 more sightings I have not reported but will do so after I submit this report. This is the same area the famous 2000 UFO was chased by 4 or 5 police cars. My first thought was the giant ball was a UFO but then I decided it must be something on a building or tower. The next night I saw the very same thing. On Sept 15th I saw another ball in the sky so I checked out your sight and NUFROC and see that there have been several sightings of these balls around the country as well as my area which is 15 minutes from St. Louis. I guess some people reported seeing these balls on the 4th of July in the St. Louis area. You can contact me but please keep my name, address and phone number off of your sight and the Internet."],"Source":"MUFON","Case Number":"25479","Object Shape":"Fireball","Date Submitted":"09/17/2010 03:02 UTC","files":["/var/www/straped/mufon/html2text/25479.html.txt","/var/www/straped/mufon/org/25479.html"],"Country":"United States","Tags":"City","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=38.644136,+-90.024261(25479)&iwloc=A&hl=en\"> mufon case (25479) map </A>"}