{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.668077,+-117.997506(25488)&iwloc=A&hl=en\"> mufon case (25488) map </A>","Source":"MUFON","Object Shape":"Square, Rectagular","Region":"California","Case Number":"25488","files":["/var/www/straped/mufon/html2text/25488.html.txt","/var/www/straped/mufon/org/25488.html"],"Date Submitted":"09/18/2010 12:37 UTC","Latitude":"33.668077","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Tags":"City","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around September 17th 2010"],"Object Features":"Unknown","divs":["sighting detailsdriving down pch from sunset beach towards huntington beach after a nice dinner. suddenly my teenage daughter pointed out a flying object which we had seen last week too coming from the ocean side above the back bay in newport beach going inland, this time we saw a similar object also coming from the ocean side: on the bottom rectangular shaped with white lights on the bottom, which roll sometimes from one side to another, some of them blinking on and off, almost like a thin flying carpet (to describe the shape) with a red light towards the back and maybe towards the top. could not see the shape in the dark. blinking lights on top sometimes. it was flying above the water then changed direction, flew inland, moved to its side sometimes and then it flew north until we could see it no longer. we were amazed to see this object again one week later. then headed home until to our surprise we saw another one about 3 minutes later, also coming from the ocean side south of huntington beach (it was probably above the back bay again, pretty far to see from where we were) and going inland and then it disappeared. the speed of these flying objects seem to change too. is there something like this that we know of? it was definitely not a plane, a blimp (which goes slowlier) or a helicopter. who knows what it was? we drive often in the evenings but have never seen anything like this. sounds like these objects seen by others: [links moved to additional evidence section\\cms\\tg] i was driving and had no camera with me, too bad."],"City":"Huntington Beach","Log Number":"US-09182010-0001","Disposition":"IFO","Date of the Event":"09/17/2010 08:28 UTC","Longitude":"-117.997506","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Summary":"2 rectangular flying objects with red light towards back/top"}