{"Log Number":"US-09172010-0008","Country":"United States","Longitude":"-75.126364","Object Shape":"Triangle, Other","Source":"MUFON","Date Submitted":"09/17/2010 04:59 UTC","files":["/var/www/straped/mufon/html2text/25481.html.txt","/var/www/straped/mufon/org/25481.html"],"Latitude":"40.313086","Tags":"City","Object Flight Path":"Stationary,Path with directional change","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around June 30th 1983"],"City":"Doylestown","Disposition":"Insufficient Data","Summary":"4-6 orange stationary objects seen in Doylestown, PA in July 1983.","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"06/30/1983 12:00 UTC","Region":"Pennsylvania","Weather Factors":"Unknown","divs":["Sighting DetailsThis happened about 25 -27 years ago. I think the year was 1983 but it could have been 1984 - 1985. It was in the evening in the summer in Doylestown, PA. I went outside and in the sky in my neighborhood there were 4-6 orange objects in the sky. I can't remember if they were diamond or triangle. These objects were not crafts. I would describle them as lights. They were stationary for awhile but then moved around in the same spot. My parents and brother witnessed these orange objects too but none of us can remember the details. I would have been 11 - 13 years old. I was afraid so my dad had us all go inside. I don't know how long the objects were there or how they disappaered. Other people in the area reported these objects and the newspaper wrote an article stating they were weather balons. Nobody seemed to buy it. This started my life long fear of UFO's. I have reported other sightings to MUFON (all in IL)but just decided to report this one because I see that other people have reported things from many years ago. I guess the more people report the better!"],"Object Features":"None","Case Number":"25481","map":"<A HREF = \"http://maps.google.com/maps?q=40.313086,+-75.126364(25481)&iwloc=A&hl=en\"> mufon case (25481) map </A>"}