{"files":["/var/www/straped/mufon/html2text/25482.html.txt","/var/www/straped/mufon/org/25482.html"],"Weather Factors":"Unknown","Case Number":"25482","Longitude":"-85.176454","Object Features":"Undisclosed","Tags":"City","Disposition":"Unknown","Date Submitted":"09/17/2010 05:03 UTC","trends":["There have been 15 other sightings in Battle Creek","There were no other sightings in Battle Creek on or around March 1st 2010"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","divs":["Sighting DetailsWe were let off work around 6pm et. I dropped off 2 coworkers and headed west on Columbia Ave toward Fort Custer Air Base. I noticed directly above FCAB 2 jets circling around what appeared to me to be an orange cloud. It wasnt strange until I got by Exit 92 on I-94 going towards Kalamazoo, MI that I noticed this cylindrical cloud was now south of the Air Base just south of I-94 and now it appears to be almost doughnut shaped with what appeared to be a dark center to the object. This anomoly was huge and went from a southward direction to a westward direction in a matter of seconds. By the time I had reached Exit 85 in Galeburg, MI this \"cloud\" had already passed Kalamaoo by my estimation and seemed to be following I-94 towards Chicago. I arrived at work the very next day and begun to tell my story to a few co-workers when my manager stepped in and admitted she had witnessed the same thing at Exit 92 in Battle Creek and she had called her mother by cell and her mother had also seen the object from Exit 100 in Battle Creek, MI. Only differnce was they did not see the jets that I seen circling the object minutes before. I have never seen such an object in the sky as large as this. I had no fear of the object whatsoever, the object to me appeared to not be perfectly round either. I have looked and looked at multiple supposed pictures and video of UFO sightings and the only object I have found close to resembling this object was a Youtube video I seen of what is called the \"HAARP\" program. My co-worker and her mother believe they seen muliple colors, what I seen was a Violent Orange and made the FCAB jets look like pin points in the sky. I believe the jets were A-10's, not 100% sure on that. Whatever this \"cloud\" was caught not only my attention, but also the attention of a co-worker, her mother and I know for a fact 2 pilots at FCAB!"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.329042,+-85.176454(25482)&iwloc=A&hl=en\"> mufon case (25482) map </A>","Log Number":"US-09172010-0009","Object Shape":"Sphere","Country":"United States","Latitude":"42.329042","Date of the Event":"03/01/2010 06:30 UTC","City":"Battle Creek","Viewing Distance":"Unknown","Region":"Michigan","Source":"MUFON","Summary":"Short day at work noticed 2 jets circling what first appeared to be orange cloud headed southward then turning 90 degrees westbound."}