{"Date Submitted":"09/17/2010 11:42 UTC","Object Shape":"Triangle","Log Number":"US-09172010-0014","Summary":"Three Red Lights in Western Sky Tinley Park IL","Date of the Event":"09/17/2010 09:56 UTC","Region":"Illinois","Latitude":"41.574637","Country":"United States","Longitude":"-87.781554","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/25487.html.txt","/var/www/straped/mufon/org/25487.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.574637,+-87.781554(25487)&iwloc=A&hl=en\"> mufon case (25487) map </A>","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around September 17th 2010"],"Disposition":"Unresolved","divs":["Sighting Details@ 9:50pm I took my two dogs outside for the last time for the night. As I was standing there facing west, I clearly saw 3 red lights in the form of a triangle moving towards the NorthEast. It is extremely clear out at this time. My initial thought was \"WOW They are Back.\" I sprinted inside and looked at the clock to confirm the sighting time. 9:56pm. I literally jumped out of my shoes and scared the hell out of my wife who was brushing her teeth. After a few moments, maybe 60-70 seconds, she found the video camera and I raced back out side, her following as she had seen them the Halloween night as well. Much to my dissapointment, the lights were no place to be found. My wife gave up looking after a few minutes and said call her if I see them again. Standing outside, I noted the conditions. What stood out right away to me was the complete lack of air traffic in my area. There are always planes somewhere to be seen in the sky. Nothing. Not a sound. After about 10 mins I gave up but I did notice that as I was coming in, planes began to appear again. It stood out because it was so odd to me. Night was crisp (65deg) and skies were clear with a light haze to the west. I believe Mars was in the western sky low on the horizon. But the Lights I saw were clearly much closer and could no way be interpreted as being a part of what I saw."],"Source":"MUFON","Object Features":"None","Tags":"City","City":"Tinley Park","Case Number":"25487","Sighting Duration":"Undisclosed"}