{"Disposition":"Insufficient Data","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path","divs":["sighting detailsi was talking on the phone in my back yard and saw something strange rising in the sky to the south. i ran to get some binoculars. i found the object and concluded quickly that it was a string of about six balloons. while looking at the balloons though, another object or two crossed within view. it was two large dim lights moving fairly quickly in tandem to the north. when i took the binoculars from my eyes i couldn't see the lights. i couldn't see any other form holding the lights together. they stayed in a fixed pattern and i thought they must be connected by a craft that was not visible in the current lighting conditions. the sky was still somewhat light but changing to night. dusk. i followed the two lights with the binoculars for about 15 seconds and it faded from view in the atmosphere. these lights were uniform in brightness and did not blink or strobe. if these balloons were 1\\2 mile away looking through the binoculars these lights individually were perhaps ten times larger than a single balloon in comparison. i didn't see the lights pass behind the balloons but my feeling is that they were much higher. the distance between the lights compared to the length of the balloon string was about five times longer than the six balloons tied in a line."],"Object Shape":"Circle, Unknown","Case Number":"25492","files":["/var/www/straped/mufon/html2text/25492.html.txt","/var/www/straped/mufon/org/25492.html"],"Viewing Distance":"Unknown","Log Number":"US-09182010-0005","Object Features":"None","City":"Orem","Date of the Event":"09/03/2010 12:00 UTC","Longitude":"-111.693258","Latitude":"40.301988","Date Submitted":"09/18/2010 12:11 UTC","Country":"United States","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Orem","There were no other sightings in Orem on or around September 3rd 2010"],"Summary":"Sighted Two Large Dim Lights in tandem Travelling North Overhead","Region":"Utah","map":"<A HREF = \"http://maps.google.com/maps?q=40.301988,+-111.693258(25492)&iwloc=A&hl=en\"> mufon case (25492) map </A>","Sighting Duration":"Undisclosed"}