{"divs":["sighting detailswhile photographing a vintage car race at pacific raceways near auburn washington, i heard an airliner climbing after take off from the seattle airport. i looked up to locate the airliner and decided to take a picture of it. while taking the photo of the airliner, i noticed a bright spot in the sky. after taking the airliner photo, i tried to find the bright spot. it was gone. i kept looking and saw it reappear. aimed the camera at the spot and took a picture. the spot did not appear to be moving. was going to take a second picture but the spot was gone and did not reappear. i thought it was a wayward helium balloon of some sort. the strange thing was once i tried to take another photo of the race, the camera's autofocus no longer worked. i had to turn off the camera and remove\\reattach the lens to get things working again. once i got home and downloaded the photos, i checked this image closely and decided it did not look like a helium balloon. my camera is a professional level canon with a high quality telephoto lens. canon 1dmkii with a 70-200 2.8 telephoto and a 2x extender giving a total of 400mm. i have the series of photos showing the airliner, the bright object and the empty sky plus one where the focus failed."],"files":["/var/www/straped/mufon/html2text/25499.html.txt","/var/www/straped/mufon/more/25499_submitter_file1__HQ8R0424.JPG","/var/www/straped/mufon/org/25499.html"],"Tags":"City","Case Number":"25499","Disposition":"Unknown","Date Submitted":"09/19/2010 01:56 UTC","Viewing Distance":"Unknown","Date of the Event":"09/18/2010 01:21 UTC","Object Features":"Other","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Region":"Washington","Longitude":"-122.219783","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 12 other sightings in Auburn","There were no other sightings in Auburn on or around September 18th 2010","This sighting has never been favorited.",""],"Log Number":"US-09192010-0005","Country":"United States","Latitude":"47.317233","Summary":"Observed bright spot in clear sky","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=47.317233,+-122.219783(25499)&iwloc=A&hl=en\"> mufon case (25499) map </A>","City":"Auburn"}