{"Longitude":"-118.293922","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.7979,+-118.293922(25496)&iwloc=A&hl=en\"> mufon case (25496) map </A>","Latitude":"33.7979","Object Shape":"Star-like","Log Number":"US-09192010-0002","files":["/var/www/straped/mufon/html2text/25496.html.txt","/var/www/straped/mufon/org/25496.html"],"Case Number":"25496","trends":["There have been 404 other sightings in Los Angeles","There were 4 other sightings in Los Angeles on or around September 19th 2010"],"Disposition":"Insufficient Data","Date Submitted":"09/19/2010 04:48 UTC","Region":"California","Date of the Event":"09/19/2010 12:00 UTC","Summary":"Orange colored sphere(star like) object emits spectacular strobe lighting","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt's back again. Tonight just like all the other times (4 times) I have had the pleasure of witnessing this phenomenon, in the Harbor City area of Los Angeles. Its appears high up, (6,000-10,000ft), always slow moving (5-10mph), and frequently just hangs there in the sky, stationary. Eventually drifts off on it's merry old way somewhere else. Tonights sighting was special because it emitted a strobe effect that lasted for about 10 seconds. It did this twice, and I have to say that effect was spectacular. Wow. About 12 weeks ago, after watching it meander for about 20 minutes, there was another different happening. As it hung there in the sky, another one of it's friends faded in (from outer space?)maybe to say hello. After a minute they both faded away, maybe they decided to share a tea break together! I just find it hard to accept the US military or any other military for that matter, would allow for any of its officers to to fly or control anything, wasting so much public funds on such stupid innane behaviour. Anyway, given the amount of sightings from the US and Europe. Anyway, it seems these orange orbs don't recognize international boundaries. It just doesn't make any sense. Can't wait to see the next show!"],"City":"Los Angeles","Object Features":"Undisclosed","Country":"United States","Weather Factors":"Unknown"}