{"Disposition":"Insufficient Data","Latitude":"32.726499","City":"Fort Worth","Object Flight Path":"Undisclosed","Log Number":"US-09182010-0006","Date Submitted":"09/18/2010 05:10 UTC","Region":"Texas","Summary":"saw in sky","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around September 18th 2010"],"Date of the Event":"09/18/2010 02:05 UTC","divs":["Sighting Detailsi am 49 years old and sense i was 8 or 9 i have seen things. every time i have seen something in the sky it has always been very close. always about a 100 yards or closer. this has been going on all my life i wished it never happened ever i mean ever. what i have seen lately is a boomerang shape allways at night. i have hade many more things happen but i wont write them down for just anyone to read. i will talk to someone but only in private. please if you can give me any insight it would give me peace of mind god knows i could use some. i dont wish for the world to know my personal busness. but i need to tell my story to someone. if not i will continue to keep all this to myself. like i have done my whole life. what i saw over my house has happen before. it is allways quite and very large. about 500 hundred feet wide and allmost clear with very slow moving and just go away very fast. i would love to tell someone about my childhood experances but only in a private setting. i dont care if anyone belives me or not i know it is all true. i dont want to be made a joke of so belive it or not i dont care. i know it is real and i know it it will contiue to happen to me. i know why so many people keep this kind of storys to themselfs. i dont know why i tell this story now but such is life. i guess"],"files":["/var/www/straped/mufon/html2text/25493.html.txt","/var/www/straped/mufon/org/25493.html"],"Sighting Duration":"00:02:00","Case Number":"25493","Object Features":"Undisclosed","Tags":"City","Object Shape":"Boomerang","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.726499,+-97.31291(25493)&iwloc=A&hl=en\"> mufon case (25493) map </A>","Longitude":"-97.31291","Source":"MUFON"}