{"files":["/var/www/straped/mufon/html2text/25490.html.txt","/var/www/straped/mufon/org/25490.html"],"Source":"MUFON","Disposition":"IFO","City":"Henderson","Country":"United States","Longitude":"-114.976811","Sighting Duration":"Undisclosed","Log Number":"US-09182010-0003","Region":"Nevada","Summary":"Gliding Triangular Shape","Weather Factors":"Unknown","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=36.040615,+-114.976811(25490)&iwloc=A&hl=en\"> mufon case (25490) map </A>","Latitude":"36.040615","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Date of the Event":"09/17/2010 11:14 UTC","Date Submitted":"09/18/2010 03:12 UTC","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around September 17th 2010"],"Object Features":"Unknown","Tags":"City","Case Number":"25490","divs":["Sighting DetailsMy husband and I were sitting out in our backyard stargazing at 11pm tonight. I looked up and saw the 3 lights high in the sky above our home...I alerted my husband and he caught sight of it as well. We know it was not an airplane or military jet as we live on the McCarran flight path and are familiar with planes. This object was much higher in the sky than jets or commercial planes could travel. The object was triangular in shape with 3 lights. The lights were a faint white-light yellowish tinge color. The object literally glided across the sky, completely silent, for approximately 20 seconds. The space between the 3 lights was open, to where I could see the stars in between the lights as they moved. It was almost as if the 3 lights were independent of eachother but formed a triangle. I watched it the entire 20 seconds and it seemed to slowly fade away the farther it got. My husband ran inside to get our camera, but by the time he got back the object was gone. First time we've seen anything like this and we stargaze alot. Seen a ton of satellites. This was definitely something I can't explain."]}