{"Region":"Montana","Longitude":"-112.004433","divs":["Sighting Detailshaving FUN while writing a fony story about people and what they do withthemselves at night. so i finnished it and an alien mooned me through my windowmy friend bob was mezmerized and started making out with it until i told himthat he was making out with its butt. he turned and looked at me with achocolate mustash he laughed and continued then a giant blue light shown throughthe window the next thing i knew i was being extreamly violated it was rapeingbob and jeffry but bob still seemed to like it every time it stoped he wouldyell LLLLLLLLLLOOOOOOOOOOONNNNNNNNNNGGGGGGGGEEEEEEEERRRRRRRRRRRso jeffry ran to one feeling jelous and started making out with another oneuntill ii told him it was a guy. he looked content and stardted again so any waywe were having fun righting a phony article to some phony web sit titledohiomufon.com and wondering if it was a gouvernment sight so we startedwrighting this story that kind of like this having FUN me and my friends werewriting a phony story called what people do with there dogs at nightso ifinnished it and an alien mooned me through my windowmy friend bob was mezmerized and started making out with it until i told himthat he was making out w"],"Object Flight Path":"Stationary","Country":"United States","files":["/var/www/straped/mufon/html2text/2550.html.txt","/var/www/straped/mufon/org/2550.html"],"trends":["There have been 9 other sightings in Helena","There were no other sightings in Helena on or around September 8th 2002"],"Tags":"City","Viewing Distance":"20 Feet or Less","Date Submitted":"09/08/2002 01:09 UTC","Source":"MUFON","Date of the Event":"09/08/2002 01:09 UTC","Object Shape":"Cylinder","Disposition":"Hoax","Latitude":"46.574506","Log Number":"","Summary":"it raped me","map":"<A HREF = \"http://maps.google.com/maps?q=46.574506,+-112.004433(2550)&iwloc=A&hl=en\"> mufon case (2550) map </A>","City":"Helena","Object Features":"Window(s), Wings, Other","Weather Factors":"Windy, Lightning, Fog, Light","Case Number":"2550","Sighting Duration":"01:59:00"}