{"Source":"MUFON","Date Submitted":"09/19/2010 10:01 UTC","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=33.533746,+-82.130675(25501)&iwloc=A&hl=en\"> mufon case (25501) map </A>","Tags":"City","City":"Evans","Summary":"Stationary Orange bright object","Case Number":"25501","Country":"United States","Object Features":"Other, Unknown","Latitude":"33.533746","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/25501.html.txt","/var/www/straped/mufon/org/25501.html"],"Longitude":"-82.130675","trends":["There have been 15 other sightings in Evans","There were no other sightings in Evans on or around September 19th 2010"],"divs":["Sighting DetailsWhilst taking out a vaccuum bag to empty it, I came to notice a vry bright orange \"star\" in the sky. I thought of it as polaris (the northern star) and disregarded it. Soon, however, it came to my attention that the light was not in the north direction but instead, it was southeast. Checking a compass, I confirmed my suspecion. What struck me as odd though, was the fact that I had observed a similar object previously in virginia while on vacation. I went and got my dad. We are both UFO enthusiasts and watch programs on TV whenever we can. He took a look at it and (as I did) disregarded it. Until, that is, it began moving. First, it moved right (eastward) and then began descending. Quickly, my father, my little sister, and I jumped into our truck and took off, chasing the object. We soon came to a position where we could get a clear view. We had a cheap Meade telescope with us and set it up on the truck. The object continued it's descent and we frantically sifted through lenses, finally finding on with the correct zoom, etc. As I looked through the lense, I saw that the object had three distinct colors to it (this may, however, be due to the lense), the colors being, red, white, and green. Again, the object moved down. We jumped back in the truck and followed the light to the intersection of Hereford Farm and Columbia road. We followed where we thought it would be but could not locate it. Just as we were leaving (and on the phone with Mufon) two helicopters (very close together) flew over us to where we orignally spotted the craft. One went on to Fort Gordon and the other made multiple passes over the area. During the initial experience, I was stunned and amazed. You never know when you will see something like that. When the helicoptors flew over, however, I got a conformation of my feelings. They seemed to be scanning, searching."],"Viewing Distance":"Over One Mile","Object Flight Path":"Other","Sighting Duration":"00:15:00","Date of the Event":"09/19/2010 08:20 UTC","Log Number":"US-09192010-0007","Weather Factors":"None","Disposition":"Insufficient Data"}