{"files":["/var/www/straped/mufon/html2text/25503.html.txt","/var/www/straped/mufon/org/25503.html"],"Longitude":"-83.402988","trends":["There have been no other sightings in Huron Charter Township","This sighting has never been favorited."],"Case Number":"25503","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.162541,+-83.402988(25503)&iwloc=A&hl=en\"> mufon case (25503) map </A>","divs":["Sighting DetailsOUR SON CAME INTO THE HOUSE FROM THE NEIGHBOR'S BON-FIRE AND SAID HE SAW 3 ORANGE LITES IN THE SKY AS HE WAS COMING HOME. MY WIFE AND I WENT OUTSIDE IN FRONT OF OUR HOUSE WITH OUR SON AND WE SAW THE SAME 3 ORANGE LITES IN A STRAIGHT LINE APPROXIMATELY ONE MILE APART MOVING FROM THE NORTH TO THE SOUTH JUST EAST OF DETROIT METRO AIRPORT. THERE WAS A BROKEN CLOUD DECK AT APPROX. 3000-4000 FT. THE LITES WERE BELOW THE CLOUD DECK WHEN FIRST OBSERVED. I FIRST THOUGHT THEY WERE AIRCRAFT LANDING LITES BUT THEY WERE NOT THE NORMAL COLOR OF AIRCRAFT LANDING LITES. I WENT BACK INTO THE HOUSE AND GOT MY BINOCULARS AND CAME BACK OUTSIDE AND LOOKED AT THE LEAD LITE WITH MY BINOCULARS. THERE WERE NO AIRCRAFT MARKER OR STROBE LITES FLASHING IN THE VICINITY OF THE LEAD LITE, LIKEWISE FOR THE OTHER TWO ORANGE LITES. I STEADIED MY ELBOWS ON MY SON'S TRUCK ROOF AS I OBSERVED THE LEAD ORANGE LITE MOVE FURTHER SOUTH. THERE WAS NO SOUND OF AN AIRCRAFT ENGINE. AT ABOUT THE ONE O'CLOCK POSITION THE LEAD LITE ENTERED THE CLOUD DECK. THE CLOUD DECK SLOWLY OBSCURED THE LITE AS IT ASCENDED INTO THE CLOUD DECK. THE SECOND AND THIRD BRITE ORANGE LITES FOLLOWED THE SAME PATH AS THE FIRST INTO THE CLOUD DECK. NO FURTHER OBSERVATIONS OF THE LITES WERE MADE. THE MOON SHONE IN THE SOUTHERN SKY BEHIND THE BROKEN CLOUD DECK. I WAITED ABOUT ANOTHER 5 MINS TO SEE IF THE ORANGE LITES WOULD REAPPEAR IN THE VICINTY OF THE MOON BUT THEY DID NOT. WE WENT BACK INSIDE THE HOUSE FOR THE REST OF THE EVENING. WE DISCUSSED WHAT WE HAD SEEN AND NOTED THAT NONE OF US HAD HEARD ANY AIRCRAFT ENGINE SOUNDS DURING THE WHOLE INCIDENT AND THERE WERE NO AIRCRAFT MARKER LITES OBSERVED."],"Log Number":"US-09202010-0001","Object Flight Path":"Straight-line path","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Object Features":"Unknown","Disposition":"Unknown","Tags":"City","Object Shape":"Unknown","Summary":"a series of 3 brite orange lites moving in a straight line about 1 mile apart.","Date of the Event":"09/18/2010 10:40 UTC","Region":"Michigan","City":"Huron Charter Township","Source":"MUFON","Latitude":"42.162541","Date Submitted":"09/20/2010 10:19 UTC","Weather Factors":"None"}