{"Disposition":"Unknown","Summary":"Triangular shaped brite lights hovering in sky. Smoke or fog with light trails.","divs":["Sighting DetailsMy husband noticed the bright 'star' at about 5:50 a.m. in a westerly direction from our bedroom. After deciding it couldn't be a helicopter, airplane or blimp I decided to take notice. I was suprised to see that what he was looking at was the same thing I had noticed the night before. It was the same bright lights in a southerly direction from our bedroom the night before but quickly dismissed since I had had a sighting a few months ago. I didn't want to know. However, this time I couldn't resist watching in an attempt to 'figure it out'. I began to watch the triangular shaped object with one very prominent light that turned red, then back to white. The object hovered in the same location above the tree line then took off in a slow but purposeful southerly direction where it hovered and moved back and forth for about twenty minutes (above and between two trees) before slowly moving away in the distance at 6:31 a.m. Most notable was the appearance of the object. A couple times I noticed what appeared to be a fog or smoke surrounding the object with long trails of lights much like tentacles. The most prominent light was very bright fading in and out. There were lights around the primary light which gave me the opinion it had to be triangle in shape. I watched with disappointment as the object moved away from me in a westward direction. It finally disappeared behind the trees at 6:31 a.m. as it began to get light out. I was disappointed to see it leave. I want to know more."],"Sighting Duration":"Undisclosed","Tags":"City","Case Number":"25513","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"09/21/2010 05:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.387713,+-85.347065(25513)&iwloc=A&hl=en\"> mufon case (25513) map </A>","Date Submitted":"09/21/2010 08:46 UTC","City":"Cadillac","Object Flight Path":"Path with directional change","Weather Factors":"None","Latitude":"44.387713","Longitude":"-85.347065","Country":"United States","files":["/var/www/straped/mufon/html2text/25513.html.txt","/var/www/straped/mufon/org/25513.html"],"Region":"Michigan","Object Shape":"Triangle, Other","trends":["There have been 9 other sightings in Cadillac","There were no other sightings in Cadillac on or around September 21st 2010"],"Source":"MUFON","Log Number":"US-09212010-0006"}