{"files":["/var/www/straped/mufon/html2text/2551.html.txt","/var/www/straped/mufon/org/2551.html"],"Longitude":"-117.715521","Date of the Event":"09/16/2003 09:15 UTC","divs":["Sighting DetailsOn the 16 of Sept I was on temporary duty with the air force talking on a cellphone to my wife when i noticed blinking lights at about 5000ft approx 10 milesaway that remained in one place. I fly on military helicopters and the lightsequence and hover height didnt seem right. I got my friends, a paramedic,survival instructor, chaplain. Using binoculars we saw four to five lights thatwere arranged in a square or diamond if object moved. It would stay still for10 min, then move out of view. We thought it was gone. Within minutes it hadreturned. The lights would blink red, blue, green, white randomly or flashingbut not like plane or helicopter. I know we had no helicopters operating atthat time because i would have been on it. We were confused and shocked becausewe couldnt explain it. It would also appear to dart around. Ive spent longperiods outside at night and in the past have thought stars darted around. Thiswas different. The next night the same thing happened but in a differentlocation in the sky. This was witnessed by two new witness. a doctor ofpsychology and a chief master seargent. They agreed it was unexplained. It wassuggested at the time to call the local sheriff but dismissed as stupid idea. Any ideas you have to shed light on this sighting would be appreciated. Thanks,Dennis Hooten"],"Disposition":"Unknown","Case Number":"2551","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=48.276287,+-117.715521(2551)&iwloc=A&hl=en\"> mufon case (2551) map </A>","trends":["There have been 4 other sightings in Chewelah","There were no other sightings in Chewelah on or around September 16th 2003"],"Object Shape":"Star-like","Source":"MUFON","Date Submitted":"09/16/2003 09:15 UTC","Weather Factors":"Unknown","Sighting Duration":"00:30:00","Tags":"City","Region":"Washington","Object Flight Path":"Hovering then path","City":"Chewelah","Log Number":"","Object Features":"Undisclosed","Summary":"multicolored lights","Latitude":"48.276287","Country":"United States"}