{"Case Number":"25522","City":"Dowagiac","Log Number":"US-09222010-0006","Viewing Distance":"21-100 Feet","trends":["There have been 3 other sightings in Dowagiac","There were no other sightings in Dowagiac on or around June 30th 1984"],"Country":"United States","Source":"MUFON","Disposition":"Unknown","Region":"Michigan","Latitude":"41.991102","Tags":"City","Date Submitted":"09/22/2010 02:18 UTC","Sighting Duration":"Undisclosed","Object Features":"None","files":["/var/www/straped/mufon/html2text/25522.html.txt","/var/www/straped/mufon/org/25522.html"],"divs":["Sighting DetailsI was on my way home after a doctor's appointment in town in the early afternoon in the summer of 1984. I lived in southwestern Michigan at the time. I first saw the flying object soon after I turned on a road which led four miles to my home. It was a beautiful sunny day without hardly a cloud in the sky. I saw a reflection in the corner of my left eye. I looked up at the tree line as I was traveling 45 mph. I was stunned to see a cigar shaped object reflecting rays from the sun. I could plainly distinguish a beautiful mirror like surface. I saw no wings,no port holes, no fins, no rudders,and no seams. It appeared to be one solid flying object. I became fearful and speeded my car up to 55 mph and then 60, 65, 70, 75, 80, and last 85 mph. The craft accelerated each time I did, which caused sheer panic to sweep over me! I had to slow down shortly after reaching 85 mph since my house was in view. The craft slowed down and stopped across the street at the tree line. I blew my horn and the baby sitter (16 years old neighbor girl) and my three children and nephew ran out of the house to witness the craft accelerating up and down at the tree line and just across the road only a few feet from our home. Out home was close to the main road, and the craft hovered just across the street. As we stood gazing in awe the noiseless craft turned and began to slowly move northwest. I will never forget the lady that looked straight up as she drove her car past our home. She was fixated on the strange craft and I feared she would run into a tree. I was astounded at what we had witnessed that sunny afternoon. It is forever etched in my memory. The craft was unlike anything I have ever seen in this world. I have no idea what it was."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.991102,+-86.106853(25522)&iwloc=A&hl=en\"> mufon case (25522) map </A>","Date of the Event":"06/30/1984 12:00 UTC","Longitude":"-86.106853","Object Shape":"Cigar","Object Flight Path":"Straight-line path,Path with directional change","Summary":"Mirror like surface. Closely shaped like a cigar. No port holes, no fins, rudders, or seams. Approximately 40 feet long."}