{"Case Number":"25520","Summary":"star light object liminated red","Latitude":"41.919824","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around September 22nd 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=41.919824,+-88.303287(25520)&iwloc=A&hl=en\"> mufon case (25520) map </A>","divs":["Sighting DetailsI was up working on a buisness plan when I decided to get some water on my return to the room I observed what was a red star like object out the window I got up open up the curtain to get a better look. Since in the past 9 days I had 2 sightings and I had a hunch it could be the same object. As I started at it to confirm if it was it, it stayed stationary for another 20 seconds or so then it shift to the left just enough to notice it moved and then remained stable for like 10 seconds suddenly it got bright red and lite up like those signs in Las Vegas, then it dimmed and faded for like 10 seconds, then it light up again but back to the initial way I 1st seen it, and then started heading southbound as it moved it was lighting up red and then visible ligths around it gave it an impressing to be a round but saucer shape object. It headed south and I thought I was recording to find out the batteries were dead, although I did manage to snap several pictures along with a :45 second video..."],"Longitude":"-88.303287","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/25520.html.txt","/var/www/straped/mufon/more/25520_submitter_file1__09-236am-2.jpg","/var/www/straped/mufon/more/25520_submitter_file2__hovering.jpg","/var/www/straped/mufon/org/25520.html"],"Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Log Number":"US-09222010-0004","City":"St Charles","Region":"Illinois","Date Submitted":"09/22/2010 07:01 UTC","Date of the Event":"09/22/2010 12:00 UTC","Object Shape":"Circle, Star-like","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Object Features":"Dome"}