{"City":"Phoenix","Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile","Region":"Arizona","Latitude":"33.450077","Date Submitted":"11/30/1977 11:00 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/2552.html.txt","/var/www/straped/mufon/org/2552.html"],"Case Number":"2552","Country":"United States","Longitude":"-112.066917","Weather Factors":"None","Source":"MUFON","divs":["Sighting Detailsmy friend and i were sitting on a wooden jungle jim behind moon mt. elementry school talking late at night. it was a calm very quiet night. i believe it may have been in fall. for some reason i looked up at the stars . we lived at the edge of the desert with a mountian to the east of us. i thought it was a hangglider with red lights at the nose and tips of a plane. i told scott what the hell is he doing at night hang gliding. then i relized i could see the stars in between the lights. the objects moved in perfect triangular formation very, veryslow no noise, like a dead calm. they circled right over head staying in a perfect formation,scott ran home to get a telescope. i watched them move slowly torwards s. mountain then picking up speed. once over s. mountain one shot off to the left torwards space the other two shot right in a flash torwards space at an unbeliveable speed. by the time scott got back they were gone. i have only told this to family. i try to watch every program that stanton friedman is on this ismy first time for telling this to any one outside the family. i believe 3 days after this their was an article in the paper that somewhere in the middle east some people saw the exact same thing we saw. this happend a long time ago but i remember it like yesterday. till this day i have not seen any thing on earth like i saw that night. thank you tony sasso"],"Summary":"three red objects","Tags":"City","Date of the Event":"11/30/1977 11:00 UTC","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 30th 1977"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.450077,+-112.066917(2552)&iwloc=A&hl=en\"> mufon case (2552) map </A>","Disposition":"Unknown","Sighting Duration":"00:10:00","Object Flight Path":"Hovering then path","Log Number":""}