{"divs":["Sighting Detailsfor a few weeks now, usually on tuesdays and wednesdays (trash night) my family and neighbors have seen these very bright orange and red and sometimes white lights. sometimes they will come in groups of 2 or 3, one at a time, 3-8 minutes apart. they are completely silent, which leads me to believe its not a typical aircraft. also they move in unusual patterns; typically, they'll come straight up, then travel straight, and either move farther away and disapear or move left or right and then slowly disapear. it looks like they can make paths and turns at swift 90 degree angles, and other patterns and movements that normal aircrafts cant perform. the first time i seen these lights i was at Trenton, MI fireworks (around July 5th), they were on the Detroit river, and during the fireworks myself and friends, along with the people surrounding us, witnessed these lights travel by right above us, we almost thought it was a hot air balloon, but then realized they dont go that high, or that far. we all were very curious and had no clue what the lights were, but i didnt think much of it at the time. then, a few weeks later, my dad seen the lights while taking out the trash, the same ones i had seen in Trenton. This time i was kind of freaked out, i can't think of anything logical to describe what these lights could really be. they have now become almost a weekly phenomena. from where i am, in Lincoln Park, MI, the lights appear to be coming up from around Taylor or Romulous, MI, but could be further away. from where i stand in my backyard, (where i can most clearly see the lights) if i could cover the round-to-triangle shaped lights with an object, they would probably be skittle sized or aspirin sized. tonights lights were suprisingly very bright, a deep firey red while last weeks were more of a firey orange. tonight was also sort of cloudy, but the lights were still very visible. we questioned reporting the lights to the police, but my family and i feel it won't be investigated or taken as serious as it should be. basically, these lights appear almost weekly it seems, typically between 9:30 and 11:30, sometimes come in groups or periodicly every few minutes, they have strange flight patterns and are completely silent, move slowly and disapear slowly, and they are always a firey orange and red, sometimes white. i have no pictures or film evidence, but many have witnessed these lights in the Downriver area."],"Region":"Michigan","Latitude":"42.340787","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around September 22nd 2010"],"Case Number":"25529","Object Features":"Unknown","Summary":"orange/red/white-ish lights. come in groups, odd movements. seen routinely","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Sighting Duration":"00:35:00","Date of the Event":"09/22/2010 11:15 UTC","Longitude":"-83.038974","Date Submitted":"09/23/2010 01:38 UTC","Country":"United States","Disposition":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","Object Shape":"Sphere, Triangle","Log Number":"US-09232010-0004","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.340787,+-83.038974(25529)&iwloc=A&hl=en\"> mufon case (25529) map </A>","City":"Detroit","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/25529.html.txt","/var/www/straped/mufon/org/25529.html"]}