{"Disposition":"Hoax","trends":["There have been 5 other sightings in Lacey","There were no other sightings in Lacey on or around September 5th 2010"],"divs":["Sighting DetailsI was sleeping and I felf like somethig shook me awake, my wife Christie remained sleeping. I went to check my kids and they were sleeping as well and i noticed the house was quiet- no sound at all. Then it was like someone flipped a switch and flood lights filled the house- that was what I initially thought. Then I noticed that each window regardless of orientation had light coming in- so bright in fact that you could not see out. I went to my room and my wife was awake standing the middle of the room and looked at me, although she claims to have never been awake. I glimpsed what I thought was one of my kids in the mirror, they were both in bed though, then my next recolection was lying in bed next to my wife waking up with thte lights still coming in. I realized I was able to move and I thought I saw my kids run down the stairs..as I ran to catch them I noticed my kids were in their beds- I was spooked bad..then the lights disapated enough for me to see that a ligjht source was above my bed, when I looked out and up I noticed a disk like object shooting straight up. My kids claim no recolection but my wife has similar memories to mine."],"City":"Lacey","Tags":"City","files":["/var/www/straped/mufon/html2text/25521.html.txt","/var/www/straped/mufon/org/25521.html"],"Object Features":"Unknown","Date of the Event":"09/05/2010 12:00 UTC","Latitude":"47.043623","Case Number":"25521","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=47.043623,+-122.815492(25521)&iwloc=A&hl=en\"> mufon case (25521) map </A>","Date Submitted":"09/22/2010 12:21 UTC","Object Shape":"Disc","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Country":"United States","Log Number":"US-09222010-0005","Longitude":"-122.815492","Source":"MUFON","Summary":"house lit up through all windows-bright white light- none on street claims to have seen","Region":"Washington","Sighting Duration":"Undisclosed"}