{"Summary":"row of flashing red lights, top row brighter than the bottom row in cigar shape","Latitude":"32.224363","Weather Factors":"Unknown","Object Shape":"Cigar","Log Number":"US-09242010-0004","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25538.html.txt","/var/www/straped/mufon/org/25538.html"],"Tags":"City","Longitude":"-110.923519","Object Features":"Unknown","Country":"United States","Object Flight Path":"Stationary","trends":["There have been 173 other sightings in Tucson","There were 2 other sightings in Tucson on or around September 23rd 2010"],"Date of the Event":"09/23/2010 11:00 UTC","Disposition":"Unknown","City":"Tucson","Case Number":"25538","map":"<A HREF = \"http://maps.google.com/maps?q=32.224363,+-110.923519(25538)&iwloc=A&hl=en\"> mufon case (25538) map </A>","Date Submitted":"09/24/2010 11:31 UTC","Viewing Distance":"Over One Mile","Region":"Arizona","divs":["Sighting DetailsAt about 10:45 pm I was a pasanger in a car and I saw a row of flashing red lights. It looked like it may be on top of the mountains of east Tucson. They were red and flashed in an alternating sequence (went from dim to bright). It was hard to say how manny lights there were, maybe 6 or 7 total. Uppon pulling over the car to take a better look, I observed that the lights were in a stright horizontal line in a Cigar shape, the bottom row much dimmer than the top row. Looking on the ground beolw it, I saw 2 bright red lights on the ground in the distance, much to bright to be stop lights. There was no sound and it seemed to move slightly in every direction slightly. It was definetly within the valley that the city resides in the south east part of the city. My wife and I stared at it for about 3 minutes before moving on. I would have watched it longer but it made my wife very uncomfortable and she was scared to get out of the car and told me to stay in the car as well. Neather of us could say what it was but there was not a doubt in eather of our minds that it was just an airplane. It was not traveling accross the sky and they lights were very differenty than an aircraft. We had no idea what it was but it was not something we had ever seen before. The next day I did a net search for \"strange lights over Tucson\" and found, as I suspected, we were not the only ones who saw it. The paper listed several quotes from witnesses that got a better look than I did."]}