{"Date of the Event":"06/21/2009 12:00 UTC","Date Submitted":"09/24/2010 05:43 UTC","Longitude":"-94.574157","Object Flight Path":"Undisclosed","Case Number":"25535","Disposition":"Hoax","Log Number":"US-09242010-0001","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/25535.html.txt","/var/www/straped/mufon/more/25535_submitter_file1__securedownload25a.jpg","/var/www/straped/mufon/more/25535_submitter_file2__securedownload25.jpg","/var/www/straped/mufon/more/25535_submitter_file3__securedownload42(2).JPG","/var/www/straped/mufon/org/25535.html"],"trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around June 21st 2009","This sighting has never been favorited.",""],"Region":"Missouri","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.102616,+-94.574157(25535)&iwloc=A&hl=en\"> mufon case (25535) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Summary":"12 to 15 Black space craft in the western sky I believe Monoliths","Object Shape":"Star-like, Other","City":"Kansas City","divs":["Sighting DetailsI was about 4 or 5 years old. I was out in the front yard playing with a bug. I was tying a string to its leg and letting it fly around me. When I let it go, it began to fly around. As I watched it flying, I also noticed something else flying in the air. There were black looking planes a dozen or more flying in some kind of formation headed north against the backdrop of the setting sun. I didn't give them much thought, but I did realize at the time that I didn't hear any noise comming from their direction. being a kid I didn't give that much thought either. After growing tired of playing with my bug, I decided to let him go and go in the house. I continued to play in the living room until time to go to bed. While playing I decided to look out of the front window. What I saw scared me. There was the head of a person pressed against the glass. I screamed and ran over to where my mom was and told her that there was a man looking through the window. She looked out while trying to calm me down and said there was no one out there. Still crying I told her yes there was. after some prodding she finally got me to look out and I didn't see anyone either. She then got me ready for bed. I was still scared bug went to bed anyway. I lay there for more than an hour before finally going to sleep Only to be awakened by something pushing on the back door. So I started crying again hopeing that it would wake my mom and she would come and see about me. But that didn't happen. But what did happen I will never forget. Even with my head covered I could see through the sheet a small crafg about 2 to 3 feet in diameter brightly lit. In fact it lit up the whole room. I could hear the latch on the door moving and see the door opening as the light grew brighter and brighter. I was trying to stop crying so that who ever was in the room would not hear me and perhaps go away. But instead I could see it hovering about 3 or 4 feet above my head and the lid or top was opening. I then covered my mouth and tried not to make a sound and eased the cover back just far enough to see the object and hopefully not let it see me. Once the hatch was open a small person raised its head and appeared to smile at me or atleast in my direction. I was still scared and I think now that it could sense that. So the hatch closed. It went back out the same way it came in and closed and latched the door. When I finally got brave enough jumped up and went and told my mother about what had just happened and she told me that I had a bad dream. And for 50 something odd years I have been trying to convince myself thats all it was a dream. But now I'm not so sure! It seemed to real. It still seems real. Except now it is real. I seem to be getting visits from some of these (for lack of a better word) creatures. When I was in my twenties I believed that I had another dream. While laying on the bed after comming home from work, I dozed off to sleep or so I thought. Problem was I was paralyzed, but could still see, hear, and sense everthing around me. then the impossible happened. I was lifted from my bed and and could feel something examineing my body. touching my back one area at a time all the way to my neck and then back down again. I don't know how long I was in that position but it felt like an eternity but I believe it was only a few minutes. And then I was lowered back down on the bed and after a few minutes allowed to move again. As soon as I could get up I ran out of the house and did not go back in for several hours. These may be dreams, but Now just 2 weeks ago after seeing all sorts of creatures. I wake up and my foot is bleeding and there is a small hole there that I can't explain. I have so much more to tell, But I'll save it for the investigators. But for now just know that in all of my encounters with these creatures to my knowledge I haven't been seriously harmed atleast not Physically. However they do seem to like to play head games. They do also seem to know alot more about us then we will ever know about them. I also can't explain why so many of them fly over my home, hover in my front and back yard, attempt to hide behind small clouds and just observe you. I've seen alot in the last couple of years that I have been seriously observing them. The orbs seem not to be crafts but living creatures, not smooth but several textures and many types. I have seen several types of probes that leads me to believe that more than just 1 or 2 species are studying us, but several. They appear to have the power to control gravity and not require air to live nor does it (air) seem to affect them adversly. Oh and one more thing; They don't seem to exhibit any emotions, fear, expression,anger. Atleast not the one that came within 5 feet of me. But allow me to qualify that statment by stating for the record, I don't know what this thing was. It didn't appear alive nor dead, It did'nt look like a probe of any kind, and it did'nt try to communicate atleast not with me. You folks already have my number. I'll set up something with one of your investigators and we'll see what I've got. And perhaps maybe some one can shed some light on whats really going on. Thanks. for atleast trying to sort it out."],"Latitude":"39.102616"}