{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/25532.html.txt","/var/www/straped/mufon/org/25532.html"],"Object Features":"Undisclosed","City":"Edmonton","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-113.482652","map":"<A HREF = \"http://maps.google.com/maps?q=53.552544,+-113.482652(25532)&iwloc=A&hl=en\"> mufon case (25532) map </A>","divs":["sighting detailsdescription: *(link moved to additional evidence section below--cms\\sg). this morning i checked the above link to see what satellites would be visible over edmonton. it indicated nothing for today. at about 5:30 am i went outside to have a cigarette and coffee. at 5:35 i observed a bright light orbiting north to south and as it passed overhead the illumination went off. i thought it had passed over a cloud. about 15 seconds later the lights came on again and it continued south for about 5 seconds. i am thinking that this is a satellite. then it stopped and hovered for about 10 seconds. that immediately freaked me out. it moved north again without turning around. it just reversed direction. it stopped just south of the sherwood park freeway over 34 st. it stayed there for about 1 minute while i watched it. i am now curious about what can fly like that. it sort of danced around in a circle formed by short straight lines and came to rest where it first hovered. then it started moving west, stopped and then flew east, reversed and stopped in the same spot where it hovered for about 1 minute. it is now sinking in as to what this thing is. i just about **** my pants, because i know this thing is watching me. i ran into the office building and started recounting what i just saw. a few minutes later i checked outside and it was gone. i now know for sure that ufo\\'s exist."],"trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around September 22nd 2010"],"Date Submitted":"09/23/2010 12:12 UTC","Tags":"City","Summary":"Bright light dancing in sky.","Country":"Canada","Sighting Duration":"Undisclosed","Date of the Event":"09/22/2010 05:35 UTC","Log Number":"CA-09232010-0007","Object Shape":"Sphere","Latitude":"53.552544","Case Number":"25532","Region":"Alberta"}