{"Weather Factors":"Unknown","Case Number":"25530","Tags":"City","divs":["Sighting DetailsWe had just finished eating a late dinner and were sitting at the picnic table outside of our camper. We had attended a Penn State football game that afternoon and were spending the night at their campground which was located near the agriculture compounds. I had been looking at the night shy and then I noticed what I thought, at first, was a Roman Candle. After looking at it for a second I realized several things: 1. It was not falling,it was soaring. 2. It was much larger than any Roman Candle. 3. It was a \"orange-yellow\" flame that was smaller at the front than the rear. The object continued to float noiselessly over the campground at a low altitude. When it had gone for about a minute it turned to the right at a sharp angle and started to gain altitude and speed. It took several minutes for it to slowly disappear. Shortly after it turned a neighboring camper came running over asking if we had seen it. He then went back and another member of his party took the attached picture using his Blackberry. I do not know if the \"V\" shape it actual, or if it is a result if hand movement. It did not have a shape like this to the naked eye."],"Object Shape":"Fireball, Teardrop","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/25530.html.txt","/var/www/straped/mufon/more/25530_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/25530.html"],"Region":"Pennsylvania","Object Features":"None","Latitude":"40.802025","Log Number":"US-09232010-0005","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.802025,+-77.856501(25530)&iwloc=A&hl=en\"> mufon case (25530) map </A>","trends":["There have been 10 other sightings in State College","There were no other sightings in State College on or around September 18th 2010","This sighting has never been favorited.",""],"City":"State College","Disposition":"Unknown","Longitude":"-77.856501","Summary":"fireball flew over campground, then turned right and gained altitude","Country":"United States","Source":"MUFON","Date of the Event":"09/18/2010 09:45 UTC","Sighting Duration":"Undisclosed","Date Submitted":"09/23/2010 09:52 UTC"}