{"Source":"MUFON","Country":"United States","Tags":"City","Region":"Illinois","Date Submitted":"09/24/2010 10:41 UTC","divs":["Sighting DetailsMy wife and I were sitting on our back pation facing due east looking at the very bright moon around 7:45pm to 8:35pm on Sept 23, 2010. There was intermittent cloud cover but during the sighting it was a clear sky. We noticed around 8:33pm a solid dark mass shaped like a boomerang approaching the moon from the south. It was quite large and was easily seen with the naked eye. It started at the top view as we looked at the moon from the right and it went across to the left and down infront of the moon and then changed course went up and behind the moon. In around 10-15 seconds it reappeared back at the right side and below the moon and moved off to the left until we could not see it. As the first object as moving out of sight a second one approached from the same right south side from the middle to lower half of the moon and moved across in a downward angle to the right. The second dark solid boomerang object appeared to be exactly like the first one. I had my camera on hand since I was trying to take photos of the moon since it was so bright and beautiful. The camera has a video mode and I have a short video of the second object moving from right to left but since the camera is not of a professional quality you can only tell the mass is solid and sort of fuzzy as it moves by. I tried to get the first object in a video but could not focus well on the moon due to its brightness. The event last about 2 minutes or so. We were so excited that we did not think to go get our binoculars until after it was over. None of my photos turned out very well. Around the 30-35 second mark you can slightly see a dark mass moving from the right to left at the bottom of the moon. Wish I had a better video camera and was not so excited that I could hold the camera still."],"Case Number":"25536","Object Shape":"Boomerang","Object Flight Path":"Path with directional change","Latitude":"39.676163","Sighting Duration":"Undisclosed","Log Number":"US-09242010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=39.676163,+-89.704544(25536)&iwloc=A&hl=en\"> mufon case (25536) map </A>","City":"Chatham","Weather Factors":"Windy","Summary":"2 boomerang shaped objects flew infront of moon with 1 object circling the moon","files":["/var/www/straped/mufon/html2text/25536.html.txt","/var/www/straped/mufon/org/25536.html"],"Object Features":"Unknown","trends":["There has been one other sighting in Chatham","There were no other sightings in Chatham on or around September 23rd 2010"],"Date of the Event":"09/23/2010 08:35 UTC","Viewing Distance":"Over One Mile","Longitude":"-89.704544","Disposition":"Unknown"}