{"Object Shape":"Triangle","Date of the Event":"09/23/2010 08:30 UTC","Latitude":"33.027333","City":"Plano","Country":"United States","Date Submitted":"09/24/2010 05:07 UTC","Disposition":"Insufficient Data","Summary":"Triangular shape, red light at pinicle, yellowish lights(streetlight color) other ends, light in center flashed/pulsated","divs":["sighting details my son 8 *(name deleted--cms\\sg) ,10, was on a 5th grade camping trip with his school on the nights of sept. 22-24. my son does not watch shows associated with ufo's because his mother won't let him nor do i do not talk to him about ufo's. after i picked him up today we spoke about the camping trip and shortly after the conversation began he told me that he thinks he saw a ufo. he told a friend about it but he did not believe him. *(name deleted) explained to me that the object in question was triangular shaped and he could tell this from the lights illuminating the object. he says that the object rose above the treeline similar to the way a helicopter would point its nose down, ascend at an angle, level out, then move away quickly. this does sound like an actual helicopter but he was telling me the lights looked close enough that if it was a helicopter he would have heard the sound. according to william, this made absolutely no sound whatsoever. right before the sighting, he was with a group of students and a teacher and they were looking at constellations. after the group was walking off, *(name deleted) remained behind a few moments to try and locate a constellation. he says that's when he saw the object rise and take off. he ran down and around the cabin to see if he could get a better look but it was gone by then. he says he felt confused, interested and scared all at the same time. by the time he went to tell a friend he says he really didn't know what to think. from what he told me, he initially thought it was a stealth fighter. only later did he think about what he saw and really question it."],"Log Number":"US-09242010-0008","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-96.692156","files":["/var/www/straped/mufon/html2text/25542.html.txt","/var/www/straped/mufon/org/25542.html"],"Object Features":"None","trends":["There have been 25 other sightings in Plano","There were no other sightings in Plano on or around September 23rd 2010"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.027333,+-96.692156(25542)&iwloc=A&hl=en\"> mufon case (25542) map </A>","Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"00:00:30","Weather Factors":"Unknown","Case Number":"25542","Region":"Texas"}