{"Date of the Event":"07/18/1988 08:00 UTC","Weather Factors":"None","Disposition":"Unknown","City":"Redding","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Source":"MUFON","Latitude":"41.304444","files":["/var/www/straped/mufon/html2text/25549.html.txt","/var/www/straped/mufon/org/25549.html"],"Longitude":"-73.392778","Tags":"City","Log Number":"US-08092011-0046","Case Number":"25549","Object Shape":"Other","Region":"Connecticut","divs":["Sighting DetailsMy brother and I decided to drive to Saugatuck lake in fairfield county in the state of connecticut to do some night fishing. we arrived at our spot at approximately 8 pm. We walked out to a large flat rock to begin fishing. I made a cast and was in the process of catcing a fish but my brother was experiencing some line problems. while I was fishing, he was doing his repairs. He said \"hey look at that!\" I looked up and over a nearby ridge of pine trees i saw what looked the lights you'd see at a baseball game above the tree tops. they were large bright white lights in a straight line. i didnt really think anything of it and continued fishing. he then said again \" hey! what the hell is that?\" i looked again and now these lights were in the shape of a slanted 7 then an almost cross and then a jagged line. i could feel what i can only describe what it must feel like to be between to magnets turned to opposite poles, it was very strange. i also noticed that my thought pattern was disrupted, i couldnt think clearly. i could not see anything but these lights. and at the time my brother first noticed this, it was dusk; still a bit light out. this thing, whatever it was floated over us and i only know this because i finally realized i couldnt see the sky any longer. i could not see any sky from left to right at all. this thing made absolutely no noise. it was just above us. after looking up at what was essentially nothing but black sky for a long while, this thing turned slightly and i began to be able to see some stars and then i realized the size and shape of this thing and was instantly terrified. i grabbed my brother and pointed out the shape of this craft. it looked like a 55 gallon drum that was cut down the middle from top to bottom and then laid flat and it was massive. i have no way of estimating the size. i had never seen anything like this before or since. my instinct was to pull my brother to the ground and lay as flat as possible. i remember scanning the woods and road looking to see if something was there that was potentially threatening. we continued to watch this thing for quite a while and watched it ascend slowly until we could no longer see it. there was no ultra fast movement, no unbelievable lights, no noise, just this massive thing in the sky above us. we left right away, amazed and in shock. when we arrived home, i called the redding p.d. at the behest of my family and asked the officer who answered if anyone had reported seeing anything strange in the sky that night; he replied no. he asked if i wanted to file a report, i declined. i am finally writing about this all these years later because i know what we saw, i also know people tend to think that those who observe these craft are lying. to this day, 22 years later, i look at the sky constantly, i wonder what the hell this thing was and why we saw it. it permanently changed my world."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.304444,+-73.392778(25549)&iwloc=A&hl=en\"> mufon case (25549) map </A>","Summary":"a massive life changing event","Object Flight Path":"Path then hovering","Object Features":"None","trends":["There has been one other sighting in Redding","There were no other sightings in Redding on or around July 18th 1988"],"Sighting Duration":"Undisclosed","Date Submitted":"08/09/2011 10:44 UTC"}