{"Longitude":"-118.482921","files":["/var/www/straped/mufon/html2text/25554.html.txt","/var/www/straped/mufon/org/25554.html"],"Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsA friend and I had just visited some friends in Santa Monica. We had parked on the very top floor of a parking structur near teh intersection of 2nd St and Santa Monica Blvd. At the end of the night, we were walking to the car when I looked to my left, south, and noticed a lighted object that was distinctly different from the planes in the sky. I am one who has always looked twice at every object I see in the sky before I write it off as a plane. We were close to Santa Monica Municipal Airport, so there were several other planes in the sky, at least 3. I noticed that the lights on the UFO were different from the planes. Because of the lights on the object, it appeared to be disc-shaped with lights all around it. A light would go out and \"travel\" around the UFO and then all the lights would disappear at once and then the re-appear. I asked my friend if she saw it and she noticed it as well. I tried getting a video with the camera on my cell phone, but nothing showed up in it, not even the planes in the sky. I was really excited, because I have been passionate about the paranormal all my life! My friend even made a comment about how excited I was. She wasn't as fascinated by it as I was. We watched it for about 8 minutes and noticed it moved at a different speed than the planes. It looked like it was headed southwest from where we were. We watched it until we could barely see it any more since it was moving away from us."],"Date Submitted":"09/25/2010 12:17 UTC","Weather Factors":"None","Log Number":"US-09252010-0006","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"25554","map":"<A HREF = \"http://maps.google.com/maps?q=34.022254,+-118.482921(25554)&iwloc=A&hl=en\"> mufon case (25554) map </A>","Object Shape":"Disc, Unknown","Disposition":"IFO","Source":"MUFON","Date of the Event":"09/24/2010 10:40 UTC","City":"Santa Monica","Object Flight Path":"Hovering then path","Latitude":"34.022254","Summary":"A friend and I were getting into our car on the top floor of a parking structure in Santa Monica. I looked to my left, south, and noticed a lighted object that was distinctly different from the planes in the sky. I alerted my friend & she saw it.","Country":"United States","Region":"California","trends":["There have been 20 other sightings in Santa Monica","There were no other sightings in Santa Monica on or around September 24th 2010","This sighting has never been favorited.",""]}