{"trends":["There have been 3 other sightings in Springfield","There were no other sightings in Springfield on or around September 25th 2010","This sighting has never been favorited.",""],"Object Shape":"Cigar","Log Number":"US-09252010-0008","City":"Springfield","files":["/var/www/straped/mufon/html2text/25556.html.txt","/var/www/straped/mufon/org/25556.html"],"Tags":"City","Case Number":"25556","Latitude":"38.79247","Source":"MUFON","Object Flight Path":"Undisclosed","Longitude":"-77.177264","Summary":"My son and I witnessed a UFO cross the sky at an apparently incredible speed","Date of the Event":"09/25/2010 03:05 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.79247,+-77.177264(25556)&iwloc=A&hl=en\"> mufon case (25556) map </A>","Object Features":"Undisclosed","Viewing Distance":"Unknown","Region":"Virginia","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy son and I were just outside passing the football back and forth, when I looked up and right there was what I took to be a jet, but really a lot lower than a jet that big has ever been around here. Then I noted that I couldn't see either wings or a stabilizer. So I got my son to look at it and said, \"that could be a UFO. What do you think?\" He looked and said, a bit subdued, \"I think it's a jet..\" but he was not at all sure. (He has since decided that it was a UFO, and this has scared him. He asked me not to tell anybody in the neighborhood because he doesn't want them to think we are weird.) The object was so close, we surely should have heard it. There was a lawnmower going on at a neighbor's house, but this should have been louder than the lawnmower to us. A little later, we heard a jet very loudly even though we couldn't see it. We definitely should have heard what we looked at if we could see it. The part that struck me as the strangest was that the object's size shrank over 8-10 seconds, from what would have been about two inches if you held your fingers out in front of you, to too small to see. It appeared to be going in a straight line, so this did not fit with a jet banking away from us. And even if it was a jet banking away, I've never seen one get as far away as that in such a short time anyway. Again, we never saw wings or stabilizers. About twenty minutes after our sighting, my son and I went to separate rooms to draw what we had seen. I will attach both in pdf form. Mine is 004 and my son's is 005, if that is not obvious. I am 47 years old and he is 9."],"Date Submitted":"09/25/2010 04:04 UTC","Country":"United States","Disposition":"Unknown"}