{"Object Features":"Unknown","divs":["Sighting DetailsMy husband and I were heading out to walk my dog. As we came around the corner from our street, I paused with my dog to let my husband catch up to us. I just happened to look in the right direction, at exactly the right moment. If I hadn't, I would have missed the event entirely. (The whole event lasted only a few seconds.) I was looking straight ahead when a movement on the distant skyline caught my eye. A very bright, kind of \"star-like\" object was moving across the sky. It was round, very bright, and circular in shape. It was moving so fast that it was out of my viewing range in a couple of seconds. It moved at a steady speed, no jumping around. It moved in a straight line, horizontally. I ran as fast as I could down the street, hoping to get more of the sky in my view (we live in a suburb area, trees and rooftops were blocking my view of the sky). When I came to an area where I could have seen where the object went, it was gone. I asked my husband if he saw the object, and he did not. He would had to have been looking exactly where I was, at the same exact moment, in order to have seen it. We were both excited, that is for sure. When I saw the object, a bunch of thoughts trying to comprehend what I was looking at went through my mind. Falling star? Nope. (Stars fall vertically, this object was moving horizontally.) A plane or jet? Nope. (Way too fast, no flashing lights, no distant motor noise.) A comet or meteor? Nope. (No trail behind the object, no flashing, and it was traveling at a very high speed horizontally, and also it had too steady of a movement.) In fact, on our way home from our walk, we saw an actual jet in the sky. It did not even compare to what I experienced earlier. It was so slow when I compared it to what I had seen. Also, we could hear the jet, and see the familiar shape as well as the flashing lights even though it was far away. The object I saw earlier made no sound that I could hear from where I was standing. There was only the bright round shape, no flashing lights, and silence. It just zoomed past in a matter of seconds in a straight line. I asked my husband what words I used after seeing the object. He told me I said, \"Brighter than any stars in the sky at the time.\" \"Waaaaay too fast to be any plane or jet.\" \"It was definitely being \"piloted;\" it looked like it was definitely going somewhere.\" \"It was on a straight horizontal course.\" \"I wish you had seen it, too.\" \"Someone else had to have seen it, I couldn't have been the only one.\" \"It was traveling too fast to be anything man-made.\" I lost sight of the object because it was too fast, and I couldn't get to where I could follow it in the sky fast enough to see where it went. I sure wish that I could have. Seeing it was very intense. I haven't been able to think of much else ever since. I have no pictures, no video, and doubt I would have had time to capture this object on either one. I apologize for only being able to tell you what I witnessed. I am an honest person and know what I saw. Thanks for giving me a chance to share my U.F.O. story. I hope that someone else experienced what I did and comes forward. I would love to know just what it is that I saw. Lastly, I have \"instincts.\" My instincts tell me that I witnessed something incredible. When I'm not sure about something, I go by them. So, here I am reporting what I saw because my instincts tell me I saw a U.F.O. And, to be honest, I believe my instincts. Sometimes it's all you have."],"Date Submitted":"09/25/2010 06:21 UTC","Region":"Vermont","Latitude":"44.203856","Date of the Event":"09/24/2010 08:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.203856,+-72.497109(25558)&iwloc=A&hl=en\"> mufon case (25558) map </A>","Tags":"City","Summary":"A round object, brighter than a star, moved horizontally, lightning-fast across the sky. Too fast to be a plane or jet.","Viewing Distance":"Over One Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25558.html.txt","/var/www/straped/mufon/org/25558.html"],"Country":"United States","Case Number":"25558","trends":["There have been 2 other sightings in Barre","There were no other sightings in Barre on or around September 24th 2010"],"City":"Barre","Sighting Duration":"Undisclosed","Object Shape":"Circle, Star-like, Other","Longitude":"-72.497109","Log Number":"US-09252010-0010","Object Flight Path":"Straight-line path","Disposition":"IFO","Weather Factors":"Unknown"}