{"Log Number":"","divs":["Sighting DetailsI dont remember exactly what month or day it was although I do remember it wassummer. I was in my house in my bedroom asleep. I woke up thirsty and thoughtbriefly that my lamp next to the window was too bright. I got up to turn it offand found that it wasnt on, and thats when I realized the light was comingthrough the closed blinds on the window which faces the east. I looked over atthe clock thinking I mustve slept into the next day and saw that it was 1250, myclock at the time didnt have an am or pm indicator so I thought it was almost 1in the afternoon. I opened the blinds and saw that it was still black outsideand that the light was coming from above my house. I strained my neck upwardsand saw a large object, the top of which wasnt visible. It was circular and onehemishphere of it was as large as my house. It had a number of lights, allcircular, around the edge of the side that was facing me. They were flashingdifferent colors, but all of the lights flashing at one time were the samecolor, such as white lights flashed with white lights and etc. They were thelights I described earlier and I dont remember the exact pattern but it wasobvious that it was a pattern. I stared at it for about a minute or so, I thenturned to head to the ground floor my room is on the 2nd floor and outside tosee it better. I hit my leg on the corner of my bed and nearly fell over fromthe pain I ended up with a nice bruise the next day. I glanced at the clock andit was 1252 and then I ran downstairs and outside to see the thing better. WhenI got outside I stared up and thats when I first heard the humming. It was avery very low pitched hum, something that reminded me of power lines humming orsomething electrical. The lights kept flashing in their pattern and what feltlike 2 minutes later all of the lights on the object shut off. Then they allcame back on for a second or two and then the object shot off into the distance,in less than a second it was the size of a star againist the sky and then it wasgone. I walked back inside, dumbfounded, thinking Id"],"Longitude":"-87.761417","map":"<A HREF = \"http://maps.google.com/maps?q=38.41088,+-87.761417(2556)&iwloc=A&hl=en\"> mufon case (2556) map </A>","Viewing Distance":"20 Feet or Less","City":"Mt Carmel","Object Flight Path":"Straight-line path","Tags":"City","Disposition":"Unknown","Source":"MUFON","Date of the Event":"11/30/1995 12:50 UTC","Object Shape":"Unknown","Sighting Duration":"00:30:00","Date Submitted":"11/30/1995 12:50 UTC","trends":["There have been no other sightings in Mt Carmel","This sighting has never been favorited."],"Case Number":"2556","Region":"Illinois","Summary":"Very large circular object with lights","Weather Factors":"Unknown","Object Features":"Dome","Latitude":"38.41088","files":["/var/www/straped/mufon/html2text/2556.html.txt","/var/www/straped/mufon/org/2556.html"],"Country":"United States"}