{"trends":["There has been one other sighting in Tehachapi","There were no other sightings in Tehachapi on or around September 25th 2010"],"Object Shape":"Cigar, Fireball, Flash, Oval, Star-like","Weather Factors":"None","Tags":"City","Summary":"Something in sky, looking on fire, falling, not sure UFO-seemed more star like.","Latitude":"35.139378","Case Number":"25566","City":"Tehachapi","Object Flight Path":"Straight-line path","Object Features":"None","Country":"United States","Source":"MUFON","Longitude":"-118.440874","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=35.139378,+-118.440874(25566)&iwloc=A&hl=en\"> mufon case (25566) map </A>","Log Number":"US-09262010-0005","files":["/var/www/straped/mufon/html2text/25566.html.txt","/var/www/straped/mufon/org/25566.html"],"Date of the Event":"09/25/2010 10:00 UTC","Date Submitted":"09/26/2010 02:52 UTC","Sighting Duration":"00:01:00","divs":["Sighting DetailsIt was very, very strange a little before 10:00pm. Some relatives and I saw something strange in the sky but it did not look like the UFO's I have seen photos of. It was falling, burning all over, like sparks falling from it, then falling, falling and going out but then came back on. It looked to me like something falling off of something else, like an airplane, etc. But it was not a shooting star, my sons are sure and I am nearsighted and had no glasses! I am not a great witness but I hope someone else in California witnessed the same thing and can explain. It gave me the feeling of a meteor, etc. but everyone said said it did not show characteristics of that or a shooting star. It was much slower than a shooting star. But could it have possibly been some rock or something that hit our atmosphere and we saw a small piece that had broken off or something as it entered our atmosphere? Anyway, it is driving me crazy. I believe in Aliens, etc but doubt I saw anything like that, darn it, lol. Did anyone else in my area see this or anyone have comments? Thanks, just curious. PS It did not look like a light, it looked very much like part of it was a fireball or had fire on it but not light. There was also a very bright moon. A few minutes later, the fire seemed to go out or lessen and my nearsighted eyes could not see it but others could. It seemed to fade and fall more. Thank you. DARN IT Just realized no pictures but again, I hope someone who saw it did take photos, etc and can share more. Thank you. I don't know if this helps, but it really seemed to be falling, not flying or moving around purposely."],"Viewing Distance":"Unknown","Disposition":"IFO"}