{"Date Submitted":"08/09/2011 06:00 UTC","Source":"MUFON","Longitude":"-73.186387","Viewing Distance":"Unknown","Date of the Event":"09/06/2010 05:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.191548,+-73.186387(25561)&iwloc=A&hl=en\"> mufon case (25561) map </A>","divs":["Sighting DetailsWhile awaiting for a friend to pick me up to go play basketball, I was talking with my girlfriend on my cell phone. While talking, I was glancing at the sky which was mostly clear. There was a nearby black kite in the sky which I was following. Suddenly, I noticed three lights in the sky which appeared to be close to the kite, but were moving in a NE direction. At first I thought they were other kites. However, a closer look made me realize they were like orbs of distinct colors. One was orange-red, one white, and the other neon blue. The lights moved closer and away to each other while moving NE. The lights appeared close first, but at the end of the event they were far away. There was no noticeable sound other than the regular street noise (cars and people). A photo was taken with my cell phone but even zooming the picture did not show the orbs. The photo is attached in case you can somehow detect anything. Also a picture map depicting my point of view (green arrow), the path of the orbs at a distance (yellow arrow), and the position of the black kite (black circle) is included. The approximate coordinates where I was standing are 41.191671,-73.205692."],"City":"Bridgeport","files":["/var/www/straped/mufon/html2text/25561.html.txt","/var/www/straped/mufon/more/25561_submitter_file1__trajectory.JPG","/var/www/straped/mufon/more/25561_submitter_file2__lightsinthesky.JPG","/var/www/straped/mufon/org/25561.html"],"Region":"Connecticut","Summary":"Three star like objects of different colors triangular formation","Tags":"City","Case Number":"25561","Disposition":"Unknown","trends":["There have been 11 other sightings in Bridgeport","There were no other sightings in Bridgeport on or around September 6th 2010","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"41.191548","Object Features":"Unknown","Log Number":"US-08092011-0122","Object Flight Path":"Path with directional change","Object Shape":"Star-like"}