{"Object Features":"Unknown","Case Number":"25564","Date of the Event":"09/17/2010 11:00 UTC","divs":["Sighting DetailsOver the past few weeks I've been observing the Andromeda Galaxy, Jupiter and the Moon at around midnight with my 8inch Celestron. One night last week at around 11pm I witnessed a star like object that was brighter than Jupiter come into view from the east and curve and turn southbound and increase it's elevation and then vanish. At first I just thought it was another plane or satelite but after thinking about it I don't know what it was for several reasons. I am on the flight path for Bradley Airport. Planes constantly fly over my house at a altitude of around 5000ft coming into view from the southwest and turning North just south of Middletown keeping just west of the CT River. I also get Large aircraft flying over my house on the way to Logan Airport and the Chicopee Airforce Base to the north and northeast. All the aircraft coming towards me have landing lights on. The light I saw was just as bright but the craft was moving away from me so it wasn't a landing light, I saw no other lights. It was on a curved path towards the south and increasing in altitude so it couldn't be a Satelite. It was way too fast to be a Helicopter. And in the 5 years I've lived here and all the nights I've stayed up watching the star's and everything else fly by I've never see a craft move in that path."],"Sighting Duration":"00:02:00","Summary":"Very bright star like object moving east then south","Region":"Connecticut","Object Flight Path":"Path with directional change","Latitude":"41.565441","Disposition":"Unknown","Weather Factors":"Unknown","Longitude":"-72.644449","map":"<A HREF = \"http://maps.google.com/maps?q=41.565441,+-72.644449(25564)&iwloc=A&hl=en\"> mufon case (25564) map </A>","trends":["There have been 15 other sightings in Middletown","There were no other sightings in Middletown on or around September 17th 2010","This sighting has never been favorited.",""],"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/25564.html.txt","/var/www/straped/mufon/org/25564.html"],"Log Number":"US-08042011-0029","Tags":"City","Viewing Distance":"Over One Mile","Date Submitted":"08/04/2011 12:27 UTC","City":"Middletown","Country":"United States","Source":"MUFON"}