{"Date Submitted":"09/26/2010 06:37 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"AU-09262010-0006","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.119559,+-74.240455(25567)&iwloc=A&hl=en\"> mufon case (25567) map </A>","Tags":"City","Case Number":"25567","Summary":"Solid brilliant white light travelling Sth East apx 10,000m and Apx 2,000kmph the size of 2 x jumbo jets","divs":["sighting detailsre: sighting 26\\09\\2010 7:15pm nth ringwood location of sighting i stepped outside into my backyard for a cigarette, an avid ufo follower i always take this opportunity to look to the skies. on this night sunday 26th of september at apx 7:13pm, i saw something a solid white light to the north just coming into view over my neighbours roof travelling in a sth east direction at an estimated height of around 10,000meters and looked to be much bigger than an airbus at that distance, it made no sound at all in the extremely quiet area i live in, it looked to be slightly zigzagging and didn't move at a consistent speed though this may have been an illusion of staring at this light object from this distance, it was in view for around 2 minutes in total on a clear night. i ran inside called my 10yr son and grabbed my iphone but it was useless in these conditions, my son verified what i was seeing and he too was questioning what it was, the difference of navigation lights to this solid light and why there was no sound. it was not an aeroplane of any sort as there were no navigation lights, made no sound an was a solid light it was not a star as it was too large and travelled too fast it was not a lantern as it was too bright and a brilliant white colour summary of estimate. direction: sth east distance: 10,000 meters speed 2,000 kmph size: 2xjumbo jets colour: solid brilliant white light sound: no i have noticed satellites and suspect sightings at the height of satellites before but never anything this low, i was very excited and believe this is not explainable and worth reporting especially because it was so low and it may tie in to something more significant or other sightings in the area."],"City":"Ringwood","Country":"United States","Date of the Event":"09/26/2010 07:13 UTC","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 3 other sightings in Ringwood","There were no other sightings in Ringwood on or around September 26th 2010"],"Object Flight Path":"Straight-line path","Latitude":"41.119559","files":["/var/www/straped/mufon/html2text/25567.html.txt","/var/www/straped/mufon/org/25567.html"],"Object Shape":"Oval, Sphere","Viewing Distance":"Over One Mile","Longitude":"-74.240455","Region":"New Jersey"}