{"Source":"MUFON","Country":"United States","Sighting Duration":"00:00:12","Disposition":"IFO","divs":["sighting detailsat exactly 7:32pm on september 23, 2010, i was traveling northbound on rt. 33 between carrol and canal winchester (one tenth of a mile before the hill\\dilely road exit), when i spotted the object. the object caught my eye out of the 10'oclock position (nnw-north northwest). it was in plain sight maneuvering in an unfixed pattern, about 200' off the ground. it appeared to be located about 500' west of the hill\\diley rd exit bridge, hovering over an empty field and partially the road. the object itself was unlike anything i have ever seen. it was sort of egg shaped, without wings or other definition. however the luminosity of the object was the most prominent characteristic. when i first sighted it, the object was an extremely bright (mega-led bright) blue. after a few seconds, it gradually faded into an equally bright red color. it was not the standard blue and red lights of faa regulations common on all commercial\\private aircraft. these lights were extremely bright and the source of the colored light encompassed the entire object. i estimate the object's size as being relatively small at about less than 4 feet in diameter. it never changed shape, morphed into individual lights nor did it have any dimensional shape. it hovered in a gliding pattern, lowering its altitude, however i never seen it land. i had direct visual contact with object for about 10-12 seconds max. i actually pulled the car onto the highway berm and came to a 5-10mph crawl, in order to soak in what i was seeing. other traffic (10-15 additional vehicles) going in both north and south directions on rt. 33, did not seem to be affected by the object (no one else stopped of slowed down). the weather was partly cloudy, dry and the lighting was dusk. i might also add that 10 minutes prior to the sighting, i noticed an unusual amount of increased outgoing air-traffic originating from rickenbacker air base, located about 6 miles to the west from the sighting location. i saw several (5-7) separate large cargo aircraft depart the air base within a 5 minute span. this occurred 10 minutes or so before i was even in the area of the sighting. in closing, i have never seen anything unusual in the sky before. i am a fairly avid astronomy buff and am constantly looking into the night sky. this was certainly an event\\object i can't seem to get a grasp on. i'm not sure if i really believe that extraterrestrial aliens are visiting the earth. i lean towards \"no\" due to the immense distances between even the closest stars, however after seeing this object, i am close to at least believing that the object i saw is beyond what mankind can\\has produced. if anyone else seen this object at this time\\date, please contact me at: [email address removed\\cms\\tg]. thanks!"],"Case Number":"25570","Log Number":"US-09262010-0009","Object Shape":"Egg","Date of the Event":"09/23/2010 07:23 UTC","Tags":"City","Region":"Ohio","Object Features":"None","City":"Canal Winchester","trends":["There have been 2 other sightings in Canal Winchester","There were no other sightings in Canal Winchester on or around September 23rd 2010"],"Longitude":"-82.812365","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.846656,+-82.812365(25570)&iwloc=A&hl=en\"> mufon case (25570) map </A>","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25570.html.txt","/var/www/straped/mufon/org/25570.html"],"Summary":"Egg shaped, multi-colored object near Canal Winchester on Rt. 33","Date Submitted":"09/26/2010 10:15 UTC","Latitude":"39.846656","Viewing Distance":"101-500 Feet"}