{"files":["/var/www/straped/mufon/html2text/25578.html.txt","/var/www/straped/mufon/org/25578.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.059234,+-118.233785(25578)&iwloc=A&hl=en\"> mufon case (25578) map </A>","Latitude":"34.059234","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"09/27/2010 12:18 UTC","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around September 25th 2010"],"Object Features":"Undisclosed","Summary":"re-entry, collision, breakup or trajectory fusion burn","divs":["sighting detailsthis seems like 25566 from tehachapi, except they reported 9\\24, but this was saturday night. i saw it in the high southwestern sky, probably way out over the pacific. first there was a fireball and sparks flying off - reminiscent of columbia's re-entry breakup. there was a bright orange light like a star at the head of the fireball path, heading east. then the fire trail faded, and the bright orange star changed direction toward the southeast or south, then faded out - perhaps behind clouds. then it appeared again heading in a southerly direction, then faded out. there is a tiny blurb in the last paragraph of this crappy story [link moved to additional evidence section\\cms\\dr] - but it doesn't make sense that this was a launch from vandenberg, because the object and the fire trail was progressing from the western sky toward the east, before it headed south. unless the launch from vandenberg was an interceptor, and kim jong-il has been trying to nuke us before his party gets tired of his b.s. and kicks him out? or, it could have been a fusion battleship changing course, similar to the one that strafed the beijing airport."],"City":"Los Angeles","Tags":"City","Log Number":"US-09272010-0001","Date of the Event":"09/25/2010 09:45 UTC","Case Number":"25578","Object Shape":"Fireball, Flash, Star-like","Object Flight Path":"Path with directional change","Region":"California","Longitude":"-118.233785","Source":"MUFON","Disposition":"IFO"}