{"Object Flight Path":"Hovering then path","City":"Austin","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Flash, Square, Rectagular, Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=30.271223,+-97.741961(25583)&iwloc=A&hl=en\"> mufon case (25583) map </A>","Longitude":"-97.741961","Date of the Event":"09/26/2010 08:55 UTC","Case Number":"25583","Summary":"Bright white light that dimmed to red and passed silently over.","trends":["There have been 188 other sightings in Austin","There were 2 other sightings in Austin on or around September 26th 2010","This sighting has never been favorited.",""],"Source":"MUFON","Disposition":"Insufficient Data","Date Submitted":"09/27/2010 01:42 UTC","Region":"Texas","Log Number":"US-09272010-0005","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Features":"Other","Latitude":"30.271223","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25583.html.txt","/var/www/straped/mufon/more/25583_submitter_file1__IMG_0005.JPG","/var/www/straped/mufon/more/25583_submitter_file2__IMG_0006.JPG","/var/www/straped/mufon/more/25583_submitter_file3__IMG_0007.JPG","/var/www/straped/mufon/org/25583.html"],"divs":["Sighting DetailsBetween 8:45-9:00 roughly, I was riding in the car with a girlfriend of mine. We were heading east on stassney from 35. I saw to my right, over the city, a bright light that appeared to be floating. It was brighter than any plane I'd ever seen. I pointed out to my friend who was driving and could only catch glimpses of it as per trees, but noticed immediately that it was too far away to shine as brightly any typical aircraft. I considered shortly that it may be a helicopter with a spotlight, but it was a very well balanced light source that shone like a prism, not a spotlight. We pulled into a left turn lane and stared at it, where we watched for about one minute. I was only able to take one photo from this point, my camera would not cooperate. We turned, pulled the car over and quickly jumped out. The aircraft hovered for another two minutes or so while we repeated our bewilderment to each other in the street. \"what is that? No way\", \"that's a UFO, this is incredible\", over and over. I snapped two more photos. My camera was responding slowly and I gave up on taking photos to pay better attention to the aircraft, but the two photos were taken when it dimmed it's light to a red shade and moved toward us. More graceful than any helicopter. This is when I gave up taking photos and watched. It passed above us heading southeast. It was very dark in color when we saw the underside of it. Like that of a stealth aircraft. It was almost rectangular in shape with one corner leading the way. It passed silently over us, speeding up as it passed and sending a few faint pulses of light. I don't know what to think, but I've encountered people in this town that I've felt absolutely zero human connection with. I don't know what to think about that. I've seen mysterious lights in the sky before but never anything like this, and I had a close friend by my side that saw it all. Bizarre. I'm a 22 year old white female from Florida, living in Austin just over A Year. Let me know if this occurrence rings any bells."]}