{"City":"Bandon","divs":["Sighting DetailsOutside at approx 10PM. I noticed the object to the direct North-west of my home. This would put it directly over the beach just sounth of the Coquille River mouth and jetty. The object moved laterally in several directions. The object displayed red white and blue alternating flashing lights. There was also a cluster of brilliant white lights on the underside(Ground side) of the object. It would remain motionless for 5 minutes or so and then veer off either to the North or the East. Returning after a few mintues. There was no sound. The sky was clear at the objects altitude but the was a layer of light fog below below the object to the ground. We took several digital pictures and I tried my night vision scope for a better look. The NVG image was washed out by the brilliance of the white light. I could make out no further details as far as shape thru the NVG. Overall, I estimate the altitude as not more than 1,000 feet, and the object appeared to have more of a diamond shape than anything else. At times, all of the lights would blink out, returning a few seconds later. My final impression was that it may have been a kite, but I could see no one along the shoreline or on the bluff above the beach through the NVG. There was no way I could determine the object's size since I lacked any visual reference to it. It was, from my location, located about 335 degrees, at an angle of about 40 to 45 degrees above the horizon. There was no moon, or any other bright objects in the sky. We are far from any large airport, and are outside of the normal flight paths of anything. Meaning, we rarely see aircraft in the skies here wth the exeption of small private planes. I will attach the photos this evening when I get home."],"Sighting Duration":"Undisclosed","Summary":"A slowly moving diamond shaped object with colored and brilliant white lights.","Date Submitted":"09/27/2010 03:50 UTC","Object Shape":"Boomerang, Chevron, Cross, Diamond, Flash, Square, Rectagular, Triangle","Case Number":"25585","files":["/var/www/straped/mufon/html2text/25585.html.txt","/var/www/straped/mufon/org/25585.html"],"Object Features":"Undisclosed","Country":"United States","Source":"MUFON","trends":["There has been one other sighting in Bandon","There were no other sightings in Bandon on or around September 26th 2010"],"Longitude":"-124.402858","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.124398,+-124.402858(25585)&iwloc=A&hl=en\"> mufon case (25585) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unknown","Latitude":"43.124398","Region":"Oregon","Weather Factors":"Unknown","Date of the Event":"09/26/2010 12:00 UTC","Log Number":"US-09272010-0007","Tags":"City"}