{"trends":[],"Viewing Distance":"Unknown","Longitude":"-119.409502","files":["/var/www/straped/mufon/html2text/25580.html.txt","/var/www/straped/mufon/org/25580.html"],"Country":"United States","Region":"California","Case Number":"25580","Object Features":"Undisclosed","City":"Undisclosed","Summary":"Bright red with some orange yellow","Weather Factors":"Unknown","Log Number":"US-09272010-0003","Sighting Duration":"Undisclosed","Date Submitted":"09/27/2010 08:31 UTC","Latitude":"36.781611","map":"<A HREF = \"http://maps.google.com/maps?q=36.781611,+-119.409502(25580)&iwloc=A&hl=en\"> mufon case (25580) map </A>","Object Shape":"Egg, Oval","Source":"MUFON","Date of the Event":"09/26/2010 08:25 UTC","Tags":"City","Disposition":"IFO","divs":["Sighting DetailsWas trying to locate Jupiter when I noticed a bright reddish object traveling from west to east. It was low and as large or larger then a big plane flying at a lower elevation. When I first saw it, it gave me an impression that a plane was on fire. All I could see was a bright red light in front of the craft shaped like a sphere as if it was a giant red head light. It had a Ora around it with some yellowish orange color around the sides. I ran in the house and got my wife, mother in law and daughter and they came out and saw it. It was moving at a slow speed when it appeared to slow to a stop and reverse direction now traveling east to west. As it moved west it started to get smaller and smaller as if was moving upward until it was a small dot and not seen anymore. As we viewed this my mother inlay pointed out the this object made no noise. I know in my heart that this was not an airplane or any other manmade object. The there where no flashing lights it was a solid bright red beam of light in the front with some yellowish orange around the sides, the way it stopped and changed direction and then disappeared could not have been any plane or other object I have ever seen. I could not sleep last night as I am writing this at 5:30 the next morning."],"Object Flight Path":"Undisclosed"}