{"City":"Silt","Log Number":"US-09282010-0007","Date Submitted":"09/28/2010 09:31 UTC","Region":"Colorado","Case Number":"25599","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.548592,+-107.656171(25599)&iwloc=A&hl=en\"> mufon case (25599) map </A>","trends":["There have been no other sightings in Silt","This sighting has never been favorited."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/25599.html.txt","/var/www/straped/mufon/org/25599.html"],"Summary":"Bright green sphere/orb glowing from inside out; like a flare. No noise or smoke trail","Date of the Event":"09/27/2010 06:30 UTC","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","divs":["Sighting DetailsWalked out of our front door, at the address listed above, around 6:30AM. Was looking at the southern horizon seen the object described above slowly falling for about five seconds and then dissapeared behind the mesa. The path was in an arc from east to west but became vertical as it went behind the mesa. I can narrow down the path to a pretty small swath of sky as it was between two trees in the yard. When I first saw the object I was actually immediately taken back to having seen the exact same type object falling the exact same way in Fairbanks Alaska when I lived there. And at that point I figured it was a rocket fired from Poker flats testing range on a return path, but never heard anything more about it. That event was around 1992-1996. My reaction was like what the heck. Makes the hairs stand up on your neck. In Alaska I was actually facing 180 degrees away from the object when I got a chill down my spine that made me turn around. This object only gave me a chill afterwards but I figured it was likely a meteorite or a satillite falling. I immediately told my wife what happened. After arriving at work she was told by a coworker, who lives on the mesa where we had seen the object disappear, that he had seen State Police and Military personel heading up to morisonia(sp) mesa and I guess there was about 200+ other reports of the incident. He then told her about this website so I decided to submit a report as well. I have pictures of my view point that I will have to upload at a later point if someone can send me a link. Feel free to contact if you need more information."],"Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Object Shape":"Sphere","Latitude":"39.548592","Longitude":"-107.656171","Disposition":"Unknown"}