{"Object Features":"Undisclosed","trends":["There has been one other sighting in Conshohocken","There were no other sightings in Conshohocken on or around September 26th 2010"],"Disposition":"Unknown","City":"Conshohocken","Longitude":"-75.301571","Date of the Event":"09/26/2010 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/25596.html.txt","/var/www/straped/mufon/org/25596.html"],"Object Flight Path":"Undisclosed","Object Shape":"Diamond","divs":["Sighting DetailsI was driving on the Pennsylvania Turnpike around 10:15pm just a few minutes away from the Conshohocken Exit When I noticed an unusual craft smoothly and quietly gliding across the sky from the front the front left of my car. It appeared to be either black or a very dark grey color and in the shape of an elongated diamond. The longer tips were pointing towards the front and rear of the craft. At the rear under belly of the craft were three large lights in the formation of a triangle and at the front tip of the craft were smaller lights that seemed scattered. The smaller lights were hard to make out from the angle and short amount of time I had to observe the object. I watched the craft gracefully fly across the turnpike in front of me and then head to the right and back of my car as I continued driving. One thing I noticed before I lost sight of the UFO was that the back right light ( one of the three in the triangle formation) was abruptly shut off, leaving only two lights at the rear. This was right before the craft appeared to descend in its flight and thats when I lost view ( and almost crashed my car) Oh and all the lights appeared to be white in color. When I first noticed the craft I thought it must be some new type of military airplane or something but the odd triangular shape of the lights and the fact that none of them were blinking or red tipped me off that this was unusual. Also I have never seen a flying object that had no wings or propellers, like I said, the shorter tips of the diamond shape were pointing to the sides. Also it is hard to explain but the way it flew was eerie, smooth, graceful, seemingly silent and quick, the flying pattern had a slight curve to the right but mostly it just headed straight on. I pulled out my cellphone to take a pic but didn't get much of a shot, instead of fiddling with my phone to try again I decided to abort the effort and just stare at it for as long as possible, I would have pulled over if it were safe but there were plenty of cars on the road zipping around me ( I had slowed down and drove a bit recklessly) I would be very surprised if none of the other cars on the road noticed this peculiar flying object. I can't really explain how I felt, part of me was excited but I wasn't scared ( which is how I always thought I would feel if I saw a UFO) I know it was definitely a UFO but I'm not so sure it was extraterrestrial. I have never seen any craft look or fly the way this one did but at the same time something felt \"human\" I mean it was so OBVIOUS and didn't look like it was trying to be stealth at all... anyway thats it, the craft looked like it was flying lower and lower and was lost behind a bunch of trees and the hills to the right of my car. I got to my exit and stared at the sky for the rest of the drive home hoping to catch another glimpse."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.079277,+-75.301571(25596)&iwloc=A&hl=en\"> mufon case (25596) map </A>","Summary":"Dark Elongated Diamond Shaped Craft With 3large lights (Triangle Formation) at the Rear, Smoothly Floats Across Pennsylvania Turnpike","Latitude":"40.079277","Tags":"City","Source":"MUFON","Date Submitted":"09/28/2010 02:35 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"Pennsylvania","Case Number":"25596","Log Number":"US-09282010-0004","Sighting Duration":"Undisclosed"}