{"Log Number":"US-09272010-0012","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Shape":"Cigar, Star-like","Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"Unknown","Date of the Event":"09/26/2010 08:00 UTC","Region":"California","Source":"MUFON","Longitude":"-117.152455","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around September 26th 2010"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.722669,+-117.152455(25590)&iwloc=A&hl=en\"> mufon case (25590) map </A>","City":"San Diego","Date Submitted":"09/27/2010 07:40 UTC","Summary":"Two UFOs near sdsu","Case Number":"25590","Country":"United States","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMe and my buddy were sitting down outside our dorm, and as an astronomy major I'm always looking at the stars. This time when i look up i see a bright orange light hovering in the sky. It was around the same color of a street light, so i asked my friend if it was a streetlamp or something else. He confirmed that it was not a streetlamp and told me that it must have just appeared since it was not there earlier. The light began to dim making the shape of the craft visible, me and my friend both confirmed that it was indeed cigar-shaped. After that the light began to gradually get bright again, then shrink into darkness. This time after the light dimmed completely, the craft flew around for about a minute then began to emit a white light which flashed towards the edges, mimicking a commercial aircraft. That's when i noticed another strange light higher in the sky that was not a star; this one emitted a deep blue light and was stationary. As first craft continued to circle the area, me and my buddy got a text from our friend saying he was about to get into a fight, so we left and ran to his aid. I tried to take a picture on my blackberry, but both lights looked like nothing more than tiny white dots."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/25590.html.txt","/var/www/straped/mufon/org/25590.html"],"Latitude":"32.722669"}