{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"09/08/2003 09:45 UTC","Date Submitted":"09/08/2003 09:45 UTC","Object Shape":"Oval","Source":"MUFON","City":"Cerrigydrudion","Region":"Wales","Summary":"Bright blue shooting star","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsI was driving home in a westerly direction with my father in the front seat ofthe car. I saw the object travelling on a parallel course with the car for abrief second, and took it to be a shooting star. When I looked back asplit-second later, I saw that it was bright blue and glowing and had anoval-like shape. I turned to my father who confirmed he had seen the object. He insists that it disappeared instantly, but I could not confirm that as I wasdriving, and it was only after the event that I realised the significance. Theweather was very clear and the moon very bright, and, I have to admit, quiteblue itself, so my heartfelt belief is that it WAS a shooting star, and a trickof the light made it appear to be oval-shaped and blue. It could not have beenany terrestrial object as it was very far away and covered such a distance inthe sky it would have had to be either travelling at abnormal speeds, or indeeda meteor travelling outside the atmosphere. However, should it have turned outto be something else, I did not want to report this AFTER such a discovery Ithink you know what I mean.NB. Your site will not allow me to submit without choosing a State or Province,but this sighting did NOT occur in the USA."],"files":["/var/www/straped/mufon/html2text/2559.html.txt","/var/www/straped/mufon/org/2559.html"],"Log Number":"","Disposition":"Unresolved","Country":"United Kingdom","Object Features":"Undisclosed","trends":["There have been no other sightings in Cerrigydrudion","This sighting has never been favorited."],"Sighting Duration":"00:00:59","map":"<A HREF = \"http://maps.google.com/maps?q=53.023818,+-3.561871(2559)&iwloc=A&hl=en\"> mufon case (2559) map </A>","Case Number":"2559","Latitude":"53.023818","Longitude":"-3.561871"}