{"Weather Factors":"None","trends":["There have been 18 other sightings in Monterey","There were no other sightings in Monterey on or around September 27th 2010","This sighting has never been favorited.",""],"Log Number":"US-09282010-0009","Region":"California","Longitude":"-121.892116","Object Shape":"Boomerang, Other","Case Number":"25601","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Unknown","Tags":"City","Date of the Event":"09/27/2010 08:30 UTC","City":"Monterey","Source":"MUFON","divs":["Sighting DetailsI was sitting in my back yard last night at appx 8:30 PM PST smoking a cigarette when I spotted a Boomerang or V shaped craft pass over my house from a northwest to southeast direction. The craft was very large, made no sound and had 1 glowing light at the tip with 3 glowing white lights down each wing (no blinking lights). It moved rapidly across the sky, and dissapeared. A few moments later the same craft passed over in a east to west direction and then a few moments later approached from the south heading to the north, along the legnth of the house. It then appeared to dissapear. The craft moved much quicker than an airplane it appeared to be black or dark gray and I could see the outline of it on the clear starlit night we had last night. The lights on the wings were very pronounced. I live behind the Monterey airport and see aircraft all the time, and this was no airplane or Jet that I have ever seen. I was blown away, spooked but also very intrigued, when it made its 1st pass I called my wife outside and she saw the subsequent passes. Our airport is a regional airport and traffic control closes at 9:00 PM I intend to call the airport to see if anything was spotted on radar. After looking at photos online this morning, I have found pictures that resemble what I saw last night and they most closely resemble the photos or drawings of the phoenix sightings of 1997, I am attaching photos of what I found online that match it. It was clearly not like anything I have ever seen before. I also called a local radio show host last night whom I am aquianted with and reported the sighting to him as well"],"files":["/var/www/straped/mufon/html2text/25601.html.txt","/var/www/straped/mufon/more/25601_submitter_file1__boomerangUFO.jpg","/var/www/straped/mufon/more/25601_submitter_file2__V-Camel.jpg","/var/www/straped/mufon/org/25601.html"],"Date Submitted":"09/28/2010 11:00 UTC","Summary":"V shape or Boomerang shape UFO passed over my home 3 times last night","Country":"United States","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=36.607648,+-121.892116(25601)&iwloc=A&hl=en\"> mufon case (25601) map </A>","Latitude":"36.607648","Sighting Duration":"00:00:05"}