{"divs":["Sighting DetailsKennedale, Texas - 09-24-10 I am a police officer and was on duty. I was parked dark and stationary along a road under construction, watching for local burglars that hit the businesses on 4-wheelers by coming in through the woods. I was parked facing south on the west shoulder of 1000 Bowman Springs Rd. in Kennedale, Texas at 02:23. I noticed what first appeared to be a very bright flickering star to the east at about 45 degrees on the horizon. Then I thought it might be a plane. I noticed it move slowly to the left then stop. I took my binoculars from my bag and looked at the object. It was then I could see that what appeared to be flickering were rotating white, blue, and sometimes red lights. The object appeared saucer-like in shape and made no noise. It would hover, then move left, right, and up several times during the duration which lasted 33 minutes. A jet came into the frame also. I could tell the jet because of the shape, the lights, and the headlight out in front. As the jet approached, the object moved away to the left. When the jet passed, the object moved back. There was a bare tree branch in the foreground I used as a reference point, and could clearly see the object move. At times it became bigger, and one other time it moved straight away until barely visible, then came back to where it had been, but bigger. The object seemed to have one bigger, central or top light, with the other lights going around it. I watched this object move around until a low cloud covered it completely from view. When the cloud cover cleared, the object was gone. It WAS NOT a star! It was a full moon with the moon in the west sky. I was hoping someone else would come by so I could show them. I tried video on my phone, but it is no good. I would be interested to know if someone else saw this. It could have been seen by nearby Mansfield or Arlington as well, probably."],"Tags":"City","Viewing Distance":"Over One Mile","Source":"MUFON","Date Submitted":"09/28/2010 01:05 UTC","Country":"United States","Date of the Event":"09/24/2010 02:23 UTC","Disposition":"Unknown","Region":"Texas","Log Number":"US-09282010-0011","Latitude":"32.646801","Object Features":"Undisclosed","City":"Kennedale","Sighting Duration":"00:33:00","files":["/var/www/straped/mufon/html2text/25603.html.txt","/var/www/straped/mufon/org/25603.html"],"trends":["There have been no other sightings in Kennedale","This sighting has never been favorited."],"Weather Factors":"None","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"Blue and white/red lights hovering and changing direction in sky over Kennedale/Mansfield/Arlington, Texas.","Case Number":"25603","map":"<A HREF = \"http://maps.google.com/maps?q=32.646801,+-97.225846(25603)&iwloc=A&hl=en\"> mufon case (25603) map </A>","Longitude":"-97.225846","Object Shape":"Oval"}