{"Country":"United States","divs":["sighting detailsi smoke and go to my garage to do so since i do not smoke inside the house. i began noticing this star object appear at different times of the evening starting last july. it is visible to the naked eye and can be seen clearly throughout the evening. i decided to take some video since i noticed it having strange and erratic movements. perhaps this is a satellite? i was hoping you could debunk this for me since it is there almost every evening and i don't want to be curious anymore. i hope i am not wasting your time. to me it does seem to have a conscience since it does move erratically when a plane comes by. we are located in\\near a flight path. you will notice in the video at 7.04 minutes how if moves drastically when a plane comes by as well as at 9.14 minutes. in my video there are a few dozen or more purple flashes or over-exposures throughout the video. this object also morfs. if you do not see this on the version i sent this in..you will need to see it from my chip or download. important notes: in minutes (12 total) 2.25- 2.51 goes out of focus 4.21-5.37 moves\\floats up quickly 5.43-7.04 moves dramatically from one window pane to another 7.18 goes back to original position 9.00 disappears 9.14 plane goes by 9.33 blurs 10.00 disappears 10.13 reappears 10.35 different colors please advise!"],"Log Number":"US-09282010-0017","Date of the Event":"09/26/2010 12:00 UTC","Object Flight Path":"Hovering then path,Other,Unknown","Date Submitted":"09/28/2010 05:48 UTC","Sighting Duration":"Undisclosed","Region":"California","Disposition":"IFO","City":"Hacienda Heights","Summary":"As seen through my garage windows..an on-going sighting (90 days)- Please debunk :)","Object Features":"Unknown","Latitude":"33.995128","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.995128,+-117.960216(25609)&iwloc=A&hl=en\"> mufon case (25609) map </A>","Object Shape":"Chevron, Disc, Flash, Oval, Sphere, Star-like, Teardrop, Other, Unknown","Case Number":"25609","trends":["There have been 4 other sightings in Hacienda Heights","There were no other sightings in Hacienda Heights on or around September 26th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/25609.html.txt","/var/www/straped/mufon/org/25609.html"],"Weather Factors":"Unknown","Longitude":"-117.960216","Tags":"City"}