{"files":["/var/www/straped/mufon/html2text/25610.html.txt","/var/www/straped/mufon/org/25610.html"],"Case Number":"25610","Weather Factors":"Unknown","Date Submitted":"09/28/2010 07:31 UTC","Latitude":"43.498351","Disposition":"Unknown","Region":"Idaho","City":"Idaho Falls","trends":["There have been 8 other sightings in Idaho Falls","There were no other sightings in Idaho Falls on or around June 19th 1973"],"Date of the Event":"06/19/1973 12:00 UTC","Object Flight Path":"Undisclosed","Object Shape":"Star-like","Object Features":"Undisclosed","divs":["Sighting DetailsMy wife and I and an older women who was into the UFO phenonmenon were returning to the latter's home that summer night in 1973. This women, we will call her Marge noticed this light off in the distance ( very difficult to estimate distance when the sky is pitch black). She then turned off onto a sidestreet just as we were about to enter the outskirts of the city of Idaho Falls. I recall there were new housing sites in the process of being built. She drew our attention to this \"light,\" which was clearly visible, but at a distance in the sky. It was peculiar as I had just gotten out of the US Air Force and never seen anything quite like this, which remained stationary in the sky. Some minutes later as we were watching, several 4 or 5 smaller lights of a somewhat orange color were seen exiting from the bottom of the light (object). We watched for I guestimate 4 or 5 minutes and suddenly the smaller lights which looked like \"fireflies\" returned into the object. Marge said these were returning to the \"mother\" ship? the experience (siting) got even alittle stranger as she flashed her high and low headlight beams on and off. Lo and behold, the rotating lights responded in perfect sync. We continued to watch for approx one-half hour and started back. I happened to notice that there was a bright, red ball followed us home. It appeared exactly like a red airport beacon. Marge lived in a home overlooking the local airport, and I saw the same red light hovering over the airport, we then went to bed."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.498351,+-112.030644(25610)&iwloc=A&hl=en\"> mufon case (25610) map </A>","Viewing Distance":"Unknown","Country":"United States","Summary":"appeared as, large bright star light with rotating lights about the middle. Color was red and bluish-green. Observed smaller orangish exit from bottom of object.","Log Number":"US-09282010-0018","Longitude":"-112.030644","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON"}