{"Log Number":"GB-09292010-0002","City":"Birmingham","Country":"United States","divs":["sighting detailsi am 49 years old and on the 16\\09\\2010i was woke up by the sound of a helicopter above my house when my partner went to look he said there was a light above it by the time i got out of bed the helicopter had gone but the light remained in the sky i managed to take several photos and a few videos it wasn't until i woke up and looked at the pics that i realised how clear the photo's are the photos are in my camera memory so my father put them on the computer for me each photo is different and they have made me feel really scared to look at them there is clear images of something lifelike a few of them really do look like aliens but i just think people will laugh at me .my family and friends have all said i need them to be looked at.i have tried to get someone to take a look but don't know where to go from here.cannot explain what i thought it was i also noticed some very small light coming of it they where red and blue at one point i saw it change into a blue circle with tiny red and blue lights inside the circle which resembled a bycicle wheel it changed back after a short time i actually was looking at it at the time.this was when i got really scared and was so shocked i screamed for my partner to come. i continued to watch it untill 4\\45am when i noticed it goin away from my veiw."],"trends":["There have been 48 other sightings in Birmingham","There was one other sighting in Birmingham on or around September 16th 2010","This sighting has never been favorited.",""],"Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=33.525151,+-86.79742(25616)&iwloc=A&hl=en\"> mufon case (25616) map </A>","Sighting Duration":"Undisclosed","Longitude":"-86.79742","Summary":"bright light in sky looked like it was changing shape","Object Features":"Unknown","Object Shape":"Circle, Star-like","files":["/var/www/straped/mufon/html2text/25616.html.txt","/var/www/straped/mufon/more/25616_submitter_file1__IMG00573.jpg","/var/www/straped/mufon/more/25616_submitter_file2__IMG00571.jpg","/var/www/straped/mufon/more/25616_submitter_file3__IMG00568.jpg","/var/www/straped/mufon/org/25616.html"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Disposition":"Unresolved","Latitude":"33.525151","Weather Factors":"Unknown","Date Submitted":"09/29/2010 11:04 UTC","Object Flight Path":"Stationary,Path then hovering","Date of the Event":"09/16/2010 02:45 UTC","Case Number":"25616","Tags":"City"}