{"Weather Factors":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","City":"San Jose","Region":"California","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/25617.html.txt","/var/www/straped/mufon/org/25617.html"],"Date of the Event":"09/29/2010 10:45 UTC","Case Number":"25617","Object Shape":"Star-like","divs":["Sighting DetailsSaw a bright star just below the quarter moon. Watched for three minutes and observed no movement (if there was movement, it was at the same rate as the moon). Went to get a camera but returning less than two minutes later, the object was no longer visable. In scanning the sky, I observed two similar but not as bright objects overhead. While remaining in the same part of the sky, they appeared to interact with each other. One disappears while the other remains. In trying to locate the missing object, I discover three more faint object in the NorthWest, heading in a Northerly direction. These were very far away as they twinkled similar to stars. There is a tree obstructing my view to the North, however for a brief moment, a much brighter object which appeared to be much closer appeared from behind the tree, traveling at a fair rate of speed, heading East. The closer object disappeared over the hills East of my location within a minute. I was unable to locate the three previous objects but discovered two more straight above. These also appeared to be interacting with each other but were very faint. Within 25 minutes of my first observation, I could not locate any other objects. The distance was too great to any photos and I didn't get a picture of the closest object as I was unable to locate it with the camera before is passed. I initially thought these could be the reflection of weather balloons, however the objects didn't seem to relate to any particular wind direction and conditions on the ground are near calm. I'm reporting this to see if anyone noticed these objects in other areas in town."],"trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around September 29th 2010"],"Object Features":"Unknown","Longitude":"-121.890726","Latitude":"37.347616","Summary":"Several Stars appearing during daylight","map":"<A HREF = \"http://maps.google.com/maps?q=37.347616,+-121.890726(25617)&iwloc=A&hl=en\"> mufon case (25617) map </A>","Log Number":"US-09292010-0003","Source":"MUFON","Tags":"City","Country":"United States","Date Submitted":"09/29/2010 02:35 UTC"}