{"Tags":"City","Region":"Michigan","files":["/var/www/straped/mufon/html2text/25619.html.txt","/var/www/straped/mufon/org/25619.html"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=42.372935,+-83.466463(25619)&iwloc=A&hl=en\"> mufon case (25619) map </A>","Disposition":"Unknown","divs":["sighting detailsi got off my bus, it was about 6:45, with my headphones still in, and headed for my school. i like to watch the the sky as i walk in because it's that nice time right before the sun rises. i was looking at the sky above the woods the turned my head towards the gym\\pool building, which is to my left when i was it, it was a diamond like shape and it seemed to be glowing, it was white with a very very small hint of yellow, it looked aboout as far away as a plane would be but was much larger than a star or a plane light. it didn't flicker at all and it just sat there, i watched it as i kept walking wondering what it was, it didn't move or sway at all it just stayed still.i began to wonder if i was insane, suddenly i heard a russle in the bushes to my right i quicly looked at it hoping to catch sight of the rumored racoon that hangs around in our creek but saw nothing. i looked back to where i saw the diamond and it was still there, i looked around and no one else seemed to notice it. then i just kept staring at it in wonder, and it still did not move at all, i was starting to get a bit freaked out when i triped i looked had to look away to balance myself. i imediatly looked back to the area in the sky where i saw the diamond and it was gone, it just vanished, i looked all around the sky and didn't see it at all. now i was really freaked out and i wasn't about to tell anyone incase they might find it strange."],"Weather Factors":"None","Viewing Distance":"Unknown","Sighting Duration":"00:05:00","Latitude":"42.372935","Date of the Event":"09/16/2010 06:45 UTC","City":"Plymouth","Date Submitted":"09/29/2010 08:14 UTC","Case Number":"25619","Country":"United States","Object Features":"None, Unknown","Source":"MUFON","Log Number":"US-09292010-0005","Object Shape":"Diamond","Longitude":"-83.466463","Summary":"There was a diamond like object just sitting in the sky above my school's building.","trends":["There have been 2 other sightings in Plymouth","There were no other sightings in Plymouth on or around September 16th 2010"]}