{"files":["/var/www/straped/mufon/html2text/25618.html.txt","/var/www/straped/mufon/more/25618_submitter_file1__myUFO.jpg","/var/www/straped/mufon/org/25618.html"],"Country":"United States","divs":["Sighting DetailsBack when my husband and I were dating, (1968) we were riding around on the 4th of July, looking for fireworks displays. We wanted to watch them and it was about 8:45 p.m. so we figured they were already going off. We drove to Arlington Heights (Arlington, MA) to get up high enough to look around for fireworks but we saw something we didn't expect. Actually, I saw it while my husband was driving, he couldn't take his eyes off the road; we were going uphill on a street in Arlington with me watching the sky and suddenly, I saw something odd. It was a curved string of lights, set on an angle, just above the rooftops and it was moving uphill at the same speed that we were. It popped in and out of view as it went behind the tops of trees and houses along the street. Then it began to pick up speed so we accelerated until we were doing 70 mph going up that hill. Then it went faster and faster until we couldn't keep up and it disappeared. Every time my husband tried to look at it, it went behind a rooftop and he didn't get to see it. There were no other vehicles on the street at the time. We did not have a camera with us, but I have vivid memories of the incident. I have recreated the image in Photoshop and included it here."],"Date Submitted":"09/29/2010 04:44 UTC","Source":"MUFON","Longitude":"-71.152793","Region":"Massachusetts","trends":["There have been 2 other sightings in Arlington","There were no other sightings in Arlington on or around July 4th 1968","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=42.421844,+-71.152793(25618)&iwloc=A&hl=en\"> mufon case (25618) map </A>","Date of the Event":"07/04/1968 09:00 UTC","Case Number":"25618","Log Number":"US-09292010-0004","Latitude":"42.421844","Summary":"I saw a curved string of white lights just above the rooftops, moving at a very high speed.","Tags":"City","Sighting Duration":"Undisclosed","City":"Arlington","Disposition":"IFO","Weather Factors":"Unknown","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Disc","Object Flight Path":"Undisclosed"}