{"divs":["Sighting DetailsI was outside on my front porch, sitting on the steps smoking a cigarette. I wasn't wearing my glasses, but something in the sky caught my attention. It looked like a bunch of little white lights moving Northwest across the sky. They were all grouped together in sort of a flock formation. I went inside to get my glasses, hoping to see it or something like it again. I wanted to be sure what I was seeing. Sure enough, only a couple of minutes later, there was another flock of lights, this time moving in the opposite direction. There were another 5 sightings within the next 10 minutes. The last one was very distinct. There were 5 lights moving together in a group. They would spread apart some and then cluster back together. The other groups had too many lights to count. I asked my boyfriend if he wanted to come outside and look and he said, \"That's okay, I'm good. I don't want to get freaked out.\" All of the groups suddenly appeared, flew across the sky and then they would eventually fade out. Anywhere from 10 seconds to a couple of minutes later, another group would appear. Honestly, I wasn't sure if I wanted to go back outside after I got my glasses. Wasn't really sure if I wanted to confirm what I had seen or not. But I went out anyways, I was a little scared, but also curious. Very strange indeed."],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"09/29/2010 10:50 UTC","City":"Junction City","map":"<A HREF = \"http://maps.google.com/maps?q=39.028609,+-96.831398(25622)&iwloc=A&hl=en\"> mufon case (25622) map </A>","Disposition":"Unknown","Country":"United States","Latitude":"39.028609","Object Features":"Undisclosed","Tags":"City","Log Number":"US-09292010-0008","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25622.html.txt","/var/www/straped/mufon/org/25622.html"],"Region":"Kansas","Longitude":"-96.831398","Weather Factors":"Unknown","Date of the Event":"09/29/2010 09:30 UTC","Summary":"\"Flock of Lights\"","Object Shape":"Boomerang","Viewing Distance":"Unknown","Case Number":"25622","trends":["There have been 3 other sightings in Junction City","There were no other sightings in Junction City on or around September 29th 2010"]}