{"Tags":"City","Country":"United States","Latitude":"39.558821","Summary":"A ship and 4 to 5 Aliens in Uranvan Colorado 1969","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=39.558821,+-105.774217(25620)&iwloc=A&hl=en\"> mufon case (25620) map </A>","files":["/var/www/straped/mufon/html2text/25620.html.txt","/var/www/straped/mufon/more/25620_submitter_file1__uravancolorado1966.jpg","/var/www/straped/mufon/org/25620.html"],"divs":["Sighting DetailsI was between for four and five years of age when I had my encounter. My family and I were living in small town westend of Montrose County called Uravan Colorado. In the early morning June of 69 I was waken by the barking of family dog name tippi outside by bedroom window. Tippi never really barked unless someone or something was in a yard that wasn't supposed to be. I remember wakening up out dead sleep and hearing tippi consant barking and wondering why older brother whose sleeping bunk above and my parents sleeping in the bedroom joining ours weren't get tell Tippi to be quit. Finally I had enough it and decided turn over in my bed and look out the window myself. When I did I couldn't believe what saw. There it was a small circle ship with its landed gear down and hatch with stairs fold down to the ground.Next to ship where green kinda lizard looking aliens. Their eyes were bright yellow,and the sometanks on there backs and another bag.They didn't have fingers but kinda web hands that look like to a bow and arrow.Their body were thin,and scaley,and legs also then,their feet had v shaped toes I remember thinking to myself this was somekinda hunting party, because my dad was bow hunter himself and that kinda gave the idea. I could tell the wear searching for something, then all the sudden another alien came of the ship. He was much bigger then the others and seemed to give the others orders. Tippi again began her barking and the alien closes to our house seemed to be upset with her barking. I could see it looking over at tippi, finally it appear \"it\" to had a problem with tippi barking and started walking over her. I then jump of my bed and headed into my parents room to wake my mother up. I remember how hard it was to wake my mother up and she acted like she was heavy drug or something.I couldn't get her wake up. Finally was able to get her up and told something was going on outside that it was going hurt tippi, she still not wake and sluggish my mother followed me to bed. Once there I showed what I was seeing outside. I don't what they did to my mom but she couldn't see them. All she wanted to do is sleep. Finally my mother got up from my bed and told me crawl to other side my bed away from the window. I did what I told. The last thing remember before going to sleep,was looking over in closet where window casted light on my close and saw to dark figure trying to look in window. No other sound came from Tippi. My mother wasn't drinking or taking anything that would make sadation. I firm believe they did somthing to family make sleep. It just didn't work on me. The morning the first I did was to run out check on Tippi in pj all. Sure enough she was lying in front yard waiting for kids to come play with her. She acted like nothing happen the night before."],"Viewing Distance":"20 Feet or Less","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Log Number":"US-09292010-0006","Date Submitted":"09/29/2010 10:34 UTC","Weather Factors":"None, Light","trends":[""],"Date of the Event":"07/20/1968 02:30 UTC","Disposition":"Unknown","City":"Undisclosed","Longitude":"-105.774217","Source":"MUFON","Case Number":"25620","Object Flight Path":"Other","Object Shape":"Circle"}