{"Object Shape":"Disc, Unknown","Longitude":"-72.38617","Case Number":"25637","Region":"New York","files":["/var/www/straped/mufon/html2text/25637.html.txt","/var/www/straped/mufon/org/25637.html"],"Viewing Distance":"101-500 Feet","Date of the Event":"01/12/1967 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.887737,+-72.38617(25637)&iwloc=A&hl=en\"> mufon case (25637) map </A>","Latitude":"40.887737","Weather Factors":"Unknown","Tags":"City","Date Submitted":"10/01/2010 06:33 UTC","Disposition":"IFO","Summary":"Huge object moving at a dog trot pace through very low cloud cover","divs":["Sighting DetailsIn January of 1967,about 50 of us were living off campus at the \"Tam-O-Shanter\" motel about 100 yards west of Southampton College on Montauk Highway (old Rte 27).It was the middle of January but the weather was mild and the temperature was about 60 degrees. The atmosphere was damp and misty and the cloud cover most have been at 200 feet and very dense with some small gaps.We were playing touch football in the parking area in front of the motel when one of the guys said something like\"holy crap\" stopped dead in place and stared at the sky.We all stopped and looked up to see what was going on.Above us at about 200 ft. was a large(100 yds.?) moving through the clouds from West to East parallel to the highway. There was no sound whatsoever. It seemed to be a steel gray color with large circular figures around the perimeter. We were all stunned and no-one said a word except one guy who said that he was going to call the Suffolk County Air Force base. He ran over to the phone booth and the rest of us just stood there watching, still not saying a word. The whole thing must only have lasted for 2 or 3 minutes. The object continued to move off East through the clouds at a pace that, if I wanted to keep up with it, all I would have to do was hit a fast trot. The next morning, two officers from the Air Force showed up when most of us were in class and asked some questions and left. They never came back and I was never interviewed. To the best of my knowledge, none of us ever discussed the incident and this is the first time that I have ever told anybody about this. One thing though; when it was over we all just walked away as if we were numb."],"Log Number":"US-10012010-0007","Object Features":"Window(s), Patterned Surface","Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","trends":["There have been 2 other sightings in Southampton","There were no other sightings in Southampton on or around January 12th 1967"],"City":"Southampton","Sighting Duration":"Undisclosed"}