{"trends":["There have been 9 other sightings in Euclid","There were no other sightings in Euclid on or around September 21st 2010"],"Log Number":"US-10012010-0006","Case Number":"25636","Disposition":"Insufficient Data","Object Features":"Unknown","Date Submitted":"10/01/2010 05:45 UTC","Summary":"Driving down highway see red lights over trees","Tags":"City","Object Shape":"Triangle","Sighting Duration":"Undisclosed","City":"Euclid","Longitude":"-81.516917","Weather Factors":"Unknown","divs":["Sighting Details We were driving home and my sister pointed out somthing flying low over the trees lining the highway. i leaned over to the window and noticed three red lights in a triangular pattern, with two blinking red lights, one on each side of the triangle in line with the others, and one larger red light in the center of the triangle. then i saw a light the color of a normal street light, golden in shade emitted like a slow torch from the rear or opposite the tip of the triangle for a brief moment possibly 1-2 secs then went away i only saw this light once . we were driving east bound on I-90 and had past the Burk air port (for quite a while) approaching Euclid. we couldnt tell if it was moving really slowly or hovering because we eventually past it, traveling at highway speeds. it was not a helicopter we saw a chopper later on and it looked nothing like it. Once we past it we debated for a minute and eventually decided to turn around but couldnt see it on the way back. (Dad was driving and never saw it, he was either to close to the trees having been in the drivers seat or too focused on driving.) My sister said some of the side was illuminated and appeared to be rounded in shape, but i did not see any shape and only saw lights."],"Date of the Event":"09/21/2010 09:45 UTC","Source":"MUFON","Country":"United States","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=41.602215,+-81.516917(25636)&iwloc=A&hl=en\"> mufon case (25636) map </A>","Region":"Ohio","Latitude":"41.602215","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/25636.html.txt","/var/www/straped/mufon/org/25636.html"]}