{"Latitude":"38.785033","Case Number":"25634","Source":"MUFON","Log Number":"US-10012010-0004","Date of the Event":"10/01/2010 12:30 UTC","divs":["sighting detailsi was driving north west on hwy 40\\64, west of the city of st. charles near hwy n. while driving, intuition urged me to look into the sky above me. i saw about 20-25 objects sort of floating on the wind almost directly above my location on the highway. i pulled off the road once i realized they were not birds. their distance from me is hard to determine, but they were certainly close enough for me to describe. their shape was like a boomerang or a triangle, similarly shaped like a b-2 except with a smoother contour to the aft section of its profile, at least from below. they were colored a brilliant white except for the tips of the wings which appeared to be black. their movement was akin to a kite, swirling in and out of each others flight paths, at what appeared to be the same height. they remained bunched together as i attempted to take a picture with my iphone, which did not come out, unfortunately. it seems as though as soon as i took the picture, they collectively, and with purpose headed east, at a very quick pace. much faster than any bird or kite or ultra-lite. faster than any civilian craft of that size, and i am certain it is nothing in our current declassified military aresnal either, as i am a former soldier of the u.s. army, aviation technitian, and military aviation enthusiast. as they moved off to the east at their unnaturally brisk pace, they met up with another group of the same typ of objects, now numbering about 30 or so. the sun glinted off of of them one last moment, then they nearly dissappeared instantaneously. without proper telemetry equipment or visual aid, my best guess is that they mainatined an altitude of about 4-5k meters and when they grouped with the others, they increased altitude and speed, in a direction directly away from me. this is my first personal sighting, and of course, i was very excited and shaking through the entire event, and afterwards. very exciting to say the least. what is interesting is that just a moment before-hand, i was scaaning my energy, the energy oaround me and my intuition guided me to feel that there was a sort of a void or a blockage of energy, or perhaps an abundance of it, above and slightly to the right of me. i felt that there was something there. i looked and there they were. the picture is not of great quality, but the objeects can be faintly seen just below the large bird, a vulture i believe, as the image is originally oriented. i did my best. i hope this helps in some way."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.785033,+-90.512987(25634)&iwloc=A&hl=en\"> mufon case (25634) map </A>","City":"St Charles","Country":"United States","Tags":"City","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around October 1st 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/25634.html.txt","/var/www/straped/mufon/org/25634.html"],"Object Flight Path":"Hovering then path","Region":"Missouri","Longitude":"-90.512987","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Date Submitted":"10/01/2010 02:29 UTC","Object Shape":"Boomerang, Triangle","Object Features":"Undisclosed","Disposition":"Unknown","Summary":"Flock of objects seen flying above location of observation. Objects suddenly and simlutaneously moved to the east","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}