{"Date Submitted":"10/01/2010 10:53 UTC","Weather Factors":"None","Object Flight Path":"Straight-line path","Latitude":"32.166685","files":["/var/www/straped/mufon/html2text/25639.html.txt","/var/www/straped/mufon/org/25639.html"],"Viewing Distance":"Over One Mile","Country":"United States","Source":"MUFON","Longitude":"-82.898533","Sighting Duration":"00:01:30","divs":["Sighting DetailsI was haveing a cigarette on my front porch, with my wife. I am acustomed to seeing planes and helicopters in the night sky, I looked up, and saw a red or orange glowing light that looked odd as it seemed larger and brighter than ones I see marking planes and helicopters. It resembled meteors I have seen in it's shape and color, but seemed larger and was moveing quite slow, a bit slower than most of the airtraffic I usualy see. I pointed it out to my wife, and I jokeingly said \" check out this UFO \". My wife laughed and said that it was just a plane, then she noticed that it didn't apear to have any of the small, flashing lights one expects on a plane. She suggested the possibility of a meteor, but we both thought it moved much too slow, and didn't have a tail like a \"shooting star\" it began to glow brighter and my wife got excited and opened the door to the living room and shouted for our son to come look. After a moment, my our son appeared just as the light seemed to dim and go out. We all talked for a moment about how \"cool\" it was to have seen it and what it could have been, when the light seemed to come back on. It was very dim at first, then it returned to it's origanal brightness. It continued to travel at the same speed and in the same direction it had previously. It appeared to be in the sky to the south or southeast of our home. It moved from west to east and appeared to be traveling in a straight line, approximately level. I couldn't say how large it was or how far away it might have been. It looked like it was somewhere over gwinnett, but may have been further south. After a moment it became obscured by trees and left our view. The entire sighting lasted for about a minute and a half, it was witnessed by myself, my wife and my son. The object didn't appear like a plane or helicopter or anything common, it was similiar to a meteor in some ways but it seemed to fly very slowly and it appeared to maintain a level course, it didn't seem to be falling. I have seen the international space station cross over at night before, and it wasn't that either. It appeared to move slower and to be lower in altitude. I surmise there is a mundane explanation for it, I just don't know what it might be. It was an \"object\", it was \"flying\" and I don't know what was. I did a google search to see if anyone else might have reported anything, which is how I came upon your websight. I feel that this sighting probably has a mundane explanation, and I hope you would be kind enough to share it with me if possible."],"trends":[],"Object Shape":"Sphere, Other","Tags":"City","Summary":"A red/orange ball of light travelling slowly. It dimmed,went out, then lit back up","City":"Undisclosed","Log Number":"US-10012010-0009","Region":"Georgia","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.166685,+-82.898533(25639)&iwloc=A&hl=en\"> mufon case (25639) map </A>","Disposition":"Unknown","Date of the Event":"10/01/2010 09:30 UTC","Case Number":"25639"}