{"City":"Phoenix","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.451707,+-112.069387(25635)&iwloc=A&hl=en\"> mufon case (25635) map </A>","Latitude":"33.451707","Summary":"Star moving slow, became increasingly brighter then just vanished.","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around September 28th 2010"],"Region":"Arizona","Weather Factors":"None","Country":"United States","Object Shape":"Star-like, Teardrop","Viewing Distance":"Over One Mile","divs":["Sighting DetailsAfter having seen an unidentifiable light in June, I have renewed energy for one of my hobbies that I have enjoyed since childhood. It was 7:14 pm. The sun had barely set and only about 3 or 4 of the few stars we can see from here were barely visible. Jupiter was also visable. I was sitting out back chatting with my daughter before her bedtime. We were looking at Jupiter with the binoculars to see how many of the 4 visible moons we could see. There was patchy cloud cover. I saw a light in the south and thought it odd. There is not normaly a star in that area of the sky at that time in the evening. The light was moving slowly. I then thought maybe it was a satalite due to the slow speed. I looked at it with my binoculars because I have never seen a satalite at 50 or 60 degrees from zenith. I looked for additional directional lights to determine if it was a plane. As it grew brighter, I began to suspect that it was an oncoming plane but it had only one non-blinking light. I was adjusting my focus to confirm that it was one non-blinking light and was about to call to my husband to look at it too. I bumped my binoculars while refocusing and then it was gone. Just poof, gone. It had been slow moving in a northerly direction. As it grew brighter it became a little bit teardrop shape. The best way I can describe the brightness is like a fireball meteor without any train. I have never seen a shooting star that had not trail behind it and this moved much slower than any meteor I have seen. It seemed like it was coming into the atmosphere. It did not go behind a cloud. The light occured in a patch of clear sky. I also noticed a lot of air trafic at the time. If it had been a plane or helicopter I should of been able to easily see additional lights as, I could see several lights on a plane a little higher and further south of the strange light. I'd like to know if this is a type of meteor or possible space rubble from satallites or another known object coming into our atmosphere or if this is another unknown object. Sorry for any poor spelling. I do not have a very good spell checker."],"Sighting Duration":"Undisclosed","Date of the Event":"09/28/2010 07:14 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/25635.html.txt","/var/www/straped/mufon/org/25635.html"],"Case Number":"25635","Tags":"City","Log Number":"US-10012010-0005","Longitude":"-112.069387","Date Submitted":"10/01/2010 05:37 UTC","Object Features":"None, Unknown"}