{"Longitude":"-6.460125","Summary":"Metallic, Low Flying, Slow Moving, Rotating Object with Three White Lights on the Bottom Hovered Overhead","files":["/var/www/straped/mufon/html2text/25649.html.txt","/var/www/straped/mufon/org/25649.html"],"Object Features":"Patterned Surface","Case Number":"25649","divs":["Sighting Details I'm not quite sure if it was July 17th exactly.. But it was definitely in July 2010.. Honestly, I have seen three definite UFOs this year alone, I managed to catch the other two on video - but this one was more amazing than those two, in the way that this one was lower; not just lights. I could see the shape, colour, flight patterns, and even the detail on the metallic surface. It had a 'hatch' on the bottom - and Im only calling it a hatch because I can think of no other word for it.. That place where the aliens walk out on a ramp from in the movies, and also where the 'abduction ray' comes from.. Around that, were three lights, and three lines, as if seperating the craft into three seperate sections - or maybe just for design. I was sleeping in the attic which had been converted into a bedroom, in my cousins house. Both of us have trouble sleeping so I was looking out the skylight window when this event occured. It was around 4:30am (GMT)and I was staring at this object the whole time while it hovered slowly accross the night sky. As soon as this UFO came into view, I thought to myself \"now there's a classic examply of a flying saucer - just like the typical interpretation\" I had a camera phone right beside me, but I didnt want to miss the opportunity to watch this UFO for as long as I could. When I say \"UFO\" I do not mean \"Unidentified Flying Object\" - I mean an alien spaceship, because I only use the term 'UFO' when I know thats exactly what it is. I was happy to see it so clearly, in such detail. I have always believed in aliens, and that they are here on Earth. Recording this on my phone - where videos could not be faked, would've proved it to everybody who got to see it.. I wish I had recorded a video of this UFO passing above me, but I was too pre-occupied with watching it to even think about picking up my phone. My cousin said \"what did you see?\" when he saw me stare.. I replied \"oh.. just a UFO..\" as if it was nothing to me, but it was.. I only replied in such a way because I had seen several UFOs before, and already known of their presence. I will report the other UFOs with video foorage, and the exact time and date. I just wanted to start with this one."],"trends":["There have been no other sightings in Wexford","This sighting has never been favorited."],"Object Shape":"Disc","City":"Wexford","Country":"Ireland","Disposition":"Unresolved","Latitude":"52.339161","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Flight Path":"Straight-line path","Date Submitted":"10/02/2010 04:59 UTC","Region":"County Wexford","Log Number":"IE-10022010-0007","Source":"MUFON","Date of the Event":"07/17/2010 04:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=52.339161,+-6.460125(25649)&iwloc=A&hl=en\"> mufon case (25649) map </A>","Tags":"City","Viewing Distance":"21-100 Feet"}