{"trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around September 23rd 2003"],"Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsDate 92303 Time Apx 1845 Weather Conditions Clear with very few clouds, none in direct LOS of object. Duration 5-10 seconds Location of sighting Directly North of the Whiteland exit on I65 heading North. State IN Distance to UFO Unknown UFO Size Size of grain of rice held at arms length. UFO Shape Appeared oval from side UFO Color Silver, appeared to be reflecting the Sun. Number of Witnesses Myself. Passenger was asleep. Details of sighting I noticed the object after I passed the Whiteland exit going North on I65. I attempted to identify it since I knew that there was an air lane from the Indy airport along there. The object did not appear to be moving. I watched it for approximately 5-10 seconds before I glanced down to make sure that I wasn't going to rear end another car and when I looked up it was gone. I scanned the sky to see if I could reacquire it but there was no trace of in the entire horizon. I then checked my GPS that I have on my dash to get the bearing and time. Bearing was 344 degrees and the object was approximately 50-60 degrees above the horizon. I am usually pretty good at identifying aircraft and other objects from my years in the military, but this one was either too distant or something I didn't recognize as an aircraft."],"Latitude":"39.769576","Object Flight Path":"Stationary","Disposition":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","Log Number":"","Summary":"Unidentified Object","Weather Factors":"Windy","Longitude":"-86.152074","Country":"United States","Region":"Indiana","Date of the Event":"09/23/2003 06:45 UTC","Date Submitted":"09/23/2003 06:45 UTC","Object Shape":"Disc","Sighting Duration":"00:00:59","City":"Indianapolis","files":["/var/www/straped/mufon/html2text/2564.html.txt","/var/www/straped/mufon/org/2564.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.769576,+-86.152074(2564)&iwloc=A&hl=en\"> mufon case (2564) map </A>","Case Number":"2564"}