{"Object Shape":"Star-like","Source":"MUFON","Latitude":"43.593435","Country":"Canada","files":["/var/www/straped/mufon/html2text/25646.html.txt","/var/www/straped/mufon/org/25646.html"],"trends":["There have been 20 other sightings in Mississauga","There were no other sightings in Mississauga on or around October 1st 2010","This sighting has never been favorited.",""],"Region":"Ontario","Viewing Distance":"Unknown","divs":["Sighting DetailsBefore submitting this event I checked to see if anyone else reported it, and i beleive it is the same event as reported from arizona on the same day. I was looking up at the sky. In my city you can hardly see the stars, only the brightest of them can be seen. The sky was cloudless in the area i was looking. I noticed a point light appear and slowly move, seemingly in a northerly direction, but as it SLOWLY moved it got brighter. It appeared brighter than the lights on planes so it got quite bright. after about 20 seconds it started to dim, but it seemed to me at the time it started to dim it changed direction slightly and speed, and in about 10 seconds it was gone. It definately was not a sat, possibly a meteor, but the way it moved and looked seems odd to be a meteor, unless the meteor was coming straight down almost directly towards my position. I have provided a few sketches. Sketch A represents my viewing of the sky looking towards north at about 65 degree angle. Sketch B is the way i interpretted it. This does not necessarily mean this is how it moved, but only how it was perceived to move. The sketch shows the earth, and a location where i would be standing. If it was an object, this is how it would be perceived. It seemed to go from outer space, into the atmosphere, and back out again. I hope this helps to related how I perceived it. As a final note, I still think it may have been a meteor, although I have never seen one like that. Usually they shoot quickly across the sky. But I figured I would file the report anyways in case what i describe could not be a meteor."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.593435,+-79.64286(25646)&iwloc=A&hl=en\"> mufon case (25646) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"10/01/2010 08:20 UTC","Log Number":"CA-10022010-0004","Case Number":"25646","Disposition":"Unresolved","Date Submitted":"10/02/2010 01:59 UTC","Longitude":"-79.64286","Weather Factors":"Unknown","City":"Mississauga","Tags":"City","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Summary":"Slow moving bright star like object"}