{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/25648.html.txt","/var/www/straped/mufon/org/25648.html"],"Latitude":"37.501161","Country":"United States","Source":"MUFON","Region":"Missouri","Tags":"City","Case Number":"25648","Object Shape":"Star-like, Unknown","Summary":"Starlike object begins moving after 15 minutes of hovering. After it got closer I could see that the object had multiple lights.","City":"Oak Ridge","map":"<A HREF = \"http://maps.google.com/maps?q=37.501161,+-89.72982(25648)&iwloc=A&hl=en\"> mufon case (25648) map </A>","trends":["There have been no other sightings in Oak Ridge","This sighting has never been favorited."],"Weather Factors":"None, Does Not Apply","Date Submitted":"10/02/2010 03:36 UTC","Object Features":"Unknown","Longitude":"-89.72982","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn Friday night, October 1st, 2010, I was at one of my favorite dark sky areas I go to for meteor showers and general star gazing. At about 10:45 I noticed what looked like a star in the North Western sky at about 15 - 20 degrees above the horizon. It seemed to be about a Magnitude 2 in brightness. The reason this caught my attention is because I am very familiar with the night sky and this \"star\" didn't seem to belong in that part of the sky. I immediately looked at it through my binoculars but it simple appeared to be a star. It was not moving and it was quickly changing colors just as a star does when it is low in the sky. I still felt that this object should not be in the position it was if it was a star so every couple of minutes I would check it out again through the binoculars to see if its position had changed. Every time I checked it was in the same position. I did this for about 15 minutes at which point I knew if it was a star I should have been able to tell that it had dropped a few degrees lower towards the horizon due to the movement of the earth. It had not moved at all. It was by this time, being interested in and believing that there are objects in the sky that are unexplainable, I began thinking to myself, \"if you're not going to move down, move up. Then I will know you're not a star.\" Still no movement was noticed. After about 15 minutes of noticing this object, I looked at it again and it finally looked like it had moved. I once again looked at it through the binoculars and it was finally moving in an Easterly direction. It still looked exactly like a star until it had moved far enough to be approximately NNW of me. I could then start seeing that there were 3 distinct light on this object. There were two orange lights that stayed lit continuously and one red light in the middle that pulsated. I did not see a green light or a white strobe light like you would expect to see on an airplane. I followed the object using my binoculars all the way across the sky from west to east until it got in the North Eastern sky until it was close to the position in the sky very close to the constellation Auriga. At this time it was like someone just turned out the lights. It was if there was nothing ever there. I then began checking out the rest of the sky again. I noticed something to the north again traveling west to east but after looking at it through the binoculars it appeared to have the lighting of a traditional aircraft. I then looked back to the NE where the unidentified object had disappeared and didn't see anything. At the same time a relatively bright orange light was seen moving North to South at about the same elevation in the sky as the original object that I was tracking. I looked at it through the binoculars and appeared almost identical to the original object but the separation in the three lights was not as noticeable. I have no idea if this was the same object but considering the timing and the location in the sky I would assume it was. The next night I went to this same spot wanting to watch an airplane traveling near the same path as the object I had seen the night before thinking that a plane my appear also as a star like object from a distance near the North Western horizon. I was fortunate enough to see one close to the same location. I was able to distinguish it as looking like an airplane until it was very close to the horizon. Even then it looked nothing like the object I saw when I first noticed it."],"Disposition":"Unknown","Log Number":"US-10022010-0006","Date of the Event":"10/01/2010 10:45 UTC"}