{"divs":["sighting detailsdriving to st. louis from des peres, traveling south at i-270 at kirkwood i noticed an incongruent triangle of red lights at about 15 degrees off the horizon traveling west to east, my right to left. the lights were fixed and appeared to be on a craft like a helicopter but didn't have faa helicopter navigation light colors nor blinking, all the lights faded and brightened in unison about once a second. it seemed like it could have been a large helicopter traveling adjacent to i-44, an east\\west highway that intersected with i-270 about a mile or two from where i was when i first noticed it entering my field of vision. as i traveled and exited on to i-44 east, the object appeared to move in a southeast direction as i was getting closer to it. it was about the \"size\" of a dime at the closest i then saw it. i was tempted to stay on i-270 to possibly catch up to it as i was getting closer to it, but i continued on home - i don't go chasing ufos or possible ufos. after merging onto i-44 i started to see if i could yet see it in the distance by glancing to my right while driving. i didn't see anything for about a mile, there also being some small hills at that side of the highway that blocked a closer perspective. after clearing the last of these small hills there was suddenly, fairly close, the same incongruently shaped triangle of lights, but now all white and not blinking but keeping a constant brightness and much closer. i traveling east, the craft was at a 45 degree angle to my right just above the windshield while i was driving, so i could now only glance up to it once in a while. while i glanced up at it, it quickly had two of its lights flare up to a brighter white while the \"back\" white light went out. every time i got a chance to glance up to it while it was slowly passing in front of me about 45 degrees above me now, it was about the \"size\" of a dollar coin. it's lighting configuration had dimmed but stayed all white but also was slightly changing each time, additional lights coming into view when i would look up. by the time it passed at about 45 degrees to my left, about 15 degrees off the horizon, it seemed i could see a very black indefinite triangular structure that had four evenly spaced white lights on what from my perspective was its back with its point facing in the direction it was traveling away from me. there was additional lighting along a possible bottom and edges, those not so symmetrical as the four \"back\" lights. the craft appeared to be moving slower than a plane could. i could not tell if there was sound from it for the interstate highway noise. two of the previous three nights i also saw lights that didn't appear to be on conventional craft while i was driving, each not far from a point i saw tonight's craft, but i could not view them long enough to figure out what it was or wasn't. so, i'm making this report as tonight's craft did not appear it could have been conventional by its lighting color and configuration changes. it's weird to me that 3 of the past 4 nights i've seen strange lights as i was traveling somewhere along the same route each night between my home in st. louis and a place in des peres. last year i had several mufon reported sightings and pictures of day and night craft, clearly unconventional. this year i've had a few clear unconventional night sightings, but a lot of sightings that have kept me wondering what it was i saw, and i'm wondering what's up with that :)"],"Region":"Missouri","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around September 29th 2010"],"files":["/var/www/straped/mufon/html2text/25642.html.txt","/var/www/straped/mufon/org/25642.html"],"Object Shape":"Triangle, Unknown","Longitude":"-90.189504","Latitude":"38.631472","Date of the Event":"09/29/2010 10:10 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Hoax","Log Number":"US-10022010-0001","map":"<A HREF = \"http://maps.google.com/maps?q=38.631472,+-90.189504(25642)&iwloc=A&hl=en\"> mufon case (25642) map </A>","Case Number":"25642","City":"St Louis","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"10/02/2010 01:49 UTC","Summary":"Triangle of Lights Change Color and Configuration"}