{"Disposition":"IFO","trends":["There have been 2 other sightings in Waxahachie","There were no other sightings in Waxahachie on or around October 1st 2010","This sighting has never been favorited.",""],"Date Submitted":"10/02/2010 08:32 UTC","Case Number":"25653","Date of the Event":"10/01/2010 12:16 UTC","Source":"MUFON","Tags":"City","Object Flight Path":"Undisclosed","Sighting Duration":"00:00:01","map":"<A HREF = \"http://maps.google.com/maps?q=32.386531,+-96.848331(25653)&iwloc=A&hl=en\"> mufon case (25653) map </A>","Country":"United States","Region":"Texas","Log Number":"US-10022010-0011","Object Features":"Undisclosed","Summary":"Was taking photos for a Real Estate listing and captured a disk object in one of the shots","Object Shape":"Disc","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/25653.html.txt","/var/www/straped/mufon/more/25653_submitter_file1__DSCN8855.JPG","/var/www/straped/mufon/more/25653_submitter_file2__DSCN8853.JPG","/var/www/straped/mufon/more/25653_submitter_file3__DSCN8854.JPG","/var/www/straped/mufon/org/25653.html"],"Viewing Distance":"Unknown","Latitude":"32.386531","City":"Waxahachie","Longitude":"-96.848331","divs":["Sighting DetailsI was taking photos of a real estate listing in Ellis County near Waxahachie on FM 66. I did not see this object, nor hear it, or realize anything actually until one day later, today, this morning (Oct 2nd 2010) when I was reviewing the photos and choosing the ones I want for the listing. I saw this object, then zoomed in, and no doubt it has a disk shape. It's in only one photo, but the photos taken directly before it in the same area do not show it. I have a Nikon Coolpix P80 camera which took the photo, and the flash was off, so time in between photos was short, maybe 5-7 seconds or so. The photos directly afterwards are of the back of the home, showing I was completely unaware of what was just photographed. The photo was taken at 12:16pm CST on the right side of the home facing the back yard to the left of the home. The barn in the picture is the neighbors barn and not on this property. I still have the original photo on the memory stick. The first photo is the image photo in the top left corner. The next 2 photos are the ones that directly proceeded this photo showing the same area and taken within seconds of this one. I have saved the photo on multiple computers as to not lose it, still have it on the memory stick, and emailed to myself and family."]}