{"Viewing Distance":"Unknown","Date of the Event":"10/02/2010 11:55 UTC","Summary":"Large burning object low in the sky, falling.","Object Features":"Undisclosed","divs":["Sighting DetailsI was standing on the deck, smoking a cigarette outside of my parents home in Orion, MI around midnight on October third. I was looking into the night sky, and noticed that a lot of dogs in the surrounding suburb were barking more than they usually do. I was watching some interesting cloud formations blow by when I saw a blue streak cross the sky above. I thought at first that it might have been a comet, or a shooting star, but quickly realized that it was far too low to the ground, and seemed to be falling. As it got lower, I noticed that it looked like it was on fire, the actual object looked round and seemed to be engulfed in bright blue flames, and was followed by a cooler, orange trail. The object was quite large, perhaps the size of a quarter if you held it out in your hand against the horizon. It watched the object as zipped by and descended lower to the horizon. I was expecting it to collide to the earth, but before it reached the edge of my viewable horizon, it seemed to blink a couple of times before it disappeared entirely. The entire sighting was fairly short, perhaps only two seconds or maybe even less. When it was over, I stood watching the sky in shock for around five minutes. I was so distracted by what had happened that I noticed that my cigarette had gone out while stared I dumbly at the horizon. I also noted that after the object had vanished, more dogs around the neighborhood started barking. Eventually I got too cold to keep looking at the sky, so went in side, grabbed my computer to search for any astronomical events over the Michigan sky for the night, and found nothing that would account for I had just seen. I am still unsure of what I saw, and am pretty hesitant to say it was an extra-terrestrial craft, but it was certainly a UFO. I am hoping that someone who reads this might be able to explain what I saw, or at least quench my curiosity."],"trends":["There has been one other sighting in Orion Township","There were no other sightings in Orion Township on or around October 2nd 2010"],"Tags":"City","Date Submitted":"10/03/2010 01:00 UTC","Longitude":"-83.272008","Sighting Duration":"Undisclosed","Latitude":"42.763743","Object Flight Path":"Undisclosed","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25657.html.txt","/var/www/straped/mufon/org/25657.html"],"Disposition":"Unknown","Weather Factors":"Unknown","Case Number":"25657","Region":"Michigan","Object Shape":"Fireball, Sphere","Log Number":"US-10032010-0001","map":"<A HREF = \"http://maps.google.com/maps?q=42.763743,+-83.272008(25657)&iwloc=A&hl=en\"> mufon case (25657) map </A>","City":"Orion Township"}