{"Longitude":"-122.204297","Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","Log Number":"US-10032010-0003","Summary":"3 moving objects in the night sky that resembled bright orange stars","Region":"Washington","Viewing Distance":"Over One Mile","Tags":"City","trends":["There have been 4 other sightings in Mill Creek","There were no other sightings in Mill Creek on or around September 30th 2010"],"Country":"United States","Latitude":"47.860097","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=47.860097,+-122.204297(25659)&iwloc=A&hl=en\"> mufon case (25659) map </A>","files":["/var/www/straped/mufon/html2text/25659.html.txt","/var/www/straped/mufon/org/25659.html"],"Date Submitted":"10/03/2010 01:50 UTC","Case Number":"25659","Object Shape":"Star-like","City":"Mill Creek","divs":["Sighting DetailsI was at my home in Mill Creek (about 20 miles north of Seattle) watching TV when my sister, who was in the backyard, asked me to come outside to look at something strange in the sky she could not identify. I was curious so I came outside to have a look at what she was talking about. When I was outside, she pointed at 2 (she said there had been 3) fairly bright orange objects in the sky. I have never seen anything before that had the appearance of these lights and I'm not sure what they could have been. The light they were emitting seemed very strange. They were moving roughly in a north to south direction and appeared to be quite high up. They seemed to be moving at about the speed of a jet airplane at first, but then one object slowed to a stop and hovered. The second object kept going a bit further, then slowed down, changed direction and faded out of sight. The first object remained visible for a bit longer, still hovering, then went dark as well. By luck, the sky was clear that night and we had an unobstructed view of the objects. We really aren't sure whether what we saw was military or otherwise, but it definitely was not a natural occurrence."],"Object Features":"Unknown","Disposition":"Unknown","Date of the Event":"09/30/2010 09:00 UTC","Sighting Duration":"00:01:00"}