{"Latitude":"52.980471","Weather Factors":"None","Country":"Ireland","Object Shape":"Square, Rectagular","trends":["There has been one other sighting in Wicklow","There were no other sightings in Wicklow on or around September 12th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/25666.html.txt","/var/www/straped/mufon/org/25666.html"],"Date of the Event":"09/12/2010 09:48 UTC","Source":"MUFON","Longitude":"-6.042743","Tags":"City","Date Submitted":"10/03/2010 04:11 UTC","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Straight-line path","Object Features":"Appendage(s)","City":"Wicklow","Case Number":"25666","Sighting Duration":"00:00:50","Viewing Distance":"101-500 Feet","Log Number":"IE-10032010-0010","Summary":"Square Shape with Seperate Section at Front (like where you would expect a pilot) with Orange Glow at Back... Went Overhead and Disappeared","Region":"County Wicklow","divs":["Sighting DetailsI was standing outside waiting on a bus. It was the 12th of September 2010, at exactly 9:48pm. I looked up above the building accross the road from me - and I seen an orange light ascending, as if it just hovered up from the ground. When it got to a certain height, it stopped for a second, then hovered slowly towards me (travelling east) and I managed to get my phone camera set up after 20 seconds or so. I could see the outline of this ship. Honestly, it looked exactly like the landing craft from the original series of V. or like the Imperial Landing Craft - or Imperial Shuttle from Star Wars. With the square main part, and another part attached to the front - with the 'boost' at the back.. It didnt look like it was a thruster.. was a perfect circle, orange, glowing not exactly like a fire. (there was also nothing such as smoke emitted from the back) I recorded this UFO flying but my phone camera just shows the orange light hovering until it disappears. No outline can be noticed in the video."],"map":"<A HREF = \"http://maps.google.com/maps?q=52.980471,+-6.042743(25666)&iwloc=A&hl=en\"> mufon case (25666) map </A>"}