{"Latitude":"40.490564","Weather Factors":"Unknown","Region":"Pennsylvania","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.490564,+-79.885136(25663)&iwloc=A&hl=en\"> mufon case (25663) map </A>","Log Number":"GB-10032010-0007","Date Submitted":"10/03/2010 10:13 UTC","Summary":"I was on the bus on the way to school and witnessed a silver/metallic sphere that was inanimate.","Object Features":"None","Longitude":"-79.885136","divs":["Sighting DetailsI was on the bus early in the morning on the way to school, and it was a very clear day with no clouds in the sky, and so there were no strange shadows from the sun and clouds. I was sat on the left side of the bus on the back seat next to the window and so I could see perfectly what was outside. The bus had started to climb a steep hill out of a valley, and my view was blocked by a tall hedge on the left side. When we reached the top of the hill the hedge ended and then there is an open dirt track, and then just as I was looking down this dirt track as i do every day, I glimpsed upward as I saw a small glint. Again, It was a very hot and clear day and so i know that I wasn't just seeing a strange shadow of some kind, and I make this journey every day and so I know what is and what isn't out of the ordinary. Once I had noticed the glint of the reflection of sunlight, I immediately looked up and saw what appeared to be a sphere that looked very metallic in appearance. I was amazed at it as it was not moving at all, and I knew that no technology of today is sophisticated enough to be as still as what this object was, so I straight away dismissed the fact that is was any kind of aircraft that I knew of, it was definitely not of this world as far as I know. When i looked at it i noticed that there were no ropes or anything that would be holding it still, so I also dismissed the fact that it was a weather balloon of some sort. It was just perfectly still in mid air- hovering. From what I could tell it must have been at least 80-100 feet up in the air above the dirt track. From where I was, it looked about the size of a wrecking ball, but I know that it wasn't a very small object. (In my personal opinion it could have been some sort of probe or reconnaissance object) I couldn't understand what or why it was there, and I know for a fact that the day previous to the event that it was not there at all. As the bus drove further away and into a nearby village, I continued to look at the object as I thought that it might vanish at some stage but it didn't. When the bus drove into the village I could no longer see it as there were houses and trees in the way. The bus continued through the village and we eventually came out of the village the same way we came in, and so I was expecting it to still be there, but it had now vanished. I looked around the area where it was and also the surrounding area to make sure that it hadn't simply moved to another place, but it had vanished and there was no further sighting of the object at all. I haven't ever been this close to an object that I am unfamiliar with, and i was very intrigued to find out what the object was. I am not a UFO skeptic at all, and I am very interested in this subject. I would like to thank you for reading this story, and I am intrigued to find out if there have been any further sightings of objects similar to this."],"Sighting Duration":"00:02:00","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/25663.html.txt","/var/www/straped/mufon/org/25663.html"],"trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around July 2nd 2010"],"Date of the Event":"07/02/2010 08:40 UTC","Tags":"City","Object Flight Path":"Stationary","City":"Pittsburgh","Disposition":"Unresolved","Case Number":"25663","Viewing Distance":"21-100 Feet"}