{"City":"Williamsburg","divs":["Sighting DetailsI was looking up in the sky at the skydivers who were brining the game ball for a William and Mary football game. At that time I noticed a bright star. There were no other clouds, no other \"stars\" and a complete bluebird sky. The star didn't move at all, so I knew it wasn't a plane or satellite. It was very high in the sky as there were dark birds soaring in the sky(they were dark shadows, from the angle of the sun setting towards the west) and this light was much higher and further from viewing distance on the ground. I pointed this out to my friends at the tailgate and they saw it and couldn't determine what it was. After about 1 min or so, this light vanished. I then noticed another light, lower on the horizon (from the first star) but still very high in the sky. This light appeared to have 3 distinct lights...very close together, in the shape of a triangle. It didn't move and appeared to raise the level of its illuminescence from very bright \"star-like\" to very low but still visible. Watched this for 2-5 minutes and nothing changed, no movement. I then went about my business and the lights were gone when I next looked up...within 30 minutes of the sighting."],"Summary":"3 bright lights (star-like) in shape of a triangle","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.270702,+-76.707457(25664)&iwloc=A&hl=en\"> mufon case (25664) map </A>","Object Features":"Unknown","trends":["There have been 3 other sightings in Williamsburg","There were no other sightings in Williamsburg on or around October 2nd 2010"],"Country":"United States","Source":"MUFON","Object Shape":"Star-like, Triangle","Date Submitted":"10/03/2010 03:10 UTC","Log Number":"US-10032010-0008","Viewing Distance":"Over One Mile","Longitude":"-76.707457","Region":"Virginia","Case Number":"25664","files":["/var/www/straped/mufon/html2text/25664.html.txt","/var/www/straped/mufon/org/25664.html"],"Disposition":"Unresolved","Latitude":"37.270702","Date of the Event":"10/02/2010 03:20 UTC","Weather Factors":"None"}