{"Tags":"City","Summary":"Bright Flashing Light, stationary then slowly moved down","Latitude":"40.231608","Date Submitted":"10/03/2010 05:25 UTC","Longitude":"-105.266578","files":["/var/www/straped/mufon/html2text/25668.html.txt","/var/www/straped/mufon/org/25668.html"],"Log Number":"US-10032010-0012","City":"Lyons","Country":"United States","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","trends":["There has been one other sighting in Lyons","There were no other sightings in Lyons on or around September 28th 2010"],"divs":["Sighting DetailsWe had stepped out onto our deck at appx 9pm, we live in the mountains in a small bedroom community approx 7500 feet in elevation. We dont have much light pollution and have very good star gazing. As soon as we stepped out looking due North we noticed an extremely bright object with flashing or rotating lights. We viewed this through binoculars, but it was very visable with our bare eyes as well. The object was stationary for at least 10 minutes. We had a ridge and trees to continue to compare with and are very sure it was stationary except for the lights. We called over the neighbor who was able to view it from our deck as well. Shortly after that it started to slowly move downward. We were able to follow the downward motion and actually stepped on chairs to continue viewing it until it went out of view behind the ridge. This object was much closer that a star would have ever been. it was extremely bright! There didnt appear to have any lights pointiong downward but definitely apeared to have either multiple colored flashing or rotating lights."],"Object Flight Path":"Stationary,Hovering then path","Case Number":"25668","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.231608,+-105.266578(25668)&iwloc=A&hl=en\"> mufon case (25668) map </A>","Date of the Event":"09/28/2010 12:00 UTC","Object Shape":"Cylinder, Star-like","Source":"MUFON","Region":"Colorado","Object Features":"Unknown","Disposition":"Insufficient Data"}