{"Country":"United States","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy girlfriend and I were star gazing at a friend's house, when this group of lights caught our attention. At first we thought it was a plane because all we saw at first was two white lights and a red in the center, but as it passed over us, we clearly saw it was not. A black perfect equilateral triangle. It didn't have the saw tooth pattern on the back like the B-2, it wasn't diamond shaped like the F-117, just a perfect black triangle with three bright white lights on the bottom of each point, and one less bright, slightly larger red light in the center. It emitted a sound. Though only slight, it was something of a metallic muffled hum. Also the way it moved was pretty disturbing. It didn't swoop like what an aircraft usually does. It kind of shook. Almost like balancing a magnet on top of another. It looked like whatever was keeping it up was not jet propulsion. As quickly as it passed it disappeared behind the tree line a mile off. Afterward I was excited, almost a little upset that I didn't get to meet these beings, if at all they were aliens, but a general feeling of uneasiness befell everyone. My reason is, I've never heard of a pleasant abduction by a triangular craft."],"Longitude":"-90.556473","Weather Factors":"Unknown","Date Submitted":"10/03/2010 03:28 UTC","Latitude":"29.47635","Object Shape":"Flash, Triangle","Case Number":"25665","Source":"MUFON","Date of the Event":"09/30/2010 11:00 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Summary":"Fist UFO fly directly above my friend's house, had to be an altitude less than 600 ft. This thing was huge, and quiet. I saw the complete silloutte. Perfect triangle.","City":"Montegut","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25665.html.txt","/var/www/straped/mufon/org/25665.html"],"Disposition":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.47635,+-90.556473(25665)&iwloc=A&hl=en\"> mufon case (25665) map </A>","Region":"Louisiana","Log Number":"US-10032010-0009","trends":["There has been one other sighting in Montegut","There were no other sightings in Montegut on or around September 30th 2010"]}