{"Disposition":"Unresolved","Sighting Duration":"00:22:00","files":["/var/www/straped/mufon/html2text/25677.html.txt","/var/www/straped/mufon/more/25677_submitter_file1__MOV01378_3(1).jpg","/var/www/straped/mufon/org/25677.html"],"Country":"Ireland","Latitude":"52.984521","divs":["sighting detailsit was 1:05am on the 4th of october 2010 when i had my third close encounter of the second kind. i was sitting down on the sofa\\couch watching some cartoons, since there was no ufo documentaries on discovery science, etc. the tv started freezing, so my first thought as a ufologist, was \"maybe theres a ufo out there\" and then i started to notice really strange noises which changed for some reason. ive seen several ufos and this was the first non-silent one. it sounded like a cross between a plane, a helicopter, a tie fighter from star wars, and buzz... and with the combined volume of all these, as it was much louder than either one. already on my way to the door, i unlocked it and walked out to see what appeared to be just a green glow with a white flashing light. i watched it hover in one direction until it suddenly turned and circled over my house. when it went over my roof, i went back through the house and out to my back garden, where i could see it up close - it was long, black, and either triangular or cigar shaped. with a green light on each side, a smaller dim red light on the back, and a flashing, larger white light in the middle. i didnt expect it to, but it went around in circles above my house several times for about 25 minutes. it appeared to be flying in a straight line until i walked out onto the middle of the road and started to record it... it was as if it knew i was watching..."],"Date Submitted":"10/04/2010 04:14 UTC","Summary":"UFO with two green pulsating lights, one white flashing light, and dim red light, circles over my house several times and causes tv to freeze","Object Shape":"Triangle","City":"Wicklow","Viewing Distance":"Unknown","Date of the Event":"10/04/2010 01:15 UTC","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Wicklow","There were no other sightings in Wicklow on or around October 4th 2010","This sighting has never been favorited.",""],"Tags":"City","Object Features":"Undisclosed","Case Number":"25677","Log Number":"IE-10042010-0006","map":"<A HREF = \"http://maps.google.com/maps?q=52.984521,+-6.038683(25677)&iwloc=A&hl=en\"> mufon case (25677) map </A>","Region":"County Wicklow","Source":"MUFON","Longitude":"-6.038683","Weather Factors":"Unknown"}