{"Tags":"City","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.61726,+-75.485153(25676)&iwloc=A&hl=en\"> mufon case (25676) map </A>","Longitude":"-75.485153","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25676.html.txt","/var/www/straped/mufon/org/25676.html"],"City":"Allentown","Region":"Pennsylvania","Object Flight Path":"Hovering then path,Straight-line path","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around July 10th 2002"],"Case Number":"25676","divs":["Sighting DetailsI was playing with my son who was blowing bubbles and chasing them and as I watched them blow in the wind noticed a lot of objects blowing around mostly paper and leaves. One object appeared to be a large rectangle of cardboard with retangular cut outs on each corner. I was amazed that such a large object could be picked up and blown that high. Then the rectangle began to shake and move forward into the wind! I called my son to the side of the house where he could see it and we stood there as this thing hung in one place wobbling up and down. Then a opening appeared on the bottom and a black and silver banner fell out of the thing. I was 25 feet from a camera but was so surprised that I never moved toward it. The banner began to twist slowly and after a few minutes the object began to slowly rise. I was able to follow it up to cloud base (about 15000 ft) by the reflection of the sun off the silver side of the banner. The object moved very slowly and made no noise of any kind. We live near the approach to Alllentown, Bethlehem, Easton Airport so I called them to tell them this thing was in the approach; they said they had nothing on the scope. I did report this to a ufo monitoring site but never heard anything back. I would like to know what this could have been and if anyone else has ever seen such an object? I could not begin to guess the size or distance, but; it appeared to be very close to me."],"Log Number":"US-10042010-0005","Date of the Event":"07/10/2002 12:00 UTC","Weather Factors":"Windy","Object Features":"Other","Date Submitted":"10/04/2010 03:01 UTC","Source":"MUFON","Object Shape":"Other","Latitude":"40.61726","Summary":"object dropped banner Silver/black that rotated and seemed to power ufo"}