{"Region":"Pennsylvania","Log Number":"US-10042010-0007","Weather Factors":"Unknown","Longitude":"-75.161159","Date Submitted":"10/04/2010 06:37 UTC","Latitude":"39.959665","Object Flight Path":"Path then hovering","City":"Philadelphia","files":["/var/www/straped/mufon/html2text/25678.html.txt","/var/www/straped/mufon/more/25678_submitter_file1__IMG_0527.JPG","/var/www/straped/mufon/more/25678_submitter_file2__IMG_0522.JPG","/var/www/straped/mufon/org/25678.html"],"Summary":"When getting ready to ride my bike I noticed two still oval shape objects in the sky flying real slow with no sound from it.","Viewing Distance":"Unknown","divs":["Sighting DetailsOn September the 8th 2010 at approx 18:30hrs, I arrived to my gym in a shopping mall via my bike in the area of 24th and Oregon in South Philadelphia. Upon leaving the gym for the evening I usually fix my protein drink and shake it while walking to my bike and finally take big gulps. I was never prepared for what I was going to see but I always hoped for as a young kid that I could very well see a UFO and be able to record every movement of the object. Upon arriving to my bike while drinking and my head tilted to the sky I noticed a silver oval like object moving real slow with silence near a pet-smart store at approx 19:44hrs. I then wondered is this what I think it is because it does not have any lights like an airplane and it was not leaving any air dust like jets do. I then thought maybe a weather balloon but it couldn't be because the movement looked completely different. I immediately pulled out my 4th generation Iphone and started recording and noticed no one else was looking at what I was looking so I felt weird but I didn't care because this is the moment I have been waiting for. I then saw it leaving my view and proceeded to my bike to follow the object. While on my bike I then noticed two objects flying parallel to each other in some formation that would cause a regular airplane a accident. I got off my bike shocked and tried to focus for my second recording of the now second object in visual but they were to fast and left with such speed out of this world! I immediately text my wife and told her \"you will not believe what I just recorded\". Upon arriving home I screamed for my wife and said please look at this and tell me what you think? She said is this what I think it is I then said maybe but I got to analyze and zoom into the recording for further details. I then proceeded to my computer and went to work and took some still shots of the recording and noticed I had two UFO's in sight. I started zooming into the actual recording while the object was moving and saw the actual shape of this object. I was never more in shock ever in my life until I saw this. I was more in shock for joy then anything over what I had just seen! My conclusion of these two objects can only be classified as my first kind Philadelphia UFO."],"Country":"United States","Tags":"City","Disposition":"Insufficient Data","Date of the Event":"09/08/2010 07:44 UTC","Source":"MUFON","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around September 8th 2010","This sighting has never been favorited.",""],"Sighting Duration":"07:44:10","Case Number":"25678","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.959665,+-75.161159(25678)&iwloc=A&hl=en\"> mufon case (25678) map </A>","Object Shape":"Oval"}