{"Longitude":"-87.81137","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Windy","map":"<A HREF = \"http://maps.google.com/maps?q=41.889246,+-87.81137(25675)&iwloc=A&hl=en\"> mufon case (25675) map </A>","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around October 1st 2010"],"divs":["Sighting DetailsI Was on my back porch looking up when I first noticed what looked like a quick moving single small cloud with no describable shape moving from West to East form into a distinct double Vv formation over Forest Park, IL Friday Oct 1 at around 11pm. As I watched the indescribable mass move above me it formed into a clear low flying double V or Vv formation of low lit circle lights. One V was slightly ahead of the other and it silently glided over quickly and disappeared East towards Chicago. It looked as if it went from a quick moving low lit cloud to trying to resemble a formation of birds, but I could tell they were not birds because; it made no noise, no out of sequence normal bird bobbing and flapping, it was glowing dimly and remained in perfect formation as the double Vv flew over, this all happened in a matter of 10 to 20 seconds. Again it looked nothing like normal birds in formation. I would assume if someone happened to look up and see the low lit Vv fly over they would probably think they were just geese in formation but I saw it form from a mass of nothing describable to the clear Vv. It looked as if the object tried to blend in to fly low over the City by camouflaging itself into that specific shape. I had my camera with me but the event happened so quickly I could only just witness it. Since 2009 over Forest Park I have seen tumbling dark orbs fall from the sky, dark spheres play hide and seek in the clouds, daytime high slow moving star like objects, night time high zig zagging stars, a light reflecting diamond shaped object, a copper colored orb, crescent shaped craft, orange orbs, a red orb, other craft that have resembled birds, and low lit V formations but this is the first time I have seen a low lit quick moving cloud of discoloration form into a double Vv formation. All of this is happening over my house with some consistent frequency, I am not sure why its happening but to me it is pretty amazing. Below is a generic rendering of what I saw fly over Friday October 1, 2010 hopefully someone else saw the same thing I did. Peace o o o o o o o o o o o o o o"],"files":["/var/www/straped/mufon/html2text/25675.html.txt","/var/www/straped/mufon/org/25675.html"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"10/01/2010 12:00 UTC","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","Case Number":"25675","City":"Forest Park","Source":"MUFON","Summary":"Double Vv formation w/ dim lit lights suddenly appeared then glided away","Date Submitted":"10/04/2010 01:51 UTC","Country":"United States","Region":"Illinois","Object Shape":"Circle, Unknown","Latitude":"41.889246","Log Number":"US-10042010-0004","Tags":"City"}