{"Case Number":"25674","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around September 30th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering,Unknown","Weather Factors":"None","Sighting Duration":"00:50:00","map":"<A HREF = \"http://maps.google.com/maps?q=41.080873,+-85.130101(25674)&iwloc=A&hl=en\"> mufon case (25674) map </A>","Longitude":"-85.130101","files":["/var/www/straped/mufon/html2text/25674.html.txt","/var/www/straped/mufon/more/25674_submitter_file1__M2U01025.jpg","/var/www/straped/mufon/more/25674_submitter_file2__M2U01028.jpg","/var/www/straped/mufon/org/25674.html"],"Object Features":"None","Log Number":"US-10042010-0003","Country":"United States","Tags":"City","Latitude":"41.080873","Disposition":"Unknown","divs":["Sighting DetailsOn the evening of September 30, 2010 I was at Snider High School, filming the marching band for a video project I am working on. I was also with my friend. It was around 7:11 pm and as I was filming, a few of the band members point at something in the sky in the distance above the school to the west. The sun was setting in that direction. It was a fairly bright stationary object. I got curious and decided to zoom in all the way on it. Let me also point out that I was using a Sony HandyCam DCR-SR42 camcorder with 40x optical zoom and 2000x digital zoom. It was an object with 2 lights and as I watched it the lights would flash green and red over and over. Since I was zoomed in all the way, the camera would shake with every tiny motion I took, so I decided to deploy the tripod I was using. As I was messing with they tripod, I tried to draw up an explanation to what the object was, but I drew a blank. After my friend and I fumbled with the tripod we lost sight of the object for just a few seconds until it finally reappeared in a different location in the sky. I zoomed in again and it was the same object. After about a good minute or so the object disappeared. About 2 minutes later we saw another object, but this one I did not video tape, this object was in motion and was flying around in a smooth pattern, staying in the same part of the sky, while that was going on, we witnessed another object appear, but this one was stationary. I turned on the camera and zoomed in. This time it was a single light that was flashing green and red. At this point we had thought that the first single object had split in to 2 separate objects. The object in motion disappear without us realizing it. So we kept watching the stationary object. That object then dimmed out and disappeared. After about 5 min we caught sight of yet again another object. Except this one was considerably larger or closer and lower on horizon. I zoomed in on it and right as I did it seemed to grow about twice it size and it glowed red. Then it dimmed down and started to move. As I was recording I managed to get some trees in the shot as a reference to track the motion of the object. It moved to the right slowly and as it did, it suddenly stopped. Then is started moving again, stopped, moved again, stopped once more and when it started moving it did some kind of loop. It continued to move at a constant speed and got dimmer and brighter as it moved. Until finally it disappeared behind the school building. At this point it was 7:30pm and the band's late night rehearsal was ending. The band members who saw it were very puzzled and excited at what they say and watched the videos I had taken. After practice I said goodbye to my girlfriend, and told my friend that was with me to keep his eyes peeled for anything else. At this point the sky was almost completely dark. I got in my car and started driving home, the commute to my house is only 3 minutes since I live in the neighborhood behind the school. With the objects still fresh in my mind I looked up in at the sky hoping to see something and to my amazement I did. I slowed down the car to make sure I was seeing things. It was an object with 3 lights in a triangle formation traveling southeast towards the school I just came from. It was traveling at a constant speed, and was not very high up, I could not physically see the object since the sky was dark, but as it flew over some stars, the stars disappeared behind the object. There were 2 lights in the front and the light in the back had a white strobe on it. I was about 7:56pm when I saw it. I thought that it might be an aircraft. I looked around and actually saw an usual concentration of air traffic to the west where the first objects were spotted 30 minutes previously. I knew that they we're aircraft because I am quite familiar with the light configuration on conventional aircraft since I am an aviation enthusiast. I can even identify different types of aircraft such as the make and model. I stopped my car in front of someones front yard and started filming. I got in a kneeling position to hold the camera steady and took two videos of the object. I watched it for about two minutes until it disappeared behind the tree line still traveling southeast. Freaked out at this point, I called my friend I was with while I drove the rest of the way home through my neighborhood. I told him what I just saw, then he told me that he was still at the school and that he saw a very bright white light in the sky in the same direction the craft was coming from. Then it disappeared. I finally got home, very spooked, and watched the videos I had just taken. All of these events took place from approximately 7pm to 8pm. In the same area between my house and Snider High School in the neighborhood of Glenwood Park. There were about 11 to 15 witness on the first objects. And only one or two for the triangular object. The photos attached are frames taken from the videos taken that evening. I am unable to upload the videos since they are to large. The next day I also learned of a sighting of 13 objects exactly like my first sighting in West Chicago, Illinois on the same day at the exact same time."],"Summary":"1st object was a sphere shape with flashing green and red light, 2nd object was a triangle with 3 lights","Region":"Indiana","Date Submitted":"10/04/2010 01:40 UTC","Date of the Event":"09/30/2010 07:10 UTC","Object Shape":"Fireball, Sphere, Triangle","Source":"MUFON","City":"Fort Wayne","Viewing Distance":"Over 1 Mile, Unknown"}