{"files":["/var/www/straped/mufon/html2text/25684.html.txt","/var/www/straped/mufon/org/25684.html"],"Date Submitted":"10/05/2010 08:32 UTC","Latitude":"39.738566","Date of the Event":"10/05/2010 03:45 UTC","Object Shape":"Sphere","divs":["Sighting DetailsI came outside during a break at work, as I walked out I looked to the east, I was actually looking at venus I believe, but something didnt look right. In between venus and another bright star to the left of venus, I seen a third bright light in between them. Then I noticed that it was moving in a north easterly direction. It moved slowly and after I would say 3 to 4 mins, it just vanished. This was a bright white light, not an aircraft. A few min. later I was still watching the sky, and as I looked to the north, I seen another bright light. This one was more intense, and was moving much faster. It was headed in a easterly direction. I watched it as long as I could until I had to go back to work. It was still headed in the same direction as I went back inside. I couldnt believe what I was seeing. Im a skeptic untill proof is in my face, and this sighting really spooked me. I really believe what I saw was not an aircraft, shooting star, ect.. This was different than anything I have ever seen. I tried to take pics with my camera phone, but could not get it to focus, all I could see was black."],"Log Number":"US-10052010-0002","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.738566,+-90.22251(25684)&iwloc=A&hl=en\"> mufon case (25684) map </A>","Region":"Illinois","Case Number":"25684","City":"Jacksonville","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Longitude":"-90.22251","trends":["There has been one other sighting in Jacksonville","There were no other sightings in Jacksonville on or around October 5th 2010"],"Summary":"I seen 2 ufo's while looking to the south east and one to the north east","Viewing Distance":"Unknown"}