{"Date Submitted":"10/05/2010 01:23 UTC","Region":"Illinois","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"08/22/2010 09:30 UTC","Object Features":"Unknown","Longitude":"-88.201049","Country":"United States","files":["/var/www/straped/mufon/html2text/25688.html.txt","/var/www/straped/mufon/org/25688.html"],"Tags":"City","Object Shape":"Unknown","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.617695,+-88.201049(25688)&iwloc=A&hl=en\"> mufon case (25688) map </A>","City":"Plainfield","divs":["Sighting DetailsAT APPROXIMATLEY 9:30PM ON A SUNDAY EVENING WALKING THE DOGS, A VERY BRIGHT OBJECT APPROACHED STRAIGHT FROM THE EAST HEADING WEST OVER PLAINFIELD AT ABOUT 4000 FT ABOVE 135TH ST ON THE NORTHWEST SIDE. THE OBJECTS'S SHAPE COULD NOT BE DISCERNED DUE TO THE EXTREME BRIGHTNESS. THE LIGHT WAS SO INTENSE THAT NO OTHER NAVIGATIONAL LIGHTS WERE SEEN AND A HALO-LIKE APPEARANCE RADIATED OUTWARD FROM THE OBJECT IN A 360 DEGREE FASHION. THE AMBER-LIKE COLOR WAS EXACTLY THAT OF THE UBIQUITOUS STREET LAMPS. THERE WAS NO NOISE SIMILAR TO THAT OF A PASSENGER JETLINER OR HELICOPTER COMING FROM THIS CRAFT. THE CRAFT WAS TRAVELLING A SPEED TYPICAL OF AN AIRLINER APPROACHING ONE OF CHICAGO'S AIRPORTS. HOWEVER, THE ROUTE IT WAS FLYING WAS EXACTLY OPPOSITE OF THE ROUTE OF JET AIRLINERS ON APPROACH TO MIDWAY AIRPORT WHICH IS A STRAIGHT EASTBOUND APPROACH OVER THIS AREA. THE OBJECT THEN TURNED NINETY DEGREES TO DUE SOUTH WHEN IT FINALLY REACHED MY POSITION IN THE NEIGHBORHOOD. WHAT WAS ODD WAS THAT THE INTENSITY DIMINISHED GREATLY BUT THE SAME COLOR WAS SEEN FROM BEHIND BUT IN THE SHAPE OF A SMALL RECTANGLE REDUCING IN SIZE AS IT MOVED AWAY WHICH DISAPPEARED IN A FEW SECONDS ( MAYBE 5-6 SECONDS ) AS IF IT WENT INTO SOME SORT OF HYPERDRIVE. NO WHITE, GREEN, NOR RED NAVIGATIONAL LIGHTS WERE SEEN WHEN THE OBJECT WAS MOVING AWAY."],"Log Number":"US-10052010-0006","Summary":"Bright amber colored aircraft at night","Latitude":"41.617695","trends":["There have been 20 other sightings in Plainfield","There were no other sightings in Plainfield on or around August 22nd 2010"],"Case Number":"25688","Disposition":"Unknown"}