{"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.755589,+-77.467327(25681)&iwloc=A&hl=en\"> mufon case (25681) map </A>","Region":"Virginia","Country":"United States","Object Features":"Undisclosed","divs":["Sighting DetailsI was in my office when I received a call from my former neighbor. As I was on the phone with him, I looked out of my office window which faces to the SE and I noticed a triangular object which seemed to be rotating horizontally. Dulles airport is near by so I am uses to seeing lights in the sky constantly. I immediately noticed this as a unique event not only because of the size of the craft, but because as the object rotated the lights kept there respective geographical shape. This was not three planes buzzing by each other by any means. The lights neither blinked nor changed color, and the lights of the craft were a bright red. I could not make out the lines of the ship because it was too dark but by the shape of the lights again, my obvious inclination was that the craft was a triangular shape. This whole encounter lasted about 15 seconds until I ran outside to get a better look but by then the UFO was gone. There was a large cloud front that rolled in and about five later when the clouds moved by I kept a look out but there was nothing to be seen. I always keep my head to the sky and when I saw this object there was no doubt in my mind what it was, a genuine UFO sighting."],"City":"Manassas","Date Submitted":"10/04/2010 10:53 UTC","Longitude":"-77.467327","files":["/var/www/straped/mufon/html2text/25681.html.txt","/var/www/straped/mufon/org/25681.html"],"Tags":"City","Weather Factors":"Unknown","Summary":"Triangle shape UFO highlighted by three red lights on each tip","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Triangle","trends":["There have been 2 other sightings in Manassas","There were no other sightings in Manassas on or around October 4th 2010"],"Latitude":"38.755589","Case Number":"25681","Disposition":"Unknown","Date of the Event":"10/04/2010 07:50 UTC","Log Number":"US-10042010-0010"}