{"Longitude":"-110.269926","divs":["sighting detailsi'm a little fuzzy on the time frame as the event occurred so many years ago. first i want to say that i was a flight attendent for a major carrier. my date of hire was in 1964 so at that time i had 13 to 15 years experience being around and flying on many kinds of aircraft. i think that i'm qualified to make the determination as to what a conventional aircraft would look and perform like. the time frame was between 1977 and 1979. i was driving west on i-10 between el paso and tucson. i believe this was between lordsburg, nm and wilcox, az. to the north, or right of my car, i saw an object flying parallel to the freeway which was going appox. 90 mph. it was about 1\\3 to 1\\2 mile off the freeway with an altitude of appox. one thousand feet.it was twilight. the sun had already set but there was still enough light to discern the chevron shape of the craft. when i arrived at my families' home in tucson, i described it as a flying wing. there was no fuselage, engines or noise. there were 5 or 6 lights on the underside of the aircraft. i picked up my speed but it slowly pulled away from me. i eventually stopped on the side of the road and got out so that i could see it without looking through the windshield. i attributed it to military inasmuch as white sands and biggs in el paso were east, sierra vista to the south and davis monthan afb was in tucson. it puzzled me why they would fly such a top secret aircraft along such a busy highway with such a high probability of detection. on june 18, 1997, usa today ran a story about the same thing seen by so many people in phoenix, az. i kept the article all these years because it validated what i had seen 18 to 20 years before. the article has an image of the craft, however; the object i saw had a more open wingspan. it occurred to me that maybe the nose had a pivot point where the wings could be adjusted in or out. this is the first report that i have made on my sighting. i retired after flying for 44 years and this object still perplexes me as it was like nothing i have seen before or since."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.552199,+-110.269926(25682)&iwloc=A&hl=en\"> mufon case (25682) map </A>","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","City":"Sierra Vista","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Arizona","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/25682.html.txt","/var/www/straped/mufon/org/25682.html"],"Log Number":"US-10042010-0011","Case Number":"25682","Date Submitted":"10/04/2010 11:30 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Object Shape":"Chevron","Date of the Event":"11/30/1976 12:00 UTC","Country":"United States","Object Features":"Wings","Summary":"In 1977, 78 or 79, while driving to from El Paso to Tucson along Interstate 10. I saw a chevron shaped craft with 5 to 6 lights on the underside. It was traveling appox. 90 MPH and about 1/2 mile to the North and parallel to the freeway","Latitude":"31.552199","trends":["There have been 11 other sightings in Sierra Vista","There were no other sightings in Sierra Vista on or around November 30th 1976"]}