{"Latitude":"39.955909","Country":"United States","Date Submitted":"10/05/2010 10:01 UTC","Sighting Duration":"Undisclosed","City":"Toms River","Source":"MUFON","trends":["There have been 13 other sightings in Toms River","There were no other sightings in Toms River on or around October 2nd 2010"],"Object Features":"Unknown","Log Number":"US-10052010-0015","Summary":"silver circle like almost white with not moving then just gone","Viewing Distance":"Over One Mile","Longitude":"-74.192729","Object Shape":"Disc, Sphere","Weather Factors":"None","divs":["Sighting Detailsi went food shoping just to pick up a couple of things (shoprite) my daughter was in the back she is 4. i was driving towards my home near the river and i just saw this big ,not to me because it was far away but i can see a big circle that was just stationary facing south it was like over silver it was almost white but was silver and the sun was refelective on it at the top was a redish orange color hard to tell because of the sun.the thing that was strange there were no planes in the area i mean i look up all the time and there are always some planes flying by. but the sky was empty i had to make a left towards my house and looked up the sky was empty if it was a plane on a clear day i would still be able to see it going in some sort of direction it was gone.i would say it was about 10 miles south of me.i have never seen a ufo before but have been intrested in the subject for quite some time .my wifes cousin son saw one when i went to pick him up from a teen party he saw 3 red lights moving very fast we were on a bridge driving over water but it was the same area about a year ago i did not see them because i was driving. again the thing that was most strange there were no planes in the area espically for a saturday but there were none for like 1 hour in the area,also the entire sighting took place in about 30 to forty second but i know what i saw . i was driving south on fisher blvd i do not know what it was but it looked like if you took a blimp and looked at it from the front only with no scck-pit and left it stationary. it was just motionless my feeling were i was pissed because there was a car behind me and i could not pull over. i lost sight because i had to make a left turn.as soon as i could stop i did and it was gone. the direction i was driving in you can almost see it in plain sight and then look a little up."],"Case Number":"25697","map":"<A HREF = \"http://maps.google.com/maps?q=39.955909,+-74.192729(25697)&iwloc=A&hl=en\"> mufon case (25697) map </A>","Tags":"City","Disposition":"Unknown","Object Flight Path":"Stationary","Region":"New Jersey","Date of the Event":"10/02/2010 02:15 UTC","files":["/var/www/straped/mufon/html2text/25697.html.txt","/var/www/straped/mufon/org/25697.html"]}