{"Sighting Duration":"01:59:00","Object Features":"Undisclosed","Summary":"star-like multicolored pulsating light","Viewing Distance":"Over One Mile","divs":["Sighting DetailsLooking northeast from my second story kitchen window at 1000 pm, I noticed abright star-like object about 25 degrees above the horizon. It was not asbright as Mars at the recent close approach, but it was the brightest star inthe northeast quadrant of the sky. The weather was clear and calm with noclouds. The star attracted my attention due to a pronounced twinkling effect,and what I saw as a rapidly changing colors red, green, white, blue, purple. The light was located over the top of a local mountain, and appeared to be athigh altitude. When I first saw the star, I noticed briefly a similar flashinglight on the plain in front of the mountain the view from the window is quiteextensive for many miles. This ground light disappeared. After watching thelight in the sky for 10 minutes through low-power binoculars, I videotaped theobject for some time on a Hitachi NTSC 8mm video camera with x400 digital zoom.I have a video of over ten minutes. It remained in the sky for at least onehour, when I tired of watching it. I suspected it was a star, high altitudeballoon, or satellite reflection that was being colored by an atmosphericphenomenon such as ice crystals. However, when I viewed the tape the next day,I am not certain this is the explanation. The colors and dynamics of the lightare quite unusual. It may have been a prank device of some sophistication."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.167822,+-106.36558(2569)&iwloc=A&hl=en\"> mufon case (2569) map </A>","Country":"United States","Latitude":"35.167822","trends":["There have been no other sightings in Sandia Park","This sighting has never been favorited."],"Log Number":"","Region":"New Mexico","Longitude":"-106.36558","Date Submitted":"09/25/2003 10:07 UTC","Object Flight Path":"Stationary","Object Shape":"Unknown","Date of the Event":"09/25/2003 10:07 UTC","Disposition":"Unknown","City":"Sandia Park","files":["/var/www/straped/mufon/html2text/2569.html.txt","/var/www/straped/mufon/org/2569.html"],"Case Number":"2569","Tags":"City","Weather Factors":"None, Unknown"}