{"Object Shape":"Bullet, Missile, Disc","Date of the Event":"10/05/2010 02:40 UTC","Sighting Duration":"Undisclosed","Log Number":"US-10052010-0012","Country":"United States","trends":["There have been no other sightings in Between Streetman and Ric","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/25694.html.txt","/var/www/straped/mufon/org/25694.html"],"Region":"Texas","Weather Factors":"Unknown","Tags":"City","Disposition":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"10/05/2010 08:47 UTC","Source":"MUFON","Case Number":"25694","Object Features":"None","divs":["Sighting DetailsI finished a route in Fairfield and was returning to Corsicana. I was between Streetman and Richland on I-45 heading northwest. It was a clear blue sky with no clouds in sight and tempature about 80. Out of the passenger side windshield I noticed a bright white object to the north. It appeared to be about the size of a small private jet but at a lower altitude than private plane would fly. A lot lower than any commercial liner would fly. It caught my eye because there is not much air traffic visible during the day. There didn't appear to be any wings,rudder,fuselage,etc. The best description I can give for the shape is the classic \"disc\" shape. It looked like an upside down pie pan. No lights or markings just a very, very bright glowing white \"disc\". The object appeared to be heading west by northwest. Almost parallel with the freeway but a little more in a westernly direction crossing I-45. From the time I noticed it till it vanished in the distance to the west was approximately 7-8 seconds. This object was traveling at an extremely high rate of speed. No smoke, exhaust or vapor trail of any kind followed behind the object."],"Summary":"Saw a UFO heading west","Longitude":"-99.896843","Latitude":"31.971499","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","City":"Between Streetman and Ric","map":"<A HREF = \"http://maps.google.com/maps?q=31.971499,+-99.896843(25694)&iwloc=A&hl=en\"> mufon case (25694) map </A>"}