{"divs":["Sighting DetailsFireworks were being lit, but sighting occured during very brief pause in display. 3 red orbs appeared just over tree line, cruising in unison, perfectly parallel together & very fast and disappeared on the horizon. After that, and a split second behind them, 2 more appeared over the trees and disappeared on the horizon. I could not see inside orbs, they strobed darker red to lighter red. They made only a slight swoosh when they moved thru air over our heads and disappeared over the horizon. They travelled very fast and did not slow as they passed over us. Sighting lasted 3 to 5 sec. possibly. I heard an older woman say those were'nt part of the fireworks. I knew i saw a unidentifiable flying object immediately, I believe they were trying to blend in with all the fireworks, but they were clearly very High tech and did not behave like fireworks would have! I asked others if they saw what i just saw. Others there saw it also, but maybe did not have as clear of a view as i did, or they maybe could not process what they had seen. Was seen by my wife and daughter and a few others there to celebrate the 4th. I have searched internet to see if such a thing was seen by others that evening or pictures, no info though."],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/25691.html.txt","/var/www/straped/mufon/org/25691.html"],"Disposition":"Unknown","Case Number":"25691","Date of the Event":"07/04/2008 10:00 UTC","Object Flight Path":"Straight-line path","Tags":"City","Viewing Distance":"101-500 Feet","Longitude":"-121.965912","Date Submitted":"10/05/2010 04:30 UTC","Region":"Washington","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=48.09126,+-121.965912(25691)&iwloc=A&hl=en\"> mufon case (25691) map </A>","Weather Factors":"Unknown","Object Shape":"Sphere","Summary":"3 red orbs seen travelling very fast in parallel lines, then 2 more behind them dissapearing on the horizon","Source":"MUFON","Latitude":"48.09126","Sighting Duration":"00:00:05","trends":["There have been 6 other sightings in Granite Falls","There were no other sightings in Granite Falls on or around July 4th 2008"],"City":"Granite Falls","Log Number":"US-10052010-0009"}