{"Summary":"Orange light traveling very slowly followed by 7-8 dark helicoptors.","map":"<A HREF = \"http://maps.google.com/maps?q=28.045765,+-81.947674(25693)&iwloc=A&hl=en\"> mufon case (25693) map </A>","Disposition":"Insufficient Data","Log Number":"US-10052010-0011","City":"Lakeland","divs":["Sighting DetailsI was driving home with my girlfriend at around 8-9 pm when I looked up and noticed the light. I live near an airport and, frequently, see planes and other aircraft in the skies around me but this looked different. This appeared as just an orange-ish, spherical light. It was moving very very slowly across the sky above us. There were also very brief moments where it's speed would grow tremendously, moving in just a second , seemingly, as far as it had in the previous 10 . We,initially, saw the object while heading South and then turned and followed it for about 1 mile to the East, another 2-3 miles North, and then 2 more miles to the East again. People see lights all the time and I understand that. But what made this event different to me were two main things. A few minutes after we saw the light, we saw a black helicopter seemingly following it in the same direction. We then saw another, and another, until finally there were about 7-8 of these black helicopters following the orange light gaining ground as it went slowly and losing it after the light sped up and so on. The path all the craft were taking took us down a road East, as I mentioned, and we gave the chase up once we came to an area of the road which was blocked off by numerous police cars with their lights flashing. We drove around the area a bit and saw that other points around this large neighborhood area were blocked by lit up police cars. I'm a professional firefighter and a paramedic and I have been on a lot of scenes and calls where police are looking for someone and have an area closed off like this but I have never seen this many police cars used for such a purpose. It certainly could have been just the police searching for someone, but the fact that the area was much larger then I have seen in that situation, and the number of police in the area(probably at least 20 police cars) Add that to the fact that this neighborhood was under the path and around the point where we lost sight of the lights and helicopters and the, ever infamous, black helicopters made this event stick out in my mind and help me decide to share this story."],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Country":"United States","Object Shape":"Sphere, Star-like","Object Features":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Region":"Florida","files":["/var/www/straped/mufon/html2text/25693.html.txt","/var/www/straped/mufon/org/25693.html"],"Latitude":"28.045765","Case Number":"25693","Date Submitted":"10/05/2010 07:38 UTC","Viewing Distance":"Unknown","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around February 28th 2009"],"Tags":"City","Date of the Event":"02/28/2009 12:00 UTC","Longitude":"-81.947674"}