{"Tags":"City","Summary":"Disc shaped object tilted at a 45 degree angle, 15 degrees above the horizon, Due west on SR-52","Latitude":"28.336114","Object Shape":"Disc","Case Number":"25695","Region":"Florida","Disposition":"Insufficient Data","Log Number":"US-10052010-0013","divs":["Sighting DetailsDriving Home from college on State Road 52, just west of I-75, around 7:10 local time, I observed a disc shaped object approximately 15 degrees above the horizon due west, it appeared stationary, but it was tilted at a 45 degree angle, the northern side higher then the southern side. The sky was clear, The sun was setting but it was not yet dark enough to see even the brightest stars. The object was highly reflective, like light shining off polished metal or a mirror. The color, shape, and size of the object rules out anything that we \"officially\" know of as humans. It was far off in the distance, not close enough to be designated at a close encounter of the first kind, but I deffinately know what I saw, I observed the object for 1-2 minutes. I was completely transfixed on it, I up untill this event I was one of people that said, \"why didnt they grab a camera and take a picture?\" I had my cell phone with a camera in the seat next to me, while observing the object, taking a picture was the last thing I thought of. I've always believe in UFO's and aliens, but I've never seen anything personally untill today, I felt and reacted with an \"I knew it\", the reaction you get when you discover something you suspected, but could never prove untill that point. I lost sight of the object when I swerved to avoid rear ending a car that I only saw at the last second because I had been staring at the object and not the road. In the process of avoiding a collision, I slamed on the brakes and swerved to the right off the road, getting a flat tire in the process. When I revovered from my near accident, and looked up for the object again, it was gone."],"files":["/var/www/straped/mufon/html2text/25695.html.txt","/var/www/straped/mufon/org/25695.html"],"Longitude":"-82.274531","trends":["There have been no other sightings in San Antonio","This sighting has never been favorited."],"Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"10/05/2010 07:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.336114,+-82.274531(25695)&iwloc=A&hl=en\"> mufon case (25695) map </A>","Viewing Distance":"Over One Mile","Country":"United States","Date Submitted":"10/05/2010 09:13 UTC","City":"San Antonio"}