{"Sighting Duration":"00:10:00","Latitude":"33.751345","City":"Atlanta","Date of the Event":"09/27/2003 01:00 UTC","Log Number":"","Case Number":"2570","Object Features":"Undisclosed","Country":"United States","Summary":"I saw two shining orbs over Atlanta","Object Shape":"Sphere","Object Flight Path":"Unknown","Tags":"City","Disposition":"Unknown","divs":["Sighting Details 1. I was sitting in my vehicle right after lunch,talking to my mother on cell phone.2. I was overlooking a jobsite when a bright silvery light caught my attentionas it rose over a tree line about 300 away. It rose slowly but steadily until iteither went behind a cloud or through it. I estimate the clouds were 1 to 2thousand feet...it came thru the clouds and continued to a point that would beabout 35 to 40 degrees above the horizon. I thought it may have been a planelanding light...but I was too close to Hartsfield Airport for a plane to be onthat north to south route. As the object reached the peak it stopped and justsat there. I told my mother on the phone that I think Im having my first UFOexperienceand became very interested in the object. I took out mybinoculars,switched off the engine and steadied them on my open door. The binoc.are a 16x50 bushnell...I brace and focused on the object. It was clearly aspherical object, cream colored and hovering..the perimeter of the object seemedto shimmy a little but i think that may have been the binoculars. I told my callwhat was happening and out of nowhere a second object appeared at a 50 or 60degree above and to the east of 1. 2 moved downward....stopped..accended to itsoriginal elevation then stopped...then 1slowly approached 2..at arms lenght I would say they were about two fingersapart...they moved in unison to the east, stopped,then very slowly moved to theS.W. thats when I realized I needed a witness..I saw a heavy equipment operatornorth of me..I got into my vehicle...drove about 200 watching all the time. justas I got near the operator the objects winked out of sight.."],"trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around September 27th 2003"],"Source":"MUFON","Region":"Georgia","Longitude":"-84.385662","Weather Factors":"Unknown","Date Submitted":"09/27/2003 01:00 UTC","files":["/var/www/straped/mufon/html2text/2570.html.txt","/var/www/straped/mufon/org/2570.html"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.751345,+-84.385662(2570)&iwloc=A&hl=en\"> mufon case (2570) map </A>"}