{"Date of the Event":"05/27/2006 07:23 UTC","Longitude":"-75.071284","Log Number":"US-10062010-0002","Weather Factors":"None","Source":"MUFON","Sighting Duration":"00:03:00","City":"Collingswood","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.918169,+-75.071284(25701)&iwloc=A&hl=en\"> mufon case (25701) map </A>","Region":"New Jersey","Object Shape":"Egg","Object Features":"Unknown","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI honestly don't know where to begin here. Putting this up is a little scary for me, because all this stuff really happened. But it's been close to 5 years, I'm getting older and it's time to come forward with my story. Let me also say I'd much rather talk to someone about this than type it all out, but I'll do my best. On Saturday May 27th 2006 my girlfriend was away for the day, and I had our apartment to myself. I spent some time playing a new videogame, and had a long phone conversation with my mom. It was probably the deepest conversation we ever had, and she told me a story about my birth. I knew we were both sick when I was born and that she had to have an emergency c section, but apparantly her heart stopped for 45 seconds while under. When she woke up to my father holding a newborn me, all she could do was tell him about the dream she had. She was aboard a flying saucer with a higher power, or jesus, looking for others. But for some reason no one else was ready, or able to board with them. This kinda blew me away, she hesitated my whole life to tell me this because of my profound intrest in the subject. OK so we finish up the conversation, it's 7:20 PM and I try to go back to my new game. But instead I put down the controller, got up and looked out the window of my 7th floor apt. and see this white egg shaped god-knows-what right out there. It was about the size of a minivan, maby a small bus and it was so close I could have hit it with a rock. It immediately began moving away very quickly and I noticed two black dots, one on either side of it. They started swirling around the egg and would 'splash' in and out of it, causing it to shimmer black and white so fast it looked silver. It looked kinda like a molecule. OK now here's where it gets tough.... I only saw it up close for maby 10 seconds, it flew away pretty fast. But I kept my eye on it and could still see it as a black speck against the clear sky for a good 2 mins. Then it started blinking out, and i said outloud \"No! Come back\" and waved it back and this black speck zapped me. It felt like I jumped into ice water and had my brain ripped in half. The sky turned a bright purple, I wanna say ultra-violet and against it were hundreds of different sized transparant white circles, or 'orbs'. Like a polka-dot sky. It brought me to my knees and I urinated myself. OK here's the part that really scares me, I wouldn't bother coming forward if it weren't for this. When i finally managed to shake it off I heard what sounded like chaos outside- all the car alarms in the whole parking lot, several sirens and what sounded like a fire engine, all blaring loudly for 30 maby 45 seconds. The clock on my cable box said 7:23. First thing I did was try to call my mom back but the phone was dead for 10 minutes or so. At her advice about an hour later I called the local fire dept. inquiring about the alarms but got some BS answer- a \"system alarm test\". Also I found some neighbors who heard everything at that precise time, but no one saw anything. I had several other related paranormal experiences that summer, but I'm done typing about this. As i re-read this I realise there's several details I'm leaving out, but I'll always remember that day quite well. I feel MUFON is a trusted orginization so please feel free to contact me if you'd like to know more. Thank You."],"Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"10/06/2010 04:06 UTC","Latitude":"39.918169","Tags":"City","files":["/var/www/straped/mufon/html2text/25701.html.txt","/var/www/straped/mufon/org/25701.html"],"trends":["There have been no other sightings in Collingswood","This sighting has never been favorited."],"Summary":"a ufo zapped me 5 years ago","Country":"United States","Case Number":"25701"}