{"Longitude":"-85.975167","divs":["Sighting DetailsI was driving home one night from a social event in the summer with the windows down and the radio off. I glanced to the left as I was heading east and I noticed a triangular arrangement of still lights over the St. Joseph river approximately by Martin's Landing in Elkhart. I presumed the lights outlined a vessel of some sort but I could not see anything in between the lights. The shape demarcated by the lights reminded me of an Imperial Destroyer from Star Wars. By the light size and shape it appeared to only be 500-1000 ft above the water. I noticed there was no loud sound from the object, as I thought maybe it could be a helicopter hovering or similar, but I heard nothing. The object appeared to be maybe 100-300 ft long. I did not stop or investigate further as I had to get home and to bed to get up for work early. I expected to see something about it in the news but never did. So I am reporting it here. The month, day, and time are all approximate but not the location. This occurred east of the dam on the St. Joseph river. This was during summer as it was warm outside. If someone else saw this I hope they correct me on the date. The object was motionless, the lights were unmoving and not blinking - they were all steady lights. I felt nothing special other than some curiosity and thought to myself, \"I don't know what this is so to me it is an Unidentified Flying Object\". As I drove down the street the increasing number of trees obscured my view and I no longer saw the object."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/25709.html.txt","/var/www/straped/mufon/org/25709.html"],"City":"Elkhart","Region":"Indiana","Disposition":"Unknown","Country":"United States","Date Submitted":"10/06/2010 09:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.684974,+-85.975167(25709)&iwloc=A&hl=en\"> mufon case (25709) map </A>","Object Flight Path":"Stationary","Sighting Duration":"00:02:00","Case Number":"25709","Log Number":"US-10062010-0010","Object Shape":"Triangle","Latitude":"41.684974","Summary":"Triangular UFO over St. Joseph river near Martin's Landing dock","Source":"MUFON","Viewing Distance":"101-500 Feet","Date of the Event":"08/15/2010 10:15 UTC","trends":["There have been 12 other sightings in Elkhart","There were no other sightings in Elkhart on or around August 15th 2010"],"Tags":"City","Weather Factors":"Unknown"}