{"Object Flight Path":"Stationary,Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=34.120656,+-84.004351(25710)&iwloc=A&hl=en\"> mufon case (25710) map </A>","Region":"Georgia","Object Features":"None","Latitude":"34.120656","trends":["There have been 3 other sightings in Buford","There were no other sightings in Buford on or around October 6th 2010"],"Disposition":"Unknown","Log Number":"US-10062010-0011","Source":"MUFON","Tags":"City","Date of the Event":"10/06/2010 03:45 UTC","Object Shape":"Disc, Oval","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsi was driving down ridge road in buford, away from friendship road, headed towards hamilton mill. it was a beautiful day today, not a cloud in the sky. as i was approaching a break in the trees, something shining in the sky caught my eye. my very first reaction was knowing that it was not a plane. as i kept glancing at it for the next 20-30 feet, i found a place to pull over. it wasn't moving. just sitting there hovering in the sky. it looked to be about 200 feet up. my windows were down and cars were driving by, but i couldn't hear any kind of sound out of this object. i sat and watched it for about 20 seconds and then it just disappeared. it didn't fly off or move, just vanished. as i searched the sky for it, i noticed an actual plane going by in roughly the same area and i could hear the plane pass and noticed that the sun wasn't bouncing off of the plane like it was the previous object. i pulled back onto the road and drove to the redlight that was 1\\4 of a mile away from where i pulled over, while watching the sky to see if it popped back up. as i got to the redlight, with my eyes on the sky, i noticed something appear out of nowhere further off in the distance directly ahead of me. i sat and watched it. it appeared to be the same object (or another one of the same thing), except it was further away and this time, it moved very slowly to my right for about 5 seconds and then, again, just disappeared. when the light turned green, i made my left hand turn and kept glancing towards the sky. i didn't see anything else on the way home, but i know what i saw and it was a ufo. now, i want to go out tonight and search the stars to see if i can find anything else."],"Longitude":"-84.004351","files":["/var/www/straped/mufon/html2text/25710.html.txt","/var/www/straped/mufon/org/25710.html"],"Summary":"Silver metal. Longer than it was tall.","Case Number":"25710","Weather Factors":"None","City":"Buford","Country":"United States","Date Submitted":"10/06/2010 09:14 UTC","Sighting Duration":"00:00:45"}