{"Disposition":"Unknown","Country":"United States","Date of the Event":"10/03/2010 05:15 UTC","Summary":"Huge object with bright green and red flashing lights flying over the highway in front of my house","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Shape":"Unknown","Object Features":"Unknown","City":"New York","Case Number":"25714","Date Submitted":"10/06/2010 10:58 UTC","files":["/var/www/straped/mufon/html2text/25714.html.txt","/var/www/straped/mufon/org/25714.html"],"Log Number":"US-10062010-0015","map":"<A HREF = \"http://maps.google.com/maps?q=40.589102,+-74.141401(25714)&iwloc=A&hl=en\"> mufon case (25714) map </A>","Latitude":"40.589102","Weather Factors":"None","Longitude":"-74.141401","Source":"MUFON","Tags":"City","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around October 3rd 2010"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI watching TV in bed I got up to open my window and I saw this very bright light in the sky, at first I thought it was a star or maybe a plane stationary in the air. I watched it for about 10 minutes.I just didnt think it was a star or a plane.My mom woke up and I and showed her the light in the sky. All of a sudden We see this huge dark object with bright green and red lights, the lights were flashing around the object moving slowly across the highway with no sound.It was flying lower then a plane. As soon as we seen it we thought it was a UFO! I ran for my cell phone to take a picture unfortunately It didn't take because of the street light outside my house was too bright. I was shocked to see something like this. I was a little nervous not knowing what I was seeing.The sky was very dark so I could not make out the color or shape but I assumed it was round by the way the lights were flashing around it. As soon as it passed the bright light in the sky went further away & I lost sight of it.About a minute later a plane flew by going in the same direction as the object.I live off of a highway with alot of trees so I lost sight of the object within a minute or two."],"Region":"New York"}