{"Object Shape":"Other","City":"Rockledge","Object Features":"Undisclosed","Source":"MUFON","Latitude":"28.285793","Sighting Duration":"09:00:00","divs":["sighting detailsat exactly 9:00pm on october 3, 2010 just south of the kennedy space center in viera florida i was in my back yard looking at some aircraft going by when i noticed an object barely visible to the eye hovering in the direction of the kennedy space center. i was able to keep my eyes focused on the object and after about 1 minute the object began moving south\\south west in my direction passing over my head picking up speed as it went making no sound at all. when the object approached it appeared to be around 10,000 feet up in the shape of an open ended triangle with semitransparent glowing circles on each side { four on one side and three on the other } and the body seemed to be transparent. i hit the object with a very strong light as it went over and still couldn't see a body to the object, then it corrected to the left a bit and headed at a high rate of speed directly south. the triangle was about 100 yards wide and 200 yards from nose to end. just a few hours earlier i noticed a 3 weird white colored black-hawks heading towards the kennedy space center. this was unusual because i'm a veteran and the black-hawks were unusual in color and equipment. i fighter hovered high above the black-hawks as if it was guarding them. i thought the president was in town. i now realize my sighting and the earlier incident were connected."],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Log Number":"US-10072010-0002","Disposition":"Insufficient Data","Date of the Event":"10/03/2010 09:00 UTC","files":["/var/www/straped/mufon/html2text/25717.html.txt","/var/www/straped/mufon/org/25717.html"],"Weather Factors":"Unknown","Country":"United States","Date Submitted":"10/07/2010 01:38 UTC","trends":["There have been 9 other sightings in Rockledge","There were no other sightings in Rockledge on or around October 3rd 2010"],"Tags":"City","Longitude":"-80.728718","Region":"Florida","Summary":"Semitransparent V shaped UFO over the Kennedy Space Center","Case Number":"25717","map":"<A HREF = \"http://maps.google.com/maps?q=28.285793,+-80.728718(25717)&iwloc=A&hl=en\"> mufon case (25717) map </A>"}