{"Country":"United States","Object Features":"Undisclosed","Log Number":"US-10062010-0012","Object Flight Path":"Undisclosed","trends":["There have been 6 other sightings in Angel Fire","There were no other sightings in Angel Fire on or around August 19th 2010","This sighting has never been favorited.",""],"Date Submitted":"10/06/2010 10:15 UTC","Date of the Event":"08/19/2010 05:12 UTC","divs":["Sighting DetailsTwo messages, one at 5:12 pm and one at 5:13 pm, were left on my answering machine Thursday (I think the date was August 19). After listening to them many times, I believe they are two different messages, left by two different \"voices.\" I'm submitting this report and a digital audio recording of the messages because I believe they are connected to UFO sightings I have been experiencing in Angel Fire, New Mexico. A couple of years ago, I recall hearing similar sounds on an Internet site (sorry, don't remember when or which site) which described them as being made by extraterrestrials. The audio recording was made by holding a digital recorder near the answering machine on which the messages were made. I consider the recording to be about 98%-99%% as clear as the original messages (which I have retained on my digital answering machine). My Caller ID recorded the phone number, which is not included in this narrative (but which will be given to official investigator). If the reverse-number service I accessed on the Internet is correct, the phone calls were made from a land line in southern California."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.394788,+-105.281179(25711)&iwloc=A&hl=en\"> mufon case (25711) map </A>","Region":"New Mexico","Disposition":"Unknown","Latitude":"36.394788","Viewing Distance":"Unknown","Longitude":"-105.281179","Summary":"Two \"data-alien-voices\" telephone messages left on my land-line answering machine","Object Shape":"Unknown","Weather Factors":"Does Not Apply","Source":"MUFON","Case Number":"25711","City":"Angel Fire","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/25711.html.txt","/var/www/straped/mufon/org/25711.html"]}