{"Disposition":"Unknown","Latitude":"34.029954","divs":["Sighting DetailsWe have been witnessing this for a couple weeks now. Sometimes at night and other times i see it when I am leaving for work around 5:30am. It is always in the same spot. The lights are flashing red green and amber. it looks like the lights are moving in a circular motion. Sometimes it is very bright and other times it is dim. it is not always there. On Monday Morning October 4, 2010 I was leaving for work at 5:30am. I noticed the lights. it was the brightest I have ever seen it. i called my boyfriend out to look at it. We watched for 10min. it stayed in the same spot. In that time we saw 2 smaller objects come out from the light and move very slowly to the right of the light. Then a few minutes later the light started moving the same way. Within seconds another flashing light appeared in the place of the first. Then all of a sudden another one appeared above it and that quick they were gone. I can't explain it. My parents, and my boyfriend have witnessed it also. My mom said one morning the light was really long and horizontal and then just disappeared. I have done a lot of research to come up with an answer and can not. I havent heard of anyone else seeing these lights. I was outside of my house. we were just looking to see if we could see the lights. We have tried to take pictures but it is to far away. we have looked through the telescope and it is fuzzy but you can really see the lights flasing."],"Date Submitted":"10/06/2010 10:34 UTC","Object Shape":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","City":"Kennesaw","Summary":"red green and amber flashing lights","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"25713","Date of the Event":"10/06/2010 09:15 UTC","Region":"Georgia","Longitude":"-84.60644","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25713.html.txt","/var/www/straped/mufon/org/25713.html"],"trends":["There have been 7 other sightings in Kennesaw","There were no other sightings in Kennesaw on or around October 6th 2010"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.029954,+-84.60644(25713)&iwloc=A&hl=en\"> mufon case (25713) map </A>","Object Features":"Unknown","Log Number":"US-10062010-0014","Tags":"City"}