{"Object Features":"Unknown","Date Submitted":"10/06/2010 11:52 UTC","divs":["sighting detailsi'm reporting this for my father and his girlfriend who reported this event to me this evening. they were outside on her porch the evening of 10\\5 in the vicinity of west elementary on the west end of mt. vernon. they report first seeing what appeared to be a glowing cigar-shaped object hovering almost directly over her home for several minutes. after several minutes the object quickly disappeared. following the initial object they report seeing three (3) round or spherical objects fly in which \"bounced around\" for several more minutes. reportedly a neighbor came out (or arrived home, i'm not clear) and saw them looking at the sky and asked what they were looking at. my father's girlfriend directed her to look up at the area they were looking at and tell them what she saw. apparently she also saw the same 3 objects. they report hearing a loud noise associated with the objects, which was also heard in other parts of town up to 2 miles away. the sound was described as a loud \"rhhhhhew rhhhhew\" type sound. after my father returned home he continued to hear the noise and thought it may be coming from a local refinery or roofing plant, but having lived in the area over 60 years does not recall a similar noise. they speculated the noise may have also been coming from underground. i'm not clear on the size or distance of the objects, and they were reluctant to make the report themselves. she (my father's girlfriend) did say that she'd spoke to a local resident who is a ufo enthusiast\\investigator (again not sure) who had told her there had been a lot of activity in indiana recently. i can provide names of the two main witnesses upon request as this is all 2nd hand information to me."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.940666,+-87.886637(25715)&iwloc=A&hl=en\"> mufon case (25715) map </A>","Latitude":"37.940666","Sighting Duration":"Undisclosed","Tags":"City","City":"Mt Vernon","Object Shape":"Cigar, Sphere","Date of the Event":"10/05/2010 10:00 UTC","Source":"MUFON","Log Number":"US-10062010-0016","files":["/var/www/straped/mufon/html2text/25715.html.txt","/var/www/straped/mufon/org/25715.html"],"Case Number":"25715","Weather Factors":"None, Does Not Apply","Country":"United States","trends":["There have been 3 other sightings in Mt Vernon","There were no other sightings in Mt Vernon on or around October 5th 2010"],"Viewing Distance":"Unknown","Region":"Indiana","Summary":"Multi-object sighting over Mt Vernon","Object Flight Path":"Stationary,Other","Longitude":"-87.886637","Disposition":"Insufficient Data"}