{"Summary":"A bright, neon blue, pulsating light following me in the sky and shortly after I noticed it, it drop faster than a free fall into the horizon","Object Features":"Undisclosed","Country":"United States","Longitude":"-97.319729","Viewing Distance":"Unknown","divs":["Sighting Details I was walking to my friends house in Burleson, Tx, to see if he was home. He was not. On my return journey, when I was about halfway back from a .5 mile walk. I looked up at the sky. I noticed something hovering silently. A bright blue glowing object. brightest thing in the sky. I noticed it mainly because it seemed to be moving with me. mimicking the movement of my body as if it was parallelling my path as I was crossing the street. Strangely enough, when I looked closer to try and focus on it, it dropped from the sky like a shooting star and disappeared behind the trees on the horizon. I didn't know what to think, about what it was. but it moved downward faster than anything I have ever seen before in my life. it could not have been a star or a meteor, that I am sure of. during the event I felt baffled as I gazed upon it, and disappointed, yet stunned as it vanished out of sight. the oddest thing was its descention. It arched upward before plummitting down, fast, like it did."],"Sighting Duration":"00:00:20","Latitude":"32.549952","Object Flight Path":"Undisclosed","Region":"Texas","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.549952,+-97.319729(25719)&iwloc=A&hl=en\"> mufon case (25719) map </A>","Log Number":"US-10072010-0004","Disposition":"Hoax","Weather Factors":"Unknown","Date of the Event":"10/06/2010 10:30 UTC","Tags":"City","City":"Burleson","files":["/var/www/straped/mufon/html2text/25719.html.txt","/var/www/straped/mufon/org/25719.html"],"Case Number":"25719","Date Submitted":"10/07/2010 03:46 UTC","Object Shape":"Star-like","trends":["There have been 8 other sightings in Burleson","There were no other sightings in Burleson on or around October 6th 2010"]}