{"Summary":"One of two \"stars\" comes close to car on interstate and changes lighting","map":"<A HREF = \"http://maps.google.com/maps?q=38.632642,+-90.193684(25716)&iwloc=A&hl=en\"> mufon case (25716) map </A>","Disposition":"Hoax","Date of the Event":"10/05/2010 10:10 UTC","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around October 5th 2010","This sighting has never been favorited.",""],"Case Number":"25716","Object Flight Path":"Undisclosed","City":"St Louis","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/25716.html.txt","/var/www/straped/mufon/more/25716_submitter_file1__20101005221000.JPG","/var/www/straped/mufon/org/25716.html"],"Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Tags":"City","Region":"Missouri","Date Submitted":"10/07/2010 12:49 UTC","Latitude":"38.632642","Object Shape":"Sphere, Square, Rectagular, Star-like, Other","Log Number":"US-10072010-0001","divs":["Sighting DetailsI was driving in the car on I-270 south in Kirkwood when I noticed two bright lights like very bright stars separated in the sky towards the I-44 interchange about a mile or two ahead. The \"stars\" where quite noticeable and much brighter than any other visible stars. This is the same location where six days before, September 29th, I noticed strange lights in the same area and reported that to MUFON. One \"star\" appeared twice the size and brightness of the other, though both were at least as bright as the Jupiter confluence going on at this time, and they twinkled much more. As I approached the interchange where I exited to I-44 east, the lights stayed in the same relative location but each definitely flashed a few times as I glanced at them while driving, causing me to wonder. They appeared to be southeast of my direction. I lost sight of them due the the surrounding environment while getting onto I-44 and couldn't see them as I started east. When I came to about the same location as six nights before, I turned a bend and saw two bright \"star\" lights but this time much closer. The were not in the same relative position in the sky, but were in the same relative position to each other. The brighter object was just to the left of the highway about 15 degrees off the horizon. The dimmer was to the right of the highway at about 30 degrees. They stayed motionless and steady for about a minute but then both then started to move to my right towards the southeast where I had last seen the two similar \"stars\" at the interchange, and I wondered that these where the same \"stars.\" Once the brighter one passed across the highway it started becoming even brighter, appearing to be coming closer and slightly descending. It got to about at least half the size of a full moon before I could see a very small red and green light on each side of the bright shimmering ball of light. This light quicly got so close that I could no longer glance at it will driving on the interstate highway at the speed limit and I slowed down slightly in the right most lane so that I could lean forward and glance up though the windshield a few times. When I then did this a couple of times, I was at first shocked to see what is a simple depiction I've attached to this report - four distinct lights, two red and two green. The red and green lights were quite brilliant in color, not blinding, but also hard get a good \"fix\" on. There was a faint white shimmering light that was accentuated around the red and green lights, which were also shimmering themselves. The four lights and their relative sizes and positions where quite discernible though difficult to discern their exact shape, more like small columns of light than spheres of light. I actually laughed when I saw it in that configuration the first glance, thinking it was a joke on the FAA. Also the red and green lights that I saw until those glances where much smaller and dimmer, when it was almost like the full moon in white brightness between them. At these few close glances, there was no clear white light source but a dim white sparkling shimmering light about it. When it passed me I noticed that at least three other cars had slowed down with me, perhaps they saw it too. When I got a little past that I looked in my driver-side rear-view mirror and could see a row of five lights circling back behind me. The there were two larger brighter lights with three dimmer lights in a row, dim-bright-dim-bright-dim. These lights followed me at my left side at about 10 degrees over the horizon perhaps for five miles until I exited the highway at Laclede Station Rd. The lights on the craft remained steady but one would flash every one or two seconds, different ones at different times. I exited right and came to a stop light about 100 yards off the highway. Stopping at the light, at about 45 degrees off the horizon I saw a line of lights in the sky, about the size of a dime. There were five lights in a row, the middle one always red and the others usually white but sometimes green or red at the ends. The end lights would change color every few seconds, but none of the lights flashed nor changed intensity. All these lights also had a shimmer to them. I had the impression this was the second \"craft,\" since I had just last seen the larger row of white lights about 15 seconds before that had been pacing me at the opposite side of the sky. Anyway, I turned left at the light and this light seemed to then descend to about 15 degrees over the horizon and get a bit closer. I could easily see it for a few miles staying to my right. It didn't seem to move much more in the sky until I got about 2 miles from my house in St. Louis and slowly moved out of sight behind me. As I had wondered six nights before, and a few nights before those - what's up with these weird mocking lights flying around? Personally, knowing about the rumor of public disclosure by the \"Aliens\" later this month, it's something that makes me go \"hmmm.\" Yet, has disclosure already come to many, even if the minority?"],"Viewing Distance":"Unknown","Longitude":"-90.193684"}