{"Object Shape":"Undisclosed","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around August 16th 2003"],"Disposition":"Unknown","Summary":"Three mysterious, dark objects in afternoon sky","Object Features":"Undisclosed","Longitude":"-95.36561","Sighting Duration":"01:00:00","Object Flight Path":"Straight-line path","Date Submitted":"08/16/2003 05:10 UTC","Region":"Texas","divs":["Sighting DetailsWhat we witnessed that August 16, 2003 afternoon is described in a report Isubmitted to the National UFO Reporting Center from Houston, Texas. The websitefor the Center is www.nuforc.org. You can locate my report by the event date ormy city Houston.Here is a summary of what we saw that day. While in my backyard in southeastHouston, Texas near the small town of Pasadena, with my wife, son and his guest,we witnessed three dark objects for a sustained amount of time. At about 510p.m. on Saturday, August 16, my sons 10-year old friend got our attention to anobject she had spotted. The object was dark and was stationary in the sky. Atfirst, I thought it to be a cluster of balloons set adrift, but noticed that theobject was not moving. It had no wings or protusions and it appeared that thesun was able to reflect off of it.This lasted for some minutes until the object slowly drifted northwest acrossthe sky. I was still unable to figure out what it was.Once again, my sons friend pointed out two other similar objects stationedfurther out on the horizon. At this point, all three objects were distanced fromeach other by miles of skyline. One of the objects out on the horizon driftedslowly towards our direction, but still not close to the first one.My attention eventually turned back to our backyard activities and by 600 p.m.,the objects were nowhere to be seen.In viewing the National UFO Reporting Center website, I noticed that two reportsfiled by other witnesses describe similar objects that we saw. A report on 81603from Chandler, AR describes similar activities we were doing and reports thattheir objects were seen at almost the exact same time we saw ours Another reportgiving an event date as 92003 describes exactly the same objects we saw.Perhaps someone can give us an explanation as to what we saw that day."],"Case Number":"2572","Log Number":"","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.765743,+-95.36561(2572)&iwloc=A&hl=en\"> mufon case (2572) map </A>","files":["/var/www/straped/mufon/html2text/2572.html.txt","/var/www/straped/mufon/org/2572.html"],"Weather Factors":"Unknown","Date of the Event":"08/16/2003 05:10 UTC","Country":"United States","Latitude":"29.765743","City":"Houston","Viewing Distance":"Over One Mile","Tags":"City"}