{"Object Flight Path":"Path with directional change","divs":["sighting detailsi was going to bed when a very bright object caught my eye and made me get up to look out the window. first saw a light bright enough to be a low flying commercial airplane, but the light was not traveling a straight line like a plane, instead it was hovering and rapidly dashing from one point to another with no pattern, just random darting side to side, stalling then redirecting, sometimes moving upward or downward. there was another planet behaving similarly - the red planet in orion's bow. i reported to pickens county sheriff's office but they had no interest. i also reported to ufo hotline out of oregon. he called back to tell me i only saw stars, but today, i was told about the cow mutilations that took place at cooper's farm in hall county, ga over the weekend, and hall county was very much in line with the area i was viewing. i live on a 3,000 ft elevation mountain (tally mtn) and i can see all the way to atl from my mountain. it was a very very clear night when i saw this activity. i never lost site of the objects\\hovering stars, but when i went out in the yard on the phone with my father, they stopped moving and jerking and lost brightness and intensity and returned back into the normal constellation appearance and were still."],"Object Shape":"Star-like","Case Number":"25733","map":"<A HREF = \"http://maps.google.com/maps?q=34.467869,+-84.429092(25733)&iwloc=A&hl=en\"> mufon case (25733) map </A>","City":"Jasper","Disposition":"Unknown","trends":["There have been 6 other sightings in Jasper","There were no other sightings in Jasper on or around October 2nd 2010"],"Object Features":"Unknown","Longitude":"-84.429092","Region":"Georgia","Date Submitted":"10/08/2010 12:05 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Date of the Event":"10/02/2010 12:00 UTC","Latitude":"34.467869","Summary":"Darting & Looping Frantic Stars in sky forming planets in Orion's belt Constellation","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/25733.html.txt","/var/www/straped/mufon/org/25733.html"],"Log Number":"US-10082010-0001"}