{"files":["/var/www/straped/mufon/html2text/25747.html.txt","/var/www/straped/mufon/more/25747_submitter_file1__Photo0565.jpg","/var/www/straped/mufon/more/25747_submitter_file2__Photo0565G.jpg","/var/www/straped/mufon/more/25747_submitter_file3__Photo0565GP.jpg","/var/www/straped/mufon/org/25747.html"],"trends":["There have been 8 other sightings in Houma","There were no other sightings in Houma on or around May 26th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","Weather Factors":"Unknown","Summary":"This triangular object appeared in this picture.","Object Shape":"Triangle","Latitude":"29.60418","Log Number":"US-10082010-0015","Longitude":"-90.718535","Disposition":"Unknown","Date of the Event":"05/26/2010 12:54 UTC","Date Submitted":"10/08/2010 08:20 UTC","divs":["sighting detailsme and some friends were on our way back from morgan city, and we just hit the road on the way back to houma. it is the place near where the eagle's nest used to be. well i was taking pictures of the sky at a 45 degree or higher angle, where the tree line would not be visible. i was simply taking pictures of the sky. there were big fluffy white clouds and it was rather beautiful. immediately after i noticed something strange in the picture. it was a triangular like object. i looked back to see if it was there, but i noticed nothing that resembled it. i looked around the car if there were any protrusions that would have gotten in the way, but alas it is left unexplained. not my best sighting, but i figured i might as well report it. the photo has been rather controversal. everyone keeps saying its a road sign, but i know for a fact it isn't because where the picture was taken, there were not big road signs. someone said it was a speed limit sign, but those signs aren't that high off the ground and the angle and distance from the shoulder the picture was taken makes that impossible. whether or not this is an alien\\military craft, i do not know. i even sent it off to one of my buddies in the army, who knew a guy that worked with this sort of stuff. accordingly even he did not know what it was. so that about sums it up for this encounter."],"Sighting Duration":"00:00:00","Case Number":"25747","Tags":"City","Region":"Louisiana","map":"<A HREF = \"http://maps.google.com/maps?q=29.60418,+-90.718535(25747)&iwloc=A&hl=en\"> mufon case (25747) map </A>","City":"Houma","Country":"United States","Viewing Distance":"Unknown","Object Features":"Other","Source":"MUFON"}