{"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Details My oldest daughter, who is now living out in Arizona, sent me a text on my cellphone at approximately 5:10 a.m. I' m not usually awake at 5:00 a.m.but after I read her text, I was pretty awake. It felt cold in the house, I then realized I left the windows open in the house before I fell asleep. I closed all of them and lastly as I was closing my kitchen window, I noticed between the trees in the sky were these two unusual lights I've never seen before. At first I seen a small round orange yellow light, thinking to myself, is this a star? No, too big for a star. This orange yellow light was getting larger then smaller, but staying in the same stationery location. Then another light appeared, much larger, also round and orange yellow in color, this light got much larger then much smaller until it disappeared entirely. This larger light would continue to get larger then smaller and disappear, repeatedly. I thought I would wake up my youngest daughter so she could see these unusual lights in the sky. I awoke her and took her to the kitchen window. The smaller light was there but barely visible between the trees, then it got larger to it's original size as I first seen it. The larger light was gone. I quickly got dressed and went for a ride in my car to see if I could get a better view past the trees of these unusual orange yellow lights in then sky, but seen nothing as I drove around town."],"Case Number":"25759","Object Flight Path":"Stationary,Other","Source":"MUFON","Object Features":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-74.208201","Date of the Event":"10/09/2010 05:10 UTC","Tags":"City","Country":"United States","City":"Little Falls","Summary":"Observed two orange yellow lights close together in sky outside my kitchen window","map":"<A HREF = \"http://maps.google.com/maps?q=40.868988,+-74.208201(25759)&iwloc=A&hl=en\"> mufon case (25759) map </A>","files":["/var/www/straped/mufon/html2text/25759.html.txt","/var/www/straped/mufon/org/25759.html"],"Weather Factors":"None","Object Shape":"Circle","Latitude":"40.868988","Date Submitted":"10/09/2010 09:43 UTC","trends":["There have been no other sightings in Little Falls","This sighting has never been favorited."],"Log Number":"US-10092010-0008","Region":"New Jersey"}