{"Object Flight Path":"Unknown","Weather Factors":"Unknown","Tags":"City","City":"Vineland","Date Submitted":"09/13/2003 02:15 UTC","Date of the Event":"09/13/2003 02:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.424087,+-74.947942(2575)&iwloc=A&hl=en\"> mufon case (2575) map </A>","Sighting Duration":"00:00:59","files":["/var/www/straped/mufon/html2text/2575.html.txt","/var/www/straped/mufon/org/2575.html"],"Log Number":"","Country":"United States","Longitude":"-74.947942","divs":["Sighting DetailsI was just taking random pictures of the sky in the area and found the object inthe picture when I was viewing them on the computer. The camera is a PentaxOptio 230 2.3 MegaPixel. This picture is all I have of the object. The picturesbefore and after do not have the object. So it was there only momentarily. Thiswas Sept 13, 2003 at 1415 to approx 1420 and may have been just zipping by as Itook the picture but I never actually saw the object.The same such occurence happened on another day Sept 16, 2003 at approx 1230 andI feel that is the best picture Ive ever gotten when it is blown up. I Have tosubmit the photos so you can look at them to better determine just what theobjects may be. The photo taken on the 13th of Sept at first glance just lookslike a bird but when the photo was blown up 3 or 4 clicks it becamequestionable.Because the object is at a level where at the angle I was shooting from put itin the center of a long white cloud behind it , it is very hard to get adefining line for the top surface but under the object, the dark part, ishanging down like jelly fish tendrills. The top surface is shiney, reflectinglight, defining line for the surface seems to be flooded out.The photo from Sept 16 is different in that there were no clouds in the sky. Thesun was almost directly overhead behind me slightly to the left or western sky.I was taking random pictures into the northeastern sky which appeared a verydark blue azure so the objects lines of definition can be made out when blown upeven just slightly. I printed a normal size picture and looked at it with amagnifying glass and was able to clearly see that this is not anything I canidentify. There appears to be a clear or light bluish trail or emmision on theleft side of the object. I need someone with better equipment and knowledge ofvarious sightings to take a look to verify if this is something that others havegotten pictures of aand anything you can tell me because I am very curious aboutthese things."],"Object Features":"Unknown","Summary":"Flying disks in Millville, NJ","Disposition":"Unknown","Case Number":"2575","Viewing Distance":"Unknown","Region":"New Jersey","Latitude":"39.424087","Source":"MUFON","trends":["There have been 9 other sightings in Vineland","There were no other sightings in Vineland on or around September 13th 2003"],"Object Shape":"Cone"}