{"map":"<A HREF = \"http://maps.google.com/maps?q=47.61372,+-122.325611(25755)&iwloc=A&hl=en\"> mufon case (25755) map </A>","Source":"MUFON","Case Number":"25755","files":["/var/www/straped/mufon/html2text/25755.html.txt","/var/www/straped/mufon/org/25755.html"],"Object Flight Path":"Stationary","Latitude":"47.61372","City":"Seattle","Summary":"West Seattle Black Triangle","trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around October 6th 2010"],"Log Number":"US-10092010-0004","Tags":"City","Date of the Event":"10/06/2010 06:30 UTC","Country":"United States","Object Features":"None","Region":"Washington","Disposition":"Unknown","Longitude":"-122.325611","divs":["Sighting DetailsWhile commuting home to West Seattle on a local bus, I spotted a black triangular object hovering motionlessly at a very low altitude. It was while the bus was going westbound over the West Seattle bridge. It was getting late in the afternoon, but it was still sunny out. Other planes were visible in the sky which was not unusual, as there are airfields in the general area (such as Sea-Tac), but none were close by the object. The object did not appear to move at all or interact with anything. It just remained stationary near an antenna tower. If you are familiar with the West Seattle area, the tower was the one with the blinking red light on it that is just a little bit taller than the elevation of West Seattle, and is the one visible from the bridge over the Duwamish river. The object appeared at the same height as the blinking red light, and if you held out your hand, the object was about half the length of your index finger to the right of the red light. I could tell the object was hovering stationary while in my line of sight (unlike a distant plane flying straight towards or away from you) because my perspective of the triangular object appeared to be from the side. It looked like it was as big as a 700-series Boeing plane, though a little more massive due to the fact that it was triangular in shape (rather than the usual thin tube with wings of your typical commercial passenger plane, which can easily be spotted at any given time in the skies above Seattle). I only saw it for about a minute and a half due to the fact that I saw it while the bus was traveling over the bridge; after crossing the bridge, the object was no longer in view as the bus went behind a hillside as it continued on its usual route. I kept looking back as we came around the hill to see if I could spot the object again, but it looked like it was now gone. I never actually saw it move, however, such as entering or leaving the area. Nobody else on the bus seemed to notice the large dark object, and I didn't want to point it out to anybody at the time, due to fear of ridicule (even though it was plain to see it was there if you looked right at it....I take this bus every day, and don't want the people who see me daily to think I am crazy). I am not sure if the object made any noise or not, as I was riding inside a noisy bus over a busy bridge. The triangle appeared to be pointed westward and its flat bottom evenly level. It was fatter on the East side of the triangle than on the West end of it, with its \"backside\" or aft forming approximately a sixty degree angle within the triangle. The only reason I happened to notice the thing at all is just because I happened to be looking out the bus window at the right place at the right time. The moment I noticed it, it was immediately apparent that it was peculiar-looking; I couldn't help but instantly think \"UFO\" when I first saw it. Although I felt self-conscious about seeing it, I did not have any other intense emotions at the time. I just kept watching it, occasionally taking my eyes away from it just to glance around the bus to see if any other commuters were seeing what I was seeing."],"Date Submitted":"10/09/2010 02:11 UTC","Sighting Duration":"00:01:30","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Triangle"}