{"Date of the Event":"10/31/2008 03:00 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/25753.html.txt","/var/www/straped/mufon/org/25753.html"],"trends":["There have been 12 other sightings in Silver Spring","There were no other sightings in Silver Spring on or around October 31st 2008"],"Object Flight Path":"Straight-line path","Weather Factors":"None, Does Not Apply","Sighting Duration":"Undisclosed","Longitude":"-77.020518","Disposition":"Unknown","Case Number":"25753","Viewing Distance":"21-100 Feet","Summary":"Large completely silent black triangle approximately 300' on a side","Country":"United States","Latitude":"38.999636","Region":"Maryland","map":"<A HREF = \"http://maps.google.com/maps?q=38.999636,+-77.020518(25753)&iwloc=A&hl=en\"> mufon case (25753) map </A>","Object Shape":"Triangle","City":"Silver Spring","Tags":"City","divs":["Sighting DetailsI live in Silver Spring, Maryland just a few miles outside Washington, D.C. At approximately 3:30am in early November, 2008 I awakened because I needed to go to the bathroom but the bed was warm and I was reluctant to move. I was laying on my left side facing a large pair of double hung windows when I noticed a low light moving overhead on the tip of what turned out to be a large flat-black triangular craft approximately 300' on a side and approximately 50-75' above the roof of the three story garden style condo I live in. It moved over the courtyard toward the next building in the complex. I estimate it was only moving between 15 and 20mph. The craft was completely silent and there was no visible means of propulsion. My best description of what I saw was that it \"slid\" through the air rather than flew. It was simply elegant to watch. It was far too large and heavy to be held aloft by air passing over air foils as do all conventional aircraft that I am aware of. It was moving so slowly that some other technology had to be at play. I could not discern any markings or openings on the bottom of the craft other than low level lights on the tips of the triangle. Because planes and helicopters fly over on a regular basis, I was acutely aware that this craft made absolutely no sound. I don't believe the military is in the habit of flying a secret craft over a metropolitan area and am also aware that sightings similar to what I saw have been reported all over the world by very credible sources. I have noticed of late that more and more UFO stories are appearing on cable television and wonder if the military is trying to get us used to the idea of a first contact scenario. In any event, we are living in interesting times."],"Date Submitted":"10/09/2010 01:31 UTC","Log Number":"US-10092010-0002","Source":"MUFON"}