{"divs":["Sighting DetailsOn the 23th of October 2008, I was sun bath tanning in my backyard. It was near 3:00 pm: so i decided to get up and go inside. Perchance i looked up in the Eastern sky and I thought I had seen a jet flying in the sky.. but it looked strange.. it was too long, and no sound at all and too low. I kind of laughed and thought it almost looked like a satellite not a helicopter. It seemed to have an aurora, if you will, around it. Its position as is in the picture shown remains as is throughout its motion. It proceeded to move eastward slowly in a southern-ish manner until it disappeared behind some 20 ft redwoods. I cannot really give you a fair estimate of how fast it was moving it was almost floating in space. Its movement was very smooth. I cannot give a fair altitude however estimates could be made from reference points in the photo. I could say it was lower than a jet yet higher than a helicopter at mid-high flight. so when I had noticed it looked strange I took out my camera phone and took a picture because i knew for sure that a high resolution picture would be captured. then after it disappeared from sight i went inside immediately and uploaded it to my computer via a standard USB cable. I only made one digital copy ever and it was only to highlight the area in which the craft(s) appear. i recommend you save the file and analyze it yourself with high zoom and perhaps even tests for modifications of any kind or the like and if you have any knowledge on the subject please email me with any questions you have. I urge you to contact me if you feel the need or want to do so. Thank you for your time."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.013581,+-121.800239(25757)&iwloc=A&hl=en\"> mufon case (25757) map </A>","Object Flight Path":"Undisclosed","Date Submitted":"10/09/2010 04:02 UTC","Object Shape":"Disc, Other, Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/25757.html.txt","/var/www/straped/mufon/more/25757_submitter_file1__102208142809.jpg","/var/www/straped/mufon/org/25757.html"],"Latitude":"38.013581","Object Features":"Undisclosed","Tags":"City","City":"Antioch","Date of the Event":"10/23/2008 02:47 UTC","Viewing Distance":"Unknown","Longitude":"-121.800239","trends":["There have been 13 other sightings in Antioch","There was one other sighting in Antioch on or around October 23rd 2008","This sighting has never been favorited.",""],"Case Number":"25757","Summary":"[W/ PHOTO] (1.2 Mb VGA camera phone 2008)Three craft flying in formation with an aurora around them.","Region":"California","Source":"MUFON","Disposition":"Insufficient Data","Sighting Duration":"00:00:30","Weather Factors":"Unknown","Log Number":"US-10092010-0006"}