{"Longitude":"-74.77988","Country":"United States","Weather Factors":"None","City":"Morrisville","divs":["sighting detailsi was outside my friend *(name deleted--cms\\sg)apartment when we noticed an odd sporadic formation of lights. they would flash all over the place like the object was a diamond or triangle, we saw the same type of lights a few nights later and were able to see the appox shape of the craft it's lights were so bright they lit up the clouds it was traveling through. both were completely silent and were visible for a min or two then gone, shortly after we heard what we believe to be military jets over head, it had to be no more then a min after the craft disappeared. we noticed it because the sporadic pattern and the huge apparent size and its odd flight pattern over here, over there, making u turns. at 1st we thought it might be a plane, then we saw a plane on the other side of the visible sky and no likeness. the object made me feel apprehensive, it just seemed abnormal. the video i've attached isn't the best, but you will see what i mean."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25769.html.txt","/var/www/straped/mufon/org/25769.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.217458,+-74.77988(25769)&iwloc=A&hl=en\"> mufon case (25769) map </A>","Region":"Pennsylvania","Case Number":"25769","Sighting Duration":"Undisclosed","Date Submitted":"10/09/2010 11:22 UTC","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"40.217458","Object Flight Path":"Path with directional change,Other","Date of the Event":"10/02/2010 09:40 UTC","trends":["There have been 5 other sightings in Morrisville","There were no other sightings in Morrisville on or around October 2nd 2010","This sighting has never been favorited.",""],"Log Number":"US-10092010-0018","Object Features":"Patterned Surface, Other","Object Shape":"Diamond, Flash, Triangle","Summary":"strange pattern of lights pulsing over wide range no pattern"}