{"Latitude":"32.445974","Date of the Event":"10/09/2010 08:20 UTC","Tags":"City","Case Number":"25766","Object Shape":"Triangle","divs":["Sighting DetailsI was just out to have a smoke and the stars are really nice tonight; i was seeing several shooting stars (3), so i thought i'd watch a minute more to see if there were others. Then, coming out of the west very fast was a bright orange elongated shape. It was moving VERY fast and on an incredibly flat, straight path. It did not veer even the slightest bit. As it went toward the south it very SUDDENLY slowed to a near stop. At that point, i could easily make out that it appeared to have a sort of triangular shape ~ pointy in the front, tall in the back and still quite orange. Then it began to move very, very slowly until i lost sight of it behind the trees on our easterly property line. I don't have much of a horizon to the southwest because of trees, so i can only see about an acre back. I measured with my thumb and forefinger how far up it was from the ground at the back of the acre and that measurement was about 5\". (Sorry; i know nothing about degrees and angles) All of the movement it made continued on the same very straight line, never going above or below that 5\" mark. I called my husband to come out because i was just sure it would come out from behind those trees, but it never did, so it would have to have continue heading due south ~ otherwise i would have seen it come from behind the trees. Checked the clock and it would have been right about 8:20p (9th Oct 2010) that i first saw it."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.445974,+-95.703852(25766)&iwloc=A&hl=en\"> mufon case (25766) map </A>","Object Features":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"Texas","files":["/var/www/straped/mufon/html2text/25766.html.txt","/var/www/straped/mufon/org/25766.html"],"Country":"United States","Longitude":"-95.703852","Date Submitted":"10/09/2010 09:55 UTC","Log Number":"US-10092010-0015","Disposition":"IFO","Source":"MUFON","City":"Ben Wheeler","Summary":"Orange triangular object going FAST out of West toward South then almost stopped before continuing on quite slowly","trends":["There have been no other sightings in Ben Wheeler","This sighting has never been favorited."],"Object Flight Path":"Straight-line path"}