{"Longitude":"-72.709299","files":["/var/www/straped/mufon/html2text/2576.html.txt","/var/www/straped/mufon/org/2576.html"],"Date of the Event":"07/31/1974 09:00 UTC","Country":"United States","Region":"Vermont","map":"<A HREF = \"http://maps.google.com/maps?q=44.935324,+-72.709299(2576)&iwloc=A&hl=en\"> mufon case (2576) map </A>","City":"Berkshire","Tags":"City","Log Number":"","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsWe were collecting wood for our campfire next to the hired mans trailer when wenoticed a very bright orange light moving from the zenith toward the easternhorizon. It made no sound and did not deviate from its course. We kept trackof the object until it became obscured on the eastern horizon, when we noticedanother, identical orange UFO on the same path and at the same speed as thefirst. It too eventually vanished on the eastern horizon after being observedfor approximately one minute. The witnesses, besides myself, were my brotherCarl 10, my brother-in-laws half-brother Perry Henderson, and the hired manskids Julie Rich 16, Virgil 14, Lynn 11, Mike about 10, and one other boy 7. Theexact date of the sighting is unknown, but I reported the event to the EnosburgFalls, Vermont police department the next day. I turned 13 on August 11, 1974. During the entire sighting we all perceived the objects as UFOs or spaceshipsfrom another planet. The same evening, we saw many shooting stars, which Iexplained to the other youths as not really stars at all. My brother, Carl,would wish present anonymity since he is now 2003 a professional airline pilot."],"Weather Factors":"Unknown","Object Features":"Undisclosed","Latitude":"44.935324","Case Number":"2576","Object Flight Path":"Undisclosed","Sighting Duration":"00:05:00","Summary":"Two orange nocturnal lights in single file, not in","Object Shape":"Undisclosed","trends":["There has been one other sighting in Berkshire","There were no other sightings in Berkshire on or around July 31st 1974"],"Date Submitted":"07/31/1974 09:00 UTC"}