{"Case Number":"25776","Log Number":"US-10102010-0007","Latitude":"39.355047","Date of the Event":"05/31/2007 11:30 UTC","Object Flight Path":"Straight-line path","Longitude":"-90.037052","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25776.html.txt","/var/www/straped/mufon/org/25776.html"],"Country":"United States","Summary":"three circles of burnt-orange light in a triangular formation","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Hettick","This sighting has never been favorited."],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.355047,+-90.037052(25776)&iwloc=A&hl=en\"> mufon case (25776) map </A>","Object Features":"Unknown","City":"Hettick","Tags":"City","divs":["Sighting DetailsI was working at a summer camp back in 2007 and one night later in June, some of the staff and I were going to go lay in the field and watch the stars that night. we all lay down in a row along the road embankment and started star gazing when someone saw a star that was a litter darker and larger than the rest, far off in the distance directly south of us. We thought it was just Mars or Jupiter and didn't think much about it. A few minutes later we looked back at it and noticed that it had moved a little upwards in the sky, at arms length, the distance of a dime. At that point we thought that it must have been some form of aviation. We thought it was military, because there is an armory and military airport within a few miles of the camp, so we once again ignored it to some extent. About twenty minutes had past, and at that point we could start to see that it wasn't just one light, a few minutes after that we could tell that it was three lights in a stationary triangular formation. We continued to think that it was just military and while it was right over us the circles of light were, at arms length, the size of dimes, twice the distance of their diameter away from one another and were a burnt orange color, darker on the edges and lighter, almost a yellow, in the middle. I was still convinced that it was military, until after it had past us. I started to question U.F.O when I noticed that it made absolutely no sound. I knew that no stealth jet or any military flying vehicle was that silent, and I didn't know of any that shape. We continued to watch it for another 30 or 40 minutes until it went out of our sight at the northern horizon. The craft moved very slowly across the sky in a straight line from north to south, taking about an hour and a half to go from one horizon to another. I have no evidence, mainly because the camp doesn't like the staff carrying electronics, and Polaroid cameras were locked in the trading post. I cant remember the exact day it happened because it was years ago, but I think it was late July. I know it had to be between June and July because the camp is only opened for six weeks starting in June. I didn't report this incident until now because I didn't know where to make a report until I saw something on the discovery channel about M.U.F.O.N. Most of the people I saw it with are still convinced it was military, but I wont agree until I have evidence. I'm reporting this to see if it helps in any way, and hopefully to find out what exactly I saw that night."],"Date Submitted":"10/10/2010 10:38 UTC","Object Shape":"Circle, Triangle","Region":"Illinois","Viewing Distance":"Unknown"}