{"Summary":"Flying triangle over fort collins, CO","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.58526,+-105.084423(2577)&iwloc=A&hl=en\"> mufon case (2577) map </A>","City":"Fort Collins","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around October 1st 2003"],"Region":"Colorado","Latitude":"40.58526","files":["/var/www/straped/mufon/html2text/2577.html.txt","/var/www/straped/mufon/org/2577.html"],"Log Number":"","Object Features":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"10/01/2003 09:28 UTC","Longitude":"-105.084423","Date Submitted":"10/01/2003 09:28 UTC","Source":"MUFON","Object Shape":"Triangle","Case Number":"2577","divs":["Sighting DetailsOut on the balcony of Sara Wades 9th floor flat in one of Fort Collinss only 4high-rise buildings. It was dark and weather conditions were largely clear, withlight cloud to the south that became thicker, but clear up to the cloud. It mayhave been slightly hazy. Sara Wade noticed an object that looked really closebut didnt make any noise. Aaron Reid went to look and said its a triangle.Oliver Niesewand then came to the front of the balcony and saw it too. It wasvery obvious - clearly triangular shape with five lights that picked out atriangular chevron pointed towards the direction of travel, and a sixth light inthe middle of the configuration. All lights were steady and didnt blink orflash. The object was moving very fast - faster than a helicopter or passengerjet but looked big - larger than a low altitude helicopter or small jet. Twostriking things about it aside from the completely unfamiliar lightconfiguration when compared to civil or military aviation lights was the speedat which it travelled without producing any audible sound - comparable to a lowfighter jet perhaps. However, the apparent size of the object when consideredwith its speed makes this unlikely. It then travelled into the cloud base which,while thin, was enough to conceal it. The whole time of the sighting was about 8seconds. The craft did not seem to change direction at all.Although gauging distancesize in the night sky is very hard to do, it leaves twohard questions that cannot apparently be explained by known craft. The speed ofits travel was so fast and so noiseless that it defies standard explanation whenconsidered with the apparent size of the craft. It was one of the biggest thingswe have ever seen in the night sky.I am surprised that anyone would be flying such a craft in largely clearconditions so low over a town. Hardly very secretive, although likely to settongues wagging.I would be interested to know what local air traffic control has logged, or ifanyone else saw it too."],"Disposition":"IFO","Sighting Duration":"00:00:59"}