{"divs":["Sighting DetailsI had first noticed a single orange ball hovering above the tree line at my apartment at 14111 big crest ln in woodbridge VA. I was on my back porch smoking a cigarette when I noticed the light. I thought it could perhaps be a tower light but there's no towers in that direction. I never thought anything of it until it kept coming back for about 2 months. It never did any more than sit in the same spot above the tree line. It would get brighter and lesser and stuff but never move. One day I was walking out to my car and looking up at it and it started blinking. First really really slow like a surge every 4-5 seconds. But as it sped up it got very very bright. So bright it lit up like a spot light after it was at it's brightest flashing it just vanished like a scene from star trek when they do the hyper speed thing. I'm unaware if anybody else had seen it but I didn't see anyone else outside at the moment. I did have one girl witness it with me, an ex girlfriend but when she saw it she refused to believe it and would never speak of it like it was a taboo topic. We no longer speak. The fireworks incident was around the 4th of July because a resteraunt named Tim's River Shore had to be doing fireworks because I could see them over the tree line. ( the direction of the tree line is towards Rt 1 which leads down to this resteraunt) I was out on the back porch yet again watching the fireworks and noticed the bright orange ball in his normal spot just hanging out like usual when another one had floated our from behind it and it seemed to be trying to get a better position to watch the show from. They both sat there the 'main' one never moving but the other one would bob and switch sides every now and then. They wnt on for about 20-25 minutes and after they were over, the 'mover' circled the 'main' ship and left in a instant boost of speed normal crafts are not capable of. The main one sat about another 10 minutes and then did his same old flashing deal and then vanished like every other time. Haven't seen them since because I moved to an apartment about 10 minutes down the road. (10:35 A M I am currently watching the Chris bledsoe animation and the orange balls are Exactly what I saw. And the one zooming in was th same fashion as my 'mover') I am a 23 yr old and I do believe there is something out there and would like to help in the exposure of the truth to the public. Thank you for your time."],"Viewing Distance":"101-500 Feet","Tags":"City","Summary":"*Chris Bledsoe bright orange balls 'watching' fireworks","Weather Factors":"None, Does Not Apply","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.664882,+-77.246985(25777)&iwloc=A&hl=en\"> mufon case (25777) map </A>","Object Flight Path":"Stationary,Other","Log Number":"US-10102010-0008","Source":"MUFON","Object Shape":"Fireball, Sphere","Country":"United States","City":"Woodbridge","Region":"Virginia","Sighting Duration":"Undisclosed","Date of the Event":"11/30/2007 10:00 UTC","Disposition":"Insufficient Data","Longitude":"-77.246985","Latitude":"38.664882","trends":["There have been 5 other sightings in Woodbridge","There were no other sightings in Woodbridge on or around November 30th 2007"],"Case Number":"25777","files":["/var/www/straped/mufon/html2text/25777.html.txt","/var/www/straped/mufon/org/25777.html"],"Date Submitted":"10/10/2010 10:39 UTC"}