{"divs":["Sighting DetailsMy wife, son, and I were driving on route 130 west to go to Merrillville, IN, to shop. I was driving. We were driving west. When we were passing threw a small town called Wheeler, my wife asked us both if we could see this object that was in the sky. We were driving into the sun, so I had some trouble seeing what she was pointing at in the sky. Finally, I saw it. It was round and very far off in the distance. I said may be it is a star or planet that is just bright in the sky. It was bright white. The object was obviously in front of the sun, yet it did not look dark or shaddowed. The sun was around 10 o'clock in the sky and the object was around 11 o'clock. I also felt it could be a plane traveling in in a manner that made it seem still. However, I did not see any vapor trails. It appeared very far away. I was looking at thinking what kind of plane would be so bright. I figured it was a planet. Then it moved. IT was no longer bright white, it was black. It moved fast. All three of us watched it go north. I figured it was heading for lake Michigan. It moved like nothing I know. It crossed the horizon and out of view in less than 5 seconds. There was no vapor trail. If it was a jet fighter, there was no sound. I just keept saying it's moving to fast to be a jet. It just moved like quickly dragging the mouse on a computer quickly from side to side. We pulled over near a field and tried to locate it again. If it was a plane, we would have seen it. Visibility was excellent. All three of us witnessed this, my wife a little longer because she was not sure at first if it was really happening. The entire sighting lasted 3-4 mins. What ever that was today, someone else had to see. It was nothing I can explain without using the term \"UFO\". It really has me freaked out. I have never seen anything like this before. If it was just me, I would probably dismiss it as my own crazy mind, but all three of us saw it."],"Region":"Indiana","Log Number":"US-10102010-0001","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Date Submitted":"10/10/2010 01:20 UTC","Case Number":"25770","Weather Factors":"Unknown","trends":["There have been no other sightings in Wheeler","This sighting has never been favorited."],"Date of the Event":"10/09/2010 05:20 UTC","Disposition":"Insufficient Data","Longitude":"-87.1792","Latitude":"41.511705","Source":"MUFON","City":"Wheeler","files":["/var/www/straped/mufon/html2text/25770.html.txt","/var/www/straped/mufon/org/25770.html"],"Summary":"Bright objet seen standing still in the sky, Looked almost like a star. Moved away at speed I have never known.","Object Shape":"Sphere, Star-like","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.511705,+-87.1792(25770)&iwloc=A&hl=en\"> mufon case (25770) map </A>","Tags":"City","Sighting Duration":"Undisclosed"}