{"Tags":"City","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Petersburg","There were no other sightings in Petersburg on or around November 30th 2002","This sighting has never been favorited.",""],"Log Number":"US-10102010-0013","City":"Petersburg","map":"<A HREF = \"http://maps.google.com/maps?q=41.905768,+-83.708428(25782)&iwloc=A&hl=en\"> mufon case (25782) map </A>","Sighting Duration":"Undisclosed","Disposition":"Hoax","Latitude":"41.905768","Country":"United States","Summary":"Giant triangle flies 50 ft right over my head","Region":"Michigan","Source":"MUFON","Case Number":"25782","Object Shape":"Triangle","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Longitude":"-83.708428","Object Flight Path":"Straight-line path","divs":["Sighting DetailsIt happened while i was sitting on a bicycle at the corner of a intersection. To my right was a church and a tall tree on the corner. To my left is a small open lot and next to that is a two story building. While i was sitting there i noticed something over head. I looked up and coming from my right just above the tree and church steeple was a giant object. As it moved from my right to my left i could see the bottom of it somewhat clearly and could tell it was flat black and had three white lights on it. One in the front and two in the back making a triangle shape. It moved from above the top of the tree to above the top of the two story building and out of my line of sight. The distance between the tree and two story building is about 100 ft and this object moved so slow it took about 5 or 6 seconds to travel that space. While overhead it was so slow and so close i could have thrown a rock at it and hit it but i didn't. I was very aware that this object was not making any noise and that it did not create any type of air wake like when a car or something passes you and it makes a wind blow on you."],"Date of the Event":"11/30/2002 12:00 UTC","files":["/var/www/straped/mufon/html2text/25782.html.txt","/var/www/straped/mufon/more/25782_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/25782.html"],"Date Submitted":"10/10/2010 11:33 UTC"}