{"Object Features":"Other","Disposition":"Unresolved","Longitude":"-81.513254","Viewing Distance":"20 Feet or Less","Summary":"Football field size triangle Jacksonville fForida","Latitude":"27.672727","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=27.672727,+-81.513254(2578)&iwloc=A&hl=en\"> mufon case (2578) map </A>","divs":["Sighting DetailsThe following incident occurred about ten years ago. Strangely it was notimportant to me until the past few years. It is really bothering me now.This with my fathers strange untimely death, his connections with themasons,rumored ties to a secret NavyWhich does not exsistand his documented nowdisappeared squadron UFO chase is now just frightening me.I have scoured the Internet for an incident similar to mine and have come upempty handed. Of the hundreds of alleged reports I have scoured the only similardetail I have run across two large football field size triangle incidents.Though the happenings, light configuration etc. do not match what I saw.I am scientific minded and believe in UFOs and aliens 100 per centor at leastthe possibility. However, I do strongly feel that most like minded aredelusional, easily led, lying or just plain crazy. I have only told a few peoplemy experience as I do not want others to categorize me as such. Maybe I wascrazy at the time. I do not really know where to turn with such a story or howto research my incident. Its just plain driving me nuts.In the fallit was just starting to get cool here of 93 or 94sorry not sureMygirlfriend and I Were watching our local PBS station and we caught the star guysshow. He advised that the most spectacular meteor shower in decades would bevisible in our area away from city lights in a few days.Later we packed a picnic, binoculars and a blanket and headed off for The CrossRoads at Ponte Vedra Beach. The cross roads Is a portion of beach so named afterthe sole condo complex near by. Ponte Vedra beach is an affluent wealthy area ofour shore line. At the time of the sighting The Cross Roads was situated in awooded isolated area of the beach. Traditionally this area was our High Schoolsdomain of the beachthough located over 30 miles from it and we were both in our2nd year of college. You would park in a small, unmarked wooded public beachaccess area as the affluent were dying to kill the public beach access. Fromthere a long, narrow sand trail would"],"Tags":"City","Object Flight Path":"Straight-line path,Unknown","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"11/30/1993 12:00 UTC","Object Shape":"Triangle","Case Number":"2578","trends":["There have been no other sightings in JacksonvillePonte Vedra B","This sighting has never been favorited."],"Sighting Duration":"00:00:00","files":["/var/www/straped/mufon/html2text/2578.html.txt","/var/www/straped/mufon/org/2578.html"],"Date of the Event":"11/30/1993 12:00 UTC","Log Number":"","Country":"United States","City":"JacksonvillePonte Vedra B"}