{"Date Submitted":"10/10/2010 08:50 UTC","Longitude":"-92.440917","Object Features":"Unknown","Disposition":"Unknown","trends":["There have been 5 other sightings in Alexandria","There were no other sightings in Alexandria on or around October 8th 2010"],"Object Shape":"Circle, Star-like, Triangle","Sighting Duration":"Undisclosed","Summary":"It looked like Mars at first, until it started to move.","Weather Factors":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/25799.html.txt","/var/www/straped/mufon/org/25799.html"],"City":"Alexandria","Source":"MUFON","Latitude":"31.318504","Case Number":"25799","Log Number":"US-10102010-0029","Date of the Event":"10/08/2010 12:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=31.318504,+-92.440917(25799)&iwloc=A&hl=en\"> mufon case (25799) map </A>","divs":["Sighting DetailsI have an apartment behind my parents home, and my boyfriend and I were just walking back to it from visiting with my mom. He decided to stand outside to smoke, when I noticed what appeared to be Mars in the night sky. I asked him, \"Matt, is that Mars?\" At first he wasn't paying attention so I asked him again, \"Hey, is that Mars?\" He agreed that it was. I said, \"Wow! You can see it so clear tonight.\" We haven't had any rain in several weeks and there wasn't a cloud in the sky that night. Needless to say, after observing it for a few more minutes, I turned my attention back towards him and was talking. All of a sudden he says, \"Hey, find where Mars went?\" Turning around sort of puzzled I did look in the exact spot where Mars had appeared to be only a few seconds earlier, but it had dissapeared. So I started to scan the sky and finally found it travelling in a North-East pass over us. At the moment that the reddish-orange ball that I had thought only moments earlier to be the planet Mars was parallel to our position, it shuts off the red-orange light and a series of three smaller bliking lights became visible. Two white, one red and they appeared to rotate around the what now appeared to be triangular object in an irregular pattern. The object was moving very quickly and silently and we watched as it sped off into the far distance, but before it completely dissapeared, I am almost positive that I observed it make a sharp dart downward, than back upward. My boyfriend however had a hard time seeing it at this point and I think mostly because of the glare of our security light."],"Viewing Distance":"501 Feet - 1 Mile","Region":"Louisiana","Tags":"City"}