{"Case Number":"25791","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Stationary","Latitude":"36.980537","Date of the Event":"09/12/2001 07:30 UTC","Summary":"Ball of light appeared, hovered and disappeared.","Weather Factors":"None","Date Submitted":"10/10/2010 01:56 UTC","Log Number":"US-10102010-0022","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-122.029296","Object Features":"None","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around September 12th 2001"],"Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25791.html.txt","/var/www/straped/mufon/org/25791.html"],"divs":["sighting detailsi own a house on top of a mountain, level with two other mountain ridges. it was 9\\12 during the no flight zone after 9\\11. we don't have a detailed recollection because we never thought we would make a formal report of what we saw, but we talked about it this morning, and seem to both still remember it the same way. the sun had set, but it was still light out. we were out on my deck. a ball of light came into my sight and i pointed it out to my boyfriend. we talked about the no flight zone, and continued to watch it hover. we don't recall it moving. it was just over the ridge, too low and close to be aircraft or a satilite. when it disappeared was when we both freaked out and assured each other that we had seen the same thing and that it seemed totally unexplainable. there is a flight pattern that goes directly over my house headed north east toward san jose airport, but this was further west. sorry we don't have futher details, and the time we provided is a guesstimate that we both agreed opon. we saw your show this morning and realized that you have the resorces to possibly colaborate our story with another witnesse's account. this is not something that has caused us duress, although we feel that as of that night we both became convinced of the existance of extra tarestrial life."],"Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=36.980537,+-122.029296(25791)&iwloc=A&hl=en\"> mufon case (25791) map </A>","City":"Santa Cruz","Region":"California"}