{"divs":["Sighting DetailsFlew to Philadelphia on commercial flight. Had window seat on left side of jet. We were descending westward toward the Philadelphia airport and were just east of the Delaware River when I noticed a close object, approx. 100-200 yards from the jet that looked like a metallic soccer ball. It was sort of sparkly as it flew and I thought that it was very odd. Then I thought my eyes must be deceiving me and tried to think that maybe the sparkly look was due to a bird flapping it's wings... but would need to be too big to be a bird at even 100 yards. The pilots must have seen this thing... one could not miss it if they were looking out the window. Was watching a show today that mentioned MUFON and did a search for soccer ball looking UFOs were I read about a guy in NE Arizona... his description sounds very similar to what I believe I saw. When I say that it looked like a soccer ball, it appeared to have flat spots in the same sort of configuration as a soccer ball. I could not tell whether it was going in the same direction as us but it appeared to be moving slow as we moved past it or it was going in the opposite direction. It was flying roughly in the same east west direction as us. The object was in my view for what seemed about 10-15 seconds."],"Object Flight Path":"Straight-line path","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around May 13th 2007"],"files":["/var/www/straped/mufon/html2text/25797.html.txt","/var/www/straped/mufon/org/25797.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10102010-0027","Latitude":"39.961495","map":"<A HREF = \"http://maps.google.com/maps?q=39.961495,+-75.155709(25797)&iwloc=A&hl=en\"> mufon case (25797) map </A>","Object Features":"Patterned Surface","Source":"MUFON","City":"Philadelphia","Object Shape":"Sphere","Case Number":"25797","Region":"Pennsylvania","Disposition":"Unknown","Date Submitted":"10/10/2010 06:57 UTC","Viewing Distance":"101-500 Feet","Summary":"From jet at approx 6k ft saw a metallic soccer ball object flying near our jet","Date of the Event":"05/13/2007 12:00 UTC","Weather Factors":"Unknown","Longitude":"-75.155709","Country":"United States","Tags":"City"}