{"divs":["Sighting DetailsDriving in auto on country road near Dunreith . Its brightness at 45 degrees in SW sky. Didnt' know what it could be. Reaction amazement nearly freaked out is word witness used. Stopped car and watched it for about 4 or 5 minutes. At home same object reappeared same place in sky .Watched for 2 minutes. Object never moved but rather this yellow-white mix silver delta shaped object just vanished at times. Lost sight when it vanished and never returned. The Newcastle Post Officer arrive late at the 1st. sighting and said he hd never seen anything like it. The Newcastle Post told the excited witneses to call me Donald Worey Connersville donhelp1@webtv.net. I had many many UFO sightings in 66 67 and 73 waves and other years but stopped gettng things in the sky and investigated and reserched abduction and the Nordic type aliens. I have been at this for 38 years and have helped over 200 abductees and have written over 50 articles on our avocation. I am now age 82 and still do it at a slower pace. Though I have helped many I lost one man when he hung himself leaving a wife and three kids. It really upset me to say the least. I have had some injuries to abductees with the worst being the Florida lady who had the rat aliens cleanly remove all their inside female organs. It took me some time to get her out of the depth of dispair. If you want to read some of my articles my web site is httpwww.abduct.comworleyworley.htm. I formerly belonged to NICAP. APRO, CUFOS, and MUFON . Now I'm just freelance."],"Date of the Event":"09/29/2003 07:30 UTC","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=39.803379,+-85.438583(2579)&iwloc=A&hl=en\"> mufon case (2579) map </A>","trends":["There have been no other sightings in Dunreith","This sighting has never been favorited."],"Weather Factors":"None, Unknown","Source":"MUFON","Region":"Indiana","Log Number":"","City":"Dunreith","Summary":"Dunreith UFO","files":["/var/www/straped/mufon/html2text/2579.html.txt","/var/www/straped/mufon/org/2579.html"],"Tags":"City","Sighting Duration":"00:05:00","Disposition":"Unresolved","Date Submitted":"09/29/2003 07:30 UTC","Longitude":"-85.438583","Object Features":"Other","Country":"United States","Latitude":"39.803379","Case Number":"2579","Object Flight Path":"Other","Viewing Distance":"Over One Mile"}