{"Disposition":"Unresolved","Region":"Ontario","files":["/var/www/straped/mufon/html2text/25792.html.txt","/var/www/straped/mufon/org/25792.html"],"Case Number":"25792","Object Shape":"Other","Source":"MUFON","Date of the Event":"10/07/2010 08:55 UTC","Viewing Distance":"Unknown","Date Submitted":"10/10/2010 02:57 UTC","divs":["sighting detailshello, this is my first ufo experience.on thursday october the 7th. at approximately 8.55 pm i was sitting outside with my wife looking at the nighttime sky.it was a beautiful starry night.we brought two chairs out to the patio and place them in a south east direction.we even turned all the lights off in the house which made a big difference for viewing the sky.we were not outside 5 minutes when i laid my head back against the chair when a huge v shape craft silently and almost invisible flew over the house in a se direction!!i couldn,t beleive my eyes.the v was red.it was very faint,almost transparent, it wasn't a perfect v it looked like somebody took a red can of spraypaint and made a sloppy v (or it seemed to be changing shape,i'm not sure)inside the arms of the v were orange balls i wouldn't call them lights i can't say they gave off any light.it also blocked out the stars.i felt a bit unnerved at this point because i realized it must be huge.it covered the whole sky in about 4 to 5 seconds.i don't know if it went out of my field of vision or just disappeared.iws very excited after seeing this object,it was as if i had a revelation i thought to myself all those people that have reported something like this can't all be crazy.i had to tell somebody, so i called my brother. i wanted to report this to the police but my wife talked me out of it until today october 10 2010 .i googeled v shape ufo.turns out this exact craft was reported fly above the kennedy space centre in florida.this person describes exactly what i saw. also about 3 minutes after the sighting a helicopter flew into the same area,just like the case in florida.the hair on the back of my neck was standing up when i compared my notes from the other night to this sighting in florida. i would love to hear from anyone who might have seen the same craft.i feel like i need to tell people about this experience. thank you *(wit's name deleted--cms\\sg). p.s. i did make sketches of the object."],"Longitude":"-82.35084","Summary":"A red V shape craft flew over my house October 7th at 8.55 pm EST","Weather Factors":"Unknown","Tags":"City","Country":"Canada","Sighting Duration":"00:00:05","Log Number":"CA-10102010-0023","Object Features":"Patterned Surface, Other","trends":["There have been 16 other sightings in Sarnia","There were no other sightings in Sarnia on or around October 7th 2010"],"Latitude":"42.98842","Object Flight Path":"Straight-line path","City":"Sarnia","map":"<A HREF = \"http://maps.google.com/maps?q=42.98842,+-82.35084(25792)&iwloc=A&hl=en\"> mufon case (25792) map </A>"}