{"Viewing Distance":"Unknown","Disposition":"Unknown","Sighting Duration":"00:15:00","Case Number":"25795","Longitude":"-82.447718","files":["/var/www/straped/mufon/html2text/25795.html.txt","/var/www/straped/mufon/org/25795.html"],"City":"Tampa","Latitude":"27.959055","Summary":"3tite nit balls w/red glow","trends":["There have been 105 other sightings in Tampa","There was one other sighting in Tampa on or around October 9th 2010"],"Object Flight Path":"Undisclosed","Country":"United States","Object Features":"Undisclosed","Object Shape":"Circle","Date Submitted":"10/10/2010 04:46 UTC","Region":"Florida","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-10102010-0025","Tags":"City","Date of the Event":"10/09/2010 06:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.959055,+-82.447718(25795)&iwloc=A&hl=en\"> mufon case (25795) map </A>","divs":["sighting detailswoke up early shortly before dawn went outside for some air looked up and stared at the stars, one cluster of stars had am red glow thinging it was a planet i kept staring in amusement, shortly thereafter the cluster started going in a circular motion, but first drifted to my left which would be west towards cape kennedy.then it stopped and began to circle a fairly large motion no way to tell how,believing at first it was planet i have no knowledge of astronomy or mathamatical literacy. just a common joe. i then looked at otherstars believing i might have morning hallucinations. none of the other stars moved at all.the tight cluster kept circling,then went left in a straight line then right and circled again almost felt like it was playing with me again looked at other stars and no motion looked back at\"planet\"??? it kept circling till dawn then dissapeared in the light. had to let you know i never seen anything like this in my life of 63 years i truly believe this was not a hallucination of any sort it was too explicit in it's motion signed *(wit's name deleted--cms\\sg)don't bother checking my records you'll believe i definately am unstable but trust me this happened good luck will look again tonight or in a.m. will let you know chow baby!!!!!"]}