{"files":["/var/www/straped/mufon/html2text/25800.html.txt","/var/www/straped/mufon/org/25800.html"],"Weather Factors":"Does Not Apply","Source":"MUFON","Region":"Georgia","Viewing Distance":"Unknown","Object Features":"Unknown","Date Submitted":"10/10/2010 09:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.166215,+-82.898983(25800)&iwloc=A&hl=en\"> mufon case (25800) map </A>","Date of the Event":"11/15/2009 11:17 UTC","Case Number":"25800","Log Number":"US-10102010-0030","Disposition":"Insufficient Data","Longitude":"-82.898983","City":"Undisclosed","Object Shape":"Flash","Sighting Duration":"00:00:35","Country":"United States","trends":[],"Latitude":"32.166215","divs":["Sighting DetailsHappened to turn on the NASA channel. At home watching television. Footage over earth at night, camera was panning across the surface until half of screen displayed space. Sudden burst of tiny flashes of light in space (none over the surface area of Earth) Each burst was an extremely quick flash, a tight, precise sphere. I THINK THIS IS EXTREMELY IMPORTANT WHAT HAPPENED NEXT: Suddenly a video \"noise\" effect was activated. White bursts started appearing all over the screen including over the surface being shown of Earth. The blips were big, misshapen and in no way similar to what I saw from the \"official\" footage moments before. I could still see the flashes in the sky from the real event going on, but for the most part they were obscured by the noise filter that had been activated suddenly. The footage was dropped moments later as someone started discussing another unrelated topic. What is important to me (besides the bright flashes above the Earth) was that these people knew that this could happen and had a filter that could be activated (presumably) at the touch of a button to cover up what was happening. I'm not a physics person, but the area covered by these lights had to be as large as the continental United States. Assuming equal sized objects \"flashing,\" these objects were three dimensional in layout (sizes varied of the flash, though all were perfect pinpoints of light.) Not a single flash occurred near the surface of the Earth along the rounded edge nor over any portion of the Earth as seen from the camera's perspective. The noise-creation filter activated by someone in authority was obvious and looked nothing like the real event. Again, these speckles of white (not flashes of light) occurred over the entire image, far off in space (where none of the real flashes occurred) and included the entire surface where Earth continents were visible."],"Object Flight Path":"Other","Summary":"Live footage from NASA over earth. Space above earth errupted in flashing lights.","Tags":"City"}