{"Source":"MUFON","Object Shape":"Other","Country":"Ireland","Log Number":"IE-10112010-0004","Date of the Event":"09/24/2010 10:00 UTC","City":"Dublin","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 12 other sightings in Dublin","There were no other sightings in Dublin on or around September 24th 2010"],"Object Flight Path":"Path then hovering","Viewing Distance":"Unknown","Latitude":"53.349214","Longitude":"-6.259384","Case Number":"25809","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=53.349214,+-6.259384(25809)&iwloc=A&hl=en\"> mufon case (25809) map </A>","Object Features":"Wings","Date Submitted":"10/11/2010 05:22 UTC","Summary":"A disc similar to the space station appeared and travelled in an east to west direction initialy. It dissapeared behind a cloud and then a delta winged aircraft appeared from behind the clouds","Region":"County Dublin","files":["/var/www/straped/mufon/html2text/25809.html.txt","/var/www/straped/mufon/org/25809.html"],"divs":["Sighting DetailsAt 10p.m G.M.T. I opened the back door of my house and stepped into the garden for fresh air. I happened to glance up at the sky and observed there was cumulus cloud visible as well as a clear starry sky bethween the clouds. I noticed what I first thought was a satelite or space station travelling in an east to west direction. It was circular in shape like a round ball and was roughly the size of a planet and it was hidden by cloud. Suddenly from behind the clouds a delta winged aircraft appeared. I know it was delta winged because I study different aircraft as a hobby and subscribe to aviation magazines regularly. It appeared to be at a great height and could possibly be at space station height. It was golden or yellow coloured and there were no lights visible and nor was there any sound whatsoever. It stopped briefly in the sky and I was looking directly up at it. It then spun around quickly in a counter clockwise direction a full three hundred and sixty degrees and then immediatelty spun in a clockwise direction. It then flew away at great speed the way it had come and dissapeared behind a clouds. It appeared to bounce in the sky. It was the strangneness of the movement that I found most amazing and I dont know of any aircraft or aeroplane manufactured in this world that could move like this. It lasted approximately forty-five seconds. As I didnt have a video camera or anything else with me I have no visual evidence unfortunately. I found the whole experience amazing and I feel it is hugely important to report this. What I found most amazing was the movement of the craft. My most immediate reaction was to tell the person I share a house with of my experience and I have also told some work colleagues and family members."],"Disposition":"Unresolved"}