{"Source":"MUFON","Log Number":"","Latitude":"30.5427","Object Flight Path":"Straight-line path","Case Number":"2580","Longitude":"-97.54667","Region":"Texas","Object Shape":"Other","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/2580.html.txt","/var/www/straped/mufon/org/2580.html"],"Sighting Duration":"00:00:59","map":"<A HREF = \"http://maps.google.com/maps?q=30.5427,+-97.54667(2580)&iwloc=A&hl=en\"> mufon case (2580) map </A>","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","Disposition":"Unknown","Date Submitted":"09/30/2003 01:15 UTC","trends":["There have been no other sightings in Hutto","This sighting has never been favorited."],"Summary":"Saw an elongated object with multiple white lights","Date of the Event":"09/30/2003 01:15 UTC","Country":"United States","City":"Hutto","divs":["Sighting DetailsI was working my regular job as a locomotive engineer. I pulled in behindanother train at a Union Pacific Railroad siding called Hestes, Which is locatedbetween Hutto and Taylor, Texas. I was waiting for a train to pass in theopposite direction. I walked out the back door of the locomotive and stood onthe walkway, this location has little light pollution and I was star gazing. Atabout 115 A.M I noticed what I first thought was an aircraft, coming overheadfrom the Northeast. It soon became clear that this was nothing I had seenbefore. What I witnessed was an elongated object that looked rather like adomino, with the edges rounded off. It had rows of white lights on what appearedto be the bottom of the object. The object itself was black and there was aslight ripple effect as it moved below the stars. The white lights on the objectglowed steadily. There were no colored lights and no lights flashed on and off.I do not know if the object emitted any sound due to the noise from thelocomtive which was idleing. It would be very hard for me to judge its speed butit had to be moving very fast as it only took 10 to 12 seconds for it to movecompletely out of sight. I have been a member of MUFON for a while now, however,I have never reported a sighting before. We always imagine what a sighting mightbe like, but I never expected it to look like this."]}