{"Weather Factors":"Unknown","Region":"North Carolina","Case Number":"25801","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.924086,+-82.297771(25801)&iwloc=A&hl=en\"> mufon case (25801) map </A>","Longitude":"-82.297771","Summary":"small object circling randomly around larger, elongated, object","Tags":"City","Date of the Event":"10/09/2010 06:05 UTC","divs":["Sighting DetailsGetting ready to go for an afternoon run. Looked up while stretching an immediately noticed the two objects. At first I thought the larger object was a plane, but then I realized that I could see an elongated section, but no wings, no tail, no lights, no contrails, no doppler-shifted engine noise. Absolute clear daylight sky. Very high up. Elongated cylindrical object moving steadily from NW to SE. Smaller object moving randomly around the larger object: right to left, pause - hesitate, the circle left to right, pause - hesitate, then moved back to front as if examining the larger object. Smaller object continued this random movement for the duration that I could see the objects. No lights. No sounds. No contrails. Far away but appeared to have metallic color. Smaller object was making \"impossible\" direction changes and pausing. I wasn't frightened or alarmed. Just amazed that having spent years with my telescope looking at planets, nebulae, satellites, Iridium flares, comets, etc..I finally see what I can only describe as a UFO in broad daylight."],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Latitude":"35.924086","Source":"MUFON","City":"Burnsville","files":["/var/www/straped/mufon/html2text/25801.html.txt","/var/www/straped/mufon/org/25801.html"],"Disposition":"Insufficient Data","Date Submitted":"10/10/2010 09:11 UTC","Object Shape":"Bullet, Missile, Cylinder","Log Number":"US-10102010-0031","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Burnsville","There were no other sightings in Burnsville on or around October 9th 2010"]}