{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.741232,+-114.03159(25818)&iwloc=A&hl=en\"> mufon case (25818) map </A>","Longitude":"-114.03159","Source":"MUFON","Case Number":"25818","Log Number":"US-10112010-0013","Latitude":"40.741232","Weather Factors":"Unknown","City":"Wendover","Sighting Duration":"Undisclosed","Date Submitted":"10/11/2010 03:00 UTC","Summary":"It was just I light from were I was, but it moved up and down and side to side.","Object Shape":"Oval","Region":"Utah","Object Flight Path":"Stationary,Hovering then path","Disposition":"Unresolved","trends":["There has been one other sighting in Wendover","There were no other sightings in Wendover on or around October 8th 2010"],"Tags":"City","files":["/var/www/straped/mufon/html2text/25818.html.txt","/var/www/straped/mufon/org/25818.html"],"Viewing Distance":"Over One Mile","Date of the Event":"10/08/2010 12:00 UTC","divs":["Sighting DetailsI am a truck driver, I was driving home from Carlin Nv To Salt Lake City and stopped at the rest stop just east of wendover, Utah, at about 5:00 am, I always look at the stars when I stop just out of habit I saw a star that I had not seen before low in the southern sky, I whatched it and it started to move so I looked closer I watched for awhile it looked like it was trying to maintain it's position kind like wobbling! then I asked it to give me a sighn that it could hear me, it blinked off then on real bright then back to were it was originally, it moved up and down and side to side then the clouds rolled in and I lost sight of it around 5:30 I have friends that say they saw one that morning about 2:00 am flashing red,blue and green and white lights they watched it for awhile as well it was moving upand down. it was high in the southern sky, we think that it is the same one that we saw last night that looked like a planet. that night on 10-8-10 and 10-9-10 I drove up into the nearby mountains to get out of the clouds and lights of the city, I saw three of them in the northern sky far apart from one another, I whatched them as they moved around and blinked red, blue white and green lights, it was about 1:00-2:00 am I was listening to Ian Pundant on coast to coast am, I whatched them for about an hour and got tired and went home. the following night 10-10-10 I saw one over Salt Lake it was disquising it's self as a planet just like the one I saw Friday morning, then saw four more in the northern sky, I called my friend that said she and another friend saw one Friday morning, she and I went up to a place called little mountain just east of Salt Lake at the top of emigration canyon, a popular place for star gazers, we were amazed there must have been at least thirty to fouty of these things in all areas of the the sky they were all moving like they were trying to maintain there position, then ocasionally they would shoot off to another position. the one that was the most amazing was the one right above us that was just one white light, it was the one that looked like A planet, it was the closest to us, we looked at it with binoculars and could see windows on either side of it, oval in shape it was setting off center on a 45 degree angle it would move when we asked it to and it would change it's light intensity from time to time. we got tired and went home about 2:00 am I am suprised that not one thing was said on the news or radio, I think that they choose who they want to be revealed to, we were not scared in any way it was a feeling of kindness, I am writing to you not out of concern but out of curiosity I know you take this stuff seriously and am not going to criticise us as the media may do. I would like to have someone with the right equiptment and know how to look at this in a non judgmental way, if I had more powerful binoculars of a high intensity camera I could have seen alot more detail."],"Object Features":"Window(s)"}