{"Tags":"City","Source":"MUFON","Longitude":"-122.413956","City":"San Francisco","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25820.html.txt","/var/www/straped/mufon/org/25820.html"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.77817,+-122.413956(25820)&iwloc=A&hl=en\"> mufon case (25820) map </A>","Summary":"A cluster of lights - 3 red in the shape of a triangle with a third blue light moving around san francisco southern sky","Date of the Event":"10/11/2010 02:30 UTC","divs":["Sighting DetailsOur newborn daughter woke us up at approximately 2 am. I got out of bed to listen to her for a while wondering if I needed to intervene and go into her bedroom to comfort her. While I was waiting I went out onto the back porch of our 2nd story apartment (in a two flat building) as I often do when I can't sleep, it was about 2:20 or so at this point. We live in San Francisco where it is very hilly. I looked over the hill that borders our neighborhood to the southwest and I noticed 3 bright red lights (similar to LED lights) with a third blue light moving in a very strange way around the sky above the hill. I am a professional pilot and I know how conventional aircraft move through the sky. This was nothing like that and I knew it immediately. The three red lights were (from my perspective) in a triangle formation and were equidistant from each other and moving in unison. The third light was blue. It remained close to the red group (so close as to be considered all part of the same formation) only it seemed to move independently of the red lights. The movement of the whole group was more similar to an insect than any aircraft I've ever seen. It moved at random around the southwest sky for about 30 seconds. If I had to estimate the distance, I would say at least two miles and possibly much more depending on the actual size of the lights. From my perspective they were no bigger than pen lights but were very bright in that LED sort of way. After about 30 seconds they descended behind the hill and I could no longer see them. During the time they were visible I called to my wife through the window to open the shades and look out but she did not wake. I am, therefore, the only witness I know of. I am wondering if anybody else in the area reported the sighting."],"Date Submitted":"10/11/2010 06:36 UTC","Log Number":"US-10112010-0015","Country":"United States","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Features":"Unknown","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around October 11th 2010"],"Region":"California","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Case Number":"25820","Latitude":"37.77817","Object Shape":"Triangle, Other"}