{"Log Number":"US-10112010-0018","City":"Jasper","Region":"Georgia","Tags":"City","Weather Factors":"Unknown","Object Shape":"Circle","Viewing Distance":"Unknown","Date Submitted":"10/11/2010 08:56 UTC","Longitude":"-84.425212","Object Flight Path":"Undisclosed","divs":["Sighting Details It all started when i got my new phone, almost a year ago. I was taking pictures of clouds, and in one of them, there was a random white orb in the cloud. I didnt think anything of it at first, I just thought it looked cool, so I kept the picture. Then, one afternoon sometime in September 2010, I was laying down on my trampoline looking at the sky. A white orb was gliding, and zig-zagging across the sky. It came out of one cloud, and glided into the next one. I was rather curious, so i stayed outside and waited to see it again. When my mom came outside, I told her what I had seen, and I showed her the picture I took a when i first got my phone. She was stunned. She said for me to be careful. A week ago, we were having our fall break from school, every day of the break, I noticed an odd white light outside my window, in the sky. I just ignored it. Then last night at 3:30AM I woke up in the middle of the night and saw the light outside my window. I waited until it disappeared, and then I tried to go back to sleep. Out of no where, I hear this LOUD noise, that sounded like a car revving up to 100mph, I thought it was coming from the road, but it sounded too loud to be. Then it started making a warping noise. It was steady for about 15 seconds then it warped for another 15 seconds, like vrooooooooommmm, voom, voom, voom, voom, voom. It was one of the craziest things to ever happen to me. I was completely still, and tried not to make a noise, up until 4:00 then I ran to my moms room and told her what I heard. Im almost afraid to sleep now."],"files":["/var/www/straped/mufon/html2text/25823.html.txt","/var/www/straped/mufon/org/25823.html"],"Source":"MUFON","Country":"United States","Case Number":"25823","Sighting Duration":"00:00:30","map":"<A HREF = \"http://maps.google.com/maps?q=34.475039,+-84.425212(25823)&iwloc=A&hl=en\"> mufon case (25823) map </A>","Object Features":"Undisclosed","Summary":"a white sphere","trends":["There have been 6 other sightings in Jasper","There were no other sightings in Jasper on or around October 11th 2010"],"Latitude":"34.475039","Disposition":"Insufficient Data","Date of the Event":"10/11/2010 03:30 UTC"}