{"Log Number":"US-10112010-0022","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Country":"United States","Disposition":"Insufficient Data","Viewing Distance":"Over 1 Mile, Unknown","City":"Ephrata","Source":"MUFON","Object Shape":"Boomerang, Star-like","Tags":"City","Latitude":"40.179816","Summary":"Two bright star like lights flying slowly away from thunder storm","trends":["There have been 2 other sightings in Ephrata","There were no other sightings in Ephrata on or around October 11th 2010"],"Date of the Event":"10/11/2010 09:04 UTC","Case Number":"25827","Longitude":"-76.178839","divs":["Sighting DetailsI was driving west back to my school in PA on I-76 near Ephrata, Pa in Lancaster county (last exit I remember seeing around this time) at 9 at night. I was trying to watch some flashes of lightning that had been going in the sky as I was driving. There was barely anyone on the roads and it wasn't raining at this time. As I was looking up at the sky I noticed two bright lights that I first thought was an airplane. But after glancing up at for about a minute I noticed it there weren't any blinking identification lights. It was two lights very close together with what looked like an outer shape to it kind of like a V shape. Appeared to be below the cloud cover but not really close to the ground. It moved very slowly away from the lightning storm, North to South, looking as if it just went through the storm. When I first noticed it I thought it was strange that a plane would be flying through a lightning storm like that, which first caught my interest. Watched it for about ten minutes just flying slowly through the sky until it disappeared to the South. I know it was at 9:04pm because I called my girlfriend to tell her of what I was seeing. Location is approximate as Ephrata was the exit I remember seeing around that time. Wanted to know if anyone else saw this."],"Region":"Pennsylvania","Object Features":"Undisclosed","Date Submitted":"10/11/2010 11:12 UTC","files":["/var/www/straped/mufon/html2text/25827.html.txt","/var/www/straped/mufon/org/25827.html"],"Sighting Duration":"00:20:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.179816,+-76.178839(25827)&iwloc=A&hl=en\"> mufon case (25827) map </A>"}