{"files":["/var/www/straped/mufon/html2text/25825.html.txt","/var/www/straped/mufon/org/25825.html"],"Date of the Event":"10/10/2010 11:37 UTC","Latitude":"35.487666","Object Shape":"Disc, Oval","Object Features":"None","divs":["Sighting Detailsi was outside surveying for ufos watching the night sky for over an hour,when i witnessed a small object oval in shape,possibly disc shape with oval appearance.it was moving very fast i measured by gauging my thumbs close to 6 inches apart in view moving to stay insync with object to get idea of the distance to speed,and i know from a pilot friend that 3 inches on the ground can be over a mile in relation when you try to configureearth to sky sprrd ratios. the fact of the matter is 6 inches could under conditions range to over 2 miles yhis object was traveling atleast 6 inches in my scale per second thats moving!!!!!!! it was directly overhead at 12oclock above me,and it started out to appear yellow white to dim yellow to red as it looked to cool off,or powerdown its appearence? its trajectory was east to west in a degree of aprox southeast, to west, and it changed course: sort of curved as it changed direction. i witnessed it turning dark before i lost sight it looked as if it mayhave been picking up speed no tail,nor did it flameout or look like any metior or metiorite i have seen,matter of fact i would state that its changing speed and direction cancels that hypothisis.i have witnessed many ufo incidents,and i dont understand it all however i am researching values and conclude intelligence behind the sightings, not a blind or uncreatured flight without some sort of guidence involved......"],"Case Number":"25825","Tags":"City","Disposition":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Date Submitted":"10/11/2010 09:06 UTC","Source":"MUFON","trends":["There have been 3 other sightings in Shelbyville","There was one other sighting in Shelbyville on or around October 10th 2010"],"Viewing Distance":"Over One Mile","City":"Shelbyville","map":"<A HREF = \"http://maps.google.com/maps?q=35.487666,+-86.455282(25825)&iwloc=A&hl=en\"> mufon case (25825) map </A>","Summary":"extremely fast object whizzing thru sky changing colors and disapearing","Log Number":"US-10112010-0020","Longitude":"-86.455282","Country":"United States","Sighting Duration":"Undisclosed","Region":"Tennessee"}