{"Sighting Duration":"Undisclosed","Disposition":"Unknown","Latitude":"45.41028","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Summary":"Line of very bright shining lights (blue & red) traveling quickly across the sky back and forth.","Object Features":"Other","City":"Clackamas","Country":"United States","Region":"Oregon","files":["/var/www/straped/mufon/html2text/25828.html.txt","/var/www/straped/mufon/org/25828.html"],"Log Number":"US-10112010-0023","Object Flight Path":"Path with directional change","Date of the Event":"10/10/2010 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.41028,+-122.567469(25828)&iwloc=A&hl=en\"> mufon case (25828) map </A>","Date Submitted":"10/11/2010 11:21 UTC","Source":"MUFON","Object Shape":"Other","Case Number":"25828","trends":["There have been 3 other sightings in Clackamas","There were no other sightings in Clackamas on or around October 10th 2010"],"Longitude":"-122.567469","divs":["Sighting DetailsA bright shining object flying across the sky in an arc from the horizon up and around then back into the area it came from caught my eye. It looked relatively low-flying and moved like no man-made craft. It looked blue-ish silvery, and I have to stress how shiny the lights looked. It didn't really leave a tracer, but the lights did sort of blur together. I was a passenger. We had just gotten off I-205 and were headed toward Clackamas Town Center. I screamed what the HELL was that, the driver didn't see anything. Just as I started to explain what I'd seen, there it was again. This time he saw it. We watched as it flew across the sky, it looked like it came from the same general vicinity up and into the sky, then turned around, kind of looped around like a boomerang, and went back to where it came from, generally. As we watched it go through the air, the driver pointed out that it moved too fast to be a plane, and looked like it was too close to the ground. Then when it turned as it did and kind of looped through the air, we both were really taken aback. This second time it came through (or maybe it was a second one?) I got a better look at it. Maybe it changed angles or something, but I was more able to recognize it as a row of lights. Although the overall color just registered as bright white silvery shining blue (kind of like LED lights), I did think I may have seen a little red, but I can't be sure. It did not shoot through the air like an arrow, it moved maybe at a forty-five degree angle to the direction it was headed. Very shiny and bright. Very obviously there. It looked about an inch to two inches long, which made me feel it was very close to the ground. We were both flabberghasted."]}