{"map":"<A HREF = \"http://maps.google.com/maps?q=38.38157,+-81.815786(25824)&iwloc=A&hl=en\"> mufon case (25824) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-10112010-0019","Object Flight Path":"Straight-line path","Tags":"City","trends":["There have been 2 other sightings in St Albans","There were no other sightings in St Albans on or around October 11th 2010"],"Country":"United States","files":["/var/www/straped/mufon/html2text/25824.html.txt","/var/www/straped/mufon/org/25824.html"],"Date Submitted":"10/11/2010 09:06 UTC","Summary":"white starlike aircraft flashing approximately every 5 seconds","Case Number":"25824","Viewing Distance":"Unknown","divs":["Sighting DetailsI was letting dogs out and looking up at the sky as usual. I have been a MUFON member and always look up when I go out. After seeing several of the usual commercial jets that are almost constantly passing over from east to west (occasionally west to east at a different altitude), I noticed, while looking approximately north in the direction of the Big Dipper a flash of light about the size and brightness of the brightest stars. The flash occurred about every 5 seconds and took about 1 second to fade in and out. I could not see any other lights on the object like I can with the commercial jets. The object moved approximately from the handle of the Big Dipper where I first saw it towards the southeast. The flashing became irregular as it approached the usual flight path for commercial jets. I saw it flash once just before intersecting this usual path (it would have come very close to one of these passing jets if it continued along the same path that I last observed it following. At first I thought it was just another airplane because of it's apparent altitude and speed which I would estimate was the same as other aircraft I have observed. It moved at a constant speed in the same direction during the entire observation. I was quite calm while observing and tried to gather as much information as I could as this did not appear like other aircraft that I have observed. This is the second attempt to submit this observation. During the first, as I was about to submit, my computer suddenly and unexpectedly decided to shut down. I don't remember this happening before in this way. Please contact me if you need additional info."],"Weather Factors":"Unknown","Date of the Event":"10/11/2010 07:55 UTC","Longitude":"-81.815786","Region":"West Virginia","Source":"MUFON","Latitude":"38.38157","Object Shape":"Flash","City":"St Albans","Disposition":"Unknown"}