{"Region":"Indiana","Log Number":"US-10122010-0003","files":["/var/www/straped/mufon/html2text/25832.html.txt","/var/www/straped/mufon/more/25832_submitter_file1__ufo001.jpg","/var/www/straped/mufon/org/25832.html"],"Summary":"Very bright blue swaying object in the sky.","map":"<A HREF = \"http://maps.google.com/maps?q=41.353325,+-86.300318(25832)&iwloc=A&hl=en\"> mufon case (25832) map </A>","Object Features":"Undisclosed","Date Submitted":"10/12/2010 02:41 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was leaving Wal-Mart after midnight and was stopped at a stop sign leaving the parking lot facing east. I noticed a very bright blue triangular-shaped light moving very quickly in the sky above the parking lot across the street and thought it was strange. I realized that the lights to my dashboard in the car were blue, so I started to think they were lights from inside my car but then the object started to sway back and forth in very fluid motions and realized it couldn't be from inside my car since I was at a full stop. I knew it couldn't be an airplane because the lights were all completely blue and very bright, and the object moved in such a way that I knew it could not be a plane. I watched it for a few minutes trying to figure out just what it was but there were cars behind me, so I had to move I thought about going into the parking lot but was in the turn only lane, so I had to turn. As I turned toward the north, the lights were visible from my driver's side window and were still moving around, but seemed to do more hovering. When I started toward home, I could no longer see the lights."],"Tags":"City","Case Number":"25832","Weather Factors":"Unknown","City":"Plymouth","Viewing Distance":"Unknown","Date of the Event":"Unknown","trends":["There have been 6 other sightings in Plymouth","There were no other sightings in Plymouth on or around","This sighting has never been favorited.",""],"Source":"MUFON","Latitude":"41.353325","Object Flight Path":"Undisclosed","Country":"United States","Disposition":"Unknown","Object Shape":"Triangle","Longitude":"-86.300318"}