{"trends":["There have been 6 other sightings in Rocklin","There were no other sightings in Rocklin on or around October 6th 2003"],"Date of the Event":"10/06/2003 05:15 UTC","City":"Rocklin","Case Number":"2583","Sighting Duration":"00:30:00","Tags":"City","Latitude":"38.790734","Region":"California","Source":"MUFON","divs":["Sighting DetailsDue to disability I frequently wake up early am so am frequently awake in theearly AM. This morning was no different and I went outside to feed our outdoorkitty on the deck wrap around deck. We live in a two story home at elevation 2500 ft. I can clearly see Sacramento city lights from our deck on a clearnight, and last night was clear. I looked up and saw a red light in the sky atan elevation that a small aircraft would fly, going over our house headed forSacramento. I heard no sounds but figured it was a commuter light plane on itsway from GV airport. I fed the cat and looked up and saw the red light againabout a minute later hovering down in the Sacramento area, just a bright redround light. It was there too long to be an aircraft, and had no other lightsassociated with it. For about two minutes I watched this red light hovering inthe same spot when suddenly it moved upwards and was stationary again, howeverits light was pulsating, and continued to pulsate in this spot for about 60 moreseconds then flew off with great speed to my left and hovered there for a fewseconds pulsating again. The light then sped away and vanished in a S or Edirection. We have a tree-line in that direction and further view was obscured.We would be interested to know if anyone else reported any similar sightingsaround the same time of early morning."],"Weather Factors":"Unknown","Country":"United States","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=38.790734,+-121.235783(2583)&iwloc=A&hl=en\"> mufon case (2583) map </A>","Object Shape":"Undisclosed","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Object Features":"Undisclosed","Date Submitted":"10/06/2003 05:15 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/2583.html.txt","/var/www/straped/mufon/org/2583.html"],"Summary":"red ufo sighting over Sacramento valley, 100603 @","Longitude":"-121.235783"}