{"Case Number":"25846","Summary":"White cylindrical object flying erratically over my area","Country":"United States","files":["/var/www/straped/mufon/html2text/25846.html.txt","/var/www/straped/mufon/org/25846.html"],"Source":"MUFON","Log Number":"US-10122010-0014","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"California","Object Shape":"Cylinder","Date Submitted":"10/12/2010 10:56 UTC","Longitude":"-121.956627","Latitude":"36.988006","Object Features":"Window(s), Appendage(s)","Disposition":"Insufficient Data","divs":["Sighting DetailsI saw a white-colored cylindrical object flying slowly but somewhat erratically over my area this afternoon. Object appeared cylindrical in shape and had a diameter of 20 feet or less and a length of 50 feet or less. It was white. It had a trailing tale or tentacle like objects dangling from it. There was a band around the middle of it. It had windows. The object revolved about on its own axis head over tail every few seconds. It was about 3000 feet up or less and traveling from north to south over our area. I could see it clearly. I was standing at the back of my truck watching it for ten minutes. It was not flying fast at all, very leisurely. At first I thought it was a helium balloon floating off, but after observing it I can say it was too large for a child's ballon, and it was turning over and over. I went to my truck to get my camera, then lost sight of it. I do not think it was a satellite, it was too low. The rotation it was doing was strange to me. It had been higher up in the sky when I first spotted it. Actually, I think I saw it on my way to the store as well. So it was still around when I got out of the store, nearly a half-hour later."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.988006,+-121.956627(25846)&iwloc=A&hl=en\"> mufon case (25846) map </A>","Weather Factors":"Unknown","City":"Soquel","Object Flight Path":"Other","Date of the Event":"10/09/2010 01:15 UTC","trends":["There have been 2 other sightings in Soquel","There were no other sightings in Soquel on or around October 9th 2010"],"Sighting Duration":"Undisclosed"}