{"Disposition":"Unknown","Object Flight Path":"Hovering then path,Other","Object Features":"None","Sighting Duration":"00:06:00","Log Number":"US-10122010-0014","Viewing Distance":"Over One Mile","Date of the Event":"10/10/2010 07:51 UTC","Case Number":"25845","Weather Factors":"None","Longitude":"-85.133181","files":["/var/www/straped/mufon/html2text/25845.html.txt","/var/www/straped/mufon/org/25845.html"],"Region":"Indiana","Summary":"Several Red lights filled the eastern sky then disappeared","Country":"United States","Source":"MUFON","City":"Fort Wayne","map":"<A HREF = \"http://maps.google.com/maps?q=41.083143,+-85.133181(25845)&iwloc=A&hl=en\"> mufon case (25845) map </A>","Tags":"City","Latitude":"41.083143","Date Submitted":"10/12/2010 10:27 UTC","trends":["There have been 41 other sightings in Fort Wayne","There was one other sighting in Fort Wayne on or around October 10th 2010"],"divs":["Sighting DetailsI was in my living room on the computer. I had my children go outside to get their bikes out of the driveway. One of my children came running in, and told me \"hurry you have to see this, there is something weird in the sky\". I walked out and looked east to see several (15-20) bright red lights in the sky which continued to rise higher with no specific pattern. They did not move as one object would. The lights did not create any specific shape, and seemed each light had its own movement. The highest point had a few red lights and the rest seemed to follow those at the top. I ran to get a camera and could only find my cell phone, which I was able to capture a photo at the end of this unusual phenomenon. It only shows two lights. The others were disappearing so quickly I was barely able to get a photo. My children and one of their friends were witnesses. A gentleman at the end of our street was also standing in the middle of the road looking up in the same direction and I can only assume he witnessed this as well. I was very excited after this and quickly went to a neighbors to see if they had seen it. They did not however their daughter claimed to have seen the last few. I then went to our other neighbors who is an officer to find out if any reports had come in. The officer called and stated that dispatch had several reports of odd lights in the sky. Unfortunately when I tried to find the reports in the local police activity report, I was unable to find any specific report. He also had a friend contact a brother who is an air traffic controller, to verify there were no military exercises that evening. It was confirmed, there were none. We did see airplanes still flying around directly after. The lights were not blinking, they were solid and as bright as a star, there was only 1 star visible in that direction on this evening. During the sighting I was in utter awe, and confused. I have never seen anything like this in my entire life and desperately want some answers. After the incident I have not been able to stop asking people if they saw it. I need clarification for myself and my children. This took place between 7:51-7:55 pm. I will upload the photo later as I need to get cable to upload it from my phone. I wanted to post and hopefully get some much needed answers."],"Object Shape":"Fireball"}