{"Weather Factors":"Unknown","Tags":"City","Summary":"fast moving light","map":"<A HREF = \"http://maps.google.com/maps?q=41.312555,+-81.440113(2584)&iwloc=A&hl=en\"> mufon case (2584) map </A>","Date Submitted":"10/06/2003 06:17 UTC","files":["/var/www/straped/mufon/html2text/2584.html.txt","/var/www/straped/mufon/org/2584.html"],"Object Shape":"Undisclosed","trends":["There have been 5 other sightings in Twinsburg","There were no other sightings in Twinsburg on or around October 6th 2003"],"Case Number":"2584","Disposition":"Insufficient Data","Date of the Event":"10/06/2003 06:17 UTC","divs":["Sighting DetailsI was driving home from Cleveland, going E on I-480, listening to WNIR talkradio out of Akron, traveling perhaps 70 mph. At approx Exit 35, I noticed abright white light that reminded me of an airplane landing light coming at me.Being not too far from Cleve-Hopkins Airport, that was my first thought. Itseemed to hover in place then, faster than any airplane I have ever seen, theobject headed towards the SE at a very rapid clip- like watching a shootingstar. The object started out somewhat N in direction, and went SE. The almostfull moon was just to the right of the object, it went under the moon during itstravel. The sun was over the right side rear of my car. I lost sight of theobject behind trees in the distance. I was kinda tense after work, and viewingthis object made me forget about the bad day I had today-I am an auto mechanicin Cleveland. Nothing noted with my car- I drive a gas-electric Honda Insight. Inoted time, approx place and conditions- I am also a bigfoot researcher andParanormal Investigator. I have never seen any object move so fast, other than ashooting star at night, but this was still daylight- not a cloud in the sky.If possible, could I be kept informed of any findings due to this matter, suchas radar reports of air traffic in the area, or other witnesses to this eventThank you for providing an outlet.Jeff Weingart"],"City":"Twinsburg","Latitude":"41.312555","Source":"MUFON","Country":"United States","Viewing Distance":"Over One Mile","Region":"Ohio","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-81.440113","Sighting Duration":"00:00:59","Log Number":""}