{"Date of the Event":"09/26/2010 09:30 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Unknown","Source":"MUFON","Country":"United States","Case Number":"25841","Region":"Texas","trends":["There have been 3 other sightings in Dickinson","There were no other sightings in Dickinson on or around September 26th 2010"],"divs":["Sighting DetailsAround 9:30pm on September 26, 2010, I went outside to lock-up my car and close the garage door as I always do. I noticed a rather bright star just above the house across the street. While I was looking at this \"star\" I noticed a group of silverish oval craft flying from north to south between myself and this \"star.\" I watched until this formation moved out of sight (about 45sec to 1 minute). Then, I noticed the \"star\" turned and headed NNW and it was a helicopter. This helicopter had sat there and watched the crafts go by. Once they were gone, the helicopter flew away. In total disbelief, I went inside and got my wife. She came out to look with me. After she and I stood out there for a minute or two, we noticed a single oval craft moving along the exact same path as the first five, from north to south. I asked her if she saw it too. At first she wouldn't admit to seeing it, but I could tell she had. I asked her again, and she said she did, but she didn't know what to think of it. Neither of us could identify the crafts. As a biologist, I am well aware of the processes of evolution and I do admit that I see no reason why life could not exist on other planets. However, while I have always been a little intriged by UFOs, I thought most reports were either hoaxes or people looking for attention. I am now a believer and I have been looking for other people who saw the same thing that night. I really still don't know what to think of them. Was it from space? I do live about five minutes from NASA's Johnson Space Center. Could the crafts have been NASA tests? I just don't know."],"Summary":"Five oval craft flying in V formation followed a few minutes by single object","Date Submitted":"10/12/2010 01:27 UTC","Longitude":"-95.044517","Weather Factors":"None","Disposition":"IFO","Object Shape":"Oval, Triangle","Latitude":"29.462638","files":["/var/www/straped/mufon/html2text/25841.html.txt","/var/www/straped/mufon/org/25841.html"],"Tags":"City","City":"Dickinson","map":"<A HREF = \"http://maps.google.com/maps?q=29.462638,+-95.044517(25841)&iwloc=A&hl=en\"> mufon case (25841) map </A>","Log Number":"US-10122010-0012"}