{"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"10/13/2010 05:41 UTC","Tags":"City","Object Shape":"Boomerang, Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.257621,+-80.732529(25858)&iwloc=A&hl=en\"> mufon case (25858) map </A>","Latitude":"41.257621","divs":["Sighting DetailsAt a soccer game yesterday in Howland, our team was sitting on the field stretching. I went to stretch my quads and laid on my back with my leg under me. As I stared up, I noticed how clear the sky was, and I could see the moon perfectly. Then, as my eyes scanned the sky, I noticed an object that I jokingly pointed out to my friends as \"a Russian spy-plane!\" As I stared at this strange aircraft, I noticed that it was extremely high, and was white in color (against the blue sky), with the shape of a \"Z\". The closest shape above would be compared to a boomerang, but one side of the the object was facing the opposite direction of another point, giving the object a \"Z\"-like appearance. It was common knowledge that no regular aircraft took that shape or could fly at such a high altitude, moving so unbearably slow across the sky away from the moon (moving southwest). Also, the object made absolutely no audible noise, nor did it emit any type of visible exhaust. We discussed what it could be, while staring at this incredibly high, white, object. Right before our eyes, it began emitting a white light out of the western-most side of the object. The light did not flash, blink, or flicker; it was a constant white beam, but it was not bright, and was still barely noticeable. After about 3 minutes of staring at this object, it had vanished right before our eyes. My reactional thought process was \"there is no way...that could NOT have been a U.F.O.\", as I tried to think of logical explanations for the sudden complete disappearance of this object, in the cloudless sky. I truly believe, after thinking about it all night, that this MUST have been a U.F.O.... no aircraft known to man would hover at such a high altitude, moving incredibly slowly, and vanish instantly."],"Log Number":"US-10132010-0010","Region":"Ohio","Summary":"At a soccer game, saw slow moving, extremely high u.f.o.","files":["/var/www/straped/mufon/html2text/25858.html.txt","/var/www/straped/mufon/org/25858.html"],"Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Longitude":"-80.732529","City":"Howland","Sighting Duration":"00:03:00","trends":["There have been no other sightings in Howland","This sighting has never been favorited."],"Date of the Event":"10/12/2010 06:38 UTC","Case Number":"25858","Disposition":"IFO"}