{"trends":["There have been 579 other sightings in New York","There were 7 other sightings in New York on or around October 13th 2010"],"Object Flight Path":"Undisclosed","Object Shape":"Disc, Oval, Other","Longitude":"-73.998663","Source":"MUFON","Date of the Event":"10/13/2010 12:30 UTC","Latitude":"40.719473","Tags":"City","Region":"New York","Sighting Duration":"Undisclosed","City":"New York","Viewing Distance":"Unknown","Log Number":"US-10132010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=40.719473,+-73.998663(25857)&iwloc=A&hl=en\"> mufon case (25857) map </A>","Country":"United States","Summary":"what looked to be like stars moving around about 15 I saw myself","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/25857.html.txt","/var/www/straped/mufon/org/25857.html"],"Object Features":"Undisclosed","Date Submitted":"10/13/2010 04:12 UTC","Case Number":"25857","divs":["Sighting DetailsI went outside and there smalls groups of people looking up. I inquired about it, and someone pointed up at what looked to be like a star. It was a white dot. Open closer inspection there were a lot of them! I counted about 15+. Folks before me told me they saw more but they started to fade. Some of the \"white dots\" were completely still while others were quickly zooming around. Some came together to form clusters. They would come together then separate. There was a group of dots forming a triangle shape, while another group looked to form like orion's belt. Once again, at times, the dots would just stay still and fade in and out. The sky was completely clear and blue except for these star like objects. They seemed to be coming from all directions, but mostly coming from the West and North moving South and East. There was not a cloud in sight. People were making comments all around me, but one by one, they would quiet and just stare. The crowd got larger. A man with a camera started to take photos. When he zoomed in, they seemed to be yellow in flat but rounded shape. There was one that was rather large (close up?) that started to float up and started to fly higher and higher. At first look, it looked like a plastic bag because its shape kept changing so I thought nothing of it. As it floated higher and higher, it started to look like the other objects we were seeing so high in the sky. It was pale cream to yellow color. It was scary mostly because there was no particular flight pattern. They were going in strange directions. They would fade, I'm assuming because they were getting higher and higher and too small to see. They looked like flying stars."],"Disposition":"IFO"}