{"Latitude":"32.804075","Object Shape":"Cigar","Tags":"City","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around October 12th 2010"],"Object Flight Path":"Straight-line path","Summary":"Saw an elongated piece of white light traveling slowly across the skyline.","map":"<A HREF = \"http://maps.google.com/maps?q=32.804075,+-96.764793(25855)&iwloc=A&hl=en\"> mufon case (25855) map </A>","files":["/var/www/straped/mufon/html2text/25855.html.txt","/var/www/straped/mufon/org/25855.html"],"City":"Dallas","Longitude":"-96.764793","Object Features":"None","Case Number":"25855","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was walking to my car which was parked in a parking garage at a low rise complex when I happened to look up at the sky. I saw this slim elongated piece of white light traveling slowly across the skyline at quite a distance away. It just slowly glided, no change of direction or other unusual movements. It definitely was not a plane as no blinking lights usually seen when a plane is ascending or decending, no dark part as you would see with a plane - it was solid white bright light. It appeared to be elongated, but could have been the edge of a disc as seen from my vantage point. It was moving in a northern direction and seemed to be slightly decending. There is no airport in the direction the object was moving. I watched the object until it was out of sight. I have no photos. It was dusk, temperature about 75 degrees, no wind or moisture. It was a clear day. I can't explain what made me look up at the sky at that point, other than this happens to me frequently when something strange is occuring, such as strange cloud formations, flying objects, or other situation I should know about, ESP maybe. There was no noise emitting from the object, at least from where I was observing it. When i first noticed the object, I felt uneasy as I immediately realized it was probably not one of our earthly aircrafts. I was curious, so watched it as long as it was in my view. I was somewhat disturbed by seeing this object, and had trouble sleeping that night. I'm ok about it now. After viewing the object, I went to a grocery store in my area, and was discussing this incident with a checkout clerk. He told me he had also seen what he thought was a UFO in his neighborhood, but the description was different than the one I saw. Thanks for the opportunity to file this report. I appreciate the objectives of your organization. The more light shed on this phenomena, the better."],"Disposition":"Unknown","Region":"Texas","Weather Factors":"Unknown","Date of the Event":"10/12/2010 07:10 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"10/13/2010 11:19 UTC","Country":"United States","Log Number":"US-10132010-0006"}