{"Date of the Event":"06/07/1982 09:23 UTC","trends":["There have been 22 other sightings in Terre Haute","There were no other sightings in Terre Haute on or around June 7th 1982"],"City":"Terre Haute","Disposition":"Unknown","divs":["Sighting DetailsOn June 7th, 1982 at around 923 p.m Saturday night, I was taking girlfriend home near Hulman Airport. The house is on the east side of Terre Haute, Indiana and the airport is on the far east side of Terre Haute. I got out of my car and started looking at the stars becasue I am very interested in space and ufology. I thought to my self that it would be interesting if I saw a ufo. To my surprise I noticed a bright whirling object coming slowly from the east It was moving in a westerly direction. My girlfriend walked next to me and asked what is that I said I think it's a ufo Then the object stopped and hovered directly in front of us at tree top level. The object was about 30 to 50 feet away from us. For some strange reason we felt like the object was studying us as well as we were studying it. The object hovered for about 45 seconds and them started moving slowly to the west. Then all of a sudden it shot out of sight in about 2 seconds. The object was white in color, but it was whirling and made no noise at all unlike a heliocopter. I have been around planes all my life, but I have never observed a craft like this. When we saw the craft, my girlfriend and I both had goose bumps on our arms and had a feeling of helplessness, but elation that we had seen this object. I have always wanted to see a ufo and I got my chance. I must say that it has changed my life in some ways. I have alwaysbelieved that there wer other beings in the universe, but this confirmed my belief. I must say that I believe sightings may run in families. My father was flying his Beechcraft Bonanza near Hulman Airport the same airport that I was in close proximity to when I sighted my ufo, about 40 years ago and he came home stating the a bright object almost collided with his plane. He reported it to the tower, but I do not know what happened after that I did not report my sighting becuase I was afraid there would be repercussions if I reported it to the authorities. If I had to do it over again I would have reported it. My fathers brother was a farmer in Hume, IL and he was driving his tractor out in his field in the same year I encountered my ufo, in 1982, which I feel is strange. He told me tha"],"Sighting Duration":"00:05:00","Object Features":"Other","Longitude":"-87.411539","Source":"MUFON","Date Submitted":"06/07/1982 09:23 UTC","Case Number":"2585","Viewing Distance":"21-100 Feet","Object Shape":"Unknown","Summary":"Whirling Lights","map":"<A HREF = \"http://maps.google.com/maps?q=39.472303,+-87.411539(2585)&iwloc=A&hl=en\"> mufon case (2585) map </A>","Region":"Indiana","Tags":"City","files":["/var/www/straped/mufon/html2text/2585.html.txt","/var/www/straped/mufon/org/2585.html"],"Weather Factors":"Unknown","Country":"United States","Latitude":"39.472303","Object Flight Path":"Straight-line path","Log Number":""}