{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/25867.html.txt","/var/www/straped/mufon/org/25867.html"],"Date of the Event":"10/13/2010 03:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.89917,+-71.14889(25867)&iwloc=A&hl=en\"> mufon case (25867) map </A>","Weather Factors":"Unknown","Summary":"Several lighted objects in movement","Object Shape":"Sphere, Other","Source":"MUFON","Longitude":"-71.14889","Log Number":"US-10132010-0019","divs":["Sighting DetailsI was woken from sleep at approximately 0245 local time. I got up and drank some water and went back to bed, but was very restless and got up again and looked out the windows of our house which face the western sky, which includes Mount Chocorua. Initially I witnesses several lighted objects to the South of Mount Chocorua in relation to my viewing position that moved erratically within a small range of area, followed by what appeared to be a dim white firework pattern, followed by a point of light that initially moved very quickly to the South of Mount Chocoura, stopped and accelerated to what appeared a Southerly direction and then climbed from a it's horizontal movement to a 60-70 degree angle to horizontal stopping at a position of approximately 30-35 degrees of angle from my perspective. Subsequently, another lighted object which appeared to change color, moved into a position in close proximity to the aforementioned object. Both objects appeared to 'dance' and moved to and from each other with smooth but quick acceleration and stops. Eventually, the colored object moved from the the Southwest to Northeast, which was very quickly followed by the point of light which accelerated to a 8 o'clock position to the colored object, stopped and backed off just as quickly, followed by an acceleration back towards the colored object and began to once again dance around the colored object. Both objects continued to move towards the Northeast over the top of the house and out of my line of sight."],"Sighting Duration":"Undisclosed","Region":"New Hampshire","trends":["There have been no other sightings in Madison","This sighting has never been favorited."],"Viewing Distance":"Unknown","Country":"United States","Date Submitted":"10/13/2010 11:00 UTC","Case Number":"25867","Object Features":"None","Latitude":"43.89917","Tags":"City","City":"Madison","Object Flight Path":"Other"}