{"Log Number":"US-10132010-0013","Latitude":"39.968088","Longitude":"-76.725475","Date of the Event":"07/24/1977 12:00 UTC","Country":"United States","Date Submitted":"10/13/2010 07:39 UTC","City":"York","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around July 24th 1977"],"Summary":"Was walking dog and UFO flew in from distance and hovered above me 5 minutes","Disposition":"Insufficient Data","Object Shape":"Disc","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI never reported this event, but now that I've been to my first UFO meeting, I feel obligated to finally report this. It was 1977 at dusk, around 7 PM, during the Summer. I was walking my dog on a leash and I was barefoot and wearing a summer teeshirt and shorts. I was 15 yrs old at the time. This was in York, PA in Springettsbury Township. I was walking on a parallel street to S. Marshall Street. On my left were houses, on my left a church and then the main highway. I happened to glance up at the sky at a distance and I saw a faint object. As it very quickly flew towards me it got larger and larger. Then it was hovering right along side me just above the church parking lot. It was mammoth size. It was a silver disc shape. There was a dome at the top and then in the middle were red blinking lights circling around the disc. Then below the red lights was the silver disc part that came out. I noticed a Hmmming noise and I looked down at my schnauzer and he was looking up at it with his ears perked back. That's how I knew I wasn't imagining it. He was hearing the humming noise too. The humming noise and the red lights going around the disc were the most unusual features about it. I couldn't figure out why it was just hovering in that spot. After about 5 minutes, it then went up quickly about 100 feet and then it started going back towards the location from where it came from. As it flew away it got faster and faster to the point where it looked like it was dissipating. Planes never look like they're disintegrating from going to fast. That was my experience."],"Object Features":"Dome, Window(s)","Region":"Pennsylvania","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.968088,+-76.725475(25861)&iwloc=A&hl=en\"> mufon case (25861) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/25861.html.txt","/var/www/straped/mufon/org/25861.html"],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Source":"MUFON","Case Number":"25861"}