{"Date of the Event":"10/13/2010 02:45 UTC","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"10/13/2010 08:14 UTC","Summary":"Two bright objects so high it looked like a star crossed the sky about 2:45-3pm","Object Shape":"Star-like","divs":["sighting detailsi was sitting on our back patio soaking up some sun when i noticed a very bright object traveling slowly from the southwest to the northeast which is unusual for any jets since we are in an east to west jet corridor - it was going to cross the sun and i held my hand to block the sun and as it emerged i called my wife who was also outside and she also said it looked weird, unlike any jets that we see passing over and to the south of us each day. we watched for about another 30-45 seconds until it simply faded away. i continued sitting there and watching in the same general direction and another one as bright as the first one was coming from the west to east, crossed under the sun and shortly (probably 10 seconds) after crossing the sun it too faded. we have lived in this house for 24 years and observed many aircraft and as stated above, a main east west corridor is directly to the south and we often watch jets as we sit on the back porch, these two objects just seem so high i thought maybe it was the space station but checking online it does not appear to be crossing this area and then to see another one within 10 minutes going in a different direction, i simply do not know. i had no intention of reporting this until i saw a video of multiple or similar looking objects taken over new york city. their timeline was apparently earlier than ours by about 1 to 1 1\\2 hours."],"files":["/var/www/straped/mufon/html2text/25862.html.txt","/var/www/straped/mufon/org/25862.html"],"Source":"MUFON","Longitude":"-76.840659","Region":"Pennsylvania","Log Number":"US-10132010-0014","Viewing Distance":"Unknown","trends":["There has been one other sighting in Dover","There were no other sightings in Dover on or around October 13th 2010"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.009973,+-76.840659(25862)&iwloc=A&hl=en\"> mufon case (25862) map </A>","Latitude":"40.009973","Country":"United States","City":"Dover","Case Number":"25862","Object Features":"None","Disposition":"Unknown","Weather Factors":"None"}