{"Country":"United States","Object Features":"Unknown","Viewing Distance":"Unknown","Summary":"ufo seen over 2 week period and on 10/13/2010 multiple ufos","Region":"Washington","Source":"MUFON","Longitude":"-117.416097","Sighting Duration":"06:15:08","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.66665,+-117.416097(25877)&iwloc=A&hl=en\"> mufon case (25877) map </A>","Disposition":"Unknown","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around October 13th 2010"],"Case Number":"25877","Log Number":"US-10142010-0010","Object Shape":"Circle, Star-like, Unknown","Weather Factors":"None","City":"Spokane","Date of the Event":"10/13/2010 05:00 UTC","Latitude":"47.66665","files":["/var/www/straped/mufon/html2text/25877.html.txt","/var/www/straped/mufon/org/25877.html"],"divs":["sighting detailsufo was a bright light, i couldn't make out any shape but looking at it with binoculars it was perfectly round and looked dim. the ufo started out being bright and over about 30 seconds it faded and stayed that way. it was visible all night for most of the days and on the days when i would see it leave it would fade to black without moving erraticly. the ufos would slowly move across the sky over many hours while slowly making very sudden fast short movements like small super fast circles then stopping on a dime then darting very short distances and going back and forth and up and down and all directions. 10\\13\\2010 when i saw multiple ufos one was close and the rest were far and they were all spread out across the sky, they were all a white light except one, one was multi colored like flashing christmas tree lights the closer they were the brighter. my mom and dad also saw them but only my dad saw one moving erratically, they don't have that good of eye sight. i took me several days before i decided they couldn't be man made crafts. two times on 10\\13\\2010 i tried filming the closest ufo but as soon as i would turn on the camera it would stop moving and just looked like a really close bright light so i didn't bother posting it on here."],"Object Flight Path":"Path with directional change,Path then hovering","Date Submitted":"10/14/2010 05:41 UTC"}