{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.823582,+-85.758364(25879)&iwloc=A&hl=en\"> mufon case (25879) map </A>","Log Number":"US-10142010-0012","Tags":"City","Object Shape":"Star-like","Case Number":"25879","files":["/var/www/straped/mufon/html2text/25879.html.txt","/var/www/straped/mufon/org/25879.html"],"Longitude":"-85.758364","Region":"Alabama","Sighting Duration":"00:00:07","Object Features":"Unknown","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Jacksonville","There were 2 other sightings in Jacksonville on or around September 30th 2010"],"Date of the Event":"09/30/2010 07:35 UTC","divs":["Sighting Details I was outside of my house with my kids when I noticed a falling star, so I decided to stay out there to see if I could see anymore. At around 7:35pm, I saw what I thought was a faint star at first, but as I watched it, I saw that it was traveling at a very fast speed. I thought maybe it could be another shooting star, but it traveled straight instead of arching as most shooting stars. It also did not leave any kind of trail. The speed of it was incredible,going at least 3 to 4 times faster than the fastest airplane I've ever seen. But the oddest thing was when it was nearly out of my sight, without slowing down, it made a sharp turn then just vanished. I first saw it looking toward the southwest sky. It was traveling from the west to the east. I couldn't tell the shape of it. It looked exactly like a faint star in both color and size. I was so excited about seeing it so I stayed outside for another hour but didn't see anything else. But I did go back outside the next night and witnessed something simular. On Friday,October 1,2010 at around the same time, I again saw the faint star-like object. This time it was traveling at the same pace as an airplane, or maybe a bit slower. It was a bit brighter and bigger this time and going in the same direction as the night before. As I watched it,it remained going perfectly straight. This time however,as it got closer to my line of sight, something happend. It grew and got very bright and bigger for about 4 seconds,then went back to the normal size. This really frightend me. I don't know if the craft actually grew bigger or if it happend to turn on a bright light. I don't know what these objects were, but I've never seen anything like it. I've been paying close attention to the skies ever since I saw a UFO back in March that I reported to Mufon."],"City":"Jacksonville","Summary":"I saw a faint star-like object traveling at very fast rates of speed.","Date Submitted":"10/14/2010 09:42 UTC","Source":"MUFON","Disposition":"Unknown","Country":"United States","Latitude":"33.823582"}