{"Summary":"Four Jets flying in formation with Sphere in the West","City":"Shawnee","Disposition":"Unknown","Object Features":"Unknown","Tags":"City","Region":"Kansas","trends":["There have been 6 other sightings in Shawnee","There were no other sightings in Shawnee on or around October 8th 2010"],"Longitude":"-94.709886","Case Number":"25878","Object Flight Path":"Stationary","Latitude":"39.024378","map":"<A HREF = \"http://maps.google.com/maps?q=39.024378,+-94.709886(25878)&iwloc=A&hl=en\"> mufon case (25878) map </A>","Date Submitted":"10/14/2010 09:22 UTC","Date of the Event":"10/08/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/25878.html.txt","/var/www/straped/mufon/org/25878.html"],"divs":["Sighting DetailsWhile coming home from work, as I turned onto Shawnee Mission Parkway, there were four jets that were flying in formation. They were not flying fast and they were really low, which is what first caught my attention. It seemed unusual to see four planes flying in formation over Shawnee, Kansas, and even more unusual that they initially were not flying fast. They were flying toward the west. When I got onto Shawnee Mission Parkway heading west, there was a bright \"sphere\" in the west that then caught my attention. It appeared to be several miles away and at about a 30 to 45 degree angle off the horizon. It did not appear to be moving in either a north or south direction. It clearly was not moving in an easterly direction because it did not get any closer. I kept trying to figure out what it was and to rationalize what it might have been. My thoughts were all over the place regarding what it might have been. As I got to Neiman Road, the jets were still flying slowly and were visible. They appeared to be slightly to the south of Shawnee Mission Parkway. By the time I reached Quivira Road, the jets were suddenly out of my sight no doubt in part because of my also having to keep an eye on the traffic. I don't know if they suddenly sped up or if I was just busier longer than I thought with paying attention to the traffic. The next thing that I noticed after I did not seek the jets were jet trails in the sky to both the north and the south of the object. When I arrived at my destination at Lackman and Shawnee Mission Parkway in Shawnee, the \"sphere\" was still clearly visible in the sky, but probably more at a 30 degree angle from the horizon than a 45 degree angle. I stood in the parking lot watching it for about five minutes and it did not appear to be moving. When I left the store, the object was still in the sky as I headed south on Lackman. By the time I got home, it was getting dark and the trees around my home prevented me from any further observation. I had a vaguely uneasy feeling because of the jets, their pattern of flying, and the \"sphere.\""],"Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Log Number":"US-10142010-0011","Sighting Duration":"Undisclosed","Country":"United States"}