{"Object Shape":"Star-like","Country":"United States","Source":"MUFON","Latitude":"35.094141","Object Flight Path":"Undisclosed","Tags":"City","City":"Albuquerque","Object Features":"Undisclosed","divs":["Sighting DetailsI was standing outside in the backyard, having a beer and smoking a cigarette. Just staring at the stars and constellations. Was almost done with my cigarette and was looking at a blue star just beneath Orion. The star was slightly above the lower peaks to the east of Albuquerque on the Sandias. It was just about level with the star that marks Orions right heel. I then noticed a bright star in the Orion constellation. When I looked I saw a bright orange-yellow star just below the center star on the belt. As I focused on the star, it was steadily bright for 2-3 seconds. Then it faded from view. It was as if someone had taken a dimmer switch and slowly just turned it off. It was completely stationary the entire time. It was there, where i new there shouldnt be a star, and then it just faded from view. I stood outside for at least an hour afterward staring at the eastern sky, and nothing else happened for the rest of the time i was out there. About 40 some minutes after, i saw 2 shooting stars about 5 mins apart. If what i saw was a shooting star it would have to have been coming directly at me, because it did not move at all. The object i saw was much brighter than any shooting star Ive ever seen, and it was stationary. I was curious about it the moment I saw it, and when it started to fade from view I was filled with such awe and bewilderment that I dont believe it was a shooting star. Ive been studying constellations since a very young age. Ive been a stargazer for most of my life and Ive never seen, experienced, or felt anything like that before."],"Case Number":"25873","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Summary":"Bright star that faded from view","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/25873.html.txt","/var/www/straped/mufon/org/25873.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.094141,+-106.644857(25873)&iwloc=A&hl=en\"> mufon case (25873) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-10142010-0006","Date of the Event":"10/08/2010 03:30 UTC","Longitude":"-106.644857","Date Submitted":"10/14/2010 01:15 UTC","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around October 8th 2010"]}