{"divs":["Sighting DetailsWhile on the phone, I witnessed my first ever UFO at 8:40 PM in Grandview, MO on October 13th. The V- shaped aircraft was flying low. (1000 ft at the most. app. 750 ft) It seemed to be smoothly gliding like a B-2 stealth bomber. It was flying slow (200 MPH app.) It had large low glowing lights emitting a warm, not shiny, light. It had no tail, cockpit, or visible engines. Just a thin black V. Ive seen B-2 stealth bombers. I live an hour from Whitemans airforce base. I looked up a F-117. Not even close. Although it made no sound at all it was not a stealth bomber. Just a V. I noticed it because it was fairly large. App. 100 yards across. It flew strait Northwest to Southeast. I lost sight of the object behind a trees leaves from my balcony. The first thing I said while I was on the phone was, \"I just saw my first UFO...dang... what is that? I hung up and tried to look up any V shaped aircraft on the internet. The closest thing to it was the Phoenix lights incident. I have never seen lights underneath an aircraft like this before. Almost yellowish, these large circular lights gave me the feeling it was very advanced technology. Maybe electromagnetic capabilities. I would understand if the government wanted to keep this thing secret. It looked like nothing I had ever seen before. There is a new nuclear installation being built in South Kansas City at the old Richards Gebaur airport."],"Region":"Missouri","Tags":"City","City":"Grandview","Summary":"V shaped with around 5 big low glowing lights underneath. Flying low and slow.","Object Shape":"Other","trends":["There have been 4 other sightings in Grandview","There were no other sightings in Grandview on or around October 13th 2010"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.885841,+-94.53301(25885)&iwloc=A&hl=en\"> mufon case (25885) map </A>","Object Flight Path":"Straight-line path","Disposition":"Unknown","Log Number":"US-10142010-0018","Case Number":"25885","Date Submitted":"10/14/2010 01:06 UTC","Date of the Event":"10/13/2010 08:41 UTC","Sighting Duration":"00:00:10","Longitude":"-94.53301","Latitude":"38.885841","Source":"MUFON","Object Features":"Wings, Other","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25885.html.txt","/var/www/straped/mufon/org/25885.html"]}