{"Log Number":"US-10142010-0014","map":"<A HREF = \"http://maps.google.com/maps?q=33.819892,+-85.757814(25881)&iwloc=A&hl=en\"> mufon case (25881) map </A>","Weather Factors":"None","divs":["Sighting Details My 6 year old daughter and I were outside walking when we saw a shooting star. We decided to sit outside to see if we could see anymore. Then at 7:35pm, I noticed what I at first thought was a faint star. It seemed to be moving and as I watched, it picked up alot of speed. It was going at least 3 to 4 times faster than the fastest airplane I've seen. My first thought was that it was a shooting star, but those are usually alot brighter, they disappear very fast, and they arch with a trail behind them. This object was perfectly round and faint, with no trail of light, and it was traveling perfectly straight, from the west to the east. Right before it left my line of sight, it suddenly and without slowing down, turned right at a perfect angle, then vanished. There were no flashing lights and no sound. It looked exactly like a faint star in both size and color. I tried to come up with what it could have been,and if it had not made that sudden turn, I probably would have dismissed it as anything odd. The next night I witnessed something very simular at around the same time. I've decided to report it seperately because it was on a different date and there were a few differences."],"Viewing Distance":"Over One Mile","Case Number":"25881","City":"Jacksonville","Sighting Duration":"00:00:08","Object Flight Path":"Path with directional change","Country":"United States","Tags":"City","Longitude":"-85.757814","Date of the Event":"09/30/2010 07:35 UTC","trends":["There have been 4 other sightings in Jacksonville","There were 2 other sightings in Jacksonville on or around September 30th 2010"],"Source":"MUFON","Summary":"I saw a faint star-like object traveling at a very fast pace","Object Shape":"Star-like","Object Features":"Unknown","Date Submitted":"10/14/2010 10:28 UTC","Region":"Alabama","Latitude":"33.819892","files":["/var/www/straped/mufon/html2text/25881.html.txt","/var/www/straped/mufon/org/25881.html"],"Disposition":"Unknown"}