{"Object Shape":"Undisclosed","Date Submitted":"10/07/2003 07:30 UTC","Region":"Arizona","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around October 7th 2003"],"Sighting Duration":"00:30:00","Summary":"witnessed red glowing balls of light","Object Flight Path":"Stationary","divs":["Sighting Details1. I was at home. I live about 4mi. southeast from Luke Air Force Base. I was inmy back yard with my kids. 2. I am always sky watching. I saw one red glowingball of light south of the base. 3. I thought it was a ufo. I have seen thistype before around the base, around same time on night. I have seen then duringthe day also. I see things everyday but, do not report them. 4. I was excited. Igot in a better position to watch. 5. First, one ball of light lit up verybright south of base. About 10 min. later, as f-16s were flying over the basenorthward appeared to be on normal flight, to the northeast of the planes, oneby one 5 different balls of light lit up in a huge triangle formation lastingabout 10 sec. I called my husband out, they disappeared. As I was explaning whathappened, one by one 5 balls of light lit up south of 1st formation in a halfcircle over base. Jets were still flying below these lights didnt seem tonotice. The lights lit up very bright for about 5 sec. 3 of our children alsosaw the lights but, they were not very interested. I never saw the lights leave.They were stationary appeared out of the darkness. First as a small star-likelight then glowing magnified to about aspirin size from my viewpoint. 6. Thelights faded I cont. to watch for 45min. but, never saw anymore. From the 1stsighting at 730pm, the 1st formation was about 743pm then the 2nd formationabout 746pm."],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2588.html.txt","/var/www/straped/mufon/org/2588.html"],"City":"Glendale","Viewing Distance":"Over One Mile","Country":"United States","Log Number":"","Tags":"City","Source":"MUFON","Longitude":"-112.182637","Date of the Event":"10/07/2003 07:30 UTC","Weather Factors":"Unknown","Latitude":"33.547232","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.547232,+-112.182637(2588)&iwloc=A&hl=en\"> mufon case (2588) map </A>","Case Number":"2588"}