{"Region":"Virginia","Log Number":"US-10142010-0017","Object Flight Path":"Straight-line path","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/25884.html.txt","/var/www/straped/mufon/org/25884.html"],"Object Features":"None","Case Number":"25884","trends":["There have been no other sightings in Purcellville","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Source":"MUFON","Country":"United States","Summary":"floating 30 to 50 feet over field behind my house moving westward","Date of the Event":"10/13/2010 08:10 UTC","Tags":"City","Latitude":"39.136772","City":"Purcellville","divs":["Sighting DetailsMy wife and I were cleaning up after dinner. She was emptying the dishwasher, stood up and said \"What's that?\" pointing to a green light between the leyland cypress trees in our back yard. I saw the light, stepped over to the door and out onto the back porch. Dark night. I thought a plane was landing in the field, or maybe a helicopter. The light passed our trees and was behind the neighbor's house as another green light appeared between the trees. This green light had a red flashing light adjacent to it. I stepped off of the porch and hurried over to the neighbor's fence where there were no trees so I could get a better look. Looked at my blackberry, it was 8:10 PM. Something wasn't making sense - and I realized there was no sound. Nothing like a plane 100 yards away. Certainly nothing like a helicopter flying by 100 yards away. I watched both of the lights and it just didn't register. There was a long black box between the 2 sets of lights. Maybe 100 to 150 feet long. If it was an airplane after the front of it passed I shouldn't have been able to see the front lights but I still could. Later I wondered if the lights were on one side. Whatever it was it was moving rapidly. Within a minute it was out of sight. I emailed my neighbors to ask if anyone else had seen it but so far I can find no one that has."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.136772,+-77.714715(25884)&iwloc=A&hl=en\"> mufon case (25884) map </A>","Longitude":"-77.714715","Disposition":"Unknown","Date Submitted":"10/14/2010 12:30 UTC"}