{"Country":"United States","Region":"Alabama","Latitude":"33.815062","trends":["There have been 4 other sightings in Jacksonville","There were 2 other sightings in Jacksonville on or around October 1st 2010"],"Viewing Distance":"501 Feet - 1 Mile","Summary":"I saw a star-like object in the sky","Tags":"City","Sighting Duration":"00:01:45","divs":["Sighting Details On Sept.30th, I witnessed a strange object in the sky. So the next night which was October 1st, I went outside to see if I could see anything unusual again. My 6 year old daughter and I were watching the sky when I noticed a faint star-like object just as we had the night before. This time the object seemed a bit larger and a bit brighter,which made me believe it was closer to us than the previous night. Another difference was that this object was traveling really slow. It followed the same path of west to east as the previous night. It looked just like a star with no flashing lights and no sound. This time however, as it was a little past where we were standing, it all of a sudden grew bigger and brighter. It may have been some kind of light that it turned on. That scared me because if it was a light, it seemed to be turned in our direction. After about 10 seconds, the light started to fade back to the original star-like appearance and it continued on until I coundn't see it anymore. Now about 30 minutes later, I heard a helicopter and then I saw that it flew right over our house. As it was nearly directly overhead, it turned on a spotlight in the field and woods across our street. As soon as it got over this area, they turned the spotlight off. It circled our area 3 times. It may have had nothing to do with what I saw, but I thought it was worth mentioning."],"Object Flight Path":"Straight-line path","Disposition":"Unknown","Longitude":"-85.752754","map":"<A HREF = \"http://maps.google.com/maps?q=33.815062,+-85.752754(25882)&iwloc=A&hl=en\"> mufon case (25882) map </A>","Object Features":"Unknown","Case Number":"25882","files":["/var/www/straped/mufon/html2text/25882.html.txt","/var/www/straped/mufon/org/25882.html"],"Log Number":"US-10142010-0015","Date of the Event":"10/01/2010 07:40 UTC","Date Submitted":"10/14/2010 11:03 UTC","City":"Jacksonville","Object Shape":"Star-like","Source":"MUFON","Weather Factors":"None"}