{"Source":"MUFON","Case Number":"25892","Summary":"Red-orange, upside-down balloon-shaped object glowing from inside of bottom, out","Disposition":"Unknown","Object Flight Path":"Other","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around October 8th 2010"],"Date of the Event":"10/08/2010 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.494437,+-86.123643(25892)&iwloc=A&hl=en\"> mufon case (25892) map </A>","Latitude":"40.494437","Object Features":"Unknown","Country":"United States","Date Submitted":"10/14/2010 06:24 UTC","Tags":"City","Longitude":"-86.123643","files":["/var/www/straped/mufon/html2text/25892.html.txt","/var/www/straped/mufon/org/25892.html"],"Log Number":"US-10142010-0024","Viewing Distance":"21-100 Feet","Weather Factors":"Windy, Light","Region":"Indiana","City":"Kokomo","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn Friday, October 8th, at about 9:30 pm, I was at the intersection of Southway Blvd. and South Webster St. in Kokomo, Indiana waiting for the light to turn green and saw out of the corner of my eye, a red-orange glowing object in the sky. The object didn't seem far away enough to be a plane, yet it was close enough to me that I thought for sure it was a lit-up balloon of some sort, but after it began to hover not far from my vehicle, I could tell it was an upside down teardrop shaped object floating at an angle. The object was floating in a diagonal direction towards the northeastern sky. It wasn't an airplane (too slow and wrong shape). It looked like an upside-down balloon that was glowing red-orange from the inside-out. The glowing part of the object was on the bottom and gave it a 3D spherical shape. Then, I had to leave from the stoplight. I turned the car around, but the object was gone. On October 9th (the following night), about 10 or 11 pm, I saw the same thing around the same area. This time it was further up in the sky and appeared to be moving faster at an angle going north and then making a curve going east. I turned around & went around the block and couldn't find it anymore."],"Object Shape":"Egg, Fireball, Sphere, Teardrop, Other"}