{"Latitude":"39.047825","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Maryland","Object Shape":"Oval, Triangle","Object Flight Path":"Undisclosed","trends":[],"Date Submitted":"10/14/2010 07:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.047825,+-76.634401(25895)&iwloc=A&hl=en\"> mufon case (25895) map </A>","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/25895.html.txt","/var/www/straped/mufon/org/25895.html"],"Summary":"A bright starlike light in the sky captured my attention","Case Number":"25895","Weather Factors":"Unknown","Log Number":"US-10142010-0027","Tags":"City","City":"Undisclosed","divs":["Sighting DetailsIt was about 10 pm on Maryland's Eastern Shore. I was finished working for the evening and went out to my truck. It is exceptionally dark in this part of the country and even more so as I do not recall a moon last night. So there was an bright star which at first seemed stationary. It was far too bright to be anything I've ever seen in the sky, so I went in to get my binoculars. By the time I got it in sight I discovered it was moving, but rather slowly. It passed low, probably 1000 feet, directly above me. It was a large triangle with no tail red lights on one side green on the other, in the rear. The front had a huge spotlight that seemed to be able to shine down on the land. It was a warm light. It was relatively quiet for how close it was. It sounded mostly like wind sheer. Then it was out of sight. Then I looked back in the direction I had originally seen it and I noticed a red light orbiting, almost dancing around, much higher but in the same general part of the sky. Through the binoculars the second craft seemed oval or sphere shaped with rows of pulsing lights, blue, green and red. Then I saw the first object headed back in the vicinity of the second object so that they were both in view if the binoculars. The triangle craft passed the hovering craft. The hovering craft continued to nimble around almost as showing off. This was no helicopter. I assumed it was a training exercise on some new technology with NASA or something. I should have watched longer but was tired so went home to sleep."],"Longitude":"-76.634401","Viewing Distance":"Unknown","Country":"United States","Object Features":"Undisclosed","Date of the Event":"10/13/2010 12:00 UTC"}