{"Sighting Duration":"Undisclosed","Date of the Event":"10/13/2010 10:21 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-73.997033","City":"New York","Region":"New York","Date Submitted":"10/14/2010 10:20 UTC","Latitude":"40.718243","map":"<A HREF = \"http://maps.google.com/maps?q=40.718243,+-73.997033(25901)&iwloc=A&hl=en\"> mufon case (25901) map </A>","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25901.html.txt","/var/www/straped/mufon/org/25901.html"],"Object Shape":"Circle, Fireball, Oval, Star-like","Disposition":"Unknown","divs":["sighting detailsi heard of the events set to happen on october 13, 2010, and decided to do a google video search upon my return home from work. i found news footage of the sighting in ny and decided to dig deeper. around 10:15 pm i found a youtube video recording of a live webcam (http:\\\\www.earthcam.com\\usa\\newyork\\midtown\\?cam=empiresouth#) that captured the ufos flying over south manhattan. i clicked the link provided and waited. when my boyfriend and brother came home, i told them about the video and when i switched tabs to the live webcam, bright yellowish\\orange orbs appeared. they assumed various formations in non-conventional air traffic patterns. they changed brightness, size and position for nearly an hour. i don't have video capture software but did take screenshots via the \"grab\" application on my mac. it was certainly the most interesting thing i have ever seen. we were all baffled, but excited at what we were witnessing. i grew up a us air force brat and have seen many many flights while living on military installations throughout my dad's career ... but never anything like this! my screenshots are attached. i took 12 screenshots throughout the sighting, but will post the most significant three. below is the video that led me to the webcam. youtube video titled: nyc ufo's via webcam 2010\\10\\13 10:00 pm posted by user: areca81 http:\\\\www.youtube.com\\watch?v=lrtvlqpzkzm"],"trends":["There have been 579 other sightings in New York","There were 7 other sightings in New York on or around October 13th 2010","This sighting has never been favorited.",""],"Summary":"UFOs seen on live webcam!!","Case Number":"25901","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","Log Number":"US-10142010-0033","Tags":"City"}