{"Object Shape":"Blimp, Cylinder","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Source":"MUFON","Log Number":"US-10152010-0005","Longitude":"-91.809868","Case Number":"25909","map":"<A HREF = \"http://maps.google.com/maps?q=30.007106,+-91.809868(25909)&iwloc=A&hl=en\"> mufon case (25909) map </A>","Region":"Louisiana","divs":["Sighting Detailsi was driving from houston tx. on my way to houma la. while i was driving east on highway 90 i noticed a rectangular shaped cloud moving across the sky in a sort of jerking motion. the reason it caught my attention was because it was the only thing moving in the sky.iwatched the cloud until it went into another cloud bank.a few seconds later this object appeared. it looked like a long white tube it came towards the road,when it got close to the road it made an immediate 180 degree turn and stopped. it did not have the shape of a blimp.it looked to have the shape of a long cylinder,it had no means of steering,meaning nothin visible protruding from either end there was nothing such as a wheelhouse.the only thing i remember is that were a row of windows that ran the intire lenght of it. i unfortunatly did not have camera with me all of this took place as i was driving.at the time this happened i thought that vice president cheney was somewhere in louisiana hunting so i thought it could have been some sort of a protection for him. iknow other people must have seen the same thing i did.ihave never seen anything like this and i may never have this priveledge again thank you for your time."],"Object Flight Path":"Stationary,Path with directional change","Summary":"came from clouds and parked","City":"New Iberia","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25909.html.txt","/var/www/straped/mufon/org/25909.html"],"Object Features":"Window(s), Other","trends":["There have been 4 other sightings in New Iberia","There were no other sightings in New Iberia on or around November 30th 2006"],"Date Submitted":"10/15/2010 12:29 UTC","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"30.007106","Date of the Event":"11/30/2006 07:15 UTC","Country":"United States"}