{"Latitude":"28.542816","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around December 15th 1991"],"Country":"United States","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/25906.html.txt","/var/www/straped/mufon/org/25906.html"],"Tags":"City","Log Number":"US-10152010-0002","Region":"Florida","Date of the Event":"12/15/1991 12:00 UTC","Summary":"orange color with moving blue lights","Date Submitted":"10/15/2010 12:45 UTC","Case Number":"25906","Longitude":"-81.376376","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.542816,+-81.376376(25906)&iwloc=A&hl=en\"> mufon case (25906) map </A>","Object Flight Path":"Straight-line path","Source":"MUFON","divs":["Sighting DetailsI was at the fashion square mall around christmas time with my wife, my 4 month old son and my coworker. We were getting into our car to go home when i happened to look up and right above the parking garage i saw this orange color egg shaped object with these blue lights moving around it. At first i thought it was a remote control toy,being so close to the holiday. I realised that it wasnt because it was pretty sizable and moving slow. I called out to my wife and coworker but by the time they looked it was already gone. It wasnt even dark at the time so i always wondered if anyone else saw this thing. Anyway for years i thought i was going crazy because no one believed me. Then about 6-7 years later,my wife friend was over at our home and she said she was driving downtown orlando the other night. She said she saw a flying object as she was driving home. She couldnt believe it because no one on the road seem to notice it. I then told her about my encounter i had 6-7 years earlier,as i described the object i saw her jaw just hit the ground. It was the exact object i saw those many years ago."],"Sighting Duration":"Undisclosed","Object Shape":"Egg","Viewing Distance":"Unknown","City":"Orlando","Weather Factors":"Unknown"}