{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsJust stepped outside for a smoke. Right away, I saw 2 orange colored spherical objects flying side by side. The only sounds I could hear came from the compressor station down the road. At first sight, I would estimate the size of them to be about the size of a small baby pea, although I have no idea how far away from me they were. They were gliding slowly, like they were in no hurry, to the west of me. They were heading in a westerly direction. There are trees all around where I live and I had to move a few times to keep them from becoming obscured by the branches in the taller trees. I watched them as they continued to get smaller and farther away, then I ran inside to email my friend who saw one a few days ago. I would have called her but its late and I know her husband has to work in the morning and didnt want to wake him. She lives 80 miles west of me and they are headed right for her! I'm guessing she is already in bed, too, as if she were up and on the computer, my phone would have rung by now. After sending my initial report, I went back outside to see if I might get to see anything else. The only thing I saw this time was a plane flying in the exact same direction as the 2 orange objects. I watched the plane until it went out of sight. The plane was much higher in the sky than the 2 orange \"orbs\" as it never even got near the tops of the trees and I didnt have to move to keep sight of it. I would say that the plane was flying faster than the 2 objects I saw because it flew out of my range of vision faster than the the the 2 \"orbs\" did."],"Country":"United States","Log Number":"US-10152010-0001","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Date of the Event":"10/14/2010 11:16 UTC","Object Features":"Unknown","trends":["There have been 9 other sightings in Marshall","There were no other sightings in Marshall on or around October 14th 2010"],"Disposition":"IFO","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25905.html.txt","/var/www/straped/mufon/org/25905.html"],"Tags":"City","Weather Factors":"None","Region":"Texas","Object Flight Path":"Straight-line path","Longitude":"-94.364458","Case Number":"25905","map":"<A HREF = \"http://maps.google.com/maps?q=32.550561,+-94.364458(25905)&iwloc=A&hl=en\"> mufon case (25905) map </A>","Date Submitted":"10/15/2010 12:44 UTC","Summary":"2 orange objects flying low and slow and silent","City":"Marshall","Latitude":"32.550561"}