{"Sighting Duration":"Undisclosed","Longitude":"-80.473157","Object Flight Path":"Path with directional change","trends":["There have been 21 other sightings in Homestead","There were no other sightings in Homestead on or around October 15th 2010"],"Country":"United States","Weather Factors":"None","Log Number":"US-10152010-0012","Source":"MUFON","Viewing Distance":"Over One Mile","Date of the Event":"10/15/2010 08:12 UTC","Object Features":"Undisclosed","Case Number":"25916","Summary":"Star-like object was observed entering atmostphere hover and returned out of atmostphere over an area of no fly zone as per NRC and USAF.","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/25916.html.txt","/var/www/straped/mufon/org/25916.html"],"Object Shape":"Star-like","divs":["sighting detailsi reside in a small town in florida near a nuclear plant and an air reserve \\ airforce base called homestead. i am a retired army infantryman, and a state law enforcement officer. today at approximately 2012 hundred hours i came outside my home to have a realaxing cup of coffee on my back yard pool deck, when i glimps up onto the sky i noticed a star-like object moving from east to south west in an approximately 45 degree angle. as this object moved it was slowing down and a small tail started to form. it came so low that the object looked bigger as it was decending. at this point i said to my wife \"look honey is a shooting star\"; when she looked up she said honey shooting stars fall thats going up. at this point i looked up along with my wife and observed how the shooting star look alike object had no more the meteor look alike tail, instead it was a big ball of white light moving upward back into space. the event took approximately 10 to 12 seconds. i was stunt when i saw this event but i was even more concenrned when i heard 2 military jets motors been scrambled. i waited for a few more seconds and whent and picked up from my room a pair of 50x100 binaculars and followed the fly by area that the f-18 flew, and for my surprise they climbed from the east toward the same area and altitude the star-like object was seen by me and my wife. i have seen numerous aircrafts during my time in the military and civilian life but i have never seen anything that could possibly enter our atmostphere and return back out without leaving some kind of visible smoke trail or sound. i am concern about what is lurking in our aereospace as the no fly zone are both combine more than 30 miles. fifteen miles no fly zone at the nuclear plant at turkey point and another fifteen on the adjacent air reserve\\ air force base to their north. that includes our neighborhood which is approximately 7 miles away west of the base and 13 miles west north west of turkey point nuclear plant. i have made some calls but the air reserve base will not comment nor the nuclear plant would not answer their phone. anyone cares to provide any answer, please be my guess."],"map":"<A HREF = \"http://maps.google.com/maps?q=25.471342,+-80.473157(25916)&iwloc=A&hl=en\"> mufon case (25916) map </A>","Latitude":"25.471342","Tags":"City","Date Submitted":"10/15/2010 09:27 UTC","Region":"Florida","City":"Homestead"}