{"Log Number":"US-10152010-0010","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"None","Date Submitted":"10/15/2010 08:15 UTC","Date of the Event":"10/15/2010 01:45 UTC","Object Shape":"Sphere, Star-like","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around October 15th 2010"],"Summary":"While I was watching one UFO moving and stopping others would fly past at high speeds.","Latitude":"35.47692","Viewing Distance":"Over One Mile","Disposition":"Unknown","Longitude":"-97.511358","divs":["Sighting DetailsWhile I was on a smoke break at work I looked up in the sky and noticed what looked like a very bright star, but it was bright and sunny and about 1 in the afternoon. I watched as it moved slowly to the south and then stopped. That's when it really had my attention. It then started to move slowly west and it stopped again. It looked to be extremely high in altitude (above the altitude jets fly at.). While I was watching, another one came from the south at very high speed. I would say it was at least ten times faster than a military jet. The one from the south kept going until it was out of sight in the north. Shortly after that, the one I was originally watching faded until I couldn't see it anymore. (By the way, during this time I had ran inside and found the number to a local news station and told them to go outside and point their cameras up and told them what I was seeing.) I then went inside and went back to work. A little while later I came out and saw it again, brighter than before, and almost directly over me. It was still way up there. Shortly thereafter it took off to the north at high speed and split into 3 pieces and disappeared. I went home and turned on the news but they didn't have anything about it."],"Case Number":"25914","Region":"Oklahoma","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Oklahoma City","Country":"United States","files":["/var/www/straped/mufon/html2text/25914.html.txt","/var/www/straped/mufon/org/25914.html"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.47692,+-97.511358(25914)&iwloc=A&hl=en\"> mufon case (25914) map </A>"}