{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/25911.html.txt","/var/www/straped/mufon/org/25911.html"],"Object Flight Path":"Undisclosed","Summary":"long fireball without the fire that was large at the begining and tapered off toward the end.","Weather Factors":"None","Viewing Distance":"Unknown","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around October 14th 2010"],"Case Number":"25911","Date Submitted":"10/15/2010 02:10 UTC","Longitude":"-86.351136","Log Number":"US-10152010-0007","map":"<A HREF = \"http://maps.google.com/maps?q=40.758354,+-86.351136(25911)&iwloc=A&hl=en\"> mufon case (25911) map </A>","Latitude":"40.758354","Object Shape":"Fireball","Disposition":"Unknown","Object Features":"Undisclosed","Tags":"City","City":"Logansport","Region":"Indiana","Date of the Event":"10/14/2010 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting Detailswent out to the back yard noticed how pretty the sky was because between the ground and middle part of the sky was clear then it turned to line of flat cloud cover toward top of sky with pink color in the clouds. looked toward logansport and noticed that above the tree line of the woods across the field where it was clear sky was what I can only describe as a fireball without the fire. looked like the white trail that a jet leaves behind but only this was extremely large at the front and tappered of toward the back. I would say it was like a comet without fire. It was moving in a straight line toward the north. I first thought it was a jet as they leave the white trail behind them but this was way to large and was not leaving a trail behind it. I told my 13 year old daughter to look and she said I see it then walked away. I watched it for about 2 more minutes then went in to get my husband and camera. I went back outside and was in the house for about one minute or less and came back out and it was gone."]}