{"map":"<A HREF = \"http://maps.google.com/maps?q=39.106656,+-94.568637(25918)&iwloc=A&hl=en\"> mufon case (25918) map </A>","divs":["Sighting DetailsI want someone, anyone to explain to me what is flying around the top of the moon. When I took these photos which are exactly 7minutes 7seconds apart I noticed through my viewfinder a dark silhouette at the top of moon image. I kept zooming in and out and snapping photos of the moon and stars, and 7 minutes 7seconds later this thing is on the other side of the moon and at a different angle. Nobody wants to tell me whats going on. I have approximately 50 count um 50 strange photos and videos that I can't explain. I go out in my back yard and take photos at night and get these strange circular images that appear to have eyes or at least what looks like eyes. I'm tired, don't get much sleep and everyone in my family and at work thinks I'm crazy. maybe I am. Or maybe I'm just paranoid, at any rate I don't think that I can project my psychosis onto a photo or video. I don't think that Mufon can help me get to the bottom of this. But I am still trying to solicit their help. I could be reading more into these photos or videos. Hold on for a few minutes a military helicopter flyihg over my house. That never happen before! Copter flying just above my house pausing, now taking off heading west. I thought that just maybe they might be out to take a look. you see all the photos that I have submitted are real and so are the ones I haven't. Every since I was approached by one of these things I wanted to tell everyone that someone or something is here that hadn't revealed itself before. I have shown you all a few of these in hopes that you will realize that these creatures are indeed here. I have seen a few of them up close and they appear to be pure energy, but the energy is contained in a transparent sleeve or shell. I don't know what to make of them, so hopefully there is someone out there that has seen (truly seen) what I have and then figure out how to alert other. When you download these photo zoom in on the top left and top right and then ask yourself why is it there?"],"Case Number":"25918","Date Submitted":"10/15/2010 10:09 UTC","Object Shape":"Unknown","Latitude":"39.106656","files":["/var/www/straped/mufon/html2text/25918.html.txt","/var/www/straped/mufon/more/25918_submitter_file1__070.JPG","/var/www/straped/mufon/more/25918_submitter_file2__053.JPG","/var/www/straped/mufon/more/25918_submitter_file3__066.JPG","/var/www/straped/mufon/org/25918.html"],"Longitude":"-94.568637","Object Features":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Moon photos","City":"Kansas City","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around August 24th 2010","This sighting has never been favorited.",""],"Disposition":"Hoax","Region":"Missouri","Tags":"City","Date of the Event":"08/24/2010 02:39 UTC","Weather Factors":"Unknown","Log Number":"US-10152010-0014"}