{"Object Shape":"Cigar, Cylinder","Log Number":"US-10152010-0008","Object Features":"Other","Longitude":"-95.684968","Country":"United States","Source":"MUFON","Case Number":"25912","Object Flight Path":"Straight-line path","City":"Topeka","divs":["Sighting DetailsI was on a walk in my neighborhood last evening when I noticed a strange looking flying thing near the moon. It grabbed my attention because although it flew like an airplane, it didn't look or sound like one. It was becoming dark outside, but still light when I had the sighting. The sun might have just set or was about to. I was walking in a southerly direction and the moon was in front of me to my left. The object was flying from south to north but was also to my left, east of me. It was up in the air at approximately a 45 degree angle. It was approximately 2 inches long. It could have been an airplane that I witnessed. It flew in a straight trajectory like one. However, it didn't have wings that I could see. It didn't make noise. It didn't make a vapor trail. It didn't look like a plane. It looked like a flying horizontal tube. It lit up as a bright orange object, but that could have been the setting sun reflecting off of it. Hard to say. I watched it for a minute or so before it disappeared into the distance to the north of me. I tried to take a picture with my cell phone, but because my phone doesn't zoom, I couldn't really get a good shot. The way the light came off of it, it kind of looked like the object might have had three sections to it -- a front, a middle and a back section. I looked in the sky on my way home and noticed a few airplanes. Some were very distant and some were lower to the ground. NONE of them looked like the orange tube. The one airplane that I saw at approximately the same altitude definitely made a lot of noise. Seeing the object felt exciting, but I wish it could have been just a little closer to the ground so I could have had an even better view of it. I would have liked to have gotten a good photo."],"Weather Factors":"Unknown","Date of the Event":"10/14/2010 06:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.057544,+-95.684968(25912)&iwloc=A&hl=en\"> mufon case (25912) map </A>","Region":"Kansas","Sighting Duration":"Undisclosed","Summary":"Reflective Tube Like orange UFO in Topeka, KS","Date Submitted":"10/15/2010 02:58 UTC","Latitude":"39.057544","trends":["There have been 9 other sightings in Topeka","There were no other sightings in Topeka on or around October 14th 2010"],"Tags":"City","files":["/var/www/straped/mufon/html2text/25912.html.txt","/var/www/straped/mufon/org/25912.html"],"Disposition":"Unknown","Viewing Distance":"Unknown"}