{"Longitude":"-106.482221","City":"El Paso","Date Submitted":"10/15/2010 10:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.76088,+-106.482221(25920)&iwloc=A&hl=en\"> mufon case (25920) map </A>","Sighting Duration":"00:10:00","Country":"United States","files":["/var/www/straped/mufon/html2text/25920.html.txt","/var/www/straped/mufon/more/25920_submitter_file1__sketch.jpg","/var/www/straped/mufon/more/25920_submitter_file2__sketchcolor.jpg","/var/www/straped/mufon/org/25920.html"],"Object Flight Path":"Hovering then path,Path then hovering,Other","Latitude":"31.76088","Source":"MUFON","Tags":"City","Region":"Texas","Summary":"Pyramid-like structure of lights, slowly hovering and rotating","Disposition":"IFO","Weather Factors":"Unknown","Log Number":"US-10152010-0016","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around October 15th 2010","This sighting has never been favorited.",""],"Object Features":"Unknown","divs":["sighting detailsi was standing in the kitchen, clearing off some dishes, when my dad comes in from the side door of our house, urging us to come outside, thinking it was just an animal in the street, until my dad tells me to look to the sky, i look, and he starts explaining he saw something similar to a comet, before i have time to take it all in, i see for myself; three glowing lights hovering\\flying in unison. toward the western sky is where i saw it, it appeared to be flying west at first i thought it was a squad of fighter jets, because we live close to fort bliss, and that's commonplace around here, but soon my doubts were silenced when i saw the three lights starting to hover around a central point. i ran inside, to get my mom to come outside and see for herself, when i came back outside it had moved further into the horizon, and a fourth light had appeared above the triangle of lights in the center, forming a pyramid-like structure, and i had to climb onto my dad's unused car. i urged my parents to do the same so we could see it as well. we just stood there starting at it, it continued to move slowly to the west, constantly rotating as it moved. that was when my dad said he wished we had a camera, so i quickly jumped off the car and ran inside to grab my digital camera, i ran back outside, but realized i could get a better view from the roof, so i ran to out backyard and struggled to get our ladder set up, i dropped it once before i got help from my dad and we set it up, he climbed up first, and i followed, but when we got up there, it was gone. no trace of it was left, it just disappeared from the sky. it couldn't have flown further away, because at the speed it was already going, it would have been in our view for another 10-20 minutes. with it still fresh in my mind, i decided to sketch what i saw to the best of my ability, i went back inside and started to sketch what i saw, and notify any of my friends in the area through a social networking site to see if they had seen the same thing."],"Case Number":"25920","Date of the Event":"10/15/2010 07:00 UTC","Viewing Distance":"Over One Mile","Object Shape":"Triangle, Other"}