{"Sighting Duration":"Undisclosed","Region":"Louisiana","City":"Denham Springs","Summary":"Landing of Spacecraft","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Longitude":"-90.946232","Date Submitted":"10/16/2010 05:20 UTC","divs":["Sighting DetailsI have never believed in UFO's. I've always thought it was nonsense. The other night though,when I got home, becuase it was is the weekend, I decided to bring out my telescope and do a little star gazing. I had been observing for about probably 30 minutes or so when I noticed something in the sky that appeared to be an orange egg shaped object making no noice maybe about a quarter of a mile away. It was extremely low. It got closer and closer and I begin to freak out. I ran in my house and looked for my camera but could not find it. When I returned out, the object was actually hovering above my yard about 30 feet in the air. I have no idea how it was able to fly. It then proceeded to hover into my back yard and land. I thought maybe I should dial 911 but did not due to the fact that I may have not been believed. I ran into my backyard after debating whether I should approach the object or not. I went into the back and stood crouched down by a large bush for the next five minutes or so. The object did not move. It had no windows on it, but had two orange lights on it. One light on either side of the spacecraft. The object had four (metal Im assuming) legs that it had used to land on. It was about 8 feet tall and 5 feet wide. After watching it for 5 minutes it slowly lifted of the ground. I watched it take off and then go down in a nearby field. I assumed it had landed again, so I went back inside to search for my camera which I still could nto find so I got my cell phone out of my truck, but by the time I got to the field, the object was no where in sight. There is no evidence that the craft landed. It was just a very odd, surreal expirience. Im just very shocked."],"Object Features":"Undisclosed","Object Shape":"Egg","Latitude":"30.489566","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.489566,+-90.946232(25929)&iwloc=A&hl=en\"> mufon case (25929) map </A>","Log Number":"US-10162010-0006","Object Flight Path":"Undisclosed","Date of the Event":"10/16/2010 12:00 UTC","Disposition":"Unknown","Case Number":"25929","trends":["There have been 3 other sightings in Denham Springs","There were no other sightings in Denham Springs on or around October 16th 2010"],"files":["/var/www/straped/mufon/html2text/25929.html.txt","/var/www/straped/mufon/org/25929.html"],"Tags":"City"}