{"files":["/var/www/straped/mufon/html2text/25921.html.txt","/var/www/straped/mufon/org/25921.html"],"Country":"United States","Disposition":"Unknown","Object Features":"Unknown","trends":["There have been 8 other sightings in Fairfield","There were no other sightings in Fairfield on or around October 15th 2010"],"Object Flight Path":"Hovering then path","Date Submitted":"10/15/2010 11:21 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.734003,+-96.156268(25921)&iwloc=A&hl=en\"> mufon case (25921) map </A>","Viewing Distance":"Unknown","Region":"Texas","Sighting Duration":"Undisclosed","City":"Fairfield","Weather Factors":"Unknown","divs":["Sighting DetailsMissed a call on my phone from a friend who had just left our place a little less than an hour before. He called at exactly 7:07 PM Central time. I returned the call around 7:13 PM and he was super excited. He saw a picture that we took almost 2 years ago today of three strange objects in the western horizon and because of what just happened to him, he called me. He had been driving North back to the Dallas area and was just south of Corsicana on I-45 when he observed a huge object in the sky heading west...he said it was amazing. He called me to see if I could see it from here but I was not near the phone. When I called him back, he told me what he was seeing and I ran outside to see if I could see anything. The sun was setting in the West and I scanned the horizon, I suddenly spotted two metalic shiny thin shapes suspended above the horizon (almost exactly like the sighting we reported 2 years ago and took pictures). They were above the tree line but below the jet fly over area along I-45 or beyond (near hwy 84). They were in almost a V like formation. I told my friend that I was seeing two objects and he reported that he could see them too, even though he was now in Corsicana looking back toward the south west. I yelled for my fiance to come out of the house and grab the camera (we live on a farm)..he didn't hear me so I ran back in through the front door. he was in the kitchen so I told him to run out onto the back porch to see for himself...I grabbed my digital camera and ran out too. They were gone. I had hung up with my friend when I ran inside the house. I called him back and he couldn't see them any longer either. On interesting note: Two years ago when I snapped a picture of the three contrail shiny pencil objects suspended in the western sky (in almost the exact location), the objects that appeared in the picture looked like perfectly round metallic balls (not anything like we had seen with the naked eye)."],"Case Number":"25921","Tags":"City","Object Shape":"Other","Longitude":"-96.156268","Latitude":"31.734003","Log Number":"US-10152010-0017","Summary":"shiny reflective long objects (2) suspended on Western horizon, looked like solid contrails but solid","Source":"MUFON","Date of the Event":"10/15/2010 07:14 UTC"}