{"Disposition":"IFO","Case Number":"25939","Sighting Duration":"09:00:00","Region":"Texas","files":["/var/www/straped/mufon/html2text/25939.html.txt","/var/www/straped/mufon/org/25939.html"],"Object Shape":"Star-like","City":"La Porte","Summary":"Star-like objects rapidly changing different colors. Red, blue, green, white.","divs":["sighting detailsi live in la porte, tx. i have been seeing lights in the night sky at my apartment that seem at first glance to be a star. they don't appear every night. the difference is that these are not white like the majority of the stars that are out. they blink different colors very rapidly. the colors they keep changing to are red, green, blue, and white. they don't move so it's not a plane. it's very strange. most times it is just one. sometimes more than one. but the first time my girlfriend and i noticed it we were able to pick out four of them. i bought binoculars to get a closer look. i wish i had a strong telescope. i've called channel 11's tip line on two different occasions. they say no one else has called to report it. one lady i spoke to asked the meteorologist there who used to work for nasa and they just responded with it's nothing to worry about. they said it's probably a satellite. i'm skeptical about ufo's. i would like someone to be able to come out and get video or still pictures if possible and confirm what i'm seeing. i have had other guests at my home who have witnessed it and no one seems to know what these star-like objects are. from my apartment i can see them in the sw\\w direction. i've called relatives to look outside in houston but with all of the light in the city they aren't able to see them. have you seen or heard about these lights in the sky that flash different colors? i don't know where else to turn to about this but i would like answer. i'm glad i found this site so i can post what has happened and hopefully find an answer to what i'm seeing on certain nights."],"Weather Factors":"Does Not Apply","Log Number":"US-10172010-0005","Source":"MUFON","Longitude":"-95.011173","Viewing Distance":"Over One Mile","Date of the Event":"10/09/2010 09:00 UTC","trends":["There have been 5 other sightings in La Porte","There were no other sightings in La Porte on or around October 9th 2010"],"Latitude":"29.668754","Tags":"City","Country":"United States","Object Flight Path":"Stationary","Date Submitted":"10/17/2010 04:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.668754,+-95.011173(25939)&iwloc=A&hl=en\"> mufon case (25939) map </A>","Object Features":"None"}