{"Disposition":"Hoax","Object Shape":"Circle, Oval, Star-like, Other, Unknown","divs":["Sighting DetailsThursday October 14th, 2010, driving home from Des Peres to St. Louis, after interchanging from I-270 S to I-44 E, I rounded a bend after about a half-mile and saw what seemed like an extremely bright star low in the horizon, but a bit bigger than stars. I realized that it seemed to be slowly moving alongside westbound I-44 similar in height and distance off the highway as a traffic helicopter might be. I knew it wasn't a star but had never seen a light on a helicopter so bright before. It was moving much too slowly to be a plane, I thought it might be about 300' off the ground and 300' to the opposite side of the westbound lanes, I now slowed down and rolled my window down in the eastbound lanes. As it got close the light appeared to be more elliptical in shape, longer horizontally. I started to notice a small red light just to the right of the big white light as it got closer. I am driving on a 4 lane interstate highway, but I get into one of the rightmost lanes and slow down to about 50, glancing at it while I'm realizing I want to try to take note of what I see. When it was exactly perpendicular to me it definitely had three sets of three balls of light. Each set emitted a particular color. Two of the sets stayed the same color and never change intensity, one set white with green balls and the other red with red balls. The trailing set as regularly changing. They would go off for a second or two and come back on, usually red with red balls, but sometimes white with white balls. I couldn't keep looking as I passed it, and lost it that way. I saw it for a least a minute, and a good 15 seconds where the three sets of three balls were quite distinct, and fascinating. The balls where solid circles of their color, although the green circles in the front where very light green inside and light green at the circumference, but strangely emanating a white shimmering light. The green balls were a bit smaller and set further apart from the other sets. The other sets were solid circles emanating shimmering light. I was fascinated with the lighting configuration where it was similar to lights seen in the sky at night on conventional craft, but distinctly different. I am quite sure of these details as I have never seen anything like this in my 50 years, seeing lights in they sky, at least what I remember. I've never seen pictures of anything conventional like it at all. Anyone, please contact MUFON and reference this case if you can send them a picture of a craft that this could have been, with this lighting capability. I could not hear a helicopter, but there was highway noise, but it didn't appear to be far away, and was moving far too slow to be a plane. Please see the attached created image for the lighting configuration and pattern. When I had been on I-270 approaching the interchange, I did notice a bright star. It was a few times brighter than any other star I could see in the sky, about 30 degrees off the horizon but just a pinpoint of twinkling bright white light, not seeming to move. So, after the, whatever it was, flew by me I started to tremble uncontrollably a little, it was obviously something very different than usual, and was a bit disconcerting to me. \"It\" seemed like it was wanting my attention, that it wanted to make sure that I saw it, but maybe it was just coincidence. It was definitely going slower than the traffic on the westbound side of the road that it was on. There were others on the road and someone looking up on that side at that time could have seen even more detail than I did, but would have come up to it and passed by it. Based on how fast the traffic was passing it going in the same direction it was, it was going perhaps 30 mph. It would have been almost the length of my thumb in relative size if I had stuck it out while driving and glancing at it, but glancing at it more than several times while still driving safely. So, I exit I-44 about 5 minutes later at Laclede Sta. Rd. and take a few turns and about 2 minutes later I enter one end of the River Des Peres parkway at the Shrewsbury Metro Link station. As soon as I take a right on to it there almost straight ahead at treetop level I see a very bright white elliptical shimmering light, about the relative size of a thumbtack head. The parkway is a bit curvey and has some trees though sparse in places. The light seemed to be getting closer as I drove on, but I'd loose it it the tree tops. When I'd loose it in a group of trees it would sometimes come out the other side than I expected, and this happened a few times. By the time I had reached a longer straight stretch of road, it was just to my right, slowing moving right at about 15 high, still a a clearly elliptical shimmering white light but having moved off a distance, about half a thumbnail size from the half a thumb size when it was getting closer while I was winding through the parkway. I noticed that I had started to shake at that point, but I had calmed down when I saw it further away. As I was nearing the end of the straight, it passed behind a large tree in the distance. I expected it to come back out from the right having entered from the left, but a small red light with a while strobbing light came back out from the left where the elliptical light had entered. It continued at the same pace, like a helicopter about 1 mile away at 500' feet, moving left. Small white lights seemed to become apparent as it moved, similar to seeing the lights turned on in an airliner cabin close to the ground at night. I turned left onto Gravois from the parkway and glanced two more times to my right at the object as it seemed to be going in a northeast direction, moving diagonally away from me. I glanced two times and each time it seemed to strobe a red light that created a red \"halo\" around it. I lost site of it in the trees and buildings. Last, then went to the supermarket and was walking back out to my car about 8 minutes later, about 100 yards from where I'd last seen the object, if it was the same object I'd been seeing along the parkway anyway - a helicopter flew directly over my head, perhaps 200' feet, and was far quieter than the helicopters I hear land at the hospital facility where I work. The helicopter had one red steady light and a strobbing white light that seemed to be on top that was perhaps reflecting off the rotating rotors. The helicopter was in the process of slowing down, and was heading exactly towards where I'd seen the object leaving. The helicopter seemed to be slowing down as it continued on that direction when I got in my car and left for my house."],"Country":"United States","Region":"Missouri","Date Submitted":"10/17/2010 02:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.586216,+-90.398015(25938)&iwloc=A&hl=en\"> mufon case (25938) map </A>","trends":["There have been 3 other sightings in Kirkwood","There were no other sightings in Kirkwood on or around October 14th 2010","This sighting has never been favorited.",""],"Case Number":"25938","Object Flight Path":"Undisclosed","Latitude":"38.586216","files":["/var/www/straped/mufon/html2text/25938.html.txt","/var/www/straped/mufon/more/25938_submitter_file1__201010140810.JPG","/var/www/straped/mufon/org/25938.html"],"Summary":"Three sets of three circles pacing I-44 in MO, single craft?","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Kirkwood","Object Features":"Undisclosed","Longitude":"-90.398015","Log Number":"US-10172010-0004","Source":"MUFON","Date of the Event":"10/14/2010 10:08 UTC"}