{"City":"Columbus","Longitude":"-82.995674","Sighting Duration":"00:00:15","Tags":"City","Date of the Event":"10/16/2010 09:40 UTC","Country":"United States","Object Flight Path":"Stationary","Object Features":"Unknown","Region":"Ohio","Log Number":"US-10162010-0010","Object Shape":"Flash, Star-like","Case Number":"25934","files":["/var/www/straped/mufon/html2text/25934.html.txt","/var/www/straped/mufon/org/25934.html"],"Date Submitted":"10/16/2010 10:46 UTC","Disposition":"Insufficient Data","Latitude":"39.962566","Source":"MUFON","Summary":"Very bright white light with \"starburst\" pattern. Quickly dimmed out of sight.","divs":["sighting detailsi was sitting on the outside deck of my condo in the galloway area looking towards the north when an extremely bright, silver-white light caught my eye above the roofs of the opposing line of condos. it startled me a bit, as it hadn't been there a few moments before when i had been looking directly that way. at first my immediate thought was that it must be a small private jet which was flying low and heading due south (directly towards me) with it's bright take off\\landing light still on (though that would be odd as the airport is on the other side of town), and then realized that there were no blinking \"running lights\", no sound, and the object was not moving at all...just hovering there in one place. i sat there and watched it for about 10 seconds, a very brilliant silver-white light that gave off a \"starburst\" kind of pattern from it, and then it started to fade as if it were on a \"dimmer\" and over the next five seconds faded completely out of site. the whole thing only lasted about 15 seconds for me, but i was curious if anyone else in the area had seen it?"],"Weather Factors":"Unknown","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around October 16th 2010"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.962566,+-82.995674(25934)&iwloc=A&hl=en\"> mufon case (25934) map </A>"}