{"Date Submitted":"10/17/2010 01:29 UTC","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-10172010-0001","Object Flight Path":"Hovering then path,Straight-line path","Disposition":"Hoax","Date of the Event":"10/17/2010 10:00 UTC","Region":"Missouri","files":["/var/www/straped/mufon/html2text/25935.html.txt","/var/www/straped/mufon/org/25935.html"],"Longitude":"-93.284419","Latitude":"37.217997","Object Shape":"Circle, Fireball, Sphere","City":"Springfield","Source":"MUFON","Summary":"orange glowing circular orb- no noise","Viewing Distance":"501 Feet - 1 Mile, Unknown","Case Number":"25935","map":"<A HREF = \"http://maps.google.com/maps?q=37.217997,+-93.284419(25935)&iwloc=A&hl=en\"> mufon case (25935) map </A>","divs":["sighting detailsgoing down north part of springfield mo. at intersection of dale and kellet streets and going north of kellet towards the baptist university. multiple orange orbs flying across the sky. three going soutwest to northeast flight pattern and we filmed it. then there were three more coming across following the others by about two minutes between the pack. then a final three coming behind those as well a few minutes between. other people at the university in a pickup stopped and about 5 or 6 other people got out and we all watched these orbs fly over. they were about 1 or 2 thousand feet in the air. very close and visible. you could tell it was a spacecraft in the orb just a bit, but the orange glowed brightly and at times you could see there was something under it but not just for sure what. it was flying without any noise. so silent. the time was between 9 and 10 pm on saturday night october 17, 2010. they disappeared into the horizon and we followed the i-44 corrider going toward strafford mo just looking for them but nothing was found. has anyone else seem these this night? please let us know that we were not the only group who did. thanks. email me if any more questions can be answered. thanks *(wit's name deleted--cms\\sg."],"Country":"United States","trends":["There have been 31 other sightings in Springfield","There were no other sightings in Springfield on or around October 17th 2010"],"Weather Factors":"Unknown","Object Features":"Unknown"}