{"Object Flight Path":"Straight-line path","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-10172010-0006","Tags":"City","files":["/var/www/straped/mufon/html2text/25940.html.txt","/var/www/straped/mufon/org/25940.html"],"Summary":"bright flash then streaking purple light across sky. no sound and quick to dissipitate","Object Features":"Unknown","divs":["Sighting DetailsWent outside on porch to smoke a cigerette at 450am. just as i was finishing my cigerette there was a bright and quick flash in the sky overhead light purpleish in color. as i looked up a LONG and very quick light purple streak went away from me overhead. It darted from the beginning of my line of sight upwards and out of sight and the streak went from a wide streak to a narrow streak before dissappearing. the purple streak of light completely disappeared in less then a few seconds. there was absolutely no sound during the entire encounter. i see hundreds of airplanes go overhead every week and there was no way this was any type of known air vehicle. at first i thought it may have been a shooting star, but seeing as how the streak seemed to be going upwards i can rule that out. The streak totally disappeared in a couple seconds so it couldnt be a shooting star, asteroid, meteoroid, or any of the like because it was a solid streak that was here and gone in 30 seconds with no trace and no pieces left falling or breaking away from the streak. when i first saw it it scared me thinking it was an exploding airplane because of the initial flash. then all i could think of was what the hell was that. with no noise, the color, the speed, and the look of going upwards, left me to believe that it had to be a UFO. Not saying it was an alien craft, but it was absolutly \"Unidentifiable\"! when the streak was totally gone i ran downstairs and looked around and there was no trace of anything at all."],"Source":"MUFON","Object Shape":"Unknown","Date Submitted":"10/17/2010 05:30 UTC","Region":"Kentucky","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.00814,+-84.625251(25940)&iwloc=A&hl=en\"> mufon case (25940) map </A>","Weather Factors":"None","Latitude":"39.00814","trends":["There have been 5 other sightings in Florence","There were no other sightings in Florence on or around October 17th 2010"],"Date of the Event":"10/17/2010 04:55 UTC","City":"Florence","Longitude":"-84.625251","Case Number":"25940"}