{"Country":"United States","files":["/var/www/straped/mufon/html2text/25942.html.txt","/var/www/straped/mufon/org/25942.html"],"divs":["Sighting DetailsI was out with the family for an astronomy viewing event we scheduled with a company in Sedona. We were at a trail head just west of the town, in a desolate part so we could get a clear view of the sky. The gentlemen conducting the event was pointing over towards the eastern horizon when I just happened to look almost straight up. A solid moving light caught my eye. It was moving at a moderate pace in a SW direction. At first I thought it was a plane but it did not blink and it seemed to be at a higher than you would expect altitude for a plane. I then thought it must be a satellite. Even though it was much larger and brighter than any satellite I have ever seen. The size of the object was slightly larger than jupiter that night, and not as bright. Best described as a solid yellow Just as I was leaning over to tell me wife, the object made a slight deviation from its course and faded out of sight, it did not go out abruptly but rather kinda faded quickly. There was no trail of an kind. I watched for it to show up on its path but nothing did. The entire viewing lasted 15 seconds at the most. We continued with our Astronomy tour and I was looking for the object to show back up. I scanned the sky for the next 2 hours and saw nothing."],"Log Number":"US-10172010-0008","Disposition":"IFO","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around September 24th 2010"],"Longitude":"-111.75279","Object Features":"Unknown","City":"Sedona","Date Submitted":"10/17/2010 12:23 UTC","Case Number":"25942","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.87079,+-111.75279(25942)&iwloc=A&hl=en\"> mufon case (25942) map </A>","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Date of the Event":"09/24/2010 08:30 UTC","Latitude":"34.87079","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Arizona","Object Shape":"Circle, Sphere","Summary":"Solid bright light moving slowly then gradually fades from sight"}