{"Disposition":"Insufficient Data","City":"Chicago","Sighting Duration":"Undisclosed","Object Features":"None","Country":"United States","Date Submitted":"10/18/2010 12:45 UTC","Source":"MUFON","Log Number":"US-10182010-0011","Latitude":"41.887814","map":"<A HREF = \"http://maps.google.com/maps?q=41.887814,+-87.623018(25957)&iwloc=A&hl=en\"> mufon case (25957) map </A>","Region":"Illinois","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around October 13th 2010","This sighting has never been favorited.",""],"divs":["sighting detailsaproximately 8:35 pm, i had just returned home form the store with my daughter. i sent her upstrairs to send the dog down so i could walk her. as i walked out the back gate (facing due south), a commercial jet caught my eye, it had lights across the entire span that were red\\white\\blue. and it was rather low, i would estimate it to be no more than 1000 - 2000 feet. as i watched it, and it passed over me (it was moving north east, coming from the south east - likely taking off from midway airport), another thing caught my eye moving pretty low, and pretty fast from the north west. at first i thought it was birds flying in formation - but then i noticed that it was moving much too fast, and actually had a solid shape to it. the rear portion was actually blocking out the few stars you can see in chicago, and the sly itself with blackness. so it did appear to have mass. it was a shape much like that of a b-2 stealth, but more boomerang shaped. the object made no sound, had no lights, and left no comtrail, nothing really. i am guessing that the only reason i was able to see it was because of the moon and bright stars illuminating it. the moon i think was likely crescent or similar stage, but it was very clear that night so it was bright. the object was under the altitude of the passing airliner, and likely 1\\2 mile in the distance (where as the airliner flew directly over me). the object moved from the west, and out of view in the south east horizon, within 10 - 15 seconds. i did have my iphone in my hand as i noticed the object, and i was able to snap 1 photo - but all you can see is a faint \"\\\" shape in the top (a little over half vertical) left (around 1\\4 of the way left). you can kind of make out the top portion of the shape, but again it really a bad photo and like i said - the object did not give off it own light as far as i can tell. i have also included a second copy of the photo, which explains the flight path, direction, and points out the location of the object in the photo."],"Summary":"Non-Lit Boomerang shape - Made no noise - moved from West to South East - Very Low","Case Number":"25957","Longitude":"-87.623018","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/25957.html.txt","/var/www/straped/mufon/more/25957_submitter_file1__IMG_0310.JPG","/var/www/straped/mufon/more/25957_submitter_file2__ufo-photo-with-comments.jpg","/var/www/straped/mufon/org/25957.html"],"Object Shape":"Boomerang","Object Flight Path":"Straight-line path","Date of the Event":"10/13/2010 08:35 UTC"}