{"Date of the Event":"10/17/2010 12:00 UTC","Object Flight Path":"Unknown","Tags":"City","divs":["Sighting DetailsI have to admit that the recent UFO sightings have got pretty paranoid. Tonight though, I calmed down a bit and realized that it's all in my head. I decided maybe I should take a look at the sky outside anyways. My wife and I went out to deck in the back. We gazed at the stars for a while. There was nothing out of the ordinary. For a while we were just trying to find some constellations. Then, out of nowhere I see a shooting star in the sky. It had me pretty excited. I even made a wish. (HAHA) It moved quickly. I lost my sight of it from the trees. Eventually, my wife got cold so we went inside. I browsed the web for a while and listened to some music. Then I realized something about what I saw, it wasn't a shooting star at all. It was too close to us. The color was bright orange. Almost like fireball falling from the sky. It looked similar to videos on the web. I just realized that I should have seen a glimpse of it when it went behind the trees but i didn't. As if it just disappeared. It just seem weird now that I'm thinking about it. I didn't get a video or picture. Didn't think that I would see anything. Maybe it was really a shooting star? Maybe it'll happen again so I can decide. Bye."],"Region":"New Jersey","Object Features":"Unknown","Case Number":"25950","Viewing Distance":"Unknown","Disposition":"IFO","Country":"United States","Object Shape":"Fireball","Date Submitted":"10/18/2010 02:25 UTC","City":"Little Ferry","Sighting Duration":"Undisclosed","Log Number":"US-10182010-0004","map":"<A HREF = \"http://maps.google.com/maps?q=40.852878,+-74.042085(25950)&iwloc=A&hl=en\"> mufon case (25950) map </A>","files":["/var/www/straped/mufon/html2text/25950.html.txt","/var/www/straped/mufon/org/25950.html"],"trends":["There have been no other sightings in Little Ferry","This sighting has never been favorited."],"Weather Factors":"Unknown","Latitude":"40.852878","Summary":"Ball of fire...","Source":"MUFON","Longitude":"-74.042085"}