{"City":"Maumee","files":["/var/www/straped/mufon/html2text/25955.html.txt","/var/www/straped/mufon/org/25955.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"None","trends":["There has been one other sighting in Maumee","There were no other sightings in Maumee on or around October 17th 2010"],"Object Shape":"Boomerang, Chevron, Fireball, Triangle, Other","Region":"Ohio","Case Number":"25955","divs":["Sighting DetailsAround 8:30pm., outside in my backyard in the hottub,out of nowhere appeared a shape which looked triangular but only the lights were visable. The lights formed a triange, first 2 lights behind 3 more lights in perfect form like how bowling pins are set up. I couldn't see the body of the vehicle because it looked invisible but I absolutely seen what looked triangular even though nothing was at the front, I could see a pointed image. It's white lights were diffused almost as if a cloud was in front of it but there were no clouds. It flew quite low like when a plane flies towing a banner. It was very eerie, there was no sound and it looked as if it tipped to its side as if to see me on the ground. It flew in such a way that I can only describe it similar to a hummingbird, it was very fast and extremely large compared to the moon. I could compare it's size because the moon was in my visual with this vehicle. I could see it slow down and speed up. I couldn't believe what I had seen so I called my husband out to watch with me. I was freaked out because I just saw a UFO and it was like nothing I've ever seen before!. He stayed out a few minutes and went back inside. About ten minutes later I seen what looked like a shooting star and following that I saw my second sighting which looked like a fireball. It semed like a shooting star because it's path was similar to one but it looked strange. It was two circles hooked together and wobbling back and forth and moving like a shooting star. It had color to it not just white but red and white. I called my son out to watch with me and within a half hour we saw another sighting together. It's shape was different also but it followed the flight path of the first one. It appeared out of nowhere as if it came through a black hole. It was round in shape and had 3 distinct lighted parts inside which I thought looked round but each had jagged edges and my son described it as having holes in it. We were both freaking out and we called my husband back out to watch. Within 20 minutes all 3 of us saw another object which looked like a boomerang shape. It was invisible looking because we all agreed we could see through it. It was lit up but very different then the others. It's shape could also be what you include in in above descriptions as a chevron. We all believe we saw UFO'S!"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-83.650004","Latitude":"41.570929","Country":"United States","Log Number":"US-10182010-0009","Tags":"City","Disposition":"Unknown","Date Submitted":"10/18/2010 11:03 UTC","Viewing Distance":"Unknown","Object Features":"Patterned Surface, Wings","map":"<A HREF = \"http://maps.google.com/maps?q=41.570929,+-83.650004(25955)&iwloc=A&hl=en\"> mufon case (25955) map </A>","Summary":"4 sightings over 2 hr. time span--all different shapes-3 family members seen with me","Date of the Event":"10/17/2010 08:30 UTC"}