{"Source":"MUFON","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/25956.html.txt","/var/www/straped/mufon/org/25956.html"],"Case Number":"25956","Disposition":"IFO","Latitude":"40.129747","Tags":"City","Region":"Pennsylvania","Object Features":"Other","Country":"United States","City":"Norristown","Date Submitted":"10/18/2010 11:16 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Disc, Fireball, Oval","divs":["Sighting DetailsI was laying downin my bed and i naturally have a view out of my window that can see up in the night sky.. Out of nowhere i see this fireball round pulsating object come slowly down to my field of vision. Immediately, i tried to rationalize what it could be and it was like nothing i encountered. then the object stopped and held its position for about an hour and 30 to 45 minutes. I closely watched the object out of my room, and it would move from time to time, like zigzagging and slow moving, however it maintaned its position. I realized it was too close to be a star and that i never saw a star there at night, it felt out of place, plus it was too close to the ground, about the height of a helicopter would be in flight. I immediatley got my samsung vibrant smart phone and began trying to record it; however it would not show up when being recorded, the light wouldnt show up.So, then i switched to camera, and i got the object to show up on camera, so i focused in and took several shots. I was tired so went to bed thinking my head was playing games on me, however i felt like there was something they wanted me to know. The next day when looking at the pictures, i increased the magnification, and to my utter amazement, the object was a metallic disk, and it seemed that there was this weird energy that the camera picked up and its semetrical on each side of the photes.. its dots around the disk like object....Im willing to do anything it takes to get these photos analyzed, because i hope this is the smoking gun...."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.129747,+-75.334675(25956)&iwloc=A&hl=en\"> mufon case (25956) map </A>","Log Number":"US-10182010-0010","Longitude":"-75.334675","Summary":"The fireball like object came down and i took pictures as it hovered in place","Date of the Event":"10/17/2010 02:45 UTC","trends":["There have been 2 other sightings in Norristown","There were no other sightings in Norristown on or around October 17th 2010"]}