{"Viewing Distance":"Unknown","Log Number":"US-10182010-0012","Object Shape":"Teardrop","Region":"Indiana","Disposition":"Insufficient Data","City":"Lebanon","trends":["There have been 4 other sightings in Lebanon","There were no other sightings in Lebanon on or around October 9th 2010"],"Date Submitted":"10/18/2010 01:17 UTC","files":["/var/www/straped/mufon/html2text/25958.html.txt","/var/www/straped/mufon/org/25958.html"],"Source":"MUFON","Longitude":"-86.467368","map":"<A HREF = \"http://maps.google.com/maps?q=40.049954,+-86.467368(25958)&iwloc=A&hl=en\"> mufon case (25958) map </A>","Case Number":"25958","Latitude":"40.049954","divs":["Sighting Detailsok. my friend Craig and i had just dropped off our friends and we were going for a drive. we were heading south-east on lafayette ave. when we both saw a cluster of green and yellow lights rapidly swerve through the sky. we both imediatly knew that it wsnt a man-made object that we had just witnessed. we both felt sick to our stomach and our eyes kept tearing up even tohugh we wernt sad about anything that we were awhere of. it seemed so close to the ground that we went to look for it. after about 2 hours of finding and losing the lights (whitch were blue and purple by now) we were able to find the group of trees it had landed in. sadly we were not aloud to go out to it because it was on private property. also while we were searching, we kept seeing this black ford taurus. i think they were following us off and on. it was like they were making sure we didnt find anything. i think that the people in the taurus were in aliance with the government. i strongly believe that the government keeps extra-terestrials captive and away from the public eye."],"Date of the Event":"10/09/2010 12:00 UTC","Country":"United States","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Summary":"green and yellow lights. it was like 2 a.m. so i couldnt see much","Sighting Duration":"Undisclosed"}