{"Disposition":"Unknown","Summary":"A sphere like apparition appeared in the sky with pointed sides, almost eye shaped and soon disappeared.","Tags":"City","Log Number":"US-10182010-0019","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"None","Object Flight Path":"Stationary","Region":"New Jersey","Object Features":"Unknown","Date of the Event":"10/16/2010 10:40 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/25965.html.txt","/var/www/straped/mufon/org/25965.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn the night of October 16th, 2010 at approximately 10:30 pm I was driving down Dante avenue of Vineland, NJ with a friend. As we were driving down said road, I happened to look out of the passenger side window and survey the sky. As I was doing this, a large silvery white object appeared seemingly out of no where, at exactly the spot to which I was looking. At first, I was caught off guard and did not know what to make of such a thing. The whole encounter lasted about 5 seconds, during which time the Unidentified Flying Object stayed in its set position, and then disappeared into itself, leaving nothingness behind besides from the stars glistening in the sky. The object never moved while I was looking at it, but instead stayed in its exact positioning as I have stated above. It was almost eye shaped, with a domed top and bottom which met at the sides in points. It did not look as if it were too close, but it did not look that far away either. It wasnt a bright glow, not something that would have created a flash. But instead was a dull white silver glow. At first , I was in awe and shock as to what I was seeing.. because common sense told me that this is not something that I really should be seeing. Immediately I had the sense that this was NOT something from this planet, and is NOT something man made. After the object disappeared, and it disappeared by sucking into itself almost going away from the middle out, I turned to my friend and said \"I think I just saw a UFO\" to which she replied \"Shut up, you're buggin.\" But I know what I saw, and it was not something from this planet.. of that I am sure. This is my first close enounter with the First Kind."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.489417,+-75.016031(25965)&iwloc=A&hl=en\"> mufon case (25965) map </A>","Latitude":"39.489417","Object Shape":"Oval, Sphere","trends":["There have been 9 other sightings in Vineland","There were no other sightings in Vineland on or around October 16th 2010"],"Source":"MUFON","City":"Vineland","Case Number":"25965","Longitude":"-75.016031","Date Submitted":"10/18/2010 08:37 UTC"}