{"Source":"MUFON","divs":["Sighting DetailsMy wife, a friend and I were standing outside my camper at the Lake of the Ozarks at Deer Valley Campground. As we stood outside talking I noticed this object in the sky traveling to the East. It was teardrop shapped, silver, smooth, no sound, it seemed to be at an altitude of at least 10 to 15,000 feet. It was roating end for end like a helicopter with roter failure but was not desending and was traveling at a speed compariable to a jet at 20 to 30,000 feet. It was unique and I pointed it out to my wife and friend who both observed the object for approxiamely two or three minutes until it was out of site. While it was at approximately my 11 in the sky I told my wife and friend that I had binoculars in my truck that was approximatley 30 yards away and I went to retrieve them. By the time I returned the object was going out of site to the East over the Lake. I thought the object was a helicopter or plane in a sprial at first. However it was not loosing altitude. I then thought it could be a balloon, but discounted that when the rotations were consistent. We all agreed it was something none of us had ever observed before. I checked for reports of sighting or other news reports but found nothing. It was bugging me so I decided to report it through MUFON."],"Disposition":"Unknown","Case Number":"25962","Tags":"City","Object Shape":"Teardrop","Sighting Duration":"Undisclosed","Log Number":"US-10182010-0016","Object Features":"None","Region":"Missouri","files":["/var/www/straped/mufon/html2text/25962.html.txt","/var/www/straped/mufon/org/25962.html"],"Object Flight Path":"Straight-line path","City":"Sunrise Beach","Date Submitted":"10/18/2010 06:31 UTC","Date of the Event":"10/15/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.180344,+-92.777485(25962)&iwloc=A&hl=en\"> mufon case (25962) map </A>","Summary":"Silver teardrop, no wings, no tail rudder or elevators, no contrail, no sound at approximately 10 - 15KFt","trends":["There have been 2 other sightings in Sunrise Beach","There were no other sightings in Sunrise Beach on or around October 15th 2010"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-92.777485","Latitude":"38.180344","Country":"United States","Weather Factors":"None"}