{"Object Shape":"Circle, Star-like, Triangle","Viewing Distance":"Unknown","Region":"Louisiana","Source":"MUFON","Country":"United States","trends":["There have been 5 other sightings in Alexandria","There were no other sightings in Alexandria on or around October 18th 2010"],"Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsThis is my second sighting of this unexplainable object, the first sighting being on October 8th approximately at the same time. At about 7:20 PM I heard our dogs barking outside, and after several minutes I was prompted to see what was provoking them. So I stepped outside my front door, the dogs have stopped barking, and I didn't observe anything in particular they were interested in. The sky is very clear tonight, no clouds around, and I turn my head up and see three air planes flying over head in different directions. Since it was so clear, I walked around my little apartment to gaze in the direction where my boyfriend and I had seen the UFO on the 8th. The location of the first sighting is due south from my position and tonight it was clear, but just to the south-east I caught sight of the brilliant, awesomely bright orange star that seemed very similar to the one that had caught my attention 10 days ago. For almost a minute this object did nothing, no movement, no twinkling, just stationary, when all of a sudden it quickly began to ascend into the sky gaining altitude, then the orange bright light was shut off, it disappeared for a split-second and then the white and red blinking lights in the erratic pattern began bringing it back into view. It continued to ascend for only a few seconds more before starting off in a north-western path which this time, brought it directly in a flight path over my home. The object was triangular shaped, has only one red light with several white lights that blink in irregular patterns around the parimeter of the object. The solid part of the craft appeared to be medium to dark grey. This object makes no sound, leaves no trail and moves rapidly. It continued on the north-western path until it game to what appeared to be another bright star which was twinkling multi-colors, came very close to this multi-colored star before changing course into a south-west direction. From there I lost sight. What is stranger is that the large multi-colored star that the object changed its course by, disappeared shortly after that."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Features":"Unknown","Weather Factors":"None","Summary":"Second Sighting--Brilliant Orange Star-Like Object that Hovers Before Taking Off","Date Submitted":"10/18/2010 10:20 UTC","Case Number":"25967","map":"<A HREF = \"http://maps.google.com/maps?q=31.318704,+-92.443637(25967)&iwloc=A&hl=en\"> mufon case (25967) map </A>","Date of the Event":"10/18/2010 07:45 UTC","City":"Alexandria","Longitude":"-92.443637","Latitude":"31.318704","files":["/var/www/straped/mufon/html2text/25967.html.txt","/var/www/straped/mufon/org/25967.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10182010-0021"}