{"trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around June 15th 1980"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.750865,+-84.380322(25970)&iwloc=A&hl=en\"> mufon case (25970) map </A>","Log Number":"US-10192010-0001","Country":"United States","Source":"MUFON","Tags":"City","City":"Atlanta","Date Submitted":"10/19/2010 12:30 UTC","Longitude":"-84.380322","Date of the Event":"06/15/1980 12:00 UTC","Object Flight Path":"Straight-line path","Region":"Georgia","Object Shape":"Circle","divs":["Sighting DetailsI was very young when this took place, but my brother also witnessed it. To this day I cannot believe what I saw, but I know for a 100% fact that we did. It was around dark, maybe just after and i remember this thing coming from over the trees. It was so close to the ground, that you could have tossed a rock and hit the bottom. It came directly over our heads and made no noise. To this day I remember it had no noise, but a sound that sounded very much like bass in a car. Not the loud noise, but the vibration. My brother, who was older than me at the time, was screaming at this thing to go away. However, I remember jumping up and down and screaming, \"come down,come down\". Its amazing how i can still remember how it felt as though this thing was playful. As I write this, i just cant believe it happened. We watched it fly over the house, very close to the top of the house. its hard to believe but I can remember thinking,\" wow, my parents have got to see this\". One of the things that sticks out the most was those 4 huge domes on the bottom. They were glowing a milky white, like really hard to describe. My brother and I never talk about what happened that night. We both acknowledge that it happened, but strangely dont talk about it. This thing was so close, that being 6ft tall now, i couldve stood on top of the house and touched the bottom. it was about 20ft off the ground and directly over my head. To this day I have no idea what that was, but I am 100% sure that I did see a circular craft just feet over my head. Sometimes I go back to where it happened in that house i use to live in. The back yard is a lot smaller than i remember, but those cherry trees are still there and thats how high off the ground it was. It was brushing the top of the cherry trees. Sometimes, I wonder if anything else happened and I dont remember. I know that sounds ridiculous, but I ve heard of that happening to people and this thing was so close, it had to have known we were there. Wow, unbelieveable how that event is in my mind like this 30 years later!! I can remember how I felt, how it sounded, what it looked like, what I said, what my brother said and what i thought about it. Trully unbelievable."],"files":["/var/www/straped/mufon/html2text/25970.html.txt","/var/www/straped/mufon/org/25970.html"],"Sighting Duration":"Undisclosed","Case Number":"25970","Summary":"circular craft 15 ft in diameter with 4 large dome lights on bottom","Latitude":"33.750865","Disposition":"Insufficient Data","Viewing Distance":"20 Feet or Less","Object Features":"Other"}