{"trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around October 3rd 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.448605,+-79.992286(25979)&iwloc=A&hl=en\"> mufon case (25979) map </A>","Weather Factors":"Unknown","Object Features":"Undisclosed","Country":"United States","Date Submitted":"10/19/2010 04:58 UTC","Object Shape":"Other","Region":"Pennsylvania","Object Flight Path":"Undisclosed","Longitude":"-79.992286","Viewing Distance":"Unknown","Summary":"Cold, cloudy evening saw unknown round lights half a circle spinning rapidly coming out of a cloud moving vertically and horizontally, at the bottom was a small circle of lights spinning rapidly moving back and forth.","divs":["Sighting DetailsI was watching TV in the living room at 9:00 p.m. and about an half an hour later I noticed flickering lights below the awning of the side window. There is a county airport across the river I didn't pay much attention because I have seen beams of lights for the airplanes, etc. After watching TV I thought the flickering of light hasn't stopped yet, a bit unusual, so I looked outside and could not believe what I saw. The weekend was cold, damp and very cloudy but no rain on that Sunday evening it was clear but cloudy. There was a long horizontal cloud and out the right side about ten spinning rapidly circular objects a half circumference moving together vertically horizontally at the bottom of the cloud was a smaller circle of round objects spinning very fast, also moving back and forth rapidly, then the whole thing would disappear and come back this went on for one hour. At one point the objects spiraled downward and then the circles went into beams of light and spun around. This wasn't that far up in the sky, I could really see this spectacular show. I was paralyzed and DID NOT HAVE A CAMERA. I called my sister who lives across the river she saw one light flickering. The next day I talked to several people who saw the spinning lights but didn't have full view like I did and they did not see the bottom circle of lights. These lights were opaque not clear almost cloud like in composition?? I wasn't afraid just mesmerized and wondered what they could possibly be-- supernatural? I kept staring at the cloud beyond 11:00 everything disappeared. This happened in Glassport, PA at the top of the Hill on 7th Street. This event would be the South Eastern sky."],"Date of the Event":"10/03/2010 10:59 UTC","Case Number":"25979","files":["/var/www/straped/mufon/html2text/25979.html.txt","/var/www/straped/mufon/org/25979.html"],"Disposition":"Unknown","Latitude":"40.448605","Tags":"City","City":"Pittsburgh","Log Number":"US-10192010-0010","Sighting Duration":"Undisclosed","Source":"MUFON"}