{"City":"Greenwood","Source":"MUFON","Date Submitted":"10/19/2010 09:31 UTC","Object Shape":"Other","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around October 19th 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsLast night I was having a difficult time sleeping and after I drifted off for a while I awoke about 5:25am and realized I didn't take the trash out the night before. So I gathered my shoes and jacket headed outside to take the trash to the curb. For some reason I had this really uneasy feeling but I ignored it. After taking the trash out, i went to the front porch to smoke a cigarette. As I walked out I stood there and all of a sudden I saw movement out of my perifial and imeadiately looked at that area. I couldnt believe my eyes, because it looked like an alien gray trying to sneak across the street unoticed. I even walked off the porch to see more and it had to be hiding. No trace of it anymore. I finished my cigarette quickly and went back inside. This looked like the classic gray alien, the skin looked gray and no clothes, there is a street light right in the path it took to go across the road. Another interesting fact is that it's stride was different than what a human would look like. I took a picture of my viewpoint from the porch later that morning so you can see in the daylight how far away it was and the direction it traveled."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.623468,+-86.102973(25975)&iwloc=A&hl=en\"> mufon case (25975) map </A>","Case Number":"25975","Sighting Duration":"00:00:10","Region":"Indiana","Summary":"Alien Gray Sighting","Longitude":"-86.102973","Viewing Distance":"21-100 Feet","Date of the Event":"10/19/2010 05:30 UTC","Latitude":"39.623468","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/25975.html.txt","/var/www/straped/mufon/more/25975_submitter_file1__mufonpic001new.JPG","/var/www/straped/mufon/org/25975.html"],"Log Number":"US-10192010-0006","Weather Factors":"Fog","Disposition":"Insufficient Data","Country":"United States","Tags":"City","Object Flight Path":"Undisclosed"}