{"Log Number":"US-10192010-0009","Source":"MUFON","trends":["There have been no other sightings in Collins","This sighting has never been favorited."],"Disposition":"Unknown","Latitude":"32.181301","files":["/var/www/straped/mufon/html2text/25978.html.txt","/var/www/straped/mufon/org/25978.html"],"Summary":"Arrowhead shaped UFO was being chased by military aircraft above Reidsville and Collins Georgia.","Date Submitted":"10/19/2010 04:24 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.181301,+-82.109008(25978)&iwloc=A&hl=en\"> mufon case (25978) map </A>","Sighting Duration":"Undisclosed","Object Features":"Other","Viewing Distance":"Over 1 Mile, Unknown","City":"Collins","Country":"United States","Case Number":"25978","divs":["Sighting DetailsLet me first just give clarity to the reviewing administrator that myself, along with the other two witnesses have normally shot down the idea of UFO's in the stereotypical sense. That being said, here's our story from my perspective. Last night, October 18th, 2010, around 8:00, my fiance` Laura, and our mutual friend Abbie made plans to cruise dirt roads and over-all just pass the night away. A little after 8:00 P.M (Perhaps a little before), Abbie called to let us know she was on her way, and arrived shortly after. We made our way down the usual stretch of the Old Reidsville Collin's Highway (Anderson Street, now), and passed through Collins, Georgia. I was in the back seat, and Laura was sitting in the front alongside Abbie. I was taking notice at the vast amount of movement in the sky, and the fact that the clouds were streaked, as if they'd been raked. Around 8:40 or so, we arrived at the entrance to a dirt road outside of Collins, then proceeded to turn down into it. By this time, I'd pointed out the activity in the sky, which we joked around about being UFO's. It wasn't until we noticed that what looked to be a military air-craft was pursuing a very vague object that was seamless against the sky, did we stop to think we might be right. The object looked like a very dull star at first, though it was indeed moving. I told Abbie to stop the car, and when she inquired why, I told her we'd be able to make it out in a moment because it was about to pass under the moon's light. Once she stopped the car, Abbie, Laura, and myself exited the car, and watched this very vague craft become more visible the closer it drew towards the moon. The craft then passed over-head, under the moon's light, and we were all utterly dumbfounded by the very prospect of just having witnessed a UFO. We watched as what appeared to be military aircraft, or aircraft of some sort trailing this object. A description of the UFO is provided below; The craft I saw was in the shape of a soft featured arrowhead. Being overhead, I assume it was the bottom I saw. There were three obvious lights, one at each point, and a design in the middle of the lights that mimicked the original shape of the object. The design was a lighter color than the rest of the craft. The craft itself was black. Almost seamless against the night sky. We reentered the vehicle, and the time was 9:00. (Not exactly, but I believe it was around 9:05-(9:10). Laura grabbed Abbie's phone, and decided she was going to call her mother in total shock of what she'd just seen. There was no service on the phone. I suddenly felt rather ill. Extremely fatigued, my face felt like it had been doused with boiling water. I mentioned it, and Abbie and Laura both agreed they felt the same. After contemplating what to do, we decided to follow the UFO. It wasn't soon after that it disappeared from all visibility behind a very thin cloud. The aircraft that were pursuing the UFO looked as if they were circling around the cloud. We were sure it'd disappeared, when they began forming a triangular shaped pattern near this cloud. Seemingly out of no-where, this bright orange tinted light suddenly appeared through the cloud, and the UFO became visible once more as it sped past the aircraft. The UFO once again passed near the moon's light, and then began to turn, which granted me the ability of gauging the craft had multiple dimensions and was indeed soft-featured. Once the craft completed it's turn, it began a slow diagonal ascension. At this point, all disbelief has left the three of us. We're intrigued, but tired. Rather distraught, but morbidly curious. While still following the craft, we turned back onto the main highway outside of Collins. We all watched in disbelief as the UFO disappeared yet again. We watched as aircraft began swarming the area it'd disappeared in. We made it back to my fiance's mother's house around 10:00. The three of us decided to ensure no one was lying, we all decided to draw it and not show anyone until we were all finished with the sketches. Sure enough, the sketches were all identical. This morning, I woke up earlier than usual, feeling extremely tired and beat. I felt as if I'd been beaten with a bat. It took my fiance' a while to finally coerce me out of bed. She wasn't feeling well either. About 1:00 P.M today (October 19th, 2010), Abbie called us, saying she'd missed her class because she couldn't really move this morning. We all decided this needed to be reported."],"Object Flight Path":"Path with directional change","Longitude":"-82.109008","Region":"Georgia","Weather Factors":"Unknown","Date of the Event":"10/18/2010 08:40 UTC","Object Shape":"Triangle"}