{"Summary":"Saw large rounded triangular craft","Case Number":"2597","Object Flight Path":"Stationary","Date of the Event":"06/30/2000 07:30 UTC","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Log Number":"","Longitude":"-122.709477","City":"Ashland","Region":"Oregon","Object Shape":"Triangle","Source":"MUFON","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.194576,+-122.709477(2597)&iwloc=A&hl=en\"> mufon case (2597) map </A>","trends":["There have been 10 other sightings in Ashland","There were no other sightings in Ashland on or around June 30th 2000"],"Date Submitted":"06/30/2000 07:30 UTC","Object Features":"Undisclosed","divs":["Sighting Details1 I was in my car ... driving ... just off HWY 5 South-bound EXIT 19 toAshland, Oregon2 At the red light ... intersection of HIGHWAY 99 and VALLEY VIEW RD. Saw 2people male female 40-somethings between buildings of MR. Cs and next doorMEXICAN RESTAURANT looking up in the sky in that Close Encounters of the ThirdKind wonderment and awe. The light turned green, I began very slow left turn --because I wanted to see what the people mentioned above were in awe about ... itwas then at mid-turning I saw this large, blackish brown triangular craft aboveEXIT 19 with the TEXACO STATION in foreground for scale close to Exit 19.3 I thought -- Hmmm. That is not a regular aircraft. Oh, my -- THAT is a UFO...4 I had slowed to a near stop in the middle of the left turn -- a car came upbehind me from the same direction, I had to complete the turn, I countiuedlooking at it and turning to the front to navigate to the immediate side of theroad. I was calm -- I had a sense of wonderment as to what I had seen. When Ilooked back -- it was gone.5 Object was a large, blackish brown triangular craft -- no bigger that 100feet in diameter. It hovered. I have a recreation I made in Bryce and map ofscene back in October of 2000 if required.6 I had pulled over to the immediate curb when the car behind me came up. Bythe time I looked to the sky and the location it was seen -- it was gone."],"files":["/var/www/straped/mufon/html2text/2597.html.txt","/var/www/straped/mufon/org/2597.html"],"Weather Factors":"Unknown","Sighting Duration":"00:00:59","Latitude":"42.194576"}