{"Country":"United States","Region":"Oregon","Source":"MUFON","Latitude":"45.528712","map":"<A HREF = \"http://maps.google.com/maps?q=45.528712,+-122.670827(25972)&iwloc=A&hl=en\"> mufon case (25972) map </A>","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Triangle","files":["/var/www/straped/mufon/html2text/25972.html.txt","/var/www/straped/mufon/more/25972_submitter_file1__DSC02293.JPG","/var/www/straped/mufon/more/25972_submitter_file2__DSC02294.JPG","/var/www/straped/mufon/more/25972_submitter_file3__DSC02295.JPG","/var/www/straped/mufon/org/25972.html"],"Disposition":"IFO","Object Features":"Unknown","Viewing Distance":"Over One Mile","City":"Portland","Tags":"City","Weather Factors":"Unknown","Date of the Event":"10/18/2010 07:00 UTC","Case Number":"25972","Date Submitted":"10/19/2010 01:07 UTC","divs":["Sighting DetailsWhile driving west on Padden PKWY in Vancouver WA on my way home, I noticed a pefect triangular formation of bright sphere-like lights to the south of me in the general area of Portland International Airport. The lights appeared much brighter than the typical plane lights look in the sky as planes come and go from PDX. As I continued driving, I saw that the formation was completely stable, and seemed to be just sort of hovering in place. Confused as to why and how planes would hold a formation like this above the airport, I turned and drove south down HWY 503 towards the lights, hoping to get a better view, and to pull over to determine if the lights were as stationary as they seemed. After pulling off the road into a parking lot, I got out of the car with my camera and snapped a photo. The formation then began rotating slowly in place, with all three lights maintaining the same spacing and distance from one another. I snapped two more photos while this was happening, and then 1 of the lights broke out of formation and moved steadily to the east. The two remaining lights continued to rotate for another few moments, and then another one left formation and seemed to move in a north-westerly direction. The remaining light became stationary, and then slowly faded from sight. If anyone else saw this, please submit your own report for additional verification. I phoned PDX to ask if the air traffic was moving normally and she said that all flights were operating normally. I could not think of a satisfactory explaination for what I saw."],"Longitude":"-122.670827","Summary":"Saw stable triangle formation in the area of PDX","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around October 18th 2010","This sighting has never been favorited.",""],"Log Number":"US-10192010-0003"}