{"City":"Peru","Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"Unknown","Latitude":"40.758723","Longitude":"-86.066881","Country":"United States","Viewing Distance":"Over One Mile","Object Shape":"Sphere","divs":["Sighting DetailsI am 51 years old now. I lived in the country on 200 N. Miami county between Peru and Wabash Indiana. This happened during Indiana State Fair time in either 1973 or 1974. I did not have my drivers license yet but we had lived in that house for no more than two years at the time. The time would have been between 9 pm and 11 pm. I had just gotten back from the fair. I had gone with a friend and his family. My mother, sister and a neighbor were in our driveway looking at the southwest quadrant of the sky. They said they had been watching for around 15 minutes. There were five to seven \"dots\" in that area that were moving at different speeds and were changing colors. They would speed up and slow down and change colors. The colors were red, blue, green and white. All the actions were random. They could change direction and speed instantly. They looked like they were really close to Grissom Air Force base. We had just been through that area on our way home from the fair and did not notice anything at that time. The dots were able to move across the entire southwest sky at a very rapid speed. We watched for around 20 to 30 minutes more then got back in the car to see if we could get closer. We noticed other neighbors looking at the area. We did not even make it into Peru before everything just vanished from the sky. We called Grissom but they said they didn't know anything. We found out later that a number of people saw it. Since I was a teenager at the time,and into science, I thought it was a cool thing to see. I've not seen anything like it again."],"Date of the Event":"06/30/1973 12:00 UTC","files":["/var/www/straped/mufon/html2text/25986.html.txt","/var/www/straped/mufon/org/25986.html"],"Summary":"Dots changing color and moving very fast over the southwest quadrant","Region":"Indiana","trends":["There have been 19 other sightings in Peru","There were no other sightings in Peru on or around June 30th 1973"],"Tags":"City","Log Number":"US-10202010-0005","Sighting Duration":"Undisclosed","Date Submitted":"10/20/2010 09:16 UTC","Case Number":"25986","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.758723,+-86.066881(25986)&iwloc=A&hl=en\"> mufon case (25986) map </A>","Weather Factors":"None"}