{"City":"Seattle","Sighting Duration":"00:00:30","divs":["Sighting DetailsLast night at about 6:55 PM I was driving South up a hill in West Seattle to visit a friend. It was a beautiful, clear night with a bright moon. As I crested the hill I noticed, through my left (driver's window), just below the moon in the SE sky, three very bright stars - what looked like jupiter at the top and two equally bright stars just below and to the right and left of Jupiter, forming a triangle with Jupiter at the top. I was amazed, but had to glance away to the road ahead and a stop sign. As I turned left, I looked back up through my windshield at the moon, and in the few seconds that had transpired the two bright stars under Jupiter had dimmed to half of their brightness and then were gone. I tried to rationalize - could they have been reflections through the window? Airplanes flyng in my direction that turned away in unison? I have no idea what these two bright lights were, and how long they were there before I saw them, but I checked this morning and was excited that someone else reported seeing the same thing, albeit from another part of the country (MI). Although that gentleman reports that the lights \"dropped away\" from Jupiter before disappearing, I didn't notice them dropping, just fading, perhaps because I had turned away and was in a moving car. Anyone looking up at the sky around 6:55 PST would have seen this amazing sight, so I'm surprised that there aren't more reports."],"Object Shape":"Star-like","Latitude":"47.56677","map":"<A HREF = \"http://maps.google.com/maps?q=47.56677,+-122.394831(25989)&iwloc=A&hl=en\"> mufon case (25989) map </A>","Country":"United States","Object Flight Path":"Stationary","Source":"MUFON","Tags":"City","Weather Factors":"None","Date of the Event":"10/19/2010 06:55 UTC","Log Number":"US-10202010-0008","Date Submitted":"10/20/2010 01:07 UTC","Disposition":"Unknown","Longitude":"-122.394831","trends":["There have been 110 other sightings in Seattle","There was one other sighting in Seattle on or around October 19th 2010"],"files":["/var/www/straped/mufon/html2text/25989.html.txt","/var/www/straped/mufon/org/25989.html"],"Case Number":"25989","Region":"Washington","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Summary":"Bright stars appear below Jupiter"}