{"Date of the Event":"08/10/2010 10:30 UTC","Source":"MUFON","trends":["There have been 33 other sightings in Vancouver","There was one other sighting in Vancouver on or around August 10th 2010"],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"10/20/2010 06:33 UTC","Country":"Canada","divs":["sighting detailsi have had 31 encounter's with these fast moving orbs of light, some of them just moving slow, all of them during dusk or night. i have had 5 witnesses during 5 of the 31 encounters. i was walking to the store that early evening and looked down the street towards the mountains and spotted this red\\orange orb of light just hovering approximately a mile away. i was quite excited as the week before, i saw 5 in nanaimo b.c, canada during the night with 2 other witnesses. it is apparent with all the nasa\\ufo research that i have done over the last few years, these encounters are in similarity with the orbs of light quite prevalent with what nasa knows. i have a contact which goes by the name of *(name removed--cms\\sg) from bowen island b.c, who recorded the nasa information and my encounters are very similar with those phenomenon discovered by *(name removed--cms\\sg). it's interesting these times we are in. thank you for your continued research and support of this most divine and universal revelation manifesting amongst the human soul species. sincerely, **(wit's name removed--cms\\sg)."],"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/25983.html.txt","/var/www/straped/mufon/org/25983.html"],"Longitude":"-123.106627","Case Number":"25983","Log Number":"CA-10202010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=49.264956,+-123.106627(25983)&iwloc=A&hl=en\"> mufon case (25983) map </A>","Tags":"City","Latitude":"49.264956","City":"Vancouver","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"British Columbia","Summary":"Red/Orange orb of light in east Vancouver","Object Features":"Undisclosed","Viewing Distance":"Unknown"}