{"Viewing Distance":"Over One Mile","Country":"United States","Case Number":"25991","Region":"Nevada","Log Number":"US-10202010-0010","Longitude":"-115.168796","Source":"MUFON","files":["/var/www/straped/mufon/html2text/25991.html.txt","/var/www/straped/mufon/org/25991.html"],"City":"Las Vegas","Date Submitted":"10/20/2010 03:46 UTC","Date of the Event":"10/18/2010 08:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around October 18th 2010"],"Object Shape":"Teardrop","Object Features":"None","Tags":"City","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWhat I saw what a craft of some sort, I would say the exact same as what was in the China UFO video EXCEPT there was no light at the rear. It was producing the same type of vaporization type of contrails. Could not have been more then 8000' elevation and las vegas is roughly 2000' where i was at. Literally no more then 5 miles away either, no sound no noise what so ever. The only reason I was able to see the \"contrails\" is because the moon was in view behind it and lit it up. Otherwise I believe it would have been invisible. This craft was literally passing RIGHT by the air force base. But it DID NOT take off from the base, also it only had one light on it a solid white very dim light. It was also incredibly small. If it had been a fighter jet or something of that nature I would have seen the outline that's how close it was. I saw it moving from North to South on the eastern side of vegas along the \"Sunrise Mountains\". It crossed the entire Las Vegas sky from Nellis Air Force Base to past Henderson in around 45 seconds. Thats around 50-60 Miles I would say before it was no longer in sight. If it had been a jet I would have heard the sonic boom or engine noise as fast as it was moving."],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=36.117946,+-115.168796(25991)&iwloc=A&hl=en\"> mufon case (25991) map </A>","Latitude":"36.117946","Summary":"Craft moving past Nellis Air Force Base (above) splitting atmosphere","Weather Factors":"Unknown"}