{"Longitude":"144.96825","Object Features":"Undisclosed","Summary":"Looking at Jupiter with my Telescope . I spotted a star like object moving from one side of the Viewing field to the other in a matter of seconds. Object stops then moves up and down then back the other way. Seen this for 40 mis.","Latitude":"-37.807897","files":["/var/www/straped/mufon/html2text/25998.html.txt","/var/www/straped/mufon/org/25998.html"],"Sighting Duration":"09:00:00","Country":"Australia","Viewing Distance":"Unknown","divs":["Sighting DetailsWent out to look at Jupiter with my telescope about 8:30pm EST. observing the moon then Jupiter, was looking at the moons of Jupiter and noticed a stat like object moving. Time was about 9:00pm EST. I focused on the object and noticed it was moving in a very strange manner. It was moving from one side of the viewing field to the other side in approximate 10 to 20 seconds and then up down and then back again. It even moved in full circles. I pointed my Telescope at another star to see if my telescope was unstable and to see if another star was moving the same way and it did not. I called my wife to have a look to see if my eyes were playing tricks. She had seen the same thing I did. I only occasionally use my telescope when the weather is nice and I have never seen this before. It defiantly was not a satellite. This event lasted about 40 minutes. The areas I live in have reported including ME UFO sightings in the passed. It was on the total lunar eclipse of 16 July 2000. I will be defiantly looking again tonight if the condition is right. I hope this helps you."],"Log Number":"AU-10202010-0017","Tags":"City","Object Flight Path":"Undisclosed","Date of the Event":"10/20/2010 12:00 UTC","Date Submitted":"10/20/2010 10:31 UTC","Object Shape":"Star-like","Case Number":"25998","map":"<A HREF = \"http://maps.google.com/maps?q=-37.807897,+144.96825(25998)&iwloc=A&hl=en\"> mufon case (25998) map </A>","Source":"MUFON","Region":"Victoria","City":"Melbourne","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around October 20th 2010"],"Disposition":"Unresolved","Weather Factors":"Unknown"}