{"trends":["There have been 68 other sightings in Eugene","There was one other sighting in Eugene on or around October 20th 2010"],"Latitude":"44.055599","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=44.055599,+-123.083334(26008)&iwloc=A&hl=en\"> mufon case (26008) map </A>","City":"Eugene","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI was leaving a cafe (on Monroe Street between 11th and 12th) in West Eugene after listening to music at approximately 9:45 Approximately a dozen-or-so patrons were outside and one man said they were watching a UFO and pointed it out. It was west of us in a small area of sky outlined by trees. The shape and colors were not immediately distinguishable to me. It was a full moon. I saw a bright star and asked what that was. Someone said it was Venus, and then the object appeared. It was brighter than Venus and maybe about 5 times the size in appearance and it appeared closer in. I watched it for what seemed like 10 to 15 minutes moving about or meandering non-linearly. It took me a few minutes to distinguish its shape, which looked like a plane with a neon body and neon orange wings that sometimes seemed to spin around the neon green body. It was not very big and seemed to be as close in as a plane would be. A young lady captured it with her cell phone camera and showed it to me, but the image on her phone was only an indistinguishable spec. I immediately thought it was either a genuine UFO or a black ops maneuver. I watched for it to dart about erratically, but it seemed to gracefully move or meander about and hover, occasionally disappearing behind the tree scape. I was very excited to see it, especially when it seemed to move closer and waved and beckoned to it, to no avail. There were two young men standing beside me. One commented that he thought it was an unmanned craft, and the other commented that he thought it was a remote-controlled glider and that he had seen something like it before. When it disappeared behind the trees, everyone dispersed. I walked west several blocks and, on my way home, I ran into a couple lingering, who explained that they were watching a UFO. This was around 10:15 or so. It was still there in the same general area as before, only from where I was standing it was more up overhead and slightly to the east of where I was standing. I only saw it briefly at that time before it disappeared behind the treeline, and a large low-flying plane became visible, which the three of us speculated was patrolling the sky for the object we had just seen. I was surprised at myself and my feelings of actually wishing it would land. For all the things I had heard about aliens being hostile, this was not what I was feeling. I felt a strong desire to have contact with other intelligent beings in the universe. At the same time, I was skeptical, and still am, that this could be a black ops, governmental, or some other kind of attempt at mind control."],"Object Shape":"Cross","Region":"Oregon","Summary":"Plane-shaped object with neon green body and neon orange wings-like shape that seem to spin around sometimes","files":["/var/www/straped/mufon/html2text/26008.html.txt","/var/www/straped/mufon/org/26008.html"],"Log Number":"US-10212010-0007","Case Number":"26008","Date Submitted":"10/21/2010 11:51 UTC","Country":"United States","Disposition":"Unknown","Longitude":"-123.083334","Viewing Distance":"Unknown","Date of the Event":"10/20/2010 09:45 UTC"}