{"Date Submitted":"10/20/2010 11:03 UTC","trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around October 17th 2010","This sighting has never been favorited.",""],"Latitude":"39.764218","Summary":"resembled falling plane or burning meteor","Log Number":"US-10202010-0020","map":"<A HREF = \"http://maps.google.com/maps?q=39.764218,+-84.187207(26001)&iwloc=A&hl=en\"> mufon case (26001) map </A>","Object Flight Path":"Stationary","Object Features":"Unknown","Source":"MUFON","Disposition":"IFO","divs":["Sighting DetailsOn October 17, 2010, I was leaving Xenia, Ohio, to go to work in Centerville, Ohio. I was on State Route 723 leaving Bellbrook and entering Centerville. At approximately 4:50 PM, my eyes saw something in the sky, and my first thought was a plane was on fire and it was going down. Then I thought it might be a meteor. Then I noticed a smaller object beneath the larger \"falling\" object. Using depth perception and reference points, I was able to determine the \"falling\" object wasn't falling at all, but was in fact remaining stationary. The \"smaller\" object I first thought was a jet, the kind that leaves behind cloud-trails. It had a \"flare tail\" but it didn't leave any kind of cloud trail behind. It ascended at an angle and proceeded to travel rapidly up, beneath the larger object, and into the sky. The \"falling flaming meteor\" remained in the same position for the next 10 minutes, until I reached my job and turned a different direction, and lost sight of it. As I live next to Wright-Patterson AFB, I dismissed it, but the following day I saw news footage of strange lights seen over El Paso, and they were almost exactly the very same thing I saw on October 17th, only during the day instead of night. I was so disturbed by this that I contacted the Dayton Daily News, and considered contacting Wright-Patt AFB, but decided not to. DDN couldn't confirm any other reported sightings. A co-worker tonight said they had explained away these multiple sightings, but an exhaustive net-search pulled up nothing. I'm not a UFO nut, and living next to an Air Force Base, especially Wright-Patt, I'm used to seeing multiple aircraft of different types in the sky. I am able to identify them. This object was unidentifiable. I only made the effort to contact the newspaper after seeing the El Paso video, which at that point profoundly disturbed me. I know what I saw wasn't normal. I lost sight of the object while changing directions in my car and I was no longer able to keep eyesight on it."],"Viewing Distance":"Over One Mile","Country":"United States","Longitude":"-84.187207","Tags":"City","City":"Dayton","Region":"Ohio","Case Number":"26001","files":["/var/www/straped/mufon/html2text/26001.html.txt","/var/www/straped/mufon/org/26001.html"],"Sighting Duration":"Undisclosed","Date of the Event":"10/17/2010 04:50 UTC","Weather Factors":"Unknown","Object Shape":"Fireball, Sphere, Teardrop"}