{"Latitude":"39.955399","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/26000.html.txt","/var/www/straped/mufon/org/26000.html"],"City":"Toms River","divs":["sighting detailstraveling east bound on adams ave. noticed 4 lights arranged in a cross shape all blinking at the same time, object was moving slowly and steadily in what looked like a northern direction along the coast (ortley beach\\seaside area). while moving slowly northbound the lights stopped blinking all at once and then started blinking in an alternated pattern- 2 red at one time & then the 2 white would blink. i observed this for approximatley 1 minute before i turned left on to harding ave travelling north, intrigued by the odd lights i looked to my right (towards the ocean) to see the lights and could not find them. for approximatley 2 stop signs (or maybe 45 seconds-1min)i did not see the lights, as i looked back up to the northern sky the lights were directly in front of me in teh direction of route 37. they were still blinking in an odd pattern and the lights began to descend till i couldn't see them anymore under the treeline. they appeared to be adjacent to high school east. at first i thought it was a plane or a helicopter flying along teh coast line but the lights were clearly in a t shape, and all the same size & intensity. if it was a plane it looked as if it would have to be flying on its side, but theres no way it could move from the ocean, over the bay, over 37 towards fischer blvd and be over high school east, let alone descend low enough to not be seen below the treeline, those trees are not that tall."],"Summary":"Four lights (2 Red-2 White) arranged in a cross or \"t\" shape blinking & shifts course suddenly","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.955399,+-74.193439(26000)&iwloc=A&hl=en\"> mufon case (26000) map </A>","Country":"United States","Weather Factors":"None","Date of the Event":"10/20/2010 10:15 UTC","Log Number":"US-10202010-0019","Date Submitted":"10/20/2010 10:53 UTC","trends":["There have been 13 other sightings in Toms River","There were no other sightings in Toms River on or around October 20th 2010"],"Source":"MUFON","Object Features":"None","Longitude":"-74.193439","Case Number":"26000","Region":"New Jersey","Object Shape":"Cross"}