{"map":"<A HREF = \"http://maps.google.com/maps?q=36.042025,+-94.247152(26018)&iwloc=A&hl=en\"> mufon case (26018) map </A>","Latitude":"36.042025","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was walking my dog, Looking at the halo of ice crystals in the air around the moon (signaling rain is coming) and just happened to look south from my deck and saw what looked like a bright light (maybe a satellite) to the south of my house, moving west to east. It was strange that there were no aircraft running lights, and there appeared to my eye to be several objects trailing the light. I went into the kitchen and got my binoculars, and found the object, which is moving much faster than a normal aircraft, given what looked like about 50 miles distance. I looked through the binoculars and saw about 5-7 yellowish, constant lights moving as though they were linked together. I believe that the object was quite some distance, possibly over the river valley since we get commercial planes flying overhead at about 30 thousand feet, and you can hear them. I heard no jet or prop noise, saw no running lights, or landing lights (must be over 10,000 feet agl) I lost sight of the object as it went behind trees in my neighbors yard. I went to the front yard but could not locate the object. There was an airplane to the east, which had running lights, and looked nothing like the object. My feelings were amazement, since I never believed I would see something like this."],"Source":"MUFON","trends":["There has been one other sighting in Farmington","There were no other sightings in Farmington on or around October 21st 2010"],"Region":"Arkansas","Summary":"line of lights moving quickly from west to east","Date of the Event":"10/21/2010 08:55 UTC","Longitude":"-94.247152","Disposition":"Unknown","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26018.html.txt","/var/www/straped/mufon/org/26018.html"],"Case Number":"26018","Log Number":"US-10212010-0017","Object Flight Path":"Straight-line path","Object Shape":"Square, Rectagular, Star-like","Date Submitted":"10/21/2010 10:10 UTC","City":"Farmington","Object Features":"None"}