{"Object Shape":"Disc","Latitude":"36.593532","map":"<A HREF = \"http://maps.google.com/maps?q=36.593532,+-79.385663(26013)&iwloc=A&hl=en\"> mufon case (26013) map </A>","Date of the Event":"07/31/1995 07:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Case Number":"26013","Summary":"disc higher on top with sq. windows (?) around center in primary colors","Viewing Distance":"101-500 Feet","Country":"United States","Region":"Virginia","Date Submitted":"10/21/2010 04:18 UTC","Longitude":"-79.385663","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"None","City":"Danville","Tags":"City","files":["/var/www/straped/mufon/html2text/26013.html.txt","/var/www/straped/mufon/org/26013.html"],"Object Features":"Dome, Window(s)","divs":["Sighting DetailsI've had many sightings since age of 11, but this is the most extreme. I lived on a farm by myself with my Shih Tzu. I went into the south facing bedroom to start closing drapes for the evening and over the unoccupied farm next doow, hung a huge disc. I was alarmed, but felt somewhat entranced even more. It hung there with the colored lights around the center blinking. The colors in these \"windows\" were primary colors. I called friends who lived approx. 20 miles north, but who's house was up on a hill. They could see it too over the tree tops. It stayed for about 5 minutes then took off in a flash south towards the town. It lowered straight down below the tree line. I continued to watch and it cqme back to the farm next door and stayed for another 10 minutes or so, then headed slowly south until it was gone. It did that for about 3 nights. One of those nights it went slowly over a semi-pro baseball stadium about 30 miles south while they were playing and was seen by those there. It was reported to be a \"meteor\" by some \"authority\" in the paper the next day. On the 3rd night of it's evening appearance, I had gone to bed around 10 p.m. It was a queen sized bed and my little dog was on the right side near the foot. All of a sudden I couldn't move. I strained to break free and could not. I vaguely saw some moving objects around me on three sides that looked like gargoyles to me. I was terrified of the way they looked and kept trying to break loose. One on the right put it's head lower towards me and then back again. Though scared almost to death, I felt nothing physical. Then they were gone, instantly. I couldn't move my head but could cut my eyes over to my dog to see if she was aroused. She was still sleeping undisturbed. Then they were gone and I broke free. I was afraid I'd kick her and kept thinking about that, but I didn't. I got up, grabbed her and went in the other room and sat up for the rest of the night. Something did happen, but I just can't figure out what. I believe I was conscious throughout but couldn't swear to it. Several days afterward, a black Lincoln Town Car drove past the farm in the morning with about 6 men in black suits and black dress hats. They all looked alike and were looking forward. They came from the north going south on the dirt road that came out of the woods and turned into a hard surfaced road at the entrance to my farm. They were so out of place in that location or even in town or in the nearby city, that they really stood out. It's one of those things that's imprinted in your mind forever. That was years before I heard about \"The Men in Black\". In the early 60's I also had an experience were I couldn't account for a space of time that has always haunted me. I've had a number of sightings and experiences that might be of interest to you. I've never told anyone for obvious reasons. If a third party is going to contact me, please have them email me in advance so I know to answer the phone. I don't want to confuse them with a solicitor. Thanks."],"Sighting Duration":"00:20:00","Log Number":"US-10212010-0012","trends":["There have been 7 other sightings in Danville","There were no other sightings in Danville on or around July 31st 1995"]}