{"Object Flight Path":"Stationary,Hovering then path,Straight-line path","City":"Norwood Young America","Case Number":"26010","Viewing Distance":"21-100 Feet","Disposition":"Unknown","Object Features":"Patterned Surface","Source":"MUFON","Log Number":"US-10212010-0009","Latitude":"44.773573","Region":"Minnesota","Tags":"City","files":["/var/www/straped/mufon/html2text/26010.html.txt","/var/www/straped/mufon/org/26010.html"],"Object Shape":"Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=44.773573,+-93.921635(26010)&iwloc=A&hl=en\"> mufon case (26010) map </A>","Longitude":"-93.921635","Summary":"Not Provided","Country":"United States","Weather Factors":"None, Does Not Apply","trends":["There have been no other sightings in Norwood Young America","This sighting has never been favorited."],"Date Submitted":"10/21/2010 02:32 UTC","divs":["Sighting DetailsI was outside smoking a cigarette looking up at the stars because it was very clear out. I noticed a clump of 8 or more lights in the far distance and at first thought they were stars. Then the lights started moving in and out from the center light, but they were jumping instead of actually moving(best way I can describe it). My neighbor came outside to smoke a cigarette, and I asked her to look at what I was seeing because I thought it was my eyes playing tricks on me. She confirmed what I was seeing, and within 5 minutes we noticed that the group of lights were moving closer and closer to our location. She went inside to get her boyfriend, and he also saw what we were seeing. I tried to record it on my camcorder on my phone, but couldn't get it to show because it was too dark. My neighbors went in, and I sat on my front step watching it get closer and closer. Then out of nowhere this very big black triangle glided from across the street and right over my other neighbors house only about 40 ft. in the air (heading towards the direction of the group of lights). It had absolutely no lights on it, and made no noise what so ever. I literally stared at it for about 5 seconds. It was moving slower than an airplane and I couldnt believe what I was seeing. I jumped up to try to keep watching it, but could no longer see it. It had white or grey markings on its bottom that were not numbers, or letters but half ring shapes. At first I thought it was like a stealth fighter, but It was moving entirely too slow, and made no sound what so ever. I know my eyes werent playing tricks on me because I was no further than 50 or 60 ft. away from it, and had to turn my head in order to follow it. I was very scared and banged on my neighbors window, but it didnt appear again. I continued to watch the group of lights for a little over an hour after the triangle appeard. They didnt move any further in the distance, but were very high, and almost above my neighbors house. This isnt my 1st encounter with unexplained objects and lights in the sky, or other things I have experienced as a kid, but it is my 1st time seeing the black triangle. I researched it online today, but some peoples description of it doesnt match what I saw. It was almost like it was made not to be seen in the dark. But I definently saw it, and am now a believer of these triangles."],"Sighting Duration":"02:00:00","Date of the Event":"10/20/2010 10:00 UTC"}