{"files":["/var/www/straped/mufon/html2text/26011.html.txt","/var/www/straped/mufon/org/26011.html"],"Weather Factors":"Does Not Apply","Longitude":"-91.13588","divs":["sighting detailsmy name is *(wit's name removed--cms\\sg) a 42 year old caucasian male. i was driving from covington la. to baton rouge la. about 20 miles before arriving in baton rouge i noticed traffic on both sides of the interstate braking and slowing down, the driver in front of me had his window rolled down and was pointing in the air. i looked up and saw a small white sphere just hovering in the sky. i pulled my vehicle over on the shoulder of the road and took a snapshot with my cell phone.( i do know that cell phones are not known for their clarity.) i got back in my car, turned on my hazard lights and took a look at the picture. what i saw startled me, not only had i gotton a picture of this small white sphere but some type of \"craft??\" off to the left by the treeline(i did not see this \"craft\" when i took the picture, only when i observed it when i returned to the car. there are a few strange features that i noticed in the picture upon closer observation. a very strange cloud formation that appears to have the shape of a perfect triangle with trails coming off of it. it also appears that there is an identical cloud, how do i word this, placed a little off center but over the other cloud. there is also another sphere apparently the same size and shape as the one that i saw initialy with my own eyes, to the bottom left of the craft and alson two more spheres in the center of the \"craft\" itself. i did not want to report this, just save it on my phone and show it to friends to get thier opinion. any call or meeting time would be fine with me. i am basicly computer dumb and have no idea how to attach this photo, but am happy to meet in person or by phone. thank you, *(wit's name removed--cms\\sg)."],"Case Number":"26011","trends":["There have been 27 other sightings in Baton Rouge","There were no other sightings in Baton Rouge on or around October 7th 2010"],"Log Number":"US-10212010-0010","Source":"MUFON","Summary":"DRIVING ON I-12 TO BATON ROUGE, TRAFFIC SLOWED, LEFT VEHICLE AND TOOK A SNAP SHOT","Object Flight Path":"Hovering then path,Path with directional change,Other","Region":"Louisiana","Date Submitted":"10/21/2010 02:48 UTC","Latitude":"30.459583","Country":"United States","Disposition":"Unknown","Object Shape":"Sphere, Triangle, Other","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.459583,+-91.13588(26011)&iwloc=A&hl=en\"> mufon case (26011) map </A>","City":"Baton Rouge","Object Features":"Unknown","Date of the Event":"10/07/2010 01:20 UTC"}