{"Source":"MUFON","trends":["There has been one other sighting in Barberton","There were no other sightings in Barberton on or around November 30th 1969"],"Object Shape":"Sphere","Country":"United States","Date Submitted":"11/30/1969 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.012833,+-81.605122(2602)&iwloc=A&hl=en\"> mufon case (2602) map </A>","Object Features":"Undisclosed","City":"Barberton","Case Number":"2602","divs":["Sighting DetailsThese are the two letters I just wrote to the Kecksburg Pa. petition site. Itawoke something in me again. I have to find out what is stored, if anything, inmy mind.91lkean@ix.netcom.com92 and paufo@westol.com were the two e-mails that were sent 10-14-2003. They areas followsPlease help me with the suspected trajectory. If the path is where I suspect,then I can offer a very interesting account. There were six of us kids campingin a tent in our backyard. Then it slowly became high noon. It was approaching1130 pm. I was sent from the tent to get a power cable to watch a localCleveland TV program. As I unzipped the tent, I saw the back of the house getbrighter and brighter. I stepped out and looked behind us. What happened nexthas changed my life. Ever since then, I have asked only my brother about it. Heseems to shrug it off. He was with the remaining four that only saw it pass thehouse tops and chased it to the front yard only to see what appeared to be ameteor. I was the first and stared right into it. My cousin Kenny followed meand just caught it before it passed over the house. Anyway, if the eventcoincides with the trajectory, time of year and time of night, then maybe I holdsomething for you. I am an artist. Ever since then, I have excelled. My visualmemory of how it looked has not faded. It is almost as if something is waiting.I have really never told anyone, except an occasional girlfriend or buddy. But Ifeel that there is a very strange point to this that might surprise anyone whowill not ridicule me. I am a professional designer and account representativeand would not want to put my job in jeopardy. I will secretly go under. There ismore. Afterwards, at night, lights would appear in the field behind the house. Ithought that they were flash lights looking for something until they penetratedthe bedroom wall and that is where I wake up every time. I was around five orsix. Maybe I can helpthen again maybe you can help me get rid of this haunting memory that hassecretly consumed me for well over 37 years.I just looked at the sight after I wrote my first letter to you and saw thedate. It was dated December If my event took place in our backyard in a tent, itwas warm and maybe later. The lights that kept coming back were what Please helpme find out. The object I witnessed was heading due east. The address that Ispoke of when it was seen was 3522 Clarks mill Road, Norton, Ohio 44203. I donot live there now. Some of my relatives still"],"Longitude":"-81.605122","Object Flight Path":"Straight-line path","Summary":"Night turned into day","Latitude":"41.012833","Date of the Event":"11/30/1969 11:30 UTC","Weather Factors":"Unknown","Disposition":"Insufficient Data","Log Number":"","Region":"Ohio","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/2602.html.txt","/var/www/straped/mufon/org/2602.html"],"Sighting Duration":"00:05:00","Tags":"City"}