{"Case Number":"26026","files":["/var/www/straped/mufon/html2text/26026.html.txt","/var/www/straped/mufon/org/26026.html"],"Viewing Distance":"Unknown","Longitude":"-77.022918","Sighting Duration":"Undisclosed","Region":"Maryland","Country":"United States","Weather Factors":"Unknown","Object Features":"None","trends":["There have been 12 other sightings in Silver Spring","There were no other sightings in Silver Spring on or around October 22nd 2010"],"Object Flight Path":"Path with directional change","Date of the Event":"10/22/2010 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.995176,+-77.022918(26026)&iwloc=A&hl=en\"> mufon case (26026) map </A>","Log Number":"US-10222010-0006","Disposition":"Unresolved","divs":["Sighting DetailsMy husband first saw it at 7:30AM from a window in our house, but by the time we got the good camera it was too late. He was disappointed. He described it as chrome-like with red and yellow on it. Sorta cigar shaped and keeping up with a plane I went to the park down the street at 8:00 with dog and cheap camera because he was holding on to the good one just in case it came back; and at 8:30 it was moving slowly over the park! I had crapy camera on me just in case but I did get 3 photos! Not the best photos but I have something. All I can say is that it behaved like mercury. It was chrome like and would be circular but then move into an oval. The object was rolling one way then another. This one also had red on it but because it would change jesture I cant say that the red stayed on just one area of the UFO. I will go back to the park at 9:30 and hopefully there is a pattern. I will post pics later Another observation is that it looked like the birds were flying eractly. At one point this morning around 7:40 we saw them flying into eachother. They looks confused and paniced. I was excited. I waved to it in hopes that it would just stop crusing by. I pointed to it and yelled UFO and got out crapy camera in the meantime the other three dog park people began to look and point."],"Object Shape":"Cigar, Circle, Oval, Sphere","City":"Silver Spring","Date Submitted":"10/22/2010 09:15 UTC","Latitude":"38.995176","Tags":"City","Summary":"Chrome like but with red. Moved slowly","Source":"MUFON"}