{"Country":"United States","Disposition":"IFO","Case Number":"26028","Weather Factors":"None","Tags":"City","City":"Greensboro","map":"<A HREF = \"http://maps.google.com/maps?q=36.082575,+-79.790705(26028)&iwloc=A&hl=en\"> mufon case (26028) map </A>","divs":["Sighting Details on october 22 around 530 ish I was drinking coffee and star watching. I was sitting down and facing northeast towards greensboro. Last night I saw several shooting stars and I was absently scanning the sky looking for more while planning my day. I focused on a trio of bright stars and one winked out. I kept my eye on it thinking that a cloud had covered it and it would reappear. It did reappear but significantly to the left of where it was originally. After a few seconds it winked out again, then reappeared in a different position. I was awestruck and literally staring with my mouth hanging open. After this it stayed put and pulsed out a very bright white light. After about 30 seconds it winked off again. I started to scan the sky nearby to see if it would reappear and in my periphal vision to the left I glimpsed something moving at a great amount of speed. I sat waiting to see something else for about 10 minites, then returned to the house. I was shocked even though I've always hoped to see something anomalous. A weird mixture of elation and puzzlement."],"Object Shape":"Flash, Oval, Star-like","Longitude":"-79.790705","Sighting Duration":"00:05:00","Date of the Event":"10/22/2010 05:30 UTC","Viewing Distance":"Unknown","Object Flight Path":"Other","Latitude":"36.082575","Log Number":"US-10222010-0008","Region":"North Carolina","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26028.html.txt","/var/www/straped/mufon/org/26028.html"],"trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around October 22nd 2010"],"Summary":"saw a star like object blink on/off then disappear","Date Submitted":"10/22/2010 10:51 UTC","Object Features":"Unknown"}