{"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/26023.html.txt","/var/www/straped/mufon/org/26023.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.946515,+-124.10062(26023)&iwloc=A&hl=en\"> mufon case (26023) map </A>","Region":"California","divs":["Sighting DetailsI went out for my morning cigarette, and noticed that the sky above was perfectly clear. Since the sun had not yet risen, I took a moment to marvel at how beautiful the star filled sky was. After looking north to locate the big dipper, I turned to look at Orion. While scanning upward, I saw two stars that appeared to move a bit. My first thought was, \"That can't be right.\" I watched the two stars more closely, and in fact, they were moving slowly across the sky in a southerly direction. First I tried to figure out why two aircraft would be flying a formation that open, and how they could maintain such a precise separation in a formation that loose. After I figured out that what I know about aircraft just didn't fit what I was watching, I thought that it might be possible that the lights two pointss on a single object. I selected a relatively brite star that the trajectory went near and attempted to move so that the lights would pass on either side of it, relative to my possition. Unfortunately, I could not move far enough to get that angle, so I settled for picking a dimmer star that was directly in the path of the lights, and would have each pssing on either side. As I watched them move accross the star I picked, it was obscured btween them. The lights then passed out of sight beyond the tree line. It is difficult to say how high the object was, but it was far enough that moving a distance of about 80 to 100 feet made no significant change in the apparent angle relative to the stars. There may have been a third light, equidistant between the two and slightly forward of them, but the moment that I thought I saw it was so fleeting that I am hesitant to state with any certainty that there was really one there. From the point at which I noticed the lights until they went beyond the trees was two minutes or less. They travelled roughly 35 or 40 degrees of arc across the sky in that time. The time of sighting above is plus or minus about two minutes. If any other reports are received for this time frame I would like to know."],"Latitude":"40.946515","trends":["There have been no other sightings in McKinleyville","This sighting has never been favorited."],"Object Shape":"Star-like, Unknown","Date Submitted":"10/22/2010 12:37 UTC","Longitude":"-124.10062","Object Features":"Unknown","Case Number":"26023","Date of the Event":"10/21/2010 06:20 UTC","Summary":"Spotted two points of light that moved parallel to each other in a southerly direction","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-10222010-0003","Disposition":"Insufficient Data","City":"McKinleyville","Source":"MUFON","Weather Factors":"None"}