{"Sighting Duration":"00:01:00","Case Number":"26021","map":"<A HREF = \"http://maps.google.com/maps?q=31.513327,+-82.842535(26021)&iwloc=A&hl=en\"> mufon case (26021) map </A>","divs":["Sighting DetailsSitting on couch talking to a friend by phone while looking at the door with glass window when a golf ball looking light very bright pops up and is followed by 3 more in a perfect sequence; like the lights are being turned on one at a time. Lights were coming forward as they came on in perfect sequence with the fourth one a little more forward than the other 3 that were evenly spaced. Once they came on the lights did not move. Then they all went off at the exact same time. I got up and went out the door telling my friend what I was seeing as the 2nd, 3rd and 4th lights were coming on. I told her what I was seeing was very strange. I stepped out on the deck of house as the 3rd and 4th lights came on. The moon was full with a planet in conjunction to the south of the moon almost above my head. There was no sounds, no breeze, and the night was cool. The lights were Southeast and about 45 degrees off the horizon. The event lasted no more than 1 minute. My friend quickly noted the time for me as 9:40 pm Eastern. After the lights went out there appeared to be a small plane with a red light moving from the Southwest to the southeast which crossed over the area where the lights had gone out. The plane proceeded to the east and disappeared in the distance. The white lights were a lot larger than the red light on the plane as that red light was about the size of a ink pen tip and the white lights were as large as a pencil eraser if held at arms length. The lights were perfectly round like golf balls and the roundness was very pronounced.The lights did not have a star shine halo; instead they were perfectly round like a flash light turning on and then turning off. I continued to talk to my friend on the phone while walking on my deck and trying to see if anything else seemed unusual. Sky was clear without clouds and very light outside due to the full moon. No other lights appeared and about 10 minutes later I went back inside still talking on the phone to my friend. Hanging up the phone I then explained to my husband watching TV what I had witnessed. He had seen me get up saying to my friend about the lights and had watched as I went on the deck to observe them closer. He is handicapped and did not attempt to get up and get into his wheelchair but waited to have me tell him what I had seen."],"Object Flight Path":"Stationary","City":"Douglas","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-82.842535","Object Shape":"Circle","Region":"Georgia","trends":["There have been 4 other sightings in Douglas","There were no other sightings in Douglas on or around October 21st 2010"],"Object Features":"Unknown","Summary":"Golf ball size lights come on in sky in a forward arc like sequence and then all go out together","Weather Factors":"None","Disposition":"Unknown","Date Submitted":"10/22/2010 12:25 UTC","Latitude":"31.513327","Date of the Event":"10/21/2010 09:40 UTC","files":["/var/www/straped/mufon/html2text/26021.html.txt","/var/www/straped/mufon/org/26021.html"],"Country":"United States","Log Number":"US-10222010-0001","Tags":"City"}