{"divs":["Sighting DetailsI went outside on my deck. I allways look up at the sky aroung me from my deck to appreciate the morning surroundings. To the right of my deck up in the sky I saw 2 blinking lights move side to side what at first looked like against each other, and I was astounded, because I see airplanes all the time coming in to the Airport . Then I noticed a large streack in the sky associated with the left blinking light, but not the other blinking light on the right. It looked as if the right blinking light was hitting the left light. this occured for several seconds and then both lights disappeared. The large streak in the sky was still there. I called upstairs for a family member to come downstairs and showed them the streak in the sky and described what happened. that person agreed it did not look like a normal size streak from any aircraft we usually see flying over the skies where we live. About a few minutes later the large streak was in the sky to the left of the sky off our deck. I'm guessing from the earth's rotation. I took pictures on my camcorder of the streak because I could not find my camera."],"Date Submitted":"10/22/2010 07:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.045157,+-77.480862(26025)&iwloc=A&hl=en\"> mufon case (26025) map </A>","Latitude":"39.045157","Object Shape":"Unknown","trends":["There have been 11 other sightings in Ashburn","There were no other sightings in Ashburn on or around October 22nd 2010"],"Tags":"City","Object Features":"Undisclosed","Source":"MUFON","Region":"Virginia","Weather Factors":"Unknown","Case Number":"26025","Longitude":"-77.480862","files":["/var/www/straped/mufon/html2text/26025.html.txt","/var/www/straped/mufon/org/26025.html"],"Disposition":"Unknown","Summary":"blinking white lights 2 of them","Date of the Event":"10/22/2010 06:36 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","City":"Ashburn","Log Number":"US-10222010-0005","Country":"United States","Viewing Distance":"Unknown"}