{"Viewing Distance":"Over One Mile","Case Number":"26036","Object Shape":"Cross, Disc","Longitude":"-92.417632","Region":"Louisiana","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Disposition":"Unknown","trends":["There have been no other sightings in Eunice","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsFor two months prior to this event, I had been seeing a strang object in the sky to the south sometimes and sometimes to the west of my home. This usually occured around 9 to 10 o'clock at night. The object gave off many different colors and at times gold beams would come from the bottom of it to the ground. I tried to submit a report to mufon at that time but I guess I did not do it correctly because nothing was logged about it on the site that i could find. About the 9th of January my girl friend and I were coming back from hunting at about 10 at night and as we traveled west on the Hwy 190, I was telling her about the object I had been seeing. Right cue it appeared directly in front of us in the western sky. I told her to look that that was the thing i had been seeing. She was looking at it with me and we were wondering what it could be, natural or UFO or man made, when from the north I spotted another one comeing at a high rate of speed. The one in the west never moved. The one from the north came up to the stationaly one circled it and placed itself next to it and became stationaly also. The two were identical. After about 4 or 5 minutes the one that had come from the north started to go up and toward the west. When it was just about out of sight, it turned and came back east and passed directly over us at a very high altitude. The one in the west remained stationary and was still there when I reached my home. I tried to see it agian about 30 minutes after getting home but it was gone. I have seen it again to the south, and to the west of my home on two occasions. But, it has not been seen since april or may."],"Summary":"T shaped UFO hovering in the western sky was approached by another.","Date Submitted":"10/22/2010 03:25 UTC","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.494367,+-92.417632(26036)&iwloc=A&hl=en\"> mufon case (26036) map </A>","Date of the Event":"01/09/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/26036.html.txt","/var/www/straped/mufon/org/26036.html"],"Tags":"City","Object Features":"Undisclosed","City":"Eunice","Log Number":"US-10222010-0016","Weather Factors":"Unknown","Latitude":"30.494367"}