{"Case Number":"26038","Object Features":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Triangle","Disposition":"Insufficient Data","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around September 24th 2010"],"divs":["sighting detailsmy roommate and i were heading down i-5 (south) and we were a few miles before grants pass heading up a relatively steep hill when i noticed some brilliantly white lights above\\near the peek of the hill. at first we only saw 2 bright lights because of our angle of approach, but as we got further up the hill we could see that there were 3 white lights in a triangular shape and one blinking amber(ish) colored light in the center. we kept driving up the hill discussing what it could be, and decided that it was definitely not any sort of normal plane because it was totally still and looked to be very large. as we drove underneath it my roommate put his head out the window and looked up and said he could barely see the outline of the object and that it was a triangle with the lights in the corners. i couldnt make out the outline because i couldnt stick my head out the window to look up while driving. it was difficult to tell the size of this thing without much to reference it to, but just judging by how long it took to drive underneath this thing and just our perspective of it i would say it was maybe the width of a football field or so. as we went down the other side of the hill my roommate said it must have moved toward the way we came from because we quickly lost sight of it with the peak of the hill obstructing our view. if we could have turned around at that point on the freeway we definitely would have, but we were in a bit of a rush and there wasn't any way to go back the other way for a few miles. ive seen ufo's a couple times before but they were the single bright lights that move in zig-zag patterns, and i never quite believed in the triangular ufo's before this sighting. i obviously believe in them now..."],"Date Submitted":"10/22/2010 03:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.442507,+-123.325152(26038)&iwloc=A&hl=en\"> mufon case (26038) map </A>","Date of the Event":"09/24/2010 12:00 UTC","Summary":"Huge black triangle with brilliantly bright lights on each corner and one blinking amber light in center hovering just over I-5","Object Flight Path":"Undisclosed","City":"Grants Pass","Source":"MUFON","Log Number":"US-10222010-0017","files":["/var/www/straped/mufon/html2text/26038.html.txt","/var/www/straped/mufon/org/26038.html"],"Latitude":"42.442507","Sighting Duration":"Undisclosed","Longitude":"-123.325152","Tags":"City","Region":"Oregon"}