{"Log Number":"US-10222010-0014","trends":["there have been no other sightings in palmdale\\lancaster\\little","This sighting has never been favorited."],"Country":"United States","Case Number":"26034","Viewing Distance":"Unknown","Latitude":"36.788151","Region":"California","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/26034.html.txt","/var/www/straped/mufon/org/26034.html"],"Date Submitted":"10/22/2010 02:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.788151,+-119.411632(26034)&iwloc=A&hl=en\"> mufon case (26034) map </A>","Summary":"stars chasing each other...changing direction, crossing each other very high. Got binoculars, amazing what was going on.","Disposition":"Unknown","divs":["Sighting DetailsStepped out to empty trash. Noticed super bright star, Venus or whatever in the evening sky. I froze in my tracks when it seemed to vibrate. I threw the trash bag at our front window to get my wife's attention...she didn't respond. I didn't want to lose sight of what I was seening, I just stood there. My 12 year old son came out the front door at that moment, asked what the heck I was doing...I told him to get my binoculars. As I looked at what I was certain was a planet...a starlike object moving from that particular point started moving east. It was much smaller than the bright star. However, it was soon being chased by another star that crossed it's path, now somewhat directly overhead. I gave the glassed to my son, and he too saw this happening. Very high, it seemed. No exhaust, no noise...and no blinking lights associated with them whatsoever. Total of about 3 or more starlike objects involved. The went off to the east. I've brought this up to people here and there with the expected responses. Last night I watched a program about UFO's over Edwards. This event took place in Littlerock California....about 25 miles south of that base. I've been looking ever since...and have to date not seen an episode like that again. I do see lots of planes, satelites, space shuttle landings, fighter planes maneuvering with each other in the foothills, all that stuff around here....not even close!"],"City":"Palmdale/Lancaster/Little","Date of the Event":"06/15/1993 12:00 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","Object Features":"Unknown","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Longitude":"-119.411632"}