{"Latitude":"33.783928","Longitude":"-84.294172","Country":"United States","Object Flight Path":"Stationary","Summary":"I saw a glowing oval object with blue, yellow, red lights on bottom and a red light on top.","Date Submitted":"10/22/2010 01:51 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Decatur","Sighting Duration":"00:07:00","Log Number":"US-10222010-0013","divs":["Sighting DetailsI was driving to work down Lawrenceville Hwy. I am always looking up in the sky. I saw this bright object in the sky. It was huge. I kept looking at it. \"What is that?\" I thought it could be an air plane. But it was sitting still. Maybe it could be a blimp. But it was ALL LIT UP. All of it was glowing. The thing did not move. Just sat in the sky. I had to stop at a light and the object was in between 2 trees. I looked to see if it moved behind a tree. No. It was still. I stared hard trying to see what it was. It seemed to glow. It was white or silver. There were lights flickering on an off or jumping around on the bottom of it. I saw one red light on top. The thing scared me so bad. I thought surely other people were seeing it. I even turned on the AM news radio to see if they were talking about it. No. I wish I could have driven toward it to get a better view. But I had to get to work. I slowly drove away from it until I could no longer see it's glow. It is the strangest thing I've ever seen. I told a friend at work. She said she saw the same thing as she came off the interstate ramp. I checked the news that night if anyone reported seeing anything. I even checked the next day. Nothing. So I decided to report it myself. I haven't been able to stop thinking about it. Even during the event. I was trembling. I think I finally saw a space ship."],"Case Number":"26033","Date of the Event":"10/19/2010 07:15 UTC","Weather Factors":"None","Tags":"City","Region":"Georgia","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Decatur","There were no other sightings in Decatur on or around October 19th 2010"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.783928,+-84.294172(26033)&iwloc=A&hl=en\"> mufon case (26033) map </A>","Object Shape":"Egg, Oval","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/26033.html.txt","/var/www/straped/mufon/org/26033.html"]}