{"divs":["Sighting DetailsWalking my daughter's dog and facing north in her complex parking lot. It was partly cloudy with large clear spots. I saw a bright light slightly NW, at about 11:00 and about 60 degrees above the horizon. It appeared to be still and I assumed it was a bright star. As looked I at it, an airplane approached from behind the light, slightly to it's right ( east ) and began to overtake it...I cannot estimate the altitude of either or the distance between them. Visually the plane seemed between 1 to 2 inches east of the light. As the plane approched from behind, the light began to move in the same direction as the plane, toward me. The plane overtook and passed the light which was now steadily moving in the same direction as the plane. The plane was clearly a passenger plane, noise lights etc it passed overhead. It was followed by the lght which, by the time it reached my position, was now clearly 4 white lights... two at the front, two at the back, like auto headlights. Toward the rear was a smaller red flickering light between the two rear white lights. It continued flying south easterly, like the plane but at a slower pace. It made no sound nor could I see a structure of any kind, I have assumed a rectangle by virtue of the position of the 4 white lights. I think the length appeared about half that of the airplane, but I have no idea how close thy were to each other, so this is just a guess. I watched the light(s0 until the disappeared in cloud cover."],"Sighting Duration":"Undisclosed","Latitude":"41.575727","files":["/var/www/straped/mufon/html2text/26047.html.txt","/var/www/straped/mufon/org/26047.html"],"City":"Tinley Park","Source":"MUFON","Country":"United States","Longitude":"-87.779744","Region":"Illinois","Date Submitted":"10/22/2010 10:51 UTC","Summary":"See below","map":"<A HREF = \"http://maps.google.com/maps?q=41.575727,+-87.779744(26047)&iwloc=A&hl=en\"> mufon case (26047) map </A>","Object Shape":"Square, Rectagular, Unknown","Object Features":"Unknown","Disposition":"Unresolved","Object Flight Path":"Straight-line path","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around October 22nd 2010"],"Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"26047","Date of the Event":"10/22/2010 08:15 UTC","Log Number":"US-10222010-0026"}