{"Date of the Event":"10/22/2010 09:00 UTC","Sighting Duration":"01:00:00","Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=33.244281,+-86.816377(26046)&iwloc=A&hl=en\"> mufon case (26046) map </A>","Log Number":"US-10222010-0025","Source":"MUFON","Case Number":"26046","Object Shape":"Circle, Egg, Flash, Star-like","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unknown","Longitude":"-86.816377","Summary":"Saw a very very bright star like object. then it started flashing multiple colors. Got the binoculars and found out it was circular with multicolored lights on the undercarriage.","trends":["There have been 6 other sightings in Alabaster","There was one other sighting in Alabaster on or around October 22nd 2010"],"Tags":"City","Latitude":"33.244281","divs":["Sighting DetailsAbout a week ago, this exact event happened. However, it reoccurred today. My mother spotted the same star-like flashing object once again, so my friend and I rushed outside. We sat outside on my back porch watching this object for about thirty minutes before we realized six other round objects with orange lights around its' circular perimeter all going in the same direction within a five minute time period. After that, we got some binoculars and stared at the object. However, since it was dark we could not make out the exact shape; the bottom portion was circular, but appeared eggish because of the angle. There were about four different colored lights, being pink,blue,green and red. This was the largest and most important UFO which hovered in one spot, then would shoot off very fast for a very small distance. Then, after seeing the colors we noticed a closer UFO that seemed to glide right over us. This one had the same placement of lights, however they were not multi-colored. This had us very nervous as it was way too low down for an airplane to fly. We had my dad come outside to see if he could tell what it was, since he was an ex-marine and knows the types of military planes or helicopters that could resemble it."],"City":"Alabaster","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"10/22/2010 10:49 UTC","files":["/var/www/straped/mufon/html2text/26046.html.txt","/var/www/straped/mufon/org/26046.html"],"Country":"United States","Weather Factors":"None","Object Features":"Unknown"}