{"Source":"MUFON","Date of the Event":"10/05/2010 12:00 UTC","Object Flight Path":"Undisclosed","Tags":"City","divs":["sighting detailswhile staying in playa del carmen, my friend *(name removed--cms\\sg) and i went to our roof top to see the night sky and look for shooting stars. it was a beautifuly clear night no clouds and bright stars. while watching the sky, we both noticed what we assumed to be a jet plane coming from the east , from over the ocean and moving west, towards land and us. we did not mention it to each other but we were both watching it to the point when it was almost directly above .there was no sound and i remember it not moving in a perfectly straight line but meandering somewhat within its course. it had blinking colored lights and possibly a white light. then in an instant, it disappeared. it was no where to be found. no lights or shape of anything. we looked all over the sky for at least 15 minutes or so. it should have been right above us with no clouds or anything to obscure our sight. it simply vanished. about 5 minutes later we saw two jet planes pass in a similar direction that seemed to be unusually close to each other on their flight path. they passed the entire visible sky in normal fashion. when first seeing the object, it caught my attention a little more than normal. just seemed to be moving so quietly and as i remember, the only object moving in the sky. for it to completly vanish has *(name removed--cms\\sg) and i wondering what it was. i asked two airline pilots of our flight home if they ever shut their lights and they said no. just the landing light when high in flight. the were stumped also."],"Country":"Mexico","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=20.632925,+-87.074892(26041)&iwloc=A&hl=en\"> mufon case (26041) map </A>","Summary":"blinking lights that appeared to be a jet airliner then dissapeared","files":["/var/www/straped/mufon/html2text/26041.html.txt","/var/www/straped/mufon/org/26041.html"],"trends":["There have been 2 other sightings in Playa del Carmen","There were no other sightings in Playa del Carmen on or around October 5th 2010"],"Weather Factors":"Unknown","Date Submitted":"10/22/2010 06:29 UTC","City":"Playa del Carmen","Sighting Duration":"Undisclosed","Case Number":"26041","Longitude":"-87.074892","Object Features":"Undisclosed","Log Number":"MX-10222010-0020","Viewing Distance":"Unknown","Latitude":"20.632925","Object Shape":"Other","Region":"Quintana Roo"}