{"Sighting Duration":"00:30:00","Weather Factors":"Unknown","Date of the Event":"12/31/1993 03:00 UTC","City":"Danbury","Log Number":"","Case Number":"2604","Tags":"City","Summary":"Slow moving Triangle UAP that was chased by a smal","divs":["Sighting DetailsI was in the bedroom,putting clothes away, and talking to my husband when I wasdrawn to the bedroom window. I saw what looked like a rather large orange starlow on the eastern horizion. Only no large orange stars appear there any timeof the year. I stood and watched it for about three to five minutes. Itappeared to get larger and was moving in my direction.I got very excited and ran out of the room and went outside. This was ratherodd behavior so my husband followed me. It flew right over our heads. Therewas no sound and you could almost walk under it and keep pace. This seemedamazing because of the sheer mass of it. Then from the about the same directiona small fast jet appeared out of nowhere and flew on a parallel path,at a much higher altitude and flew out of sight. You could heat the jet. Thelarge UAP just floated slowly and silently along. Then it disappeared behind amountain.We live in a major flight corridor so I am familiar with all types of aircraftflying overhead. Military and Civilian Especially at night because I am astargazer.Strange thing, almost a year later, New Years day, about 3am, our neighbors leftour house after spending the night watching movies. We watched them across thestreet as they walked home and all of a sudden they were pointing to the sky. Myhusband and I went outside and watched the same type of UAP, on almost the sametrajectory, floating overhead. Strangely I said It is just our resident alien. No, we had not had any alcohol or anything else that night and the movie wewatched was Casper. Our neighbors were two adults and a ten year old child.The flight path is more accurately ese going nnw. Both times. My reaction thesecond time was almost like this was so redundant that it was almost not worthwatching, as opposed to my first time when I was so excited.This is not the first strange thing I have seen here, but it is the only one Iwill talk about. and it has taken me this long to report itThe years might be wrong either 94 and 95 or 95 and 96, but the month is thesame and the times are the same, and the event was unforgettable, the first tme."],"Object Features":"Undisclosed","Country":"United States","Object Shape":"Triangle","trends":["There has been one other sighting in Danbury","There were no other sightings in Danbury on or around December 31st 1993"],"Region":"North Carolina","Date Submitted":"12/31/1993 03:00 UTC","files":["/var/www/straped/mufon/html2text/2604.html.txt","/var/www/straped/mufon/org/2604.html"],"Disposition":"Insufficient Data","Longitude":"-80.205883","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.409305,+-80.205883(2604)&iwloc=A&hl=en\"> mufon case (2604) map </A>","Viewing Distance":"21-100 Feet","Latitude":"36.409305","Object Flight Path":"Straight-line path"}