{"Longitude":"-77.852628","divs":["Sighting DetailsThe first night I witnessed one of these crafts was roughly two months ago. My mother and I were outside and I was leaving. A bright red orb slowly hovered over the woods across the street. I turned and looked at her to see her in shock. We had both seen the same thing. My next encounter was on my way back to my girlfriends town house where I currently reside. I witnessed the same red object only this time it was following me. It disappeared after about ten minutes. When I first witnessed witnessed these object I thought that they were some form of heat lightning. Since the night of October 14 I have been up late for work. I sit in a living room overlooking a vast range of the appalachian mountains. At first I started seeing a few lights at a time blinking irradicaly. I thought that they were planes until taking a better look. I had a feeling as if I was being watched and I ended up staying up the entire night. From that night on I have seen them every where in this county and I even contacted local authorities. They assumed that I was just seeing things and that they were most likely helicopters. The night of the 16 I was on my way home when I came up on a single police car and I saw a minor wreck. This is after I tried driving though the mountains to find one these crafts I saw from a distance. I stopped as the officer dealt with the civilians and then I saw a glimmer. There were two orbs 20 feet down from the officer moving in ways I have never seen before. I filmed it all with my camera and jumped back in my car overwhelmed with fear. Within ten minutes the area was completely shutdown with law enforcement every where. For the next two nights I witnessed these crafts in the mountains and floating above. I have pictures of them moving in ways that defy physical laws of this earth. I decided to come forward with this information after last night...I had been filming them for the third time at a scenic view here west virginia. This night was different as I heard odd pulsating noises. I got scared for my life and left immediately. That night I woke up at 3 am and felt as if I was being watched. I saw these lights again from my window and took my camera out and began rolling film. The first thing that scared me to death was the moon had a red holographic image coming from the side that I have never witnessed before. I filmed this as well as the lights blinking and lighting up forming a triangle. One of the objects actually came down and sat hovering pulsating lights. I have no desire to make these events up and I am a man of my word. I have roughly 8 hours of film all together and about 200 pictures. I believe this event will change everything."],"Weather Factors":"Unknown","Object Shape":"Bullet, Missile, Cigar, Cone, Circle, Cylinder, Diamond, Disc, Egg, Fireball, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.29555,+-77.852628(26044)&iwloc=A&hl=en\"> mufon case (26044) map </A>","City":"Charles Town","files":["/var/www/straped/mufon/html2text/26044.html.txt","/var/www/straped/mufon/more/26044_submitter_file1__october21016.JPG","/var/www/straped/mufon/org/26044.html"],"Tags":"City","Source":"MUFON","Case Number":"26044","Log Number":"US-10222010-0023","Sighting Duration":"12:59:59","Object Flight Path":"Undisclosed","Latitude":"39.29555","Region":"West Virginia","Date Submitted":"10/22/2010 09:40 UTC","trends":["There have been 2 other sightings in Charles Town","There were no other sightings in Charles Town on or around October 15th 2010","This sighting has never been favorited.",""],"Date of the Event":"10/15/2010 09:00 UTC","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Country":"United States","Object Features":"Undisclosed","Summary":"Ball/Blinking Lights/Pulsating Cigar Shape"}