{"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"SAW DARK SHAPE","Latitude":"39.295535","Disposition":"Insufficient Data","Case Number":"2605","Sighting Duration":"00:00:59","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around December 5th 2002"],"Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.295535,+-76.610309(2605)&iwloc=A&hl=en\"> mufon case (2605) map </A>","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/2605.html.txt","/var/www/straped/mufon/org/2605.html"],"Log Number":"","divs":["Sighting DetailsI was standing at the light rail stop waiting for the next train. I was lookingslightly up at the time. The time approx. 1900-1800. Distance to object -notsure. I was looking at the dark clear sky an i noticed a dark shape movingslowly past. The overall shade of it was very slightly darker than thebackround nite sky but just enough to see it pass in front of stars. It was todark a color and far away to discern its shape. It had either some kind ofwindow or port out of which was lighter in color or dimly lit which is how Inoticed it also. I didnt know what it was. I was thinking it could have beena plane but there were no lights on it like a plane has. I was thinking it wasa ufo and I was overjoyed at seeing it and thought it was cool. It moved veryslowly. Across from me in the same direction was a light rail station light.which started to obscure my vision of the object. I looked away to cross tracksand move away from that light to get a better view. But on returning my eyesto the spot where it was I could no longer find it. I only viewed the object forabout 5 seconds moving a total distance at arms length of about one hand widthapproximately."],"Source":"MUFON","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"12/05/2002 12:00 UTC","Country":"United States","Longitude":"-76.610309","Date of the Event":"12/05/2002 12:00 UTC","City":"Baltimore","Region":"Maryland"}