{"Object Flight Path":"Path then hovering","Log Number":"US-10232010-0013","Latitude":"38.809856","trends":["There have been 10 other sightings in Alexandria","There were no other sightings in Alexandria on or around October 22nd 2010"],"Longitude":"-77.037121","divs":["sighting detailswe left our apartment in alexandria, and thought we saw fireworks from the south\\south-west at first. there were four lights with trailing tails, like a meteor. then the four objects sort of hovered, and the trails caught up\\disappeared because they were no longer falling. then one died out or something, because there were only three. they then seemed to just drift and move laterally at times, and when they did there would be a short trail for a second. this lasted for about 2 minutes or so, as we drove and caught sight of them between buildings. during this time they seemed to be drifting downwards. eventually we lost sight of them for about 1\\2 a minute, and when we had a clear view again, they were gone. we have a few thoughts about what they could have been. they seemed to just south of the pentagon perhaps, so at first we thought they were praticing for an air show, but then planes don't move like that. transformers three has been filming, but we still don't know what that could have been, and why'd they'd film near the pentagon, if in fact that's where it was. we're really just looking for an explanation."],"Date of the Event":"10/22/2010 07:20 UTC","files":["/var/www/straped/mufon/html2text/26062.html.txt","/var/www/straped/mufon/org/26062.html"],"Country":"United States","Region":"Virginia","Weather Factors":"Unknown","Date Submitted":"10/23/2010 01:05 UTC","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Fireball","Tags":"City","Viewing Distance":"Unknown","City":"Alexandria","Object Features":"Unknown","Summary":"Seemed at first to just be 4 meteors or fireworks, which then hovered, and moved laterally with short trails behind. Slowly drifted down.","map":"<A HREF = \"http://maps.google.com/maps?q=38.809856,+-77.037121(26062)&iwloc=A&hl=en\"> mufon case (26062) map </A>","Sighting Duration":"Undisclosed","Case Number":"26062"}