{"Viewing Distance":"21-100 Feet","Object Shape":"Circle","Object Features":"Other","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/26064.html.txt","/var/www/straped/mufon/org/26064.html"],"Latitude":"45.065599","City":"Alpena","divs":["Sighting DetailsI was fishing one night on avery lake. It was pitch dark.the only way i could find the boat launch was looking for camp fires next to it.I had no boat lights. I think it was in august 2009.All of a sudden it was day light for a split second. then i heard this BOOM BOOM boom boom boom. Way off in the distance.Had no idea what it was.The next day a Alpena radio station.Said a possible meteor hit west of them. That is were i live.And thats all that about it. They did tell the deer hunters to look for a strange rock in the snow it might worth something. Around late november. I was staying sister and brother in law.hear in atlanta. Iwas waiting for my home to be set up. My sister does not allow smokeing in her house.So at night i would stand outside on the front porch. Frezzeing to death and look up at the cold clear sky.And watch for satelights. I wouid always see one or two.No city lights the night sky is real clear. I started to see this bright light light so bright you could not make out a shape.not big probaly hovering. At the altitude of a helecopter. Only it was flying in a straight line real slow. NO sound NO beakon lights. I saw it two other times once with my sister and once with my brother inlaw.Doing the same thing never flew fast or zig zag. it wold fly slow straght. Watch it for a while then go dark. One morning in december around 5am it was to cold to smoke outside. I went to the back door proped the storm door open with my foot and held my cigarette out side. So that no smoke came into the house. While i was standing there looking through the glass it was dark. A ball of light with a dark ball in the center. Started comeing down wright in front of me about 50 feet away. It coming down sort of fast steady and controlled. It was so bright almost blinding. But when it went down behind the pine trees. Nothing around it would light up. I lost sight of it.I have deer cams set up in my back yard night vision and still pictures.that trip when a deer comes in contact.I have caught these balls of light on video and still pictures. they are all over my property. These things are starteing to scare me and make mad. I caught one on still photo . This is oct 23 2010. The thing is on the ground not lite up you can make out the ball with the dark center and the deer is stareing right at it. I have no idea what these things are. But iam about ready to get my rifel and start hunting balls of light. Iam 56 years old i dont drink and i dont drug. And iam not crazy. I video of the ball moveing by a deer and still photos of the light around cant figure out how to send them."],"Tags":"City","Longitude":"-83.426423","Date of the Event":"12/12/2009 07:48 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.065599,+-83.426423(26064)&iwloc=A&hl=en\"> mufon case (26064) map </A>","Date Submitted":"10/23/2010 03:15 UTC","Summary":"bright ball with a dark center ball","Case Number":"26064","Country":"United States","Disposition":"Unknown","Weather Factors":"Snow, Light","Region":"Michigan","Log Number":"US-10232010-0015","trends":["There have been 5 other sightings in Alpena","There were no other sightings in Alpena on or around December 12th 2009"]}