{"divs":["Sighting Details I went to the end of my driveway to get the newspaper, the sky was still dark. I noticed a small triangle of lights that had a strange blinking pattern (blink, blink....blink)and were brighter than typical planes I've seen. Object seemed to be located ESE of Salt Lake (North of me, in Sandy)and was headed North-to-south (towards me. I'm unsure of it's altitude, as the only reference I had were the clouds, which it was below.) The sky was too dark to allow me to see an outline beyond the lights, but the lights moved in unison and gave me the impression they were 3 lights on one vessel, as opposed to 3 vessels in formation. It did seem to be traveling about half-again (150%) as fast as typical planes. after almost 2 minites, the object paused in mid-blink and, when it resumed blinking, was moving at the same speed east-to-west. I saw it for another 30 seconds (appox) Then it stopped blinking. (remaining in the pattern.) It was still too dark to see any outline, and I'd figure a plane would'nt have turned thier lights off yet.) About a minute after I first noticed the object I was still assuming it was a plane, but I started to video it on my camera phone (just in case.) Video is available, but I did not see anything on it. An airplane did fly in a somewhat similar path about 15 minutes after the sighting. That was a commercial airplane, still flashing it's lights (different color, pattern and sequence.) I could clearly see the fuselage outline by this time. It seemed to being flying higher than the object was, but still below the cloud cover."],"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.57714,+-111.857622(26060)&iwloc=A&hl=en\"> mufon case (26060) map </A>","Longitude":"-111.857622","Date of the Event":"10/22/2010 07:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/26060.html.txt","/var/www/straped/mufon/org/26060.html"],"Log Number":"US-10232010-0012","Source":"MUFON","Tags":"City","Date Submitted":"10/23/2010 09:35 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"Nocturnal lights, Sudden direction change. Odd flash pattern.","Country":"United States","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around October 22nd 2010"],"Case Number":"26060","City":"Sandy","Region":"Utah","Latitude":"40.57714"}