{"files":["/var/www/straped/mufon/html2text/2607.html.txt","/var/www/straped/mufon/org/2607.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Summary":"V-Formation over Los Angeles","Object Flight Path":"Straight-line path","Source":"MUFON","Log Number":"","divs":["Sighting DetailsAt about 9PM last night a friend and I were sitting outside having drinks on thedeck of the Sky Bar on Sunset Boulevard in Los Angeles at about 9PM. We werefacing south looking out at the city when my friend pointed to his right andsaid jokingly, Here comes a UFO. I looked to the West and there was an objectapproaching on the horizon.It was lights in a V-formation heading directly toward the bar. The lights werenot bright but muted. The formation looked like a flock of geese.At first I thought is was some sort of plane heading to us. Then as itapproached I noticed that the rear lights in the formation were in constantmotion switching positions. This caused me to think that maybe the lights fromthe city were simply reflecting off the underside of a flock of birds in flight.The lights approached and then flew directly over the bar. Whatever theobjectswaswere completely silent and the rear lights appeared to be in constantmotion swithching positions. The air was slightly hazy so it was impossible totell if the lights were a part of single object or each an independent aircraft. Whatever it was relatively large and the open end of the V appeared to be thewidth of a normal aircraft wingspan. I have no idea on the height of the objectbut would guess 5,000-7,000 feet.I stood to follow the object over the bar as it continued northwest and thenlost sight of it as it passed over the hotel and beyond.My initial reaction was to look for a logical explanation but none could befound. I live in Texas and have seen flocks of birds in V formation millions oftimes and these were not birds. Also the motion of the rear lights was almostmechanical not the motion of birds.It was not a normal plane because it was completely silent and the lights werein motion, something that doesnt even happen with the V shaped Stealth aircraft. My friend and I went through various scenarios but none fit, it was trulyunexplainable.Its my opinion that what we saw was not from outerspace but some new technologyfrom our government. The direction of the craft was from the Pacific headingNorthwest toward Nevada. This may seem far fetched but I think the governmenthas created some new means of moving aircraft without noise and without normalaircraft parts. I think the moving lights were somehow being used to stablizethe aircraft as it flew.I am at a loss and am wondering if anyone else saw something in the air over LosAngeles on the night of October 14th."],"City":"Los Angeles","Latitude":"34.058964","Country":"United States","Date of the Event":"10/14/2003 09:00 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Triangle","Sighting Duration":"00:00:59","Date Submitted":"10/14/2003 09:00 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 14th 2003"],"Disposition":"Unknown","Region":"California","Longitude":"-118.241345","Case Number":"2607","map":"<A HREF = \"http://maps.google.com/maps?q=34.058964,+-118.241345(2607)&iwloc=A&hl=en\"> mufon case (2607) map </A>"}