{"Viewing Distance":"Unknown","Country":"United States","Latitude":"33.812387","files":["/var/www/straped/mufon/html2text/26079.html.txt","/var/www/straped/mufon/more/26079_submitter_file2__ufopic.jpg","/var/www/straped/mufon/more/26079_submitter_file3__ufopic1.jpg","/var/www/straped/mufon/org/26079.html"],"Date Submitted":"10/24/2010 04:40 UTC","City":"Long Beach","Date of the Event":"09/04/2010 12:30 UTC","Object Flight Path":"Undisclosed","Log Number":"US-10242010-0004","Disposition":"IFO","Weather Factors":"Unknown","divs":["Sighting DetailsMy friend, a Wedding videographer was filming a wedding reception for a friend who just got married. The Location was called the REEF in the Marina area of Long Beach California. The date was September the 4th, 2010. The time was between 12 and 12:30 PM. It was a clear sky, and a beautiful day. As the videographer was filming the wedding reception, he panned left getting a view of the Harbor, and tilted up slightly. In the frame for 10 seconds were two groups of very brightly colored orbs in a huge circle. They could be clearly seen, and appeared to be quite low. The videographer panned the camera to the right, then quickly back to the left. They were gone, just that fast. The videographer did not realize that he had captured footage of UFOs. It was During the editing of the Wedding video, to the videographer's amazement. That he realized he captured video of objects that are truly out of this world. The videographer who is a friend of mine. Called me on the evening of October 18th, or the 19th. He was excited, exclaiming \"I filmed the aliens, I filmed th aliens\". I asked him, \"what are you talking about\". He then went on to tell me what he discovered, during the editing of the wedding video. Today is Friday the 22nd of October, today is my first time examining the ufo footage. I have to say, I believed it to be an authentic sighting. These ufos were caught on video camera inadvertently. Now you decide."],"Region":"California","Object Shape":"Circle, Diamond, Fireball, Flash, Oval, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=33.812387,+-118.149736(26079)&iwloc=A&hl=en\"> mufon case (26079) map </A>","Summary":"Two groups of ufos in a huge circle that were glowing in the mid afternoon in Long Beach CA Sept 4, 2010","Source":"MUFON","Sighting Duration":"00:00:10","Object Features":"Undisclosed","Longitude":"-118.149736","Tags":"City","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around September 4th 2010","This sighting has never been favorited.",""],"Case Number":"26079"}