{"Region":"Hawaii","trends":["There have been no other sightings in Haliimaile","This sighting has never been favorited."],"City":"Haliimaile","Object Features":"Undisclosed","Country":"United States","Date of the Event":"10/23/2010 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=20.871111,+-156.343889(26076)&iwloc=A&hl=en\"> mufon case (26076) map </A>","files":["/var/www/straped/mufon/html2text/26076.html.txt","/var/www/straped/mufon/org/26076.html"],"Weather Factors":"Unknown","Longitude":"-156.343889","Tags":"City","Disposition":"IFO","Summary":"Very Large Blue, Looked like very Large Planet in night sky, Only moving.","Object Flight Path":"Undisclosed","Date Submitted":"10/24/2010 02:37 UTC","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"20.871111","Log Number":"US-10242010-0001","Object Shape":"Circle, Cross, Sphere, Star-like","Case Number":"26076","divs":["Sighting DetailsAppeared to be 2 to 6thousand feet in altitude Blue Sphere moving in a strait line. No sound as large as your Pinki finger nail when heald at a far. I was on the Phone, Just as it was Over my head directly Up I asked my friend \"Don't all airplanes have red lights and strobes?\" He says \"Yes\" So I go get my father. My nabor hears me yelling at my father \"Get out here if you want to see something very cool\" Neighbor rushes out as well just in time to see the Object after it passed over head. Object Moving FROM West South West Toward East North East. Object Moved about 10 Miles and began to get smaller. And I do NOT mean smaller as in because it was getting farther away thus appeared smaller. I mean as in the light or object was actually getting smaller and smaller till a point at which its smallest it turns Red and then Vanished. DID NOT Vanish because it went out of sight it Vanished because the Light slowly faded down, turns red and then turns off. I woudl have thought it looked like a re entry except NO Tail nor any red color from Heat. Another Possibility My father brought Up was perhaps a space station reflecting the sunlight as it got farther over Earth, earth blocking the sunlight the light fades away. So it woudl be a good idea to research the path of orbit of the space station and see if it is consistant with this sighting. Also was it over Hawaii during this time and Date. However I saw Two Sattlights moments after the Object on an orbit from South to North and both of them clearly In Orbit Looked Hundreds of times farther Upward than this Object. This Object appeared to be Right over head. As I said looked to me like it was between 3 and 6 thousand feet up no More. Its possible it was a Re Entry of some Kind. This would explain the Light being so bright and then faiding away. Though I want to make clear over the 10 Mile Path the light did not faid one single bit. It only began to faid after the end of the 10 Miles. Once It began to faid it was only seconds till it went red and then out completely. If this was a Re Entry I would wonder why an Object woudl be re Entering Earth Right Over Maui. I sure would like to see some research into the Possibilities such as the Path of the Space station to conferm or eliminate that theory. Ect.. Thank you"],"Sighting Duration":"00:02:00"}