{"Sighting Duration":"00:06:00","Longitude":"-96.820762","Country":"United States","Region":"Texas","Log Number":"US-10242010-0002","Summary":"Two Bright Lights Observed Stationary Elev 40 Due South - . Both -1Mag.","Date of the Event":"10/23/2010 07:55 UTC","Object Features":"None","Date Submitted":"10/24/2010 02:52 UTC","divs":["Sighting DetailsOn Sat, two of us were at the back of a friend's property having cigarettes when I became aware that there were 2 very bright stars some 25deg to the right of an extremely clear & bright Jupiter. I knew there were no bright pairs of stars in that section of sky. These were close together about <=1 lunar diameter and they appeared to be mostly stationary or very slight movement \"on the spot\". Left \"star\" was slightly higher than the right by only a few degrees. This pair was about hhalf as Jupiter so I guess mag 1 or -1. II also put the elevation to be around 40deg from my position in Frisco. This would put them over Plano or Richardson if the altitude was great. I stood there watching and I commented to my friend that \"those stars shouldn't be there\" and wondered if a planet had moved to a position near another star. Both were white, there was no discernable disc, no flashing or noise. Heres the interesting part - I watched for some 5mins and the one on the right started to fade and so did the one on the left. But the other stars around them did not. Within 10-20secs both stars faded on the spot and were \"gone\". I checking on their last postion several times in the next hours but there was nothing more to be seen. I checked to see if the ISS was in the sky and it was not. Has anyone else reported these objects ? Thankyou,"],"City":"Frisco","Source":"MUFON","Case Number":"26077","Disposition":"IFO","Object Shape":"Star-like","trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around October 23rd 2010"],"Tags":"City","files":["/var/www/straped/mufon/html2text/26077.html.txt","/var/www/straped/mufon/org/26077.html"],"Weather Factors":"Unknown","Object Flight Path":"Stationary","Latitude":"33.153534","map":"<A HREF = \"http://maps.google.com/maps?q=33.153534,+-96.820762(26077)&iwloc=A&hl=en\"> mufon case (26077) map </A>","Viewing Distance":"Unknown"}