{"Region":"Arizona","Object Features":"None","files":["/var/www/straped/mufon/html2text/26072.html.txt","/var/www/straped/mufon/org/26072.html"],"Longitude":"-110.924679","Latitude":"32.223993","Case Number":"26072","Disposition":"Unknown","Object Shape":"Sphere","Summary":"two orbs revolving around each other","Date Submitted":"10/23/2010 11:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.223993,+-110.924679(26072)&iwloc=A&hl=en\"> mufon case (26072) map </A>","Log Number":"US-10232010-0022","Viewing Distance":"Unknown","Tags":"City","Country":"United States","City":"Tucson","Source":"MUFON","Weather Factors":"None","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around October 23rd 2010"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date of the Event":"10/23/2010 07:18 UTC","divs":["Sighting DetailsMy wife and I were watching the nlcs game on T.V. The inning ended so we went outside to smoke a cigarette. We saw the lites of 3 planes approcing from the south east. We turned to watch them as they were passing, looking toward the north west. My wife saw it first and asked \"whats that\" when I saw what she was looking at it appeared to be two balloons turning end over end around each other. Following slightly above and behind we saw the lights of another plane which looked like it was following. They came from noth west to south east. I asked my wife to get my binochs which she did. When I looked thru them they were turnning over each other, moving to fast to be balloons on a still night. They were not lit. No lights. Just the reflection of the city lights on them. We didn't notice any noise from them, although the sound of the planes may have drowned out any other sounds. When they went out of our sight we came back inside and I checked the time, 7:20 PM. They did not change direction or speed, just kept going until we chould no longer see them. It was obvious they were not bolloons, esp. in the binochs. Just weird. I am reporting this because I whould like to know if anyone else saw them too."]}