{"Region":"Arizona","Longitude":"-111.239862","divs":["Sighting DetailsI was in my bedroom watching T.V. and my then wife started shouting for me tocome outside and see what was flying overhead above the house. The object wasvery enormous, football feild size, and Jennifer was standing outside with herbrother Jesse and his girlfriend Nicole. I was a Police Officer then and Ireported the object to the local Police department. The object moved from theKeams canyon direction toward the Bittersprings area in a matter of 15-20 min.Very quiet moving and this was a daylight sighting around 5 pm in the evening intown with a population of about 8000 people. As soon as I reported it we saw 2military jets follow the object and later 2 helicopters flying from theFlagstaff, arizona area toward the Page, Arizona area after the oject. I knewit was a UFO because nothing in the world is rectangular and can fly. I andeveryone around were stunned with silence, unfortunately no videocamera orcamera at the time, I was too excited too se my very first UFO We watched theobject fade away into the distance. The bottom of the object had what lookedlike mechanical parts, pipes, conduits, boxes, etc. I can only describe it aslooking at the undercarriage of a car. The heighth of the object seemed toappear to be 2 stories high, very rectangular, with sharp corners. No wings orpropellers. I am Randy. I have a grandmother whom does not speak a word ofenglish, she is a Novajo elder whom lives in the woods alone with mygrandfather. She stated that she has seen The new people who live in the heavenson several occassions. She was asked during a family gathering, by my Uncle,what she does alone the woods to pass her time each day, To everyones shockingsurprise she said she waves to the star people that land in the woods sometimesduring the day while she tends the folk. She stated that they only wave to herfrom the distance and they appear to look like children, she was given a sheetof paper and asked to draw the beings and she drew a Grey. She asked us whatthey were and who they are, Our only explaination to her is that they live faraway beyond the stars and that she is lucky to be choosen to see one up close.Some of our family members have seen many silvery flying disks in the NavajoMountain area, especially near the canyon near my granparents place. Thank you,bye."],"Sighting Duration":"00:10:00","Case Number":"2608","Date Submitted":"08/31/1996 05:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.134993,+-111.239862(2608)&iwloc=A&hl=en\"> mufon case (2608) map </A>","Object Features":"Other","files":["/var/www/straped/mufon/html2text/2608.html.txt","/var/www/straped/mufon/org/2608.html"],"Object Shape":"Square, Rectagular","Summary":"Saw a rectangular football feild sized noiseless c","Source":"MUFON","trends":["There has been one other sighting in Tuba City","There were no other sightings in Tuba City on or around August 31st 1996"],"Latitude":"36.134993","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","City":"Tuba City","Disposition":"Unknown","Log Number":"","Country":"United States","Date of the Event":"08/31/1996 05:00 UTC","Weather Factors":"Unknown"}