{"Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.61347,+-122.330171(26086)&iwloc=A&hl=en\"> mufon case (26086) map </A>","Viewing Distance":"Over One Mile","Case Number":"26086","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around October 24th 2010"],"Date Submitted":"10/24/2010 05:33 UTC","divs":["Sighting DetailsI was driving South on Bothell-Everett Highway,a mile from downtown Bothell, with a dark gray sky in front of me. A spot of gray sky started to glow, got brighter, then morphed in shape as if seen through heatwaves. Then, a much darker spot shimmered in the center, and a few seconds later, a craft came through this darker spot, and moved to the right of the now bright spot. The morphing image gradually diffused until it disappeared, leaving just the craft motionless to the right of where the abnomaly had been. I had pulled over to watch this incredible sight for about 3 minutes. The craft remained stationary, but was sufficiently far enough away that I could not discern any details of shape, and was too far away to hear anything. As a pilot, I would estimate the distance from me at 5 miles. A 747 airliner seemed to pass over this craft on its way into SEATAC airport on the base leg. The craft seemed to descend below the tree line, so I continued driving. As I neared downtown Bothell, it was again visible, just sitting in the same spot as before. Wish I had binoculars in my car. I am going to start carrying a set. My reaction was at first, one of shock and awe at seeing such an incredible sight. I started to rationalize it as a regular aircraft, but the way the sky seemed to get so bright (when the sky was a thick gray) defies meterology, and the craft which came through, and then just stoped to the right of the anomaly. Very strange, and the way the opening was ver bright, then had such a darker, shimmery center.. I've seen 3 other craft in my lifetime, but this was my first daylight sighting, and it was a real experience. Please let me know if anyone else has seen this?"],"Weather Factors":"Unknown","Latitude":"47.61347","Object Flight Path":"Hovering then path","Log Number":"US-10242010-0011","Region":"Washington","Tags":"City","files":["/var/www/straped/mufon/html2text/26086.html.txt","/var/www/straped/mufon/org/26086.html"],"Date of the Event":"10/24/2010 01:06 UTC","Object Features":"Unknown","Longitude":"-122.330171","City":"Seattle","Summary":"Rift opened, craft came through","Object Shape":"Unknown"}