{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.451177,+-112.066527(26095)&iwloc=A&hl=en\"> mufon case (26095) map </A>","Sighting Duration":"Undisclosed","Summary":"2 UFOs trailing flames drop down from the upper atsmosphere","Date of the Event":"10/23/2010 07:30 UTC","Latitude":"33.451177","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around October 23rd 2010"],"Region":"Arizona","Disposition":"Unknown","Date Submitted":"10/24/2010 11:41 UTC","Object Shape":"Bullet, Missile, Egg, Fireball, Flash, Star-like","Longitude":"-112.066527","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26095.html.txt","/var/www/straped/mufon/org/26095.html"],"City":"Phoenix","divs":["Sighting DetailsThe Sighting: Around 19:30 in the evening I was in front of the internet cafe \"Cyber Zone\" in North Phoenix having a cigarette. I noticed in the sky 2 objects that were trailing fire behind them. They appeared to be descending from space in the Thermosphere down into the Troposphere. As they were falling there was an audible noise unlike other conventional general aviation aircraft. It was a deep loud rumble. The color of the flames was a golden and white mixture and was very brilliant. After what was about 25 seconds of falling time, the 2 objects leveled out their altitude at about a 20 degree angle off of the horizon while turning to the right. When level the appeared to morph into each there own oval shape. They then began to hold there elevation while traversing the sky, left to right, and then back from right to left, all the while still trailing a flame behind then as they moved. They continued this activity for two and a half minutes before they disappeared and what I would call there corona stopped burning. (2 others witnessed this event with me including the owner of the cafe and his wife.) My Feelings: When I first saw the objects falling, I was trying to process what they could possibly be with deduction from my personal knowledge and life experience. I have seen meteor showers many times in Arizona before. I am also hold an FAA Private Pilot Certificate and have served in the Marine Corps and have seen all different types of military aircraft. I have also viewed missiles launched from white sands missile range in New Mexico that were viewable from Arizona in the past. This is my third sighting in Phoenix and the most amazing. I believe that whatever I witnessed that night was operated with intelligent control."],"Log Number":"US-10242010-0020","Case Number":"26095","Object Features":"Unknown"}