{"Tags":"City","Log Number":"US-10252010-0001","Case Number":"26097","City":"Oklahoma City","Disposition":"Hoax","Date of the Event":"10/24/2010 09:20 UTC","divs":["sighting detailsthis occured in oklahoma city on 10\\24\\2010 at 9:20 pm. my wife and i were sitting in our hot tub (with the jets off) in silence when a white\\ silver looking boomerang craft flew right towards us and directly over our heads. i spotted it coming at us and told my wife to look, which she immediately did. the craft was approx 80' to 100' feet above us, approx 30' wide and 20' in depth, and was completely silent the entire time. it was moving at a slow rate of speed (approx 25 mph) and we watched it go in a straight line past us for approx. 400' when it started to turn sharp right and then totally disappeared. it was not too far from us to go out of sight, but simply just vanished. the moon was almost full and visability was good as there was no clouds at all. there is no doubt in our minds at all that this was a ufo. it could not have been anything else. i have seen a ufo close up before many years ago and know they exist and my wife did not believe in them at all, until now. she always laughed at my story from the past and it was great that she now knows they do exist. please contact me if you have any questions. attached is a web link we found that shows exactly the same craft that we saw. http:\\\\lightsinthetexassky.blogspot.com\\2010\\04\\cloud-disguised-boomerang-shaped-ufo.html"],"Object Flight Path":"Path with directional change","Date Submitted":"10/25/2010 12:42 UTC","Weather Factors":"Unknown","Longitude":"-97.509858","Sighting Duration":"00:00:20","Latitude":"35.4718","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around October 24th 2010"],"Object Features":"Wings","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26097.html.txt","/var/www/straped/mufon/org/26097.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.4718,+-97.509858(26097)&iwloc=A&hl=en\"> mufon case (26097) map </A>","Summary":"Small white/silver boomerang craft observed at close range","Country":"United States","Viewing Distance":"21-100 Feet","Object Shape":"Boomerang","Region":"Oklahoma"}