{"Region":"California","Tags":"City","Longitude":"-119.118113","Viewing Distance":"Over One Mile","Summary":"Saw large white(?) object moving very fast pass behind a mountain","Country":"United States","Object Shape":"Oval","Object Features":"None","Latitude":"37.966902","Date Submitted":"10/24/2010 11:43 UTC","Log Number":"US-10242010-0021","Case Number":"26096","Sighting Duration":"00:00:04","City":"Lee Vining","map":"<A HREF = \"http://maps.google.com/maps?q=37.966902,+-119.118113(26096)&iwloc=A&hl=en\"> mufon case (26096) map </A>","Date of the Event":"10/22/2010 12:00 UTC","Disposition":"Unknown","Source":"MUFON","trends":["There have been 4 other sightings in Lee Vining","There were no other sightings in Lee Vining on or around October 22nd 2010"],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/26096.html.txt","/var/www/straped/mufon/org/26096.html"],"divs":["Sighting DetailsCamping in the Sierras, had finished breakfast and stood to look west into the canyon. I was looking for weather moving in, and the sky was clear. I saw what I thought was a balloon at first glance, but realized was something much bigger at higher altitude. As it passed behind a mountain I realized how large it was and how fast it was moving. It was moving perpendicular to the prevailing winds in the area, from North to South. I saw it for 3-4 seconds before it passed behind the mountain. I was around 8000' elevation. The object would have been in the morning sun, so I can't be sure it was white. It may have been reflective. It was shaped sort of like an oval, but flatter on the bottom and more domed on top. There were no other details I could see, and it moved along a straight line to the South. I'm not sure if this is anything interesting or not, as a large balloon could move quite fast at that altitude. But the object appeared rigid and symmetrical. I've never seen a UFO, and don't really know if this was one. I'm also a licensed pilot, although not current. I was on family property, a place I've been frequenting almost every year for the past 40+. Also worth mention, the weather patterns up there last week were all over the place. We saw rain and hail, some snow, and systems were approaching from the East and West alternatively. I can only comment on the winds in the canyon, which can only go in those directions. Winds aloft, I have no idea on that day. But my estimate of the object's altitude is around 15,000 - 20,000 feet based on the mountain it passed and the fact that I am very near it's base. The minimum altitude it could have been would be (in my opinion) 10,000-11,000 feet to clear the low parts of the surrounding terrain. Even at that low altitude, the object would still have been approximately the size of a house or larger, possibly a large building. It appeared smooth on the outside and didn't \"light up\" or anything. In my opinion, the object had to be moving several hundred knots. It never wavered from its course in the brief 3-4 seconds I watched it. I mentioned it to two other people, who thought I was messing around. They are both California Highway Patrolmen who were also there, but did not see anything and were not outside when I saw it."],"Weather Factors":"Unknown"}