{"Object Shape":"Star-like","City":"Sunol","divs":["Sighting DetailsThe Star shape was Silvery with whitish firey from its rear. It zipped like being unzipped from a Gladbag- or children's toys toppling out- or maybe like darkness-unzipping and out pops the star- as it tripped like it was hopping down 2 stairs at a time.... I was visiting some friends as I stopped on a country road as I enjoy observing the stars,when over in this beautiful SUNOL area. And all of a sudden this star just peeked out from nowhere, 8:30-8:40 PM on Oct 13,2010. WOW! How colorful! AS it swept quickly into the Vargas MOuntainside and disappeared. I waited a little longer to see if another one was coming, but none did. The sky was clear, there were no clouds. The temperature was warm enough that you did not need a jacket. If you were on highway 680- you would have seen it from the angle of driving Southbound to San Jose along the Pleasanton, Sunol Area- and it seemed to just appear as if unzipped from something-not like other shooting stars I have seen over the years. If I had to describe an angle- then it would be difficult,as t was falling like steps.... I would better describe it as time on a clock. It fell at 1:15, lowering at 3:15, lowering at4:15 then out of sight... I just stopped my car, and notice the stars on this small road. I enjoy the fresh air and the breezes, and the night sounds. I have no idea what it could have been, but I figure'd I'd put the information here, maybe someone else might have seen it too. The star was a white vibrant-all through and through-with the silvery look, that carried an interesting whitish fire behind it-and it seemed much larger than other stars I have seen. About 10x larger than other stars that zip across the skies through the night skies......."],"Longitude":"-121.883478","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.601318,+-121.883478(26098)&iwloc=A&hl=en\"> mufon case (26098) map </A>","Tags":"City","Case Number":"26098","Latitude":"37.601318","Weather Factors":"None","Date of the Event":"10/13/2010 08:30 UTC","Summary":"Star in shape with silver flowing whitish firey from its rear","Date Submitted":"10/25/2010 01:59 UTC","Disposition":"Insufficient Data","Log Number":"US-10252010-0002","Region":"California","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Sunol","There were no other sightings in Sunol on or around October 13th 2010"],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26098.html.txt","/var/www/straped/mufon/org/26098.html"],"Source":"MUFON"}