{"Source":"MUFON","Object Flight Path":"Stationary","Log Number":"US-10252010-0007","Date of the Event":"10/23/2010 11:25 UTC","Summary":"Strange smoke and strange object","trends":["There have been 6 other sightings in Columbia","There were no other sightings in Columbia on or around October 23rd 2010","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Case Number":"26104","map":"<A HREF = \"http://maps.google.com/maps?q=39.212024,+-76.856685(26104)&iwloc=A&hl=en\"> mufon case (26104) map </A>","Longitude":"-76.856685","Object Shape":"Cigar, Disc, Unknown","Country":"United States","Disposition":"Unknown","Region":"Maryland","files":["/var/www/straped/mufon/html2text/26104.html.txt","/var/www/straped/mufon/org/26104.html"],"Latitude":"39.212024","Date Submitted":"10/25/2010 05:57 UTC","City":"Columbia","divs":["Sighting DetailsDriving east on MD RT 100 right before the exit for 95. I noticed in the clear sky that there was smoke in a weird pattern. It was almost like somebody drew it in the sky. A couple seconds later I notice a strange object not moving AT ALL. It looked just like those videos of \"UFO's\" that people capture all the time. It was so far away so it was really difficult to tell exactly what shape it was. I told the driver of the car to look at it, and he noticed that the person driving next to us was staring at it too. I expected to see something on the news about it, but I haven't heard anything and that's actually how I ended up on this website. There was no way this was a plane or helicopter or something that I see every single day. When we got the exit for 95 and started heading north, I couldn't see it anymore beyond the trees. I don't believe in any of this stuff, and still am having trouble believing myself that it wasn't something regular. I just thought I'd post in hopes of someone else seeing what I saw. I drew on paintbrush to the best of my ability of what I saw."],"Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Weather Factors":"None"}