{"divs":["Sighting DetailsSo last night, I was with a couple of friends were on a cruise on some country roads while it was raining (around 52 and ridge) and the rain transcended into a crazy, blinding, downpour with some hail, crazy lightening, thunder, the works. It was so frightening we contemplated pulling over, and then fact that we might be about to cross paths with a tornado (there wasnt much wind, looking back on the situation, but this was how severe it was), then out of no where the sky FLASHED a brilliant, almost neon- electric blue, with no trail of source. It happened maybe 3 times, and was terrifying to the core. The light, and color of it did not seem natural. A couple of us were asking out loud what that was. Anyway, survival mode kicked in, and we booked it. First instinct for all of us, was that it was that color could not have been produced by nature, but no one wanted to say anything. My friend described it as it being like \"someone was taking a picture of the whole world\" if the persons flash had a blue covering. What's weird is that in town, approx 10 minutes from where we witnessed the flashing, the storm had not raise remotely any alarm. Now this was the same storm that terrified us to the point where we thought we were going to die. We were shaking a solid two hours after the incident, reflecting on how engaging the light was and how we never felt that feeling of sheer terror before, not knowing WHAT was coming our way."],"Case Number":"26108","City":"Plainfield","map":"<A HREF = \"http://maps.google.com/maps?q=41.620965,+-88.196019(26108)&iwloc=A&hl=en\"> mufon case (26108) map </A>","Object Shape":"Flash","Region":"Illinois","files":["/var/www/straped/mufon/html2text/26108.html.txt","/var/www/straped/mufon/org/26108.html"],"Longitude":"-88.196019","Weather Factors":"Lightning, Rain, Hail, Heavy, Light","Object Flight Path":"Unknown","Disposition":"IFO","Summary":"BRILLIANT NEON BLUE FLASH TAKING UP WHOLE NIGHT SKY","Sighting Duration":"Undisclosed","Latitude":"41.620965","trends":["There have been 20 other sightings in Plainfield","There were no other sightings in Plainfield on or around October 24th 2010"],"Viewing Distance":"Unknown","Date Submitted":"10/25/2010 08:41 UTC","Date of the Event":"10/24/2010 12:00 UTC","Country":"United States","Log Number":"US-10252010-0011","Source":"MUFON","Tags":"City","Object Features":"None"}