{"Object Flight Path":"Undisclosed","trends":["There have been 3 other sightings in Tombstone","There were no other sightings in Tombstone on or around October 17th 2010","This sighting has never been favorited.",""],"Disposition":"IFO","divs":["Sighting DetailsMy wife and I were down from Oregon for my sisters wedding in Tuscon Arizona on Saturday the 16th of October 2010. Sunday the 17th we drove out to Tombstone where they just by chance for us were having Helldorado days which was a lot of fun. As we were leaving Tombstone we stopped at Boot Hill cemetery just at the north end of town. After walking through the cemetery my wife and I were about to get into the car. I looked out over the road (HWY 80) toward the west to take in the scenery out over the desert. That's when I noticed something just hanging there maybe a mile or 1.5 miles high and about 3 miles total distance. It hovered and did not appear to move. It was a little difficult to see with the Sun facing me at about 2 o'clock with the object to the left at 9 or 10 o'clock. At first I considered it could be a hot air balloon but I quickly ruled that out. I thought the sun could be reflecting off of something but that would mean there had to be something there to reflect off of. With the naked eye I could see the dark area on the left and the bright white vertical boomerang shape on the right. I grabbed my camera and took about four pictures, the one I posted is the best image. These images were able to provide much more detail than I could see otherwise. My wife also could see the object as well. With no nearby roads leading out to the object and not knowing what it was we decided to leave after watching it for about ten minutes. During that time it did not appear to move, if anything it got a little closer."],"Object Features":"Undisclosed","Log Number":"US-10252010-0010","files":["/var/www/straped/mufon/html2text/26107.html.txt","/var/www/straped/mufon/more/26107_submitter_file1__tombstone_UFO1_10_17_2010.jpg","/var/www/straped/mufon/more/26107_submitter_file2__tombstone_UFO2_10_17_2010.jpg","/var/www/straped/mufon/more/26107_submitter_file3__DSC04366.JPG","/var/www/straped/mufon/org/26107.html"],"Summary":"Tombstone AZ - Hovering white boomerange with dark oval shape","Date of the Event":"10/17/2010 03:30 UTC","Longitude":"-110.062366","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"10/25/2010 08:40 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.722628,+-110.062366(26107)&iwloc=A&hl=en\"> mufon case (26107) map </A>","Object Shape":"Boomerang, Oval","Case Number":"26107","Latitude":"31.722628","Source":"MUFON","Region":"Arizona","City":"Tombstone","Weather Factors":"Unknown"}