{"Latitude":"39.140448","Tags":"City","Case Number":"26102","Sighting Duration":"Undisclosed","Region":"California","Country":"United States","Longitude":"-121.616911","trends":["There have been 10 other sightings in Yuba City","There were no other sightings in Yuba City on or around October 25th 2010","This sighting has never been favorited.",""],"City":"Yuba City","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"10/25/2010 09:00 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/26102.html.txt","/var/www/straped/mufon/more/26102_submitter_file1__2010-10-1031stanniversary383.jpg","/var/www/straped/mufon/org/26102.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.140448,+-121.616911(26102)&iwloc=A&hl=en\"> mufon case (26102) map </A>","Log Number":"US-10252010-0006","Date Submitted":"10/25/2010 03:15 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Cigar, Cylinder","Summary":"White cylinder with indentation in middle (like a cigar w/band in middle)","Object Features":"None","divs":["sighting detailsi stepped out on my back porch to drink my morning coffee of which i always do every day just to take in a bit of the morning sun. i always look up to the sky just to observe the sparrows in the trees and the honkers of which there are a lot of this time of year. as i scanned the blue sky i noticed a bright white object coming from north and heading south. i immediately thought \"how strange this object looked\". it was a bright white yet transparent looking object. the front and back were rounded just like a long tube. there was a slight discoloration (slightly darker than the bright white\\transparent color of the rest of the object) in the middle which gave it the appearance of a band around it. i listened for \"sound\" but heard none but i also know that you can't always hear a planes engine until they have passed over you somewhat. i learned this because i see a lot of commercial airliners. i knew immediately this object was different because i couldn't see any wings, tail, windows, or a jet stream. it also seemed to move with more ease like it was gliding. i can't explain why i felt that way except maybe because there was no sound. i remembered my camera was on the table so i ran in the house and grabbed it (coincidently it was sitting on my kitchen table because i had been loading my vacation pics into my laptop that morning!) when i got back out on the porch, less than 10 seconds, i noticed it had moved very fast and my nerves kicked in. i felt i needed to just start snapping photo's or else i was going to lose it. i snapped only 3 frames before it was out of sight. i only caught one good enough to show what i saw and i am pleased. i listened for the \"sound\" again but heard nothing. it seemed to be heading south but also \"up\" and it disappeared rather into the high sky before i could blink."]}