{"Country":"United States","files":["/var/www/straped/mufon/html2text/26115.html.txt","/var/www/straped/mufon/org/26115.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.904022,+-77.033846(26115)&iwloc=A&hl=en\"> mufon case (26115) map </A>","Object Shape":"Flash, Star-like","Disposition":"Insufficient Data","City":"Washington","Tags":"City","Case Number":"26115","divs":["Sighting DetailsMy friend and I were walking to the store at around 9:40pm(NewYork eastern standard time) I had just been pointing out to him what I believed to be the crux constellation a few minutes earlier so i was still looking in the sky to see if I could point out any more stars when I had noticed these two flashing lights in the sky coming towards us from the distance. The sky was fairly clear no real cloud cover to obstruct my view to much. The lights were traveling fast, silent, and in sync. If it weren't for the great distance in between them I would have believed that they were connected. These were their characteristics: they flew on a straight line meaning side by side and front and back, they flashed in sync, and they traveled at great speeds with no sound. I think it is important for me to note that when we saw them, we saw them coming an angle that would have been on their left side coming toward us. At no time did they rotate positions. As the objects were getting closer to us they had begun to turn toward the right. This next part is a bit hard to explain. When the objects were coming in our direction the were in a front to back kind of formation, where one was In the front and the other was following in a straight line in the back, but when they had begun to turn toward the right it was as if the one in the back swiveled around to the front or as if the one that was in the front had turned on an axis leaving them both side by side traveling away from me. A better way to describe this is if you were to imagine these two lights coming in to view traveling one behind the other from your right side as you stand forward, and then the whole line that they are traveling on turns 180 degrees leaving the two objects to be flying directly away and In front of you. These objects were high in the sky and traveled fast. When I first saw them I had thought they were planes but I almost instantly ruled that out because where I live planes travel through all the time and this object only had one white flashing light no red or green ones and made no sound considering the great amount of speed at which they were traveling. After initially seeing the objects felt a little bit skeptical on wether it was some sort of plane but soon became very excited when I saw and realized that the objects had very un-plane like flight patterns and characteristics. Finally I would like to say that I am and was a UFO believer before this incident and that I don't and never will believe that Ufos break the laws of physics or do anything that we as humans couldnt do. I believe that the answers lie in our equations and through study we may get to that point to. But mostly it just angers me that these Ufos fly over our heads as if we can do nothing about it. It's belittling."],"Source":"MUFON","Object Flight Path":"Straight-line path","Region":"District of Columbia","Longitude":"-77.033846","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around October 26th 2010"],"Sighting Duration":"Undisclosed","Date of the Event":"10/26/2010 09:42 UTC","Latitude":"38.904022","Viewing Distance":"Unknown","Summary":"I had noticed two separate objects flashing in sync about 200miles away from each other flying on a line as if they were two ends of the same object but they weren't connected even when they turned, as if they were on an axis 1 turned and the other swung","Date Submitted":"10/26/2010 03:47 UTC","Object Features":"Undisclosed","Weather Factors":"Windy, Fog, Medium","Log Number":"US-10262010-0001"}