{"trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around October 25th 2010"],"Country":"United States","Longitude":"-82.571489","Date Submitted":"10/26/2010 11:47 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","divs":["Sighting DetailsMy father and I were outside looking at the sky talking on the phone to a family member. About 7:25pm I noticed a bright white light moving from the southwest going northeast. At first I thought it was a satellite, possibly the space station. We watched it move slowly across the sky at one point going directly over our heads and our house. As it went further east it never lost it's light. All the other satellites I've ever seen have gotten dimmer as they go away from the sun. This never got dimmer at all. It held it's intensity until it went behind the trees and disappeared. I would like to know if anyone can tell me that this was indeed the space station or some other satellite. I know it wasn't an aiplane because it had no binking or flashing lights at all. Also there was no sound at all. We also saw two or three airplanes flying over during the sighting. They all had blinking lights and were obvious airplanes. This was solid white and looked like Venus. When the light didn't fade I began to doubt that we were seeing a satellite. I am going to go out again tonight and see if I can see it again. I will have my camera this time."],"Weather Factors":"None","Date of the Event":"10/25/2010 07:25 UTC","Case Number":"26118","map":"<A HREF = \"http://maps.google.com/maps?q=27.500428,+-82.571489(26118)&iwloc=A&hl=en\"> mufon case (26118) map </A>","Object Shape":"Star-like","Latitude":"27.500428","Log Number":"US-10262010-0004","Disposition":"Insufficient Data","Object Features":"None","Viewing Distance":"Unknown","Summary":"Unknown Light","Region":"Florida","files":["/var/www/straped/mufon/html2text/26118.html.txt","/var/www/straped/mufon/org/26118.html"],"City":"Bradenton","Sighting Duration":"Undisclosed","Tags":"City"}