{"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26125.html.txt","/var/www/straped/mufon/more/26125_submitter_file1__P1100363.JPG","/var/www/straped/mufon/more/26125_submitter_file2__P1100364.JPG","/var/www/straped/mufon/more/26125_submitter_file3__P1100359.JPG","/var/www/straped/mufon/org/26125.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.248003,+-79.881215(26125)&iwloc=A&hl=en\"> mufon case (26125) map </A>","City":"Hamilton","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Country":"Canada","Region":"Ontario","Date Submitted":"10/26/2010 09:46 UTC","divs":["sighting details* link moved to additional evidence section below--cms\\sg. took this at june 13, 2010 around 10:00pm when noticed light outside my window.i though at first was lamp but the shape was to weird to ignore,and i couldn't see it clearly(bad eye sight) so i took out the camera and zoomed in at it,and thought what the heck and pressed record to see if anything odd would happen..really i thought was new lamp neighbours got..but then at around 30 secs into recording it,thing would fade out and in but i could see it still shiny from distense with my eyes and it wasent fading like it was on camera view. also after checking the other video's i took,beside this one.what ever it was has put itself between the neighbours garage brick wall right side and my backyard fence.so its between. also later the neighbours came outside and started pointing to the sky and talking excited about what i prasume was the beams of lights that shot down as you see in the video,i stoped recording when they came out. also i dont think they where aware of the the other entity.i took pictures of it change shape from small ball of light to tall person,i saw it glow like sparkles while i was snapping the picture and saw it burts into light and shoot off some of its body? in the sky. also i would prefer it with no music,but the orginal audio has to much backround sound from my family in other rooms.and i dont want there voices to be herd."],"Case Number":"26125","trends":["There have been 15 other sightings in Hamilton","There were no other sightings in Hamilton on or around June 13th 2010","This sighting has never been favorited.",""],"Date of the Event":"06/13/2010 12:00 UTC","Log Number":"CA-10262010-0011","Tags":"City","Longitude":"-79.881215","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"43.248003","Summary":"beams of light from the sky and enitity","Source":"MUFON","Object Shape":"Flash, Other, Unknown"}