{"map":"<A HREF = \"http://maps.google.com/maps?q=31.720408,+-110.061126(26127)&iwloc=A&hl=en\"> mufon case (26127) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 3 other sightings in Tombstone","There were no other sightings in Tombstone on or around September 30th 2010","This sighting has never been favorited.",""],"Tags":"City","Weather Factors":"Unknown","Case Number":"26127","files":["/var/www/straped/mufon/html2text/26127.html.txt","/var/www/straped/mufon/more/26127_submitter_file1__VACATIONPOINTSWEST2010179.JPG","/var/www/straped/mufon/more/26127_submitter_file2__VACATIONPOINTSWEST2010110-3.jpg","/var/www/straped/mufon/more/26127_submitter_file3__258-2.jpg","/var/www/straped/mufon/org/26127.html"],"Country":"United States","Object Features":"Undisclosed","Date Submitted":"10/26/2010 10:56 UTC","Log Number":"US-10262010-0013","Summary":"UFO hovering over moutain later afternoon, still there next morning","Longitude":"-110.061126","divs":["Sighting DetailsMy husband and I were on vacation visiting Tombstone, Arizona. We were staying at a hotel on the north side of town. Late that afternoon, from 8:00 P. M. Central Standard Time (? Arizonia time) we were sitting behind the hotel facing west toward a mountain. He pointed out to me an object in the sky over the mountain. The mountain was probably two to three miles away and the object several hundred feet above the mountain. At first he thought it was possibly a blimp. I made three photographs. We continued to watch it until sunset. It appeared to be black and continued to hover in the exact same location. He is definitely a UFO skeptic; however he did said that he knew of no plane, helicopter, or blimp that could hover like that. He is a former army paratrooper. The next morning he went outside before I did and spotted it again. I went with him to look. It was in the same spot twelve to fifteen hours later. This time to me it appeared white. He thought it was silver. I made several photos. The sun was bright during the second AM sighting and I could not focus. The photos are not great. I copied and enhanced one. Enlarged it appeared to me to be shaped like a fish. We observed it for a few minutes that morning. As we had many things to do we left the hotel. I did look for it later that morning while visiting Boothill Cemetery and it was not visible. I was anxious when I saw it and continued to be that night and the next day. My husband did not express any anxiety. His interest in looking for it again and the fact that he did not tell me it wasn't anything says he did think it was unusual. The photos are attached. I was reluctant to report it. I have checked this site to see if anyone else did. Someone else reported a similar sighting and I decided to report ours. The photos in which the object appear black were made later afternoon. The one with a white object in the far right corner were made mid morning the next day."],"Latitude":"31.720408","Object Shape":"Other","Object Flight Path":"Undisclosed","Disposition":"IFO","Region":"Arizona","City":"Tombstone","Date of the Event":"09/30/2010 06:10 UTC"}