{"Object Features":"None","Longitude":"-82.795313","Disposition":"IFO","Object Flight Path":"Straight-line path","City":"Clearwater","Latitude":"27.972313","Weather Factors":"None","Region":"Florida","Sighting Duration":"00:02:45","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around October 25th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/26121.html.txt","/var/www/straped/mufon/org/26121.html"],"Source":"MUFON","Date Submitted":"10/26/2010 06:50 UTC","Country":"United States","Log Number":"US-10262010-0007","Date of the Event":"10/25/2010 07:30 UTC","Object Shape":"Star-like","Summary":"Star-like object over Clearwater FL caught on video","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsI went out by the pool Oct 23, 2010 between 7 and 8 to have a smoke. We live in Clearwater FL. and the moon was full and had just come up. It is a populated area so you could only see a handfull of stars and a planet much brighter that I think is Venus. I noticed a bright star-like object overhead heading to the south. It was almost as bright as the brightest star it the sky (Venus). It had no flashers and was a solid point of light remaining the same brightness until it seemed to fade to red and then vanished. I went inside to tell my girlfriend and her 2 kids. THey came out to watch with me and the same type object came from the south headed northeast. Same brightness and no flashing lights. It also faded to red and vanished. Two nights later, 10-25-10, I went back out armed with my video camera. At about 7:30 PM I saw it again coming from the south heading to the northeast and it remained bright like Venus until it vanished in or behind some high clouds. All three cases the object stayed on a straight path at about the same speed. In the video as I follow it with the zoomed in camera, it does pass some stars so you can get an idea of the speed. There was no sound for any of the sightings."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.972313,+-82.795313(26121)&iwloc=A&hl=en\"> mufon case (26121) map </A>","Case Number":"26121"}