{"Log Number":"US-10262010-0014","map":"<A HREF = \"http://maps.google.com/maps?q=33.914908,+-98.487967(26128)&iwloc=A&hl=en\"> mufon case (26128) map </A>","Source":"MUFON","Tags":"City","Latitude":"33.914908","Sighting Duration":"00:00:08","files":["/var/www/straped/mufon/html2text/26128.html.txt","/var/www/straped/mufon/org/26128.html"],"trends":["There have been 12 other sightings in Wichita Falls","There were no other sightings in Wichita Falls on or around October 26th 2010"],"divs":["sighting detailsafter returning home from a social outing around 8:30 pm, just before pulling into my drive, i noticed that the sky was very clear and many stars were visible. i walked through my house to the back yard to see if the moon was coming up as the nights have been so clear. i stood a few minutes watching the skies toward the east. as i watched i noticed movement and a group of star-like lights, i believe 5 in all, in the general shape of a kite or cross or arrow-head moved quickly and silently overhead and slightly to the south, moving westward. i could see the grouping flatten as the object went past, like i was seeing it more from an edge view. in less then ten seconds it passed over and disappeared behind my two-story house. the lights had a slight shimmer or unstable look, like they were being viewed through water or some transparent media. i checked the time and it was 8:45 according to my cell phone clock. as it passed my thoughts were that i wished it would stop or turn so i could get a better look. but it was over so fast i barely had time to take stock of what i'd seen. it seemed impossible to determine the precise elevation, however, i would guess that the object was between 1000 and 5000 feet from the earth. i am a mufon field investigator and am open to suggestions as to what this might be. however, in my opinion, it was anomalous enough in appearance that i decided to report\\document it."],"Object Shape":"Cross, Star-like, Triangle, Other","Case Number":"26128","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"10/26/2010 11:31 UTC","Region":"Texas","Object Features":"Unknown","Disposition":"Unknown","Date of the Event":"10/26/2010 08:45 UTC","City":"Wichita Falls","Summary":"Stepped into my back yard to view the sky and saw a grouping of star-like lights move quickly and silently overhead east to west","Longitude":"-98.487967","Viewing Distance":"501 Feet - 1 Mile"}