{"Object Shape":"Circle, Flash, Square, Rectagular","files":["/var/www/straped/mufon/html2text/26124.html.txt","/var/www/straped/mufon/org/26124.html"],"Latitude":"26.568594","Tags":"City","trends":["There have been 16 other sightings in Cape Coral","There were no other sightings in Cape Coral on or around","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","City":"Cape Coral","Date of the Event":"Unknown","Date Submitted":"10/26/2010 09:38 UTC","Country":"United States","divs":["Sighting DetailsThe sighting occurred in North West Cape Coral, Florida, zip code 33993, near the coast. Witnesses are Hispanic and their voices are heard during recording. One witness, a woman, was sitting resting in a family gathering when observed an unusual red light started to descend in the distance, on the sea or near the coast. She noted it was not a familiar plane light. The approximate distance appeared be a mile or more from the place of observation to where the object could be seen. The light becomes a huge illuminated structure and after a while the woman called other persons in the house to look together at the object. One of the people went in search of a camcorder that could not be found in time. Other people began recording the object with video feature of a common camera. The recording starts when the object was apparently stopped, just before it begins separate into several illuminated structures. The largest section seems elongated; with two rectangles that seems windows in its central part. This section falls outside the field of the camera and recording is focused in two sections that are separated and begin to perform very fast movements keeping close to each other. One of these sections has a small light that rotates in a circle and change colors. One witness says that it is not a light Bengal. There are exclamations of surprise and excitement. The person that handles the camera said: come on, ET! The object disappeared in all its parts suddenly about 2 minutes later. Witnesses did not appreciate sound coming from the object during the event."],"Sighting Duration":"Undisclosed","Summary":"iluminated object separates in several structures near a neighborhood in Cape Coral","Log Number":"US-10262010-0010","Region":"Florida","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Case Number":"26124","map":"<A HREF = \"http://maps.google.com/maps?q=26.568594,+-81.946843(26124)&iwloc=A&hl=en\"> mufon case (26124) map </A>","Source":"MUFON","Longitude":"-81.946843","Object Features":"Undisclosed","Disposition":"Insufficient Data"}