{"Tags":"City","Date of the Event":"10/03/2010 12:00 UTC","Country":"United States","Region":"California","Summary":"Elongated Triangle","Object Shape":"Square, Rectagular","Object Flight Path":"Straight-line path","Longitude":"-120.987848","map":"<A HREF = \"http://maps.google.com/maps?q=37.646727,+-120.987848(26134)&iwloc=A&hl=en\"> mufon case (26134) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsI witnessed a black triangle in the sky on October 3rd, 2010, on a Sunday. According to my notebook: \"Saw the black triangle moving slowly from south to north -- just east of us. Wish I had my camera out there, and it did have the telephoto lens on it! It would have been so simple.\" I do not believe these triangular types of UFOs are extra-terrestrial, but I do know about Skunk Works, and all of the things the government experiments with there. This black triangle (an elongated triangle style) was most likely one of those. Just wish I had gotten that picture. I was in my backyard on that Sunday morning, and heard the sound of a jet. We live not too far from an airport, so that is nothing unusual. I enjoy watching the planes and jets flying overhead. It was high overcast clouds that morning. I looked to the west where the sound was coming from, and then to the east, and saw the black triangle, and it was at quite a high altitude, but I could still see it was a black triangle. I know the jet sound was not coming from it. I did not see the jet the sound was coming from, but may have been out of sight because of trees. The triangle was too high for making that much of a sound, anyway. The black triangle moved very slowly in a straight line from south the north. It simply vanished into the distance, and took quite a while to disappear. I thought about getting my camera, but was afraid it would disappear before I could get to it."],"files":["/var/www/straped/mufon/html2text/26134.html.txt","/var/www/straped/mufon/org/26134.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10272010-0006","Source":"MUFON","Date Submitted":"10/27/2010 12:42 UTC","Weather Factors":"None","City":"Modesto","trends":["There have been 48 other sightings in Modesto","There was one other sighting in Modesto on or around October 3rd 2010"],"Object Features":"Unknown","Case Number":"26134","Disposition":"IFO","Latitude":"37.646727"}