{"Disposition":"Unknown","Sighting Duration":"00:02:28","Weather Factors":"Unknown","Object Shape":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"10/27/2010 02:56 UTC","Date of the Event":"10/25/2010 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.300566,+-82.98247(26139)&iwloc=A&hl=en\"> mufon case (26139) map </A>","files":["/var/www/straped/mufon/html2text/26139.html.txt","/var/www/straped/mufon/org/26139.html"],"Longitude":"-82.98247","Region":"Florida","Country":"United States","Summary":"Reoccurrin sightings","Source":"MUFON","Log Number":"US-10272010-0011","trends":["There have been 3 other sightings in Live Oak","There were no other sightings in Live Oak on or around October 25th 2010"],"Tags":"City","City":"Live Oak","divs":["sighting detailsfrom: *(wit's name and email address deleted--cms\\sg) sent: wednesday, october 27, 2010 11:10 am to: **(email address deleted--cm\\sg) subject: aliens an angels by *(wit's first name deleted--cms\\sg) dear miss ***(name deleted--cms\\sg) there was an object ufo move from south to north very slow and close to myself about 200 to 600 feet from ground i believe. this one came out from swanee river or underground springs that connect each other.this event was from 7;25p.m. to 7;32p.m. look like rounded and shiny complete no noise and moving very show.they were doing an observation on me.because i am part of they. second object ufo after i move to a different location.i see a another object at high altitude move from west to south east at 7;53p.m. to 7;55p.m.this one pass near by a strong lightning storm. this object moving in straight line. like the first one no sound and no smoke or fire left behind. third object ufo .i was located at same location of the second object time 8;01 p.m.to 8;04 p.m .very high altitude and hard to seem. moving from north to south in zigzag movement. also close to the big lightning storm. this one disappear on the sky. this event happened on the day october 25 .2010. on a clear sky with a lining storm some were south east i believe from the point i was located. about 15 miles south away from the small town of live oak. very clear sky. conclusion since my accident happened in 1971 -1972 that i believe and proof. that i am part humans an part aliens that was the day that i reborn and aliens took over my body to do not let me to die and use my body as a part of they i believe that i have some powers.and the ability to communicate with they.i know is hard to believe but this is happening to me right now.and i have all of this mysteries writhing down in a manuscripts. when the time come i will opened my manuscript to and show all this mysteries."],"Latitude":"30.300566","Case Number":"26139"}