{"Tags":"City","trends":["There have been no other sightings in Nelsonville","This sighting has never been favorited."],"Summary":"triangle shaped lights under object dark in color very silent =no noise","Country":"United States","Longitude":"-82.231816","Object Shape":"Triangle","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.458681,+-82.231816(26136)&iwloc=A&hl=en\"> mufon case (26136) map </A>","files":["/var/www/straped/mufon/html2text/26136.html.txt","/var/www/straped/mufon/org/26136.html"],"Object Flight Path":"Undisclosed","Case Number":"26136","Sighting Duration":"Undisclosed","City":"Nelsonville","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Latitude":"39.458681","Disposition":"Unknown","Date Submitted":"10/27/2010 02:17 UTC","Region":"Ohio","Date of the Event":"03/28/2009 12:00 UTC","divs":["Sighting Details My wife and I were vacationing in Hocking County, Ohio on March 28,2009. We rented a cabin up on a ridge that looked down on a small valley. Our cabin had several sky lights in the loft bedroom. It was a beautiful warm dark,clear night around 10:00 pm. We opened the window in the loft bedroom and was settling in for the night. I was lying in bed looking thru the skylights while my wife got ready for bed. Suddenly there was a flash of bright light with no sound. As I watched thru the skylight, a large, dark triangle object floated over the cabin with lights underneath the object.They were not landing lights of a plane. They appeared to be recessed lights and still no sound. I asked my wife if she saw the light.She stated that she saw a flash, but, was unsure what it was. She ran down the stairs and onto the deck at the rear of our cabin. She did not see anything unusual at that time. Our neighbors in another cabin up the ridge had a dog. We noticed that the dog was barking. Then, all got quiet. We felt no fear at this time-just curious. We saw nothing on the area local news that weekend. However, upon returning home, my nephew ( who lives in central ohio) called to say that several strange lights were reported in southeastern Ohio that night. WE were watching UFO sightings on the T.V. several months later and I saw the same triangle. I am unsure what to make of this encounter. However, I know what I saw that warm March night. As of this time, I have not viewed any thing of this nature since the first encounter."],"Log Number":"US-10272010-0008"}