{"Latitude":"41.245223","Date of the Event":"10/27/2010 02:45 UTC","files":["/var/www/straped/mufon/html2text/26131.html.txt","/var/www/straped/mufon/org/26131.html"],"Country":"United States","Case Number":"26131","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Summary":"Bright white light in the western sky in a location where I'm not accustomed to seeing bright stars","Object Flight Path":"Stationary","Longitude":"-82.605933","Date Submitted":"10/27/2010 08:09 UTC","Object Features":"None","Disposition":"Insufficient Data","Weather Factors":"Unknown","Log Number":"US-10272010-0003","Object Shape":"Sphere","trends":["There have been 2 other sightings in Norwalk","There were no other sightings in Norwalk on or around October 27th 2010"],"City":"Norwalk","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.245223,+-82.605933(26131)&iwloc=A&hl=en\"> mufon case (26131) map </A>","divs":["Sighting DetailsMy wife an I have previously seen an unusual bright light in the sky from our upstairs bedroom window in the north-western sky, usually around two AM. We've seen it periodically over a period of about three years but have not seen it for about a year. At 02:30 AM on October 27, 2010, our dog woke us indicating he needed to go outside - a very unusual occurence. I dressed and took him out on his leash. His behavior while outside was normal. As I walked from the back of the house to the front of the house along the sidewalk running along the East side, I saw a very unusual and very bright light in the western sky. It was motionless, appeared to be at quite a distance, but I could hear a perceptable though faint hum. My wife dressed and came out on the front porch and we watched it together. She characterized the noise as the faint sound of a vacuum cleaner. I watched it through binoculars. At one point it appeared to be a large lighted spherical object with a smaller spherical object in front that was unlit and positioned so as to occlude the view of part of the lighted object (similar to the appearance of a partial lunar eclipse). At another point, it appeared as two slightly out of round lighted sperical objects pressed together, one above the other in a figure 8 pattern. The object was at a bearing of approximately due west (270)and at an azimuth of 40 to 45 degrees above the horizon. It was significantly larger than the visible stars and about one fouth the sixe of a normal full moon. We returned to bed. A arose for woke and left the house at about 05:15 EST. The object was no longer visible. First, is there a record of any normal heavenly body visible from my area at the time and location that I described (ther was recent news report about alignment of Jupiter and another planet - weeks back and reported to be visible in North Western sky)? Second, I found your case 26105 and was intrigued by the similarities other than the time (0745 GMT vs 19:28 GMT)."]}