{"Object Features":"Undisclosed","Case Number":"26143","Object Shape":"Disc","Source":"MUFON","Date of the Event":"05/29/2010 01:40 UTC","Tags":"City","Longitude":"-116.417389","City":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","Disposition":"Hoax","Region":"Nevada","trends":["There have been 2 other sightings in Unknown","There were no other sightings in Unknown on or around May 29th 2010"],"Date Submitted":"10/27/2010 10:31 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.80965,+-116.417389(26143)&iwloc=A&hl=en\"> mufon case (26143) map </A>","Sighting Duration":"Undisclosed","Latitude":"38.80965","divs":["Sighting DetailsMy girlfriend and I flew from San Francisco to Atlanta for a family visit. About an hour or so into the flight (1:40pm PST) my girlfriend, who was sitting in the window seat, was talking to me about something. I was sitting right next to her in the aisle seat feigning to listen when a bright object passed from the right to the left of the plane window. It caught my eye immediately because I was turned toward her and staring out the window as she talked away. I immediately asked out loud, \"What the hell is that?\" She looked too and we both sat and watched the object \"fly\" by the plane for about 10 seconds until the tiny window obstructed our view. We even wrenched our necks and pushed our faces into the window to keep it in view. We then turned to each other and asked what we just saw. We both said exactly the same thing. A whitish, greyish metallic disc flew by our window. It had no wings, no tail, no windows, no markings, no trail and no lights. It seemed completely smooth all around except there might have been a slight ridge running along the bottom of the disc. Instead of the classic cliche disc which tends to look like two frisbees stacked together, it appeared to us as only one large frisbee with the rounded top, tapering down on either side into a flattish bottom. It was in the middle of the day, it was sunny, the sky was completely clear, and we were above the clouds. The stewardess told us we were at approx 14,400 feet. The only discrepancy in each of our descriptions is that I felt as if it \"flew\" by us in the opposite direction while she felt it could have been sitting still as we flew by it. A potentially interesting note is that before and after the \"sighting\" we commented aloud on how many airplanes there were in the sky that day. There were seemingly tons of them, everywhere, some close and some far. I mention this because the thing we could not decide on was how close the object was to our plane and hence its size. We really didn't have a reference, except that even the planes that passed the furthest from us, way out there, we could still clearly see that they had wings and tails. Shortly after, I wrote a note on a piece of paper and handed it to a stewardess to hand to the captain. It said: Captain, About 10 mins ago (roughly 1:40pm Pacific Time) my girlfriend and I witnessed some kind of craft flying past us on the left side of our plane. We thought it could have been a plane, but it didn't look like it had any wings or tail. Honestly it looked like a greyish, white reflective disc. Did you see it? Was it a plane? Thank you, Seat 30B After reading my note to the captain over a cockpit phone or whatever it was (she said for security reasons she couldn't just walk in), the captain said he was reading a magazine so he didn't see anything but he did say, based on the time, it was no plane."],"Summary":"We were flying from San Francisco to Atlanta and about an hour or so into the flight my girlfriend and I both saw an off-white, grayish metallic looking disc pass by us through the airplane window. It was in our sights for no more than 10 secs.","files":["/var/www/straped/mufon/html2text/26143.html.txt","/var/www/straped/mufon/org/26143.html"],"Log Number":"US-10272010-0015","Viewing Distance":"Unknown"}