{"Longitude":"-118.316971","Country":"United States","Disposition":"Unknown","Date Submitted":"10/27/2010 09:29 UTC","Object Features":"Undisclosed","Date of the Event":"10/26/2010 09:20 UTC","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.013798,+-118.316971(26142)&iwloc=A&hl=en\"> mufon case (26142) map </A>","Region":"California","Tags":"City","Viewing Distance":"Unknown","Summary":"all i saw were the three triangles w/ red/white lights, and two circular things on bottom.","Log Number":"US-10272010-0014","Sighting Duration":"Undisclosed","City":"Los Angeles","Case Number":"26142","divs":["Sighting DetailsI heard the dogs around my house going crazy barking, last night about 9:20 p.m. Pacific standard, in leimert park california. My dog started whining and barking so i let him out and went out to see what they were barking at. At that moment something went slowly over my house, not too high up a little higher than the rootops not high like airplanes, it made no noise whatsoever at all and the dogs were going crazy. It was dark, so i couldn't see it all completely all i could see were the three triangles on the back but i think it was like a long flat rectangle shape, kind of like back lights on a car, but they had little bulbs on the triangle part with red and white alternating lights..then i could see these two circular things on the bottom, probably like jet engines or something...anyway it went slowly over the house, i ran back in to get my phone to take a pic but by then it was out of focus. I stood there wondering if i really saw what i had just seen, i am not sure what the heck it was but i have never ever seen anything like that before. Why were the dogs going nuts? We have a lot of \"scramblers\" that go over this area, it's a known drug part of town within blocks of me. I will be watching the tv and it will scramble when the helicopters go over, but this was NOT a helicopter, it made no sound whatsoever. When i first noticed it, i was sure it wasn't anything i had ever seen before, i called my neighbor to come out, but he was late getting there, he said i could tell on your face u saw something...just the look on it. I don't know what i thought it was. i have no idea. just weird. it just went straight over my house in a straight line, very slow toward the east. After seeing it i was scared, wasn't sure what it was and what it meant that i saw it. Just disbelief in what i saw in general. I lost sight of the object as it disappeared over the roof of a house in the distance."],"Source":"MUFON","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 26th 2010"],"Latitude":"34.013798","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26142.html.txt","/var/www/straped/mufon/org/26142.html"]}