{"Country":"United States","Object Shape":"Bullet, Missile, Diamond","Disposition":"Hoax","Log Number":"US-10282010-0001","divs":["sighting detailsat 9:35 my wife was in the hot tub and i was in the suana outside right next to the hot tub when she yelled for me to come out. she saw a white 80' long pencil\\rocket shaped oject with rocket type fins on the back flying approx. 80' overhead and directly over her. it was going north to south at approx. 25 mph. i came out and missed seeing it right when she lost sight of it. as she was freaked out and telling me about it, i was looking up and saw a light red diamond shaped craft about the size of an f16 taking the exact same flight path as hers and the same height and speed. i could not get her to look up in time to see it as she was too excited about what she saw. i watched it go out of sight. both craft were completely silent, very low, no lights, and flew directly over our hot tub. this is the 3rd different shaped craft that has flown over our hot tub in 4 nights. on sunday night 10\\24 we both saw a boomerang shaped craft take the exact same path over us. we do not understand how or why this is happening to us..."],"Date of the Event":"10/27/2010 09:35 UTC","City":"Oklahoma City","Weather Factors":"None","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.47082,+-97.513028(26151)&iwloc=A&hl=en\"> mufon case (26151) map </A>","Source":"MUFON","Viewing Distance":"21-100 Feet","Region":"Oklahoma","Sighting Duration":"00:01:00","Summary":"Close sighting of 2 different shaped craft 20 seconds apart in the same spot","trends":["There have been 78 other sightings in Oklahoma City","There were 4 other sightings in Oklahoma City on or around October 27th 2010"],"Object Features":"Undisclosed","Date Submitted":"10/28/2010 12:12 UTC","Latitude":"35.47082","files":["/var/www/straped/mufon/html2text/26151.html.txt","/var/www/straped/mufon/org/26151.html"],"Case Number":"26151","Tags":"City","Longitude":"-97.513028"}