{"City":"Grand Ronde","files":["/var/www/straped/mufon/html2text/26152.html.txt","/var/www/straped/mufon/more/26152_submitter_file1__5-13-06UFOsGrandeRondeOregon1.jpg","/var/www/straped/mufon/more/26152_submitter_file2__5-13-06UFOsGrandeRondeOregon1(contrast-zoom).jpg","/var/www/straped/mufon/org/26152.html"],"Region":"Oregon","Longitude":"-123.604057","map":"<A HREF = \"http://maps.google.com/maps?q=45.069023,+-123.604057(26152)&iwloc=A&hl=en\"> mufon case (26152) map </A>","Case Number":"26152","Date of the Event":"05/13/2006 03:30 UTC","Sighting Duration":"00:00:01","Object Flight Path":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","trends":["There has been one other sighting in Grand Ronde","There were no other sightings in Grand Ronde on or around May 13th 2006","This sighting has never been favorited.",""],"Summary":"Three disc shaped objects unknowingly caught on film on a sunny day in the Oregon coastal mountains","Tags":"City","Log Number":"US-10282010-0002","Country":"United States","Latitude":"45.069023","Viewing Distance":"Unknown","divs":["Sighting DetailsThe UFO's were not noticed until I got home and looked at the pics. I'm pretty observant and noticed the UFO's immediately. Their shape stood out to me as classic UFO shapes. Their orientation is a bit odd as they're not parallel to the ground as you might expect; they all appear to have different flight paths (strange). Anyway, it was a sunny day in the coastal mountains near Grand Ronde, Oregon. We were about 5 miles due south of the town. There were 3 of us couples in 3 4x4 vehicles... We had been exploring all day. We began taking pictures while on top of a high peak. There was an interesting rock structure on top and we had been taking pics of our vehicles on parked top of it. We placed a geocache there and made a small rock cairn in the rock structure and took a pic of it. This picture shows the UFOs. I have many photos taken from this spot that day. Sadly, another one of the photos shows what I believe is 2 of the UFO's but I accidentally re-sized the photo when I got home that day and the quality got cut down making it almost useless. All other photos show nothing, just clear blue skies. I'll also include a pic that I adjusted the contrast and shading which resulted in making the UFO's stand out more... I'm currently working on getting the photos from the other guys that were there that day to see if there's anything in them... Pic1: 3 UFO pic Pic2: 3 UFO pic + contrast + crop (zoom-in) Pic3: 2 UFO pic"],"Disposition":"Unknown","Date Submitted":"10/28/2010 01:35 UTC","Object Shape":"Disc"}