{"trends":["There have been no other sightings in Greenford","This sighting has never been favorited."],"Region":"Ohio","Object Shape":"Sphere, Star-like, Triangle","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Sighting Duration":"Undisclosed","Object Features":"None","files":["/var/www/straped/mufon/html2text/26150.html.txt","/var/www/straped/mufon/more/26150_submitter_file1__ufosighting.jpg","/var/www/straped/mufon/org/26150.html"],"Weather Factors":"None","Case Number":"26150","Summary":"I looked up in the night sky and saw a bright, solid pure white light in the shape of a triangle.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.943948,+-80.791469(26150)&iwloc=A&hl=en\"> mufon case (26150) map </A>","Date of the Event":"10/27/2010 08:00 UTC","Source":"MUFON","divs":["Sighting DetailsShortly before 8pm ET, I pulled into my driveway and stopped the car so my husband could get the mail. He got out, closed the door, and walked to the mailbox, which is on a post at the intersection of our driveway and our road, on the passenger side of the car. I hit the button to roll down my window, and looked up to watch it come down so I could stop it part way (it's chilly out). When I looked up, it was RIGHT THERE. It was either huge or really close, and positioned just north of my car (car was facing east). It was an incredibly bright, pure, solid white light in the shape of a triangle and it was in the process of rapidly increasing in intensity. Like quickly turning up a rheostat, which gave me the impression that it was growing brighter AND larger. My brain was screaming helicopter, but there was no sound but the bawling of the neighbors cattle, and nothing but that solid white triangular light. Life flight goes by here all the time, so I know what that looks and sounds like. I knew better. I immediately screamed for my husband to look up, as I was leaping out of the car. By the time I got out of the car, it had dimmed and decreased slightly in size. As it quickly floated away, it lost it's triangular shape and became a fuzzy ball. It headed north, running parallel with our road. Then it stopped a few fingers above the northern horizon line. My 12 year old daughter exited the back seat on the passenger side and ran around the car to see what was going on because I was out of the car and still calling my husband's name. She came and stood beside me, she was frightened because I was yelling and pointing. She witnessed a ball of shiny white light that looked fuzzy in the middle. It was stationary then began moving back towards us just as my husband arrived. (He had been looking in the mailbox with a flashlight and missed the entire thing. It had to have flown RIGHT over his head). It pulsed a few times then started moving away again, a few seconds later it moved up and to the right and became stationary. My daughter saw it flash red three times while it was moving up and to the right. I did not see this. Sadly, my husband has poor vision from cataract surgery, wears bifocals, and never saw anything. Please note that my daughter has perfect vision, and that I wear glasses for astigmatism with a crizal antiscratch coating, which I was wearing at the time of the sighting. The object was close to the horizon and we have ambient light issues from the neighboring town to the northeast, so it appeared to fade in and out of existence. We believe that at some point it actually disappeared and we started seeing Dubhe, as the big dipper was just starting to rise. This entire incident took place in a very short time, approximately 5-10 minutes, but felt like a lifetime. My husband pulled the car down to the bottom of the drive while my daughter and I walked home. It's about 180 feet from the top of the drive to where we park our car. My husband and daughter went up to the house, I stayed outside for a while to see if anything else appeared, then also went to the house. After pulling myself together I decided to write this report. A few notes... This was not a plane. We are on the PIT-ORD flightpath so we see a lot of air traffic. We also see some New York and CLE traffic to the north. There are 2 small airfields within 10 miles of the house. We are also frequently buzzed by transports from the Youngstown air reserve station in Vienna. The Ravenna Army Ammunition Plant is about 30 miles north west of us. There was actually quite a bit of normal air traffic during the sighting. This was not a meteor, we watch the Perseids every year. This object moved with control and intent. It did have the radiance, but not the tail, of an earth grazer, which I have seen. This was a solid triangular shaped light, NOT 3 lights in a triangular formation. A few cars passed us while this was happening. It was early in the evening. Please, if you saw this thing, file a report. Thank you for your time."],"Date Submitted":"10/27/2010 11:54 UTC","Disposition":"Unknown","Log Number":"US-10272010-0022","Latitude":"40.943948","Longitude":"-80.791469","City":"Greenford"}