{"Date of the Event":"06/30/2005 12:00 UTC","Country":"United States","Case Number":"26159","Object Flight Path":"Stationary","Disposition":"Unknown","Log Number":"US-10282010-0008","divs":["sighting detailsi was living in an apartment building at the top floor looking towards the sutter buttes. i faced west and had a blind down to block the sun. i went outside to raise the blind and saw in the almost totally darkened sky a disc which i would estimate as being the size to fit into a four block area. it was about 300-1000 feet above me giving off only a slight humming sound. what surprised me the most is that a vibration was given off to me with a great sense of peace and comfort and that i didn't need to look any further. i then went inside and waited about 20-25 minutes and went back outside on my patio and the disc was still there. it was harder to see the outline but the absence of stars in that area helped me determine the shape and size. it hadn't seemed to move at all. the sense of peace was still there. i also had the feeling that i shouldn't talk about it. i did tell my sister the next day but this is the first time i have become public with the sighting. a few years before that i sent in a photo taken near the sutter buttes showing a very large disc. the response i got from mufon was that there were two more discs that were harder to determine. i have believed most of my life in ufo's. i had worked with the federal government for 10 years with the air force and know how they treat sensitive information. i was the type that never asked questions about anything sensitive so i was determined to be safe for such discussions but it never happened. this wasn't my first experience with ufo's\\aliens but is the one that i am willing to discuss today."],"City":"Yuba City","Longitude":"-121.609371","map":"<A HREF = \"http://maps.google.com/maps?q=39.142138,+-121.609371(26159)&iwloc=A&hl=en\"> mufon case (26159) map </A>","files":["/var/www/straped/mufon/html2text/26159.html.txt","/var/www/straped/mufon/org/26159.html"],"Summary":"A disc with a cut out area suitable for a pilot station","Tags":"City","Source":"MUFON","Date Submitted":"10/28/2010 04:01 UTC","Region":"California","Viewing Distance":"101-500 Feet","trends":["There have been 10 other sightings in Yuba City","There were no other sightings in Yuba City on or around June 30th 2005"],"Weather Factors":"None","Sighting Duration":"Undisclosed","Object Shape":"Disc","Object Features":"None","Latitude":"39.142138"}