{"Log Number":"","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=45.31278,+-107.93639(2615)&iwloc=A&hl=en\"> mufon case (2615) map </A>","Sighting Duration":"00:10:00","Viewing Distance":"501 Feet - 1 Mile","Summary":"Three white lights forming a triangle","Source":"MUFON","Latitude":"45.31278","Case Number":"2615","Date of the Event":"09/13/2002 05:30 UTC","Weather Factors":"Unknown","City":"Fort Smith","Object Features":"Undisclosed","trends":["There have been no other sightings in Fort Smith","This sighting has never been favorited."],"divs":["Sighting Details1. Standing on porch smoking cigarette.2. The brightness and location of the lights.3. Ther should not be lights in this location.4. Just watch until out of sight.5. Three lights forming a triangle, moving very slowly.6. Went behind a hill.Here is a full account of this sighting.Three bright lights with no sound.It was 530am on the morning of Sept. 13, 2002. I was stand on the porch of themotel I was staying at. The porch has a clear view to the W through NNW. I waslooking in a WNW direction when I saw three bright white lights in a triangularshape or formation. I estimate these lights to be 12 of a mile from my location.The lights appeared to be moving in a NW direction at the speed of a smallaircraft 120 kts or less. They were at about 20 degrees above the horizion. Asthe light were moving away from me The front light went out. I dont know if thisdue to the light being turn off or if it became obstructed by part of the craft.I can not say this was one craft or three as it was to dark to see. The lightsdisappeared behind a hill to my NW.There was no noise from these lights. The morning air was still and quite, nodogs, no birds and no traffic noise that could have covered the sound of anaircraft engine.The dam located not far from my location is a hydroelectric dam. After lookingon a map these lights may have followed the power lines to the dam from the SEand departed the area following the power lines to the NW."],"Country":"United States","Region":"Montana","files":["/var/www/straped/mufon/html2text/2615.html.txt","/var/www/straped/mufon/org/2615.html"],"Longitude":"-107.93639","Disposition":"Unknown","Date Submitted":"09/13/2002 05:30 UTC","Tags":"City","Object Shape":"Triangle"}