{"Region":"Maine","Case Number":"26156","Tags":"City","City":"Rockland","Object Shape":"Diamond","map":"<A HREF = \"http://maps.google.com/maps?q=44.103691,+-69.108929(26156)&iwloc=A&hl=en\"> mufon case (26156) map </A>","Summary":"3 sided or 4 sided flying diamond","Latitude":"44.103691","trends":["There have been no other sightings in Rockland","This sighting has never been favorited."],"Sighting Duration":"00:01:00","Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/26156.html.txt","/var/www/straped/mufon/more/26156_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/26156.html"],"divs":["Sighting DetailsI stepped out onto my deck to get some fresh air and look at the night sky as i often did back then. At the time i was living in Owl's Head Me. which is in Knox county. My house was on the dublin road on the airport side. I was looking up at the object facing towards lucha beach and the ocean. I first noticed the object as it came over the tree line. The red lights on each point immediately caught my attention. When i first noticed the motion of the object i immediately ruled out any human craft. Unless it was a top secret government craft ( i highly doubted it) i had no other explination other than a UFO. I heard no noise coming from it as it flew. The fact that it flipped and rotated as it went, i couldn't think of any propulsion system that we have that would allow for that motion. I recall it was a moonless night and there was very little light pollution. A great evening for viewing stars. The object was moving from east to west roughly in that direction. I would say it was about 60 to 70 degrees from the horizon. The object had one red light on each point. There were either 5 red lights (if it was 3 sided) or 6 red lights (if it was four sided). The object was very black. I could distinguish between the object and the background as the craft was darker than the night sky. As it moved across the sky the object would rotate and then flip, and then rotate again. It did this in a regular pattern as it moved across the sky. It wasn't moving particularly fast. It moved straight across the sky, flipping and rotating as it went. I really could not estimate its size or altitude. I can only say that i got the impression that it wasn't particularly big. If i had to guess i would say between a bus and a house, but with no references and not knowing its altitude i really would only be guessing. The only facts i am sure of is the red lights at each point and its flight pattern. I could see its motion clearly thanks to the red lights. I could clearly make out its flip and rotation motion as it moved across the night sky. I lost sight of the craft as it moved over the tree line to the west. I was amazed by what i was seeing. I knew i was seeing something not of this world and i felt like i had won the lottery. My whole life i had wondered. I'm a science buff and i love thinking about those unanswered questions. It is one thing to hear others talk about their UFO experiences and another to have one yourself. Before this event i always thought that it was possible that some of the UFO sightings were real. But, you are never certain until you see it for yourself. I am 99.9 percent convinced that what i saw was an alien satellite sent to investigate our planet. Given the way it moved across the sky i cannot conceive of any alien life being on board. I got the feeling that what i was seeing was an unmanned craft sent to earth to gather data. Much like the satellites we send out to explore the planets in our own solar system."],"Longitude":"-69.108929","Date Submitted":"10/28/2010 12:26 UTC","Country":"United States","Date of the Event":"11/15/1999 11:10 UTC","Log Number":"US-10282010-0006","Object Features":"None"}