{"trends":["There have been no other sightings in Canton","This sighting has never been favorited."],"Disposition":"Unknown","Region":"Mississippi","Weather Factors":"None","Viewing Distance":"Unknown","Case Number":"26161","Object Features":"Unknown","Object Flight Path":"Straight-line path","City":"Canton","Latitude":"32.612638","Sighting Duration":"Undisclosed","Summary":"Bright object (sunlight reflection) traveling WSW parallel to pasenger aircraft","files":["/var/www/straped/mufon/html2text/26161.html.txt","/var/www/straped/mufon/org/26161.html"],"Log Number":"US-10282010-0010","Date of the Event":"10/27/2010 06:10 UTC","Source":"MUFON","Longitude":"-90.036751","map":"<A HREF = \"http://maps.google.com/maps?q=32.612638,+-90.036751(26161)&iwloc=A&hl=en\"> mufon case (26161) map </A>","Country":"United States","divs":["Sighting Details Shortly before a partly cloudy sundown I happened to glance westerly at about a thirty-five degree angle above the horizon and observed a passenger aircraft traveling west by southwest. This aircraft was leaving a contrail. It was then I saw a silvery object traveling parallel to and in a straight line and clearly under intelligent control. I observed it for about two or three minutes and noted that it was traveling almost twice as fast as the jetliner (I think), but was not leaving any kind of contrail or sound in its wake. I could not ascertain its size nor its height above the earth, but it was plainly visible and appeared very large in comparison. however, its outline was \"fuzzy\". I could not determine the height of the aircraft either but could only see a small 'dot' ahead of its contrail. I thought perhaps the object was an orbital satellite or the Russian unmanned spacecreaft on its way to rendezvous with the space station, but it struck me as odd that it was traveling west, not east. At the end of the estimated time period it disappeared behind a low cloud never to be seen again, though I continued observing the aircraft for a good five or six minutes longer. About an hour later I checked with a local television station and also with the Madison County Mississippi sheriff's department but there had not been any more relevant calls."],"Object Shape":"Circle, Sphere","Date Submitted":"10/28/2010 05:01 UTC","Tags":"City"}