{"Source":"MUFON","Weather Factors":"None","Country":"United States","Tags":"City","Log Number":"US-10282010-0014","files":["/var/www/straped/mufon/html2text/26165.html.txt","/var/www/straped/mufon/org/26165.html"],"Object Shape":"Flash, Oval, Star-like","Disposition":"Unknown","City":"Oklahoma City","Region":"Oklahoma","divs":["Sighting DetailsI arrived at my house at 4:47PM coming home after work. I parked in my drive way which faces north on the north west side of Oklahoma City. My drive way goes up before leveling off, so when I pulled up I noticed a helicopter extremely high in the air. That is what first caught my attention. I parked and got out of my truck and began watching it. I have never seen a helicopter so high in the sky just staying stationary. It was much higher then the normal police, news or traffic helicopter. It appeared to be positioned there for a reason. It looked like a military helicopter by the shape and the dark color. I watched it for about five minutes and it did not budge. Then I saw them.........directly in front of the helicopter a white oval globe or star like object appeared slowly and faded away, then another behind that one as the first one faded out.Almost in a sequence moving forward one after the other appeared and faded out moving away from the helicopter. There was four total. They appeared one at a time never shining at the same moment. The sky was clear blue and they were bright white like a star. The objects moved west in a line away from the helicopter that remained still facing west. They moved behind some trees and my house where I could know longer see them. That lasted about three minutes. I continued to watch and my girlfriend came out to see what I was looking at. She then made the statment that it was weird to see that helicopter hovering like it was so high up. I told her what I saw and we watched together for about 15 more minutes and the helicopter never left that spot. We went in a I turned on the news to see if there was some breaking news on that side of town that might call for a helicopter to be needed. Nothing happened in our area, or at least it wasn't reported. I regret not getting out my camera, but the objects caught me off guard because I was focussed on the helicopter.It almost seemed like it was ordered to stay stationary and to observe the objects. The whole thing just seems really weird and out of place to me. I did see today that there was another sighting in OKC that night."],"Sighting Duration":"Undisclosed","Longitude":"-97.515188","Object Flight Path":"Stationary,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.47416,+-97.515188(26165)&iwloc=A&hl=en\"> mufon case (26165) map </A>","Date Submitted":"10/28/2010 07:59 UTC","Case Number":"26165","Viewing Distance":"Over One Mile","Date of the Event":"10/27/2010 04:49 UTC","trends":["There have been 78 other sightings in Oklahoma City","There were 4 other sightings in Oklahoma City on or around October 27th 2010"],"Summary":"4 white globe like objects appeared in and vanished in sequence in front of a military helicopter.","Object Features":"Unknown","Latitude":"35.47416"}