{"Disposition":"Hoax","Country":"United States","Date of the Event":"10/28/2010 08:15 UTC","Object Shape":"Unknown","Latitude":"39.103466","Longitude":"-94.576647","Log Number":"US-10282010-0023","Region":"Missouri","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was outside letting my dog do his business, when I noticed what looked like a small aircraft flying in a westerly direction. I then noticed another small craft approaching in a easterly direction, another in northeaserly direction and another from the south. At firt I concluded that perhaps they were all aircraft headed toward different destinations, but it wouldn't seem likely or make since that they would all end up in the same approximate area at the same time, but they did. I then noticed a couple of minutes later, a large bright globular glowing craft heading in a easterly direction. I stood there for a minute and then became concerned. As the large circular craft came closer in my direction, I began to shine a flashlight that I was carring with me in it's direction. It then traveled about 500 hundred feet or more and then turned it's lights completely off. I'm not sure but I don't think that aircrafts do that. I then began to scan the skies for the globular object but could no longer see it, but the other crafts were still in the area. They however all went in different directions after the globular craft could no longer be seen. I hate to admit it but it frightened me so that I then went into my home and called local authorities. The police dept dispatcher stated that they did not handle those type of calls, but gave me a number to the F.A.A. I then called the F.A.A. and the person on the phone stated that they didn't handle these type of calls either, but would refer me to another dept which was located in Washington State, so they transfered me to another person who asked me for my name and telephone number. I gave them the information they asked for and then began to give a description of the details of the events that had transpried. After giving them the information they then stated that they would look into it and someone would get back with me I have been frightened before, but not like this. Not to the point where I felt that I had to call the police dept, F.A.A and who ever else to get them involved in this. I'm tired of hearing the word fake. These things are not fake. They are real and if it is their objective to destroy us, they will easily succeed because no one will even believe that they exist. I have submitted several pictures in the past, only to have someone say that they were investigating it. But nothing has come of it. There needs to be a place where people can call, give descriptions and real investigations can be launched. I am not implying that MUFON does not do real investigations, I'm just stating that from what I have seen. I can say that it's beginning to get real serious now. And until someone with some real power to do something believes these creatures are real. We may all be powerless to stop what ever objective they have. I realize that so far from my experiences they have only invaded our airspace. But I don't know why I believe it, but I for some reason believe that they have been in my home, inserted something into my body while I slept although I have no way to prove this. paranoid perhaps but if you've seen what I seen, maybe you would be too."],"Source":"MUFON","Case Number":"26174","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.103466,+-94.576647(26174)&iwloc=A&hl=en\"> mufon case (26174) map </A>","Date Submitted":"10/28/2010 11:15 UTC","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26174.html.txt","/var/www/straped/mufon/org/26174.html"],"trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around October 28th 2010"],"City":"Kansas City","Weather Factors":"Unknown","Object Features":"Undisclosed","Summary":"I large round craft and 5 or 6 crafts in same area"}