{"Tags":"City","Object Features":"Other","City":"Lafayette","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unknown","Log Number":"US-10282010-0020","Country":"United States","Date of the Event":"10/28/2010 05:37 UTC","Summary":"Very luminous oval shape moving above and behind high-altitude commercial jet that turned into a...cloud?","Sighting Duration":"Undisclosed","Object Shape":"Oval","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.23257,+-92.012493(26171)&iwloc=A&hl=en\"> mufon case (26171) map </A>","Longitude":"-92.012493","files":["/var/www/straped/mufon/html2text/26171.html.txt","/var/www/straped/mufon/more/26171_submitter_file1__Pic10-28-2010001.JPG","/var/www/straped/mufon/org/26171.html"],"Date Submitted":"10/28/2010 10:44 UTC","Viewing Distance":"Over One Mile","Case Number":"26171","divs":["sighting detailscuriously, my report is almost identical to case # 26161 of the 10\\27\\2010. just after work today, shortly after 5:30 pm, i observed a very luminous, oval-shaped object moving nw to se (a rough estimate) above and behind a commercial airliner that was on a west to east course. both were observed in clear sky, just to the north of a high layer of cloudiness moving in from the south. at the time of the sighting, the clouds were just obscuring the sun. both the plane and the object were approximately 35 degrees above the western horizon. when the object's path intersected the airliner's contrail, it appeared to stop. through 7-power binoculars, the object appeared as a fuzzy compact oval shape that was extremely luminous--much more so than any of the surrounding clouds or the contrail; it appeared as a reflection or light source, but fuzzy--diffuse. it appeared that there might have been several tiny condensations within the fuzzy shape. its size was several (perhaps ten) of the plane's contrail widths in diameter. while continuing to observing the object over the course of five minutes while driving home, it appeared to grow in size and look like a small cloud. at this point, i decided to pull over and get a picture of it. i thought this worthy of reporting because of the almost identical appearance to case # 26161 of yeaterday, at the same time, in the same direction, angular height, and also because of the apparent close association to a commercial aircraft."],"Region":"Louisiana","trends":["There have been 7 other sightings in Lafayette","There were no other sightings in Lafayette on or around October 28th 2010","This sighting has never been favorited.",""],"Latitude":"30.23257"}