{"Object Shape":"Circle","Object Flight Path":"Undisclosed","Date Submitted":"10/28/2010 11:34 UTC","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/26178.html.txt","/var/www/straped/mufon/org/26178.html"],"Object Features":"Undisclosed","divs":["sighting details i was in about the 5th grade. i lived in a home near cullaby lake in warrenton or. i woke in the middle of the night and was face up in my bed and could not move. the room was filled with a grey\\blue light and i saw the heads of 2 short figures raised up next to my bed. they had skinny necks and dark oval eyes and triangle shaped heads. i was very frightened and tried to move. my torso was immobile. but i could move my left arm so i tried to bang against my bedroom wall to wake my mother down the hall. she didnt hear me. thats all i remember. the next night the same thing happened but i was able to get my left arm free and punched one of the figures in the face. what also was strange was that i didnt remember these events right away. one morning i woke up and remembered these events had happened a week or so before. i morning i remembered i found i had a sore spot on the back left of my skull. the area was now a dent. i still have it to this day. and was tender to the touch almost like a soft spot for the next 8 years or so. years later i was on a date next to cullaby lake and my now wife and i witnessed a strange light going back and forth behing the mountains across from carnahan county park which is about 2 blocks from the house that i had this encounter in. i dont remember the color of the light. maybe blue."],"Log Number":"US-10282010-0027","Sighting Duration":"Undisclosed","Longitude":"-123.923756","Disposition":"Unknown","Date of the Event":"03/01/1992 12:00 UTC","Country":"United States","Latitude":"46.165105","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.165105,+-123.923756(26178)&iwloc=A&hl=en\"> mufon case (26178) map </A>","Weather Factors":"Unknown","City":"Warrenton","trends":["There has been one other sighting in Warrenton","There were no other sightings in Warrenton on or around March 1st 1992"],"Summary":"in my room","Case Number":"26178","Region":"Oregon"}