{"Case Number":"2617","Object Flight Path":"Stationary","Object Features":"Other","Object Shape":"Oval","Sighting Duration":"01:59:00","files":["/var/www/straped/mufon/html2text/2617.html.txt","/var/www/straped/mufon/org/2617.html"],"Tags":"City","Latitude":"40.557216","Summary":"Signs of light bending to hide whatever.","Log Number":"","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"10/15/2003 04:30 UTC","Date of the Event":"10/15/2003 04:30 UTC","trends":["There have been no other sightings in Noblesville-Fishers,area","This sighting has never been favorited."],"divs":["Sighting DetailsObvious light bending object-objects to hide themselves. Easily seen with eye but much more pronounced with ruby coated binoculars. The objects viewed just above treetops. When looked at straight on through binoculars the objects is discolored, transparant, very blurry with the tendency to slide your vision off of it to one side or the other. Often trees are subject to highwind behavior below the stationary object. Also noteworthy are birds that fly into-past object and thus out of my sight till flown past the object, or birds seeming to pop out of nowhere from the blurry area-field of somekind around this thing. The birds that seem to me to interact with these objects are either large hawk like birds or smaller dark birds that don't seem to flap just kinda zoom or dodge behind trees or other sight blocking things house, land contour, barn the hawks in pictures I taken have a circular radiance around them perhaps a 1-foot overlap of birds physical size. The only other anomalies that usually are present at viewing times are bird like faint shadows that dart at high speed to and from the cloaked object, from the object these faint shadows just impact into the ground and vanish with no thump or sound or mark. I can notice these my opinion light bending objects out of the corner of my eye and then the air just looks dirty viewed straight on. Im not pshycic or anything just observant. I think this is just military stuff or things that exists at the fringe of our eyesight. Compass usually twirls about. Thank you for this outlet. 10-16-2003 639pm"],"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"Indiana","Longitude":"-85.599084","Country":"United States","City":"Noblesville-Fishers,area","map":"<A HREF = \"http://maps.google.com/maps?q=40.557216,+-85.599084(2617)&iwloc=A&hl=en\"> mufon case (2617) map </A>"}