{"Summary":"a bright light approached from the west, passed to the east and appeared to be intersected by another bright light approaching from the south east., the southeast light then appeared red and both disappeared","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.879122,+-93.090162(26170)&iwloc=A&hl=en\"> mufon case (26170) map </A>","Source":"MUFON","trends":[],"Object Shape":"Sphere","Disposition":"Unknown","Log Number":"US-10282010-0019","City":"Undisclosed","Longitude":"-93.090162","Viewing Distance":"Unknown","divs":["Sighting DetailsI was standing in my driveway, which is in a rural area, away from light pollution. The sky was perfectly clear and I was looking up at the night sky, towards the Big dipper. I noticed a very bright light, larger than how most planets appear. It was moving in an arc from west to east in the northern sky. At first I thought it was a plane but I did not see any flashing lights, only the steady white light. It seemed to wobble on its path briefly and as it neared the eastern side of my viewing area, another bright light of similar size and intensity approached from the southeast, seemingly on a near-collision course with the first light. Their paths crossed, both lights seemed to stop and the southeastern light turned red and both lights disappeared. My guess on the amount of time that elapsed was perhaps 20 seconds. I thought Holy Mackerel, I might have just seen two UFO's. It was so moving that I called my boyfriend on my cell phone because I felt I needed to report the sighting to someone. I then came in the house to my computer and did a google search to check if anyone else had seen what I had seen. So here I am, a bit bewildered but also excited to have had the experience. Take good care, all."],"Date of the Event":"10/28/2010 07:45 UTC","files":["/var/www/straped/mufon/html2text/26170.html.txt","/var/www/straped/mufon/org/26170.html"],"Object Features":"None","Region":"Iowa","Case Number":"26170","Sighting Duration":"00:00:20","Object Flight Path":"Straight-line path","Date Submitted":"10/28/2010 09:47 UTC","Latitude":"41.879122","Tags":"City","Country":"United States"}