{"Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/26188.html.txt","/var/www/straped/mufon/org/26188.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10292010-0008","Region":"Oklahoma","Date Submitted":"10/29/2010 12:53 UTC","Country":"United States","Tags":"City","City":"Oklahoma City","Object Shape":"Boomerang, Cylinder, Diamond, Sphere, Triangle","Summary":"UFO Display - 11 objects in 1 hour 20 minutes - all almost identical path","Source":"MUFON","Case Number":"26188","divs":["sighting detailsthis occured in nw okc at my home in our side yard where we have a large cement area with a fire pit, hot tub, and suana. it started at 8:50 with a boomerang craft traveling approx. 25 mph and 80' high going north to south. i watched it for approx 20 seconds and within 2 minutes of it passing a small grey sphere with a reddish tint (about the size of a basketball) flew directly over my head approx 20' high high traveling west to east about 15 mph. at this time my wife came home and we sat in the hot tub and watched a small diamond shaped ufo pass over, followed by a boomerang object, then a 100' long white straight object, another boomerang object, a huge triangle object that was massive in size, 3 more pass overs by a medium boomerang object and the last instance was a very large bomerang object. 11 objects in 1 hr 20 minuntes and then it ended without seeing anything more and we went to bed. we are in the hot tub almost every night and never saw a thing ever until sunday and now this week has been crazy. tonight was beyond belief. there is something going on and why they are picking our side yard for their flight path is unreal. every craft has traveled within 50' of the exact same path and all within the edge of our roof to the middle of our side yard and none anywhere else. they all don't appear coming at us from a distance, but they originate at the beginning of our yard from nowhere. we have only seen objects from 8:50 to 10:10, nothing before and nothing after. we have a small mag. flashlight and shined it up on each one as it flew over to help see them. some had faint lighting and some no lights at all. we are in total shock that this is happening and they seem to be targeting us. we are buying a large mag light tomorrow and will set up the video camera on a tripod. has anyone ever experienced anything like this? please email me if you have ever had something like this happen to you or can tell us why they may be targeting us. our email is *(wit's email address deleted--cms\\sg)."],"Latitude":"35.47284","Object Features":"Undisclosed","Longitude":"-97.506928","trends":["There have been 78 other sightings in Oklahoma City","There were 4 other sightings in Oklahoma City on or around October 28th 2010"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.47284,+-97.506928(26188)&iwloc=A&hl=en\"> mufon case (26188) map </A>","Weather Factors":"Unknown","Date of the Event":"10/28/2010 08:50 UTC","Viewing Distance":"Unknown"}