{"Object Shape":"Circle","City":"Vandalia","Log Number":"US-10292010-0003","Date of the Event":"04/22/2009 04:12 UTC","Case Number":"26183","Country":"United States","divs":["Sighting DetailsA life-long friend and I were laying video games when we decided to take a smoke break. We were not drinking and had taken no drugs. We went out front of his apartment and lit our smokes when he said \"Dave come here you have to see this!\", a decorative brick wall was obstructing my view of the sky when he said this. I stepped out from the wall and my heart sank as I witnessed two round objects emitting light that was not strobing moving through the sky towards each other as if they were on a collision course. Both objects did not appear to be at the same level of height as the one on the left appeared as if it were moving down and towards the other while the one on the right was moving in to the left. Both objects than stopped leaving a small gap and didn't move for about half a minute. Then, they both seemed to move at the same time alligning one above the other as the object to the left went northeast and the object on the right went southwest. They alligned perfectly as if they were one, and stayed like this for about 10-20 seconds. The one on top then suddenly began to move in the same direction I originally witnessed it in and disappeared within seconds. While the one below it stayed where it was at for over an hour."],"Source":"MUFON","Longitude":"-84.197691","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/26183.html.txt","/var/www/straped/mufon/org/26183.html"],"Tags":"City","Region":"Ohio","Weather Factors":"Unknown","Object Features":"Undisclosed","Summary":"Sightings took place in Vandalia facing the direction of Wright-Patterson Air Force Base.","map":"<A HREF = \"http://maps.google.com/maps?q=39.895842,+-84.197691(26183)&iwloc=A&hl=en\"> mufon case (26183) map </A>","trends":["There have been 6 other sightings in Vandalia","There were no other sightings in Vandalia on or around April 22nd 2009"],"Sighting Duration":"Undisclosed","Date Submitted":"10/29/2010 12:29 UTC","Object Flight Path":"Hovering then path,Path then hovering","Disposition":"Insufficient Data","Latitude":"39.895842"}