{"Weather Factors":"Unknown","City":"Poland","Case Number":"26186","Log Number":"US-10292010-0006","Country":"United States","Tags":"City","Object Shape":"Fireball, Flash","Summary":"My friend and I saw glowing rods in the bushes. when I reached for it, I dont remember what happened. When i came to I saw a blue flash. a fireball objct flew away.","trends":["There have been no other sightings in Poland","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/26186.html.txt","/var/www/straped/mufon/org/26186.html"],"Date Submitted":"10/29/2010 12:42 UTC","Latitude":"44.060556","Sighting Duration":"03:00:00","Object Features":"Undisclosed","divs":["Sighting DetailsOne day when I was sixteen one of my friends came to me and asked me if I would help him get some copper because he wanted to junk it and make some money. I said sure. We went down a trail through the woods that led to the place were he had seen a couple of large copper radiators that he wanted to try to junk for money. We got to the place. We got on each side of one of the radiators and carried it a ways back the way we had came. My friend said \"lets drop this one here for now and go get the other one\". I said ok. We then put the radiator in the ditch on the side of the road.(this was at about five o clock in the afternoon in the summer) While I was in the ditch something in the bushes caught my attention. It was a rod lying on the ground. It was about eight to ten inches long and had glowing green triangles in vertical lines from top to bottom. I remember thinking to myself...wow thats really neat looking and I reached down to pick it up. The next thing i remember is comming to my senses. Me and my freind were walking down the road away from were we had been in the ditch.(The sky was starting to get dark which struck me as strange because it had been light just a few momments ago) I looked over at him and I was about to ask him if he saw something in the bushes when a bright blue flash happened. when we turned around we saw something shoot up off the ground in a red trail. We saw this very clearly. When it reached the top of the trees it changed into a green fireball and shot down across the woods at treetop level. We then turned and ran all the way to my house. We told my mother what we saw. She did not beleve us. Later on when I asked my friend what he had seen in the bushes he said he had seen a rod object with glowing red triangles on it. I have no idea what we saw or what happened to us that day. I have often thought about undergoing hypnosis to find out what happened during my missing time."],"Date of the Event":"07/18/1993 05:04 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.060556,+-70.393611(26186)&iwloc=A&hl=en\"> mufon case (26186) map </A>","Disposition":"Unresolved","Longitude":"-70.393611","Source":"MUFON","Viewing Distance":"Unknown","Region":"Maine"}