{"Tags":"City","Weather Factors":"Unknown","Date Submitted":"10/29/2010 12:20 UTC","files":["/var/www/straped/mufon/html2text/26182.html.txt","/var/www/straped/mufon/org/26182.html"],"Longitude":"-97.534153","Sighting Duration":"00:05:00","Object Shape":"Boomerang, Triangle","Summary":"they came out of a transparent cloud ,","Source":"MUFON","Case Number":"26182","trends":["There have been no other sightings in Olmito","This sighting has never been favorited."],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.021745,+-97.534153(26182)&iwloc=A&hl=en\"> mufon case (26182) map </A>","Disposition":"Unknown","Log Number":"US-10292010-0002","Country":"United States","Date of the Event":"11/25/2009 06:30 UTC","City":"Olmito","divs":["Sighting DetailsThe sun was about to go down,I was was sitting in my back yard going on my second beer, the it was an almost clear afternoon, there were only transparent clouds in the sky,know this because I have a habit of looking at the sky when ever I'm out side. On that afternoon four boomerang like shapes suddenly began coming out of a cloud that was just above my house, they seem to be flowing in formation three in front and one in the back of them, I say that they seem to be flowing because I couldn't hear an engine of any kind. They were they size of a 747 and seem to be flying about some 15,000 feet or lower, because I felt that I could almost touch them.there were no lights There color was gray. I believed that a time dimension window open,which allow me to see them as they pass by,I believed that they were actual in another time dimension,that's why there was no noise, and that's why nobody else saw then, I say this because you couldn't miss something that big,also for some unknown reason this area seems to be point X for UFO activity. I ran to call my wife,but she took too long to respond and by the time I finally got her to come out side, the show was over. After witnessing something like that I began question myself wondering if I had actual witness such an event,and if I hadn't, what cause my mind to project such a so real event? That's all I have to say, thank you for your time."],"Viewing Distance":"Unknown","Latitude":"26.021745","Object Flight Path":"Undisclosed","Region":"Texas"}