{"divs":["Sighting DetailsEvery morning as I am getting ready for work, I look up at Orion (this time of year), and it just so happened that the moon was out too. Looking up at the moon, I observed an object that was at a dead stop directly centered under the wanning (phase) of the moon. This ruled out a jet flying in the sky. The object and contrail matched that of the object taped over the China airport in July? of 2010. The moon light illuminated the contrail and the object, both of which appeared to be pure white in color with a slight blue tinge on the coned shaped object. Under the moon light, it was difficult to say if the object was putting out any light of its own, But both object and contrail was very reflective of the moon light. After watching the object for about 2 mins, during which time it remained stationary in the same spot, I finished loading up my car for work. (which only took less than a minute). Upon looking back at the area where the object had been, not only was the object gone.............but so was the contrail (which had been very evident, and didn't appear to have been dissipating during the initial viewing period). For the object to be gone was one thing, but for the contrail to be gone too caught me as strange. Upper winds were not strong that morning. Being an amateur astronomer for years, I have never seen anything like this, nor have I seen anything that I couldn't explain........until that morning."],"Sighting Duration":"Undisclosed","Latitude":"28.674753","Object Shape":"Cone","Weather Factors":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26187.html.txt","/var/www/straped/mufon/org/26187.html"],"Log Number":"US-10292010-0007","Longitude":"-82.08429","Region":"Florida","Object Flight Path":"Stationary,Other","trends":["There have been no other sightings in Villages","This sighting has never been favorited."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=28.674753,+-82.08429(26187)&iwloc=A&hl=en\"> mufon case (26187) map </A>","City":"Villages","Object Features":"Unknown","Date Submitted":"10/29/2010 12:52 UTC","Viewing Distance":"Unknown","Date of the Event":"09/28/2010 05:45 UTC","Case Number":"26187","Summary":"cone shaped object with contrail shaped like the one video taped over China airport","Disposition":"Unknown","Tags":"City"}