{"Disposition":"Unknown","Latitude":"35.741158","Date Submitted":"10/29/2010 12:37 UTC","Log Number":"US-10292010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=35.741158,+-81.333197(26185)&iwloc=A&hl=en\"> mufon case (26185) map </A>","Object Shape":"Unknown","Country":"United States","Region":"North Carolina","Summary":"Bright white light converting to red pulsating light, with no sound, and only a subtle whoosh as the light dimmed and seemed to fade","Longitude":"-81.333197","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/26185.html.txt","/var/www/straped/mufon/org/26185.html"],"Sighting Duration":"00:02:45","City":"Hickory","Object Flight Path":"Hovering then path","Weather Factors":"None","Case Number":"26185","trends":["There have been 33 other sightings in Hickory","There were no other sightings in Hickory on or around October 18th 2009"],"Tags":"City","Viewing Distance":"21-100 Feet","Date of the Event":"10/18/2009 03:17 UTC","Source":"MUFON","divs":["Sighting Details I was awakened from sleep a little after 3 a.m. on the morning of October 18, 2009, by something which I can't explain. My twelve year old dog was sleeping on the bed next to me, when I was awakened by my two five month old puppies barking like crazy. The puppies, because they were so young, were crated overnight in the tiled entryway of the house. My room is at the opposite end of the hallway. As I awoke to their barking, I opened my eyes and noticed my room was very light. There are heavy, double layered light filtering shades at the bay window across my room. The light was so bright it was lighting the room as it came in through the cracks between the shades and the window frame. It also showed through the layers of material. The only time which could provide any kind of comparable light overnight would be a full moon, and this light was much brighter, and the moon wasn't full that evening. As I awoke and my brain began to quickly notice something was very different, my mind immediately began to race. As I lay there thinking, \"what is that?\", \"why is it so bright?\"' \"why is there no sound?\"' I was also thinking, \"don't move, don't make a sound, don't get up and look\", even though I wanted very much to know what it was outside my bedroom window. As I lay and watched it, the constant bright light changed into a pulsing red light. The two lights didn't show simultaneously. There was one very bright, sustained white light which changed into a red light that seemed to pulse in and out at a 1-2 second rate. I'm noting that because I thought it could possibly be a helicopter, but as far as I know, the red and white lights on a helo run simultaneously. So I waited it out silently, without moving, and quite honestly, feeling terrified. As the red pulsing light converted back to the bright white light, it brightened for a much briefer time, then faded with only a whoosh. The whoosh was the only sound I'd heard during the entire experience. It definitely was not the typical sound associated with a helicopter flying out. There are some other reasons this experience seemed odd. My room is on the second floor of the house. Outside, below the window, there's a swimming pool. On one end, there's a large oak tree. About 50-60 feet away, there are some large magnolia trees. Behind the pool is a tall line of cypress trees. Anyone trying to come in with a chopper and searchlight would have to fly over the cypress trees, and dip between the oak and the magnolia trees to be positioned in the spot where the light was shining from. Based on the angle it was hitting the windows, it seemed level with the second floor or slightly above, but still well below the tops of the trees. That would be some fancy flying for the wee hours of the morning in a residential area. After the light dimmed, the dogs stopped barking, but the light on the back deck remained on for a few more minutes. It's on a motion sensor, and we do have a cat, so I'm not prepared to make any connections to the other lights. The last time I remember checking the time was 5:30 a.m., since I couldn't get back to sleep before then. The next day, after thinking about the lights a little more, I told one family member. I still can't explain it based on the information I've seen. I've tried over the last year to rationally explain it, but I can't. The experience has stayed with me, and is still as real as it was that evening. That's why I'm reporting it now. Perhaps the folks with MUFON can shed some light on the matter. After the light dimmed and I heard the whoosh, I couldn't go back to sleep again for a couple of hours. The last time I remember checking the clock was 5:30 a.m."]}