{"Log Number":"US-10292010-0011","files":["/var/www/straped/mufon/html2text/26191.html.txt","/var/www/straped/mufon/org/26191.html"],"Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Date Submitted":"10/29/2010 01:15 UTC","Latitude":"33.821156","trends":["There have been 24 other sightings in North Myrtle Beach","There were no other sightings in North Myrtle Beach on or around May 28th 2009"],"Weather Factors":"Unknown","Case Number":"26191","Object Features":"Unknown","divs":["sighting details this was the last week (wed i believe) of may 2009. we was staying at a hotel called the ocean reef in north myrtle beach, south carolina. our room was on the 11th floor facing the ocean and it was about 11:30 at night. 1st i seen 2 white balls coming in over the water towards the hotel that looked at 1st like headlights on a car, but when they got closer they split and went into different directions. these white balls moved around and then was gone. they reappeared a few min later in a different area again for a few secons, then was gone. we sat and watched for a few minutes and was getting ready to go back inside when we noticed a high fog coming in. not low over the water but higher up that our hotel. all a sudden an object seem to move out of this fog that was hugh. i believe it was triangle shape because i could see what i thought was the front of the object and lights that ran down the right side. i couldn't see the left side. the lights on the side we could see was white and glowed. the lights was going from bright to dim making it look like the lights was running from front to back(right to left. we watched this for about 3 to 5 minutes and it went dark. i went inside to get my cell phone to get a picture but it never lite up again. the fog slowly went back over the water. i looked down at the beach below and seen a couple standing there. they didn't move and finally sat down on the beach. i left my room and went down to the beach and talked to the young couple that was in there mid twenties. i asked if they had seen anything and they seemed to be very confussed and said they were not sure what they had seen but described pretty much what i had seen my self. the reason i'm sending this is to see if anyone else has reported seeing this beside us? pls let me know. thanks *(wit's first name deleted--cms\\sg)."],"Source":"MUFON","Date of the Event":"05/28/2009 11:30 UTC","Longitude":"-78.670776","Object Flight Path":"Path with directional change,Path then hovering","City":"North Myrtle Beach","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.821156,+-78.670776(26191)&iwloc=A&hl=en\"> mufon case (26191) map </A>","Country":"United States","Summary":"Was on 11th floor looking out at the ocean. I seen 1st 2 white balls coming towards the shore like headlights that spit and went in different directions. Later seen a hugh pointed thing with muli lights running down its side.","Object Shape":"Sphere, Triangle","Tags":"City","Region":"South Carolina"}