{"Date of the Event":"08/14/2007 03:35 UTC","Sighting Duration":"00:40:00","map":"<A HREF = \"http://maps.google.com/maps?q=47.474094,+-115.927939(26196)&iwloc=A&hl=en\"> mufon case (26196) map </A>","trends":["There have been no other sightings in Wallace","This sighting has never been favorited."],"Date Submitted":"10/29/2010 04:05 UTC","Disposition":"Insufficient Data","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","Case Number":"26196","Latitude":"47.474094","City":"Wallace","Log Number":"US-10292010-0016","Region":"Idaho","Summary":"Was on a patrol in the forest when I seen a star like light bullet shape shout out of the tree line.","Tags":"City","Object Shape":"Bullet, Missile, Star-like","Longitude":"-115.927939","files":["/var/www/straped/mufon/html2text/26196.html.txt","/var/www/straped/mufon/org/26196.html"],"Source":"MUFON","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsOn the 14th of August, 2007 I was on a patrol spotting for forest fires. My job at the time was a wild land fire-fighter. I was in my truck at the time by myself about 3-3:35am on United States Forest Service road 456 and turning on to placer creek rd. on moon pass. As I was turning my truck on to placer creek rd. I seen what I thought was a camp and or wildfire, coming from a tree line about 230 feet to the left side of my truck. At first the light came off dim, but then got brighter and I studied it. I went to radio myself in to report the light I thought was fire, but my radio was fuzzing in and out and would not send to the dispatch center. About this time I seen the light at super speeds jump out of the tree line in to the sky. I seen what looked like a bullet shape dart of in to the night sky. I can remember thinking it was time to put out a fire and hope I could stop it before it got out of hand and had to call in a I.R. team. I also remember taking maybe I should just watch it and see if it was just a group of campers. As I seen the light move back and fourth I also remember thinking OK this is a wildfire I need to take action and report it. When having problems with my radio I seen the light at super speeds jump out of the trees in to the sky I remember being very scared and my heart racing. I've never seen any thing like this before. I looked myself in my fire truck and hid in back set. After I calmed down I remember being lost and confused as to what just happened. I thought I was going to die that night."],"Weather Factors":"Unknown","Object Features":"Unknown"}