{"Latitude":"40.192809","trends":["There have been 3 other sightings in Royersford","There were no other sightings in Royersford on or around October 28th 2010"],"City":"Royersford","Sighting Duration":"Undisclosed","Date of the Event":"10/28/2010 11:17 UTC","divs":["Sighting DetailsI was driving home from work. On 422 west just before the ext for royorsford. Two objests apered they looked like two stars. They were vary bright bighter then the stares i have ever seen. There placement in the sky was one was in the senator. The other was on the left side and it was on top. The two light began to get bigger, brighter. At the same time like some1 had a dimmer swich and was making them brighter. They were to fare apart to be a plaine or a jet or a hellcopter. There were no green or red flashing lights or strob light. When the two objects began to get dimmer. They did it at the same time like some one had them on a dimmer switch. They got to the point were I could not see them any more. You could see the stars vary well and you could tell ware the were. I would have bin able to see them move away because they would have blocked out the stars if they had moved. They simply just disaperded. What made me notice them was I'm always looking for ufos. I have seen a lot they I can not expain being anything else but them. I have bin looking for ufos for about ten years and I can tell you the difference between a shooting stare,satlights,plains,jets,helicopters. When I first noticed it I thought they have might bin two plains."],"Object Features":"Undisclosed","Summary":"One on top of the other bright lights then got out at the se time","Source":"MUFON","Case Number":"26199","Region":"Pennsylvania","Object Shape":"Circle, Flash, Star-like, Other","Longitude":"-75.528964","files":["/var/www/straped/mufon/html2text/26199.html.txt","/var/www/straped/mufon/org/26199.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.192809,+-75.528964(26199)&iwloc=A&hl=en\"> mufon case (26199) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"10/29/2010 10:31 UTC","Log Number":"US-10292010-0019","Weather Factors":"Unknown"}