{"Latitude":"43.978215","Tags":"City","files":["/var/www/straped/mufon/html2text/26195.html.txt","/var/www/straped/mufon/org/26195.html"],"Longitude":"-99.897153","map":"<A HREF = \"http://maps.google.com/maps?q=43.978215,+-99.897153(26195)&iwloc=A&hl=en\"> mufon case (26195) map </A>","Case Number":"26195","Disposition":"IFO","Summary":"West to the East bright white light slow moving silent Bright like Jupiter turning a Red Orange and Vanished clear sky","City":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-10292010-0015","Object Shape":"Star-like, Other, Unknown","Source":"MUFON","divs":["Sighting DetailsI stepped outside for a cigarette with two of my friends and half way through our conversation we noticed a low flying object coming from the west heading to the east-northeast. The brightest \"star\" in the sky is actually a planet tonight, what i believe to be Jupiter, but I'm not positive if it is actually Jupiter just to be clear, But the date is October, 28, 2010. And I live In Eastern South Dakota, So you at Mufon should know what planet I am talking about. It has been clearly visible every stary night for several weeks now from my vantage point. This object was much brighter than what i believe to be Jupiter, the brightest object in the sky from my vantage point. It slowly moved to the east in what appeared to be a straight line. This object was bright white light much like the stars appear but much brighter and much clearer. It passed slightly to the South of where I was standing, but shortly after it turned a red orange color it had to be east of the town i live in, and then it simply dissapeared. Vanished. It was a very clear night tonight. I could clearly see geese flying south tonight in the same night sky. It may have lasted up to two minutes. It was some time between 7:45pm - 8:30pm central time USA Time. This was unlike anything I've ever seen!!!"],"Weather Factors":"Unknown","Date Submitted":"10/29/2010 03:43 UTC","Sighting Duration":"Undisclosed","trends":[],"Object Flight Path":"Undisclosed","Country":"United States","Region":"South Dakota","Date of the Event":"10/28/2010 12:00 UTC"}