{"Date Submitted":"10/29/2010 05:41 UTC","divs":["Sighting DetailsMe and a friend of mine, were traveling north on highway 131. We were just getting near our exit which is 36(were currently passing exit 34) just talking about work and stuff when all of a sudden this bright bluish green sphere just appear towards the horizon. In amazement we both just watched as this object just bursted right through the cloud it seemed like. It only lasted a few seconds. At first i thought it could've been a plane or a helicopter but the light was 10x's bigger than the lights of a plane or helicopter. Than i thought, maybe a missil, but than still, a missile would leave a streak or something. It also looked as if it would hit the ground. With the speed and trajectory it looked in possible to pull of. It just dissapeared. Me and my friend were extremely excited because we've been watching shows of ufo's and aliens since we were kids. I instantly than knew that it had to be something from outta this world."],"Log Number":"US-10292010-0025","City":"Kalamazoo","trends":["There have been 12 other sightings in Kalamazoo","There were no other sightings in Kalamazoo on or around October 27th 2010"],"Object Flight Path":"Straight-line path","Longitude":"-85.582669","map":"<A HREF = \"http://maps.google.com/maps?q=42.294367,+-85.582669(26205)&iwloc=A&hl=en\"> mufon case (26205) map </A>","Region":"Michigan","Source":"MUFON","Sighting Duration":"00:00:03","Object Features":"Unknown","Tags":"City","Weather Factors":"Windy, Medium","files":["/var/www/straped/mufon/html2text/26205.html.txt","/var/www/straped/mufon/org/26205.html"],"Case Number":"26205","Summary":"bright turquois light in sky. speeding vertically downward in a controlled manor. It split a small cloud, but left no streaks as if a falling plane or jet would produce.","Object Shape":"Sphere, Teardrop","Latitude":"42.294367","Disposition":"Unknown","Country":"United States","Date of the Event":"10/27/2010 07:27 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile"}