{"trends":["There have been 3 other sightings in Mattoon","There were no other sightings in Mattoon on or around October 29th 2010"],"files":["/var/www/straped/mufon/html2text/26209.html.txt","/var/www/straped/mufon/org/26209.html"],"Region":"Illinois","Longitude":"-88.368506","Weather Factors":"None","Date of the Event":"10/29/2010 02:00 UTC","Object Shape":"Cigar, Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=39.48757,+-88.368506(26209)&iwloc=A&hl=en\"> mufon case (26209) map </A>","Tags":"City","City":"Mattoon","Object Features":"Unknown","Summary":"White, cigar-shaped object flying near commercial jet","Viewing Distance":"Unknown","Latitude":"39.48757","Sighting Duration":"Undisclosed","Log Number":"US-10292010-0029","Date Submitted":"10/29/2010 10:44 UTC","divs":["Sighting DetailsWe were traveling down South 9th Street in Mattoon, IL on the afternoon of October 29th, heading North. I happened to look out of our car's windshield and saw a jet with a trail behind it, and directly below it, a large white object traveling at what I first thought was the same speed as the commercial jet. After watching for a few seconds, it almost looked as if the jet, which was higher up, was somehow escorting the larger, lower object. I joked that it must be Air Force One and the jet was it's \"wingman\". My husband also saw this object and we stopped the car to watch it. We could not figure out what it could be. It was either cigar-shaped or cylindrical in shape and appeared to be totally white. It left no jet trail or any evidence that it was flying in the air. It didn't shine or sparkle against the sun, but seemed more matte in it's appearance. It traveled toward the west, but didn't seem to move overly fast or bank in any direction. The object went in a very straight trajectory and appeared to move at the same pace for the duration of the sighting. We watched it until it faded out of sight into the sky. We both were at a loss to explain what this object was."],"Source":"MUFON","Disposition":"IFO","Country":"United States","Object Flight Path":"Straight-line path","Case Number":"26209"}