{"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=41.005375,+-74.290704(26206)&iwloc=A&hl=en\"> mufon case (26206) map </A>","divs":["Sighting DetailsMy wife and I were walking down the street to go to a restaurant. I was looking up to see if there were any meteors because some were expected this day. I then saw a bright star like object moving across the sky like a satellite, but a bit brighter than a satellite given it wasn't crystal clear enough to see satellites so easily - I tracked it behind trees as we walked but looked forward to a clearing ahead to point it out to my wife. 30 seconds later we got to the spot and I stopped her to point up at the small high up light. At that point, stopped on the sidewalk we both shouted out in surpise - it wasn't following a normal trajectory, it started turning sharply then reversed direction very fast, like an insect flying. It then disappeared from my view totally but my wife was looking toward a point of the sky where she was able to see it for a few more seconds, before she said it moved back and forth a little bit before taking off at an impossibly fast speed. It was very far away, not a satellite and not a meteor, also not a planet - I'm an amateur astronomer and Jupiter was very bright and right next to the moon at the time - in fact it was one of the brightest moon nights I've ever seen, so perhaps the moon reflection is the source of light on whatever it was. Mostly disbelieving my own eyes. Still trying to come up with explanations like my own dizziness that made stars seem to move around or something, and I might have convinced myself if not for the 2nd witness confirmation of everything I saw and more. Just very interesting really. I really just want to know from someone if anyone else saw something like this on this night."],"Date of the Event":"10/22/2010 08:30 UTC","Longitude":"-74.290704","files":["/var/www/straped/mufon/html2text/26206.html.txt","/var/www/straped/mufon/org/26206.html"],"Country":"United States","Sighting Duration":"00:02:00","Case Number":"26206","Region":"New Jersey","Object Shape":"Star-like","Date Submitted":"10/29/2010 05:54 UTC","Object Features":"Undisclosed","Summary":"I thought it was a high up bright satellite when looking up to see meteor shower, but then wife & I saw it then turn, reverse, accelerate, and eventually disappear. Flight was irratic and fast but it was just a star-like object, very high up.","Log Number":"US-10292010-0026","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Pompton Lakes","There were no other sightings in Pompton Lakes on or around October 22nd 2010"],"City":"Pompton Lakes","Latitude":"41.005375","Tags":"City","Source":"MUFON"}