{"City":"Schaumburg","Region":"Illinois","Object Shape":"Oval","Weather Factors":"Unknown","divs":["sighting detailswas driving east from burlington, il towards st. charles, il on 10\\27\\10. around 9pm we noticed an unusual amount of lights on the horizon, which i dismissed as just a bunch of planes in a holding pattern on their way to land at o'hare in chicago. when the airport is busy or backed up, we can often see a few planes on their way towards us or those that already went that past us, turned overhead & are on their way back towards o'hare to land. what we saw on 10\\27 was 3 distinct \"strings\", each made of 10-15 points of light, that extended up from the horizon & curved over high in the night sky. we could see planes to the left & right of the strings of light which moved into or out of our field of vision. i'm submitting this report because the points of light that made up the \"strings\" did not move. after my passenger insisted the lights were not moving, i pulled over to confirm & we watched for several minutes. we then continued east to route 64 (north ave.) taking it through st. charles, il to the dupage airport (arriving at 9:30pm) where there was open space to take another look. strings of lights were still visible. we continued east on route 64 to route 59 (where there's several large stores with large open parking lots), arriving at route 59 at 9:45pm. strings of lights were gone."],"Date of the Event":"10/27/2010 12:00 UTC","Log Number":"US-10292010-0020","Source":"MUFON","Case Number":"26200","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Disposition":"Unresolved","Object Features":"Unknown","Date Submitted":"10/29/2010 10:57 UTC","Country":"United States","Summary":"3 strings of lights extending in a curved line from the horizon into the sky","Latitude":"42.037271","trends":["There have been 8 other sightings in Schaumburg","There were no other sightings in Schaumburg on or around October 27th 2010"],"Tags":"City","Longitude":"-88.081306","files":["/var/www/straped/mufon/html2text/26200.html.txt","/var/www/straped/mufon/org/26200.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.037271,+-88.081306(26200)&iwloc=A&hl=en\"> mufon case (26200) map </A>","Viewing Distance":"Over One Mile"}