{"Source":"MUFON","Date Submitted":"10/30/2010 11:41 UTC","Tags":"City","Object Features":"Wings","divs":["Sighting DetailsMy wife and I were outside putting some things in my work truck when she said to me \" what the heck is that \". I turned to face her and ask what was what. She pointed up to the sky toward the north and said \"that\". At first I looked toward where she was pointing and didn't see anything then I seen it. She asked me if it was a flock of geese at first and as it got closer you could clearly tell it wasn't birds. As the object flew overhead you cold clearly tell there was mass to it. The moon was shining behind it just to the left of the object. As it flew overhead it made absolutely \"NO\" sound ! There were no lights emitting from it and it appeared to be transparent. The only thing you could actually see was the outline of the object. It was enormous in size. The object flew from a North to South direction and as it passed us it was as if it completely disappeard. My wife and I stood looking into the sky and couldn't see anything but stars. I ran around the corner of my house to see if I could see anything and there was nothing !! I looked at her and said I got to draw a picture really quick of what I just witnessed. I got in the truck and found some scratch paper and drew a real quick pictuer and asked my wife if this is what she saw . After showing her the picture we just stood there starring into the sky for a few more minutes amazed. We both were so excited..I wanted to tell someone but didn't know who to tell. My wife looked at me and said \" I'm glad we got to share this experience together. She has told me over the years that as a little girl she had witnessed an object durring the daylight hours. I was always kind of skeptical of people saying they saw strange unidentified flying objects in the sky until now. I now know beyond a shadow of a doubt there truely are mysteries above !!"],"Case Number":"26219","Region":"Texas","Country":"United States","files":["/var/www/straped/mufon/html2text/26219.html.txt","/var/www/straped/mufon/more/26219_submitter_file1__scan0003.jpg","/var/www/straped/mufon/org/26219.html"],"Sighting Duration":"Undisclosed","Date of the Event":"10/28/2010 05:58 UTC","Longitude":"-97.139367","Log Number":"US-10302010-0008","Summary":"Object flew silently over head","Object Shape":"Boomerang","Weather Factors":"None","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"32.565392","Object Flight Path":"Straight-line path","City":"Mansfield","trends":["There have been 6 other sightings in Mansfield","There were no other sightings in Mansfield on or around October 28th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=32.565392,+-97.139367(26219)&iwloc=A&hl=en\"> mufon case (26219) map </A>"}