{"Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.411999,+-103.195267(26229)&iwloc=A&hl=en\"> mufon case (26229) map </A>","Source":"MUFON","Date of the Event":"05/15/2000 12:00 UTC","Date Submitted":"10/30/2010 06:52 UTC","Log Number":"US-10302010-0017","Summary":"watched large triangle shape object ,that blocked out stars when above me, heading up street north. very faint \"purring\" sound, dim lights","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26229.html.txt","/var/www/straped/mufon/org/26229.html"],"Disposition":"Unknown","Case Number":"26229","divs":["Sighting DetailsIt was about 1:00am on a clear skied night. I was living in town, but my street is dark with only a few light poles, so I could see the night stars fairly brightly. As I drove north on my street, something caught my eye in front of me. I could tell it was an dark object moving towards me, but at first I couldn't make out a shape. As it came closer, moving very slow around 15mph, I could make out a trianglular shape. This thing was very large. I stopped my car at the stopsign and opened my door and got out and looked up as it passed overhead. It was very silent, but it did have a very light \"purring\" sound. I watched it flow over head and was just in awe. I knew immediatly what I was seeing and just couldn't take my eyes off it as it continued down my street and over a small city pond and off in the distance. My husband was with me, but unfortunatly, doesn't remember anything (him and his buddies pulled a good beer buzz and he was passed out in the passenger seat). I did try to wake him up when it was overhead, but he was loudly suggesting me to get in the car and take him home. I think that if he were not with me, and I was by myself that night, I would have turned around and followed that thing. What was really odd is that this object ,when overhead, blocked out all the stars and was not conspicuous at all. If not looking up at the time, I would have never even knew it was there. I think I was just at the right place at the right time that night. I have always believed in UFO's since I was a little girl and continue to have a great interest in the truth. I've told my stories a couple to time to different people when the subject comes up, but I don't really think they believe me. I don't talk about this incident anymore. My husband didn't remember anything the next morning and still doesn't to this day. I don't know if he believes me either, but I know what I saw that night. It was, without a doubt, not from our doing here in this world. I would also like to note that Cannon Air Force Base is home here in Clovis, New Mexico and I've seen many weird looking military airplanes but nothing like this."],"Tags":"City","City":"Clovis","Region":"New Mexico","Latitude":"34.411999","Object Features":"None","Weather Factors":"Unknown","Country":"United States","Longitude":"-103.195267","trends":["There have been 6 other sightings in Clovis","There were no other sightings in Clovis on or around May 15th 2000"]}