{"Object Flight Path":"Straight-line path","Tags":"City","Region":"Arkansas","Sighting Duration":"Undisclosed","Summary":"Bright light.. As object passed could see night red blinking lights on underbelly. No sound.","Weather Factors":"None","Latitude":"35.499968","Date Submitted":"10/31/2010 02:03 UTC","files":["/var/www/straped/mufon/html2text/26238.html.txt","/var/www/straped/mufon/org/26238.html"],"Date of the Event":"10/31/2010 11:32 UTC","divs":["Sighting DetailsI live in Cleburne County, AR. My dogs were barking at 11:32 p.m., October 31, 2010...so I went out with a flashlight to see if I could spot what was causing the problem. After looking around I turned the light off. No sooner than I turned the light off, but a bright white light came on in the sky to the north west. At first, I thought it was a landing light of an aircraft...heading to the nearest small airport, but the object was too far out from the airport to have its lights on. So I thought it was a helicopter...there was no sound. The object was moving slowly from the west to the east and I would guess about 1500 ft in altitude. There was NO sound, what so ever. As the object passed I could see 9 red flashing lights on the underbelly of the craft...in a trianglar outline. Along the sides were three alternating bluish lights. I live in a rural area, on the ridge of a mountain. It was a very clear night. No clouds. No city lights. I was facing the north which is cleared...so a clear view. There are trees to the west of my property and to the east of the property. The object was in view for approximately three minutes. Once it pasted to the east it was out of my line of sight. I waited for several minutes, but it did not return. It was really quite exciting and fascinating. My husband works in the airline industry and I have been around aircraft and blimps at night. I have never witnessed anything the looks like this. My first thought was that it is an experimental military aircraft, as we live in the flight path of a airforce base in Jacksonville, AR. But I have never seen this before. I called my daughter who lives further east of my location and asked her to step outside and watch for the lights...she never saw them and she lives very near the small airport I mentioned earlier. I was able to capture three videos with my cellphone camera. The quality is not great. The first one is the longest, but it is also the one that seems to move around alot, due to my movements...the light was on a steady path."],"trends":["There have been 3 other sightings in Heber Springs","There were no other sightings in Heber Springs on or around October 31st 2010","This sighting has never been favorited.",""],"City":"Heber Springs","Country":"United States","Case Number":"26238","Log Number":"US-10312010-0004","Object Features":"Unknown","Disposition":"Unknown","Longitude":"-92.02436","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.499968,+-92.02436(26238)&iwloc=A&hl=en\"> mufon case (26238) map </A>","Source":"MUFON"}