{"Sighting Duration":"00:10:00","Log Number":"","Case Number":"2623","Tags":"City","divs":["Sighting DetailsMe Matthew Borden, my fiancee Justine Olivares and her 2 children were driving down hwy 72 westbound to cherokee alabama to do some star gazing bc I am into amateur astronomy. It was right about sunset the sun had already went behind the horizon, Me and justine both saw an redish pinkish glowing arrowhead shaped object hovering in the sky to the right side of the hwy both of us said at the same time What the hell is that We watched it for a minute going down the road it remained motionless I pulled over in a church parking lot to the left side of the hwy and the object turned from vertically up and down to horizontally. I was going to get my binoculars from my bag and noticed children playing in the parking lot so I went on down the hwy and turned into the old Orba plant driveway, as I was getting out of my jeep to get my binoculars the pointed end of the object turned our direction, altho it was moving the redish glow which I thought was a reflection of the sun never moved the glow stayed constant as I was digging thru my telescope bag for the binoculars my fiancee yelled It's Moving I looked and the object appeared to be moving in reverse away from us slowly I got my binoculars out and was removing them from the pouch and walking around to drivers side to avoid being hit by cars, I had just got to the side ofthe car and it vanished. It didn't fly off or move it just vanished right in front of my eyes...Me and my fiancee were breathing heavy the kids wanted to know why they were looking at us. But other than being a little scared no one had any physical effects. Any information you can give me as to what it was would be VERY appricated..most importantly will it come back..and should I be worried that it noticed us Thank You"],"Country":"United States","Object Shape":"Other","Longitude":"-87.967604","trends":["There has been one other sighting in Cherokee","There were no other sightings in Cherokee on or around October 18th 2003"],"Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=34.761994,+-87.967604(2623)&iwloc=A&hl=en\"> mufon case (2623) map </A>","Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Summary":"We saw an arrowhead shaped glowing object","City":"Cherokee","Date Submitted":"10/18/2003 07:00 UTC","Date of the Event":"10/18/2003 07:00 UTC","Latitude":"34.761994","files":["/var/www/straped/mufon/html2text/2623.html.txt","/var/www/straped/mufon/org/2623.html"],"Source":"MUFON","Object Flight Path":"Straight-line path","Object Features":"Other"}