{"Object Shape":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsMy stepdad and I went to the Queen Mary area of Long Beach Harbor to see if an old B17 bomber shell was still on display but it was only on display for one day either Friday or Saturday.the display time and location was in the Long Beach paper. It was gone so we went to Shoreline Village. We were looking for a parking space and was near the end of the parking lot when a bright object caught my eye at about 4000 ft. my angle of sight put it above the Queen Mary for reference.The sun was at a position between the object and the Goodyear Blimp which was at about 800 ft. elevation, the blimp was over the city moving down the beach which was crowded with people and the object was 3 to 4 miles away both were moving the same direction down the beach.When I noticed there were no wings or engines or tail section everything seemed like slow motion I looked at my stepdad and he was busy trying to grab the parking spot and the car in back of us was trying to crowd us past the parking spot so they could park.Anyway it was probably about 500 ft long about 45 ft. high and had no windows and both ends looked the same, sloped and rounded and the whole vessel had rounded edges rather than sharp 90 degree edges.At what could be called the cockpit section there were seams the whole length spaced evenly like it could be lengthened or shortened.When the car stopped I jumped out and carefully focused my digital camera and when I pushed the shutter nothing happened. Icouldn't believe my luck. The night before I took the full card out got distracted and put the damn full card back in, when I was intent on taking pictures of it a cloud of mist formed like a square wall that you could still see the blue sky through it that was big enough for the craft to slowly fly into but not out of.By the time I had deleted 2 pictures the end of the craft disappeared into the mist.This has really shook me up. NO ONE believes me and if they can do what they did what chance would we have if they meant harm instead of sightseeing. That was my impression after awhile, the speed they were going was slow enough.I can't get this damn thing out of my head and I wish now it didn't happen to me.Do you guys respond to these reports?Hope you guys believe what I have said here I am not able to make this thing up.I can draw it but don't know how to put it into the computer to send to you. Sorry for my lack of computer skills."],"Disposition":"Insufficient Data","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around June 8th 2010"],"Case Number":"26239","Log Number":"US-10312010-0005","Sighting Duration":"Undisclosed","Region":"California","Longitude":"-118.155976","map":"<A HREF = \"http://maps.google.com/maps?q=33.808557,+-118.155976(26239)&iwloc=A&hl=en\"> mufon case (26239) map </A>","Date of the Event":"06/08/2010 04:40 UTC","Summary":"watched long bright metal object flying same course but higher elevation as Goodyear Blimp on bright sunny day","Object Flight Path":"Undisclosed","Tags":"City","Latitude":"33.808557","files":["/var/www/straped/mufon/html2text/26239.html.txt","/var/www/straped/mufon/org/26239.html"],"Object Features":"Undisclosed","Country":"United States","City":"Long Beach","Date Submitted":"10/31/2010 03:14 UTC","Weather Factors":"Unknown"}