{"files":["/var/www/straped/mufon/html2text/26232.html.txt","/var/www/straped/mufon/org/26232.html"],"Object Flight Path":"Stationary,Other","Weather Factors":"Unknown","Latitude":"41.713799","trends":["There have been 15 other sightings in Michigan City","There were no other sightings in Michigan City on or around October 29th 2010"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","City":"Michigan City","Sighting Duration":"00:30:00","Date of the Event":"10/29/2010 10:33 UTC","Date Submitted":"10/30/2010 08:41 UTC","Summary":"Balls of light being followed by US aircrafts","Source":"MUFON","Longitude":"-86.89159","Tags":"City","Region":"Indiana","Object Shape":"Circle, Flash","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.713799,+-86.89159(26232)&iwloc=A&hl=en\"> mufon case (26232) map </A>","Object Features":"Unknown","divs":["Sighting DetailsI was sitting the bedroom of my apartment when I heard a helicopter outside. By the time I looked outside my screen door, the helicopter was gone, but off in the distance I could see a bright ball of light hovering. If I put my hand up in front of me, it would be the size of my thumbnail. It was too far for me to see if there was a shape to it, all I saw was a bright ball of white light and it was hovering over the treeline. It could not have been any kind of aircraft we have now, it was too bright to be so far away and it was not a star because it didn't look like a star, it was just small white ball from where I was standing. Then it turned blue and then white again, then it dissappeared- just like that. I felt confused at first when I saw it, like I couldn't believe what I was seeing. Then I realized this was a real UFO, it could not be anything else but that. A couple of minutes later, I heard helicopters again, so I rush to the screen door and I see three helicopters moving towards the direction of the previous UFO. The bright ball of light, UFO, is there again and the helicopters are moving towards it. And I'm pretty sure that there was also a plane near the UFO, it was quickly flashing red, blue, and white and moved like a plane in one direction. It was coming from the left side. Then the ball of light turned blue and dissappeared. And all of the sudden another white ball showed up to the right side, it just showed up out of nowhere. Just appeared. I thought it was the same ball of light, but then another one showed up where the previous one was at. So there were two, one in front of me and one to my right. They started moving towards each other, then stopped and dissappeared. The was the last time I saw them last night."],"Case Number":"26232","Log Number":"US-10302010-0021","Country":"United States"}