{"City":"El Dorado","Date of the Event":"10/30/2010 08:20 UTC","Case Number":"26234","files":["/var/www/straped/mufon/html2text/26234.html.txt","/var/www/straped/mufon/org/26234.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10302010-0023","trends":["There has been one other sighting in El Dorado","There were no other sightings in El Dorado on or around October 30th 2010"],"Longitude":"-96.862252","Country":"United States","Source":"MUFON","Object Shape":"Triangle","Latitude":"37.81724","Disposition":"Unknown","divs":["Sighting DetailsAt exactly 2020 hours on Saturday night between the 5th and 6th innings of the world series, I went on to the porch to smoke, and something in my head said look up at the stars witch I do at night when I am on the porch. I decided to go out to the sidewalk and look at the stars since it was a very clear night. some dark gray movement in the NE part of the sky caught my attention. I looked at it and as it passed over my head I saw that it was moving at a relatively fast pace. I distinctly saw 7 dim orange lights on the leading edges of it. It moved to the SW and disappeared over the houses and I noticed that no sound followed the thing. I have grown up with a father in the Air Force so I know what aircraft are. I have a great knowledge of modern aircraft and I have never seen anything like this. I keep telling myself that what I saw is not possible. I continued to search the sky as the craft was only 20 miles NE of McConnell AFB. No modern aircraft were trailing the object. about 10 minutes after this incident I saw two flocks of large birds fly over my house and they did not resemble it at all. you could actually make out each individual bird. this craft was almost transparent against the pitch black night sky. It blocked out the stars as it passed by. the dim orange lights were the only thing I could make out clearly. Please tell me I am not crazy. My roommates think I am now. I only had about 10 seconds to view it as it again traveled from the NE in a southwesterly direction towards McConnell AFB."],"Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.81724,+-96.862252(26234)&iwloc=A&hl=en\"> mufon case (26234) map </A>","Date Submitted":"10/30/2010 10:04 UTC","Viewing Distance":"Unknown","Summary":"Triangle with dim orange lights on leading edges.","Region":"Kansas","Weather Factors":"Unknown","Object Flight Path":"Straight-line path"}