{"files":["/var/www/straped/mufon/html2text/26241.html.txt","/var/www/straped/mufon/org/26241.html"],"divs":["Sighting DetailsI walked out to call my cat in at about 9:20 pm. The night was crystal clear and very cold. January 30th, 2009. Something caught my peripheral sight line and I couldn't believe what I saw. It was a huge vee shaped object that sat as if painted on the night sky. It was motionless and had no sound. The wing span on each side had to be 60 - 100 feet or so. Each wing had four, round white lights. The craft stayed in that same position for at least fifteen minutes. I had enough time to call my neighbor to see it and my daughter as well. (My daughter reports that she remembers the craft changing shape, into a long line from the vee. Suddenly, a small red light at the apex of the vee came on and the craft disappeared. Again, it disappeared without any sound or visual trail. A similar event took place in April of that same year. I saw a white light coming across the top of the Mountains and for some reason I just knew it was the same craft returning. I ran outside, called my husband to come and look and this time saw a smaller craft with only two lights on each wing, again, white round lights. The craft stayed a shorter time and more or less disappeared in the same way...instantaneously. I would be happy to discuss this with you.In retrospect, I remember feeling puzzled at the sight, then excited and then somewhat fearful."],"Disposition":"Unknown","Object Features":"Undisclosed","Region":"New York","Case Number":"26241","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around January 30th 2009"],"Longitude":"-74.002273","Viewing Distance":"Unknown","Date Submitted":"10/31/2010 10:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.722853,+-74.002273(26241)&iwloc=A&hl=en\"> mufon case (26241) map </A>","City":"New York","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-10312010-0007","Tags":"City","Date of the Event":"01/30/2009 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Summary":"Saw huge vee shape, with four large round lights on each wing. Motionless, no sound, close by hanging in sky.","Latitude":"40.722853","Source":"MUFON","Object Shape":"Chevron"}