{"files":["/var/www/straped/mufon/html2text/26253.html.txt","/var/www/straped/mufon/org/26253.html"],"Object Shape":"Oval","Log Number":"US-10312010-0019","Region":"Michigan","Object Features":"Unknown","divs":["Sighting DetailsIve seen UFO's before. (I have seen objects that I was unable to explain (Makeing them UFO's to me)) This was the first time I had seen one during the day. I was reclined inn the passenger seat of our car. We had just got done shopping at a store. My wife was talking to me and I was listening to her. As I was listening I was looking up in the clouds and I was enjoying how big and beautiful they looked when I saw inbetween them a oval shape reflection really far away..... Now I new it wasnt a plane considering that no plane would be that high with an airport nearby, and the fact that I had seen countless planes that day and this thing seemed not to be moving ...... I watched it while my wife continued talking.... I didn't let her know about it untill it was gone because A. She was driveing B. She gets nervous from stuff like that seeing as we had been seeing UFO's all over Adrian and Tecumseh for 3 years now..... Some of wich had chased us and or did strange things like appear right infront of us..... Anyway, as she was talking I continued to watch and just before a cloud was going to cover it up from view.... it just vanished...... My only responce to let my wife know what I had seen was me saying..... \"Interesting....\" She asked me what was interesting, in which I told her..... If interested in this case..... ask me about the other sightings ive had.... I'd like to know what I seen....."],"City":"Adrian","Date Submitted":"10/31/2010 06:01 UTC","Country":"United States","Date of the Event":"01/31/2010 02:20 UTC","Tags":"City","Case Number":"26253","Sighting Duration":"00:05:11","Summary":"Small oval shine in sky during day. not moving fades from exsistance","Latitude":"41.901807","Object Flight Path":"Stationary","Disposition":"Unknown","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Adrian","There were no other sightings in Adrian on or around January 31st 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.901807,+-84.028886(26253)&iwloc=A&hl=en\"> mufon case (26253) map </A>","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-84.028886"}