{"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=30.578855,+-97.408104(26254)&iwloc=A&hl=en\"> mufon case (26254) map </A>","Latitude":"30.578855","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Case Number":"26254","Disposition":"Unknown","Date of the Event":"12/15/1951 08:00 UTC","Object Flight Path":"Hovering then path","Log Number":"US-10312010-0020","City":"Taylor","Country":"United States","files":["/var/www/straped/mufon/html2text/26254.html.txt","/var/www/straped/mufon/org/26254.html"],"Summary":"Close encounter with two disc shaped objects, metalic, 24\"-36\" diameter","trends":["There have been 3 other sightings in Taylor","There were no other sightings in Taylor on or around December 15th 1951"],"Longitude":"-97.408104","Tags":"City","Region":"Texas","divs":["sighting detailsmy grandfather, my father, and i were returning to taylor, from our farm between round rock, and hutto. my grandfather, driving, and my father were in the front seat. i was in the back seat trying to sleep. when we turned onto hwy 95 (n), from lake drive, we had driven about 1 mile when my grandfather said, \"what the hell is that?\", and started slowing down. he came to a full stop, and up ahead of us, directly over the road, about 100 yards ahead, were two silver discs hovering about 3-4 feet over the road. we watched them for about one minute, then they proceeded to the left, over some stalks of either corn, or maise. they were only about one foot above the stalks, but there was no deflection, or sound. they proceeded down the row of maise\\corn for about 300 yards. there they stopped, then pivoted 90 degrees, to present a full, top view, and they both shot up into the air, and were out of sight in about 3 or 4 seconds. grandfather is dead, father is dead, and i'm 72, and dying. just thought someone should know about this, in case it ties in with any other reports. all dates, and times are approximate. i do remember it was a saturday, or a sunday morning, and the sun was only up for a little while and reflected off of the discs when they tilted up, and shot out of sight in the west. i still live on the farm we we tending that morning, and remember almost the exact spot where we saw them. plus this is all true. i even tried to tell the newspaper in taylor, and houston, when dad and i returned to houston, but they wouldn't believe me, and didn't investigate. if they had, my grandfather, and my father could have corroborated the event, but they didn't, and now there is only me."],"Source":"MUFON","Object Shape":"Disc","Object Features":"Other","Date Submitted":"10/31/2010 06:19 UTC"}