{"trends":["There have been 10 other sightings in Destin","There were no other sightings in Destin on or around June 30th 2008"],"Case Number":"26256","Region":"Florida","Longitude":"-86.492143","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=30.401534,+-86.492143(26256)&iwloc=A&hl=en\"> mufon case (26256) map </A>","Latitude":"30.401534","Object Features":"Unknown","Country":"United States","Source":"MUFON","City":"Destin","Sighting Duration":"00:00:15","Summary":"2 white dots, close together, move apart in opposite direction, quickly","Object Flight Path":"Hovering then path","divs":["Sighting DetailsThe location was a couple of blocks from the beach. I was sitting on the deck watching the night sky, looking south across the Gulf of Mexico. I happened to be looking at a pair of (what I thought were) stars. They were very close together and of fairly equal brightness. As I was looking at them, they suddenly began moving away from each other, one to the east and one to the west. Their acceleration was very smooth and rapid and within a few seconds they were very far apart. And then they vanished. Obviously, my first thought was that they must be airplanes. But, they had no red lights. They were both simply white, star-like dots. And, of course, airplanes don't stop in mid-air and then start flying again. I've been a stargazer for most of my life, and know the difference between shooting stars, airplanes, helicopters, etc., at night. There was no doubt in my mind that what I was witnessing was none of those. In fact, I had never seen anything like it before in my life. This was something different. Very different. I'm a very skeptical and rational person, and though I do believe we are not alone in this universe, I don't watch the skies in search of aliens. I just enjoy its beauty. It's been over two years since this happened, and the effect is still profound."],"Tags":"City","Date of the Event":"06/30/2008 11:00 UTC","Weather Factors":"None","Log Number":"US-10312010-0022","files":["/var/www/straped/mufon/html2text/26256.html.txt","/var/www/straped/mufon/org/26256.html"],"Date Submitted":"10/31/2010 06:32 UTC","Disposition":"Unknown","Object Shape":"Star-like"}