{"Latitude":"61.221976","Tags":"City","Date of the Event":"10/13/2010 08:15 UTC","files":["/var/www/straped/mufon/html2text/26252.html.txt","/var/www/straped/mufon/org/26252.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","City":"Anchorage","Source":"MUFON","Country":"United States","Log Number":"US-10312010-0018","divs":["Sighting DetailsOn the evening of October 13, 2010, I picked my teen up from dance class which gets out at 8:00 PM. We went straight home that night so the time had to be around 8:15PM when we turned into our neighborhood. As I turned the corner into my complex, we both caught 4 extremely bright lights in the sky just hovering. We looked at each other with wide eyes, and asked each other, \"What was that!?\" I hurried and pulled up to my garage door where we could get a good visual. We both jumped out of the car to look up at them. There were 4 lights that were the color of fire. Not orange like street lights, but not red like taillights either. The amount of light that was being illuminated was not like anything we've seen before. They had to have been huge or highly powerful. (We see aircraft several times a day). They were above South Anchorage, just higher than the mountains, but lower than the clouds. Between O'malley, Huffman, and maybe as far over as DeArmoun Rd. They slowly started to move North in single file before they turned and headed West. Before they were over Lake Otis Pkwy, the first two lights disappeared, one at a time. The second two lights kept going for a short distance. I had called up to my roommate to look out the window (hands were shaking to dial). The third light disappeared and she caught sight of the fourth light before it disappeared. We noticed that the light flickered right before they disappeared. The \"backdrop\" of the sky was evening but you can still see if an airplane is flying without lights. There was nothing. And no sound. Hot air balloons can't disappear like that nor can they produce the intensity of light that these did. That baffled us and we cannot wrap our minds around what we saw that night. I don't know how to find out if anyone else saw it too."],"Case Number":"26252","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around October 13th 2010"],"Date Submitted":"10/31/2010 05:55 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Object Shape":"Circle, Fireball, Sphere","Region":"Alaska","Longitude":"-149.899278","map":"<A HREF = \"http://maps.google.com/maps?q=61.221976,+-149.899278(26252)&iwloc=A&hl=en\"> mufon case (26252) map </A>","Summary":"Lights over Anchorage Color of Fire Controlled Flying then vanished in mid air."}