{"files":["/var/www/straped/mufon/html2text/26264.html.txt","/var/www/straped/mufon/org/26264.html"],"divs":["Sighting DetailsWas travelling north on Hwy PD when my wife and I saw what appeared to be a stationary orange light hovering in the sky. Stopped my vehicle along side the road to get a better view. When I got out of my vehicle the light was moving in a southerly direction and more or less parallel to the road I was on. It wasn't moving very fast but I observed shortly after it passed my position that the light just seemed to disappear. Not like it got so far away I couldn't see it anymore, but just disappeared. It was a single, spherical orange light. It wasn't very bright, but somewhat subdued. It didn't blink, but maybe pulsated slightly and didn't make any sound that I could hear. The whole incident from the first moment I saw the light until I lost sight of it was approximately 2 minutes. The exact location as determined by topographical mapping software is 42 degrees, 55.570 minutes N and 89 degrees, 31.689 minutes W. Elevation of that location is 899ft above sea level. Time of incident was 1:35 a.m., October 31, 2010. Skies were clear and many stars along with a large crescent moon were visible. Approximate temperature was 35 degrees Fahrenheit. I had no alcohol or narcotics in my system. I was not impaired in any way. My wife also witnessed the light. There were no other vehicles on the road that I noticed when the light was visible. I assume it was just a normal aircraft that I couldn't positively I.D. Because of the darkness and the angle of viewing I might have missed some features that would have given me a clue as to what it was. I'm not overly concerned of what I saw, just curious."],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Latitude":"42.92944","Region":"Wisconsin","City":"Paoli","Log Number":"US-10312010-0030","trends":["There have been no other sightings in Paoli","This sighting has never been favorited."],"Tags":"City","Date Submitted":"10/31/2010 09:35 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.92944,+-89.52361(26264)&iwloc=A&hl=en\"> mufon case (26264) map </A>","Weather Factors":"None","Disposition":"Unknown","Summary":"Orange light in sky appeared stationary then started moving south then disappeared.","Longitude":"-89.52361","Object Shape":"Star-like","Case Number":"26264","Date of the Event":"10/31/2010 01:35 UTC","Sighting Duration":"00:02:00","Object Flight Path":"Hovering then path","Source":"MUFON"}