{"trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around November 1st 2010"],"City":"Torrance","Object Features":"Undisclosed","Region":"California","Summary":"half moon (blimp) looking object stationary, a distance away from it orange satilite looking objects were apearing and flying around eachother then dissapearing","Object Flight Path":"Other","Weather Factors":"None","Latitude":"33.837449","divs":["Sighting Details7am i walked out of work to go home. I observed a strange \"mark\" in the sky at the horizon as the sun was about to begin rising. I couldn't tell if the \"mark\" was an oval cloud reflecting the rising sun or a stationary object. About 10 minutes later to the far right of the \"mark\" a bright light appeared and seemed to \"swim\" around in the sky like a fish. It was a ball that seemed to glow orange then back to a bright light then disappear. For 20 minutes I witnessed this with 2 co-workers. At one point 2 lights appeared and seemed to interact with each other then disappear. The entire episode was about 30 minuets, the lights overall reappeared about 5 times and the phenomena gradually decreased as the larger \"mark\" drifted farther east until out of sight. Planes north of the phenomena from LAX gave a great control comparative during the observation. These were not commercial air craft, they simply looked like firefly's in the atmosphere."],"Longitude":"-118.336689","Source":"MUFON","Object Shape":"Blimp, Fireball, Oval, Star-like","Date Submitted":"11/01/2010 11:52 UTC","Tags":"City","Disposition":"IFO","Log Number":"US-11012010-0008","Case Number":"26274","Viewing Distance":"Over One Mile","Date of the Event":"11/01/2010 07:10 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.837449,+-118.336689(26274)&iwloc=A&hl=en\"> mufon case (26274) map </A>","files":["/var/www/straped/mufon/html2text/26274.html.txt","/var/www/straped/mufon/org/26274.html"],"Sighting Duration":"Undisclosed"}