{"Tags":"City","Viewing Distance":"Unknown","Region":"Florida","Date of the Event":"11/01/2010 11:55 UTC","Log Number":"US-11012010-0006","Object Flight Path":"Undisclosed","Country":"United States","Latitude":"29.028129","files":["/var/www/straped/mufon/html2text/26272.html.txt","/var/www/straped/mufon/org/26272.html"],"trends":["There have been 9 other sightings in New Smyrna Beach","There were no other sightings in New Smyrna Beach on or around November 1st 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.028129,+-80.923608(26272)&iwloc=A&hl=en\"> mufon case (26272) map </A>","Longitude":"-80.923608","Object Shape":"Flash, Unknown","Object Features":"Undisclosed","City":"New Smyrna Beach","Date Submitted":"11/01/2010 01:52 UTC","Disposition":"Insufficient Data","Summary":"GREEN FLASHES FROM ON OR JUST BELOW THE HORIZION","Weather Factors":"Unknown","divs":["Sighting DetailsMy brother and we outside star gazing out to catch a shooting star.It is a common to see aleast one or two on a clear night. When it was about 12:30am is when the first flash i noticed. It was a flash of light neon green, or emerld green in color in the direction about 290 degress west, northwest sky.The second flash came about 7-10 minutes later same color was spoted by my brother in the south, southwest sky about 220 degrees,then again about 5 minutes later another flash this time in about 270 degrees due west. the fourth and final flash witnessed was about another 5-7 minututes from the last in about 240 degrees west southwest. All the flashes seen are fairly bright and appear very low on the horizion with a maxium of 40 degress to the highest point of illumination from the ground up and about 20 to 30 degress wide. The light that we were seeing seemed to have no point of origin,no brighter point threw out the flash itself.these lights are not the first time seeing them i have personally have witness these same flashes many times before but never to here a sound."],"Case Number":"26272","Source":"MUFON","Sighting Duration":"00:30:00"}