{"Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Fremont","There were no other sightings in Fremont on or around October 29th 2010"],"divs":["Sighting DetailsI was at our vacation trailer on the Wolf River about a mile down river from Fremont, Wi. (20 miles west of Appleton,Wi.). It was dusk. The sky was clear, stars were very very faint. I was facing southeast, a planet was the brightest object in the sky (venus?) It was this planet I was looking at. It wasn't dark yet (azure skies).The planet was off my 2o'clock the object came into view off my right shoulder slightly below the planet. It was as bright as the planet and about the same size. The planet was a brilliant white while the object was more like a dirty white.It moved in a straight path in a northerly direction from my right shoulder to my nose. The motion was odd, more like quickly floating horizontily then being propelled. It reminded me like letting a helium balloon go and watching it go skyward but on a horizontil plane. I watched it for 30 sec. to 1 min. It didn,t waver or strobe or flash. I wasn,t overly concerned when I saw it at first thinking it was a plane until I realized the speed and altitude were wrong then I thought it was weird (different). I continued to observe the object until like I said it got to about my 12 o'clock and it went out. It was like someone flipped a switch it just went out. It was well above the horizon and tree line across the river, no clouds or anything to obstruct my view. It didn't go up or down left or right it just went out and the sky where it was was empty. I live near the airport in Racine, drive past the airport in Milwaukee daily, drive past the EAA airport in Oskosh almost every weekend from spring to fall, in all types of weather and different times of day or night and I have never witnessed anything like this. This is a rural area no city lights or abundent air traffic. I wasn't afraid or in awe. My feeling was that this is really weird. I didn't do anything but stand there and watch. I am an avid fisherman and fish in daylight and dark and because of this area being a major wetlands I am also familiar with different types of birds and there habits."],"Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"26280","City":"Fremont","Weather Factors":"Unknown","Log Number":"US-11012010-0014","Object Shape":"Sphere","Region":"Wisconsin","Tags":"City","Object Features":"None","Date of the Event":"10/29/2010 12:00 UTC","Disposition":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","Date Submitted":"11/01/2010 07:35 UTC","Summary":"watched glowing sphere move across sky until it just went out","Longitude":"-88.864834","files":["/var/www/straped/mufon/html2text/26280.html.txt","/var/www/straped/mufon/org/26280.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.259703,+-88.864834(26280)&iwloc=A&hl=en\"> mufon case (26280) map </A>","Latitude":"44.259703"}