{"Summary":"Luminous orbs at high altitude dart around daytime sky above Boulder","trends":["There have been 3 other sightings in Superior","There were no other sightings in Superior on or around October 31st 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.954683,+-105.165848(26283)&iwloc=A&hl=en\"> mufon case (26283) map </A>","Viewing Distance":"Over One Mile","Weather Factors":"Windy, Light","Tags":"City","Latitude":"39.954683","Country":"United States","Object Shape":"Star-like","Disposition":"Unresolved","divs":["Sighting DetailsMy girlfriend and I were walking around the Pearl Street Mall in Boulder Sunday afternoon looking at children in their costumes. We were standing at the intersection of Pearl Street and 14th Street looking East. I noticed several balloons were being released into the sky and I was trying to see how high they would go. There were several gliders flying around also that day from the nearby airport, and occasionally caught a few glimpses of the sun gleaming off of them as they very slowly cruised across the sky. As I was watching one of the gliders, I saw what looked like a shooting star or meteorite travel right behind the glider, as it was very bright and possibly a little yellowish in color. There was no noise. I thought maybe it was a balloon, but then thought there's no way it could travel that fast across the sky... but maybe its really windy up there. It had traveled about two or three widths of my hand across the sky in less than a second (measured with my arm fully extended out.) It was really small and hard to see, maybe like trying to look at a star during the daytime. This object seemed to fade in and then fade away as if it was a light that went out, maybe it went behind some moisture in the air but it looked as if it was gone. Right after I was thinking maybe it was a shooting star, about a half second after that it reappeared and went back the direction in which it came at the same speed and disappeared again. There was no trail like I have seen on shooting stars thought. Next, I couldn't tell if it disappeared or if I'd lost track of it as it was so small it was hard to see. At this point I thought a balloon couldn't have back tracked that quickly. Maybe they were satellites I thought. At this point I told my girlfriend to look up at the sky in the direction of the phenomenon to see what she though, while she didn't see anything she said it was probably a balloon. As I kept an eye on them I now saw two of these objects fly across the sky side-by-side about two finger widths apart, definitely not balloons flying in formation. I pointed to the area again as one or two of them continued to move around the sky in large arcs, fading in and out and zig zagging through the sky. She said that she also saw them move quickly and zig zag and doubted they could be balloons, but refrained to say what she thought they were. I guess the range of the sky they were moving in was approximately a four foot square area at arms length, enough to need to turn my head a bit to watch, maybe a larger area as I lost track of them several times. It was a comforting feeling to me that she saw them also. Towards the last few minutes of watching them they were moving at what seemed like large distances in a very short amount of time. Based off of seeing the latest military jets at the local air show this summer, there's no way they were conventional aircraft. They (or one of them) seemed to get closer and further away and at times seemed as I could barely see them. At one point the object slowed down momentarily and appeared to get bright yellow-orange while it sparkled like a star, and appeared to be approximately the size of the largest star in the sky I've seen at night, at this point it kind of looked like a mini sun. They just seemed to fade away and we never saw them again. It was pretty exciting to see what ever phenomenon this was. The fact that at least two of these lights flew together makes be believe it was intelligently controlled, but by who?"],"files":["/var/www/straped/mufon/html2text/26283.html.txt","/var/www/straped/mufon/org/26283.html"],"Object Flight Path":"Straight-line path,Path with directional change","Case Number":"26283","Date of the Event":"10/31/2010 03:45 UTC","Region":"Colorado","Date Submitted":"11/01/2010 11:57 UTC","Longitude":"-105.165848","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Unknown","Log Number":"US-11012010-0017","City":"Superior"}