{"Latitude":"41.589599","Case Number":"26286","Region":"Indiana","City":"Hammond","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.589599,+-87.493841(26286)&iwloc=A&hl=en\"> mufon case (26286) map </A>","Date of the Event":"07/10/2009 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Summary":"Flying horizontally single craft then split into 3 triangle and sped up fast","trends":["There have been 8 other sightings in Hammond","There were no other sightings in Hammond on or around July 10th 2009"],"files":["/var/www/straped/mufon/html2text/26286.html.txt","/var/www/straped/mufon/org/26286.html"],"divs":["sighting detailsmy brother from texas was visiting and we are not new to encounters. i was driving and showing him around the city in hammond. then, i noticed a very bright orange\\white (firey) light in the sky and quickly thought it was very unusual. i pointed it to my brother and pulled over the street to see what it was. we both witnessed the light of the space craft, which came to a complete hault, flying horizontally (approximately 15,000 feet)and not in an arch(as fireworks would) but then split into three(3) cone like lights and sped-up in one zig-zag motion pausing almost still like in 30degree angles then took off horizontally east-bound (almost like around gary airport in indiana) so those guys or tower people must have witnessed it themselves- like nothing on earth we've seen or flying crafts like jets or hilicopters could. my brother and i both were very excited but knew our spouces would not believe because \"seeing is believing\"... i quickly tried to follow by turning east-bound onto streets but a couple of blocks later we lost them. on our way back, a police patrol car was parked and we were tempted to pull over and inform authorities of our sighting but decided to go back home and turn tv, radio, computer internet, etc., to see if anyone had reported this event. no one did but we know we were not the only ones witnessing this sighting. in past, we have witnessed other closer sightings in nm, and tx. i am not dissapointed in the fact our spouses did not believe us because we witnessed the sighting and that's all that matters to us or me, personally. i could not take photos since it happened so fast. if there is a next time, i hope to react swiftly by snapping pictures with phone."],"Disposition":"Insufficient Data","Date Submitted":"11/02/2010 12:15 UTC","Object Flight Path":"Stationary,Path with directional change","Log Number":"US-11022010-0003","Source":"MUFON","Object Shape":"Bullet, Missile, Cone, Fireball, Triangle","Object Features":"Dome","Tags":"City","Country":"United States","Longitude":"-87.493841"}