{"divs":["Sighting DetailsI was walking west on Olympic Blvd near Flower street when I glanced up past the Petroleum building (west). Through the LA Live spotlights and over the roof of the Petroleum building there appeared what I initially thought was just stars. Then the \"stars\" started growing brighter in clusters of two or three. I discerned a string like pattern (almost like connect the dots) with various \"stars\" illuminating. I did not discern any pattern, though groups of two or three \"stars\" appeared to shine with greater intensity, sometimes towards the front of the \"string\", then \"stars\" towards the back of the string would intensify shortly after the last group dimmed (but remained visible). The whole string appeared to move very slightly, perpendicular to the lines of planes heading for LAX. I used the flag posts on the top of the petroleum building as a reference point. The \"string\" appeared about three times the apparent diameter of the moon. It was not a straight line, but was an almost tree like assembly of \"stars\" which seemed to extend straight then loop around at the back. It did not appear to me that the LA Live spotlights were illuminating the string. From my vantage point the string appeared two or three times higher than jets inbound to LAX on the typical night western to eastern trajectory (where they typically loop around and land to the west going into LAX.) I observed the \"string\" for about two minutes and concluded it could be a group of star like objects flying together, as I was unable to discern any structure connecting the independent white points of light. What really struck me as odd was how only two or three of the stars would grow in intensity, then fade (though remain still visible) and then a few moments a different set of two or three \"stars\" would grow in intensity for a couple of seconds, with the whole lot (about 10-15) remaining visible throughout. The \"stars\" that intensified were always clumped in adjacent groups of two or three (i.e. if the lights in front intensified, the ones ion back remained constant). I walked past the Petroleum building to see if the string would be visible from a different vantage point. It was not. I then returned to my original vantage point but could not see the string at all. A minute or two later two strobing red lights were seen, which moved like aircraft. These lights flew past the area where the string had been, then looped back around (after a couple of minutes). Overall this was a very odd experience. There is always a lot of air traffic at night over downtown Los Angeles, but I've never seen anything like this before. I do not think this was a single object, but multiple. They appeared at high altitude and became invisible after a couple of minutes. During the time they were visible, the truly odd thing was how some increased (flashed) in intensity, as described above."],"trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around November 1st 2010"],"Case Number":"26288","Object Flight Path":"Other","Longitude":"-118.239085","Date of the Event":"11/01/2010 09:35 UTC","Country":"United States","Latitude":"34.056634","Summary":"String like collection of multiple star like points of light visible briefly from downtown LA","Disposition":"Unknown","Weather Factors":"None","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Region":"California","Log Number":"US-11022010-0005","City":"Los Angeles","map":"<A HREF = \"http://maps.google.com/maps?q=34.056634,+-118.239085(26288)&iwloc=A&hl=en\"> mufon case (26288) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/26288.html.txt","/var/www/straped/mufon/org/26288.html"],"Date Submitted":"11/02/2010 01:31 UTC","Object Shape":"Star-like, Other, Unknown","Sighting Duration":"Undisclosed"}