{"City":"Memphis","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.154644,+-90.04479(26294)&iwloc=A&hl=en\"> mufon case (26294) map </A>","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around October 29th 2010"],"Region":"Tennessee","Country":"United States","Disposition":"Insufficient Data","Source":"MUFON","Case Number":"26294","files":["/var/www/straped/mufon/html2text/26294.html.txt","/var/www/straped/mufon/org/26294.html"],"Object Shape":"Triangle","Object Features":"Undisclosed","divs":["Sighting DetailsIt was a Friday evening and I was working my usual part time shift as a projectionist at a movie theatre. I had around 5 minutes before I had to start one of the last movies before a long break so I went out back just to get some fresh air. It was dark outside when I went out and I was just looking around at my surroundings (A field, office buildings, a small back road) when I looked at the tree line and saw some odd lights in the distance above the tree line. They were four red lights forming the shape of a triangle (three lights forming the triangle and a fourth in the center of the triangle). The lights did not blink or move, they stayed on the entire time and there was no movement for over one minute. I remember standing and thinking what could this thing be? I thought it could be a radio tower with a plane passing it in the distance. I stood there looking at this object trying to think of every possible solution to what it could be other than a UFO until it started to move. At that point I knew it was something very different. The object slowly turned in the same spot where it was located, until the lights resembeled a vertical straight line. At this point the object looked like a straight line with three red lights. When watching the object turn I did remember that all of the lights stayed on the entire time it turned. There were no lights that shut off or blinked. Once the object was in the vertical stance for a moment, two of the lights slowly disappeared (the top and bottom lights leaving the center light on) until the final light in the middle vanished. I am unsure if the lights turned off or if the object flew away. I did not get any picture or video evidence of this because my phone was on my desk inside. I tried to think of every possible flying object or radio tower that knew of to rule out a UFO, but this was just too odd. I did not think of myself as a believer in these things but I have changed my mind. The entire incident lasted roughly around 3 minutes."],"Weather Factors":"Unknown","Tags":"City","Longitude":"-90.04479","Latitude":"35.154644","Viewing Distance":"Unknown","Date Submitted":"11/02/2010 12:23 UTC","Date of the Event":"10/29/2010 07:35 UTC","Summary":"Watched a Triangle shaped object hover a short distance away, Turn, then vanish slowly into the distance.","Sighting Duration":"00:03:30","Log Number":"US-11022010-0010"}