{"Tags":"City","files":["/var/www/straped/mufon/html2text/26293.html.txt","/var/www/straped/mufon/org/26293.html"],"City":"Ottumwa","Country":"United States","Object Features":"Window(s)","Date Submitted":"11/02/2010 10:30 UTC","Date of the Event":"09/26/2007 10:10 UTC","Weather Factors":"Does Not Apply","Summary":"CIRCLE IN SHAPE WITH A BEAM OF LIGHT COMMING FROM OBJECT TOUCHING TGE GROUND.","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=41.02653,+-92.410263(26293)&iwloc=A&hl=en\"> mufon case (26293) map </A>","trends":["There have been 8 other sightings in Ottumwa","There were no other sightings in Ottumwa on or around September 26th 2007"],"Log Number":"US-11022010-0009","divs":["Sighting DetailsI WAS ON MY COMPUTER AT 10 PM IN LOOKED OUT MY FRONT WINDOW TO REST MY EYES.THE OBJECT WAS IN THE EASTERN SKY. AT FIRST I THOUGHT IT WAS THE MOON.BUT I SAID TO MYSELF,THE MOON DOESN'T HAVE A BEAM OF LIGHT COMMING OUT OF IT AND GOING CLEAR TO THE GROUND.IT WASNT A PLANE NOR A WEATHER BALLOON OR SWAMP GAS.LIKE OUR GOVERNMENT WOULD OF TOLD ME.WHEN THE OBJECT MOVED THE LIGHT STARTED TO BEND IN AN ARCH.MORE LIKE A CURVED TAIL.I DIDNT HAVE TIME TO GRAB MY GOOD CAMERA SO I GRABED MY CELL PHONE AND GOT 4 PICS OF THE OBJECT.THE OBJECT WENT FRM BRIGHT TO DIMN. THEN BACK TO BRIGHT THEN IT JUST WAS GONE.LIKE SOMEONE WOULD TURN OFF A LIGHT SWITCH IN YOUR HOME.IM 58 YEARS OLD AND THISMY 3 RD SIGHTING IN ll those years this is the only one that have pisc to prove it.so i will send the pics to my home pc from my cell phone so ii can post them on this site.this is not the end of this. i have 2 other people saw the same object.but 3 years later.the wifewoke her husband up in the middle of the night so the wife could show her husband,she rembers it well,but her husband cant for some reason remember the sighting at all...more later.."],"Latitude":"41.02653","Case Number":"26293","Object Shape":"Circle","Object Flight Path":"Hovering then path","Longitude":"-92.410263","Source":"MUFON"}