{"Object Flight Path":"Stationary,Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/26295.html.txt","/var/www/straped/mufon/org/26295.html"],"Log Number":"US-11022010-0011","Tags":"City","Case Number":"26295","Region":"Missouri","Summary":"Bright light appeared, not moving, then started shaking/moving and changing shapes","Longitude":"-90.694598","Sighting Duration":"Undisclosed","City":"O'Fallon","Latitude":"38.819248","Weather Factors":"Windy","Date Submitted":"11/02/2010 12:37 UTC","Disposition":"Unknown","Object Shape":"Circle, Diamond, Egg, Flash, Oval, Sphere, Star-like, Other","Country":"United States","divs":["sighting detailswe were in our driveway when my husband noticed a very bright light in the distance. it was kind of low in the sky. we were wondering what it could possibly be. too bright to be a planet\\star or moon. maybe a plane? we stared for about 4 min. and it did not move at all. i was then getting very curious. i went in the house to get my video camera. when i came out i started recording. it then started to move a little and turn? not sure how to describe... the more i zoomed, the more it glared and then i started to notice it moving., so i would zoom out and just try to let the camera focus. it seemed to break into 2 lights then started changing colors. i noticed the colors red and green. the shape appeared to change, but now i'm wondering if maybe it was turning or something? it almost seemed to turn into a glowing ball at one point. it was the craziest thing we have ever seen. it kept getting out of our sight behing a rooftop, and we kept moving to see it. it finally got smaller and took off quickly. i have to say, i was a little concerned it might know i was video taping it. i have never really put much thought into ufo's before this."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.819248,+-90.694598(26295)&iwloc=A&hl=en\"> mufon case (26295) map </A>","Object Features":"Unknown","Source":"MUFON","trends":["There have been 15 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around October 31st 2010","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Date of the Event":"10/31/2010 08:08 UTC"}