{"Object Flight Path":"Unknown","Date Submitted":"11/02/2010 04:08 UTC","Object Shape":"Flash","Tags":"City","Viewing Distance":"20 Feet or Less","Source":"MUFON","Longitude":"-1.541427","Log Number":"GB-11022010-0017","Sighting Duration":"03:00:00","Country":"United Kingdom","Date of the Event":"10/31/2010 02:50 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=53.802629,+-1.541427(26301)&iwloc=A&hl=en\"> mufon case (26301) map </A>","trends":["There have been 9 other sightings in Leeds","There were no other sightings in Leeds on or around October 31st 2010"],"Object Features":"Unknown","Summary":"Triple flash within about 2 hours at intervals. Flashed into a dark kitchen. Thought it was a failing tube but it is still opperating. Witnessed by my wife on one burst.","Disposition":"Unresolved","Case Number":"26301","Latitude":"53.802629","divs":["Sighting DetailsWe were preparing for a Halloween party in Sheffield, UK on the Sunday afternoon, 31st October. My partner, Diana noticed an intense flash of light in the room for a second. I carried on cooking and it happened twice more in the afternoon. I thought it was a power surge or a failing long life bulb. I listened to a radio 4, BBC report on the radio the next day about Iridium satellites as can't and I don't believe in UFO's. It talked about flashes of light but I don't think this matches the description, as the light filled the room. I felt that it could be a power surge but no fuses blew! Our lights blow very easily in our old system. I would like to know if there were any other such experiences at the time. I had previously, during the summer found some melted rock on the lawn that looked like either a meteorite or steel slag which is common here. It caught on the blade of the mower and wasn't there the night before. Sheffield now has no geologist in their museum. I'm planning to take it to Leeds. Jim"],"City":"Leeds","files":["/var/www/straped/mufon/html2text/26301.html.txt","/var/www/straped/mufon/org/26301.html"],"Region":"England"}