{"Object Flight Path":"Undisclosed","Summary":"ufo passed direcly overhead of me whilst i was parked at work","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI arrived early to work tuesday the 2nd nov 2010 at 0600 hrs and had just sat in the vehicle for a min or two, when i noticed how clear the sky was and rolled down the window. I thought i would rest my neck on the ledge of the open window of the door of the truck and enjoy the stars for a few mins, then all of a sudden this huge V shaped object came into sight directly above my line of vision above. The lights i could not count because of the speed it was traveling it was soundless, i counted 12 in the time i had. The two front lights at the front of this craft were moving seperatley from the rest as if putting on a show, ie side to side as though they were crossing. At this point i jumped out of the truck and watched as it continued it's forward path. the color of the lights were like a black light effect, dark red to purple but not bright bright the speed of this craft was about 1000 to 1500 miles per hr i guessed this as we have vancouver airport in the direction this craft was flying towards, and we see regular high and low flying aircraft over this commercial industrial estate daily. At this time however there were no aircraft in the sky. The size of this craft i can only say was huge and we don't have anything that big and fast, i did not notice other stars being blocked out. I have no idea how high this object was but i would estimate it at regular aircraft flying height 25000 30000 ft the direction this craft was flying was south west my head was facing east the address i was parked at 4077 McConnell Drive Burnaby, BC. Canada. truck hood facing south, parked west side pavement......... I did have a camera on board and alway's do because of my job.... But this was so quick i did not even have time to think....... Size i would estimate at football field....."],"Date Submitted":"11/02/2010 09:40 UTC","Disposition":"Unresolved","Object Shape":"Chevron, Triangle","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=49.257969,+-122.964166(26309)&iwloc=A&hl=en\"> mufon case (26309) map </A>","Source":"MUFON","trends":["There have been 6 other sightings in Burnaby","There were no other sightings in Burnaby on or around November 2nd 2010"],"Case Number":"26309","Longitude":"-122.964166","Date of the Event":"11/02/2010 06:15 UTC","files":["/var/www/straped/mufon/html2text/26309.html.txt","/var/www/straped/mufon/org/26309.html"],"City":"Burnaby","Region":"British Columbia","Latitude":"49.257969","Object Features":"Undisclosed","Log Number":"CA-11022010-0025","Weather Factors":"None","Country":"Canada","Viewing Distance":"Unknown"}