{"Summary":"Saw two bright lights hovering, then moving slowly, then dissappeared.","Source":"MUFON","Case Number":"26314","Date of the Event":"10/29/2010 06:49 UTC","Latitude":"27.339655","Log Number":"US-11032010-0001","Region":"Florida","Object Flight Path":"Hovering then path","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around October 29th 2010"],"Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"None","Tags":"City","City":"Sarasota","map":"<A HREF = \"http://maps.google.com/maps?q=27.339655,+-82.525753(26314)&iwloc=A&hl=en\"> mufon case (26314) map </A>","Object Shape":"Star-like","divs":["sighting detailsit was a clear evening, not a cloud in the sky. i was sitting at our table outside talking with my son as he sat on the roof of my jeep liberty (yes,the roof) i was facing west when i spotted the two bright lights. i thought they were bright stars but then they were way too close to be stars. i watched the lights as they seemed to hover, completely still....i could not make out a specific shape of them, they were to bright. the lights seemed to be approx 4-6 miles west of my house, possibly over bird key, lido key or the gulf of mexico. after watching the lights \"hover\" for several seconds i looked at my cell phone to document the time. it was 6:49pm. i then looked around in the sky to see if there were stars out to compare them, but there was none that i could see. i looked back at the lights and asked my son if he saw them as well, and he did. he commented on how bright the lights were. only one of them seemed to be moving due north at this time, but very slowly while the other lagged behind a bit- so they were approx and inch apart if you put your fingers to the sky to measure. then both lights headed north, after that brief pause. watching them, i wondered why i could look at such a bright\\brilliant light and not have it hurt my eyes. the lights continued to move north for a few more seconds and then they were gone...didn't fade away slowly, didn't change directions...just gone. in a blink of an eye....literally. i feel honored that i was able to witness another ufo and wondered if anyone on the beach that night saw them too....."],"Longitude":"-82.525753","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/26314.html.txt","/var/www/straped/mufon/org/26314.html"],"Disposition":"Unknown","Date Submitted":"11/03/2010 12:07 UTC","Viewing Distance":"Over One Mile"}