{"map":"<A HREF = \"http://maps.google.com/maps?q=40.080089,+-74.713279(26311)&iwloc=A&hl=en\"> mufon case (26311) map </A>","Disposition":"Unknown","Country":"United States","Log Number":"US-11022010-0027","files":["/var/www/straped/mufon/html2text/26311.html.txt","/var/www/straped/mufon/org/26311.html"],"Viewing Distance":"Unknown","Longitude":"-74.713279","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"00:00:05","Summary":"Green flash of light travelling north, then disappearing after a few seconds.","Date Submitted":"11/02/2010 10:22 UTC","Latitude":"40.080089","Object Flight Path":"Straight-line path","City":"Mansfield","Region":"New Jersey","Tags":"City","Object Shape":"Flash","trends":["There have been 2 other sightings in Mansfield","There were no other sightings in Mansfield on or around October 31st 2010"],"Source":"MUFON","Date of the Event":"10/31/2010 09:00 UTC","divs":["Sighting DetailsI was driving north on the New Jersey turnpike at approximately 9pm on Sunday night Oct 31. At ths time I was somewhere between exits 5 and 7. My girlfriend was on the passengers side. There was a steady flow of traffic, but the highway was not crowded. Through the windshield I suddenly noticed what I can best describe as a green spot streaking through the sky. It was directly in my field of vision, moving away from my car. Given that I was travelling north on the turnpike, I concluded that the green dot was also travelling in a northerly direction. After just a few seconds, the dot disappeared. There was no explosion or burst of light. It just disappeared. There were numerous airplanes in the sky both before and after this event, and they were easily identified as airplanes. This green object was clearly no airplane. The most striking aspect of this experience was the considerable speed with which this green dot was moving. I was not able to ascertain the approximate height of the dot, but it was obvious that it was travelling very fast. It travelled in a smooth trajectory, with no stops, turns, or twists. I had no idea what this dot could have been, but it wasn't like anything that I'd ever seen before. My initial reaction was one of confusion, again not knowing how to begin to explain why I had just seen. My girlfriend had been nodding off at the time. As soon as I saw the dot I yelled over to her, but unfortunately by the time she perked up the dot had disappeared."],"Case Number":"26311"}