{"Latitude":"43.849188","Summary":"in visible with slight heat streams and a chaser jet behind it","Disposition":"Unknown","Case Number":"26318","Tags":"City","divs":["Sighting DetailsI was sitting in a yard on green lake wiconsin with my family i had binoculers and i was looking out onto the lake i noticed a jet flaying obove with streems of smoke behind like we all see but when i looked closly in front of the jet aprox .25 inche as seen from binoculers, mayby .5 inches as seen with a naked eye I saw a heat signature from where the exsost would be from another craft, and the closer i looked i could somewhat makeout where the plain should be in front of that and it seemed like there was a atmisfiric distubance where the plain should have bin. I supose it was a militery test flight of an invisible plain with a chser plain so u would not notice the heat signature because the second jet was flying in the same path as the invisible one and the leaving the smoke trail. that is my story i showed it to my wife and son they agreed on what i saw when i showed them. ( -----> = x-------) ( >) is the plain i could see (=) is the heat signature (x) is where the siloet of invisible plain was the plains where flying in a stragight line id say 1200 to 2000 mph 50,000 ft at first it looked like the plain i could see was spliting up the air in front of it that is when i noticed something was there."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.849188,+-88.956753(26318)&iwloc=A&hl=en\"> mufon case (26318) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-11032010-0005","trends":["There has been one other sighting in Green Lake","There were no other sightings in Green Lake on or around July 20th 2001"],"Object Shape":"Triangle, Other","Date of the Event":"07/20/2001 12:00 UTC","Longitude":"-88.956753","Sighting Duration":"Undisclosed","Weather Factors":"Light","City":"Green Lake","Date Submitted":"11/03/2010 01:05 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26318.html.txt","/var/www/straped/mufon/org/26318.html"],"Object Features":"Undisclosed","Region":"Wisconsin","Object Flight Path":"Straight-line path","Country":"United States"}