{"Latitude":"43.369151","Disposition":"Unknown","Case Number":"26315","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Tags":"City","Object Shape":"Star-like, Triangle","Source":"MUFON","Region":"Oregon","City":"Coos Bay","map":"<A HREF = \"http://maps.google.com/maps?q=43.369151,+-124.2091(26315)&iwloc=A&hl=en\"> mufon case (26315) map </A>","Longitude":"-124.2091","Country":"United States","Weather Factors":"Does Not Apply","trends":["There have been 10 other sightings in Coos Bay","There were no other sightings in Coos Bay on or around November 2nd 2010"],"Date of the Event":"11/02/2010 07:45 UTC","files":["/var/www/straped/mufon/html2text/26315.html.txt","/var/www/straped/mufon/org/26315.html"],"divs":["Sighting DetailsMy mother and I have been UFO hunting since my mother had seen her first one and quite a few after. Today we found a nice dark spot in town around seven thirty and looked into the horizon where we spotted two orbs. One was a rather bright star that suddenly went out, the other, not two seconds after the first, started up red and moved south to north. It went out, glowed really bright then went out again. My mother and I soon left for home after the mild excitment. This is were the real fun happened! Not five minutes after making it home we look to the sky one last time, my mother grabs me and points to the sky yelling at me to look. There was a black triangle with seven lights (one in the front and three on either side. Very dim I might add) roughly three stories up, not making any sound, cruising directly over us (north to south). It all happened in about five seconds but that was enough to have me jumping up and down screaming about how awsome it all was and my mother awstruck asking if I saw it. We believe our excitment from the other two may have brought on the third one to come so close. Just a theory. It was definatly a triangle though, it blocked out stars behind it and disappeared behind the trees. Today was a day to be had!"],"Log Number":"US-11032010-0002","Sighting Duration":"Undisclosed","Summary":"Black triangle cruised over apartment.","Date Submitted":"11/03/2010 12:09 UTC","Object Features":"None"}