{"Date Submitted":"11/02/2010 11:48 UTC","Object Shape":"Star-like","Country":"United States","Sighting Duration":"00:01:00","Region":"California","Date of the Event":"11/02/2010 07:00 UTC","trends":["There has been one other sighting in Rancho Santa Fe","There were no other sightings in Rancho Santa Fe on or around November 2nd 2010"],"files":["/var/www/straped/mufon/html2text/26313.html.txt","/var/www/straped/mufon/org/26313.html"],"divs":["sighting detailsi had just gone to dinner with my mother and younger sister. i was behind the wheel on the way home, my mom in the passenger seat and my sister in the backseat. we reached our community at 7:00pm and started driving up the hill towards our home. the angle of the hill allows us to see much of the sky. the sky is very clear tonight 11\\2\\10. my mom said \"look that must be a planet, i wonder what planet it is?\" (the object was very bright like that of a planet no blinking lights were visible it was just a very bright white light identical to a very bright star). it was out the front of the windshield nearly overhead west of the car. i looked up at it and said \"i don't know...\" i examined it for a moment and noticed that while a star near it was stationary it was moving closer to the star but i wasn't sure if it was moving since we were also moving. next, it moved quickly across the sky towards the north, north-east on a straight path. i speculated that it was \"probably a satellite\" and at the top of the hill i stopped the car completely to watch it. we watched as it sped up and into the distance. my younger sister had her window open and heard no sound coming from the object. it then swerved severely left and then severely right and then left again and right before i saw it vanish completely as if the light was turned off (not as if it had faded into the distance). we have no explanation for it, as our initial thought was that it was a satellite, but once it swerved that had to be ruled out and the fact that it was nearly overhead and no sound was coming from it meant that it could not be a helicopter or plane. we live in a populated area so i'm hoping others report seeing this so we can figure out what it is, whether it be military aircraft or i dunno."],"Longitude":"-117.202813","Summary":"Star-like ufo follows straight pattern then swerves violently several times and vanishes","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.020321,+-117.202813(26313)&iwloc=A&hl=en\"> mufon case (26313) map </A>","Tags":"City","City":"Rancho Santa Fe","Log Number":"US-11022010-0029","Latitude":"33.020321","Object Flight Path":"Path with directional change","Case Number":"26313","Viewing Distance":"Unknown","Object Features":"None","Weather Factors":"None","Disposition":"IFO"}