{"Latitude":"34.027734","Case Number":"26327","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Log Number":"US-11032010-0013","divs":["sighting detailswe had gotten done with trick-or-treating around 8:30 pm est in kennesaw, ga, and had left our neighbor's house (they were still standing outside talking). i went inside and started to close some curtains and noticed a red fireball\\star-like ball of light that was crossing the sky (from southwest to northeast) over the neighborhood (i'm guessing about a quarter-mile to a half-mile up). it was bright, and looked rather weird, so i went outside to see it better (thinking at that time it was likely just a plane). the neighbors were all looking up at it too (we exchanged a few \"what is that?\" type phrases). it only took about 2-3 minutes to cross overhead. it moved about as fast as i've seen helicopters move, but the fact it was just one bright light made it look odd. i didn't have time to grab a camera. i actually wasn't going to report it at all due to the lack of a photo and the fact it's path\\speed resembled a helicopter or plane; however, i saw another report in ga of a very similarly-described red light in the sky that same night (titled \"star like redish light tranformed to a flarelike fire ball\" submitted on 11-1-2010), and perhaps these \"cases\" are linked. i can provide a map of it's approximate path, if needed."],"files":["/var/www/straped/mufon/html2text/26327.html.txt","/var/www/straped/mufon/org/26327.html"],"Object Flight Path":"Straight-line path","Date of the Event":"10/31/2010 08:30 UTC","Weather Factors":"Unknown","Longitude":"-84.6058","Source":"MUFON","City":"Kennesaw","Disposition":"Insufficient Data","Object Shape":"Fireball, Star-like","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.027734,+-84.6058(26327)&iwloc=A&hl=en\"> mufon case (26327) map </A>","trends":["There have been 7 other sightings in Kennesaw","There were no other sightings in Kennesaw on or around October 31st 2010"],"Date Submitted":"11/03/2010 10:44 UTC","Tags":"City","Region":"Georgia","Summary":"Bright red fireball/light passes over residential area","Sighting Duration":"Undisclosed"}