{"map":"<A HREF = \"http://maps.google.com/maps?q=32.224186,+-98.200483(26324)&iwloc=A&hl=en\"> mufon case (26324) map </A>","Sighting Duration":"Undisclosed","City":"Stephenville","Case Number":"26324","Source":"MUFON","Region":"Texas","Tags":"City","Summary":"Sharped edged, transparent, boomerang shaped object","Object Features":"None","Viewing Distance":"Unknown","Country":"United States","Date of the Event":"10/28/2010 12:00 UTC","divs":["Sighting DetailsVery early morning, stars and moon still out. Couldn't sleep, went out to hot tub. Looking at sky...noticed fast movement of transparent, sharped edged boomerang object passing over house, into cloud (one of about three small wispy clouds in the sky at the time) and didn't see it come out. It moved from the WNW to the ESE, wind from due N, but clouds not moving at all. Watched for it to come out of the cloud for several minutes. My feelings. I thought it was interesting. Different. I live in Stephenville and have seen many different things, but nothing remotely like this. This was on or about Oct 28. Only reporting because I saw report of similar object on approx the same date as I saw this. Missing time? Was out in very early morning several times that week. One morning I was very surprised at what time it was when I went back into the house. It was much later than I thought it should be, but I may have just lost track of the time or looked at the clock wrong when I went out of the house. Am not sure it was even that morning. I have never reported sightings before and have seen many interesting things. Including black triangle shaped object hovering low near my house, showed to husband. He looked at it said that's interesing and went back to bed. We see so many strange things. I go to the hot tub a lot in the middle of the night (esp. between 2:00 and 5:00) when I wake up and can't go back to sleep. The few seconds I saw it sounds like a very short time, but it was clear, impressive and I had been looking at the sky already."],"Latitude":"32.224186","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around October 28th 2010"],"files":["/var/www/straped/mufon/html2text/26324.html.txt","/var/www/straped/mufon/org/26324.html"],"Date Submitted":"11/03/2010 09:31 UTC","Longitude":"-98.200483","Disposition":"Unknown","Log Number":"US-11032010-0010","Object Flight Path":"Straight-line path","Object Shape":"Boomerang","Weather Factors":"None"}