{"Source":"MUFON","Tags":"City","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around November 2nd 2010"],"Region":"California","Longitude":"-117.996486","Summary":"4 Very faint and Dull Sphere, 3 in the shape of triangle- the 4 outside it- 2 fingers under Jupiter at arms length.","Weather Factors":"Unknown","Log Number":"US-11032010-0009","Disposition":"IFO","Latitude":"33.662767","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Date of the Event":"11/02/2010 11:59 UTC","City":"Huntington Beach","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.662767,+-117.996486(26323)&iwloc=A&hl=en\"> mufon case (26323) map </A>","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/26323.html.txt","/var/www/straped/mufon/org/26323.html"],"divs":["Sighting Details Well, I couldn't get 'Coast-to-Coast' on 640 AM radio, because of the election results. Dam, Republicans lost. And gold is now in limbo. But then, I realized I could get 'Coast-to-Coast' on XM 165. So at 10 pm, I went to get a coffee and headed on P.C.H. to Huntington Beach, Ca. to listen to 'Coast to Coast' for a couple of hours and enjoy the nice cool sea-breeze and stargaze for about 20 or 30 min. At the news brake, at the top of the hour around 11:59 pm, I decided to get out of my truck, and check out the sky (Jupiter) with my binoculars. While looking at Jupiter, facing West, I noticed four very faint and dull stars- about the width of two fingers at arms length underneath Jupiter. Though, I'm not sure that's a valid measurement- but it works for me. While thinking about reporting this sighting, I noticed on the MUFON website, that there have been other sighting, San Diego and northward. At Absolute Magnitude- Sun being -30, I'd say these objects- unseen to the naked eye (with eye sight seeing around plus 5 or 7), would have been close to around a +10 to +15 magnitude... Apparent or Absolute- not sure. And since, I can't remember what the Full Moon is at Absolute Magnitude. I'd have to just say; that they just didn't give off much 'light'. The only way to see them was with binoculars. they (the four stars) just looked like- in the shape of- an engine of a rocket looking up from the bottom- that was orbiting earth. Each one, looked like- almost large enough in size to eclipse Jupiter. After about 20 minutes of looking them, I realized, I could go to Sunset Beach about 6 to 7 miles away and view them. The locations, and angles being different, but still had the objects were apparently under Jupiter. At Huntington Beach, Jupiter seemed to be appearing over three oil rigs very wide apart. At Sunset Beach, Jupiter wasn't even near the oil rigs. And appeared over three other oil rigs further out. Suggesting the objects under Jupiter were outside Earth's atmosphere. And since didn't have the equipment like a protractor to find the angles with me. I decided to stop at that point and get the supplies later to Huntington Beach and Sunset Beach to do a triangulation and parallax. Sounds fun. Though, I did check the 'Stellarium' program and came up with a possible explanation for the objects- Stars: HIP- 9639, HIP- 114855, HIP- 115115. These stars resemble the shape and were near (and under) Jupiter. End of sighting report... I don't think I was abducted, and the objects were still there when I left. I was thinking about a lot of this stuff below... But since I don't know exactly what they were, I'm reporting the sighting. I guess I'll know for sure on November 12th when 'Skyline' comes out. I don't normally report sightings cause I don't usually see objects that I would call 'unknown' or UFOs. But using the 'FOIA' in the early 1980's, the FBI sent me a UFO document in 1984-5, claiming that the Air Force had 3 dead aliens in silver metallic uniforms- referring to the Roswell incident in 1947. I think the Air Force wanted the FBI to believe they had dead aliens to create an allusion. To cover up the captured of German made Craft, I've seen pictures of on the internet. One consistant thing, I've noticed, UFO's always land in the most odd places- mountains, swamps, desert areas, farms of many acres, etc Are they 'drug' running? Cops never seem to catch them.. And why do they seem to be using Astrology? Like the Kenneth Arnold chart, which seemed predict the 'Challenger' disaster- 'Bouncing Light off the moon from the sun hits 'Uranus' transit- 18 degrees Sagittarius.' 'Majestic 12', seems to be a horoscope of 12 ships coming into port in Messina, Italy ,October 1st, 1347, maybe at 11:02 am. 600 years before the group, Majestic 12, is mentioned. What? aliens gave us the 'Bubonic plague'? like Cortez? and the Spanish flu? And the 12 ships coming into port would look kind of 'Majestic' to the people living there, up until they talked to the sailors and got sick themselves. The horoscope has Good Friday- Earth day, 2011 on it. So Red alert on April 22nd, 2011. The chart also has predicted events of this past month, I just didn't know what they were or where, or whether to believe the chart was being used.. Though, I have an idea- how that work. One way using the Part of Fortune, and using combinations of charts to triangulate the general day, time and location. A lot of effort. On 9-11 the USA chart was very active, as well as the chart of Japan attacking China. July 07th, 1937. 7x7 is 49. July 1952, plus 49 years is 2001. Thus 3 UFO's over Andrews Air Force Base. And a Japanese-American designed the World Trade Center. But on the Oct 1st, 1347 in Messina, Italy chart. Things like the Spanish flu... Pearl Harbor... Invasion of Poland.. and a lot of other stuff are on it. Plus, Aliens are real, they seem to be travel 30 plus trillion miles to earth, and while in earth's atmosphere, the F-16 size objects, don't seem to travel at or near supersonic speed. Accept maybe, July 1952, when one of three UFO's traveling at 100 mph accelerates to Mach 9 traveling a distance of 11.1 miles. If true, A lot of windows would have been shattered. The speed was said to be 7300 mph subtract 100 mph is 7200. The World Trade Center- Tower one is complete in 19'72'. Tower two, south, is completed in 19'73' 19 terrorist' 72-73. Or maybe flight 19 in 1945, which never landed. Terrorist didn't want to learn how to land. Mach 9 @ 11.1 miles ? Andrews Air Force Base to Riverdale, Md. google suggested it was 11.1 miles to the airport, when I first noticed. Of course, google also has other milage data too. Sorry, about all of this nonsense, there's to much to say and show to continue.. I'd have to write an astrology book.. The minds of these people, (terrorist), pattern wise, are almost as wacky as my mind. By the way, I don't the Military, White House, or the Japanese planned 9-11. I think the Nazi's did. Pissed off about the 'Spanish Flu', the U.S. gave them. 50 million civilians in Europe died. Though, I do think someone hired Al-qaeda- as crazy as it sounds, offering gold as payment. See wikipedia- for world Trade Center data. See YouTube- Rod Serling and Jacques Vallee's, UFO lecture on youtube. FBI document see New Mexico Lobo, August 1985 or UFO newsclipping service, November 1985. 'The Black Death', by John Aberth. Do correlation between the US Unemployment rate, Jan 1, 1948 to present time and the accumulative price of Gold each year since 1948. Both Variables rise together! And since 9-11, it looks like a 'Madoff' graph. See Kitco.com for gold info. And that's what I was thinking about.."],"Date Submitted":"11/03/2010 08:51 UTC","Object Features":"None","Case Number":"26323"}