{"Latitude":"34.020289","trends":["There have been no other sightings in Walnut","This sighting has never been favorited."],"Region":"California","Case Number":"26321","Country":"United States","Summary":"Orange glow, glowed brighter and hovered and then broke up into three pieces, 2 went straight down, one piece flew diagonally","Tags":"City","Date Submitted":"11/03/2010 02:58 UTC","Date of the Event":"11/02/2010 11:20 UTC","Log Number":"US-11032010-0008","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Diamond, Fireball","Disposition":"IFO","Object Features":"Unknown","divs":["Sighting DetailsAround 10:20-10:30pm. Nov. 2, 2010. Pacific time. Walnut, CA. Was passenger in car. We saw it low in the sky. We pulled over in parking lot to look at it. Saw orange glowing object in the sky. This was definitely not a plane, not a helicopter, not a star. Looked like giant fireball. Sort of bobbed in the sky. Was low, then went higher in the sky and glowed brighter and brighter. Then suddenly one piece fell off, dripped off almost, then another piece fell. These two pieces went straight downward. Then a third piece drifted diagonally. And the main thing was gone, totally. As if it were comprised of those 3 pieces. When we saw that, whoa. What kind of craft drips off stuff, seemed like embers falling, except for that 3rd piece which did not fall straight down, but flew diagonally. No noise. I thought the thing looked sort of like a soft roundish diamond shape, but it was hard to tell because it was glowing so brightly, whitish in the middle and orange at the edges."],"City":"Walnut","map":"<A HREF = \"http://maps.google.com/maps?q=34.020289,+-117.865339(26321)&iwloc=A&hl=en\"> mufon case (26321) map </A>","Object Flight Path":"Path then hovering","Viewing Distance":"21-100 Feet, Over 1 Mile","files":["/var/www/straped/mufon/html2text/26321.html.txt","/var/www/straped/mufon/more/26321_submitter_file1__orangethinginsky110210.jpg","/var/www/straped/mufon/more/26321_submitter_file2__orangethinginskycropped110210.jpg","/var/www/straped/mufon/org/26321.html"],"Longitude":"-117.865339"}