{"Country":"United States","Object Features":"Undisclosed","Sighting Duration":"00:01:30","Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around October 29th 2010"],"Object Shape":"Unknown","Case Number":"26329","divs":["Sighting DetailsAround the 8 o'clock hour on Friday night, October 29th, 2010, myself and a friend observed a fast moving, solid light formation heading NE from the Goose Hollow area of Portland, Oregon. We were on the upper deck of a downtown building cooking on the grill. I've been sky watching for some time now in the hopes of spotting a flying triangle UFO. While observing the skies above, a brighter than normal light caught my attention clearing the hills of Goose Hollow moving north easterly. My guess is that it was very high up, probably the same height (25,000 to 35,000 feet) as a commercial airliner when it is at cruising altitude. However this object had no identifying flashing FAA lights on it. It was moving very fast for an object that high to be a commercial jet as I've observed commercial jets before and they move at a much slower pace. I could not make out if there were multiple lights on it due to the distance it was at. We both observed it on its trajectory heading towards the north east for a little over a minute. We both chatted about how this could be a UFO, possibly a flying triangle due to the solid, non-flashing lights on it. As I stated though, we could not identify if the lights were in triangle formation due to the height and brightness of them. After observing for the time we did the object appeared to bank to the left. The lights turned to an orange then red and then they went out. Almost as if the lights were powered down and the craft went into a dark mode. It was amazing. No commercial or private aircraft for that matter would do that. Primarily because it would cause many problems for the air traffic that departs and arrives at PDX International. The object did not reappear, as we looked in all directions for about 2 minutes after that. We weren't startled by it, not spooked, just in awe that we may had just observed a UFO. I know there are military bases around the Portland area, so it could have been a test craft or even a triangle UFO. Anyway, it was pretty cool to see that. It definitely was not an airliner. The FAA lights are a dead giveaway for any registered, commercial aircraft. This did not have anything like that. No flashing multicolored lights. Just solid. Anyway, thought I'd share this with you."],"Summary":"Fast moving, solid light, vanished","Disposition":"IFO","Date Submitted":"11/03/2010 01:18 UTC","City":"Portland","Latitude":"45.527612","Longitude":"-122.668197","Date of the Event":"10/29/2010 08:00 UTC","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.527612,+-122.668197(26329)&iwloc=A&hl=en\"> mufon case (26329) map </A>","Source":"MUFON","Tags":"City","Log Number":"US-11032010-0015","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26329.html.txt","/var/www/straped/mufon/org/26329.html"]}