{"Longitude":"-76.90664","Tags":"City","Region":"Maryland","Case Number":"26325","Object Flight Path":"Stationary","City":"Camp Springs","Object Features":"None","Date of the Event":"10/30/2010 02:15 UTC","divs":["Sighting DetailsMy niece, nephew and I were in the Post Exchange parking lot of Andrews AFB returning to the car at approximately 2:15PM. I know this because my niece had a hair appt at 2:30PM and I remember thinking we have 15 minutes to get home. My nephew pointed out that the sky had chemtrails then he asked, \"Uncle Mike, what is that?\" I looked up and realized how bright the sun was then noticed another bright but smaller (than the sun) object off to my right. It was bright, however, not so bright you couldn't look at it. At first it appeared to be just a point of light with no apparent source, but then I immediately thought, the sun light is reflecting off something but I can't see what it is. The object was not moving, the reflection was steady. I remembered my cell phone camera and quickly pulled it out and took (2) pictures of the phenomenon. I thought to myself \"WTF is that?\" We left after about 2 min and I took the kids home for my nieces hair appt. When I got home I downloaded the pictures and noticed that there was a substancial time difference between when I actually took the picture and the time listed in properties which was more like the download time."],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=38.804003,+-76.90664(26325)&iwloc=A&hl=en\"> mufon case (26325) map </A>","Date Submitted":"11/03/2010 09:31 UTC","Log Number":"US-11032010-0011","Summary":"You could see the sun reflecting off an object that was cloaked or camouflaged.","Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/26325.html.txt","/var/www/straped/mufon/more/26325_submitter_file1__2010-10-30_14-21-30_887WTF.jpg","/var/www/straped/mufon/org/26325.html"],"Latitude":"38.804003","Object Shape":"Other","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Camp Springs","This sighting has never been favorited."]}