{"Date Submitted":"11/03/2010 06:33 UTC","Object Features":"Undisclosed","Country":"United States","divs":["Sighting Detailssince i was twelve years old, i've seen objects on the sky, but that day!. i been watching these spheres for a wile already, i mean for years, but its hard to talk about it with your own family, and what to say about your friends, they think you're crazy, well i have two grandkids, and since i'm always playing with them, i started showing them those spheres i was looking at once in a wile on the sky, and i was telling them they were balloons, you know they're kids, so i didn't want'em to go around and telling other kids they're watching UFOs, and after a while they were the ones telling me that there was a balloon on the sky, and that wasn't moving, so we looked for it and yes there it was, it was like a white balloon just sitting there in the sky without any movement at all and then disappeared, and these is been going on for a while, and we see'em very often. but on july 24 we got to see up to 24 of them in a period of time of 3 to 4 hrs, it was on july 24 2010 from 4 pm till 7 pm. and last Saturday october 30th around 1 pm, we saw another one, well i said we, because this time i got to show it to my son my wife my daughter in law and the kids, but this one was different to the other ones this one was shining and was like transforming, sometimes it was a sphere with something that looks like a tail hanging from it, and sometimes like a sphere, but there were times that it looked like a disk and was shining, and sometimes disappearing from our view, and this weekend on sunday afternoon we realized they also fly kind of low, almost ground touching, well not that low but we can say maybe a couple hundred feet above ground level. i tried to take video, but it's very hard to focus those small spheres on the sky, but i manage to take video from two of them, but maybe only for 2 or 3 seconds, also there's a web site called, earthcam, with cameras streaming live images from different parts of the world, i normally use that page to set up a live image on my computer as a wallpaper, and the camera i normally use in that page is in chile, south america, i type in the word patagonia and it starts streaming live video, and you'll be amazed by the images you get to see there. \"UFO\" images (you'll see'em when you less expected) and it gives you the option to save the image like a picture, i have taken a couple of pictures where you get to see what i'm talking about, give it the try and find out for your self, this is not every day, and its only when the camera is pointing to the mountains, normally from 9:00 am til noon. los angeles local time, now if you want to see those spheres i'm talking about, you can do it. it takes time but specially you have to be patient.and here in california i normally see'em from 4 pm to 7 pm its when i get to my son's house after work and i start playing with the kids at the front yard,and also at nigh they can be seen at any time, normally they're red color at night.you'll recognize'em by the way they move or fly, very different to any airplane. on day time they're normally white color, but once in a while we get to see'em on blue or red color,and some times you see'em changing color from white to red or yellow. again it takes time and patient. also i'm attaching 3 pictures, two of them are from the same object, but if you see on one of the pictures the object is closer to the edge than the other one, because it was moving up and down, and like i said the web site gives you the option to take pictures in real time while streaming, now on the other picture you'll see two objects in the center of the image, disk shaped and also two more in the right hand side at the bottom of the same image. well. if you really want to see it for your self keep looking up, or go to the web site i mentioned before. false, truth, is up to you to decide."],"Region":"California","Case Number":"26337","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 24th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26337.html.txt","/var/www/straped/mufon/more/26337_submitter_file1__PatagonianPeaks_20101026142842_10_26_2010.jpg","/var/www/straped/mufon/more/26337_submitter_file2__PatagonianPeaks_20101028163553.jpg","/var/www/straped/mufon/more/26337_submitter_file3__PatagonianPeaks_2010102612592110_26_10_945.jpg","/var/www/straped/mufon/org/26337.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.197877,+-118.446487(26337)&iwloc=A&hl=en\"> mufon case (26337) map </A>","Sighting Duration":"Undisclosed","City":"Los Angeles","Log Number":"US-11032010-0023","Object Shape":"Disc, Egg, Sphere","Source":"MUFON","Date of the Event":"07/24/2010 12:00 UTC","Longitude":"-118.446487","Latitude":"34.197877","Viewing Distance":"Unknown","Summary":"spheres moving around in different directions","Disposition":"Unknown","Weather Factors":"Unknown","Tags":"City"}