{"trends":["There have been 7 other sightings in Charter Township of Clinton","There were no other sightings in Charter Township of Clinton on or around November 3rd 2010"],"Case Number":"26332","divs":["sighting detailstime: a few minutes after 5:00am (est) atmospheric conditions: clear and unlimited visibility. description: red\\orange object sighted in sky through my living room window. at first i thought it to be the planet mars because it was so different from the stars in the sky, but within a few seconds of seeing the object, i noticed that it was moving, slowly, towards the south. the object, based on approximate altitude, size, and direction, was very near to selfridge air national guard base (and perhaps over the base). upon determing that i was not seeing a known type of aircraft, i watched the object moving slowly to the south, and then southwest. airspeed was very slow, and was similiar to what i am accustomed to seeing the local ch-47's fly at. there was absolutely no sound from the object. the object slowly moved out of sight as its distance increased. there were no colored lights (the red & green anticollision lights), and there was no rotating beacon, nor was there any lights at all, other than that of the object which was a red\\orange glow. the \"glow\" was constant, steady, and not pulsating. this was the 3rd ufo that i have witnessed in the vacinity of selfridge in only a few years. interestingly, the time previous to this sighting, this was the same color object, location of sighting, and this object also followed the same route out of the airspace. but the previous sighting, the object moved at *incredible* speed not possible by an aircraft."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.593358,+-82.914061(26332)&iwloc=A&hl=en\"> mufon case (26332) map </A>","Log Number":"US-11032010-0018","files":["/var/www/straped/mufon/html2text/26332.html.txt","/var/www/straped/mufon/org/26332.html"],"Summary":"Red/Orange Glowing Object at Selfridge ANGB","Country":"United States","Object Flight Path":"Path with directional change","Disposition":"Unknown","Sighting Duration":"Undisclosed","Region":"Michigan","Weather Factors":"Unknown","Latitude":"42.593358","Date Submitted":"11/03/2010 02:56 UTC","Object Features":"None","Object Shape":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","City":"Charter Township of Clinton","Date of the Event":"11/03/2010 12:00 UTC","Tags":"City","Longitude":"-82.914061"}