{"Object Shape":"Triangle","Object Features":"Unknown","City":"Southaven","Source":"MUFON","Country":"United States","Region":"Mississippi","Summary":"Low hovering silent objects over north Mississippi.","Date Submitted":"11/03/2010 06:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.988982,+-90.012591(26338)&iwloc=A&hl=en\"> mufon case (26338) map </A>","Tags":"City","Latitude":"34.988982","Object Flight Path":"Stationary","Disposition":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsI was driving south from Memphis, TN on I55 with a few friends when I noticed a low flying object. At first I thought it was a plane, but then as we got closer, I realized it wasn't moving. It had been raining all day and night, so seeing a \"plane\" was odd. I asked someone else in the car what it was and they also thought it was a plane until we confirmed that it wasn't moving at all. We got closer and eventually drove directly under it. We noticed that we could not hear anything coming from the \"plane\". After we passed under it, we noticed another object exactly like the first. It was triangular in shape and had extremely bright lights in the front and smaller lights on the other two corners. As we continued to drive south, we noticed several more crafts flying right above the tree line. They were coming from all directions but all turned and started flying north, towards Memphis. We finally realized that what we were witnessing were not planes because of how low they were flying and the lack of sound coming from them. This startled us all and we were honestly a bit frightened so we didn't pull off the highway to keep sight of them. As we continued south, we started losing sight of the objects and eventually lost them completely."],"Date of the Event":"Unknown","files":["/var/www/straped/mufon/html2text/26338.html.txt","/var/www/straped/mufon/org/26338.html"],"Case Number":"26338","Longitude":"-90.012591","Weather Factors":"Unknown","trends":["There have been no other sightings in Southaven","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Log Number":"US-11032010-0024"}