{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.048122,+-76.147424(2633)&iwloc=A&hl=en\"> mufon case (2633) map </A>","divs":["Sighting DetailsI was returning to Boston from a conference in Toronto with some colleauges ofmine, and we were just about to pick up the thru-way near Syracuse, New York. We were still heading south at this point as I noticed what looked like twoheadlights shining through the cloudy sky above. I thought they were twoindividual planes at first, but quickly disregarded that idea. I then thoughtthat they might actually be the reflection of a cars headlights in the window,so I moved my head around in an effort to make them disappear, to no avail. Theobject seemd to be moving due west, directly over the van. As it passed aboveus, I could tell that there was a definite structure behind the two headlights. I jumped over to the passenger side window to try to catch it again. As itre-emerged from behind the vans roof, I saw a much dimmer white light on theobjects underside which, combined with the brown sky, provided enough contrastto see the structure was that of a black, perfect isosceles triangle. Therewere no other lights on the object, so that once it had passed overhead, it wasno longer visible.I failed to mention to anyone what I was seeing until I jumped to the passengerside and they asked what was wrong. I calmly stated that I was watching somestrange, triangular aircraft. I was indeed remarkably calm until after thefact, when I realized that I had just had the classic flying triangle sighting."],"Sighting Duration":"00:00:59","Disposition":"Unknown","Object Flight Path":"Straight-line path","Latitude":"43.048122","Log Number":"","Viewing Distance":"Unknown","Object Shape":"Triangle","Longitude":"-76.147424","Object Features":"Undisclosed","Summary":"Flying triangle in upstate New York","Source":"MUFON","Case Number":"2633","Country":"United States","Date of the Event":"10/22/2003 10:45 UTC","Weather Factors":"Unknown","Date Submitted":"10/22/2003 10:45 UTC","files":["/var/www/straped/mufon/html2text/2633.html.txt","/var/www/straped/mufon/org/2633.html"],"City":"Syracuse","trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around October 22nd 2003"],"Region":"New York"}