{"Source":"MUFON","Object Shape":"Triangle, Other","Date of the Event":"12/28/1985 07:15 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=41.153139,+-76.150208(26340)&iwloc=A&hl=en\"> mufon case (26340) map </A>","files":["/var/www/straped/mufon/html2text/26340.html.txt","/var/www/straped/mufon/org/26340.html"],"Log Number":"US-11032010-0026","Latitude":"41.153139","City":"Shickshinny","Tags":"City","Region":"Pennsylvania","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-76.150208","Viewing Distance":"21-100 Feet","Date Submitted":"11/03/2010 09:06 UTC","Summary":"triangle-three white lights-like a reflection","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"26340","Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsThe date this event occurred is not accurate. It either occurred sometime over Christmas break 1985 or 1986. It was very cold and clear with a stiff breeze and my two younger sisters and I decided to ice skate on a small farm pond. When we left the house Peter Jennings was signing off so it was almost 7 p.m. When we got to the ice I heard some snowmobiles running down a trail about 400 yards downhill from our location. I immediately noticed that approximately 10 feet above them there were twinkling lights so I thought what kind of banner antenna thing are they carrying? My youngest sister needed help with her skates so I began to help her but kept glancing toward the snowmobiles. They began to move through a hollow of trees and I couldn't see them and realized that the light was moving away from them, but I still thought it was being caused by the snowmobiles headlights? I asked my other sister who was skating around the pond what she thought was causing the lights. She spots a jet going overhead and informs me it's just a plane, they always look like that. We start arguing, but I don't see the lights any more...So I'm just thinking some weird atmospheric event when all of a sudden I see it directly overhead. I'm screaming there it is, run. The sister I was fighting with is all like you're just trying to scare me and skates off to the far end of the pond. I'm running off the pond into knee deep snow. I glance back my youngest sister is standing looking up at this triangle that is lit on three corners with white lights. It looked like you could see the stars through it and it's getting lower. The sister who I was fighting with is now trying to listen to me and get off the ice. I realize there is no way my youngest sister can run through that snow with skates on. I run back onto the ice and drag them into the snow at the side of the ice. I toss a few handfuls of grass and snow on top of us and we are all laying on the ice staring up at this thing, that looks like it is going to land right on top of us. I start praying all the prayers I ever learned mostly like please help us God and Mary, mother of God, the choirs of angels all the Saints and people who have died before us. It hovers over us and than all of a sudden it flashes and the only thing I can describe it like was as if a big Poloroid flash cube went off, the kind, where you can't see too well for awhile. The triangle gradually lifted off. It flew off over our house hesitated over the house and as it got further away it began to look like a twinkling strange reflection again. When it was over the house I was able to see that it was a very metal looking craft of some sort. It was about two hay wagons wide. There was no markings or anything to give it away as man made. We all started to laugh and say we were going to be in some alien's photo album of My trip to earth. We walked back up to the house with our skates on. AT this point my youngest sister asked what was that? I realized we weren't acting quite right so I wrote everything down and think its the only reason I remember it well. Also Jeopardy was on when we got back to the house so I don't think we had lost time."],"trends":["There has been one other sighting in Shickshinny","There were no other sightings in Shickshinny on or around December 28th 1985"]}