{"Object Shape":"Triangle","Weather Factors":"None","Viewing Distance":"Unknown","Latitude":"33.946706","Date Submitted":"11/04/2010 02:19 UTC","Sighting Duration":"Undisclosed","Date of the Event":"10/25/2009 08:45 UTC","Case Number":"26346","Longitude":"-117.225892","Summary":"2 Triangle shaped UFO sighted for short time then they distorted the night sky and disappear","Object Features":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","Tags":"City","Log Number":"US-11042010-0001","trends":["There have been 13 other sightings in Moreno Valley","There were no other sightings in Moreno Valley on or around October 25th 2009"],"Source":"MUFON","City":"Moreno Valley","Region":"California","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.946706,+-117.225892(26346)&iwloc=A&hl=en\"> mufon case (26346) map </A>","divs":["Sighting DetailsOn the night of October 25th, 2009 at about 8:45 pm I was outside on my back patio which faces north and I was looking at the stars, which I often do because I enjoy astronomy, and to have a smoke when I noticed what I thought was a big bird, for a split second, in the sky traveling from south to north. I stood up and noticed that there were two of them. Then I realized that each object had six amber lights, 3 on each side and the objects were triangular in shape and had rounded tips. They were very slow moving and made absolutely no sound at all. It was at this point that I realize what I was looking at. I was in so much shock I couldn't speak and tell my husband. One of the objects was positioned slightly in front of the other. Then I notice that these objects where completely blocking my view of the stars to the north. The sky and stars in that area were distorted kind of like they were being pulled towards the center of the UFO and then they suddenly disappeared. Since then I guess you would say I have been in denial. I reported that same night to the national UFO reporting website and just buried that event then when my report posted on the website I discovered that another person here in Hemet also seen a UFO about 15 minutes prior to me and I literally freaked out. It became real to me. I just can't believe that this is really real. I had ALWAYS been a skeptic. I was curious but now I am a believer!"],"files":["/var/www/straped/mufon/html2text/26346.html.txt","/var/www/straped/mufon/org/26346.html"],"Country":"United States"}