{"trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around October 29th 2010"],"Country":"United States","divs":["sighting detailson october 29 2010,at approximately 6:45pm my husband and i were driving down 70 hwy east(independence).we noticed 5 bright white lights in a row flying above us on the north side of the car.we noticed them because they were very bright and silvery not like anything we have ever seen.they were flying fairly low for aircraft. they flew in perfect unison from northeast to south east until they crossed over in front of us where 291 hwy crosses 70 hwy. when they crossed 70 all but one fell back together in a cluster with the fifth one out in front away from the rest and continued to move east. as we turned south off of 70 hwy onto little blue parkway they stopped just a few miles east of us just south of 70 over northwest blue springs.they again lined up in a row shoulder to shoulder. then after a moment of staying motionless the moved into a circle formation and rotated around in a tight circle (at an angle)and moved out from each other just a little. as they did this one of them shot down to the ground, it looked kind of like shooting star shot down to the ground and back up. they seemed to get a little larger\\ brighter when they were circling around.at this point we got really excited we knew that it was a ufo.then we turned south on little blue parkway and we lost sight of them."],"Date of the Event":"10/29/2010 06:45 UTC","Log Number":"US-11032010-0028","Sighting Duration":"Undisclosed","Region":"Missouri","City":"Independence","Weather Factors":"None","Date Submitted":"11/03/2010 09:38 UTC","Case Number":"26342","Tags":"City","Summary":"multiple lights/craft over independence blue springs area.","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26342.html.txt","/var/www/straped/mufon/org/26342.html"],"Longitude":"-94.376322","map":"<A HREF = \"http://maps.google.com/maps?q=39.051542,+-94.376322(26342)&iwloc=A&hl=en\"> mufon case (26342) map </A>","Object Flight Path":"Path then hovering","Object Shape":"Sphere, Other","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.051542","Object Features":"Unknown"}