{"Object Flight Path":"Path with directional change","Tags":"City","files":["/var/www/straped/mufon/html2text/26348.html.txt","/var/www/straped/mufon/org/26348.html"],"Object Features":"Unknown","Source":"MUFON","Date Submitted":"11/04/2010 04:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.202669,+-115.108161(26348)&iwloc=A&hl=en\"> mufon case (26348) map </A>","City":"North Las Vegas","Viewing Distance":"Over One Mile","divs":["sighting detailswoke up about 12:30pm got up to take the dogs out in the back yard. there is a school right behind the house and was watching over the fence at the kids playing when i heard some jets from nellis i went to look up and straight up in the 12 o'clock position was a very bright pinpoint star like object very high up. at first it was stationary for the first couple of minutes than it started to drift slowly north to the sheep range\\ nellis range. first thought was it was a balloon of some sort with a sliver finish but just seemed too bright. was actually quite brilliant. solid blue color stood out very well against the blue daytime sky. after about ten minutes i ran inside to tell the mrs and from the bedroom window on the second floor i pointed it out to her. by now it was further to the north and more at a 10 o'clock position in the sky. i noticed the winds were light out of the sw object still moving straight north. object started to oscillate going from very brilliant to almost invisible some times to other times being a sharp dark pinpoint of a dot. started to become very hard to see and than started moving straight east while still oscillating. about this time i heard the jets again and slow and low over the mountains came a couple of f22s much much lower than the object. once distracted by the f22s and the dogs barking and the mrs asking me repeatedly what the heck is that i lost track of it."],"Region":"Nevada","Country":"United States","Disposition":"Unknown","Summary":"Bright Blue Star Like","Longitude":"-115.108161","Object Shape":"Star-like","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around November 3rd 2010"],"Latitude":"36.202669","Log Number":"US-11042010-0003","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"11/03/2010 01:00 UTC","Case Number":"26348"}