{"Latitude":"35.367538","Source":"MUFON","trends":["There has been one other sighting in Morro Bay","There were no other sightings in Morro Bay on or around January 31st 1991"],"Country":"United States","Case Number":"26347","Object Flight Path":"Path with directional change","Disposition":"Unknown","Date Submitted":"11/04/2010 02:46 UTC","Object Shape":"Disc","Log Number":"US-11042010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=35.367538,+-120.840351(26347)&iwloc=A&hl=en\"> mufon case (26347) map </A>","Longitude":"-120.840351","files":["/var/www/straped/mufon/html2text/26347.html.txt","/var/www/straped/mufon/org/26347.html"],"Tags":"City","City":"Morro Bay","Weather Factors":"Unknown","Object Features":"Dome","Date of the Event":"01/31/1991 12:00 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailsthis happened 21 years ago and i have not related it to anyone except a few friend in all that time. i am reporting it to mufon now because recent events (the national press club conference, etc.) seems to me to make it more important to do so. i am hoping it will still be helpful after all this time. here is what happened: in early 1991, i was driving to my home in morro bay, ca with my then 12 year old daughter at around 2:00am in the morning coming from atascadero, ca on hwy 41. there was little or no traffic on this route at that time in the morning. this route descends into a narrow canyon before reaching the coast. as we drove into the canyon a flashing red light caught my attention in my rear view mirror. thinking that it was an emergency vehicle approaching from my rear i was concerned because there was not really much room to pull over and let it pass. as i was watching it in my mirror i noticed that the red light was flash in a very irregular manner, unlike an ambulance or fire truck or police car. at one point the road made a large sweeping curve to the left which allowed me to look back up the canyon, which i did trying to figure how far behind me the lights were. it was then that we came upon a small turnout on the shoulder of the road and i pulled off and stopped and awaited for it to pass. when i looked back i noticed that the red light was now steady and not flashing and i realized that it was coming down the other side of the canyon slightly above and floating above the treetops. it was also maintaining a constant distance above the trees by rising and falling as it floated. there are no roads on that side of the canyon and i could see the reflection of the red glow which was coming from the curved bottom of a small (no more than 20 feet) disk shaped craft moving somewhat slowly as it followed the hillside. as my daughter had been dozing, i woke her and called her attention to what i was seeing. i also rolled down my window at this point and could tell at this time that the disk was absolutely silent - no noise at all. as we continued to watch the craft made it's way further down the canyon to a position across and slightly above ours and after passing that point it began to rise along the hillside while still moving forward until it reached the ridge at which point it went up and over the ridge and descended over the other side and out of sight. at this point it began to sink in that what we had just seen was a ufo and i experienced the hair on the back of my neck standing up. in a moment, wanting to see more, i got back on the road and sped down the canyon trying to gain another vantage point to see it again. i was not able to. my daughter was excited and agitated and kept asking me, \"what was that daddy?\", but i had no answer. we went the last few miles home in silence and soon went to bed. i know what i saw. i know it was strange, but i also know it was not some ordinary object or vehicle. as i said, to this day i have not recounted this to any but a few close family and friends. i can only hope that there is something useful and\\or helpful here. i certainly will never forget it."],"Region":"California","Viewing Distance":"21-100 Feet","Summary":"stopped my vehicle and witnessed a disk with a red glow floating silently down a canyon near Morro Bay, CA"}