{"map":"<A HREF = \"http://maps.google.com/maps?q=30.278834,+-89.776904(26343)&iwloc=A&hl=en\"> mufon case (26343) map </A>","Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Triangle","Country":"United States","Date of the Event":"10/28/2010 08:12 UTC","Date Submitted":"11/03/2010 10:09 UTC","Log Number":"US-11032010-0029","Summary":"Triangular shaped UFO, no sound, no lights, very slow moving.","divs":["Sighting DetailsIt was the night of October the 28th, 2010 between 8:00pm and 8:30pm. I was talking to a friend on the phone while standing in my back yard (Slidell, Louisiana, 30 miles to the North of New Orleans, Louisiana), watching my dog. My friend asked if it was cloudy and I looked up and said no, the stars are out, then all of a sudden I realized something was blocking the area of sky I had been looking at. It was a large rectangular craft,dark in color, smooth texture, no lights, no sound. My guess was it was approximately 50 to 60 feet in length, not far above the trees, moving from southeast towards the northwest, so slowly I cannot imagine how it stayed in the sky. I could not move, I was so frightened, and repeatedly said, Oh my God, over and over in a frightened voice, until I heard my friend asking if I was alright, I described what I was seeing to him, and at first he laughed thinking I was joking, but realized I wasn't. The object made absolutely no noise, not a dog in the area barked, including my dog. The UFO slide through the sky effortlessly. I am wondering if anyone else in my area saw this UFO? It was spectacular! I've never seen anything like it before! Wish I hadn't felt so frightened. I watched it until I couldn't see it anymore, it disappeared behind the trees. The whole incident lasted about 15 minutes, or less."],"Object Features":"Undisclosed","Latitude":"30.278834","Sighting Duration":"00:15:00","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/26343.html.txt","/var/www/straped/mufon/org/26343.html"],"Disposition":"Unknown","City":"Slidell","trends":["There have been 6 other sightings in Slidell","There were no other sightings in Slidell on or around October 28th 2010"],"Case Number":"26343","Viewing Distance":"101-500 Feet","Longitude":"-89.776904","Region":"Louisiana","Source":"MUFON"}