{"Object Flight Path":"Unknown","Latitude":"35.152994","Object Shape":"Circle, Flash","files":["/var/www/straped/mufon/html2text/26345.html.txt","/var/www/straped/mufon/org/26345.html"],"Case Number":"26345","Date Submitted":"11/03/2010 11:12 UTC","Sighting Duration":"09:15:13","Log Number":"US-11032010-0031","map":"<A HREF = \"http://maps.google.com/maps?q=35.152994,+-90.04354(26345)&iwloc=A&hl=en\"> mufon case (26345) map </A>","divs":["sighting details today 11\\3\\11 approximately around 9:15, i went outside to smoke a cigarette because i was mad at the world of course. then i asked my neighbor to use her phone. as i was standing outside listening to the phone dial. the sky caught my eye and i just froze and stared at this big premises in the sky with bright lights circling around then coming together really fast. i told my friend on the phone what i had seen and he just laughed at me and called me crazy. i know what i saw. i was disappointed. i was thinking that it was a child with some crazy flash light but the circles spun so fast i new it wasn't. after i hung up with my friend i was so upset with him that i wasn't paying attention anymore so i went inside. later on i came back outside and the sky seemed very different. the clouds where red like an indian sky only in the night but there was black gas paint looking splatters that threw me off. i observed everything. that is the only clue i had. i came inside and looked some stuff up on this mysterious happening and found some interesting stuff. i love this kind of stuff and feel pretty awesome witnessing it. it's kind of a highlight of my day after how foul it was."],"Object Features":"Unknown","Viewing Distance":"101-500 Feet","Longitude":"-90.04354","Disposition":"IFO","Date of the Event":"11/03/2010 09:15 UTC","City":"Memphis","Summary":"Four bright lights going in fast circles then comeing together","Country":"United States","Tags":"City","Weather Factors":"Unknown","Region":"Tennessee","Source":"MUFON","trends":["There have been 62 other sightings in Memphis","There was one other sighting in Memphis on or around November 3rd 2010"]}