{"divs":["Sighting DetailsI should be honest about this...I got two days off from work I work as a ProgramAssociate at an international exchange program after a long, difficultconference. On Monday night, October 6th, my roommate and I decided to have arelaxed night, knowing I didnt have to get up on Tuesday morning for work. OnMonday night, we were drinking and smoking pot, although not to a point where itfelt excessive. I will admit right there that this could call my story intoquestion, but I should be honest. We live in a two-story rowhome, and I decidedthat since it was a great night, I would climb onto the roof, which I had neverdone before. My roommate, being heavier than I, didnt even want to try. Icimbed up the back of the house for a wonderful view of the city from therooftop.I was laying on my back on the roof watching the stars, ejoying the tricks thatthey play on you when you stare at them for too long, when I noticed two smallabout the size of a star orange-yellow bits of light in the sky. I was on myback, with my feet facing south, so I would say they were in thesouth-southwestern part of the sky, moving in a straight line towards the duesouth horizon. From my home at 20th and Washington, they looked like they wereheaded towards the part of the horizon where Veterans Stadium is, which is duesouth and a few blocks west. I thought at first it was either stars, asatillite, or the beer, honestly. So I kind of closed my eyes and shook my headto get the cobwebs out and refocus my vision -- when I noticed that the objectswere still there, moving on the same trajectory, at the same speed, and at theexact same distance apart. Still thinking this was in my head, I looked to adifferent part of the sky for a few seconds, then looked back to where theyellow-organge lights SHOULD have now been given their speed and trajectory, andsure enough they were still there, moving together, same speed, at the exactsame distance apart. I followed them until they faded away as they got close tothe limit of my vision. In the city, obviously, the light pollution makes itdifficult to see anything unless it is very high above the horizon.I came inside and told my roommate about it, and that was about the end of theconversation, both of us laughing that it was in my head. I think the time onthe cable box was like 1245 AM, but I could be a bit off. I remember that itwas earlier than I thought it was, but still after midnight. This would make itofficially early Tuesday morning by this point.Anyway, I didnt really think about it much at all u"],"Log Number":"","Weather Factors":"Unknown","Summary":"UFO Over Philadelphia, PA","Object Shape":"Undisclosed","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Longitude":"-75.158429","Disposition":"Insufficient Data","Date Submitted":"10/07/2003 12:00 UTC","Region":"Pennsylvania","Case Number":"2635","Date of the Event":"10/07/2003 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/2635.html.txt","/var/www/straped/mufon/org/2635.html"],"trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around October 7th 2003"],"Sighting Duration":"00:05:00","City":"Philadelphia","Latitude":"39.960735","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.960735,+-75.158429(2635)&iwloc=A&hl=en\"> mufon case (2635) map </A>","Tags":"City","Source":"MUFON"}