{"Latitude":"39.173162","Date Submitted":"11/04/2010 02:12 UTC","Viewing Distance":"Unknown","City":"Germantown","Log Number":"US-11042010-0013","Country":"United States","files":["/var/www/straped/mufon/html2text/26358.html.txt","/var/www/straped/mufon/org/26358.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.173162,+-77.27165(26358)&iwloc=A&hl=en\"> mufon case (26358) map </A>","Object Features":"Unknown","Disposition":"Unknown","Tags":"City","Case Number":"26358","divs":["Sighting DetailsAt about 12:45 to 1:15am I was outside walking the dog. It was a perfectly clear nite and we had a new moon so the skies were dark and the stars were very visable. For some reason I had a gut feeling that I was going to see something strange for about 2 days prior. Anyway, while looking at the stars I was thinking I was going to see a shooting star. After about 10 minutes or so looking straight up in the sky I saw something twinkling out of the corner of my eye so I kept looking even though it was very cold out side. As I looked in all directions of the sky I could not see a plane or helicoptor and noticed how calm and quiet it was outside. Then I looked over top of my apartment building away from the Germantown Library I noticed 2 perfectly shaped triangles side by side with 3 round soft white lights one at each point in the triagle. The objects moved in a straight line. I coulc not see any metal or other detailing and there wasn't any clouds in the sky to determine the height of the ufos. It tooked the ufos only 5 to 8 seconds to cross the nightime sky until I could not see them anymore. It would have taken a regular airplane at least 1 to 2 minutes to travel that far. I know that this was not an airplane because there was no audible sound from the craft and also the rate of speed was faster than imajinable. About 5 minutes later I saw a shooting star and 2nd white round object that made a cursive pattern in the sky. Not sure what the that was. The 2 UFOS as they traveled kind of had a shadow of soft light as they went by in the night time sky. I can not explain what other type of craft this could have been. I also can not explain why I felt 2 days prior in my my gut that I was going to see something strange. It is almost like I was ment to see this phenomenal event."],"Weather Factors":"Unknown","trends":["There have been 4 other sightings in Germantown","There were no other sightings in Germantown on or around November 2nd 2010"],"Object Shape":"Triangle","Region":"Maryland","Summary":"Two Triangle Shaped objects with 3 soft white lights at the point","Date of the Event":"11/02/2010 01:00 UTC","Source":"MUFON","Longitude":"-77.27165"}