{"Case Number":"26356","files":["/var/www/straped/mufon/html2text/26356.html.txt","/var/www/straped/mufon/more/26356_submitter_file1__UFO1.JPG","/var/www/straped/mufon/more/26356_submitter_file2__UFO.JPG","/var/www/straped/mufon/org/26356.html"],"Summary":"White cross shaped object.","City":"Little Rock","Object Shape":"Bullet, Missile, Cross","divs":["Sighting DetailsDriving South on Highway 430 in South Little Rock there appeared to be a cross shaped object hovering above the tree line about 200-300 feet. It hovered for five minutes when I passed it on the freeway, got off an offramp before the W. Dixon exit to turn back to examine what was in the sky, and it was gone. I and other motorists did the same thing. Tried turning around after passing it to have another look. It literally disappeared. It was white in shape with a red stripe of some sort. It emitted extreme heat from the entire flat bottomed surface of it. I thought it was a plane until I noticed it wasn't getting further away or any closer, and because I was only 10 miles from the Little Rock airport. It was directly in the take off flight path from that airport. I saw a plane, after the craft was gone, fly right by where it had been sitting. I was completed baffled at the fact it wasn't moving then it just seemed to disappear into thin air. I wanted to turn around and get video of this with my cell phone off the highway but it was gone. It had some kind of writing on it but I couldn't tell what it was. The entire bottom of the craft looked like the trail behind a jet engine that has been turned on. The pictures I have supplied are the side, and front views of what I saw drawn to the best of my ability. I think I could make a better model with clay or Play-Doh. I do believe it was about 40-50 feet long and I do not remember if it had any windows."],"Date of the Event":"11/04/2010 10:25 UTC","Longitude":"-92.284345","Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=34.754821,+-92.284345(26356)&iwloc=A&hl=en\"> mufon case (26356) map </A>","Disposition":"Insufficient Data","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-11042010-0011","Latitude":"34.754821","Date Submitted":"11/04/2010 01:12 UTC","Object Features":"Wings","Source":"MUFON","Object Flight Path":"Stationary","trends":["There have been 21 other sightings in Little Rock","There were no other sightings in Little Rock on or around November 4th 2010","This sighting has never been favorited.",""],"Tags":"City","Weather Factors":"Unknown"}