{"divs":["Sighting DetailsI was talking to my husband while at my son's baseball practice, when I noticed a bright light, which suddenly became brighter, almost like a really bright falling star, but much brighter more like an explosion. It was located towards the Southeast Mountains surrounding Lake Havasu city. I watched this light, which did not move, but it was amber and when it became bright it was almost red, white, and then returned to amber. I kept watching the general area, and seconds later I saw it miles away and it became brighter, same colors, and then disappeared. Then again, but this time it went up and to west. Only this time, when it became brighter, it stayed bright, and split into two, with the second one moving instantly and directly horizontal, what must have been miles away, in the eastern direction. They both stayed there for what seemed like five seconds and then they were gone. I directed my husbands attention to them, after the second sighting, and asked what he thought it was, and he witnessed the movement and splitting. He was just as amazed as I was. These things moved much faster than any aircraft I have ever seen or know about. 1) I was talking to my husband at my 12-year-old son's baseball practice. 2) The fact that it was so bright was the first thing that attracted my attention. I have never seen anything so bright in the sky. 3) When I first noticed the object, I thought of a falling star, but it was not falling, it was actually just sitting there. 4) It was difficult to tell if there was any shape to them, as they were so far away in the distance. The light that they emitted was extremely bright and appeared round. It also moved instantly, unlike anything I have ever seen. 5) When I first saw it, I thought falling star, I always catch them. Then immediately I thought, \"I am seeing my very first UFO\", and I turned my husbands head to see it. We were both amazed, and I felt calm, and thankful that I was able to witness such an amazing event. 6) The objects once split appeared to move just beyond the mountains, and I was unable to see them after that. I tried to look for them several times up until about 2130, but did not see anything that would appear to be them. I tried to get my camera phone to work, but the program would not come up, and it is unfortunate. I think I was in too much shock to figure out an alternative, and I did not want to stop looking at them. They were beautiful."],"Object Shape":"Fireball, Flash, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=33.456667,+-112.071147(26353)&iwloc=A&hl=en\"> mufon case (26353) map </A>","City":"Phoenix","Latitude":"33.456667","Country":"United States","files":["/var/www/straped/mufon/html2text/26353.html.txt","/var/www/straped/mufon/org/26353.html"],"Weather Factors":"None","Date of the Event":"11/03/2010 08:36 UTC","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"26353","Date Submitted":"11/04/2010 11:19 UTC","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 3rd 2010"],"Summary":"Several Lights, Becoming Brighter, Splitting in Two, and then Disappear","Longitude":"-112.071147","Disposition":"IFO","Tags":"City","Sighting Duration":"00:01:00","Region":"Arizona","Log Number":"US-11042010-0008"}