{"Case Number":"26357","City":"Pekin","files":["/var/www/straped/mufon/html2text/26357.html.txt","/var/www/straped/mufon/org/26357.html"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Patterned Surface, Louvres","Country":"United States","Summary":"Chevron moving silently across the sky","Weather Factors":"Windy, Light","Latitude":"40.571459","Longitude":"-89.637998","Region":"Illinois","Date of the Event":"11/03/2010 07:18 UTC","Sighting Duration":"00:00:15","Object Flight Path":"Straight-line path","Object Shape":"Chevron","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.571459,+-89.637998(26357)&iwloc=A&hl=en\"> mufon case (26357) map </A>","Disposition":"Unknown","trends":["There have been 7 other sightings in Pekin","There were no other sightings in Pekin on or around November 3rd 2010"],"divs":["Sighting DetailsNow I've seen lights in the sky before. I've seen them make speeds across the sky that I don't think conventional craft can make... and weird aerobatics that none should be able to make. Specifically, those were 30 and 20 some years ago. But tonight. I saw something both weird, and awesome, if you'll forgive the nerdy enthusiasm. So my boss and I were outside looking up at jupiter at 7:15pm. I'm an amateur astronomer and was trying to convince my boss that he needs to go get himself a nice 5\" or 8\" refractor and get into the hobby. We talked... I turned to look up at jupiter again... and he did the same. I turned to look at him and he looked at me and it took that half to full second for my brain to go \"I think you'd better look back up... there was something not right there...\" I looked up and saw what I thought was a flock of birds at first instinct. You know, that chevron shape... maybe some canadian geese. Trouble is, you can hear canadian geese flying south. I immediately ruled that out. A number of things flashed through my head as I stared, and they were ruled out as well. It was at that point both of us went \"What the @#$!@ is THAT?!\" How big was it? How high was it? Not sure. It was in open air so I had no frame of reference. I can only GUESS based on the light shining off of the bottom of it from the city below that it was maybe 1000-1500 feet up... Maybe 200-300 feet across. It almost looked to have a leading edge white glow, and a brownish color underneath. It was chevron shaped ( V shaped ) and I could almost make out some structure underneath it. Like vent ports or something. It was absolutely silent. It wasn't creeping along, nor was it moving like a bat out of hell either. It was moving at a reasonable clip... maybe 200mph? The night was clear... and the air crisp. Despite it being dark, it was unmistakably not a plane, bird, etc. What immediately came to my mind was \"if it wasn't for the lights from the city... no one would even know that thing was up there...\" How many more are just creeping along like that in the middle of the night? Nobody looks up... and if they did, they MIGHT see a trail of stars winking out for a few seconds and attribute it to a cloud or two... I know the whole thing is relatively cliche, but that's what I saw. And it kicked ass. :D"],"Log Number":"US-11042010-0012","Date Submitted":"11/04/2010 01:51 UTC"}