{"Date Submitted":"11/04/2010 03:49 UTC","Summary":"bright red orb moving north then hovering , Moved east then hovered then shot straight into the air.","City":"Sedgewickville","divs":["Sighting DetailsI wanted to report a sighting in the summer of 1998 in Sedgewickville missouri which is located about halfway between St Louis and Sikeston Missouri. I was doing a job with my boss building a barn for his mother. We lived in Sikeston at the time and it was about a hour and a half drive so we decided to camp out during the week and go home on the weekends. It was around 8 o'clock in the evening and we were in the tent when we noticed a red light in the sky, so we decided to go out to get a better look. The object was bright red, didn't flash or change colors. It was constant. The object was between 50 and 100 feet of the ground. The size im not sure but if i put my left hand on one side and my right hand on the other my hands were about 2 ft apart. Im not saying it was two feet wide because if u see a plane in the sky it looks small but up close its huge, so i guess it all mathmatics to determing the actual size. There were a couple of things i noticed that were odd. One was that it was completely silent. Two was that the edges were perfectly defined. You know when u see a light in the distance the edges are fuzzy, this wasn't like that, you could make out the edges. The object was perfectly round, glowed bright red but didn't light up the sky or the ground. The object moved in a northernly path for about 20 seconds then stopped and hovered for about 5 to 7 seconds. Then it went east for another 5 seconds or so, hovered again for another 5 or so seconds then shot straight into the air and dissapeared. The object made a smooth path, no zigzaging or up and down moting. My boss mentioned to me before hand that he grew up in the area and strange lights have been noticed for years, at least as long as he can remember. I hope this information helps with ur cause. I appreciate ur time and keep up the good work, the truth needs to be known. WE ARE READY SINCERELY ERIC SADLER"],"Object Features":"None","Date of the Event":"06/30/1998 12:00 UTC","Source":"MUFON","Region":"Missouri","trends":["There have been no other sightings in Sedgewickville","This sighting has never been favorited."],"Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Longitude":"-89.907049","Disposition":"Unknown","Object Shape":"Sphere","Log Number":"US-11042010-0016","Latitude":"37.516166","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"26361","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/26361.html.txt","/var/www/straped/mufon/org/26361.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.516166,+-89.907049(26361)&iwloc=A&hl=en\"> mufon case (26361) map </A>"}