{"map":"<A HREF = \"http://maps.google.com/maps?q=29.700402,+-95.203201(26368)&iwloc=A&hl=en\"> mufon case (26368) map </A>","Latitude":"29.700402","Case Number":"26368","files":["/var/www/straped/mufon/html2text/26368.html.txt","/var/www/straped/mufon/org/26368.html"],"Tags":"City","Date Submitted":"11/04/2010 10:18 UTC","Summary":"Large round (orb) white light traveling at a high rate of speed.","City":"Pasadena","Country":"United States","Object Features":"Undisclosed","Weather Factors":"Unknown","Longitude":"-95.203201","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Region":"Texas","Date of the Event":"11/04/2010 07:16 UTC","divs":["Sighting DetailsSoutheast of Houston, Texas area. On my way to work on Thursday, November 4, 2010 at 7:16 am, I saw a UFO! I was driving west bound oh Hwy 225 in between Deer Park and Pasadena. It was dawn and the sky was clear and blue. I noticed a very large bright white round (orb) light to the southwest traveling extremely fast headed to the north - north west. This would be at my 10 o'clock position through my windshield. I kept looking at it because it seemed strange, too bright and too large. I countinued looking at it and the road back and forth since I was driving. I have seen many plane lights due to Hobby Airport being to the south of Hwy. 225 and Bush International being to the North. With planes, jets, and helicopters, I have always noticed small red lights as well. At first I thought it was a star or a comet, but it was absolutely crystal clear blue sky - not one star, no stars, nothing. If it was a comet, the tail would have been visible. It actually looked like a small bright full moon. My phone rang at 7:17 am and I continued looking at the light as I was driving. I mentioned to the caller what I was seeing, but since I was talking on the phone, I didn't think I could take a picture with my cell phone. Then it just vanished in thin air - no smoke, no jet or plane in the sky - nothing!!! Visibility was clear for several miles - if it was a plane, once the light turned off, there was enough daylight that the plane would still be visible, but there was nothing."],"Disposition":"IFO","Log Number":"US-11042010-0022","Object Shape":"Sphere","trends":["There have been 10 other sightings in Pasadena","There were no other sightings in Pasadena on or around November 4th 2010"],"Source":"MUFON"}