{"Date Submitted":"08/01/1963 09:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.390856,+-93.33465(2636)&iwloc=A&hl=en\"> mufon case (2636) map </A>","Summary":"Grand Armada In the Sky","divs":["Sighting DetailsThis is all based upon stories I heard from several fellow students thatsomething happened over Benton County Missouri July 1,1963 Lights thousands orhundreads of thousands of lights in the sky appeared scaring the hell out ofall the animals and most of the people who were in the area suffered a greatstampede. Animals from the Benton COunty area went on a rampage killing hundredsof people who tried to stop it. Most of the people who saw this event are oldor dead now. My father was also home at that time getting ready to go to workthe next day. He went to bed at 830 that night and didnt get up until three thenext morning and according to him nothing happend at all. It was reported thatthis event took place over the home that I was comming home to. The eventlasted four hours from nine to twelve midnight. and it has been told to me thatmy birth was the sign of an ill omen. AS for meI was born in Kansas City Mo at Menorah hospital.I was born at 3.36.p.m. It was exactly seven hours later when the event happendand according to my fatherwho is now deadHe said that everyone was crazy telling of the stampede that took place. Hethought they had gotten into the pop-skulla drink made from sorgum squeezens andhallucinated the whole thing.at that time, my father had beagle puppies in the old barn which doesnt exisitanymore. My former home was one mile south and three miles east on lake road H.The home has a gravel road in front of it. If there had been anything going onthe puppies and their mothers would have been raising hell about it. None ofthem said anything and got throught the night just fine with no incident. Therewas no evidence but there were cow patties in the yard and hoofprints goingacross the pasture. Still my father who used to work for the Fajin GunstockCompany which is also defunct. Thought everyone there had was nuts and told meto stay away from them. So I dont know what to tell you. If there is anyonethere who can verify anything that happend. Then perhapse they will tell yousomething. This event happend a very long time ago. Whatever you can find wouldbe a help to me if there is anything at all. Animals both wild and domestic ranfor their lives in sheer fright. What couldnt get away died of fright. Manyfarmers lost their homes and had to go through a long and terrible recoveryprocess. Many men who were up older thought it was the end of the world and diedof fright as well. The lights were said to be beautiful and were bright lightswithin lights comming and going and if there was ever a time when the world wasgoing to endthen the Lord was practicing for the big day of his return. I dont know anythingmore than what other people have said. Whe"],"Date of the Event":"08/01/1963 09:02 UTC","Object Features":"Undisclosed","Region":"Missouri","Case Number":"2636","Country":"United States","Source":"MUFON","City":"Lincoln","Log Number":"","Sighting Duration":"01:59:00","Latitude":"38.390856","trends":["There have been no other sightings in Lincoln","This sighting has never been favorited."],"Disposition":"Insufficient Data","Longitude":"-93.33465","Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/2636.html.txt","/var/www/straped/mufon/org/2636.html"],"Tags":"City","Object Shape":"Unknown","Object Flight Path":"Unknown"}