{"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.674847,+-116.978451(26365)&iwloc=A&hl=en\"> mufon case (26365) map </A>","trends":["There have been 11 other sightings in Hemet","There were no other sightings in Hemet on or around October 1st 1982"],"Tags":"City","Case Number":"26365","Latitude":"33.674847","Object Flight Path":"Undisclosed","Date Submitted":"11/04/2010 09:10 UTC","Longitude":"-116.978451","Summary":"Herd progressivly load humming noise, it moved from power poll to backyard then straight up","Region":"California","Country":"United States","Log Number":"US-11042010-0019","Viewing Distance":"Unknown","Date of the Event":"10/01/1982 12:00 UTC","Object Shape":"Sphere, Triangle","Source":"MUFON","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/26365.html.txt","/var/www/straped/mufon/org/26365.html"],"divs":["Sighting DetailsMe and my brother were playing camping in the yard of our house in the back of my dads old pickup. We both fell asleep late talking about hunting then i awoke startled by the vibrations in my chest and the sound of that hum was very strange.Kind of pulsating slower and faster all at once. as i leaned forward i sat there not sure what to think.there it came over the roof of the house about 50 ft up and only showing one side of it self. It moved slowly to the backyard then stopped in full view, Three green triangles stacked with two very small rectangle red bars below the triangles pulsing and moving back and forth under the triangles.they would sometimes split and come back together always at different times.OK while i watched hypnotically the first thing that went through my head was no one is going to believe me...I tried very hard to shake my brother as to not draw attention. I was terrified at first anyway as i glanced over to my brother laying there with his eyes wide open and looking straight up, he wouldn't move a bit when i was pushing on his arm he just stared straight up like he was unconscious. My brother had his eye's open the whole time not looking at anything.....i felt like he was not meant to see this ....to this day he remembers nothing. As we shared glances for a short while it gave me purpose to my life. And it would not be my last.The pulsing noise quieted then it slowly started away from me at 45 deg.angle then zip ............it was gone. I immediately grabbed my arm to make a bruise on it to have a acknowledgment of thee experience. Then my brother awoke and rolled over.I felt later as though it was reading me some how. Like it had thee ability to use your thoughts as an active camouflage."],"Weather Factors":"Unknown","City":"Hemet"}