{"Disposition":"Unknown","Country":"United States","Summary":"I saw an object from my window, it flashed green and red, I watched as it changed shapes, then turned into a sphere with a light shinning from it and then disappeared in a matter of approximately 5 minutes","divs":["sighting detailsi was in my exercise room and sitting on the floor for a moment when i looked out the window around 9:00 pm and saw one of the bright planets, i believe this may be venus. i was facing south so the next closest city to me would be westlake, ohio. as i was staring at it, i noticed an object in the distance that had red and green flashes.i thought it was my eyes playing tricks so i grabbed the binoculars and watched it. the object looked like it was one shape, then changed to another. as i watched it turned into a sphere and then from the sphere only for just a few seconds, maybe ??? 10, there was what looked like a beam of light that came from it. it wasn't a plane with it's lights on though i thought at first it might be. this object though was for lack of words, strange. i called my family members as i watched it and described what i was seeing before it just disappeared. the lights green\\red flashed in no specific order. a few weeks earlier, a woman and her friends saw an object as they came from a bar in westlake. they took a video of it. this did not look like what i saw and unfortunately i don't have a camera that is capable of taking photos in the dark. my feelings are that as humans we continue to take from the earth and perhaps with all the drilling, mining and abuse of our planet, whatever it was, has a concern for our race. i wasn't afraid but i surely wouldn't go out looking for it either. i am asking my husband for a video camera that will be capable of taking long range videos at night for christmas!"],"Weather Factors":"None","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26366.html.txt","/var/www/straped/mufon/org/26366.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.457413,+-81.912477(26366)&iwloc=A&hl=en\"> mufon case (26366) map </A>","Tags":"City","Object Flight Path":"Path with directional change","City":"Westlake","Date Submitted":"11/04/2010 09:26 UTC","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Circle, Oval, Sphere","trends":["There have been 2 other sightings in Westlake","There were no other sightings in Westlake on or around November 1st 2010"],"Longitude":"-81.912477","Date of the Event":"11/01/2010 09:00 UTC","Case Number":"26366","Latitude":"41.457413","Log Number":"US-11042010-0020","Sighting Duration":"00:05:00","Region":"Ohio","Object Features":"Unknown"}