{"Date of the Event":"11/03/2010 11:55 UTC","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around November 3rd 2010"],"Date Submitted":"11/04/2010 04:09 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.268763,+-97.733931(26362)&iwloc=A&hl=en\"> mufon case (26362) map </A>","Viewing Distance":"Unknown","City":"Austin","Log Number":"US-11042010-0017","Object Flight Path":"Undisclosed","Tags":"City","Latitude":"30.268763","Region":"Texas","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26362.html.txt","/var/www/straped/mufon/org/26362.html"],"Object Features":"Undisclosed","Case Number":"26362","Disposition":"IFO","divs":["sighting detailsi was walking back from 7-eleven with my friend janel. on the way back, just past the intersection of barton skyway and s lamar, an unknown, silent craft, there was a spherical object with a pulsating red glow from the interior passed us. it was directly in front of us. it came over the treeline, from right to left, it was approximately 40\\50 feet in the air and was not very large. it was travelling rather quickly, so the entire episode lasted about 1 minute. i was in a state of shock as i looked over to my friend, looked back up and then looked back at my friend. i commented, \"do you see that?\" i'm like, \"that's not a plane or helicopter\". i stayed dumbfounded\\in awe for about 20-30 seconds. my friend snapped me out of it and was like, \"film it\". i am upset with myself as i had a camera phone, but as i fumbled to get the camera\\video function turned on, the craft was about 1\\4 mile away. it was flying in the general direction of the airport. the craft did not seem very large, almost like some type of orb, between 5-10 feet in diameter, but i'm horrible with depth perception. all i can say it was fairly low to the ground for an aircraft and did not seem very large--but the pulsating red glow was its most salient aspect."],"Sighting Duration":"00:01:00","Longitude":"-97.733931","Object Shape":"Sphere","Weather Factors":"Unknown","Summary":"pulsating black/red aircraft flew over treeline and over street from right to left"}