{"Log Number":"US-11042010-0017","Latitude":"35.159214","Case Number":"26363","Tags":"City","Source":"MUFON","Date of the Event":"11/02/2010 12:00 UTC","Viewing Distance":"Unknown","Longitude":"-90.04007","Region":"Tennessee","divs":["sighting detailswe received this call from a witness that we have worked with in the past about a substance that has appeared in her backyard. this is similar to the substance she found earlier in the year that was complimented with a sighting of a cigar shaped object. i was called to assist because of the time frame from which we wanted to collect data. i asked a new fi, lynette gutshall if she was available and we both arrived on scene 942am the following morning. this was 4 november.upon entering the scene, we clearly saw this substance and it did look \" dropped\" and splattered. we did our initial readings and found no magnetic, electrical or radio waves that would be abnormal. the air\\environmental temperature was 58degrees and the actual substance temp. read 45.6 degrees. debris around the substance such as leaves or small branches read the same temp. as environment. we photographed the entire area, including the surround landscaping. we took shots of obvious sizing of the pieces and area of interest. evidence collection was done on a 4 level series. since the substance appeared moist, i took swab rubbing samples, cottonball swipe sample and collected the substance itself in plastic canisters and plastic bagging. physical evidence form was completed by the witness and released for analysis. we did a thorough grid search thru the backyard and did not find anything remotely close nor did we find anymore. we did random stops and searched the neighborhood looking for any evidence of this substance or anyone that has seen this before and we could find none."],"Summary":"Case Is being submitted for the witness by Chase Kloetzke, Deputy Director of Investigations/Star Team Manager.","files":["/var/www/straped/mufon/html2text/26363.html.txt","/var/www/straped/mufon/org/26363.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.159214,+-90.04007(26363)&iwloc=A&hl=en\"> mufon case (26363) map </A>","Object Features":"Undisclosed","Date Submitted":"11/04/2010 05:23 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"None","Country":"United States","trends":["There have been 62 other sightings in Memphis","There was one other sighting in Memphis on or around November 2nd 2010"],"Object Shape":"Unknown","City":"Memphis","Disposition":"IFO"}