{"Case Number":"26379","map":"<A HREF = \"http://maps.google.com/maps?q=36.120366,+-115.171516(26379)&iwloc=A&hl=en\"> mufon case (26379) map </A>","Summary":"QUICK FOUR LIGHTS SHOOK THEN DISSAPEARED VERY RAPIDLY UPWARDS","Object Flight Path":"Hovering then path","Sighting Duration":"00:00:05","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Date of the Event":"08/08/1997 12:00 UTC","Viewing Distance":"Over One Mile","Log Number":"US-11052010-0007","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/26379.html.txt","/var/www/straped/mufon/more/26379_submitter_file1__flight.JPG","/var/www/straped/mufon/org/26379.html"],"Object Features":"None","divs":["Sighting DetailsI was a sophomore attending Bonanza High School west of the Las Vegas strip. A couple friends and I were skateboarding in a parking lot around Dusk 7-8pm approximate area of Jones and Alta looking east towards Lake Mead (the lake). Now I have lived close too Nellis Air force base and attended PLENTY of airshows so I know exactly the maneuvers and speeds that can be obtained. The four lights I saw were in a perfectly straight line they appeared just above the mountain top quite a distance from the strip they seem to have hovered for a second or two then moved very rapidly in a shaking or Z shape then very suddenly disappeared. This event took place all in about a few seconds but very distinct and burned an image in my head that has prompted me to share because of the such rapid rate of movement and synchronized (spacing) of the lights at which they moved. Once again It was so fast I was not sure if anyone I was with seen the same thing nor did I even mention it at the time and I have never really mentioned it to anyone since (13yrs)??"],"Country":"United States","Region":"Nevada","Date Submitted":"11/05/2010 06:56 UTC","Latitude":"36.120366","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 8th 1997","This sighting has never been favorited.",""],"Object Shape":"Other","City":"Las Vegas","Longitude":"-115.171516"}