{"City":"Bishopville","Weather Factors":"Unknown","Date of the Event":"10/31/2009 07:50 UTC","Country":"United States","Log Number":"US-11052010-0006","Date Submitted":"11/05/2010 03:57 UTC","Object Shape":"Unknown","Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/26378.html.txt","/var/www/straped/mufon/org/26378.html"],"trends":["There have been no other sightings in Bishopville","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.218211,+-80.248406(26378)&iwloc=A&hl=en\"> mufon case (26378) map </A>","Summary":"lights over a residential home in a farming community","Tags":"City","Sighting Duration":"00:01:10","Disposition":"Insufficient Data","Longitude":"-80.248406","Latitude":"34.218211","divs":["Sighting Details I was driving on Lucknow Road in Lee County, South Carolina, going to a nightclub, to meet with some friends and have a few drinks. As I turned onto Lucknow Road off of Pinchum Sly Road, I saw three white(not bright yellow or similarly incandescent)lights in the distance. Aware that a home was in that very vicinity, I first speculated that it was yard lighting. As I got closer, I realized these lights were over the tree tops that line the property boundary. I immediately let of the gas pedal and allowed my vehicle to coast. These lights were stationary there were no multiple flashing lights to suggest planes or helicopters. These lights were positioned so that I could determine shadows (or diffusion of the light) through the limbs of the trees below the lights. I reached a distance of fifty to seventy-five yards from the location below the closet light when all lights went out simultaneously. I was traveling at about 25mph at that moment and lowered my window in case I could hear motors or rotors, I heard nothing but my tires on the pavement and the rush of air at that speed. I continued to the club at a much accelerated speed constantly checking my mirrors(just in case). I was actually uncomfortable with this experience. At the very moment of the experience I had a terrible sense of dread. I felt as though I should immediately go home. I have remained silent about this incident. I am not certain if it is from fear or the stigma attached to claimants of sightings. In either case, this is the first and only report I have made of the incident. Thank you."],"Viewing Distance":"101-500 Feet","Case Number":"26378","Region":"South Carolina"}