{"City":"Owosso","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.998845,+-84.174446(26376)&iwloc=A&hl=en\"> mufon case (26376) map </A>","divs":["Sighting DetailsI have no photos of the event because it occurred in my dream (if it was a dream). I remember lying awake in my and turning over on my stomach. my bed is next to my wall. The next thing I remember, this is in my \"dream\", I wake up; I can't move as I'm on my stomach and my bed is in the middle of my room. I look around and see 7 figures standing around me. Each of them are wearing a black trench coat type clothing or robe, and their fingers are somewhat tentacle like. I remember starting to feel terrified for some reason as they looked at me and I was telling myself to wake up but could not. This went on for at least 4-5 minutes. Finally, I \"wake up\" but I'm on my back, instead of my stomach, and my bed was moved an inch or so from where it was earlier. I've never woken up so terrified in my life. EVER. I can still remember the dream as if it were yesterday. Never been so vivid and I haven't had the dream since. Also, before this, I was in the military in Kuwait. It was summer of 2008, I think. Anyways, I was sitting in my truck looking up at the stars and I noticed a bright star that was moving in an odd manner. At first the object was moving fast. Then it slowed, sped up, and slowed down again. After doing that for a few minutes it stopped completely and then it started to get smaller and dimmer. Not more than 2 minutes later, two military jets came into the area and circled around for about 5-10 minutes. The star had disappeared so the jets flew away back to where they came. Can't explain it."],"Object Shape":"Saturn-like, Star-like, Other","Summary":"Possible Abduction","files":["/var/www/straped/mufon/html2text/26376.html.txt","/var/www/straped/mufon/org/26376.html"],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Latitude":"42.998845","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/05/2010 01:59 UTC","Log Number":"US-11052010-0004","Object Features":"Unknown","Longitude":"-84.174446","Case Number":"26376","Source":"MUFON","Region":"Michigan","trends":["There has been one other sighting in Owosso","There were no other sightings in Owosso on or around June 11th 2010"],"Date of the Event":"06/11/2010 12:00 UTC"}