{"Weather Factors":"Unknown","trends":["There have been 69 other sightings in Boise","There was one other sighting in Boise on or around September 26th 2010"],"files":["/var/www/straped/mufon/html2text/26375.html.txt","/var/www/straped/mufon/org/26375.html"],"Country":"United States","Date of the Event":"09/26/2010 07:30 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.619881,+-116.206536(26375)&iwloc=A&hl=en\"> mufon case (26375) map </A>","Region":"Idaho","divs":["sighting detailsithey were was walking at the park across the street(kathryn albertson park). i had my camera with me and was hoping to see the deer that live in the park and get some new pics of them. as i was walking thru a pathway and onto the grass i noticed something out of the ordinary hovering in the distance. kind of square and had a copperish,brown color. at first i thought it may be a kite but noticed that it was completely still and absolutely silent. i took several pictures and zoomed in while taking them. after a couple of minutes i continued to walk to a different area and keep an eye on the object. as i walked around a corner and looked up again it seemed to be gone. i continued with my walk. but i knew i had witnessed something very out of the ordinary that evening. i was reminded of this when i ran across an article about the object from the witnesses. i just thought since i also observed this that i should go ahead and report it. i will be going thru my pictures on my computer to locate the ones that i have of the object. from what i remember they were fair and i do think a bit better than the ones from the other gentlemans cell phone camera. thank you *(wit's initials deleted--cms\\sg)"],"City":"Boise","Date Submitted":"11/05/2010 01:45 UTC","Object Features":"Other","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary","Disposition":"Hoax","Latitude":"43.619881","Object Shape":"Square, Rectagular","Longitude":"-116.206536","Sighting Duration":"Undisclosed","Case Number":"26375","Log Number":"US-11052010-0003","Source":"MUFON","Summary":"Observed something hovering at the park,"}