{"Object Features":"None","Tags":"City","Date of the Event":"10/24/2003 09:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Path with directional change,Unknown","divs":["Sighting DetailsSorry to bother you with an observation so trivial and devoid of detail.1 - I was out on my lawn looking to see if the northern lights were visiblesolar activity in the preceding 36 hours made a display of the aurora lessunlikely than usual.2 - I was simply scanning the sky and enjoying the stars. The Pleiades werequite visible to the east. I noticed the object about 10 degrees south of thePleiades position at about 2130 hours.3 - At first I thought it another star shimmering low toward the horizon, butthe amount of motion was more than could be accounted for by atmosphericdistortion. Then I thought it was an aircraft, or possibly a satellite, but itstrajectory seemed highly unusual, and thats really all I have to make me thinkit was anything out of the ordinary.4 - I suppose Id describe my reaction as detached curiousity. As its path inthe distance took it behind some tall trees on my property from my position andperspective, I strolled toward the road to see if I could pick up sight of itagain. I was distracted by the sudden barking of a dog on a neighbours propertya few hundred yards in the other direction, and lost sight of the object.5 - When I first noticed the object, it seemed nearly motionless, like any otherstar in the sky. Unused to seeing a gold star in that area, however, andnoticing that its atmosphere-induced shimmy was excessive, it held my attentionfor a moment, at which point I realised it was or had just then begun movingsouth with some slight acceleration. It began to climb or at this point in myobservation, I considered it was perhaps merely turning west and toward myposition, describing an arc that covered perhaps 10 degrees horizontally and alittle less than that in elevation. Its apparent motion came back a shade pastvertical, having described something of a quarter-circle, then it cut gently andwithout any change in speed southward again, moving in a very flat horizontalarc, first clibling very slightly then very slightly descending over perhaps 15or 20 horizontal degrees. Its descent, again without any change in speed, thenbecame steeper, rather parabolically, and then flattened once more to continuesouth.6 - At this point I began to lose sight of it behind the large trees that bordermy property, so I moved first one way, then the other, and saw it again for amoment in a gap in the woods near the road, but a sudden sound distracted me andin the moment I turned away and looked back I found I could no longer locate itbehind more trees across the road.Again, sorry to take your time with so pedestri"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.753959,+-76.702448(2637)&iwloc=A&hl=en\"> mufon case (2637) map </A>","Disposition":"Insufficient Data","trends":["There have been no other sightings in Aurora","This sighting has never been favorited."],"Region":"New York","City":"Aurora","Source":"MUFON","Date Submitted":"10/24/2003 09:30 UTC","Country":"United States","Object Shape":"Star-like","Case Number":"2637","Summary":"Gold object, erratic path, at great distance","Latitude":"42.753959","Log Number":"","files":["/var/www/straped/mufon/html2text/2637.html.txt","/var/www/straped/mufon/org/2637.html"],"Viewing Distance":"Over One Mile","Sighting Duration":"00:00:59","Longitude":"-76.702448"}