{"trends":["There have been 2 other sightings in Santa Rosa Beach","There were no other sightings in Santa Rosa Beach on or around November 3rd 2010"],"Object Shape":"Boomerang","Viewing Distance":"Unknown","Date Submitted":"11/05/2010 06:11 UTC","Source":"MUFON","Log Number":"US-11052010-0014","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Longitude":"-86.227192","Summary":"My 18 yr old son and I saw a giant \"V\" or boomerang shaped object fly silently over our heads from West to East","map":"<A HREF = \"http://maps.google.com/maps?q=30.398332,+-86.227192(26386)&iwloc=A&hl=en\"> mufon case (26386) map </A>","Object Features":"Other","Date of the Event":"11/03/2010 10:50 UTC","Weather Factors":"Unknown","Latitude":"30.398332","files":["/var/www/straped/mufon/html2text/26386.html.txt","/var/www/straped/mufon/org/26386.html"],"City":"Santa Rosa Beach","Case Number":"26386","divs":["Sighting DetailsLast night, after picking my 18 yr old son up from work, we were walking in from the car and stopped on the path in the front yard to look at the stars and planets for a minute. I was pointing out to him how bright Venus is in the sky this time of year. While doing this, we suddenly noticed a very large object moving very fast from the West toward the East, almost directly over our heads. The object was a giant \"V\" shape (like a boomerang) and there were no lights on it. However, there were several (I think 5 or 7) large circular shaped parts on the underside of the object that we could clearly see which looked a little like like giant headlights that would shine straight down but that were not on. It proportion to the boomerang shaped object, the circular parts seemed to be rather large and take up a good portion of the width of each leg of the \"V\". It was dark and we could not see the color of the object nor what it was made out of. It didn't seem \"reflective\" or that it was made of metal or glass, but we couldn't be sure because it was so dark and it was fairly high in the sky. It was completely silent and it moved very fast but smoothly through the sky. It simply made a straight line path in its movement from the West toward the East- no turns that we could see. It seemed to be a consistent hight the whole time too- not moving any higher or lower as it moved along. It happened so quickly that all we could do was point at it with our mouths open and say, \"What in the world is that?\" Then it was out of our sight. We quickly went inside the house and then found out that we both saw the same exact thing. We both drew and described the same thing when we compared our perspectives on what we just saw. Unfortunatly, since we were walking in from the car, we didn't have a camera with us to film this. Also, it just happened so fast that I don't believe there would have been time to film it. We both felt very curious and a little excited. We both had a very hard time sleeping after that, but mostly , I just want to know if other people saw this object too. Is there anyone I can talk to about this?"],"Country":"United States","Disposition":"Unknown","Region":"Florida"}