{"Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"11/05/2010 05:45 UTC","Log Number":"US-11052010-0013","Latitude":"42.014671","City":"Park Ridge","divs":["Sighting DetailsI went out on my front porch for a cigarette before going to bed. I watched an airplane go by on the way to O'Hare airport traveling East to West.. Then I saw the blinking light coming toward me from the West. At first I thought it was an airplane since I live near the airport. It appeared to be moving about two to three times as fast as most of the airplanes I see flying around. I also thought that it was at a really high altitude, although at night it is hard to judge how close something might be. It was flying in a relatively straight line until it came close to passing overhead. At that point it began to make strange movements. It continued to move in the same general direction, but it would also slow to almost stopped and then speed up to where it would have been if it hadn't slowed down. It also made a quarter circle movement off it's flight path and then moved sideways back. Then it started weaving side to side and made other circular movements. By this point it had passed over head and was east of my house. It's blink rate changed for two cycles and then it changed course and made a more pronounced arc like movement and disappeared into the cloud cover. The entire time, I did not hear any noise from it. I fly model airplanes and helicopters, so I am familiar with the types of movements aircraft can make. I have never seen anything make the types of movements I witnessed as it passed over head. I went inside and checked the time. Then I went to bed. I hope someone can tell me if this strange event was just an atmospheric effect on a regular aircraft or something not known. I do not necessarily believe what I saw to be extraterrestrial, but it did not appear to be any aircraft I know of."],"Disposition":"IFO","Viewing Distance":"Unknown","Summary":"Single blinking light with eratic movements","Date of the Event":"11/05/2010 03:20 UTC","Region":"Illinois","trends":["There have been 4 other sightings in Park Ridge","There were no other sightings in Park Ridge on or around November 5th 2010"],"Source":"MUFON","Object Shape":"Other","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"26385","Longitude":"-87.832299","map":"<A HREF = \"http://maps.google.com/maps?q=42.014671,+-87.832299(26385)&iwloc=A&hl=en\"> mufon case (26385) map </A>","files":["/var/www/straped/mufon/html2text/26385.html.txt","/var/www/straped/mufon/org/26385.html"],"Tags":"City","Object Flight Path":"Path with directional change"}