{"Latitude":"44.985055","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.985055,+-93.254506(26382)&iwloc=A&hl=en\"> mufon case (26382) map </A>","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around November 5th 2010"],"Sighting Duration":"00:00:03","files":["/var/www/straped/mufon/html2text/26382.html.txt","/var/www/straped/mufon/org/26382.html"],"Weather Factors":"Unknown","Tags":"City","City":"Minneapolis","Region":"Minnesota","Summary":"one round bright flash of light lasted only a few seconds","Date of the Event":"11/05/2010 05:30 UTC","divs":["Sighting DetailsI was lying in bed and just looking out at the early morning sky, it was still dark and I could see a few stars. I noticed all of a sudden a small round bright light flash in the sky, it was little bigger than a star, at first I wasn't sure if there was an overcast and thought maybe it could be a light from a plane that briefly appeared through a cloud. But a few seconds later I notice another simliar one in a different area of the sky, not too far away from the first one. I got out of bed to take a closer look to see if there was an overcast sky but there wasn't, it was very clear. I wanted to sit and observe to see if I could see another one. I went briefly to talk to my daughter and just as I came back to sit down I saw a streak of what looked like a meteorite, it was so different from a shooting star and almost looked like it had a firey tail to it. I said OMG, three time because it looked so amazing to me. It was in the same vicinity as the two lights. It came sideways and thought it was strange the way it moved. If this makes sense the lights I had seen earlier were higher than this streak of light but all were in the same viewing area. I would like to mention that previously (not sure about how many months ago or the date) I had seen a similar round light that was much larger than the two I saw this morning, and was told that it could be a satellite. This was very similar to that one except it was much smaller. Both times I refer to it as if someone turned on a flashlight very high in the sky just for a moment and then turned it off. This is the best way I know of describing it."],"Disposition":"IFO","Viewing Distance":"Unknown","Object Shape":"Circle, Fireball, Other","Case Number":"26382","Longitude":"-93.254506","Log Number":"US-11052010-0010","Date Submitted":"11/05/2010 02:01 UTC","Object Features":"Unknown"}