{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"26398","Region":"Florida","Tags":"City","files":["/var/www/straped/mufon/html2text/26398.html.txt","/var/www/straped/mufon/org/26398.html"],"Object Flight Path":"Undisclosed","City":"Tallahassee","Weather Factors":"Unknown","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around October 31st 2010"],"Date of the Event":"10/31/2010 08:45 UTC","Log Number":"US-11062010-0008","Date Submitted":"11/06/2010 07:46 UTC","divs":["Sighting DetailsI was with some friends at an outdoor concert, while waiting for the main act to go on (i was getting bored) I was looking up at the sky and noticed a light way up above. The light was way too high to be an airplane (almost looked like a star) but it appeared to be moving so I quickly insisted that my friends look up as well. I've seen many shooting stars in my lifetime so I know when I see one- and this was definitely not a shooting star. Then came my friends hypotheses: \"Maybe its a plane\" one of them said, but there were no flashing lights and the white light was WAY too high up to be an airplane. As we continued to watch another friend suggested that it could possibly be a satellite. Only seconds after she said that the light suddenly dissapeared and then reappeared again, but this time going in the opposite direction. It went in the opposite direction until it reached the point that we first noticed it at and again dissapeared from view. I was very excited after seeing the object, but I wasn't suprised or scared. My friends seemed interested, and one of them slightly scared, but I assured them that there was nothing to be afraid of and that if what we saw was a \"UFO\" it is a good thing! :)"],"Summary":"circular light moving across sky, too high to be an airplane, not flashing, disappeared & reappeared in sight twice before switching directions and again disapearring from view","Object Shape":"Circle","Object Features":"Undisclosed","Country":"United States","Longitude":"-84.274033","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.444796,+-84.274033(26398)&iwloc=A&hl=en\"> mufon case (26398) map </A>","Source":"MUFON","Latitude":"30.444796"}