{"Tags":"City","Country":"United States","Date Submitted":"11/06/2010 04:21 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailsi was sitting with my kids and we were watching tv,and my wife came in and said \"*(wit's name deleted--cms\\sg) come and see this\"! i was like \"what\"! she said \"theres a ufo in the sky\"! so i grabbed my video cam and came outside and was kinda shocked at what i was looking at it was red then changed to orange it kinda looked like a orb so i began to film it.it was kind of starlike at times and was quiet and made no noise like a airplane would i did make reference to it being a flying saucer because when i was filming it to the naked eye it kind of looked like a saucer when it passed over us and the ground had a kind of wierd vibration and the dogs in my nieghborhood were all barking it was very strange.after the object passed i remember thinking wow!i felt like it was a gift to get to see somthing like this and to film it was a plus! thank you *(wit's name deleted--cms\\sg) *(link moved to additional evidence section--cms\\sg)"],"Weather Factors":"None","Log Number":"US-11062010-0003","Date of the Event":"10/30/2010 09:25 UTC","Object Shape":"Circle, Diamond, Fireball, Flash, Star-like, Other","Latitude":"39.087081","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","trends":["There have been 7 other sightings in Covington","There were no other sightings in Covington on or around October 30th 2010"],"City":"Covington","files":["/var/www/straped/mufon/html2text/26393.html.txt","/var/www/straped/mufon/org/26393.html"],"Disposition":"Unknown","Case Number":"26393","Summary":"It was a reddish Orange star looking object that was moving fast.","Longitude":"-84.500074","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.087081,+-84.500074(26393)&iwloc=A&hl=en\"> mufon case (26393) map </A>","Region":"Kentucky","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Other"}