{"Viewing Distance":"Unknown","Date of the Event":"11/06/2010 10:05 UTC","Latitude":"43.623822","Object Features":"Unknown","Tags":"City","Country":"United States","City":"Midland","files":["/var/www/straped/mufon/html2text/26405.html.txt","/var/www/straped/mufon/more/26405_submitter_file1__Pattern.png","/var/www/straped/mufon/org/26405.html"],"Summary":"Three \"shooting-star\" like things, weaving in and out with each other, fading in and out at regular intervals","Weather Factors":"None","Case Number":"26405","Object Flight Path":"Path with directional change,Other","Log Number":"US-11062010-0015","Source":"MUFON","Sighting Duration":"00:00:20","Object Shape":"Bullet, Missile, Star-like","Region":"Michigan","trends":["There have been 10 other sightings in Midland","There were no other sightings in Midland on or around November 6th 2010","This sighting has never been favorited.",""],"Date Submitted":"11/06/2010 11:17 UTC","divs":["Sighting DetailsMy mom and I were on our way home from a party at my grandparents' house. We were about 5 minutes away from our exit, and I saw something out the right side car window. I thought I was just seeing things... but I wasn't. There were three star-like, small, things, that would fade in and out at a regular half-second or so interval. They wove in and out with each other, too. I made quite sure that it was not a reflection. I checked many times. After concluding that I was actually seeing something, I just watched in disbelief. It only lasted about 15-20 seconds, and when it disappeared, it faded out and didn't come back. After it was gone, I felt a jittery kind of fear, like when you feel an unwanted presence. Now, I didn't actually FEEL any presence, but it was just that sort of fear. The teary, creepy, jumpy kind of fear, with adrenaline. The picture attached is an example of how these things were weaving. They were moving from left to right(relatively)."],"Longitude":"-84.244352","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.623822,+-84.244352(26405)&iwloc=A&hl=en\"> mufon case (26405) map </A>"}