{"map":"<A HREF = \"http://maps.google.com/maps?q=36.06252,+-86.662802(26400)&iwloc=A&hl=en\"> mufon case (26400) map </A>","City":"Antioch","Region":"Tennessee","Log Number":"US-11062010-0010","Tags":"City","Object Features":"Unknown","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI answered the door to find someone there who was trying to sell me a new roof. I looked out over his shoulder to the southeast, and there was a swath of light...I told the guy to look at it, and he said \"Wow, I guess we should watch the news tonight\". It was shaped somewhat like a paint swath, wider than any contrail I have ever seen. For a second or two, I thought it might be a meteorite, but it was awfully wide...say as wide as your thumb would be at arm's length. Immediately it was clear that it was not an aircraft, no contrail, nothing, and moving very fast. It was about 30 degrees above the horizon when I first sighted it, and I watched for about 30 seconds, then turned to go get my camera. By the time I got back, it was gone. I have no idea whether there are any satellites in this area or not...or what they would look like. It was not yet beginning to get dark, so I know it wasn't a star; anyway, it was moving! So if anybody out there knows how to check whether we had a satellite passing over the southeast of Antioch, I would appreaciate that info! When first sighted, it was about 25 degrees above the horizon..."],"Date Submitted":"11/06/2010 08:00 UTC","Object Flight Path":"Straight-line path","Summary":"2 minute sighting of light in the sky","trends":["There have been 6 other sightings in Antioch","There were no other sightings in Antioch on or around November 6th 2010"],"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"36.06252","Object Shape":"Other","Date of the Event":"11/06/2010 04:58 UTC","Case Number":"26400","Longitude":"-86.662802","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/26400.html.txt","/var/www/straped/mufon/org/26400.html"],"Disposition":"Unknown"}