{"Longitude":"-4.307031","Case Number":"26407","Source":"MUFON","Object Flight Path":"Hovering then path","City":"Carmarthen","Country":"United Kingdom","Date Submitted":"11/07/2010 02:30 UTC","Disposition":"Unresolved","Latitude":"51.86607","Object Shape":"Disc","Tags":"City","Log Number":"GB-11072010-0002","divs":["sighting detailsi am reporting this incident for the witness who wishes to remain anonymous at this time. i received several photos taken in rural carmarthenshire, wales, uk near carmarthen on november 5, 2010 around 7 pm local time. the witness noticed the object rise from behind a hill at a distance of approx. 1\\2 mile. the ufo hovered for about a minute then continued to rise until it was out of sight. it was described as disc shaped with red lights. the photo was taken with a cell phone. after talking to the witness, i estimate this object was at least 150 ft. across...possibly up to 200 ft. as you can see in the photo, the object seems to have structures on it. there have been a few unusual sightings in this specific area recently. the witness has asked me not to disclose further location information. i realize the this was guy fawkes night in the united kingdom and that there are traditionally fireworks and bonfires...but the witness is very reliable. at this time, the images will be posted at *(link moved to additional evidence sectio--cms\\sg). under copyright"],"Date of the Event":"11/05/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/26407.html.txt","/var/www/straped/mufon/org/26407.html"],"Region":"Wales","trends":["There has been one other sighting in Carmarthen","There were no other sightings in Carmarthen on or around November 5th 2010"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=51.86607,+-4.307031(26407)&iwloc=A&hl=en\"> mufon case (26407) map </A>","Object Features":"Appendage(s), Other","Summary":"Large disc shaped object with red and white lights and structure","Weather Factors":"None"}