{"Object Shape":"Sphere","Sighting Duration":"Undisclosed","City":"Austin","Weather Factors":"Unknown","Country":"United States","Summary":"Bright object in the sky looked through a telescope, saw multiple orbs","Date of the Event":"10/16/2010 05:09 UTC","Object Flight Path":"Unknown","Log Number":"US-11072010-0003","Viewing Distance":"Over One Mile","Tags":"City","Longitude":"-97.741471","Disposition":"Insufficient Data","Latitude":"30.275933","files":["/var/www/straped/mufon/html2text/26408.html.txt","/var/www/straped/mufon/more/26408_submitter_file1__photo-3.jpg","/var/www/straped/mufon/more/26408_submitter_file2__photo-1.JPG","/var/www/straped/mufon/more/26408_submitter_file3__photo.JPG","/var/www/straped/mufon/org/26408.html"],"divs":["sighting detailsi saw a flash in the sky. looked up, and saw a solid bright object. i called for my friend and had him look at it. the object was a solid bright object in the clear sky. i went to grab my camera, nikon d-90 w\\ 18-200mm lens, iphone, ipad and my celestron nexstar 60 slt telescope. we looked at it through the camera, looks like a solid bright object. i used my iphone 4 and ipad wifi and opened up starmappro and star walk. looked at the start map and location, there isn't suppose to be anything there. i can clearly see the moon to my right. it was not jupiter either. my friend tried to take pictures with the iphone 4 and the d90, didn't come out that well. the object was very hard to see, i kept losing track of it. i setup the telescope, with 35mm, 25mm, 9mm and 6mm lens. when i looked through the telescope and focused, i saw multiple orbs hovering and orbiting each other. i tried to count, lost count after 9. they kept moving around each other making it hard to keep counting. i had my friend look through the telescope, total he had about 2-3 min looking through the telescope, i had over 5 min looking through the telescope. we both saw multiple orbs. i tried to kept track of it switching out lens and making sure it wasn't just the lenses. the telescope got bumped when i had it on 6mm and we both lost track of it. the objects was in the direction of east and heading below our horizon while the moon and jupiter was far right of the objects and rising. the orbs were solid glowing uniformly, didn't see any shadows, orbiting each other like you would see an animated atom with electrons moving around the a nucleus."],"Object Features":"None","Region":"Texas","Date Submitted":"11/07/2010 02:49 UTC","Case Number":"26408","map":"<A HREF = \"http://maps.google.com/maps?q=30.275933,+-97.741471(26408)&iwloc=A&hl=en\"> mufon case (26408) map </A>","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around October 16th 2010","This sighting has never been favorited.",""],"Source":"MUFON"}