{"Date Submitted":"11/07/2010 10:11 UTC","Log Number":"US-11072010-0005","Date of the Event":"11/03/2010 11:40 UTC","Disposition":"Unknown","Latitude":"44.941835","Viewing Distance":"Unknown","City":"Chippewa Falls","Tags":"City","Case Number":"26410","map":"<A HREF = \"http://maps.google.com/maps?q=44.941835,+-91.384335(26410)&iwloc=A&hl=en\"> mufon case (26410) map </A>","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/26410.html.txt","/var/www/straped/mufon/org/26410.html"],"Longitude":"-91.384335","Country":"United States","trends":["There have been 5 other sightings in Chippewa Falls","There were no other sightings in Chippewa Falls on or around November 3rd 2010"],"Source":"MUFON","Sighting Duration":"00:00:04","Summary":"About six red lights in triangular formation, twice the relative size of the Pleiades, overflew me at a great altitude in an easterly direction.","Weather Factors":"None","Object Flight Path":"Straight-line path","Region":"Wisconsin","Object Features":"None","divs":["sighting detailson the evening of nov. 3, 2010 at around 11:40 i went outside to sit on my back porch and smoke a cigarette. i was sitting and reclining on my bench looking up at the sky, which was entirely clear that night. my backyard is obscured from surrounding streetlights by homes and garages and has great visibility at night, so i was looking up at the stars when a strange triangular formation of red lights entered my field of vision at about 90 degrees elevation. for the first instant i believed it was a meteor, before i focused on the object(s) and realized that there were at least six lights travelling in a fixed formation. the lights had no apparent disc, although they were fairly bright. they were around the same magnitude of brightness as an average star, but distinctly red in color. the formation was an elongated triangle and travelled close to due east for about four seconds before fading out at around 45 degrees elevation, before reaching the lower limit of my field of vision (the top of my neighbor's garage). the object(s) passed a few degrees to the north of the pleiades, which allowed me to judge its relative size to be about twice that of the constellation. it did not appear to me as if the space between the lights obscured any stars as it passed, so i believe the lights to have been discreet separate objects travelling in formation rather than lights attached to a single object. also, there was no sound at all from the objects. i had the impression that they were flying at extraordinary altitude, probably beyond the atmoshpere. i was startled and and somewhat spooked by the incident and remained outdoors for a few minutes after the sighting, waiting to see if the lights would return or anything else would appear. when i returned indoors and looked at the time it was 11:50 pm. i have no idea if this will stay formatted, but i'll attempt to \"draw\" the formation the way it appeared to me from the ground with an arrow indicating it's direction of motion. . . . . . . || || \\\\ east"]}