{"files":["/var/www/straped/mufon/html2text/26412.html.txt","/var/www/straped/mufon/org/26412.html"],"Region":"New Jersey","Date Submitted":"11/07/2010 03:48 UTC","Summary":"Blue/Green Cylinder accompained by large Triangle Object","Object Shape":"Cylinder, Triangle","Country":"United States","Disposition":"Unknown","Weather Factors":"Does Not Apply","Sighting Duration":"00:10:00","Viewing Distance":"Over One Mile","City":"Hawthorne","Tags":"City","Source":"MUFON","Object Features":"None","Longitude":"-74.153755","map":"<A HREF = \"http://maps.google.com/maps?q=40.949265,+-74.153755(26412)&iwloc=A&hl=en\"> mufon case (26412) map </A>","divs":["sighting detailsit was around 12:30am when i left my friend's house in hawthorne. as i was walking to my car a blue\\green object in the sky caught my attention. the sky was very cloudy and you couldn't see any other stars, planes, the moon. at first i thought it was a star or maybe a planet like venus or mars but then i realized it was way too cloudy and also the object was giving off an aura. it looked like it could of be a cylinder shape and when i looked closely with my eyes it also looked like it had a red light in the center of it and i could cover it with a penny at arm's length. i quickly jumped into my car and sped off, the object at the time was on my right side. as i was driving down wagaraw blvd at the gas station and stop light i noticed the object was on my left now and straight ahead in the distance i saw 3 amber lights dimming in and out in the outline of a triangle. i started to panic and said to myself it's just street lights but then i realized it was way too high in the sky to be street lights and there's no mountains or hills in that direction. i sped off into the prospect park area, when i turned down a street that i normally take to go home i saw in the distance in front that the blue\\green object was next to the triangle object (this time the blue\\green object was much smaller like how an airplane would look like up in the sky, like a good 300 feet away from it and the triangle's amber lights were dimming in and out like it was communicating to the blue\\green object. again i start panicking, as i was driving down haledon ave i can see the objects still but once i got into town, the trees, lights, and buildings blocked my view and that was the last i saw of the two them. from the position and area they were, it looked like they could of been above the north haledon reservoir or wanaque (but my guess is wananque because of how smaller the blue\\green object had gotten). once i got outside of my house i ran out of the car into my house panicking, i couldn't sleep the rest of the night. i had so many opportunities to snap photos and video with my phone but i was too terrified to too."],"trends":["There has been one other sighting in Hawthorne","There were no other sightings in Hawthorne on or around November 6th 2010"],"Case Number":"26412","Date of the Event":"11/06/2010 01:00 UTC","Latitude":"40.949265","Object Flight Path":"Stationary","Log Number":"US-11072010-0007"}