{"Log Number":"US-11082010-0005","files":["/var/www/straped/mufon/html2text/26425.html.txt","/var/www/straped/mufon/org/26425.html"],"trends":["There have been 3 other sightings in Boonville","There were no other sightings in Boonville on or around November 8th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.053883,+-87.265042(26425)&iwloc=A&hl=en\"> mufon case (26425) map </A>","divs":["Sighting DetailsI work as a security officer a few miles outside of Boonville, IN. While on duty tonight I looked out my passenger side window and noticed a bright light in the sky (to the west). At first I assumed it to be a star or planet, but it was extremely bright. I watched the light for several minutes and it appeared to be moving, but because of the distance and lack of noticable landmark's it was hard to tell. I took out my camcorder and tried to record the light but because of bright lights where I am I couldn't get anything to show up, as the light was very small from where I was. I eventually moved the car closer to the road away from the lights and tried again, and was eventually able to get some video of the light but because of zoom and the time of day there are issues with focus at times and the video is pretty jerky. After recording about 3 minutes of video the camcorder battery was low so I put it back down in the glove box and when I looked back to keep watching the object, it was gone. It was at this point that I knew for sure it could not have been a star. I looked away for a few more seconds and when I looked back it was again in roughly the same spot. This occured 2 more times while I was watching. During the several minutes I watched it it did not appear to make any major moves in position. I'd say it was maybe 15-20 deg. off the horizon. There is a tree line, but since it was dark I couldn't get a good idea of relative position or height. The light was a bright white, and looked to phase to a more reddish light later on. After watching 10-15 minutes the light appeared to be moving lower on the horizon, and eventually it sank below the tree line. I believe I could still see it very low through the trees for another few seconds but eventually I lost total view of it. I continued looking for a few more minutes but never saw it reappear, so I left here to go make my rounds."],"Tags":"City","Region":"Indiana","Object Features":"Undisclosed","Summary":"Bright light in sky to the west","Country":"United States","Object Shape":"Star-like","Date of the Event":"11/08/2010 01:30 UTC","City":"Boonville","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Weather Factors":"None","Latitude":"38.053883","Source":"MUFON","Case Number":"26425","Disposition":"IFO","Viewing Distance":"Unknown","Longitude":"-87.265042","Date Submitted":"11/08/2010 04:46 UTC"}