{"Longitude":"-121.797033","Object Shape":"Other","Source":"MUFON","Country":"United States","Date of the Event":"03/31/1987 02:00 UTC","Disposition":"Insufficient Data","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.693043,+-121.797033(2642)&iwloc=A&hl=en\"> mufon case (2642) map </A>","Viewing Distance":"Unknown","Sighting Duration":"00:30:00","Weather Factors":"Unknown","Log Number":"","files":["/var/www/straped/mufon/html2text/2642.html.txt","/var/www/straped/mufon/org/2642.html"],"Tags":"City","trends":["There have been 5 other sightings in Marina","There were no other sightings in Marina on or around March 31st 1987"],"City":"Marina","Object Flight Path":"Unknown","Object Features":"Undisclosed","Case Number":"2642","Latitude":"36.693043","divs":["Sighting DetailsOn my way home, riding a motorcycle, to Seaside from work in Sunnyvalesouthbound on SR1 and having just left Castroville, I saw an occasional flickerjust on the edge of my helmet visor which I thought was just a diffractedterrestrial light. It persisted flickering several times and seemed to come fromthe same apparent direction though I had changed direction following SR1. Ilooked up and saw a vaguely dark object with orange and green flickers of light.I exited at Del Monte Blvd after crossing the Salinas River and looked up at theobject and saw a black object, rock-like, round with rounded ends and pinched inthe middle in the sky about 70 degrees above the horizon, south-southwest of mylocation, or, from my location at the onramp to southbound SR1, in the directionof the water tower at Fritzsche Field at Fort Ord. The object was stationary,pointed down at approx 45 degrees and appeared to be aligned in a north-southdirection. The object was emitting sheets of deep green and orange flame fromthe front and sides and smaller jets of yellow, red, red-orange and blue flameoccasionally from all parts. There appeared to be a faint trail of gray smoke orcloud behind it, or going out the end farthest from me, which faded outcompletely about one of the objects length behind. There were amber sparksemitted a couple times which faded out before going past the object. The flamesand sparks moved back across the object, or, away from me and my viewingperspective. The object was much blacker than the night sky and could clearly beseen against stars to the southwest of the Milky Way. There appeared to be somelight reflected from parts of the object, too, which made it possible to see anapparent crater on the far side of the waist in its middle. The moon was notvisible but I recall thinking that the moon might be in a position over thehorizon to the east to reflect light on the object.I watched the object for at least 20 minutes, and it appeared to move veryslowly relative to the stars but appeared not to move at all relative tolandmarks. The object did not appear to spin or rotate in any manner. I wenthome when it got too cold and watching the object made my neck sore.The month given is approximate. I do not recall the exact date and notes of theevent were lost or destroyed. The time is approximate I recall checking my watchand was concerned at how long I was there.I inquired of FAA and local news about the object. They were interested ingetting off the phone as qui"],"Date Submitted":"03/31/1987 02:00 UTC","Summary":"A Stationary black rock"}