{"Date of the Event":"11/07/2010 07:30 UTC","Summary":"A bright starlike object moved across the night sky, changed direction suddenly then disappeared","Country":"United States","City":"Blairsville","Region":"Georgia","trends":["There have been 6 other sightings in Blairsville","There were no other sightings in Blairsville on or around November 7th 2010"],"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/26433.html.txt","/var/www/straped/mufon/org/26433.html"],"Sighting Duration":"00:00:20","Object Features":"None","Date Submitted":"11/08/2010 11:03 UTC","Log Number":"US-11082010-0013","Longitude":"-83.951901","Source":"MUFON","Latitude":"34.884799","Case Number":"26433","divs":["sighting detailssunday evening 11\\7\\10 at 7:30 i was in my driveway loading trash in my truck.it was a nice clear night for stargazing,so i stopped what i was doing to look at the stars. as i stood there looking up i noticed an airplane moving directly over my house. there was nothing unusual about the airplane it looked like any other plane flying at night, cruising at normal speed and altitude with blue and red strobe lights. as i continued to watch the plane i noticed movement out of the corner of my eye.i looked to my right and saw what was the brightest object in the sky, and it was moving. the fantastic part was i was able to look back at the airplane then back to the object and compare the two and after doing this several times it was easy to rule out just another airplane. they were not alike. there were no flashing lights, no sound, it was just very bright. the object then changed direction too quickly to be a plane.as soon as it changed direction, my heart started pounding in my chest and i felt very anxious. after watching this for about 20 seconds it suddenly got half as bright then turned into a pinprick of light and was gone. going from the brightest thing in the sky to disappering took about 2-3 seconds. my heart was racing and i started to sweat even though it was a cold night, because i know i saw something unusual.i dont know what i saw but i do know that it wasn't an airplane, helicopter, sattelite, meteor, reflections, swamp gas, space station,or hallucination.it was going north towards murphy, north carolina when it finally vanished.i am not ashamed or embarressed to report what i saw. please let me know if anyone else saw what i saw, it would be nice to hear about other witnesses."],"Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Weather Factors":"None","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.884799,+-83.951901(26433)&iwloc=A&hl=en\"> mufon case (26433) map </A>"}