{"Longitude":"-83.270285","Source":"MUFON","Object Shape":"Blimp, Disc, Oval, Sphere","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Unknown","Log Number":"US-11082010-0012","Sighting Duration":"Undisclosed","Latitude":"30.835332","Country":"United States","Region":"Georgia","Date Submitted":"11/08/2010 10:52 UTC","divs":["Sighting DetailsI am a retired corrections officer. I was sitting in my kitchen in the early afternoon looking out the door when I saw a whiteish colored object rise up from the tree line at a forty-five degree angle, it was moving from my right to left. I first thought it was a large balloon until it stopped and changed directions. As it moved from my left to right, I thopught maybe a plane, since I live near Moody Air Force Base and a municipal air port. However, when it stopped and remained motionless for about a half a minute, I decided that I didn't know what it was. I called my wife from the house and she and I watched the object moving around the sky for nearly fifteen minutes. first it would go up, then down, then side to side. All the while it appeared to be pulsing from white to silver. In the silver phase it almost appeared to vanish. I went in to get a camera and when I returned I took three photos and several seconds of video. Later when I looked at the pictures I was surprised to see that I had actually caught the object in one photo and the video, surprised because I could not see the object in the veiw screen when I took them.when I looked back up from the camera the object was gone. I don't know if it simply moved from my field of veiw or if it streaked away. this is not the first time I have seen an unusual sight in the sky. photo 091 shows the object in the upper left corner of the cloud. photo 093 was taken within seconds of the first one... no object. the vide shows a bird flying from right to left and the object from left to right in the right hand corner of the frame."],"Weather Factors":"Unknown","Disposition":"Unknown","Viewing Distance":"Unknown","trends":["There have been 6 other sightings in Valdosta","There were no other sightings in Valdosta on or around September 9th 2010","This sighting has never been favorited.",""],"Date of the Event":"09/09/2010 12:00 UTC","Tags":"City","Case Number":"26432","City":"Valdosta","Summary":"looking out the door, I saw an object in the distance. my wife and I watched for several minutes as it pulsed from white to silver","files":["/var/www/straped/mufon/html2text/26432.html.txt","/var/www/straped/mufon/more/26432_submitter_file2__091.JPG","/var/www/straped/mufon/more/26432_submitter_file3__093.JPG","/var/www/straped/mufon/org/26432.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.835332,+-83.270285(26432)&iwloc=A&hl=en\"> mufon case (26432) map </A>"}