{"Country":"United States","Object Flight Path":"Undisclosed","divs":["sighting detailsaustin tx. oct. 30 2010 4:45 pm. very clear sky a few high cirrus clouds.location: larmar st.\\airport blvd. notice a very bright dot in the sky 80 degree off of horizon toward the east. altitude very high in the sky( above airline traffic) object was blinking or tumbling moving toward the nne slowly very slowly. went out of sight. thirty min later at 5:20 pm in same general area of sky notice a nother object very bright in the sky moving alittle faster but still slow like drifting toward the nne. these were not planes or helicopter. i know what a plane looks like even at 30,000 feet.these were round dots in the sky like orbs i recorded the inguration and when they show bushes helicopter leaving you can see a black stealth(something)plane come in and out of the clouds but there is no noise of a plane also when they show a recording of when reagan in his helicopter you can see disk shap objects in the back ground following him, i recorded the cbs station so i don't have the cnn portion. but it is very interesting. i just wonder what they know that they won't tell us. maybe we don't need to know ( my opinion )"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.272433,+-97.740741(26435)&iwloc=A&hl=en\"> mufon case (26435) map </A>","Longitude":"-97.740741","Weather Factors":"Unknown","Date of the Event":"10/30/2010 04:45 UTC","Case Number":"26435","Log Number":"US-11082010-0015","Object Features":"Undisclosed","Date Submitted":"11/08/2010 12:37 UTC","Source":"MUFON","Region":"Texas","Summary":"blinking dot in sky daylight sighting","Viewing Distance":"Unknown","City":"Austin","files":["/var/www/straped/mufon/html2text/26435.html.txt","/var/www/straped/mufon/org/26435.html"],"Tags":"City","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around October 30th 2010"],"Object Shape":"Saturn-like, Sphere, Star-like","Latitude":"30.272433"}