{"Object Flight Path":"Hovering then path","Disposition":"Unknown","Latitude":"34.548254","divs":["Sighting DetailsMy husband and I had just left Prescott adult library. There is a large hill that overlooks the Prescott sewage treatment plant, going East. We had reached the top of that hill when a shiny object in the sky caught our attention. Immediately we recognized that it was not moving, except for an in place rotation. There was no question that it was not conventional. The rotation was actually quite slow, with the suns reflection blinding us as the object rotated. From the rotation, it appeared to us, to have presented its frontal part to us, dipped down at us. Then rotated the frontal part up and to the East. Rotating at a 60 to 70 degree angle up and to the East. The object then made a medium speed get away for about a half mile. With two military jets closing in from the North and South, the object then disappeared in front of us. There were no clouds in the sky to obstruct our view. I could not reference a shape from my vantage point, however my husband described the shape as an outline of a triangle, only in that the outer 3 spokes would have formed that. The spokes, he said stood out from the main part of the vessel. The object once again....standing still except for a slow rotation up and to the East. I saw some sort of residual trail. My husband did not recall any trail. We both agree that there was no noise at all."],"Object Shape":"Triangle","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Appendage(s), Unknown","Region":"Arizona","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.548254,+-112.462572(26436)&iwloc=A&hl=en\"> mufon case (26436) map </A>","Source":"MUFON","City":"Prescott","Date Submitted":"11/08/2010 12:59 UTC","Summary":"No clouds/2 to 3 thousand feet/Three pronged triangle, rotated in place/military jets closing in.","Case Number":"26436","Date of the Event":"11/08/2010 04:25 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/26436.html.txt","/var/www/straped/mufon/org/26436.html"],"Longitude":"-112.462572","trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around November 8th 2010"],"Log Number":"US-11082010-0016"}