{"Disposition":"Unknown","Country":"United States","Case Number":"26431","Summary":"HUNDREDS of UFOs in the night sky! All different types!","Region":"Nebraska","Log Number":"US-11082010-0011","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Latitude":"41.734286","Object Shape":"Circle, Diamond, Disc, Fireball, Flash, Sphere, Star-like, Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.734286,+-96.5054(26431)&iwloc=A&hl=en\"> mufon case (26431) map </A>","Date Submitted":"11/08/2010 09:25 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26431.html.txt","/var/www/straped/mufon/org/26431.html"],"Object Features":"Wings, Other","Weather Factors":"None","Tags":"City","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","trends":["There have been no other sightings in Uehling","This sighting has never been favorited."],"divs":["sighting detailsso i had reported a ufo sighting for my sister about 3 weeks ago. i hadn't seen it myself. it was a day-time ufo & she was very convinced in what she saw. so, naturally this piqued my interest, and decided to take it upon myself to do a little ufo hunting of my own. almost every night since then (and even during the day) i would check the skies. standing out there from anywhere between an hour or two hours. i saw a few things that i thought were 'strange' but was still on the fence about it. until last night. i was at my sisters and we decided to go outside and see if we could see anything. and almost immediately after we started looking at the skies, it began. i remember standing there and exclaimed, \"omg! look over there! wait, look over there! wait! look over there! they are everywhere!\" sounds comical, i know. if you were there watching us and not the sky, you'd be laughing at us. but if you were watching the sky, you'd have been freaking out too! at first it was just the flashing lights all over. glittering the sky. very similar to planes, but these were no planes. many of them hovered in one spot. some of them moved around slowly in strange patterns. but they were popping up everywhere. they were all over the place. you'd see one and then you'd see a dozen more popping up all over the sky. and then there were these strange twinkling stars. or at least we thought they were stars. until they, too, started moving. and around them you could see 'shooting stars'. if all that wasn't incredible enough, what we were about to see was mind-boggling. there was a glowing mist in the distance. it wasn't too far from us. if we ran for only a few minutes, we could have reached it. at first we thought maybe it was just a fog and the light was catching it in a strange way. until we started seeing huge transluscent things flying in it. several of them. 2 or 3. they were enormous. they were close to the ground. they were only partially visible. they looks like ghosts in the sky. that's really the only way to describe it. it was the freakiest thing i'd ever seen in my life. my sister and i were screaming in terror and excitement. they did there circling dance for about 15-20 minutes. it was almost as if they were putting on a show just for us. it certainly felt that way. and then one of them must have shot up way high in the sky. it was no longer a shadowy\\transluscent ufo. it was saucer-shaped, glowing, and very solid-looking. and it darted to the left, southward. like it was going to land! and almost before it reached the ground (which had to have been over the town park) it just vanished. so weird. naturally, we were really freaking out and couldn't stand anymore. too excited. too overwhelmed. i mean, it was life changing. i'd never seen anything like this before. i'd always believed. and i'd watched youtube videos, but until you see something like this with your own two eyes... it's not the same. but things didn't end then. we were sitting down and then we saw an unblinking set of lights. light five lights. it was no plane. like i said, unblinking lights. it was like triangular\\pyramid shaped. it was so hard to tell, because it almost seemed as if it were shap-shifting. and it just flew across the sky, slowly, spinning. sometimes hovering. floating. these sightings lasted for about 2-3 hours before they started to slow down. it was amazing. if you're a skeptic, my advice is go outside. know that you're going to see something. because you will."],"City":"Uehling","Longitude":"-96.5054","Date of the Event":"11/07/2010 10:00 UTC"}