{"divs":["Sighting DetailsVery warm summer or autumn night, approx 2230. The sky is very smoggy, so thatcommercial aircraft from San Jose Airport enroute to Los Angeles cannot be seen,though they can be heard. Typical aircraft on this route includes Boeing 737with the very loud Rolls-Royce turbines and Douglas DC7 triple-engine jet.Out in the front yard, looking at the sky to try to see what aircraft are upthere and trying to find the aircraft I had heard just before and see ninebright pinpoint lights of a deep, sodium-orange color, in a triple-triangleformation come slowly from the southeast. They must have been low, because theycould be seen through the smog, where any aircraft could not. They moved veryslowly northwest. They did not move relative to each other and did not appear tobank or change altitude. There was no sound at all from the lights, though Icould hear a 737 far to the north climbing and turning south and another jet tothe northwest. I also heard a small plane go north from Reid-Hillview approx 30minutes prior to seeing the orange lights. Otherwise, it was quiet. Even thedistant freeway was silent on this night.I assumed at first that the lights belonged to a small aircraft but there was noengine noise and there was no traffic at all at nearby Reid-Hillview airport atthe time. THe objects were also not headed toward the airport and were not onany usual flight path taken by any aircraft. Then I thought that perhaps theybelonged to one or more of the new SR-12 spyplanes but they remained absolutelyfixed in position relative to each other and proceeded in a perfectly straightline as they passed overhead. Any aircraft in the area would have had to usenavigation lights, being so near two airports but there were no navigationlights at all.The lights were arrayed in the vertices of three equilateral triangles which inturn formed the vertices of one larger equilateral triangle three times the sizeof the three triangles.I specifically looked for signs that they moved relative to each other, to tryto find out if it was a formation of aircraft but they did not move.There was no wind on the ground that I could tell. But I was on the lee side ofthe house and would not have noticed a breeze. The prevailing wind in this areais from the North-Northwest, which is the direction the objects were goingtoward.I continued to watch the lights until they were no longer visible through thesmog. The total arc during which they were visible was approx. 90 degrees. Ittook a long time for the objects to traverse that arc.There is no selection to indicate smoggy sky conditi"],"Region":"California","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Country":"United States","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=37.341736,+-121.893306(2643)&iwloc=A&hl=en\"> mufon case (2643) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/2643.html.txt","/var/www/straped/mufon/org/2643.html"],"Object Shape":"Other","Object Features":"Undisclosed","Log Number":"","City":"San Jose","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around November 30th 1973"],"Weather Factors":"Unknown","Longitude":"-121.893306","Summary":"triple triangle made of orange lights","Date of the Event":"11/30/1973 12:00 UTC","Latitude":"37.341736","Source":"MUFON","Date Submitted":"11/30/1973 12:00 UTC","Sighting Duration":"01:00:00","Case Number":"2643"}