{"Viewing Distance":"Unknown","Object Shape":"Triangle","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around October 24th 2010","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Country":"United States","Log Number":"US-11082010-0014","Tags":"City","Date of the Event":"10/24/2010 12:00 UTC","divs":["sighting detailsaround 4pm on sunday october 24, 2010 i was at a friends house on the northwest side of chicago near ohare airport we were watching nfl games. i went on the back deck to enjoy the day when i looked up and directly south and saw a dark silver sphere ufo pass from west to east at fast pace. it had no wings and made no noise but darted across the sky. i have been seeing this phenomenon a lot for over a year now and i knew that once i saw one there should be another ufo shortly after. i went inside and grabbed my friends wife's sony hdr-sr12 handy cam and waited. a few minutes later a black triangle appeared in the sky. it was floating west to east toward lake michigan. i turned on the handy cam and recorded about a minute and forty five seconds worth of this object. the triangle ufo appeared to be moving in place with the nose of the triangle pointing in various directions. the ufo also looked at one point to transform from a solid black triangle to a chevron shape. still while floating it appeared to produce a small straight \"banner\" looking appendage or something that came out of the bottom of the craft. the objected continued to float east until it vanished from sight. i tried to run out to the front of the house to try and keep recording but it disappeared. i will try and upload the video to mufon but when i try and watch other video reports on mufon the video does not play. if you search chicago november 2010 ufo on you tube you should be able to see what i captured. it has been over a year now that i have been seeing and recording anomalous objects in the chicago sky but this is the first time i was able to record a daytime solid black triangle ufo. not a balloon not a kite a lot smaller than a regional jet that i also recorded in my video to give comparison to the ufo triangle. here is the link to the video. thanks for reading. *(link moved to additional evidence section--cms\\sg)."],"Latitude":"41.879324","Region":"Illinois","Sighting Duration":"Undisclosed","Date Submitted":"11/08/2010 12:19 UTC","Case Number":"26434","Longitude":"-87.626628","Object Features":"Undisclosed","Disposition":"Hoax","Object Flight Path":"Undisclosed","City":"Chicago","Source":"MUFON","Summary":"Daytime Black Triangle UFO Hovers over Chicago - HD Video","map":"<A HREF = \"http://maps.google.com/maps?q=41.879324,+-87.626628(26434)&iwloc=A&hl=en\"> mufon case (26434) map </A>","files":["/var/www/straped/mufon/html2text/26434.html.txt","/var/www/straped/mufon/more/26434_submitter_file1__guttergawker_0003.jpg","/var/www/straped/mufon/more/26434_submitter_file2__youtube.com_guttergawker_0006.jpg","/var/www/straped/mufon/more/26434_submitter_file3__youtube.com_guttergawker_0007.jpg","/var/www/straped/mufon/org/26434.html"]}