{"Summary":"white cigar shaped object hovered over the hospital for 3 min (to my knowledge)","Weather Factors":"Windy, Light","Object Shape":"Cigar","Case Number":"26442","Date of the Event":"11/03/2010 12:00 UTC","Region":"Arkansas","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Flight Path":"Stationary","Tags":"City","Latitude":"36.06968","City":"Fayetteville","files":["/var/www/straped/mufon/html2text/26442.html.txt","/var/www/straped/mufon/org/26442.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"11/08/2010 05:36 UTC","Object Features":"Unknown","trends":["There have been 21 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around November 3rd 2010"],"Disposition":"Unknown","Country":"United States","Log Number":"US-11082010-0022","divs":["Sighting DetailsI was taking a delivery to Mana dr near the hospital. I was traveling down Bob Yunkin rd towards the south end of the hospital when I saw a white cylindrical object hovering about 60-100 feet over the hospital. At first I assumed that it was a helicopter or a plane but I decided to pull over to make sure. (when I pulled over I was just about on Appleby rd.) I studied the object for about 2 min. The object was white and cylindrical, it had discoloration like an off grey on both ends and a redish looking stipe in the middle, there were no wings,rutters, windows, tail sections, outboard engines, or any visible exhaust, nor did it make any sound. Having made the decision that I was not going to find out what this thing was I decided to go ahead and make my delivery. By the time I had reached Mana dr I had spent about 45 seconds- 1 min traveling when I stopped at my destination I looked where it had previously been and it was gone. I had decided that I would never see it again when (on my way into the building) I caught a glimse of it to the east atleast 30 miles away and a mile higher than before. PS. the object was about 30ft long and about 8-10ft wide."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.06968,+-94.150546(26442)&iwloc=A&hl=en\"> mufon case (26442) map </A>","Longitude":"-94.150546"}