{"Date Submitted":"11/08/2010 10:28 UTC","City":"Second Mesa","Longitude":"-110.5277","Tags":"City","Object Flight Path":"Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.843361,+-110.5277(26449)&iwloc=A&hl=en\"> mufon case (26449) map </A>","Date of the Event":"04/18/2010 12:00 UTC","Object Shape":"Disc","Object Features":"Unknown","Region":"Arizona","divs":["Sighting DetailsAfter visiting the Grand Canyon the day before, on April 18th on the way back to my son's home in Denver my wife wanted to go thru the Hopi Reservation. During the entire three day trip we would stop the car for me to get out and take pictures. I took hundreds but none like the ones attached to this email. I never saw the object and was not aware of the object in my picture until last week. After I got home I downloaded the pictures of the trip onto my computer where they will cycle thru as the screensaver flashes them up on the screen. It was one night when I had taken a break from my computer and the screen saver was cycling these particular pictures caught my eye. I had never notice the bright light in the center before. What you are seeing are two photos I took of the landscape one up close and the other a little further back. My camera is a Digital Cannon with a 12x telescopic lens. What caught my eye more than anything was the bright object had moved in relationship to the clouds. The two pictures were taken within seconds of eachother. In truth I have no idea what it is but several family and friends have told me to send it to you to see what you think. If you notice there was no sun that afternoon it was getting ready to storm and did later on in the day. The sky was black. No one, not my son, wife or grandchildren nor I saw any object in the sky that day but it is clearly there in the picture. I was outside the car heading north on the passenger side facing east when the pictures were taken. The sun would have been behind me if it was out but it wasn't. So I can tell you it was not a break in the clouds for the sun to poke thru nor is a reflection of any kind. However, the light was bright enough to cause a light ring in the camera lens as you can see. That ring is not on any other pictures ever taken with this camera. The camera was not moving because the rest of the picture is clear and steady. I do believe the slight light streak behind the object is the results of the object moving."],"Case Number":"26449","Country":"United States","trends":["There have been no other sightings in Second Mesa","This sighting has never been favorited."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/26449.html.txt","/var/www/straped/mufon/more/26449_submitter_file1__IMG_5764.JPG","/var/www/straped/mufon/more/26449_submitter_file2__IMG_5765.JPG","/var/www/straped/mufon/org/26449.html"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"bright light","Viewing Distance":"Unknown","Log Number":"US-11082010-0029","Latitude":"35.843361"}