{"Date Submitted":"11/08/2010 09:31 UTC","Object Flight Path":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/26446.html.txt","/var/www/straped/mufon/more/26446_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/26446.html"],"Date of the Event":"09/28/2010 02:15 UTC","Log Number":"US-11082010-0026","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.532813,+-122.986686(26446)&iwloc=A&hl=en\"> mufon case (26446) map </A>","trends":["There have been 8 other sightings in Hillsboro","There were no other sightings in Hillsboro on or around September 28th 2010","This sighting has never been favorited.",""],"Longitude":"-122.986686","Weather Factors":"Unknown","Object Shape":"Other","Object Features":"Undisclosed","Latitude":"45.532813","Disposition":"Hoax","Sighting Duration":"00:00:15","City":"Hillsboro","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsIt happened while I was standing in a large unplowed field in Hillsboro, near Highway 26. I had my camera out; I was about to photograph a row of trees because I liked the way they looked, and this craft came over the trees and I snapped the photo. I lowered the camera and the craft had shot straight up and all I saw was a sort of metallic flare on its edge from the sun as it disappeared. I didn't think I had the photo and I wasn't sure what I'd seen. I was in the process of moving the next week so I didn't get the film processed (it was a traditional film camera). I would guess this thing was at least fifty feet wide because the trees were between forty to fifty feet tall. I have no idea how high this craft was, but it traveled very fast and then almost stopped before it took off. I didn't see any windows or any sign of how it was propelled. It made no sound whatsoever until it shot up, and I didn't hear anything but the traffic on the freeway. There were no other witnesses as far as I know because the traffic was light and no one was in the field but me. It happened around the time of the Hillsboro air show, probably after the show at least by a week, but there were planes flying all over just a few days earlier if I recall, and a lot of them were military planes. I know that because they flew really low right over my apartment in Hillsboro every day for at least a week."],"Region":"Oregon","Case Number":"26446","Summary":"It came from the west over a row of trees near a residential area shot straight up."}