{"Disposition":"Unresolved","Sighting Duration":"00:00:01","Viewing Distance":"Unknown","City":"Ocoee","Longitude":"-81.534615","divs":["Sighting DetailsJust after sunset, sitting on the deck of a holiday house at Lake Bennett in Australia's (vast and sparsely populated) Northern Territory. I was taking some photographs of my family relaxing - I did not use a flash because I wanted to get that grainy-dusky feel to my photos (I use a cheap little digital camera for happy-snaps, nothing fancy). As I lined up the photo and pressed the button I was momentarily blinded by light - I thought my flash had gone off by mistake although the light was brighter than the usual flash. I reviewed the photo and saw the bright light on the image. My daughter who was fishing said she hadn't noticed anything and neither did my husband, who was cooking at the time and there was no-one else around to ask. Near this area however, is a place called Acacia Hills where there have apparently been many sightings of UFOs over the years. After seeing the image I immediately sensed that I had photographed something unusual and it could not have been an insect or dirt on my lens (none of the other pics taken at that sunset time had any unusual features)."],"trends":["There has been one other sighting in Ocoee","There were no other sightings in Ocoee on or around November 6th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=28.5535,+-81.534615(26456)&iwloc=A&hl=en\"> mufon case (26456) map </A>","Object Features":"Unknown","Object Shape":"Flash, Saturn-like","Object Flight Path":"Unknown","Weather Factors":"Unknown","Date Submitted":"11/09/2010 04:53 UTC","Region":"Florida","Tags":"City","Log Number":"AU-11092010-0005","Date of the Event":"11/06/2010 12:00 UTC","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/26456.html.txt","/var/www/straped/mufon/more/26456_submitter_file1__UFOmaybe.jpg","/var/www/straped/mufon/org/26456.html"],"Summary":"Bright light flashed in and out of view very fast","Latitude":"28.5535","Case Number":"26456"}