{"Disposition":"Unknown","Weather Factors":"Unknown","City":"Owings","Country":"United States","Viewing Distance":"101-500 Feet","Longitude":"-76.601349","Object Features":"Undisclosed","Date Submitted":"11/08/2010 10:56 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on my way home from work when in the middle of the sky in front of me I noticed there was a bright white light in the sky. As I headed south home, it remained stationary and I got closer and closer to it. For about ten minutes I watched the bright light hover in the same spot in the air. I thought maybe it was a planet until the bright light suddenly went out and was replaced by blue pulsating lights. About five to ten minutes later, the bright light came back and the blue pulsing faded. I then thought it could be a helicopter based upon its behavior; however, at one point at around 9:58pm I drove directly underneath of the object. I could see its shape perfectly. It was an obtuse triangle. The bright light I had seen on the front was actually a combination of three - one was on the tip and the other two were on either side of that bright central light. On the other tips, I could see blue lights. They did not look like aircraft lights, but instead looked like a slowly pulsating glow. I could not believe what I was seeing. I lost sight of it after I passed beneath it. I did not see it from that point forward."],"Object Flight Path":"Stationary","Log Number":"US-11082010-0030","Latitude":"38.717618","Object Shape":"Fireball, Triangle","Case Number":"26450","trends":["There have been no other sightings in Owings","This sighting has never been favorited."],"Summary":"three bright white lights on front, two pulsing blue lights on tips, obtuse triangle, stationary","map":"<A HREF = \"http://maps.google.com/maps?q=38.717618,+-76.601349(26450)&iwloc=A&hl=en\"> mufon case (26450) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26450.html.txt","/var/www/straped/mufon/org/26450.html"],"Tags":"City","Date of the Event":"11/08/2010 09:35 UTC","Region":"Maryland"}