{"Source":"MUFON","City":"Osawatomie","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=38.497237,+-94.950521(2646)&iwloc=A&hl=en\"> mufon case (2646) map </A>","Object Shape":"Other","Tags":"City","Date of the Event":"04/30/1969 03:00 UTC","files":["/var/www/straped/mufon/html2text/2646.html.txt","/var/www/straped/mufon/org/2646.html"],"Disposition":"IFO","Object Flight Path":"Unknown","Region":"Kansas","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsIt was aprox. 300 A.M.We lived in the country,I was in bed but was unable tosleep. The sky lit up like it was daytime.I got out of bed and looked at theclock and discovered that it was still night,So I walked around the houseinsideStill seeing daylight in the house . Seemed like the whole countryside waslit up, I didnt see darkness anywhere.I went to check the children in thererooms and both were still asleep as well as my husband.About 20 mins. later whenI was standing in the livingroom, everything slowly began to turn back to normalnight time again. After checking on the kids again, I went back to bed and justlaid awake until morning to see if it would happen again. It didnt. My daughterdeveloped an unusual white spot on her left rear cheek which later became so badthat she almost lost her leg. The DRs. said that she had a birthmark that theblood had stopped circulating to. My son grew up with learning problems but Inever related it to any of this. About two weeks later a friend of mine cameby to visit and told me that his cousin had been killed in a car accident inKansas City because of some bright light that lit up the sky, It shocked him sobad that he ran off of the bridge. After I told him about what I saw wediscovered that it was on the same night.I didnt have a phone at the time but Idid listen to the TV and radio. Nothing was ever said or put in the paper.Tothis date, I am still curious and would just like to know what it could havebeen. Thank you , Pat"],"Latitude":"38.497237","Object Features":"Other","Weather Factors":"Unknown","Case Number":"2646","Country":"United States","Date Submitted":"04/30/1969 03:00 UTC","Longitude":"-94.950521","Summary":"brightly lit sky at 300am","Sighting Duration":"00:30:00","trends":["There has been one other sighting in Osawatomie","There were no other sightings in Osawatomie on or around April 30th 1969"]}