{"Disposition":"Unknown","Country":"United States","City":"Crystal Lake","Object Shape":"Fireball, Oval","Viewing Distance":"Over One Mile","Date of the Event":"03/01/2008 01:45 UTC","trends":["There have been 7 other sightings in Crystal Lake","There were no other sightings in Crystal Lake on or around March 1st 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.245114,+-88.306446(26466)&iwloc=A&hl=en\"> mufon case (26466) map </A>","Sighting Duration":"00:02:10","Longitude":"-88.306446","divs":["Sighting DetailsAt approximately 1:40 AM on Saturday, March 1st 2008, as I was watching a show on television, my two dogs both awakened and started whining and lightly barking for no apparent reason. I let them both out to our fenced in back yard and (together) they ran to the middle of the yard looked up and started barking more loudly. I tried calling them back inside - but they wouldn't come in. I then went outside to get them and both dogs were sitting in the snow barking at something (I thought) was in one of the trees, but there was nothing there. Then in the distance, up in the sky over Algonquin, Illinois a very large oval-shaped fireball UFO appeared out of nowhere, hovered in place for over a minute or so, which gave me time to further notice actual flames being emitted from the object, yet the object emitted no sound whatsoever. The longer it remained stationary, the stranger the whole thing seemed. Then, and without warning - or even a sound - the object sped off at a great speed horizontally to the southeast and was literally out of sight within 2 seconds. The object was easily a mile or two away from where I live, yet it was large enough for me to see the flames coming off it, so how large an object it was - I can't say, but it was big enough for me to see that much detail from a fairly long distance."],"Latitude":"42.245114","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/26466.html.txt","/var/www/straped/mufon/org/26466.html"],"Date Submitted":"11/09/2010 04:53 UTC","Log Number":"US-11092010-0015","Summary":"Football-shaped UFO / Fireball over Crystal Lake / Algonquin Illinois","Case Number":"26466","Tags":"City","Object Features":"None","Weather Factors":"Unknown","Source":"MUFON","Region":"Illinois"}