{"Date of the Event":"11/08/2010 08:05 UTC","Summary":"red, amber, green/blue lights followed by 3 circular white lights, Saginaw County, MI","Case Number":"26465","Log Number":"US-11092010-0014","Object Features":"Undisclosed","Region":"Michigan","Sighting Duration":"00:15:00","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/26465.html.txt","/var/www/straped/mufon/org/26465.html"],"Viewing Distance":"Unknown","Disposition":"Unknown","Source":"MUFON","Date Submitted":"11/09/2010 04:32 UTC","divs":["Sighting DetailsFirst of all I want to start by saying I am not crazy, tonight at about 8pm my boyfriend and I were going to his house in Saginaw County, MI and were going down a somewhat country road to get there, the road had houses on it but we were the only car on the road (usually theres at least one other car we pass on the way there). While on the road I saw a light in the sky that was far away that looked like a weird star or planet or something I noticed it because of its strange colors and after he saw it we started arguing about what it was, it wasn't moving but he said it was a plane and so I pulled over to prove it wasn't moving, it then started moving back and forth so we were both wrong and we saw a plane pass below it (it was definitely a plane). I started getting a bad feeling in my stomach, kind of like anxiety and said we should go so we continued driving down the road when (and this is the part where i swear i'm not crazy, we both saw exactly the same thing) three lights in a row came out of nowhere and started coming directly towards us. It was flying very low, too low to be a plane and almost in the tree line, at this point I was the most scared I have ever been in my life, it was not stopping and my boyfriend was telling me not to stop the car but I turned it around as fast as I could and started going as fast as I could the opposite way, I was telling him to call 911 and he got out my phone and had the number dialed but didn't call and I was so scared my whole body was shaking, we were about two miles from the main road. I was near tears when we got to the main road and once we got there he tried to say it could have been another plane, so I insisted we go to the airport, once there he went in and talked to a sheriff and airport worker who said that the only flight that came in was from Chicago, this all happened before 8:30pm. We then concluded that there was no way it could have been a plane, (my boyfriend is very rational and level-headed) after the airport he told me that while we were driving, whatever had been in front of us was driving directly next to us less than a quarter mile away, he got a vague look at it and said it had no wings or tail, when I was driving I was going about 70mph and slowed to about 55mph when coming to a stop sign, he said it stayed directly next to us the entire time. This was the most terrifying experience I have ever had and I almost can't believe it happened. On a side note, earlier that evening I found out my blood type was B- and that if a woman gets pregnant and that baby has a + blood type the mom could reject it, so we had been talking about that and while looking UFO sightings today I stopped for a bit to get more info on my blod type and found a article saying that most people who are abducted by aliens have B- or other - blood types; not that I think I was abducted it was just a weird incident and that information made it a little weirder... It would be nice to get a bit more info on that."],"Tags":"City","Object Shape":"Bullet, Missile, Triangle, Other","Latitude":"43.525026","Object Flight Path":"Undisclosed","trends":["There have been 2 other sightings in Tittabawassee","There were 2 other sightings in Tittabawassee on or around November 8th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.525026,+-84.12276(26465)&iwloc=A&hl=en\"> mufon case (26465) map </A>","Country":"United States","City":"Tittabawassee","Longitude":"-84.12276"}