{"Weather Factors":"Unknown","Region":"Indiana","Object Shape":"Triangle, Other, Unknown","Longitude":"-87.328504","Date Submitted":"11/09/2010 02:54 UTC","Date of the Event":"11/08/2010 06:45 UTC","Summary":"Multiple UFOs and man-made aircrafts","Latitude":"41.484234","Country":"United States","files":["/var/www/straped/mufon/html2text/26463.html.txt","/var/www/straped/mufon/more/26463_submitter_file1__uforemake.png","/var/www/straped/mufon/org/26463.html"],"divs":["sighting detailsi was in the back seat of our car, coming from merrillville to michigan city indiana. it was about 6:45 pm and the stars were out. i was looking outside of the window and saw a couple of star-like lights that were moving and flashing. i saw three airplanes in the same air space in parallel lines. then i saw a very bright thing that looked like a star, at first i thought it was the north star, but it was three times the size of the other stars so i thought that it was a planet, then i realized the it was moving real slowly upwards. it seemed like it was getting closer. i looked at the other lights around it and saw three other starlike moving objects around it as well. then as the large starlike object came closer, i saw other lights on the object. the lights were red, green, blue, white, and yellow\\orange in a triagular shape. as it got closer, i think i saw a triangular shape but i can't be sure. it definitely was not any aircraft that i know of, not an airplane or a helicopter or a jet. it also moved as if it were floating\\hovering. after about 10 mins from seeing it, i lost sight of it. the drive from merrillville to michigan city took about 30 minutes and during that time i saw a lot of weird moving lights that looked like stars all of them changed and flashed colors atleast one point or another and they also moved in a way that planes cannot possibly move. all in all i believe i saw 8 unidentified flying objects and 6 planes."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.484234,+-87.328504(26463)&iwloc=A&hl=en\"> mufon case (26463) map </A>","Sighting Duration":"Undisclosed","Object Features":"Other","Tags":"City","Source":"MUFON","Object Flight Path":"Straight-line path","trends":["There have been 7 other sightings in Merrillville","There were no other sightings in Merrillville on or around November 8th 2010","This sighting has never been favorited.",""],"Case Number":"26463","Viewing Distance":"Unknown","Log Number":"US-11092010-0012","Disposition":"Unknown","City":"Merrillville"}