{"files":["/var/www/straped/mufon/html2text/26471.html.txt","/var/www/straped/mufon/org/26471.html"],"Disposition":"Unresolved","Object Features":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"11/09/2010 07:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.514939,+-0.123675(26471)&iwloc=A&hl=en\"> mufon case (26471) map </A>","Region":"England","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around November 9th 2010"],"Date of the Event":"11/09/2010 06:45 UTC","Case Number":"26471","Viewing Distance":"Unknown","divs":["Sighting DetailsI saw three triangular shaped craft flying in a triangle formation from East to West. I would say altitude was around 3,000 feet. I was in the Ealing area. The unusual thing about them was the light, there were no single points of light or blinking green and red navigation lights. Instead, each of the triangles showed off a diffuse, subdued orange light, which was triangular in shape. Possibly, they might have been reflecting back the city lights below. They moved really fast across the sky (about 9 seconds to pass out of view) and before they went out of sight, one of the triangles changed position so that there were now three triangles in a diagonal line. This area is near Heathrow Airport and there was a jet from there climbing out over the area, which made a lot of noise, so I'm unable to say if these craft were silent or not, but I did not discern any noise coming from them like fighter jets would make. Just puzzled by this, I see aircraft every day, but these were nothing like anything I have seen and the strangest thing about them was the diffuse orange light."],"Log Number":"GB-11092010-0020","Summary":"Three orange coloured triangular craft flying in triange formation over London, England","Latitude":"51.514939","Sighting Duration":"Undisclosed","City":"London","Tags":"City","Country":"United Kingdom","Longitude":"-0.123675","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Source":"MUFON"}