{"Tags":"City","Summary":"Star like light that changed colors rapidly while stationary in the sky.","Sighting Duration":"Undisclosed","Case Number":"26489","map":"<A HREF = \"http://maps.google.com/maps?q=41.886651,+-88.196691(26489)&iwloc=A&hl=en\"> mufon case (26489) map </A>","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/26489.html.txt","/var/www/straped/mufon/more/26489_submitter_file1__abc1.jpg","/var/www/straped/mufon/more/26489_submitter_file2__abc3.jpg","/var/www/straped/mufon/more/26489_submitter_file3__abc2.jpg","/var/www/straped/mufon/org/26489.html"],"Log Number":"US-11102010-0009","Region":"Illinois","Latitude":"41.886651","trends":["There have been 2 other sightings in West Chicago","There were no other sightings in West Chicago on or around November 8th 2010","This sighting has never been favorited.",""],"City":"West Chicago","Viewing Distance":"Over One Mile","Longitude":"-88.196691","Weather Factors":"None","Source":"MUFON","Date of the Event":"11/08/2010 11:10 UTC","Country":"United States","Object Features":"Other","divs":["Sighting DetailsThe night of Nov. 8th my son came into the house and stated mom you have to see this it just showed up in the sky. I observed in the eastern sky a Bright colored object that was Changing colors as we watched. Not just primary colors many differant hues. I went in the house grabbed my 7d Canon camera with the basic telephoto lens and started shooting. I took about 11 shots then went inside to get binoclars.When I returned the object was gone. Last Night I went out at the same time to see if it was there and it wasnt so I knew it could not have been a star. At 11:15 my friends son came over to look at the photos I took. I had to go out to get something out of my car. I turned around and it had appeared again. This time it alomst seemed to respond when I used a flash on the camera I would flash and it would flash a bright white. We watched it for over and hour and once again it just vanished. I have 3 other witness from last nights episode. My Son, and daughter, and His friend. I am anxious to find out what we saw. I have Pictures, and would be able to email to someone. I have taken one of the photos and cleaned it up. We can see what looks to be a Triangle image, with a vapor trail at one of the sides. The series of photos show again Green, Purple, yellow, red, teal green, bright green, and it leaves with out a trace just like someone turned off a light."],"Date Submitted":"11/10/2010 09:30 UTC","Object Shape":"Boomerang, Cone, Circle, Egg, Flash, Star-like, Triangle","Disposition":"IFO"}