{"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Tittabawassee","There were 2 other sightings in Tittabawassee on or around November 9th 2010"],"Latitude":"43.534426","Summary":"UH-64 Helicopter landed at MBS Freeland, MI","Log Number":"US-11102010-0007","Tags":"City","files":["/var/www/straped/mufon/html2text/26487.html.txt","/var/www/straped/mufon/org/26487.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.534426,+-84.12048(26487)&iwloc=A&hl=en\"> mufon case (26487) map </A>","Source":"MUFON","Object Features":"Undisclosed","Longitude":"-84.12048","Date Submitted":"11/10/2010 08:38 UTC","Date of the Event":"11/09/2010 06:10 UTC","Region":"Michigan","Country":"United States","Case Number":"26487","Object Shape":"Unknown","Viewing Distance":"Unknown","Disposition":"IFO","Sighting Duration":"00:20:00","divs":["Sighting DetailsTHIS IS NOT A UFO REPORT. This data is submitted with regard to MUFON Case 26465. The skies in central MI have been crystal clear since Sunday, 7 Nov 2010. As a result I have been out plane watching both day and night. In conjunction with this 90% of the arriving flights at MBS, Freeland, MI have landed on Rwy 05 after making their approach from the SW Chicage arrivals or Right Base 05 from Detroit. Many of these flights are B-757's that appear to hover in the sky (from a distance) especially when down to 2,100 ft. approach altitude. There are (2) Lifeguard helicopters that operate from downtown hospitals located in Saginaw, MI approx. 7.0 mi DME heading 145 deg. from MBS. Both birds are rarely on the ground. Both have a very bright red light on top that alternates with one on the bottom of the fuselage. Both rarely fly above 2,500 AGL and more often than not between 1,200 to 1,800 AGL. Both are modified BO-105's. These (2) birds alone can explain away half of the sightings here. Re: Case 26465 The dates are off by 24 hours but, from 17:55 hrs Eastern thru 18:15 hrs Eastern the night of 9 Nov. 2010 I listened to my scanner tuned to MBS approach 126.45 while a UH-64 (probably military) helicopter made a 25 mile approach to MBS from the SW on an approx. 050 deg heading while vectoring to land on Rwy 05 midfield. The UH-64 did report his speed was 140 mph and I assume he was down to 2,100 ft AGL. Two other commercial aircraft were also in the pattern and as a result the UH-64 was directed off course to a northerly heading while yielding to the other craft. In short, just prior to landing the UH-64 would have flown out into dense, wooded, back country for a couple minutes before resuming Rwy 05 vectors. I will add that Military aircraft use MBS for training simulated bomb runs regularly. The past two weeks there has been a glut of MIANG A-10 Warthogs doing the deck then bugging out."],"City":"Tittabawassee"}