{"Case Number":"26485","Weather Factors":"Unknown","Date Submitted":"11/10/2010 08:21 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.359861,+-71.053063(26485)&iwloc=A&hl=en\"> mufon case (26485) map </A>","Summary":"big loss of time possible boston ma abduction","Source":"MUFON","Object Features":"Other","Disposition":"Unknown","Country":"United States","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around October 6th 2000"],"Longitude":"-71.053063","Date of the Event":"10/06/2000 07:00 UTC","City":"Boston","Object Shape":"Other","Log Number":"US-11102010-0005","Tags":"City","Object Flight Path":"Hovering then path","Region":"Massachusetts","Latitude":"42.359861","Viewing Distance":"Unknown","divs":["Sighting Detailsalot of wierd things have happend to me threw out my life so ima just give u this 1 story and if u could ask the right person what they think about it or if they think im bein followed. its about UFO's, well when i was 16 me and a friend went to the charles river in Boston MA after school. to smoke ciggars(yes we were to young for that and it was stupid to smoke, but we did it any way) it was about7pm when we lit r first ciggars when all of a suddn we just r waking up in the same position on the bench we were sitting on, our butts were at the end of the bench and the back of our heads were resting on the back of the bench(kinda in a looking up position if u could imagine). we both saw a craft that look to be really high above us and did not look areodynamic at all moving from over charles river to over cambridge fast. we look at are watches it was 3:30am. then we both ran home. since then ive seen 15 ufo's threw out the years till 2010 . the question i have for this story would be where did the 8hrs go and am i seeing the same ufo following me or are these ufo's all different?"],"files":["/var/www/straped/mufon/html2text/26485.html.txt","/var/www/straped/mufon/org/26485.html"],"Sighting Duration":"Undisclosed"}