{"Latitude":"35.851161","map":"<A HREF = \"http://maps.google.com/maps?q=35.851161,+-86.38538(26482)&iwloc=A&hl=en\"> mufon case (26482) map </A>","City":"Murfreesboro","Case Number":"26482","Country":"United States","Sighting Duration":"00:00:10","Object Shape":"Square, Rectagular","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/26482.html.txt","/var/www/straped/mufon/org/26482.html"],"trends":["There have been 18 other sightings in Murfreesboro","There was one other sighting in Murfreesboro on or around November 9th 2010"],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"11/10/2010 12:42 UTC","Log Number":"US-11102010-0002","Object Flight Path":"Straight-line path","Weather Factors":"None","divs":["Sighting DetailsI was sitting in my room, watching TV, when I heard this sound, quiet at first but growing louder. It was a sound like I've never heard before. The closest thing I can think of to describe it would be the sound of wind blowing through something with the sound raising in pitch as well as volume. I went out the door that's connected to my room, that faces northwest. I caught just a glimpse of an enormous dark rectangular object that looked like it was the end of something larger that I could not see. It immediately disappeared over the tree line, and I didn't get a very good look at it. It was far larger than any aircraft I've ever seen. I didn't see any lights specifically, but it was definitely illuminated somehow, it seemed from the bottom. I didn't know what to think the thing was, I've never seen or heard anything quite like it. My heart started beating faster when I heard the sound, and my heart was racing for a couple minutes after the event. Even now as I type my heart is starting to beat a little faster. After it disappeared I stood outside for a bit longer, but I didn't see or hear anything else. After I came in I got on the computer and told a couple friends what I saw, then started filing this report about ten minutes after it happened."],"Date of the Event":"11/09/2010 10:40 UTC","Object Features":"Unknown","Summary":"Heard an odd noise so I looked outside and saw something pass over tree line.","Source":"MUFON","Longitude":"-86.38538","Tags":"City","Region":"Tennessee"}