{"files":["/var/www/straped/mufon/html2text/2649.html.txt","/var/www/straped/mufon/org/2649.html"],"Country":"Mexico","Object Features":"Other","divs":["Sighting DetailsWe were on a hotel balcony in Puerto Vallarta Mexico just enjoying the view whenI thought I saw a shooting star in the eastern sky. It started out in theeastern sky traveling south to north, but then the shooting star stopped,changed direction twice then disappeared. As I pointed to the sky to show myhusband and 2 friends where this had happened, another objected appeared andbehaved in the same manner. Most of the time there were 2-3 objects visable atthe same time, zipping about the sky above the Sierra Madre Mountains thendisappearing briefly only to reaapear seconds later, however there was onemoment where we counted 4 different lights in the sky at the same time. Oneeven stopped, hung still in the sky and pulsated brightly. This continued for30-45 minutes until a haze moved into the area from the south. We were in suchawe and excitement, Im surprised we didnt wake up the whole hotel because wewere shouting out everytime one appeared. We checked the sky every night afterto see if anything was there, but nothing was ever seen again. I am justgratefull I had the three others to witness this with me, because nobody elsewould believe it unless they had seen it themselves I had seen this same thingbefore with only one object for about 5-10 seconds, and much much closer to uswhen in Costa Rica in 1995."],"Disposition":"Unresolved","Region":"Jalisco","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=20.622018,+-105.228457(2649)&iwloc=A&hl=en\"> mufon case (2649) map </A>","Longitude":"-105.228457","Date of the Event":"10/23/2003 12:10 UTC","Date Submitted":"10/23/2003 12:10 UTC","Summary":"white lights above the Sierra Madres","Object Shape":"Undisclosed","Log Number":"","Case Number":"2649","Source":"MUFON","Weather Factors":"Unknown","City":"Puerto Vallarta","Latitude":"20.622018","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"01:00:00","trends":["There have been 4 other sightings in Puerto Vallarta","There were no other sightings in Puerto Vallarta on or around October 23rd 2003"]}