{"divs":["Sighting DetailsThe sighting I am about to describe occurred many years ago, It is difficult to estimate exactly when but some time during the 1980's is a reasonable guess. I was traveling south on 525W, a road that is 7-8 miles west of Columbus, near the intersection of what is now Goeller Blvd. It was a warm summer evening, probably near 7:30pm or so. As I approached the intersection I noticed what I thought was a very bright star on the western horizon. The horizon in this case is a very high bluff. I thought to myself \"gosh that's a bright star.\" and wondered if it was a planet. After driving another 100 yards or so I again looked at the star and it seemed much closer. The \"star\" then began to split as two like sized units emerged from the original one and took up positions to the left and right of the initial one. The two outside units then each had another like sized unit emerge from them and position themselves further to the outside. There was now a fleet of five units flying in formation from west to east. The five units were some distance apart, flying in parallel. Since there was no one behind me I got out of my car and watched as the units streaked across the sky. I remember being amazed how fast they were flying and thinking to myself that we don't have anything that flies that fast. After a short time they disappeared from my view to the east. Trees blocked my view so I could not see them disappear over the eastern horizon. The above episode only took a few minutes. I remember thinking UFO's are for real. It was truly awe inspiring. The actual tme is difficult to estimate with accuracy but a good guess would be 3-4 minutes from the time I first saw the \"star\" to the five units disappeared to the east."],"Disposition":"Insufficient Data","City":"Columbus","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.20348,+-85.91988(26495)&iwloc=A&hl=en\"> mufon case (26495) map </A>","Log Number":"US-11102010-0014","Case Number":"26495","Latitude":"39.20348","Object Flight Path":"Straight-line path","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/26495.html.txt","/var/www/straped/mufon/org/26495.html"],"Summary":"Bright white star appeared on horizon that split into three separate star-like units. The two outside units each then split into two units, bringing the total to five. All five star-like units flew in parallel across the sky .","Weather Factors":"None","Longitude":"-85.91988","Date of the Event":"07/31/1985 07:30 UTC","Date Submitted":"11/10/2010 03:31 UTC","Source":"MUFON","trends":["There have been 14 other sightings in Columbus","There were no other sightings in Columbus on or around July 31st 1985"],"Sighting Duration":"Undisclosed","Region":"Indiana","Country":"United States","Object Features":"Unknown","Viewing Distance":"Unknown"}