{"divs":["Sighting DetailsI was sitting in my kitchen at around 10:20 am in my house in the Hollywood area. I heard a very loud sound of airplanes, like the sound of fighter planes. I had my door open on my deck so I walked out to look. Sure enough there were 2 fighter planes flying in formation going from west to east. As the 2 fighter planes flew out of sight I noticed that high above the altitude of the planes, and moving in the opposite direction of the fighter planes (east to west) 6 pinkish white dots of light, (They looked like bright stars but in the daylight) At first they were in no specific formation, then they gathered into a \"V\" shape with one of the dots kind of far off to the side (south of the formation) they broke up again and moved quite quickly in and out of the \"V\" formation but staying in pairs. Then they seemingly changed direction and started flying back toward the east, but it seemed that they were also gaining altitude and getting further away. I tried to get it on my flip camera but they were so high up that they only look like pixels on my camera. It was so frustrating that no one in my house had binoculars because I needed to see it more clearly, I couldn't explain or believe what I was seeing! I watched with my hands cupped around my eyes for about 7 or 8 minutes till they just climbed so high that they were no longer visible."],"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Silverlake","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.659722,+-120.115623(26492)&iwloc=A&hl=en\"> mufon case (26492) map </A>","Date Submitted":"11/10/2010 01:57 UTC","Sighting Duration":"Undisclosed","Summary":"6 round dots of pinkish light in a \"V\" formation scattering after 2 fighter planes flew past","Disposition":"IFO","Case Number":"26492","Log Number":"US-11102010-0011","Region":"California","Country":"United States","Object Features":"Unknown","Source":"MUFON","Object Shape":"Circle","Latitude":"38.659722","files":["/var/www/straped/mufon/html2text/26492.html.txt","/var/www/straped/mufon/org/26492.html"],"City":"Silverlake","Longitude":"-120.115623","Date of the Event":"11/10/2010 10:28 UTC","Tags":"City","Weather Factors":"Unknown"}