{"Region":"Georgia","Longitude":"-84.422342","Source":"MUFON","Country":"United States","Object Features":"Undisclosed","Date of the Event":"10/28/2010 11:20 UTC","Date Submitted":"11/10/2010 02:07 UTC","Weather Factors":"None","Sighting Duration":"00:00:15","Tags":"City","Object Flight Path":"Straight-line path,Path then hovering","Latitude":"34.473069","files":["/var/www/straped/mufon/html2text/26493.html.txt","/var/www/straped/mufon/org/26493.html"],"City":"Jasper","trends":["There have been 6 other sightings in Jasper","There were no other sightings in Jasper on or around October 28th 2010"],"Case Number":"26493","Disposition":"Insufficient Data","Viewing Distance":"Unknown","divs":["Sighting Detailsi had been watching out my window for any signs of showers from the hartley2 comet. my window faces directly north and there are 2 bright stars close together that i use as a reference point. just when i started to close the curtain and go to bed. i saw a bright flash of orange right next to the two stars. at first i thought it was a fireball but after thinking about it,it seemed to strange to be a fireball. like i said it was a fiery bright orange on top and it was a perfect up and down strip of orange with a brighter star shaped or fireworks shaped light on the bottom of the strip, below that it appeared to be dripping orange fire.it came straight down from no where and disappeared just as quick. if it had been a fireball it should have had some arc to it or some kind of tail. this thing just appeared like it just dropped down then it was gone. the more i have thought about it it kinda looked like a big giant orange door with fire more like fireworks and something dripping from that.the color was consistent all over the thing,a bright orange with tinges of yellow on the fireball part and orange drips from the bottom.i have tried to sketch it a few times but just can't get it right. the size had to be enormous. the area it appeared over would be talking rock or ellijay."],"Object Shape":"Fireball, Square, Rectagular, Star-like, Other","Summary":"while watching for meteors from hartley2 something strange showed up in the northern sky","Log Number":"US-11102010-0012","map":"<A HREF = \"http://maps.google.com/maps?q=34.473069,+-84.422342(26493)&iwloc=A&hl=en\"> mufon case (26493) map </A>"}