{"Tags":"City","Longitude":"-73.238262","Date of the Event":"11/10/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.453684,+-73.238262(26497)&iwloc=A&hl=en\"> mufon case (26497) map </A>","Country":"United States","City":"Pittsfield","Latitude":"42.453684","Object Flight Path":"Undisclosed","trends":["There have been 17 other sightings in Pittsfield","There were no other sightings in Pittsfield on or around November 10th 2010"],"Date Submitted":"11/10/2010 08:55 UTC","Weather Factors":"Unknown","Region":"Massachusetts","Disposition":"IFO","divs":["Sighting DetailsI am a 38 year old professional.I was driving up my parents hill for a visit and to give my Dad his shots for medicine. When I got out of the car at 5:45 PM, I looked up and noticed a \"star\" that seemed to be larger than the other stars and it was flashing, or strobing red,green,yellow,and blue colors. The lights were thing was 100% stationary and seemed to be in one place or on one object?. There also seemed to be a fair amount of of recognizable air traffic...port red and starboard green lights and white strobes on the planes and the planes move. The Commercial aircraft was very high up....the lights were larger and higher up. It reminded us both of a super charged \"Simon\" game, but far more active and sparkly. The lights or object remained stationary for over 4 hours and is actually still out there as I type. After showing it to my parents through the window, my mother went and retrieved my fathers high power binoculars. We both looked at the object while laying the binoculars on the car roof for stability. I can't even say what we both saw...it was like a large star...but strobing madly and didn't stop. It grew in intensity and pulsing frequency and then calmed a bit over and over. The \"object\" or lights were amazing and truly appeared to be \"arcing\" like welding does. As a matter of fact...it was similar to a multi colored welding flame that strobed as well yet seemed more electrical I guess. My Mother stated she thought it looked like never ending fireworks but stationary and appeared to be the same altitude as the stars. This \"thing\" can't really be described in type. The flashes were so frequent it looked as though it was literally made of strobe lights in multi colors. My Mother and I both thought it had an \"aura\" glow around it as well. My Mother and I both called Mufon, and the local Colleges Astronomy Telescope Observatory to tell them. I left and came home to type this. My Mother just called at 8:45PM and said \"Through the binoculars it looks like it's well....it almost looks triangular now\". \"The red is on the middle it seems\"...\"It's so bright...there's Red middle, and there are \"creamy white lights\" now near it and moving that can be seen in the binoculars only.\"It's the most amazing thing I've ever seen\". \"There are colors on what appear to be the corners\" I am now calling my friends with telescopes. I do not have a camera yet recorded on my cell. The cell camera took video of blackness. I'm going to see if I can see anything on my laptop. We are 10% convinced it was not Identifiable at all. It was no craft like anything either of us has ever seen. We are both very very blown away!"],"Case Number":"26497","Log Number":"US-11102010-0016","Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/26497.html.txt","/var/www/straped/mufon/org/26497.html"],"Object Shape":"Other","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Red,Yellow,Green, and Blue flashing/twinkling/stationary large starlike?"}