{"map":"<A HREF = \"http://maps.google.com/maps?q=40.801817,+-81.370817(26501)&iwloc=A&hl=en\"> mufon case (26501) map </A>","Longitude":"-81.370817","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/26501.html.txt","/var/www/straped/mufon/org/26501.html"],"divs":["sighting detailson the evening of november 10, 2010 around ten pm, i was taking my dog out for her evening walk. it was an exceptionally clear night and the stars were amazing. as i looked up at them there was a super bright light, which i figured was venus or jupiter, and then i thought it was an airplane when i saw the blinking lights. the lights flashed blue and green in conjunction with thewhite light. while i stared at it it never moved, in fact it didnt move from the position it was in for a few hours. the other heavenly bodies moved as they should but this light did not move. i could see it from my living room window. this is not the first time that my family and i have seen these strange lights. they started appearing in 2006. same are but different parts of the sky, usualy the southern part of the sky or the souh western part. after i came in the house i told my mom to look at it just to make sure i wasnt seeing things. she alsosaw it and we had a discussion on what it could be while watching it from our living room window. we were both nervous but then curiousity took over and we just kept watching it. around 1` am i no longer noticed it in the sky\\ i dont know where it went. the only movement it made while i was outside looking at it could have just been me moving but it wiggled a lil bit apart from that nothing for 2 hours or so. and my dog wanted back in that is all"],"Summary":"bright green and blue flashy light","Object Shape":"Circle, Flash, Oval, Saturn-like","City":"Canton","Case Number":"26501","Region":"Ohio","Date Submitted":"11/11/2010 03:22 UTC","Country":"United States","Tags":"City","Object Flight Path":"Stationary","trends":["There have been 13 other sightings in Canton","There were no other sightings in Canton on or around November 11th 2010"],"Sighting Duration":"Undisclosed","Log Number":"US-11112010-0001","Latitude":"40.801817","Weather Factors":"None, Does Not Apply","Date of the Event":"11/11/2010 11:02 UTC","Viewing Distance":"Over One Mile","Object Features":"Unknown","Source":"MUFON"}