{"Date Submitted":"10/25/2003 11:35 UTC","Object Features":"Undisclosed","Latitude":"34.016505","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Flight Path":"Unknown","divs":["Sighting DetailsEverything you want to know is reported at the National UFO Reporting Center.This is, perchance, the third appearance of this UFO in two months over a majorcity or cities, namely Montebello, El Monte, Commerce, Bell Gardens, PicoRivera, etc.This time, the time was 1135pm on 10252003 when I went outside for a glance atthe very smokey Southern Californian Sky Due to extreme fires around whentowards the southwest which would be Montebello and Commerce,...the very brightRED star or planetary-like UFO caught my eye once again. I wasam surprise thatit had return for the third time. Also, the UFO appears only on Saturdays, whichis strange because at around that time, everybody is active in fun filledactivities. And, many did see this UFO. A Mass UFO sighting. YES. Anyrate, itwas moving slowly towards my area, when suddenly, it changed color to white andtook the shape of a spiraling wheel with five small star-like objects dancingrather oddly. Time duration of that spectical was about 2 minutes whenfinally,...it just disappeared or fade out of existence. Time of disappearance1145pm. I would guess that the brightness of this UFOs introduction of thatnight102502and the previous Saturday nights is about the extreme brightness of awelders arc, but RED.Continuing. As I stood in the backyard discussing the event with the othereyewitness for several minutes, believing the show was over,...it suddenlyreappeared. Time of reappearance 1200am Sunday 10.26.2003. This time it was adifferent appearance. The UFO first flashed once like a cameras flash, then inabout 3 seconds it appeared like a growing glowing white bright spherical light,like a welders arc, or like some pyrotechnic when it explodes. But the UFO didnot explode, but remained bright white for about 1 minute. Then, it changed intoa Christmas tree or cone shape with many little lightsRED, GREEN, WHITE blinkingor acting rather oddly around the main object. The time of duration of that wasabout 2 minutes, when suddenly, the UFO faded out and never reappeared.For Information OnlyTime duration of last sighting 30-35 minutesDay Labor Day2003 Appearance was,...b"],"Country":"United States","files":["/var/www/straped/mufon/html2text/2650.html.txt","/var/www/straped/mufon/org/2650.html"],"Object Shape":"Unknown","Sighting Duration":"00:10:00","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.016505,+-118.113754(2650)&iwloc=A&hl=en\"> mufon case (2650) map </A>","Summary":"Red Spherical UFO Visits Montebello, CA Again","Case Number":"2650","Longitude":"-118.113754","trends":["There have been 2 other sightings in Montebello","There were no other sightings in Montebello on or around October 25th 2003"],"Date of the Event":"10/25/2003 11:35 UTC","Disposition":"Unknown","Region":"California","Log Number":"","City":"Montebello"}