{"Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-117.370703","Case Number":"26507","Date Submitted":"11/11/2010 03:31 UTC","Weather Factors":"None","Disposition":"IFO","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.20009,+-117.370703(26507)&iwloc=A&hl=en\"> mufon case (26507) map </A>","Object Shape":"Bullet, Missile, Cylinder, Teardrop","divs":["sighting detailswhile driving east bound, up a short hill i had to lower my sun visor to block the sun as it was early morning and i was driving eastbound. i noticed the object in the sky to the left of the sun. at first i thought a small bit of bird [profanity deleted\\cms\\tg] was on my side glass. i double checked and there was nothing on my window. the object was the color of a white cloud but was shaped very differently. the bottom was squared off and the sides were straight. in the middle of the bottom there seemed to be a dark spot, i looked at this part of it more intensely to be sure. the top end kind of tapered off and had a wispyness to it. i stopped driving to take a closer look at it. the place where i stopped was next to a large tree. i was looking over my left shoulder to see the object. i kinda disregarded it after a while. almost took a cellphone pic of it but decided it was too far away to get anything decent. it was about 10 miles away. as i pulled away from where i stopped, the large tree blocked my view of the object. i looked again to where it should have been and it was gone. i then looked forward and there it was, still about 10 miles away but now it moved 90 degrees clockwise through the sky. that startled me. i kept driving on and soon lost sight of the object."],"Country":"United States","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around November 11th 2010"],"Object Features":"Unknown","Summary":"in clear blue sky a white upright cylindrical object with a dark spot in the center of the bottom was noticed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/26507.html.txt","/var/www/straped/mufon/org/26507.html"],"Date of the Event":"11/11/2010 07:45 UTC","Region":"California","Latitude":"33.20009","City":"Oceanside","Object Flight Path":"Hovering then path,Straight-line path,Other","Log Number":"US-11112010-0006"}