{"Object Flight Path":"Straight-line path","Source":"MUFON","trends":["There have been 106 other sightings in San Jose","There were 2 other sightings in San Jose on or around November 11th 2010"],"Date Submitted":"11/12/2010 01:20 UTC","Date of the Event":"11/11/2010 03:55 UTC","Viewing Distance":"Unknown","Object Features":"Undisclosed","Weather Factors":"None","divs":["Sighting DetailsThe craft was heading north by north west. Looked to be traveling along the 101 up the coast. Or maybe on the Coast line itself. I was in Milpitas making a delivery and finished at 3:58 am. Saw out of my eye what I thought was a flock of geece or birds climbing back into my commercial truck. After rubbing my eyes and realizing what I was seeing I climbed onto the top of my truck to watch it. The Craft in relation to where it was in the sky, was the size of a 50 cent piece, and was in the general placement just below Orion's Belt constelation. At the point I saw it- it \"appeared\" to be leaving the San Jose area. The point of the \" V \" was pointing north and i was able to see the lights clearly around both sides. The sky was very clear with a new moon. Unlike the drawings I have seen on Ufo Hunters the lights were individual about 5-7 , not one solid light. There was also a kind of glow around them appearing to be one solid light. I watched it for about 3-4 min until the craft faded into the night. It was clearly a craft as the stars disappeared as the craft went under them. It looked to be moving at a slow pace. but up that high who knows. It was my first sighting and was really cool. I hope I was able to add to your list on MUFON. I can now understand why photo's of UFO's look fuzy in nature- if I had used my camera on my phone it would have looked fuzy as well. If these are military like some believe its important to know just days ago there was a mysterious missile launched off our Southern Coast down by San Diego."],"Summary":"Triangle heading north up coast of CA","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"37.347766","map":"<A HREF = \"http://maps.google.com/maps?q=37.347766,+-121.885236(26518)&iwloc=A&hl=en\"> mufon case (26518) map </A>","Case Number":"26518","Object Shape":"Triangle","Region":"California","files":["/var/www/straped/mufon/html2text/26518.html.txt","/var/www/straped/mufon/org/26518.html"],"Longitude":"-121.885236","Log Number":"US-11122010-0002","Country":"United States","Tags":"City","City":"San Jose"}