{"trends":["There have been 12 other sightings in Rio de Janeiro","There was one other sighting in Rio de Janeiro on or around June 13th 1970"],"City":"Rio de Janeiro","Log Number":"","Date of the Event":"06/13/1970 03:30 UTC","Viewing Distance":"20 Feet or Less","Region":"Rio de Janeiro","Sighting Duration":"01:59:00","Tags":"City","Country":"Brazil","files":["/var/www/straped/mufon/html2text/2651.html.txt","/var/www/straped/mufon/org/2651.html"],"Longitude":"-43.205547","Summary":"A Strange but Very Real Fact in Rio","Disposition":"Unresolved","Object Flight Path":"Unknown","Weather Factors":"Windy","Source":"MUFON","divs":["Sighting DetailsA strange but very real factI will try to recollect what happened more than 30 years ago, so please considerthat some details may be a little imprecise, even though as true as one can be.I was just 17 years old and it was in Rio de Janeiro, June 1970. When theweather was nice, I and my friends used to go a suburb named Barra da Tijuca. In the 70s, Barra as we called it, had just a bunch of houses in its first 15miles of unspoiled beach now the place is full of luxury skyscrapers. Aseverybody else, we bowled, laughed and had a wonderful time with our girlfriendsin front of a paradisiacal beach. Close to the beginning there was a biologicalmarine reserve with barbed wire fences at both sides of the beach road. There isalso a nice restaurant at the Marisco rock, at the end of the 15-mile longbeach.One day however, on Friday or Saturday of the week before my 18th birthday, Iwas driving my girl home in my blue Opala Chevrolet from this restaurant alittle after 3 AM. We were speeding fast on the bumpy beach side road to arriveat the girl92s home before her mother woke up. I was singing happily while listening to theradio and seeing the beautiful night sky with a full moon and bright stars. Iwas totally unconcerned while my yellow high light beams vanished the darknessahead of us. When we started crossing the marine reserve with its fences, theradio suddenly started to give static and went completely off. I thought it wasjust because of a bump on the pavement. Then, the road lights also went off in asequence of stretches, blackening out the entire beach, but this was not unusualat that year in Rio. However, to my total surprise, seconds later bothheadlights also went off entirely96 and the ENGINE stopped That"],"Object Shape":"Disc","Date Submitted":"06/13/1970 03:30 UTC","Object Features":"Window(s)","Case Number":"2651","Latitude":"-22.901509","map":"<A HREF = \"http://maps.google.com/maps?q=-22.901509,+-43.205547(2651)&iwloc=A&hl=en\"> mufon case (2651) map </A>"}