{"Country":"United States","City":"Dayton","Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-11112010-0009","Object Shape":"Cone","divs":["Sighting DetailsMy children and I had been at a bowling alley and when we walked out, I looked up into the night sky as I often do. I saw a large orange pulsating light in the sky. I asked my oldest child if she saw what I saw. She didn't see it at first because she was already in our vehicle. I made her get out of the vehicle so she could see it. The other kids weren't interested in looking at it. As soon as she looked up into the sky, she saw what I was talking about. The object (shaped much like a Candy Corn standing up on the pointed end) stayed stationary for a minute or three while we observed it. The object was pulsating an orange, orange-ish and white light. It didn't blink as airplanes do, it pulsated. There was never a time when it wasn't a color. Airplanes have a distinct blinking pattern that is easily recognizable and this was not that. We both thought it was pretty neat, but neither of us could identify what it might be. We watched it slowly start to move until it was out of our sight. It didn't move quickly, just meandered out of our sight. Wondering if anybody else saw it or knows what it may have been? I tried to get a picture on my cell phone, but my cell phone is no good at night shots."],"trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around November 11th 2010"],"Longitude":"-84.182347","files":["/var/www/straped/mufon/html2text/26510.html.txt","/var/www/straped/mufon/org/26510.html"],"Summary":"Pulsating Orange Object in Night Sky","Latitude":"39.767538","Viewing Distance":"Unknown","Date Submitted":"11/11/2010 10:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.767538,+-84.182347(26510)&iwloc=A&hl=en\"> mufon case (26510) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"None, Does Not Apply","Tags":"City","Disposition":"Unknown","Date of the Event":"11/11/2010 07:40 UTC","Region":"Ohio","Source":"MUFON","Case Number":"26510"}