{"Tags":"City","Longitude":"-112.427036","City":"Maricopa","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.294477,+-112.427036(26514)&iwloc=A&hl=en\"> mufon case (26514) map </A>","Weather Factors":"None","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/26514.html.txt","/var/www/straped/mufon/org/26514.html"],"Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","divs":["Sighting DetailsOn Nov 11, 2010, at approximately 6:24pm (Local time in Maricopa, AZ) My brother in-law and I just pulled into my parking spot on the west side of my house. I exited my truck and was walking north, away from my truck when I see this row of red lights in the sky to the north by north east (NNE). Approximately 10 Degrees in the sky. The lights were all in a row and were blinking on and off like a strobe. They were in perfect alignment and it appeared to rotate around this object. This thing was HUGE!!! Now comparing it to a full moon. It was five to six times bigger. At first I thought it was a bunch of planes coming into Sky Harbor, but they were all blinking red. Which is unusual for plane inbound to PHX. Then I realized that they were in a perfect line and blinking in sequence. At that moment I put them together and realized this was one HUGE object. At first it appeared to move east to west. And then north toward South Mountain. But now that I reflect back on it, the object was flying by Maricopa towards Phoenix. I called my wife and parents out of the house to see this object. I also called my friend in Mesa to look out and see if he saw it. My friend in Mesa, said it was huge and was moving north. We all watched this object move over Phoenix. Traveling north from the eastern edge of South Mountain, then over Camelback mountain and then over toward cave creek. We watched this object until we could not see it any more over the horizon. It was visible for approximately 11 min total."],"Region":"Arizona","Date of the Event":"11/11/2010 06:24 UTC","Object Shape":"Other, Unknown","Date Submitted":"11/11/2010 11:19 UTC","Case Number":"26514","Disposition":"Unknown","Latitude":"33.294477","Source":"MUFON","Log Number":"US-11112010-0013","Summary":"HUGE!!! Red Light Object over Phoenix","trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around November 11th 2010"]}