{"Object Shape":"Disc","Sighting Duration":"00:00:02","divs":["Sighting DetailsIn December 2006, three men went missing on Mt. Hood. CNN was reporting live on the rescue operation taking place at the summit. All three men where found dead. The United States military sent in a U.S. Army Chinook helicopter to assist in the evacuation of rescue teams on the mountain. This part of the operation was being broadcast live by CNN at the time. As I was watching the live broadcast, CNN camera crews zoomed in on the Chinook helicopter as the pilot was preparing to start rescue lift operation. As I was watching this event take place, I noticed a disk shaped object moving from left to right at a very high rate of speed. The object traveled from behind the mountain on the left side of the screen, to the right and moved behind the helicopter and out of view. I would suspect that CNN still retains the video footage of this event. I am simply letting you know. What you do with this information is up to you. I prefer to remain anonymous. However, I would like to be notified by email if MUFON feels this is a very important find. As I said, CNN retains this video footage. I have looked online and at youtube for any of this footage. I have been unable to locate the actual video. I am an aviation air combat artist of 25 years as well as a graphic artist. I have put together 2 pictures that are very close to the original video I saw that day. The angle of the aircraft, mountain and object are very close too the original footage. This should give you a good guide to assist in your search. \"Please do not mistake these pictures for the real thing\"."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.526522,+-122.674737(26519)&iwloc=A&hl=en\"> mufon case (26519) map </A>","Log Number":"US-11122010-0003","Case Number":"26519","files":["/var/www/straped/mufon/html2text/26519.html.txt","/var/www/straped/mufon/more/26519_submitter_file1__UFOMt.Hood.jpg","/var/www/straped/mufon/more/26519_submitter_file2__UFOMt.Hood2.jpg","/var/www/straped/mufon/org/26519.html"],"Source":"MUFON","Viewing Distance":"Unknown","Latitude":"45.526522","Region":"Oregon","Country":"United States","Longitude":"-122.674737","City":"Portland","Object Features":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"12/15/2006 05:00 UTC","Date Submitted":"11/12/2010 01:53 UTC","Tags":"City","Summary":"Disk shaped object moving at high speed from left to right.","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around December 15th 2006","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Disposition":"Insufficient Data"}