{"Case Number":"26522","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26522.html.txt","/var/www/straped/mufon/org/26522.html"],"Country":"United States","Weather Factors":"None","Region":"Florida","Object Flight Path":"Path with directional change","Object Features":"Unknown","Latitude":"25.475122","City":"Homestead","Source":"MUFON","Longitude":"-80.470177","Summary":"Zig zagging star(UFO)","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=25.475122,+-80.470177(26522)&iwloc=A&hl=en\"> mufon case (26522) map </A>","Object Shape":"Star-like","Disposition":"Insufficient Data","trends":["There have been 21 other sightings in Homestead","There were no other sightings in Homestead on or around November 12th 2010"],"Log Number":"US-11122010-0006","Tags":"City","Date Submitted":"11/12/2010 04:36 UTC","divs":["Sighting DetailsA friend and i were walking around a local park and after some time we decided to sit on a bench where we noticed the beautiful night sky. As we stared up to the sky we saw a shooting star, as the night progressed i kept an eye out for more shooting stars and once it came time for my friend to leave as i hugged her goodbye i saw what appeared to me to be space debris though im unsure since it was the first time i ever seen anything like it. First falling with a bright white to blue, yellow-orange then red color until no longer visible but a few minutes later as i began to walk home i kept my eyes on the sky staring up as i walked and noticed a star like shine that moved across the sky in a short zig zag sort of motion but kept a steady speed. Faster than the planes i could visibly see and this what i believe to be a UFO was at a far greater altitude than the planes i could see flying above. As i watched this UFO i had a great sense of euphoria wash over me to an extent where i actually shed a tear from an intense sense of happiness and when it just vanished i knew what i saw because planes and stars do not just disappear in the blink of an eye. I hope to one day see it again and experience this moment again."],"Date of the Event":"11/12/2010 12:00 UTC"}