{"Object Flight Path":"Straight-line path","Source":"MUFON","trends":["There has been one other sighting in Herndon","There were no other sightings in Herndon on or around November 12th 2010"],"City":"Herndon","Latitude":"38.975134","Summary":"Plane without wings, escorted by 2 jets","divs":["Sighting DetailsI went outside to smoke a cigarette when I looked up and saw from the right what at first appeared to be a ball. As it went across my field of view it became apparant that it was a cylindrical object. I thought it was a plane, but the more I looked, the more bizarre it seemed to look. It looked exactly like a plane, without any markings or logos, silver in color, without any wings or tail. I struggled to keep my eyes on it as it was moving steady and fast. As I was keeping my eyes on it in disbelief, I noticed a jet with vapor trail at a much higer elevation following it's same path, maybe 4 seconds later a second jet, same vapor trail same path. I dont know if these were related, but they were there and I assure you they could definitely see the object as well. The Plane without wings was much much lower in altitude, yet it was moving much faster. I had a very wide view of the sky, and it is a crystal clear blue sky. This object took about 6 seconds to go all the way across the sky, while the jets took seemingly 4 or 5 times as long. I live right by Dulles airport, so I see planes ALL the time. I also have a pretty good idea of flight paths around or above my home as I see the planes departing in generally the same area and path and the planes arriving which is a totally other path on the other side of the sky and different direction. I have observed many ,many many planes here over the years, my favorites are when they are flying very low because you can actually get a very very detailed look at them as they pass overhead. What I saw just now was no plane. The sun was glinting off of it, I had basically 3 different angled views of it, as it approached, flew almost directly over me, and as it left. I had a very clear view of this thing. It had no wings!! It looked like a fusellage(sp?) but with no tail, no fins, no wings, no markings. I didnt even see really any windows or a cockpit windshield. The best way I can describe it is a jetliner with no wings or markings or tail mechanism. It was truly strange! I can say with utmost certainty that it was not a plane of any kind. It did not exhibit any strange flight characteristics other then it seemed to be going very very fast. I had probably a 180 panoramic view of the sky and it took this thing about 7 seconds or so to come into view and go all the way across the sky. It seemed maybe 4 times as fast as a normal jet you would see flying across the sky. I also dont think I heard any sound coming from it, and when I normally see planes at around the same appearance of altitude you can definitely hear them! I made sure to wrap my eyes around it and assess if maybe light was making the wings not visible, but this was not the case. If this thing had wings or a tail I would have beenable to see them! The jets which were at much much higher altitude were clearly visible to have wings and a general plane shape. This thing was not a plane!!! In broad daylight no less! Ive never seen anything like it! I hope someone else saw it."],"Weather Factors":"Unknown","Region":"Virginia","Object Features":"None","Object Shape":"Bullet, Missile, Cylinder","Tags":"City","Longitude":"-77.378178","Log Number":"US-11122010-0012","Country":"United States","Date of the Event":"11/12/2010 02:10 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/26528.html.txt","/var/www/straped/mufon/org/26528.html"],"Case Number":"26528","Date Submitted":"11/12/2010 02:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.975134,+-77.378178(26528)&iwloc=A&hl=en\"> mufon case (26528) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown"}