{"Object Features":"None","Object Flight Path":"Path then hovering","Log Number":"US-11122010-0009","Date of the Event":"06/16/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.517303,+-82.697663(26525)&iwloc=A&hl=en\"> mufon case (26525) map </A>","Latitude":"38.517303","Sighting Duration":"Undisclosed","Date Submitted":"11/12/2010 09:47 UTC","Disposition":"Unknown","Tags":"City","City":"Russell","Weather Factors":"Unknown","Case Number":"26525","Longitude":"-82.697663","Source":"MUFON","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/26525.html.txt","/var/www/straped/mufon/org/26525.html"],"trends":["There have been no other sightings in Russell","This sighting has never been favorited."],"Region":"Kentucky","Country":"United States","Summary":"observed a star-like object in the NNE sky accelerate at high speed, stop, accelerate and stop then spped off from view","Viewing Distance":"Unknown","divs":["Sighting DetailsI was on the back patio of the evening dated above at approx 11:30 pm (0330 UTC), and observed an unnormal star in the sky located approx. 60 degrees NNE at an elevation of approx 20-25 degrees. I noticed this because at this time a normal star rise occurs and this star-like object was not normal. The object was not a star after observation, due to the steady emmited light from the object. The object was at the same elevation but approx 10-15 degrees to the north of the normal star. After about 30 seconds the object accelerated at an unnormal rate toward the normal star, and then stopped instantly about 5-7 degrees from the original star, stayed in place for approx. 10 seconds then accelerated at unnormal speed, to the eye, next to the original star; stopped and stayed in that place for over a minute. The object then seemed to accelerate away at a high rate of speed and disappeared from sight in an instant. This was very unique, and certainly did not seem normal. The rate of acceleration was extreme, and to my knowledge there is no commercial jet, or military aircraft that can do what this object did."]}