{"Weather Factors":"None","Date of the Event":"11/12/2010 03:20 UTC","Object Features":"None","trends":["There have been no other sightings in Seven Hills","This sighting has never been favorited."],"Tags":"City","Date Submitted":"11/12/2010 08:37 UTC","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Source":"MUFON","Summary":"sphere that looked the same as a drop of mercury","Region":"Ohio","Latitude":"41.39533","map":"<A HREF = \"http://maps.google.com/maps?q=41.39533,+-81.676239(26534)&iwloc=A&hl=en\"> mufon case (26534) map </A>","divs":["Sighting DetailsI was driving south on Broadview Road just coming up over the hill into Seven Hills, OH - driving about 35 MPH. The sky was almost perfectly blue - no clouds and not hazy, and around 55 degrees outside, very calm. It was approximately 3:20PM EST. As we were coming to the top of the hill my son and I noticed an object in the sky, in front of us and to the 'slight right' of the road we were on and it was very high in the atmosphere. We noticed it was stationary. We kept watching it waiting for it to move but it didn't. It stayed this way for a few minutes. We thought it may be a very large satellite. Then it instantly traveled to the left (East) some distance to where it was- this freaked us out. It traveled there in literally a blink of an eye - instantly. There were planes in the distance but all of the planes looked like planes and \"all the planes\" had long trails behind them. What we saw was a 'SHINY, METALLIC SPHERE' that made no trail when it instantly traveled to the East. Within several seconds of the new location to the East... it vanished, just completely disappeared instantly. We were shocked and were looking all over the sky for it. It was gone. The whole experience was less then 6 minutes. I know what we saw was a UFO because nothing can be that high up staying stationary - being a very large metallic sphere, then INSTANTLY move that far to the East then VANISH. We are shocked because we have never seen anything like this - ever!"],"Case Number":"26534","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26534.html.txt","/var/www/straped/mufon/org/26534.html"],"Country":"United States","Log Number":"US-11122010-0016","Object Flight Path":"Stationary,Straight-line path","Longitude":"-81.676239","Disposition":"IFO","City":"Seven Hills"}