{"Longitude":"-82.898923","Object Shape":"Triangle","Weather Factors":"Unknown","Sighting Duration":"00:05:00","City":"lakewoodcleveland","Source":"MUFON","Object Features":"Other","divs":["Sighting DetailsAbout 3am this am, I was hearing noises in my joints neck muscles.Unable to sleep, i decided to walk around the neighborhood.I had observed helicopters flying approximately parralel to i-90 east,there is a hospital heliport at lakewood hospital but these were not lifleighthelicopter noises or patterns. I am making the asumption that this may havebeen a helicopter carrying a lighting banner but, at this hour there would notbe an event. As the craft veered from what appeared to be its path along thefreeway, it turned directly north towards my location, descended slightlyand accelerated, I again felt pressure in my foreheadsinuses, then a feelingof relief fromthe pain tension I had felt i originaly left my residence towalk get sleepy The aircraft may have been flying towards burke lakefrontairport , but the wind was from the southwest at the time and would have beenapproaching downtown cleveland too far to the south for this to be the case. The noise was neither helicopter nor single engine.,noise was very lisght anddistinct... I aksed a convenience store attendant the location is freuqented bylate shift policeman if he had heard the crafts or of an accidnet, no.....the object continued northward heading050-070 lihgts were sporadic,then I lostsight of it, about 315am......Later, about 0340, i observed similar light in a light ascent to the southwest,reached an altitude of perhaps 2500 then became stationery dissapeared.The ringing in my ears and headache ceased until morning when it resumed..."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.426197,+-82.898923(2653)&iwloc=A&hl=en\"> mufon case (2653) map </A>","Latitude":"40.426197","Case Number":"2653","Object Flight Path":"Straight-line path","Date of the Event":"10/31/2003 03:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/31/2003 03:10 UTC","trends":["There have been no other sightings in lakewoodcleveland","This sighting has never been favorited."],"Summary":"triangle.","Country":"United States","Disposition":"Insufficient Data","Tags":"City","files":["/var/www/straped/mufon/html2text/2653.html.txt","/var/www/straped/mufon/org/2653.html"],"Log Number":"","Region":"Ohio"}