{"divs":["sighting detailswas driving home when a low very bright object in the horizon caught my eye. i am so glad i chose to keep my camcorder in the car at all times and this is why!! event happened between 7:30pm and 7:45pm est. object moving at a very low altitude, an airplane even passes above it to show how low this ufo was. the entire object glowed a bright gold color then while filming, suddenly lights up all red. it was very difficult to follow the object due to the whole object seemed to be flashing off and on. i believe it may have even morphed\\changed shape towards the end. then the object completely is gone. i even scan the skies in infrared nightvision to try to find and it disappeared. no clouds and no trees in it's path of travel while filming. where did it go?? i know it sounds like right out of a sci fi movie but it happened. i filmed the object moving south to north (from canfield toward austintown). no, this was not the iss, as confirmed by the nasa website. i've made a video proving this theory wrong. the iss had already passed over (north to south btw so not possible!!) at 6:30pm est. would have only been seen for a duration of 3 minutes video can be seen on youtube with same title as short description november 12, 2010"],"Log Number":"US-11122010-0019","Country":"United States","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around November 12th 2010"],"Disposition":"IFO","Region":"Ohio","Case Number":"26537","Object Shape":"Circle, Oval, Unknown","Date Submitted":"11/12/2010 09:52 UTC","City":"Youngstown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.10322,+-80.643619(26537)&iwloc=A&hl=en\"> mufon case (26537) map </A>","Sighting Duration":"00:01:30","Latitude":"41.10322","files":["/var/www/straped/mufon/html2text/26537.html.txt","/var/www/straped/mufon/org/26537.html"],"Longitude":"-80.643619","Source":"MUFON","Tags":"City","Date of the Event":"11/12/2010 07:30 UTC","Viewing Distance":"Unknown","Summary":"UFO Glowing Orb Disappears on Camera Ohio"}