{"Log Number":"US-11122010-0014","Region":"New Jersey","Case Number":"26532","Object Features":"Dome","divs":["sighting detailsi want people to know this. my name is *(wit's name deleted--cms\\sg) im 25. been running **(business name deleted--cms\\sg) in lebanon for 6 years. very interested in this subject, elated to finally be a part of it. i get to work at ten a.m. and do my normal routine. run the store. background: store is connected to others in stripmall fashion. to my right is another business (the owner i had come outside) and to that businesses right is another. (this is run by a manager like me) both of these other people are women, above middle age and very grounded in \"the real world\" so. here we go. i like to connect with my customers. one such customers knew i would be interested in this so- i receive a call on my business phone and its (this woman\\customer) she is driving country roads in bedminster (miles away 10-20min) and tells me she sees a ufo. i hurry out front and immediately see 3 planes with classic white plume-trails behind them. as i tell her i see nothing... i see it. this wasnt just an orb. it had form. small (very far away?) but the planes (farther away) were minuscule so i imagine it could be huge. i had to get witnesses. i ran to the business with the manager first. she came out and spotted it in seconds.. we both gawked as the object seemed to tip, casting the suns rays off it as though it were a mirror in the sky for a split second. then it travelled a bit, seeming slow until it actually looked like it investigated a passenger plane i mentioned earlier. yes. farther away. at this time the owner of the business in between ours (and her customers) came out as well.. many were older and had difficulty fighting with the sun (it was crystal clear in good ole jerz today)to see it. one woman saw it, said \"i dunno i think your all smoking too much lsd\" and went inside. the other customers saw it but didnt find it interesting enough to stay and watch. (this is funny- one woman said \"its a balloon! a weather balloon.....object disappears and reappears miles away in front of all of us.....\"oh wait\".. she finishes her thought with an entirely new opinion) so thats it. what we witnessed was a shiny or gleaming object fly around above hunterdon county. it flickered in an out of existence, it tilted and tumbled, had depth (3d object), travelled, came close enough (it looked like) to a passenger plane that the passengers would have to be blind not to see it (they probably didnt). and this whole event would have gone unnoticed if it were not for my customer 20 minutes driving distance away having seen it and calling my attention to it. what i am wondering is this: two points of sight on one object in the sky... is this triangulate-able? could someone with the skill be able to figure out exactly where it was (how high + distance travelled) if i was able to show him or her where i was and where this woman was when we saw it?? i dont claim to know what this was. i do know what it wasn't. i have been studying the sky and the things in it for years. and my father is a military buff, especially when it comes to aeronautics, so i at least know something. \"ha\" im glad i got this out here tonight because i cant wait for the \"commonplace explanation\" that will surely be given to this object somewhere in the media possibly tomorrow. so there u have it. i have witnesses (3 not counting myself) from two separate places miles apart, on a crystal clear day (u couldnt even see pennsylvania the air was so clean >:) i would like everyone to know at least that i have gone from someone who truely believes, to someone who knows belief isnt necessary anymore. ps. i asked everyone the same question. \"have u ever seen anything like this in your life? anything even similar?\" the answer was a unanimous \"no\""],"Country":"United States","Object Shape":"Cone, Circle, Disc, Egg, Oval, Sphere, Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.6373,+-74.866886(26532)&iwloc=A&hl=en\"> mufon case (26532) map </A>","Latitude":"40.6373","Date of the Event":"11/12/2010 03:30 UTC","Source":"MUFON","Disposition":"Insufficient Data","City":"Clinton Township","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/26532.html.txt","/var/www/straped/mufon/org/26532.html"],"Summary":"Ufo was seen VERY clearly cloaking, uncloaking by 1 business owner and 2 managers of other small businesses.","Weather Factors":"None","Sighting Duration":"Undisclosed","Date Submitted":"11/12/2010 07:39 UTC","trends":["There have been 5 other sightings in Clinton Township","There were no other sightings in Clinton Township on or around November 12th 2010"],"Longitude":"-74.866886","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City"}