{"Country":"United States","City":"Washington","Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":"US-11132010-0006","Object Features":"Unknown","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around November 12th 2010"],"Latitude":"38.902142","Sighting Duration":"Undisclosed","Date Submitted":"11/13/2010 07:26 UTC","Date of the Event":"11/12/2010 06:05 UTC","Weather Factors":"Does Not Apply","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.902142,+-77.032356(26545)&iwloc=A&hl=en\"> mufon case (26545) map </A>","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","Disposition":"Unknown","Longitude":"-77.032356","files":["/var/www/straped/mufon/html2text/26545.html.txt","/var/www/straped/mufon/org/26545.html"],"Case Number":"26545","Summary":"Triangle Flying Low Over Busy DC Street","divs":["Sighting DetailsI was sitting in a pulled over car with a friend waiting for her daughter to emerge from a music lesson. Time was approximately (within a minute or two) 6:05 pm. My friend and I were talking and she got a call on her cell phone and I was sitting in the passenger seat looking south. A triangle shaped object suddenly came into view and flew east to west over the 4500 block of Wisconsin Avenue. I saw it for approximately 10 seconds. My friend did not see it. It was flying low (lower than a helicopter we saw a minute or so later) and it had white or yellow lights all along it. The lights looked kind of bulb-like and reminded me of old fashioned Christmas tree lights in shape and appearance. The sighting was very quick and almost as soon as I thought \"what was that\" it had flown out of view. There are many trees in the area and they blocked further view. The object was flying smoothly and at about the speed of a helicopter. I was in a car with the windows shut, so I don't know if it made any sound. The flying triangle definitely wasn't a helicopter or conventional plane. It was over an extremely busy street in rush hour and I hope others saw it and will report it."],"Region":"District of Columbia"}