{"Date Submitted":"11/13/2010 01:36 UTC","Log Number":"US-11132010-0002","divs":["sighting detailswas perfectly clear night with partial moon low in horizon. stars were clear and no clouds. had been outside walking from house to lake, multiple times , working on temporary water supply pump that had quit. as a quick background, have been a pilot since 15 years old,(fixed wing), and from 1987 to 1998 had trained, owned, and flew a bell jet-ranger helicopter with a federal part 135 certification. i know all my aircraft, military, commercial and civilian. i also studied celestial physics in college and have been an amateur astronomer since childhood. very aware of light configuration and appearance of landing lights at night. lights had a slight golden look. object was south of me moving from my right to left at an estimated distance of 5 miles max. there were no strobes or noise. size was approx 1\\2 of a full moon diameter.it's speed was probably under 100mph. i have seen the iss 100 plus times and this was not it or even close, and the time made that impossible. i ran to the house to get binoculars,(15 seconds max). upon return, the object had vanished, and i have a clear view and no obstructions. moon was low in western sky but had not set yet. i scanned it's estimated path and it was gone, both by eye and with bino's. tonight i was doing the same routine and noticed the same object a little earlier, but it was lower in the horizon but obstructed by trees in the horizon and was unable to obtain picture or a good view. it remained visible for about a minute, but at a much greater distance, and about the same west to east path. definitely not a plane or satellite. it was difficult to determine if it was a fattened disk or cylinder, but it was large. much larger than any commercial aircraft.i experienced no fear, just wonder, and wanted to document it by picture and i have the perfect 14 mp high def camera with 35x optical zoom that just didn't care to be available, but would have if there was more time. this is the first time i have ever submitted a report of any kind. am well studied on the subject and keep abreast of the phenomena almost daily.as so many say,\"the next time\"! i may be contacted but have little to add. i will keep looking up. also there are no city lights that could have given any illusion. thanks."],"Source":"MUFON","Summary":"Two Bright Headlights with Light extension on Rt. side illuminated upwards moving West to East","Case Number":"26541","City":"Rutland","trends":["There have been 7 other sightings in Rutland","There were no other sightings in Rutland on or around November 13th 2010"],"Tags":"City","Sighting Duration":"00:00:20","Object Shape":"Cigar, Cylinder, Disc, Star-like","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.618024,+-72.971606(26541)&iwloc=A&hl=en\"> mufon case (26541) map </A>","Disposition":"Unknown","Longitude":"-72.971606","Viewing Distance":"Over One Mile","Date of the Event":"11/13/2010 08:10 UTC","Region":"Vermont","files":["/var/www/straped/mufon/html2text/26541.html.txt","/var/www/straped/mufon/org/26541.html"],"Weather Factors":"Unknown","Latitude":"43.618024","Object Flight Path":"Straight-line path","Object Features":"Appendage(s), Other"}