{"Object Flight Path":"Stationary","Date Submitted":"09/12/1997 08:13 UTC","Sighting Duration":"01:59:00","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/2654.html.txt","/var/www/straped/mufon/org/2654.html"],"Object Features":"Other","Longitude":"-84.508545","Date of the Event":"09/12/1997 08:13 UTC","Summary":"the ship i saw was long and gold color","Case Number":"2654","Tags":"City","Object Shape":"Other","City":"Kingston","Latitude":"35.880908","Source":"MUFON","trends":["There have been 5 other sightings in Kingston","There were no other sightings in Kingston on or around September 12th 1997"],"Country":"United States","divs":["Sighting DetailsOn September 12, 1997, my son and I went to mow Dogwood Church and Cemeteryafter I got off my job. When we were finished, I asked my son what time it was. He said it was 850 pm.A few minutes later, while I was loading my mower on my trailer, my son said,What the hellI asked, Whats wrongHe pointed to the sky and said, That star next to the full moon is moving.I looked up, and at first I couldnt tell that the star was moving. Then Inoticed that it moved forward and stopped. I stopped watching it, and went backto tying my mower on my trailer. When I got in between my truck and trailer, Ilooked up again. It stated to move forward again. I thought I was tying down mymower with my eyes closed. I was feeling weird.As I turned to my son, I asked him, Is it goneMy son said, Didnt you see it leaveI said, No. Where did it goHe said, It went straight up.I said, Damn it I miss it.We got in the back of my trailer and set on the rails. My son was on one sideand I was on the other. We started talking about it and looking at the sky. Wesat there a little while before we got out of the trailer and got into the truckto go home.I turned to my son and said it might have been a meteorite. When we got home, Iwalked into the house and I told my wife we saw a UFO at the cemetery. I left itat that. I didnt say any more about it the rest of the night.The next day, I got up and went to work. I told the guys at work that I saw aUFO at the cemetery. I left it at that, I didnt say any more about it the restof the day.As days went by, I had a flashback like a TV screen coming on in my head. Later when I would talk about it, I would lose my eyesight for about four or fiveseconds before my vision would return. It only happened when I would talk aboutit.I dont lose my eyesight any more. I guess it is all the memory I am going toget. This is what I remember in my flashba"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.880908,+-84.508545(2654)&iwloc=A&hl=en\"> mufon case (2654) map </A>","Region":"Tennessee","Log Number":"","Weather Factors":"Unknown","Disposition":"Unknown"}