{"Log Number":"US-11132010-0008","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-71.610101","trends":["There have been 2 other sightings in Whitefield","There were no other sightings in Whitefield on or around November 12th 2010"],"Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsObject was first spotted by son of homeowner. He was outside on porch facing west. I was inside house around 8 pm when homeowner called me outside to view object. I stopped long enough to grab small digital camera. When I got outside this object was just coming into view over the trees at the end of our drive. We live within 5 miles of a small airport. This object looked like it could have been a plane landing. The only thing was it was heading toward the NE and the airport is SE from us. It was probably about 200 to 500 feet up. It was slowly descending as it continued over us at a quick speed. Once outside I ran down the drive with camera trying to turn it on and grab a quick shot. It was moving too fast to get any kind of focus on it. Camera proved useless. The object I was now seeing, from I assume it's tail end, was a V or pointed front, with flaired end. There were three lights, one I believe was red. This happened quick. It may have been a boomerang shape, too dark to make a definite call on that. Although the lights to me appeared to be on the back underside of object with the other (red) light in the middle of front underside. It moved over houses and trees the next street over, still slowly descending, then out of view. There were three of us who saw this object, and two of us jumped into our car and tried to get site of it up the road. We went about two miles but never again saw this object. I do not think it was any military or local air plane, it was too quick and soundless. As I said it looked like it was landing. We live in the White Mountains, and aside from that this place is called the Grand Bois Du Nord for a reason. There are trees everywhere. If this thing was coming down that quick in that direction we would have heard the crash. I was going to report this last night but did not. Was waiting to see if anyone else said anything about a strange craft."],"Date of the Event":"11/12/2010 12:00 UTC","Case Number":"26547","City":"Whitefield","Date Submitted":"11/13/2010 10:30 UTC","Weather Factors":"Unknown","Summary":"Boomerang ( V shaped) object with three lights moving SW to NE over us. No noise, quick, about the height of an aircraft coming in to land.","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26547.html.txt","/var/www/straped/mufon/org/26547.html"],"Latitude":"44.37311","Object Features":"Undisclosed","Region":"New Hampshire","Disposition":"Unknown","Object Shape":"Boomerang, Chevron, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=44.37311,+-71.610101(26547)&iwloc=A&hl=en\"> mufon case (26547) map </A>","Tags":"City"}