{"Weather Factors":"None","Sighting Duration":"00:03:00","Date Submitted":"11/13/2010 02:23 UTC","Object Flight Path":"Hovering then path","Date of the Event":"11/11/2010 06:15 UTC","files":["/var/www/straped/mufon/html2text/26549.html.txt","/var/www/straped/mufon/org/26549.html"],"divs":["Sighting DetailsI was leaving world gym off south cobb drive at approx 1815. i was on atlanta road waiting in traffic to get onto 285. Im facing the atlanta downtown skyline and I notice a huge lit oval shape which was moving very slowly. it appeared to have a cigar shaped object in the center of the light. the reason i know it was moving because i was sitting still waiting to take a left onto 285 and in my field of view were a few sky scrappers. it was slowly moving left to right across my field of vision. I observed this object for approx 2-3 mins. Also during that time there were several civilian jet liners and helicopters in my field of view and they were dwarfed. When i 1st observed it i said to myself thats a really bright blimp, then after a few seconds of watching it i concluded that i did not believe it was a blimp anymore. I lost sight of the object because i was in traffic and had to take a left onto 285. There are a lot of sporting events this weekend so i guess it still couldve been a blimp, but i thought i should report this after acouple days of thinking about it."],"Object Shape":"Cigar, Oval","Case Number":"26549","Object Features":"None, Unknown","trends":["There have been 95 other sightings in Atlanta","There was one other sighting in Atlanta on or around November 11th 2010"],"Country":"United States","Source":"MUFON","Log Number":"US-11132010-0010","Latitude":"33.753655","Region":"Georgia","Longitude":"-84.380932","Tags":"City","City":"Atlanta","Viewing Distance":"Over One Mile","Summary":"bright oval light with cigar shape in the middle moving very slow and quite big","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=33.753655,+-84.380932(26549)&iwloc=A&hl=en\"> mufon case (26549) map </A>"}