{"City":"New Orleans","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26548.html.txt","/var/www/straped/mufon/org/26548.html"],"Weather Factors":"Unknown","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around November 13th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.960886,+-90.063622(26548)&iwloc=A&hl=en\"> mufon case (26548) map </A>","Sighting Duration":"Undisclosed","Case Number":"26548","Country":"United States","Tags":"City","Log Number":"US-11132010-0009","Region":"Louisiana","Object Flight Path":"Undisclosed","divs":["sighting detailsi was thinking about going to the po boy festival today and so checked the french quarter cam at *(link moved to additional evidence section--cms\\sg) to see what the weather was like. there was a large object floating in the sky just beyond rampart st. at first i thought the cam was malfunctioning and was somehow \"freezing\" the picture. i thought that perhaps it was a helicopter frozen in flight, but then i could see cars moving along rampart. you know how it is...i just sat there and stared at the screen. the thing must have been making some movement because sometimes i could see light glint off of it. after a few minutes, i realized that there was more than one stationary object in the sky, but they were much farther off. i went to the mississippi bridge cam to see if i could see more of them but there were none visible in that direction. when i returned to the fq cam, the large object was gone and only one of the smaller (or farther) objects remained. i just checked; it is still there: *(link moved to additional evidence section--cms\\sg). look to the right of the building on the left. was the larger object the goodyear blimp? this is a festival day in nola. but how could it have disappeared so quickly? i then went to mufon to see if anybody else had reported from nola and when nobody had, i decided to report in spite of not being there."],"Summary":"Silvery flattened oval seen stationary 10 min over French Quarter on FQ cam; later disappeared.","Source":"MUFON","Date Submitted":"11/13/2010 11:30 UTC","Longitude":"-90.063622","Date of the Event":"11/13/2010 08:20 UTC","Object Features":"Undisclosed","Object Shape":"Cigar","Latitude":"29.960886","Disposition":"IFO"}