{"Weather Factors":"Unknown","Latitude":"38.442657","files":["/var/www/straped/mufon/html2text/26544.html.txt","/var/www/straped/mufon/org/26544.html"],"Disposition":"Unknown","Longitude":"-122.707131","map":"<A HREF = \"http://maps.google.com/maps?q=38.442657,+-122.707131(26544)&iwloc=A&hl=en\"> mufon case (26544) map </A>","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around September 29th 2004"],"Case Number":"26544","Sighting Duration":"00:00:03","Tags":"City","Viewing Distance":"21-100 Feet","Object Shape":"Square, Rectagular","divs":["Sighting DetailsSeptember 29, 2004 (date from pilot's logbook entry) Flying a Piper Cherokee PA-28-140, southbound, 100 knots, 10pm, 6500ft, west of Santa Rosa, over the Pacific coast - had just looked west for jets, east for jets, south for jets, listening to Oakland Center. All quiet. Alone in the sky. Nothing near me and the Cherokee was purring and the heater was, of course, toasting my right foot. Luminescent blue, a glowing rounded corner rectangle, maybe 5 ft x 8 ft x 2 ft thick at my 10 o'clock, flashing cross the mighty Cherokee's nose and off out over the ocean to my 2 o'clock. 2-3 seconds total. Instinctually, I slammed the yoke forward and turned hard right. At the same time I thought... I JUST LOOKED and there was nothing. HOW could I could have missed a jet's landing light? WHY is there a jet at 6500 feet traveling west here? It's too late to \"dive\" out of the way, I'm going to get hit by turbulence no matter what. I didn't get physically hit? Hey, if it's a landing light, how can I could still see it as it winked out over the ocean? No noise, no wake turbulence, no nothing, except a pounding heart. Scoobie Doo says \"Huh?\" This made no sense. On first instinctual impression, a jet - then thinking about it, a meteor, A luminescent blue meteor? But, it didn't \"get dim\" from looking through a smoky trail, over the ocean, it just \"winked out\". making me think: no smoke trail. And it was blue, no sparks, no flames, looked symmetrical and had a smooth or maybe ribbed surface. I couldn't really figure out how close it was - but, it appeared at my 10 o'clock and went over the ocean at about my 2 o'clock - and it was only visible for 2-3 seconds. So - it had to be darned close. If I had to guess, it passed across my nose, 50 to 80 ft in front of me. Weirdest thing I've seen. I can't help thinking that some ET teenager swiped the keys to the saucer when the parents were out and went out with his buddy's for a night of ET style \"cow tipping\"...... btw: I was so shocked that I couldn't talk enough to call Oakland Center - ZOA......."],"Date Submitted":"11/13/2010 03:12 UTC","City":"Santa Rosa","Country":"United States","Object Flight Path":"Straight-line path","Summary":"Luminescent blue, rounded rectangle almost hit airplane: night, 6500 ft","Region":"California","Object Features":"Patterned Surface","Date of the Event":"09/29/2004 10:00 UTC","Log Number":"US-11132010-0005","Source":"MUFON"}