{"Weather Factors":"None","Object Flight Path":"Path with directional change","Log Number":"US-11132010-0004","Case Number":"26543","Object Features":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailsi was in my driveway having a cigarette and looking at the stars and noticed that an airplane was coming in from the east and coming directly over (which is normal because i live about 2 miles from an airport) but thought it looked akward. instead of just the red flashing light it also looked like it had a white light on the front. as it came closer it seemed like a single cylindrical-shaped aircraft (because of the altitude i could only see the lights) and also seemed to rotate counter-clockwise but passed under a few stars which i could see between the two lights, showing me that it was actually two aircraft ( one distinctly being an airplane). as they went directly above me i watched the single white light circle the plane 1 1\\2 times then quickly darted in front again, lead for a few seconds, then make a hard right turn and accelerate up and to the northwest before disappearing. i also noticed that the faint sound of the jet was all that i heard, not anything unusual like i would have expected, just the sound of a single aircraft. the object moved swiftly and fluidly and did not flash. i am very excited to have seen this as this is the fourth time in my life that i have seen a ufo and i hope to see more! also the airplane did not land here but kept going in the general direction towards seattle from lewiston."],"Disposition":"Unknown","Date of the Event":"11/08/2010 12:00 UTC","Viewing Distance":"Unknown","Country":"United States","Date Submitted":"11/13/2010 02:46 UTC","Latitude":"46.406679","map":"<A HREF = \"http://maps.google.com/maps?q=46.406679,+-116.998889(26543)&iwloc=A&hl=en\"> mufon case (26543) map </A>","trends":["There have been 4 other sightings in Lewiston","There were no other sightings in Lewiston on or around November 8th 2010"],"Longitude":"-116.998889","Object Shape":"Other","City":"Lewiston","Region":"Idaho","Tags":"City","Summary":"A single white light flew in front of a commercial airliner, circled, continued to lead, turned hard right and ascended quickly to northwest then vanished","files":["/var/www/straped/mufon/html2text/26543.html.txt","/var/www/straped/mufon/org/26543.html"],"Source":"MUFON"}