{"Sighting Duration":"04:00:00","Disposition":"Unknown","Longitude":"-79.136646","Object Shape":"Cone, Disc, Oval, Star-like","Date Submitted":"11/13/2010 07:46 UTC","Summary":"UFO Flying and hovering and Emitting Mainly White and Blue light.","Date of the Event":"11/12/2010 10:00 UTC","Tags":"City","Log Number":"US-11132010-0013","Source":"MUFON","Object Flight Path":"Path then hovering","trends":["There have been 3 other sightings in Lynchburg","There were no other sightings in Lynchburg on or around November 12th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/26552.html.txt","/var/www/straped/mufon/org/26552.html"],"Region":"Virginia","Latitude":"37.417744","Object Features":"Dome, Window(s)","Country":"United States","Weather Factors":"Unknown","Case Number":"26552","Viewing Distance":"Unknown","City":"Lynchburg","map":"<A HREF = \"http://maps.google.com/maps?q=37.417744,+-79.136646(26552)&iwloc=A&hl=en\"> mufon case (26552) map </A>","divs":["Sighting DetailsAfter hearing about the event near Richmond Va. I realized I have seen at least two objects in the night sky for the past week of Nov. 8 through the 12th near where I live. This one appears to be imitating a star and it stays just below the small dipper constellation through out the night in the Eastern sky after 10:30 PM. It also moves slowly in a zigzag and circular or oval pattern in a small area. I want to know really what it is. I say craft, because it could be alien or human. I just don't know and want answers. The other one, not filmed, was only around 1 night on Wednesday 11-10-2010. It was out that night for only 40 minutes in the North West close to the horizon. About the video. My DV Camera is about 8 years old and doesn't have night vision, but I was using Night Shot mode with low lux enabled. The only editing I did was clip the shaky movement out after the camera would try to focus on the intense bright blue, white and blinking light. The Blur around the object is from me zooming all the way in very fast. My feelings of the object is: I get very fixated and intrans-ed by it. I feel like I could some how communicate with the object. Very weird feeling. I am happy that I have finally seen one of these things with my own eyes, but at the same time a little scared too. I have also noticed 2 other star-like objects next to small dipper constellation. They blink same way but with less intensity. So, the UFO I have filmed and the other 2 star-like objects would make a much bigger triangle shape."]}