{"Disposition":"Unresolved","Case Number":"26557","Sighting Duration":"00:01:15","Source":"MUFON","trends":["There have been 2 other sightings in Trenton","There were no other sightings in Trenton on or around November 9th 2010"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.102072,+-77.571652(26557)&iwloc=A&hl=en\"> mufon case (26557) map </A>","Date of the Event":"11/09/2010 12:00 UTC","Log Number":"CA-11132010-0018","Latitude":"44.102072","City":"Trenton","files":["/var/www/straped/mufon/html2text/26557.html.txt","/var/www/straped/mufon/org/26557.html"],"divs":["Sighting DetailsDriving down Highway 401 Eastbound near Trenton Ontario I noticed a falling star or meteor streaking South to North directly in front of me or so I thought. But also noticed the light did not diminish, or fade and after a long streak across the sky it made a sharp 45 degree turn and traveled another 5 seconds and disappeared. It did not burn out or fade just vanished! I travel this road every night doing a run in a tractor trailer from Cambridge Ontario to Kingston Ontario and back. About the same time and on the same highway. I have noticed a similar event two weeks prior at 4:00 am heading West. I dismissed it as being tired and my eyes perhaps playing tricks on me. This particular event the sky was perfectly clear, and was directly in front of me, in plain sight. I also noticed on your website sightings over the North tip of New York state, a stone throw from my location. I immediately picked up my Blackberry and messaged my wife to inform her of what I saw, hoping she was still up. Also the message would would document the time at 1:14 am. I simply stated \" I think I just saw my first UFO, or maybe second!\" Both our interests have been with the Paranormal and in Ufology, and our eyes are more into the stars than ever."],"Country":"Canada","Viewing Distance":"Over One Mile","Object Features":"Unknown","Region":"Ontario","Date Submitted":"11/13/2010 10:12 UTC","Object Flight Path":"Path with directional change","Summary":"Appeared as a falling star","Longitude":"-77.571652","Weather Factors":"None","Object Shape":"Star-like"}