{"Object Shape":"Circle, Flash, Sphere, Star-like","Weather Factors":"Unknown","Case Number":"26556","Date of the Event":"11/13/2010 07:35 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Log Number":"US-08072011-0040","trends":["There have been 3 other sightings in East Haven","There were no other sightings in East Haven on or around November 13th 2010"],"Viewing Distance":"Unknown","Longitude":"-72.865364","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.278958,+-72.865364(26556)&iwloc=A&hl=en\"> mufon case (26556) map </A>","Disposition":"Unknown","Object Features":"Unknown","divs":["sighting detailsat approx. 7:35 pm over the horizon in the south west, two lights appeared very close to the horizon, changing color, size and shape. the colors ranged from red, white, blue, and amber\\orange. about the same time a chopper from the north (unidentified) approached; the lights diminished and seem to vanish. a few minutes later as the chopper retreated to the south, the lights appeared again. they were very bright, but not at the same time. it seem to be a game of lights between them. others began to appear later around 7:55 pm towards the north\\northwest carrying the same characteristics. they seem to stay in the same position for some time. they formed an arc or triangle at different points on the sky. one being on the horizon, the other directly above it and then one over the city lights in the west. more started to appear and there was a total of 5 flashing and become bright changing from the colors of white-red-orange. this happened about 8:20- 8:30 pm. then as they began to ascend higher, they solidified into a low orange color, and \"glided\" away. they formed a noticeable arc in the sky. when i saw them i knew that they werent planes or weather balloons with flares as most of the experts would state. i know what planes look like, i see them every night. this has been happening for the past two days, but the real changes occured the 13th between the hours of 7:35- 8:40 pm. i was excited to verify that my feelings about them were correct and able to see them for the first time instead of watching from others. i wasn't even thinking or looking for them, i was feeding my cat when i noticed them. i'm not concerned with their agenda, because we humans have no real control, only our government which continues to deny everything. they have better technology and as far as i'm concerned they will do what they want regardless of our desires. i just wish that the government would lie so much in a silly way with \"weather balloons, children's balloons, rc helicopter, military flares, unamed rocketeer, etc..\" don't they know that most people are tired of that?"],"files":["/var/www/straped/mufon/html2text/26556.html.txt","/var/www/straped/mufon/org/26556.html"],"Source":"MUFON","Latitude":"41.278958","Tags":"City","City":"East Haven","Date Submitted":"08/07/2011 12:09 UTC","Region":"Connecticut","Summary":"star-like object (sometimes) changing shape and color, steady and then moving sometimes in a zig-zag."}