{"Country":"United States","Region":"Arizona","Disposition":"Unknown","Object Shape":"Star-like","Source":"MUFON","Weather Factors":"None","City":"Prescott","Date of the Event":"11/13/2010 06:23 UTC","Summary":"Bright glow moving at high rate of speed, then turned red as slowed down.","Viewing Distance":"Unknown","Latitude":"34.548924","Tags":"City","Object Features":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting Details We were bbq'ing in my back yard and I spotted the object in the northern sky moving S.E. I thought it may be a satellite but I am very familiar with the way those show in the night sky. It was very bright and moving fast with no sound. Midway through the viewing what looked like a shooting star appeared directly under it. The shooting star seemed to be more like a missle that was shot at the bright object and missed. A couple minutes after that the object slowed down drastically and changed color from an intense white to a dull red color. We lost sight of the object behind the mountain and about 3 min later what seemed to be two military f-16 fighters appeared in the same area that the object traveled. We could clearly hear these two jets and they had normal blinking aircraft lights. After the occurence we really could'nt believe what we had just seen especially when the jets showed up. I believe that what we saw was advanced aircraft or something not from here. The missle type object is what made us really wonder."],"Date Submitted":"11/14/2010 01:48 UTC","files":["/var/www/straped/mufon/html2text/26559.html.txt","/var/www/straped/mufon/org/26559.html"],"trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around November 13th 2010"],"Log Number":"US-11142010-0001","Longitude":"-112.458532","map":"<A HREF = \"http://maps.google.com/maps?q=34.548924,+-112.458532(26559)&iwloc=A&hl=en\"> mufon case (26559) map </A>","Sighting Duration":"00:10:00","Case Number":"26559"}