{"trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around November 10th 2010","This sighting has never been favorited.",""],"City":"St Louis","Longitude":"-90.193224","Case Number":"26554","Log Number":"US-11132010-0015","Summary":"White Line-Spheres object over St. Louis Sunrise in 3 different pictures","Disposition":"Hoax","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.632112,+-90.193224(26554)&iwloc=A&hl=en\"> mufon case (26554) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26554.html.txt","/var/www/straped/mufon/more/26554_submitter_file1__2010111007322701.jpg","/var/www/straped/mufon/more/26554_submitter_file2__2010111007323801.jpg","/var/www/straped/mufon/more/26554_submitter_file3__2010111007324401.jpg","/var/www/straped/mufon/org/26554.html"],"Date of the Event":"11/10/2010 07:32 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"00:00:17","Date Submitted":"11/13/2010 08:40 UTC","Tags":"City","Latitude":"38.632112","Object Shape":"Cigar, Sphere, Other","Region":"Missouri","Object Features":"Undisclosed","divs":["Sighting DetailsThis Wednesday morning the sunrise was beautiful and I took more than several pictures for several minutes, panning across the sky in them. The first three north pictures contain a white line in the sky that appears to have two spheres within it or along it, one bigger and one smaller and in different positions in each picture - although the white line appears to be in the same position in the sky in each picture. Each attached image is a cropped of the original, two rotated to compensate for the unaligned frame and house - no other adjustments were made to the originals. Why this appears to truly be an unidentified flying object, by definition, is that two of the pictures had a twist in the frame relative to the horizontal line of the house top. When that was compensated for with software, the white line-sphere object appears to be in the same position in the sky! What's different in the images is the amount of light the camera let in, the positions of the spheres of the line, and the slight differences in the frame of each due to photography only being a hobby of mine and I couldn't crop them exactly the same. Even with my intermediate knowledge of digital imaging, I realize that it is unlikely that a camera anomaly caused these images as the white line-sphere was in a different position and angle in each original, yet rotated and cropped to the same position which is more likely of an actual object in sky there. The three pictures span 17 seconds. Another picture of the north taken almost 4 minutes later did not have the object in it. I did not see the object with my eyes at the time, I noticed it when I downloaded the images from my camera to computer two days later. These are all cropped images yet all are at 100 percent resolution of the camera image density."],"Country":"United States"}