{"Log Number":"","Disposition":"Insufficient Data","Longitude":"-80.151448","trends":["There have been 3 other sightings in Meadville","There were no other sightings in Meadville on or around October 30th 2003"],"Source":"MUFON","Summary":"Large fast moving orange orb with no tail","divs":["Sighting Details1. I was driving northbound on I-79 at mile marker 160, near Meadville, PA.2. I noticed the object due to its extreme level of illumination, and its speed.3. I first thought it to be a plane, but it was much lower in altitude than aplane, and moving much faster than a plane. Horizon to horizon in under 10seconds The objects bright glow did not change in intensity as it passed me fromright to left, indicating that it was not the headlights of a plane. The objecthad no flashing marker lights, and there were planes in the area to compare.4. I immediately pulled the car over to observe the object. I had a camera, butthe objects speed did not give me the time to get the camera.5. The object passed from East to West over the highway about 14 mile in frontof me, moving pretty fast. It then turned North and disappeared over thehorizon. After about 1-2 seconds, it rose over the horizon again very briefly,then disappeared below the horizon again. Conditions were very clear, and itdid not leave any trail, light or dark, behind it. It is hard to estimate theexact object distance and speed, as I do not know the actual size of the object. My estimate is it was 100 feet in diameter, and at about 1,500 to 2,000 feet inaltitude."],"files":["/var/www/straped/mufon/html2text/2656.html.txt","/var/www/straped/mufon/org/2656.html"],"Date of the Event":"10/30/2003 08:00 UTC","Region":"Pennsylvania","Tags":"City","Date Submitted":"10/30/2003 08:00 UTC","Case Number":"2656","City":"Meadville","Latitude":"41.641444","Sighting Duration":"00:00:59","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.641444,+-80.151448(2656)&iwloc=A&hl=en\"> mufon case (2656) map </A>","Country":"United States","Object Shape":"Sphere"}