{"Viewing Distance":"Unknown","Weather Factors":"None, Does Not Apply","Case Number":"26561","trends":["There have been 45 other sightings in Long Beach","There was one other sighting in Long Beach on or around November 13th 2010","This sighting has never been favorited.",""],"Date of the Event":"11/13/2010 12:00 UTC","Region":"California","Latitude":"33.812657","Object Features":"None","Longitude":"-118.152756","Disposition":"Unknown","Date Submitted":"11/14/2010 03:18 UTC","Tags":"City","Summary":"String of Orange Orbs","Source":"MUFON","Log Number":"US-11142010-0003","divs":["Sighting DetailsJust before 7:00 pm this evening (November 13, 2010) my wife and I heard our downstairs neighbor calling us to the back yard. My wife went out and then yelled for me to come outside quickly because there were \"UFOs out here..\" I ran out to the back balcony and looked up to see several bright orange orbs in the sky looking towards the ocean and the direction of Catalina Island. I quickly ran back into our apartment and grabbed my point-and-shot digital camera. I returned to the balcony and was able to record the last 2 and a half minutes of the sighting while the last orb brightened for a last time and then faded to a dark gray and continued on it's course. I personally saw two bright orange orbs, my wife saw three (because she went outside first) and our neighbor said she saw 7-8 orange orbs, all in a line across the sky. I am not sure how far away the orbs were from us, but they were unlike anything I have ever seen. They seemed to burn from inside, but it wasn't what seemed to be propelling them. They did not fall through the sky like burning debris, but like a vehicle moving on a set course from west to east across the sky. While it can't be seen because of the video quality, the orbs continued along their eastern course as dark gray orbs, each with a very dim orange glow inside. Included with this report is several graphics I made this evening right after the event: 1. a time-chart of the path of the one orange orb I was able to videotape. 2. a map showing our field of view and the flight path of the orange orbs The video is unedited."],"files":["/var/www/straped/mufon/html2text/26561.html.txt","/var/www/straped/mufon/more/26561_submitter_file2__orbs-11-13-2010-long-beach-7-pm.jpg","/var/www/straped/mufon/org/26561.html"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.812657,+-118.152756(26561)&iwloc=A&hl=en\"> mufon case (26561) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere","City":"Long Beach","Country":"United States"}