{"divs":["Sighting DetailsI was looking up at the sky from my back-yard and trying to see the stars in the dusky sky in the early evening and noticed a few dim stars. I live in a small town and the street lights hamper seeing the full night sky, but the major stars are visible. A brighter white star-like object suddenly appeared approximately 55 degrees above the horizon in the east. It was moving toward the north-east at such a steady pace I thought it must be a plane. Then it seemed to be moving more quickly than a plane. There were no blinking lights, just a steady white light. It's hard estimate it's altitude but it was easily 5 times larger than the dim stars behind it. I watched for about 5 seconds and then it simply disappeared as quickly as it appeared. At no time was there any sound from it. I stayed for another minute to hear any sound and there was none. There is still no cloud cover as I write this ten minutes later. I have seen this kind of object so often over the last three years that it's hardly an event anymore."],"trends":["There have been 6 other sightings in Charlottetown","There were no other sightings in Charlottetown on or around November 14th 2010"],"Longitude":"-63.11471","Object Shape":"Star-like","Tags":"City","Latitude":"46.251037","files":["/var/www/straped/mufon/html2text/26576.html.txt","/var/www/straped/mufon/org/26576.html"],"Case Number":"26576","Region":"Prince Edward Island","Viewing Distance":"Unknown","Country":"Canada","Sighting Duration":"Undisclosed","Date Submitted":"11/14/2010 05:13 UTC","Weather Factors":"None","Object Flight Path":"Undisclosed","Log Number":"CA-11142010-0018","Source":"MUFON","Summary":"Star-like object appears 55 degrees up from horizon due east, moving NE for 5 seconds and disappears. No sound.","Disposition":"Unresolved","City":"Charlottetown","Object Features":"Undisclosed","Date of the Event":"11/14/2010 05:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.251037,+-63.11471(26576)&iwloc=A&hl=en\"> mufon case (26576) map </A>"}