{"Source":"MUFON","Country":"United States","trends":["There have been 5 other sightings in Centerville","There were no other sightings in Centerville on or around November 14th 2010"],"Summary":"A stationary metallic object was floating in the Dayton area (Centerville/Kettering) and then vanished inexplicably","City":"Centerville","Object Shape":"Cigar, Cylinder","files":["/var/www/straped/mufon/html2text/26582.html.txt","/var/www/straped/mufon/org/26582.html"],"divs":["Sighting DetailsAround 4pm Eastern time on November 14, 2010, I was driving northbound and glanced up in the sky and spotted a shining metallic object. It was a beautiful autumn day, sunny and crisp, clear skies as far as the eye can see. What caught my attention more than anything was the lack of movement from this object in the northwestern sky. The object was stationary with the sun shining off it's metallic and cylindrical shape. It's hard to judge how far away it was, all I can say is that it wasn't very close, but wasn't very far away either. I only saw it for about 10-20 seconds before I rounded a bend where my view was blocked by trees. Approximately 20-30 seconds after losing visibility, I hit a clear stretch of road that enabled a good view. The object had inexplicably vanished. Nowhere in the sky was it to be seen. I am familiar and an avid follower of the \"mysteries\" beyond public recognition, such as extra terrestrial existence, secret governments, the potential and nature of human consciousness, etc. Having seen many videos and photos of UFOs, I almost immediately recognized the object in the sky as one of them. Rationally speaking, had the object been a plane of some sort, there's no way it could have gone from unmoving to completely vanished in a mere 20-30 seconds. As stated, it was a very crisp and clear day, and had the \"plane\" flown off, I would have spotted it SOMEWHERE in the sky, yet there wasn't a single trace of it. I have read a theory before that most UFO's cannot be seen because of the dimension they are in. But if they linger too long in the Earth's atmosphere, they become visible due to the gravitation pull. And if they stay long enough, they become permanently part of this dimension. Unfortunately, because of the short time I had to react, I could not snap a photo or take a video with my phone. This is the first time I have potentially seen a UFO, and I'm sure someone else out there had to have seen it. Keep in mind that Wright Patterson Air Force Base is nearby in the Dayton area. So seeing planes fly by is an everyday occurrence. The unmoving, metallic structure, and inexplicable disappearance of this object is why I believe it was not part of the Air Force."],"Case Number":"26582","Longitude":"-84.157122","Date Submitted":"11/14/2010 09:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.632293,+-84.157122(26582)&iwloc=A&hl=en\"> mufon case (26582) map </A>","Viewing Distance":"Unknown","Date of the Event":"11/14/2010 04:00 UTC","Object Flight Path":"Stationary","Log Number":"US-11142010-0024","Disposition":"Unknown","Tags":"City","Weather Factors":"None","Region":"Ohio","Object Features":"None","Sighting Duration":"00:00:20","Latitude":"39.632293"}