{"City":"Marietta","Viewing Distance":"21-100 Feet","Longitude":"-81.446184","Summary":"Bright white Rectagular with a window","Case Number":"26586","Object Flight Path":"Other","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsMe my dad my stepmother and my baby sister were all in the car. We were going home from a friends house,My dad was driving. When the object came down just above the tree tops on left side of the car. I was in looking up at the object the whole time. You could have cut the fear in the car with knife, My dad tried to get away from it, driving at high speed on a curvy road at speed more than 80 mile an hour. Object kept pace with us chasing the car. I could see a window and what looked like a bright white skeleton laughing, I could see black eyes or dark eyes where the eye would be. It glowed the same bright white as the object, I could only describe the object as a ship. I never seen my dad so scared in all my life, and he doesn't scare easy. I just remember the chase and how scared my father and stepmother were. I don't know If I passed out or what happen after that, but my dad says he pulled over and got out of the car. He then said the craft put a beam of light down on him, then took off. He also told me he had to take my stepmother to the hospital, because she was hysterical. Some people say they have seen UFOs, well how many of been chased by one,and better yet how many people have seen a possible alien. This was a real event, only told to relatives, which didn't believe it. My dad has told me not to tell anyone, because people would think were nuts! I also have a strange dot on the back of my ear, looks like a tattoo ink dot, but I have never had a tattoo,and it's under the skin slightly. I would be happy to answer any questions you have regarding this event."],"Date Submitted":"11/15/2010 03:18 UTC","Log Number":"US-11152010-0002","Country":"United States","Object Features":"Window(s)","Region":"Ohio","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Marietta","There were no other sightings in Marietta on or around November 30th 1977"],"Source":"MUFON","Date of the Event":"11/30/1977 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/26586.html.txt","/var/www/straped/mufon/org/26586.html"],"Latitude":"39.420322","map":"<A HREF = \"http://maps.google.com/maps?q=39.420322,+-81.446184(26586)&iwloc=A&hl=en\"> mufon case (26586) map </A>"}