{"Tags":"City","Weather Factors":"None","Object Shape":"Star-like","trends":["There have been 3 other sightings in Branford","There were no other sightings in Branford on or around August 4th 2011","This sighting has never been favorited.",""],"Object Features":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"41.286673","Log Number":"US-08042011-0031","Longitude":"-72.796617","Date of the Event":"08/04/2011 11:45 UTC","Object Flight Path":"Stationary","Case Number":"26583","Summary":"(sg) Ball of light over Long Island Sound, Changed color, fixed position","divs":["Sighting DetailsWe were driving home from East Haven and saw a light flashing in the sky about a mile from our house from inside of the car. It didn't look like the typical aircraft were used to seeing flying in and out of Tweed or down the coastline. When we pulled onto our street we saw the same light again over Long Island Sound in a fixed position not moving. We went into the house got our camera and walked down to the beach. We stood there for about 30 minutes and just observed it. It didn't move up or down or any direction, but it would change from white, to red, to blue. At first we were excited to see this weird object in the sky, but eventually we figured there must be some reasonable explanation for this event. A man walked down the street and paused for like 3 minutes as he passed us, kinda creepy. So we decided to go home. The camera had a hard time focusing on the object."],"Viewing Distance":"Over One Mile","Source":"MUFON","Region":"Connecticut","City":"Branford","map":"<A HREF = \"http://maps.google.com/maps?q=41.286673,+-72.796617(26583)&iwloc=A&hl=en\"> mufon case (26583) map </A>","Date Submitted":"08/04/2011 12:33 UTC","files":["/var/www/straped/mufon/html2text/26583.html.txt","/var/www/straped/mufon/more/26583_submitter_file2__IMG_2573.JPG","/var/www/straped/mufon/more/26583_submitter_file3__IMG_2575.JPG","/var/www/straped/mufon/org/26583.html"],"Country":"United States"}