{"Region":"Indiana","Object Flight Path":"Straight-line path,Path then hovering","Source":"MUFON","Tags":"City","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.080283,+-85.135951(26588)&iwloc=A&hl=en\"> mufon case (26588) map </A>","Longitude":"-85.135951","divs":["Sighting Detailsi was coming home from work on the highway. i wondered why the cars in front of me were slowing down. the highway was in dangerous conditions of ice and snow and there were alot of wrecks that day. i was concentrating so hard on the road that it took me a bit to realize why people were slowing and some were pulling over. i have an expedition... very large truck, high in the air. there was a huge triangle craft with one bright white light on each corner approaching from the right side above, heading across the highway. it was silent, moving slow and so close it made me just gasp. i felt it would not be far from the roof of my truck. i pulled over, got out of the truck, waited for the few cars that were coming to pass, in all that time the craft only got to the other side of the highway. i had a wierd dizzy feeling and i remember going across the highway even though i was scared. the car in front of me, the wife was pulling her husband telling him to get back in the car. she was terrified. i went to the middle of the highway feeling this odd hazy feeling. i watched this thing just slowly float away and higher in the air. i now noticed that as it got further away, i lost that weird feeling i had. could have been adrenaline, but i don't think so. that usually makes you very fast, this was like i was almost in a trance. i will never forget that craft. i came home, started searching the internet that night and you can even find my writing to people online if you google it asking people who actually posted videos on youtube in indiana as well to please contact me because i had just seen what they were posting online."],"Disposition":"Unknown","Log Number":"US-11152010-0004","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around January 5th 2009"],"Viewing Distance":"20 Feet or Less","Date Submitted":"11/15/2010 09:59 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/26588.html.txt","/var/www/straped/mufon/org/26588.html"],"Object Features":"None, Patterned Surface, Other","City":"Fort Wayne","Weather Factors":"Windy","Summary":"huge triangle craft on highway","Latitude":"41.080283","Date of the Event":"01/05/2009 10:15 UTC","Sighting Duration":"00:06:00","Case Number":"26588"}