{"Case Number":"26580","Log Number":"US-11142010-0022","divs":["Sighting DetailsMe and my cousin went outside around 11:45pm or so to take my puppy to go potty. We walked out of my house on the walkway and waited for my puppy to finish up. It was cold and I was just looking around in the sky since it was clear and you could see all the stars. I was looking up and then I looked forward and I saw some light come up from behind the trees, it was quite a bit away from us but it was really bright. It looked like a star in the sky but it was brighter than any other star in the sky. I nudged my cousin and told him to look at it because I didn't know what it was and neither did he. As it was still going up in the sky at a slight angle it then started going faster still really bright. So I ran down my driveway into the road to get a better look while my cousin stayed with my puppy by the house. I was kinda freaked out simply because I didn't know what it was and why it went from slow to fast that quick and why it was so bright. At first I thought it was some night launch the space center was doing but from all the night launches I've seen, they never looked like that or did what it did. My cousin yelled to me that it was turning and coming close to us in which it was and at that point I got kinda scared and I turned and ran back to my walkway where my cousin was. As it was turning it got closer and wasn't as high in the sky as the stars were. The brightness of it went down and all you we could see was this thing flying in the sky and were trying to see if looked like a plane or something like it. It was kinda a disc like shape and it had lights but it wasn't flashing the way planes do. Planes usually have two flashing lights on the each side and varies in color, what we saw was it had multiple lights (kinda yellow kinda orange) that were flashing left to right in a horizontal line. We couldn't see the other side of the object so we weren't sure if there were lights on the other side of it or not. When it was closer to my house it got slower in speed and it kinda turned East and went in that direction at the same slow speed. We lost sight of it due to the trees being in the way and we couldn't go any farther to chase it in the sky. I was a little freaked out from not knowing what it was and kinda in disbelief of what we just saw. We tried coming up with what it could've been: a rocket night launch from the space center, some kind of plane, a shooting star (but I thought that couldn't be it cause shooting stars don't go up and then hover with lights). And we figured planes couldn't and usually don't make that kind of random speeds and turn that fast then slow down and hover with strange lights like that either. It was very bright too so we couldn't explain it. And after that happened we started see shooting stars randomly in the sky. I didn't have time to get my camera or video cam but I drew quick sketches of what happened."],"map":"<A HREF = \"http://maps.google.com/maps?q=28.860968,+-81.676103(26580)&iwloc=A&hl=en\"> mufon case (26580) map </A>","trends":["There have been 2 other sightings in Eustis","There were no other sightings in Eustis on or around November 12th 2010","This sighting has never been favorited.",""],"Object Shape":"Disc, Saturn-like, Star-like","Source":"MUFON","Object Flight Path":"Undisclosed","Summary":"Really bright fast star like shape slowed down into disc shape w/ weird lights over my house","Tags":"City","Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"Florida","Viewing Distance":"Unknown","Country":"United States","Longitude":"-81.676103","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26580.html.txt","/var/www/straped/mufon/more/26580_submitter_file1__Sketch1.jpg","/var/www/straped/mufon/more/26580_submitter_file2__Sketch2.jpg","/var/www/straped/mufon/org/26580.html"],"Disposition":"Unknown","Date Submitted":"11/14/2010 08:37 UTC","Date of the Event":"11/12/2010 11:45 UTC","Latitude":"28.860968","City":"Eustis"}