{"Date Submitted":"11/15/2010 07:13 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Indiana","Tags":"City","Latitude":"41.064764","Longitude":"-86.215833","Summary":"Object with two long lights flashing between white and red behaved unconventionally in sky. Flashes of white light appeared twice.","Case Number":"26599","Log Number":"US-11152010-0015","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other","Disposition":"Unknown","Country":"United States","City":"Rochester","Date of the Event":"11/14/2010 06:30 UTC","divs":["Sighting DetailsI first noted the object approximately at 6:30pm. I was driving on 25 North, around half an hour outside of Rochester, when an unusual object caught my eye. I watched it for a while and grew more and more curious - from my vantage point on the road, it seemed like two lines of light, almost a -- --, and they alternated between flashing white and red. The movement also seemed unusual, as it seemed to bob and weave around in the sky, and at one point dropped straight down what must have been a considerable distance in the sky. I've worked night shift the past few years and thus drive a lot at night - I've seen planes and even helicopters in the sky, and nothing I've seen looked like this thus far. After about 10-15 minutes it seemed to fly off into the horizon, and out of the corner of my eye I saw a bright white flash in the sky, and the object seemed to once again be closer to 25 North. Once again it seemed to move around in the sky, still not behaving like anything I've ever seen. It was at this point I began to grow excited, as I've never witnessed anything similar before. After another couple of minutes there was another flash in the sky. Sadly, once again I did not see the flash directly, but caught it from the corner of my eye. The object was still a little ways off in the distance, moving around in an odd manner. In total I watched the object for about half an hour before I moved into Rochester and lost sight of it."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.064764,+-86.215833(26599)&iwloc=A&hl=en\"> mufon case (26599) map </A>","Object Features":"None","trends":["There have been no other sightings in Rochester","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26599.html.txt","/var/www/straped/mufon/org/26599.html"],"Weather Factors":"None"}