{"Region":"California","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=34.222064,+-119.030272(26595)&iwloc=A&hl=en\"> mufon case (26595) map </A>","Longitude":"-119.030272","Date of the Event":"11/14/2010 07:00 UTC","Log Number":"US-11152010-0011","Summary":"Observed slow moving, glowing, large, light to the NW from Camarillo.","Latitude":"34.222064","Date Submitted":"11/15/2010 01:43 UTC","trends":["There have been 7 other sightings in Camarillo","There were no other sightings in Camarillo on or around November 14th 2010"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/26595.html.txt","/var/www/straped/mufon/org/26595.html"],"divs":["sighting detailsmy wife and i observed and videotaped a strange light in the sky last night just before and around 7pm pst. we live in camarillo california and observed the light\\craft from our balcony which is oriented facing west-northwest. the light or craft appeared to be glowing brightly orange-red. the light seemed to undulate or grow brighter and then dimmer. the light appeared to the west-northwest and slowly moved due east, appearing to get closer and larger. we observed several other aircraft in the sky at the same time. the normal civilian and military aircraft's lights were noticably different than the light\\craft that we were observing. i am a former usaf air trafic controller trained in aircraft recognition, air traffic control and weather observation. i could not readily identify what i was looking at. it did not have standard aircraft lighting. eventually as the very slow moving light\\craft crossed to a point where it was relatively straight across and up from us, it simply vanished to my eye. my wife believed she could still see something\\ some form after the light disappeared. a few minutes after the light \"disappeared\" another light-craft appeared on the horizon at approximately the same point the first one appeared. it followed the same \"flight route\" and again disappeared near the point where the first one disappeared. i observed the second craft through binoculars. the light or glowing red\\orange color appeared to be sandwiched between a \"hull\" or craft shape. as the craft moved closer, the single glowing light seemed to turn into four small red lights in a diamond pattern...just prior to disappearing. the view from our porch\\balcony looks out almost straight across the camarillo airport. there is also pt.mugu nearby. we have a lot of air traffic around us. the light\\s we observed appeared quite different and larger than any other air traffic that was visible. no strobe light, no red or green safety lights like normal aircraft. it appeared much larger than any other aircraft in the sky simultaneously and had a mildly pulsating glow. we captured both craft\\lights on a amatuer sony home video camera. i have no idea what we observed but my wife and i are interested in reporting it, sharing our video and finding an explanation however ordinary it may turn out to be."],"City":"Camarillo","Country":"United States","Object Features":"Other","Viewing Distance":"Unknown","Case Number":"26595","Object Flight Path":"Straight-line path","Object Shape":"Cigar, Disc, Oval, Sphere","Source":"MUFON"}