{"Region":"Texas","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/26606.html.txt","/var/www/straped/mufon/org/26606.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsOk this may sound nuts but surely I'm not the only one who has noticed this.. Ok so I have dish network and on channel 287 there is a live feed from one of their satellites. I'm guessing it's a real cam pointed toward earth. I don't know if it's an optical illusion from the tv or what.. I have a 42\" Sony LCD in my bedroom and a 52\" Sony LCD in my living room and have witnessed it on both of them. You can see the anomalies any time but it seems the best time is from 12:30 thru 3:00 am est.. So one day while channel surfing I came across this channel and for some reason stopped and decided to watch for a min and I can assure it wasn't because of the background music.. I suggest muting ur tv if ur gonna watch for any period of time.. But anyway do I was watching and after only seconds of looking at the screen I started to notice these faces.. I don't know what an Alien looks like, but just going by what is portrayed in the movies, it is an alien face.. So I'm sitting there watching these faces pop up randomly when my wife walks into the room and says what in the hell are you watching? I said hey do u notice anything strange, asked without telling her what I saw just to make sure my eyes weren't playing tricks on me.. She walked on into living room and before she even stopped to take a close look she said \" yea are you talking about the alien faces. She said this with no hesitation. So then I really got interested and the more I watched the more I believed that this is not an optical illusion. Now I'm not saying that someone hasn't altered the footage in some way but some of these images are 3 dimentional.. I'm talking so real that it will give you chill bumps. And if you dvr this channel for a couple of hours then fast forward through you will see Their mouths moving and all.. I know it sound rediculous and far fetched but check it out and see for yourself. Look in the darkness of the picture and believe me you will see it and if you watch at the times I listed above there will be light rays across the screen witch will illuminate these images.. The added color brings out the facial caracteristics and will appear 3D. The more you watch the more you'll see and the more you see the more you know that it's not coincidence. Either these images are real or they have been hoaxed somehow. Anyway just thought I'd share that.. Let me know what you see and what you think.. And sorry I didn't fill out all the info above but there is really no need to since u can check it out yourself anytime 24 hrs a day.."],"Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Unknown","trends":[],"Longitude":"-99.892443","map":"<A HREF = \"http://maps.google.com/maps?q=31.972359,+-99.892443(26606)&iwloc=A&hl=en\"> mufon case (26606) map </A>","Sighting Duration":"Undisclosed","Latitude":"31.972359","Tags":"City","Disposition":"Hoax","Date of the Event":"Unknown","Log Number":"US-11162010-0004","Date Submitted":"11/16/2010 02:41 UTC","City":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"26606","Summary":"Not a UFO but you have got to check this out!!!","Country":"United States"}