{"Date Submitted":"11/04/2003 12:00 UTC","Summary":"object changing colors in eastern sky at midnite","Sighting Duration":"01:00:00","Region":"North Carolina","City":"High Point","Object Features":"Undisclosed","Country":"United States","trends":["There have been 5 other sightings in High Point","There were no other sightings in High Point on or around November 4th 2003"],"divs":["Sighting DetailsI walked out our back door at approx 1207am. Because I often have troublesleeping, I am accustomed to searching the night sky for anything I may considerunusual. We live 3 miles from an airport Piedmont Triad Intl and I often seeplanes at a distance. I saw what appeared to be an exceptionally bright, coloredstar in the eastern sky. After watching it for only 20 seconds or so, I couldsee that it was the most unusual star, or plane, I have ever seen. I thought my17 year old son was upstairs and I was afraid to lose track of the object. Iopened the back door and called him. He was in the kitchen and I called hisname. I told him to get out here, quick, Im not kidding.We both watched the object for 45 minutes. It seemed to be miles away but wecould see it had a quality to it that was so unusual that it certainly wasnt aplane and was very unlikely to be a star or planet.The object, even at a distance, was changing colors. It had an overall whiteappearance, which remained throughout the event, but had secondary colors ofred, orange, blue, almost cobalt blue, and green. These colors did not flash ina pulse-like manner, but did change in succession, almost like the object wasturning. It first appeared to be closer and slowly, over 45 minutes, to moveaway. It appeared to dance side to side and up and down, more often in adiagonal pattern. In other words, not directly up and down or side to side.We attempted to use the trees in the backyard as a fixed point of refernce toconfirm or deny movement but, honestly, were never really able to cleary say itsmovement was indeed erratic although it appeared so, especially after observingother stars in the sky. What we were able to confirm using the trees asreference, was that, slowly, over a period of 45 minutes, the object moved fromleft to right, probably 10 degrees or so. Other stars, in comparison, did not doso.It appeared to me to almost look like an A in the sky, or, perhaps to describeit in another way, the shape of fighter jet standing on end, nose up.After 45 minutes, I went back inside, incidentally, I called and left a messagewith the control tower at the airport, as we were so sure of its oddity toreport it.I returned to the backyard 20 or so minutes l"],"Viewing Distance":"Over One Mile","Log Number":"","Date of the Event":"11/04/2003 12:00 UTC","Disposition":"Insufficient Data","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Triangle","Object Flight Path":"Other","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.955692,+-80.005318(2660)&iwloc=A&hl=en\"> mufon case (2660) map </A>","files":["/var/www/straped/mufon/html2text/2660.html.txt","/var/www/straped/mufon/org/2660.html"],"Longitude":"-80.005318","Latitude":"35.955692","Case Number":"2660"}