{"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around November 12th 2010","This sighting has never been favorited.",""],"Log Number":"US-11162010-0002","files":["/var/www/straped/mufon/html2text/26604.html.txt","/var/www/straped/mufon/more/26604_submitter_file1__Screenshot2010-11-13at9.20.40PM.png","/var/www/straped/mufon/more/26604_submitter_file3__Screenshot2010-11-13at12.54.27PM.png","/var/www/straped/mufon/org/26604.html"],"Country":"United States","Latitude":"34.061074","Tags":"City","Region":"California","Disposition":"IFO","divs":["sighting detailsnote: when this was happening i got on twitter and had over five others confirm this ufo sighting on web cam while it was happening! on twitter i am (wit's twitter id deleted--cms\\sg). ufo sighting over lax, los angeles international airport on nov 12, 2010! date of sighing: nov 12 2010 location of sighting: lax, la, california, usa note: the screenshots from the live cam are similar to the famous \"phoenix lights\" ufo sighting in arizona in 1997. i was watching the live web cams again and caught sight of another unusual sight on the lax live cam. now seeing something flying above an airport is no big deal, but this has been over the airport for over three hours! it looks like a very long ufo is over la right now as i write this. if you visit the live cam below, you will see it too. these ufos hovered there not moving except a little bit, i first noticed the ufos on 11-12-2010 at 20:48:44 (as recorded in photo of cam) and it continued until about 11-13-10 at 5:17:14 am (as the cam recorded in the photo). the four lights in a row sometimes turn off and on, but if these lights are a single ufo, then it is over three city blocks long, in comparison to the skyscrapers below it. these four lights move in unison slightly up or down, but usually slightly left or right. they never move from being in line with each other. that is why i assume they are a single craft. far to their right were three other lights. these lights look like orbs, same as the four on the right, but they change position from one above and two below. these three orbs sit in a triangle position, but the triangle rotates in position every few minutes. the live lax cam is at (link moved to additional evidence section--cms\\sg. i am *(wit's name deleted--cms\\sg) and would appreciate it if you could tell me what this is all about and why after 9-11 there are ufos over lax that hold position and do not fly away."],"Viewing Distance":"Unknown","Summary":"UFO Sighting over LAX, Los Angeles International Airport on Nov 12, 2010!","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-118.235885","Source":"MUFON","Date Submitted":"11/16/2010 12:04 UTC","Object Features":"Undisclosed","Object Shape":"Circle, Flash, Sphere","Date of the Event":"11/12/2010 08:48 UTC","City":"Los Angeles","map":"<A HREF = \"http://maps.google.com/maps?q=34.061074,+-118.235885(26604)&iwloc=A&hl=en\"> mufon case (26604) map </A>","Sighting Duration":"Undisclosed","Case Number":"26604"}