{"Object Features":"None","Summary":"Orange Colored Rectangular UFO","divs":["sighting detailsi was facing south looking at the stars when directly overhead i spotted an orange rectangle with three orange lights inside the rectangle. this object was moving at a pretty fast pace as i only observed it for about 6 seconds before i lost it behind nearby trees. this object was moving from the west to the east. if you hold a ruler at arms length it was about 1\\4inch wide and 3\\4inches long. it was outlined in orange with three orange lights inside, one on each end just inside the rectangle and one in the middle. it also looked grayish in between the lights. i could not see how thick it was. the altitude was lower than passenger jet liners i see all the time that i assume are at about 40,000ft. i figured this was about 30,000ft. i heard no sound as it moved across the sky at about 3 time the speed of a jet liner. i was the only witness to this sighting. _________ | * * * | __________ this is what i saw, the bottom line should be higher to form the shape correctly but you get the idea. i have read and have seen on tv reports of triangular and v shapes in the sky and that is why i was so surprised to see this rectangle and wanted to report it. this object had no rounded edges like a cigar shape would have."],"Tags":"City","Log Number":"US-11152010-0016","map":"<A HREF = \"http://maps.google.com/maps?q=37.348496,+-121.892056(26600)&iwloc=A&hl=en\"> mufon case (26600) map </A>","files":["/var/www/straped/mufon/html2text/26600.html.txt","/var/www/straped/mufon/org/26600.html"],"Longitude":"-121.892056","Object Shape":"Square, Rectagular","Country":"United States","Weather Factors":"None","City":"San Jose","trends":["There have been 106 other sightings in San Jose","There were 2 other sightings in San Jose on or around November 11th 2010"],"Date Submitted":"11/15/2010 07:35 UTC","Latitude":"37.348496","Disposition":"Unknown","Object Flight Path":"Straight-line path","Case Number":"26600","Viewing Distance":"Over One Mile","Region":"California","Source":"MUFON","Date of the Event":"11/11/2010 10:30 UTC","Sighting Duration":"Undisclosed"}