{"City":"Rochester","Disposition":"Unknown","Tags":"City","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-11162010-0012","Object Shape":"Triangle","Longitude":"-83.128501","Sighting Duration":"00:02:00","divs":["Sighting DetailsDriving northbound on Rochester road at Hamlin (see attached map), I saw about a mile ahead of me two VERY bright, yellow-white lights close together. The lights were very different from the street lights, car lights, and building lights in the area. All those lights looked washed out compared to the floating lights. The floating lights were also significantly brighter and larger in diameter. At first I thought they were landing lights from a plane flying really low. As I approached I realized the lights were stationary and then thought it must be lights on the end of a high pole - perhaps they're having a carnival in the parking lot of the mall again. As I came to a stop in the left-hand turn lane at Rochester and Avon, It was about 20 or 30 yards away (west and slightly north) and about 4 stories up... and still not moving. I keep thinking to myself, \"I can't be the only one seeing this\". The thing that stood out most was how I had traveled a mile with this thing in full view and it never appeared to move at all. No wavering, nothing, even when I was right next to it. It was just hanging there steady in the same spot. At this point, I could make out a third light, and the three lights formed a triangle, but I could not see anything between the lights at all. I pulled out my iphone and shot 3 pictures, but only 2 came out (not very well, either. I have an iphone 3g so it's not HD). After about 10 seconds it started to move south. It didn't accelerate, it just started moving at a slow, constant rate. As it moved over the parking lot to my left (west), I could CLEARLY see its shape since the ground lights were illuminating it from below. It was a triangle with equal lengths on all sides and appeared to have no markings at all; just a flat, \"grayish\" surface with lights on the each end. I could not tell how thick it was. As it moved, the lights faded to nothing over the span of about 6 seconds and then I couldn't see it at all even though it was fairly close. FYI, it was raining slightly and there was a slight \"haze\" in the air. This may be unrelated, but when I crossed the road two miles back I saw four police cars with lights and sirens blaring as they drove through the intersection of Rochester and Auburn roads. Two continued west and two turned south."],"Latitude":"42.681588","Date of the Event":"11/16/2010 05:58 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.681588,+-83.128501(26614)&iwloc=A&hl=en\"> mufon case (26614) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/26614.html.txt","/var/www/straped/mufon/more/26614_submitter_file1__IMG_5306.JPG","/var/www/straped/mufon/more/26614_submitter_file2__IMG_5307.JPG","/var/www/straped/mufon/org/26614.html"],"Date Submitted":"11/16/2010 09:42 UTC","Region":"Michigan","Case Number":"26614","Object Features":"None","Summary":"Equilateral triangle with bright yellow lights on each end","trends":["There have been 3 other sightings in Rochester","There were no other sightings in Rochester on or around November 16th 2010","This sighting has never been favorited.",""]}