{"Sighting Duration":"00:00:30","Case Number":"26617","Weather Factors":"Unknown","Object Shape":"Unknown","City":"Sandy","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around November 16th 2010"],"Viewing Distance":"Unknown","Summary":"Vague light in the sky","Date Submitted":"11/17/2010 12:39 UTC","Object Features":"None","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/26617.html.txt","/var/www/straped/mufon/org/26617.html"],"Latitude":"40.57821","map":"<A HREF = \"http://maps.google.com/maps?q=40.57821,+-111.850622(26617)&iwloc=A&hl=en\"> mufon case (26617) map </A>","Disposition":"Unresolved","Log Number":"US-11172010-0002","Source":"MUFON","Region":"Utah","Longitude":"-111.850622","Date of the Event":"11/16/2010 08:00 UTC","divs":["Sighting DetailsWas outside my home smoking a cigarette (my typical brand) and looking up at the planes approaching through the normal approach corridor on their way to Salt Lake City International Airport. Planes typically appear in the south-by-southwest, about ten degrees from south toward the west, then proceed northerly toward the airport, passing west of my residence. Noticed another object that I thought was a plane at first, though it didn't move. I re-evaluated the object as a helicopter, and stared to see what kind of helicopter it was (was considering news, police, or private helicopter). Object appeared to be the same general kind of light affixed to aircraft that the planes were using, though different in quality (I'm colorblind, and so it may actually have also been a different color). I did not feel that this craft was at first any kind of extraordinary object. Something was different about the light--something I can't quite put a finger on. I did not see the object itself; I merely saw the light, and noted that the sky conditions at the time were cloudy and overcast in the area due to precipitation. Clouds to the west were breaking up. The object then moved at a high rate of speed to the west, seemingly without really accelerating to that speed--it was just moving quickly, and started very suddenly. Within 1-3 seconds, the object crossed 30 degrees of sky and disappeared behind some tall mountains. Seeing this, the hair on the back of my neck stood up, and I felt a little upset, though also excited. I spent the next 2 hours researching aircraft and did not find any that seemed to be capable of something like that. I then decided to file this report. The entire experience lasted less than a minute, but it seemed a significant amount of time. I am guessing about 30 seconds, though I did not have a timepiece with me."],"Object Flight Path":"Hovering then path"}