{"Log Number":"US-11172010-0003","Case Number":"26618","Sighting Duration":"00:00:05","Region":"Alabama","Weather Factors":"Unknown","City":"Mobile","Object Flight Path":"Undisclosed","Country":"United States","Source":"MUFON","Latitude":"30.695497","Disposition":"Unknown","Date of the Event":"11/10/2010 07:00 UTC","Viewing Distance":"Unknown","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/26618.html.txt","/var/www/straped/mufon/org/26618.html"],"Tags":"City","Object Features":"Undisclosed","Longitude":"-88.035464","Date Submitted":"11/17/2010 12:58 UTC","trends":["There have been 19 other sightings in Mobile","There were no other sightings in Mobile on or around November 10th 2010"],"divs":["Sighting DetailsThree of us were traveling north on Snow Road near Semmes. It was dark. From the east, perhaps around 2 o'clock position, it looked like an airplane was moving westward at a typical speed. It had the appearance of a planet - just a bright point in the sky - bluish in color. I suppose it was this brightness that caught my attention. No blinking lights. However, it quickly accelerated and appeared to take a slight altitude loss trajectory. The point of light continued to accelerate quickly and moved from our 2 o'clock position to the 10 o'clock position in about 1 or 2 seconds... then it disappeared without any notable changes in the appearance (no flash-out, etc). The driver of the car also witnessed the event. We both were surprised and amazed at the speed of the object as well as the obvious acceleration. We wondered if it was meteor, but the light intensity did not change and it did not create a tail or streak so there were no signs of typical re-entry. A subsequent Google of meteors and the like did not match what we witnessed, which is why I'm reporting this on MUFON."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.695497,+-88.035464(26618)&iwloc=A&hl=en\"> mufon case (26618) map </A>","Summary":"Extreme excelleration of an object across night sky"}