{"Object Features":"Unknown","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Boomerang","Date Submitted":"11/16/2010 06:14 UTC","Object Flight Path":"Straight-line path","Longitude":"-119.416662","Log Number":"US-11162010-0010","Summary":"Boomerang shape black with 3 bright white lights on rear of craft","Weather Factors":"None, Does Not Apply","Case Number":"26612","Latitude":"36.787201","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.787201,+-119.416662(26612)&iwloc=A&hl=en\"> mufon case (26612) map </A>","trends":[""],"City":"Undisclosed","Date of the Event":"11/12/2010 06:30 UTC","divs":["Sighting DetailsI live 10 miles NW of San Francisco International Airport, near the Pacific Ocean. I was in my backyard looking up at the jet aircraft on approach to SFO Airport and I was star gazing. I was testing my new IGen night vision video camera when I saw this UFO fly overhead (without sound) about 500 feet high. It was heading South on this Friday night at 6:30 PM. I was able to capture about 20 seconds on video tape. I knew it was not a normal aircraft by its shape, light configuration and absence of noise. It had no strobe lights, no red left wing nor green right wing light and was flying below the 1500 foot flooring in this controlled airspace. It was moving about 300 MPH. I lost sight of at as it flew far away. Yes, it was a UFO! This was not my first UFO encounter. I have seen many different types flying over San Francisco the past 2 years and now they fly over head almost every night. I have a collection of UFOs from May 2010 thru Oct 2010 on video tape using a .001 Lux 15 FPS camera. We are not alone and there are many different types of UFOs up there. Hope for clear skies and more sightings. NOTE: To see video better, you may have to increase your computers brightness, gamma and contrast settings, as the video is a little dark."],"Sighting Duration":"00:00:20","Tags":"City","Region":"California","files":["/var/www/straped/mufon/html2text/26612.html.txt","/var/www/straped/mufon/org/26612.html"],"Disposition":"Unknown"}