{"City":"Boutte","Sighting Duration":"00:20:00","map":"<A HREF = \"http://maps.google.com/maps?q=29.905508,+-90.383697(26622)&iwloc=A&hl=en\"> mufon case (26622) map </A>","Log Number":"US-11172010-0007","Weather Factors":"None","Date of the Event":"03/02/2007 02:15 UTC","Tags":"City","Object Flight Path":"Stationary","Region":"Louisiana","trends":["There have been 4 other sightings in Boutte","There were 3 other sightings in Boutte on or around March 2nd 2007","This sighting has never been favorited.",""],"Date Submitted":"11/17/2010 05:19 UTC","Country":"United States","Longitude":"-90.383697","Source":"MUFON","divs":["Sighting DetailsThe night of this occurrence I was on my way back from Houma, Louisiana. I was working as a courier and I was transporting film from a theatre in Houma back to the New Orleans airport close to where I live in Kenner, Louisiana. Attached is a digital photo of a red mustang that I saw and took a picture of by the accident scene I witnessed on 3-2-2007 around 2:15 a.m. near Boutte and Paradis, Louisiana. I passed this accident scene and I was so amazed by it I turned around and made a U turn so I could take some pictures of it. I then noticed that other cars passing this accident scene were going very fast as if they did not see anything occurring. For some reason all of the passing cars were traveling in the left lane. This prevented them from hitting the police car and going over the animal but they were not slowing down. When I pulled up to the accident scene for the second time I saw two police cars on the scene. One police car was in front of the animal that was laying across the right lane of the road. I noticed the windows of this police car were BLACK and I could not see anything inside of the car. The other police car was behind the red car that was just a few feet down the road but they were in the emergency lane. I could see the back of a policeman and the front of a man standing next to the red car. The man that apparently was the driver of the car was moving his hands in the air as if to be in a deep conversation with the police officer. This man was about 6 feet tall with dark hair and he was dressed nicely. I noticed he did not have a scratch on his face yet his vehicle was badly damaged. I came very close to getting out of my car and speaking with these two people but I did not. I have pictures but police have NO record of this accident taking place! I spoke with a very nice police officer in the early morning hours of 3-5-2007 about this occurrence and his name is \"Clint.\" Clint works for the St. Charles Parish Police Department. He informed me that on the night of 3-2-2007 he patroled highway 90 not far from the 310 entrance and this is exactly where the occurrence happened. He was also on duty at the exact time of the occurrence. Clint stated that he did not see anything like this occur and there is no report of it. In fact NO police departments have any reports of a huge animal being hit on the road in this area but I have the picture of this strange looking LARGE animal below! I believe the police officer was being honest but this adds even more mystery to this event. It appears to be a mixture of many different animals. It has a long tail and it's head appeared to me as a beautiful golden head of a Camel on the night of the occurrence. A few months ago a friend of mine went with me to the Audubon Zoo here in New orleans and we showed the image of this animal to a zoologist. He said he would be the one to speak with about this strange animal that we wanted to show him the digital image of. He looked it over carefully and was amazed at what he saw. He said he had never seen an animal like this and could not figure out what type it could be. Crytozoologists cannot make out what type it is either. It appears to be made up of many different animals. The average person might call it a cow, horse, etc but close observation shows it is not any one animal type. I have the original sd card saved of the pictures I captured that night. I did this to prove that my images have not been edited or manipulated. The only thing done to any image below is the car was lightened because the image was to dark to see prior to lightening it. If you look close at the road that the animal is lying on you can see a circular pattern on it as if something landed there. One of the zoomed in images of the 3 UFO's in they sky above the occurrence shows intense colors and energy about it. Notice the mustang car has an alien figure that appears on the side of it with what looks like a hand holding some type of phone. The back part of the car appears ghostly was if it vanishes. Oddly the men on the scene of this accident do not appear in any of the pictures. The strange animal was huge and covered the whole right side of the lane. After I arrived back home I called all of the police departments in the area of occurrence including the state police and no one had any record of this incident occurring. I spoke with the St. Charles Police Department where the incident occurred and they stated that any time an animal is hit in there area everyone knows about it. They had not record of it and the cars passed the accident scene very fast as if they did not see anything. Approximately 8 hours later I drove back to the area of this occurrence with my dad and NOTHING was there! There was NO blood on the pavement, no animal, no car, nothing! I know exactly where this occurred because this is the only route I take coming back from Houma to Kenner. It is right by where I get on 310 that takes me back to the Kenner area. Highway 90 is the only way to and from where I live to Houma, La. Highway 90 near Boutte, La is where this incident occurred. During this event I noticed a stillness like no other and it was as if the universe was standing still for a few moments. A very enlightening and moving experience! I have my own beliefs in regards to what I witnessed since I have always had a very strong faith in God. After this incident I have been able to share a lot of information to many people in regards to aliens and there purpose for visiting us here on earth. (1.7 Million on Myspace) The book of ezekiel has many passages that express words that would make us think of modern day UFO's. I do know that I did my research and what I witnessed that night was not from earth. The image of this strange animal is unlike anything here on earth. In fact when I arrived back home I zoomed in on the image of this animal and at the head appears a very evil looking image of something. I have this image below also. I do have the original images saved on the original SD card from the digital camera I used that night to take the pictures. Of course now I wish I would have tried to make contact with the men on the scene but at the time I did not know how signifacant this event would turn out to be. I have had some other incidents where I witnessed UFO's etc, but not quite like the night of 3-2-2007. There was an incident this same year (2007) near Kentwood, La that I witnessed. It involved 2 18 wheeler trucks and one was on fire. After I passed the 18 wheeler that was in flames a triangular shaped UFO hovered over the woods very close to my car. I did not have time to take a picture but viewing it gave me a wonderful feeling. I felt as if the aliens in the craft had great knowledge and held the answers to many unexplained questions we seek. The UFO took off in the direction of the 18 wheeler on fire. I made the next exit (about 3 miles or so) to head back in the direction of the UFO. When traveling back I heard fire trucks but then nothing was found in the area of occurrence. I do have a picture of one of the trucks laying across the interstate. I plan to go back the the area of Boutte, Paradis, la more often and I hope I can capture something significant to share with many people. I have looked over these images many times and there are even some words that appear at the bottom of the image of the car but I cannot make them out. I shared these images with numerous priests and pastor's and they believe I was blessed with the gift of Visions. (Joel 2:28) I have a a very STRONG faith in God over MANY years! I will keep my faith! Charles"],"Object Shape":"Disc","Latitude":"29.905508","files":["/var/www/straped/mufon/html2text/26622.html.txt","/var/www/straped/mufon/more/26622_submitter_file1__charlessphoto.jpg","/var/www/straped/mufon/more/26622_submitter_file2__Picture008-2.jpg","/var/www/straped/mufon/more/26622_submitter_file3__Picture069.jpg","/var/www/straped/mufon/org/26622.html"],"Case Number":"26622","Object Features":"Undisclosed","Disposition":"IFO","Summary":"I witnessed an animal that appears to not be from earth and a strange car where 3 UFO's were in the sky above me!","Viewing Distance":"20 Feet or Less"}