{"City":"Laughlin","Region":"Arizona","Summary":"multiple satellites moving in formation with manuevers","Disposition":"Unknown","Latitude":"35.177497","Weather Factors":"None","Log Number":"US-11172010-0010","Date of the Event":"11/17/2010 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.177497,+-114.566571(26625)&iwloc=A&hl=en\"> mufon case (26625) map </A>","Source":"MUFON","Object Features":"None","Tags":"City","Viewing Distance":"Unknown","trends":["There have been no other sightings in Laughlin","This sighting has never been favorited."],"Date Submitted":"11/17/2010 02:00 UTC","Object Shape":"Sphere, Other","files":["/var/www/straped/mufon/html2text/26625.html.txt","/var/www/straped/mufon/org/26625.html"],"Longitude":"-114.566571","Case Number":"26625","Country":"United States","divs":["Sighting DetailsI was standing outside this morning at around 4:30am, I was looking up at Orion when I noticed a bright satellite moving from the northwest to the southeast at a rather fast pace. I had a small pentax monocular and used it to view the object. When I found it in the eyepiece it was moving past Orions left shoulder. As I watched another satellite came in from the west at a high rate of speed and joined the first. It came in and stopped directly behind the first then began following as if linked with a computer. As I watched another satellite came in from the northeast and joined the other two, this time on the left hand side and in between, creating a triangle formation. They then began making maneuvers, I thought of high school boys with their cars on a friday night. One would lag behind then speed up almost rear ending the first, then leap frog in front of the other. They made several \"loops\" around each other as well as other odd maneuvers. The second two then departed the first, again in different directions at very high rates of speed. The first continued across the sky until it disappeared down the horizon. The \"satellites\" did not change color or shape, they remained a bright white in color regardless of distance or angle of view. I say satellite because they were so far up they were just pinpoints of light, like an orb."],"Sighting Duration":"00:02:00","Object Flight Path":"Path with directional change"}