{"Object Flight Path":"Stationary,Other","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.226696,+-98.199593(26623)&iwloc=A&hl=en\"> mufon case (26623) map </A>","Log Number":"US-11172010-0008","Disposition":"IFO","Weather Factors":"Unknown","Sighting Duration":"00:30:00","Longitude":"-98.199593","Object Shape":"Star-like","Region":"Texas","files":["/var/www/straped/mufon/html2text/26623.html.txt","/var/www/straped/mufon/org/26623.html"],"Object Features":"Unknown","Source":"MUFON","Date of the Event":"11/16/2010 06:00 UTC","Date Submitted":"11/17/2010 09:17 UTC","Case Number":"26623","Country":"United States","Summary":"Star like object that blinked out then reappeared several times in a line pattern.","divs":["sighting detailson 11\\16\\2010 at about 6:00 pm i was driving through the stephenville texas city park when i saw what appeared to be a bright star towards the south west. the star like object was in the direction of dublin texas, and slightly above the tree line. while i was looking towards the object, it blinked out. i then realized it was not a star. i brought my car to a stop and the object then reappeared, but in a slightly different location to the left. the object continued to turn off and on in a linear pattern moving from my right to my left. the object reappeared again in a few minutes but was lower and closer to the top of the tree line. i got my iphone 4 out and attempted to take video but the object stopped illuminating before i could activate the camera. i stepped out of my car and got my iphone ready to take video when the object reappeared for a third time. the first video attached below is what i caught on camera. the second video is of what appeared to be a military aircraft flying over about 15 minutes later. the military aircraft was coming from the ft. worth area (north) and was flying towards the dublin area at a high rate of speed. the first 3 sightings happened from about 6:00 pm to about 6:05 pm. the military craft flew over at about 6:15 pm. i started to leave the park at about 6:30 at which time i got a glimpse of the object again, but only for a brief moment. i stayed for a few more minutes and did not see it again. the object did not appear to be a conventional type aircraft. i did not hear any sound and could not make out a shape."],"Latitude":"32.226696","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around November 16th 2010","This sighting has never been favorited.",""],"City":"Stephenville","Viewing Distance":"Over One Mile"}