{"Latitude":"35.47206","Log Number":"US-11172010-0011","files":["/var/www/straped/mufon/html2text/26626.html.txt","/var/www/straped/mufon/org/26626.html"],"Object Flight Path":"Undisclosed","Region":"Oklahoma","divs":["Sighting DetailsWe were attending a Halloween event at the zoo. We had stopped because the crowd had bottle-necked. I looked up into the sky at a distance and I see something flying towards us on the horizon. It wasn't quite dark yet but this thing blended into the night sky so at first I wasn't sure what it was. Was it a plane, hang glider? There were no \"normal\" lights. I quickly realized I wasn't seeing something \"normal.\" I told my husband to look up and at first he thought it was a flock of geese because of the formation. Then he realized he was wrong too. As it came closer it appeared to have stripes of alternating glowing \"lights\". Black, white, black, white all along the front facing portion. It made NO sound. It flew overhead and then as it passed over us to the left it just disappeared into thin air!!! I remember thinking with all these people around us how come no one else is freaking out. I was shaking and had this feeling like I had just seen something I wasn't supposed to have seen. I posted immediately to my Facebook account that I had just seen a UFO. I wanted there to be proof and a timestamp. I called a TV station on the way home to see if anyone else had reported anything, but got no where (not suprisingly). I haven't stopped wondering about that night since. I am so grateful my husband saw it too. I can't imagine what it would feel like to be all alone with this knowledge! I read an article in the online paper today about another sighting in OK and that's what lead me here. Glad to know we aren't alone, but would LOVE to know for sure what it was we saw! As you can tell, it was weeks ago and I can't stop thinking about it. I will never stop wishing we had the camcorder with us that night."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.47206,+-97.510478(26626)&iwloc=A&hl=en\"> mufon case (26626) map </A>","City":"Oklahoma City","Disposition":"Unknown","Object Shape":"Boomerang","Weather Factors":"Unknown","Longitude":"-97.510478","Case Number":"26626","Tags":"City","Date Submitted":"11/17/2010 02:48 UTC","Summary":"Craft flew over our heads at the Zoo","Source":"MUFON","Date of the Event":"10/27/2010 07:40 UTC","Viewing Distance":"Unknown","Country":"United States","Object Features":"Undisclosed","trends":["There have been 78 other sightings in Oklahoma City","There were 4 other sightings in Oklahoma City on or around October 27th 2010"],"Sighting Duration":"Undisclosed"}