{"Object Flight Path":"Straight-line path","Latitude":"39.760428","Tags":"City","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.760428,+-84.189587(26636)&iwloc=A&hl=en\"> mufon case (26636) map </A>","Date Submitted":"11/17/2010 11:25 UTC","Source":"MUFON","Longitude":"-84.189587","Log Number":"US-11172010-0018","trends":["There have been 40 other sightings in Dayton","There were no other sightings in Dayton on or around November 17th 2010","This sighting has never been favorited.",""],"Date of the Event":"11/17/2010 07:30 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/26636.html.txt","/var/www/straped/mufon/more/26636_submitter_file1__001.JPG","/var/www/straped/mufon/more/26636_submitter_file2__002.JPG","/var/www/straped/mufon/more/26636_submitter_file3__003.JPG","/var/www/straped/mufon/org/26636.html"],"Country":"United States","Object Shape":"Fireball","Sighting Duration":"Undisclosed","Region":"Ohio","Viewing Distance":"501 Feet - 1 Mile","City":"Dayton","Summary":"Fireballs flew over my house","Disposition":"IFO","Case Number":"26636","divs":["sighting detailsi was leaving my house to visit a friend at around 7;30 tonight 11\\17\\20.i was in my driveway about to get in my car, when my wife came out of the house with my cigarettes that i'd forgotten. when she brought them out to me she pointed to the west and said \"what is that\"? we saw 2 fireballs coming towards us moving west to east. they flew directly over our house about 300 feet above us. they were in the shape of spheres that were on fire. we could see that they were covered in flames. we got a good look at them and they were red and yellow glowing fireball. they were moving horizontally together. we watched the fireballs fly directly over the house and i told my wife to go get the camera! by the time she got back out they had traveled far enough that they were only the size of red dots . she zoomed in on them and snapped 4 pictures of them moving away from us. these fireballs didn't stop or slow down and were moving at a very fast speed with no sound. these objects were absolutely not planes, jets, balloons, blimps, hot air balloons, meteorites, but they were completely engulfed in flames. i know,more pictures of red lights in the sky we wish we would of had the camera when they flew over the house. i was spectacular! we couldn't believe how close they were to the ground. the camera used was an olympus fe360 2.5 pixels."]}