{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/26635.html.txt","/var/www/straped/mufon/org/26635.html"],"divs":["Sighting Detailsmy wife and i were outside looking for shooting stars(while having a smoke) when i noticed what had looked like a plane approaching from the south.bright light, but,high in the sky.as it was getting closer the light dimmed to where it looked like a moving star(no blinking lights,slow pace).then, it turned a quick 35 degree angle to the east. as it went behind a high thin cloud, it disappeard, and i said to my wife ,\"i bet it appears near that star,(pointing to a star where i thought it would appear)\".and i was pretty close. by this time we were looking about dead east and as the light headed in the northeast direction i still didnt notice any blinking light and the brightness never faded or got stronger.about an hour later we went out to have another smoke and i noticed a small plane(looking east) going north to south and low(blinking light and could hear it) then i noticed the same light we saw an hour ago right above it moving the same direction(but it seemed like it was about the same altitude as before but going much faster). I looked at my wife and said,\"its hauling ass now\", and she agreed.when we looked back up it seemed like it had slowed down and we watched it for about 5 min until it was barely visible on the horizon."],"Log Number":"US-11172010-0017","Case Number":"26635","Viewing Distance":"Unknown","Date Submitted":"11/17/2010 11:18 UTC","Source":"MUFON","trends":["There have been 3 other sightings in Edgewater","There were no other sightings in Edgewater on or around November 10th 2008"],"Object Flight Path":"Undisclosed","Region":"Florida","Latitude":"28.990955","map":"<A HREF = \"http://maps.google.com/maps?q=28.990955,+-80.901076(26635)&iwloc=A&hl=en\"> mufon case (26635) map </A>","Country":"United States","Summary":"in a distance, looked like airplane headlights (brightness)but high in altitude","Longitude":"-80.901076","City":"Edgewater","Object Features":"Undisclosed","Object Shape":"Star-like, Unknown","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"00:02:00","Date of the Event":"11/10/2008 08:30 UTC"}