{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.778956,+-87.466959(2663)&iwloc=A&hl=en\"> mufon case (2663) map </A>","Case Number":"2663","Object Flight Path":"Unknown","Object Features":"Undisclosed","City":"Centerville","trends":["There have been no other sightings in Centerville","This sighting has never been favorited."],"Object Shape":"Unknown","Latitude":"35.778956","Log Number":"","Date Submitted":"07/31/1967 12:00 UTC","Date of the Event":"07/31/1967 12:00 UTC","Disposition":"Unresolved","Tags":"City","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"00:00:59","Summary":"karen77","Longitude":"-87.466959","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/2663.html.txt","/var/www/straped/mufon/org/2663.html"],"Region":"Tennessee","divs":["Sighting DetailsIll make this short and sweet..It looked in the window at me and I looked at it,we stared for a moment and I said to my self what the hell is that And wecontinued to stare at each other and at the time no one talked about aliens backthen so I thought it was a guost..And a while later7B yrs7D the rag magasines came out with a picture of an alien and I said to mymother, that is what I saw It was white, you could almost see through it and ithad round black eyes..This is really hard to describe. And I had a burning smellin my nose for about a week after. And when I was about 12 orso the sky lite uplike it was on fire and I turned around and my house was behind me..I didnt knowhow I got there and my motherfather and brother were gone..I still find it verypuzzling..And a short time later a man from the government came to my housewearing a suit, carrying a briefcase and drove a big black car and asked my dadwhat he had seen along with my neighbors..I was young and didnt really stickaround to hear him..I just thought it was kinda cool, a guy from the governmentcame to OUR house..We lived in the country kinda and it was rare to see someonein a suit, let alone from the government...And my brother told me years later hesaw one elien look in the window..It was white with Big black eyes and longboney fingers. He will not talk about it anymore. He thinks people will thinkhes crazy..THat was in michigan..THen like I said I saw one look in the windowat me when I was in Tennesse when I was 17..But the one I saw was white withround black eyes..There have been other things also but its a long story..I dontcare who believes me...I know what I saw and what me and my family also saw..And how come all of us who have seen them say the same thingThey are white humanform with black eyesBelieve me or not I dont really care, but that is what I sawwith my own eyes... Karen"]}