{"Latitude":"29.918539","Object Shape":"Flash, Star-like","Summary":"What are these moving stars ?? Every night / Every morning..This morning was different..","Object Flight Path":"Straight-line path","City":"Waggaman","trends":["There have been no other sightings in Waggaman","This sighting has never been favorited."],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.918539,+-90.210909(26639)&iwloc=A&hl=en\"> mufon case (26639) map </A>","Weather Factors":"Unknown","Source":"MUFON","Case Number":"26639","Date of the Event":"11/18/2010 05:00 UTC","Date Submitted":"11/18/2010 10:19 UTC","Longitude":"-90.210909","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/26639.html.txt","/var/www/straped/mufon/org/26639.html"],"divs":["Sighting Details I see these moving stars every night and morning that its not cloudy..They just glide across the sky. Faster than a plane would be alot slower than a falling star.Sometimes there 4 or 5 within 10 minutes time. No blinking lights like a plane would have.Except the ones that slowly strobe and stay out for a few seconds,those are usually amber colored. But as I was watching the third one I saw(just this morning) (looks like a star)gliding across the sky,not far from it and its path..I saw a bright blink,and this star slowed down.So I was looking where the blink was,and it was another one.It was going the other way.It was signaling the other one..That was the first time I saw that happen.There have been alot more lately (alot mro active).Sometimes they go straight, sometimes wobble,sometimes zig-zag.I have even seen them move to go around stars..These can not be airplanes..I was telling my sister about them a while back,she said call me next time you see one.I called her 5 minutes later and told her where to look,she freaked out when she spotted it.Then a few minutes later she called me back(she spotted another one). All u have to do is look up.I live across the river from the airport..They have radar.All I can say (they must be flying above radar). They do look higher than a plane would be..To all those who dont get it.Just look up Maybe I should report them everytime. But that would be every night just about..Ya'll need a repeat button .LOL.I see that there is a guy in shreveport on youtube that records them (exactly the same thing i see). Shreveport is in north Louisiana,I live in south Louisiana."],"Log Number":"US-11182010-0002","Region":"Louisiana","Country":"United States","Object Features":"Undisclosed","Disposition":"Unknown"}