{"Date Submitted":"11/18/2010 08:06 UTC","Source":"MUFON","Summary":"Very small, star-like object exhibiting odd movements","Region":"Arizona","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-111.635269","Latitude":"35.209602","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around November 18th 2010"],"Date of the Event":"11/18/2010 04:50 UTC","Object Shape":"Star-like","Case Number":"26638","Disposition":"IFO","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Other","Log Number":"US-11182010-0001","divs":["Sighting DetailsI work the graveyard shift at the hospital in town, and I was sitting outside this morning on my break at 4:30am local time hoping to observe some of the Leonid meteor shower. I only saw 4 meteor streaks when I was outside, so I kept moving my line of sight in order to see if a different direction would have better action. At 4:50am, I noticed a 'star' located in the vicinity of the Big Dipper (I don't have that much knowledge of star names and locations) that kept grabbing my attention, because it looked like it was 'twinkling', but the other stars nearest to it were not. This 'star' was very small, like the others nearby, so I'm guessing it was a great distance away, or just not noteworthy in size. Flagstaff is a Dark Sky city, so light pollution is very minimal, and it's easy to see a wide range of stars. There were no clouds to block the view. I assumed it was a satalite at first, because of the size and the fact that it was wobbling a bit, but it wasn't following a path. It kept returning to, from what I could tell, what was the same spot (not sure at that distance.)It was the same color as the other stars, but it kept changing it's brightness, lasting a few seconds each time, right before it would move. It would move about it's spot like it was a pinball in a machine, very irradic. When it would move, the light would blur out a little from the object, and it would move fast, zig-zag, make 90 degree turns on a dime. The whole area this was taking place in could have easily been blocked out by my pinky finger nail. There were two stars nearest to this object, and they formed a scalene triangle with the object, but I believe this was a coincidence unrelated to the object. After the whole 30 minutes I stayed watching it, a nurse came outside and we chatted for no more than 5 minutes. When she left and I looked back at that spot in the sky, the object was barely noticable, but I had to get back to work. I know it was a meteor shower, but there's no way that was any meteor fragment. Anyone else out there notice this?"],"Tags":"City","City":"Flagstaff","map":"<A HREF = \"http://maps.google.com/maps?q=35.209602,+-111.635269(26638)&iwloc=A&hl=en\"> mufon case (26638) map </A>","files":["/var/www/straped/mufon/html2text/26638.html.txt","/var/www/straped/mufon/org/26638.html"]}