{"Object Features":"Unknown","Country":"United States","Object Shape":"Circle, Cylinder","trends":["There have been no other sightings in North Pontiac","This sighting has never been favorited."],"Source":"MUFON","Region":"Michigan","Disposition":"Unknown","Latitude":"42.549007","Case Number":"26644","City":"North Pontiac","map":"<A HREF = \"http://maps.google.com/maps?q=42.549007,+-83.464869(26644)&iwloc=A&hl=en\"> mufon case (26644) map </A>","Summary":"kind of disk shaped but not skinny. not quite as tall as wide. smooth edges. i want to say it had lights under. i want to say red. its still fuzzy. maybe 30 or so feet wide. not really huge at all.","Weather Factors":"None","Tags":"City","Longitude":"-83.464869","Date of the Event":"07/04/1983 12:00 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet","Sighting Duration":"Undisclosed","divs":["Sighting Detailsit was the 4th of july. i was 10,11,or 12. we were all out in the parkinglot watching everyone light their fireworks off. we lived in woodland square apartment coop. on starlight st. in pontiac. next to the only virgin wooded area left in that city. over the trees it came. i saw it floating there. so close. i remember pointing and saying \"LOOK!!! LOOK!!!\" everyone that was there saw it. there were alot of people. we all looked at it in awe! it was silent. it came closer. it was maybe 40 or 50 feet in the air when i first noticed it coming over the trees. closer and closer. it was silent. i want to say it had lights. it wasnt so dark that you couldnt plainly see what it was. after a while my mother went into our appartment to call whatever authority she thought would tell her what it was. i remember it coming but i dont remember it leaving. after it happened i dont remember making a fuss about it the next day or anything. it just seemed to not have happened. later in life i asked a boy who was my best friend at the time if he remembered the incident. and he seemed upset with me and answered quite sternly \"it was a blimp!!! it said happy 4th of july on the side of it!!!\" he seemed very angry with me for asking him to recall the incident. i asked my mother this year if she remembered it. she said she didnt. i asked her to try really hard to remember and she said that she did remember going into the house to call the police who told her that it was a hellicoptor. those are the only people i remember from back then that were there. im absolutely sure it wasnt either of those things. i know what i saw. i remember it coming CLEARLY. i just dont remember it leaving. ive never known any blimps to fly close to the ground on the 4th of july when morters are exploding in the sky. and i absolutely know with everything in my being that it was not a helicoptor. it was SO close. maybe 100 200 feet away. i really want to be hypnotized to remember everything. i know some of the event and others i remember small parts of are missing. mary zimmer helped a friend of mine remember and he is feeling much better. i would love it if she could help me. im desperate. not knowing consumes me sometimes. i just want to know. im not scared. i just want the walls in my mind to be taken down. its in there i know it is. i really want to remember.ive had many \"dreams\" about ships and them."],"files":["/var/www/straped/mufon/html2text/26644.html.txt","/var/www/straped/mufon/org/26644.html"],"Object Flight Path":"Hovering then path","Date Submitted":"11/18/2010 12:50 UTC","Log Number":"US-11182010-0007"}