{"map":"<A HREF = \"http://maps.google.com/maps?q=41.485921,+-73.050697(2664)&iwloc=A&hl=en\"> mufon case (2664) map </A>","Viewing Distance":"21-100 Feet","Date of the Event":"11/30/1988 08:00 UTC","Date Submitted":"11/30/1988 08:00 UTC","Log Number":"","files":["/var/www/straped/mufon/html2text/2664.html.txt","/var/www/straped/mufon/org/2664.html"],"Case Number":"2664","Country":"United States","Summary":"saw object hovering within a rocks throw.","divs":["Sighting Detailswe were building a clubhouse at a dirt clearing near a wooded area. it was darkoutside with clear skies. we were about to nail down the last piece of the roof,when i saw a briliant white light behind us from the corner of my eye. i turnedaround saw this object,then grabed my friend and turned him around and showedhim. he instantly became transfixed on the oject and became unresponsive. I didnot know what it was, but it flew like nothing I ever saw before or since. Myreaction was intrigue and fear. My partner did not have any reaction until itleft, then he was overcome by fear. Our final reaction was to run away. Itshull blended perfectly with the nights sky. It had a brilliant white lightcoming from its entire bottom. The light coming from the bottom, lit up theimmediate surroundings like if it was daylight. When the object was moving itseemed like it had a long green light on the back of it. The green light wasglowing but not as bright as the white light under it. The object came down ata steady pace until it came to a hover approximately 18-20 feet from the ground,40-50 feet directly in front of us. It stayed in that exact position for approx30 seconds. It did not make any sound or stir up any dirt or debris. Then itstarted to rise and move toward the tree line to our right. It moved over thetree line into the woods and did what I would call a u-turn and headed backtowards us again. Approximately 30 seconds after going over the tree line itcame back to a hover at the exact place it hovered before. Then after hoveringfor about 15-20 seconds it started to rise and move towards our left which wassouth. It continued to rise until its white light blended with the stars, thenwent out of sight. It maintained a slow steady pace during all these movements.Maybe 5 miles per hour when maneuvering in front of us increasing the speedduring its departure. This is not a joke"],"City":"Naugatuck","Object Shape":"Oval","Disposition":"Unknown","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Object Flight Path":"Unknown","Object Features":"Dome","Region":"Connecticut","trends":["There have been 6 other sightings in Naugatuck","There were no other sightings in Naugatuck on or around November 30th 1988"],"Longitude":"-73.050697","Source":"MUFON","Tags":"City","Latitude":"41.485921"}