{"files":["/var/www/straped/mufon/html2text/26648.html.txt","/var/www/straped/mufon/org/26648.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.160925,+-83.373237(26648)&iwloc=A&hl=en\"> mufon case (26648) map </A>","Date of the Event":"11/18/2010 01:10 UTC","Longitude":"-83.373237","Sighting Duration":"Undisclosed","Region":"Kentucky","Disposition":"IFO","Date Submitted":"11/18/2010 05:40 UTC","Case Number":"26648","divs":["Sighting DetailsThis sounds crazy I know! The weirdest thing happened I go running about 4 times a week I run to the top of a mountain and pray. Well I noticed an object in the sky a red light very fast i thought it was a comet until it stopped above me and started getting closer. I closed my eyes for maybe 3 seconds and when I opened them I was shocked there someone was in front of me. I thought it may be someone else out hiking or something he looked normal so I asked him does he see that. He told me he came out of it I laughed thinking he was joking. He told me he needed my help with something that only I could help him with I told him he was crazy. I told him aliens don't exist but he didn't call himself an alien he called himself something else at first he wasn't even speaking in English. He asked me what did he have to do to prove he was an alien I was joking and said make fire come out of your hands I didn't think it was possible I must be going crazy because I swear I seen fire. I screamed he grabbed my mouth and said I'm not here to hurt you I need your help.Being afraid I asked him what was it he needed,he told me some crazy story about him and his brother and that I knew where his brother was and where his brothers spear was. It is crazy but I had a dream about his brother before but I don't know him just the name. Before he could finish talking to me something else came out of the forest except it didn't look like us it was pale skinned, no hair, great athletic condition,eyes so dark I have never seen that color black before it wasn't very tall either maybe 4.5ft maximum. They started fighting the next thing I know I'm knocked down and when I raise up there both gone. The one that I first talked to though didn't look nothing like the other it looked like us and it had a sword that when it hit a tree as he swung at the other and it fell over it went straight threw. There is more but to much to go over here I think I may be going crazy. Please one of you that work here please contact me and tell me I am going crazy. I am very afraid."],"Object Shape":"Fireball, Sphere, Star-like","Tags":"City","trends":["There has been one other sighting in Hyden","There were no other sightings in Hyden on or around November 18th 2010"],"City":"Hyden","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Log Number":"US-11182010-0011","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Summary":"I not only seen the ship he talked to me.","Latitude":"37.160925"}