{"Longitude":"-98.960981","map":"<A HREF = \"http://maps.google.com/maps?q=32.100304,+-98.960981(26642)&iwloc=A&hl=en\"> mufon case (26642) map </A>","City":"Rising Star","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/17/2010 07:00 UTC","trends":["There have been 7 other sightings in Rising Star","There were no other sightings in Rising Star on or around November 17th 2010"],"Log Number":"US-11182010-0005","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26642.html.txt","/var/www/straped/mufon/org/26642.html"],"Tags":"City","Date Submitted":"11/18/2010 11:07 UTC","Object Features":"Undisclosed","Summary":"Lighted disc shaped object with rotation spotted 150 ft. above field.","Disposition":"Unknown","Case Number":"26642","Region":"Texas","divs":["Sighting Detailsi was picking up a load of crude oil from a lease 3 miles southwest of the williams community.upon arriving at the lease i spotted a light hoovering above a nearby field.it had oddly spaced lights that were moving right to left.when one would start to disappear to the right i could see the other starting to reappear to the left.it gave the impression that it was disk shaped and had rotation.there was only one light at a time in clear view as the the second was always disappearing as the next one was coming into view on the opposite side.i grabbed my phone to get a picture.before i could get the shot the craft gave the impression that it went from a horizontal position to a tilted one and just as i was fixing to take the picture it simply vanished or the lighted aspects of the craft went dark.there were no streaks of light as it disappeared.Just the total absense of any lights.It made no noise and wasnt moving in any direction other then when the object tilted and a distinctive rotation of the visable lights.i observed the object through the windshield of my truck and from the outside of the door as i was trying to get the shot.It gave the impression it was aware that i had grabbed my phone.things happen quickly as soon as i picked it up.i was very disapointed i couldnt get the shot."],"Weather Factors":"Windy, Medium","Country":"United States","Latitude":"32.100304","Object Flight Path":"Stationary","Object Shape":"Disc"}