{"City":"Fort Myers","Sighting Duration":"Undisclosed","Region":"Florida","Object Shape":"Fireball, Flash, Star-like, Other","Log Number":"US-11182010-0004","Date of the Event":"11/18/2010 12:00 UTC","Object Flight Path":"Undisclosed","divs":["sighting detailsi had a errie psyonic feeling in the air, i was 'feeling my place in the cosmos' and feeling out my life and what the future brings. i had spent the night researching on the internet the ufo phenomenon and became convinced that they watch us constantly and that my previous negative experiences with the super-natural had to do with my cosmic identity and that i couldn't escape dealing with the painful and strange side of life. while walking my dog i really felt like i must have been sending out psyonic distress signals. after i saw it i tried to send it something to let them know that i was okay. the event could have been a natural phenomenon however i feel fairly studied in the observation of nature and the night sky and can't think of what it would be. that coupled with my convictions about the nature of consciousness and its roll in the universe (my initial angle on this being from direct negative experiences, many years ago) i do beleive it was super-natural. what happened: i looked up, after catching 'something' out of the corner of my eye, maybe a flash. then i saw what appeared very clearly to be a comet in the sky. sitting there with a tail and white streek behind it, the tail was also blue, i know that comets move very slow so i was at first astonished that i had not scene it before. within the same second of spotting this there was also a very long shooting star right to the right of me, about 30 degrees from my central field of view of 'the comet'. in retrospect it looked like one of those really high flying shooting stars that is just a single-white-line except it seemed super low and close. to my total surprise the 'comet' started to disintegrate... slowly... with this distinct blue gas lingering for a good 15 seconds. the shooting star is perhaps co-incidental, and maybe i witnessed some extreme and random collection of negative ions in the sky. but i don't think so. the lingering blue gas was an incredible sight. i'd say the comet phenomenon was about 1 to 1\\2 a degree of visible area in the sky. it was distinctly 'blue gas' floating around and slowly dissipating. initially with a bright light at its far right center. in retrospect it looked like it could have been a strobe light peering through a low lying cloud. i tried to make out a ship in the general area there but i can't be sure, i did see weird-ness in that whole general area."],"files":["/var/www/straped/mufon/html2text/26641.html.txt","/var/www/straped/mufon/org/26641.html"],"Viewing Distance":"101-500 Feet","Date Submitted":"11/18/2010 11:02 UTC","Object Features":"Undisclosed","Source":"MUFON","Case Number":"26641","Longitude":"-81.868728","Country":"United States","Tags":"City","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=26.647908,+-81.868728(26641)&iwloc=A&hl=en\"> mufon case (26641) map </A>","Latitude":"26.647908","Weather Factors":"Unknown","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around November 18th 2010"],"Summary":"Strange comet like fomation with lingering blue gas in the sky; way too short to be a comet, trail of low flying blue gas could not have been a meteor, distinct bright light sitting inside the blue gas. Under 1,000 feet. 3 AM Ft.Myers FL"}