{"Viewing Distance":"Unknown","Date Submitted":"11/18/2010 01:17 UTC","City":"Rancho Cordova","divs":["Sighting DetailsIt was approximately 8:35 AM, and I was out on my morning walk during my first break at work. Since a storm is moving in today, I looked up to check for clouds, and saw a strange object heading over the Sierra Foothills. Thinking it might be a large jet, maybe even an Air Bus, I looked at it closer, and realized there was something strange about it. I see planes on a daily basis, from the size of personal twin engine type, all the way to huge cargo planes. I work in Rancho Cordova, CA, which is directly under the flight path from Sacramento International Airport to the East, and within 3 or 4 miles of Mather (a former air force base), that still receives cargo planes for various shipping companies, along with fighter jets for the popular air shows. No, what I saw today was nothing like a plane or a jet. For instance, with a plane or jet, you can always make out the wings, but this object had none. It was bright white, and looked segmented (long white section, then a small grey section, white section, grey section, long white section), kind of like a centipede), and it flew in a straight line. When I first sighted the object, it was already pretty far away, and yet in the sky it was the size of a dime (which makes me estimate it was at least the size of a football field). And it was traveling at a high rate of speed. In no more than 5 seconds the object was completely gone."],"Case Number":"26646","Summary":"White segmented, Cigar shaped object seen between Rancho Cordova and Sierra Foothils","Disposition":"Unknown","Tags":"City","Longitude":"-121.294228","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26646.html.txt","/var/www/straped/mufon/org/26646.html"],"Latitude":"38.593442","Object Features":"Undisclosed","Region":"California","Object Shape":"Cigar","Source":"MUFON","Date of the Event":"11/18/2010 08:35 UTC","Sighting Duration":"Undisclosed","trends":["There have been 18 other sightings in Rancho Cordova","There were no other sightings in Rancho Cordova on or around November 18th 2010"],"Weather Factors":"Unknown","Log Number":"US-11182010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=38.593442,+-121.294228(26646)&iwloc=A&hl=en\"> mufon case (26646) map </A>","Country":"United States"}