{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was outside around 6:30 PM on November 14, 2010. I was looking at the moon and Jupiter as it was clearly visible. I looked the east was watching the planes that fly over from down south. They go by every 2 or 3 minutes. Inbetween planes, I saw a light traveling in the same path. I thought it might be a plane at a higher altitude, except it had no wing markers on it. And it was traveling extremely fast. Then it almost came to a complete stop instantly, but not quite stopped. Then it made a 90 degree turn to the east and accelerated to an incredible speed in one second. As it increased speed, it appeared to grow in size and looked distorted for a fraction of a second. Then the object vanished and the distortion then vanished. Two seconds later I saw another light following the same path in the same area of sky. And it just increased speed and went out of veiw over the trees to the north. Again there were no flashing lights or markers on second object. The entire event lasted between 15 and 18 seconds. My feelings during this event were that this was not a conventional aircraft or any kind of craft known. The sudden 90 degree turn, incredible speed and its departure startled me considerably. I know of nothing that can move this fast or make a turn at such a speed."],"Date of the Event":"11/14/2010 06:40 UTC","Sighting Duration":"Undisclosed","Longitude":"-82.81762","Source":"MUFON","City":"Trenton","files":["/var/www/straped/mufon/html2text/26643.html.txt","/var/www/straped/mufon/org/26643.html"],"Case Number":"26643","Disposition":"IFO","Object Shape":"Circle","Summary":"circular in shape and brightly lit","map":"<A HREF = \"http://maps.google.com/maps?q=29.613294,+-82.81762(26643)&iwloc=A&hl=en\"> mufon case (26643) map </A>","Country":"United States","Log Number":"US-11182010-0006","Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","Date Submitted":"11/18/2010 11:41 UTC","Region":"Florida","trends":["There has been one other sighting in Trenton","There were no other sightings in Trenton on or around November 14th 2010"],"Latitude":"29.613294","Object Features":"Unknown"}