{"Date of the Event":"11/17/2010 03:40 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.867222,+-103.660833(26655)&iwloc=A&hl=en\"> mufon case (26655) map </A>","Object Shape":"Circle, Star-like","Disposition":"Unknown","Longitude":"-103.660833","Latitude":"41.867222","Log Number":"US-11182010-0018","Date Submitted":"11/18/2010 11:13 UTC","trends":["There have been no other sightings in Scottsbluff","This sighting has never been favorited."],"City":"Scottsbluff","files":["/var/www/straped/mufon/html2text/26655.html.txt","/var/www/straped/mufon/org/26655.html"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Weather Factors":"Windy, Light","divs":["sighting detailsi am a 42-year old male with a recent marital separation and displacement from my home. i am currently living at my parents home while searching for another place. i mention this to provide an indication of my current mental state of being at the time of this sighting. it seems all in my life has gone horribly wrong, and at the time of the sighting, i was in the process of speaking a rather angry prayer to the judeo-hebraic god yhwh, in whom i believe. at the time, i was casting blame toward him for my recent state of affairs. i had just endured a bitter argument which actually caused some suicidal thoughts for a few moments, but i recovered relatively quickly. i went outdoors behind the house and entered into a state of prayer while looking up at the sky. during the prayer, i was facing due north of scottsbluff and was staring at a elongated dark nimbostatus cloud. i was angrily praying that i didn't understand what the purpose was for my being born, when god has permitted nothing to happen in my life that is successful. when i had uttered \"i loath the day i was born and don't understand why you would put me here to get nowhere in this world, and i don't even know why i bother to speak to you when it always seems to fall on deaf ears\", i saw a bright star-like object descend from the cloud at which i had been staring. at first the object appeared to descend at a rapid rate. i thought it could simply be an aluminum-coated party balloon being blown about by winds, while reflecting the sunlight since it was only about 3:40 pm mst and the sun was at a 45-degree westerly position from the objects position in the north. the balloon theory quickly vaporized as the object became quite active. the object increased in brilliance and jolted approximately 10 to 20 miles to the left of its former location, within a period of half a second (estimated based on the perceived altitude of the object in relation to ground miles per inch moved from perspective). the object came to an abrupt halt, then shot to the right and past the position where it had begun. it then moved 5 to 10 miles to the right of its starting position within less than one second once again and came to a complete halt. the object returned to its starting point and then ascended above the cloud for about 15 to 20 seconds. as the clouds moved away to reveal the object again, it began moving up and down rapidly, about 20 to 30 times with enough speed that it appeared to draw a diagonal line of light in the sky. it came to a stop and then began flying in a round circular pattern, performing 6 complete circles. the object then ascended and moved back above the cloud and remained out of sight for another 10 seconds, then it began to slowly descend below the cloud where it came into view again, then went back up above the cloud. this ascending and descending occurred 3 times. on the third time of ascension, the ordeal was over and the object wasn't seen again. considering i was angrily praying when the object occurred, i was quite stunned and fear-stricken. while i'm not absolutely sure this sighting had anything to do with my angry prayer at the time, it seems to be more than a mere coincidence to me, giving me the \"feeling\" that \"something\" was observing the commotion i was making, since i was speaking toward the sky out loud. i remembered the last utterance i had made before this object of brilliance appeared and i gave in to awe at first as prayer turned into a very silent period of observation of the object. once it had concealed itself not to be seen again, the awe turned into a rapid heartbeat and a sense of fear as i finally was able to move - at which time i went back into the house and mentally repeated what i had seen over and over again for nearly 3 hours after. i realize many of scientific mind may want to gain a deeper insight into how the mental\\spiritual state of people may be influencing at least some of these sightings, and i have provided mine openly so others may take these things into account. i am concealing the information that led up to my marital woes, and the names of my family members for privacy reasons. however, i believe the \"mental climate\" i was experiencing at the time of the observance may play a very important role in why i saw this \"thing\" whether demonic, angelic, or other-worldly alien. i can tell you this much, however. no human being could survive the abrupt stops, or the rapid changes in altitude this thing made. i also feel i wasn't alone in the sighting, as all of the neighborhood dogs were barking ecstatically the entire time i observed the object. once it ascended above the clouds, the dogs continued barking for about 3 minutes after it wasn't seen visually again. this was a very, very creepy and unsettling event for me, and one i hope i never have to endure again."],"Viewing Distance":"Over One Mile","Tags":"City","Object Features":"None","Country":"United States","Region":"Nebraska","Case Number":"26655","Summary":"Brilliant Star-Like Object With Abrupt Movements Left and Right, Then Circular Flight Maneuvers, Changing Altitude","Source":"MUFON"}