{"Object Shape":"Circle, Sphere","Log Number":"US-11192010-0001","divs":["sighting details a string of orbs over san francisco caught on video tape! this is not the first time i have seen these type of things. i also have videos of other strings or ribbons of orbs flying over head just a few day prior. in my backyard i was looking up and noticed a long string of white orbs. it was night time and i first thought it was a series of helium balloons that got free. but after closer inspection, i realized these were not balloons. the shape was different, they were lit up and although flying together, the orbs were free to move around (as not connected). the thing moved slowly northward then eastward then ne then east again. it was about 200 feet up. the orbs did not have a balloon shape but were perfectly round and emitted a white light from within. also, the orbs did not stay in place, they moved to other positions in this string pattern. they were free to move about each other yet they stayed pretty much in this string pattern. i was lucky to have my new \"ir video camera\" and captured them flying over my house for a minute or so. please see video. i will also post the video on you tube under my site ufoandusohunter. hope for clear skies and more sightings. *(wit's first name and other information deleted--cms\\sg)"],"Region":"California","Summary":"16 bright white ORBS flying over house. Orbs shifting positions as changing directions","Object Flight Path":"Path with directional change","Date Submitted":"11/19/2010 01:27 UTC","files":["/var/www/straped/mufon/html2text/26656.html.txt","/var/www/straped/mufon/org/26656.html"],"Viewing Distance":"101-500 Feet","Object Features":"None","Sighting Duration":"Undisclosed","Date of the Event":"11/15/2010 06:45 UTC","Tags":"City","Weather Factors":"None","Latitude":"37.78339","City":"San Francisco","Source":"MUFON","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around November 15th 2010","This sighting has never been favorited.",""],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.78339,+-122.413856(26656)&iwloc=A&hl=en\"> mufon case (26656) map </A>","Longitude":"-122.413856","Case Number":"26656","Country":"United States"}