{"Viewing Distance":"Unknown","divs":["sighting detailsi was driving home one night from my girlfriends home, i had just crossed the black river bridge on rt. 41, up ahead i could see strange lights flashing in the sky. the lights where orange in color, and rectangular in shape. the night sky was cloudless, and crisp, allowing me to see clearly the stars and moon. the moon shone bright, causing the sky to appear a deep shade of purple. i pulled my car off to the side of the road and stepped out, to get a better view of the lights. the lights seemed to flash in patterns, (see attachment), every time they flashed the pattern changed. it seemed to me that the lights were signaling or giving out a code of some sort. the more i observed the the lights i could make out a outline in the sky, then i could see that these light were coming from a huge, circular object in the sky. my feeling went from curiosity to excitement and wonderment. then from nowhere, i felt like something was watching me, i was scared to move, but at the same time waves of peace and a sense to relax, were also present in my body. needless to say, i had an array of mixed emotions in just a series of minutes. i decided i just needed to leave, the emotions and sense of being watched alone made me feel uneasy. i got into my car and drove off, still keeping an eye to the skies. about 1\\4 of a mile i lost sight of it. i know what i saw was a ufo, something not from this world. i have always been tuned into the supernatural, and seen and heard things i can and cannot explain. even so much as had dreams that are unexplainable, dreams of tall dark figures, and such. this i cannot explain, but for some reason the events of that night and the details seem fresh in my mind."],"Country":"United States","Summary":"The UFO appeared to be isolated in the sky, circular in shape, and flashing rectangular, orange colored lights in a weird pattern.","trends":["There have been 4 other sightings in Georgetown","There were no other sightings in Georgetown on or around October 18th 2005","This sighting has never been favorited.",""],"Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"None","Date Submitted":"11/19/2010 04:09 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/26665.html.txt","/var/www/straped/mufon/more/26665_submitter_file1__UFOlightpatterns.png","/var/www/straped/mufon/org/26665.html"],"Date of the Event":"10/18/2005 02:15 UTC","Log Number":"US-11192010-0010","Tags":"City","Object Flight Path":"Stationary","Latitude":"33.383004","Longitude":"-79.285746","map":"<A HREF = \"http://maps.google.com/maps?q=33.383004,+-79.285746(26665)&iwloc=A&hl=en\"> mufon case (26665) map </A>","Case Number":"26665","City":"Georgetown","Disposition":"Unknown","Object Shape":"Circle","Region":"South Carolina"}