{"trends":["There have been 2 other sightings in South Miami","There were no other sightings in South Miami on or around November 17th 2010"],"Latitude":"25.710716","Summary":"two vividly blinking star-like objects traveling north-north-west in parallel formation","City":"South Miami","Region":"Florida","Source":"MUFON","Longitude":"-80.284195","Viewing Distance":"Over 1 Mile, Unknown","divs":["sighting detailsmy mother and i were walking westward on sw 68th street, approaching sw 75th avenue at about 8:15pm. we kept out eyes on the sky due to the leonid meteor shower scheduled to happen throughout the week and reaching its peak on the night of the 17th. but in the direction opposite to where the meteors were expected to pass, we noticed to very bright star-like objects moving north-north-west parallel to each other. they were blinking vividly and plusatingly and in unison across the sky and moving quite fast in a straight line. at first we assumed they were gps or telecom satellites because they were definitely artificial. but they were not moving in the direction in which satellites are supposed to move, nor are two satellites usually seen simultaneously. nor do satellites blink. these observations were noted later, once we arrived back home from our walk. i am still very curious as to what they were though i still want to believe that they are of earthly origin. we lost sight of them once they flew over the horizon (near the palmetto expressway\\sr-826). we also noticed that there were several commercial aircraft in the area with which to compare: several airplaines landing and taking off from nearby miami international and tamiami airports, and a medevac helicopter."],"map":"<A HREF = \"http://maps.google.com/maps?q=25.710716,+-80.284195(26663)&iwloc=A&hl=en\"> mufon case (26663) map </A>","Country":"United States","Sighting Duration":"00:03:30","Object Shape":"Star-like","Log Number":"US-11192010-0008","Weather Factors":"None, Does Not Apply","files":["/var/www/straped/mufon/html2text/26663.html.txt","/var/www/straped/mufon/org/26663.html"],"Date Submitted":"11/19/2010 10:49 UTC","Date of the Event":"11/17/2010 08:15 UTC","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Case Number":"26663"}