{"Sighting Duration":"Undisclosed","trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around November 18th 2010"],"Country":"United States","files":["/var/www/straped/mufon/html2text/26662.html.txt","/var/www/straped/mufon/org/26662.html"],"Region":"Texas","Weather Factors":"None","Date of the Event":"11/18/2010 10:05 UTC","Object Features":"Unknown","Log Number":"US-11192010-0007","Tags":"City","Date Submitted":"11/19/2010 09:16 UTC","Case Number":"26662","Disposition":"Unknown","Summary":"BLUE AND RED LIGHTS IN FORMATION TRAVELING LOW,FAST DIRECTLY OVER INTERSTATE TOWARD ME","Object Flight Path":"Straight-line path","divs":["sighting detailsi'm a truck driver in north dallas texas area for the most part.i was doin a nignt run from mesquite to coppell texas and back all night.i was 2 hours into my shift east bound on i-635 back to mesqiute.just entered garland in medium heavy traffic at 22o5 huors{10:05 pm} i see some blue and red lights about maybe as far as a mile to a mile and a half away,their comin down rite over the freeway up ahead and leveling off just above traffic and heading west toward me. i'm thinking what the heck,thats in the air and their red and blue and looks like their following each other in formation like three or four military helicopters but these light are solid and not flashing and red and blue,no green,red and white.the blue light's are on my left and red on the right.traveling in what appeares to be in pairs of blue and red like one unit with two light's each,three or four separate vehicle or aircraft.each pair was closer to each other than the space between each pair. all with perfect eaqual spacing among them selves.they keep coming my way just following the interstate like a roadmap moving prety dam quick.these light are hugging the freeway and all these other people on the road gotta be seeing this too. they kept comeing and flew rite over me,i looked up and out my wind shield as they passed directly over me.there was a lot of city roadway lighting and i could not see any actual craft,just light's,red and blue solid ,no flashing and fairly large.like volckswagon beetle size, no helicopter rotor noise.no jet engine noise.just these cool looking, briliantly rich, red and blue light's.they had to be on some kind of craft but i couldn't make out any silowette or anything. they just zipped rite on by and they cruised off down the road in between at least three airport raidar systems in the area that i know of. addison airport,love field\\dallas and dfw.some one had to see this besides me.they were prety darn low though so maybe they didn't show up on raidar.i don't know how to find out.the ball is in your court now mufon.this was to much to ever hope for in my life time. wow!!!!!!"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.922374,+-96.630083(26662)&iwloc=A&hl=en\"> mufon case (26662) map </A>","Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"32.922374","Longitude":"-96.630083","City":"Garland","Object Shape":"Other, Unknown"}