{"Summary":"hovering over our car 100 feet was a charcoal triangle object charcoal color with some 60 lights on belly","Sighting Duration":"Undisclosed","divs":["sighting detailsthe evening was at dust on a beautiful night so we had the windowns down. traveling along mackay road in gso, nc my eyes caught sight of some lights in the overhead sky. my minds eye thought it was a baseball field and upon realizing there were no fields in our area i screamed for my husband to pull the car into the center lane and stop. as a car passed us the person screamed holy ****. hovering 100 feet over our head perfectly formed in the background of the dusk of night was a trianle some 200 feet wide just sitting staring back at us. we decided to make a mental note of the object, had no camera, and we just sat and watched it. the 60 lights below were mostly the size of your first with three lights red, three green and three orange. it didn't have any large lights only these small lights. as the object starting moving west across the road we followed. we were moving at 15 miles per hour. as we turned the road to follow the object was no where in sight. my husband and i though it was a stealth bomber and when we got home we looked them up and we also drew a picture of what we saw so our mings would no run rampant. we called a local tv station to report and they said they had other sightings but unless it was spitting our flames they didn't care. we called the fbi since it was the day before 9\\11 and we contacted homeland security. they didn't care. we are both 62 and have never in our lives used drugs nor are we on any medication. the stealth bomber has jagged edges this object was a perfect triangle and we saw it as clear as a bell. we do wear reading glassed but thats all. it did hover and it did move at 15 miles per hour and it did disappear. my husband is a carpenter and that is how he knew the height above us and the width. just in case you need to know. thank"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.10213,+-80.241686(26667)&iwloc=A&hl=en\"> mufon case (26667) map </A>","Case Number":"26667","Log Number":"US-11192010-0012","Weather Factors":"Unknown","Source":"MUFON","Latitude":"36.10213","Disposition":"Unknown","Date Submitted":"11/19/2010 06:32 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"09/10/2010 08:20 UTC","Object Shape":"Triangle","Country":"United States","Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/26667.html.txt","/var/www/straped/mufon/org/26667.html"],"trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around September 10th 2010"],"City":"Winston-Salem","Region":"North Carolina","Longitude":"-80.241686"}