{"Tags":"City","Source":"MUFON","Summary":"HWY I-5 southbound portland or.","Disposition":"Unknown","Case Number":"2666","Region":"Oregon","Sighting Duration":"00:05:00","Object Flight Path":"Other","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/2666.html.txt","/var/www/straped/mufon/org/2666.html"],"divs":["Sighting Details I had entered the freeway from the lombard st. exit going due south... immediatly upon merging onto the freeway I looked up into the sky above to the south east .. all the cars had slowed way down by this time.. to see a of silver military jets flying very irradically.. At first i thought with my peripheral vision that they were birds by the way they were flying weaving back and forth.. thats what made me look up I then saw that the 2 jets were chasing a bright reflective object... the jets were trying to surround the object and keep it between them,, thats how it appeared to me. The whole Highway obviously saw this too. Jets around Portland do not fly the daredevil way that these jets were flying.. they were also not as high as any plane would be at all flying over the city. Especially over the highway The traffic was stopped and puttering along for 7 minutes.. I watched as much as i could of the flying jets and the bright object they were chasing, and maybe saw 2 min. worth and then the traffic jam.. all lanes were still... I have never seen anything like this in broad day light before. Very surreal.. I felt bewildered and have been very amped up all the rest of the afternoon because of it.. i hope i can sleep tonight.. I am really wondering if anyone else has reported this as well. I didnt know where else to report this to.. so thanks for being here.. I also thought that if it were reported we sure wouldnt hear about it on the evening news.thanks, jen"],"City":"Portland","map":"<A HREF = \"http://maps.google.com/maps?q=45.533252,+-122.669947(2666)&iwloc=A&hl=en\"> mufon case (2666) map </A>","Object Features":"Undisclosed","Object Shape":"Sphere","Date of the Event":"11/06/2003 11:30 UTC","Country":"United States","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around November 6th 2003"],"Latitude":"45.533252","Weather Factors":"Unknown","Log Number":"","Date Submitted":"11/06/2003 11:30 UTC","Longitude":"-122.669947"}