{"Sighting Duration":"00:15:18","Summary":"A shaft of light standing vertically where no lights have been seen in Mountains for 30 years.","Weather Factors":"Fog","Disposition":"Unknown","Object Shape":"Other","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.19623,+-82.0704(26661)&iwloc=A&hl=en\"> mufon case (26661) map </A>","files":["/var/www/straped/mufon/html2text/26661.html.txt","/var/www/straped/mufon/org/26661.html"],"divs":["sighting details i am sorry i cannot report seeing any type of vehicle,and i have had a close-up view of an unknown vehicle,that was in 1973, ever since then i've kept an eye out for strange aerial phenomena,and i do keep up with ufo news,but i do not report every light in the sky that i think looks strange. here's what i saw yesterday, a pillar of light standing vertically due west of roan mountain,tn. it was instantly striking because it was right out my back door,where i let my dog out every morning always about 10 'till 5,so i can get up in time to watch shepherd's chapel bible studies on tv. i will keep looking, it was too foggy to see anything this morning,maybe tomorrow. the thing looked as if someone had an airport spotlight shining straight up, but it ended abruptly, about 75 to 100 yards up and you could not tell if it was beaming upwards or down, just a standing pillar of light in the middle of nowhere. it didn't look like bear hunters. i cannot figure it out. it looked similar to the tail of a comet,but i've never seen a comet that large or bright. i will keep looking and report any future sighting of this object if it is seen here again. thank you, *(wit's name deleted--cms\\sg)."],"Region":"Tennessee","Longitude":"-82.0704","Latitude":"36.19623","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Case Number":"26661","Log Number":"US-11192010-0006","trends":["There have been 2 other sightings in Roan Mountain","There were no other sightings in Roan Mountain on or around November 18th 2010"],"Tags":"City","Object Features":"None","Date Submitted":"11/19/2010 08:26 UTC","Date of the Event":"11/18/2010 04:49 UTC","City":"Roan Mountain"}