{"Longitude":"-115.982405","files":["/var/www/straped/mufon/html2text/26668.html.txt","/var/www/straped/mufon/org/26668.html"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Region":"Nevada","Viewing Distance":"Unknown","Object Shape":"Star-like, Unknown","Disposition":"Unresolved","Sighting Duration":"12:00:00","Log Number":"US-11192010-0013","Source":"MUFON","Object Features":"Other, Unknown","trends":["There have been 12 other sightings in Pahrump","There were no other sightings in Pahrump on or around November 10th 2010"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.217424,+-115.982405(26668)&iwloc=A&hl=en\"> mufon case (26668) map </A>","Date Submitted":"11/19/2010 08:04 UTC","City":"Pahrump","Latitude":"36.217424","Summary":"sparkling objects with red and blue revolving lights in outer space","Tags":"City","Weather Factors":"Unknown","Date of the Event":"11/10/2010 06:00 UTC","divs":["Sighting DetailsI had read recently that huge ships from outer space are hovering over our world and that they want us to see them so we will get used to them and not be afraid of them before they land here, and they are going to land soon. So, after reading the whole website \"The New Earth\", which took me six months of part time reading, I did go outside my house one night and look at the sky just for the heck of it, which I normally don't do. The only thing I saw to look at was directly in front of me to the northeast and looked like what I thought was a planet of some kind, or a star. I am not at all educated on the planets, as I was never interested in astronomy. It twinkled with red, white and blue lights that seemed to be revolving, but then as I watched it I saw it moving around, up and down, backward and forward. That sure got my attention. I just stayed and watched it, then went in and got my husband and he saw it too and we were both amazed. Then I called up my neighbors and my husband's nephew and they saw it and couldn't imagine what it was but didn't seem too interested in finding out. I went inside but kept coming back out to look again. It stayed there all evening, moving constantly, and I finally went in to bed at about 9 pm. The next night it was there again in the same way. This was two weeks ago. Now I am looking all over the sky every night at all hours and I see them everywhere when the sky is clear. Our night sky is literally crawling with these sparkling, moving, objects. It is utterly fantastic to see. During the course of a long night they travel closer to each other, away from each other, and they come into view over the trees at different places on different nights. The one I first saw always came up behind one certain tree on my horizon, but last night it came up farther to the right or behind a different tree, not that close to the first one. I can definitely see five of them in a circle around our town and valley every night, at probably the same distance away from earth. They are identical in appearance. But very late at night the stars seem to be much brighter and I can see more of the moving ufo's, dimmer and farther away in space. Two nights ago I went out at 3:30 am and saw a whole new bunch. The one in the northeast was stationed quite close to the one that comes up in the east. Four bright moving objects were placed roughly in a square off to the right side of my house, in the sky. None of these objects has ever come close to earth, that I can see. They are in outer space but you can still see them with your bare eyes and my eyes are not that good. I don't have a telescope but one neighbor does and she says she will get it down from a high shelf in her garage soon so we can take a better look. I have looked at them with binoculars but I get pretty much the same view as without them. No matter where they are in the sky, they never sit still. I think it's because they want to attract our attention. One day I called the local newspaper to tell them about it but they haven't returned my call. Anyone in this town could see them if they ever looked up and paid attention. We are not too many miles from Nellis AFB but we are not in the Nellis Test Range where they do their testing of whatever they test. We are quite far to the west of Nellis. I want to get everyone to see these things. Even if we can't do anything about them we could at least have some kind of a dialogue going on. Whatever you think, I would like to hear it. Thank you."],"Case Number":"26668"}