{"Summary":"Was walking home from work, When I noticed, What appeared to be a plane coming in to land at CVG airport.","Country":"United States","files":["/var/www/straped/mufon/html2text/26664.html.txt","/var/www/straped/mufon/org/26664.html"],"Tags":"City","Object Shape":"Cigar, Disc","Object Features":"None","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI lived approximately 0.5 miles from the restaraunt I worked at, I was 16 years old when this event took place. (NOTE: I lived very close to the airport, And it was normal to see low flying planes and jets. On my way home from work that night, I was almost half way home, When I noticed a plane coming in on a normal approach pattern to the airport, It was a cool, crisp fall night, You could actually hear the leaves blowing across the street. But it hit me that this was not a plane or jet, It just looked peculiar to me ! And I stopped and watched in amazement, Because it made no sound what soever, The next thing I knew it was hovering right above me ! I was not scared, I was mesmerized by it, I was trying to estimate it's size, But I couldn't, Because I did not know what it was, But it's metal shimmered from it;s lights, Not like anything Iv'e seen before. Then, Just in a flash, It was gone, What seemed to me just a few minutes, Turned into more, When I got home I saw the clock, And asked my parents who were watching TV, If the clock was right, And they told me it was. I could not account for, About 30 minutes of time, I did not mention this event to anybody. I was in shock and awe about this event, For years, It doesn't make sense to me, to this very day, But several years passed, When their was a local UFO investigation, From a local station, They interviewed the Air Traffic Control Tower personnel, The control tower person they interviewed had been there for twenty years. They asked him if he had ever seen anything peculiar on radar, He said yes, And what he described he saw on his radar screen, Exactly fits to my incident, How it moved from one place to another, and then vanished."],"Weather Factors":"Windy, Medium","Disposition":"Unknown","Latitude":"39.020978","Log Number":"US-11192010-0009","Case Number":"26664","Source":"MUFON","Longitude":"-84.593347","trends":["There have been 4 other sightings in Erlanger","There were no other sightings in Erlanger on or around November 8th 1972"],"Viewing Distance":"101-500 Feet","Date Submitted":"11/19/2010 12:09 UTC","Date of the Event":"11/08/1972 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.020978,+-84.593347(26664)&iwloc=A&hl=en\"> mufon case (26664) map </A>","City":"Erlanger","Region":"Kentucky","Object Flight Path":"Path then hovering"}