{"Latitude":"43.282913","trends":["There have been 4 other sightings in Warner","There were no other sightings in Warner on or around November 18th 2010"],"files":["/var/www/straped/mufon/html2text/26679.html.txt","/var/www/straped/mufon/org/26679.html"],"Longitude":"-71.807276","map":"<A HREF = \"http://maps.google.com/maps?q=43.282913,+-71.807276(26679)&iwloc=A&hl=en\"> mufon case (26679) map </A>","divs":["Sighting Detailswell here we go, i was at the auction in concord, nh as i usually am on a thursday night. i left the auction at about 8:15 heading back home to vermont going up i-89 when in the area while on the interstate around warner, nh exit 9 at about 8:30 i noticed in the sky flying low slow and bright a big object. i then slowed down while on the interstate and watched it as it approached and passed directly over head and went south as i went north. it was a partically moonlite night the object was below the cloud line aprox 2,000-3,000 feet up. judging by the width of the lights at that height if they were on the ground they would have stretched beyond the width of the interstate. no aircraft that i know of has a light set-up like this and i know my aircraft. there were no green or red lights blinking or visible on the ends where wing tips would be. it floated along at a speed a little bit faster than a hot air balloon. absolutely no airplane, jet aircraft, or helicopter, moving too slow and the form would have been visible. this is not the first time i have seen strange objects and lights in the sky in this area at night. at first i just thought it was an airplane but once it got closer and more visible i knew it was something more and the speed told me otherwise. it was very fasinating to watch."],"Object Features":"Unknown","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Square, Rectagular","Log Number":"US-11202010-0009","Region":"New Hampshire","Case Number":"26679","Summary":"a row of 4 lights shining straight down just floating along like a hot air balloon","Date of the Event":"11/18/2010 08:30 UTC","Sighting Duration":"Undisclosed","Date Submitted":"11/20/2010 09:35 UTC","Tags":"City","Source":"MUFON","Country":"United States","Object Flight Path":"Straight-line path","City":"Warner","Weather Factors":"None, Light"}