{"trends":["There have been 3 other sightings in Merritt Island","There was one other sighting in Merritt Island on or around November 18th 2010","This sighting has never been favorited.",""],"Tags":"City","Log Number":"US-11202010-0003","Region":"Florida","Sighting Duration":"Undisclosed","Latitude":"28.324401","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=28.324401,+-80.657081(26673)&iwloc=A&hl=en\"> mufon case (26673) map </A>","Weather Factors":"Unknown","Object Features":"Undisclosed","Viewing Distance":"Unknown","divs":["sighting detailsdate of sighting: november 18, 2010 location of sighting: kennedy space center, florida i was watching one of the nasa live cams and i noticed an object fly near the top of the shuttle. i quickly took 12 screenshots, because this object was so obvious. what i saw is exactly what is in the photos here. i saw a gray metallic like football craft over the shuttle discovery. the cam is not a video cam but a photo cam that is updated every 3-5 minutes. i waited for the next photo and between photo you could see quick motion video of the craft. it shot downward at an angle that was about 60-70 degrees shooting tot he bottom left of the screen. no at that moment i hesitated and could not believe i saw it move. it was a straight line, not a bent line and not curved in any way. it is my belief that this ufo was a probe, unmanned but remote controlled and was observing them working to fix the cracks in the shuttle tanks. was it there because it could see something bad happening in the future i wonder? the shuttle discovery was delayed from first week of november to now be launched on the 30th of november. i took only screenshots of cams that nasa has. this ufo was over the shuttle discover while repairs were being made. i cannot imagine how an alien craft could possibly get into a high security launch pad area without nasa security or radar towers becoming aware of it. unless of course, nasa did know about the probe, but did not see it as a threat, but perhaps an allowed alien craft that is sometimes seen at nasa? then again, this may be a nasa craft, knowing their endless budget and hi-tech gadgets. please tell me in comments what you think about this and what it may be. thank you, *(wit's name and other information deleted--cms\\sg)."],"Date Submitted":"11/20/2010 10:34 UTC","files":["/var/www/straped/mufon/html2text/26673.html.txt","/var/www/straped/mufon/more/26673_submitter_file3__shuttlediscovery18nov201013.jpg","/var/www/straped/mufon/org/26673.html"],"Case Number":"26673","Summary":"This is 2nd UFO I caught in 2 days on same NASA Live Cam.","Longitude":"-80.657081","Source":"MUFON","Disposition":"IFO","Object Flight Path":"Undisclosed","Date of the Event":"11/18/2010 12:00 UTC","Object Shape":"Sphere","City":"Merritt Island"}