{"Latitude":"39.737092","Longitude":"-104.8269","Weather Factors":"Unknown","Date Submitted":"11/20/2010 09:15 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/26678.html.txt","/var/www/straped/mufon/org/26678.html"],"divs":["Sighting DetailsI pulled into a Shell gas station on the corner of Parker and Quincy in Aurora, CO. I was filling up my car with gas when I saw a plane fly over from the north. Being an aviation enthusiast, I glanced up to look at the plane and noticed right behind it, 3 very faint white dots to the north. The dot in the center glowed red for a few seconds, like a window reflector used to block heat on a car window. At first I thought it was either 3 aircraft or balloons. But the objects were completely stationary, not moving like an aircraft, just standing still in the sky. After about a minute the sphere on the far left disappeared. The two remaining spheres stayed stationary for about 10 seconds but then the one on the far right moved to the center sphere very quickly, and then disappeared. I grabbed my camera and took a picture of the center sphere but it was an old manual film camera (Pentax K1000) and the film did not turn out correctly exposed. I could not tell how far away the objects were but my guess would have to be several miles. The center sphere vanished about 20 seconds after I took a few pictures of it. I've been very cautious about telling people since I was afraid of being labeled crazy. I've only told my mom about the experience."],"Case Number":"26678","map":"<A HREF = \"http://maps.google.com/maps?q=39.737092,+-104.8269(26678)&iwloc=A&hl=en\"> mufon case (26678) map </A>","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around August 28th 2010"],"Log Number":"US-11202010-0008","Country":"United States","Region":"Colorado","Viewing Distance":"Over One Mile","City":"Aurora","Summary":"Saw 3 sphere shaped objects while at a gas station to the north","Object Flight Path":"Hovering then path","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Object Features":"None","Source":"MUFON","Disposition":"Insufficient Data","Date of the Event":"08/28/2010 12:00 UTC"}