{"Date of the Event":"06/05/2009 12:01 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.043081,+-100.920999(26676)&iwloc=A&hl=en\"> mufon case (26676) map </A>","Case Number":"26676","Log Number":"US-11202010-0006","Date Submitted":"11/20/2010 05:47 UTC","Weather Factors":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsI was standing on my back porch with other members of my family observing a beautiful circumhorizontal arc to the South of our house when I decided to take a picture to e'mail it to friends. I took a few pictures, deleted the ones I didn't like, and downloaded the one I did to my computer days later. When I blew up the photo on my computer screen I notice what looked like a small ball in the sky to the upper left; I thought at first it was a glitch in my camera's pixels since my camera is old (Sony DSC-P31, 2.0 Mega Pixel); but the object cast an undershadow, and also seamed to be reflecting sunlight. I guessed from what I saw on screen that if object was real it must have been about 300 ft. in the air, and about a 1 mile South. Hope you enjoy looking over this photo (and the circumhorizontal arch), and my two zooms - the second was done by color heightening: interesting how the object takes on an orange color like in the arc."],"Region":"Kansas","files":["/var/www/straped/mufon/html2text/26676.html.txt","/var/www/straped/mufon/more/26676_submitter_file1__UFOwithaCircumhorizontalArc.JPG","/var/www/straped/mufon/more/26676_submitter_file2__UFOzoom.jpg","/var/www/straped/mufon/more/26676_submitter_file3__UFOColorHeightened.jpg","/var/www/straped/mufon/org/26676.html"],"Object Shape":"Oval, Saturn-like","trends":["There have been 2 other sightings in Liberal","There were no other sightings in Liberal on or around June 5th 2009","This sighting has never been favorited.",""],"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","City":"Liberal","Summary":"Unidentified object observed in upper left portion of photo of Circumhorizontal Arc after photo was downloaded and blown up on computer screen.","Object Flight Path":"Unknown","Longitude":"-100.920999","Object Features":"Dome","Tags":"City","Country":"United States","Latitude":"37.043081"}