{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Case Number":"26687","Date Submitted":"11/21/2010 02:48 UTC","files":["/var/www/straped/mufon/html2text/26687.html.txt","/var/www/straped/mufon/org/26687.html"],"Sighting Duration":"Undisclosed","Object Shape":"Circle, Flash, Sphere","trends":["There have been no other sightings in Gainesville","This sighting has never been favorited."],"Weather Factors":"Unknown","City":"Gainesville","Region":"Missouri","Disposition":"Unknown","Object Flight Path":"Path with directional change,Other","Date of the Event":"10/15/2010 09:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.603118,+-92.428217(26687)&iwloc=A&hl=en\"> mufon case (26687) map </A>","Log Number":"US-11212010-0005","Latitude":"36.603118","Summary":"unusual flashes of light in sky","Source":"MUFON","Object Features":"Unknown","divs":["Sighting DetailsOn the approximate date and time my wife and I were star-gazing in our front yard on a nearly clear sky. I observed an intense and very brief flash of white light in the shape of a dot. It startled me a bit because we had seen no planes or FO in that vicinity. There was no context whatever, just an intense dot that had no shafts of light radiating from it. I watched that area for another minute hoping to see it again, which I did in a slightly different position, but identical other than that. I told my wife who was standing several feet away. I watched for several minutes more without seeing it again. I had just stopped looking and was about to suggest that we go inside, when my wife said, \"I just saw it\". We watched a short while longer without seeing it again and went indoors. Niether of us had any idea what it was. The unusual aspects of the sighting were that neither of us had ever seen anything like it before despite our history of sky-watching. I have previously reported other sightings to mufon. The quality of the light itself was also unique, it appeared niether incandescent, flourescent nor any other type I am familiar with. As I said, there were no rays of light radiating from it, yet it was intensely bright and seemed somehow focused. The interval of appearances was unusual, a minute or so apart and irregular and they stayed within a small area of the sky as if it were loitering. There was no audible sound. It was just a small dot of chalk-white light that blinked on and off three times in about five minutes in an area where it should not be."],"Tags":"City","Country":"United States","Longitude":"-92.428217"}