{"City":"Chicago","Tags":"City","Case Number":"26680","Source":"MUFON","Latitude":"41.883684","files":["/var/www/straped/mufon/html2text/26680.html.txt","/var/www/straped/mufon/org/26680.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.883684,+-87.624468(26680)&iwloc=A&hl=en\"> mufon case (26680) map </A>","Country":"United States","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was in my side yard bringing in the bird feeders as we have a raiding raccoon and it destroys the feeders. I live 50 miles north west of O'Hare airport ( Chicago ) I like to watch the planes as they fly over both day and night, I noticed a jumbo jet on it's landing path and I like the view of their wing tip lights from rear or the amber glow they have. I noticed a bright star like object behind and above the plane, at first I thought it was Jupiter but then I noticed that it was moving at the same speed as the plane. Normal rule that I know of is 3 mile distance between planes landing. It stayed above and behind the plane until the plane was out of sight, but I could still see it on the horizon, the object that is. It had no strobe lights or any lights at all. A second plane was within the normal distance from the jumbo jet and flying at same altitude as jumbo jet and desending. My thoughts after was wow my second sighting in two months, sorry haven't reported the first one yet, but I guess I will. I mentioned my sighting to my local meeting of MUFON Illionis today and since another also mentioned seeing a object like I discribed on same day and time I was asked to report, so here you go."],"Sighting Duration":"Undisclosed","Object Shape":"Star-like","Object Features":"Unknown","Weather Factors":"None","Viewing Distance":"Over One Mile","Date of the Event":"11/15/2010 05:15 UTC","Date Submitted":"11/20/2010 10:08 UTC","Disposition":"IFO","Longitude":"-87.624468","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around November 15th 2010"],"Region":"Illinois","Summary":"Trailing a jumbo jet landing at O'Hare airport Chicago.","Log Number":"US-11202010-0010"}