{"Weather Factors":"Windy","Object Flight Path":"Straight-line path","Sighting Duration":"00:01:30","Object Shape":"Sphere, Star-like","Tags":"City","Viewing Distance":"101-500 Feet","Case Number":"26684","Latitude":"42.499958","Source":"MUFON","Object Features":"None","City":"Roseville","Longitude":"-82.935831","files":["/var/www/straped/mufon/html2text/26684.html.txt","/var/www/straped/mufon/org/26684.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.499958,+-82.935831(26684)&iwloc=A&hl=en\"> mufon case (26684) map </A>","Date Submitted":"11/21/2010 08:45 UTC","trends":["There have been 14 other sightings in Roseville","There were no other sightings in Roseville on or around November 20th 2010"],"Disposition":"IFO","Date of the Event":"11/20/2010 07:22 UTC","Region":"Michigan","divs":["Sighting DetailsI've been working the night shift as a cab driver for several years, and I'm an avid skywatcher, and a UFO \"enthusiast\", if you will. I'm constantly keeping my eyes on the skies, but up until now I've NEVER seen anything that I couldn't explain(as much as I have wanted to see something). On Saturday, November 20th at 7:22PM I was driving in the city of Roseville Michigan, going eastbound on 10 mile road, when I saw this strange light directly ahead of me, at what appeared to be maybe 200 to 300 feet in the air. At first I thought it might have been a firework(a roman candle) that someone had just shot off. But the light remained constant and didn't dim or go out, which is when I said to myself \"what the HECK is that?\". I immediately pulled over onto a side steet and got out of the car to get a good look at it. At this point it was almost directly above me, and now looked to be perhaps 500 feet in the air. Although it's hard to judge distance on a \"LIGHT\". There was no STRUCTURE that I could make out, just a LIGHT. An orange-ish pink-ish hue, a color unlike any other light I have ever seen in the sky, and although not extremely bright, it appeared to have sort of brilliant corona, as if it SHOULD have been bright, but the intensity of the light just was not bright. Kind of difficult to explain really. As I watched it fly past, it \"appeared\" to be moving at a relatively slow to moderate speed, steadily gaining altitude, and heading on a true and straight line trajectory. I would say it was climbing at a 45 degree angle. Even though the speed appeared to be constant(slow to moderate) it didn't take long(about 90 seconds?) for the object to fade away into the distance, at which point I would guess it to be several thousand feet by then. Like I said, it's hard to gauge distance on a LIGHT, and it was also small in size. If my estimate of it's height when I got out of the car to look at it is correct(500 feet), then I would guess it's size to be 6 feet in diameter. The light never varied in intensity, it didn't flicker, and it didn't change color. I don't know what this was, but I can tell you what it wasn't. It wasn't a chinese lantern. It wasn't a balloon. It wasn't a flare tied to a balloon. It wasn't any sort of radio controlled craft. And it definitely wasn't any type of conventional aircraft. It was simply a \"LIGHT\". Close enough for me to see that it wasn't \"attached\" to any sort of craft, although the possibility remains that it was indeed a craft, that was \"glowing\". It flew, not floated, but \"FLEW\" like some type of craft. I don't know what it was, but I've never seen anything like it, and I can't for the life of me explain it. My very first UFO."],"Country":"United States","Log Number":"US-11212010-0002","Summary":"small orange-pinkish light moved in a straight line from NE to SW...."}