{"Object Shape":"Fireball, Triangle, Other","Longitude":"-81.860378","map":"<A HREF = \"http://maps.google.com/maps?q=30.068851,+-81.860378(26685)&iwloc=A&hl=en\"> mufon case (26685) map </A>","Latitude":"30.068851","Summary":"Bright red lights in the sky first in a line, then arc, then forming a triangle and disappearing","Weather Factors":"Unknown","Source":"MUFON","Case Number":"26685","Object Features":"Unknown","Log Number":"US-11212010-0003","Tags":"City","City":"Middleburg","trends":["There has been one other sighting in Middleburg","There were no other sightings in Middleburg on or around November 20th 2010","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","Date Submitted":"11/21/2010 10:38 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26685.html.txt","/var/www/straped/mufon/org/26685.html"],"divs":["Sighting DetailsMy wife, brother, and father were returning from St. Augustine about 7:19 p.m. Saturday, November 20, 2010. When I got out of the car, there were a number of bright red fireballs in the western sky towards Middleburg, Florida. We live between Green Cove Springs and Middleburg. The fireballs seemed to line up, then disappear one by one and reappear. I ran into the house and got my camcorder and my wife called the sheriff's office at the same time. A number of them would appear as if coming from the ground moving straight up as one would disappear. Four of the fireballs formed a curved line, then slowly moved away from each other and disappeared. I took my camcorder back into the house when they disappeared. My brother yelled for me to come back outside and the lights had re-appeared and formed a perfect triangle moving south in the night sky. I had left my camcorder in the house so I didn't get video of the triangle. I, also, sent an email to Channel 4."],"Date of the Event":"11/20/2010 07:19 UTC","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Region":"Florida"}