{"files":["/var/www/straped/mufon/html2text/26683.html.txt","/var/www/straped/mufon/org/26683.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.223573,+-110.920189(26683)&iwloc=A&hl=en\"> mufon case (26683) map </A>","Source":"MUFON","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around November 21st 2010"],"Date of the Event":"11/21/2010 10:46 UTC","Case Number":"26683","Object Shape":"Flash, Star-like","Sighting Duration":"Undisclosed","Longitude":"-110.920189","Object Features":"Unknown","Summary":"5+ lights moving in all diffrent directions far East of Tucson then flashing away at FAST SPEED!!","Viewing Distance":"Over One Mile","divs":["Sighting DetailsLooking East from East Tucson, we spotted 3 lights rising up from the horizon, all 3 taking diffrent paths. Soon after the first three started to line up at about 30 degrees above horizon to 45 degrees. At that point they slowed down and almost stopped in line. Then 2 more lights came in from the left of these bright red lights and started to circle around the first 3 lights. The first 3 lights then appeared to fly away due east away from us without appearing to rise or fall in height from the horizon. They looked like they were traveling @ maybe 300-400 miles per hour and faded out quikly. Meanwhile the other two lights continued to rise and cross each other at @ 40-45 degrees up from horizon. One ligh faded out pretty fast, not flying away, just faded out. The last red light then moved faily slowly away to the East getting dimmer. After almost a minute it was getting hard to see, but then flashed VERY BRIGHT and then appeared to fly straight up and out of sight in less than 2 seconds. We are sure they were not any type of aircraft that we have ever seen before and preformed manuveres that cant be done by modern airplanes. My wife and her son, and myself feel very strongly that these lights were of extra terrestrial nature."],"Country":"United States","City":"Tucson","Log Number":"US-11212010-0001","Disposition":"Unknown","Weather Factors":"None","Latitude":"32.223573","Date Submitted":"11/21/2010 02:26 UTC","Tags":"City","Region":"Arizona","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}