{"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsFor about the last 2 weeks my normally quiet and relaxed dog has been acting quite wierd. He has been given the nickname Bipolar puppy. He used to be ok in the dark he would sleep all night and only get up to potty. but now he cries and barks and carries on like something is hurting him. the only way i can get any sleep is to be right in front of him. On November 20th at 509 am i decided to take him for a walk to try to calm him down. We got to the end of my yard and I felt \"look up\" and i saw 5 triangular objects flying in a straight line. They flew that way for about 2 minutes then the last one broke the pattern and went directly under the last one. Im not sure if at that point they went out of my line of sight or just disappeared, but i thought wait, come back, and they reappearedright where i saw them the first time. Hearing the voice in my head didnt even begin to frighten me, but having them reappear after i thought it, scared the living daylights out of me. I nearly strangled Jake trying to get back in the house. They probably think that I am rude after all that, but maybe they'll understand. The other wierd thing is that almost immediately after getting back in the house Jake went and layed down and fell asleep ans stayed asleep for the rest of the morning. He even slept all last night. it was wonderful."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"11/20/2010 05:09 UTC","Latitude":"39.789811","Object Features":"Unknown","Longitude":"-89.643228","City":"Springfield","files":["/var/www/straped/mufon/html2text/26689.html.txt","/var/www/straped/mufon/org/26689.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.789811,+-89.643228(26689)&iwloc=A&hl=en\"> mufon case (26689) map </A>","Object Shape":"Boomerang, Chevron","Country":"United States","Disposition":"Unknown","Tags":"City","Log Number":"US-11212010-0007","Weather Factors":"Unknown","Source":"MUFON","Summary":"5 trangle UFOs over house","Region":"Illinois","Date Submitted":"11/21/2010 07:03 UTC","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around November 20th 2010"],"Case Number":"26689"}