{"Case Number":"26693","Latitude":"32.227743","Longitude":"-110.923409","City":"Tucson","Tags":"City","Disposition":"Insufficient Data","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=32.227743,+-110.923409(26693)&iwloc=A&hl=en\"> mufon case (26693) map </A>","Summary":"I Can Confirm the Tucson Sighting Seen by Many + Video","Date of the Event":"11/20/2010 10:40 UTC","Object Features":"Undisclosed","divs":["sighting detailsi was in tucson on the east side at catalina mart on golf links rd & pantano waiting for my friend who went inside when i noticed a line of lights coming up over the city skyline towards my direction. i am an avid ufo hunter as it is so, naturally, i had my camera with me and began filming. it was a line of red\\orange fireball orbs. my friend and i as well as a couple other random spectators gawked as they flew overhead. i considered they might be chinese lanterns until i zoomed in on one of them. they floated over us and disappeared. before they dissipated, i was able to zoom in on one that was right over us at about 300 ft. above our heads, it was a red fireball and it was rotating like a little red light house or something! there was no form to these lights other than that they themselves appeared to be made of light. unlike the previous report from the same night, i did not see them flash. they all seemed to simply vanish into the night sky rather than get further away in distance. they disappeared. thank god i had my camera! my channel on (link moved to additional evidence section--cms\\sg) please check it out and add me.... i see ufos all of the time but i don't want to 'cry wolf' but given the fact that there were multiple, unassociated witnesses in this case, i felt it would be appropriate for me to give my account of what happened and share the video. thank you. p.s. i hope they dont delete this link to the video as i cannot upload directly to the mufon site for some reason. my youtube again is **link moved to additional evidence section--cms\\sg) plus someone else who i do not know personally but who also lives here in tucson took video the same night half an hour earlier on a different side of town and that ***(link moved to additional evidence section--cms\\sg)."],"files":["/var/www/straped/mufon/html2text/26693.html.txt","/var/www/straped/mufon/org/26693.html"],"Log Number":"US-11212010-0011","Source":"MUFON","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around November 20th 2010"],"Weather Factors":"Does Not Apply","Date Submitted":"11/21/2010 10:56 UTC","Sighting Duration":"00:07:00","Viewing Distance":"101-500 Feet","Country":"United States","Object Shape":"Boomerang, Circle, Fireball, Sphere, Teardrop, Triangle, Other","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering"}