{"Weather Factors":"Unknown","Object Features":"Undisclosed","Summary":"Triangle of lights one by one turn off then back after crossing I-44 near St. Louis","Source":"MUFON","Object Shape":"Star-like, Triangle","Date Submitted":"11/22/2010 12:08 UTC","Country":"United States","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26696.html.txt","/var/www/straped/mufon/more/26696_submitter_file1__201011202215.JPG","/var/www/straped/mufon/org/26696.html"],"Longitude":"-90.350439","Log Number":"US-11222010-0001","trends":["There have been 2 other sightings in Webster Groves","There was one other sighting in Webster Groves on or around November 20th 2010","This sighting has never been favorited.",""],"Case Number":"26696","Object Flight Path":"Undisclosed","Latitude":"38.600952","Sighting Duration":"00:03:00","City":"Webster Groves","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=38.600952,+-90.350439(26696)&iwloc=A&hl=en\"> mufon case (26696) map </A>","Date of the Event":"11/20/2010 10:15 UTC","divs":["sighting detailsi was traveling south in i-270 near i-44 in kirkwood when i noticed a very bright star very slowly moving in the sky, apparently south of i-44 but paralleling eastbound. i exchanged to i-44 east and traveled about a mile passing by hills obscuring my vision south were the bright \"star\" was. when i got to a clearing i didn't see the star but saw an incongruent triangle of lights, two read and one white, all steady and not flashing. i came to another set of small hills obscuring those lights and looked for the lights where i expected them to be in the next clearing. i didn't see them but leaned forward and looked up, and just starting to cross the highway was a clearly equilateral triangle of white lights with a red light in the center. all the lights were steady but also flashed, the white lights one by one in a counter-clockwise direction. after it passed the highway going south to north, my right to left, one by one it turned off two of its white lights and then its center red light, but turned on a small red light next to the remaining single white light when the center red light went out. after it flew like that for a moment, it turned those lights back on in reverse order of how they shut off. it finally added two additional outer white lights as it flew off into the distance and i lost sight of it. though not directly of this circumstance, i have recently had at least 4 other sightings of unidentified aerial phenomenon - unconventional lights and\\or craft - at essentially this same location, september 29th, october 5th, and 14th. all these circumstances have involved seeing a star like object within a mile of the i-270\\i-44 interchange, and subsequently seeing lights or an object or objects that are clearly unconventional shortly afterward. this time, ironically, the car radio song playing when i last saw the uap was singing \"we should meet out space brothers of different races!\" that's to corny to make up, i'm serious!!"],"Region":"Missouri"}