{"Viewing Distance":"Unknown","Object Features":"Undisclosed","Date Submitted":"11/22/2010 08:06 UTC","trends":["There have been 8 other sightings in Royal Oak","There were no other sightings in Royal Oak on or around November 21st 2010"],"Region":"Michigan","files":["/var/www/straped/mufon/html2text/26708.html.txt","/var/www/straped/mufon/org/26708.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.49244,+-83.142918(26708)&iwloc=A&hl=en\"> mufon case (26708) map </A>","Object Flight Path":"Undisclosed","City":"Royal Oak","Disposition":"Unknown","Tags":"City","Sighting Duration":"00:20:00","Source":"MUFON","divs":["Sighting DetailsI pulled up to my house with my mom after grocery shopping.We had also just got off work.I saw what appeared to be a long stream of black jet smoke all the way across the sky as far as I could see in all direction's.While we carried the groceries into the house I noticed three large silent helicopters with big bright search lights started to circle the sky.This went on on for a good while.When they seem to have finally cleared the sky and gone away I noticed an object coming from the right of me in the sky.I told my mom to come see it.It flew pretty smooth.It looked triangular in shape,had three giant white lights on the front and a few red one's on the back which appeared clustered in a strange formation.It kept flying lower and lower.Then from behind me i noticed one of the helicopters came back out of no where and started to follow the object.The helicopter flew a little higher.I ran to my back yard to continue to observe as they both disappeared into the night sky.A moment later two giant aircrafts followed secconds apart from one another in the same direction.Now I dont know if they had anything to do with the engaged object but it was definantly strange. Now that being said it could have been a numerous amount of thing's: A government training operation. An enemy spy plane. A stealth fighter. Or what appears to me and I would like to believe was an actual unidentified flying object. I would like it to go on the record that I served this great nation in the united states marine corps and I can say that Ihave never seen an object like that or that type of helicopter.Also this was only witnessed by my mother and my self and have zero photographic evidence to support this claim. thank you."],"Longitude":"-83.142918","Date of the Event":"11/21/2010 07:27 UTC","Case Number":"26708","Summary":"Triangle shape with big lights","Country":"United States","Latitude":"42.49244","Object Shape":"Triangle","Log Number":"US-11222010-0010"}