{"City":"Undisclosed","Date Submitted":"11/22/2010 08:28 UTC","Region":"Florida","Object Flight Path":"Stationary,Hovering then path","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Case Number":"26709","Longitude":"-81.510294","Summary":"unusual aircraft seen over Wesley Chapel every night for a week in 9/2008","Latitude":"27.668207","files":["/var/www/straped/mufon/html2text/26709.html.txt","/var/www/straped/mufon/org/26709.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.668207,+-81.510294(26709)&iwloc=A&hl=en\"> mufon case (26709) map </A>","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Features":"Unknown","Object Shape":"Sphere, Triangle","Log Number":"US-11222010-0011","Tags":"City","Source":"MUFON","Weather Factors":"None","divs":["Sighting DetailsI called my husband from the hospital to tell him the doctor was inducing labor and he should come to the hospital. He told me he and the neighbor were outside watching a strange aircraft over the woods near our housing development. The neighbor and his grandchild were videotaping. My husband came to the hospital where we both stayed with our new baby for the next two nights. On the third night, we came home and I had put the baby down to sleep when my husband came to get me, saying the aircraft was back. We went outside and watched it in the woods behind our house for at least an hour or so. It was trangle shaped with blue lights. It was less from a mile from our house. My husband thinks it was about the size of a large vehicle, but it appeared bigger than that to me. It hovered in the air in an unatural fashion, moving a little bit every now and then, but staying pretty much in the same area. It also appeared to rotate periodically. We did not know what it was, but wondered if it was military aircraft. Our neighbor, ex-military, said it was not. My husband said he first noticed it by accident. That first night he saw it, he walked outside to change cars around and glanced up and saw it. We did not think to call the police, because it seemed unlikely they'd be able to do anything about it. We saw this same object every night for the next several days. We would check for it at night and it was there after dark, usually appearing later in the evening, after ten or eleven p.m. and remaining visible until the early hours of the morning. We would check periodically to see if it was still there, then get tired of watching it and go to bed. In the morning it was always gone. On the last night we saw it, we only saw it for about an hour or so. On that night, the moon was especially full and bright and there were a couple clouds in an otherwise clear sky. The object moved in front of the clouds at one point and we could make out its shape more clearly. It had a solid base, grayish in color and looked saucer shaped, which was strange because when we could only see the blue lights, it appeared triangle shaped. We watched as it decended and disappeared into the treeline, appearing to be landing. We have not seen it since. We have sent you the video under seperate cover. Feel free to attach it to this page. Unfortunately, a young kid took the video so it's not the best quality. Hope this helps your investigation."],"Date of the Event":"09/06/2008 12:00 UTC","trends":[]}