{"divs":["Sighting DetailsTraveling eastbound on I-44 in Webster Groves about 1 mile from the Laclede Sta. Rd. exit, I noticed what I at first thought was a commercial airliner taking off from St. Louis International airport flying over and away from the city in the distance. About the relative size of an asprin at arms length, I could make out a few white lights and a red light. The white lights suddenly flared up at the ends of the object and became much brighter and bigger, and it soon became a line of white light made up of smaller white lights that appeared to be quickly coming in my direction. The initial dimmer and smaller lights, if a common airplane, would appear to move slowly even if banking, but this object quite suddenly changed its appearance and now seemed to be not too far away and getting closer fast. I figured it must be a helicopter even though it seemed to change its appearance too quickly to be that either. Now appearing to be a line of very bright white lights seemingly made up of at least two or more smaller lights in a row, at least five small red lights appeared in cluster at what appeared to be the top back end of the object as it approached, seemingly like a traffic helicopter might parallel the road but very low, perhaps at 200 to 300 feet up traveling along the outer edge of the westbound lanes of I-44. No structure could be discerned yet, just lights. The red lights seemed to be changing in a cluster, and the white lights were flickering, and it was getting closer fast, and I had a hard time trying to discern what lighting I was seeing. When the craft was within perhaps 300 feet of me it started to strobe with a white flash that I could not discern the source other than the object. The last of the three pulses was extremely bright and made me blink, like a camera flash went off. After that strobing, there was a single red disk of light closer to me, and a single white disk of light further from me, which were on each side of a structure that appeared to be off-white in color. The \"fuselage\" that I could see looked like one long cylinder with two cylinders of the same size mounted half-way up the single lower cylinder, the two \"side\" cylinders half-way fused into the lower cylinder. The disks of light were just on either side above the side cylinders. I could not make out a beginning nor end of the craft, nor see its top. There was a bright white ambient glow at what would seem to be the top of the craft, like looking at light source in fog, but the lower structure of the craft could be clearly discerned. Basically, anything below the lights could be seen of the structure, but above the lights was a glow that hid the top structure. This all happened fairly fast, about 20 seconds, and I was trying to drive on an interstate, there were two cars in lanes to the left front of me. In my frequent glances I could yet see the bottom structure as it passed by me and I was focusing on the area that had the lights, and with the craft moving in the opposite direction of me I couldn't get an overall look at it. It was a very unseasonably warm night, and I rolled my window down when it passed. There were only two cars near me, and none on the other side, so the ambient sound was mostly just the wind blowing by. I have driven by many traffic helicopters and they would easily have been heard in this situation, but there was no indication of any sound coming from the craft. While I honestly could not depict the craft for several reasons, I could discern what I've related, which is enough for me to think that this was an unconventional craft. I used to make model airplanes as a kid, and while I was looking at the structure as it was passing by, all I could think was that it was like the bottom of the US Navy's A-7 Corsair. I could definitely see the a solid structure in a configuration that I'm not aware commercial nor military air vehicles have. The way the lights shined was also quite different than conventional aircraft lighting, it's hard to describe. The pulsing that took place when it was closest while in front of me caused me to be partially blinded in those times, and the last one lit up the highway like something was taking our picture, much brighter and wider in what was illuminated on the ground than the traffic light strobes that go off taking a picture of a car violating an intersection's traffic lights. That freaked me out a bit, and it seemed the other two cars traveling with me also let up on the gas as I did when that happened, so it seemed they saw at least that too. I was also a bit freaked out because this location where I first saw this craft was the last location I saw a triangle of white lights fly over me and turn off and back two nights before, November 20th, which I ironically had planned on and did report to MUFON after I got home from seeing this one!"],"Date of the Event":"11/21/2010 10:30 UTC","Source":"MUFON","Case Number":"26711","Latitude":"38.600702","Country":"United States","Sighting Duration":"00:00:20","Region":"Missouri","Weather Factors":"Unknown","Disposition":"Hoax","Longitude":"-90.351059","map":"<A HREF = \"http://maps.google.com/maps?q=38.600702,+-90.351059(26711)&iwloc=A&hl=en\"> mufon case (26711) map </A>","Tags":"City","City":"Webster Groves","files":["/var/www/straped/mufon/html2text/26711.html.txt","/var/www/straped/mufon/org/26711.html"],"Viewing Distance":"Unknown","Object Shape":"Cylinder, Unknown","Object Flight Path":"Undisclosed","trends":["There have been 2 other sightings in Webster Groves","There was one other sighting in Webster Groves on or around November 21st 2010"],"Log Number":"US-11232010-0001","Summary":"Silent craft with changing and strobing lights flew low along I-44 westbound","Object Features":"Undisclosed","Date Submitted":"11/23/2010 01:34 UTC"}