{"Case Number":"26713","Date of the Event":"11/21/2010 09:00 UTC","Longitude":"-92.326112","Weather Factors":"Windy","Viewing Distance":"Unknown","divs":["Sighting DetailsMy husband and I were traveling West on I-70 from St. Louis to Kansas City and were about 50 miles East of Columbia when he opened the sunroof of the vehicle and noticed a bright planet. He asked me what planet that was and after I looked at it a few times (I was driving) I saw that it was moving and too large and bright to be a planet. It was a very large very bright light and the size of an asprin or a bit larger held at arm's length. We kept watching it for about 15 minutes, when it changed course or position slightly north, to where I could see a a silver color chevron shaped structure with rounded edges. I realized at that point that it must have been fairly close to us - somewhere between 3,000 and 5,000 ft. I looked for wings or tail and saw nothing. As it moved, the white light only appeared on the left side,which would have been the back part of the craft, and partially obscuring the craft. About 15 seconds later it moved behind clouds and was partially visible for a minute, then no longer visible as the clouds got heavier. The object did not move like conventional aircraft and must have been moving slowly in order for us to see it for that length of time. See the drawing attached."],"trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around November 21st 2010","This sighting has never been favorited.",""],"Country":"United States","Object Shape":"Chevron","Log Number":"US-11232010-0003","City":"Columbia","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26713.html.txt","/var/www/straped/mufon/more/26713_submitter_file1__ChevronNov21.jpg","/var/www/straped/mufon/org/26713.html"],"Tags":"City","Object Features":"Other","Date Submitted":"11/23/2010 11:43 UTC","Disposition":"Unknown","Region":"Missouri","Summary":"Large Chevron craft south of I-70","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=38.957695,+-92.326112(26713)&iwloc=A&hl=en\"> mufon case (26713) map </A>","Source":"MUFON","Latitude":"38.957695"}