{"Date Submitted":"11/23/2010 12:22 UTC","Country":"United States","City":"Voorheesville","Disposition":"Unknown","Source":"MUFON","Summary":"While Driving see brightling on horizan, happen to drive to it. Then i watch it hover and then take off.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving back from a friends house. Its dark at this time around 735pm. As im driving I see a bright light on the horizon. I watch it for a good ten minutes and it never got dim or changed course(as far as I could tell). I happen to be driving in its direction on Albany County Rte 208. I even tried to catch its attention per say by flashing the high beams at it from time to time as I got closer. As I neared I started to go through all the possibilties as to what it could be(been involed in two other UFO encounters soo this isnt new to me). At this point im roughly a half mile away from it. As far as I could tell it was around 200-300 feet in altitude. The road starts to bend around to the right. As I come around the bend its on my left hand side. Im going roughly 35-40mph. I caught right up to it. As I got really close I could see a smaller flashing light kind of behind the ufo. Realized it was a helicopter coming towards it!! I stopped the car parralel with the ufo. Now its maybe 600 feet from me. If I were to hold my hand out at arms length it was just a little bigger than my hand. While im doing this im listening. No nosie except for the approaching chopper. I get back in the car and make a phone call the place I work.(I dont own a cell, havent since 05. Well im suppiled a company phone. Basic model no camera and a restricted call list.) I called one of the people I work with. I needed to have some sort of other human contact at that point because I was starting to kind of \"panic\". He found it funny untill he heard the fear in my voice. Those were his exact words. Well back to it, as I got on the phone it started to move to the right. It had a white light shinning out of the back.Appeared to be the back becasue the direction it was moving. It then stopped again, the light switched ends and it started moving slowly to the left. With in the next 5 seconds the end with the light lite a bit brighter and then shot off soo far the only thing I could see was a faint glimmer of the light in the distance. Thats my encounter, havnt been able to sleep or think the same since. Also interesting is that where this happened is only minutes away from the Thatchers park moutains. Ive seen the same light up on that mountain randomly. Now when I go up there to investigate theres no evidence. I can go right to the area where the lights would be and theres nothing but woods. Maybe the same ufo, I dont know? I do know that im having a hard time driving now because alls I do is look towards the sky. Dangerous ..lol .."],"Weather Factors":"None","Log Number":"US-11232010-0005","Date of the Event":"11/18/2010 07:48 UTC","Region":"New York","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Case Number":"26715","Object Shape":"Cigar, Oval, Other","Longitude":"-73.928736","files":["/var/www/straped/mufon/html2text/26715.html.txt","/var/www/straped/mufon/org/26715.html"],"Object Features":"Wings, Other","Tags":"City","Viewing Distance":"101-500 Feet, Over 1 Mile","trends":["There have been no other sightings in Voorheesville","This sighting has never been favorited."],"Latitude":"42.653967","map":"<A HREF = \"http://maps.google.com/maps?q=42.653967,+-73.928736(26715)&iwloc=A&hl=en\"> mufon case (26715) map </A>"}