{"Country":"United States","Disposition":"Unknown","Log Number":"US-11232010-0006","files":["/var/www/straped/mufon/html2text/26716.html.txt","/var/www/straped/mufon/org/26716.html"],"Latitude":"48.484462","Longitude":"-122.319748","Weather Factors":"Does Not Apply","Date of the Event":"11/18/2010 06:05 UTC","Sighting Duration":"00:00:06","Summary":"Saw round bright white object streak across the sky at 6:05 a.m. because I ran to see what time it was.","Date Submitted":"11/23/2010 01:42 UTC","Region":"Washington","Case Number":"26716","Source":"MUFON","trends":["There have been 8 other sightings in Burlington","There were no other sightings in Burlington on or around November 18th 2010"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=48.484462,+-122.319748(26716)&iwloc=A&hl=en\"> mufon case (26716) map </A>","Tags":"City","divs":["Sighting DetailsI was outside smoking a cigarette watching the sky at 6:00a.m. I was surprized to see some clearing around our house because it had been cloudy and raining earlier. I was standing on the west edge of our patio and out of the corner of my eye I noticed a light about 6:05a.m. I turned and saw a bright white round object in the sky on the west side of our house. It was about the size between a nickel and a quarter. Closer to a quarter. It was white and glowing. Did not know what it was but I thought it was a UFO. It came from the north and was going south. Flying as fast as could be. Faster than any jet I've ever seen. It lasted about 6 seconds. I lost sight of it when it went behind our birch tree but could still see some glowing white light and then it was gone. There was no noise at all or any emissions or tails behind it. The weather was partly clear and partly cloudy in areas and I could also see other stars in the sky. The object didn't seem to be very high. It was not up with the other stars, in fact it was about maybe 60 to 80 feet above the poplar tree west of our house. It's very hard to judge the distance above because your looking at a vast night sky. But it did seem very low. I kept watching for a few minutes more and then white clouds started to come in. I was in awe and very shocked to see this. I feel very lucky to of seen the many sightings I've seen over time. Our area seems to be very active for what reason, I don't know. I have seen many more sightins in our area also."],"City":"Burlington","Object Shape":"Circle","Viewing Distance":"Unknown","Object Features":"None"}