{"Latitude":"35.174247","Source":"MUFON","Longitude":"-87.737803","map":"<A HREF = \"http://maps.google.com/maps?q=35.174247,+-87.737803(26722)&iwloc=A&hl=en\"> mufon case (26722) map </A>","Date of the Event":"08/31/2003 12:00 UTC","files":["/var/www/straped/mufon/html2text/26722.html.txt","/var/www/straped/mufon/org/26722.html"],"Case Number":"26722","City":"Collinwood","Country":"United States","divs":["Sighting DetailsThis was the first time I saw the \"glowing balls\". Since this night, I have seen a red luminescent ball, another blue one, and two green ones. I have tried to do a little research online but I have been unable to find anything exactly like these things I have seen. I have seen two in Wayne County, TN, two in Pensacola, FL, and one just north of Nashville, TN in a small town named White House. The glowing balls don't fall at a normal rate as if dropping a tennis ball from a high elevation. These things seem to slowly fall as if they have a small parachute attached. The always fall straight down (no sideways movement). I have only seen them at night. The appear out of nowhere in the middle of the sky and fall to the ground several hundred yards from where I was standing (at the time) beyond the tree line. I would probably just disregard the sightings if I had only experienced this one time, but I have seen these balls 5 times, in 3 different parts of the south eastern US. Before I ever saw the glowing balls, I saw several silver objects darting in and out of a large cloud several miles off the ground (basically directly above me). I was at summer camp in 1997 when this happened. Someone else actually noticed the objects and brought my attention to them. We watched them for several minutes before the disappeared. I saw these objects in the middle of the day (possibly 2-3 pm)."],"Sighting Duration":"00:00:10","Date Submitted":"11/23/2010 08:45 UTC","Tags":"City","Region":"Tennessee","Disposition":"Unknown","Weather Factors":"Unknown","trends":["There have been no other sightings in Collinwood","This sighting has never been favorited."],"Log Number":"US-11232010-0012","Object Flight Path":"Undisclosed","Summary":"Blue luminescent ball","Object Shape":"Circle, Sphere","Object Features":"Undisclosed","Viewing Distance":"Unknown"}