{"Country":"United States","Object Shape":"Egg, Fireball, Oval, Teardrop","Longitude":"-80.643249","Sighting Duration":"00:05:30","Date Submitted":"11/23/2010 11:02 UTC","Region":"Ohio","Date of the Event":"11/23/2010 05:00 UTC","Weather Factors":"Unknown","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around November 23rd 2010"],"Latitude":"41.10714","Object Features":"Unknown","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26724.html.txt","/var/www/straped/mufon/org/26724.html"],"Object Flight Path":"Hovering then path","City":"Youngstown","Summary":"Strange UFO? UAP? Fiery Object? Portal Hovering","Log Number":"US-11232010-0014","divs":["Sighting DetailsI was driving doing some shopping and saw this object in the sky. I thought it was strange so I filmed it from a shopping plaza in Austintown, Ohio. The video title is the same as the short description on here.It appeared to be an oval shaped fiery object hovering in the Southern skies. This happened at around 5:oopm EST. I looked at my cell phone time to confirm it. I really didn't know what to make of the object. I tried to find a closer location to the object but it appeared (can't be positive) to be moving slowly away once I was at the 2nd location of filming. The second location was just a little further down the road at a bigger shopping plaza. At this point I lost sight of the object in the trees. I again tried to find a 3rd location but the object was no where to be found and there were many trees obstructing the skyline. I then went back to the original location to see if it was still there, it was not. I do not know what this was. I have gotten several emails already by folks swearing this is a portal to another dimension. Not sure what I believe."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.10714,+-80.643249(26724)&iwloc=A&hl=en\"> mufon case (26724) map </A>","Case Number":"26724","Disposition":"IFO","Source":"MUFON"}