{"divs":["Sighting DetailsThis occurred in the northern night sky. I was looking at what I thought were two pretty dim stars, when they randomly began getting extremely bright, I stress extremely bright, and began moving east. But how they were moving was weird. They looked as if they were falling out of the sky.. It is fun catching things like this... They were in my line of sight of about 3-5 min before they ran into the tree line.. It is hard to explain without sounding weird but I was looking out at the sky, as I normally do in anticipation of seeing these objects. When these two what I thought were stars caught my eye. Withing about the first 30 seconds of noticing them, their light became so bright. Approx. 3 times brighter than 'Sirius'. As they were becoming extremely bright they also began to move. It was weird, they looked like they were simply falling.. Probably because of the direction I observed this from. So, they were moving east. No sound, it wasn't anything explainable.. About 30 min. after seeing these two, a final third object (I think this may have been \"Hailey's Comet\") moving fast but was in my line of sight for about 5 min. This object was heading east from the west. This object kept its 'brightness' , wasn't like the first two.. Did anyone else see this? It made me happy. I love seeing these! After the sighting I wanted to see more, its peaceful."],"Case Number":"26725","Disposition":"Insufficient Data","Country":"United States","Source":"MUFON","Object Flight Path":"Hovering then path","Summary":"Two dim objects became extremly bright, seemed to enlarge and began moving","Object Features":"Unknown","Date of the Event":"11/16/2010 07:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.134046,+-80.224204(26725)&iwloc=A&hl=en\"> mufon case (26725) map </A>","Viewing Distance":"Over One Mile","Region":"Florida","Longitude":"-80.224204","Sighting Duration":"Undisclosed","Log Number":"US-11242010-0001","City":"Plantation","files":["/var/www/straped/mufon/html2text/26725.html.txt","/var/www/straped/mufon/org/26725.html"],"Weather Factors":"Unknown","Latitude":"26.134046","Date Submitted":"11/24/2010 12:37 UTC","Object Shape":"Circle, Diamond, Egg, Flash, Oval, Sphere","trends":["There have been 6 other sightings in Plantation","There were no other sightings in Plantation on or around November 16th 2010"],"Tags":"City"}