{"Longitude":"-88.309513","City":"St Charles","divs":["Sighting DetailsWELL THEY ARE HERE, WHAT CAN I SAY, THIS TOWN IS HOT. MUST HAVE CONCLUDED MY 500TH \"FUNNY LIGHTS\" SIGHTING A WEEK AGO. THEY MUST BE VICTIMS OF PURE DICTIONARY DEFINITION ON THE CHEMISTRY BOOKS TO HOLD SUCH UNLIMITED QUANTITIES OF URANIUM NUCLEAR POWER. I OFTEN ASK MYSELF, IF I HAD A UFO, THEN WHERE AM I GOING ANYWAYS? THE GARBAGE DUMP POT GOT TOO HOT AND MELTED INTO THE CENTER OF THE PLANET.....OOO OOOO OOo! QUICK! COVER IT UP WITH MORE GARBAGE, NO QUICK SPILL SOME MORE WATER ON IT. ONCE DUMB GERMANS ALWAYS DUMB GERMANS...I SIT ON MY SMOKING TANNING CHAIR AND CONCLUDED ONE THING RECENTLY AFTER LIKE MY BILLIONTH STRANGE SIGHT....THE UNIVERSE IS A VERY OLD PLACE, BUT, ONE THE OTHER HAND, THE UNIVERSE IS A VERY SMALL PLACE. SAINT CHARLES IS HOT, THE SAD, BUT HAPPY, BUT IRONIC PART IS THAT.......CONCLUDING ONE LAST STATEMENT..THE ANSWEAR IS ALWAYS RIGHT THERE IN FRONT OF YOURE FACE...BEHIND YOURE FACE , YOURE HEART, YOURE MIND, THEN THE PHYSICAL REALM WE LIVE IN. SINCERELY YESHUA BLAHA (RUSSIAN FOR FENDER GUITAR) & CHRIS BLAHA \"MARY MAGDALENE\" (A MAGALLAN GPS) MERRY CHRISTMAS PS : ITS OK TO PUT MICROCHIPS IN YOURE HEAD IF ITS NOT A KNITSTITCH WITH A WIRELESS SIGNAL FROM THE 1600S \"hint hint\""],"Weather Factors":"Unknown","Latitude":"41.918951","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around November 2nd 2010","This sighting has never been favorited.",""],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/26727.html.txt","/var/www/straped/mufon/more/26727_submitter_file1__UFO-wisconsin-711287.jpg","/var/www/straped/mufon/org/26727.html"],"Object Flight Path":"Undisclosed","Tags":"City","Country":"United States","Region":"Illinois","Log Number":"US-11242010-0003","Date of the Event":"11/02/2010 01:00 UTC","Case Number":"26727","Date Submitted":"11/24/2010 08:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.918951,+-88.309513(26727)&iwloc=A&hl=en\"> mufon case (26727) map </A>","Viewing Distance":"Unknown","Disposition":"Hoax","Object Shape":"Circle","Object Features":"Undisclosed","Sighting Duration":"00:01:00","Summary":"FUNNY YOU MENTIONED SAINT CHARLES"}