{"Region":"Nevada","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around November 25th 2010"],"Case Number":"26739","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/26739.html.txt","/var/www/straped/mufon/org/26739.html"],"Object Features":"None","Disposition":"IFO","Weather Factors":"None","Date of the Event":"11/25/2010 06:45 UTC","Log Number":"US-11252010-0007","divs":["sighting details6:45pm, clear skies, no wind, 39 degrees outside, no planes visible. i stepped outside to have a cigarette in my back yard, looked up toward the south and at about 45 degrees up i saw what at first looked to be the white wings of birds in a v shape moving from east to west but as i looked it was moving too fast to be any birds and was apparent it was an object with a body with luminous dots (don't know quite how to explain it, it wasn't lights but could make them out faintly, like they were almost in a mist). object emitted no sound. i stepped back to see around the shop we have that was blocking my view to see if i could still see it and i could. i watched still going west until it was out of sight. i have seen many flocks of geese (i lived in jackson, wy. for 25 years) and these were not geese or birds of any kind. this had a body that was barely there (hard to explain). it had to be rather large object but move fast making no sound. when i realized it wasn't birds, i knew it was a ufo, i was in awe, i wasn't scare, i just wanted to watch it. i felt like getting in the car to chase it but knew it was way gone. i hope this makes sense to you. sorry, no photos, there wouldn't have been time to get the camera. *(wit's first name deleted--cms\\sg)."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.201219,+-115.107701(26739)&iwloc=A&hl=en\"> mufon case (26739) map </A>","Longitude":"-115.107701","Summary":"Luminous white dots (not bright) in a triangle shape","Latitude":"36.201219","Viewing Distance":"Unknown","Country":"United States","City":"North Las Vegas","Date Submitted":"11/25/2010 10:31 UTC","Source":"MUFON"}