{"Summary":"Luminus white oval light traveling NNE, silently with larger luminius lights flashing on the ends of the oval on for 1 sec, off for 1 sec","Case Number":"26737","Log Number":"US-11252010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=28.277276,+-82.717725(26737)&iwloc=A&hl=en\"> mufon case (26737) map </A>","Longitude":"-82.717725","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/26737.html.txt","/var/www/straped/mufon/org/26737.html"],"divs":["Sighting DetailsMy wife( skeptic) and I were sitting in our back yard enjoying outside fire and star gazing. I notice high overhead a liminus light traveling at high speed to the NNE. At first I thought it was a plane. The light seem to be oval, almoct disk shaped, with the light or the whole body being constant. Also there were 2 luminus lights, 1 on each end of the oval or disk body that flashed on and stayed on for about one second then off for a second then on again. When the outboard lights were on, those lights made the craft appear to be solid from one side to the other and the outboard lights thicker than the disk or oval was. I asked the wife if she saw the lights. Her answer was \"What the --- is that\"? I told her I didn't know. Speed was faster than any commercial or military aircraft I have seen here from my yard. I live in Tampa air traffic control area. There was no sound . There was also no red or green navigational lights or beacon light visible from my point of observation.I got the feeling I was looking at a solid body that was giving off its own light. There was a broken overcast with a cloud base of 10 to 1500 ft.agl. Altitude of object was probably 30,000 to 50,000 agl. Craft may have been larger than a C-5A Galaxy. Object was in viewing area about 30 seconds. Lost sight after it passed over clouds. Only feeling I had was how lucky I was to see a possible ufo with my skeptic wife. Next morning I got up early to watch ISS pass overhead for comparrison. ISS was not near as fast or large , but was a beautiful sight as it passed by Venus in the early morning sky. This evening, Thanksging, I made another eving fire to sit outside, enjoy the weather and star gaze again. Happen to see a bright meteor, I pointed it out to my wife. It was visible so long she moved out of her chair to see it pass over tree we were sitting under.This also was not like the the sighting we had 2 days ago.She said I should report this, maybe someone else saw it."],"Date of the Event":"11/22/2010 06:47 UTC","Country":"United States","City":"Port Richey","Date Submitted":"11/25/2010 08:31 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Object Shape":"Oval","Object Features":"Unknown","Tags":"City","Disposition":"Insufficient Data","trends":["There have been 8 other sightings in Port Richey","There were no other sightings in Port Richey on or around November 22nd 2010"],"Weather Factors":"None","Region":"Florida","Latitude":"28.277276"}