{"Disposition":"Insufficient Data","Country":"United States","Weather Factors":"Unknown","City":"Rock Falls","Region":"Illinois","Source":"MUFON","Summary":"bullet shaped ufo similar to sighting # 25425.","Longitude":"-89.688997","Sighting Duration":"Undisclosed","Date of the Event":"07/01/1955 12:00 UTC","divs":["Sighting DetailsI am relating now what I saw and have wondered about all of my life: This was in 1955. I was almost 5 years old outside playing in the yard on a sunny clear day. My mother and my aunt were both sitting outside at a folding card table having coffee and (deep) conversation. Seemingly out of nowhere, a gray torpedo or bullet shaped object came moving thru my yard in an easterly direction. It was about 3 feet long and 1' in diameter. Something intelligent was obviously directing its movement. It was about 2 feet off the ground, traveling about 3 or 4 mph at most. I saw it and gave chase. I had no idea what this was; I just wanted to catch it. When I would catch up to it and reach out to touch it, it would move just out of my reach.It felt like there was a force field around it. I would almost reach it, like inches away and I would fall down, get back up, chase it again unable to touch it; all the time I seemed to get this message in my head that \"You are too young or too small, you can't touch us\". Of course, when I ran over to try to get my mom and my aunt to look at the object, I was told to not interrupt. So, I was the only real witness to this event as I watched it this ship leave my yard and continue on its way east,crossing the street heading east from the end of my yard, where I stopped. I watched it travel out of site into parking lot where some large trucks were parked. It was the only ufo I ever saw until a couple months ago. I have seen 4 in the last two months, and 3 in one night. These were very high in the sky. Each of these was different. One was like a falling star; it was a constant light just dropping out of the sky straight down. One was a tiny star like point moving, stopping, jumping and disappearing. Another was like a star getting very, very bright then disappearing as quickly as it appeared. Also, what I saw 55 years ago looks alot like the object reported in sighting 25425; Believe it."],"files":["/var/www/straped/mufon/html2text/26730.html.txt","/var/www/straped/mufon/org/26730.html"],"trends":["There have been 2 other sightings in Rock Falls","There were no other sightings in Rock Falls on or around July 1st 1955"],"Log Number":"US-11242010-0006","Object Shape":"Bullet, Missile","Latitude":"41.779753","Viewing Distance":"Unknown","Date Submitted":"11/24/2010 03:03 UTC","Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"26730","map":"<A HREF = \"http://maps.google.com/maps?q=41.779753,+-89.688997(26730)&iwloc=A&hl=en\"> mufon case (26730) map </A>"}