{"Summary":"Western Pennsylvania Sighting","Log Number":"","Disposition":"Insufficient Data","Date of the Event":"11/10/2003 11:30 UTC","Source":"MUFON","Object Flight Path":"Unknown","Country":"United States","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/2673.html.txt","/var/www/straped/mufon/org/2673.html"],"Weather Factors":"Windy","Tags":"City","Region":"Pennsylvania","divs":["Sighting DetailsOn the night of November 10, 2003 at around 1130 p.m. my dog, puffers, startedto shimmy around in my apartment on the floor, whining and being very strange. Usually when she even makes a slight movement she has to go to the bathroom. This is the first time in a long time that she actually did this sort ofbehavior this late at night. I work Mon-Fri starting a 7am so I am usually inbed by 930 or 1000 pm. I do not feed her water or food after six so that shedoes not need to go out past 900pm. Well I got out of bed and let her out. Shebolted to the backyard of my apartment. My backyard is a enbankment over astream that leads to the Neshannock Crick. On the other side of the enbankmentis a large area of woods. I let her go onto the grassy area and she startedsniffing around. Mind you, she never, never goes near the water ever. I lit upa cigarette and was looking at the sky for not even a minute. I drifted backdown to puffers and she was slowly walking toward the stream. I started toscream out of fear that she would fall in the water and at that moment I heard arustle in the woods associated with a very annoying humming noise. I started tolook into the woods and saw a white light about 10 feet from the tree tops. Ithought it was just a distant car light or business light so I quickly dismissedit as being anything unordinary and called for my dog. At that moment Puffersstarted to bark and yelp like someone was stepping on her tail. I got scaredthinking she stepped on something and hurt her paw. When I went to pick her up,she threw herself out of my arms and started bolting down the enbankment towardthe stream again. I started running after her and happened to see out of thecorner of my eye this same light I thought was nothing start rising out of thewoods. I stopped dead in my tracks with fear that I was about to experience aparanormal experience. I looked down at my feet and puffers was sitting verynice just staring at this light that had obviously gotten the best of both ofour attentions. As I looked at this tear-dropped shaped light I noticed that itwas almost like blinking but with a very slow motion. It was like a dirty whitecolor and as it kept rising until it was directly aligned with the treetops Inoticed"],"trends":["There have been no other sightings in Hickory Township","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.041251,+-80.287879(2673)&iwloc=A&hl=en\"> mufon case (2673) map </A>","Object Features":"Insignia","Viewing Distance":"101-500 Feet","Case Number":"2673","Latitude":"41.041251","Sighting Duration":"00:05:00","Longitude":"-80.287879","Date Submitted":"11/10/2003 11:30 UTC","City":"Hickory Township"}