{"City":"Belle","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.293149,+-91.715652(26738)&iwloc=A&hl=en\"> mufon case (26738) map </A>","Date of the Event":"06/30/1974 12:00 UTC","files":["/var/www/straped/mufon/html2text/26738.html.txt","/var/www/straped/mufon/org/26738.html"],"Case Number":"26738","Longitude":"-91.715652","trends":["There has been one other sighting in Belle","There were no other sightings in Belle on or around June 30th 1974"],"Log Number":"US-11252010-0006","Disposition":"Unknown","Object Flight Path":"Hovering then path","Region":"Missouri","Source":"MUFON","Weather Factors":"None","Object Shape":"Triangle","Country":"United States","Tags":"City","Object Features":"Window(s)","divs":["Sighting DetailsI was 16 years old and was driving around the town of Belle, Missouri, where I have lived all my life, on my way to work at a local cafe and I was coming down 8th Street toward Hwy. 28, and when I got to the stop sign at Hwy 28, it caught my eyes, across the highway off to the right a little bit, it was so big, I couldn't miss it! It was hovering, with no noise what so ever, just staying in one spot, a black triangular ship with lights on the three corners, which were rounded just a little and also windows going all the way around it, as far as I could see. It was unbeleiveably huge! I drove across highway 28 and stopped for a moment, then it hovered back into the woods off to the right a bit, but I could still see it there. It really scared & astonished me, I had to calm myself down a little,(I was afraid to get out of my car and start yelling and pointing), so then I drove into a parking lot to the left of the street and headed back down Highway 28 to get to work. I told a few people at work, but no one really believed me-I was still really shock up. This was before I had ever drank alcohol, smoked marijuana or anythng, so I know what I saw was there. After that I was always prone to a lot of nervous anxiety, insomnia, and depression. Still to this day I have to take xanax to help avoid panic attacks, which have landed me in the hospital a few times, thinking I was having a heart atack."],"Date Submitted":"11/25/2010 10:07 UTC","Sighting Duration":"Undisclosed","Summary":"Afternoon-I saw a triangluar black ship with lights on the 3 corners and a row of windows around the ship","Latitude":"38.293149"}