{"Longitude":"-117.223884","Log Number":"US-11262010-0008","trends":["There have been 3 other sightings in Fallbrook","There were no other sightings in Fallbrook on or around November 26th 2010"],"Tags":"City","Weather Factors":"None","Disposition":"IFO","City":"Fallbrook","Viewing Distance":"Over One Mile","Country":"United States","divs":["sighting detailsmy girlfriend [first name of girlfriend removed cms\\dr] had just pulled into the driveway and i was outside smoking a cigarette. i walked up to the car and around to the drivers side, facing west. she got out and we said a few words. her friend [friends first name removed cms\\dr] got out of the car and asked me for a lighter. i handed it across the roof of the car to her. i looked past her and noticed a very bright and fast moving white light had seemingly appeared from nowhere. at first i thought it was a shooting star. it arced across the sky, slightly downward in the same manner that one would. right as i saw it i said \"look, a shooting star!\" just at that moment it suddenly dipped downward, then turned up like the letter \"j\". and then shot straight up into the sky and vanished. [first name of girlfriend removed cms\\dr] looked in time only to see it disappear, while [friends first name removed cms\\dr] missed the whole thing. it was unlike anything i have ever seen. i cannot express how amazing it was to see. five minutes later there were several types of aircraft in various positions in my field of vision. another five minutes later, there were no aircraft at all, which is strange since we live a few miles from camp pendleton marine base."],"Latitude":"33.291047","Object Features":"Unknown","Source":"MUFON","Object Shape":"Fireball, Flash, Star-like","Sighting Duration":"Undisclosed","Date Submitted":"11/26/2010 10:22 UTC","Date of the Event":"11/26/2010 06:24 UTC","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.291047,+-117.223884(26748)&iwloc=A&hl=en\"> mufon case (26748) map </A>","Region":"California","Case Number":"26748","Summary":"light arced across sky, dipped downward, then ascended abruptly","files":["/var/www/straped/mufon/html2text/26748.html.txt","/var/www/straped/mufon/org/26748.html"]}