{"Object Features":"Unknown","Weather Factors":"None","Source":"MUFON","Disposition":"Unknown","divs":["Sighting DetailsI was on a red-eye flight from Long Beach to Washington, D.C. It was a pretty empty flight, maybe 20 or 30 passengers. I was seated in a window seat in a row with no other passengers. As we took off, I watched the night-time traffic below. I noticed that along a hillside road that was lit with streetlamps, there was what I thought initially to be an automobile speeding down the road going way too fast. It was following the roadway, so I thought it was on the road. Because we were off the ground and far enough away, I looked over to the main roadway to compare the speed of other traffic with the hillside object's. The main traffic was creeping along while this golden light was zipping. At the moment I realized how extraordinarily fast it was going, it zigged off the roadway over the hillside and I realized it was actually flying. It zagged in the opposite direction, then zigged a third time as it skimmed over the water and I could see it's light reflected greenish underneath it on the water. I continued to watch and then it submerged into the water, the light turned from gold to green as it did so. It descended deeper and I watched as it disappeared and the water went dark. I continued to watch for a minute or so to see if it came back up. Nothing happened. I looked around to see if anyone else had been looking out the window. There was nobody behind me. There was a man across the aisle in a row all to himself, like I was, and he was reading a book. I looked to the front of the plane to see the stewardess standing in the aisle straightening magazines or something, but clearly she had not been looking out the window to see anything I had seen. I didn't say anything to anyone because there was really nobody to say anything to. I'd never seen anything like it and wondered what it could have been. It was confusing and made me think about it, realizing that I couldn't find any explanation for it. I knew it wasn't a crash, because the water wasn't disturbed as it submerged. It just seemed to sink in and it's speed didn't really change. I never mentioned it to anybody and forgot about for about six months when one day I turned on the History Channel and a man was on the screen describing objects people had seen flying into and out of the water. They were called USOs. I had turned the tv on about halfway through the program and watched it until the end. I finally knew what I had seen - a USO. I went to the library and checked out eery book I could find on USOs and even UFOs. I read and watched any other program available on the History Channel and other channels about these incidents. Now I know it isn't so uncommon."],"Sighting Duration":"Undisclosed","Summary":"Watched a golden ball of light zig zag down a hillside and descend into the water.","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around May 31st 2004"],"Country":"United States","Latitude":"33.810647","Region":"California","Case Number":"26744","map":"<A HREF = \"http://maps.google.com/maps?q=33.810647,+-118.155236(26744)&iwloc=A&hl=en\"> mufon case (26744) map </A>","Object Shape":"Circle, Fireball","files":["/var/www/straped/mufon/html2text/26744.html.txt","/var/www/straped/mufon/org/26744.html"],"Longitude":"-118.155236","Date Submitted":"11/26/2010 01:19 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Tags":"City","Log Number":"US-11262010-0004","Date of the Event":"05/31/2004 10:45 UTC","City":"Long Beach"}