{"Date Submitted":"11/27/2010 12:42 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.742961,+-121.420643(26749)&iwloc=A&hl=en\"> mufon case (26749) map </A>","Date of the Event":"11/25/2010 09:15 UTC","Region":"California","Weather Factors":"Unknown","Disposition":"Insufficient Data","Longitude":"-121.420643","Source":"MUFON","Viewing Distance":"101-500 Feet","Country":"United States","files":["/var/www/straped/mufon/html2text/26749.html.txt","/var/www/straped/mufon/org/26749.html"],"City":"Tracy","Latitude":"37.742961","Summary":"Boomerang shaped UFO flew over my head twice on November 25, 2010.","Case Number":"26749","Tags":"City","trends":["There have been 8 other sightings in Tracy","There were no other sightings in Tracy on or around November 25th 2010","This sighting has never been favorited.",""],"Log Number":"US-11272010-0001","Object Features":"Wings, Other","Object Shape":"Boomerang","divs":["Sighting DetailsAt 9:15 p.m I was sitting on my mother-in-laws front porch looking at the stars, when an UFO flew directly overhead. The aircraft was unlike anything I have seen before or know to exist as a contemporary aircraft type. The object was shaped like a large boomerang. The aircraft had no lights, but it did have approximately four reddish colored, circular-shaped parts on the underside of each \"wing\" with one in the\" front\" of the craft. The circle shapes looked like headlights which were not illuminated and each circle was covered with with a surface that looked like dark tinted glass. There was a small \"cross\" shape in the middle of each \"light\" that looked like a \"plus- sign\". The object flew with a gliding motion in a straight line from the South-East toward the North-West. As the object initially approached my vantage-point, I could see it from directly \"head-on\". It appeared to be very flat, which gave me the impression that the aircraft could not have been a \"manned\" one. The aircraft seemed to be flying unusually low to the ground, no more than a couple hundred feet above my head. (It was low enough for me to discern the details described above.) The speed and altitude of the craft appeared to remain constant. There was absolutely no sound emitted from the craft, whatsoever. I watched the UFO until it was beyond the horizon-line, behind the house. I excitedly ran to get my husband, who came outside to watch the sky with me. After five minutes passed with nothing out of the ordinary happening, he decided to go back inside. No more than three minutes later the craft appeared overhead again. This time the craft was flying back from the North-West toward the same direction that it had initially appeared. I watched the craft until it crossed beyond the opposite horizon and was no longer visible."],"Object Flight Path":"Straight-line path"}