{"Latitude":"39.52099","Summary":"(sg) was photographing a star, I thought. Then four white lights came over the horizon hovered, no sound. Then changed direction and left one at a time.","Date of the Event":"11/21/2010 05:53 UTC","Longitude":"-104.759003","Disposition":"IFO","Tags":"City","Case Number":"26740","files":["/var/www/straped/mufon/html2text/26740.html.txt","/var/www/straped/mufon/more/26740_submitter_file1__ufo3thentherewerefourlargeonesmall.JPG","/var/www/straped/mufon/more/26740_submitter_file2__ufo6Theyareleaving.JPG","/var/www/straped/mufon/org/26740.html"],"Log Number":"US-11252010-0008","Source":"MUFON","Object Features":"None","Object Shape":"Star-like, Other, Unknown","Viewing Distance":"Over One Mile","Date Submitted":"11/25/2010 10:57 UTC","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.52099,+-104.759003(26740)&iwloc=A&hl=en\"> mufon case (26740) map </A>","divs":["Sighting DetailsIt was still light out but the sun had just begun to set and I was driving home. I saw a bright light in the sky above the trees in my neighborhood. I pulled over and started taking close up pictures thinking it was Mars. When I zoomed out I saw three bright lights in formation and hovering. Then another white light rose from the horizon with two smaller lights. All orb shaped and bright. They stayed in the same place for several minutes and then slowly left one at a time following each other. As they changed direction I could see the front had two bright white lights and the back two red lights. In continuous shot mode I finally got a close up of the last craft as it was moving away. I then thought \"Got ya\". Don't know what it is but I got a picture of it and two short videos of them hovering. It looks like a small Star Ship Enterprise."],"Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Parker","There were no other sightings in Parker on or around November 21st 2010","This sighting has never been favorited.",""],"Weather Factors":"None","Country":"United States","City":"Parker","Region":"Colorado"}