{"Object Features":"Undisclosed","City":"Lexington","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.046914,+-84.495616(26746)&iwloc=A&hl=en\"> mufon case (26746) map </A>","Log Number":"US-11262010-0006","Tags":"City","Longitude":"-84.495616","Sighting Duration":"00:01:00","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around November 13th 0001"],"divs":["Sighting DetailsJust as the sun was going down on the the 15th of November at around 5 or quarter past 5, I was driving up Highlands Road and I saw a pudding shape object appear above my windshield just as if it had been above the car. It shot north following the road. As it was above the car when I first saw it, it looked more like a disk, but as it shot forward it took on more of a pudding shape not unlike a dome but it was not a disk. It shot forward from around several hundred yards ahead of the car to out of sight in a couple of seconds. Just as it disappeared I saw several yellow balls or orbs streaking forward in the same direction. I stopped my car to get my camera out of the trunk but by the time I did that there was nothing. I have been watching the news and reading the papers ever since and I have seen nothing about it anywhere. I found out about MUFON so I am reporting it. Surely other people saw this? You could not miss it. It flew over at least a dozen cars and probably many more that I could not see. Maybe hundreds of cars. It must have been seen by many dozens of people or even more. Maybe hundreds. It seemed to be around the size of a car. It is hard to tell but it was not very big. It was around 12 feet wide. It could maybe have been 20 feet. It seemed to be around 100 feet off the ground. Maybe 200, but as it shot off it elevated in height of miles which is why many people must have seen it. I hope that by making this report maybe some other people will come forward with photos. It is hard for me to believe that I am the only person who saw this UFO. I know that other people must have seen it. I can't believe that I am the only person who witnessed that object. It was not a plane or a helicopter. It was not anything I have ever seen. It shot off at such a speed, it could not have been anything man made. It went from here to gone in seconds. I am not into UFO's or anything and I would never have believed in them, but after seeing this object, I don't know what to think. I really don't know. I ave never seen anything like it. I find it hard to believe we can build anything that can move that fast."],"Source":"MUFON","Latitude":"38.046914","Country":"United States","Case Number":"26746","Summary":"Pudding (dome) shape object at great speed.","Date of the Event":"11/15/0001 05:15 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/26746.html.txt","/var/www/straped/mufon/org/26746.html"],"Disposition":"Unknown","Object Shape":"Other","Region":"Kentucky","Viewing Distance":"Unknown","Date Submitted":"11/26/2010 09:40 UTC"}