{"files":["/var/www/straped/mufon/html2text/26747.html.txt","/var/www/straped/mufon/more/26747_submitter_file1__DSCN1328.jpg","/var/www/straped/mufon/org/26747.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.955622,+-74.985712(26747)&iwloc=A&hl=en\"> mufon case (26747) map </A>","Tags":"City","Region":"New Jersey","Disposition":"Unknown","divs":["sighting detailsi was on vaction with my mom. we went to philidelphia to check out the sites.we actually stayed in a room in new jersey. we had just gotten back from the philidelphia zoo around 5pm. i started juggling tennis balls out behind our room. i happened to look up noticed this bright red \"plane\". except i have never seen a plane like this before.it was a triangle, silent, and moving very slow.i ran into the hotel yelling for my mom to look at this plane and to get my binoculars for a better look. i thought they were in a bag besides the fridge, but i left them in the car. so i ran right out to get them out of the car and when i got outside i tried to find the plane. but it was gone. i couldnt believe it. i tried to locate it on the same tradgectory that it was going.it was going so slow there is no way it could have flown by in that amount of time.i kept looking to see if it would come out of a cloud,but nothing. i continued juggling until dark with one eye always to the sky. you could see other planes flying by, they would take a while to get across the horizon. and any low flying plane is easily heard. i am still baffelled to this day as to what i saw out there. here are the important topics: 1.date 6\\20\\05 2.location:roadway inn 2840 sr 73n,maple shade nj (39'56.522n 74'58.568w) room 138 3.time: approx 5:15pm est 4.weather: sunny, nice out white fluffy clouds scattered about. 5.color:brilliant fire engine red 6.shape: triangle... \"pizza slice\" 7.flight characteristics:low and slow, silent vanished without a trace. flying se at last glance 8. definetly something machanical i thought it was a plane at first site."],"Date Submitted":"11/26/2010 09:57 UTC","trends":["There has been one other sighting in Maple Shade","There were no other sightings in Maple Shade on or around June 20th 2005","This sighting has never been favorited.",""],"Summary":"was out juggling, looked up saw red triangular \" plane\". ran inside hotel for binocuars,they were in car. by the time i ran out it was gone","Sighting Duration":"Undisclosed","Case Number":"26747","Date of the Event":"06/20/2005 05:15 UTC","Weather Factors":"None","City":"Maple Shade","Source":"MUFON","Longitude":"-74.985712","Log Number":"US-11262010-0007","Latitude":"39.955622","Country":"United States","Object Features":"Unknown","Object Shape":"Triangle"}