{"Source":"MUFON","Date Submitted":"11/26/2010 01:19 UTC","Case Number":"26741","Object Shape":"Unknown","divs":["Sighting DetailsI am a truck driver. The one route I drive daily is near a heavly traveled fly zone. It is not uncommon to see 5 to 7 jet contrails at one time. I was looking at 5 different jet contrails and noticed what appeared to be an airplane. The sun reflected off of this object and caught my attention. The object was flying in an easterly direction at about the same speed a prop driven airplane would be going. I could not tell what shape the object was. I was about to give up trying to see what it was when the object changed it's flight by going 90 degrees north. The change in direction was in a second and in an other second it diappeared from my sight. This object did not leave any contrails nor was I able to hear if it made any noise due to the noise of my truck engine. Most airplane contrails go from east to west in this area, some come up from the south. The time of this sighting was about 4pm on November 8, 2010. I told my wife and a few friends about the sighting but they did not seem excited as I did about seeing it."],"Weather Factors":"None","Country":"United States","Longitude":"-78.003861","map":"<A HREF = \"http://maps.google.com/maps?q=40.488806,+-78.003861(26741)&iwloc=A&hl=en\"> mufon case (26741) map </A>","Sighting Duration":"00:01:00","Log Number":"US-11262010-0001","Latitude":"40.488806","Viewing Distance":"Unknown","Region":"Pennsylvania","Tags":"City","Object Features":"Unknown","trends":["There have been 2 other sightings in Huntingdon","There were no other sightings in Huntingdon on or around November 8th 2010"],"City":"Huntingdon","files":["/var/www/straped/mufon/html2text/26741.html.txt","/var/www/straped/mufon/org/26741.html"],"Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Summary":"Unknown reflective object changed it's flight 90 degrees and disappeared.","Date of the Event":"11/08/2010 04:10 UTC"}