{"Object Features":"None","files":["/var/www/straped/mufon/html2text/26742.html.txt","/var/www/straped/mufon/org/26742.html"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.447834","Summary":"Circular bright blue light looping in the air","Case Number":"26742","map":"<A HREF = \"http://maps.google.com/maps?q=28.222449,+-82.447834(26742)&iwloc=A&hl=en\"> mufon case (26742) map </A>","Region":"Florida","Tags":"City","Date of the Event":"11/25/2010 10:20 UTC","Source":"MUFON","City":"Land O' Lakes","divs":["sighting detailsmy bf and i were outside with the dogs talking. suddenly he said \"what the hell is that?\" and pointed toward the north\\northeast. i stood up and looked in the direction he was pointing and saw a bright blue circular light moving in looping movenments in the air. it would hover for a second or two then descend toward the ground. other times it would move thru the air with a looping motion. its movements never seemed to be in a straight path, it constantly looped or made curvy motions thru the air or it would rise or descend\\drop out of viewing range as if it were lowering all the way to the ground. then about ten, fifteen, twenty seconds later it would rise and do all the movements again. sometimes when it hovered it would turn bright white but only for a second or two then it returned to the bright blue color. it did seem to travel at a very fast pace. my bf seemed to be more awestruck\\confused by the speed and i was more awestruck\\confused by the looping movements and suddeny descending to the ground. there are houses across the street from our backyard so the light disappeared below the roofs of these homes and we stood on patio chairs for much of the sighting and we stood on the chais for much of the sighting. most of the movements were between 250 and 500 feet. sometimes when it rose in the air it got as high as 750 feet (i guess). i don't know how exactly how low it got because of the roofs of the houses in our way. i did film three video clips but i don't know if my digital camera is good enough to pick up the lights in nighttime darkness. (or i don't know how to \"program\" to accomplish it.) and i also took some pics with no flash and did see that i did capture the light, altho' i have to zoom to get a really good look. [which i'm uploading to my comp after i file this report.] i've seen a lot of strange lights, fireballs, etc. in this area since i moved into this house three years ago. this one was by far the best and most amazing sighting so far. and i have a witness"],"Weather Factors":"Unknown","Country":"United States","Latitude":"28.222449","Log Number":"US-11262010-0002","Date Submitted":"11/26/2010 06:59 UTC","trends":["There have been 8 other sightings in Land O' Lakes","There were no other sightings in Land O' Lakes on or around November 25th 2010"],"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Object Shape":"Circle, Sphere","Object Flight Path":"Path with directional change"}