{"Log Number":"FI-11272010-0004","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Tags":"City","City":"Nykarleby","Object Features":"Undisclosed","Date of the Event":"11/27/2010 02:10 UTC","Sighting Duration":"Undisclosed","Longitude":"22.530384","Weather Factors":"Unknown","Case Number":"26753","Region":"Ostrobothnia","Viewing Distance":"Unknown","Summary":"An Unidentified Object slowly flew westwards outside my home.","files":["/var/www/straped/mufon/html2text/26753.html.txt","/var/www/straped/mufon/more/26753_submitter_file1__IMG_8672.JPG","/var/www/straped/mufon/more/26753_submitter_file2__IMG_8673.JPG","/var/www/straped/mufon/more/26753_submitter_file3__IMG_8686.JPG","/var/www/straped/mufon/org/26753.html"],"Source":"MUFON","trends":["There have been no other sightings in Nykarleby","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=63.521787,+22.530384(26753)&iwloc=A&hl=en\"> mufon case (26753) map </A>","Latitude":"63.521787","divs":["Sighting DetailsI was standing out on our porch enjoying a cig, when I noticed what I thought was a lonely cloud in the sky hovering to the south west. I went in to fetch my camera, since it looked interesting enough to be photographed and I told my girlfriend that I was going to take a few shots of a really cute little cloud I was witnessing. The sky was completely clear in the area of the cloud, and I thought it cool; I was in a hurry to get my camera, so the cloud would not disperse. When I came back out, the cloud had not at all dispersed, but remained intact and in the same shape as when I left it. I started taking several photographs of the object as it \"sailed\" slowly to the west. The sky was clear, only displaying some light cloud formations far to the south, but nothing in the area of the object of my interest. I took photographs and studied the object as it continued its slow passage over the sky in the western direction. A light, cold, wind came in from the north. I stopped photographing when the object disappeared from my view behind the tree tops. During all this time it did not change shape, like a regular cloud, but indeed seemed solid. There was no sound of airplanes in the vicinity. the object seemed to be flying in the air about one or two kilometres from me, and when it disappeared behind the trees it was far away, leading me to believe that it was no small balloon or anything in that category. I know of no military excercises or hellicopter flights being arranged in my area at the time of the sighting either. The object seemed silent and I heard no sound of it. The sun was up to the south and seemed to shed its northern European winter light on the object. I took a whole series of photos of the object as it flew over the sky; with different zoom levels and I included parts of the terrain and surroundings in some and the trees. There is also a telephone line showing in the photos which also shows the slow western travel of the object."],"Date Submitted":"11/27/2010 08:47 UTC","Object Shape":"Oval","Country":"Finland"}