{"Region":"Massachusetts","Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/26759.html.txt","/var/www/straped/mufon/org/26759.html"],"Log Number":"US-11272010-0011","Viewing Distance":"Unknown","Date Submitted":"11/27/2010 03:00 UTC","Case Number":"26759","Date of the Event":"10/26/2010 09:00 UTC","Sighting Duration":"Undisclosed","City":"North Attleboro","Tags":"City","Object Features":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.972732,+-71.354314(26759)&iwloc=A&hl=en\"> mufon case (26759) map </A>","Longitude":"-71.354314","Summary":"Several red/orange lights (8 or more) appeared then faded/disappeared","Country":"United States","Weather Factors":"None","divs":["sighting detailswe have seen these lights approx. a dozen times or more now, since july 2010, all coloring the same, size and shape the same and all coming from approx. the same direction. we have seen any where from 3 to 4 up to 16 at highest count-because i don't have professional photo equipment nor do we ever know when they will appear it is difficult to capture them-i did however get video of the group on the 26th of october this year (2010). this was taken with a handheld small digital camera and is best viewed full screen-they are located lower left of screen-as i said this was not the best photo equipment and when looking at the view screen could not be seen so i was guessing and hoping i had it pointed in the correct direction. earlier in the summer we had a much better view of these craft as they appeared at dusk-as the lights went out you could still see a black round object in the sky-one of which slowly came across the lake in our direction and over the tree line. with each sighting there have been several witnesses in our area and there was no sound coming from the lights\\objects. we actually thought of night operations from the military or any other thing we could come up with but these \"lights\" were often too close to one another and again there was no sound. i noted 2 other reports from our general area recently posted so felt i should also report as i believe in both cases we were seeing the same lights as their descriptions were quite similar as were the dates of both events."],"Object Shape":"Sphere","Source":"MUFON","Latitude":"41.972732","trends":["There has been one other sighting in North Attleboro","There were no other sightings in North Attleboro on or around October 26th 2010","This sighting has never been favorited.",""]}