{"Latitude":"38.900693","City":"Lamia","Object Shape":"Blimp, Boomerang, Bullet, Missile, Cigar, Cone, Chevron, Circle, Cross, Cylinder, Diamond, Egg, Fireball, Flash, Oval, Saturn-like, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle, Other, Unknown","Tags":"City","Date of the Event":"11/27/2010 06:05 UTC","Longitude":"22.433777","Country":"Greece","divs":["sighting detailsi was with my son called [nick name removed\\cms\\tg] and we were trying to find our dog called [dog's name removed\\cms\\tg]. suddenly, i felt an extremely big orgasm and i thought \"omg,that can't be normal! i'm gonna die !\" and then i saw that john was hurt too! then, we looked up to the sky and we saw a big light coming at us ! i first thought that it was the apocalypse! but then a fell down and i couldn't move my body at all! then john fell too ! i tried to speak but i wasn't able even to speak ! then, 3 human figures appeared, they took us in this huge light which seems to have landed. we can't remember much... but we suddenly woke up in a white room and we couldn't move our body but we could finally speak. then we saw these figures again... but they weren't human... they some kind of aliens like the well known \"greys\" i asked: \"wtf is going on? were the #$%& are we? who the #$%& are you? what the #$%& do you want from us ?\", they didn't open their mouths, but we could hear them in our minds !, they said that they are ones who are watching us all this million of years in the skies, the ones that took part in the creation of the man kind, the ones that are called the elochim, in the bible, we are the son's of the god, some hybrids called the nephelim in the bible live under your feet and they want humans to suffer, because they are at side of the fallen, we abducted you to bring this message to everyone, the truth will be soon revealed, but for we to know were you are we'll #$%& the crap out of you ! and then the freaky part begins, they took a huge organ that looked like a penis they put it in our tiny &*%#@ with all of their strength ! we were bleeding but they didn't care... it hurt to much ! we can't remember any more... but we woke up at the street with all lot of blood on our clothes... my wife said that we were missing for 5 days ! ! !"],"Object Features":"Undisclosed","Date Submitted":"11/27/2010 09:20 UTC","trends":["There has been one other sighting in Lamia","There were no other sightings in Lamia on or around November 27th 2010","This sighting has never been favorited.",""],"Region":"Central Greece","Summary":"Unknown Flying Object seen and contact with extra terrestrials !","Sighting Duration":"04:03:18","Case Number":"26754","Log Number":"GR-11272010-0005","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/26754.html.txt","/var/www/straped/mufon/more/26754_submitter_file3__arescinema1knk9.jpg","/var/www/straped/mufon/org/26754.html"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.900693,+22.433777(26754)&iwloc=A&hl=en\"> mufon case (26754) map </A>"}