{"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/26756.html.txt","/var/www/straped/mufon/org/26756.html"],"Sighting Duration":"00:05:00","Region":"Texas","divs":["sighting detailsas we turned east from cedar bayou rd onto massey tomkins rd in baytown at 18:05, we noticed 8 or 9 lights flying in a loose formation from the southest to the northwest at between 500 ft and 1000 ft altitude. the lights were dimmer than halogen lights. they almost reminded us of japanese lanterns, but the lights were not growing in intensity or decreasing in intensity as you would expect candle lights. the wind at that time was blowing out of the south\\southwest, so i assumed that the lighted objects were self-powered. however, there was no sound coming from them. if they were small planes or ultralight craft, we should've heard some type of noise. i turned into a driveway on raccoon road to get out of the car and get a better look. at that point, the objects headed in a more northerly direction. there were two more that came from the same direction as the others that appeared to be speeding up to catch up with the original group. at that height, they appeared to be going approximately 50 to 75 mph. we watched the lights head northerly until they were out of eye sight. is there any way to verify if there was an ultralight flight club that would've been out for the day?"],"Log Number":"US-11272010-0008","Tags":"City","Object Features":"Unknown","City":"Baytown","Case Number":"26756","Source":"MUFON","trends":["There have been 7 other sightings in Baytown","There were no other sightings in Baytown on or around November 25th 2010"],"Date of the Event":"11/25/2010 06:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.735505,+-94.977427(26756)&iwloc=A&hl=en\"> mufon case (26756) map </A>","Object Shape":"Other","Date Submitted":"11/27/2010 12:43 UTC","Summary":"8 or 9 lighted objects flying southeast to northwest, less than 1000 ft altitude","Longitude":"-94.977427","Object Flight Path":"Path with directional change","Latitude":"29.735505"}