{"map":"<A HREF = \"http://maps.google.com/maps?q=29.768013,+-95.36091(26765)&iwloc=A&hl=en\"> mufon case (26765) map </A>","Region":"Texas","Sighting Duration":"Undisclosed","Case Number":"26765","trends":["There have been 173 other sightings in Houston","There were 2 other sightings in Houston on or around November 27th 2010","This sighting has never been favorited.",""],"Country":"United States","divs":["sighting detailsi first sited aprox 20 silver disc shaped objects flying in formation from the northeast headed towards the southwest at aprox 25 - 30k feet. at first glance i thought they were geese however after watching them for a few minutes i realized they were not birds but silver discs and they were rotating and reflecting bright light as they turned. i ran in the house and got my video camera that i had rigged up after seeing these things earlier in the month i wanted to see if i could get a close up view of them if i ever saw them again. i filmed these objects back on november 6th but the video was kind of shakey so this time i was prepared with a tripod and a 500x zoom lens. when i returned outside with my camera the first group was gone and i saw another large group flying over but they disapeared by the time i got my camera setup to start filming. i gazed into the sky for several minutes when i saw 2 single discs flying over and i filmed them as well as several others over the next 45 minutes. some were silver rotating discs that flashed bright lite as they turned others were a brite fire orange\\red color. i have several minutes of video if anyone is interested they can contact me. these objects can be seen almost on any day when the sky is very clear with no haze watch for what may seem to be a star like object high in the sky over houston texas. the video i am uploading shows one disc and another zoom past it from the bottom of the screen to the top left corner. the video was shot with a sony trv-730 hi8 video and a 500x zoom lens. i have several more minutes video available for the asking."],"Object Features":"Undisclosed","Latitude":"29.768013","Disposition":"IFO","Object Shape":"Circle, Disc, Sphere","Log Number":"US-11272010-0017","Longitude":"-95.36091","Date of the Event":"11/27/2010 01:30 UTC","Tags":"City","Weather Factors":"Unknown","Summary":"Several ufo's seen moving from the northeast to the southwest over Houston","files":["/var/www/straped/mufon/html2text/26765.html.txt","/var/www/straped/mufon/org/26765.html"],"City":"Houston","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"11/27/2010 10:15 UTC","Source":"MUFON"}