{"divs":["Sighting DetailsSince November 6th every clear night we have been seeing this object in the southeastern part of the sky in Spring, Texas. It has moved farther away since the first night we observed it. It now appears smaller so I have no idea how far away it is. It stays in the exact same location for at least an hour or more with red, green and amber lights that pulse and it goes from a bright white to a dim glow at times. When it does move it is at an extremely slow rate and then it remains stationary for another long period of time. We never see it before 2:00 a.m. and it is always gone by 5:00a.m. CST. I would really like to know what this object is. I'm thinking about buying a good telescope just so I can determine what it is. I have been viewing it through binoculars and have been unable to get a photograph of it. 1. I was in my back yard taking the dog outside. 2. I thought it was an airplane. However, it remained stationary and did not move for hours. 3. I thought is was an airplane. 4. It remained stationary and had these pulsing red, green,and amber lights. It also would dim from a bright white to a dull glow when airplanes would go above or below it. 5. On the first night it was a euphoric feeling that I had seen something so unusual. However, now that it keeps coming back night after night I am frustrated that I cannot determine what it is and why it is here. 6. It usually goes behind trees or objects and fades away."],"Region":"Texas","Object Flight Path":"Stationary,Hovering then path","Tags":"City","Object Shape":"Disc","Summary":"Since November 6th my family has been seing this in the sky on clear nights.","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26760.html.txt","/var/www/straped/mufon/org/26760.html"],"Case Number":"26760","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-11272010-0012","Latitude":"29.764693","City":"Houston","map":"<A HREF = \"http://maps.google.com/maps?q=29.764693,+-95.36614(26760)&iwloc=A&hl=en\"> mufon case (26760) map </A>","Longitude":"-95.36614","Viewing Distance":"Unknown","Disposition":"IFO","trends":["There have been 173 other sightings in Houston","There were 2 other sightings in Houston on or around November 27th 2010"],"Object Features":"Unknown","Date of the Event":"11/27/2010 02:15 UTC","Date Submitted":"11/27/2010 04:56 UTC"}