{"Summary":"Sighting over Conyers, GA around 12am on November 28 2010","Log Number":"US-11282010-0003","Disposition":"Unknown","Date Submitted":"11/28/2010 02:28 UTC","files":["/var/www/straped/mufon/html2text/26769.html.txt","/var/www/straped/mufon/org/26769.html"],"Country":"United States","Date of the Event":"11/28/2010 12:00 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsDriving along Salem Road from Interstate 20 towards Brown Bridge Road. Object caught my eye because it was too big to be a plane, the shape was different and the lighting was solid. The shape was blimp like, but the shape was almost like a domed serving platter. the object first appeared to be hovering and then it was moving off towards the West (I think). I was trying to drive and keep the object in my view. I did stop and try to get a better look, but then the trees blocked my sight. It was also moving away from me and getting smaller. As I lost site, I got back on Salem Road and turned onto Brown Bridge Road heading towards Mcdonough. I caught site of the object again but it was moving away and the trees were blocking my view. I tried to keep up with it and eventually lost it completely. I remember feeling like I could not be the only one seeing this. I thought about it just being a blimp, but the time and the look did not make me believe it was anything short of abnormal. After arriving home, I searched the skies without any luck. I immediately searched the internet to see if anyone had reported seeing it. I know that I saw something other than an ordinary aircraft. I regret not having a camera available to get a picture."],"trends":["There have been 5 other sightings in Conyers","There were no other sightings in Conyers on or around November 28th 2010"],"Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Region":"Georgia","Object Shape":"Blimp, Egg, Oval, Sphere","Latitude":"33.6703","City":"Conyers","Longitude":"-84.01585","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.6703,+-84.01585(26769)&iwloc=A&hl=en\"> mufon case (26769) map </A>","Weather Factors":"None","Object Features":"None","Case Number":"26769","Tags":"City"}