{"Country":"United States","Latitude":"40.339138","map":"<A HREF = \"http://maps.google.com/maps?q=40.339138,+-75.923175(26768)&iwloc=A&hl=en\"> mufon case (26768) map </A>","Disposition":"Unknown","Date Submitted":"11/28/2010 02:16 UTC","Log Number":"US-11282010-0002","divs":["Sighting DetailsI was riding home from Maryland with my parents. I was a passenger in the front of a VW van. We were entering the outskirts of Reading Pa. As I looked at the sky two (what looked to be fixed) star like lights were speeding toward the highway and spreading apart suggesting they were on either side of a huge dark craft at an estimated 2 to 3 thousand foot altitude descending toward the crowded highway at great speed. The white lights were star like and unremarkable save for speed at which they approached and the slight intensification(brightening) of the lights in combination with the spreading of the 2 points of light (again) suggesting to the eye that these lights were fixed upon a huge craft. The lights then stopped approaching (spreading) abruptly and the light on the left moved in a quick diagonal curve coming to rest above the right light and to what was the right light's right. The distance between the two lights remained generally constant during this diagnal motion. The speed of this motion was very fast and the light stopped on a dime at a speed beyond any conventional craft almost suggesting that the entire structure rotated and stopped very quickly (half a second) Buildings and trees periodically blocked my view very briefly as the van drove down the highway but from what I could discern, the lights remained in the sky simply looking like stars. Then the top light changed color to an dull orange with a flashing red light on top and flew off slowly looking like a completely conventional midsized aircraft at a perhaps 7 to 8 thousand feet while the lower light stayed stationary like all the other stars in the sky. We did not stop the van and my parents did not see this at all. These lights were unremarkable and looked like stars or distant aircraft but their movements were completely unconventional clearly creating g forces beyond human tolerences. I was overwhelmed. If these lights were fixed points at either end of a rigid structure the craft would be huge The highway was crowded and the area was populated and the night was clear but one would really have to be studying that area of the sky to notice these movements. Between the lights I could discern no outline of a craft only darkness which blended into a clear night sky obscured by a the ambient light of a large city. So I couldn't discern an abscence of stars between the two points. So I can't say for certain that there was a large craft but the movements of the lights were unconventional and unlike anything I've ever witnessed, even taking into account my lack of depth perception as I had no real reference for comparitive distance. I told my parents immediately but the unconventional maneuvers had ceased within brief seconds although the 2 points of light stayed in the sky for a long period as one flew away in a completely conventional presentation. The highway was crowded and we simply continued to drive home. Admittingly it was hard to get an absolute fix on these points of light when trees and buildings obscurred the sky as the van drove down the highway so I can't be sure of the last part of the story when the top object seemed to transform into a conventional craft presentation but the initial movements were seen clearly without obstruction and were remarkable."],"Weather Factors":"Unknown","Region":"Pennsylvania","Tags":"City","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around November 26th 2010"],"Date of the Event":"11/26/2010 06:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Source":"MUFON","City":"Reading","Summary":"two (what looked like fixed lights) descending at very fast speed then one light moved at impossible angle stopping on a dime","files":["/var/www/straped/mufon/html2text/26768.html.txt","/var/www/straped/mufon/org/26768.html"],"Case Number":"26768","Longitude":"-75.923175","Object Shape":"Star-like, Other","Object Features":"Unknown"}