{"Object Flight Path":"Undisclosed","Date Submitted":"11/28/2010 12:04 UTC","Source":"MUFON","Date of the Event":"11/27/2010 08:00 UTC","City":"Commerce","Country":"United States","Summary":"At any given time about ten objects in sky all around. Objects had multiple light arrays and colors strobing, flashing and pulsing.","files":["/var/www/straped/mufon/html2text/26772.html.txt","/var/www/straped/mufon/org/26772.html"],"Latitude":"33.254117","Viewing Distance":"Unknown","Longitude":"-95.890876","Weather Factors":"Unknown","Tags":"City","Disposition":"Insufficient Data","trends":["There has been one other sighting in Commerce","There were no other sightings in Commerce on or around November 27th 2010"],"Log Number":"US-11282010-0006","divs":["sighting details on the evening of nov. 27. my nephew and i exited my house to ride atv to check hog trap. we first noticed a bright low altitude light moving southwestarly. it was silent and seemed to be floating along like a fishing bobber in the water. object was relatively close but not discernable by the naked eye. i ran back in and grabed some binoculars. i could not believe what i was seeing. it had a disc shaped helm that was a row of lights. these lights were a bright whitish blue kind of color. they were pulsing from one end of arc to the other and also flashing in random sequences as well. i gave my nephew the binoculars and immediately started saying i dont believe this something is not right. its a disc its a disc. we were both a bit in dis-belief. the object was vanishing behind a northsouth fence\\tree line. we drove around and out into the open in front pasture. here most all of the sky is visible. we proceeded to watch the object until it stopped and appeared to hover in one spot far off above the southwest horizion. upon gazing around the sky we statred to notice several objects all over the sky. there were several that were flying low on the northwestern horizion headed southwest. at first they were bright yellowish lights and appeared quite large. they would begin to flash and display different colors of light. some times there were three to four of these in fairly close proximity. some times they moved toward each other and at other times they would almost touch and then move away from each other one heading northward and the other southward, both moving at the same rate. there were also objects moving south to north. these would fly almost directly over head and made almost no noise. they sounded kinda like a jet engine,but with a much quiter tone. these are what i call the flying bars. they had two whitishyellow lights on each end. in between were several different lights flashing, pulsing, and possibly changing color. it was hard to tell with our crappy binoculars but you could definately see the lights on these objects. there were also objects that were rectangular flying light panels. these objects had the most lights and the most different colors. there were reds, blues, greens, ambers, white, orange, purple, and possibly more. all flashing, pulsing, some steady, some blinking and some possibly moving. the objects moved at a fairly slow rate of speed but speed up and slow down as well as go up and down at times appearing to just \"float\" around. we also witnessed triangular shaped light arrays on some of these objects. these had bright whitishblue lights on three points with many other lights in between and inside the triangular shape. i was watching a statonary very bright orangish one low in the southwest sky. it pulsed brightly and vanished. then there were several smaller flashing flying objects. my report is a little scattered because i was really rattled by all this and there was so much happening. we watched the show in total disbelief for about an hour. upon a break for some turkeyday leftovers we both independently drew simple pictures\\diagrams of what we had witnessed. we drew three of the same objects and two that were quite similar. we saw triangular, discshaped, square\\rectangular objects.the only really good closeup view was of the initial craft with a definite arc of lights on its helm. at approximatly ten p.m. i went back out on atv and almost all activity had stopped. there were still a couple of strange objects around but nothing like what we had previously witnessed. its about eleven on sunday morning so my details are a bit lacking. we never could really see what the objects were or looked like except for the amazing mumber,color, and actions of the lights on these craft. i have seen some weired stuff in my day but this takes the cake. i live on the outside test loop for majors field in greenville, texas. the airforce has taken control of some stuff out there. i dont know if there is any connection but its worth noting. thank you for your time, and no for once i was not drunk on a saturday night. i feel today like im crazy because i cant hardly believe what we actually saw. could ten airplanes be seen at any given time at numereous places, variable velocity and trajectory in the sky for over an hour?"],"Object Shape":"Chevron, Disc, Flash, Square, Rectagular, Triangle, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.254117,+-95.890876(26772)&iwloc=A&hl=en\"> mufon case (26772) map </A>","Case Number":"26772","Object Features":"Undisclosed","Region":"Texas","Sighting Duration":"Undisclosed"}