{"Case Number":"26770","Date of the Event":"11/27/2010 11:45 UTC","Disposition":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Blimp, Oval, Saturn-like","Log Number":"US-11282010-0004","Weather Factors":"None","Latitude":"33.598811","Country":"United States","divs":["Sighting DetailsWe had been at a friends house outside Madison, GA, for dinner and stayed to watch a football game. After the game there were 9 of us standing outside talking and getting ready to leave. The time was approximately 11:45 PM. The owner of the house noticed an extremely bright light in the sky just above the treeline that, at first, seemed stationary at an approximate distance of one to two miles (best estimate without knowing the exact size of the object). The light began to move slowly, at times getting closer but moving on a northwesterly course. We observed the object for approximately 15 minutes before it disappeared behind the far treeline. It was clearly not an airplane or helicopter, but we thought it might be a blimp. However, there were no collision lights visible on the object, only bright whitish-blue lights covering what appeared to be the length of the object. The object seemed to glow. When viewing it through binoculars, the object appeared to have a dome-like structure on the top and a glowing ring encircling the bottom of the object. We could hear no sound coming from the object as it moved. The overwhelming reaction from everyone was that it was like nothing anyone of us had ever seen before. A couple of us kept saying that it had to be a blimp, simply because that was the only thing we knew of that would be moving at that speed and altitude. Several people thought we should call the police, but we decided not to for the sake of seeming like we were crazy. My wife, son and I had about a 65 min drive home. When we got home she was still so shaken that she did not want to go into the house alone or go outside when I took our dogs out. At 12:01 AM a friend in Monroe, GA, approximately 15 miles to the northwest of the location from which we observed the object, sent us a text message that she had just seen the same object pass overhead. Her description of the object was similar to our observation - an oval object with what appeared to be a ring around it moving slowly with bright lights covering it."],"Summary":"Bright light hovering above the trees.","Tags":"City","Longitude":"-83.464654","Region":"Georgia","City":"Madison","Source":"MUFON","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/26770.html.txt","/var/www/straped/mufon/org/26770.html"],"Date Submitted":"11/28/2010 02:30 UTC","trends":["There have been 2 other sightings in Madison","There were no other sightings in Madison on or around November 27th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.598811,+-83.464654(26770)&iwloc=A&hl=en\"> mufon case (26770) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering"}