{"map":"<A HREF = \"http://maps.google.com/maps?q=32.32777,+-106.758034(26773)&iwloc=A&hl=en\"> mufon case (26773) map </A>","Case Number":"26773","Latitude":"32.32777","Object Flight Path":"Stationary","Longitude":"-106.758034","Viewing Distance":"101-500 Feet","Region":"New Mexico","trends":["There have been 24 other sightings in Las Cruces","There were no other sightings in Las Cruces on or around July 3rd 2010","This sighting has never been favorited.",""],"divs":["sighting detailsmy husband and i were driving through southern new mexico, approximately 30 miles north of las cruces. i commented on the beauty of the clouds, as chemtrailing seemed to be absent or minimal that day, and took a photo using my digital camera. i did not see anything unusual in the sky at the time; however, when i uploaded the image to my computer i was very surprised to see something in the upper left hand portion of the picture which looked like a metal hinge of sorts with several squarish openings in it. my husband and i looked at it with wonder, first discussing if it could be a reflection from anything inside the car. we determined that it could not be that, and remarked at how the ufo image was embedded within the clouds -- clouds in front and behind. (the attached image of this ufo has not been altered in any way. you will see that it is in a \"photoshop\" file but i do not even have photoshop enabled on my computer. it is simply the way my pictures get stored.) later, i noticed small, light, circular objects lower in the picture. i don't know if these are related to the ufo or if they are the result of moisture or other factors. i have very limited photography knowledge. just a few days ago, i was viewing a link provided in kerry cassidy's blog on the project camelot portal [link moved to additional evidence section cms\\dr] when i saw frame #iss-007-e06886, \"unidentified\" object photographed outside iss during expedition 7, i recognized the similarity to the ufo in my picture. very strange . . . i have e-mailed ms. cassidy in this regard but have not yet heard back from her. i am sending this to mufon, as i think it is important to do so. thank you for all your efforts. best regards, [name removed cms\\dr]"],"Date Submitted":"11/28/2010 12:27 UTC","Object Shape":"Other","Date of the Event":"07/03/2010 12:00 UTC","Country":"United States","City":"Las Cruces","Summary":"I was taking a picture of the sky and did not see the UFO at all. I noticed it when I uploaded the image to the computer.","files":["/var/www/straped/mufon/html2text/26773.html.txt","/var/www/straped/mufon/more/26773_submitter_file1__0703101508.jpg","/var/www/straped/mufon/org/26773.html"],"Disposition":"Unknown","Object Features":"Other","Tags":"City","Log Number":"US-11282010-0007","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}