{"Object Features":"Dome, Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.970458,+-83.915069(26779)&iwloc=A&hl=en\"> mufon case (26779) map </A>","Summary":"I took some pic's of the moon and when i processed them these images were on the picture.","Latitude":"35.970458","Case Number":"26779","Source":"MUFON","Date of the Event":"11/20/2010 01:28 UTC","Longitude":"-83.915069","divs":["Sighting Details We were at home. Taking pictures of the moon outside our bathroom window. We noticed the object after we down loaded them onto our computer. I have no idea what it is, light refraction? A bug on the screen? I did find it interesting enough to want to send it to someone. Both my Wife and I were Very curious when I zoomed in on the shot on our computer and adjusted the exposure. We got 2 or 3 different shots. We were making fun of each other about \" UFO's \" and how we got a picture. The more we looked at it the more it looked like something we could not explain. We love to take pictures, never took one like this! Same as above. Witnessed by me and my wife. I did'nt photo shop the shots except to crop and stich the photos of the object I saw. Probably nothing. You can decide. The picture is all I saw. Nothing while we were taking pictures caught our eye....looks like a disc, with 4 lights, and some sort of vapor trail coming out of the bottom heading towards the ground."],"Country":"United States","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around November 20th 2010","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","City":"Knoxville","files":["/var/www/straped/mufon/html2text/26779.html.txt","/var/www/straped/mufon/more/26779_submitter_file1__2010-11-20001002-Copy.JPG","/var/www/straped/mufon/more/26779_submitter_file2__2010-11-20001001.JPG","/var/www/straped/mufon/more/26779_submitter_file3__2010-11-20001007.JPG","/var/www/straped/mufon/org/26779.html"],"Object Shape":"Disc, Sphere, Other, Unknown","Tags":"City","Region":"Tennessee","Disposition":"IFO","Log Number":"US-11282010-0013","Object Flight Path":"Unknown","Sighting Duration":"00:01:00","Date Submitted":"11/28/2010 09:10 UTC","Weather Factors":"None"}