{"Latitude":"40.810962","Date Submitted":"11/29/2010 09:23 UTC","Disposition":"Unknown","Summary":"i have videos of multiple space crafts at least 15 of them all different and non human figures in photots","Sighting Duration":"03:00:00","Viewing Distance":"20 Feet or Less, Unknown","files":["/var/www/straped/mufon/html2text/26789.html.txt","/var/www/straped/mufon/org/26789.html"],"Object Features":"None","divs":["sighting detailsi was going to walmart at 3 am for black friday and we see this bright star that is about 5x brighter than venus. it begins to move so i film it and when i film it on the camera i cannot see it only complete darkness. i lost track completely of 3 hours and next thing i know were driving home at 630 am and we go home and i look on my phone and there are 5 videos each between 5 seconds and 1minute and 51 seconds. each video contains different spaceships and in 2 videos u can see humanoid figures in front of us and one runs up to me hits me and drags me off and the video ends. please contact me and i can send the videos and we can talk about what happened. im quite frightened and my bellybutton has 2 tiny stitch like thing in it. theres also a little metal something sticking out of it. this evidence could truely be world changing and i'd appreciate contact. also ive experienced extreme paranoia and almost as if soemthing is following me and constantly watching. please give your assistance asap. i will not post my videos here , theyre kind of private and the fact that you can see me being taken, i dont feel comfortable with multiple people seeing that at the moment. so one please contact me and i can privately send them and decide what to do. sincerely *(wit's first name deleted--cms\\sg)."],"City":"Lincoln","Object Flight Path":"Stationary,Path then hovering,Unknown","Weather Factors":"Unknown","Longitude":"-96.673569","map":"<A HREF = \"http://maps.google.com/maps?q=40.810962,+-96.673569(26789)&iwloc=A&hl=en\"> mufon case (26789) map </A>","Object Shape":"Boomerang, Cigar, Sphere, Star-like, Triangle, Unknown","Region":"Nebraska","Tags":"City","Case Number":"26789","Date of the Event":"11/26/2010 12:00 UTC","Country":"United States","Log Number":"US-11292010-0007","Source":"MUFON","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around November 26th 2010"]}