{"City":"Sioux City","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving north on I-29 on Thursday, November 13, 2003. At about 400 p. m.,midway between Council Bluffs and Sioux City, I saw a network of high voltagepower lines that crossed the interstate up ahead. Above the power line network,I saw an object that I first assumed was a dark, tobaccobronzebrown jet planethat had just taken off and was climbing to gain altitude. Since I was, atleast, thirty or forty miles north of Council Bluffs and Eppley Field in Omaha,and out in the middle of flat, farm country, I was surprised to see the planeand wondered where it had come from.After driving under the power line network, I began watching the object throughthe front windshield of my car. I was waiting for it to continue climbing andorbank right or left, so that I could see its wing structure and identify theaircraft. It appeared to be less than a mile from my car. But, as I continuedto drive and watch the object, it remained stationary -- tilted at about a 40degree angle in the sky. The craft was narrow and elongated, with no wings,props, landing gear, windows, jet wash, or other distinquishing marks, exceptfor a slight bump on each end.I had driven quite a way, watching this object and wondering what it was, when acar passed me at a very high speed on my left. I immediately looked over at thecar, and checked my position on the highway. When the car was safely past me,and I looked back up at the object in the sky, I was amazed to see nothing but alarge, intensely-black circle, where the original craft had been. To myastonishment, the circle quickly diminished in size to approximately one half ofits original diameter, and then completely disappeared In the few seconds thatI glanced away from the craft, it apparently turned up on its side i. e., towhere I was actually seeing the circular bottom of the craft before it eithercloaked itself, or took off at a velocity that apparently exceeded the speed oflight.Needless to say, I was and remain stunned and dumbfounded by what I witnessed. Iam a rational 60-year-old, scientifically trained, and not subject tohallucinations. But I can offer no reasonable explanation for the craft that Isaw. Please let me know if there were other reports of a similar craft inwestern Iowa on that day, or if other observers have ever seen similar objectsthat simply disappeared. I would be pleased to talk with any of yourresearchers about this matter. Thank you for your consideration."],"Case Number":"2678","Disposition":"Unknown","Date Submitted":"10/13/2003 04:00 UTC","trends":["There have been 12 other sightings in Sioux City","There were no other sightings in Sioux City on or around October 13th 2003"],"Sighting Duration":"00:05:00","Log Number":"","Tags":"City","Country":"United States","Date of the Event":"10/13/2003 04:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"Iowa","Latitude":"42.509554","Summary":"a ufo that changed shape and disappeared","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/2678.html.txt","/var/www/straped/mufon/org/2678.html"],"Longitude":"-96.391307","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=42.509554,+-96.391307(2678)&iwloc=A&hl=en\"> mufon case (2678) map </A>","Source":"MUFON","Object Features":"Appendage(s)"}