{"Date of the Event":"11/19/2010 12:00 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26783.html.txt","/var/www/straped/mufon/org/26783.html"],"Object Features":"Unknown","City":"Caspar","map":"<A HREF = \"http://maps.google.com/maps?q=39.364922,+-123.814475(26783)&iwloc=A&hl=en\"> mufon case (26783) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary","Case Number":"26783","Latitude":"39.364922","Sighting Duration":"Undisclosed","Longitude":"-123.814475","Country":"United States","Date Submitted":"11/29/2010 01:41 UTC","Object Shape":"Circle","Region":"California","Summary":"\"Sun\" Seen Over Moon in Caspar, California","Tags":"City","Source":"MUFON","divs":["Sighting DetailsThis is a second-hand report from my father. My Dad vacations every year for a week on the California coast in Caspar (Mendocino County). He is a very down-to-earth individual who during the whole time while growing up told me I was nuts if I believed in anything like UFO's or aliens. So when he told me he saw a big red-tinted, whitish circle over a full moon at about 2 AM that was about twice the size of the moon and that it appeared above his eye-level at about 45 degrees and cast a shadow through a large window in the upstairs room he was sleeping in--it gave me pause. He stood in front of the window and watched it for about 10 minutes or so and then decided to go back to bed. It really shook him up. The shadows cast by it were almost as distinct as day-time shadows cast by the sun. He said it was like watching a moon-set and a sunrise except the sun doesn't rise at 2 AM and the sun doesn't rise in the west. The more he tried to figure it out, the more it shook him up. And not being able to explain it right now is troubling for him. I've done some web searching and nobody appears to have reported a siting from Caspar, Mendocino or Fort Bragg, so I guess this is the first."],"trends":["There have been no other sightings in Caspar","This sighting has never been favorited."],"Disposition":"Insufficient Data","Log Number":"US-11292010-0001"}