{"Longitude":"-82.81073","Object Features":"Unknown","City":"Trenton","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.615274,+-82.81073(26793)&iwloc=A&hl=en\"> mufon case (26793) map </A>","Object Shape":"Triangle","trends":["There has been one other sighting in Trenton","There were no other sightings in Trenton on or around November 28th 2010"],"Log Number":"US-11302010-0002","Disposition":"Insufficient Data","Date of the Event":"11/28/2010 09:10 UTC","Object Flight Path":"Straight-line path","Latitude":"29.615274","files":["/var/www/straped/mufon/html2text/26793.html.txt","/var/www/straped/mufon/org/26793.html"],"Region":"Florida","Summary":"Triangular, six circular markins on underside of craft of lighter coloer","Viewing Distance":"501 Feet - 1 Mile","Case Number":"26793","Weather Factors":"None","divs":["Sighting DetailsI was outside at 8:30 pm. There was some cloud cover to the west and to the north. At 8:45 pm there was almost complete cloud cover and no visible stars. By 9:00pm the cloud cover was almost completely clear in my viewing area. I noticed several planes, both to the east and to the west. There were several pairs of planes that appeared to be flying in formation to the east on a north heading. (too close to be commercial airliners) I was situated in a postion facing south at the darkest section of my yard. 9:10pm From directly overhead I saw a large blur coming from a direction behind me. I looked directly at the object and noticed that it blocked the view of the stars above it. There were no lights at all on the object. However there were six circular markings on the underside of the object. The six circular markings made an upside down V with the point of the V moving away from me. I had a pair of Eleitz Wetzlar 8x30 binoculars in my hands. I immediately veiwed the object with these. Viewing this object through the binocluars I could only see the center portion of the object, with its outside portions outside my viewing. I could see all six of the circular markings on the underside of the object. The object in its entirety was triangular in shape. Each point of the object was rounded and not pointed. At arms length measuring between thumb and first finger it was 5 inches in width and 3 inches in length. I would estimate speed to be close between 500 and 600 miles per hour with an altitude of 500 to 1000 feet. Entirely silent. I lowered my binoculars and veiwed it flying away and out of view south. I timed the viewing of this object to be 10 seconds and noted the time. I immediately sketched to paper what I viewed as best as I could. I also noted that the object appeared solid because nothing could be seen above it. I waited 15 minutes longer viewing the same area of sky before going inside to type up what I viewed."],"Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"11/30/2010 09:55 UTC","Country":"United States"}