{"divs":["Sighting DetailsI was heading northbound on 183 hwy after leaving the airport. I noticed a dark triangle shaped craft moving very slowly over the army base area about 45 degrees up and to the left side of my vehicle, moving southward towards the airport. it almost flew right above me so i pulled the van over to the side of the road and stopped the car just to get a better view of it. it had a light on each angle and two more lights toward the middle of the bottom. I watched it fly congruent to a jetliner as it was passing it by. The jet wasn't very close to this object but this triangle object was very low to the ground. There were no apparent landing gear, it was just kinda cautiously approaching the airport. It dissapeared to the south after about 3 minutes...Since,it passed over the army base really low it gave me the impression that this was an experimental government aircraft. This triange was a little bigger than a 747 wingspan wise. This is the best description i can give. This is genuine. I don't have any photos because it was too dark and my cell phone takes lousy pics. The attached pic is kinda what it looked like to me, just that the craft i saw was gunshot metal color."],"Source":"MUFON","Disposition":"IFO","Date of the Event":"11/28/2010 12:00 UTC","Log Number":"US-11302010-0006","Object Shape":"Triangle","Latitude":"30.273543","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.273543,+-97.739561(26799)&iwloc=A&hl=en\"> mufon case (26799) map </A>","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around November 28th 2010","This sighting has never been favorited.",""],"Date Submitted":"11/30/2010 05:00 UTC","Case Number":"26799","Tags":"City","Region":"Texas","City":"Austin","Country":"United States","Longitude":"-97.739561","Sighting Duration":"Undisclosed","Summary":"Triangle shaped object above Fort Brag","files":["/var/www/straped/mufon/html2text/26799.html.txt","/var/www/straped/mufon/more/26799_submitter_file3__flying.jpg","/var/www/straped/mufon/org/26799.html"],"Object Features":"Undisclosed"}