{"Source":"MUFON","Date Submitted":"11/29/2010 09:24 UTC","divs":["Sighting DetailsI was sitting on my back porch after having supper when I noticed a light moving from the west to the east. It was about as bright as the stars I could see and it's movement was what caught my eye. This was about 6:30pm. It was traveling about the speed that a satellite would travel as seen from the ground. I watched it for about 15 seconds before it disappeared behind a tree to the east of me. About five minutes later, as I was again scanning the sky, I saw another light flare up above a tree in my front yard, due south of my position. I didn't see the light until it flared on but I determined that it was moving from the southwest to the northeast. This time the light flared on for about two seconds then dimmed out for about two seconds then came back on. It did this three times before dimming out for good. I kept watching in the direction it was moving but didn't see it again. About five minutes after this another light flared on in about the same location as the one before this but this time it was traveling south to north. This one stayed lit for about five seconds before dimming out and disappearing. I again tracked it's course but didn't see it again. About five minutes later another light flared on what seemed to the west of my house. This time it was moving from the north to the south. The light stayed lit for about six to seven seconds and as it traveled south it seemed to zigzag slightly then it dimmed out and disappeared. I, again, scanned the direction it traveled and didn't see it again. This whole episode has me excited."],"City":"San Antonio","Region":"Texas","Sighting Duration":"00:25:00","files":["/var/www/straped/mufon/html2text/26790.html.txt","/var/www/straped/mufon/org/26790.html"],"trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around November 29th 2010"],"Weather Factors":"None, Does Not Apply","Object Flight Path":"Straight-line path,Other","Summary":"Several lights, somewhat like a satellite going over head, traveling in different directions.","Viewing Distance":"Unknown","Case Number":"26790","Object Features":"Unknown","Disposition":"IFO","Country":"United States","Object Shape":"Star-like","Date of the Event":"11/29/2010 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.432702,+-98.487658(26790)&iwloc=A&hl=en\"> mufon case (26790) map </A>","Log Number":"US-11292010-0008","Longitude":"-98.487658","Tags":"City","Latitude":"29.432702"}