{"Latitude":"33.66919","Summary":"Unknown lights hovering in the sky - Walnut Grove, GA","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Object Flight Path":"Stationary","trends":["There have been 5 other sightings in Conyers","There were no other sightings in Conyers on or around November 9th 2010","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","Date of the Event":"11/09/2010 08:50 UTC","Object Features":"Unknown","divs":["Sighting DetailsOn the night of 11-8-2010 I was coming home from town. As I pulled in the driveway I noticed 3 bright lights in a diagonal line over the trees across the field. I stopped and looked but kept driving. As I went further down the driveway I was trying to figure out what I had seen. I backed the car up and parked in the field and watched. When I got back down the driveway the top light had now moved down and the lights were now in a triangular formation. They were very bright and appeared to be very close and low, just over the trees it seemed. They hoovered in the same spot for about 15 minutes and then one just faded out.Then a few minutes later the second faded away. Then the third. The next night 11-9-2010, I was coming home around the same time, but this time I had my nephew with me. We saw what appeared to be the same lights hoovering in the same location and as before they hung around for at least 15 minutes. We drove over to the next driveway on the other side of the field to see if we could tell what the object(s) were but all we could see were the lights. As before, one by one they just faded away. I've been out to the field several nights and just sat and watched, but there has been nothing out there since those two nights. From what I am reading, there are reports of sightings in several surrounding counties in the last two weeks. Conyers, Covington, Monroe, Madison and some further out.. Two sightings in Clayton County and I believe one more but I don't recall the county. Also, there was a report of a sonic boom as reported in the AJC that was heard around Carrol, Douglas and Harelson Counties. Very strange. In the pictures I've attached, there is a bright light at the bottom of the photo and a smaller light to the right. The light to the right is our neighbors street light and the light to the left is a reflection off of a license plate. The lights at the top of the photo are those that appeared to be hoovering in the sky."],"files":["/var/www/straped/mufon/html2text/26804.html.txt","/var/www/straped/mufon/more/26804_submitter_file1__2010-11-08_21-03-19_443.jpg","/var/www/straped/mufon/more/26804_submitter_file2__2010-11-09_21-42-45_590.jpg","/var/www/straped/mufon/more/26804_submitter_file3__2010-11-09_21-43-24_660.jpg","/var/www/straped/mufon/org/26804.html"],"Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Country":"United States","Date Submitted":"12/01/2010 01:43 UTC","Region":"Georgia","Weather Factors":"Unknown","Case Number":"26804","Log Number":"US-12012010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=33.66919,+-84.01247(26804)&iwloc=A&hl=en\"> mufon case (26804) map </A>","City":"Conyers","Longitude":"-84.01247"}