{"Object Features":"Unknown","divs":["Sighting DetailsI was in my hotel room at the Holiday Inn (1805 Hotel Plaza Blvd, Lake Buena Vista, FL 32830), when my 9 year old grandaughter said it was thundering outside. I went out on the balcony to look. At first, I thought the noise was an airplane because I could see one traveling across the sky and then I realized it was a firework show over Disney World (probably Magic Kingdom but I'm not familiar with the area enough to be sure and we are several miles away and couldn't actually see the fireworks). After I figured out what the noise was, I noticed a star-like light very high in the sky, well above the airplane that was flying in the sky. It really stood out because there was not a single other star in the sky. I thought it odd because I'd been at the firework show at Magic Kingdom the night before and had seen a lot of stars in the sky so this difference really caught my attention and caused me to really focus on the star-like object. After a few minutes, I saw the object move very slightly, so slightly I felt maybe it had not happened. I also was a bit freaked because I had seen a similar looking object back in Oregon last week when I was walking my dog late at night. It also moved very slightly and I felt perhaps I was imagining it so I thought oh no, my mind is playing tricks again. But, this also caused me to really fixate and watch the object and when I saw it slightly glide just a tiny bit a couple more times, I called out my grandaughter to see if her younger eyes noticed anything. Asked her to watch it and she humored me and then got a little scared when she and I both saw it move a bit slightly. We came back into the room and I talked to her- she wanted to know if there were humans or aliens in the UFO and I reassured her that everything was ok. I went back into the room for awhile to keep her company and kept peeking to see if it stayed, which it did. About 10 or 15 minutes after the fireworks stopped, I saw the light move more noticeably and then it started to dim and then got bright again and did this about 2 times before I called my grandaughter back out to look. She and I watched as it dimmed and lit back up and then it totally disappeared and then quickly lit back up and dimmed and lit back up one more time. Then it disappeared and slightly after this we heard a sound like a backfire or firework and we could not see it anymore. We went back inside and I kept checking periodically and about 10 minutes of it not being there, the next time I went out it was back in the same location in the sky. It stayed for awhile and I just went out to check and it is still there and it's now 22:16. In fact, it's movements are not as subtle and I could see it moving from side to side in a downward semi-circle pattern several times. It moves slightly and then steadies and remains still for awhile and repeats this way over and over. Unfortunately, I don't have any binoculars handy but am wishing I did so I could see even better. I just went out one more time before I submit this. At approximately 22:31, I saw it dim again and then a large cloud cover moved in between the oject and I and I couldn't see it anymore. I waited for about 5 mins but the clouds continued to block the view and I can't tell if it's still there or not. As far as my feelings about the sighting- I felt a mixture of excitment and skepticism when I first saw it. The excitement remained as I watched and then I was a little frightened when we saw it dim and re-light and disappear. Right now, I feel calm with an underlying excitement. I have had a couple of experiences in the past 2 years where I spotted a UFO-like object but have been by myself and just tried to put it out of my mind because I felt maybe I was imagining or perhaps even delusional. This event made me feel compelled enough to search the Internet and find this site to make the report. I also will be researching the Internet to learn more about other sightings at Disney World- I really got the sense that the object was there to watch the firework show. I just looked outside again, it's 22:41 now, the clouds are all gone (not a single one in sight) and the star-like object is absolutely not present."],"Latitude":"28.541776","Summary":"UFO over Disney World during and after firework show","files":["/var/www/straped/mufon/html2text/26802.html.txt","/var/www/straped/mufon/org/26802.html"],"trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around November 30th 2010"],"Country":"United States","Date Submitted":"11/30/2010 11:58 UTC","Sighting Duration":"Undisclosed","Date of the Event":"11/30/2010 09:50 UTC","Weather Factors":"None","Tags":"City","Case Number":"26802","Region":"Florida","Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=28.541776,+-81.376456(26802)&iwloc=A&hl=en\"> mufon case (26802) map </A>","Disposition":"IFO","City":"Orlando","Longitude":"-81.376456","Object Shape":"Star-like","Log Number":"US-11302010-0009"}