{"Date Submitted":"12/01/2010 03:06 UTC","Viewing Distance":"Over One Mile","Region":"Alabama","Date of the Event":"11/29/2010 01:00 UTC","Tags":"City","Sighting Duration":"00:35:00","City":"Tuscumbia","Log Number":"US-12012010-0004","files":["/var/www/straped/mufon/html2text/26806.html.txt","/var/www/straped/mufon/org/26806.html"],"divs":["Sighting DetailsStepped outside at 12:45 am for a smoke before going to bed. I am a professional pilot and somewhat of an amateur astronomer. As is my habit, I scanned the sky for aircraft and identified Jupiter, Pleiades. Taurus, Orion, Betelgeuse, Sirius, etc. It was then that I noticed a flash of an approximare magnitude of Sirius about 15 degrees SE of Betelgeuse near Procyon. The object was staionary and remained so at an extreme altitude, well above the flight levels. The light was white in color and flashed at intervals of 9 to 9.5 seconds with each flash about 1 to 2 seconds in duration. The light was well defined in shape, being circular and unlike any aircraft anti-collision lights. After watching this object for 15 minutes I went inside to wake my wife and retreive my binoculars. My wife is also a professional pilot and she witnessed the remainder of the observation. Back outside, I trained my 9X binos on the object. Procyon was just visible inside the field-of-view and allowed me to determine that the object was not moving relative to that star. I offered the binos to my wife and noticed that with the naked eye the object was not as bright as before. After 5 more minutes it was not visible to the naked eye. I continued to observe through the binos until 1:20 am when bands of cirrus began to obstuct the view completely. Total duration of the observation was :35 minutes. My wife and I have many decades and many, many thousands of hours aloft in everything from biplanes to big Boeings. We are certain this was no aircraft. Perhaps it was a slowly rotating satellite with the sun glinting off a mirrored surface. It was strange and we wish we had a better idea of what it was."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.74017,+-87.69413(26806)&iwloc=A&hl=en\"> mufon case (26806) map </A>","Source":"MUFON","trends":["There has been one other sighting in Tuscumbia","There were no other sightings in Tuscumbia on or around November 29th 2010"],"Latitude":"34.74017","Weather Factors":"None","Object Flight Path":"Stationary","Longitude":"-87.69413","Object Shape":"Star-like","Case Number":"26806","Object Features":"None","Summary":"High altitude, stationary, flashing object.","Disposition":"Unknown"}