{"Disposition":"Unknown","Date of the Event":"10/06/2010 10:15 UTC","Tags":"City","Object Flight Path":"Other","Summary":"MASSIVE UFO! Similar sighting on Nov. 17th. 2010","Weather Factors":"Unknown","Object Shape":"Boomerang, Circle, Disc, Flash, Square, Rectagular, Triangle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26801.html.txt","/var/www/straped/mufon/org/26801.html"],"Log Number":"US-11302010-0008","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around October 6th 2010"],"Latitude":"34.490841","Longitude":"-114.320305","Date Submitted":"11/30/2010 11:28 UTC","Sighting Duration":"Undisclosed","divs":["sighting details i was outside my home on 10\\6\\10 and again on 11\\17\\10 and was video taping flashing light's. i filmed in front and behind the flashing object. what my naked eye could not see....my camera sure did and what it captured was nothing less than awesome! this object had a formation that started as a \"v\" shape and had so many other things \"attached\" to it, that is what makes this so incredible. on 11\\17\\10, i video taped numerous rotating lights in a mountain area, where there should have been nothing there at all. this is really interesting......on 11\\19\\10, i contacted seti and told them of tapes...i have and what i've seen in the sky. they asked me, \" do you see anyone flying these things?\" i thought to myself, \"what the heck, yeah they opened their window and waved at me\". needless to say, the conversation wasn't much longer after that comment. the next day, 11\\20\\10, 2 military helicopters began circling the city along with...jets. i've lived here since 1997 and have never seen a military helicopter, let alone 2 at the same time. i just thought it to be strange that after contacting seti, all of a sudden the military shows up."],"Case Number":"26801","Country":"United States","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.490841,+-114.320305(26801)&iwloc=A&hl=en\"> mufon case (26801) map </A>","Viewing Distance":"Unknown","Region":"Arizona","City":"Lake Havasu City"}