{"Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Region":"Kansas","map":"<A HREF = \"http://maps.google.com/maps?q=38.973279,+-95.22993(26803)&iwloc=A&hl=en\"> mufon case (26803) map </A>","Log Number":"US-12012010-0001","Longitude":"-95.22993","Latitude":"38.973279","Date of the Event":"11/30/2010 09:30 UTC","Object Shape":"Triangle","Case Number":"26803","files":["/var/www/straped/mufon/html2text/26803.html.txt","/var/www/straped/mufon/org/26803.html"],"Disposition":"Unknown","Object Flight Path":"Undisclosed","City":"Lawrence","Tags":"City","divs":["Sighting DetailsI recieved a call from my friend around 7 PM when she was driving on K10 coming from Olathe to Lawrence. She said she saw something that looked like a UFO because it was low and seemed to be hovering and there were blinking lights on it. We blew it off until me and another one of my friends were driving from Lawrence toward Olathe at around 9 PM and we saw the exact thing that my first friend had described. The UFO started off looking like a star. It then got extremely bright and started lowering, moving toward us driving on the highway. It flew directly over us and the bottom of it looked to be in a triangle shape with the same lights described above. We then saw another UFO act in the same exact way. We went back into town then grabbed a few of our friends because we saw so many abnormally twinkling \"stars\" that turned out to look like triangle ships as the dropped down. We went back on K10 and pulled off in a dim area to watch this strange situation. Sure enough, the same exact thing happened with three more ships, all looking similar but the blinking of the lights seemed to be different for each ship. There were two UFOs that were next to each other then one started moving up and one started moving down at the same time. There were so many bright UFOs in the sky that stayed in the same place for the most part but would tend to minutely move up, down and side to side. The last ship we saw that came down made a sound when we didn't hear a sound come from any of the other ones we saw. It sounded like a \"whomping\" noise (hard to explain). Two of my friends said that they felt tingly all over and the top of their head was tingling sensationably and they couldn't help but have tears come even though they were not sad, they could not explain why this was happening to them. Eventually we came back home because it was getting late, but they never left the sky."],"trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around November 30th 2010"],"Date Submitted":"12/01/2010 01:26 UTC","Sighting Duration":"Undisclosed","Summary":"They all looked like triangles, some more like pyramids. They had red, blue and white lights flashing on them.","Country":"United States"}