{"Region":"California","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"12/02/2010 02:45 UTC","Latitude":"33.526826","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/26815.html.txt","/var/www/straped/mufon/org/26815.html"],"Weather Factors":"Unknown","Case Number":"26815","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.526826,+-117.705383(26815)&iwloc=A&hl=en\"> mufon case (26815) map </A>","Tags":"City","City":"Laguna Niguel","trends":["There have been 11 other sightings in Laguna Niguel","There were no other sightings in Laguna Niguel on or around November 26th 2010"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-117.705383","Log Number":"US-12022010-0003","Summary":"low flying, high speed, white lights chasing around, red light on top, flying North over I-5","Object Features":"Undisclosed","Date of the Event":"11/26/2010 09:00 UTC","Object Shape":"Circle, Oval","divs":["Sighting DetailsI was driving North on Interstate 5 in Orange County at about 75 miles an hour. My 13 year old daghter was in the car and pointed out the window saying \"Daddy, what is that thing?\". I leaned forward and looked up. I saw something dark and circular with chasing lights and a red light on top. I told her it was a blimp. At the time it was moving very slowly. I thought the chasing lights were a message board on the side of a blimp. She asked me if I was sure so I looked again. It was definitely NOT a blimp. I could see a single line of chasing lights that would have a occassional break in them, kind of like a binary code or morse code. I could see they wrapped around the object. The red light on top stayed on continuously. It continued slowly from the West to East side of the freeway. Then back over the freeway. At this point we had been watching for about a minute. Then the craft began accelerating very quickly heading North. When I say quickly, I mean like a jet taking off or faster, pulling away from us with some serious speed. I was positive at this point that it couldn't be a jet or a blimp. It seemed to be within 1,000 feet or so from the ground. We couldn't hear any noises. We pulled over at Avery Parkway and continued to watch. Our cameras on our cell phones weren't good enough to get a photo of it. It continued North at high speed for about 20 to 30 seconds after we pulled over. Then it headed out over the ocean and was gone in the next 10 seconds. The whole event lasted between 2 and 3 minutes. I've seen objects before, but this was definitely the closest and clearest I've ever been able to see one. It appeared to be a pretty simple looking craft compared to some of the descriptions I've heard in the past concerning UFO sightings. It was the first time my daughter had seen anything like this. She was very excited."],"Disposition":"Unknown"}