{"Region":"Illinois","Object Shape":"Triangle","Latitude":"42.222669","Date Submitted":"12/02/2010 01:03 UTC","trends":["There have been 5 other sightings in Vernon Hills","There were no other sightings in Vernon Hills on or around December 1st 2010"],"Longitude":"-87.972629","Summary":"Low Flying Triangle","Object Features":"Undisclosed","City":"Vernon Hills","Log Number":"US-12022010-0002","Disposition":"IFO","Case Number":"26814","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.222669,+-87.972629(26814)&iwloc=A&hl=en\"> mufon case (26814) map </A>","divs":["Sighting DetailsWas Driving South on Butterfield Road Between Vernon Hills and Libertyville Briefly Saw A triangle Flying Low Over the road from West to East. I noticed 3 steady white lights forming a triangle with a flashing light of the same color in the center. I only saw it briefly as reported above, though I believe I may have been able to make out a triangle shape between the lights and it seemed to turn slightly without banking. Something felt funny in the way it was moving. I will be the first to admit I don't know much about aircraft lights apart from the red and green wing tip lights. It should be noted that cloud cover seemed to be very low so perhaps there are specific lights to be used in such conditions, during which may have blocked out the wing tip lights. I see planes flying in this area all the time, it was honestly the light color and movement that threw me off. As a UFO enthusiast I try to explain away almost everything I see flying as terrestrial, as I am naturally more prone to jump up and shout UFO!! this one just felt different. It absolutely could have been a plane I am a complete novice when it comes to aviation. I wanted to get this report in. I would disregard unless you hear a similar report in the same area."],"Object Flight Path":"Path with directional change","Tags":"City","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"12/01/2010 10:15 UTC","files":["/var/www/straped/mufon/html2text/26814.html.txt","/var/www/straped/mufon/org/26814.html"]}