{"Summary":"Saw string of lights","City":"North Chicago","Object Features":"Unknown","Log Number":"","Viewing Distance":"Over One Mile","Date Submitted":"11/19/2003 06:40 UTC","Case Number":"2681","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/2681.html.txt","/var/www/straped/mufon/org/2681.html"],"Source":"MUFON","Region":"Illinois","Latitude":"42.325578","map":"<A HREF = \"http://maps.google.com/maps?q=42.325578,+-87.841182(2681)&iwloc=A&hl=en\"> mufon case (2681) map </A>","divs":["Sighting DetailsExiting work on Casmir Pulaski Dr. heading east. I waited at the light on Rt. 43heading east and looked up and across the road. Above the horizon I saw whatappeared to be a aerial holding pattern as seen from a distance. Looked exactlylike planes waiting outside OHare in inclement weather, waiting for anopportunity to land, except they were very low. We do have an airport here and amilitary base, but it is a naval base Great Lakes and a training facility forbasic. The light changed and I continued east keeping an eye on the lights. Ibelieve that they appeared to be either over Abbot Labs or just east of it which would be over the near western shore of lake Michigan. When I reachedLewis rd. I noticed that the 6-10 lights had become, quite suddenly, 4 seperateand very distinct lights. They appeared to be moving slowly eastward and downsimultaneously toward the horizon. By the time I reached Sheridan road in frontof Abbot Labs., I could only see one and that one disappeared from my line ofsight as I turned north.They looked like very bright stars at first, much like Venus did recently,though much larger. They at first appeared to be very distant, as if in aholding pattern viewed from afar. I realized they were not far and I noticedthey were moving eastward at a rate somewhat faster than 30 mph I was traveling.They could have been helicopters I guess though they did not move with the quickmotions of a helicopter ascending or descending. And I could not describe themethod in which they left my field of view as it seemed that they descended andfaded at the same time."],"Disposition":"Unknown","Tags":"City","Date of the Event":"11/19/2003 06:40 UTC","trends":["There has been one other sighting in North Chicago","There were no other sightings in North Chicago on or around November 19th 2003"],"Object Shape":"Star-like","Country":"United States","Longitude":"-87.841182","Object Flight Path":"Hovering then path,Unknown","Weather Factors":"Unknown"}