{"Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Latitude":"29.762093","Source":"MUFON","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around October 27th 2010"],"Longitude":"-95.36509","divs":["Sighting DetailsI was in my home cleaning. the suddenly a copter flew over head very low and loud and fast over my home. I didnt think much of it because it happens often. But this copter was going back and forward over my home it was getting on my nerves. So i grab my digital camera and went out and took three pictures of the copter watched it for a while as it was flying around in circles one street away from my street very low. That was all I saw was the copter. Four to five days went by and I load my camera on to my computer and there it was. My computer automatic blows the pictures up to 300 times when loading. The orb look like it was giving off heat or somthing because it was blurred around it. I started showing everyone I ran into, and some skeptic but after they kept coming back to look at it they said weird. Some say its a bird, no way it is a good picture. It is right below the copter, I got a good picture. Once it is blown up it does blurr to really see it but it is still very clear it is a orb. I kept showing friends and different people and one friend stated to me that the copter is are local news copter. It is channel 13 eyewitness news, its blurred but I do see it now.Many stated to me they do believe now and they didnt before. I would love to show someone in the UFO division my photo on my computer. I would also state that this isnt the first time I spotted a orb and copter. When I was walking my dog in the area one weekend about 4-5 years ago I spotted a copter and orb again. I didnt have a camera so I didnt tell anyone and I always believed in all this stuff and I watch UFO programs when they are on TV all the time when its on. And the last thing my friends want to here is about Ufo and such so I learn to keep quite. Its a good picture and I plan to join a UFO group now and show my picture to them. I always wanted to get more into the UFo and such but never really had the guts until now because I have somthing to bring to the table and it has got me going.I dont know how to send pictures over the computer but you will probably here it or see it threw the grapevine because I am going to get more involved."],"Object Features":"Appendage(s), Wings","Disposition":"Insufficient Data","Weather Factors":"Unknown","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/26822.html.txt","/var/www/straped/mufon/org/26822.html"],"Date of the Event":"10/27/2010 01:10 UTC","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"26822","Object Shape":"Sphere","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.762093,+-95.36509(26822)&iwloc=A&hl=en\"> mufon case (26822) map </A>","City":"Houston","Date Submitted":"12/02/2010 02:36 UTC","Summary":"orb very small metallicI","Log Number":"US-12022010-0010"}