{"Viewing Distance":"501 Feet - 1 Mile","Latitude":"34.484901","files":["/var/www/straped/mufon/html2text/26825.html.txt","/var/www/straped/mufon/org/26825.html"],"Source":"MUFON","Tags":"City","Date Submitted":"12/02/2010 03:21 UTC","Longitude":"-114.316655","Weather Factors":"None","Country":"United States","Object Features":"Wings","Summary":"Small winged aircraft--small military-- slight eradic/jerking movement","Disposition":"Unknown","divs":["sighting detailsmy wife and i were headed to havasu city at app. 2:15 pm to meet some friends. we left bullhead city on hwy 95 to needles, ca. and turned east on hwy 40. we exited hwy 40 going south toward havasu. about 4-5 miles i saw what i thought to be a small military plane appear in the west and it proceeded east.the exact point we were at gave us at least a 150 degree view of the sky.this is desert open land.there were mountains to the south another 4-5 miles but they did not obstruct the view of the sky where the object was traveling. the object passed over us and cleared our entire field of view in only seconds. i immediately rolled down the window on my side to experience the sound however, the sound was minimal. my wife heard nothing.i commented to my wife that it was highly unusual for a plane of any kind to be in this area.the only landing fields are for very small private planes, nothing like what we had just seen. there are no air bases close. the usual flight pattern for commercial aircraft crosses over kingman- bullhead city but not this far south(app. 60 mi) i was in the us air force for 5 years. i am very familiar with planes. after some consideration and thought i now, do not believe we saw a normal\\conventional aircraft."],"Case Number":"26825","Sighting Duration":"00:00:28","Region":"Arizona","Object Shape":"Triangle, Other","City":"Lake Havasu City","Date of the Event":"08/20/2010 02:15 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.484901,+-114.316655(26825)&iwloc=A&hl=en\"> mufon case (26825) map </A>","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around August 20th 2010"],"Log Number":"US-12022010-0013"}