{"Longitude":"-89.428121","divs":["Sighting Details I live in a rural area in South Central Mississippi. My husband was gone on a job one weekend and I was in my house watching TV with my three stepchildren and my nephew. I noticed a light coming through the window blinds that face my backyard. I originally believed someone had pulled around to the back of my home and was in the process of driving away. I went to the window, but didn't see a vehicle. I then walked to the front door, where surrounded by children I still failed to see a car. Then, I looked up and slowly cruising above a juvenile pine tree-line was the most astonishing sight I have ever beheld. The object was metallic silver and Square shaped, edges were rounded, the top was slightly domed. There were lights shining down from the four corners. The bottom was smooth and seemless. There seemed to be no means of propulsion. This object was approximately 10 feet above the trees yet there was no movement from the pine trees. My stepdaughter asked me, ( Is that what I think it is?) I replied, ( I don't know what that is sweety but we're locking the door.) The children slept in my room that night and every night that they came to visit for about a month until the event began to fade for them. We still talk about it every now and then..but we don't go outside after the sun starts setting anymore."],"Latitude":"31.829604","trends":["There have been no other sightings in Taylorsville","This sighting has never been favorited."],"Source":"MUFON","Object Features":"Undisclosed","Summary":"Metallic, Square shaped UFO slowly cruising over treeline traveling approximately 5 mph in a westward direction","Log Number":"US-12022010-0009","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/26821.html.txt","/var/www/straped/mufon/org/26821.html"],"Case Number":"26821","map":"<A HREF = \"http://maps.google.com/maps?q=31.829604,+-89.428121(26821)&iwloc=A&hl=en\"> mufon case (26821) map </A>","Region":"Mississippi","Date Submitted":"12/02/2010 02:08 UTC","Date of the Event":"03/04/2007 05:00 UTC","Disposition":"Unknown","Tags":"City","Viewing Distance":"Unknown","Country":"United States","City":"Taylorsville","Object Flight Path":"Undisclosed","Object Shape":"Square, Rectagular"}