{"trends":["There have been 4 other sightings in Glens Falls","There were no other sightings in Glens Falls on or around July 15th 2010"],"Latitude":"43.312183","Disposition":"Unknown","Date Submitted":"12/02/2010 01:26 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26820.html.txt","/var/www/straped/mufon/org/26820.html"],"Log Number":"US-12022010-0008","Object Shape":"Chevron","Source":"MUFON","Tags":"City","Summary":"2 came over my head when I was setting up to watch the stares","Country":"United States","Date of the Event":"07/15/2010 11:27 UTC","City":"Glens Falls","Case Number":"26820","Viewing Distance":"Unknown","divs":["sighting detailsi was setting up my teliscopes and looking up at the stares to the north when 2 ships that i have never seen before came over my home. thay didnt look very high up.1 higher and on the left wing or side of the othere.there was 5 large white orange lighs on each craft.(no sound) thay looked to be about 500 yards up.not moveing vary fast at all. thay went south in a strate line for about 3 min.then it looked like the just stoped and huvered not going up or down.after a few mor min.they started off again but didnt bild up speed thay just went off.then a %90 turn and off like i have never see before. i have see planes in combat and here doing munovers a lot but nuting like that.helos and plaines just cant do what i saw . 1 time before in late june i was looking at the moon and notest a star looking out of place all at onece it darted left tghen rite then up into the moon light were i lost it . i told my son mike and he got excited and said he and his wife saw it the night before but thay didnt wont to tolk about it to otheres at the time.thanking we wouldn't beleve them. im now bring out vidio camras when i got out to look and a still. think you *(wit's name deleted--cms\\sg)"],"Object Features":"Undisclosed","Longitude":"-73.643995","map":"<A HREF = \"http://maps.google.com/maps?q=43.312183,+-73.643995(26820)&iwloc=A&hl=en\"> mufon case (26820) map </A>","Region":"New York","Object Flight Path":"Undisclosed","Weather Factors":"Unknown"}