{"Case Number":"26829","Source":"MUFON","Log Number":"US-12022010-0017","files":["/var/www/straped/mufon/html2text/26829.html.txt","/var/www/straped/mufon/org/26829.html"],"Tags":"City","Object Features":"Undisclosed","Date of the Event":"10/23/2010 06:30 UTC","Region":"Nebraska","Object Shape":"Triangle","Summary":"saw multi-colored object w/3 white lights in triangle & 1 red ctr. light blinking","Longitude":"-95.993518","Weather Factors":"Unknown","City":"Omaha","Viewing Distance":"Unknown","divs":["sighting details on saturday evening, october 23rd, 2010 i, *(wit's name deleted--cms\\sg), was heading west in a vehicle on center st. just east of 69th st. when i noticed a multi-colored object approximately a half of a mile south of center st. at an altitude of approximately 500 feet. the object was heading east\\southeastly towards offutt air force base in bellevue, ne which is a suburb of omaha, ne. the object was only multi-colored until i noticed the underside of the object had three(3) bright white lights in a triangular formation with a center red blinking or strobing light. that's when i recognized the object as a typical \"flying triangle.\" then i noticed the \"front leading white light\" dimmed out. i wasn't able to continue to observe the object, because i had to keep my eyes on the road. the object didn't appear to be like anything i had seen before due to the array of colored lights. i liken it to a christmas tree on its side or a christmas reef \"floating through the air.\" it did not make a sound. i made sure i did not have a problem hearing it, because i turned off the radio and rolled down the window in the vehicle. it appeared to be just \"gliding\" along. the object didn't produce any sound that i could detect even though it was just approximately a half mile away at approximately 500 feet in altitude. i have seen multi-colored flying objects before hand and since then, but that was the only occasion that i was able to identify the object as a known\\classified u.a.p. due to the fact of the \"flying triangle\" signature."],"Sighting Duration":"00:01:00","Date Submitted":"12/02/2010 08:16 UTC","Latitude":"41.260843","trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around October 23rd 2010"],"Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.260843,+-95.993518(26829)&iwloc=A&hl=en\"> mufon case (26829) map </A>","Object Flight Path":"Undisclosed"}