{"Sighting Duration":"Undisclosed","Tags":"City","Region":"Maryland","Object Flight Path":"Hovering then path","Country":"United States","City":"Lanham-Seabrook","Object Features":"Window(s)","Weather Factors":"Unknown","Disposition":"Unknown","Viewing Distance":"21-100 Feet","Date Submitted":"12/02/2010 11:20 UTC","Summary":"Rectagular, rotating lights all around, blinking light on top & bottom, steel girder like legs.","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=38.967778,+-76.848611(26832)&iwloc=A&hl=en\"> mufon case (26832) map </A>","Log Number":"US-12022010-0020","trends":["There has been one other sighting in Lanham-Seabrook","There were no other sightings in Lanham-Seabrook on or around September 19th 1975"],"Source":"MUFON","Case Number":"26832","Date of the Event":"09/19/1975 08:40 UTC","Latitude":"38.967778","files":["/var/www/straped/mufon/html2text/26832.html.txt","/var/www/straped/mufon/org/26832.html"],"divs":["sighting detailsnoticed rectangular light in sky as i was driving on washington beltway toward ardmoor rd. saw this light 3 different times in 3 different places. thought at first it was an airplane. afterthought a ufo, but laughed it off in my mind. i drove down ardmoor\\ardwick road heading east(which was a secluded country road at that time). when i reached the end to turn right (head south) onto lottsford\\vista road i looked up and saw a rectagular craft hovering over the tree tops, which was to my left (driver's side of car). hovering over the treetops at the enterprise golf course. it was the size of a football field. lights were rotating around the rectagular craft and there was a blinking light on top and one of the bottom blinking simultaeously. i had my 5 year son with me at the time and asked him if he was seeing the same thing as i. to this day he remembers it. i heard no engine sounds as my car window was open because i reached my head out to get a better look. my son said he saw figures looking out of a window, i did not see them. as i began to move forward the craft began to move with me and it was at that time i began to panic and drive faster. the road led under a tunnel of trees and when i reached that point the craft swiftly and quietly disappeared in a matter of seconds over the trees. at the time my boyfriend subscribed to the nicap newsletter. when he received the september issue it has an article in it that stated 2 other people spotted the same craft and i did that same night in p.g. county. i would like to know if you still have that article? additionally, the next day i called andrews afb and asked about the project blue book that i wanted to report seeing a strange craft and they said they no longer accepted ufo calls and that the project blue book was closed. i asked if they had such an aircraft that could hover and they said yes they did, however they did not describe the same as the one i saw."],"Longitude":"-76.848611"}