{"Disposition":"Unresolved","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Latitude":"26.705621","Date of the Event":"11/30/1978 12:00 UTC","Source":"MUFON","City":"Palm Beach","divs":["Sighting DetailsIt was approx 1979, as I remember that I was only about 5 because I hadnt asthen started school. Me and my family were on holidays at the Gold CoastAustralia and standing in a take away food store waiting for our order. Beingfrom a country town, I was amazed by jumbo jets that would frequently fly overhead. Every time I would hear a jet flying over, I would run out onto thefootpath and look at it flying over.I did this for a while, hearing the jet sound and running out to look at it. Then after about the 3rd jet, I heard what I assumed was to be another jet, butwas amazed to see a disc floating just above the road while traffic still drovepast. This was on a very busy road, so I am sure there must have been otherwitnesses. What amazed me was that it was just hovering right there over theroad no more than 20ft and almost directly above me. I was in shock and didntthink to yell out to everyone in the shop to come out and look.One thing I noticed that, even at that young age struck me as peculiar was themulti-coloured lights all around the craft. They appeared to be standard screwin type incandescent globes we are all familiar with. I remember thinking Wow,THEY use the same types of lights as us.This very fact has led many to tell me that I must have been mistaken that itwasnt a UFO, that it was a helicopter or something similar. I KNOW WHAT I SAWand it wasnt a helicopter or anything similar.I could see inside through the windows in the top of the craft and it was verybright white. Like it may be lit by flourescent lighting in a perfect whiteroom. I could not see any inhabitants in the craft.Perhaps it was because I was so young, I dont know, but I did not feel any fear. I was in awe and shocked, but very calm.Probably the strangest thing that I remember about the whole incident, andsometimes disturbs me, is that it made absolutely no sound whatsoever as itgently drifted out of sight over the pacific ocean. It is odd because it madethe sound of a jet on its arrival, and no sound leaving. It was like theywanted me to come out and see them. It is like they knew that I was coming outwhen a jet noise appeared.As it neared the horizon on its departure, I ran into the shop telling everyoneto quicky come outside to see the UFO. It was long gone and I felt quiteembarrased.PS, I was forced to pu"],"Region":"Florida","Country":"United States","Date Submitted":"11/30/1978 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.705621,+-80.03643(2683)&iwloc=A&hl=en\"> mufon case (2683) map </A>","Object Features":"Dome, Window(s)","Summary":"A long time ago I saw a UFO up close.","trends":["There have been 5 other sightings in Palm Beach","There were no other sightings in Palm Beach on or around November 30th 1978"],"Case Number":"2683","Log Number":"","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/2683.html.txt","/var/www/straped/mufon/org/2683.html"],"Sighting Duration":"00:05:00","Object Shape":"Disc","Tags":"City","Longitude":"-80.03643"}