{"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/26836.html.txt","/var/www/straped/mufon/org/26836.html"],"Disposition":"Unknown","Case Number":"26836","Date of the Event":"12/03/2010 03:15 UTC","Latitude":"33.737051","map":"<A HREF = \"http://maps.google.com/maps?q=33.737051,+-85.032445(26836)&iwloc=A&hl=en\"> mufon case (26836) map </A>","Log Number":"US-12032010-0004","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","Sighting Duration":"00:06:00","Object Features":"Unknown","City":"Temple","trends":["There have been 3 other sightings in Temple","There were no other sightings in Temple on or around December 3rd 2010"],"Date Submitted":"12/03/2010 10:41 UTC","Region":"Georgia","Object Flight Path":"Straight-line path","Summary":"Very shinny craft moving very slow","Tags":"City","Longitude":"-85.032445","Country":"United States","Source":"MUFON","divs":["sighting detailsi had went outside on my back deck to bring in some flashlight batteries that i had put out to let the sun recharge.( to the people that don't know that trick,the sun will recharge them if they aren't totally dead.) as i was getting the batteries i saw a very shiny craft(looked to be v shaped) moving very slow. i stood there looking in amazement a the thing for about two minutes. it was bigger than a 747 jumbo jet. it had no noise. it was about 1000 to 1500 feet high in the sky. probably about 3\\4 to a mile east of us. there were no clouds at the time. i went into the house to tell my wife that she had to come out and see what i was seeing. we both went back out and the craft had moved just a little ways in the sky. she watched it with me for another 2 minuets and i said i was going in to get my binoculars to get a better look. when i came back out i focused on it for just a second when my wife and i heard a jet coming fairly low from behind us. we both turned around to see the jet. a popular tree blocked our view. we then turned back around and the craft was gone. their was plenty of sky for us to have seen it after we had turned back around.it was so shiny it looked like highly polished chrome or silver. i spotted night time ufo's several times this year, but this is my first daytime experience.i don't have any pictures because my camera wasn't working. one thing else, it was so quite you could here a pin drop.( no birds, dogs, anything."]}