{"Object Flight Path":"Other","Case Number":"26834","files":["/var/www/straped/mufon/html2text/26834.html.txt","/var/www/straped/mufon/org/26834.html"],"Date of the Event":"12/03/2010 11:30 UTC","Sighting Duration":"00:05:00","Country":"United States","Log Number":"US-12032010-0002","trends":["There have been 9 other sightings in Morrison","There were no other sightings in Morrison on or around December 3rd 2010"],"Tags":"City","Disposition":"Unresolved","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Longitude":"-105.18548","map":"<A HREF = \"http://maps.google.com/maps?q=39.654719,+-105.18548(26834)&iwloc=A&hl=en\"> mufon case (26834) map </A>","Object Shape":"Flash, Sphere, Other, Unknown","Weather Factors":"Unknown","Date Submitted":"12/03/2010 03:32 UTC","Latitude":"39.654719","City":"Morrison","Region":"Colorado","Summary":"5 blue balls of light flash in back yard followed by something inside the house","Source":"MUFON","divs":["Sighting DetailsMy parents are out of town for the week so they asked me to house sit for them, so I headed up to their house in the mountains with my dog (extremely smart Australian Shepard) after work at around 10:00 pm. At 11:30 I went into the kitchen to make something to eat and as I was washing my hands at the sink I saw 2 flashes of blue light through the sliding glass door in the back yard out of the corner of my eye. I didnt think much of it and went over to the stove. So now Im facing the sliding glass window and as I look up I see another flash except this time its in my direct vision and my dog sees it too, perks her ears up and starts growling. As I stand there, kind of in shock, I see 2 more flashes all within 15-20 seconds of each other. So as my dog and I are standing there staring out the into the darkness, after what felt like maybe a minute after seeing the lights, both my dog and I hear a loud bang come from one of the bedrooms upstairs. I immediately call 911 and head straight into my mom and dads room to grab a gun. Dispatch tells me to stay in the room and hide somewhere to wait for the police to arrive and not even 30 seconds later I hear the police cars pull into the driveway so I put the gun away and crawl out the window to meet them (yes I grabbed my dog too). The officers searched the house and the surrounding area for a good 20 minutes and find nothing. Here's where it gets weird, as Im telling one of the officers about the lights 2 other officers, who were standing over at thier car talking to each other, immediatley walk over to me and start asking me questions about them, what did they look like, what color were they, what shape were they, ect... So I ask the officers why they're so interested and they tell me that they have had numerous calls throughout the past year regarding the exact same thing, and apparently another officer (who wasnt there) had seen them recently too. Now keep in mind that this area is in the Denver metro foothills where every house sits on about and acre of land and in my parents case, the nearest house is over a mile away and the back yard is litteraly a forest. But its now 1:05 am as Im writing this and I havent heard or seen a single thing since the police arrived about an hour ago. What I thought the lights were at first, was that it was a flashlight from someone trespassing, then once I heard the bang I thought for sure that they had broken in. Only when I saw that look on the officers face when I was describing it did I realize this was something else. Thinking back to it now it doesnt make any sense that it would be a flashlight because when the flashes would occur it had no motion, the light was solid. The lights would just shine in place for a second or two, then go away. And the bang sound, I really dont know how to describe. It was as if someone dropped a heavy box or something in one of the bedrooms, and to be honest Im still to affraid to go in there and see if anything is out of place. I dont know why I even got on here and wrote this, I just remembered seeing this organization on 9news a long time ago and thought that this might interest you. Anyways, that was my experience tonight."]}