{"Tags":"City","Log Number":"US-12032010-0008","Disposition":"Unresolved","Object Flight Path":"Path with directional change","Summary":"glowing and spinning, size of a softball or a little bigger","Viewing Distance":"20 Feet or Less","Latitude":"36.606285","Weather Factors":"Unknown","Longitude":"-82.184397","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.606285,+-82.184397(26840)&iwloc=A&hl=en\"> mufon case (26840) map </A>","City":"Bristol","Object Shape":"Circle, Oval","Case Number":"26840","Region":"Virginia","divs":["sighting detailsthis was on a warm summers night in the city of bristol, virginia. my uncle and i were sitting on a picnic table at my grandmothers house. her property sits on a bank that overlooks the city street about 15 to 20 feet below. the picnic table was about 20 feet from the street. all of a sudden out of nowhere we saw this ball come up the street and stopped at eye level and was center of the street right in front of us. it moved back and forward about three times, spinning the whole time and then shot off at a high rate of speed, went about 200 yards and shot to the right over a patch of wooded area and was gone. i asked him if we should call the police or someone and he said.\"what are we gonna tell them\". people will think we are crazy. so we never mentioned it. a couple of weeks ago a was talking to a couple of young guys and asked if they believed in ufo's. they looked at each other in surprise and described a similiar sighting between bristol, virginia and abingdon, virgina a few day earlier. i just wondered if anything like this has ever been reported. again, the ball was spinning very fast and traveled at a high rate of speed when it took off. no sound at all.thank you, [name edited from narrative\\cms\\tg]"],"Object Features":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26840.html.txt","/var/www/straped/mufon/org/26840.html"],"Date of the Event":"06/30/1987 09:30 UTC","trends":["There have been 5 other sightings in Bristol","There were no other sightings in Bristol on or around June 30th 1987"],"Country":"United States","Date Submitted":"12/03/2010 08:41 UTC"}