{"Weather Factors":"None","City":"Savannah","Latitude":"32.091131","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Region":"Georgia","Country":"United States","trends":["There have been 20 other sightings in Savannah","There were no other sightings in Savannah on or around September 18th 1991"],"Tags":"City","divs":["Sighting DetailsIn 1991 myself and 2 friends were standing outside of my house at around 9 P.M. Directly in front of my home is a street that goes around to make a circle and come back out further down but still onto my street again and at the entrance in front of my home is a streetlight. As I and my friends were talking away I noticed over my home a massive black cylinder shaped something moving very slow over my home, I was only able to make it out because it was darker than the sky behind it,there were no lights on it, no sound of an engine but because it was probably only 250-300 ft. above us I could hear the sound of the wind pushing off of its rounded end.To give it an est. speed I would say it was around 15 mph. As it passed above the streetlight in front of my home (at this point we were in the street watching it amazed) I saw what I interpreted to be the glint of light off of a metal surface. My friends and I tried to keep following it but it was on a path that was leading away and over the homes in the middle of the circle street and when we got to where we thought it would emerge it never showed again. We did not report this. The size of this thing I would est. to be as long and as wide and half again(maybe more) as a city bus, rounded on both ends like a tube, not like a submarine or anything exaggerated like that. It was very unremarkable in the way of UFOs I guess but it sure made an impact on me."],"Date of the Event":"09/18/1991 12:00 UTC","Object Features":"None","Disposition":"Insufficient Data","Source":"MUFON","Longitude":"-81.094174","Sighting Duration":"Undisclosed","Object Shape":"Cylinder","Case Number":"26847","Summary":"An unknown black something flew over my home","files":["/var/www/straped/mufon/html2text/26847.html.txt","/var/www/straped/mufon/org/26847.html"],"Date Submitted":"12/04/2010 05:05 UTC","Log Number":"US-12042010-0006","map":"<A HREF = \"http://maps.google.com/maps?q=32.091131,+-81.094174(26847)&iwloc=A&hl=en\"> mufon case (26847) map </A>"}