{"divs":["Sighting DetailsOn 2010 Dec 03 About 930 PM While enjoying a back yard camp fire in Thousand Oaks California near the 23Fwy at Avenida De Los Flores we noticed a light in the eastern sky which appeared to be the same color and brightness as a yellowish fog street light. It was flying toward us (west ward) it then zig-zagged then flew straight again, then zig-zagged again. It almost appeared to be a flame fired toy balloon but it was too bright and with the speed and the sudden turns any flame would have been extinguished. It made no noise at all and in about 2 minutes it suddenly gained altitude faded to a red dot then vanished. I live under the flight path to LAX and this light flew across the flight path around or just below the altitude the jumbo jets fly. The clouds were moving slowly, there was very little wind and there were no aircraft seen in the area. Using google earth and measuring from the mountain it appeared to fly over it seemed to travel about 5.5 miles in about the 2 minutes we observed it. I think it could have been what is known as an earthquake light. There were power lines under the center of it's path but it was very high in comparison to the lines. If it was a flame fired toy balloon the person who set it aloft could have started a brush fire."],"Object Shape":"Fireball, Sphere","Object Flight Path":"Straight-line path,Other","City":"Thousand Oaks","Object Features":"None","Latitude":"34.171881","Summary":"Fireball like ufo seen zigzagging flying straight then zigzagging again","Sighting Duration":"Undisclosed","Case Number":"26848","Region":"California","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Date of the Event":"12/03/2010 09:31 UTC","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26848.html.txt","/var/www/straped/mufon/org/26848.html"],"Longitude":"-118.830194","Weather Factors":"None","Log Number":"US-12042010-0007","trends":["There have been 17 other sightings in Thousand Oaks","There were no other sightings in Thousand Oaks on or around December 3rd 2010"],"Date Submitted":"12/04/2010 07:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.171881,+-118.830194(26848)&iwloc=A&hl=en\"> mufon case (26848) map </A>","Country":"United States"}