{"Source":"MUFON","Object Shape":"Oval, Triangle, Other","Region":"Missouri","Log Number":"US-12042010-0008","Latitude":"38.634792","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around December 2nd 2010"],"Object Flight Path":"Undisclosed","Tags":"City","Case Number":"26849","Object Features":"Undisclosed","Date Submitted":"12/04/2010 07:40 UTC","City":"St Louis","Sighting Duration":"00:05:00","Date of the Event":"12/02/2010 06:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.634792,+-90.194314(26849)&iwloc=A&hl=en\"> mufon case (26849) map </A>","Longitude":"-90.194314","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsLeaving my house going to the local drive-thru ATM in my car, I immediately noticed a triangle of lights as I started my car. When I looked up it was right in front of me, over the cemetery across the street from the street I was parked on. The \"plane\" was moving away from me going slightly right but banking from the left, two steady white lights (a right white light diagonally higher than the left) and a blinking red light, not in line, between them. The three lights were about the size of a nickel at arms length in relative size. I live in south St. Louis and commercial flights often fly through my airspace, most at lower levels, but few as low and in the direction this was going. Though peculiar, I dismissed it as a plane. I then noticed a very bright white light peripherally to my right, a thick line a distance away and closer to the horizon. This object was at about 20 degrees and further away, the \"plane\" was closer and at about 40 degrees. I was parked at the end of my street and I pulled out and took a right, towards the white line light. It was now appearing to be the relative length of a thumbtack moving from my left to right, where it would cross in front of me in less than a half-minute if we both continued as we where. It then suddenly changed direction, now going perpendicular in direction to where it was going and the lighting \"changed,\" but I attributed that to what I figured was the different orientation and direction the object was now traveling. It now appeared to have a distinct round larger white light in its front travel while coming in my direction, with a smaller round white light in the back, both steady, and a smaller blinking red light between them and slightly higher and closer to the front light of the \"helicopter.\" I guessed this to be a helicopter for how very fast and sharply it changed direction, and figured I now saw the front headlight with a back white light at the back rotor and a red light at the main rotor. It was getting closer and and the white lights suddenly started dimming, the front light a lot and the back a little. It then suddenly sharply changed direction again and started moving relatively NW of my direction, now appearing in the same configuration as the \"plane\" I saw starting my car, two steady white lights with a blinking red light between them forming a short-height triangle of light in the direction each was traveling. Just before I got to the ATM I came to a clearer view from the trees and buildings of the relatively NW direction this object was slowly moving away in, seeming to slowly ascend also. I then suddenly saw a flash of white light to the bottom left of the object, the flash at about 15 degrees, the \"helicopter\" object about 30. I then could see the other object was another triangle of lights, seemingly further away in the distance, the relative size of an aspirin, and the lights were more faint for distance. I figured it was the first \"plane\" I'd seen as that was the direction it was heading in when I last saw it, but it had gotten to a lower relative height in the sky as it was flying away in a relatively NW direction and became obscured by the buildings and trees. When I got to the ATM I could clearly see the two triangles when I looked to my right out the car window using the ATM, lined up in a clearing left of a tree. At first they seemed to be almost one over the other at 15 and 30 degrees in height each. When next I looked, they were distinctly apart, diagonal from each other. When next I looked over, they were diagonally apart again, but had switched the sides they where on when I last looked! At that point I knew I was seeing unconventional craft for sure, nothing I'm aware of can move that distance across the sky in a perpendicular direction to their direction of travel, literally just in the moment of several seconds each time!! I left the ATM and turned back my direction and didn't see them anymore, but it seemed that the \"plane\" UFO had also gone backwards when it last switched sides, where the \"plane\" object had become a larger relative size to the same size as the \"helicopter\" object!!!"],"files":["/var/www/straped/mufon/html2text/26849.html.txt","/var/www/straped/mufon/org/26849.html"],"Weather Factors":"Unknown","Disposition":"Hoax","Summary":"Two Triangles move and change unconventionally over St. Louis"}