{"Disposition":"Unknown","Longitude":"-91.996466","Object Features":"None","Date of the Event":"12/03/2010 07:30 UTC","Summary":"3 lights as stars in the form of a triangle","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.236081,+-91.996466(26845)&iwloc=A&hl=en\"> mufon case (26845) map </A>","Sighting Duration":"Undisclosed","Latitude":"34.236081","files":["/var/www/straped/mufon/html2text/26845.html.txt","/var/www/straped/mufon/org/26845.html"],"Object Shape":"Star-like, Triangle","Case Number":"26845","trends":["There have been 3 other sightings in Pine Bluff","There were no other sightings in Pine Bluff on or around December 3rd 2010"],"divs":["Sighting DetailsEvery evening I step outside to have a cigarette. I keep a pair of binoculars at the garage door so I can check out the moon, stars and any aircraft flying over. Last night about 7:30 I went out the side door of my garage and lit a cigarette. I was facing southwest. I noticed blinking lights moving away from me at high altitude. I grabbed my binoculars to have a look. Looking at about a 45 degree angle I had had what I believe is Venus in my view. As I looked at the planet, what appeared to be 3 stars in unison forming a triangle moved through my field of view very quickly! I did not have the aircraft in my view at the time. I pulled the binoculars away to look with my eyes, I didn't see it. I again looked with the binoculars, scanning the sky in the direction of the movement, I saw nothing. In the brief time the object was in my view I could not make out any edges or shape other than the 3 lights formed a triangle. I got excited about what I had seen and went back in the house to tell my wife. She wasn't as excited... :) The only things I can think to add is that the sky was clear and the object had to be very large if it was one object, also there was no noise."],"Tags":"City","Source":"MUFON","City":"Pine Bluff","Country":"United States","Weather Factors":"Unknown","Region":"Arkansas","Object Flight Path":"Straight-line path","Date Submitted":"12/04/2010 01:46 UTC","Log Number":"US-12042010-0004"}