{"Country":"United States","Summary":"Pulsating, blue- haloed sphere","Region":"Colorado","files":["/var/www/straped/mufon/html2text/2684.html.txt","/var/www/straped/mufon/org/2684.html"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"2684","Log Number":"","Object Flight Path":"Straight-line path","Longitude":"-104.044403","City":"Deer Trail","Latitude":"39.614982","Object Shape":"Sphere","Source":"MUFON","trends":["There have been 2 other sightings in Deer Trail","There were no other sightings in Deer Trail on or around August 5th 2003"],"Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=39.614982,+-104.044403(2684)&iwloc=A&hl=en\"> mufon case (2684) map </A>","Tags":"City","Date Submitted":"08/05/2003 01:30 UTC","divs":["Sighting Details The date I gave is accurate to within a day or two. I wanted to clarify that first. I live in a very rural area with only a few houses nearby. The closest house is 300 yards or so to the east. The other houses are to the north starting at about the same distance of 300 or so yards, and consistantly spaced as I said to the north for about 1.5 miles. To the west there a few houses, the nearest being 1 mile away. To the south there is nothing but open pasture or praire with many revenes, gradual hills and dry creeks. I guess the nearest house to the south is probably 8 miles as the crow flies, and not at all visible, with the hilly countour of the land, from my house. In esscence it is desolate back there and dark at night.I was home alone the night that we are speaking of and I had eaten some dinnerand layed down on the couch to watch some t.v., as my dogs, all four of them,crashed out on the floor next to me. I dozed off at about 1030 p.m. or so, andawoke shortly after and turned the t.v. off and fell right back to sleep. Allfour dogs were sound asleep on the floor in the living room beside me.Some time later, around 130 a.m., I was awakened by my dogs making a few whinysounding short barks and scurrying around the living room. I thought that theymight need to go outside to relieve their bladders, so I got up and put on myshoes to take them outside. I stood up and before I could even take one step,all of the dogs ran around the couch and into my room hiding in the closet amdbehind my bed as they do when it storms or is very windy. I started to followthem down the hall to my room when I noticed to my left out the front door, adim blue haze coming from the south. I grabbed my binoculars not knowing whatwould be causing the light as there are no houses or roads of any kind to thesouth, from which the light was being projected. I opened the fron"],"Weather Factors":"Unknown","Date of the Event":"08/05/2003 01:30 UTC","Sighting Duration":"01:59:00","Disposition":"Insufficient Data"}