{"Summary":"Silver dots and stationary \"streak\" like objects in sky","divs":["sighting detailsat sunset on wed. dec. 1 i noticed silvery objects in the sky as the sun was going down. i did see an airplane with its contrail flying as it normally would with the trail becoming longer and eventually fading. but these silvery streaks seemed to hover or move very, very slowly and no trail formed. then a third silver object appeared but it was more of a dot\\star-like than thin silvery thing. no trail appeared with the third object either. i watched for over a half hour. for the longest time they seemed to hover but eventually i guess they were moving so slowly that i couldn't really detect movment but realized that they were moving in a northern (i think) direction. it was about 5:15 pm when i first spotted the objects. they were west\\north west from me. i think over hudson, port richey or maybe even the gulf of mexico 'cause i really couldn't tell exactly how far away the objects were. i did film video and take pictures. (but i'm not sure about loading a large video file with this report. i can send to you if contacted for the footage. i only included 2 pics with this report.) i looked in the sky at the same time the following day and didn't see anything like the previous night. i waited to submit this report because i recently submitted a previous report re: a thanksgiving night sighting and i didn't want to seem like i was reporting every damned thing i see in the sky around here. but then i saw a report from someone else in the general area explaining something to similar to mine so i decided to submit."],"Tags":"City","Country":"United States","Weather Factors":"Does Not Apply","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/26858.html.txt","/var/www/straped/mufon/more/26858_submitter_file1__OFU006.JPG","/var/www/straped/mufon/more/26858_submitter_file2__OFU011.JPG","/var/www/straped/mufon/org/26858.html"],"trends":["There have been 8 other sightings in Land O' Lakes","There were no other sightings in Land O' Lakes on or around December 1st 2010","This sighting has never been favorited.",""],"Date of the Event":"12/01/2010 05:20 UTC","Region":"Florida","City":"Land O' Lakes","map":"<A HREF = \"http://maps.google.com/maps?q=28.308533,+-82.733635(26858)&iwloc=A&hl=en\"> mufon case (26858) map </A>","Object Features":"None","Case Number":"26858","Date Submitted":"12/05/2010 09:43 UTC","Object Shape":"Unknown","Longitude":"-82.733635","Source":"MUFON","Disposition":"Insufficient Data","Log Number":"US-12052010-0004","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"28.308533"}