{"Date of the Event":"12/03/2010 05:45 UTC","Date Submitted":"12/04/2010 10:58 UTC","files":["/var/www/straped/mufon/html2text/26854.html.txt","/var/www/straped/mufon/more/26854_submitter_file1__102_1681.JPG","/var/www/straped/mufon/more/26854_submitter_file2__102_1682.JPG","/var/www/straped/mufon/org/26854.html"],"Object Features":"Patterned Surface","Summary":"Ufo hovering with 2 other ufos checking it out","Object Shape":"Circle, Other","Object Flight Path":"Stationary,Hovering then path,Other","City":"St Helens","Viewing Distance":"101-500 Feet, Over 1 Mile","Country":"United States","Tags":"City","Weather Factors":"Unknown","Region":"Oregon","Case Number":"26854","map":"<A HREF = \"http://maps.google.com/maps?q=45.868774,+-122.811054(26854)&iwloc=A&hl=en\"> mufon case (26854) map </A>","Log Number":"US-12042010-0013","Disposition":"Unknown","trends":["There have been 2 other sightings in St Helens","There were no other sightings in St Helens on or around December 3rd 2010","This sighting has never been favorited.",""],"divs":["Sighting DetailsAt 5:45 PST I was sitting on my back porch and noticed what is known as a chemtrail and a light making weird blinks below it as it slowly was rising i decided to get my camera and film it after 2 min of film i decided to go back inside when 2 red lights come from the south toward the objects at super speed i turned back on the camera and was filmin and looking at the event with my regualr sight as the camera filmed. About 5 seconds after the 2 red lights aproached the object the bottom red light started flying toward me and went right over my house it was circle in shape with about 60-80 red lights in a circular motion on the bottom of the craft and made a 180 turn and headed back the way it came. I ran inside to see the video immediately and the film with the red lights had been erased but the film with the other light was still there and the pic. I was really irreated it was not there and looked at my cellphone and it had been turned off also. Also when the craft went my I noticed a really odd smell almost bitter I have never smelled anything like it and it didnt last but about 10 seconds."],"Latitude":"45.868774","Sighting Duration":"Undisclosed","Longitude":"-122.811054","Source":"MUFON"}