{"trends":["There have been 28 other sightings in Escondido","There were no other sightings in Escondido on or around December 3rd 2010"],"divs":["Sighting DetailsMy fiancee and I went out to the garage to smoke a cigarette and when we sat down noticed a very bright light flashing in the distance. It looked like a very bright low star at 1st glance. It was very bright and flashing red, green, blue, yellow and orange. I am a novice astronomer and knew at once this was not a star, planet, comet or meteor or any thing I have ever seen flying in this area. It was totally quite and the night was very clear and we could hear no noise from the object. We could see that it was rotating fairly quickly. It seemed to be disk or round shaped. The colors it flashed were not steady or timed and in no pattern that we could make out. It hovered for 5 mins. and then suddenly moved away from us at an extremely high rate of speed. It disappeared to the east away from us and was gone. It had to be moving at several hundred miles an hour from a complete motionless hover. It seemed to be rather large and was about 1 to 2 miles from us. We both thought it was amazing and incredible. We were both excited and talked about it for awhile. During the sighting I was totally captivated by it but not scared just very curious. Later that night I was a little scared about what we had seen and how close it was to our house."],"Weather Factors":"None","Object Features":"Unknown","Object Flight Path":"Hovering then path","Date of the Event":"12/03/2010 08:57 UTC","Longitude":"-117.082131","Tags":"City","Region":"California","Sighting Duration":"Undisclosed","Disposition":"IFO","Latitude":"33.121477","files":["/var/www/straped/mufon/html2text/26853.html.txt","/var/www/straped/mufon/org/26853.html"],"Summary":"object with bright flashing/pulsing multi color lights hovered then left and very high rate of speed.","Country":"United States","Viewing Distance":"Over One Mile","Source":"MUFON","City":"Escondido","Object Shape":"Disc, Flash","Date Submitted":"12/04/2010 11:04 UTC","Case Number":"26853","Log Number":"US-12042010-0012","map":"<A HREF = \"http://maps.google.com/maps?q=33.121477,+-117.082131(26853)&iwloc=A&hl=en\"> mufon case (26853) map </A>"}