{"City":"Aurora","Tags":"City","files":["/var/www/straped/mufon/html2text/26862.html.txt","/var/www/straped/mufon/org/26862.html"],"Object Shape":"Triangle","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around October 20th 1992"],"Date Submitted":"12/05/2010 02:22 UTC","Source":"MUFON","Longitude":"-104.83192","Country":"United States","Region":"Colorado","divs":["Sighting DetailsI was taking my daughter to my brothers house (she walks to school from there) and then on to work at about 5:30 in the morning. I was driving east on 13th avenue, when I noticed a dark shape that was very low and just ahead of me at the corner. At first, I thought it was a small plane and was it was going to crash into the school(Elkhard Elementary). As I pulled over to the curb, I realized it was hovering, so it could not be a plane. So then I thought, oh its a helicopter. I was curious as to why (what I thought was a helicopter) was so low. So I rolled down my window to get a better look and realized there were no lights on the object. I got scared when I also realized that it was totally silent. Helicopters are noisy. The object was black in color and triagular shaped. There were no lights and it didn't make a sound. It was about 15 feet above the street. As, I was leaving, the object started to drift upward and head northwest very slowly. I saw it at the corner of Thirteen avenue and Dearborn street in Aurora, Colorado. I have told a very few people what I saw, and I have never talked about it again. When I first saw it I thought it was a small plane. I really thought it was going to crash into the school so I stopped and pulled over to the curb. When I noticed it was not moving, just hovering, that is when I thought it was a helicopter. As I rolled down my window to get a better look is when I realized it did not make a sound and no lights. I got very nervous and left."],"Object Flight Path":"Other","Weather Factors":"Unknown","Case Number":"26862","Latitude":"39.730582","Summary":"I saw a black triangle shape, about 15 feet above the street, not lights, no sounds.","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=39.730582,+-104.83192(26862)&iwloc=A&hl=en\"> mufon case (26862) map </A>","Date of the Event":"10/20/1992 05:15 UTC","Log Number":"US-12052010-0008","Object Features":"None","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data"}