{"map":"<A HREF = \"http://maps.google.com/maps?q=35.241524,+-106.661094(26864)&iwloc=A&hl=en\"> mufon case (26864) map </A>","trends":["There have been 8 other sightings in Rio Rancho","There were no other sightings in Rio Rancho on or around December 5th 2010","This sighting has never been favorited.",""],"Weather Factors":"None","Latitude":"35.241524","Log Number":"US-12052010-0010","Viewing Distance":"Unknown","Source":"MUFON","divs":["sighting detailsabout 3:45 or 4:00 a.m. on 12\\5\\2010 i opened the sliding glass door on the north side of our house to let my dogs out to relieve themselves and out of the corner of my right eye i saw a bright white light so i turned to face it and observed what appeared to be a very bright, circular white light above the horizon of the sandia mtns. in the background of sky there are in fact two bright yellowish lights that are visable every night; both on the crest of the sandias and apart from one another and this light was \"centered\" and above them and the sight of it appeared to be a triangle with the yellow lights of sandia crest on the left and the light of the sandia peak tram house on the right forming the \"base\" of the triangle along the sandia crest and the bright light forming the peak of the triangle at the top. i started to dismiss my initial sighting of the light as the moment when an aircraft turned on it's landing lights and i must have seen it as it was moving towards me.... so i waited to see if it would turn toward the south to albuquerque international or westward to double eagle. it seemed peculiar to me that it was taking entirely too long for any \"aircraft\" to reach me; the night was perfectly quiet, there was no jet engine noise or prop noise, there were no strobe lights or red and green wingtip lights, no automobile noises to muffle the sounds that should have been there. i looked closely at the white light and observed that it seemed to flicker somewhat along the edges and \"wobble\" side to side and up and down, but it certainly was not getting any closer to my location... it was just up in the sky shining brightly... hovering as it were and then as i watched the light it went out! it just vanished completely from my sight! the night was still perfectly quiet and there were no sounds, and there were no strobes or red and green wingtip lights that i could observe, and no competing automobile noises as i listened for some jet engine noise or propellers beating the air like a helicopter or airplane would. there was no sound. i was stumped. i didn't know what i had seen and i certainly couldn't identify it either. as my dogs were coming back in i couldn't help looking toward the sandia mountains for one final look and just as suddenly as it had disappeared, it reappeared in the very same area it was before!! wow!! it was there, i didn't imagine it. where had it gone and where did it come from? it was now clear to me that there was a very real, very curious event indeed going on and i was a witness to it. i observed the same behavior as before but then as i watched the light rotated from pointing straight toward me to my left and faced to the north. it remained there and looked like a cone. a cone of white light with the smaller end facing south and the wider end facing north. i am not sure how long it remained this way, it got dimmer and bright again and again and as i was observing the \"cone\" of bright light the entire cone rotated back to it's left and faced westward again. it continued to brighten and dim somewhat for several minutes i started to thik it was similiar to the lights over phoenix, but only one light here, and then, as i watched, it just went off like someone flipped a switch; and as i looked at the place where the incredibly bright white light used to be, there was now what appeared to be a glowing \"ember\" that was colored yellow and grew steadily smaller and smaller until it finally disappeared completely and i saw it no more."],"City":"Rio Rancho","Region":"New Mexico","Longitude":"-106.661094","Disposition":"Unknown","Case Number":"26864","Country":"United States","Sighting Duration":"00:40:00","Tags":"City","Object Shape":"Cone, Circle, Star-like","Object Flight Path":"Stationary","Date Submitted":"12/05/2010 06:07 UTC","files":["/var/www/straped/mufon/html2text/26864.html.txt","/var/www/straped/mufon/more/26864_submitter_file1__SandiaMountainBrightLight.jpg","/var/www/straped/mufon/org/26864.html"],"Summary":"While letting my dogs outside through my patio door, I observed a brilliant white light that appeared to be above the NE heights of Albuquerque","Object Features":"Unknown","Date of the Event":"12/05/2010 12:00 UTC"}