{"Tags":"City","Date of the Event":"11/12/2010 11:19 UTC","Object Flight Path":"Undisclosed","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=36.774749,+-76.281983(26866)&iwloc=A&hl=en\"> mufon case (26866) map </A>","Weather Factors":"Unknown","Longitude":"-76.281983","Summary":"lights in the water by chesapeake bridge and numerous dead birds on bridge.","trends":["There have been 8 other sightings in Chesapeake","There were no other sightings in Chesapeake on or around November 12th 2010"],"divs":["Sighting DetailsOn nov 12 2010 around 11:15pm, my fiancee and I were on our way to nj and decided to take rt 13 up. On the way she had noticed while driving across the chesapeKe bridge an unusual amout of dead pelicans on the bridge. Yes pelicans. I assumed maybe they were hit by cars or something else, that was until I began to notice something very strange. All of the dead pelicans were exactly about a quarter from each other all lined up on the left side of the bridge with other birds around the body. Scary thing was... The bodies were not mangled at all. Almost like they just fell from the sky and were strategically placed like that. This went on for a while but before we exited the bridge when we saw lights in the water shaped like a diamond. The colors were blue then red and then seemed to rotate and move around then dissappear. I was freaked out bc while off the bridge you still have a good visual of the water. And,the lights were still there. If anyone was in the va area that night you may remember that the sky was really clear and there was seemingly more stars out. The connection btw the pelicans and the lights were more than a coincedence. I hope there is someone out there who can back me up. From what ive read there was numerous sightings that night."],"Country":"United States","Date Submitted":"12/05/2010 08:11 UTC","Disposition":"Unresolved","Object Shape":"Diamond, Flash, Other","Latitude":"36.774749","Viewing Distance":"Unknown","Case Number":"26866","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Chesapeake","Object Features":"Undisclosed","Log Number":"US-12052010-0012","files":["/var/www/straped/mufon/html2text/26866.html.txt","/var/www/straped/mufon/org/26866.html"]}