{"Viewing Distance":"Over One Mile","Object Shape":"Cigar, Circle, Triangle","Country":"United States","Region":"Rhode Island","files":["/var/www/straped/mufon/html2text/26868.html.txt","/var/www/straped/mufon/org/26868.html"],"Longitude":"-71.364776","Date Submitted":"12/05/2010 09:44 UTC","Object Flight Path":"Stationary","Summary":"Appeared as a cloud, but no other clouds in sight, very symmetrical and vanished rather fast.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.767323,+-71.364776(26868)&iwloc=A&hl=en\"> mufon case (26868) map </A>","Log Number":"US-12052010-0014","Object Features":"Dome","divs":["sighting detailscoming home on 1-195 east @ 21:03 i was looking across the river while riding passenger and before hitting the george washington bridge, i noticed a bright star then i noticed a cloud to the bottom right that looked peculiar due to the fact that weather.com was reporting no clouds in the area 20 minutes prior, other stars were highly visible. the \"cloud\" must have been huge, from my point of view it was as long as my thumb and i would suspect it was several miles away. i told my wife and she was trying to see but she was focused on driving. it was a little rough to keep a constant view as there were a lot of street lights but between them i could clearly see that the object looked like a squished pyramid, with a very well defined bottom portion. the upper part may have been more illuminated due to the moon\\skylight and gave a very dark purple (to me it had the color of a fluffy cloud at night) but the bottom was pitch black and it looked way to well defined to be a coincidence. judging by the relation to the star i was keeping in view as something to base any movement on, it was stationary for at least 5 minutes. around 21:08 we took a curve that had a lot of trees in the way and a light, the view was obstructed for no more than 10 seconds and upon the star coming back into view the object was completely gone. i kept an eye on the area and scanned around to see where it could have \"floated\" if it was a cloud and it was 100% gone. it was a cold, crisp, clear night with great visibility. winds wnw @ 10mph 49% humidity, dew point 15 degrees, visibility 10 miles. i am a prior service army medic and i tried to rule out several things but i am certain this was a physical object under intelligent control due to the sudden vanishing. something that large does not stay stationary for so long then completely vanish in less than 10 seconds."],"City":"East Providence","Latitude":"41.767323","Weather Factors":"Unknown","Disposition":"IFO","trends":["There have been 11 other sightings in East Providence","There were no other sightings in East Providence on or around December 5th 2010"],"Case Number":"26868","Date of the Event":"12/05/2010 09:03 UTC","Tags":"City","Source":"MUFON"}