{"divs":["Sighting DetailsThe first sighting was on Tuesday evening, November 30th. At just before 7pm, I had taken the dog outside and while she sniffs around for the perfect spot to go, I always gaze up at the sky. As soon I looked up I saw a low flying, small airplane in the sw sky. Right next to the plane was another craft that did not have the same lighting as the plane. We live in airport community and we are also along the flight path of several commercial jets flying in and out of Tampa. Needless to say, we are very used to seeing planes of all kinds and can find at least 3 of them flying over at any given time. The small plane was flying from N to S. This other \"craft\" was flying in the opposite direction and appeared to have passed the airplane at one point. All that was visible of this other object was a large yellowish-orange light that flashed on and off slowly, nowhere near as fast as FAA lights on planes. This light was the only light or part of this craft that was visible.There was no noise, that we could tell. (My husband was called outside to witness this craft as well). We estimated this object as flying at a 5,000-7,000 ft altitude. Niether of us could identify what it was as it did not look at all like anything we had ever seen in the sky before. We eventually lost sight of the craft over the treeline as it flew to the north. The second sighting took place on Friday, December 3rd. Again, it was just before 7pm and I had taken the dog outside. As usual, I looked to the sky. In the western sky at that time are two brighter stars that sit paralell to one another at approx 20- 30 degrees apart. I was looking in this direction when I noticed a third star-like light in between these two stars. I thought it looked unusual because I didn't recall ever seeing three stars in a row before. As I watched, suddenly, the middle star faded out of existence, as though it heard my thoughts that it looked out of place. I continued to watch for several more minutes but it never reappeared. The third sighting was last night, December 5th. Once again, just before 7pm, I took the dog out. Because of the sighting I had just a few nights prior, I looked to that section of the sky. There was no third star. My gaze went to another set of stars that appear to form a triangle with a fourth star in the middle of the bottom section but a little but higher than the two lower corners. (This star arrangement is a bit to the north and a little higher than the previous described stars from Friday night.) As I looked at this triangular star formation, I saw another star-like light appear to the left of the triangle. It flew toward the right side of the formation for a short distance before it it disappeared. Like Friday's sighting, this light also just went out. I became extrememly excited knowing that I wasn't seeing something mundane. I waited and watched a few more minutes when siddenly, to the right of the triangle star formation and about 20 degrees to the north of the right most edge of it, another light (which I believe may have been the same light that had just disappeared due to this appearing along the same flight path) appeared suddenly and darted so fast to the right that it left a streak of silvery light behind it before it disappeared once again. The streak was not a contrail but the light from this object due to the speed at which it flew. The streak faded away quickly after the light disappeared. The speed of this object was unimaginable and there is no way any human could survive movement like that. This was also NOT a shooting star, as I have seen plenty of them and this was totally different. After seeing this object move so fast, I took the dog inside and grabbed my nightvision scope in hopes of seeing this object again and possibly tracking it. I spent nealry 20 minutes outside scouring the sky but was not able to find this object again. There is no way for me to estimate the altitude of the last two sightings but, from their appearance I would say they were pretty high up in the atmosphere. I was very excited after viewing each object, especially the last two."],"Disposition":"IFO","Sighting Duration":"00:01:30","Tags":"City","Log Number":"US-12062010-0003","Region":"Florida","Country":"United States","files":["/var/www/straped/mufon/html2text/26871.html.txt","/var/www/straped/mufon/org/26871.html"],"Object Flight Path":"Path with directional change","Latitude":"28.246307","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around November 30th 2010"],"Date of the Event":"11/30/2010 07:00 UTC","Summary":"Three different sightings in one week","Source":"MUFON","Object Shape":"Flash","Case Number":"26871","Date Submitted":"12/06/2010 09:51 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.246307,+-82.711467(26871)&iwloc=A&hl=en\"> mufon case (26871) map </A>","Weather Factors":"None","Object Features":"Unknown","City":"New Port Richey","Longitude":"-82.711467"}