{"Object Features":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.275194,+-89.781174(2687)&iwloc=A&hl=en\"> mufon case (2687) map </A>","Viewing Distance":"21-100 Feet","Tags":"City","Weather Factors":"Unknown","City":"Slidell","Longitude":"-89.781174","trends":["There have been no other sightings in Slidell","This sighting has never been favorited."],"divs":["Sighting DetailsRiding back from New Orleans on I-10 on the bridge I was staring at sky noticing the stars and how clear the sky was when one of the stars i was staring at got real bright white then blinked red then flew around in a sporadic pattern similar to a fly, then it blinked out completely. The person driving asked what I was looking at as soon as I said I didn't know he saw it. we continued on I-10 past Slidell, LA and as we discussed what we saw I noticed an empty car on the side of the road. I started counting cars there seemed to be quite a few empty cars along the interstate, I counted seven. I felt strange then looked up out the front winshield and saw what looked like two round solid dark objects, very symetrical coming toward the car just above the treeline. the objects had a thin halo and what I can only describe as an atmospheric disturbance. It was smoke-like but it was not smoke. I reached for the drivers arm because I could not speak, but I wanted to know if he saw it too. As soon as I touched his arm he screamed so I knew he saw it also. We continued to head for home as fast as we could."],"Latitude":"30.275194","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Date Submitted":"11/13/2003 12:00 UTC","Log Number":"","Case Number":"2687","Country":"United States","files":["/var/www/straped/mufon/html2text/2687.html.txt","/var/www/straped/mufon/org/2687.html"],"Summary":"craft flew low above car strange lights in distanc","Disposition":"Unknown","Date of the Event":"11/13/2003 12:00 UTC","Region":"Mississippi","Sighting Duration":"00:05:00"}