{"Weather Factors":"Unknown","Region":"Indiana","Log Number":"","Date Submitted":"11/30/1976 09:00 UTC","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in idaville","This sighting has never been favorited."],"Country":"United States","Latitude":"40.756984","files":["/var/www/straped/mufon/html2text/2689.html.txt","/var/www/straped/mufon/org/2689.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.756984,+-86.649453(2689)&iwloc=A&hl=en\"> mufon case (2689) map </A>","Longitude":"-86.649453","Object Flight Path":"Unknown","Summary":"saw a formation of lights in the night sky","Disposition":"Unknown","Object Shape":"Sphere","Source":"MUFON","divs":["Sighting DetailsI was driving home from logansport, indiana after seeing a girl friend. It wasabout 9 pm or a little after. I was about half way between Idaville and Burnstville near the old sawmill and saw a formation like ducks fly in V formation with about 7 or 8 lights off to the south west coming torward me not directly at me but off the south of me. I stop the pickup and got out side and looked for a few seconds. I remembered I had a polaroid land camera with me. I had taken pictures of my girl friend I got the camera and took a photo. My handswere shaking so bad I couldn't keep the camera still. I laid the photo on the hood of the truck and took another photo. Laid that photo on the truck hood, the wind pickuped a little and the photos started to be blown off the hood a car had passed by me on the highway so I turned to catch them then turned around again and the formation of lights had scattered in a split second, now all the lights were scattered all around the horizon. And were moving in different directions and had moved a great distance in under a second. I got the pictures and got back in the truck went on home in Monticello. I looked at the photos when I got home I don't remember if they turned out or if I can even round up the photos any more."],"City":"idaville","Object Features":"Undisclosed","Sighting Duration":"00:05:00","Date of the Event":"11/30/1976 09:00 UTC","Tags":"City","Case Number":"2689"}