{"Country":"United States","divs":["Sighting DetailsThat's the best way to describe it. It was a landing party that cut off traffic along Interstate 40. Sounds nuts but not after you've been thru what I've been thru. My family is from Roswell NM. My father was born in 1904, we're from Norway. Family traveled to New Mexico working on the railroads. My grandfather was killed in Las Vegas NM in 1916 - so my dad went to live with his aunt in Roswell. My dad would never talk about things. I won't even go into details, it's too stupid. He used to take me to New Mexico every summer - and everytime we got near Gallup or up in the NM high deserts, something fishy would happen. So this has been going on for years - and I'm so used to it, it doesn't rattle me anymore. In 1987, I was down in Tucson, and started seeing lights - ended up following them out into the desert - got into trouble, police had to come and get me. Then I had a lot of explaining to do - I keep trying to report this, and nobody takes me seriously. They're following me around, I think it's my family problem. Whenever I get near Gallup NM, and into New Mexico, I have to watch out. So in 1991, we were going on a family vacation. There were 4 of us in the car - my husband, me, and our two kids - My daughter 14, and my son 12. We left Flagstaff late, trying to get to Albuquerque. We're driving along, and we could see lights on the road - as we got closer, it was roadbloacks, yellow flashing lights - pitch black - then we saw a road crew, only everybody was facing the other way - they were wearing yellow reflective gear with hoods - they narrowed I-40 down to 1 lane - and the freaking lane just disappeared We experienced some dark area - a blinding flash of light - and we were back about a mile - I noticed that the hills on the left side of the road, we kept passing the same hills - then my son started freaking out and screaming - and my husband, who is a space cadet in the first place - he ended up having to drive us to Gallup. We checked into a local hotel - but it was weird. We went to get a burger about 2:00 a.m. - and people were walking around at half speed, acting confused - the waiter came up and set the table wrong, and then handed us the menus upside down- You think sometimes that people are just stupid - but these guys were really really stupid - I played along, because I already knew something was fishy - my husband was pretty tolerant and patient- they didn't appear to know how to act The next day got even worse - and I can describe that later - we ended up turning the car around and going back to Phoenix where we lived - My son asked me when he was about 25, \"mom, did we ever take a trip and pass the same mountain two times?\" He remembered it - we talk about it - but I don't like to upset him - so we never bring it up. It's just something we live with. I think they took our whole car someplace - and then brought it back, and dropped us a mile before the landing party - because when we went drove past the same mountain, the road blocks were gone, along with the lights and the guys in the reflective gear Now my husband and I sort of laugh when we see a road crew - Whoever they are, they are fairly sophisticated - I think they have uniforms. I caught some of them fixing light poles in the middle of the night too, down in Tucson - When I showed up - they all ran off. This has to have been going on when my dad was young too. My dad was in WWII - and had a few close encounters of his own - My husband said a ship landed in his yard when he was a kid living in Reno - I think that they know the families of people they can trust - then they just follow you around I saw that contrail in California - and I don't even live there. I happened to be in a deposition that day - and came outside and saw it. Honestly, I don't think that they have any contact with the US government. I don't think they're covering anything up, because I honestly don't think that they have any use for the government. I get the feeling that they are just going about their business, and once in a while we see them. I also think that the really awful things associated with UFOs, are just earthbound antics. I would have loved to been able to report this when it happened."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.533888,+-108.735064(26891)&iwloc=A&hl=en\"> mufon case (26891) map </A>","City":"Gallup","Region":"New Mexico","Longitude":"-108.735064","Object Flight Path":"Stationary","Object Features":"Unknown","Date of the Event":"07/04/1991 12:00 UTC","Log Number":"US-12082010-0003","files":["/var/www/straped/mufon/html2text/26891.html.txt","/var/www/straped/mufon/org/26891.html"],"Date Submitted":"12/08/2010 02:19 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Gallup","There were no other sightings in Gallup on or around July 4th 1991"],"Disposition":"Unknown","Viewing Distance":"20 Feet or Less","Object Shape":"Other","Weather Factors":"Unknown","Case Number":"26891","Latitude":"35.533888","Summary":"Landing Party"}