{"Longitude":"-80.722567","Source":"MUFON","City":"Dobson","files":["/var/www/straped/mufon/html2text/26900.html.txt","/var/www/straped/mufon/org/26900.html"],"Sighting Duration":"00:10:25","Date of the Event":"12/07/2010 05:05 UTC","Log Number":"US-12082010-0012","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=36.395689,+-80.722567(26900)&iwloc=A&hl=en\"> mufon case (26900) map </A>","Object Features":"Unknown","trends":["There have been no other sightings in Dobson","This sighting has been favorited 1 time."],"Object Shape":"Cigar, Circle, Disc, Saturn-like","Country":"United States","Weather Factors":"Windy","Disposition":"Insufficient Data","divs":["Sighting DetailsWe where driving home when I noticed a strange looking object in the sky,I told my fiancee to look and he said oh it is probably fighter jets to which I said they are sitting still in the sky and one looked liked a disc shaped and the other two looked long and bright but not moving, when he looked at them he yelled stop the car and that is what I did. We tried to take a picture with our camera phone but it would not show up,I pointed to the disc shape one and told him to try and get it, at that point that thing took off like nothing I have ever seen,it was there and then gone in an instant!!We continued to watch and then more showed up,we counted at least twelve, all following formation really really close to one another. We heard no sound coming from them and they where all headed south west.I finally got a little afraid and told my fiancee we where leaving the area. I have seen things in the past and regreted not telling someone, so I have tried to tell you everything that I could."],"Latitude":"36.395689","Tags":"City","Case Number":"26900","Summary":"The leader was disc shaped and the rest was shaped like long bight cigar shaped. They appeared to be in 3 squards.","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Region":"North Carolina","Date Submitted":"12/08/2010 06:16 UTC"}