{"Latitude":"32.451426","Viewing Distance":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-12082010-0015","Longitude":"-99.728844","Weather Factors":"None","Date of the Event":"12/08/2010 06:58 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/26903.html.txt","/var/www/straped/mufon/org/26903.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.451426,+-99.728844(26903)&iwloc=A&hl=en\"> mufon case (26903) map </A>","City":"Abilene","Date Submitted":"12/08/2010 08:34 UTC","Object Shape":"Other","divs":["Sighting DetailsOk myself and my dad watched these lights for 30 minutes, i was trying to pick them up on my camera this time but couldn't get them to show up, all you can hear is our commentary about seeing them. They appeared at first as a single light stayed on for a second or two then went out, came back on in the same exact part of the sky 10 minutes later this time it came on as 1 then a 2nd then a 3rd all very close to each almost appearing to be connected. Then 2 military jets were circling the sky for 20 minutes, they were looping around in the area of the lights but not the exact area. You very rarely see jets here, all we have here is C-130 and B-1's. I looked for some sort of jet that would be near the lights dropping flares like people are claiming these to be, but the sky was empty. No planes in the area, no beacon lights of planes off in the distance. The way these lights and come on they aren't flares. They don't flicker at all they are perfectly round orange lights, people see the orange orbs all over the country so come on stop calling them flares. I know what im looking at and I know its not a flare."],"Tags":"City","Case Number":"26903","Region":"Texas","Summary":"Orange Lights","Object Flight Path":"Stationary","Source":"MUFON","Country":"United States","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around December 8th 2010"]}