{"files":["/var/www/straped/mufon/html2text/26907.html.txt","/var/www/straped/mufon/org/26907.html"],"Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-74.058855","Case Number":"26907","Region":"New York","trends":["There have been 2 other sightings in Monsey","There were no other sightings in Monsey on or around December 8th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.119607,+-74.058855(26907)&iwloc=A&hl=en\"> mufon case (26907) map </A>","Tags":"City","City":"Monsey","Weather Factors":"Unknown","Date of the Event":"12/08/2010 05:00 UTC","Date Submitted":"12/09/2010 01:49 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"41.119607","divs":["Sighting Detailsto out it simply i was closing my window after opening it for some air at around 5am before getting to sleep when i noticed a bright light which seemed to be across the street not too high up and on top of my neighbors house. At first i thought it was likely a planet case ive seen venus which looks much like a ufo too but i noticed it seemed to get brighter at one point and after looking it for maybe 3 minutes or so, it started to hover away. Also it was completely silent the whole time and i may have noticed a blinking or not blinking red light on the side of it that was opposite of what i can see. My reactions were that it was a very interesting sighting, it could have easily been a military craft but it seemed very odd that it was so low and also seemed to literally stop or hover in middle of the sky for some reason. I happen to have an interest in ufo's which is why i noticed the light, i often keep my eyes out when i can. I don't neccesarily believe or disbelieve in them but i have a high interest. What this was i cant really say but it was certainly interesting. It also seemed like it may have been pretty small and possible rectangle or boomerang type of shape, it was really hard to tell. I lost sight of it when it drifted off past my house to were i couldn't see it and i was looking out my window the whole time. I did keep quiet too when i saw it for my own safety in case it was somethng strange. Also worth noting is that it seemed to shut off its lights or appear invisible for a split second or two about two times as i recall. It could have been because of clouds or wind but im sure its at least worth mentioning"],"Summary":"Saw bright light sitting in the sky for a few minutes until it turned and seemingly hovered away silently","Disposition":"IFO","Object Shape":"Boomerang, Square, Rectagular","Viewing Distance":"Unknown","Log Number":"US-12092010-0003"}