{"Tags":"City","City":"Kansas City","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 27 other sightings in Kansas City","There were no other sightings in Kansas City on or around May 10th 1959"],"Latitude":"39.119093","Viewing Distance":"Over One Mile","Summary":"Felt someone was out there","Longitude":"-94.622474","Weather Factors":"Unknown","Date of the Event":"05/10/1959 12:00 UTC","Region":"Kansas","Country":"United States","Case Number":"26909","Log Number":"US-12092010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=39.119093,+-94.622474(26909)&iwloc=A&hl=en\"> mufon case (26909) map </A>","Object Flight Path":"Stationary,Other","Object Features":"None","Date Submitted":"12/09/2010 01:53 UTC","divs":["Sighting DetailsI was probably 10 years old when my grandfather gave me a paperback book on UFOs. Ever since then, I was interested in trying to find one. Our family lived on 17th Street in Kansas City, KS in an older two-story home. The homes were about 100 years old and quite close together so there wasn't a lot of sky visible. One night about 11:00 PM when I was approximately 11 years old,I started looking at the sky out my front bedroom window. I sadly thought to myself, \"I want to go home; I want to go home\". Then I thought...what do I mean? I AM home! I then laid down on my bed so I could put my head on the window sill to see out the window on the side of my bedroom. I kept thinking to myself \"I know you're out there somewhere, I can feel it\". I continued back and forth between the two windows. I had noticed a bright star slightly to my left when looking out the side window. It was directly over the edge of the roof. I continued back and forth looking out both windows for about three hours. The last time I looked out the side window while lying on my bed, I had my head turned to the right looking up. Then, something caught my eye and I turned my head to the left. The star that had been stationery for three hours had begun to move. It made a sideways \"S\" pattern and continued over the next door neighbor's house so I lost sight of it. Tears came streaming down my temples. I felt as if I had been left behind. Was the \"S\" for my name \"Suzanne\"? I get agitated when no one believes me. They said \"Well, it must have been a helicopter or a satellite\". That high up and stationery for three hours? I know what I saw and how I felt. I decided to finally report this because other people are coming forward with sightings from years ago. Thank you for your time. Sincerely, Suzanne H"],"files":["/var/www/straped/mufon/html2text/26909.html.txt","/var/www/straped/mufon/org/26909.html"],"Object Shape":"Star-like","Disposition":"Unknown"}