{"trends":["There have been no other sightings in Hartshorne","This sighting has been favorited 2 times."],"Region":"Oklahoma","Object Features":"None","Object Shape":"Chevron, Triangle","divs":["Sighting DetailsMy wife and I, while sitting outside watching the stars, noticed a dark object flying toward us. At first I thought it was a large bird then a kite, but as it went over head you could see it was a triangle with a dim light at each corner. It was blocking out the stars as it went over. You could see the actual shape was a triangle with a notch out of the back. I thought perhaps it was a stealth bomber, only it was low to the ground and made no noise. It moved slow like you imagine a UFO would. My wife is pretty hard to impress and she was like you need to contact those MUFON people it was so real. The next day you rationalize it and say it was nothing just a plane or something, we will never know. That was late October. Then in late November about the same time 9:45 pm I see another triangular shaped craft. Same flight pattern, only it had more lights this time, and before it could disappear from sight it made a hard left turn impossible for a plane. I was shocked and couldn't believe my eyes. I ran in the house, told my wife and ran back out looking for it. I never saw anything else but it was so real. I was uneasy about seeing a actual UFO. I tried to rationalize it again by thinking it must be a drone aircraft, maybe a new stealth model they are testing over southeastern Oklahoma? Not too long after that, news reports came out of sightings that weren't too far away. I was encouraged to write this report. I hope it helps other people that have seen it to know they are not crazy, I saw it too."],"Latitude":"34.845098","map":"<A HREF = \"http://maps.google.com/maps?q=34.845098,+-95.557481(26905)&iwloc=A&hl=en\"> mufon case (26905) map </A>","Weather Factors":"None","Case Number":"26905","Disposition":"Unknown","Summary":"Triangular UFO Sighting Over SE Oklahoma","Source":"MUFON","City":"Hartshorne","Tags":"City","Longitude":"-95.557481","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"10/29/2010 09:45 UTC","Date Submitted":"12/09/2010 12:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12092010-0001","Sighting Duration":"00:00:15","Country":"United States","files":["/var/www/straped/mufon/html2text/26905.html.txt","/var/www/straped/mufon/org/26905.html"]}