{"Log Number":"US-12082010-0014","Weather Factors":"None","Longitude":"-74.424441","City":"East Brunswick","Summary":"Large Triangular Shaped Object Moving Over Rt 1 Highway From South to North","Date Submitted":"12/08/2010 08:04 UTC","Tags":"City","Source":"MUFON","Latitude":"40.452825","Sighting Duration":"00:03:00","Region":"New Jersey","Object Shape":"Triangle","Case Number":"26902","files":["/var/www/straped/mufon/html2text/26902.html.txt","/var/www/straped/mufon/org/26902.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.452825,+-74.424441(26902)&iwloc=A&hl=en\"> mufon case (26902) map </A>","trends":["There have been 4 other sightings in East Brunswick","There were no other sightings in East Brunswick on or around December 2nd 2010"],"Object Flight Path":"Straight-line path","Object Features":"Other","Date of the Event":"12/02/2010 08:40 UTC","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was exiting off of Rt. 18 North on the Rt 1 South exit ramp in my car. As I neared the bottom of the ramp and began to merge onto Rt.1 South, I noticed a low-altitude object with three bright, constant white lights over the highway directly ahead of me. I thought at first it was a plane, but as I began to take a closer look the object, I noticed there were no red, green, or flashing white navigation lights visible as I neared the object. I was trying to get a better visual while also trying to steer my car so as not to crash, but this object was actually large enough and flying low enough that I was able to get a good look at it going 50 mph down the highway. It was triangular in shape with three bright white lights on each corner. The edges of the craft were illuminated slightly and there was also a red light either toward the center or the back of the craft that was also steady and not blinking. The object was headed in a northerly direction right over Rt 1 as I was headed south. I am wondering if anyone else saw this object as there were quite a few people on the road when I witnessed this object. The sheer size of the craft was immense and I was reluctant to post this sighting until I did some research on large military cargo planes like the Hercules, Galaxy and Globemaster. However, I do not believe that the object was any of these planes as there is no military base that I know of in the area of the sighting. Secondly, I do not believe a military cargo plane would be devoid of proper navigation lights and flying at such a low altitude. Please feel free to contact me if need be."],"Disposition":"Unknown"}