{"files":["/var/www/straped/mufon/html2text/26916.html.txt","/var/www/straped/mufon/org/26916.html"],"Viewing Distance":"101-500 Feet","Object Features":"Patterned Surface","Case Number":"26916","divs":["Sighting DetailsMy husband and I were traveling on I-4 towards Orlando headed to St. Augustine for the weekend. We were talking to a friend on the phone and were around Plant City, Fl. We had reached a part of the interstate where the wasn't really any exits to get off and nothing around us but farmland and trees. As we were talking to our friend I had noticed an object in the sky. I thought nothing of it at first and did not mention it. I assumed it was a helicopter, because if the lights. It had a blue, green and red light flashing at the bottom of it. As we continued our conversation I kept my eye one it, because really there was nothing else to look at. My first thought was that It looked odd because it seemed to not move, but then again being in a car moving 70 mph can do that. At this point it was at my passenger window (my husband driving) I looked away and then looked back and was bewildered. The flashing light were gone and there were very bright golden colored lights flashing across the object. the lights moved clockwise, then counter-clockwise around the object. the object did not appear to be moving and was hovering in a field just above the tree line. The best way I could describe it was if you imagined light panels flashing across a disc. This would continue for a moment and then stop, followed by the green, blue and red flashing lights coming back on. I immediately told my husband to look and we watched it for about 2 minutes. There wasn't much traffic on I-4 but the cars around us slowed down, I could see the driver next to us looking at the object. We all slowed down to about 50 mph, which on a Florida Highway is rare. As we continued to drive the object moved farther and farther up, we watched it from miles away until we lost sight of it completely. I have never seen anything in the sky look like this. I am highly skeptical about ufos, and I think most things can be explained. This was nothing normal. Whatever this was didn't mind being seen, or why else would it have been so close to a main highway on a friday night. It was very bizarre and of course now we are very curious as to what we saw. I wished we could have taken a picture but of course, the camera was in the truck with our luggage:("],"Date Submitted":"12/09/2010 08:07 UTC","Object Flight Path":"Hovering then path","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-82.105244","Object Shape":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.026672,+-82.105244(26916)&iwloc=A&hl=en\"> mufon case (26916) map </A>","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Plant City","There were no other sightings in Plant City on or around November 12th 2010"],"Region":"Florida","Disposition":"Insufficient Data","Country":"United States","Summary":"flashing green, blue, and red light followed by horizontal golden lights flashing left to right across object","Date of the Event":"11/12/2010 12:00 UTC","City":"Plant City","Latitude":"28.026672","Log Number":"US-12092010-0012"}