{"Region":"England","divs":["Sighting DetailsThis event took place in or around 1974, when I was in my mid teens. I have verbally told many people about it over the years, but have never put it down in writing till now, which is strange since I am a professional biography writer by career, also publishing paperbacks in the self-help genre. The location was Corby, Northants, England. I'd been at a friend's house on Occupation Rd, and had cycled back to my home in Argyll St, about half a mile away. I'd been putting my bike in the shed at the back of the house, and had been scanning the sky as was my habit. Even then (and still the case today) I was a very keen aviation enthusiast. I was a senior NCO in 422 Sqdn Air Training Corps, and often represented the Sqdn in Aircraft Recognition. In those days I could identify just about every aircraft type flying! On that occasion, I noticed a triangular formation of lights moving across the night sky from North to South. My natural assumption was that I was viewing an airliner as the speed across the sky would have been consistent with viewing a large aircraft at typical operating altitude in the FL360 area. It was a very clear night, and the moon was full and sitting high in the Western sky. I noticed that the projected flightpath of these lights would take it very close to the bright full moon, so I decided to run into the house, grab my 20x50 binoculars, and wait to see if the aircraft would cross the face of the moon, thus allowing me a very clear silhouette by which to identify the type of aircraft. When I was in the house I told my Dad about it, and he also came out to look. When I came back outside, probably no more than 20-30 seconds after flying through the door on the run, I quickly found the lights again, and confirmed they were likely to cross the moon. I found them in the binoculars but was unable to see the aircraft shape, I also noticed the lights were white and steady, not flashing or coloured as I might have expected some to be on an aircraft. I remember moving my view to the left to see the full moon, and then back to the lights, and then, knowing they were going to converge, watching only the moon. Please remember that at this moment my expectation was to see a clear outline of a conventional aircraft against the bright, clear, full moon. What happened next has burned itself so clearly into my memory that it is as if it happened yesterday. While viewing the moon, at 20x power, it took up much of the viewfinder, but with enough black sky around it to clearly see \"entry\" and \"exit\" points where the aircraft would cross the surface. I knew it would be quick, but I had enough confidence in my identification ability that I knew I'd get the type of aircraft. I watched the lights come into view from the right, but instead of giving a clear outline of an aircraft, those lights disappeared BEHIND the surface of the moon. I continued to watch through the binoculars for maybe another five or ten seconds, but those lights never did re-appear to the left of the moon. I removed the binoculars from my eyes and scanned the clear night sky where an aircraft lights should have been if I had been watching an aircraft, it was gone. Both my late father and I were amazed at what we had seen, I moreso because I had witnessed this through the 20x50 binoculars. We both looked for the lights for several minutes but to no avail. The next day, during classes at school, the best friend I had visited that night told me that he had seen something strange in the sky after I had left. He described the exact scenario I have outlined above, but he brought up the subject, not me. We had independently seen the same thing, without communication, even though we were at our respective homes in town, a good half mile apart. Over the years I have often reflected on that sighting. It was my first UFO event. I have had several others since then, but nothing so amazing as what I witnessed in those mid teenage years. I was a credible, level-headed witness with a background in identifying aircraft types. I had expected to see nothing out of the ordinary, I had been using professional standard binoculars that had once belonged to the manager of the England Football team, and my sighting was confirmed by my Dad who watched it with me, and my buddy who saw it independently. The speed of those lights must have been phenomenal as they crossed space and disappeared behind the surface of the moon. The deceleration must have been greater than our known technology even now would allow for. Was it three objects or one? My impression has always been three, because the size of one object would have been unimaginable. I had no doubt as to my impression that these were controlled craft, then or now. It was an amazing, perspective-altering sighting, which even now leaves more questions than it provides answers."],"Date of the Event":"11/30/1973 12:00 UTC","Longitude":"-0.682254","Tags":"City","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","trends":["There has been one other sighting in Corby","There were no other sightings in Corby on or around November 30th 1973"],"Summary":"Triangular formation of lights that disappeared behind the moon","Log Number":"GB-12092010-0006","files":["/var/www/straped/mufon/html2text/26910.html.txt","/var/www/straped/mufon/org/26910.html"],"Case Number":"26910","Date Submitted":"12/09/2010 01:59 UTC","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Country":"United Kingdom","Object Shape":"Triangle","Latitude":"52.499639","map":"<A HREF = \"http://maps.google.com/maps?q=52.499639,+-0.682254(26910)&iwloc=A&hl=en\"> mufon case (26910) map </A>","City":"Corby"}