{"Region":"Massachusetts","Date Submitted":"12/09/2010 08:01 UTC","Tags":"City","Sighting Duration":"01:00:00","Object Shape":"Triangle, Other","Object Flight Path":"Stationary","Case Number":"26915","City":"Haverhill","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26915.html.txt","/var/www/straped/mufon/org/26915.html"],"Weather Factors":"Unknown","Summary":"3 lights in large triangle","map":"<A HREF = \"http://maps.google.com/maps?q=42.783262,+-71.06862(26915)&iwloc=A&hl=en\"> mufon case (26915) map </A>","Country":"United States","divs":["sighting detailsi stepped out back for a smoke after dinner, and looked up into the sky as i always do at night. i've become accustomed to the usual stars and aircraft flight paths. there is an airport in the area, but i would definitely recognize a plane. when i looked up, i noticed three blue\\green lights almost in a vertical line. the middle light was slightly off to the right, creating a very thin triangle. they were oscillating as if to be twinkling stars. as i said, i know the normal stars i see every night, and these were not them. i also noticed three similar lights in a more pronounced triangle approximately 20-30 degrees to the left. they behaved the exact same way. they were not moving and did not appear to get closer or further away. i stood outside and watched them for about an hour before all 6 lights disappeared at the exact same time. they did not fade out or zoom off out of sight. they simply disappeared. as i said, i look to the sky every night to see if anything abnormal is there. this is the first time i have ever seen anything out of the ordinary. i'm very creeped out right now. to add to that, my tv signal just went out. coincidence? probably. creepy given what i just saw? absolutely."],"Longitude":"-71.06862","Log Number":"US-12092010-0011","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"12/09/2010 07:50 UTC","Object Features":"Unknown","Latitude":"42.783262","trends":["There have been 9 other sightings in Haverhill","There were no other sightings in Haverhill on or around December 9th 2010"]}