{"Date of the Event":"06/01/1969 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.839792,+-104.819483(26912)&iwloc=A&hl=en\"> mufon case (26912) map </A>","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around June 1st 1969"],"Country":"United States","Disposition":"Unknown","Source":"MUFON","Weather Factors":"None","Object Shape":"Disc","Region":"Colorado","divs":["Sighting DetailsMy father was in the Air Force. We moved frequently. We moved to Colorado Springs, father stationed at ENT air force base. House was offbase in residential area. Could see opening to NORAD mtn. from back yard. Approx 1.5 to 2 miles away. I was 12 years old at the time. Just walked out the front door and stood in front yard. Across the street about 30 feet above the neighbors house was a UFO. It was fairly large, about the size of 1.5 school buses. It was a disc. The dome on top was more square like, sort of like a top hat but a little shorter. The craft was black. The dome had large windows that took up nearly all of the dome. There were lights on inside and I could see dark shadowy humanlike figures looking out at me. There was no noise. There was no visible means of how it was hovering at maybe 1 or 2 mph. There was a distinct calmness in the air or atmosphere that surrounded the craft and reached out to my distance enveloping me. As I recall the atmosphere that I was in was kind of orangish to look through. Things moved almost in slow motion. I looked to my right and the neighbor next door was standing in the yard staring at this object also. She also seemed to move very slow and animated. She was an elderly woman visiting from Germany and spoke no english. As I looked away from this woman to again look at the UFO it wasn't there. Things (sight and atmosphere) had cleared up and stuff was moving at normal speed again. I thought it had left, or I was seeing things. But a quick glance down the street and it was there moving very slowly over somebody elses house. Maybe five or six houses away. I have only told this story to about seven people, mostly family. My impression of this whole ordeal was that of a tour bus, except that it was a tour bus for aliens. It was close enough to hit with a rock. Thats it! Thanks."],"City":"Colorado Springs","Object Features":"Dome, Window(s)","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-104.819483","Viewing Distance":"21-100 Feet","Latitude":"38.839792","Case Number":"26912","Summary":"Watched UFO slowly move over house across street, tree top level, 100 feet away.","Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/26912.html.txt","/var/www/straped/mufon/org/26912.html"],"Log Number":"US-12092010-0008","Date Submitted":"12/09/2010 02:53 UTC"}