{"Region":"Ohio","Longitude":"-81.514085","Viewing Distance":"501 Feet - 1 Mile","City":"Akron","Log Number":"","Source":"MUFON","divs":["Sighting DetailsHello Mufon I was taking my trash out at about 1000 pm when what I thought was alowflying jet came into view coming towards me out of the north. What attractedme to this lowflyer was the unusual number of lights. I watched until it reachedmy position and I had a side view.I thought that if this is a jet, there arelights running from nose to tail under the fuselage. Same thing with wing tips.Lights all the way across. So I was seeing a cross formation of lights. Theceiling was low that evening, Im guessing around 500 feet. And this jet wasright at the ceiling. Kind of flying in a fog up there. I distinguished no bodyshape at all. Just the light pattern.what really got my attention was the factthat I didnt hear the scream of jet engines. Just a swoosh sound. Like if youwere to shush someone.shhhhhhhhhhVery quiet indeed. The reason I am reportingthis is because two nights later I hear from a friend at work the WJW TV, FoxAffiliate in Cleveland, Reported on their news channel that there were uforeports out of Akron.I didnt see the reports and I dont want to talk to the newschannel but I am curious if what I saw is what was reported. It flew southacross Interstate 76 and bypassed Akron Muninciple Airport. To sum it up, Youcould say I seen a low flying jet that was going very slow, very quiet, and hadlights galore. There were was one light lower than the rest, like the landinggear was down and there was a light only on one landing gear. As the set oflights approached my position, this is what i seen AS it got beside my location for a sideview, this is what I seen Then it simply flew out of my view perspective....total viewing time 3-4 minutes"],"Case Number":"2692","Sighting Duration":"00:05:00","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.090395,+-81.514085(2692)&iwloc=A&hl=en\"> mufon case (2692) map </A>","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around November 18th 2003"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/2692.html.txt","/var/www/straped/mufon/org/2692.html"],"Object Flight Path":"Straight-line path","Summary":"Low Flyer","Disposition":"IFO","Date of the Event":"11/18/2003 10:00 UTC","Country":"United States","Latitude":"41.090395","Date Submitted":"11/18/2003 10:00 UTC"}