{"trends":["There have been 10 other sightings in Cisco","There was one other sighting in Cisco on or around December 8th 2010","This sighting has never been favorited.",""],"Case Number":"26926","City":"Cisco","divs":["sighting detailswednesday, december 8, 2010, 18:22 hrs. while driving from our home near breckenridge, to eastland, texas (which is approximately a 30 mile drive for us), my spouse and i saw unusual lights in the sky. we were traveling south on hwy 183 and it was at approximately the 12 mile mark south of breckenridge, that i noticed a short string, of what appeared to be \"christmas lights\". at this time of year that is certainly not unusual but what was, is that these lights were at some distance, located to our south\\southwest and about 10 degrees above the horizon. there is no hill there from my vantage point, no house and no towers. the lights were clearly elevated some distance above the ground and may have been over, or near i-20, possibly west of cisco, texas. at that distance it was hard to discern. i was in the passenger seat, so i leaned forward to get a better look through the windshield. the lights were clearly visible for about 5 seconds, until my view was momentarily blocked by trees. when we passed the stand of trees, i was able to see the lights again. unfortunately, another stand of trees again blocked my view and after only 4 or 5 seconds to clear the trees, the lights were gone. they didn't just move away, they were simply gone. total viewing time was about 10 seconds. i asked my husband if he saw the lights and he answered yes, however, he thought the lights might have been an aircraft, as he only got a glimpse of them. he was having to pay attention to the road. i could not be so dismissive, as i had clearly seen the lights, which appeared to look like multicolored christmas lights in a slightly elliptical, horizontal pattern, as depicted in my illustration. i might also add that i had just emailed a friend before we left home, telling him that we might see a ufo. later, the lights appeared right after i thought to myself, \"ok, show yourselves.\" evidently someone, or something heard me but they didn't show for long. 1. we were driving to eastland, for a meeting. 2. we noticed the object (lights) due to the fact that they suddenly appeared in the sky ahead of us and were quite distinct. 3. i won't say what i thought it was but i can say what it wasn't. it was not a conventional aircraft, an hallucination, venus, swamp gas, weather balloon or the goodyear blimp. 4. the object hung in the sky, 10 degrees above the horizon. it's lights flashed and\\or rotated around it's outer perimeter. the lights looked like multicolored christmas lights. the object appeared to be disc shaped, seen edge on and slightly tilted. 5. i was not surprised, as i knew it would be there, somewhere and we would see it. 6. we watched it until we lost sight of it behind trees and then it was gone. i did not have time to take a photo, therefore i am enclosing my depiction of what we saw."],"Object Flight Path":"Stationary","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.392756,+-98.969884(26926)&iwloc=A&hl=en\"> mufon case (26926) map </A>","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Disc","Source":"MUFON","Disposition":"Unknown","Latitude":"32.392756","Region":"Texas","Date of the Event":"12/08/2010 06:22 UTC","Summary":"Spouse and I saw what appeared to be \"Christmas lights\" in sky near Cisco, TX","files":["/var/www/straped/mufon/html2text/26926.html.txt","/var/www/straped/mufon/more/26926_submitter_file1__12-08-2010-sighting-SW.jpg","/var/www/straped/mufon/org/26926.html"],"Object Features":"Unknown","Log Number":"US-12102010-0005","Longitude":"-98.969884","Date Submitted":"12/10/2010 03:45 UTC","Country":"United States","Sighting Duration":"Undisclosed"}