{"trends":["There have been no other sightings in Litchfield","This sighting has never been favorited."],"Tags":"City","Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.043934,+-84.757465(26924)&iwloc=A&hl=en\"> mufon case (26924) map </A>","Object Shape":"Disc","Longitude":"-84.757465","Log Number":"US-12102010-0003","Object Flight Path":"Straight-line path","Date Submitted":"12/10/2010 01:05 UTC","files":["/var/www/straped/mufon/html2text/26924.html.txt","/var/www/straped/mufon/org/26924.html"],"Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsI was about 13 years old when this occured. We lived in the country. Our entire family had been out on a shopping trip. When we arrived home and exited from the car, my father pointed to the south and exclaimed \"Look there.\" We all (8 of us) turned and saw this ring of rotating lights slowly drifting over the top of the trees to the south, and over the top of us, moving from south to north. It made no sound. The air was still,and the sky was clear.It blocked out the stars as it went over head. My father went to get a small telescope we had, while the rest of us remained outside. I got the impresion that it was so close I could have hit it with a rock if I threw one. None of us spoke. My father came out of the house with the scope, but by that time it was across the road and was drifting slowly away. All he could see with the scope was a blur of lights. We watched it drift away untill it was just a dot of light. We didnt talk of it after that. Not even the next day. It was like it hadnt happened. 10-15 years later, I brought it up at a family get together, and was suprised to find that only my younger brother and I can remember the event."],"Weather Factors":"Unknown","Latitude":"42.043934","Sighting Duration":"Undisclosed","Date of the Event":"06/30/1968 12:00 UTC","City":"Litchfield","Country":"United States","Region":"Michigan","Object Features":"Unknown","Summary":"Rotating ring of lights, aprox. 30-40 ft. in diameter.","Case Number":"26924"}