{"Object Features":"None","Case Number":"26929","City":"Greeneville","Latitude":"36.173107","Log Number":"US-12102010-0008","Date Submitted":"12/10/2010 06:06 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailslast year on july 7th,2009 i got a picture of 'fireball' coming down the mt.side...it made a sharp right turn sped off and was seen from someone miles away who said it turned and went straight up to the sky... july ,then sept and oct. i got more stuff..same exact area. 'disks or coins' with detailed design on them...(i just recently got many of those same ones in the past month (nov\\dec. 2010)..last year i actually got pictures of a 'glob' of stuff and then it formed into these disks. recently i caught them in a different form,..not quite into the disk yet but going there...a fuzzy ball!...i watched 'six tiny lights' skirting around the sky like fireflies last year and when i enlarged them they look like gol'darn kids kiddy cars...i got a 'black thing' and when i enlarged it it didn't get the pixels like it should have but became a sharp rectangle with sharp edges and a gray edge around the black. doing further investigation of my photos i haver found that it 'may be a doorway' to a larger craft where these tiny things emerged from. (i've gotten the black thing in recent photos too...still appears as the same type of thing.....i have seen 'strobe lights' that shoot out a beam and then the object turns like a globe and shoots out the strobe light again. same night it happened again(last year) but no where in the sky but level with my house but down a ways to our left but way below the mt. that's when i caught the first glob of the disc formning....i've got photos of a craft looking form with a string hanging down...(last year)..recently i have got pictures of the disks\\coins...and ...are you ready for this...'long airplane looking crafts!!!' i watched them every night for over a week (and if it wasn't for the rains and snow and bitter cold would still be out there)they are around for at least an hour every night.at first the light was like a flashing light...i thought it was a plane and took it so i would have a reference if i ever got something'strange'!..it ended up being the strange things.there were at least ten iof them,one right after another and going in all directions..all different...several are like a bar with different lights..some with more than others...the usual 'discs\\coins' and something that looks like a bio plane. there is also one of them against what everyone 'thinks' is the moon (but greenish tint)..it isn\"t the moon...the moon was the exact oppositre direction. i 'think' it is that ??'mother craft the things come out of.i looked for the door but this one was a little different and instead of at the edge it looks like it is in the middle...i also have seen and have pictures of the 'v shape' (several going in different direction s).most of this stuff my camera picked up and i didn't see the stuff until looking at my picture.however, a couple of weeks ago i saw a low flying v lower than the mt's. and it was like a lit up christmas tree. there were three lights on each side and across the bak with one red light on the back left. the photo i fot has it as a solid white(brightness??) but there was a red streak which made me think a plane leaving a trail,..but..the red ?trail\\ was also in front of it..(this is all this last month(i have a nikon 300 camera and had it setting on a tripod and used a cable release so there wouldn't be any shaking.i put it on 'programed' because i didnb't know what to set it on.(the one i took last year i had it set on a fast speed for takuing pictures of birds in flight during the day and was able to catch the falling fireball!) oh yes, my camera was fiorst set on 1600- asa and i cranked it to 3500. also, a couple of weeks ago i actually saw the bar with lights craft like is in the pictures,with my own eyes!!! a light lit up and then one to the right and then another but zipped fronm one to the other.when it got to the end they all stauyed stil (without blinking) for a split second and then 'disppeared' ..not shot off,..just disappeared,..like in harry potter's invisable cloth...which,by the way is why i ythink our pilots can't catch them..it's not that they are so fast,..they just change...the recent lights with colored string seen in kokomo indiana and are thought to be something 'new' i have a group of pictures of way back when i lkived in st.pete fla. the local mufon said it wasn't anything yet at least fifty of us saw it. i also have the 'string' coming down little by little and again i think 'crafts'; were coming down it.don't send the local mufon guy.he camed with the ball of fire but wasn't interested in it as he said it was suppose to be a traingle or a 'creature' discription.'i' had pictures ..yet he was impressed by what someone else said they saw...there are far too many photos to even try to submit (i have hundr4eds)..i will give a sample so you can see the different ones...i need to send them by e-mail because i can't open just separate pictures by hitting browse below it opens family phoits too. please send me an e-mail to answer and i'll enclude them there."],"Object Shape":"Blimp, Disc, Fireball, Square, Rectagular, Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=36.173107,+-82.823306(26929)&iwloc=A&hl=en\"> mufon case (26929) map </A>","Disposition":"IFO","Object Flight Path":"Hovering then path,Path with directional change","Summary":"MANY over the past two years in same place..recent many different kinds in one week","Source":"MUFON","Longitude":"-82.823306","Country":"United States","Tags":"City","Weather Factors":"None","trends":["There have been 9 other sightings in Greeneville","There were no other sightings in Greeneville on or around November 18th 2010"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26929.html.txt","/var/www/straped/mufon/org/26929.html"],"Region":"Tennessee","Date of the Event":"11/18/2010 09:15 UTC"}