{"Date of the Event":"11/23/2010 12:00 UTC","Source":"MUFON","City":"Palermo","Log Number":"IT-12102010-0010","Weather Factors":"Unknown","Longitude":"13.361406","Date Submitted":"12/10/2010 08:00 UTC","Sighting Duration":"Undisclosed","Country":"Italy","Case Number":"26931","Object Flight Path":"Unknown","Summary":"UFO photo on the highway Catania - Palermo","Latitude":"38.11564","Object Shape":"Other","divs":["Sighting DetailsOn 23 November 2010, around 12 PM, we have stoped on the highway to take some fuel. I took the chance to shot some photos around, the sight of the mountain was great. I took four photos, one after another, within one minute, then after another two or three photos, I took again three photos of the same mountain. I haven't seen anything strange or something moving on the sky before, during or after I took the photos. Two days later, at home, after I downloaded the photos, I saw that on the fourth foto taken at the beginning, there is something, like a spot. I zoomed in and I was shocked to find that it looks like a cap, with two lights on it, on the left side. I increased the contrast at maximum and decreased at a minimum the midtones and the result was really surprising. I am sending you the original photo plus the first before and the first after. I am still keeping the original photos on my digital camera. Strange enough, in the photo in which the strange object appears, on the left side, high, there are some other points visible, one of them (the biggest one) looking slightly like the main one. NB The date and time of the camera is not setted, I observed that the date of the picture appears 22 Nov, and the time, 22:26, but in fact it is not correct, as everything happened on 23 Nov, afternoon time. Thank you for your help in investigating this. Best regards."],"files":["/var/www/straped/mufon/html2text/26931.html.txt","/var/www/straped/mufon/more/26931_submitter_file1__UFOphoto.JPG","/var/www/straped/mufon/more/26931_submitter_file2__P1010625.JPG","/var/www/straped/mufon/more/26931_submitter_file3__P1010631.JPG","/var/www/straped/mufon/org/26931.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.11564,+13.361406(26931)&iwloc=A&hl=en\"> mufon case (26931) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Region":"Sicily","trends":["There have been no other sightings in Palermo","This sighting has never been favorited."],"Disposition":"Unresolved","Object Features":"Undisclosed"}