{"City":"Whitehall","Tags":"City","Object Features":"None","Object Flight Path":"Hovering then path","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","Region":"Ohio","Latitude":"39.966731","Sighting Duration":"00:10:23","Log Number":"US-12102010-0013","Case Number":"26934","Weather Factors":"None","Date Submitted":"12/10/2010 10:25 UTC","Date of the Event":"12/10/2010 10:05 UTC","Summary":"Brilliantly Flashing Light Moves Slowely Over Tree Line","map":"<A HREF = \"http://maps.google.com/maps?q=39.966731,+-82.885456(26934)&iwloc=A&hl=en\"> mufon case (26934) map </A>","trends":["There have been no other sightings in Whitehall","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/26934.html.txt","/var/www/straped/mufon/org/26934.html"],"Object Shape":"Flash","Longitude":"-82.885456","Country":"United States","divs":["Sighting DetailsI was standing outside at around 10:00pm and was sitting in a lawn chair smoking a ciggarete on the front porch. I sat there for about 5 minutes and noticed a sudden flash of light appear about 800 feet above the tree tops, the light began to pulsate and flicker. Thinking it was a plane, I never minded it, but noticed it didnt move from its location for about 5 minutes. I contued to watch it for a bout 5 more minutes and noticed that it was moving at an incredibly low speed, the lights blinked in and out from the edges inward, and was flashing at a high rate. The color of the flashes were a metallic silver that lit up the surrounding sky in its perimeter. The flashes were fast and reminded me of some sort of strobe light. I then ran down my front lawn and into the street to get a better look, but I soon realized it was drifting away towards a Southwestern direction behind trees and could not see it as good, but I noticed that with the low altitude of the lights, and flashing strobe that it was in fact not a jet or commercial airplane, there was no sound of engine roars or anything, it was completly silent and contenued its slow moving path...it almost seemed to just drift away, and the lights were flashing at an amazing speed with blinding brilliance, sort of a metallic type light."],"Source":"MUFON"}