{"Longitude":"-77.033896","Summary":"Picture taken of UFO unintentionaly, then noticed later on when browsing through my pictures.","Case Number":"26937","Source":"MUFON","Disposition":"IFO","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around December 7th 2010","This sighting has never been favorited.",""],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.897592,+-77.033896(26937)&iwloc=A&hl=en\"> mufon case (26937) map </A>","Log Number":"US-12112010-0002","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"38.897592","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"12/07/2010 02:30 UTC","files":["/var/www/straped/mufon/html2text/26937.html.txt","/var/www/straped/mufon/more/26937_submitter_file1__P1010193.JPG","/var/www/straped/mufon/org/26937.html"],"Tags":"City","Date Submitted":"12/11/2010 12:28 UTC","divs":["Sighting DetailsMe and some friends went to washington dc for a few days. We decided to go and visit the typical tourist attractions, the white house, the monument, the lincon memorial etc. The even happened whilst I was posing for a picture on the steps of the lincon memeorial looking towards the Washington monument, my friend wanted to get a shot of the back of my head looking over the steps and the water leading upto the monument, so I posed, the picture was taken & then we proceeded to get on with our day. It wasnt untill the next day when we was on the plane home that i decvided to look through the snaps from our vactiuon to pass time and noticed quite clearly on the picture in question, a fairly big object in the sky of my picture. We never heard any noise of the object on the day and it looks pretty low too, we never even saw it in real time either. We had seen 3 black milatary helicopters in the same region 5 minutes before hand though, although this could just be sheer coinciendce but I thought id let you know everything that happened regardless to give you the complete picture. I was shocked and excited by this picture because of its clarity and clearness, the interesting thing was we took 2 shoots either side oif this picture maybe about 10 seconds apart and this object isnt in either of those pictures so it much have benn travelling fast? Anyhow I would love to know what you think this is, even if it is a secret military plane or something, its just interesting me :) I hope this helps and if you have any questions please do not hesitate to contact me. Kind regards"],"City":"Washington","Region":"District of Columbia","Object Shape":"Boomerang, Other"}