{"Log Number":"US-12102010-0011","Weather Factors":"None","Object Features":"Dome","Disposition":"Unknown","Longitude":"-77.45647","trends":["There have been 17 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around December 10th 2010"],"Object Shape":"Sphere, Star-like","Case Number":"26932","City":"Fredericksburg","divs":["Sighting DetailsI was walking my dog outside in my neighborhood, just listening to my Ipod and gazing up at the sky like I always do. I noticed to the left there appeared a spherical orb that I had not noticed before, gliding across the sky at a moderately fast pace. It had no tail or blinking light. It had the luminescence of the moon. It glided across the sky and was gone in less than three seconds. I first thought it was a shooting star, but I have seen shooting stars and it looked nothing like this object. I have no idea what made me look at the sky at the time I did. I think the object had already been on it's path and I noticed it while it continued it's northern glide towards Route 1. The orb just flew in a straight path. It had no stops or turns that I noticed. The speed of the object remained the same. This is the first time I have seen anything like this, so I freaked out and ran inside after swearing under my breath and contemplating what I just saw. During the 3 seconds I saw the object I was in a mesmerizing trance. Just following the object with my head until it continued it's northern path and was out of my sight."],"files":["/var/www/straped/mufon/html2text/26932.html.txt","/var/www/straped/mufon/org/26932.html"],"Latitude":"38.310314","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"12/10/2010 08:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.310314,+-77.45647(26932)&iwloc=A&hl=en\"> mufon case (26932) map </A>","Source":"MUFON","Summary":"Biright sperical orb that glided across the sky at a moderately fast pace.","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Country":"United States","Region":"Virginia","Date of the Event":"12/10/2010 08:32 UTC"}