{"Region":"Arizona","Object Features":"Undisclosed","Date Submitted":"11/30/1973 07:00 UTC","Tags":"City","divs":["Sighting DetailsMy girl friend and I, were camping outside the town of Snowflake not sure if itwas coconino off of a logging road we found, off the main highway to Snowflake.We had just finished eating Camping out and was just getting dark and wassitting under a pine tree, when I noticed the ground around me eluminating. Ilooked up...and noticed a light that, I thought may have been a big star atfirst...almost straight above me, it started moving down towards me and my girlfriend who I thought was sleeping on my lap. As it got what appeared tobe....4-6ft. away, I realized what I was wittnesing was something from out ofthis world we live in. I became frozen like, with tingeling on the back of myneck and back, my breathing became aratic, I tried to touch it with the end ofmy rifle butt. the object must of been higher, hard to predict. At the closestpoint...it looked to be, what I would describe as a Ball Of Energy which seemedto be anolizing us it definately was zerod in on us for some reason at whatseemed 4-5 ft. away. After a period of maybe a minute or two it started back upSlowly then kind of...dissapated from what Iremember. It definately did not take off....or make like an object that had aflight path or something. I didnt realy start getting scared until...mygirlfriend started grabbing me and wispering what the hell is that Then I knew Iwasnt exaggerating Please help me understand. Steven Paulson"],"Case Number":"2693","Date of the Event":"11/30/1973 07:00 UTC","files":["/var/www/straped/mufon/html2text/2693.html.txt","/var/www/straped/mufon/org/2693.html"],"Longitude":"-110.078449","Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path","Latitude":"34.51337","Country":"United States","Source":"MUFON","Summary":"A bright ball of light","Object Shape":"Sphere","Weather Factors":"Unknown","Disposition":"Unresolved","Log Number":"","Sighting Duration":"00:05:00","City":"Snowflake","trends":["There has been one other sighting in Snowflake","There were no other sightings in Snowflake on or around November 30th 1973"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.51337,+-110.078449(2693)&iwloc=A&hl=en\"> mufon case (2693) map </A>"}