{"map":"<A HREF = \"http://maps.google.com/maps?q=27.505328,+-82.566789(26940)&iwloc=A&hl=en\"> mufon case (26940) map </A>","Date of the Event":"12/10/2010 12:00 UTC","Longitude":"-82.566789","Latitude":"27.505328","Log Number":"US-12112010-0005","Date Submitted":"12/11/2010 01:31 UTC","City":"Bradenton","Object Features":"Unknown","divs":["sighting detailsi often take pictures of the sun and get these star like objects once in a while.. yesterday i got a cluster and on another shot one very clear and bright object. i took 30 shots around 1pm on a clear day no birds in the area (i have taken pics of birds by the sun i know what they look like, they appear as black smudges\\dots). shots were taken every 5 seconds for up to 30 shots. only two shots showed objects. most of the time i do this all shots are clear, once in while i find an object. these seem to be illuminating their own light. these are not lens flare. lens flare appears as a line across the pic, these are not in that line. and it would not be a cluster. i continue also to record nightly with night vision scope. still waiting to hear about the midnight flashes i sent in a while ago. (flashes recorded for over an hour, stationary at midnight) last i heard they were still working on it."],"Country":"United States","Disposition":"IFO","Object Shape":"Sphere, Star-like","Summary":"Pictures of the Sun shows objects near it","Tags":"City","Region":"Florida","Weather Factors":"None","Object Flight Path":"Unknown","trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around December 10th 2010","This sighting has never been favorited.",""],"Source":"MUFON","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/26940.html.txt","/var/www/straped/mufon/more/26940_submitter_file1__S1.jpg","/var/www/straped/mufon/more/26940_submitter_file2__sun12-10inv.jpg","/var/www/straped/mufon/more/26940_submitter_file3__brightdot.jpg","/var/www/straped/mufon/org/26940.html"],"Case Number":"26940"}