{"files":["/var/www/straped/mufon/html2text/26944.html.txt","/var/www/straped/mufon/more/26944_submitter_file1__UFO20C.jpg","/var/www/straped/mufon/more/26944_submitter_file2__UFO20B.jpg","/var/www/straped/mufon/org/26944.html"],"divs":["sighting detailswhile out driving and taking pictures of the beautiful scenery i stoped to take pictures of some clouds. i took a lot of pictures and when i returned home and loaded them from my camera to my computer i noticed something strange in the picture. at first i thought it was a reflection but i noticed it had a shadow on the cloud and it looked like an octogon but when i cropped it and tried to enhance it i noticed that it was more like a cube. it seemed like the picture i took was at a angle that captured it when it was blending in with the cluds. it was reflecting the clouds and no one would have noticed it with the naked eye. this is scary because this thing was huge and just sitting there with no one even knowing it is there. i think the government need to find out what they want and are they a danger to us if they don't already know they are there. it seems kind of strange that people take pictures of these things they can't see with a naked eye and see it later on there camera. its hard to believe that the government don't know the ufos are there. this happened on 12\\04\\10 in moreno valley, california heading east on romana expressway. look, i don't know what is going on and all this investigation doesn't prove that they are real. the average person knows that they are real but are to busy to wory about it because we're trying to survive so my question is this: when are your organization and the governments going to stop b.s.ing on this and face the fact that they are here and have been here and there is nothing we can do about it. again, most of the people around the world have seen more than what i have seen but you're welcome to continue to investigate but its really time for action don't you think. time to start organizing and getting people invovle that can do something but in reality, what can we do? the pictures i'm sending you one of them has the enhanced picture of the ufo in the upper left hand corner. the original object is right above the date stamp."],"Case Number":"26944","trends":["There have been 13 other sightings in Moreno Valley","There were no other sightings in Moreno Valley on or around December 4th 2010","This sighting has never been favorited.",""],"City":"Moreno Valley","Date of the Event":"12/04/2010 12:00 UTC","Country":"United States","Object Features":"Undisclosed","Longitude":"-117.227372","Latitude":"33.951576","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Other","Disposition":"IFO","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.951576,+-117.227372(26944)&iwloc=A&hl=en\"> mufon case (26944) map </A>","Date Submitted":"12/11/2010 11:46 UTC","Summary":"Large cube like object in the clouds with a shadow on the clouds.","Log Number":"US-12112010-0009","Weather Factors":"Unknown","Region":"California","Tags":"City"}