{"Summary":"Bright red light appearing over tree line, located above mountain area of mount larcom","Disposition":"Unresolved","Weather Factors":"Windy, Rain, Heavy, Medium, Light","Date of the Event":"12/12/2010 11:09 UTC","Viewing Distance":"Over One Mile","Object Features":"Unknown","Source":"MUFON","City":"Gladstone","map":"<A HREF = \"http://maps.google.com/maps?q=-23.849,+151.263(26949)&iwloc=A&hl=en\"> mufon case (26949) map </A>","Country":"Australia","Date Submitted":"12/12/2010 08:50 UTC","divs":["Sighting DetailsWhile at work in the state forest north of gladstone, working at my laptop i noticed, out of the window to my left, a bright red light, thinking i might have a car coming through bush land towards me, i moved out of the donga i was in and waited for the car to arrive. After i exited the donga which is up of the ground, i noticed that the light was above the tree line, a long way from me in the distance, above the north end of mount larcom mountain area. Due to the forest trees getting in the way i couldnt work out if it was round or any other shape, also there where times the light hurt my eyes but not enough for me to look away from the object. but i noted that it was slowly moving down wards on the other side of the mount larcom range. I try'd to take a camera picture and video cam picture on my mobile phone but all it picked up was blackness even though i could still see the red light, at times the light appear'd very bright and at others a bit dimmer, not sure if this was due to trees or rocks and natural formations getting in my viewing way. At the time normal nature sounds still happened, no generator problems or light problems with my working area. There where no other light sources located out side the donga, and no other reasons this red light might have been caused from. During the 14 min's i watched this light, i sat down out side the donga in the dark and just watched, no time loss was noticed, nothing strange happened to me or my work area. My feelings at the time was just calmness, and relaxed a feeling not to worry about it, that all was normal. I lost site of the object as it moved down behind the mountain side. and didnt see the object again. Please note this was a very cloudy night, with rain at different times, and wind."],"files":["/var/www/straped/mufon/html2text/26949.html.txt","/var/www/straped/mufon/org/26949.html"],"Region":"Queensland","Sighting Duration":"00:14:00","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Gladstone","This sighting has never been favorited."],"Log Number":"AU-12122010-0005","Object Shape":"Other","Longitude":"151.263","Tags":"City","Latitude":"-23.849","Case Number":"26949"}