{"Date of the Event":"12/11/2010 04:45 UTC","Latitude":"40.828304","Date Submitted":"12/12/2010 01:18 UTC","Country":"United States","Log Number":"US-12122010-0002","Viewing Distance":"Unknown","Object Features":"Undisclosed","Longitude":"-106.936161","City":"Little America","divs":["Sighting DetailsI was driving back to colorado from idaho, got tired and decided to stop off at little america. reclined in my seat for almost two hours, couldn't sleep so i decided to start driving. I immediately noticed this star like figure in the eastern sky. I've seen this same figure many years ago as a teenager in Idaho more than once. I knew it wasn't a star because it was too close to the ground and way too bright. I also noticed it moving when i would stop the car, it would go back and forth from one side of I-80 to the other. I tried to keep up with the other cars because i've never felt so terrified, I felt like it was there for me for some reason, only because this isn't the only time that i've seen it. My brother and my grandmother have also seen this before. My heat was on inside my car but all that i could feel was cold. i was stopping at every exit because i couldn't stay awake, i would drink coffee and red bull but could only continue to drive for only twenty minutes at a time. every time i would stop it would move closer but when i would continue driving, it would go off into the distance. i finally couldn't drive any longer so i pulled off at a truck stop at rock springs and once again reclined me seat to try to sleep. i could see it moving south as i fell asleep, it was my last image of this star like figure. when i was sleeping, i was dreaming about it and a man that i have never seen before. in my dream, the man kept repeating that he was the reason that i could not bear children that they had other plans for me. i remember trying to wake from this dream but could not, and once again have never been so terrified. also, when i was driving, a friend of mine was sending me text messages but for some period i quit receiving these messages. when they finally came through, i had three missed messages at different times, but i remember checking my phone frequently and never did lose service. after sleeping for three hours i woke up to continue driving. even though i could no longer see the object, i still could only drive about twenty to thirty minutes at a time, i was drained of energy. i had to pull over and sleep for one or two hours every twenty to thirty minutes. a drive that would normally only take me less than five hours took me more than twelve hours because i just didn't have the energy to continue. i've made this same drive several times and was sick with severe anemia from cancer before and still was never this tired. in fact it's still hours later and i don't feel like i have any energy just yet, but i did notice i have three blister like sores on my neck in the shape of a triangle, very painful. don't know if they have anything to do with my sighting or my fatigue but don't want to dismiss it just yet. Also, i tried to stop and take pictures of the object, but it seems like every time i would stop and get my phone ready to take pictures, the object would become very dim. and according to my call log, i called my husband at 5:24 am to tell him about what i was seeing."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.828304,+-106.936161(26946)&iwloc=A&hl=en\"> mufon case (26946) map </A>","trends":["There have been no other sightings in Little America","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/26946.html.txt","/var/www/straped/mufon/org/26946.html"],"Case Number":"26946","Object Flight Path":"Undisclosed","Region":"Colorado","Summary":"first noticed object when i left little america","Source":"MUFON","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Disposition":"IFO","Weather Factors":"Unknown"}