{"Longitude":"-105.2134","Date Submitted":"12/12/2010 04:20 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26951.html.txt","/var/www/straped/mufon/org/26951.html"],"Log Number":"US-12122010-0007","Object Features":"Undisclosed","Object Shape":"Star-like","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband and I were driving home from blackhawk. We just arrived at the stoplight at the 6th ave intersection, when I noticed a bright light hovering in the southeast section of the sky. My first thought was that it was an aircraft perhaps waiting to land at a nearby airport, however I thought it was an odd time for aircraft to be waiting. As we traveled east the light appeared to be moving east towards the Aurora area. My husband commented that it may be a police helicopter monitoring Aurora. That sounded like a reasonable explanation. We traveled east on I-76 to the Hwy 85 exit. We proceeded north on 85 for about 5 minutes than I decided to look back and see what the light was up to. It was no longer over southeast Denver, it was now east of us traveling north as we were. DIA is in the vicinity, so we assumed it was probably going to land there. Well it didnt. It continued to travel north with us. I thought maybe it was airtraffick control until I realized that the light did not have red or blue flashing lights. In fact it did not flash at all. I double checked my speed an I was driving the limit. I figured by the time I got to Ft lupton or Platteville it would go away. Well it didnt. It continued to follow us. Right after we went through Platteville it got closer to us. We took the backroad that leads to Two rivers parkway and it continued to follow us. When we were approx 10 min from home it got closer and slightly ahead of us. My husband and I started to try to find a rational expanation for why we were being followed. I had let him know about my recent curiosity with ufos and aliens and told him that I have seen other strange lights on our trip home from blackhawk. We always are driving home around 3 or 3:30 in the morning. We go twice a week and we've been going consistently for about 4 years. I do not drink alcohol nor do I take medication. I am very aware of my surroundings and any changes that occur on our trips. My husband got uncomfortable with me telling him that I believed that is was a ufo with a motive of trying to communicate with me. I wasn't scared, in fact when I realized it was following us I figured if it was terrestial it would recognize my receptive reaction and assumed it would follow us home. My husband on the other hand flipped it the bird, and told me it was probably someone in the gov't messing with us. We are law abiding citizens and dont have any reason for the gov't to take interest in us. Well it stopped traveling when we did and parked in the sky to the east. It was not high in the sky like stars, in fact it was only as high as the tower lights that are located directly east of my house. We entered our house and I immediately went to my kitchen window and it was still in the same spot. It did't move. I figured it could sense what I was thinking so I expessed that I was tired and I wanted it to leave us alone. I proceeded to bed. I had to get up in a couple of hours and decided not to look for it until daylight. When I looked for it at 8:00 am it was gone."],"Case Number":"26951","map":"<A HREF = \"http://maps.google.com/maps?q=39.763823,+-105.2134(26951)&iwloc=A&hl=en\"> mufon case (26951) map </A>","City":"Golden","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"IFO","Date of the Event":"12/11/2010 03:30 UTC","Summary":"Bright light possible ufo follows us home.","Country":"United States","Latitude":"39.763823","Object Flight Path":"Undisclosed","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around December 11th 2010"],"Tags":"City","Region":"Colorado"}