{"Latitude":"29.17167","Log Number":"US-12122010-0012","trends":["There has been one other sighting in Angleton","There were no other sightings in Angleton on or around December 12th 2010"],"Object Shape":"Sphere","Weather Factors":"Unknown","City":"Angleton","Tags":"City","Longitude":"-95.429045","files":["/var/www/straped/mufon/html2text/26956.html.txt","/var/www/straped/mufon/org/26956.html"],"Viewing Distance":"Unknown","Object Features":"None","Summary":"Three bright spheres seen flying over freepor/angleton area.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.17167,+-95.429045(26956)&iwloc=A&hl=en\"> mufon case (26956) map </A>","Source":"MUFON","Date Submitted":"12/12/2010 09:23 UTC","Case Number":"26956","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsComing home from Surfside, my grandmother and myself witnessed two bright red objects flying side by side in the distance. As we drove in the direction of the objects I could make out their shape as being sperical. We drove for roughly 3 minutes as I watched the objects when suddenly the craft on the right shot off leaving the other flying alone. Roughly 2 minutes later the second craft faded out almost as if watching a flashlight die out. After returning home we stepped out on the balcony to see if the crafts were back and they were, only this time flying away from eachother. At that point a third craft appeared in the northwest, only this one was massive and blinking a bright white. In the sky this third craft was about half the size of the moon in the sky at the time. I contacted my mother and told her about what was going on when the third craft abruptly turned direction and began to glow red before dropping below the tree line out of site. There then came an unusual amount of planes in the sky and the blinking of their lights was nothing like any of the objects seen. Video captured on cell phone however the crafts are hard to see in it."],"Disposition":"Unknown","Date of the Event":"12/12/2010 07:15 UTC","Sighting Duration":"Undisclosed","Region":"Texas"}