{"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/26950.html.txt","/var/www/straped/mufon/org/26950.html"],"divs":["Sighting DetailsI had come home and let my dogs out and was just standing by my truck. I live out in the country were it's pretty quite. I like to observe aircraft in the area, so when I heard a jet engine I looked up and it was directly overhead, travelling directly east. The first thing I noticed was the 4 vapor trails, then the speed. It was going 3 to 4 times the average speed of a normal jet aircraft. I couldn't believe it! I've never see anything this fast! It was one of those times you wished someone else was there to see it. It was cloudy and overcast on and off, but I saw it the entire time. The other really unusual thing was that I could see the fuselage, which was an odd stretched diamond shape,(not reflecting light), but visable, but could not see the wings! That made it even more wierd. 4 vapor trails, odd fuselage, no wings and very fast! The vapor trails were spaced as normal. Oviously it had wings, but to be able to see the fuselage but not the wings was really odd. It continued east until out of sight, which wasn't very long. I just wish someone else was there to confirm the thing."],"Latitude":"40.06408","Object Shape":"Diamond","Region":"Ohio","City":"Newark","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Longitude":"-82.396614","Summary":"A stretched diamond shape","Object Flight Path":"Straight-line path","Object Features":"Unknown","Date Submitted":"12/12/2010 10:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.06408,+-82.396614(26950)&iwloc=A&hl=en\"> mufon case (26950) map </A>","Disposition":"Unknown","trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around December 11th 2010"],"Log Number":"US-12122010-0006","Date of the Event":"12/11/2010 03:16 UTC","Case Number":"26950","Source":"MUFON"}