{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.400876,+-104.518664(26952)&iwloc=A&hl=en\"> mufon case (26952) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy daughters and I were sitting on the corner of Main St. and Alameda St. last night (December 11, 2010 at 6:20pm) waiting for the light parade to come by. I was bored and looking around myself and noticed two stars in the sky. I realized that one was moving, must have been what caught my attention. I pointed it out to my children, but only the younger one saw it. As we watched I could tell it must have been moving higher and higher because the star was getting smaller and smaller and finally disappeared. I was traveling probably south-south-west in the sky and we observed it for about a minute or so. We were amazed and talked about it for a few minutes and then started watching the street again, still waiting for the parade to start. About one to two minutes later my younger daughter called out that there was a triangle in the sky. This time all three of us saw it. It was about the size of a quarter if I held it at arms length. It was also traveling in the same trajectory as the star-like light we had seen. South-south-west. The angle of the triangle that seemed to be the front, well the two sides that make up that angle were covered with circles. If they were lights, they were not shining, but I guess the reflection from the street lights below allowed us to see them. It could have been a string of balloons....but the triangle itself was solid, not just the lines of the two angles. I could tell the triangle was solid because it was grey in color as opposed to the darkness of the sky. It also blocked out the stars that would have been seen if it wasn't solid. So we thought maybe balloons. One daughter said geese, but no, like I said solid. It flew in the same direction as the other light we had seen and disappeared from our view in about a minute or so. When I looked at my watch, it said 6:23. So maybe a total of 5 minutes through the entire event. My initial reaction was excitement. My second reaction was skepticism, being the parade and being Roswell, someone might have been playing a prank."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Roswell","Latitude":"33.400876","Date of the Event":"12/11/2010 06:20 UTC","files":["/var/www/straped/mufon/html2text/26952.html.txt","/var/www/straped/mufon/org/26952.html"],"Log Number":"US-12122010-0008","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around December 11th 2010"],"Tags":"City","Object Features":"Undisclosed","Summary":"At parade saw star-like ufo moving then disappear followed within mins by triangle.","Region":"New Mexico","Object Shape":"Star-like, Triangle","Date Submitted":"12/12/2010 04:38 UTC","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Case Number":"26952","Country":"United States","Longitude":"-104.518664","Weather Factors":"None"}