{"Tags":"City","Case Number":"26953","Sighting Duration":"00:15:00","City":"Manchester","divs":["sighting detailsfiance went out on the side porch for a smoke. the sun was still below the tree line ..he noticed something in the south east sky remaining still. he called me out to ask what i thought. it was silver in color missle shape with semi circle attachment to one end it stayed still in the sky.. as it was very cold outside we watched it off and on from inside the house and outside the house. it appeared to be using the rising sun to gather engery.. after the first 5 minutes or so the semi circle part started 'pulsating' appeared to be morphing. got a pair of binoculars to watch ; the semi circle thing appeared to morph off of the missle shape object. on one of the many times we went into the house to get warm when we came back out the missle shape object dissappeared. we didn't get to see it leave. i felt transfixed i wanted to share it with others but i didn't want to miss a thing. if it wasn't so cold outside i'm sure we would have never moved until we saw the thing leave. i would love confirmation that someone else saw the same thing. i know it wasn't a plane (never moved) it wasn't a blimp or any type of ballon (wrong shape and again not moving just the semi circle thingy pulsating\\morphing). would love someone with expertise in the matter to reccommend a good telescope that we could use to get closer. would even consider purchasing a really good camera or video camera for the same purpose."],"Weather Factors":"Unknown","Latitude":"42.99671","trends":["There have been 19 other sightings in Manchester","There were no other sightings in Manchester on or around November 28th 2010"],"Log Number":"US-12122010-0009","Viewing Distance":"Over One Mile","Date of the Event":"11/28/2010 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.99671,+-71.445119(26953)&iwloc=A&hl=en\"> mufon case (26953) map </A>","Date Submitted":"12/12/2010 05:32 UTC","Disposition":"Unknown","Object Features":"Other","Longitude":"-71.445119","Country":"United States","Region":"New Hampshire","Object Flight Path":"Stationary","Summary":"Silver missle shape with a half circle appeared to be using the rising sun to power up","Source":"MUFON","Object Shape":"Bullet, Missile","files":["/var/www/straped/mufon/html2text/26953.html.txt","/var/www/straped/mufon/org/26953.html"]}