{"trends":["There have been 18 other sightings in Coral Springs","There was one other sighting in Coral Springs on or around December 11th 2010"],"Region":"Florida","divs":["Sighting Details(10:55 pm) on December 11, 2010 in Northwestern Broward County (South Florida). My boyfriend and I were doing laundry at the local laundry mat. We parked in the back of the building which is on a main road that runs west and east from the Everglades to the Atlantic Ocean. This location is about 10 blocks from the Everglades which is right on the otherside of the Sawgrass Expressway (literally). My boyfriend went inside to check on the clothes in the dryers and I stayed in the passenger seat of our car. I was watching videos on my phone when I got a weird urge to look out at the sky so looked out the passenger window. I was shocked to see what appeared to be the big dipper constellation because stars are hard to see in our city due to all the light pollution. What caught my attention was that more of these \"stars\" began to appear. I then realized I was looking at a cluster of orange orbs moving rapidly from west to east and immediately got out of the car. I yelled for my boyfriend to come outside NOW! And I'll be darned if as soon as I did they begand to disapear. By the time my boyfriend was able to get outside only 3-5 were left. They made no sound. This entire event took place in the span of about 20 seconds. I am very dissapointed that I did not have a chance to grab any videos or pictures. I have lived in Broward County my whole life and never saw anything like this before. As a resident here I am very familiar with how airplanes appear at a low altitude since I work right next to an executive airport and Fort Lauderdale International is right off of I95. Anyone who has driven on I95 enough times could tell you about seeing the que planes form before landing and experiencing having a boeing fly 50 ft above your car as they drop the gears for a touchdown. These were NOT planes. I was a logical optimist; a \"the universe is too vast for us to flat out say we are alone\" type of person. I am undoubtedly a believer now."],"map":"<A HREF = \"http://maps.google.com/maps?q=26.273592,+-80.269304(26963)&iwloc=A&hl=en\"> mufon case (26963) map </A>","Longitude":"-80.269304","Weather Factors":"Windy","Country":"United States","Date Submitted":"12/13/2010 05:10 UTC","Object Shape":"Star-like, Other","Tags":"City","files":["/var/www/straped/mufon/html2text/26963.html.txt","/var/www/straped/mufon/org/26963.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"26.273592","Source":"MUFON","City":"Coral Springs","Object Flight Path":"Straight-line path","Date of the Event":"12/11/2010 10:55 UTC","Disposition":"Unknown","Object Features":"Unknown","Case Number":"26963","Log Number":"US-12132010-0004","Summary":"Multiple Orange Orbs Flying West to East Over West Fort Lauderdale"}