{"files":["/var/www/straped/mufon/html2text/26964.html.txt","/var/www/straped/mufon/more/26964_submitter_file1__object1208.png","/var/www/straped/mufon/org/26964.html"],"Source":"MUFON","Date Submitted":"12/13/2010 05:13 UTC","Sighting Duration":"00:01:00","Longitude":"-96.026451","Summary":"Dark object with 3 white lights","Disposition":"Unknown","Country":"United States","Tags":"City","Region":"Texas","Log Number":"US-12132010-0005","Object Shape":"Circle, Oval","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Latitude":"32.218725","Date of the Event":"12/08/2010 06:38 UTC","trends":["There have been no other sightings in Log Cabin","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.218725,+-96.026451(26964)&iwloc=A&hl=en\"> mufon case (26964) map </A>","Object Flight Path":"Undisclosed","City":"Log Cabin","Case Number":"26964","divs":["Sighting DetailsThe wife and I had driven to San Angelo from Brownwood that day to find some good food we'd read about on the internet. We were just a mile west of Santa Ana on our way home and it was just now becoming completely dark. I observed the object just 15 degrees to the right of the road from my point of view in the passenger seat. At first I thought it was a really low plane but there's no airport for quite a while, and it was a quiet night with no sounds at all but the car running. I watched the object which seemed to be just a hundred feet up hovering and turning clockwise. I could tell it was turning because it had three very bright white lights, and I could see the round shape, but there were no blinking lights and the lights weren't pointed down like any plane light I'd ever seen. It was a perfectly clear night too. At first I thought it was a plane turning, but the lights kept coming around the object, two lights showed and then three as one would rotate out of view and another would appear from the other side. It made about ten revolutions and disappeared completely.. no more lights, no more dark spot. I might have blinked! 5 seconds later my wife said, \"did you just see that?\" And I said, \"Yes, I did, but kept silent from the awe.\" She said the same. We slowed and looked around. The only other traffic was an 18-wheeler behind us and he slowed too and seemed to be looking for the object also! We pulled over to let him pass but he just waved and pointed up, so we knew he had seen it too! I didn't even try for the camera since it was so dark it would have never made a decent photo or video. It took me almost a week to report because I thought \"nobody would believe this\" and I probably listened to way too much Art Bell in the 90s, but I checked the time before and after and wrote down where we were as soon as we started moving again. I whipped up a drawing in paint...and my wife said it was pretty exact, so here it is!"],"Object Features":"Undisclosed"}