{"files":["/var/www/straped/mufon/html2text/26960.html.txt","/var/www/straped/mufon/org/26960.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Square, Rectagular","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.260385,+-85.751846(26960)&iwloc=A&hl=en\"> mufon case (26960) map </A>","Date Submitted":"12/13/2010 08:56 UTC","Latitude":"38.260385","Log Number":"US-12132010-0003","Disposition":"Hoax","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around December 11th 2010"],"Date of the Event":"12/11/2010 12:00 UTC","Object Flight Path":"Stationary,Other","Summary":"Looked like \"grand opening\" spot lights rotating through the sky","Case Number":"26960","Tags":"City","Source":"MUFON","Longitude":"-85.751846","Country":"United States","City":"Louisville","Weather Factors":"Unknown","divs":["Sighting DetailsIt was around 9pm on the night of December 11th 2010, I was walking out to my balcony and noticed a light swinging behind a thick sky of clouds. When I stepped further out I noticed there was a total of \"4\" lights. They seemed as if they were 2 pairs. They would rotate around in a small circle, it seemed like every 4th or 5th rotation, one of the lights would swing further outside of the regular circular path the lights were in. I have lived in Louisville all my life and there were no \"grand openings\" that night. Where the area the lights came from is nothing but a few churches and neighborhoods, so I am 100% sure they were not just spotlights. After watching the object for a few minutes I felt like it was getting closer. Inside i felt like this was something supernatural. After going inside and talking to one of my brothers he claimed he saw something similar within the previous week of myself spotting this (these) object(s). I went inside to put my daughter to sleep and went back out afterwards. The object was gone..."],"Region":"Kentucky"}