{"trends":["There have been 20 other sightings in Santa Monica","There were no other sightings in Santa Monica on or around December 1st 2010","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Longitude":"-118.483381","Log Number":"US-12132010-0003","Tags":"City","Latitude":"34.023044","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.023044,+-118.483381(26962)&iwloc=A&hl=en\"> mufon case (26962) map </A>","Region":"California","Case Number":"26962","Date of the Event":"12/01/2010 05:09 UTC","Weather Factors":"Unknown","Date Submitted":"12/13/2010 04:13 UTC","City":"Santa Monica","Sighting Duration":"Undisclosed","divs":["sighting detailsthere are now multiple angles of footage on both december 1st and december 8th of strange falling fireballs over santa monica. we have footage by multiple witnesses footage from multiple vantage points footage from two different dates footage with electronic time, date and location metadata event one - december 1st, 2010 5:09pm *(links moved to additional evidence section -- cms\\sg). event two - december 8th, 2010 5:25pm *(links moved to additional evidence section -- cms\\sg). ch4 television footage (bill nye said i might have put \"brine shrimp\" aka sea-monkeys in my video somehow... clearly with all the other films by witnesses on both dates, bill's statement is fase) *(link moved to additional evidence section -- cms\\sg). santa monica daily press coverage *(link moved to additional evidence section -- cms\\sg). help investigate facebook group *(link moved to additional evidence section -- cms\\sg). my personal account of the dec 1st 2010 incident and my silver surfer ufo video this happened on december 1st, 2010 at 5:09pm on a walk in santa monica california. my wife and i were walking west about 17 blocks from the ocean when we saw these bizarre objects in the sky. it happened so fast, i barely was able to film... and i went off the objects to get a better vantage point, so only caught them for a brief moment at the beginning of the film. i really messed up the recording because i didn't know how fast it would all happen. fortunately i caught a brief moment of the objects using my iphone. i have no idea what they were... but as you can see... they were big and high in the air (seemingly over the ocean) and shooting off some kind of myst, contrail or light. the top one changed directions twice that you can see on the film if you forward through the beginning frame by frame. both objects were dropping really fast. when i was walking across the street to get a better vantage point, the iphone was unable to refocus the light, and you can't really see much after i cross the street... but you can hear in my voice that the objects were weaving back and forth like the \"silver surfer\". these things just dropped super fast. they had these crazy short contrails... and weaved back and forth as they dropped. there were not any planes visible that the objects could have been dropped out of... and what the hell were the contrails coming off of them?!?! it really looked like the \"silver surfer\" from a cartoon. crazy... and i have no idea what they were... but just wanted to share. i wish i had a better vantage point when i was filming. it does not look nearly as impressive on-screen, but i tell you that seeing it was totally wild and bizarre. at least you can see how about how big the objects were, what they looked like with the contrails, and that they were changing directions and dropping rapidly. i am just glad i caught even a moment of it on film. anybody else see anything like this before? anyone else see this that night in santa monica? maybe someone knows what they were."],"Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/26962.html.txt","/var/www/straped/mufon/org/26962.html"],"Object Shape":"Fireball, Other","Object Features":"Undisclosed","Disposition":"IFO","Summary":"SILVER SURFER UFO - Fireballs over Santa Monica on Dec 1st and 8th 2010"}