{"Source":"MUFON","Disposition":"IFO","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Latitude":"32.856186","Region":"New Mexico","Weather Factors":"None","Date Submitted":"12/14/2010 03:09 UTC","files":["/var/www/straped/mufon/html2text/26970.html.txt","/var/www/straped/mufon/more/26970_submitter_file1__3.jpg","/var/www/straped/mufon/more/26970_submitter_file2__4.jpg","/var/www/straped/mufon/more/26970_submitter_file3__5.jpg","/var/www/straped/mufon/org/26970.html"],"Date of the Event":"03/23/2001 02:00 UTC","Log Number":"US-12142010-0004","Longitude":"-107.979761","Summary":"SOLARE FLARE, STARS AND MOON","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"26970","Country":"United States","divs":["sighting detailsthe sun(solar flare) moon and stars(angels) pictures in video were taken in mimbres, new mexico in the year 2001. the sight was awesome and the pics do not do justice to the event. the cloud of fire was huge and powerful yet beautiful and calm. there were many stars flickering as if agitated inside the \"sun\" and many other things going on inside. it was transparent as if though you were looking through a portal to all the galaxies and universes. there were also two other witnesses. one of the pics was on the front page in a small corner of the sun news in silver city that i believe read \"solar flare in mimbres.\" mimbres is approximately 25 miles east of silver city. i was a freelance photographer for them and the pic in the newspaper was from them developing the negatives and scanning them as they had new equipment to be able to do that. i still have the negatives and many are aware of this. *several youtube links moved to additional evidence section--cms\\sg. if you look at the videos they will tell you where i was and what i was doing. the event happened in a small town called mimbres, next door to the mimbres restaurant at a two story house. i have the negatives in a safe place. i was not afraid but the other two were excited and seemed fearful. i was upset because i was awakened from a beautiful dream, as sometimes i do have and was upset because i was wakened. i was dreaming i was in the solar flare and looking down and beside were two peopl, i belive, but could not see their faces as they were white like lightning. as we were coming over the horizon i noticed that landscape and it was dark and remembered that i had to go down but there was no ladder an all of a suuden all i saw were tree branches and the roof of the two story house i was sleeping at when all of a sudden i hear the door flung open and somebody saying \"grab your camera and look outside.\" in the dream it felt as though the people that were beside me were my equals and did not feel like an abduction. it was most awesome and i did not want to come back down. when i raced down and saw the solar flare the other witness who was still watching, i believe, said that one of the stars shot down over the house or shot a beam but i believe he said one of the stars shot down over the house."],"Object Features":"None","Viewing Distance":"Unknown","trends":["There have been no other sightings in Mimbres","This sighting has never been favorited."],"Object Shape":"Circle, Diamond, Disc, Fireball, Flash, Sphere, Square, Rectagular, Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=32.856186,+-107.979761(26970)&iwloc=A&hl=en\"> mufon case (26970) map </A>","City":"Mimbres"}