{"Source":"MUFON","Longitude":"-84.589943","Latitude":"38.682012","divs":["Sighting DetailsI had just taken my dog out for a walk, and decided to stay out a few more minutes to look at the meteor shower. I had counted 9 meteors as I stood there smoking a cigarette and looking skyward. Just as I finished my cigarette I took one last look skyward, and was about to head inside. Suddenly I noticed a silent shape moving directly through my field of vision traveling from NNW to SSE. The shape was in a V of solid mass at, what I assume was, a high altitude. At first I tried to dismiss the sighting as ducks or Geese but then realized that it was moving too fast. The object was unlighted and entered and left my field of vision within seconds. Moving at a speed that was faster than a commercial airliner could leave my field of vision seemed unlikely for birds. As soon as the object was out of sight, I came inside, told my wife what I had just seen, then grabbed my iPhone and began this report. I know geese generally fly and make noise as well so the fact there was nothing but silence and the speed combined slowly made me realize this had to be something else. What it was, I don't know!"],"Summary":"Sighted V shape during Geminid observation","Object Flight Path":"Straight-line path","City":"Dry Ridge","Object Shape":"Boomerang, Other","Disposition":"Unknown","Date of the Event":"12/14/2010 03:43 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:00:08","Tags":"City","Log Number":"US-12142010-0005","map":"<A HREF = \"http://maps.google.com/maps?q=38.682012,+-84.589943(26971)&iwloc=A&hl=en\"> mufon case (26971) map </A>","trends":["There have been 2 other sightings in Dry Ridge","There were no other sightings in Dry Ridge on or around December 14th 2010"],"Case Number":"26971","Date Submitted":"12/14/2010 04:09 UTC","files":["/var/www/straped/mufon/html2text/26971.html.txt","/var/www/straped/mufon/org/26971.html"],"Weather Factors":"Unknown","Country":"United States","Region":"Kentucky","Object Features":"None, Unknown"}