{"Date Submitted":"12/14/2010 05:41 UTC","Sighting Duration":"00:01:15","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.129608,+-80.141409(26986)&iwloc=A&hl=en\"> mufon case (26986) map </A>","City":"Fort Lauderdale","Weather Factors":"None","Country":"United States","Object Flight Path":"Other","Object Features":"None","Log Number":"US-12142010-0020","files":["/var/www/straped/mufon/html2text/26986.html.txt","/var/www/straped/mufon/org/26986.html"],"trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around November 26th 2010","This sighting has never been favorited.",""],"Tags":"City","Longitude":"-80.141409","divs":["Sighting DetailsI was hanging out with three friends, and a mutual friend of theirs. Two of the friends were a couple, and they left to get dinner, so the rest of us returned to my friend's condo, which is near Marina Mile and I-95. We were standing on the balcony smoking cigarettes, when my attention was drawn to a flash of light out of the corner of my eye. I looked to the east-northeast and, between some tall slash pines, I saw a strange object. It was at least a few miles away but, without any reference for its size or distance in relation to other points, I cannot be much more certain of its position. It was a glowing white \"sphere\" (or something like a sphere). It dove straight down, and as it moved a trail of sparkling white light trailed behind it, almost like the trail of certain meteorites. Then it \"zigged\" (for lack of a better term to describe its motions) quickly to my right (probably moving east-southeasterly) and slightly down at an angle a short distance. At first I thought it might be a firework. Then it stopped, and the sparkling trail stopped at the same time. I was confident at that moment that it was not a firework, and I pointed it out to my friend and his friend. As we looked, the object zigged back to my left (probably moving north-northwesterly) and down at a slight angle about the same distance from where it started that it had moved to the right, the sparkling trail of white lights one again following behind. My friend's friend suggested that it was a plane, or a helicopter, but me and my friend were quite certain it was not, and were asking each other and ourselves aloud what the object was. During this time it zig zagged twice more, first right then left, about the same distance as its the sparkling trail following when it moved and disappearing when it stopped, and then simply faded away. Immediately after it disappeared, a second object appeared right where I had noticed the first object. Like the first object it was a white glowing sphere. Like the first object it first dove straight down, the trail of sparkling light following. Then, like the first object, it zig zagged right and left, following roughly the same pattern as the first in terms of direction, angle, distance, and velocity and also stopping at the same places and for the same amount of time. After it zig zagged about four times, it proceeded to start diving up and down, at slight angles, the trail still following it when it moved and disappearing when it stopped. At one point it dove up and stopped and then faded to a dim point of light, almost unnoticeable, in fact I thought for an instant that the object had disappeared, but then it flashed back to its previous intensity and started diving slowly down. Finally it dawned on me to ask if anyone had a cameraphone, which my friend did, and was able to catch the last 22 seconds of the sighting, by which time the object was very low, at times partially hidden by the tree, and its movement up and down and side to side became much more slight than it had been previously. My friend's friend was behind us, having gone back into the condo, and was making jokes, obviously thinking we were fools and that the objects were (as he had maintained) a plane or a helicopter. We thought no less foolish of him given that the objects clearly did not behave like or appear like any airplane or helicopter that exists. At some point the object disappeared, possibly behind the trees, or behind the interstate, or both, or maybe it just disappeared like the first, we could not be certain. Afterwards me and my friend spent a great deal of time asking each other what the heck we had just seen. It was not the first time I had seen a UFO, as it was in his case, but it was the first time I had seen more than one at a time. We told our two friends, the couple, about it when they got back, and tried to show them the video but, unfortunately, on a cameraphone screen it was not very impressive, plus we had been very late and missed most of the action, but on a larger screen it is somewhat more convincing. We wished we had not been so hypnotized by the incident that we were slow in recording it."],"Viewing Distance":"Over One Mile","Source":"MUFON","Object Shape":"Fireball, Flash, Sphere","Summary":"Two Sphere Shaped UFOs with Flashing Trails Zig Zagging Across the Sky","Latitude":"26.129608","Case Number":"26986","Date of the Event":"11/26/2010 05:20 UTC","Disposition":"Unknown"}