{"Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Southfield","There were no other sightings in Southfield on or around December 14th 2010"],"Summary":"UFO Skeptic","Longitude":"-83.219333","Date of the Event":"12/14/2010 07:12 UTC","Case Number":"26989","Log Number":"US-12142010-0023","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.481689,+-83.219333(26989)&iwloc=A&hl=en\"> mufon case (26989) map </A>","Region":"Michigan","Object Features":"Undisclosed","divs":["Sighting DetailsI was driving into work and looked to my right over the trees, I noticed what I thought was an airplane. The object was traveling straight down. I thought it was an airplane that was going to crash. It was heading nose down like it was falling. The object disappeared over the trees. I was expecting to hear a boom and feel a tremble as a result of the \"airplane\" crashing. I looked to my left and saw the object on the other side of the highway ( the highway is 4 lanes, north and south)I couldn't fathom how the object was able to get from my right to my left as quickly as it did. I then looked above me an saw another oval shaped object. I thought it might have been a helicopter but I didn't see any propellers (dawn was breaking). I noticed a halogen light under the second object and lights all around it. The object traveled in a straight horizontal plane and immediately changed direction as if it was doing a nose dive. I have never seen maneuvering as these object displayed. I mean, the second object was flying straight and without a second thought or hesitation changed it's direction to completely vertical. I tried to catch the event on my cell phone. When I played the recording back, nothing was captured. I was completely freaked out especially because I don't believe in UFO's!"],"files":["/var/www/straped/mufon/html2text/26989.html.txt","/var/www/straped/mufon/org/26989.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","City":"Southfield","Disposition":"Unknown","Object Shape":"Oval","Date Submitted":"12/14/2010 08:22 UTC","Latitude":"42.481689","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed"}