{"Viewing Distance":"Unknown","Tags":"City","Date Submitted":"12/14/2010 12:58 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.453183,+-71.637409(26980)&iwloc=A&hl=en\"> mufon case (26980) map </A>","files":["/var/www/straped/mufon/html2text/26980.html.txt","/var/www/straped/mufon/org/26980.html"],"Log Number":"US-12142010-0014","Disposition":"Unknown","Latitude":"43.453183","trends":["There have been 3 other sightings in Franklin","There were no other sightings in Franklin on or around August 6th 2010"],"Source":"MUFON","divs":["Sighting DetailsIt was a cool summer night. My mother was sitting on the porch with me. It was the end of a long day, and as usual we decided to stargaze. We very often would stargaze and nothing out of the ordinary would ever happen. I have lived in the same house my entire life, stargazed on the same porch my entire life. Before this event I only had one other supposed UFO encounter, and I was only a kid and I don't remember all too much about it. I didn't think much about it after. This event was more recent. It happened August of last summer. My house is located in a quiet neighborhood, connected to what can barely be considered a city. Seems like more of a town to me. Anyways, we were sitting on the porch, looking at the stars, pointing out constellations, planets, and what we believed to be a satellite. My stare was focused on this object until my mother pointed out another, more interesting object in the sky to me. An incredibly small, orange glowing dot was floating across the sky. We assumed it was a star, until it began to move. It first floated in our direction. It was not blinking, it was just a solid bright orange. It suddenly stopped. Without curving it's path, it floated to the right. Then, it floated to the left, again without turning or curving it's path. Like if a car wanted to do a U turn, but instead just drove in reverse, or just switched the driver seat around. While going left, a plane crossed it's path. The plane was heading towards us. It seemed to come out of nowhere. It met the orange glowing dot at what seemed like exactly 90 degrees. A few seconds after the plane and the dot crossed paths, the dot quickly faded away. The plane continued it's straight path for a short while, then began to slowly turn left. A minute later, two planes flying paralell to each other passed over the area where the dot dissapeared. Throughout all of this, we were in awe. All we could say was \"Do you see that?What is that? Wow!\" We weren't scared, but we were confused and amazed. After it was over and done with, we laughed and discussed what we saw. And like any teenager, I reported the event on my facebook page."],"Longitude":"-71.637409","Date of the Event":"08/06/2010 10:00 UTC","Country":"United States","City":"Franklin","Object Flight Path":"Undisclosed","Region":"New Hampshire","Sighting Duration":"Undisclosed","Summary":"It looked like an orange flying star. It did not blink. It moved across the sky and switched direction without turning.","Weather Factors":"Unknown","Object Features":"Undisclosed","Case Number":"26980","Object Shape":"Star-like"}