{"trends":["There has been one other sighting in Robb","There were no other sightings in Robb on or around November 29th 2002"],"Source":"MUFON","Date of the Event":"11/29/2002 09:00 UTC","Summary":"Beryl underneath light focused on we two:Lone humanoid beard saucer bay window musical-light, sudden dissapeared;scaly patches necks. Family CourtLoss relieved Judge&Lawyer died suddenly:Odds? Dreams Visions Presence JesusChrist Godlike.","divs":["sighting detailssee above: the purple light focused on my dear i & our cat, as i walking approached, i was told of this light. the twinkling within that light, as i stepped into it, had a certain familiar or sensitive tune to it... standing there the cat(our pet of some then 6 years-lived in outside perchhouse) jumped free of arms in that light to his other perch, my dear & i within that light. when i finally looked up, i saw the saucer, and side window a human looking bearded man! i observed his stance, then saw he was bearded very biblical looking. later we attended physician (of some 7 years) :not telling of close encounter of 4\\5 kind(yes?) nor even of sighting of ufo. kept stricktly secret until i let it out summer 2003.we had a family court matter ended badly needed no further troubles. more persecutions also from telling. reality for some, unfortunately, is lives of persecutions from neighbours, ;family-members, sometimes are the worst! we have had our share suffice to say. the malefactors lawyer died, suddenly when my stenographer called then called back said he had just died upon information recd. only just. then we also learned that the obnoxious and offensive justice, in error (respectfully) his judgement was made in terrible error. nonetheless upon efforts to remedy he died. nearly the same day or perhaps week as the lawyer. we are uninformed as to the exact dates, as yet. nonetheless, i fear these sightings are of a biblical nature. our sighting was almost godsend. by god's law we were reunited, saved from further direct persecutions after our reunion, for the most poart. please consider whether my experiance might be carefully made public. i am tired of being persecuted, even for these... seal esq to jc"],"Object Flight Path":"Stationary","Sighting Duration":"00:03:00","Latitude":"53.221643","Log Number":"CA-12142010-0019","map":"<A HREF = \"http://maps.google.com/maps?q=53.221643,+-116.983777(26985)&iwloc=A&hl=en\"> mufon case (26985) map </A>","Country":"Canada","Tags":"City","Date Submitted":"12/14/2010 05:23 UTC","Object Shape":"Disc","Case Number":"26985","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/26985.html.txt","/var/www/straped/mufon/org/26985.html"],"Weather Factors":"None","Object Features":"Dome, Window(s), Other","City":"Robb","Longitude":"-116.983777","Disposition":"Unresolved","Region":"Alberta"}