{"Source":"MUFON","Object Shape":"Boomerang","Latitude":"30.460783","Log Number":"","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=30.460783,+-91.13804(2698)&iwloc=A&hl=en\"> mufon case (2698) map </A>","Summary":"4 unusual flying aircraft","Longitude":"-91.13804","Tags":"City","Date of the Event":"11/24/2003 02:35 UTC","Object Features":"Undisclosed","City":"Baton Rouge","Case Number":"2698","trends":["There have been 27 other sightings in Baton Rouge","There were no other sightings in Baton Rouge on or around November 24th 2003"],"files":["/var/www/straped/mufon/html2text/2698.html.txt","/var/www/straped/mufon/org/2698.html"],"Sighting Duration":"00:00:59","Date Submitted":"11/24/2003 02:35 UTC","Country":"United States","Disposition":"Unknown","Weather Factors":"Windy","Region":"Louisiana","divs":["Sighting DetailsI was driving my car into a supermarket parking lot and saw what appeared to be3 flying objects aircraft in close formation to the NW above the I-10 interstatein Baton Rouge. They were sighted from their sides and it appeared as if thelead object was a larger one later when I observed them banking---seeing theunderside, I saw 4 objects, so I believe 2 separate objects visually merged inmy field to look like one larger one. The flying objects looked like aircraft,but behaved very differently. First of all they seemed to be traveling veryslowly....and completely silently...they were fairly close...also, no exhaust orcontrails were seen. The day was cool, a little windly, completely cloudless. It appeared almost as if I was looking at a film slide of 3 or 4 aircraft---minus contrails----projected onto the sky....they just caught my eyebecause they werent behaving correctly or as per usual. The craft then move VERYrapidly and silently to the east...in a matter of seconds they were dots in theeastern sky--- Their sight was blocked by a large portion of an overpass of theI-10. Then I saw the 4 craft emerge beyond the side of a large hotel. Theywere banking I believe is the term...the underside was visible and waswhite-ish. There were 4 and they looked like jets---maybe stealth-bomber-ish. They were in formation the whole time...then it appeared as if theyvanished....I never saw tem emerge from the other side of the hotel. Perhapsthey took off at a high rate of speed. Even commercial jets dont vanish thatquickly...so I guessed that they were military flying in formation gave thataway I guess but I was shocked at how FAST they were and completely silent thewhole time...no contrails also. And initially when I saw them they moved soslowly they were almost in slow motion...or hovering. VERY WEIRD."],"Object Flight Path":"Unknown"}