{"map":"<A HREF = \"http://maps.google.com/maps?q=19.642676,+-155.993376(26994)&iwloc=A&hl=en\"> mufon case (26994) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/26994.html.txt","/var/www/straped/mufon/org/26994.html"],"trends":["There have been 2 other sightings in Kailua-Kona","There were no other sightings in Kailua-Kona on or around December 14th 2010"],"divs":["sighting detailsmy mom spoke with me after dinner, telling me of a meteor shower in progress. this is nothing out of the ordinary to me, having grown up on the big island of hawaii there always seems to be such an opportunity. i live on the kona side of the big island and my house sits 3 miles from kailua pier. i stepped out just after our talk to watch right around 8:30pm . nothing to see for the most part. better than half a moon out, slight cloud cover over hualalai. only the brightest stars stood out over the moonlight, including the north star and most of orion. i heard the sound of a jet engine, (perfectly normal) shrugged it off. however, it continued longer than normal, so i looked up. it was a perfect triangle of red lights. big deal. military has a newfangled weapon. 5 minutes later: same sound, same flight path\\slightly more south. ok, big deal, right. what cooks my noodle is the two visible anomalies happening between the aircraft. one was a visible cluster of faint stars which aligned like the 3 sisters. i watched as it became the square brothers and so on... not only did the number of 'stars' change, but the intensity and color would change dot to dot without any clouds nearby. the other anomaly, (to my right when looking up the mountain) was a venus lookalike with slight, sporadic lateral\\vertical movement. by venus, i mean red\\orange. these objects will probably still be there as i type this. i have seen too many to not put in two cents at least. i was happy to see them for another night in a row- first time for me. i stopped counting how many anomalies i've seen. first one will always be the best. ... silver ball, clearest day you can find. i would like to talk to someone who is interested and willing to listen."],"Summary":"military triangle watched by star-like","Region":"Hawaii","Object Flight Path":"Straight-line path","Disposition":"Unknown","Case Number":"26994","Object Shape":"Star-like, Triangle","Log Number":"US-12152010-0002","Weather Factors":"Unknown","Date Submitted":"12/15/2010 02:42 UTC","Latitude":"19.642676","Viewing Distance":"501 Feet - 1 Mile","City":"Kailua-Kona","Longitude":"-155.993376","Date of the Event":"12/14/2010 12:00 UTC","Object Features":"Undisclosed","Tags":"City","Country":"United States"}