{"Log Number":"US-12152010-0005","Disposition":"IFO","Summary":"3 objects flew in large slow circles counterclockwise in the sky","files":["/var/www/straped/mufon/html2text/26998.html.txt","/var/www/straped/mufon/org/26998.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Unknown","Date of the Event":"12/12/2010 07:16 UTC","Latitude":"29.378013","Case Number":"26998","trends":["There have been 2 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around December 12th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.378013,+-95.105762(26998)&iwloc=A&hl=en\"> mufon case (26998) map </A>","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Weather Factors":"Unknown","Longitude":"-95.105762","divs":["Sighting DetailsMy moms friend that lives about 4 miles away called and said to look in the sky to see the slow moving lights that she had seen the day before that would get low and shine a spotlight of some sort down on the ground. We made our way outside to the back pasture to look for these \"aliens\". We spent at least 10 minutes observing them before the 3 flying objects went away, they seemed to be playing ring around the rosie in a counterclockwise direction. Each \"ufo\" had green red and white flashing lights as to be an actual legit aircraft of some sort. You couldn't see the shape of the objects. From a distance the appearance of these lights glowed like the light of a fire inside a lantern. My parents and I didn't witness any lights shining down to the ground as the friend did the night before with these objects. When they were almost overhead, you could hear a motor but it wasn't the sound of a helicopter or an airplane. I called my local police station which didn't know about it and they said they would send someone out in the vacinity to look into it. One by one these objects seems to stop the circling formation and disappeared from our view."],"Country":"United States","Object Features":"Unknown","City":"Santa Fe","Region":"Texas","Tags":"City","Date Submitted":"12/15/2010 09:49 UTC"}