{"Object Shape":"Other","Object Flight Path":"Straight-line path","divs":["Sighting DetailsThere were actually two seperate events on the same day. The first was around noon. My thirteen year old daughter saw this, I did not and she helped me in writing this report. She is homeschooled and in ninth grade, so she is home during the day. She heard a very loud sonic-boom type sound and the ground shook. She looked out our front downstairs window and saw an extremely large bell-shaped object, almost like a giant Hershey Kiss candy- brownish-silverish in color. She could see two grey chinook helicopters, one on either side- one slightly in front of the object on the opposing side, the other facing her was closer to the object's rear. To compare the size of the object with the chinook's size- the object being a Hershey kiss candy- the chinook would be no larger than an ice-cream sprinkle. They were flying beyond a tree line around residential areas, we belive above an area of open land set for possible future housing. They seemed to dissapear and my daughter witnessed two black helicopters right afterward flying the same path. During this event my daughter also saw some neighbors across the street, closer to the described object, come outside- two parents and a small child. She said that they all pointed toward the object, appeared to be screaming, then the mother went inside, quickly returning with a video camera. She thinks they might have gotten footage as the object and chinooks were not traveling very fast. The child was crying and all seemed very disturbed and went quickly inside their house after the event was over. We do not know them personally and have not approached them. The second sighting was later that evening around 6:30 pm and it was dark by that time. Some of my kids and I were leaving the house and went outside to get in the van. This time my thirteen year old daughter, my seven year old son and I all saw an object in the same place and same direction that the other object was traveling earlier. I saw what appeared to be an enormously large object, obviusly round in shape to some degree as there were several lights in a round formation. I recall red and clear or yellow lights but couldn't see a bell shape for sure. My daughter saw the faint outline of the same bell or Hershey kiss shape she saw earlier but with lights in red, blue, and yellow around the base and one red at tip. We did not hear any loud noises nor did the ground shake this time and there was no evidence of any other planes along with it this time. It dissapeared beyond the trees. I remember yelling \"What the frig is that?\" or a similar expletive and just being held in awe by the size and apparent low-flying flight path of the object."],"Latitude":"40.043396","Longitude":"-76.296944","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=40.043396,+-76.296944(26993)&iwloc=A&hl=en\"> mufon case (26993) map </A>","Case Number":"26993","Weather Factors":"Windy, Does Not Apply","Log Number":"US-12152010-0001","Summary":"Enormous bell shaped object surrounded by two chinooks","Date Submitted":"12/15/2010 01:12 UTC","files":["/var/www/straped/mufon/html2text/26993.html.txt","/var/www/straped/mufon/org/26993.html"],"Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"12/13/2010 12:15 UTC","City":"Lancaster","Region":"Pennsylvania","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Country":"United States","trends":["There have been 22 other sightings in Lancaster","There were no other sightings in Lancaster on or around December 13th 2010"]}