{"Country":"United States","Region":"Virginia","trends":["There have been 10 other sightings in Alexandria","There were no other sightings in Alexandria on or around December 14th 2010"],"Longitude":"-77.040621","Date Submitted":"12/14/2010 09:02 UTC","Summary":"Bright green irregular-shaped light flew into my view and out of sight in 3-4 seconds.","files":["/var/www/straped/mufon/html2text/26990.html.txt","/var/www/straped/mufon/org/26990.html"],"divs":["Sighting DetailsI was outside behind my house (which faces several hundred acres of woods) at 5:40 a.m. this morning; it was still dark and there was no light except starlight. From behind me and overhead (from southwest to northeast) a green light in motion suddenly appeared (it came from the direction from over my left shoulder and into my view), flying quickly overhead and away from me in a straight direction, disappearing behind a neighboring row of townhomes. I waited to see if there was a flash of light -- in case whatever it was hit the ground or exploded in the air -- but heard and saw nothing else. (I never heard anything, even when it was right overhead). The light was bright green and irregularly shaped -- somewhat oval -- but more like if you had two ovals on top of one another and then offset them so that they started to make a V shape, but not quite. The edges of the light were crisp, and it did not appear to be anything but light (there was no visible aircraft emitting the light). The entire event only lasted 3-4 seconds, but it was impossible to miss and I would swear in court that I am 100% certain what I saw (I have a government clearance and am trained in emergency planning, and have learned to be observant.) It is difficult to estimate how high the object was (and therefore the size), but it was below the clouds that were in the sky at the time (which seemed fairly low), because as it passed by the clouds above, it was still visible beneath them. I know it was not a plane because plane lights are yellow or white and this was bright green, plus it was not shaped like a plane, was moving faster than any plane I've seen, and did not make any noise (you can always hear when a plane is flying overhead, especially if it was as low as this light seemed to be). It was not a meteor (I've seen many), and not a searchlight (for it to have been a searchlight, the searchlight would have had to have been positioned in the woods behind my house, and there is nothing there but 200 acres of woods; also, I would have seen the beam of light coming up from the searchlight, and there was no beam of light, just the light flying across the sky). I have absolutely no idea what it was I saw!"],"Object Features":"Undisclosed","Date of the Event":"12/14/2010 05:40 UTC","Sighting Duration":"00:00:04","Case Number":"26990","Log Number":"US-12142010-0024","City":"Alexandria","Latitude":"38.811716","Tags":"City","Object Shape":"Oval, Other","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.811716,+-77.040621(26990)&iwloc=A&hl=en\"> mufon case (26990) map </A>","Weather Factors":"Unknown"}