{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.282683,+1.085609(27007)&iwloc=A&hl=en\"> mufon case (27007) map </A>","Weather Factors":"None","Country":"United Kingdom","Summary":"See detailed narrative.","City":"Canterbury","Longitude":"1.085609","Date Submitted":"12/16/2010 10:02 UTC","files":["/var/www/straped/mufon/html2text/27007.html.txt","/var/www/straped/mufon/org/27007.html"],"Tags":"City","Date of the Event":"07/01/2010 10:30 UTC","divs":["sighting detailsi was at my friends house in his back garden and we was on his trampoline when something inside me was telling me to look up and check out the sky so i did so and as i was looking i seen this tiny oval star-like object spinning and changing colour from green to red to amber i told my friend and he was amazed not long afterwards we went back to my house were i thereafter watched it from my bedroom window. i knew it was a ufo\\alien spaceship because i am interested in ufos and learn about them on they internet so i was sure of what it was then after i watched it disappeared and i didn't see it again, even though i had another ufo encounter a couple of days later when i was walking down my road and i seen this square\\rectangle object flying silently about 150ft above the row of houses it had the same colours as they other ufo but the colours were brighter i did get a picture but i later lost my phone that week so i am going to upload a picture of my friend who also took a picture. when i describe these two objects on the information form i am describing both of them."],"Viewing Distance":"21-100 Feet, Over 1 Mile","Object Shape":"Oval, Star-like","Source":"MUFON","Latitude":"51.282683","Object Flight Path":"Stationary,Straight-line path","Case Number":"27007","Region":"England","Object Features":"Unknown","trends":["There have been 3 other sightings in Canterbury","There were no other sightings in Canterbury on or around July 1st 2010"],"Disposition":"Unresolved","Log Number":"GB-12162010-0004"}