{"Disposition":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsLast night after taking dogs out in backyard, I saw this really bright light in south eastern sky. I went back inside house to go upstairs and get a better view from upstairs window. I also got my wife to come and look. We watched the object for about 15 minutes. The object stayed in same position for about 10 minutes,then moved west for a few minutes slowly, then just vanished. There were some clouds in sky last night but not near object at the time. It definitely was not an airplane or helicopter. Ive lived near airport my whole life and have seen thousands of planes before and this was way to bright and big to even come close to compare it to. The object pulsated a few times even brighter, it changed colors like a star twinkling in sky, I looked through my binoculars also and can distinctively see it changing all different colors, red, blue, green, yellow, but at the same time it always had a bright white light coming from it continually. I also took a short video of it from my camera, it doesn't have a good zoom on it, but you can definitely see how bright it was in comparison to the street lights in video. I will transfer video when I get home. I also checked the reports of ufo sightings and someone else posted about same object, but at different time. I was really excited to see that other people seen this also!! I hope more reports come in and.ill be ready with a better camera if it comes back."],"Weather Factors":"Unknown","Latitude":"41.931696","Summary":"Extremely bright starlike huge object","files":["/var/www/straped/mufon/html2text/27000.html.txt","/var/www/straped/mufon/org/27000.html"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","City":"Addison","Case Number":"27000","Longitude":"-87.988956","Country":"United States","Object Flight Path":"Undisclosed","Object Shape":"Circle, Star-like","Log Number":"US-12152010-0007","Source":"MUFON","Date Submitted":"07/28/2011 10:31 UTC","Date of the Event":"12/14/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.931696,+-87.988956(27000)&iwloc=A&hl=en\"> mufon case (27000) map </A>","Region":"Illinois","trends":["There have been 6 other sightings in Addison","There was one other sighting in Addison on or around December 14th 2010"]}