{"Summary":"constant abductions, sightings and interactions since 3 1/2 1947","Source":"MUFON","Longitude":"-80.137469","Sighting Duration":"02:30:00","Country":"United States","divs":["Sighting Detailslast event of a sighting, was with wife and two daughters at the edge of the everglades. it was a circular disk shaped craft with a clear toped dome, the craft was glowing a soft yellow, hovering at a fourway intersection above a tall row of pine trees.... if u contact me i will tell u all i know.....concerning a lifetime of abductions,sightings and direct communications. i dont care if u think me crazy but they implanted a probe up my rt nostril, when i was a child, which i have explicid memories of, as well as the pain and poped my sinus cavity, placing a very small barbed ball in the front of my brain, i guess ,because they would communicate telepathecly with me whenever they chose to. 1.i was contacted mentally with a vision of where they wanted me to meet them in the everglades.we were on an unlighted back country road coming home from a friends house, suddenley there it was just hovering at aproximately 30-40 feet at the top of pine trees. 2.we all saw it from the car as we approached it hovering, slightly ahead bobbing above the pines 3. we all knew it was a saucer shaped ufo instantly,not of this world 4.disc shaped with a pale yellow glow and a clear domed top, floating and bobbing slightly as it moved alomg the treetops. it was 80-100 yards across.it led us down a side dirt roas that was a dead end at the embancment of the water of the everglades. 5.i was only too familiar with such an event, i said nothing as not to influance the reactions of my wife and daughters, after it came down to hover in the water at the end of the dirt road on the embankment a fog came out of nowhere and covered the car. i began to step out of the car with the opening of the car door and my wife screemed, \"no dont\", the next thing i remember i was comming too from the heysterical screaming of my daughters in the back seat, i found myself back in the car once again recalling the abduction of myself and my family. 6.contact me if u need more information, the leader, as ive always known him is about 6' tall, enlarged crainium, huge deep, pure black eyes, no ears,tiny holes for a nose. a thin indescrible mouth, long very thin neck, exceptionally long thin apendages, overall frail looking, and a light grey skin color. i have made a drawing of the leader who has ALWAYS dealt with me. his name is garfleen. {the ship was still hovering in the water as we attempted, disoriented and freaked out by my daughters begging me to leave. it remained there as we drove away as fast as possible."],"trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around May 31st 1988"],"Latitude":"26.128208","Disposition":"Unknown","Viewing Distance":"20 Feet or Less","Region":"Florida","Date of the Event":"05/31/1988 02:00 UTC","City":"Fort Lauderdale","Case Number":"27001","Object Shape":"Disc","Date Submitted":"12/15/2010 06:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.128208,+-80.137469(27001)&iwloc=A&hl=en\"> mufon case (27001) map </A>","files":["/var/www/straped/mufon/html2text/27001.html.txt","/var/www/straped/mufon/org/27001.html"],"Object Features":"Dome","Weather Factors":"None, Fog","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Log Number":"US-12152010-0008"}