{"Date Submitted":"12/15/2010 08:35 UTC","Latitude":"32.453356","Tags":"City","Weather Factors":"Unknown","Log Number":"US-12152010-0009","Summary":"Orange Lights, Watched Them For 45 Minutes","trends":["There have been 63 other sightings in Abilene","There was one other sighting in Abilene on or around December 15th 2010"],"Case Number":"27002","Date of the Event":"12/15/2010 06:32 UTC","Object Features":"None, Unknown","files":["/var/www/straped/mufon/html2text/27002.html.txt","/var/www/straped/mufon/org/27002.html"],"Object Shape":"Circle, Sphere, Other","Region":"Texas","Country":"United States","Longitude":"-99.724074","divs":["Sighting DetailsOk first let me start by saying this is going to be my last report on these, because nobodys following up on it. The lights started appearing as single lights then after a while came on in a row of light up to 6 at a time, then at one time the light came on in a row one would come on then it appeared to jump or just another light came on and what made it odd as the lights were coming on in a row from left to right they started coming on from right to left, hard to explain but it came on like this direction----> O O O O O as a new light appeared the one behind it would go out, then they came on in this direction <---- O O O O O and there was no hesitation soon as it went from left to right it went right back from right to left. Very odd and very cool to watch, i've now seem them 5 times just in the month of December alone, before that it was 8 months before I saw these lights in the sky. This is final report until someone takes this serious ...you know maybe come check it out for yourself or look up in the sky between abilene and brownwood, from 6pm - 7pm not saying they're on a schedule just seems to be the time they appear. Good Luck ..watch the skies"],"Disposition":"Unknown","City":"Abilene","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Stationary","Sighting Duration":"00:35:00","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.453356,+-99.724074(27002)&iwloc=A&hl=en\"> mufon case (27002) map </A>"}