{"Disposition":"Unknown","Region":"Connecticut","Longitude":"-72.678723","map":"<A HREF = \"http://maps.google.com/maps?q=41.772311,+-72.678723(27008)&iwloc=A&hl=en\"> mufon case (27008) map </A>","files":["/var/www/straped/mufon/html2text/27008.html.txt","/var/www/straped/mufon/org/27008.html"],"trends":["There have been 13 other sightings in Hartford","There were no other sightings in Hartford on or around December 14th 2010"],"Summary":"Large V-shaped object making tight turn over Rte 140 in East Windsor area","Case Number":"27008","Tags":"City","Object Shape":"Chevron, Triangle","City":"Hartford","Country":"United States","divs":["Sighting DetailsI was driving to work, same route that I've taken for the past nine years. I work in the vicinity of Bradley Int'l Airport and witness planes coming and going from the airport for the second half of my trip every night. I'm used to seeing aircraft of all sizes and light patterns coming and going from multiple directions depending on wind and weather, but have never seen an aircraft come in from the direction this one did and that's what caught my attention first. I did a double take as it came closer over the trees to my left (east) and my first thought was \"where the hell is he coming from??\" Then I noticed the light pattern and the size of the area between the lights... indicating this craft was HUGE compared to the passenger jetliners I see every night. I rolled my window down, realizing I may be seeing reflections of other things in the glass but no, it was precisely what I saw through the open window. I watched it make what seemed to be a tight left turn and it reminded me of a child's toy, a Top the way it seemed to stand on the bottom point of the V shape and turn to it's left. It appeared to be banking left by the way the lights moved in the night sky as that was literally all I could see. I couldn't even see an outline of a shape. All I could see of this object were the three very bright lights, two synchronized red lights(one on the tip of each side of the top of the V) they blinked in unison slow and steady. The light at the bottom point of the V was bright white and remained on the entire time, it did not blink at all. I have to say it was one single object because all three lights moved as if they were connected to the same object, there was no variation or hesitation from one to the other. I thought to myself how smooth its flight was, almost graceful and thoughtful. The object then crossed over the road in front of me leisurely, I estimate less than a mile away, crossed Rte 140 and appeared to be heading toward Bradley Intl Airport... I blinked (literally) and it was gone. I didn't see it leave, it was just no longer visible. I don't know if that means it left in a hurry, disappeared, or if the lights simply were no longer visible to me at that angle. I haven't been able to get it out of my head and have been trying to find online any military or other aircraft that would have that light pattern and size. I cannot find anything and a friend told me to report what I saw here and gave me this link. Thank you."],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date Submitted":"08/09/2011 10:42 UTC","Weather Factors":"Windy","Object Flight Path":"Path with directional change","Latitude":"41.772311","Source":"MUFON","Date of the Event":"12/14/2010 10:48 UTC","Log Number":"US-08092011-0046"}