{"Log Number":"US-12162010-0001","files":["/var/www/straped/mufon/html2text/27004.html.txt","/var/www/straped/mufon/org/27004.html"],"Case Number":"27004","Viewing Distance":"Unknown","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"01/04/2010 12:00 UTC","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around July 21st 2009"],"Object Features":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsMid summer, after dark. A few friends and I were sitting on my front step enjoying the warm evening and one of my friends saw a red light in the sky that was moving very very slowly. It was above and behind my house in the western part of the sky. It was moving in a northerly direction. It was very very bright red, a lot like an LED light, very intense color. It was very high up, and looked about the same size as Jupiter is in the sky, pretty big. It moved extremely slowly-almost unnoticeably slow. We all became very excited and curious as to what it was. I ran inside and grabbed my video camera and began to film it. I have not been able to find the video since then, when I do I will definitely email it! When I zoomed in I could see the bottom of the light was flat. The object was 90% spherical but with a flat bottom. There were no noises, no flashing, although the light did pulse slowly. It would dim and then grow brighter. The whole cycle would take around 40 seconds or so. The pulsation was very easily noticed on the recording, but not so much on from the naked eye. After I had filmed it to my satisfaction I put my camera down. Then it faded from visibility, it didn't just vanish. Not sure whether it disappeared because of distance or if the light just faded to nothing. I recall being very excited, this being the second time I've seen a ufo, that I was actually able to film this one. I don't recall any communication on any level with this object."],"Latitude":"43.615541","Longitude":"-116.202386","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Undisclosed","Summary":"Slow moving red light ufo","Sighting Duration":"Undisclosed","Region":"Idaho","Date of the Event":"07/21/2009 12:00 UTC","Tags":"City","City":"Boise","map":"<A HREF = \"http://maps.google.com/maps?q=43.615541,+-116.202386(27004)&iwloc=A&hl=en\"> mufon case (27004) map </A>","Weather Factors":"Unknown"}