{"Date of the Event":"12/14/2010 12:00 UTC","files":["/var/www/straped/mufon/html2text/27013.html.txt","/var/www/straped/mufon/org/27013.html"],"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=42.292448,+-83.169903(27013)&iwloc=A&hl=en\"> mufon case (27013) map </A>","Case Number":"27013","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Region":"Michigan","Summary":"Multi star pattern coming from east. staying in unchanging formation. stopped","Log Number":"US-12162010-0009","Viewing Distance":"Unknown","Latitude":"42.292448","Longitude":"-83.169903","Disposition":"Unknown","divs":["sighting detailsoften, when the sky is clear, i look out bedroom window briefly before sleeping. this past tue. at 11pm i looked out at a pretty clear sky and, after a min., saw a star pattern in the distant east that incl. 3 stars in a perfect line. as i continued to watch, i realized that the pattern of 9 stars (later aware of two smaller sattelites) was slowly moving straight across the sky toward me. i thought, wow, i'm finally seeing something. i noticed that the pattern was not moving in a normal rotational direction as all other stars do. it came in a straight line, slowly and never changing formation. i quickly got my binocs.(7x35\\8*)and after 30-35 min. i thought it was going to pass out of sight over my roof but it stopped just short of the roof overhang. i noticed that in addition to the 9 primary stars, there were 2 smaller, less bright sattelites that could only be seen with the binocs. during the next 25-30 min. saw the usual stars rotate towards the south but the pattern sat still. during the 1\\2 hr. or so the pattern very slowly eked west (prob.rotation related). a little ways s.e. of me are the fermi towers and i wondered if this ufo's observance had anything to do with them, hoping not. at about midnight, with nothing else happening, i went to bed. the following day i looked around the web, hoping to see some confirmation, but nothing. they were basically the same brightness as any star (way,way up there) and moving slowly so i understand why they weren't obvious. i wish i could show you the pattern because it included 2 perfect rows of 3 and a perfect triangle on the right end. none of this surprises me, because of my reading for the last 4 1\\2 yrs. but it was a trip because it was the first sighting for me!"],"City":"Melvindale","trends":["There have been 6 other sightings in Melvindale","There were no other sightings in Melvindale on or around December 14th 2010"],"Source":"MUFON","Date Submitted":"12/16/2010 05:34 UTC","Country":"United States","Weather Factors":"Unknown"}