{"Case Number":"2701","Latitude":"40.287611","Source":"MUFON","Region":"New Jersey","Weather Factors":"Unknown","Object Features":"Appendage(s)","files":["/var/www/straped/mufon/html2text/2701.html.txt","/var/www/straped/mufon/org/2701.html"],"Longitude":"-74.172365","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"Dorbrook Farm - NAD Earle sighting","Date Submitted":"07/10/1959 07:00 UTC","Date of the Event":"07/10/1959 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.287611,+-74.172365(2701)&iwloc=A&hl=en\"> mufon case (2701) map </A>","Disposition":"Unknown","City":"Colts Neck","Log Number":"","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Country":"United States","trends":["There has been one other sighting in Colts Neck","There were no other sightings in Colts Neck on or around July 10th 1959"],"Tags":"City","Sighting Duration":"00:00:00","divs":["Sighting DetailsUnreported Daylight UFO sighting96 Monmouth County, NJ96 Summer, 1959On a warm summer evening in early July of that year, I, my family along withseveral neighbors were witnesses to a unique daylight UFO sighting that to thisday has never been reported or satisfactorily explained. The object observedwas that of a shiny metallic sphere having the appearance of silver or liquidmercury. Its approximate size on retrospect was about that of a pencil eraserheld at arms length. The sphere also displayed flashing red and white lightsthat seemed to flash randomly all around it mainly at its equator.What makes this sighting even more interesting is that the location of the farmfrom which we viewed the object is adjacent to the U.S. Navy road and railroadthat links NWS then NAD Earle the main munitions storage facility in Colts Neck,NJ to its pier facilities located in Leonardo, NJ on Raritan Bay. The roaditself is restricted to only military use, primarily that of moving navalmunitions from the secure storage facilities at the Colts Neck site to thevarious Naval ships that tie up to the piers located at the Leonardo facility.It has long been93rumored94 that the inventory stored at Earle included conventional as well as93other94 types of93non-conventional94 munitions. At the time of the sighting, my father, was employed as afarmhand by a Mr. Murray Rosenberg, then owner of Dorbrook farms as well asMiles Shoes stores a national shoe chain. We lived in a modest farmhouse on thesite facing the road then known as RD1, Eatontown. Our house also directlyfaced the Navy road that was approximately several hundred yards away. Lookingfrom my front porch, across this highway one could easily view the governmentroad then known as Normandy Road, or just93the Navy Road94 that was just across a large field to the east of the RD1, Eatontown.It should also be noted that the farms location is especially important becauseof its proximity to two critical military facilities that to this day, are stillconsidered significant and militarily important installations. Dorbrook farmnow a Monmouth county park is approximately 4 miles from the research anddevelopment facilities located at Fort Monmouth Communications and ElectronicsCommand as well as about a mile from Naval Weapons Station Earle base entranceagain, the Normandy road railroad and its service road are directly adjacent tothe farm itself.Unfortunately,"]}