{"Date of the Event":"12/14/2010 06:40 UTC","Log Number":"US-12172010-0007","files":["/var/www/straped/mufon/html2text/27027.html.txt","/var/www/straped/mufon/more/27027_submitter_file1__2.jpg","/var/www/straped/mufon/org/27027.html"],"Case Number":"27027","Object Shape":"Star-like","Longitude":"-87.985956","Latitude":"41.938876","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Stationary","Date Submitted":"12/17/2010 05:31 UTC","Country":"United States","City":"Addison","map":"<A HREF = \"http://maps.google.com/maps?q=41.938876,+-87.985956(27027)&iwloc=A&hl=en\"> mufon case (27027) map </A>","Source":"MUFON","divs":["sighting detailsi have reported this to mufon via phone after seeing i was not the only one whom have seen or reported this on this website i decided to add my own visual of event. i woke up close to 6:30am on the 14th of dec and decided to go outside to have a smoke as soon as i walked outside a bright object due south\\east of me caught my eye, it was very bright and at first i thought it was venus but then i spotted venus at about 2 o'clock position from the initial object in question i knew then it wasn't venus, i found it very odd as i glanced at it some more it got brighter so i ran inside and dashed for my camera and started to record iwas able to catch venus and as i aimed the camera toward the unknowned light i the sky it seemed to vanished.... now my video may or may not have caught the unknown light, i can't seem to find it of yet but i know where it was when i review the footage.... the video data also stamped time of recording as dec 15, 2010 6:40am with 45 seconds this purpose of report is to confirm the other 2 reports on mufon. note: the orange circle represents where in the area the mystery object (is\\was) at moment of taking video. the pic included is a snapshot from actual video."],"Viewing Distance":"Unknown","Region":"Illinois","trends":["There have been 6 other sightings in Addison","There was one other sighting in Addison on or around December 14th 2010","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"Bright Oval Light I thought was Venus at 1st which wasn't","Tags":"City"}