{"Region":"Washington","Date of the Event":"11/23/2010 03:34 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","Log Number":"US-12172010-0009","map":"<A HREF = \"http://maps.google.com/maps?q=47.756913,+-122.333428(27029)&iwloc=A&hl=en\"> mufon case (27029) map </A>","Object Flight Path":"Straight-line path","Object Shape":"Disc, Star-like","files":["/var/www/straped/mufon/html2text/27029.html.txt","/var/www/straped/mufon/org/27029.html"],"Date Submitted":"12/17/2010 06:37 UTC","divs":["Sighting DetailsOn the morning of November 23, 2010 I stepped out on my porch to admire the new fallen snow. I noticed that the sky had cleared and the snow had stopped falling. It had been snowing since 5:00 AM the previous day. So I then started to stare at the sky. From the north came gliding by two orange or amber circular lights next to each other. It was at a low elevation and did not make any noise at all! It flew by at a very high speed and the sighting only lasted a few seconds. As it was headed south, my guess was that it was doing the same thing I was doing that morning, admiring the new fallen snow. I observe lots of aircraft fly by house. When they do they are usually at a higher elevation and either the aircraft's lights or noise allow me to quickly determine human-made airplanes. This was definitely the strangest aircraft I have ever seen. Probably the strangest part about it was the absence of noise. The size of the two lights and the brilliant amber color of them would be the second strange part about my sighting. I was completely lucid during the sighting."],"Tags":"City","Disposition":"Unknown","Country":"United States","Longitude":"-122.333428","Source":"MUFON","Case Number":"27029","Sighting Duration":"00:00:07","trends":["There have been 3 other sightings in Shoreline","There were no other sightings in Shoreline on or around November 23rd 2010"],"Weather Factors":"Unknown","City":"Shoreline","Summary":"Two amber lights inside a disc passed by my house.","Latitude":"47.756913"}