{"Source":"MUFON","Object Flight Path":"Hovering then path","Date of the Event":"11/30/2007 12:00 UTC","City":"Brockton","Log Number":"US-12172010-0008","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"20 Feet or Less","trends":["There have been 4 other sightings in Brockton","There were no other sightings in Brockton on or around November 30th 2007"],"Summary":"Big dark circle object with three lights forming a triangle","Longitude":"-71.013839","map":"<A HREF = \"http://maps.google.com/maps?q=42.086934,+-71.013839(27028)&iwloc=A&hl=en\"> mufon case (27028) map </A>","Object Features":"None","Latitude":"42.086934","Disposition":"Unresolved","Weather Factors":"None","Case Number":"27028","Object Shape":"Circle","Region":"Massachusetts","divs":["Sighting DetailsI was walking home down Thatcher Street in Brockton, Ma after one of my night classes Massasoit Community college. It was close to 10 O'clock and very dark out and cold. The street lights were not really working and somewhat dim every block or two there would be light. And when I decided to look up at a tree which I often do to stare at the sky or tree's. I ended up seeing some big round object above a house. It was probably 20 feet or so above the house. I am horrible with estimation of how up high it was. But it was double the size of a 3 story house maybe triple. It was hovering above the house for a while with some noise that you couldn't really hear. At first I thought it was an airplane since there was three glowing lights under it that formed a triangle. But then why would it hover above a house and then after thinking about it. I started to walk faster to avoid it since I was a little scared yet I was fascinated since I do believe in aliens and visitors from another planet. It moved a little to the right and circled the area a little probably one full circle around 4 or 5 houses away and then it came back to the same house then went right towards east side Shaw's direction as it ascends higher into the air before disappearing from my sight. I could only see a pitch black object in the sky with the three lights under it. I have thought about posting it earlier but when I arrived home I told a friend and family member about it and they told me that it was probably just an helicopter or airplane. I just let it go even though I do think about it occasionally until someone told me about Mufon. There is not enough proof what I saw was a UFO or an helicopter or airplane. But what I do know is that a helicopter would make more noise and an airplane would not stop in a random spot for so long since they have a destination to arrive at. Therefore what I saw was something that is unexplainable and remain in my memories."],"Country":"United States","files":["/var/www/straped/mufon/html2text/27028.html.txt","/var/www/straped/mufon/org/27028.html"],"Date Submitted":"12/17/2010 06:17 UTC"}