{"City":"San Francisco","map":"<A HREF = \"http://maps.google.com/maps?q=37.78188,+-122.412316(27026)&iwloc=A&hl=en\"> mufon case (27026) map </A>","Object Flight Path":"Undisclosed","Summary":"fiery orange plasma ring over San Francisco moving slowly east to west","Sighting Duration":"12:12:30","Weather Factors":"Unknown","Case Number":"27026","Country":"United States","divs":["Sighting Details My wife and I saw an honest to god UFO last night at about a quarter past midnight. My wife was looking out the bedroom windows and shouted to me in the living room, 'HEY look out the window...HURRY! We have a skyline view of San Francisco looking east from a hilltop about a mile from downtown. I saw what my wife was looking at immediately and shouted ' What the 'f' is that!' It was coming toward our apartment building slowly at about the same speed a that a helicopter would fly and I've seen lot's of those. There was a truly bizarre, glowing, orange ring in the sky coming toward our building. The cloud layer was low over the city but, the skyline was plainly visible. The orange ring was under the clouds heading west toward the ocean. It was really, unmistakably different from anything I've ever seen. It was like an oval ring of bright orange plasma...hard to focus on like neon but intense like fire. It made the clouds glow slightly. It might have even been just inside the lower boundary of the cloud layer. It moved very smoothly with no jerkiness whatsoever and it was silent with absolutely zero, blinking lights. It flew over our eight story tall building and out of our field of vision. We both ran downstairs in our pajamas and outside onto the sidewalk hoping we could still see it. We could! It was still moving slowly west but, looked like it was going up, too. I considered going back upstairs to get a camera but, decided it would be gone before I could get back with it so, we both just kept watching it. Sure enough, it started fading out of sight as it seemed to climb back up through the cloud layer. My wife and I went back upstairs and sat on the couch talking about it for awhile.I was thrilled...she was really nervous and obviously shaken up by the experience. My wife thinks I'm nuts when I watch UFO shows on TV. She thinks it's all BS. Well, maybe not so much now. She kept asking what me what I thought it was; if I thought it was really an alien spacecraft. She was asking me what does it mean. Of course I didn't really have any good answers. It wasn't like anything I'd ever seen before. I've never claimed to have seen any UFO before. Nothing I've ever seen comes close this. I can't imagine anything, even remotely, technologically feasible st this time by anyone on this planet."],"Disposition":"Insufficient Data","trends":["There have been 127 other sightings in San Francisco","There were 2 other sightings in San Francisco on or around December 17th 2010"],"Date of the Event":"12/17/2010 12:00 UTC","Object Features":"Undisclosed","Tags":"City","Latitude":"37.78188","Region":"California","Object Shape":"Oval","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-122.412316","files":["/var/www/straped/mufon/html2text/27026.html.txt","/var/www/straped/mufon/org/27026.html"],"Date Submitted":"12/17/2010 01:41 UTC","Log Number":"US-12172010-0006"}