{"map":"<A HREF = \"http://maps.google.com/maps?q=40.571873,+-111.896862(27023)&iwloc=A&hl=en\"> mufon case (27023) map </A>","Date of the Event":"12/16/2010 07:15 UTC","Date Submitted":"12/17/2010 02:01 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/27023.html.txt","/var/www/straped/mufon/org/27023.html"],"Region":"Utah","Object Features":"Undisclosed","Longitude":"-111.896862","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-12172010-0004","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","divs":["sighting detailsi left school @ 7:00p.m. and was getting off i-215 and on to the i-15 on ramp heading south and was passing the 7200 south off ramp and saw 3 large red circular lights fading from on to off in a tri-lateral pattern just above the freeways lights. they were about 50 ft above the top of lights, and as i passed one of the street lights i not only saw the three red circular lights i saw the triangle shape (black\\rust color). this craft was stationary and not moving. now that my senses were heightened and eyes focused and scanning the skies the rest of the way home i started noticing all the aerial craft in the night skies. roughly ten-fifteen minutes later i was coming up to 14600 south and noticed another set of lights in a triangle formation over the point of the mountain. i thought this looked much bigger and the large lights were white on each corner of the craft and one small blinking red light in the center of those three. so i thought that it was just a commercial air liner, but as i got closer to getting over the point of the mountain i could see a faint black outline of a triangle shaped bottom to pyramid topped craft becoming more crisp and clear that was moving eerily slow over the freeway heading east. it was @ foot hill height (so i'm guessing about ft). traveling at roughly 15 mph. i tried to pull over but i was in the fast lane so i couldn't pull over safely fast enough in rush hour traffic. it was huge. i would say about 50 yrds in length or more and 30 yrds in height at least.............i was in awe."],"Case Number":"27023","Object Shape":"Triangle","Latitude":"40.571873","Summary":"Driving south on I-15 and saw triangle ufos 2 times in different lacations within 10 mins of one and other.","City":"Sandy","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around December 16th 2010"],"Object Flight Path":"Stationary,Straight-line path","Tags":"City","Disposition":"Unknown","Weather Factors":"None"}