{"Source":"MUFON","City":"Newport","Case Number":"27031","files":["/var/www/straped/mufon/html2text/27031.html.txt","/var/www/straped/mufon/more/27031_submitter_file1__2010-12-17_12.19.11newport.jpg","/var/www/straped/mufon/more/27031_submitter_file2__2010-12-17_16.10.40.jpg","/var/www/straped/mufon/org/27031.html"],"Date of the Event":"12/17/2010 12:15 UTC","Viewing Distance":"Unknown","Object Features":"Undisclosed","Object Shape":"Unknown","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Newport","There were no other sightings in Newport on or around December 17th 2010","This sighting has never been favorited.",""],"Log Number":"US-12172010-0011","Date Submitted":"12/17/2010 10:40 UTC","Object Flight Path":"Undisclosed","Latitude":"41.495002","Region":"Rhode Island","map":"<A HREF = \"http://maps.google.com/maps?q=41.495002,+-71.311108(27031)&iwloc=A&hl=en\"> mufon case (27031) map </A>","Tags":"City","Disposition":"IFO","Summary":"I noticed a unknown object in a picture that I took of the harbor in Newport RI on 12/17/2010.","Country":"United States","divs":["Sighting DetailsIt was a very sunny day in Newport RI at approximately 12:15PM. The sun was bright over the water and I thought it would make a nice picture. I did not notice anything at the time I was taking the picture. There were no sounds such as a helicoptor or aircraft. Later while looking at the picture on my computer I noticed an unusual object in the sky on the upper right side of the photo. I could not determine any explanation for this object. I thought that perhaps it was something on the camera lense so I took another picture and the object did not show up in the new picture. Photo 1 which I am attaching is the first photo with the unusual object. Photo 2 is later in the day when I decided to make sure it was not the lense of the camera. I have looked at this several times and have showed it to others and no one seems to have an explanation of what this object might be. Maybe you can. I would like to know what it is that I captured in this photo. This has me very puzzled."],"Longitude":"-71.311108","Sighting Duration":"Undisclosed"}