{"Object Features":"Undisclosed","divs":["Sighting DetailsI am a Pilot, College educated and I have seen many objects that are unknown and either very secret Military or from way out of this World. I believe, and am not a skeptic whatsoever. But now to see this picture on the Home page of the December 17, 2010 Mufon site really made me have to comment. At the end of this sighting report of Dec.12Th,2010 of a picture near the Washington Monument, notice the poster left a little hint that this was a possible HOAX!! He or she ends it with a smiley face punctuation mark. If I am wrong, I apologize, but some Seagulls do have black on their head, and with a very HD Monitor I can see some large \"pixelation\"blocks that, to me, show a little photo-shop work. I believe that we all want honest postings here.to gain and share knowledge. To me, this is NOT one of them. The end of this report I will paste unedited. Just google Seagull pictures and not much imagination will be needed. Let's keep the truth alive. Filer's file has the date wrong also as Dec.7th,2010,(#51-2010). All you good folks be the Judge. Thanks and look at the picture again. I do not want to waste your time but it's worth another look. Mufon should also. Investigate. Real and unexplainable things have been dismissed by Mufon.Keep looking up.They are there and I and many have seen and know..Thank you..This Vermonter believes.The report end as and I quote,,,,,,\".Anyhow I would love to know what you think this is, even if it is a secret military plane or something, its just interesting me :) End quote. What you good folks think.Look at the picture also, carefully!!! Use the search database to view."],"Object Flight Path":"Undisclosed","City":"Baltamore","Region":"District of Columbia","Date of the Event":"12/12/2010 12:00 UTC","Date Submitted":"12/18/2010 01:19 UTC","Source":"MUFON","trends":["There have been no other sightings in Baltamore","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/27035.html.txt","/var/www/straped/mufon/org/27035.html"],"Tags":"City","Weather Factors":"Unknown","Log Number":"US-12182010-0002","Longitude":"-76.918512","Disposition":"IFO","Case Number":"27035","map":"<A HREF = \"http://maps.google.com/maps?q=38.934126,+-76.918512(27035)&iwloc=A&hl=en\"> mufon case (27035) map </A>","Latitude":"38.934126","Summary":"Belief of a past posted hoax! Please read. I believe.","Viewing Distance":"Unknown"}