{"divs":["Sighting Detailswhile at the BeatSwap meet in china town it was between 4:00pm and 4:15, my wife pointed out something that looked like stars in the sky by the moon. i have never seen anything this close this birght, as the objects formed a triangle pattern and a sort of orion's belt i counted 16 objects.Planes flew in between the objects so it looked,( i later realized the objects where very far away even though they looked close) the objects started moving in formation to the north and then disappeared. this event lasted about 5 min. I managed to take a few shots off the camera and the brightest object looked very interesting. I enlarged it and it looks very interesting,i dont know what im seeing This picture was taken at 18 megs and is 5000 pixels so it was easy to blow it up. This picture only shows five objects, i was shooting at the brightest one of the bunch. SIDE NOTE: I had my camera , taking pictures all day long it was working fine, when i pointed it at the object it just would not work for some reason, as well as i could not see it on my viewing screen ,like it was invisible, i was very frustrated(it could have been operator error who knows) All i know is that if i pointed at the objects it would not take a picture, when pointing at something else it took a picture fine. when i got home to download the pictures to my hard drive and as it was transferring it suddenly unmounted it self and gave me an error message saying it was not there anymore. After getting a recovery program and painfully retrieving some of the files, all files worked , except the one with the video of the objects. I have never had so much trouble getting a picture. Tell me what this is."],"Disposition":"Insufficient Data","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.058824,+-118.240555(27034)&iwloc=A&hl=en\"> mufon case (27034) map </A>","Log Number":"US-12182010-0001","City":"Los Angeles","Tags":"City","Case Number":"27034","Object Shape":"Oval, Star-like","Longitude":"-118.240555","files":["/var/www/straped/mufon/html2text/27034.html.txt","/var/www/straped/mufon/more/27034_submitter_file1__ufolittlechinatown.jpg","/var/www/straped/mufon/more/27034_submitter_file2__chinatown-ufo-closeup.jpg","/var/www/straped/mufon/org/27034.html"],"Date of the Event":"12/12/2010 04:10 UTC","Country":"United States","Latitude":"34.058824","Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"12/18/2010 12:30 UTC","Viewing Distance":"Unknown","Summary":"Very bright very slow","Sighting Duration":"00:05:00","Region":"California","Object Flight Path":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around December 12th 2010","This sighting has never been favorited.",""]}