{"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/27044.html.txt","/var/www/straped/mufon/org/27044.html"],"Weather Factors":"Snow, Light","City":"Connersville","Object Features":"Unknown","Longitude":"-85.131125","map":"<A HREF = \"http://maps.google.com/maps?q=39.646779,+-85.131125(27044)&iwloc=A&hl=en\"> mufon case (27044) map </A>","Log Number":"US-12192010-0001","Disposition":"Unknown","Date of the Event":"12/15/2010 06:15 UTC","Tags":"City","divs":["Sighting DetailsThere are actually two events which happened on this date. First, my husband saw a silver flash, much like an elongated straight line over a tree line to the east. This occurred at approximately 2:15 pm, while we were heading south on State Rd. 101. The second was even more perplexing. We were headed north on 101 and spotted a stationary glowing object, which we thought may have been over the Richmond area. Both of us thought perhaps it was an AirEvac going into Reid Hospital, but we are 30 miles from there and would not have seen something like that due to obstructions. As we made a left onto Dunlapsville Rd, enroute to Connersville, the \"light\" glowed a bluish white and seemed to have followed us. It was cloudy and snowing lightly, so doubtfully it was an aircraft. It was on a straight trajectory and when it was at my 5 o'clock position of the car, it glowed brighter and then was gone. Insofar as the first incident is concerned, my husband also saw that bluish-white streak before and I, too, have seen it once or twice. They are pointed at each end and a little thicker in the middle. He has also seen a blackish type of \"thing\" over the treeline which would be toward the east and near Oxford, OH. Neither of us could explain what the glowing light was, either, as it was too cloudy to see Venus or Jupiter. Having a degree in Earth and Space Science, admittedly, I could not comprehend what it was we saw. Regarding our feelings, it was a real headscratcher."],"trends":["There have been 11 other sightings in Connersville","There were no other sightings in Connersville on or around December 15th 2010"],"Summary":"looked like aircraft anticollision light, but bluish","Case Number":"27044","Region":"Indiana","Object Shape":"Unknown","Country":"United States","Latitude":"39.646779","Viewing Distance":"Unknown","Date Submitted":"12/19/2010 12:07 UTC","Source":"MUFON","Sighting Duration":"Undisclosed"}