{"Disposition":"IFO","Region":"California","Tags":"City","Longitude":"-122.414326","Viewing Distance":"Over One Mile","Weather Factors":"None","Object Flight Path":"Straight-line path","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around December 15th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/27041.html.txt","/var/www/straped/mufon/org/27041.html"],"Object Shape":"Triangle","Date of the Event":"12/15/2010 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.78436,+-122.414326(27041)&iwloc=A&hl=en\"> mufon case (27041) map </A>","Sighting Duration":"00:00:04","Source":"MUFON","Date Submitted":"12/18/2010 08:50 UTC","Country":"United States","Summary":"Black UFO Triangle over San Frsancisco 10 pm Dec.15 (Wed) 2010","Log Number":"US-12182010-0008","divs":["sighting detailsufo: black triangle, over san francisco, captured on video tape. date: 12\\15\\2010 wed night. time: 22:00 pst. location: outer sunset district of san francisco, ca. my ir camera was pointing 17 degrees east (magnetic north for san francisco) and it was pointing up from the horizon about 60 degrees. this black triangle was not as close as my nov 2008 sighting that flew over my house. this ufo was father away (maybe 3000 feet high or so), but my 3 times power ir night video camera was able to bring it in closer. this triangle had two round shape bright white lights constantly on. these lights were located at the ufos far end section, but the strangest thing was that it seemed to be flying on its side or sideways. i did not see any other lights turned on nor blinking, if it made a noise, i could not hear it radiating. it seemed quiet to me. i was able to record a few seconds of it as it past the cameras lens. i was not able to follow the ufo with the camera, because other houses blocked my view of it. i will try to capture more ufos next week, after the rain stops. mufon, if you are interested in my ufo sightings over san francisco from march, 2010 until now, please look at my you tube ufoandusohunter thank you"],"Latitude":"37.78436","City":"San Francisco","Case Number":"27041","Object Features":"Unknown"}