{"Latitude":"28.545736","Summary":"3 orbs of light circling in the night sky, then 2 orbs of light then they disappeared","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around December 18th 2010"],"City":"Orlando","Country":"United States","Longitude":"-81.377836","Log Number":"US-12182010-0007","divs":["Sighting DetailsI was at my barn in the back yard feeding the horses for the evening. The barn cats started acting weird, making sounds I have not heard from them before and puffing up. I went out of the barn to investigate if there was an animal causing their distress but I saw nothing. I fed the horse then started walking back to the house. The night was foggy and the sky was partially cloudy. I saw 3 orbs of white light in the sky in front of the barn. They were flying in individual circles where they would meet in the middle and fly out again. At first I thought it was search lights but they were moving too differently from the searchlight pattern, they were moving in different areas of the sky. The circling orbs of light moved from the sky over the barn up towards the house. It reminded me of vultures circling. I watched them for approximately 10 minutes. Then it went to 2 orbs of light then they vanished. They were visible in the cloud cover better than the night sky. I got my husband and he grabbed the camera. We were not able to get a photo but we got a short video on the camera. When I was watching the orbs, I wondered if they were angels. I did not think I would feel so apprehensive watching angels because I was afraid as I was watching. I was also fascinated and drawn to watching them, I did not stop watching until they vanished. I am curious to know if any one else in this area was outside and saw what I saw."],"Object Features":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/27040.html.txt","/var/www/straped/mufon/org/27040.html"],"Weather Factors":"Fog","Tags":"City","Source":"MUFON","Case Number":"27040","Date Submitted":"12/18/2010 08:31 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.545736,+-81.377836(27040)&iwloc=A&hl=en\"> mufon case (27040) map </A>","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date of the Event":"12/18/2010 07:35 UTC","Region":"Florida"}