{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.173715,+-86.525026(27043)&iwloc=A&hl=en\"> mufon case (27043) map </A>","Case Number":"27043","Summary":"Orb/Sphere Shaped UFO over Bloomginton","Tags":"City","trends":["There have been 12 other sightings in Bloomington","There were no other sightings in Bloomington on or around November 15th 2010"],"Latitude":"39.173715","Date Submitted":"12/18/2010 11:11 UTC","Weather Factors":"Unknown","Date of the Event":"11/15/2010 12:00 UTC","divs":["sighting detailsi was walking across a courtyard on the indiana university campus with a friend and glanced up for no reason--it was cloudy out. i saw this orb-shaped object moving at a good 20-30mph across the sky. it appeared to have one light on the front (similar to an eyeball). the white was a white or beige color, but the craft itself glowed dimly a pinkish orange color. it moved in a very direct, straight path below the clouds, but higher than the treetops. i would estimate it to be about the size of a regular suv. i would never consider myself a ufo person, not even with an \"open mind\". but this ufo startled me and my friend and i followed it, running, for a couple yards trying to figure out whether or not it was a ufo. there was no way it could be a balloon--because of the front beam\\light it had. it finally went out of sight over trees and into the far distance. we were able to watch it for about 2-3 minutes. it never occurred to me to report it until i was trying to tell my mother, who asked me to look it up, but no other sightings were reported, unfortunately."],"files":["/var/www/straped/mufon/html2text/27043.html.txt","/var/www/straped/mufon/org/27043.html"],"City":"Bloomington","Object Shape":"Sphere","Log Number":"US-12182010-0010","Disposition":"Insufficient Data","Country":"United States","Longitude":"-86.525026","Object Flight Path":"Straight-line path","Region":"Indiana","Viewing Distance":"Unknown","Sighting Duration":"00:02:00","Object Features":"None"}