{"Summary":"There were 30 - 40 people standing at the corner of 23rd and 8th in Chelsea, NYC on October 13, 2010 looking up and pointing ( They were saying they see a UFO)","Longitude":"-73.954538","Log Number":"US-12202010-0005","Tags":"City","Date Submitted":"12/20/2010 06:47 UTC","Date of the Event":"10/13/2010 03:30 UTC","Country":"United States","Latitude":"40.76637","Sighting Duration":"Undisclosed","Disposition":"IFO","Region":"New York","Case Number":"27056","Object Shape":"Disc, Sphere","Object Features":"Undisclosed","Source":"MUFON","trends":["There have been 579 other sightings in New York","There were 7 other sightings in New York on or around October 13th 2010","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/27056.html.txt","/var/www/straped/mufon/org/27056.html"],"City":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.76637,+-73.954538(27056)&iwloc=A&hl=en\"> mufon case (27056) map </A>","Object Flight Path":"Undisclosed","divs":["Sighting DetailsThere were 30 - 40 people standing at the corner of 23rd and 8th in Chelsea, NYC on October 13, 2010 looking up and pointing ( They were saying they see a UFO), and news trucks from ABC news 7 and NY1 were there also. The object was very big and it was high up, at least 10,000 feet and stationary. It faded in and out a few times. I was unable to get it on my video camera, so i stood around a bit then started to walk north on 8th. As i was walking i looked up ( North East ) and noticed what look like an orb shining bright blue, it disappeared and reappeared a few times. The object was flying very fast up and down side to side and circling around, it stopped once and hovered for around 3-5 seconds then took off at a hi rate of speed, it made no sound. As the Orb dimmed i noticed it looked like a disc. The Disc had 2 cylider shaped objects on each side, when it would move the cylinders looked like they were rotating in the direction it was going. the video was slowed down because the object was moving fast."],"Viewing Distance":"Unknown","Weather Factors":"Unknown"}