{"Source":"MUFON","Disposition":"Insufficient Data","divs":["Sighting DetailsAwoke to soft yellow and orange changing light coming from object in corner of bedroom approx 5ft tall graduating in size from approx four ft round ring to 3ft ring to 2ft ring to 1 ft ring. Small ring at top to large ring at bottom. Rings rotating in alternate directions.Heard a high pitched repeating sound but it seemed to be coming from outside not from the object. I kept opening and closing my eyes to be sure I was seeing what was there was real. After about 10 min. I pulled the covers over my head and continued to pray for it to leave. Then the sound started to fade and the room got cold and when I pulled the covers back down it was gone and the air in my room was like pure oxygen. I know what pure oxygen is like having been on oxygen when hospitalized several times. I also know what the air in my room is usually like. This was totally different. My husband was aslepp in the living room that night and I told him about this first thing in the morning. Then on Sat. we read about the sighting that was reported in the paper that happened earlier that day and evening."],"Log Number":"US-12202010-0007","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-76.49891","Date Submitted":"12/20/2010 10:57 UTC","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Columbia","There were no other sightings in Columbia on or around December 15th 2010"],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/27058.html.txt","/var/www/straped/mufon/org/27058.html"],"City":"Columbia","Object Shape":"Other","Summary":"Object giving off light and sound in bedroom-changed quality of air in room","Object Features":"Undisclosed","Case Number":"27058","Tags":"City","Weather Factors":"Unknown","Region":"Pennsylvania","Date of the Event":"12/15/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.038798,+-76.49891(27058)&iwloc=A&hl=en\"> mufon case (27058) map </A>","Latitude":"40.038798"}