{"divs":["Sighting DetailsWhile at my home watching television in my living room a blue-white light came into view through the the upper portion of my living room window.The glow of this object illuminated the area of floor below the window and drew my attention then to the top of the window as the object came into view shortly thereafter. The object appeared to be the size of a penny held at arms length. The object did not produce any sound that I am aware of. This object was traveling at a high rate of speed. Many many times faster than any conventional aircraft. I quickly raced to my window, parted the lower window shades ( the lower window is the only portion of this window with shades) and again observed this object. It was aprox. two to three miles away at this point. It was climbing in an arc toward the Northeast. This object did not display any F.A.A. required Lighting configurations. The light intensity did not waver during the sighting. It did not blink, flutter or fade. The object intensity remained constant from all angles during my observation.The object was in my estimation 300 to 500 Ft distant at it's nearest point to me. I checked \"Flight Aware\" and found no aircraft to be in the area."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.811207,+-100.779149(27053)&iwloc=A&hl=en\"> mufon case (27053) map </A>","Disposition":"Unknown","Case Number":"27053","Tags":"City","files":["/var/www/straped/mufon/html2text/27053.html.txt","/var/www/straped/mufon/org/27053.html"],"Object Shape":"Sphere","Latitude":"46.811207","Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Region":"North Dakota","Country":"United States","Source":"MUFON","Weather Factors":"None, Does Not Apply","Summary":"Fast moving bright blue-white object traveling Northeasterly","Longitude":"-100.779149","Date of the Event":"06/25/2010 09:50 UTC","City":"Bismarck","Object Features":"None","Log Number":"US-12202010-0003","trends":["There have been 5 other sightings in Bismarck","There were no other sightings in Bismarck on or around June 25th 2010"],"Date Submitted":"12/20/2010 01:36 UTC"}