{"Disposition":"Insufficient Data","Date Submitted":"12/20/2010 12:02 UTC","Case Number":"27051","Source":"MUFON","divs":["Sighting DetailsI turned left off of Auction road went thru the covered bridge, turned right and saw an object in the sky. I thought at first a plane... looked a little harder and thought hhmmmm don't remember a cell tower being out here. Got to a stop sign right by the Spooky Nook Golfplex and I sat there staring in the sky at the lights wondering what it was because they were to bright to be a cell tower's lights. Sat there for a minute or two then the object began moving in my direction. Slowly too like 5 mph couldn't of been much faster than that at about 200 yards up or so (about the height of a cell tower) as it got closer I took out my cell phone but it's a piece of junk so I couldn't record anything I cracked the window to see if I could hear anything but there was no sound ZERO noise and this was a large object, to wide to be an airplane. There were 4 large bright white lights and two blinking lights one blue the other red. It continued to move very slowly and silently across the sky and as it approached the highway it sped up effortlessly to around 50 mph or so. I just sat there shaking my head trying to figure out what in the hell that could of been! All I know is no known man-made aircraft can move THAT slowly and with no sound across the sky. Very very bizarre and I wish there was an answer for what that thing was other than U.F.O. I've never seen anything like that and I wasn't on drugs, drunk or hallucinating at the time either!! I was relieved to hear that other sightings had occurred earlier that day but I haven't seen anything about lights at night."],"trends":["There have been 7 other sightings in Manheim","There were no other sightings in Manheim on or around December 15th 2010","This sighting has never been favorited.",""],"Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.164638,+-76.388761(27051)&iwloc=A&hl=en\"> mufon case (27051) map </A>","Object Flight Path":"Hovering then path","Country":"United States","Object Shape":"Unknown","Region":"Pennsylvania","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","City":"Manheim","Weather Factors":"Unknown","Latitude":"40.164638","Longitude":"-76.388761","files":["/var/www/straped/mufon/html2text/27051.html.txt","/var/www/straped/mufon/more/27051_submitter_file1__WhatISaw.jpg","/var/www/straped/mufon/org/27051.html"],"Log Number":"US-12202010-0001","Summary":"Strange lights, object moving very slowly and silently across sky","Date of the Event":"12/15/2010 11:58 UTC"}