{"Tags":"City","Log Number":"US-12212010-0007","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=29.427362,+-98.486888(27065)&iwloc=A&hl=en\"> mufon case (27065) map </A>","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was talking on my cell at the end of my sidewalk by the steet when I turned around facing my house and saw this huge black man bird thing gliding without a noise coming from the east maybe the distance would be like three streets over but about maybe five blocks down.[which three steets over there isnt five blocks because the woods are two blocks down. When i saw this I was stunned and stared at it trying to figure out what it was and then I saw it wasnt anything Ive ever seen. I ran into the house and yelled at my husband and my grown son to get out here quick. They came but seemed like forever and they looked and saw it too. When they saw it they thing was like the a few streets over and then disappeared behind the big trees. When we saw it we all said that no one would believe us; but I have recently been talking about it because it has bothered me so much. I lived in this neighborhood all my life and I can remember of three UFO sightings since I was five and all the sightings were in this neighborhood or around Stinson Field airport. I never came forward about them because people think ya lost your ever loving mind until recently when others Ive spoke with shared their experiences. I have other stories but this one is the most recent and I was wondering if anyone has ever seen this thing. It is silent like it was a glider but I could see the body was exactly like a man a very large man. Thank you for listening to me and I hope you dont think we have gone mad too. I called my daughter and told her afterwards and thats what made my mind up to stay silent. I had my darn cell on my the whole time and not once thought of taking a picture it happened so fast and Im not that savy on the cell."],"Date of the Event":"04/19/2009 06:30 UTC","City":"San Antonio","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around April 19th 2009"],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Case Number":"27065","Date Submitted":"12/21/2010 08:06 UTC","Object Features":"Appendage(s), Wings","files":["/var/www/straped/mufon/html2text/27065.html.txt","/var/www/straped/mufon/org/27065.html"],"Region":"Texas","Summary":"It was about 7 or 8 ft long black looked like a mans body with ft wing span about double head size of human but rouded like bird big long beak","Latitude":"29.427362","Longitude":"-98.486888","Country":"United States","Disposition":"Insufficient Data"}