{"Date of the Event":"08/22/1996 05:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.424281,+-86.608721(2706)&iwloc=A&hl=en\"> mufon case (2706) map </A>","Case Number":"2706","Tags":"City","files":["/var/www/straped/mufon/html2text/2706.html.txt","/var/www/straped/mufon/org/2706.html"],"Longitude":"-86.608721","Summary":"trianglier","trends":["There have been 24 other sightings in Fort Walton Beach","There were no other sightings in Fort Walton Beach on or around August 22nd 1996"],"City":"Fort Walton Beach","Region":"Florida","Viewing Distance":"101-500 Feet","Source":"MUFON","Date Submitted":"08/22/1996 05:53 UTC","Country":"United States","Latitude":"30.424281","Sighting Duration":"01:59:00","Log Number":"","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsEXT_LIGHTSpulsatedEXT_LIGHTSflashed_sequentiallyi was on government property,,, the beach goes onto gov prop. noise it made inthe water before it cam e into land. i grew up in a air force family , i,ll tellyou the difference between t-38 to an f-4 f-15 so on this was totally out of theordinary it totallly in the the gulf of mexico where i first saw it, cquite atfir5st till it started up then noise stopped..it slowley worked its way towardshore flashing red and green lightsnormal for a boat which i thought it was tillit hit the shores and totallly lite up everything, i followed east back andforth it going back and forth in the gulf for 6 hours,,,,,at the end it fianaly came upon shore once more but insteaad of traveling west this time it was goingeast on the shore rite toward me,.......,....yes im freaking out.... i followedthiswest onto gov. property 4 miles noone around now its coming towardme.....pretty serious shit, it hit the shoe lights were steady and not blinkingnow.. it came within 30 40 yards from me stopped and slowly turned around,,,strangley this was the neatest part i d didnt get a chance to see it all at oncetill then,,,,,,,,,,,,,,,, the way it turned around,, it did it real slow o showme all the three sides and all the lites afterr that it slowly went offshoreagain and turned its lites off, i was tired and gave up and wenthome.............ill remember this all my lifeEXT_LIGHTSflashed_randomlyEXT_LIGHTS_COLORwhiteEXT_LIGHTS_COLORgreen_whiteEXT_LIGHTS_COLORred_orange"],"Object Flight Path":"Stationary","Object Shape":"Triangle","Object Features":"Other"}