{"Log Number":"US-12212010-0003","Date of the Event":"12/21/2010 02:22 UTC","Summary":"Bright distinct Amber/yellow and white lights Falling at a rapid speed","Latitude":"40.324992","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Disposition":"Unknown","Date Submitted":"12/21/2010 03:28 UTC","files":["/var/www/straped/mufon/html2text/27061.html.txt","/var/www/straped/mufon/org/27061.html"],"Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Longitude":"-75.328175","map":"<A HREF = \"http://maps.google.com/maps?q=40.324992,+-75.328175(27061)&iwloc=A&hl=en\"> mufon case (27061) map </A>","Tags":"City","trends":["There has been one other sighting in Telford","There were no other sightings in Telford on or around December 21st 2010"],"Object Features":"Undisclosed","divs":["Sighting Details1. watching luner eclpise 12-21-2010 2. the falling lights 3. we tried to determine what it was and came to the conclution that is was nothing man made 4. the amber lights looked like they were placed in a circle with a red one in the middle and a white on on top you could make out each light because of the small sace in between them but the white light had a little more space inbetween it then the rest, i assume thats because it was on top of the craft 5. my fellings and reactions were wtf was that? then a sudden feeling of insignificance knowing that I just saw a ufo 6. It fell between the tree line (my personal detailed discription) I was outside with my best friend watching the luner eclipse and we both saw four amber lights across from eachother with a redlight in the center and a white light on top. This object came into view above the moon and decended to earth in under 10 seconds it fell behind the tree line near my house. it looked like where it fell was about 100 miles away from where we were. we never say anything come back up above the tree line after that.. no satilite could have steady lights like that and would burn up in the atmosephere, no plane could have done a dive from that high, it was not a space shuttle, and it was not a meteor."],"Region":"Pennsylvania","Object Shape":"Circle","Case Number":"27061","City":"Telford"}