{"Log Number":"US-12222010-0004","Disposition":"Unknown","Summary":"something that I never saw beforetoo large too weird too much sparkle, too fast and disappeared","Latitude":"40.045916","City":"Lancaster","trends":["There have been 22 other sightings in Lancaster","There were no other sightings in Lancaster on or around November 30th 1984"],"Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Region":"Pennsylvania","Date of the Event":"11/30/1984 12:00 UTC","Case Number":"27069","Object Shape":"Sphere","Tags":"City","divs":["Sighting DetailsI am finally telling my story which I believe happened in 1985 give or take a year. My small dog was very sick, on his last day on earth. I came home from work to let him out at lunch time. Carried him outside, and being tired I propped myself against the basement stair railing. Watched the dog and then looked up in the sky and saw this huge (very large) craft in the sky, lower sky. I put my head down to check the dog and then it occured to me what I saw. Un-believable it was it was so large, sparkled so much around the middle that I never have seen that sparkle since even though I look for it, yes still do. The craft was low. Then all of a sudden I saw it start to disappear from my left to right, just like someone put a veil to cover it, it disappeared just like that. I never heard any noise, nothing. I picked up my dog, thought to myself what I saw and living in a small town here in PA. decided not to say anything. However, in about a half hour I did telephone the local radio station and without giving my name asked them if anyone called about a strange craft in the sky. NO was the answer and I hung up, then telephoned the Lancaster airport (small) and was told a man did telephone about a strange craft, I hung up before giving my name. Told my husband and a few people. Then we lived in Arizona for a about eight years. One night about ten-ish before going to bed I decided to have a smoke on the deck. I sat down and looked out to the sky (not high in the sky) and saw these lights. Even though we lived near Luke Airforce base I never heard a noise. I watched these lights and again never thinking of a UFO, I watched them. If it was a UFO it was large, almost as large as the one I saw in Akron. Next morning in the newspaper there was an article on the lights. Yes, I believe there are UFO's, if not our government is lying to us on their air craft. I know what I saw, and am not one to make up things, do not need the attention one gets from making up things. I shall never forget what I saw either in Akron. PA or Surprise, Arizona. I am now 76 years old and my neighbor wanted me to report this to you. Took me about six or so months before doing so. thank you,"],"files":["/var/www/straped/mufon/html2text/27069.html.txt","/var/www/straped/mufon/org/27069.html"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.045916,+-76.297414(27069)&iwloc=A&hl=en\"> mufon case (27069) map </A>","Date Submitted":"12/22/2010 04:59 UTC","Longitude":"-76.297414"}