{"Object Shape":"Unknown","Tags":"City","City":"Pueblo","Summary":"Contact and Abduction","map":"<A HREF = \"http://maps.google.com/maps?q=38.262167,+-104.602611(27066)&iwloc=A&hl=en\"> mufon case (27066) map </A>","Country":"United States","divs":["Sighting DetailsOn June 5th I did a worldwide internet meditation lead by Lyssa Royal Holt held by Paranormal Matrix for \"First Contact\". Many things have happened since then but I was never afraid until lately. A week following the meditation I woke and while taking a shower my stomach was burning. Looking down I had (5) 1 inch cuts leading out of my navel and (1) 2 inch cut to the left of my navel. I wasn't alarmed, in fact, felt very calm. I showed the cuts to my husband. I have a scar from the cut next to my navel. Many strange things have happened since. I am irritated with myself for doing the meditation but I felt very compelled to do it at the time. I opened the door to communication and now I want it to stop. I contacted Paranormal Matrix for help regarding this situation but they have never responded. I emailed Mufon Abductions last week and I have had no response from them either. I did have a close UFO sighting in 2008. I reported it in 2009 after someone else saw the same thing a yr after I saw it. They had photographed it and my photos did not come out with anything. I am willing to be hypnotized."],"Object Features":"Unknown","Source":"MUFON","Case Number":"27066","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Viewing Distance":"Unknown","trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around June 5th 2010"],"Date Submitted":"12/22/2010 08:36 UTC","files":["/var/www/straped/mufon/html2text/27066.html.txt","/var/www/straped/mufon/org/27066.html"],"Longitude":"-104.602611","Latitude":"38.262167","Log Number":"US-12222010-0001","Date of the Event":"06/05/2010 12:00 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Region":"Colorado"}