{"Object Shape":"Sphere","Longitude":"-87.160837","Case Number":"27075","divs":["Sighting DetailsThis sighting occured back around the mid 1970s when me and two of my buddies were out at Pensacola Beach at a sand dune called the cross because there is a permanent structure of a cross on top of the sand dune. We were standing next to the water on the gulf of mexico facing the water when one of my buddies noticed the object and he stated \"dudes check it out a UFO\" so we turned towards it. There was no wind that night and the gulf was as quite as a lake. The object was traveling paralell to the road maybe 100 to 150 feet above the road. The objecct appeared to be a sphere of solid white light. So we started jumping up and down waving and shouting at it and low and behold the object chaged directions and came directly towards us and and in no time the object was almost on top of us. The object made no sound whatsoever and at the last second my friend that spotted the craft shouted run so we took off running for the direction of the sand dunes towards the road. never run so fast in my life and somehow escaped the object. we gatherd back together in the sand dunes and then my friend who originally spotted it saw it again as it resumed its paralell course on the road heading eastward. There is a large water tank it came close to and would guess the object to be about the size of the tank part of it. and it I had to guess would say the diameter of it was about 35 to 40 feet. Then the object did somthing strange as we watched it go past the water tank. That part of the beach was lighted up pretty well with business in that area. The object went almost pitch black and all we could make out was a sphere silloett of the object. So I guess they have the ability to turn off the lights on the craft so as not to be seen at night time. then the object disappeared in the distance and was gone. Ok credibility the friend that spotted it had like a four point zero grade average at a local college. Me and my friend both went through radar school in the Navy about the same time. the other friend was going through a trade school. interesting note the friend going through the trade school said he claimed to see a similar object go into the gulf waters. this paticular friend is almost leagally blind but claims he can see better at night than in the daytime. Prefer to remain anonymous on this because of the real Men in Black are out there and no one wants a visit from them as documented in one of Times Lifes books I think is where I read about them. Just one last humorous note to the sighting we hadn't even opened the bottle of wine we had with us that night which we gulped down afterwards. Lucky we all didn't end up on Jupiter that night. well that was our sighting event. This thing was practically directly over our heads when we took off running. Sarry stuff! Don;t remember any missing time. Weather balloons cant change course as this object did as it made a beeline toward us. Well thats about it on the sighting. I am a firm believer in the Bible and it states somewhere in Revelations before the end of time there will be strange lights in the sky. I believe it."],"Object Features":"Unknown","Viewing Distance":"20 Feet or Less","Date Submitted":"12/23/2010 04:04 UTC","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/27075.html.txt","/var/www/straped/mufon/org/27075.html"],"Country":"United States","City":"Gulf Breeze","Date of the Event":"10/15/1975 11:02 UTC","Region":"Florida","Log Number":"US-12232010-0004","Summary":"three eyewitness sighting pensacola beach object came after us we ran and watched object dissapear","Sighting Duration":"Undisclosed","Latitude":"30.359554","Object Flight Path":"Path with directional change","trends":["There have been 55 other sightings in Gulf Breeze","There were no other sightings in Gulf Breeze on or around October 15th 1975"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.359554,+-87.160837(27075)&iwloc=A&hl=en\"> mufon case (27075) map </A>","Tags":"City","Weather Factors":"None","Source":"MUFON"}