{"trends":["There have been 18 other sightings in Rancho Cordova","There were no other sightings in Rancho Cordova on or around December 22nd 2010","This sighting has never been favorited.",""],"Summary":"Square, partially transparent white craft seen traveling in a straight line","Date of the Event":"12/22/2010 03:40 UTC","Object Shape":"Square, Rectagular","Weather Factors":"None","Log Number":"US-12232010-0008","Case Number":"27079","Date Submitted":"12/23/2010 12:51 UTC","City":"Rancho Cordova","Sighting Duration":"00:00:04","Object Flight Path":"Straight-line path","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.597772,+-121.301228(27079)&iwloc=A&hl=en\"> mufon case (27079) map </A>","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/27079.html.txt","/var/www/straped/mufon/more/27079_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/27079.html"],"divs":["sighting detailsit was approximately 3:40 pm, and i was traveling west on highway 50 between mather field blvd and watt ave. at the time i was looking at a very large, dark cloud hovering about 1 to 2 miles ahead of me. earlier in the day a couple of funnel clouds had been sighted south of mather field, so i was watching the sky, trying to see if i'd see one too. at i was staring at this large black cloud i saw something very odd. at first i thought it was a very small cloud, but then i realized it was perfectly square, and traveling against all the other clouds in a straight line. the storm was heading east towards the sierras, and this object was heading north. the size was approximate to my thumb nail (about 1\\2 inch in diameter in the sky), and it was white, but partially transparent (i could see the dark cloud through it). and it was moving very quickly! in the time i said, \"what the hell is that? what ...\" it was gone. it just vanished out of sight. i have never in my 48 years ever seen anything like that."],"Latitude":"38.597772","Country":"United States","Longitude":"-121.301228","Source":"MUFON","Object Features":"Other","Viewing Distance":"Over One Mile","Tags":"City"}