{"divs":["Sighting DetailsI was driving on Redbridge Road in Kansas City a little past 7 pm last night and I saw unusual white lights above tree line coming from the Overland Park area from the west, coming towards me. There were three bright lights. Object looked quite big. As it flew closer, It looked like a triangle, that's what I thought. I actually pulled off the road, got out of my car and watched this thing fly, literally, over my head slowly and very low, maybe several hundred feet up, over the road. It made a noise like a flying craft of some sort. There were three lights on each point, so to me it really seemed triangular. It was really strange, it was completely grayed out, meaning that you couldn't see any real shape. Last night was cloudy, but not black. This thing was just a little darker shade grey that barely could be made out. I tried to get a pic or video, but couldn't get it in time. It was big, flying fairly low and went towards Grandview to the East. Incidentally, another guy pulled up to me asking me what in the world that was. So, this thing was big and all the drivers on the road no doubt could have seen it like me. It looked larger than a house. I called the local police shortly after this to report it and to see if others had reported it. At that time, no one else reported it yet. Honestly, this thing was the strangest aircraft i had seen with my eyes. It didn't look like a 'normal' plane with blinking lights, etc. I have never reported anything like this before."],"Object Shape":"Triangle","Region":"Missouri","Longitude":"-94.570147","Object Features":"None","Latitude":"39.102766","files":["/var/www/straped/mufon/html2text/27077.html.txt","/var/www/straped/mufon/org/27077.html"],"Case Number":"27077","City":"Kansas City","map":"<A HREF = \"http://maps.google.com/maps?q=39.102766,+-94.570147(27077)&iwloc=A&hl=en\"> mufon case (27077) map </A>","Disposition":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Log Number":"US-12232010-0006","Weather Factors":"None","Viewing Distance":"101-500 Feet","Tags":"City","Country":"United States","Summary":"Large Triagular UFO Over Street in Kansas City","Sighting Duration":"Undisclosed","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around December 21st 2010"],"Date of the Event":"12/21/2010 07:02 UTC","Date Submitted":"12/23/2010 12:09 UTC"}