{"Date of the Event":"12/22/2010 04:01 UTC","Disposition":"IFO","City":"Los Angeles","Log Number":"US-12232010-0003","Region":"California","Summary":"4 Orbs appeared out of nowhere","Date Submitted":"12/23/2010 03:15 UTC","Country":"United States","Case Number":"27074","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around December 22nd 2010","This sighting has never been favorited.",""],"Object Features":"Other","Sighting Duration":"00:00:05","files":["/var/www/straped/mufon/html2text/27074.html.txt","/var/www/straped/mufon/more/27074_submitter_file1__2010-12-2216.01.03.jpg","/var/www/straped/mufon/org/27074.html"],"Latitude":"34.093949","Longitude":"-118.321461","Weather Factors":"Rain","map":"<A HREF = \"http://maps.google.com/maps?q=34.093949,+-118.321461(27074)&iwloc=A&hl=en\"> mufon case (27074) map </A>","divs":["sighting detailsa friend and i went out to do some christmas shopping at the grove in hollywood. (the grove is an outdoor shopping mall) it had been raining non stop for the past three days and was raining heavily today in particular. just after a few minutes before we arrive at the grove the rain had stopped. i noticed that a lot of people were pointing at the sky and taking pictures. in the wake of the storm was a brilliant double rainbow, so i decided to take some photos myself. as i was about to take the picture i noticed through the screen on my cell, 4 orb like objects in front of the rainbow that were not there seconds prior. i stared at through the screen in awe. i have never seen a ufo\\s in my life but always wanted to so badly. and here i was experiencing it. they were gliding effortlessly in tandem in the sky right in front of this beautiful rainbow. it was perfect. as i took the picture my phone died. i look up from my phone, they were gone. not sure if the photo came out or not. when i arrived home i immediately connected my phone to my computer. and there they were, the four objects i saw. the picture doesn't to them justice but none the less, i captured them. 3 orbs or lights above and 1 below. one object in particular that i find interesting is the one in the middle. it almost looks like a creature attached to it. if anyone else saw this event, please post."],"Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON"}