{"Date Submitted":"12/23/2010 01:13 UTC","Object Flight Path":"Stationary,Hovering then path","Source":"MUFON","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/27072.html.txt","/var/www/straped/mufon/org/27072.html"],"Country":"United States","trends":["There have been 8 other sightings in Lewisville","There were no other sightings in Lewisville on or around December 22nd 2010"],"Latitude":"33.051243","City":"Lewisville","Weather Factors":"None","Summary":"4 objects in a V formation all were self luminescent and jellyfish shapped.","Disposition":"Unknown","Object Shape":"Boomerang, Other","divs":["Sighting DetailsAt aprox. 21:06 centeral I was on the balcony of my moms apartment. In the sky I noticed 4 objects in a V pattern. At first I thought they were lights from a airplane being that DFW airport is right down the road. Then i realized that they were stationary. At first i thought maybe they were a group of helicopters but they wernt putting off any sound. Also with dfw being a extremly controled airspace no group of helicopters would ever come to a hover in formation (I use to work for DHS). I quickly got my mom and her boyfriend to confirm that i was not going crazy. One started to fade off into the distance. As soon as that one was out of view another Shot up from what looked like the ground. It moved at the rate of a missile but also with no sound. The area it appeared to come from is about 300 yards away. I watched as they all started to fade off into the sky. It was one of the stragest things that has happend to me yet. I wanted to belive that it was man made but im not sure. I am a skeptic by nature and this totaly threw me for a loop. I deffently will think twice before putting some ones oppion off on UFO's."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.051243,+-96.985014(27072)&iwloc=A&hl=en\"> mufon case (27072) map </A>","Object Features":"None","Viewing Distance":"101-500 Feet","Case Number":"27072","Log Number":"US-12232010-0001","Region":"Texas","Date of the Event":"12/22/2010 09:06 UTC","Longitude":"-96.985014"}