{"Object Shape":"Unknown","Log Number":"CA-12242010-0003","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around December 23rd 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.547174,+-113.482752(27086)&iwloc=A&hl=en\"> mufon case (27086) map </A>","Source":"MUFON","Object Flight Path":"Undisclosed","Date Submitted":"12/24/2010 06:01 UTC","Object Features":"Undisclosed","Sighting Duration":"00:15:00","Latitude":"53.547174","Viewing Distance":"Unknown","Disposition":"Unresolved","Case Number":"27086","Longitude":"-113.482752","Tags":"City","Country":"Canada","divs":["sighting detailsi have filed a report before with you guys about a strange set of birds i filmed back in july of this year (spiritbird) that just decintegrate in mid air with an outward traveling ring of white light or energy. i sent you the video a while back. anyhow i was traveling back to calgary from edmonton, traveling south on the anthony henday highway (216) a little south of stoney plain rd. on the west side of edmonton & the next thing i know i was on a range rd. going north on the east side of the city, missed my junction to the 2 south (calgary) and can't recall how i got there. the (216) is a ring rd. that runs around the city of edmonton from nw to ne. from the west side @ stoney plain to east side to yellow head highway (16) is at least a 15 min drive @ 110 km\\h. i did not feel any adverse health affects prior to or after the incedent but i was confused as to how i got there and where i was. now unless i drove for 15 min @ 110 km\\h with no conciousness and negotiated multiple curves and not roll off the rd. then something else happend. for the life of me i can't recall that stretch of driving to that point. i was driving ryder rental unit 376767 from the calgary terminal and maybe there is an abnormality on the data recorder. my sense of time off too, like i wasn't even there for it."],"files":["/var/www/straped/mufon/html2text/27086.html.txt","/var/www/straped/mufon/org/27086.html"],"Date of the Event":"12/23/2010 10:20 UTC","Summary":"Suspect I was abducted while Driving a Semi Truck","Weather Factors":"Unknown","Region":"Alberta","City":"Edmonton"}