{"Date Submitted":"12/24/2010 01:43 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Region":"Nevada","Case Number":"27085","Weather Factors":"Unknown","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around December 23rd 2010"],"Disposition":"Insufficient Data","Latitude":"36.201259","files":["/var/www/straped/mufon/html2text/27085.html.txt","/var/www/straped/mufon/org/27085.html"],"City":"North Las Vegas","divs":["sighting detailson 12\\22\\2010 at approximately 2210 hours i observed two bright white flashing lights, apparently connected to one structure, flying southwest of my house. the lights appeared to be less than a mile from my house and appeared to be flying at a pretty low altitude (about the same altitude that the local police helicopter flies over on a daily basis). i saw the lights from my living room. i am very used to seeing all manner of aircraft flying over the house (all types of military jets, smaller commuter planes, the occasional airliner, tourist helicopters, pavehawk helicopters, police helicopters, even a blimp when they were advertising a new casino.) and i immediately thought to myself that the lights did not look like anything i have ever seen before. i leapt out of my chair, which i do a lot because i like to see what is flying over my house, and went outside. i noticed that there was no noise coming from the lights, which i think i should have heard judging by the distance i think the lights were at. i also realized how quickly the lights seemed to be traveling. in a span of approximately 20 seconds the lights traveled from the northern end of north las vegas to approximately i-15 and sahara ave. the lights then traveled to the west and became blocked by the house to the south of mine. i waited a for a while to see if i could see the light continue to travel to the west, but did not see it come back around. the object also seemed to lose elevation as it traveled across the valley. this was not ordinary and have never seen anything like this. i was not scared, but did have a feeling of awe after observing this thinking about how fast this thing must have been flying."],"Summary":"Bright white flashing lights, traveling at high rate of speed","Object Features":"Unknown","Tags":"City","Log Number":"US-12242010-0002","Longitude":"-115.111311","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.201259,+-115.111311(27085)&iwloc=A&hl=en\"> mufon case (27085) map </A>","Date of the Event":"12/23/2010 10:10 UTC","Object Shape":"Unknown","Sighting Duration":"Undisclosed"}