{"Weather Factors":"Unknown","Country":"United States","Longitude":"-80.133889","map":"<A HREF = \"http://maps.google.com/maps?q=26.126948,+-80.133889(2708)&iwloc=A&hl=en\"> mufon case (2708) map </A>","Sighting Duration":"00:00:59","Latitude":"26.126948","Disposition":"Unresolved","Date of the Event":"05/31/1980 07:00 UTC","Region":"Florida","files":["/var/www/straped/mufon/html2text/2708.html.txt","/var/www/straped/mufon/org/2708.html"],"Source":"MUFON","Log Number":"","Object Shape":"Diamond","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Dome, Other","Date Submitted":"05/31/1980 07:00 UTC","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around May 31st 1980"],"Tags":"City","Summary":"past sighting never reported","divs":["Sighting DetailsThis was summertime in 1980 and i was in florida during a scheduled visit to myfathers housemy parents are divorced. Myself, my younger brother Curtis, myfather and stepmother were in my fathers car driving home from my stepgrandmothers house in the area of sunrise drive and 31st street. There is alarge drive-in there that during daytime hours is called the thunderbird swapshop and is a huge flea market.Because of the time lapse im not sure of the exact time and date except that itwas just barely dusk. the sky was already relatively dark and my little brotherwas looking at the sky trying to see airplanes. the fort lauderdale airport isnot that far away.i wasnt realy paying too much attention to him but at onepoint he began to ask me if this was an airplane. we were stopped at a trafficlight headed east with the swap shop to our north and i glanced out the windowand up slightly and saw a pitch black object against the gray sky that for somestrange reason raised goosebumps all over me at first sight. I didnt and stilldont know what it was but my reaction was like a primal fear and almostuncontained emotion and i screamed for my father to look. I remember other carson the westbound side had stopped and a few other people seemed to also belooking at it but traffic ahead had begun moving and almost at that moment theobject shot up and to the right, hovered again just momentarily and then shotstraight up it seems, but in the blink of an eye almost giving me the thoughtafterwards that it had just dissapeared. i heard no sound. i saw no lights. itoccured to me that as i was all excited in the car that our radio that my dadalways had on had gotten louder and that the station had gotten to be totalstatic untill the object went away.my brother was simply too young to remember most of the details though heremembers the incident but i remember it like it was yesterday and i would loveto know if anyone else that saw it knows what we saw.Ive only recently become computer literate and ive never mentioned this sightingto any one except my girlfreind untill now. I figure at least YOU wont thinkthis story is crazy or a lie. i promise you that it isnt.I spent months obsessed with what id seen. I thought of it night and day and imust have drawn it a hundred times. I could see great detail. It seemed veryclose and very large.It was solid black and s"],"Object Flight Path":"Straight-line path","City":"Fort Lauderdale","Case Number":"2708"}