{"Country":"United States","Object Flight Path":"Undisclosed","Region":"Montana","files":["/var/www/straped/mufon/html2text/27082.html.txt","/var/www/straped/mufon/org/27082.html"],"trends":["There has been one other sighting in Anaconda","There were no other sightings in Anaconda on or around"],"divs":["Sighting DetailsI received an email from a curator for a historical society In Deer Lodge County wanting me to contact him about some \"interesting personal experiences\" concerning anomalous occurrences. When I spoke with him briefly on the phone he said that he and at least seven other people would like to go on record with their stories of personal experiences dealing with UFO's in the Anaconda area, and are willing to be recorded for posterity. He says that there may also be some forms of evidence to be found, specifically hydrophobic areas where they say there have been landings. He led me to believe that there is much more to this story. He said that they're getting old and want this preserved for history. He sounded sincere and genuine. I asked him to gather all the folks together and for them to write down their experiences in detail so when we do meet nothing gets missed in that exchange. According to him. they will all be there for this meeting and are all willing to go on record with their accounts. He claims that the Anaconda area is known for it's encounters but it's kept an open secret. I have set up a meeting with him and will update when I know more and as necessary."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.13015,+-112.973701(27082)&iwloc=A&hl=en\"> mufon case (27082) map </A>","Weather Factors":"Unknown","Date Submitted":"12/23/2010 03:21 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-112.973701","Date of the Event":"Unknown","Source":"MUFON","Disposition":"Insufficient Data","Object Shape":"Unknown","Case Number":"27082","Object Features":"Undisclosed","Summary":"Several witnesses want to go on record with their experiences.","City":"Anaconda","Tags":"City","Log Number":"US-12232010-0011","Latitude":"46.13015"}