{"trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around August 15th 2010"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Summary":"Clearly seen tirangle-shaped craft with blueish lights at each corner; mirror finish","Object Shape":"Triangle","Source":"MUFON","City":"Tallahassee","Object Flight Path":"Hovering then path","Disposition":"Insufficient Data","Latitude":"30.443986","Date of the Event":"08/15/2010 11:30 UTC","Longitude":"-84.279253","map":"<A HREF = \"http://maps.google.com/maps?q=30.443986,+-84.279253(27099)&iwloc=A&hl=en\"> mufon case (27099) map </A>","Log Number":"US-12252010-0001","files":["/var/www/straped/mufon/html2text/27099.html.txt","/var/www/straped/mufon/org/27099.html"],"Region":"Florida","Object Features":"Patterned Surface","divs":["Sighting DetailsI saw a UFO in Tallahassee, Florida while driving down Meridian Road. My friend was driving north down Meridian Rd. and I was sitting in the passengers seat. We were on our way to the Tallahassee Mall to see a movie. Which me did not see. Me and my friend were... sceptical believers till we saw this. While looking out the window to my right I saw a triangle in the sky. At first, I assumed it was a cell tower or something then, after thinking for a second, realized that there are no cell towers anywhere near the area. I should know. I've lived in the area for near 25 years now. Not to mention, it was VERY visible. It seemed to be hovering above what would be the southern end of Thomasville Rd, near the Miracle 5 Theater. We almost stopped (slowed to a crawl) after I pointed it out to my friend and watched it for near a minute. It made no noise and did not move. It simply hovered. There were bright, blueish lights at each of the three corners. I could clearly see the outline of the triangle and even some detail. And there was very little detail to be seen. That is to say, it was very smooth and seemed to have a mirror finish. And after nearly a minute of watching, it made a full 180 degree turn, in place, and literally STREAKED out of view. Meaning it moved fast enough to leave streaks of blue light behind it nearly a mile long. This is what I saw, described to the best of my ability. I would like to know what I saw, and if anybody else saw the same thing, which I know is a long shot, as there is almost no chance anybody from Tallahassee will read this, let alone somebody who saw the same... craft I did. As far as feelings after seeing the craft, I had very few. The overwhelming feeling was of certainty. Certainty that I had seen something I had never seen before and something that, as far as I know, humans are not capable of doing. And I must admit, I felt excitement at having an experience of my own. I knew they must be out there. The only question I had was whether or not they were visiting our planet. I no longer ask that question. At least one DID, in fact, visit us. And I can only be sure of that because I saw it. I was not high. I was not tripping. I was not hallucinating. I am very sane. And that's all I can say. Now, I just need to know. There is very little I wouldn't do to know."],"Country":"United States","Weather Factors":"Unknown","Case Number":"27099","Date Submitted":"12/25/2010 02:16 UTC"}