{"Sighting Duration":"00:01:00","Object Features":"Unknown","Object Shape":"Triangle","trends":["There have been no other sightings in Waxhaw","This sighting has never been favorited."],"Region":"North Carolina","Country":"United States","divs":["Sighting DetailsI was watching TV in my living room tonight around 7:30pm which is Christmas Eve. The house has big windows and high ceilings, so when you are sitting down on the couch and looking up at the tv which hangs on the wall, you can also see out into the sky. The sky above my house has airplanes that pass over all the time. You automatically know that they are planes because they typically have lights that are white in color, and they emit the normal flashing lights pattern as they fly across the sky. It is a normal and regular occurance to see them through the windows when I am in there watching tv, but this particular event caught my eye. As I was watching tv tonight, I glanced up at one of the windows because something different caught my eye... I saw 3 very bright orange lights in a triangle formation slowly moving across the sky almost floating above and toward the house. I ran and picked up my cell phone, the only camera I had, and went outside and shot about 1 min of footage of the event. I am an avid UFO Hunters follower, and have seen this exact type of formation featured in one of their episodes. It looked almost exactly like the \"phoenix lights\" but maybe not as big, and there were only 3 lights that looked like they were in a triangle shape, not the multiple ones you saw in the phoenix footage. There were however two more lights that were in front and behind the triangle shape.. I will discuss this more below... I could not believe I was actually seeing this with my own eyes. I could not even tell that the camera phone even was picking up the lights in the sky. It was not until later when I looked at the video afterwards that I could tell I did get something. The lights that I saw were a very bright orange, much more intense than the airplane lights that cross the sky, and definitely a different color. They were not flashing like the airplane lights do. You can't see the airplanes that were also in the sky flying in the video, but there were at least two to three airplanes in the area but were at a much higher altitude. The airplane lights were much dimmer than the orange lights that show up on my video camera footage, and I guess that is why you can't see them in the video... The 3 orange lights I saw were in formation, and not moving in distance from one another, but seemed to be moving as a whole. They were in a triangle formation, but I could not make out anything in-between the lights like it was some sort of a craft or something. It was just dark. The size was enormous, at least 2-3 football fields or more... It is hard to tell size, but it was huge. Much much bigger than the house. Probably easily as big as the entire high school that is directly across the street. It was moving slowly in the direction of the house and was literally almost right above the patio area where I was filming, although high up in the sky. There were also two more orange lights, same color and intensity. One was in front of the triangle, and one behind, as if one was leading the triangle shape, and one was following? or they could have even been possibly connected. It is hard to say. I could not make out any type of object in-between the lights, just the actual formation itself. It got so close that I ran inside the house to shut off the light, and when I came back out, it was gone. I looked all around the sky outside the house, and could not see it anywhere. If it was an object, it either disappeared completely, or turned off the lights or left at an immense rate of speed, because I was only in the house for about 10-20 seconds before I came back outside again to continue filming. It just disappeared. I never thought I would actually see something like this. I only get to see it on tv... I was completely dazed, and almost shocked when I looked up and saw this thing in the sky that I have seen on tv before... I remember them saying \"Get video!\" so I grabbed my cellphone and ran outside, and I still can't believe I actually have witnessed what many others have. I felt I should share this information since it maybe can help us all finally figure out one day what is up there... I have attached two videos. The first is the actual footage that I was able to get of the triangle shape, and the next is a short video of exactly what I was doing and how I shot the video about 10 minutes after the event had happened... Thank you."],"Longitude":"-80.743402","City":"Waxhaw","Date Submitted":"12/24/2010 08:57 UTC","files":["/var/www/straped/mufon/html2text/27096.html.txt","/var/www/straped/mufon/org/27096.html"],"Case Number":"27096","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Disposition":"Unknown","Tags":"City","Summary":"Looked up in sky and saw huge triangle shaped formation like you see on UFO Hunters","Date of the Event":"12/24/2010 07:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.924594,+-80.743402(27096)&iwloc=A&hl=en\"> mufon case (27096) map </A>","Log Number":"US-12242010-0013","Weather Factors":"None","Latitude":"34.924594"}