{"Object Features":"Unknown","Tags":"City","Object Shape":"Star-like","Longitude":"-76.278673","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27093.html.txt","/var/www/straped/mufon/org/27093.html"],"Date of the Event":"12/24/2010 06:06 UTC","Region":"Virginia","Log Number":"US-12242010-0010","City":"Norfolk","Summary":"Light traveling ENE at speed similar to airplane but whith no marker lights and went dark after dimming","Viewing Distance":"Unknown","Case Number":"27093","map":"<A HREF = \"http://maps.google.com/maps?q=36.856299,+-76.278673(27093)&iwloc=A&hl=en\"> mufon case (27093) map </A>","Object Flight Path":"Straight-line path","divs":["sighting detailsstanding on the front porch smoking a cigarette. looking up at the sky from under the porch roof(there is supposed to be a storm coming) noticing the sparse clouds and looking up at the stars and planets. (we live near an airport\\norfolk international) there is this (plane??) only with no marker lights moving east north east. i waited a few seconds to see if i could see it flash, or to be able to see port side lights. i was not able to see either. i thought this to be very unusual and pounded on the window to get my wife's attention (watching tv) she came running out saying what what what.... (typical response..lol) once she was on the porch i pointed and told her look out here..(under the edge) (look at the light) she asked me \"what is it?\" to which i replied \"i have no idea, but it doesn't have marker lights\" the light, a few moments later, dimmed from bright white (more luminous than the stars\\planets), to a red light slightly dimmer yet still bright. this lasted approximately 2-3 seconds and then it got much dimmer(sort of like it burned out??) then we could no longer see it. i was in the military, navy and have seen missiles launched and would sort of say this was not unlike a tomahawk launch-but with out the smoke, sound, speed of ascent, also i saw no booster fall away.. ie... ufo."],"Latitude":"36.856299","Weather Factors":"None","Date Submitted":"12/24/2010 06:30 UTC","trends":["There have been 24 other sightings in Norfolk","There was one other sighting in Norfolk on or around December 24th 2010"],"Disposition":"Unresolved"}