{"City":"Hendersonville","Country":"United States","Date of the Event":"12/24/2010 12:00 UTC","Viewing Distance":"101-500 Feet","Object Features":"None","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Hendersonville","There were no other sightings in Hendersonville on or around December 24th 2010"],"Summary":"Triangle shaped object, TR3B?","Case Number":"27090","Tags":"City","Date Submitted":"12/24/2010 01:50 UTC","divs":["Sighting DetailsMyself and \"CHUCK\" were checking out an abandoned farmhouse late Thursday night, early Friday morning. I noticed a shooting star, pointed it out to \"Chuck\", when simultaneously we noticed three brighter than normal stars in the northern sky. upon further inspection, we noticed the stars were moving in a southwestern direction and the distance between them never changed. The three \"stars\" began to get brighter and brighter until they were roughly the size of a small basketball or a large football. At this point, we realized the \"stars\" were attached to a triangle, boomerang shaped object. The only reason we could tell the shape of the object was because as it moved, it was blocking the stars behind it. There were no clouds in the sky this evening, and it was very quiet and still outside. The object flew directly overhead with no sound. \"Chuck\" noticed the hairs on the back of his neck were standing upright and my hair and scalp had a strange tingling sensation. A short distance from our event there is a small airport, now, we are used to seeing small airplanes take off and land, so we are well aware of the size, appearance and light patterns of these aircraft. In almost a split second, the three \"stars\" became very intense, we heard an almost mechanical, electrical kind of humming and the object INSTANTLY shot off in the direction of Nashville. A short time after, we could see and hear helicopters heading directly behind the path the object had been taking. At this point, we realized what we had saw as being the mythical TR3B. From our vantage point, we feel the object was at least two to two and a half football fields in width. We have reported this to no one and have not contacted any agencies in regards to this for fear of retribution or retaliation, or even ridicule. All these events took five minutes in total to unfold. We plan on making nightly trips over the holiday break to try and witness these events again."],"Region":"Tennessee","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/27090.html.txt","/var/www/straped/mufon/org/27090.html"],"Longitude":"-86.614776","map":"<A HREF = \"http://maps.google.com/maps?q=36.308314,+-86.614776(27090)&iwloc=A&hl=en\"> mufon case (27090) map </A>","Latitude":"36.308314","Disposition":"Insufficient Data","Weather Factors":"None","Log Number":"US-12242010-0007","Source":"MUFON","Object Shape":"Boomerang, Triangle"}