{"Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.443539,+-105.217357(27091)&iwloc=A&hl=en\"> mufon case (27091) map </A>","Source":"MUFON","Summary":"Triangle formation of light traveling due East separate. Unknown shape traveling sw.","City":"CaÃƒÂ±on City","Object Shape":"Triangle, Unknown","Date of the Event":"12/14/2010 03:15 UTC","Sighting Duration":"Undisclosed","Case Number":"27091","Log Number":"US-12242010-0008","Longitude":"-105.217357","Country":"United States","divs":["Sighting DetailsWent outside to watch The Geminid meteor shower, approximately 3am. I was watching from my backyard. after about 5 minutes saw an unknown shape with no lights but a dim reddish brown metalic reflection traveling southwest, low in the sky. It looked like it might have been a mylar balloon but the wind was blowing southeast at the time and it seemed to traveling straight to the southwest. I just saw this object for a few seconds. just thought it unusual. Approximately 15 minutes later after seeing a couple of dozen meteors and a couple of Planes in the sky. I noticed 3 lights in the shape of a triangleabout the brightness of a medium star traveling directly overhead and due east. This object had no flashing lights, made no sounds, and seemed to be quite large, fast and extremely high in the sky from the lights against the stars in bacground. I couldn't tell if it was solid because it was so far away just seemed to be the same color as the night sky. I watched it as long as I could maybe 10 or 15 seconds. As many people as should have been watching tne sky that someone else probably saw it too. maybe i'm just the first to say something."],"Region":"Colorado","Object Features":"Undisclosed","Date Submitted":"12/24/2010 02:32 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/27091.html.txt","/var/www/straped/mufon/org/27091.html"],"Latitude":"38.443539","Object Flight Path":"Straight-line path","Disposition":"IFO","trends":["There have been 6 other sightings in Cañon City","There were no other sightings in Cañon City on or around December 14th 2010"]}