{"Sighting Duration":"00:05:00","divs":["Sighting DetailsIt started out as a joke, I was a technical engineer at KTVI TV in St Louis andgot off after the 10 oclock news. I was also a photographer and UFO sceptic. Iknow it sounds stupid but I jokingly rationalize that if you were ever going tosee a UFO that you would need to signal them. My wife was already in Peidmont ather parents house and I was suposed to go down the next morning but I decided topack up some my OM4T 2 with a 50mm f1.2 and several other lenses and my tripodwith quick release. I had Kodachrome 25 loaded as these cameras can makeaccurate exposures down to 3 minutes. When I hit highway 67 going south Istarted firing my strobe through the front windshield upward every time therewere cars in site. I chuckeled at what I was doing but fired it all the way downto Peidmont and then headed into Clark National Forest, a huge area totallyremote where I used to deer hunt with my father-in-law. Still firing the strobeever few minutes and just enjoying the drive never expecting to see anything atall. Suddenly on my left there was a large shaft of light, no craft, about 150yards away. It was about 100 feet wide and circular in mature, it extendedupward about 300 feet and it just sat there. It was holographic in nature as ithad shape and was in the red, orange, and tellow spectrums and kinda looked likethe beam me up Scotty effect on StarTrek but much much larger. I came to anabrupt spot and said out loud holy f___ this is realy it. I was not scared atall and just moved very fast to set up my camera and get a shot. It was justsitting there, but at the instant that I clicked the shutter it rapidilydisipated, Had I had ISO 1000 I would of had it but no, I had to shoot finegrain film so there would be no questions. I know it sound crazy but after thatexperience I built a high speed stoboscopic sequencer which I hoped would beeven cooler. Heres a link to a sample shot commercial photographyhttpwww.kapturegroup.comph_ka_htmlsbrush.htmlbut I really built it to go back and I did but only once and saw nothing.Thats it..PS I know what northern lights look like and for the longest time Ithought it might be sprites until I found out they happen at high altitude anddo not remain stationary. I know what I saw but I dont know what it was but itwas spectacular. I do not believe in all the other sightings reported becaus"],"Date Submitted":"01/31/1987 03:00 UTC","Weather Factors":"Unknown","Latitude":"37.154495","Date of the Event":"01/31/1987 03:00 UTC","trends":["There have been 4 other sightings in Piedmont","There were no other sightings in Piedmont on or around January 31st 1987"],"files":["/var/www/straped/mufon/html2text/2709.html.txt","/var/www/straped/mufon/org/2709.html"],"Tags":"City","Viewing Distance":"101-500 Feet","Disposition":"Insufficient Data","Log Number":"","Country":"United States","Longitude":"-90.695675","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.154495,+-90.695675(2709)&iwloc=A&hl=en\"> mufon case (2709) map </A>","Summary":"A holographic orange and red beam 150 yards away","City":"Piedmont","Object Flight Path":"Stationary","Object Features":"Other","Region":"Missouri","Source":"MUFON","Case Number":"2709"}