{"trends":["There have been 18 other sightings in Mankato","There were no other sightings in Mankato on or around December 25th 2010"],"Longitude":"-93.98969","Log Number":"US-12252010-0010","Sighting Duration":"Undisclosed","Summary":"Line of orange/red spheres moving slowly and silently across the sky","Weather Factors":"Unknown","Latitude":"44.167838","Disposition":"IFO","Case Number":"27108","map":"<A HREF = \"http://maps.google.com/maps?q=44.167838,+-93.98969(27108)&iwloc=A&hl=en\"> mufon case (27108) map </A>","City":"Mankato","Date of the Event":"12/25/2010 05:30 UTC","Date Submitted":"12/25/2010 11:03 UTC","Object Shape":"Sphere, Star-like","Object Flight Path":"Undisclosed","Region":"Minnesota","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27108.html.txt","/var/www/straped/mufon/org/27108.html"],"Country":"United States","Object Features":"Undisclosed","Source":"MUFON","Tags":"City","divs":["Sighting DetailsAbout 5:30 PM I looked out my window and saw orange lights flying below the clouds moving north to south. They caught my eye as I was watching TV. I first thought they were the reflection of our Christmas lights in the window. When I got up I could tell that they were flying along and my first thought was that they were helicopters flying in formation. I walked outside to get a better look and was struck by the fact that there was no noise for how low they seemed to be flying. Also the lights were not blinking as aircraft lights do. As I watched the lights at the head of the formation seemed to disappear as they flew south. We had low cloud cover tonight so the objects had to be flying low for me to see them. I ran back into the house to grab a camera to shoot some video but all I could find was my cell phone. I did shoot a short video of the lights but the camera on my phone didn't capture much. There were about 7 lights in the group flying in a loose formation and I could see two or three of them maneuvering around each other. The main group moved south of my location and disappeared. There was one straggler that was red in color that moved along behind the main group. It eventually moved past and disappeared as well. I couldn't tell if I lost sight of the objects because they rose through the cloud cover of if their lights were directional and they were shining away from me after they moved by. My parents were driving north of town and they saw the lights as well. They called me to see if I could see them from town and confirmed that there was no sound from the objects and that they were flying beneath the low clouds. I came inside and googled recent UFO sightings and came across the footage of the lights seen yesterday in North Carolina. The video they captured shows exactly the same lights we saw down to the color and flying style of the objects"]}