{"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/27106.html.txt","/var/www/straped/mufon/org/27106.html"],"Weather Factors":"Unknown","Summary":"Bright clear/white light moving fast","Log Number":"US-12252010-0008","Case Number":"27106","Tags":"City","Longitude":"-105.505838","City":"Idaho Springs","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.744228,+-105.505838(27106)&iwloc=A&hl=en\"> mufon case (27106) map </A>","Object Shape":"Star-like","Object Features":"None","Region":"Colorado","Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsStepped outside to make a phone call and I saw a bright star moving northward. It was as bright as the north star. It was just west of Mt. Evans (high in the sky) moving north. It made no sounds. Was moving very fast. When it was over my locations it started to veer to the East in the direction of Denver. It dimmed down and changed to a reddish color. When it looked as though it was over Lookout Mountain it disappeared, just as it would be going over the Denver Metro Area. It's orbit looked lower than any satellite I've seen in the sky. The fact that it was absolutely quite, I knew it was not an airplane. Within minutes of that object disappearing I spotted a reddish colored star like object moving southwest over the Rocky Mountain Divide. I watched it until it vanished over the horizon. I spotted it when it was slightly to the North-West of where I was standing. It was moving more west than it was south. I am probably about 3 miles north of I-70 just to give you a bearing. I am in the flight paths of a lot of airplanes and I can say that these 2 objects were not airplanes! I have seen satellites in the sky before and these were not satellites either. One thing that struck me is how much lower the first object was, I am guessing it was anywhere between 35,000-60,000 miles up. It was about 2.5 times larger than what Jupiter appears in the sky. The red object was higher in the sky than the first one."],"trends":["There have been 2 other sightings in Idaho Springs","There were no other sightings in Idaho Springs on or around December 25th 2010"],"Date of the Event":"12/25/2010 12:00 UTC","Disposition":"IFO","Latitude":"39.744228","Date Submitted":"12/25/2010 08:32 UTC"}