{"divs":["Sighting DetailsI WAS SITTING ON MY PORCH WHEN I NOTICED 3 EGG SHAPED TO ROUNDISH EXTREMELY ORANGEY AND VERY SLOW MOVING. THEY WERE SO BRIGHT AND THEY LOOKED TO BE IN FORMATION AND MAKING AND UPWARD INCLINE. THEY SCARED ME BECAUSE I THOUGHT THEY WERE EXTREMELT CLOSE.. THE FIRST OBJECT APPEARED AND WITH SECOND TWO OTHERS WERE RIGHT BEHIND..I RAN AND GOT MY DIGITAL CAMERA WHICH WAS RIGHT BY ME AS I WAS JUST LOOKING AT OUR CHRISTMAS EVE SHOTS WITH OUR GRANDDAUGHTER AND FAMILY..I QUICK LINED UP A SHOT NOW FROM MY OUTSIDE PORCH..AND ALSO NOTICED THAT ONE OBJECT HAD DISAPPEARED..BUT THE OTHER TWO KEPT GOING AND THEN THEY DISAPPAEARED AS THEY WENT THROUGH THE TREES OVER OUR FRIENDS HOMES.. THERE ARE NO LEAVES ON THE TREE OF COURSE..SO THERE THEY WERE AND BOOM ...GONE..MY FIANCEE FINALLY WAS OUT OF THE HOUSE NEXT TO ME BUT WAS A FEW SECONDS LATE..I DID GET A CLEAR PICTURE AND WE LOOKED AT IT. MY FIANCEE AND I WERE ABLE TO PRINT THE SHOT IN CLOSER AND HE WAS MORE PUZZLED THAN ME. AND, YES, EVERYONE I TOLD SAID I PROBABLY SAW SANTA..HA..HA..BUT IT WAS AN AMZING SIGHT WHATEVER THESE OBJECTS WERE. IT ONLY LASTED 2-3 MINUTES BUT I WAS JUST CURIOUS IF ANYONE ELSE HAD SEEN THEM IN NJ..OR EVEN MY TOWN..SINCERELY AND VERY CURIOUS.THANKS FOR HEARING ME OUT"],"Date Submitted":"12/25/2010 01:08 UTC","Viewing Distance":"Unknown","Region":"New Jersey","Summary":"saw 3 very bright orangey objects seemto be following eachother rather slowly from west sky to east in perfect unisom and extremely close","City":"South Amboy","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Egg, Fireball, Oval","files":["/var/www/straped/mufon/html2text/27101.html.txt","/var/www/straped/mufon/org/27101.html"],"Disposition":"Unknown","Object Features":"Unknown","Case Number":"27101","map":"<A HREF = \"http://maps.google.com/maps?q=40.477884,+-74.290702(27101)&iwloc=A&hl=en\"> mufon case (27101) map </A>","Tags":"City","trends":["There have been no other sightings in South Amboy","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Latitude":"40.477884","Object Flight Path":"Straight-line path","Longitude":"-74.290702","Log Number":"US-12252010-0003","Date of the Event":"12/25/2010 02:22 UTC","Country":"United States"}