{"Weather Factors":"Unknown","Region":"Pennsylvania","Object Flight Path":"Other","Log Number":"US-12252010-0006","Summary":"2 lights circled around each other so fast they made one eliptical circle, then one stopped and the other flew out of sight in under 10","Disposition":"Unknown","trends":["There have been 3 other sightings in Bryn Athyn","There were no other sightings in Bryn Athyn on or around July 3rd 2010"],"Tags":"City","Sighting Duration":"00:00:30","Source":"MUFON","Longitude":"-75.069966","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.14169,+-75.069966(27104)&iwloc=A&hl=en\"> mufon case (27104) map </A>","City":"Bryn Athyn","Latitude":"40.14169","Date of the Event":"07/03/2010 09:30 UTC","files":["/var/www/straped/mufon/html2text/27104.html.txt","/var/www/straped/mufon/org/27104.html"],"Date Submitted":"12/25/2010 03:13 UTC","Case Number":"27104","divs":["Sighting DetailsThe top it asked if it was : AN, FB, ETC. IT WAS A COMBO OF BOTH AN1 AND FB1 It was July 3rd and our town decided to celebrate July 4th a day early this year. So later on obviously, the fireworks started to go off. At this time I was inside my house and I heard them going off, so I decided to see if I could see them from out my front yard. Surprisly so, I saw over 20 neighbors in my front yard.. For a quick moment I thought, \"man I should've charged a fee,\" laughing to myself. So I went to mingle with my neighbors.... were watching the show, and I nudged my one neighbor and said, \" wouldn't it be cool to see what tonight would look like from an astronaut's point of view?\" He said, \"yeah it would be kinda cool.\" Right after I said that I immediately looked straight up, and wouldn't you know, I saw this light making a wavy circle, kinda what a current of electricity would look like, but it was connected. I quickly said to everybody, \"look straight up!!!, quick!!\" Apparently a few did because I was heard a few awes..., seconds later, the circle stopped and I noticed it was two lights making this circle... one stopped immediately and the other went in one motion Northeast, by this time a woman said, \" is that a satellite?!\", giggling to myself I said, \" No, satellites don't go that fast honey.....,\" I looked to see if the other one was still there, but sadly it disappeared, I had no idea which way it went, for the simple fact my eyes were tracking the other fast moving light. It took about 8 sec. or so for the first light to get out of our line of sight... and...By this point the fireworks were secondary entertainment... I said we just saw Two UFOs guys.!! ; and of course, people just started not to believe what they just saw... They were saying ,no, it was something else, I said Ok what was it then.....? Not one person could give me a straight answer... except one child, he said, \"that was the coolest thing he has ever seen!!!\" Right after that his mother took his hand and proceeded to go home... Please if anyone reported something similar around that time.... PLEASE HAVE THEM EMAIL ME ... PLEASE.. it would be helpful to me... On another note, do you think it was a coincidence, that I was currently researching Billy Meier's information for the first time, exactly around the time I saw that AMAZING DISPLAY OF.,,,, W.S.F.M....... (Weird. Science.Friggin .Magic) since this event happened I've been doing a lot more research..... Makes you think. :) If someone could get it contact with me.about this, it would be greatly appreciated... Thanks for your time.. P.S. sorry it took this long to report this... I just saw the MUFON site, and the Report option was there, so, I figured I should tell my story.... Keeping my eyes to the skys now... : v ) Thanks again for existing MUFON.. William Colvard"],"Object Features":"Other, Unknown","Country":"United States"}