{"divs":["sighting detailson the aforementioned time and date, my daugther and myself where traveling home after an evening with friends. we traveled east bound from our friends house to our home, approximately 7 miles away on a north east direction. it had been raining and the west side of town was very flood. visibility was about a half of a mile, because of the rain and dark. i do not drink spirits. \"what could that be?\" was my first statement, to my daugther. her response was\"it's a helicopter.\" as we watched the 3 firey spheres\\super white lights, very close together, connected to one object. it didn't spin out of control. but slowly gained speed towards the ground. i realized it had to be farther away than i had first thought. there was no sound. as it approached the ground it started to, come appart or blow up\\spark off, but it looked like fire works. the end result of fireworks before they go out. the object just went straight into the ground. i turned my radio to news, and realized it was far away from us as we where driving in the direction of it as fast as i safely could. no sirens, no sound, and i could see from about,( since i don't know where it went down)away 8 to 20 miles in a rain storm, at night. nothing in the paper. the object must have been huge. this wouldn't be the first time. my daugther and i have seen numerous things unexplained out here near edwards afb."],"Date Submitted":"12/26/2010 04:00 UTC","Object Shape":"Fireball, Flash, Sphere, Star-like, Other, Unknown","Log Number":"US-12262010-0004","trends":["There have been 2 other sightings in Edwards AFB","There were no other sightings in Edwards AFB on or around December 18th 2010"],"Source":"MUFON","Longitude":"-117.878028","City":"Edwards AFB","map":"<A HREF = \"http://maps.google.com/maps?q=34.894103,+-117.878028(27112)&iwloc=A&hl=en\"> mufon case (27112) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Region":"California","Object Features":"Unknown","Date of the Event":"12/18/2010 09:17 UTC","Sighting Duration":"00:14:10","Case Number":"27112","Latitude":"34.894103","files":["/var/www/straped/mufon/html2text/27112.html.txt","/var/www/straped/mufon/org/27112.html"],"Object Flight Path":"Straight-line path","Tags":"City","Disposition":"IFO","Weather Factors":"Rain, Heavy, Medium, Light","Country":"United States","Summary":"saw a 3 sphere something blow up and go into/crash?, into the ground, near edwards AFB,Ca."}