{"Latitude":"30.183971","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"12/19/2010 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.183971,+-85.800608(27118)&iwloc=A&hl=en\"> mufon case (27118) map </A>","files":["/var/www/straped/mufon/html2text/27118.html.txt","/var/www/straped/mufon/org/27118.html"],"Object Flight Path":"Undisclosed","City":"Panama City Beach","trends":["There have been 12 other sightings in Panama City Beach","There were no other sightings in Panama City Beach on or around December 19th 2010"],"Case Number":"27118","Date Submitted":"12/26/2010 01:53 UTC","Region":"Florida","divs":["sighting detailsme and my cousin were riding our skateboards along the sidwalk parallel to middle beach rd. we were heading directly towards the beach and the sun had not yet set. suddenly, a very bright light appeared in the blue sky approximately 30 degrees above the sun and approximately 45 degrees above the horizon. i turned to my cousin to ask him if he was seeing the same thing that i was and he said that he was. as i turned back to look at the object it reduced in brightness and became just a small whitish line which then disappeared. this all transpired in a matter of seconds and the object\\light was stationary for the duration of the sighting. we were both in shock and stopped skateboarding to reflect on our thoughts of what we had just witnessed. as i was saying out loud that we had just seen a ufo, i was looking at the sidewalk and my cousin shouted that he saw it again but this time it was more like a pinpoint of light with a ring or halo like light around it, when i tried to look again it had already vanished. i can best describe it as if someone had turned a flashlight on and off in the middle of the sky. it was as if the object was metallic\\mirrorlike and had reflected the sun's light directly into my eyes. i felt that it had come from another dimension into ours for seconds, then returned."],"Object Shape":"Flash, Star-like, Other, Unknown","Disposition":"Insufficient Data","Summary":"Star like flash of bright light","Log Number":"US-12262010-0010","Viewing Distance":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Longitude":"-85.800608","Weather Factors":"Unknown","Tags":"City"}