{"Log Number":"US-12262010-0002","map":"<A HREF = \"http://maps.google.com/maps?q=32.454626,+-99.728784(27110)&iwloc=A&hl=en\"> mufon case (27110) map </A>","Source":"MUFON","Latitude":"32.454626","Country":"United States","Viewing Distance":"Unknown","divs":["sighting detailsit was a nice clear night, just a hair after 8pm. i was outside sitting partially in and out of my vehicle checking in to the local amateur radio net enjoying the weather. waiting for a return on the call list, i was smoking a cigarette and looking around. i looked to the sky to notice an abundance of stars. i saw a few planes flying at 10,000 feet or so and noticed a light approaching from the north\\northwest as it was kind of dull. i make my comments on the net and glance over and still see the lights approaching and heading to a south\\southeast direction, i see a dull red light on it close to center but it is not blinking as they do on airplanes and jets. another thing i noticed is that there was no sound from the aircraft, not even from the friction of moving through the air. i live about a mile east of dyess air base and this aircraft had to have flown over the north side of it easy. i absolutely heard no aircraft from dyess, taking off or landing. the only thing i could hear were cars passing by on texas ave. getting more curious i pulled out my spotting scope and stood outside my vehicle to get a better look. the beacon was not pulsing at all and the 3 lights were in the shape of a triangle, wider than it was long. the aircraft had no tail section, and i saw that there was no landing gear. at the central portion of the bottom of the aircraft seemed to be a dull bronze or brown color. the 3 lights pointed more downward than forward. at this time the vehicle is more south\\east than east. i would have to say that by the time i lost sight of it, it had to be maybe 500 to 1000 +\\- feet off the ground and the speed was maybe 100mph +\\-. all this took place within about 10-15 minutes. i'm standing there thinking, what the hell did i just see and why didn't i remember that my camera was just a few feet away hanging on my gearshift. maybe 10 minutes after i lost sight of it, i heard the 1 or 2 jets starting up at dyess but did not notice if any had taken off. i did not report it to the news, police or on the radio, wanting to avoid ridicule and waiting to see if someone else would, but know one did. i have questioned myself for 2 weeks did i see what i saw, did i miss something, did i forget something or was it even a ufo. mainly frustrated because i did not get a picture of it. i guess i was awestruck. i am a military vet, and a former police officer. when i was in law enforcement, i worked security at several air shows in corpus christi and even worked at nas kingsville so i know what military and civilian aircraft look like and sound like and this was not military or civilian and definetly not the stealth fighter or bomber, i don't know what it was, i just wish i could see it again..."],"Case Number":"27110","Date of the Event":"12/14/2010 08:05 UTC","trends":["There have been 63 other sightings in Abilene","There was one other sighting in Abilene on or around December 14th 2010"],"Region":"Texas","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/27110.html.txt","/var/www/straped/mufon/org/27110.html"],"Object Shape":"Triangle, Other","Tags":"City","City":"Abilene","Object Features":"None","Longitude":"-99.728784","Summary":"I believe I may have seen a UFO flying over south Abilene","Object Flight Path":"Path with directional change","Disposition":"Unknown","Weather Factors":"Unknown","Date Submitted":"12/26/2010 01:03 UTC"}