{"Sighting Duration":"Undisclosed","Summary":"very bright white light seen in the sky over Lowell Ma area 12/24/10 about 2AM","Log Number":"US-12262010-0007","Region":"Massachusetts","Object Features":"Undisclosed","City":"Dracut","Source":"MUFON","Weather Factors":"None","Object Shape":"Triangle","Longitude":"-71.292325","Object Flight Path":"Undisclosed","Date of the Event":"12/24/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.676149,+-71.292325(27115)&iwloc=A&hl=en\"> mufon case (27115) map </A>","Case Number":"27115","Latitude":"42.676149","Tags":"City","divs":["Sighting DetailsI was visiting a friend in Dracut Ma. and we were looking out the window at the night sky. We noticed an extremely bright white light that was far too large to be a star and appeared to be in a triangle or diamond shape with rays of light projecting out all around it. It had not been there only an hour or two before when we were looking at the sky and once it appeared it stayed there for hours. It never moved, the brightness and color (white) never changed and there was absolutely nothing around it, the sky was very clear and you could easily see that it was not suspended from nor supported by another object. It was very disconcerting, neither my friend nor I had ever seen anything like this before and we couldnt take our eyes off it. We went outside and looked at it from there and it remained exactly the same as it appeared from the inside. We went back inside and continued to watch it as we talked over several hours time. It was still there when we went to bed, which I was actually afraid to do because the light bothered me so much. The following night it appeared to be gone. I have searched the web in hopes of finding someone else who saw it and have found nothing and yet it was so stunning and unusual that I cant believe we were the only ones to notice it! I would like very much to know if you have any information about this particular sighting which was at about 2 or 3 am on December 24th 2010 over Dracut Ma.or possibly Lowell Ma area. It was hard to tell exactly what area it was over but this is the closest guess I can come to. Thank you"],"Viewing Distance":"Unknown","Date Submitted":"12/26/2010 10:38 UTC","files":["/var/www/straped/mufon/html2text/27115.html.txt","/var/www/straped/mufon/org/27115.html"],"trends":["There have been 2 other sightings in Dracut","There were no other sightings in Dracut on or around December 24th 2010"],"Country":"United States","Disposition":"IFO"}