{"files":["/var/www/straped/mufon/html2text/27125.html.txt","/var/www/straped/mufon/more/27125_submitter_file1__100_1675.JPG","/var/www/straped/mufon/more/27125_submitter_file2__100_1675zoomed.png","/var/www/straped/mufon/org/27125.html"],"Disposition":"Unknown","divs":["Sighting DetailsDriving down I-95 southbound my girlfriend spotted a group of cars on the side of the road and saw them looking and pointing towards the western sky. She promptly looked in the direction they were pointing and saw a disc shaped craft glowing orange hovering in the southwestern sky. She then called me at home and took two photographs of the object with her 6.2 mega pixel Kodak C613 digital camera. One came out blurry but the other was much clearer and you can make out the shape of a craft moving away from her. Not sure what it was but obviously it had attracted enough attention to get people to stop on the side of a busy highway to view it. While watching it she said she saw a smaller probe like object, glowing as well, come out and away from the main craft. I have attatched photographs, the original and one I blew up in a photo editing software."],"Case Number":"27125","Object Shape":"Disc, Fireball","Region":"Florida","Country":"United States","Date of the Event":"12/26/2010 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"26.78395","Object Flight Path":"Hovering then path","trends":["There have been 2 other sightings in Riviera Beach","There were no other sightings in Riviera Beach on or around December 26th 2010","This sighting has never been favorited.",""],"Source":"MUFON","Log Number":"US-12262010-0016","Date Submitted":"12/26/2010 11:17 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=26.78395,+-80.052097(27125)&iwloc=A&hl=en\"> mufon case (27125) map </A>","Longitude":"-80.052097","City":"Riviera Beach","Weather Factors":"Unknown","Tags":"City","Object Features":"Unknown","Summary":"Orange glowing disc shaped craft hovering then moving away"}