{"Log Number":"US-12262010-0014","Source":"MUFON","Longitude":"-84.146881","Date of the Event":"12/26/2010 09:32 UTC","Tags":"City","Object Features":"None","Object Shape":"Circle, Oval, Star-like","Weather Factors":"Windy","divs":["Sighting DetailsWhen coming home from my parents home that night, me and my girlfriend noticed a star in the SE sky while heading south on highway 82. It appeared to be white to amber in color in the center, with the edges changing or shifting from blue, green, red to orange. Many stars seem to change color in just a short spectrums that seem related, but this shifted all colors. We pulled down doublegate dr. and pulled into our driveway. We used google starmaps to check the entity. The object was near Procyon. Upon multiple checkings and viewings the object appeared to be moving. Left to right, forward and backwards. And then it started doing very tight, circles. There is a small airport nearby but no plane could turn the radius in a quick manner. There where several planes that passed in the objects direction in the sky, and all were much larger and distinctive wing lights. The weather was cold, clear and breezy. The view was clear with no obstructions. The objects direction was SE of us, putting it out in the direction of the airport and marine base. After seeing the object and realizing that this is the second time Ive seen objects in the night sky i was a bit electrified with my nerves flashing down my back."],"Date Submitted":"12/26/2010 10:10 UTC","trends":["There have been 7 other sightings in Albany","There were no other sightings in Albany on or around December 26th 2010"],"Case Number":"27123","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Disposition":"IFO","City":"Albany","Summary":"UFO Hovering over city in SE sky.","files":["/var/www/straped/mufon/html2text/27123.html.txt","/var/www/straped/mufon/org/27123.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Latitude":"31.581807","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=31.581807,+-84.146881(27123)&iwloc=A&hl=en\"> mufon case (27123) map </A>"}