{"Tags":"City","Region":"Florida","Sighting Duration":"Undisclosed","divs":["sighting detailsi got a nikon 3100 camera and af-s dx zoom-nikkor 55-200mm lens (which has a 1.5x magnification zoom of the naked eye) for christmas. i am currently staying at my grandmother's condo in bradenton,which is on the 5th floor of the building and faces mostly east and slightly to the north. i was playing with my camera, zooming in on an airplane through the viewfinder, flying far in the right\\south of where i was standing, when a fast moving orange sphere entered the frame. it was far in front of the plane (closer to me than the plane) and traveled quickly from south to north. my camera battery was charging so after taking the camera away from my face to view it with my eyes in disbelief, i ran to get my battery and was able to snap 3 pictures before it disappeared into the hazy sky above. all i could see was a glowing orange sphere- it did not have any other lights, it did not have blinking lights. at first it looked like a fire ball. - unfortunately, i captured the sphere without a reference point to show its relation to the ground\\buildings because i zoomed in as much as possible. the interesting part is the power of the zoom and size of the picture allows me to later upload and zoom in very close to the object. if i took a picture of airplane lights, i would be able to zoom in and make out the entire plane. with this, there was only a ball of orange light."],"Object Flight Path":"Straight-line path","Date of the Event":"12/25/2010 09:15 UTC","Disposition":"Unknown","Object Shape":"Circle, Fireball, Sphere","Longitude":"-82.572189","Country":"United States","Latitude":"27.505028","Summary":"bright orange sphere shaped light- captured 3 photos","Log Number":"US-12262010-0011","Date Submitted":"12/26/2010 02:37 UTC","Source":"MUFON","Object Features":"None","Viewing Distance":"21-100 Feet","Case Number":"27120","City":"Bradenton","trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around December 25th 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=27.505028,+-82.572189(27120)&iwloc=A&hl=en\"> mufon case (27120) map </A>","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/27120.html.txt","/var/www/straped/mufon/more/27120_submitter_file1__DSC_0847.JPG","/var/www/straped/mufon/more/27120_submitter_file2__DSC_0848.JPG","/var/www/straped/mufon/more/27120_submitter_file3__DSC_0849.JPG","/var/www/straped/mufon/org/27120.html"]}