{"Date of the Event":"12/27/2010 09:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.592132,+-121.294518(27131)&iwloc=A&hl=en\"> mufon case (27131) map </A>","Log Number":"US-12272010-0005","Case Number":"27131","Region":"California","Longitude":"-121.294518","Viewing Distance":"Over One Mile","Date Submitted":"12/27/2010 12:58 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/27131.html.txt","/var/www/straped/mufon/org/27131.html"],"Object Features":"Other","Latitude":"38.592132","trends":["There have been 18 other sightings in Rancho Cordova","There were no other sightings in Rancho Cordova on or around December 27th 2010"],"Summary":"White V-Shaped UFO Seen Over Rancho Cordova, CA","City":"Rancho Cordova","divs":["sighting detailsi work in rancho cordova near the old mather air force base (between zinfandel and sunrise blvd). i was out on my morning break, taking a walk in the back parking lot, and as i always do, i looked up. it was then that i saw a white v-shaped object in the sky overhead. it was very high up, and thus only half the size of my pinky nail at arms distance. it had three lights on each side, because at one point it changed position, and all i could see was a strip of lights. the object was between rancho cordova and eldorado hills, and was moving very slowly. i watched it for a good ten minutes trying desperately to get it in film with my sony camcorder. however, because it was white against a light blue sky, the camcorder was unable to pick it up. (when viewing my recording later i noticed that the recording blanked out several times). it was still visible with the naked eye when i went back into the building at 9:20 am. note: there is a video on youtube that was filmed in the spring of 2010. the owner captured the exact same i object i saw this morning, and interestingly enough, it, too, was filmed near the sierra foothills. *(link moved to additional evidence section--cms\\sg). also, this is the third sighting i've had in the last week. i reported one other sighting of a cube shaped object last week. something must be going on."],"Weather Factors":"None","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Disposition":"Unknown","Country":"United States"}