{"Sighting Duration":"Undisclosed","Object Shape":"Chevron, Triangle","trends":["There have been 7 other sightings in Merrillville","There were no other sightings in Merrillville on or around December 27th 2010","This sighting has never been favorited.",""],"Summary":"triangular shaped UFO with 2 red lights on side and one white orb in middle of craft sighted over Cleveland Ave","Tags":"City","Object Features":"Other","Date of the Event":"12/27/2010 06:25 UTC","Country":"United States","Source":"MUFON","Disposition":"Unknown","Weather Factors":"None","Log Number":"US-12272010-0010","Latitude":"41.486384","Object Flight Path":"Straight-line path","Case Number":"27137","Viewing Distance":"501 Feet - 1 Mile","City":"Merrillville","Longitude":"-87.327214","divs":["Sighting DetailsI was driving southbound on Cleveland Ave, when the car in front of me put his breaks on and started to swerve like he wasn't paying attention. Then something caught the corner of my eye and I looked up to see a large flying craft. I pulled over as did the car in front of me and the car behind me. All of us got out to look at this thing. It was triangular in shape with 2 red lights on one side and a large glowing white orb in the centre. It was approximately 2000ft in the air, completely silent, flying in a west to east direction. The colour of the craft was a white-greyish colour. It looked like there was something on the back of it, or like the back was a square, but it was really hard to tell. There were also 2 jets flying over the craft, turning around and coming back. I tried to film it with my camera phone but I'm unable to make anything out. I lost sight of the object over the treeline."],"Region":"Indiana","files":["/var/www/straped/mufon/html2text/27137.html.txt","/var/www/straped/mufon/more/27137_submitter_file1__UFOsketch.jpg","/var/www/straped/mufon/org/27137.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.486384,+-87.327214(27137)&iwloc=A&hl=en\"> mufon case (27137) map </A>","Date Submitted":"12/27/2010 05:36 UTC"}