{"trends":["There have been 9 other sightings in Gardner","There were no other sightings in Gardner on or around December 26th 2010"],"Summary":"Three lights","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Date of the Event":"12/26/2010 08:40 UTC","City":"Gardner","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.810592,+-94.954389(27135)&iwloc=A&hl=en\"> mufon case (27135) map </A>","Weather Factors":"Unknown","Log Number":"US-12272010-0008","Region":"Kansas","Longitude":"-94.954389","Latitude":"38.810592","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/27135.html.txt","/var/www/straped/mufon/org/27135.html"],"Tags":"City","Date Submitted":"12/27/2010 04:44 UTC","divs":["Sighting DetailsMy husband was driving, and I was riding in the front passenger seat. We were returning to our home in Overland Park from a Christmas visit with my parents in Wichita. We were taking I-35, traveling northeast, and the sighting occurred near Gardener, KS. The drive had gone smoothly so far; it was a cold, clear night, and we were relaxed and chatting intermittently. I was staring out the front windshield when my husband pointed to the passenger side window and said, \"There's a UFO.\" Because his tone was so casual, I looked out expecting to see a billboard or something else mundane. I saw three bright points of blue-white light, moving in a triangle formation. The lights were flashing on and off rhythmically. The flashes were fast, but not strobe-light fast. The lights flashed perhaps 1-2 times per second. The flashes were very regular, like a clock ticking. I could not make out what the lights were attached to, so they could have been from one object or three objects moving in tight formation. My husband said something like, \"It can't be a plane because it's just hanging there.\" However, as I watched the object, it appeared to be moving away from us and also weaving from side to side. It seemed to be hovering like a helicopter rather than flying like a plane. Our car was out of alignment and fairly noisy to drive, so I could not hear whether any sound came from the object. Because the object was traveling the opposite direction we were driving, I did not get to watch it very long. Our car's rear windows were fogged up, so I was unable to watch the object once it was no longer in view from the front passenger side window. After the sighting, I regretted not having a camera handy and not being able to watch the object for a longer period of time."],"Case Number":"27135","Object Features":"Unknown","Object Flight Path":"Hovering then path,Path with directional change"}