{"Summary":"BRIGHT AMBER COLOR MOVING VERY SLOWY","Date Submitted":"12/28/2010 09:53 UTC","trends":["There have been 4 other sightings in Fort Dodge","There was one other sighting in Fort Dodge on or around November 26th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.500019,+-94.162096(27148)&iwloc=A&hl=en\"> mufon case (27148) map </A>","files":["/var/www/straped/mufon/html2text/27148.html.txt","/var/www/straped/mufon/org/27148.html"],"Log Number":"US-12282010-0009","Weather Factors":"Unknown","Case Number":"27148","Viewing Distance":"Unknown","Disposition":"Unknown","Longitude":"-94.162096","Country":"United States","Object Features":"Undisclosed","Tags":"City","Date of the Event":"11/26/2009 06:00 UTC","Object Shape":"Cylinder","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI WAS OUTSIDE MY DAUGHTERS HOUSE HAVING A CIGARETTE AFTER THANKSGIVING DINNER. I HAPPENED TO LOOK UP TO THE NORTHWEST SKY AND SAW THIS HUGE OBJECT MOVING VERY SLOWY FROM THE NORTHWEST TO THE SOUTHEAST. IT CAUGHT MY ATTENTION AS IT WAS GLOWING VERY BRIGHTLY. I WATCHED THE OBJECT AS IT MOVED TO THE SOUTHEAST OF ME. IT WAS APPROX. 10,000 FEET HIGH. ONCE IT GOT ABOUT 3 TO 4 MILES SE OF WHERE I WAS STANDING ALL OF A SUDDEN THERE WAS A HUGE CIRCULAR FLASH OF WHITE LIGHT. IT HAD TO HAVE BEEN AT LEAST A MILE WIDE. AN INSTANT LATER THERE WAS A SMALL WHITE OBJECT THAT SHOT OUT OF THE TOP AT ABOUT A 15 DEGREE ANGLE. IT DISAPERED IN LESS THAN 2 SECONDS. AFTER THAT EVENT THE WHITE LIGHT DISAPERED AND THE LARGE AMBER COLORED OBJECT TOOK OFF AND ALL YOU SAW WAS A AMBER STREAK OF LIGHT,IT COMPLETELY BLEW MY MIND. IF I WOULD OF HAD VIEDO OF THIS IT WOULD PROVE ONCE AND FOR ALL THAT WE ARE NOT ALONE. I TOLD MY FAMILY WHAT I SAW BUT NO ONE BELEVIED ME. THIS IS MY SECOND REPORT ON THIS .I REPORTED IT TO MUFON LAST YEAR AND WAS CONTACTED BY A MUFON REP. I NEVER HEARD ANY MORE ABOUT IT. I DONT THINK ANYONE BELEIVES ME. I WOULD BE WILLING TO TAKE A LIE DECTECTOR TEST IF THAT WOULD HELP."],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Fort Dodge","Region":"Iowa","Latitude":"42.500019"}