{"Region":"Alberta","Country":"Canada","Longitude":"-113.483892","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27141.html.txt","/var/www/straped/mufon/org/27141.html"],"Object Shape":"Star-like","Sighting Duration":"Undisclosed","Latitude":"53.545564","Tags":"City","City":"Edmonton","Log Number":"CA-12282010-0002","Source":"MUFON","Weather Factors":"Unknown","Case Number":"27141","Object Flight Path":"Straight-line path","Summary":"Bright Bluish White Light, faded to dim orange then moved in a N. NE. Direction out of FOV","Date of the Event":"12/27/2010 06:42 UTC","Object Features":"Unknown","divs":["sighting detailsplease forgive any grammatical greviences and spelling errors. at 1842 hrs, on the night of december 27th, 2010, i was waiting at a bus stop for my ride to work. the night was clear with little to no cloud cover. i was distracted and looking around waiting for the bus to arrive, thinking \"a watched pot never boils,\" when something from the corner of my eye caught my attention. what appeared to be a bright flash drew my attention to the sky. the object was to my w-nw at approximately 10 o'clock from my perspective, and i was facing north on the street. as to what altitude it was at i can not guess, as at night, anything with a light on it could be 100 feet up or out into the atmosphere for all i know. all i do know was that it was in the direction of a flight path for the international airport, and appeared to be at the same, or at similar altitude that the aircraft fly at. it was just a bright blue-ish white object that was flying at a leisurely pace in a n-ne direction. at first i thought it to be an aircraft, namely the night patrol helicopter that is often overhead my neighborhood. however, this was not like the helicopter. now please bear with me but this is the part that confused me. the light was too bright and to, uh, \"pure\" to be the helicopter. with the patrol helicopter's lights, they appear to be, well, white, with no idications of color, and often i can see the beam, or at least the \"starburst pattern\" when the light is directed in my direction. the rotating beacons on the copter can be seen as well, so when the light is not on, you can see the tail and the red\\green indicator lights. the light on what i saw was very bright and just on the blue side of white. it didn't appear to be a directed beam either, but like a light source viewed from a distance. the brightness of it is what caught my attention. it was bright enough to divert my attention away from the passing cars and street lights. as i watched the object, i noted that it was heading in an apparent n-ne direction, and at a speed that would put it out of my field of view behind a building across the street in several seconds. it was shortly after i noticed it that the light began to fade. this is why it stood out to me. the light just got dimmer, until it looked like a small dim orange light, as opposed to the bright blue. not just like a light shutting off, but visibly got dimmer. no indicator lights, no rotating tail beacons. the dim orange light was a little dimmer than some of the stars that were observable at that time. the dimmer light did not change course either. just continued on it's n-ne course. it was then that the object was obsecured by the building, and my bus was visible at the end of the street. when i got off the bus later, i continued to look for the light to the north, but it had been several minutes on the bus and i did not expect to see anything. the whole incident couldn't have been more than 10-20 seconds. i myself felt nothing in relation to the object, except perhaps curiosity. i can only conclude that this objet was either space debris, or perhaps a polar orbit satellite. i assumed it to be glint from a satellite's panels, so i checked online to see if anything was transiting, but no satellites were reported transiting my area at that time. it didn't have the repeating pattern from rotating that is often found in space debris either. but as i didn't observe the object with any length of time, i cannot make any firm conclusions."],"trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around December 27th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.545564,+-113.483892(27141)&iwloc=A&hl=en\"> mufon case (27141) map </A>","Disposition":"Unresolved","Date Submitted":"12/28/2010 02:55 UTC"}