{"Viewing Distance":"Unknown","Date of the Event":"12/28/2010 08:30 UTC","Country":"United States","Longitude":"-114.563028","Object Flight Path":"Stationary,Other","Region":"Arizona","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/27149.html.txt","/var/www/straped/mufon/org/27149.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","divs":["Sighting DetailsSince November, 2010, I have seen with naked eye a very bright linear, star-like object in the Western sky above BHC, AZ. The first night, I tried to take a picture of it with my phone camera. The moon was very bright and the object did not show in the picture. It appears stationary but possibly rotating on axis, It is brightest object in the sky. I can at times see a green line and red tips. One night in particular, I saw a small light, flashing, that moved to and from the object. It can be seen on clear nights. It does not appear to move around but is at different places in the night sky, in the West. Recently, I have noted more same star-shape, linear objects that appear to be more distant. Last night, my daughter said that she saw 3 very bright objects of the same description, much closer, more South, and producing bright light. She lives more East, on higher ground and saw several objects, again more distant than the 3 she saw. I do not believe it is a planet...too linear. I took pictures with my phone tonight and they show a green, round object. The picture looks nothing like the object with the naked eye. I do not have a quality camera or telescope."],"Object Features":"None","Log Number":"US-12292010-0001","Object Shape":"Star-like","Case Number":"27149","Summary":"Every clear night for past 2 months. Very bright object, linear like star with one green line and red tips in Western sky.","Latitude":"35.157607","City":"Bullhead City","Disposition":"Unknown","trends":["There have been 11 other sightings in Bullhead City","There were no other sightings in Bullhead City on or around December 28th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.157607,+-114.563028(27149)&iwloc=A&hl=en\"> mufon case (27149) map </A>","Date Submitted":"12/29/2010 01:22 UTC"}