{"trends":["There have been no other sightings in Water Mill","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/27144.html.txt","/var/www/straped/mufon/org/27144.html"],"Case Number":"27144","Source":"MUFON","Latitude":"40.917835","Object Shape":"Cone, Circle, Cylinder, Disc, Fireball, Flash, Oval, Sphere, Star-like, Teardrop","Region":"New York","Date of the Event":"12/28/2010 06:55 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.917835,+-72.347884(27144)&iwloc=A&hl=en\"> mufon case (27144) map </A>","Tags":"City","City":"Water Mill","Summary":"Quick burst in the night sky","Longitude":"-72.347884","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"12/28/2010 07:34 UTC","Log Number":"US-12282010-0005","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsMy husband and I were driving in our car from East Hampton to Watermill on Long Island, NY. We were traveling on Route 27 heading west. We were driving at approximately 45 miles per hour. There are no street lights on this part of the road (at the corner of scuttle hole Road. My husband spotted something in the sky to our right (northwest) and told me to look. I saw a circular image that was pale and whitish. It was moving very fast towards the northwest. It was also descending. It reminded me of a flashlight shining on a wall or those projection type lights that car sale lots will use to advertise a sale. Except those are usually in pairs and crisscross and don't disappear. This light darted. My husband, who saw it for a few seconds long than myself, described it as \"more white than gold. Like a Roman candle firework that was going down instead of up.\" he agreed with me on the direction that it was traveling. He also used the words, \"meteor\", \"fireball\", and \"explosion\" to describe it. I saw it for about 5 seconds; my husband for about 10 but that is a rough estimate. It then just diapered almost like a flashlight would if you suddenly turned it off. There is a military base on Long Island so we considered that it might be something from there that had exploded. My husband asked me if I could see a fire on the ground. I didn't but it was dark and there were many trees obstructing my view. Confusion is the emotion that would best describe how we felt. That and awe."],"Disposition":"IFO"}