{"Longitude":"-90.189504","Sighting Duration":"Undisclosed","Summary":"Vapor trail materialized over St. Louis from no visible craft","Case Number":"27147","Date of the Event":"11/27/2010 04:28 UTC","Disposition":"Hoax","divs":["Sighting DetailsI stepped out my south city back door and couldn't help but notice a long vapor trail stretching from my left almost directly over my house and lengthening in an otherwise completely cloudless and clear sky. I have seen similar circumstances before, where planes could be seen emitting the vapor trail, but NO plane could be seen emitting this vapor trail! I ran inside and got my camera and took 15 pictures over five minutes of this phenomenon as it continued on, the vapor trail basically going east to west. The vapor trail being emitted was different than commercial airliners that were also in the sky at that same time, which I did take pictures of them but did not include. All the other planes could been seen and had their vapor trails dissipate within 30 or so lengths of the plane, where the vapor trailed the plane for that relatively short distance of space right behind it. But, THIS vapor trail stayed much longer in the sky and, when it dissipated, it did so in segments far trailing the head of the vapor trail, which I have pictures of. As can be seen in the three included images, the last one enlarged, no craft nor object - NOTHING - can be seen emitting the vapor: It appears the vapor is just manifesting itself across the sky! \"Logically\" it would seem that such is actually what's happening somehow, or, that an invisible object is creating the vapor trail. Are these \"reasonable\" explanations? If it can be even more strange, the picture taken at 4:29:01 PM CT had a dark object in the bottom left corner, the only image with this anomaly in it - indicating it is probably NOT a camera anomaly because it's never repeated in the other 14 pictures. Enlarged, this object appears to look like an arrow head, and if a line is drawn in the direction the arrow head is pointing, it is pointing at the head of the vapor trail manifestation!!"],"Object Flight Path":"Undisclosed","Object Shape":"Unknown","Date Submitted":"12/28/2010 09:10 UTC","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.635062,+-90.189504(27147)&iwloc=A&hl=en\"> mufon case (27147) map </A>","Tags":"City","City":"St Louis","files":["/var/www/straped/mufon/html2text/27147.html.txt","/var/www/straped/mufon/more/27147_submitter_file1__2010112716285101.jpg","/var/www/straped/mufon/more/27147_submitter_file2__2010112716290101.jpg","/var/www/straped/mufon/more/27147_submitter_file3__2010112716291001.jpg","/var/www/straped/mufon/org/27147.html"],"Viewing Distance":"Unknown","Country":"United States","Log Number":"US-12282010-0008","Latitude":"38.635062","Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around November 27th 2010","This sighting has never been favorited.",""],"Object Features":"Undisclosed"}