{"Disposition":"Unknown","Object Features":"Undisclosed","Latitude":"36.784411","Case Number":"27140","Sighting Duration":"Undisclosed","Summary":"Glowing orb not ten feet away caught observing by four witnesses","files":["/var/www/straped/mufon/html2text/27140.html.txt","/var/www/straped/mufon/org/27140.html"],"Object Flight Path":"Undisclosed","Region":"California","divs":["Sighting Details It was an early summer morning, about 0345. Three of my friends and I were out on a second floor balcony, talking and smoking cigarettes. There is a large tree to your right when you're standing on this balcony looking out onto the street. The neighborhood is in a condo complex near the water in Foster City, Ca. Anyway, we were chatting away, when out of the corner of my eye I saw this orb appear from behind the tree. It arced out from behind this tree from my right to left. I was the first to notice it as it silently hovered no more than ten feet away from us at eye level. It was about 8-10 inches in diameter. The only way I can describe it is that it looked like a ball of plasma, the insides of it seemed to be moving. It was changing colors also, vivid reds and blues, pinks and orange; it was absolutely beautiful, like \"living light\". It didn't seen to emit light. It's hard to describe. It's like the light was internal, contained. After a few seconds my three friends noticed it too. The conversation fell silent and all four of us just stood there dumbfounded, staring at it. I remember it seemed difficult to focus on, it's as if my eyes couldn't get a sharp look at what exactly it was. It hovered there for about 20 seconds, then it seemed to notice that we had noticed it (we all got really quiet and were staring at it at this point). The plasma ball silently floated away to our right and disappeared behind the tree where it had appeared from. We stood there shocked. Nobody said a word for a minute that seemed like an eternity. I asked my friends \"Did you guys see that?\" and they said \"Yeah\". None of us could explain what it was. The funny thing is, none of us ever really talk about what we saw that night. I'll ask them from time to time if they remember that night, and they do. None of us can come up with an explanation of what the hell we saw. Years later, i can't shake the feeling that there was some kind of intelligence behind it. It's hard to explain. The way it moved was very precise and deliberate. At the time, it felt like it was watching us. I think about it every day and hope to find out what it really is we saw that night."],"Date Submitted":"12/28/2010 12:15 UTC","Log Number":"US-12282010-0001","map":"<A HREF = \"http://maps.google.com/maps?q=36.784411,+-119.409622(27140)&iwloc=A&hl=en\"> mufon case (27140) map </A>","Weather Factors":"None","Object Shape":"Sphere","Viewing Distance":"20 Feet or Less","Country":"United States","Longitude":"-119.409622","Date of the Event":"08/20/2006 03:45 UTC","City":"Undisclosed","Source":"MUFON","trends":[],"Tags":"City"}