{"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"Took photo and saw UFO when looking at pictures later","Longitude":"-72.143182","Tags":"City","divs":["Sighting DetailsMy Girlfriend Patti and I were down by the train bridge where the CT river empties into the ocean. We took many pictures that day but one of them, a self picture of us with the sun setting behind us had a strange object in it when we looked at the pictures later. We were looking and taking pictures all over the sky and ocean that day. Beautiful cloudless sunny day. I do not recall seeing anything in the sky at the time we were taking this photo. The picture of us is not great but there is an object between us that looks fairly large when compared to the bridge behind us. You have to zoom in to get a good look at it. A week later we saw another UFO at the same location same conditions. This one was very large and white. It was moving very slow from right to left over the smoke stack across the water that you can see in the picture. We both watched it for about a minute and it disappeared in the time it took me to reach down for my camera! We both said it was moving too slow to be any type of aircraft. and it just looked like a very large very white \"blob\" or orb at least the size of a football field."],"trends":["There have been 2 other sightings in Waterford","There were no other sightings in Waterford on or around September 12th 2010","This sighting has never been favorited.",""],"City":"Waterford","Log Number":"US-12282010-0003","Object Shape":"Disc","Disposition":"IFO","Country":"United States","Case Number":"27142","map":"<A HREF = \"http://maps.google.com/maps?q=41.35676,+-72.143182(27142)&iwloc=A&hl=en\"> mufon case (27142) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Other","Region":"Connecticut","Date of the Event":"09/12/2010 12:00 UTC","Date Submitted":"12/28/2010 11:20 UTC","Latitude":"41.35676","files":["/var/www/straped/mufon/html2text/27142.html.txt","/var/www/straped/mufon/more/27142_submitter_file1__Nickscar036.JPG","/var/www/straped/mufon/org/27142.html"]}