{"Country":"United States","Tags":"City","Longitude":"-73.691785","Region":"New York","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/30/2003 07:50 UTC","Disposition":"Insufficient Data","Date Submitted":"11/30/2003 07:50 UTC","Source":"MUFON","divs":["Sighting DetailsI was unloading my car in the North Lot of RPI. I stood up and looked at theskyIm used to seeing planes pass overhead Albany International is only a few milesaway but as soon as I saw it I knew it wasnt a plane. It was too long to be anytype of aircraft Ive ever seen. It was dark out, so all I could see were thelights there was a cluster--not one, a cluster---of lights on the front and theback, and red blinking light in between. At first, it looked like a planetowing another plane I held out my arm---there was a centimeter between thefirst cluster and the second cluster. But then I realized how slow it wasmoving with respect to its size. When a plane appears to be that big, it justzips across the sky. But this thing was slow, it took about a minute to coverwhat distance even a prop plane would have taken 30 seconds to. It seemed todim, not just move away, to dim, and then it got too dark to see, even beforepassing over the horizon. But it kept its northwest course, nice and slow,until it seemed to fade away. Of course, I was in a brightly lit parking lot,so that could be why I lost sight, but Im telling you, this was no 747. I wassurprised when I saw it, and a little apprehensive afterwards, like I needed tomake sure my mind wasnt playing tricks on me. I was collected enough to take apicture, but it was with a disposable camera, so I dont know how it will turnout. I just want to know what the hell it was."],"Summary":"Blimp-like object w. lights seen over Troy NY","Sighting Duration":"00:05:00","Latitude":"42.728412","Log Number":"","Object Shape":"Blimp","Case Number":"2715","City":"Troy","map":"<A HREF = \"http://maps.google.com/maps?q=42.728412,+-73.691785(2715)&iwloc=A&hl=en\"> mufon case (2715) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/2715.html.txt","/var/www/straped/mufon/org/2715.html"],"Object Flight Path":"Straight-line path","Object Features":"Other","trends":["There have been 4 other sightings in Troy","There were no other sightings in Troy on or around November 30th 2003"]}