{"Summary":"I saw a cigar shape objet in the sky with rolling lights,no sounds,not moving, that dissapeared with incredible speed. I","Longitude":"-64.975203","files":["/var/www/straped/mufon/html2text/27158.html.txt","/var/www/straped/mufon/org/27158.html"],"Case Number":"27158","Object Shape":"Cigar","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"12/29/2010 04:53 UTC","trends":["There have been no other sightings in Saint-Louis de Kent","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.738602,+-64.975203(27158)&iwloc=A&hl=en\"> mufon case (27158) map </A>","Country":"Canada","Sighting Duration":"00:00:30","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"02/20/1964 12:00 UTC","Object Features":"Window(s)","City":"Saint-Louis de Kent","Object Flight Path":"Stationary","Log Number":"CA-12292010-0010","Region":"New Brunswick","Weather Factors":"Unknown","Latitude":"46.738602","Tags":"City","divs":["Sighting DetailsI am a retired school teacher.I always wanted to tell my UFO sighting to Dr Stanton Friedman.It always stayed fresh in my memory because every year my students wanted to hear my story and most of them believed it.It all began on a winter evening 1964 or 1965 at around 7 or 8 o`clock.I had spend the day at my girlfriend's house and I had to walk 3 miles to get home in kneedeep snow after a snow storm.All of a sudden there was light all around me.I could not see where it came from as there was just but one house behind me.I remember thinking it could be the snowplow or somebody with a big light.After a 360 degree turn I looked up and there it was,a big cigar shape objet with rolling lights.If I had to put a distance I would say it was about a thouand feet up.Sadly I only had a few seconds of sigthing.It never made any sound and it was not moving.I was very impressed my the lights that were moving, but I never had the time to be scare. I admit to being a little shaky afterward.The UFO dissapeared in a northward direction from 0 to incredible speed leaving a flash of light,and not a sound.I had never seen anything like it before and I have never seen anything like it since.As most sightings,there were no witnesses even though I tried hard to find some."]}