{"trends":["There have been 3 other sightings in Brookhaven","There were no other sightings in Brookhaven on or around November 25th 2003"],"Object Shape":"Sphere","Longitude":"-90.440651","City":"Brookhaven","Date Submitted":"11/25/2003 09:00 UTC","Log Number":"","Country":"United States","Region":"Mississippi","Viewing Distance":"Over One Mile","divs":["Sighting DetailsBrookhaven, Mississippi, USAA local school teacher with a Masters Degree told me of the flashing lights, himself an amateur astronomer. In all four directions, rapid flashing lights appear at the same locations, or in others. Planets don't twinkle, and these are larger than stars, and are flashing brilliant colors, rapidly. They have been there most of November. A trained Army man told me he saw a V-shaped six light aircraft, out in the rural area headed toward him from the NW about two weeks ago, at night. It made no sound, and he does not know of any craft like that. It got close to them, and all six lights went in all directions, and his wife nodded. It freaked me out. He is headed for Iraq. I observed a red one flashing in the SE night sky just above the trees just go out, about 9 PM. The biggest one now is appearing at 9 pm, due east, and seems to be moving away. I have never seen stars FLASH in all colors. Surely, others must see them. A prison guard told me 2 weeks ago, he saw one, with his mother and aunt, that was flashing, and with high-powered binoculars it was shaped like a diamond, but only the points at the top and bottom were visible because of the brilliant flashing. I asked him how big it looked. About 2 or 3 miles across.The school teacher told me the East one moved up and down, left and right. He observed, at 430, while getting all the 1-6th graders out, what he described as a nail-looking thing, at an odd angle, like 5 degrees, with a brilliant flashing light on one end. I was driving last summer and upon seeing a number of people pulled over and pointing, what appeared to be a large building, like in Dallas, glass, but fading out on the bottom left. It was huge, REALLY HUGE, due west. It looked exactly like a glass skyscraper, only very wide. I grew up in Meridian, Mississippi where there is a Navy base, and heard all kinds of things, but, never to this extent. Thankyou."],"Object Flight Path":"Unknown","Summary":"Flashing rapid multiple lights","Sighting Duration":"00:00:00","Case Number":"2716","Date of the Event":"11/25/2003 09:00 UTC","Tags":"City","Disposition":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.579059,+-90.440651(2716)&iwloc=A&hl=en\"> mufon case (2716) map </A>","Source":"MUFON","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/2716.html.txt","/var/www/straped/mufon/org/2716.html"],"Latitude":"31.579059"}