{"Region":"California","Summary":"An amber-orange object appeared to the west of the constellation Orion.","Sighting Duration":"Undisclosed","Date Submitted":"12/30/2010 10:42 UTC","Disposition":"Unknown","divs":["Sighting DetailsLocation: Colusa, California Time of Sighting: Noticed an oddly colored star in the very center of the sky from my view, slightly to the west of the constellation Orion; 8:38pm PST. At 10pm, object was still in the sky. I was outside looking at the stars, and as Orion came into my view I thought what I witnessed was the International Space Station flying by. As I watched the object, it moved north, south, and then to my amazement did a full circle in the sky. It returned to its position to the west of Orion. The object was a slightly off color, amber-orange. I went inside my house and got out a pair of binoculars to see if I could get a better understanding of what I just saw. Once I looked at the object through the binoculars it appeared to be in our atmosphere, too close to be a star. And once more, startled me as it moved in the same pattern while I was looking at it through the binoculars. I was under the impression it was trying to disguise itself as a star. I felt the urgent need to report this to some one. I used Google and found your website."],"trends":["There have been 3 other sightings in Colusa","There were no other sightings in Colusa on or around December 29th 2010"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.223984,+-122.005418(27167)&iwloc=A&hl=en\"> mufon case (27167) map </A>","Country":"United States","Latitude":"39.223984","Object Shape":"Circle, Fireball","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/27167.html.txt","/var/www/straped/mufon/org/27167.html"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","Date of the Event":"12/29/2010 10:00 UTC","Viewing Distance":"Unknown","Longitude":"-122.005418","City":"Colusa","Case Number":"27167","Log Number":"US-12302010-0005"}