{"Date of the Event":"09/28/2008 11:00 UTC","trends":["There have been 8 other sightings in Cedar City","There were no other sightings in Cedar City on or around September 28th 2008"],"Sighting Duration":"Undisclosed","Log Number":"US-12302010-0004","Longitude":"-113.056193","divs":["Sighting Details I was standing outside a residence on 300 West near 200 South in Cedar City, Utah. I observed a orange glowing circle in the air. It appeared to be a hundered or so feet above the height of a telephone pole. I looked at it for a few seconds before pointing it out to several other people. I was moving very slowly from the south to the north. When it was above the group of people I was with it stopped above us for approximately 60 seconds. It then slowly left to the north out of view. When I first noticed the object I thought it might be a road flare attached to a balloon. After looking at it for a few more seconds I was sure due to the color and movement it could not be a flare. I had a strange feeling of awe for the first 90 seconds the object was in view. The feeling turned to curiosity until the object left. I have never seen anything like the object before or since. The entire group also saw the object. I attempted to take a cell phone picture of the object but could not get my cell camera to work. It was a cold night with little or no wind."],"Weather Factors":"None","Date Submitted":"12/30/2010 03:15 UTC","Country":"United States","Latitude":"37.686777","City":"Cedar City","Region":"Utah","Object Features":"None","Object Shape":"Circle, Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/27166.html.txt","/var/www/straped/mufon/org/27166.html"],"Viewing Distance":"101-500 Feet","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.686777,+-113.056193(27166)&iwloc=A&hl=en\"> mufon case (27166) map </A>","Summary":"Glowing Orange Ball","Source":"MUFON","Case Number":"27166","Object Flight Path":"Hovering then path,Path then hovering"}