{"Object Shape":"Circle, Sphere, Triangle, Other","Viewing Distance":"501 Feet - 1 Mile, Unknown","Tags":"City","Date Submitted":"12/30/2010 02:55 UTC","Summary":"bright orange balls of light in the of a shape triangle","Region":"Colorado","Country":"United States","Latitude":"40.59131","Longitude":"-105.081863","Date of the Event":"12/26/2010 09:25 UTC","files":["/var/www/straped/mufon/html2text/27164.html.txt","/var/www/straped/mufon/org/27164.html"],"Disposition":"Unknown","City":"Fort Collins","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around December 26th 2010"],"Log Number":"US-12302010-0002","divs":["Sighting DetailsI was on my way home to loveland from fort Collins. I was on collage ave. it is also hwy.287. Was heading south on hwy 287. On the bottom of the hill is fossil creek pkwy. At this point I looked south-west and saw these Bright orange lights,at first I said there no radio tower with lites on it there,and to high to be the lights of the Tynans Nissan that was up ahead on the right on the top of hill.Coming up the hill there were no other car going south so I slowed down and was about to pull over and I remembered W Crestridge Dr coming up on my right.I looked up through my sunroof and saw the lights above but just off to the westside of hwy 287. So I pulled on to this side road, and there was another truck watching these lights too.I jumped out and looked up and there were these 3 orange lights in the shape of a triangle above me slowly going in a north direction one was out in front of the other 2.I got my cell phone out next to try to get a film it. At that point the lights changed shape.the one light to the far north stoped and at the same time the second light on the east side started to go west.The light on the far west was not moving.The light that was far north started to go back south with the light to east going west to meet it.Just before it looked like they would hit the north one was gone and the one that was right next to it got brighter almost redder in color.The one to the west started to move west to the foothills.The one flashed or got brighter above me again then it faded away.The one going west slowly lost sight of it over the foothills .I yelled too the others watching it( what was that!),they said nothing got back in there truck and left.At first was not sure what I saw ,it made no noise.My phone video showed nothing.Then I thought maybe it was a ufo.I was very interesting what ever it was wish I knew for sure what it was.There was a thin layer of clouds but I could see the stars through the clouds."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.59131,+-105.081863(27164)&iwloc=A&hl=en\"> mufon case (27164) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Case Number":"27164","Source":"MUFON","Weather Factors":"None"}