{"Longitude":"-93.616607","map":"<A HREF = \"http://maps.google.com/maps?q=40.078902,+-93.616607(2717)&iwloc=A&hl=en\"> mufon case (2717) map </A>","City":"Trenton","Weather Factors":"Unknown","Object Features":"Wings","Disposition":"Insufficient Data","Date of the Event":"11/19/2003 09:30 UTC","Country":"United States","Tags":"City","Region":"Missouri","files":["/var/www/straped/mufon/html2text/2717.html.txt","/var/www/straped/mufon/org/2717.html"],"Date Submitted":"11/19/2003 09:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"","divs":["Sighting DetailsOn the night of November19 2003, in Trenton Missouri, I was attending a buddy ofmines band practice. At 930 pm we went outside to load up the equipment, hisdrummer looked up and said Look at that thing. As I looked up I saw flying fromne to sw, A large triangled shapped craft. It had 8 lights on it in all. One onthe front tip, one on each side of that one, but back just a bit, one just alittle further back, all these where Yellow and blinking. There was also a redlight on the bottom about in the middle of the craft it was blinking also. Therewere 1 red light on each wingtip. and one on the rear in the middle, these werealso red but not blinking. It appeared to be moveing very slowly for as big asit was, about the size of a quarter at arms length, I couldnt tell what if anynoise it made because we were all talking about it, but i have been talking outdoors and still been ablie to hear a jet fly overhead.I lost sight of it when mybuddy remembered he had binoculars in his truck. He was trying to find it butcouldnt. I said give me those things , but i also could nt find it. Thats thelast i saw of it. I say it was a triangle because the wingtips if that what youwant to call them were all the way too the back of the craft, not like apassenger jet, where they are towards the middle of the plane"],"Case Number":"2717","Object Flight Path":"Straight-line path","Latitude":"40.078902","Sighting Duration":"00:00:59","Object Shape":"Triangle","Summary":"Flying triangle with 8 lights","trends":["There has been one other sighting in Trenton","There were no other sightings in Trenton on or around November 19th 2003"]}