{"Date of the Event":"12/29/2010 11:00 UTC","divs":["Sighting DetailsAround 11PM just south east of sacramento executive airport I observed an object just beyond sacramento executive airport. At first I thought it was a star and then it started to \"crawl\" across the sky and then stop and then it started to 'crawl' again in a more southerly direction. I thought it was an airplane coming in for a landing but the light became too piercing to be airplane landing lights. Living near the airport, I'm extremely familiar with what airplane landing lights and configurations look like. I watched this object for 15 minutes to make sure it wasn't an airplane. After 15 minutes I grabbed my telescope and saw the object up close. The light was brilliant and piercing, the object was a sphere but looked like a diamond at the same time, it had an amber and orange shimmer to it. I stopped watching after around 45 minutes because I was scared. I called the airport but I have not received a response yet. Please tell me someone else saw something of this sort on this same night because I really don't know what to think of what I saw, its something I have never seen before."],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Object Shape":"Circle, Diamond, Star-like","Log Number":"US-12302010-0011","Disposition":"Unknown","Latitude":"38.584122","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.584122,+-121.4914(27173)&iwloc=A&hl=en\"> mufon case (27173) map </A>","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around December 29th 2010"],"Sighting Duration":"00:45:00","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Summary":"Orange and Amber sphere/diamond","Longitude":"-121.4914","Region":"California","Object Features":"Other, Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/27173.html.txt","/var/www/straped/mufon/org/27173.html"],"City":"Sacramento","Date Submitted":"12/30/2010 02:41 UTC","Case Number":"27173"}