{"City":"Seattle","Summary":"small orb flying 100-200 yards in front of jet northbound- clear skies, no other northbound air traffic at that time.","Disposition":"IFO","Latitude":"47.6079","Log Number":"US-12302010-0010","Case Number":"27172","divs":["sighting detailsi was heading north on aurora (99) and noticed a light in front of a jet (white- perhaps alaska air). at that original distance the jet appearred about an inch long, the light maybe a sixteenth of an inch diameter (measured at arms length holding my fingers apart).the object brightly reflected sunlight from behind me for a moment then appearred a matte metallic color. it appearred to maintain a distance of 1 1\\2 jet lengths in front until i found a spot to pull over to call my girlfriend to tell her. this occurred at10:02-10:04am. there was no northbound air traffic in the area for at least 5 min. after.the jet was just west of hywy 99 and first spotted just north of n 85th. at first i thought perhaps it was a fighter escort or a film crew jet (you never know) but the characteristics were way different from those. luckily i was on a 4 lane road with no other cars around so i could slow way down to safely look as long as i could. i also took off my sunglasses and put my head out the window to eliminate the possibility of it being a reflection. i lost sight of the object as the plane got further north and more distant and i had to pull over to be a safe driver as an intersection was ahead. i originally took notice of the jet because there was a distinct lack of air traffic at that time,just looked up and saw something odd out in front of it."],"Region":"Washington","Object Features":"None","Object Shape":"Sphere","Weather Factors":"None","Source":"MUFON","Date of the Event":"11/30/2002 12:00 UTC","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around November 30th 2002"],"Viewing Distance":"Over One Mile","Longitude":"-122.327201","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=47.6079,+-122.327201(27172)&iwloc=A&hl=en\"> mufon case (27172) map </A>","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/27172.html.txt","/var/www/straped/mufon/org/27172.html"],"Date Submitted":"12/30/2010 02:32 UTC","Sighting Duration":"00:02:00","Tags":"City"}