{"Object Features":"Undisclosed","divs":["Sighting Detailsestaba prestando el servicio militar y estabamos en la base de la poblacion de santa rosa en la bota caucana. en mi turno de centinela que era de 12 a 3 am me recoste en el pasto y mire al cielo, estaba despejado y depronto una luz circular aparecio. se desplazo en linea recta, luego zigzagueo y rapidamente desaparecio. durante el evento que duro de 10 a 12 segundo aproximadamente quede sorprendido y no pude dejar de ver esa luz la verdad me senti impactado porque siempre he creido en la existencia de los ovnis, fue una sensacion maravillosa porque es importante saber que no estamos solos y me parece que es imposible que en este universo tan inmenso seamos la unica raza viva. los felicito por su trabajo y mi hijo y yo creemos en la existencia de vida extraterrestre y en lo que les podamos ayudar aqui estaremos. ----------------------------------------------------------------------------- military service was and we were at the base of the population of Santa Rosa in the boot Cauca. in my sentry shift was 12 to 3 am, I lay on the grass and watch the sky was clear and depronto circular light appeared. travels in straight lines, zigzags and then quickly disappeared. during the event which lasted from 10 to approximately 12 seconds was surprised and I could not help seeing that light the truth I felt shocked because I've always believed in the existence of UFOs was a wonderful feeling it is important to know that we are not alone and I think that it is impossible in this universe so big we are the only race alive. I salute their work and my son and I believe in the existence of extraterrestrial life and what we are here we can help."],"Weather Factors":"Unknown","City":"PopayÃƒÂ¡n","map":"<A HREF = \"http://maps.google.com/maps?q=2.45219,+-76.608827(27174)&iwloc=A&hl=en\"> mufon case (27174) map </A>","trends":["There have been 3 other sightings in Popayán","There were no other sightings in Popayán on or around June 13th 2000"],"Sighting Duration":"Undisclosed","Object Shape":"Other","Date Submitted":"12/30/2010 05:44 UTC","files":["/var/www/straped/mufon/html2text/27174.html.txt","/var/www/straped/mufon/org/27174.html"],"Region":"Cauca","Summary":"bola luminosa en zig - zag","Latitude":"2.45219","Case Number":"27174","Object Flight Path":"Undisclosed","Date of the Event":"06/13/2000 02:15 UTC","Tags":"City","Log Number":"CO-12302010-0010","Longitude":"-76.608827","Country":"Colombia","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Unknown"}