{"divs":["Sighting DetailsMy wife and I were returning from Arizona to Los Angeles driving down the I-10 Freeway. While I was driving I noticed an orange bright light in the sky and at first figured it was a plane coming in for a landing. As I drove down the freeway I noticed it was extremely bright, flying about as slow as a police helicopter usually does, and emitting an orange glow without any blinking lights like most aircraft. I woke my wife up to get her opinion on it as we were now coming up on it above us. At this point I had to look back at the road because it was flying over us. She watched as it flew over us and across the freeway back towards the east and noticed the shape being round with the back end being flat. The orange glow coming out of a hole in the center of the craft illuminated the bottom which she described as sort of white, but not white like a plane. Almost an egg shell white. As the freeway bent we lost site of the object and weren't able to see it anymore. We had no feelings other than confusion at what we had seen. We see police helicopters on a nightly basis in LA, and my wife grew up in Tucson Arizona where she would see many military craft flying in the skies daily and nightly. Neither of us have any idea what this was. Note: We did see this just before the Ontario Airport and are fully aware of that. When I first saw the bright glowing light I assumed it was flying into this airport, even though we were still a few miles away from it. Along with knowing full well what a helicopter looks like at night, as low as it was flying we should have heard something, but we didn't."],"files":["/var/www/straped/mufon/html2text/27178.html.txt","/var/www/straped/mufon/org/27178.html"],"Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Disc, Other","City":"Loma Linda","map":"<A HREF = \"http://maps.google.com/maps?q=34.048347,+-117.261153(27178)&iwloc=A&hl=en\"> mufon case (27178) map </A>","Date Submitted":"12/31/2010 04:03 UTC","Disposition":"IFO","trends":["There have been no other sightings in Loma Linda","This sighting has never been favorited."],"Tags":"City","Case Number":"27178","Region":"California","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"12/30/2010 12:00 UTC","Summary":"Saucer type ufo with a flast back and orange glow coming out the bottom","Object Flight Path":"Straight-line path","Longitude":"-117.261153","Latitude":"34.048347","Object Features":"Unknown","Source":"MUFON","Log Number":"US-12312010-0003"}