{"Country":"United States","Date of the Event":"12/29/2010 08:30 UTC","divs":["Sighting DetailsMy daughter and her friend were on our roof watching the sky. They saw four orbs with multicolor flashing lights appear in the sky (west). They watched them for a few min and called my two sons in to watch. Two orbs flew back and forth all over the sky, while the other two stood still. One dimmed iits lights and flew low over a nearby field that is also near hwy 99 and then into the neighborhood and out of sight. This was about 8:45 pm. The kids drug me out of bed to see the ones still standing still in the sky. What I saw looked orb like or oval in shape, there were three of them, blinking about five different colors and made no sound. We live near Mather AFB and can also hear planes from Sac International airport, these made no sound. They also could hover like helicopters but again no sound. I was able to watch with the kids for about 15 min they seemed to scattered away from each other and then one that was blinking multicolored lights began blinking only a blue and silver light. Two flew away in opposite directions and one seemed to just disappear. I had the kids draw what they saw. The boys drawings look oval shaped, my daughter drew the one that flew close by and it was shaped like a flat rectangle. We did take pictures and video with our cell phones but they are horrible quality so I wont submit them unless someone really wants to see them. None of the kids were worried or afraid they all seemed to be excited. I felt apprehensive, it seemed like the more pictured we took the closer two of them came. I had the kids come in off the roof and we watched them from inside the house. We watched for them again tonight but they weren't there and didn't show up. The major things that make me think this was unusuall were they shapes of the crafts, the many blinking colored llights, and how they made no sound."],"Case Number":"27176","Object Shape":"Disc, Oval, Sphere, Square, Rectagular, Triangle","Latitude":"38.410299","Tags":"City","Date Submitted":"12/31/2010 02:28 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.410299,+-121.367928(27176)&iwloc=A&hl=en\"> mufon case (27176) map </A>","Log Number":"US-12312010-0001","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Window(s), Other","Longitude":"-121.367928","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Region":"California","City":"Elk Grove","files":["/var/www/straped/mufon/html2text/27176.html.txt","/var/www/straped/mufon/org/27176.html"],"Summary":"Four Orbs appeared and then scattered","trends":["There have been 19 other sightings in Elk Grove","There were no other sightings in Elk Grove on or around December 29th 2010"],"Weather Factors":"None","Source":"MUFON","Disposition":"Unknown"}