{"divs":["Sighting DetailsI went out on my back porch to smoke a cigarette and noticed an object in the sky that resembled the size of your fist when fully extended from your body. It seemed to fly across the sky and downward out of sight. I hollered to my Fiance who was in the bathroom that I had just saw something. I went inside for a few moments, and while I was inside she saw the exact same thing from a different room. I had not described to her what it looked like yet, and she told me it was like one diamond on top of a smaller diamond that seemed to fly across the sky and was glowing with a bright light that seemed to emanate from the top diamond with a blue aura around it, and the smaller diamond below was also emanating a dimmer light with a lighter blue aura (it happened to be the exact same description of what I had seen about 20 seconds prior.) The objects seemed to fall from the sky, down below the horizon. We went outside after she told me she had seen it too. There were no clouds in the sky prior to this, and then a wave of a cloud-like smoke came across the sky. She went inside for a few minutes, and I noticed the cloud-like smoke was moving incredibly fast across the sky. When she came back outside, I came in and she said the smoke was rising more, and then mysteriously vanished into thin air. I felt a sense of awe watching the events unfold, and she was scared to death. My brother did not witness the diamond-like objects, but he did witness the smoke. He was just as interested and in awe as I was. I'm still in a sense of awe as I post this, a mere 20 minutes after the sightings we have seen. I did not have a camera to take pictures with, and the objects moved by relatively quickly, lasting in the sky almost a few moments. The objects moved by too quickly to take a picture even if I had a camera. I've seen meteor showers and shooting stars, and I assure you that this experience was neither."],"Case Number":"27177","Region":"Tennessee","Object Features":"Unknown","Longitude":"-85.492052","Object Flight Path":"Other","Summary":"Diamond shaped object one above other, two in a two minute period, cloudlike smoke that dissapated after a few minutes","Disposition":"IFO","City":"Cookeville","Date Submitted":"12/31/2010 03:03 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.166969,+-85.492052(27177)&iwloc=A&hl=en\"> mufon case (27177) map </A>","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Shape":"Diamond","files":["/var/www/straped/mufon/html2text/27177.html.txt","/var/www/straped/mufon/org/27177.html"],"Tags":"City","Log Number":"US-12312010-0002","Latitude":"36.166969","Date of the Event":"12/30/2010 01:30 UTC","Country":"United States","trends":["There have been 10 other sightings in Cookeville","There were no other sightings in Cookeville on or around December 30th 2010"],"Source":"MUFON"}