{"Summary":"White light that pulsed, shrank, and disappeared","files":["/var/www/straped/mufon/html2text/2718.html.txt","/var/www/straped/mufon/org/2718.html"],"Date of the Event":"11/28/2003 05:50 UTC","Region":"Texas","Longitude":"-97.859792","Object Flight Path":"Stationary","trends":["There has been one other sighting in Peaster","There were no other sightings in Peaster on or around November 28th 2003"],"Date Submitted":"11/28/2003 05:50 UTC","Object Shape":"Undisclosed","Viewing Distance":"Over One Mile","Tags":"City","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Case Number":"2718","map":"<A HREF = \"http://maps.google.com/maps?q=32.88136,+-97.859792(2718)&iwloc=A&hl=en\"> mufon case (2718) map </A>","City":"Peaster","Latitude":"32.88136","Disposition":"Unknown","Log Number":"","Object Features":"Undisclosed","divs":["Sighting DetailsMy parents and I were driving down West Dry Creek Road, north of Peaster Texas,on Friday, November 28 at about 550 PM. We had stopped at the intersection of W.Dry Creek and FM920 when I noticed a very bright light off to the west. A secondlater my mother commented on the light. It was not moving but seemed to justhover there above the countryside at least a mile from our location. My father,who was driving, drove across the intersection onto E. Dry Creek Road. Icontinued to watch the light but also looked away periodically to look at thefields around us we were watching for wildlife. My father noticed the light atthis point and when my mother asked him if it was a planet or star, he said no.Hes a graduate student in astronomy, so he knows a lot about celestialphenomena. My mom asked him what he thought it was and he said,I dont know.I noticed the light seemed to pulse and was about twice the size of airplanelanding lights, even on the biggest airliners. We live in the flight paths ofthe DFW International Airport, NAS Fort Worth Joint Reserve Base, and severalsmaller airports. We see many aircraft, from large airliners to small planes tomilitary jets. This light was larger and brigter than any of those. After a fewminutes, the light suddenly dimmed or shrank by about 75 per cent. There was acloud nearby, but the light had not gone behind it as my dad suggested. Hecouldnt watch it much because he was driving. I watched it off and on the wholetime and it never went behind the cloud.A minute or so later the light abruptly vanished. There were no flashing lights,like the wingtip lights of airliners. There was simply nothing there. A momentlater my dad said it mustve been a plane ascending to 10,000 feet and thenshutting off its landing lights. However, the light did not move and there wereno wingtip lights visible. Plus, the light was much larger than the largestairliners lights."],"Sighting Duration":"00:05:00"}