{"Object Flight Path":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.770466,+-86.149254(27186)&iwloc=A&hl=en\"> mufon case (27186) map </A>","Region":"Indiana","Tags":"City","Object Features":"Undisclosed","divs":["sighting details7:45am 01\\01\\2011 - lebanon, indiana 1. where were you and what were you doing at the time? standing at my back door smoking a cigarette with door open so the smoke goes outside. 2. what made you first notice the object? its daylight, but its very cloudy morning, im looking s.s.e. when i notice an extremely bright solid white light in the sky. 3. what did you think the object was when you first noticed it? a planet, but 3 problems exist, its daytime, its very cloudy, and its bigger than what planet looks like in the night time sky. 4. describe the object and its actions and motions. this light was not blinking, twinkling and did not have any colored warning lights. it was moving very very slowly towards the n.w. the object remained visible for 1 full minute then slowly faded away completely in 10 seconds. 5. describe your feelings, reactions and actions, during and after sighting the object. when i 1st seen it i thought \"hmm, thats the biggest planet ive ever seen\", my 2nd thought was, \"can you see a planet during daylight and through heavy cloud cover?, my 3rd thought was i dont think you can. and if you can, could it be that damn big and bright? i never got any unusual feelings, just couldnt figure out what i was looking at. 6. how did you lose sight of the object? object dimmed, but its size stayed the same from its brightest to when it became no longer visible."],"trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around January 1st 2011"],"Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"01/01/2011 09:01 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"-86.149254","Date of the Event":"01/01/2011 07:45 UTC","files":["/var/www/straped/mufon/html2text/27186.html.txt","/var/www/straped/mufon/org/27186.html"],"Case Number":"27186","City":"Indianapolis","Latitude":"39.770466","Summary":"Very Bright Light","Log Number":"US-01012011-0003","Object Shape":"Other"}