{"Region":"Texas","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.742887,+-97.101096(27200)&iwloc=A&hl=en\"> mufon case (27200) map </A>","files":["/var/www/straped/mufon/html2text/27200.html.txt","/var/www/straped/mufon/org/27200.html"],"Date Submitted":"01/01/2011 11:28 UTC","Case Number":"27200","Weather Factors":"Unknown","Latitude":"32.742887","Log Number":"US-01012011-0015","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around January 1st 2011"],"Object Features":"None, Unknown","Date of the Event":"01/01/2011 08:42 UTC","Object Shape":"Sphere","Summary":"speedy orb flying at high speed, turned directions and flew in the opposite direction.","divs":["Sighting DetailsMe and my girlfriend were driving down I-30 headed eastbound. We were passing Cooper street in Arlington Texas, when I noticed an orb in the sky. The orb was very bright and a fair distance away from us. I kept looking for a blinking light to figure out if this was an airplane. I asked my girlfriend if she could tell if it was \"blinking\". At that exact moment my girlfriend let out a gasp and we both noticed that the object had changed complete directions, done a 180 degree turn and was now headed in the opposite direction. The orb sped up and was flying at an exceptionally fast rate of speed. I couldn't believe my eyes. Thank god my girlfriend was there to back up my story. We both experienced a low flying object, brightly lit, changing direction in mid flight pattern and flying at an extremely fast speed. By the way I should mention that the flight pattrn that the orb took was originally headed north and then took a turn and headed south and passed right over Cowboy's stadium in Arlington Texas. The orb vanished from our line of sight behind a building, when we drove around the building the orb was well gone."],"City":"Arlington","Longitude":"-97.101096","Sighting Duration":"00:02:15","Tags":"City","Disposition":"IFO","Viewing Distance":"Over One Mile","Source":"MUFON","Object Flight Path":"Path with directional change"}