{"Object Features":"Undisclosed","Log Number":"AU-01022011-0005","Disposition":"Unresolved","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-27.464883,+153.029862(27205)&iwloc=A&hl=en\"> mufon case (27205) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI went to bed around 11pm, sometime during the night i was woken up by three creatures in a brightly light egg shaped room, the light was coming out of the walls ceiling and floor with a soft luminous glow, they were speaking to me as they woke me before i opened my eyes, so that i might not be afraid (they said & i quote: \"do not be afraid or scared, we love you and care for you\")in gentle penetrating words that echoed in my head and funnily enough not in my ears. they introduced themselves as \"one two & three, one was on my left two was behind the top of my head behind me and three was standing to my right. when I opened my eyes, I was shocked, yet there is this strange familiarity with them, as if they have known me all my life. I was naked (i wear pj's to bed)I felt dazed, even drunkish, yet i don't drink) and I went to sit up & two placed it's huge hand underneath my neck & back to help support me, they were chatting insesantly using telepathy yet I could hear them talking in clicks & pops sort of like crickets chirping but quicker and more complex & meaningful, they said they were looking for signs of tampering on a genetic & physical lvl, three had a device in his hand and starting at my right foot he brought the hand held device up my right leg about ten cm above my skin, he tilted the screen so that I could see too, the surface of the device looked like liquid metal as i watched the screen i could see beneath my skin. Three, flicked through the different resoutions so I could see the bone and muscle tissue or just the nerves & vascular, they reminded me of ants,these people. Their deep dark eyes their tiny noses & mouths, their powdery white skin that reminded me of the roughness yet smoothness of shark skin they where tall & thin yet strong. I was going to say where am i? when the walls, ceiling & floor changed to match my thoughts just like it was projected somehow from outside the craft and I could see we were high over my suburb and I could see the blue cross on top of the church, up on the hill i live at the foot of, i could see all the city lights below twinkling like a million candles...these three aliens didn't have to wake me up and show me all this stuff (i would have actually prefered they hadn't)however what is done, cannot be undone. I know for sure, that these particular aliens would never hurt us, I woke late for college by almost three hours and I could not help realise that this was not like any dream i'd ever had before, woken by creatures from the stars, as if! I kept telling myself it was only a dream, that none of it is real...unfortunately, who am i kidding other than myself? I've never had a dream like it & haven't had one since. I hope you enjoyed my adventure, feel free to contact me if you have any questions about my experience in regard to this event preferably email,though if you can get through on the phone that's okay too. my conclusion is: a. there is more than one race of alien with us, b. a faction is helping us. c. and a carnivore reptile race, maybe a small group is consuming warm blooded lifeforms through terror and collection of pituitary fluid (dimethyl...) What religion calls the beast. but i could be wrong. thanks for having a spot to share experiences, i know in my heart that what happened to me was not just a dream, I can still hear them talking sometimes at night when it's really quiet. tip chirp tip tip tip chirp getting louder and louder as it comes closer and closer from way up in the sky. they're tracking us."],"Date of the Event":"08/08/2010 12:00 UTC","Tags":"City","Region":"Queensland","Summary":"from inside the craft","City":"Brisbane","Case Number":"27205","Date Submitted":"01/02/2011 01:37 UTC","Longitude":"153.029862","Country":"Australia","Source":"MUFON","Latitude":"-27.464883","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27205.html.txt","/var/www/straped/mufon/org/27205.html"],"Object Shape":"Egg","Object Flight Path":"Unknown","trends":["There have been 27 other sightings in Brisbane","There were no other sightings in Brisbane on or around August 8th 2010"]}