{"Tags":"City","files":["/var/www/straped/mufon/html2text/27216.html.txt","/var/www/straped/mufon/org/27216.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.621528,+-93.285675(27216)&iwloc=A&hl=en\"> mufon case (27216) map </A>","Region":"Louisiana","Object Features":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Minden","There were no other sightings in Minden on or around January 2nd 2011"],"Date of the Event":"01/02/2011 08:22 UTC","Sighting Duration":"Undisclosed","Case Number":"27216","divs":["sighting detailsi was on my way home from shreveport, la around 7:30 pm when my friend *(name deleted--cms\\sg)noticed something in the sky. he pointed it out to me, so i began observing it. my other friends kept telling me it was a star, and i just couldn't accept that. the object was pulsating red, white, and green. when the green would flash you could see the disc-shaped outline. i watched it the whole way to minden, la. it didn't move at all. when i got home i walked to my backyard and watched it again. i also noticed another object to the left of it doing the same thing. i began to notice it move slightly from side to side, unlike the other stars in the sky i noticed the rays radiating from the object. i was amazed, it was like nothing i've ever seen before. i called a few of my friends to confirm that they were seeing they same thing, and they noticed two more from where they were in town. they agree the same, that was totally a ufo. it has been in the same spot, i don't have anything that could capture the ufo unfortunately. it's really cold outside too, and i've been watching it for well over two hours. i came inside just now to report it. hope everyone else gets to see something as amazing as this."],"Date Submitted":"01/02/2011 09:32 UTC","Log Number":"US-01022011-0016","Latitude":"32.621528","City":"Minden","Disposition":"Unknown","Weather Factors":"Unknown","Longitude":"-93.285675","Object Flight Path":"Stationary","Country":"United States","Summary":"pulsating, moving side to side, red green and white","Object Shape":"Disc, Flash"}