{"Case Number":"27228","Log Number":"US-01032011-0011","Latitude":"30.003271","Object Features":"Undisclosed","Country":"United States","Tags":"City","Region":"Texas","City":"Humble","Date Submitted":"01/03/2011 04:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.003271,+-95.259555(27228)&iwloc=A&hl=en\"> mufon case (27228) map </A>","Summary":"Jets creating contrails, I took pictures. And egg (?) shaped object showed, after a chevron shaped glow in the clouds showed up. Photographed them.","files":["/var/www/straped/mufon/html2text/27228.html.txt","/var/www/straped/mufon/more/27228_submitter_file1__IMG_0587a.jpg","/var/www/straped/mufon/more/27228_submitter_file2__IMG_0588b.jpg","/var/www/straped/mufon/more/27228_submitter_file3__IMG_0590b.jpg","/var/www/straped/mufon/org/27228.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["sighting detailsi was at my workplace in the humble area, came out the back door for a cigarette break. noticed a very clear sky with several white jets creating contrails. visible in the early pics (around 2:00 pm). i took a few shots just out of curiosity. about 2 hours later, i came out and the contrails had turned into heavy cloud cover with a visible contrail jet still flying over. i took a few more pics, but did notice the odd glowing chevron shape above me. took some pics. later uploaded to computer and adjusted contrast (only) to see better detail, if any. i did not see the small egg shaped object when taking the pics. the chevron was just hovering\\floating there but couldn't observe for a long time, i was at work. the chevron struck me as an oddity and of course my mind started running on the reaction between the contrails creating cloud cover and this odd shape appearing overhead. who knows. i am a digital designer by profession and i swear that nothing was re-touched or altered other than increased contrast and adding the red circles to highlight the anomaly. not even sure it was an object but it sure grabbed my attention. i am an avid skywatcher and have seen about 2o ufo's through the years. sadly, never had a camera to record anything. these were taken with an iphone4 at hd. the pics are numbered as originally still on the iphone, in the order they were shot. the first set of pics lapsed maybe 3-4 mins. the second set (4:00pm) were rapid fire. i uploaded the ones highlighting the objects(?) or whatever they are but all of the originals are available upon request. the archive is 37mb compressed, as they are hd."],"Object Flight Path":"Stationary","Source":"MUFON","Longitude":"-95.259555","Date of the Event":"12/23/2010 02:00 UTC","trends":["There have been 7 other sightings in Humble","There were no other sightings in Humble on or around December 23rd 2010","This sighting has never been favorited.",""],"Object Shape":"Chevron, Egg","Sighting Duration":"02:00:00","Weather Factors":"Unknown","Disposition":"IFO"}