{"Summary":"could see vague details of windows and ext. of craft before it became orb.","Viewing Distance":"Over One Mile","Object Shape":"Other","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around December 31st 2010"],"Weather Factors":"None","Tags":"City","Object Features":"Window(s), Patterned Surface, Other","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"12/31/2010 09:17 UTC","files":["/var/www/straped/mufon/html2text/27223.html.txt","/var/www/straped/mufon/org/27223.html"],"Disposition":"Unknown","Object Flight Path":"Hovering then path","Case Number":"27223","Longitude":"-112.069657","Date Submitted":"01/03/2011 12:37 UTC","divs":["Sighting DetailsI was out back of my house smoking a cigarette and noticed a star shimmering. I noticed it turning different colors and kind of blinking. I couldnt see it clearly with my eyes so I got my video camera with 42X zoom and took a look. Much to my surprise I saw a craft that looked like it had two windows and red light coming from inside. It turned and then turned into an orb of about the same size. The orb then went slowly higher and farther away. The orb was every color of the spectrum and looked to be swirling some how as well as pulsing like a heart beat. It stayed in the air for about 3 hours traveling slowly away and higher. I was afraid and nervous but got the whole thing on video. I slept with the camera near me because I thought someone might steal it from me and I would never be able to show anyone. I am willing to show the video to people but I honestly think its worth something. After I have watched the video frame by frame seceral times I have seen the cockpit and a shadow backlit as well as the skin of the craft ( bumpy)and roughly the size and shape of it."],"Latitude":"33.451567","Region":"Arizona","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.451567,+-112.069657(27223)&iwloc=A&hl=en\"> mufon case (27223) map </A>","Log Number":"US-01032011-0006","City":"Phoenix"}