{"Country":"United States","Case Number":"27224","map":"<A HREF = \"http://maps.google.com/maps?q=42.913408,+-85.790278(27224)&iwloc=A&hl=en\"> mufon case (27224) map </A>","Weather Factors":"Unknown","Object Shape":"Circle, Fireball, Sphere","divs":["Sighting DetailsOn New Year's Eve, outside on porch with some friends at about 11:30 pm when we saw a large and bright red glowing ball of light with a distinctly different white light glowing from the very middle. The glow was extraordinary and the object appeared to be close to us (within 1-2 miles) based on the size it started as and how small it was when it eventually left our sights. The red object appeared to be moving smoothly and very quickly from one side of our sights (about 30 degrees from the horizon) in the eastern sky and moved all the way across to the western sky and out of sight within about 45 seconds. Approximately 10 people witnessed the object. It was noiseless, very fast and changed it's direction in an instant. It also seemed to rather close to us in the beginning and as it went westward it's distance from us decreased as well. The light of this thing was very difficult to describe, but there was a distinctly white very bright light in the center, and the surrounding had red glow, equally as bright but taking up more space.Like a circle within a circle. No color blending either. Very smooth flight, but changed directions very quickly and sharply. Happy New Year!"],"Date of the Event":"12/31/2010 12:00 UTC","City":"Georgetown Township","Log Number":"US-01032011-0007","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"42.913408","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/27224.html.txt","/var/www/straped/mufon/org/27224.html"],"Object Features":"Unknown","Object Flight Path":"Path with directional change","Longitude":"-85.790278","Region":"Michigan","trends":["There has been one other sighting in Georgetown Township","There were no other sightings in Georgetown Township on or around December 31st 2010"],"Tags":"City","Date Submitted":"01/03/2011 01:33 UTC","Source":"MUFON","Summary":"Super red glowball with white center over jenison/allendale MI."}