{"Latitude":"29.845499","files":["/var/www/straped/mufon/html2text/27239.html.txt","/var/www/straped/mufon/org/27239.html"],"Weather Factors":"Unknown","Case Number":"27239","Log Number":"US-01042011-0003","Longitude":"-97.840836","Source":"MUFON","City":"Martindale","Object Features":"None","Tags":"City","Region":"Texas","Summary":"Still light that slowly landed after a couple of seconds.","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Object Shape":"Fireball, Star-like","Date of the Event":"01/02/2011 12:00 UTC","trends":["There have been no other sightings in Martindale","This sighting has never been favorited."],"Date Submitted":"01/04/2011 02:08 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was inside my house when my mom went to put some clothes in the washroom, which is outside. I followed her and intended to stay indoors since it was really cold that night. I was waiting when I noticed something bright between the branches of one of our trees. I thought is was a plane, so I moved a little and waited. It stayed still. I immediately wanted to see what it was so I went back to my room and grabbed a jacket and shoes. Once I got outside, I took a better look. It looked like a street lamp, but in the sky and brighter. At this point, I thought it was a star. It was still in the same spot as before, my it looked like it was slowly landing. I was excited to have spotted something, so I didn't really care what its was. My mom had noticed me outside and asked what I was doing. I turned around to face her but when I went to point it out to her, it was already gone. I don't know if this is related, but when I had opened the door, a lot of the neighborhood dogs were barking like crazy. My mom said that they were barking the whole time she was out there. After the light disappeared, they were silent. But our dog did nothing out of the ordinary that whole time."],"Object Flight Path":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.845499,+-97.840836(27239)&iwloc=A&hl=en\"> mufon case (27239) map </A>"}