{"Case Number":"27234","map":"<A HREF = \"http://maps.google.com/maps?q=42.363411,+-71.051593(27234)&iwloc=A&hl=en\"> mufon case (27234) map </A>","Summary":"could have been mistaken for a plane if it weren't stationery","Region":"Massachusetts","Latitude":"42.363411","City":"Boston","Date Submitted":"01/03/2011 09:56 UTC","Object Features":"Unknown","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/27234.html.txt","/var/www/straped/mufon/org/27234.html"],"Weather Factors":"None","divs":["Sighting DetailsI went outside for a smoke and as I stepped out my back door I saw over the roof of the house behind mine what I thought at 1st was a plane I walked to the left lit my cigarette and looked up at Jupiter (I think) which I always do at night, but I could still see the \"plane\" in my peripheral vision and it didn't seem to have moved so I walked back over to the left and I could see it unobstructed between two tree branches so I used the branches to try and judge movement and I couldn't see any and I now noticed it looked a bit odd there were two normal white lights that looked the same as on most commercial jets but they were in the middle very close together and there were two outer lights but all four were very close together and at the outer lights it seemed to curve some and there was no bright white blinking off of any of them which you normally see on planes and there was no small red blue or green blinking light that I could see anywhere, I was starting to panic at this point because it still wasn't moving and now I can't remember what color the two outer lights were. At that point I ran left again to knock on my kitchen windows then I thought no one inside would come fast enough, so I ran inside and my mom was right there and she came out right away and saw it, it still hadn't moved then I ran back in and told my brother to grab his binoculars (I don't know why I didn't think camera) and I threw my sons coat at him because I wanted him to see too, when I ran back outside it still hadn't moved and I was trying to point it out to my son, then it started dipping below the tree line I think at this point it had been a good 5-8 minutes (hard to tell when you're that excited but my cigarette had burned down) so I ran down my back stairs and up my driveway and I could still see it between trees and then a few seconds later I couldn't see it anymore. My brother and son never saw it, my mother did and she said it looked wierd not like a plane at all but she thinks it may have been a helicopter, but she says it definitely was not moving at all for a few minutes.I believe in UFO's, I always have as far back as I can remember and I have seen one in broad daylight back in about 1997, but I'm not crazy and I don't think every flashing light in the sky is a UFO, I'm a very rational, objective person. I live in Boston and I'm very accustomed to airplanes and helicopters day and night, I'm well aware how they can look odd sometimes especially at night and how they can look like they aren't moving. This was positvely not moving, and I'm about 98% sure it was a saucer shaped UFO. I do want to add though, air traffic seemed quite normal so I'm guessing there was nothing odd picked up on radar anywhere."],"trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around January 3rd 2011"],"Longitude":"-71.051593","Object Flight Path":"Stationary,Hovering then path","Tags":"City","Log Number":"US-01032011-0017","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"01/03/2011 08:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Disc"}