{"Latitude":"32.695011","Country":"United States","Case Number":"27238","Object Shape":"Oval, Sphere","Object Flight Path":"Stationary","Longitude":"-114.622352","Region":"Arizona","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27238.html.txt","/var/www/straped/mufon/more/27238_submitter_file1__ufocropped.JPG","/var/www/straped/mufon/more/27238_submitter_file2__ufozoomed.JPG","/var/www/straped/mufon/more/27238_submitter_file3__yumamap.JPG","/var/www/straped/mufon/org/27238.html"],"Object Features":"None","Date Submitted":"01/04/2011 01:59 UTC","Summary":"Stationary object seen in daytime while driving into Yuma, AZ from the East on Hwy 8","City":"Yuma","Log Number":"US-01042011-0002","divs":["Sighting DetailsDriving towards Yuma on the 8, I noticed a oval or spherical object which looked white over the mountain range where I believe Yuma Proving ground is. I noticed it did not move. After going over the little pass and down into Yuma, I looked and could still see it. It had not changed position for over 25-30 minutes. In Yuma, we had lunch at the Crackerbarrel and after leaving and continuing west on hwy 8, It was still in the same position, appearing to have not move. There were no other aircraft in site. We guessed it may be something tethered, but it seemed extremely high over the mountains and quite large considering it's size. I attempted to take a picture of it with my Sony 14 megapixel point and shoot, but the pictures don't offer much as far as detail. I am convinced the object remained stationary, or moved so slowly it appeared to be stationary (this was possible because I was after all moving along the highway and only looking at it periodically). I am certain this was not a cloud, star, planet, bird, helicopter, or traditional aircraft. It could have been a tethered balloon (if so it was a strange white color, appeared to be almost glowing or softly reflecting sunlight). The sky was clear for the most part and the sun was bright. I lost site of the object after leaving Yuma, driving West, and it eventually was out of sight from the highway, behind us."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.695011,+-114.622352(27238)&iwloc=A&hl=en\"> mufon case (27238) map </A>","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around January 1st 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Tags":"City","Disposition":"IFO","Date of the Event":"01/01/2011 12:00 UTC"}