{"Date Submitted":"01/03/2011 09:43 UTC","Disposition":"Unknown","Longitude":"-81.725632","Case Number":"27233","Tags":"City","Date of the Event":"01/03/2011 08:15 UTC","divs":["sighting detailsmy friend josh and i were standing outside looking for meteors during a meteor shower and he noticed something streaking across the sky. he pointed it out to me and we both watched dumbfounded as this thing streaked across the sky parallel to us. it was dark grey, had sort of a pinecone shape. it had no lights and there was an erie silence as it streaked past. it also had no tail engine or light in the rear as it passed us. we initially thought it was a satellite streaking by but it was much closer and didn't glow like they do. it was almost barely visible. there was no glow like something reentering earths atmosphere either. we estimated it to be at about 15,000-20,000ft traveling quite quickly like satellites do. it then made a sharp adjustment in its trajectory and we watched it until it disappeared behind trees and houses. i made a quick sketch of the incident within a minute. the moment (when looking for meteors) sounded like this: \"oh theres one! ..wait, what is that? -i dont know. ..its not glowing or anything. -maybe its a satellite. -no....thats too low. (10 seconds of stunned silence) -whoa what was that?! -i dont know, there werent any lights on it either..\" we tried to rationalize all different scenarios of what it could be. nothing fit. so we looked up mufon and found the fl group. *(names of two witnesses deleted--cms\\sg)"],"Object Shape":"Bullet, Missile, Cone","City":"Tavares","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.804158,+-81.725632(27233)&iwloc=A&hl=en\"> mufon case (27233) map </A>","Sighting Duration":"Undisclosed","Object Features":"None, Other, Unknown","trends":["There have been 2 other sightings in Tavares","There were no other sightings in Tavares on or around January 3rd 2011"],"Weather Factors":"Unknown","Summary":"Fast Moving Dark Object disturbs Meteor Shower Viewing","files":["/var/www/straped/mufon/html2text/27233.html.txt","/var/www/straped/mufon/org/27233.html"],"Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Log Number":"US-01032011-0016","Country":"United States","Latitude":"28.804158"}