{"Date Submitted":"01/03/2011 11:39 UTC","trends":["There have been 6 other sightings in Rocklin","There were no other sightings in Rocklin on or around January 3rd 2011"],"Longitude":"-121.229933","divs":["Sighting DetailsI stepped out of my house and looked into the very cloudy sky and saw what appeared to be a search light in the sky going around in erratic circles. But, the circular shaped light seemed to be on the inside of the clouds. I couldn't see any actual light or beam, what I saw was a shadow of a light that looked as though it was coming through the clouds. Curious, I got in my vehicle and wanted to get underneath this to see if I could see a beam or anything that would dismiss this as simply a search light. As I drove the pattern of this shadow continued to be erratic in its flight. It was also very fast and seemed to \"skip\" or \"slide\" across the sky at a very fast rate. Well, I suddenly found myself directly under this phenomenon. I had the feeling this thing knew I was watching it. I started to see a break in the clouds and focused on this point to see if I could see anything other than the shadowy glow and the thing disappeared as though someone turned the light off. I witnessed this phenomenon for about 30 minutes or so. Perhaps this was a search light. But, then why was there a search light in Rocklin on a Monday night? I have lived here for years and have never seen a search light. And, why wasn't there any beam that could be seen? And, why did the light seem dim and appear to be coming from within the cloud formation?"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.794034,+-121.229933(27236)&iwloc=A&hl=en\"> mufon case (27236) map </A>","Object Features":"None","Disposition":"Insufficient Data","Region":"California","Country":"United States","Summary":"a dim, shadowy, roundish, white green light like a search light","Latitude":"38.794034","Log Number":"US-01032011-0019","Object Shape":"Flash, Oval","Case Number":"27236","Source":"MUFON","Date of the Event":"01/03/2011 07:30 UTC","Object Flight Path":"Path with directional change","City":"Rocklin","Tags":"City","files":["/var/www/straped/mufon/html2text/27236.html.txt","/var/www/straped/mufon/org/27236.html"],"Viewing Distance":"101-500 Feet"}