{"Object Features":"Undisclosed","Case Number":"27245","Weather Factors":"Unknown","Longitude":"-93.626322","Disposition":"Unknown","Source":"MUFON","Summary":"8 Amber lights that lit up, like slow chasing lights. Appeared to be a very large half circle shape.","Date of the Event":"01/03/2011 07:25 UTC","Country":"United States","divs":["Sighting DetailsWas in my kitchen when my daughter called and said she saw \"the lights\", she was very excited and thought this was them for sure ( we have seen these in our area several times now) she was on her way to her boyfriends house when she saw a large glowing light in the sky, it lit up moved down very slowly and went out. so I went out on the porch and looked in the direction they always seem to be. We both saw the twinkling star type lights that we have noticed have come before, at the time we see the big lights. we were talking about how they aren't stars and its strange how they change color, from red, green and white. These are usually in a large group with a half dozen or more, seeming to jump around or change direction quickly( NOT planes) As we were talking about them all the sudden the big set of lights started lighting up. Huge and bright lights that were dark yellow or amber colored, starting on the right then going left one by one another would light and the others behind went off. My kids had ran out on porch behind me and my son counted eight total. I was too busy trying to calm down my screaming daughter on the phone as she was in a secluded area and was scared. Then I got my video camera and watched but they didn't light up again this night. Twinkling lights were there maybe an hour more then they were all gone. Will look again tonight as it seems before we see them a few days in a row. It was a very clear night outside."],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.467241,+-93.626322(27245)&iwloc=A&hl=en\"> mufon case (27245) map </A>","trends":["There have been no other sightings in Calhoun","This sighting has never been favorited."],"Region":"Missouri","Sighting Duration":"Undisclosed","Log Number":"US-01042011-0009","files":["/var/www/straped/mufon/html2text/27245.html.txt","/var/www/straped/mufon/org/27245.html"],"Tags":"City","Latitude":"38.467241","Viewing Distance":"Unknown","Date Submitted":"01/04/2011 06:12 UTC","Object Shape":"Unknown","City":"Calhoun"}