{"trends":["There have been 3 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around December 31st 2010"],"City":"Leavenworth","Disposition":"Unknown","divs":["Sighting DetailsNew Year's Eve 2010, at approximately 11:00 PM PST, my wife and I both observed two orangish objects in the southeast night sky, approximately 25-30 degrees above the horizon. Based on the surrounding hills, it was our guess that they might have been somewhere between the towns of Peshastin, WA and Cashmere, WA although if they were higher up or big, they might have been closer to Wenatchee, WA. The sighting was through a large bathroom window. Being an extremely clear night, it was easy to distinguish the two objects from the surrounding stars, not only because of their color, but also because they were considerably larger than the stars. In fact, that is what attracted us to them, not only because of the orange glow, but also because they were bigger than the surrounding stars and in a place where we had never seen big stars. Because it was night, we didn't have any way of telling how high up they were and what size they were. All we could tell is that they appeared as if they were orbs. At that point, our instincts told us that the objects were perhaps 10 miles to our southeast and maybe several thousand feet above the ground, but those facts are purely guesses. At first, each object appeared to be stationary. Perhaps a minute later, one of the objects appeared to travel slowly to the northwest, which would have put it on a straight course to possibly travel over our house. As it progressed, it also appeared to become slightly larger than it was initially, which would probably be the case if it was, in fact, headed our way. When they both started moving our way, all of a sudden the second orb, which was behind the first one when we first saw them, seemed to do an about face and went in a south east direction for a few seconds, then appeared as if it was heading toward the ground. We lost sight of it when it went down below the hills which surround our home. The object moving in our direction appeared to be about 60- 75 degrees above the southeast horizon. After traveling toward our home for about a minute or so, it appeared to stop and seemed as if it was perhaps only a mile or two away and several thousand feet above the ground. Again, the distances are strictly speculation. Since the remaining object was now much higher in the sky and closer to our home, I went outside for a better view. The object was still glowing orange and remained stationary. Suddenly, the object began to pulsate with a strong, white light which lasted several seconds. It reminded me of a strobe light. The light was so bright, it was difficult to look directly at it. After maybe 5 seconds, the white light then faded back to the orange glow and then repeated itself perhaps two more times, each time emitting the same strobe-like white light. After the strobe light episode, the orange glow of the orb pulsated, making the object appear larger, then it would go back to the original size. The length of time it took for it to grow larger then return to the original size was about four seconds. It then paused for around 5-10 seconds and then repeated the growing large then returning to the original size again. It did this around 4 or 5 times. After that episode, it then slowly, over the course of maybe 15 seconds, faded until there was nothing left to observe. The entire sighting lasted approximately 10 minutes. Throughout the sighting, we were astounded that there was absolutely no sound. Again, because we were unable to use a frame of reference, it could have been so high up that we wouldn't hear any sound. Because the sighting was so noticable to us, we thought others must have seen what we saw but in subsequent days we heard nothing and saw nothing in the local media, until we were directed to the UFO Northwest website, where we read the account of the family in Bremerton, WA. Their appearance, and the fact that there was more than one, lead us to speculate that maybe we were seeing similar objects. We also thought there might be some connection to the many folks who were setting off fireworks throughout the valley but neither one of us had ever seen anything like this before."],"Log Number":"US-01042011-0011","map":"<A HREF = \"http://maps.google.com/maps?q=47.601183,+-120.657076(27247)&iwloc=A&hl=en\"> mufon case (27247) map </A>","Longitude":"-120.657076","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/27247.html.txt","/var/www/straped/mufon/org/27247.html"],"Object Shape":"Fireball, Flash, Sphere","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"01/04/2011 09:20 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Latitude":"47.601183","Summary":"Observed on new years eve: two moving, orange orbs, one of which stopped and pulsated a brilliant white light","Country":"United States","Region":"Washington","Date of the Event":"12/31/2010 11:00 UTC","Case Number":"27247"}