{"Log Number":"US-01052011-0001","Tags":"City","Date Submitted":"01/05/2011 12:10 UTC","Longitude":"-122.202865","Sighting Duration":"00:10:00","divs":["Sighting DetailsI was sitting on our patio of our condo, which faces a green belt, drinking my morning tea, I thought I heard a muffled sound above and behind me and looked up to see a dark triangle low in the sky right over the trees of the green belt in front of me moving slowly in a SW direction It didn't make sense to me because as soon as I noticed it, it wasn't making any noise. It appeared to be gliding silently with one red light blinking at the front of the triangle and two steady white lights at the tips of the other two ends of the triangle. I really didn't know what to make of it. It was just a dark triangle against the somewhat dark sky. I watched it for a few seconds and then lost sight of it as it disappeared behind the trees in the distance. It was really only after I lost sight of it that it seemed to sink in that I had just seen something unusual. At that realization, I got up out of my chair, walked inside and immediately wrote down the time, the direction it was moving and drew a sketch of what I'd seen. I didn't have any particular feelings except that I remember thinking to myself, did this really just happen? I thought about waking my boyfriend but didn't. I just went about my morning routine getting ready for work. I pretty much forgot all about it till I came home from work and saw my drawing on the kitchen counter. Then I told my boyfriend and googled your site to make this report."],"City":"Kirkland","Object Features":"None","Latitude":"47.684958","Case Number":"27249","Viewing Distance":"21-100 Feet","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27249.html.txt","/var/www/straped/mufon/org/27249.html"],"Country":"United States","Weather Factors":"None","Summary":"silent triangle 2 white lights one red moving sw over trees","Object Shape":"Triangle","Date of the Event":"01/04/2011 06:10 UTC","Disposition":"Unknown","trends":["There have been 8 other sightings in Kirkland","There were no other sightings in Kirkland on or around January 4th 2011"],"Object Flight Path":"Straight-line path","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=47.684958,+-122.202865(27249)&iwloc=A&hl=en\"> mufon case (27249) map </A>"}