{"Disposition":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","Region":"Arizona","City":"Tucson","Country":"United States","Weather Factors":"None","Object Shape":"Cylinder, Star-like","Case Number":"27254","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Summary":"some sort of aircraft dropped two star like objects","map":"<A HREF = \"http://maps.google.com/maps?q=32.229173,+-110.916989(27254)&iwloc=A&hl=en\"> mufon case (27254) map </A>","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around January 4th 2011"],"Object Features":"None, Appendage(s), Other","divs":["Sighting DetailsI am visiting my sister here in Tucson and last evening comming home out on Tanque Verdie road west, \"hopefully spelled right\", we noticed what honestly looked like an airplane to me. It was comming straight at us at about 3000 ft, \"I am a pilot\". Suddenly, a relitivly bright \"star like object\" appeared to drop from it slowly. It was under control by someone or something as it stopped a few seconds, then headed west several seconds. It then quickly headed back east toward us in the truck, maintaining altitude. It was changing colors from red to white but in a twinkling \"star like fashion\" There was no place to pull over in the first few seconds, but we kept the object in sight. Then a second \"starlike\" object came out only this one was smaller. I got out and the \"plane or what ever\" passed over head. It was dark but I could see what looked like a long cylinder with very slim \"wings\" at the very back, there was no audible sound. It had two white lights on the front, and two red lights at the rear close together in the center. There are lots of aircraft with a rear set wing, but these wings were comming from the very back where the horizontal stabilizers are normally located, and appeared to be more like sticks than wings as they were very narrow. It did not have the normal marking lights of an airplane. No red light on the port wingtip, no green light on the starboard side, and no white light at the rear, just the two red lights close together. Having never seen anything like this before I was caught up in the moment and lost sight of the smaller object as it was like a far away star you almost had to look away from slightly to see. I had binoculars in the truck but by the time I got them out I could not find the first starlike object any longer and the people in the back seat were making jokes about my sister and I as we were the only ones who could see it from the from the front seat of the four door pick up. We were just a minute or two from home, and I again tried to re locate any part of what we saw, but could not. I just cant understand what or why an aircraft would release something like that."],"Date Submitted":"01/05/2011 12:17 UTC","files":["/var/www/straped/mufon/html2text/27254.html.txt","/var/www/straped/mufon/org/27254.html"],"Latitude":"32.229173","Log Number":"US-01052011-0006","Date of the Event":"01/04/2011 08:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-110.916989"}