{"Tags":"City","trends":["There have been 21 other sightings in Homestead","There were no other sightings in Homestead on or around January 3rd 2011"],"Viewing Distance":"20 Feet or Less","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"25.477852","Object Shape":"Sphere","Log Number":"US-01052011-0009","map":"<A HREF = \"http://maps.google.com/maps?q=25.477852,+-80.468757(27257)&iwloc=A&hl=en\"> mufon case (27257) map </A>","City":"Homestead","Region":"Florida","Weather Factors":"Unknown","Disposition":"Unknown","Source":"MUFON","Case Number":"27257","Object Flight Path":"Other","Summary":"Metalic glowing sphere touching ground in my back yard.","Date Submitted":"01/05/2011 05:27 UTC","files":["/var/www/straped/mufon/html2text/27257.html.txt","/var/www/straped/mufon/org/27257.html"],"divs":["Sighting DetailsOn Jnuary 2nd 2011 at approximately 18:20 (6:20 pm) hours while arriving from a holiday weekend at my home at Homestead, FL; As I opened the rear slydind door to let my two large security dogs out, I observed as a glowing metalic sphere shooted out into the sky from my back yard. It went upwards as soon as I opened the sliding rear door and the dogs went out barking.With no sound bolted upwards until reaching cloud cover and made a 90degree angle heading west in a very high rated speed until I could not see it no more into the sky. On the ground I noticed two circular marks on the grass itself. Marks are sort of circular burned patches on the ground with a white powdery ash. I am a State of Florida law enforcement officer and a retired ARMY Infantryman. I have seen it all in the civilian life as well as in combat; and there is nothing like I have seen before. I have contacted a dear personal friend who is a retired AIR FORCE Commander and he said to contact MUFON before anyone else. This is my second sighting in two years and the closest one of all. From skeptic to beleiver in two years."],"Date of the Event":"01/03/2011 06:20 UTC","Object Features":"None","Longitude":"-80.468757"}