{"Date of the Event":"01/05/2011 08:40 UTC","divs":["Sighting DetailsI was standing in my kitchen facing east, talking with girlfriend and another couple over visiting. I feel and hear the humming sound go over my head heading east, im boggled, visiting girl suggests fighter planes, then i dont buy it. Run to front window (still humming noise loudly) and catch grayscale ship coloring underneath, white lighting on edges in 3-4 spots, solid and blinking, no other colors. Though star trek enterprise with the main part only, but a couple hundred feet wide thats all. Huge though. Large craft approx 150-250ft wide if i had to guess, floated over my house heading Northeast, low altitude, 1000ft maybe ? At the highest. Then raised a little higher, made a swooping sideways left turn, could tell it was round or square shape, and headed north over the ridge out of sight. The largest and most convincing sighting ive had. I've seen small ones around here and there but this was insane. Several other small odd lights in the sky, but they are there often.. Hoping someone else sees of hears this thing, it was like a humming slash boat horn, very low alt, never seen anything like it. No time to go find camera i was speechless after i looked out the window, yelled for them to follow and ran outside as it had just passed overhead and was crossing my street."],"Weather Factors":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/27264.html.txt","/var/www/straped/mufon/org/27264.html"],"Tags":"City","Object Flight Path":"Path with directional change","trends":["There have been 2 other sightings in Washingtonville","There were no other sightings in Washingtonville on or around January 5th 2011"],"Region":"New York","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"41.433952","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.433952,+-74.15898(27264)&iwloc=A&hl=en\"> mufon case (27264) map </A>","Object Features":"Patterned Surface","Summary":"Vibrates over house, 150ft wide, slowly moving, passes over me then heads north, 5 min from Stewart Airport, not a plane","Date Submitted":"01/05/2011 10:29 UTC","City":"Washingtonville","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-74.15898","Object Shape":"Triangle","Case Number":"27264","Log Number":"US-01052011-0016"}