{"Sighting Duration":"Undisclosed","Log Number":"US-01052011-0017","Date of the Event":"01/05/2011 09:00 UTC","Object Flight Path":"Unknown","Country":"United States","Object Shape":"Flash","Tags":"City","Summary":"Extremely bright flashing light that seemed to have three flash points seen on the county road that has never been there before and disappeared in thin air.","Disposition":"IFO","trends":["There have been 5 other sightings in Goldthwaite","There were no other sightings in Goldthwaite on or around January 5th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.449886,+-98.570876(27265)&iwloc=A&hl=en\"> mufon case (27265) map </A>","divs":["Sighting DetailsI was driving on Hwy 183 South exiting Goldthwaite when I topped a hill leaving the city limits. I was talking to my son on the cell phone when he said he saw something strange down our county road towards our house. It was a very bright flashing white light. When he said that I looked out my pickup window to the right and saw the light too from where I was on the highway but as I went down the hill I lost sight of it. He said it was still in front of him and flashing slowly. I made him stop on the dirt road because he believed it to be not even a half of a mile ahead of him. I turned right on county road 411 and saw the flashing light again. It looked to be less than a mile away. My son was in his pickup two vehicles ahead of me, my husband was in his pickup between us as we headed down the dirt road toward the house. I was still talking to my son about the light and how it was flashing strangely like it had three different flash points. The light would flash from left to right and then start at the left again. As we were driving down the road we watched it about a mile and a half down the road. It didn't move as if it were going up and down the hills of the road, in fact it did not appear to be moving forward on the ground. We never got any closer to it but it never really got any further away. I mean like the size of the light never seemed to get smaller or fade. And then it was gone. I thought I had lost sight of it due to the hills and valleys in the road. But when I topped the hill again where I knew I could see it, it was no where in sight. If it had been an ordinary vehicle, I would have seen it from the top of the hill. If it had been an airplane we would not have lost sight of it because it would have still been in the air. As fas as I can tell it just disappeared."],"Latitude":"31.449886","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-98.570876","Source":"MUFON","Date Submitted":"01/05/2011 11:03 UTC","files":["/var/www/straped/mufon/html2text/27265.html.txt","/var/www/straped/mufon/org/27265.html"],"City":"Goldthwaite","Case Number":"27265","Object Features":"Unknown","Weather Factors":"None","Region":"Texas"}