{"map":"<A HREF = \"http://maps.google.com/maps?q=30.426609,+-87.214845(2726)&iwloc=A&hl=en\"> mufon case (2726) map </A>","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around December 6th 2003"],"Disposition":"Unresolved","Case Number":"2726","Date Submitted":"12/06/2003 12:00 UTC","Weather Factors":"Windy","Latitude":"30.426609","Object Features":"Other","files":["/var/www/straped/mufon/html2text/2726.html.txt","/var/www/straped/mufon/org/2726.html"],"Longitude":"-87.214845","Date of the Event":"12/06/2003 12:00 UTC","Summary":"Large Bright Blueish-White Light Rising at Interse","Source":"MUFON","Country":"United States","Log Number":"","City":"Pensacola","Object Flight Path":"Unknown","Sighting Duration":"00:00:59","Region":"Florida","Tags":"City","divs":["Sighting DetailsIt was around 10 pm in Pensacola. We were going through a green light at anintersection from Pine Forest Road and bearing left onto Mobile Highway.Shortly after getting through the intersection which only had a couple carswaiting for the light to change sitting perpendicular to us we saw a small lightbehind trees that were a few hundred feet behind the lights rise up straightwith no wobble. I immediately thought it was a helicopter and was not notworried but within seconds literally it rose up above the trees maybe as littleas 50 feet and an intense whitish-blue light that was large in diameter shoneinto our mirrors. We never actually looked back but were very aware this wasnt acar as it isnt near a highway or close to an airport and there werent any carsbehind us going through the intersection. It was obvious to me that I hadnt seenanything like it before. The light was only visible for 5 seconds Id say. Thenit disappeared and at that point my brother and I both acknowledged seeing itand wondering what the hell it was. This is all in a short amount of time and weare still quite close to the intersection. I have no idea if my brother was evenwatching the road or if the radio was on or if the headlights dimmed. But, theoddest part about this is that almost immediately after we confirmed seeing thelight to eachother, I saw the traffic lights blinking red to green to yellow, onand on. Not necessarily in that order but it was only for about 10 seconds andit went back to normal like nothing had happened. We opened the windows andheard nothing. I did notice a car at the light that did not move during thisperiod. We didnt want to just forget about it so we turned around and went backthe way we came watching for anything mysterious. We saw and heard nothing. Weare not sci-fi buffs and are not going to be fooled into thinking it was a veryquiet helicopter, if it were we would have heard something. I dont know if thismatters but I mentioned it to a friend online and he said that he has seenlights many times at night and he has been in FL his whole life. He saidPensacola and Gulf Breeze are known for ufo sightings. Please let me knowwhatever you can related to the information I gave you, and sorry I dont knowdirectional stuff well so I didnt fill in those sections. Thanks."],"Object Shape":"Other"}