{"Disposition":"IFO","Object Shape":"Cigar, Disc, Other","Date Submitted":"01/06/2011 12:43 UTC","Log Number":"US-01062011-0003","Weather Factors":"Unknown","City":"New York","Tags":"City","files":["/var/www/straped/mufon/html2text/27268.html.txt","/var/www/straped/mufon/more/27268_submitter_file1__DSC02227(3)-Copy.jpg","/var/www/straped/mufon/org/27268.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.718443,+-73.998913(27268)&iwloc=A&hl=en\"> mufon case (27268) map </A>","Longitude":"-73.998913","divs":["sighting detailson the morning of july 29, 2007 me and my family went to visit the empire state building in new york, ny. first we went to the observatory on the 86th floor, there i take lots of pictures, then decided to raise to the floor 102, there a friend asked me to take her picture, i taken the picture and left the building. when i get home i went to see the photos of that day and when i see the picture of my friend on the 102th floor, i was surprised when i see a serie of strange lights that, when i zoomed in i can see these lights have square shape as windows. i thought it was a reflection of some light, but at the small observatory there was no light that looked like what it saw in the photo. when i went back to venezuela i lost the memory stick of my camera but yesterday i found it in my old suitcase so today i write this. is weird because when i was at the empire state we didn't see those lights but in the picture the lights can be seen perfectly. - i dont speak english so i used a translate software to write this, sorry if this text have errors. i attach the photo of the object, if anyone want additional information, the original photo or the other pictures taken that day contact me: *(wit's email address deleted -- cms\\sg). this is the 2nd time i make this report because the first time i make it the image didnt upload because it have a virus. i make a antivirus scan on it and it does not have any virus, i change the name of the file to trie a second time to upload the picture, if it doestn upload follow this link to watch the photo: (link moved to additional evidence section--cms\\sg)."],"Source":"MUFON","Latitude":"40.718443","Region":"New York","Sighting Duration":"00:00:01","Object Flight Path":"Undisclosed","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around July 29th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Summary":"A picture taken from the empire state show strange ligths","Country":"United States","Case Number":"27268","Date of the Event":"07/29/2007 04:00 UTC","Object Features":"Undisclosed"}