{"Date of the Event":"01/03/2011 02:00 UTC","Object Shape":"Triangle","Weather Factors":"None","Object Features":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-01052011-0013","Latitude":"34.949259","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.949259,+-83.757395(27261)&iwloc=A&hl=en\"> mufon case (27261) map </A>","Summary":"V SHAPED OR INVERTED TRIANGLE HOVERED ABOVE N. GA MOUNTAINS LIGHTS FLASHING","Tags":"City","Source":"MUFON","Longitude":"-83.757395","trends":["There have been no other sightings in Hiawassee","This sighting has been favorited 1 time."],"Region":"Georgia","Case Number":"27261","files":["/var/www/straped/mufon/html2text/27261.html.txt","/var/www/straped/mufon/org/27261.html"],"divs":["sighting detailsjan 3 2011 i was lying in bed and could not sleep.as i looked out my window on 2 nd story.i saw a bright shining something shaped like a v something and sometimes like an l,so rolled over and tried to sleep,couuld not sleep.i got up opened the window to hear if was a helicopter,no sound.was hovering in same place for 45 mins to hour this was 2 a.m.lights where bright white w blueish tint would flash and run in sequence.it would move left to right quickly then hover then would up and down.when i first seen it thought was a star or airplane.there was no air traffic that nite and the skies were clear.never seen any aircraft move live that!then it moved north a little and to the rightand goes thru same motions.as i viewed this was interesting and thought if ican see them they can see me?then it seemed to come closer then move away.but i had a sense of peace and slept well.oh ,what i would of give for a video camera.so,after watching as long as i could i went to sleep.dont know how it left?i was tryin to stay awake to see but could not.i did see look like 2 falling stars or flases of orangeish lights thank you, *(wit's name deleted -- cms\\sg). ps:dont drink,smoke or do drugs!"],"City":"Hiawassee","Date Submitted":"01/05/2011 09:04 UTC","Disposition":"IFO","Object Flight Path":"Hovering then path,Straight-line path","Country":"United States"}