{"Longitude":"-83.152582","Case Number":"27273","Region":"Ohio","Date of the Event":"11/16/2010 04:30 UTC","Object Features":"Undisclosed","divs":["sighting detailsobject was filmed around 4:39 am to the best i can ascertain. i don't remember shooting this video but it was found in my video cam just after another video of another strange light i shot video of just prior. i did go outside my front door and film the other object but not sure what happened to get this footage accidently. i have no memory of taking footage or of seeing the object that is clearly very close to the camera a few hundred feet away it appears appearing to be close to the ground. looks like the settings on my video camera very changed here too since you cant see the houses across the street at the end of my court. it all boggles me, but can clearly see the object and to the left of the video. can see the neighbors front door to the right and what appears to be the street light at the end of the court in the middle. i posted this object and made the report only because it appears to be very similar to the sighting report someone posted her on 1\\4\\11 from cleveland, ohio"],"Latitude":"39.922128","Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=39.922128,+-83.152582(27273)&iwloc=A&hl=en\"> mufon case (27273) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","City":"Galloway","Disposition":"Unknown","Object Shape":"Unknown","trends":["There have been 4 other sightings in Galloway","There were no other sightings in Galloway on or around November 16th 2010","This sighting has never been favorited.",""],"Country":"United States","Object Flight Path":"Undisclosed","Date Submitted":"01/06/2011 11:43 UTC","Log Number":"US-01062011-0008","files":["/var/www/straped/mufon/html2text/27273.html.txt","/var/www/straped/mufon/org/27273.html"],"Summary":"strange object with four colored pulsating lights- similar to 1/4/11Cleveland, 0hio object","Source":"MUFON"}