{"trends":["There have been 10 other sightings in Richmond","There were no other sightings in Richmond on or around November 30th 1981"],"Summary":"shiny metalic looking,looked like windows lit,spinnig slowly,could see each window,made no noise,seem to put out a vibration or hum","files":["/var/www/straped/mufon/html2text/27279.html.txt","/var/www/straped/mufon/org/27279.html"],"Date of the Event":"11/30/1981 12:00 UTC","Object Shape":"Disc","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsI was sitting watching tv as my mother got a phone call,she seemed to be urgent when she told me to help her look for something outside. As we went outside I said what are we looking for and she said her sister,my aunt, just got off work and was wondering if she was seeing things or what and wanted us to look up in the air and see if we could see the same thing she was seeing since it was right across the street from our house,about 20 feet. So when I initially looked up,while standing in our front yard,I seen nothing and since my mother couldnt see it either ,she replied we dont see anything. My aunt evidently was still insisting on us to look more cause she knew she wasnt crazy and was lookin right at it almost above our house,but towards the other side of the street about 10-20 feet. So since there was a big tree in our front yard at the street I walked under it and went I got to the street and looked up, MY GOD I said, look moma look!here it is here it is. My mom said were are you looking as she walked towards me next to the street,and then she seen it,oh my god Louda,she replied to my aunt, I dont know what that is,then I think my aunt said on the phone,I knew I wasnt crazy,what do think that is. From that point on I couldnt get my eyes off of it as it just hovered in mid air with no noise and spinning rather slowly,it had no wabble at all and was the picture perfect ufo.I will never forget this ,I thought, as I was watching it,slowly I started to watch the windows on the craft because they looked to be different in shape all the sudden,but I didnt notice the different shapes of the windows at first at all for either being startled or maybe they wasnt different at first,I really dont know. As I was watching the windows all the sudden I started making out letters,these windows say (TEXACO FOUND OIL) as the craft spins. What in the world I thought,mom can you read what the windows say as that thing spins, she says she never could but I know what I read on those windows. Then this perfectly shaped ufo starts to go towards our local dirt track that we can see the from our house and when it got close to the race track you should have heard the roar of the people over there. It was like AAHHHHHH, but very loud for us to hear them from our house. When it got to the race track its like it was checking things out since it just hovered there for a while,like it did at our house, and then finally starting back going north at a very slow rate of speed. After it got quite a piece from our house and we couldnt make it out anymore we went back in the house. It was for sure being controlled because of its actions,like stopping at our house, then easing over to the racetrack and stopping, then taking back off again. all in all, I still to this day have never found out how this thing hovered in one spot,spinning,with no noise,and definetly looked very shiny,metallic metal of some sort,and if it was, it must have been somewhat heavy. Plenty of people seen this thing but I never heard anything else about it. Ive always wondered, if Texaco found oil,why would they send a perfectly looking UFO to my house to let me, and the people down my street, know that they found some oil, doesnt make any sense to me but what do I know about Texaco and there advertising if thats what is really was,then so be it,but it seems to me like that would be a waste just to let people know.!"],"Source":"MUFON","Latitude":"37.747857","Country":"United States","Object Features":"Dome, Window(s)","Case Number":"27279","map":"<A HREF = \"http://maps.google.com/maps?q=37.747857,+-84.294654(27279)&iwloc=A&hl=en\"> mufon case (27279) map </A>","Sighting Duration":"00:15:00","Date Submitted":"01/06/2011 06:28 UTC","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"Kentucky","Weather Factors":"Unknown","Longitude":"-84.294654","City":"Richmond","Disposition":"IFO","Log Number":"US-01062011-0013"}