{"trends":["There have been 16 other sightings in Saskatoon","There were no other sightings in Saskatoon on or around January 6th 2011"],"divs":["Sighting DetailsI was outside smoking and waiting for my friend to come outside. I was standing by my car when i looked up and suddenly i saw a flash of light. It looked like a flying ruler but enormous. It seemed to be passing by the earth faster than the speed of light because it appeared then just as fast it disappeared. It was dark out so when it appeared the lights were vivid, two round lights and what could have been a row of other lights but it moved so fast they appeared to be a solid line. I just happened to be looking up there, no real reason. I rationalized that it was some space gases, satellite, plane, etc...no of which fit with the size,speed, or shape. It appeared and disappeared so fast it didnt occur to me what was happening. After I felt excited, and a bit scared that I saw it, I could live with not knowing because the thought of some other species having the capabilities to design and build something like that leads me to believe that they also have weaponry and intelligence to match. I just hope they aren't destructive like humans. The object just disappeared into the dark morning sky, the same way it appeared, super fast and mysteriously."],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Case Number":"27275","Latitude":"52.13549","Log Number":"CA-01062011-0010","Object Flight Path":"Straight-line path,Path with directional change","Region":"Saskatchewan","Date of the Event":"01/06/2011 07:28 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27275.html.txt","/var/www/straped/mufon/org/27275.html"],"City":"Saskatoon","map":"<A HREF = \"http://maps.google.com/maps?q=52.13549,+-106.642756(27275)&iwloc=A&hl=en\"> mufon case (27275) map </A>","Object Shape":"Flash, Square, Rectagular","Summary":"Moved fast, was rectangular, huge, black, had 2 lights visible, on either end. maybe more but moved so fast were blurred","Date Submitted":"01/06/2011 12:52 UTC","Country":"Canada","Weather Factors":"None","Longitude":"-106.642756"}