{"Viewing Distance":"Unknown","Log Number":"US-01062011-0018","Country":"United States","Sighting Duration":"Undisclosed","Region":"Missouri","Weather Factors":"Unknown","City":"Buffalo","Case Number":"27285","Longitude":"-93.092409","Disposition":"Unknown","Object Flight Path":"Undisclosed","Date of the Event":"01/06/2011 08:15 UTC","Source":"MUFON","Tags":"City","Summary":"Red light thought it was aircraft landing light at first.","map":"<A HREF = \"http://maps.google.com/maps?q=37.643929,+-93.092409(27285)&iwloc=A&hl=en\"> mufon case (27285) map </A>","files":["/var/www/straped/mufon/html2text/27285.html.txt","/var/www/straped/mufon/org/27285.html"],"divs":["Sighting Details It was a clear night i was out looking at the stars there was a lot af air traffic.I was looking to the nnw and i saw what i thought was a airplane turned on its landing light theres no airports within 25 miles in any direction the light looked like it was about 4 or 5 miles im just guessing at the distance it looked like a landing light when it first came on only it kept getting brighter and turned a very bright red there was kind of a hazy glow like it was shining through a lite cloud layer only i hadnt noticed any cloud layer that i could see.very clear conditions some clouds way off to the north but nothing in this immediate area of the light.It stayed very bright for a few seconds maybe 3 or4 then started to dim down and went out.I was expecting to see red and green nav. lights but the sky was just black except for stars and airplanes with their strobes and nav.lights in tne distance nothing in the same area as the light.I was kinda puzzled and went back in and told my wife that i had seen something odd in the sky.Then i went back out and continued watching tje sky in the same area after about 5 minutes the same light in the same area of the sky i estimate that it was probably about 1500to2000 altitude it lasted about 4or5 seconds went out again i continued to watch the sky in the same area it happened again after a few minutes.Then i continued to watch for about 20 minutes.Ive watched the sky here for quite awhile ive watched sattelites every clear night,ive seen all kinds of aircraft from helicopters to jets at all levels.piston engine aircraft flying low and slow.Ive never saw anything that lookedlike this,it was in the same location all three times i saw it there was no sound the airplanes were all at higher levels and far enough away that i couldnt hear them."],"Date Submitted":"01/06/2011 10:27 UTC","Object Features":"Undisclosed","Object Shape":"Unknown","Latitude":"37.643929","trends":["There have been no other sightings in Buffalo","This sighting has never been favorited."]}