{"Date Submitted":"01/06/2011 09:29 UTC","Date of the Event":"06/01/2009 01:00 UTC","Summary":"UFO seen over gulf moving at high speeds and coming out of and going back into the water","Object Features":"Dome, Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","divs":["Sighting DetailsNot sure on the exact date, it was a last minute trip to the beach with some school friends who had just graduated so it was around June. It started I was walking down the beach with a friend when the object caught my eye against the dark night sky because their were no other lights out over the gulf. The craft seemed to come from the water but was most deffinately in the sky now, both of us are now focused on the object hovering what seemed to be 1000 ft above the surface. We were both in immediate agreeance in what it was and an odd state of calmness came over us as we watched with complete fearlessness, considering the circumstances. we continued to observe the vehicle fly at incredible speeds with no sound what so ever, fly east, taking off slow and then was instantly at the farthest end of the beach we could see then shot straight up into the sky and then shot passed us to the west. After watching it for about five minutes or more I'm not sure for some reason it's hard to remember how long we stood there but it eventually came back down close to where we first seen it and it seemed to fall onto the water then disapear either into the water or over the horizon but it seemed to go into the water since the lights on it were still the same size.I remember after it was gone related or not, the wind all of a sudden was blowing very hard and a small shower came over and lasted for about 10 minutes. The lights on it were in a circular pattern around the craft then one on top and one on bottom, so it wasn't a shape I could see except for the lights leading me to think or under the illusion that it was a saucer shape with a bulb on top and bottom or kinda like the shape of a planet with ring's silohoutte. The colors of the lights were different but I can't remember the colors but I know their was Atleast three different colors because the light on top and bottom was red and the lights around it are the ones I can't remember what color they were. Blue, green, and white are colors that come to mind but alot of confusion comes to mind when I think about those lights and it's been a couple of years and it was never a big deal to us that we seen it for some reason we have both been very calm about the whole ordeal. After the craft was gone we continued down the beach talking about it completely calm as if we had seen it thousands of times but it was the first time for either of us to have seen anything like that. I've always believed that the possibility of life evolving on other planets was possible I never thought I would actually witness something like this,not that I'm saying this came from another planet but I am saying I have never seen anything manuver like this before. I know what I seen and so does my friend. I still call him every now and again to ask him if he really seen it to just to make sure I'm not crazy. So Im either a crazy who hullucinated Just once in my life seen something at the same exact time as someone standing right beside me that just so happen to hullucinate the very same shape and assortment of colors as I did and we are both just crazy or it was real. IT WAS REAL. Everyone I have told has said I was High or that I'm crazy or think we were joking trying to get a laugh out of everyone but my story hasn't changed and it never will. I seen a UFO, alien or secret military technology don't know."],"Weather Factors":"Windy, Rain","map":"<A HREF = \"http://maps.google.com/maps?q=30.160223,+-85.653666(27284)&iwloc=A&hl=en\"> mufon case (27284) map </A>","Longitude":"-85.653666","trends":["There have been 19 other sightings in Panama City","There were no other sightings in Panama City on or around June 1st 2009"],"Disposition":"Insufficient Data","Tags":"City","Country":"United States","City":"Panama City","Region":"Florida","files":["/var/www/straped/mufon/html2text/27284.html.txt","/var/www/straped/mufon/org/27284.html"],"Case Number":"27284","Latitude":"30.160223","Log Number":"US-01062011-0017","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Shape":"Disc, Saturn-like"}