{"files":["/var/www/straped/mufon/html2text/27280.html.txt","/var/www/straped/mufon/org/27280.html"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-116.202386","divs":["Sighting DetailsI live in Boise, ID and walk approximately four miles home from work every night. Since about November 11, 2009 I have seen stars engaged in markedly non-star-like activities every single night that I have have walked home from work in the dark. My walk home takes about an hour so I get quite a bit of time to observe the night sky. I have routinely witnessed \"stars\" change color rapidly (from blue to red to green to orange, etc.) as well as change size rapidly. I have watched \"stars\" go out completely only to reappear several seconds or even minutes later. In the Boise night sky, I have witnessed up to 13 of these anomolous \"stars\" in a given evening all over the sky in every direction. There are approximately 7 of them that are reliably present every single night. These \"stars\" of which I speak are quite obviously not like the rest of the actual stars in the sky. As a result of spending so much time observing the night sky, I have done quite a bit of studying to satisfy my curiousity about these bizarre star-like satelites (I assume they must be satelites of some sort...man-made or otherwise.) and have learned a great deal about astronomy in general as a result. Less than two months ago, while walking home, I observed two of the \"stars\" in Orion's belt not only change size, intensity and color (seemingly in response to one another), but they actually at one point they quickly swooped around each other! Even after becoming accustomed to seeing these \"flashers\" as I call them, seeing that caused me to drop the coffee I was holding onto the sidewalk and stare, mouth agape for at least a full five minutes. I hold a master's degree in engineering and have worked for the government since I finished graduate school five years ago. I am quite sane and completely at a loss as to what these \"flashers\" imitating actual stars are up to. These \"flasher\"-satelites, if they are indeed man-made, do not behave like ANY publicly known man-made satelites. To my knowledge, no government on Earth has created a satelite that can not only mimmick actual stars but travel in a quick, agile and independent manner. So Maryland witness, what I am saying here is that you are not alone:)"],"Latitude":"43.617801","Object Features":"Undisclosed","Region":"Idaho","Disposition":"Insufficient Data","Tags":"City","Log Number":"US-01062011-0014","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.617801,+-116.202386(27280)&iwloc=A&hl=en\"> mufon case (27280) map </A>","Case Number":"27280","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around January 6th 2011"],"Sighting Duration":"Undisclosed","Object Shape":"Star-like","Summary":"Response to MD 1/5/2011 report. I have also seen them every night since Nov. 2009.","Date of the Event":"01/06/2011 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"01/06/2011 06:29 UTC","City":"Boise"}