{"Sighting Duration":"Undisclosed","Date of the Event":"06/13/1979 12:00 UTC","Source":"MUFON","Country":"United States","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=30.60178,+-87.155121(27282)&iwloc=A&hl=en\"> mufon case (27282) map </A>","Viewing Distance":"21-100 Feet","Object Shape":"Cigar","Summary":"Cigar shaped object observed hovering over highway, put spotlight on our car, made no sound","Latitude":"30.60178","Case Number":"27282","Date Submitted":"01/06/2011 08:06 UTC","Tags":"City","Disposition":"Insufficient Data","divs":["Sighting DetailsMy then boyfriend, now husband and I were traveling West on Hwy 90 just outside of Pace, Florida. It was about 9:00 pm on a Friday night, clear weather conditions, 4 lane highway with tall pines to the South and a clearing to the right as the causeway was approaching. No buildings in this rural area, no street light that I recall but there may have been some spaced very far apart. There was very light traffic. As we came down a small incline and approached the straight-a-way I noticed 2 lights hovering above the highway, about 2 miles ahead. They were white and a little brighter and larger than car head-lights. I asked my boyfriend what the lights were and he said it looked like a small plane's wing lights. Perhaps it was trying to land on the highway. As we drew closer I noticed the object seemed suspended above our side of the highway, about 100 feet in the air. It wasn't moving at all. The lights appeared to be on either end of the hovering object. We slowed down wondering what the object could be. There was a car coming in the opposite direction who was going at normal speed (probably 50 mph) seemingly not to notice the object. When our car was about 100 ft from the object a bright spotlight came from one end and shined on our car for about 2-3 seconds. It was not blinding, but bright. We slowed down on our approach, I rolled down my window and stuck my head out to have a look. The object was not very large, maybe as long as 2 semi trucks and about 20 feet wide. I could not see any details, only a dark shape above me. We pulled off to the side of the road immediately and so did the truck behind us. The car that had been going East-bound continued without slowing down at all. The two of us got out of our car and the 3 occupants in the truck got out as well (2 men and a woman) \"What the hell was that!\" One guy said to us. We all stood looking at the hovering object. It made no sound at all. We observed it for a few minutes then it rose vertically a few hundred feet and moved away, very smoothly, South East. We watched it until the trees blocked our view. It was not in a hurry, it did not make any sound, it did not move like a blimp, a helicopter or a plane. There wasn't much converstation between the 5 of us. I think we were all a little bewildered. One of the men said, \"We won't tell if you won't!\" We all laughed and got in our vehicles. When we arrived to our destination about 20 minutes later we called the Pensacola Naval Air Station to see if anyone had reported anything unusual. They said no. The next day there were no reports on the news or in the paper. The only difference my husband recalls in my recollection is that the lights were red, not white."],"Region":"Florida","trends":["There have been 4 other sightings in Pace","There were no other sightings in Pace on or around June 13th 1979"],"Log Number":"US-01062011-0015","Weather Factors":"Unknown","Longitude":"-87.155121","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/27282.html.txt","/var/www/straped/mufon/org/27282.html"],"City":"Pace"}