{"Summary":"Possible alien abduction vs intense dream??","map":"<A HREF = \"http://maps.google.com/maps?q=44.55201,+-69.631712(27292)&iwloc=A&hl=en\"> mufon case (27292) map </A>","City":"Waterville","divs":["Sighting DetailsHello. I used to live in Phoenix,Arizona a few(2)years back and had atleast 4 episodes of seeing UFO's, one episode was followed by missing time for about 6 hours, and another time I awoke with my hair a huge tangled mess like I've never seen my fine hair before or since. I have already reported those events on this website before. It has been 2 years now since I have seen anything in the sky or had any events. I moved to Maine 2 years ago, and unfortuantely, nothing. Nothing until last night when i had the most intense dream of all my life. I dreamt that I was back in Arizona and was ( with a number of other people) taken away after a whirlwind and me running to hide in the closet where i was praying as if it were the end of the world or my life. And i am an atheist! Anyway, I was taken to this intermediate station where I was being evaluated by some aliens that looked liked human sized embryo's in suits. They had something attached to my mouth for breathing. They asked me if I smoked cigarretes and proceeded to have me smoke on through this ectoplasm like attachment to my mouth. They were also evaluating my body and seemed to be communicating something about my foot. Now, I have an infection in my R great toe ever since I slammed my foot in a door many years ago. I will either have to remove my nail or be stuck with this nasty fungal infection for life. Moving on, I was brought to what appeared to be a different galaxy. There were millions of people there. I felt my body was very heavy and I was quite cold. They first greeted me by showing me this hand signal that my hands could not replicate. I kept on asking questions about God and the afterlife, and if I would ever see my family again, etc..They told me the Biblical God was not true. they asked me if they could pick up my mother the following day, but i explained to them that my mother was a religious woman, and would be frightened by the experience. They gave me something to drink, but i apparently drank too much of it and they had to keep me longer for observation. I looked at my hands and they looked frostbit. I walked around this new galaxy which seemed to have housing installations that were similar to our own, yet they had a sort of flexibility about them that i can not explain. And everything was moving very fast. I was taken back to the original examining room where I asked them when they would be back, and they said in 2007. I awoke feeling like I had just emerged from anesthesia, and my whole body was tingling for about an hour afterwards. I kept feeling the skin on my face because my skin seemed to be absent in space or just felt different. I can't explain it. I quickly reasoned that 2007 was backward in time, and convinced myself this was just a very, very intense dream. I was quite shaken up by it and looked and saw that my window was open in the dead of winter! I don't know what to make of all of this. I used to have contact with UFO's in Az as I had said before. But this is the first time in Maine that anything like this has happened. A dream vs virtual reality?? I don't know. It really shook me up."],"Latitude":"44.55201","Longitude":"-69.631712","Source":"MUFON","Case Number":"27292","Country":"United States","Viewing Distance":"Unknown","trends":["There has been one other sighting in Waterville","There were no other sightings in Waterville on or around January 7th 2011"],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/27292.html.txt","/var/www/straped/mufon/org/27292.html"],"Region":"Maine","Log Number":"US-01072011-0005","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Other","Tags":"City","Date Submitted":"01/07/2011 12:25 UTC","Date of the Event":"01/07/2011 12:00 UTC"}