{"Log Number":"US-01082011-0001","Object Flight Path":"Undisclosed","Longitude":"-122.766936","map":"<A HREF = \"http://maps.google.com/maps?q=45.304662,+-122.766936(27297)&iwloc=A&hl=en\"> mufon case (27297) map </A>","divs":["Sighting Detailsi was coming out of my grandmas after family get togather everyone still inside but me an my brother, i open back door on car to get in, my brother pushed me out of way and jumped in seat ,it was a first kinda thing. Thats when i saw it, filled the sky, a got scared an set in the car an shut door, i watched as it flew over me, in some areas i was able to see stars between some parts, if thats what u would call them, i say two attached ships of mayb a mile width or more, and in a docking type of set up, sorry back to event, it went over the top of the car at an angle, i still to this day dont know why i didnt scream, i just started wanting to see more , i turn my head to see it come across other, but didnt ,i asked james did u see it, he said what? i jumped out to look and it was gone, try to tell parents they just kept talking adult talk, my grandma was the only person that even beleive me,that was the start years ive hunted my whale, no signs pictures nothing, all these disc an triagles, at times i would think dude ur nuts, no one else has seen this ,no one talks about what i saw,but as u hav heard bfor these things wont let u forget, i know that boat as well as my moms own face, it was there, so brings me to u and why now, i found it after all this time, now i can show u the piture an show u whats missing off boat in picture, boat is another name for ship to me sorry, u guys will find ship fantasic. To much time gone by for much else, but if ur like me an love science, all things reveloent, p.s they want me to talk bout what thought it was when first saw, no other words come to mind than wrong,not suppose to b there.then felt fear but like the kind u dont want to take ur eyes off for many reasons"],"Source":"MUFON","Date Submitted":"01/08/2011 12:05 UTC","Disposition":"Insufficient Data","Tags":"City","Country":"United States","City":"Wilsonville","Object Shape":"Other","trends":["There have been 2 other sightings in Wilsonville","There were no other sightings in Wilsonville on or around July 31st 1972"],"Object Features":"Appendage(s)","Case Number":"27297","Latitude":"45.304662","Summary":"flew right over the top of me, hugh filled sky. No sound ,life changer, still we cant hold anything that big in sky","Sighting Duration":"Undisclosed","Date of the Event":"07/31/1972 12:00 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27297.html.txt","/var/www/straped/mufon/org/27297.html"],"Weather Factors":"Unknown","Region":"Oregon"}