{"Case Number":"27293","Region":"New Jersey","Source":"MUFON","Object Shape":"Oval, Other, Unknown","Sighting Duration":"00:00:01","files":["/var/www/straped/mufon/html2text/27293.html.txt","/var/www/straped/mufon/org/27293.html"],"Weather Factors":"None","Viewing Distance":"Unknown","Disposition":"Unknown","City":"Trenton","map":"<A HREF = \"http://maps.google.com/maps?q=40.218183,+-74.733038(27293)&iwloc=A&hl=en\"> mufon case (27293) map </A>","Latitude":"40.218183","Date Submitted":"01/07/2011 01:23 UTC","Tags":"City","Summary":"Gutteral speeded up voice in unknown dialect heard on walkie-talkie","Object Features":"Undisclosed","divs":["Sighting DetailsI am a retired law enforcement officer with more than 25 years experience with radios, communications, and use of of walkie talkies. While working a security detail on 1-7-11 at approximately 1010 hours PM I and another coworker at the base station overheard a brief, loud and clear voice come across our frequency. This was not bleed over, skip, or outside cell phone or other form of interference. It seemed louder and stronger than our power output. I am very familiar with many different languages, and I can say with certainty...and it really creeps me out to say this, it did not sound human. There was a gutteral vowel and consonant pattern spoken at a slighly higher pitch and speed than common human language. It was erie and unintelligable. This exchange took place when I called in a spot check over the walkie to the base station. The base station replied back to me. I heard approximately 5-6 \"words\" between a brief one-two second period of time a fraction of a second immediately after I was acknowledged to by the base station. This communication I perceived to be a either a mocking or mimicking of the base station message because it seemed to contain the same amount of phonetic groupings and cadence as was broadcasted to me. The signal was crystal clear and it boomed over the frequency, stronger than the normal signal strength. I was really taken back by it, I remember saying to myself \"what the h--- was that!!!\" out loud to myself. I was approximately 100 yards away and outside from the base station. It was cloudy with high humidity because of the winter storm closing in, temperature about 29 degrees. In all my years of experience I have never heard anything like that over the air, as stated ealier I have heard many different forms of bleed over transmissions, but it was in clear human language. This voice sounded somewhat similar to that of a young adult female, but like 60 % similar, a mix between genders is all I add to it. I went into see the base operator immediately afterward and they said it sounded like a female over the radio. There was a female security officer working but I knew from what I clearly overheard that it was not her. The operator called the female and inquired about the transmission and she stated negative on any recent transmissions. I saw or heard nothing else unusual as I looked around outside immediately after this happened. Several other security personnel working farther away on the premises heard nothing unusual, including the female. Only myslef and the base operator heard this unexplainable transmission. Of any past experiences with unexplained phenomina I have had a pre-dawn clear sky sighting in my youth in 1974 of a dime sized held at arms length object that was a bright white oval shape. When I was walking outside to deliver newspapers I saw it motionless at around 45 degrees to the horizon in the air, motionless. After about 2-3 seconds of observing it the bright oval left horizontally at an extremly high rate of speed directly towards and overhead me and out of sight. My wife in 1978 observered a big white slipper shaped craft with windows overhead a neighbors house at close range in the late afternoon. She watched it for approximately 10 seconds as it sat motionless, then it took off in an instant. She didn't recall it until the next day. She said she thought she was being watched by it, and felt compelled not to remember the sighting. Recently in the third week of November 2010 while driving down the road around 12:15 AM she obervered overhead of the street directly in front of her windshield a dark sillouetted craft against the clear starlit sky. She could only describe as a semi circle, or ball shape on the end of a stick or pole type object that was motionless. As she approached it and observred it for a couple of seconds it took off with a trail behind it away to her left and out of sight. This object was much smaller than the slipper shaped craft she saw years ago. The smaller craft seen recently is within a mile of last evenings radio incident. These have all occurred to us in the same town."],"Log Number":"US-01072011-0006","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Trenton","There were no other sightings in Trenton on or around January 6th 2011"],"Date of the Event":"01/06/2011 10:10 UTC","Longitude":"-74.733038","Country":"United States"}