{"Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","Viewing Distance":"21-100 Feet","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown","Weather Factors":"None","Latitude":"28.300776","Date Submitted":"01/07/2011 09:25 UTC","Case Number":"27291","files":["/var/www/straped/mufon/html2text/27291.html.txt","/var/www/straped/mufon/org/27291.html"],"divs":["Sighting DetailsI was driving to work, it was 5:45Am and completely dark I was on a quiet street by the lake...I saw a cluster of bright white lights. I thought it was a helicopter. As I got closer I realized it was a triangular shaped object with white lights at the corners and a red blinking light in the back, The object was only maybe 200 feet in the air and just hovered there. It was completely silent, I rolled down my car windows as I approached where the object was. There was not a noise to be heard, no birds, bugs, the air wasn't moving. As I drove toward the object it began to turn and slowly began to drift away toward the lake. I felt nervous approaching the object because I had to drive under it to continue driving, I parked my car and just stared at the object while it moved away although I don't remember seeing it actually leave, I just saw that it was gone when I realized 17 minutes had passed. When I first saw the object my clock said 5:48am, when I realized the object was gone it was 6:05am. I felt dazed and distracted and couldn't place what had happened. I went into work and immediately began to draw what I had seen. I almost felt obsessed with having to get down what I had seen. I also felt the need to just stand outside like I thought it was coming back. I had to focus on how I was acting if others saw me, I wasn't acting crazy, Just dazed."],"Country":"United States","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around January 7th 2011"],"Log Number":"US-01072011-0004","Region":"Florida","Tags":"City","Date of the Event":"01/07/2011 05:38 UTC","Object Shape":"Boomerang, Triangle","Longitude":"-81.404591","map":"<A HREF = \"http://maps.google.com/maps?q=28.300776,+-81.404591(27291)&iwloc=A&hl=en\"> mufon case (27291) map </A>","Source":"MUFON","Summary":"triangle shaped UFO","City":"Kissimmee"}