{"Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Latitude":"32.85462","Disposition":"Insufficient Data","Date of the Event":"11/01/2006 12:00 UTC","Date Submitted":"01/08/2011 03:26 UTC","trends":["There have been no other sightings in North Charleston","This sighting has never been favorited."],"Source":"MUFON","Region":"South Carolina","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.85462,+-79.97481(27309)&iwloc=A&hl=en\"> mufon case (27309) map </A>","City":"North Charleston","files":["/var/www/straped/mufon/html2text/27309.html.txt","/var/www/straped/mufon/org/27309.html"],"Case Number":"27309","Object Features":"Unknown","Weather Factors":"Unknown","Longitude":"-79.97481","divs":["Sighting Details Not sure if date is accurate but it was late 2006. One evening I stepped outside to smoke a ciggy and look at the stars (it was clear skies)and noticed an odd blinking object located somewhat above the Charleston Air Force Base. It was a pure white blink with a 7-10 second single blink pattern. I could not see any physical details as it was too high to see clearly. It was nearly overhead. As I watched it move slowly towards the north I noticed 4 other lights behaving the same way. After a minute or two, they had assembled together into a circle, hovering still and forming a circular pattern. An occasional blue blink would occur from them. As I watched after a few minutes, they began to slowly disperse and vanished upwards (I noticed the flashing becoming dimmer and dimmer and smaller). I'm prior Navy so I am familiar with plane lighting, and this had no known aircraft lighting or flight patterns. I heard no noises or felt no environmental phenomena. I took no pictures as I did not own a camera at that time. I had always suspected we were not alone in the universe, but I had not seen any in my life until that point. I kept it to myself and eventually forgot about it until recently."],"Summary":"5 high altitude objects","Log Number":"US-01082011-0013","Country":"United States","Tags":"City"}