{"Object Shape":"Triangle","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"27304","Date Submitted":"01/08/2011 01:22 UTC","trends":["There have been 7 other sightings in Derry","There were no other sightings in Derry on or around January 7th 2011"],"Viewing Distance":"Unknown","Log Number":"US-01082011-0008","divs":["Sighting DetailsDriving on Rt. 28, heading north, into Derry, returning from Salem. Just after sunset, sky still light. Low flying aircraft caught my eye coming over trees from the northeast, moving about perpendicular (southwest) to my direction of travel. I thought at first it was simply a airplane, as it seemed to have running lights as one normally has, albeit flying rather low (I'm not qualified to make an informed estimate of altitude, but it was perhaps roughly 3 or 4 hundred feet) and moved somewhat slowly, more like the speed a helicopter travels when giving tours and whatnot. As it flew over and I began to pass under its line of travel, I realized that it had a black silhouette of a perfect equilateral triangle with a light at each corner. It also had white strobes like a normal aircraft. I don't recall whether or not it had any central lights, but I believe that it did not. I am familiar with military aircraft which are triangular in shape, and I do not believe this was one: It had straight edges on all sides and no discernible detail in form, as well as appearing to be equilateral. I passed by it as it moved over the trees to my left. I experienced no strange effects, aside from being a bit surprised of seeing such a strange object, especially since it seemed so overt."],"Sighting Duration":"00:01:00","Date of the Event":"01/07/2011 04:30 UTC","Region":"New Hampshire","Summary":"Black Equilateral Triangle","City":"Derry","files":["/var/www/straped/mufon/html2text/27304.html.txt","/var/www/straped/mufon/org/27304.html"],"Source":"MUFON","Country":"United States","Longitude":"-71.322206","map":"<A HREF = \"http://maps.google.com/maps?q=42.889342,+-71.322206(27304)&iwloc=A&hl=en\"> mufon case (27304) map </A>","Weather Factors":"Unknown","Object Features":"None","Latitude":"42.889342"}