{"Sighting Duration":"Undisclosed","Date Submitted":"01/08/2011 04:15 UTC","Object Features":"Other","Object Shape":"Boomerang","Case Number":"27311","Latitude":"29.764283","Disposition":"IFO","Log Number":"US-01082011-0015","City":"Houston","Tags":"City","Region":"Texas","Viewing Distance":"Unknown","divs":["sighting detailson the night that hurricane ike made landfall, my mother and i were standing on our porch admiring the clouds from the hurricane due to their magnificent speed and movement in general. as i turned to look to the south a boomerang shaped craft with white lights lining the bottom literally slid out of the clouds like it was moving sideways, hovered there briefly then slid in what seemed as quicker motion back into the clouds almost as if it had been 'frightened'. immediately after it disappeared my first thought was \"some sort of government craft\\airplane\" doing scientific study on the hurricane due to the increasing amount of interest in hurricanes since the 2005 catastrophe of katrina. i remember my adrenaline got pumping, as it does most of the time when i see something even remotely unexplainable, and my mind started racing as to what it actually was and realized the entirety of its movement was so unusual and unlike anything i have seen before that it couldn't possibly be explained by it being 'government craft'... it simply did not operate or move like any sort of human aircraft i have seen and most definitely looked unlike any craft i have ever seen. my mother also saw it as well and was speechless. i asked her \"do you see that?!?\" and she stuttered \"yes.. but what is it?\""],"Object Flight Path":"Hovering then path,Path then hovering","Summary":"Literally slid out of the clouds of the hurricane and slid back in opposite direction","Weather Factors":"Windy, Rain, Heavy","files":["/var/www/straped/mufon/html2text/27311.html.txt","/var/www/straped/mufon/org/27311.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.764283,+-95.36557(27311)&iwloc=A&hl=en\"> mufon case (27311) map </A>","Longitude":"-95.36557","Date of the Event":"09/13/2008 01:30 UTC","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around September 13th 2008"],"Source":"MUFON"}