{"Weather Factors":"Windy","trends":["There has been one other sighting in Mt Pleasant","There were no other sightings in Mt Pleasant on or around January 8th 2011"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Summary":"loud deep jet sound blue sky no plane","map":"<A HREF = \"http://maps.google.com/maps?q=32.794065,+-79.862585(27312)&iwloc=A&hl=en\"> mufon case (27312) map </A>","Date Submitted":"01/08/2011 04:15 UTC","Longitude":"-79.862585","Disposition":"Unknown","Object Features":"Unknown","Log Number":"US-01082011-0016","City":"Mt Pleasant","Object Shape":"Unknown","Date of the Event":"01/08/2011 03:33 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Region":"South Carolina","Tags":"City","Latitude":"32.794065","divs":["sighting detailsin my yard i heard a plane it sounded large and it was a deeper sound than normal. i am about 15 miles from charleston air force base, a c-17 and c-41 base. i am use to hearing them do training lessons and play follow the leader around the area, this was not them. it sounded like a large jet 767 or the like flying low. when i looked up i saw nothing and tracked the sound to see if it was just fast.... no plane, no nothing, no contrail, not even at high altitude. it moved from sse to nw and it covered the distance of the open sky faster than any plane i have ever seen, even fighters. i am 10 feet above sea level, it was 64 degrees, the sun was out and the sky was 100% clear. this may be an audible trick but i don't see how. my sight is 20\\20, i am male, 40, good health; mental and physical. i saw a few other reports of this type on the web. i would dismiss this but 2 years ago i heard the same thing in the same general area but on a pier with 360 deg view and no plane, i think this was also a saturday and about the same time. if you have an answer please let me know what it is thanks. *(wit's name deleted--cms\\sg)."],"Case Number":"27312","Country":"United States","files":["/var/www/straped/mufon/html2text/27312.html.txt","/var/www/straped/mufon/org/27312.html"]}