{"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"01/09/2011 12:32 UTC","City":"Independence","Source":"MUFON","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around December 22nd 2010"],"Sighting Duration":"Undisclosed","Object Shape":"Triangle, Other","Disposition":"Unknown","Object Features":"Other","files":["/var/www/straped/mufon/html2text/27321.html.txt","/var/www/straped/mufon/org/27321.html"],"Country":"United States","Longitude":"-94.412467","Date of the Event":"12/22/2010 07:18 UTC","Region":"Missouri","Case Number":"27321","Weather Factors":"None","Latitude":"39.097936","map":"<A HREF = \"http://maps.google.com/maps?q=39.097936,+-94.412467(27321)&iwloc=A&hl=en\"> mufon case (27321) map </A>","Summary":"Large stationary upright triangle with 3 white lights","divs":["Sighting Details Dec.22nd in Independence Mo. A friend and I had left a local shopping center and turned west on U.S. hwy 24, when my buddy asked me if I knew what the three white lights in the sky were. As I looked up I saw three bright white lights in a triangle formation,looking closer I saw a faint outline of triangular object in the sky. It was almost the same color as the nite sky (almost a matte black in finish). The object was approximately three football fields in width across and between 2 to 3 stories in height all sides were equal in size and slightly rounded. The object after we noticed it was stationary for about a minute and then started to bank left. In the blink of an eye it quickly flattened out and headed west following U.S. 24 hwy at a high rate of speed. I kept driving west and within about 20 to 30 seconds it was no longer in sight. There was no sound to the object what so ever. My friend and I are sill in complete shock and amazement at what we saw. I have been around aircraft since I was a child and keep up with the new aircraft technology. At this time there are No aircraft in the U.S or any other country with these capabilities or of this size."],"Object Flight Path":"Stationary,Hovering then path","Log Number":"US-01092011-0001","Tags":"City"}