{"Object Shape":"Diamond, Triangle","Viewing Distance":"Unknown","Object Features":"Unknown","Country":"United States","City":"Anchorage","Disposition":"Unknown","Latitude":"61.324289","Object Flight Path":"Hovering then path,Unknown","Weather Factors":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=61.324289,+-149.558528(27327)&iwloc=A&hl=en\"> mufon case (27327) map </A>","Tags":"City","Date Submitted":"01/09/2011 04:34 UTC","Longitude":"-149.558528","Sighting Duration":"07:00:00","Region":"Alaska","divs":["Sighting DetailsIn 1992 i was a senior in high school and studying for test on the night the incident happened. It was about 1:00 in the morning and started to feel a little tired laid down and could not go to sleep. When i got up i heard a low humming noise coming from outside my first impression was i left my guitar amp on stand by and forgot about it but that was not the case. When the noise became more drowning i went to my window and opened my shades and i felt this sense of calming fear,and intrigue all at once. I saw 3 triangle,diamond shaped objects getting larger or getting closer i could not tell but the strange thing i could not see any thing else except the objects and this emence golden light. I wanted to run outside to see what this was or scream for my parents, i could not do anything. The next thing i knew the alarm clock going off and my mom coming in the room telling me it was time for school. It felt like a half an hour went by not seven hours."],"Log Number":"US-01092011-0007","Date of the Event":"04/13/1992 01:00 UTC","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around April 13th 1992"],"files":["/var/www/straped/mufon/html2text/27327.html.txt","/var/www/straped/mufon/org/27327.html"],"Summary":"I was going to bed one night when i heard low humming noise outside where there was 3 diamond ,triangle shaped objects hovering in the sky it was about 1:00 am and i passed out and woke up at 7:00 am thinking only a few minutes had passed.","Case Number":"27327"}