{"map":"<A HREF = \"http://maps.google.com/maps?q=27.640683,+-80.389304(27320)&iwloc=A&hl=en\"> mufon case (27320) map </A>","Region":"Florida","Tags":"City","Viewing Distance":"Unknown","Longitude":"-80.389304","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-01082011-0024","Case Number":"27320","Date Submitted":"01/08/2011 09:54 UTC","Object Flight Path":"Undisclosed","Date of the Event":"01/08/2011 07:25 UTC","trends":["There have been 14 other sightings in Vero Beach","There were no other sightings in Vero Beach on or around January 8th 2011"],"Weather Factors":"Unknown","Object Shape":"Other","City":"Vero Beach","Source":"MUFON","Summary":"There were about 6 objects in the sky that were streaking downward and a slight bit apart from each other.","divs":["Sighting DetailsI've never seen a UFO but think I did tonight at about 7:45 PM in the northern sky over Vero Beach FL. My husband thought it was fireworks and I didn't want to take the time to look. He convinced me and at first I thought so too, but the more I looked, the more I realized it wasn't fireworks. There were about 6 objects in the sky that were streaking downward and a slight bit apart from each other. They were flashing on and off with a red light and they hovered in place for about 2 or 3 minutes and started moving slightly east and desending a bit, in kind of row. I called my neighbors and they went outside with binoculars and they saw them too. My neighbors were convinced they were UFO's, but they only saw 2 or 3 and finally could only see just one, moving south east. The objects were blinking and my neighbors said the colors were blue and green. They could see one object far longer than I could, but they were about 3 blocks away from me, and looking from a different direction. Most unusual thing I've ever seen."],"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/27320.html.txt","/var/www/straped/mufon/org/27320.html"],"Latitude":"27.640683"}