{"Date Submitted":"01/09/2011 07:30 UTC","Sighting Duration":"Undisclosed","Date of the Event":"01/09/2011 06:30 UTC","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.251089,+-84.395426(27330)&iwloc=A&hl=en\"> mufon case (27330) map </A>","Region":"Michigan","City":"Jackson","Latitude":"42.251089","Longitude":"-84.395426","Summary":"A large bright object slowly ascended in the sky and took off very fast and blinked out.","Tags":"City","trends":["There have been 10 other sightings in Jackson","There were no other sightings in Jackson on or around January 9th 2011"],"Object Shape":"Star-like","Log Number":"US-01092011-0010","Weather Factors":"Unknown","divs":["Sighting Details1. Where were you and what were you doing at the time? I was on my back deck taking my dog out. 2. What made you first notice the object? I seen a very very bright star(I thought it was a star.) above some trees to the north of my house. 3. What did you think the object was when you first noticed it? Wow, that star is really bright and it seemed out of place, then I noticed it was move south easterly and it was rising at a 50 degree angle. 4. Describe the object and its actions and motions The object was very bright, much brighter than any star I have every seen. I was pure white much like a star and it had no sound what so every. It was a clear night. When I first saw it I was suprized it was moving and It was moving slow at first. I then opened our back door and called my wife and yelled, \"honey get out here.\" The whole time I did not take my eyes off the object. My wife and oldest son came out they both saw the object by then it was half way across my visable sky. It was slightly to the East and not directly over head. It Was much brighter as it was closer. My wife and son both started yelling what is that. We all noted it did not have flashing lights of any kind and It was a solid color. As we all stood there in awe, its speed took off faster than Ive ever seen a conventional craft move and it look like it pinched out into nothing. All three of us can atest to that. 5. Describe your feelings, reactions and actions, during and after sighting the object. I have to say it was very exciting but scary also. My son and wife also were very excited. We came inside and called my parents and told the story to them. I have to say I have never seen a aircraft that acted or looked like that. 6. How did you lose sight of the object? As I stated before it sped up and look like it pinched out. Not at a point that it should have disapeared in the horizon or anything."],"Viewing Distance":"Unknown","Disposition":"Unknown","Country":"United States","Case Number":"27330","files":["/var/www/straped/mufon/html2text/27330.html.txt","/var/www/straped/mufon/org/27330.html"],"Object Features":"Unknown","Source":"MUFON"}