{"map":"<A HREF = \"http://maps.google.com/maps?q=38.685969,+-87.519702(27338)&iwloc=A&hl=en\"> mufon case (27338) map </A>","files":["/var/www/straped/mufon/html2text/27338.html.txt","/var/www/straped/mufon/org/27338.html"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-01102011-0006","divs":["sighting detailsi work nightshift, and leave work at 2:20 a.m., with a 20 minute drive home, and on monday night\\tuesday morning 01\\04\\11 at 2:45 a.m., i and my riding\\work partner had just arrived home, and were walking to the front door of our apartment building. i had just lit a cigarette, and was walking slowly, looking at the stars. my partner had gone on into the building, and as i stepped up to the sw corner of the building, i looked sw at venus\\mars, quite bright in the low wsw sky, then east at the big dipper, and as i turned back towards the west, i noticed a narrow line of clouds, extending back to the ssw, and a dark angular object, slowly coming out of the clouds. as i watched, it became more visible, and had two bright white lights on the bottom in front, and multiple dimmer lights further back. then, from directly below the object, a spotlight shined straight up from the ground, at the object, and it made an immediate and very fluid turn to it's left, 180 degrees and went back into the clouds. i was given a full view of the entire bottom of the object, against the white cloud, which was illuminated by the lights of the town. it was approximately 1\\4 mile away, or 6-7 city blocks, dark-colored, and triangular, with the points of the triangle squared off. there were two bright lights on each point, on either side, with a dimmer, hazy ring of about 12-15 lights around the center. the turn this thing made was impossibly tight and fluid, and it quickly disappeared back into the cloud, out of sight. there was no sound at all while this event occured. as i had been watching it, i had backed up to the front door of the apartment building door, and called to my partner to come and see the object, but by the time he had come out, the object was no longer visible, and the spotlight was turned off, so he saw nothing. we stood there for another 20 minutes, scanning the sky, but saw nothing further, and finally went in. i immediately drew a diagram of the event, which i will attempt to send, and made a report to the national ufo reporting center. it was suggested that i also contact this organization with the details, which i am doing now."],"Object Flight Path":"Path with directional change","Longitude":"-87.519702","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date of the Event":"01/04/2011 02:50 UTC","Case Number":"27338","Region":"Indiana","Summary":"2:50 a.m. Tue. 01/04/11 Vincennes, IN Triangular UFO against white clouds; Full bottom view from approx. 1/4 mile, about 800 ft up.","trends":["There have been 17 other sightings in Vincennes","There were no other sightings in Vincennes on or around January 4th 2011","This sighting has never been favorited.",""],"Weather Factors":"None","Country":"United States","Object Features":"None","Date Submitted":"01/10/2011 03:28 UTC","Source":"MUFON","Object Shape":"Triangle","City":"Vincennes","Latitude":"38.685969"}