{"trends":["There have been 7 other sightings in Covington","There were no other sightings in Covington on or around September 1st 2010"],"Country":"United States","Latitude":"39.048116","Disposition":"Unknown","Viewing Distance":"Unknown","Region":"Kentucky","Date of the Event":"09/01/2010 12:00 UTC","Tags":"City","Longitude":"-84.508831","map":"<A HREF = \"http://maps.google.com/maps?q=39.048116,+-84.508831(27339)&iwloc=A&hl=en\"> mufon case (27339) map </A>","Log Number":"US-01102011-0007","Summary":"Red and white orb visible from my house every night in September and Jan 1,2,3,6,and the 8th.","Object Features":"Undisclosed","Case Number":"27339","Date Submitted":"01/10/2011 03:46 UTC","divs":["Sighting Details I looked out my window one night and saw this object hovering in the sky as I watched it more closely it started to display odd behaver, moving up and down and side to side. what made it stand out is that it was strobing white and red in a constant fast pace after waiting for a while I noticed it was making its way down past the trees out of my field of vision. This object continued to appear almost every night of September, Every night as soon as it was dark this thing was visible it would always start at the same spot in the sky however it would some times move of in a different direction than the previous night. I Have gotten several witness to view the object some would say it was a star, even though it would strobe just as much when viewed by others it does seem to slow down its movement when viewed by others., However it would seem to come alive when I would see it alone. It would start by rocking or swaying back and forth for a minute an d then steadily it's self at a certain spot in the sky and then make a straight line right to left and then when it got to a specific point it would stop and then it appeared to waddle back to the point it started. I tried to get a police man to witness this object but hew refused to come in to my house and said that in 10 years on the force he has never been called to observe a UFO. the next night I got out on my roof and took several pictures of the object with every setting i could and used a star for a point of reference while taking tease pictures I had to witnesses waiting the object and tiring to plot its location with a Google star chart while talking to my friend who lives a few blocks away mas waiting the same object from his front door with the cameras' lens almost fully extended I could see this object perfectly clear with no light flashing it was a plain low or flat gloss metal spear white on visible marks or detail what so ever but when i would zoom out or look with the naked eye it was flashing red and while light. I watched this thing almost every night in September but in October November and December it could not be seen.However as I walked out of my house on December 15th around (.35-940p.m. I saw a huge triangle shaped craft pass over me. I could not tell if the object was going on a straight path when I noticed it or of it was hovering over my house before I came out,but as I was going to my car I stopped to watch this massive black ship pass over head it seemed to be as big as a cargo plain or bigger. I could make out the shape from directly underneath as well as see the back of the ship and there was no means of propoltion, It was gust a simple shape It made no noise that I could tell and moved about 35mph. It had three lights two in the fear on each rear corner that where approx 10ft. round and 4 to 5 feet at the center. all three lights where not very bright and seemed to be soft and or matte in finish. January 1st 2011 the orb was back, until then I was not able to see it but in October someone caught the orb on tape and put it on you-tube. visible the Jan 1-3 and then not visible for cloudy overcast for a few days but again on the 7th and 8th. On the 8th I gathered several witnesses to view the object however the few neighbors I could gather where not very interested to stand out side and watch this light in the sky that was surprisingly visible from the street. my brother-in-law brought his two kids to observe the orb from the street and from my second story window although it was visible it did not display the same unearthly strange movements as it had in the past however it still moved up an d down and side to side while staying in a very small area in the sky. closer to 8pm the object started to wander downwards into the trees and then started moving straight up and slowly down several times after observing for about 25 min My brother in law left and as soon as he did the sphere started to move around left to right and up and down very fast! I called him on the cellphone And told him and he said I know I can see it! but I'm blocking traffic so I gotta go! I decided to call David MacDonald and John Bacon to tell them of this real time sighting and asked if ether of them could come witness this even though they could not however I had John on the line explaining to him what the object was doing when I noticed it started to drift more and more to the right until it was directly in the flight path of air traffic While this was happening a helicopter passed by the object approximatively 8 to 10 times however the air plains had to at first go far right to fly around the object,(there left) and as it moved further to the right the plains started to fly to the far left! coming almost directly over my house to avoid this orb! One plain had to pull up hard and fly directly over the object. As I told John the (helicopter) that I saw fly by this thing had no flash beacon, it only had one solid light, And I thought that odd yet I assumed this craft to be a helicopter because I could here the rotors and I could see them circle each other low around the city off in the distance before they would take turns doing a fly by,every few minutes another helicopter would fly directly in the path of this object and get very close but the sphere was unphased by this as it just appeared to see what would happen. usually after the sphere starts to wander off it does not come back however this time it did around 10:45-11:00pm the sphere was back hovering over the tree where It usually is except it is off to the right a little. At approx. 11.pm a new craft came up from the north on the far left from out of the clouds I could hear helicopter rotors very faintly however this craft only had one solid white light and was almost even but a little higher than the orb possibly a quarter-mile between the to objects. The orbs' movements very stubble yet the other craft seemed to have trouble keeping steady for about 15-20 min. however as i checked on them both every one in a while through the net approx. 2hrs the craft on the left stopped moving around and started to behave like the orb.they where both hovering ether waiting each other or both of them together were waiting something else. I saw a UFO last night on the side of the expressway and when I spotted it it moved across the road over me and it continued south a little to the left of I-75going about 80-85mph 5-800 ft off the ground and I saw two more lights in the sky come toward me from a SW direction as I pulled in to a gas station to get a better look and get my camera the first one disappeared however I saw an other while light coming from the same direction but further back it moved very slow and as I watched it come closer it to just disappeared just a little closer than the first one."],"Object Shape":"Sphere","Sighting Duration":"Undisclosed","City":"Covington","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27339.html.txt","/var/www/straped/mufon/org/27339.html"],"Source":"MUFON","Object Flight Path":"Undisclosed"}