{"Viewing Distance":"Unknown","Longitude":"-76.393861","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/27333.html.txt","/var/www/straped/mufon/org/27333.html"],"Case Number":"27333","Tags":"City","Date Submitted":"01/10/2011 12:32 UTC","Source":"MUFON","Disposition":"Insufficient Data","Weather Factors":"Unknown","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.169128,+-76.393861(27333)&iwloc=A&hl=en\"> mufon case (27333) map </A>","Country":"United States","divs":["Sighting DetailsTue. January 4th, 2011 roughly 8:20 pm My uncle and I were driving toward Manheim from Lititz, we were heading to Mollys gas station. I was driving and noticed some bright lights in the sky, at that time I pointed it out to my uncle. I kinda laughed and said it was a ufo. I keep my eye out from time to time but was not prepared to be witness to what comes next. As we approach the first bend we are watching this craft hover over some backroad fields, a few farm homes around and many developments within a mile north if not closer. It was only a few football fields away, pulsating peach colored orbs hovered over in front of us. Went around bend and watched it through some trees. When we came around the bend next to the pond right in front of Doe Run Elementary school the orbs fell silently towards my vehicle. Our windows and sunroof wide open we yelled as I swereved a bit! not paying no mind to the car behind us. This object acted as though weightless, fell in front of our eyes slowed down about a football field away right above the school, spun as the orbs shined in my windshield,almost blinding but made a silouette of a grey haze against the black night sky. May have been a rounded but triangle shape. After it slowed down and lights shined in our direction it spun....horizontally,very fast. then diagonally, like a ball being spun on water by hand. Best yet we then watched it take off in no way I have ever seen anything fly! as if spinning wasnt crazy enough! it silently took off towards the town of Manheim and could literally see it fly until it was prob over MtJoy PA in a matter of 20 seconds. Right when it took off at top speeds we watched in disbelief as it slithered like a snake in the air, it did not go straight. I stepped on the gas but the time I got a half mile it was long gone from our sight in the distance. We thought about reporting it but wasnt prepared to tell people this. I thought I would wait and see if anyone else came forward, we thought for sure somebody would but I havent seen anything yet. It is now the 9th. It changed the way I look at things for sure. I believe I was in shock for the past couple days. I know it sounds crazy but I didnt ask to see this especially right now at this time of my life, but I also feel very lucky and now believe in a larger picture without discrediting any beliefs or opinions. I am now at peace"],"City":"Manheim","Object Flight Path":"Undisclosed","Log Number":"US-01102011-0001","Summary":"4 peach colored pulsating orbs over Doe Run Elementary School Manheim PA","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Manheim","There was one other sighting in Manheim on or around January 4th 2011"],"Sighting Duration":"Undisclosed","Date of the Event":"01/04/2011 08:20 UTC","Latitude":"40.169128"}