{"Sighting Duration":"01:59:00","Object Features":"Window(s)","Log Number":"","Object Shape":"Disc","Viewing Distance":"21-100 Feet","Date Submitted":"10/31/2003 02:19 UTC","Country":"Belgium","Object Flight Path":"Other","Disposition":"Unresolved","City":"Brussels","Tags":"City","Source":"MUFON","Weather Factors":"Fog","Case Number":"2734","Date of the Event":"10/31/2003 02:19 UTC","trends":["There have been 3 other sightings in Brussels","There were no other sightings in Brussels on or around October 31st 2003"],"divs":["Sighting DetailsWe were on a pond in Brussels, fishing out of our boat when my wife priscillanoticed something we thought to be a jet plane in the sky. Then we just kept onfishing, but as it got closer we noticed that it didnt look quite right. Itsstanged disc shape was unkown to us and it just kept coming closer and closer. It descended, brushed into a patch of trees by the pond, the hit the water. Because of its windows we could see something inside, but it was unclear as towhat it was. Apparently, it was very hot because when it touched the watersteam began to rise up fogging up the windows and making it difficult to seeinside. Our dog was in the boat with us and barked uncontrollably during thewhole event. When I tried to calm him, he bit my hand, which he has never donebefore. The waves immitted from the impact capsized our boat and sent usoverboard. At that point there was much confusion, and I was dissy. My wifeadmitted to being dizzy as well. After a minute or two, the craft had liftedout of the water and flown back into the air. My dog drowned, and dead fishcame to the surface. Birds near by in the tress were flying over head in largenumbers. I was very afraid during the whole event, and felt somewhat out of mybody. It was extremely surreal, and as it left I began to fell sick, a feelingmy wife later said she felt as well. Being in the water with so much chaos Ijust lost sight of the craft, and I dont know how, but when I looked up onlyafter a few seconds, which felt like hours, it was gone. However, the strangestand most unexplainable event occured after my wife and I had swam ashore. Lyingon the edge of the pond i found a burnt limb of some sort, but w"],"files":["/var/www/straped/mufon/html2text/2734.html.txt","/var/www/straped/mufon/org/2734.html"],"Longitude":"4.35171","Latitude":"50.85034","map":"<A HREF = \"http://maps.google.com/maps?q=50.85034,+4.35171(2734)&iwloc=A&hl=en\"> mufon case (2734) map </A>","Summary":"Descent.","Region":"Brussels"}