{"Date Submitted":"01/11/2011 12:27 UTC","Longitude":"-97.510628","Viewing Distance":"Unknown","Object Shape":"Circle, Square, Rectagular, Other","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.46889,+-97.510628(27348)&iwloc=A&hl=en\"> mufon case (27348) map </A>","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around January 8th 2011"],"Object Features":"None","City":"Oklahoma City","Case Number":"27348","Sighting Duration":"Undisclosed","Log Number":"US-01112011-0001","files":["/var/www/straped/mufon/html2text/27348.html.txt","/var/www/straped/mufon/org/27348.html"],"Latitude":"35.46889","Region":"Oklahoma","divs":["Sighting DetailsOn January 8th, 2011 while working a security post in OK I was observing work being done on a crane. While I was watching a small silver dot appeared. The object was over the weight side of the crane about 10 degrees. The object shape started as a small circle, then while moving it appeard to change to 2 teardrop connected at the small end. When It was about half way across the horizon it seemed to change to a more rectangle shape. When it reached the futherest part behind my vehicle It sped up and then disappeared. I believe it to be a great distance from my location, the speed was a constant high rate of speed, absolutly no noise, no contrail. I see jet airliners, small planes and helicopters all the time. I was first surprised by seeing the object mainly because I had been watching the work on the crane for most of the day. The whole event was a total of less than 30 seconds. My training is observe and report, and to be detailed in all accounts. I did not have a camera with me at the time. I am looking for a explaination for what I saw and if anyone else has seen it."],"Disposition":"Unknown","Weather Factors":"None","Summary":"Small circle, changed to 2 teardrops connected then to a rectangle.","Date of the Event":"01/08/2011 03:55 UTC","Object Flight Path":"Stationary,Straight-line path","Source":"MUFON","Tags":"City"}