{"Date of the Event":"04/02/1992 09:30 UTC","Date Submitted":"01/10/2011 06:37 UTC","Country":"United States","Latitude":"40.558986","trends":["there have been no other sightings in btween martinsville\\bloom","This sighting has never been favorited."],"Longitude":"-85.594964","Object Flight Path":"Stationary,Hovering then path,Path with directional change","City":"Btween Martinsville/Bloom","Weather Factors":"Unknown","Object Features":"None","Viewing Distance":"101-500 Feet","Summary":"Square/Rectagular looked like an I beam building frame","divs":["Sighting DetailsWhile traveling south on State Road 37 between Martinsville and Bloomington Indiana (approx 7 miles south of Martinsville. I noticed what appeared to be the framework (no siding simply the framed structure) of a what appeared to be a building along side the road. It was as large as perhaps a barn. (It is not uncommon for me to check out changes along this segment of highway as I had lived in the area as a child) The I beam framed structure began to lift off the ground in an upward fashion, naturally I slowed down. I looked for some sort of crane thinking a builder was moving the structure. There was no crane. The structure lifted off the ground slowly floated off into the sky first above the trees then straight up and out of sight. There was no noise, nor sign of a smoke trail. The speed of the structure was at first slow then fast. There was another man in a car behind me who also witnessed this event. I not wanting to think I had been the only one to observe the event stopped the other driver at the stoplight at State Road 37 and 46 in Bloomington. I ask him what he saw and more importantly what he thought the structure might be. He discribed his sighting as did I. We neither one knew each other nor were we able to determine the nature of what we had both witnessed."],"files":["/var/www/straped/mufon/html2text/27341.html.txt","/var/www/straped/mufon/org/27341.html"],"Disposition":"Unknown","Log Number":"US-01102011-0009","Sighting Duration":"Undisclosed","Tags":"City","Region":"Indiana","Case Number":"27341","map":"<A HREF = \"http://maps.google.com/maps?q=40.558986,+-85.594964(27341)&iwloc=A&hl=en\"> mufon case (27341) map </A>","Source":"MUFON","Object Shape":"Square, Rectagular, Other"}