{"files":["/var/www/straped/mufon/html2text/27347.html.txt","/var/www/straped/mufon/org/27347.html"],"Viewing Distance":"Unknown","Country":"United States","Weather Factors":"None","divs":["Sighting DetailsAt around 5 a.m. on January 6, 2011, I went to the kitchen for a glass of water. I glanced out the window and saw the aircraft just above the tree line. I ran for my glasses and called for my 22 yr. old daughter who was visiting to come see. There was a row of lights that changed from blue to red. This is the same aircraft I previously saw in October 2010, when I gave a detailed drawing to the MUFON investigator. A large triangular craft is the TR-3b. We live on top of a mountain in rural country, giving us a great view of the night sky. We see lots of aircraft. Jacksonville AFB is south of us by 40+ miles driving. This time the aircraft was at an approximate altitude of 1500ft moving on a westerly heading at a steady speed. I got dressed and grabbed my keys and headed out following along HWY 25 heading toward Quitman and then on to Guy, where I lost sight of it as it went out of my sightline! The last time I saw it in October 2010...it was moving just above a hover...not so this time. No good video this time, though I had grabbed my video camera and regular camera. The first time I saw it, the weather was clear with little wind. This time, the area over us was clear with little or no wind, but there were clouds to the west on the horizon. Again, I was so excited, not fearful or anxious. I keep hoping my husband will be home when I see it next! I don't mind if the previous MUFON investigator contacts me, again."],"Latitude":"35.384247","trends":["There have been no other sightings in Quitman","This sighting has never been favorited."],"Region":"Arkansas","Date Submitted":"01/10/2011 11:20 UTC","Summary":"Looked out the kitchen window, to the west, right above the treeline was the triangular aircraft.","Date of the Event":"01/06/2011 05:00 UTC","Disposition":"Unknown","City":"Quitman","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.384247,+-92.215707(27347)&iwloc=A&hl=en\"> mufon case (27347) map </A>","Object Features":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Case Number":"27347","Source":"MUFON","Longitude":"-92.215707","Object Shape":"Triangle","Log Number":"US-01102011-0015"}