{"map":"<A HREF = \"http://maps.google.com/maps?q=33.299687,+-112.424596(27358)&iwloc=A&hl=en\"> mufon case (27358) map </A>","Date of the Event":"01/11/2011 06:55 UTC","Summary":"Orange Lights Moving across the Sky","Longitude":"-112.424596","Object Flight Path":"Stationary","Source":"MUFON","Log Number":"US-01112011-0011","Weather Factors":"None","Disposition":"IFO","Tags":"City","Latitude":"33.299687","City":"Maricopa","Object Features":"None","Country":"United States","divs":["Sighting DetailsI was driving south on SR-346 (John Wayne Parkway), and was coming up to Honeycutt Rd by the High School. I noticed two orange lights in the sky by side by side, in the southern sky. Then a new light appeared to the right of the two lights, and simultaneously the light to the left disappeared. Then one second later it repeated the same pattern. The lights lasted approximately 10 seconds and then all the lights just turned off. It looked like the lights were walking across the sky. This is not the first time I seen light like this in Maricopa. The prior time was in Mid December when we had the rain storm. It was just passed 6:00 PM and it was rush hour, I was driving south on SR-347 just south of Riggs Road and noticed a trail of lights appear in front of me in the sky. There were 6 orange lights in a perfect line across the sky. They were evenly spaced and appeared to be still. They turned on very bright and dimmed down. They did this three times and disappeared. I know they were not far away because they appeared under the clouds, I know more people seen them but I did not see anything in MUFON reports or anything in the news paper. I know more people see these lights because I have seen them more than a dozen times in the last 12 months. I just wish they would report them, so that we can figure out what there objects are."],"Object Shape":"Fireball","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/27358.html.txt","/var/www/straped/mufon/org/27358.html"],"Sighting Duration":"00:00:10","Case Number":"27358","Date Submitted":"01/11/2011 10:02 UTC","Region":"Arizona","trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around January 11th 2011"]}