{"Region":"Washington","Object Shape":"Cylinder","Sighting Duration":"01:00:00","Summary":"I was taking pictures of a bright light that seemed odd and when I looked at pictures I noticed the strange object.","trends":["There have been 41 other sightings in Spokane","There were no other sightings in Spokane on or around November 15th 2010","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Log Number":"US-01112011-0003","Case Number":"27350","Source":"MUFON","Weather Factors":"None","Date Submitted":"01/11/2011 09:33 UTC","City":"Spokane","files":["/var/www/straped/mufon/html2text/27350.html.txt","/var/www/straped/mufon/more/27350_submitter_file1__1115222121.jpg","/var/www/straped/mufon/more/27350_submitter_file2__1115222128.jpg","/var/www/straped/mufon/more/27350_submitter_file3__1115222057.jpg","/var/www/straped/mufon/org/27350.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.66832,+-117.419717(27350)&iwloc=A&hl=en\"> mufon case (27350) map </A>","Longitude":"-117.419717","Latitude":"47.66832","Date of the Event":"11/15/2010 10:15 UTC","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsI was sitting in my vehicle waiting for someone to come pick up a vehicle from our impound yard and I was watching a bright light move across the southern sky at about 1000 MSL and maybe 1 or so miles away. It would travel one way then the other maybe 90' or so. Did not think much but I began to notice it didn't have any nav lights, beacons or strobes and I found that odd. It traveled at aprox. 120-200 knots, about what I would expect of a aircraft. We are close to Felts Field but the tower was closed at this time and it was not in the pattern or even close and it was not on approach to Spokane Int or Fairchild AFB. I had my cell phone camera and decided to take about 20 pictures. I forgot about them then the other day I looked at them and noticed a object above the bright light. It seems to take several different forms and changes form. I realized my phone was a video also and took a video and in the video, on frame by frame play only you can see the object go behind the bright light then back which you could not see at normal speed. Also you can hear the sound of what sounds like a jet aircraft but during this all I heard nothing. I did have my truck running during most of the time which would have covered any sounds but when I turned it off I don't recall any sounds. I have a extensive aviation background, could fly before I could drive, lived on a airport, father is a retired 747 pilot, I know aircraft and this was not any type known to myself. I don't have any idea what it is and I find it very interesting, whatever it is?"]}