{"Tags":"City","Case Number":"27354","Longitude":"-97.31184","Latitude":"32.729019","divs":["Sighting DetailsThe sighting occurred over my southern facing home in southwest Fort Worth near Benbrook Lake in the early morning hours at 7:45 AM Central Standard Time on December 10, 2010 (I confirmed the date and time by reviewing my text message to a friend with whom I shared the experience). I was rolling out the garbage bins for Friday morning Pick-up and the triangular shaped craft, with 3 soft glowing well defined lights beneath, was moving very slowly at a diagonal from my right to the left with no sound. I am accustomed to seeing aircraft which originate from or travel toward Carswell, AFB; however, this craft was on a trajectory outside of the usual flight paths I've witnessed. The shape of the craft was distinguishable as a dark silhouette against the background of the early morning sky, and the 3 equally proportioned lights were the dominant feature. At a higher altitude, there was a military fighter aircraft too small to identify, but was still audible. I watched for about 2 minutes, as the craft grew closer and eventually passed directly overhead. I looked to my left and saw a neighbor in the car about 3 houses down; however, this person was not a co-witness. I remained in place and continued to watch. In the time I looked left again, toward my neighbor's moving car, the craft disappeared in a blink. My initial thought was that in a clear blue sky, I should be able to reacquire the craft, as there was no way a conventional aircraft could have disappeared so suddenly. The sky was cloudless, my view was unobstructed. I was unable to take a picture at that moment, but have discovered a photo that fits the description, the time of day and similar weather conditions under which I witnessed the UFO."],"City":"Fort Worth","Viewing Distance":"101-500 Feet","Log Number":"US-01112011-0007","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/27354.html.txt","/var/www/straped/mufon/more/27354_submitter_file1__30715_382104793301_683583301_3962620_8044822_n.jpg","/var/www/straped/mufon/org/27354.html"],"Summary":"Triangle shaped vehicle, 3 huge lights beneath floating overhead at low altitude...very silent.","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.729019,+-97.31184(27354)&iwloc=A&hl=en\"> mufon case (27354) map </A>","Date of the Event":"12/10/2010 07:45 UTC","Country":"United States","Sighting Duration":"00:03:00","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around December 10th 2010","This sighting has never been favorited.",""],"Weather Factors":"None","Date Submitted":"01/11/2011 02:38 UTC","Object Shape":"Triangle","Region":"Texas"}