{"Disposition":"Unresolved","Region":"New York","Tags":"City","divs":["Sighting DetailsMy friend and I would walk our dogs late at night for a good hour or two over the summer. It was around 1 am and we both walked to our neighborhood's elementary school which happens to be the half way point to both our houses, that's were we split up to each walk home. I was walking my dog home and was pretty close home, just about a block away. I was looking at the sky (which was very very clear) thinking to myself how nice it should be tomorrow. Right as I was looking at the sky I saw a rather large disc over head fly by extremely fast. I'd say it was about the size of the average frisbee held above your head at arms length. The whole thing was glowing, the center was more white and bright and as it got to the edges it was more of a mustard yellow. I saw it for a good 2-3 seconds before it disappeared. After seeing that I knew I just saw a UFO and by UFO I mean I knew it wasn't of this Earth. I stood there for a good minute thinking to myself what do I do who do I tell. I continued to walk home. After walking about another minute my dog (nicest, calmest, quietest dog, rarely and I mean rarely ever barks) stops walking (and this dog loves to walk). She turns around and starts growling. The hair on her back was standing up she was showing her teeth and everything. This scared the crap out of me. I kept pulling the leash and saying Dixie (my dogs name) calm down come on. She then let out a loud vicious bark. Then I heard the sound of something speed walking towards us from behind. It sounded like a dogs paws on the pavement. We could not see anything but it was getting louder. My dog suddenly turns around and takes off pulling me. The faster we ran the louder and closer it sounded. I was afraid to turn around to see what was behind me but I did anyway as we ran and saw nothing. I let go of my dogs leash and ran into my backyard and went through my back door into my house. My mom woke up from me running into the house. She asked what was going on because I was out of breath. I tried telling her but she got out of bed and kept accusing me of being on drugs. Then my phone started ringing and it was my friend (I had told him to call me when he got home when we left each other) I pick up the phone and started to cry as I tried to tell him what happened. Before I'd get to the substantial information, the phone would disconnect. My house has full coverage... I didnt want to call him back because he was using his house phone and I didnt want to wake everyone at his house up. I went back to my moms room to continue to try to tell her what happened. She started to believe me and was getting freaked out herself. My phone started ringing in my room so I went to go answer it knowing it was my friend. As i'd try telling him again, the phone would disconnect. He called me back right away and my mom was screaming for me to come into her room so she can try to make sense of things. I tell my friend to hold on, I left the phone in my room. As I was trying to tell my mom what happened more in depth, my cell phone started ringing (disconnected while I was talking to my mom and my friend was calling me back) I lost it. I broke down and told my mom every time I tried telling my friend what happened my phone disconnected. She didnt understand. This happened over and over again and I was eventually able to tell him quickly what happened. He was afraid bc he said he was hearing humming outside. He went to sleep in his parents room. We were 15 at the time... I counted how many times my friend called me. He called me 17 times within a half hour period. That means that my phone disconnected 16 times in that half hour period. Again, at my house I have full AT&T 3G service. I then stood outside my moms and my room and stared down the hallway for a good half hour as if i was hypnotised, not saying it was from \"aliens\" thats just how scared I was, I didnt want to move. My dog, sat and stared out the back door all night. My mom was just as scared as I was after knowing the whole story and hearing my phone ringing over and over again knowing that I wasnt hanging up the calls, they were disconnecting. My mom was so scared that she made me sleep with my door open, lights and tv on, and she made me take my necklace off in fear that it could be used to choke me. This whole story sounds far fetched I know and my being 15 at the time probably makes this sound silly but I didnt even really believe in Aliens at that time. After that incident I've become somewhat obsessed with Aliens and UFO's. When I tell friends this story they look at me as if im legitamently mental. I don't care what people think when I tell them this story. I know what happened and I take it to my grave."],"Object Shape":"Disc","Log Number":"US-01112011-0012","Sighting Duration":"00:10:00","Object Flight Path":"Straight-line path","Date Submitted":"01/11/2011 11:25 UTC","Summary":"Large UFO overhead, chased by something on foot?","Weather Factors":"None","trends":["There have been no other sightings in Latham","This sighting has never been favorited."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27359.html.txt","/var/www/straped/mufon/org/27359.html"],"Date of the Event":"07/31/2008 01:00 UTC","City":"Latham","Object Features":"Unknown","Country":"United States","Case Number":"27359","Latitude":"42.747022","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.747022,+-73.759009(27359)&iwloc=A&hl=en\"> mufon case (27359) map </A>","Longitude":"-73.759009"}