{"files":["/var/www/straped/mufon/html2text/27368.html.txt","/var/www/straped/mufon/org/27368.html"],"Region":"Maine","trends":["There have been 17 other sightings in Portland","There were no other sightings in Portland on or around January 11th 2011"],"Date of the Event":"01/11/2011 09:45 UTC","Source":"MUFON","Object Flight Path":"Hovering then path","City":"Portland","Case Number":"27368","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Latitude":"43.662741","Date Submitted":"01/12/2011 01:50 UTC","Disposition":"Unresolved","Longitude":"-70.245916","Tags":"City","Object Shape":"Star-like","Log Number":"US-01122011-0009","Summary":"Bright Light Hovering over Portland Int'l Airport","Country":"United States","divs":["Sighting DetailsI live on the third floor of an apartment that perfectly overlooks Portland, ME airport. I went out on my back porch to have a cigarette, and when i looked up i saw a very clear bright light that resembled a star, but wss clearly not a star in the sky above the airport. I became excited and continued viewing the object, looking for any signs of movement, sound or anything that would resemble a planes movement. The object was going from shining yellow light to a mixture of red light that would fade in and out blending with the yellow. I estimated the object to be hovering at maybe 1000-1500 feet above the airport, and it sat comletely still for around four minutes. Oddly, when i started questioning in my mind what i was seeing andthe validity of the object, it slowly and almost impossibly smoothly started moving from left to right in my view, still shining, At this point i ran inside and attempted to quickly find a phone number for the local news channel. After a minute or two i got the number and ran outside only to find the object was no longer there. I attemped to take a picture with my cellphone but it was just too far away to show up. I ended up calling the news and basically chickening out telling them what i saw due to fear of being possibly ridiculed. I have never in my life seen anyhting i would consider a UFO until now, and i feel the need to report it to this site. I never in my life wish i had some sort of video camera more then i do now, because at the distance i was from the object i would have been able to get incredible footage with any type of zoom whatsoever. What angers me even more is i bought a video camera about a month ago just for the reason of you never know what your going to see. I had brought it back to the store th enext day because i just didnt have the money for it, and figured it would be useless to me anyways. big mistake on my part..."],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.662741,+-70.245916(27368)&iwloc=A&hl=en\"> mufon case (27368) map </A>"}