{"Country":"United States","Disposition":"Unknown","Object Flight Path":"Undisclosed","Summary":"This event was captured on my cell phone. I was taking a picture of the beam of light coming through the clouds not the object in the pic.","Object Features":"Undisclosed","Latitude":"36.058949","files":["/var/www/straped/mufon/html2text/27369.html.txt","/var/www/straped/mufon/more/27369_submitter_file1__1222071039.jpg","/var/www/straped/mufon/org/27369.html"],"Source":"MUFON","Tags":"City","divs":["sighting detailsi was on my way to nashville, tn from my home in bruceton, tn. it was an overcast day as you can see in the picture. i was traveling south on hwy 641 in benton co when this beam of light came through the clouds of course i thought at the time it was the sun breaking through. i thought this would be a cool picture so i took out my cell phone and shot the picture never thinking nothing of it other than it being a nice picture. this happened approx. 4-5 yrs ago. today on 1\\12\\11 for no good reason while watching a program on tv that had absolutely nothing to do with ufos i thought about this picture and how i would like to have it as a background picture for my desktop. so i sent it to my email and downloaded it. when i first saw it enlarged on my computer i thought it was a speck of dirt on the screen then after close inspection of it i now think i may have inadvertently caught a ufo in the picture. i may be wrong but i don't think so. take a look and with better software than i have maybe you can figure out what it is."],"Date Submitted":"01/12/2011 05:10 UTC","Viewing Distance":"Unknown","Object Shape":"Unknown","Sighting Duration":"00:00:05","Log Number":"US-01122011-0010","trends":["There has been one other sighting in Camden","There were no other sightings in Camden on or around December 22nd 2007","This sighting has never been favorited.",""],"City":"Camden","Longitude":"-88.097815","Weather Factors":"Windy","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=36.058949,+-88.097815(27369)&iwloc=A&hl=en\"> mufon case (27369) map </A>","Date of the Event":"12/22/2007 10:39 UTC","Case Number":"27369"}