{"Summary":"Can You Be Trusted","Date Submitted":"11/20/1980 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.327222,+-92.548333(2736)&iwloc=A&hl=en\"> mufon case (2736) map </A>","trends":["There have been 5 other sightings in Alexandria","There were no other sightings in Alexandria on or around November 20th 1980"],"Region":"Louisiana","Weather Factors":"Unknown","City":"Alexandria","Object Shape":"Triangle","Log Number":"","Sighting Duration":"00:30:00","Tags":"City","Object Flight Path":"Stationary,Other","Longitude":"-92.548333","divs":["Sighting DetailsTo Whom It May Concern,There is more to this than your sterile questionnaire asked. I was just a childwhen I had seen those 3 bright red lights. To start off with I had a Telescope,cheap little Tasco but it was good enough to view the moon. I had set it upknowing the cold air would allow me to get a clearer view of the moon. Whilelooking into the scope I noticed it went dark and then the moon re-appeared.Thinking a leaf or something was blocking my view I pulled away to have a look.I saw it then. Please understand I was an Air Force Brat, USAF Planes were mylife, and I used to be able to tell you every known aircraft we had. What I sawwas not a USAF plane by no means. I saw this thing pass in front of the fullmoon, it was black and shaped like a triangle, and on all three corners it hadbright red lights. They moved to and fro from the dark object. I called for myfather. He and my sister came out to see what the fuss was about. I pointedupward, matter of fact almost directly above our house. We stood there lookingat this thing, the lights danced around ityou could make out the back triangle shape. My father yelled at us to getinside, now He was very upset at what he was looking at. He called someone onthe phoneat the time I assumed it to be the military police. My sister and I glued ourfaces to the sliding glass door watching the object. We could here siren fromthe SP92s coming, about that time the object shot up and vanished. People came to ourhouse asking questions about what we had seen. I was very adamant about what wehad all seen, I was told I had only seen a plane doing test. I was sent to myroom, being a noisy I listened to the adults speak. I heard them talking aboutothers seeing the object, and to assure us the kids it was only a plane and theywould handle it from there on. My father agreed with them. I know something waswrong with what my father had seen with us, appeared to have recognized what hehad seenThere is a lot more about this thing we had seen - I found out later in life.My father told me things I have dared not tell anyone about.What my fatherhas been a witness too and involved in is dangerousYou judge what I have said here, I trust nobody in this matter"],"Disposition":"Hoax","Country":"United States","Object Features":"Undisclosed","Case Number":"2736","files":["/var/www/straped/mufon/html2text/2736.html.txt","/var/www/straped/mufon/org/2736.html"],"Date of the Event":"11/20/1980 10:00 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"31.327222"}