{"Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-01132011-0002","divs":["Sighting DetailsI was driving down highway 1 towards Jackson, SC from the Savannah River Site at approximately 6:45pm on January 12th.. A light caught my eye near the tree tops. I immediately thought it to be a helicopter or low flying small plane. I am an avid aircraft watcher. I use binoculars sometimes & I know what type lights are used on civilian & military aircraft at night & day. The light looked like an orangish to reddish sphere. It quickly disappeared between my view of the trees & sky. I wrote it off as an aircraft & nothing more, even though I was puzzled that I did not continue to see a moving aircraft after I cleared the tree line & entered Jackson. As I headed towards Beech Island I continued to look for an aircraft in the sky that was flying low but did not see any but the typical high altitude airliner types. As I got towards the Augusta downtown area at Sand Bar Ferry Rd. & 520. I just so happened to look towards where Columbia Nitrogen facility is & saw very quickly the same orangish sphere quickly separate into 2 & disappear. I kept looking out towards the same direction but nothing else appeared. This all while sitting at a red light. I looked at my interior reflection on the window to and moved around to see if anything was just reflecting from the interior to give an illusion but there was nothing remotely resembling what I saw in the sky. Maybe someone had fireworks but then I thought that wouldn't make sense to shoot fireworks over a Nitrogen facility & what about seeing the same thing about 16 miles away. As a side note, I once witnessed something very similar while walking into the parking lot at work. It was night & I saw 5 to 6 orangish spheres in the distance that would be in a line and as the last one to the left disappeared another one would appear to the right and so on until they were all gone. Maybe lasted 10 seconds. I thought that it was probably a military jet just releasing some flares into the sky and as the jet was traveling away it left a line path of the flares that faded out. Almost everyday at my work F-18's fly at high altitude over to Shaw air force base from Warner Robbins AFB. What I saw on the 12th looked similar except I only spotted one sphere & then it would split & disappear with no aircraft sounds at all. Maybe it was just a coincidence & someone was playing with fireworks. I am not really sure. I just wanted to document my observance in case someone has seen anything like what I saw. Maybe I will see it again & get a better view. Right now I don't think it was something incredible but definitely bizarre but hopefully can be explained."],"Case Number":"27376","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"33.478266","trends":["There have been 2 other sightings in Augusta","There were no other sightings in Augusta on or around"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.478266,+-82.00377(27376)&iwloc=A&hl=en\"> mufon case (27376) map </A>","Object Flight Path":"Other","Disposition":"Insufficient Data","Date of the Event":"Unknown","Date Submitted":"01/13/2011 10:40 UTC","Weather Factors":"Unknown","City":"Augusta","Longitude":"-82.00377","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/27376.html.txt","/var/www/straped/mufon/org/27376.html"],"Object Shape":"Sphere","Summary":"Orangish sphere that divides and then disappears","Region":"South Carolina"}