{"Sighting Duration":"Undisclosed","Country":"United States","Latitude":"29.294007","Summary":"Heard helo went out and saw a military helo chasing a orange light.","Longitude":"-97.147641","Date Submitted":"01/12/2011 09:16 UTC","trends":["There has been one other sighting in Yoakum","There were no other sightings in Yoakum on or around January 12th 2011"],"Object Features":"None","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27371.html.txt","/var/www/straped/mufon/org/27371.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.294007,+-97.147641(27371)&iwloc=A&hl=en\"> mufon case (27371) map </A>","Log Number":"US-01122011-0012","Date of the Event":"01/12/2011 07:30 UTC","Case Number":"27371","Disposition":"Unknown","Object Shape":"Sphere","Viewing Distance":"101-500 Feet","Region":"Texas","divs":["Sighting DetailsI was sitting in the livingroom and my mother was in the kitchen and she yelled out that she heard a helo outside. I didnt think anything of it cause I thought it might be a life flight helo, but when the windows and the pictures started to shake on the walls I jumped up and went outside. when I looked up I saw a very large helo military grade flying low chasing what looked to be a orange light. I yelled for my mother to come out and when I looked back the light and helo was changing directions when the helo banked the light went from being infront of it to being under it. The orange light then took off fast and the helo was right behind it. We came in and called the hospital to make sure it wasnt life flight and they said it shook the windows in the hospital and that the ER called to ask if the front desk knew if there was a life flight being called in. The Nurse told them no. the Er then said they thought it was going to land on the roof of the hospital. The nurse even stated that it did not land at the airport across the street. At first I thought it was a plane being chased but there was only one light and it was orange not the red or green that are fixed to the wing tips."],"Tags":"City","Object Flight Path":"Path with directional change","City":"Yoakum","Source":"MUFON"}