{"Latitude":"44.28176","Country":"United States","Date Submitted":"01/13/2011 03:05 UTC","Weather Factors":"Unknown","divs":["Sighting Detailson Jan. 9th 2011 at approxiamately 530 AM, my husband and I were in our bedroom sleeping. Our bedroom has a sliding glass door that looks south in our pasture. I woke up and saw a very bright light about 400 yds from our bedroom door. The object was \"hovering\" in the sky. At first I thought it was a very bright star, but soon after waking up fully, I saw that it wasn't a star. After a few minutes another object rose out of the trees and it was similar to the first object. I was extremely excited and scared and I woke up my husband at that point. We both were looking at the object and I went to find my video camera. After my wife woke me up I saw two bright objects south of our pasture. Both objects appeared to be a few hundred yards south of our house and the lights were nothing that I have ever seen. I heard a few planes fly near our house and each time a plane passed within earshot of me, both objects dimmed their lights. This happened I believe 3 times. After a bit, not sure how long, the object that rose out of the trees behind our pasture started flying north over our house. We did not leave our bedroom to see where that object went. the other object continued to hover, but it seemed that it had \"spikey\" lights around it. The object seemed to go up in altitude and then stop, this went on again for a while. My wife was now videotaping and the object had gone up in altitude where we had to move to another part of the house to videotape it. We video taped it from our dining area window and also our family room window. At times it seemed that the object would move very fast and then stop suddenly, I have never seen anything like this."],"Object Features":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/27378.html.txt","/var/www/straped/mufon/org/27378.html"],"Summary":"one ufo hovered, another ufo flew up out of trees, both hovered then one flew north","Region":"Oregon","Case Number":"27378","Log Number":"US-01132011-0004","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=44.28176,+-121.166671(27378)&iwloc=A&hl=en\"> mufon case (27378) map </A>","Longitude":"-121.166671","City":"Redmond","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Redmond","There were no other sightings in Redmond on or around January 9th 2011","This sighting has never been favorited.",""],"Object Shape":"Circle","Date of the Event":"01/09/2011 06:00 UTC"}