{"Object Shape":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting Details12 January 2011 at 1910 hours, I was on the side of my house facing south-east direction, smoking a ciggerette. To the east, I noticed an extreamly bright object believing it was a planet or satelite initially. Appeared to be flying between 60,000-80,000 feet. It was a clear, visable sky with no cloud coverage. The light began to blink, slowly from dim to bright approx. ever 10 seconds, after flying directly over me(45 seconds after inital sighting). I knew then that this was not a satelite because it was too bright, moving too fast and I've never seen a satelite blink. Not losing sight of this \"blinking light\", I noticed the sound of a military turbine jet engine. I then saw a small military aircraft flying into the same direction(west) as the \"blinking light\" at approx. 5,000ft and climbing fast, several miles behind and below blinking light. I believe the military aircraft had just taken off from a local airport, either Scottsdale or Deer Valley airport, but it was not flying in typical flight pattern of the city. Continued to watch the \"blinking light\" after noticing the military aircraft. Within 3 minuetes, the \"blinking light\" and military aircraft's anti-collision light were both in my field of vision. The \"blinking light\" then changed direction to the north. After 3 minuetes of \"blinking light\" traveling northern direction, it appeared to hover, remiaing stationary at 60,000-80,000ft. I was able to see the single military jet's anti-collision light still catching up in direction, yet behind \"blinking light.\" At this point, I lit another ciggerette and began to simply watch it \"hover\" for another 5 minuetes when I lost sight of military jet. 30 seconds after losing sight of military jet, I had to go back inside to answer a call. Didn't go back outside when I was able to an hour later."],"Case Number":"27377","Longitude":"-112.066647","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Date of the Event":"01/12/2011 07:10 UTC","Date Submitted":"01/13/2011 02:53 UTC","Latitude":"33.453877","Log Number":"US-01132011-0003","Viewing Distance":"Over One Mile","Source":"MUFON","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around January 12th 2011"],"Object Features":"None, Unknown","City":"Phoenix","Tags":"City","Region":"Arizona","files":["/var/www/straped/mufon/html2text/27377.html.txt","/var/www/straped/mufon/org/27377.html"],"Summary":"High altitude, bright blinking light with military jet following.","map":"<A HREF = \"http://maps.google.com/maps?q=33.453877,+-112.066647(27377)&iwloc=A&hl=en\"> mufon case (27377) map </A>","Weather Factors":"Windy","Disposition":"Unknown"}