{"Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Selma","There were no other sightings in Selma on or around December 1st 2010"],"Date of the Event":"12/01/2010 06:30 UTC","Object Features":"Unknown","Object Shape":"Star-like","Object Flight Path":"Stationary","Case Number":"27375","Longitude":"-87.019501","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/27375.html.txt","/var/www/straped/mufon/org/27375.html"],"Summary":"UFO resembles Venus in South Western sky.","Weather Factors":"None","divs":["Sighting DetailsMy brother pops his head in the door to tell my other brother and I that the International Space Station is going to make a fly over. When we get outside I was ask \"What's that star over there\", being an amateur astronomer for over twenty-five years I had immediately noticed as soon as I got out doors that Venus was conspicuously bright in the South West sky. As high and bright as it gets, I had noticed it's bright blue white color and it's position approximately forty degrees above the SW horizon along the ecliptic. I tell them what it is and continue setting up my camera and tripod. The station comes over and the evening is uneventful. Two days later it hits me that Venus is not in the Western sky now, at that time I wasn't keeping up with planetary positions but had been out looking at the sky a couple of days earlier. Sure enough I open my astronomy software and see that Venus is close to the Sol in the morning sky. There I was with my camera on a tripod with a stationary UFO and didn't get any pictures. I have plenty of Pictures of Venus and waiting to get an image of the ISS I didn't want to setup my camera for Venus when the Station was about to come over. Too bad I missed this opportunity because I could have gotten some great photos of the object however all that would have been seen would have been a light source in the night sky. I would have liked to get a look at it with my eight inch Schmidt Cassegrain scope. Observations: 1. The Object looked stellar (outside the atmosphere). 2. The Object must have been using a lot of energy to put out that much light. 3. Position 40 degrees above SW horizon along the Ecliptic. 4. Looked exactly like Venus, Color, Brilliance were the same.It was positioned along the ecliptic. 5. Object was not Jupiter, Mars, Sirius, or any of the other bright stars around Orion. 6. Object was stationary during entire event. 7. Three Witnesses. 8. Location: Valley Grande, Alabama. Three miles north of Selma, Alabama. 9. Time: Evening astronomical twilight."],"Date Submitted":"01/13/2011 12:48 UTC","Source":"MUFON","Country":"United States","Tags":"City","City":"Selma","Log Number":"US-01132011-0001","map":"<A HREF = \"http://maps.google.com/maps?q=32.417199,+-87.019501(27375)&iwloc=A&hl=en\"> mufon case (27375) map </A>","Region":"Alabama","Latitude":"32.417199","Viewing Distance":"Unknown"}