{"Object Features":"Undisclosed","Object Shape":"Other","Latitude":"45.438816","divs":["Sighting DetailsI had been walking around the area of the Rialto Bridge in Venice on the evening of 8 Dec 2008. Sunset had occurred around 5 PM local time. The day had been overcast with periods of light rain. I had just finished crossing the Rialto Bridge moving southeast and was walking along the canal side to the northeast. I had been taking some night pictures of the holiday lights using my Nikon Coolpix L20 camera. As I worked my way away from the foot of the bridge about 100 yards, I noticed the people around me looking up. As I looked up and to the west I noticed a group of three objects at approximately 500 feet above the city moving west to east. The objects emitted no audible sound and were changing color from orange to red. The objects were in formation, one behind the other and separated by 20 feet. The objects' shape were roughly globe shaped, somewhat like a Chinese lantern. The first group of three past to the east with no sound of any kind. Nor were there any contrail or smoke. No smell of exhaust such as jet fuel was evident. A second group of three again approached from the west and at the same height of as the first. With the second group I had the presence of mind to lock on the middle object and pan with it as it passed. The resulting picture is attached here. Again as with the first set of three there were no sounds associated with the object, no smoke or contrail. Thinking the display was over, I started back towards the bridge and was at the foot of it when a third set of objects passed directly over the bridge. In total nine objects were observed, but no sound was associated with them. No engine noise, no rotor noise as with a heilo, no exhaust, no smoke or contrail. After the initial surprise of the objects, I simply watched as the objects flew in a straight line over the area and disappeared to the east."],"files":["/var/www/straped/mufon/html2text/27383.html.txt","/var/www/straped/mufon/more/27383_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/27383.html"],"Longitude":"12.346784","Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"00:10:10","Disposition":"Unresolved","Weather Factors":"Unknown","Summary":"3 groups of 3 objects each passing over Venice 8 Dec 2008","Object Flight Path":"Undisclosed","City":"Venice","Source":"MUFON","Case Number":"27383","Date Submitted":"01/14/2011 12:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.438816,+12.346784(27383)&iwloc=A&hl=en\"> mufon case (27383) map </A>","Log Number":"IT-01142011-0001","Country":"Italy","trends":["There have been 5 other sightings in Venice","There were no other sightings in Venice on or around December 8th 2008","This sighting has never been favorited.",""],"Date of the Event":"12/08/2008 07:10 UTC","Region":"Veneto"}