{"map":"<A HREF = \"http://maps.google.com/maps?q=38.629152,+-90.196704(27384)&iwloc=A&hl=en\"> mufon case (27384) map </A>","divs":["Sighting DetailsDriving home from work on Kingshighway south in St. Louis city, close to my house I suddenly realized there were two steady lights almost directly in front of me, just to the left, just a little up into the sky as if it might be a low flying helicopter, about a nickel's diameter in relative size. \"As the crow flies\" they would have been over my house. I hadn't noticed it come into my field of vision, but suddenly noticed that they were moving very slowly, left to right, although they curiously appeared to be a possible plane banking to the left - but moving right? The lights were not blinking, were definitely white circles or spheres, and there were no FAA required green nor red lights visible now nor during the entire sighting. Kingshighway is two lanes in each direction and the road was very busy with evening commuters like me, so the sighting was via multiple short looks while driving safely. I shortly noticed a small circle of light appear just by the right light, slowly \"descending\" into an equilateral triangle position relative to the other two lights, and became the same size as them. The triangle of lights then appeared to slowly \"elongate.\" I was figuring I was seeing single craft with lights that was changing its orientation while traveling, so I'm still thinking some kind of helicopter when a small fourth circle of light starts to appear between the two \"rear\" lights. While that light became slightly larger, but not as large as the other three lights, two \"lines\" of light started to appear between each of the rear circles. Those lines also became slightly longer, while the \"front\" circle became a thick white line having \"grown\" back some. During the perhaps two minutes of the sighting, the object(s) seemed to get slightly closer where it seemed a craft had slowly curved along the sky while I was driving. I started losing it in the trees and buildings almost directly right of me when the object got there. Most of the sighting I could see the object out my front windshield, but when I had to look out my right passenger window I deviated from my course and took a right to try to get a better look. I was now driving residential city side streets that are rutted with snow and ice - I glimpsed it only a few short times and quickly lost it through the neighborhood trees and houses. Getting home about three minutes later, I parked my car in my driveway and started walking to my front stairs and suddenly I heard a plane start to fly by from my left, coming from behind my house from over the large cemetery across the street. I could clearly hear jet engines but saw an incongruent triangle of steady red lights with a blinking white light between them! I see planes go by my house ever day, being about six miles from the international airport, but I've never seen a plane with all its tipped beacon lights steady red with a bottom blinking white beacon. I continued walking up my stairs and stood and watched for about 30 seconds until I lost it in the nearby trees and homes, never changing that lighting configuration. Ironically, this plane came from the direction where white lights were when I lost them about three minutes before. I've attached a created representation of the changing of the white lights, and punctuated it with the plane I saw when I got home. When I got in I discovered that one of my computer's main disk drives had failed :("],"Country":"United States","Tags":"City","Object Shape":"Circle, Triangle, Other","Date of the Event":"01/13/2011 05:46 UTC","Longitude":"-90.196704","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"01/14/2011 12:48 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/27384.html.txt","/var/www/straped/mufon/more/27384_submitter_file1__201101131746.JPG","/var/www/straped/mufon/org/27384.html"],"Object Features":"Undisclosed","Disposition":"Hoax","Latitude":"38.629152","Case Number":"27384","City":"St Louis","Viewing Distance":"Unknown","Log Number":"US-01142011-0002","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around January 13th 2011","This sighting has never been favorited.",""],"Region":"Missouri","Summary":"Two lights slowly move from front left to right and more lights appear","Weather Factors":"Unknown"}