{"Source":"MUFON","Weather Factors":"Snow","Object Features":"Undisclosed","Date of the Event":"01/13/2011 06:30 UTC","Longitude":"-83.545932","Date Submitted":"01/14/2011 09:39 UTC","trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around January 13th 2011"],"Object Shape":"Triangle","Object Flight Path":"Straight-line path","Tags":"City","City":"Toledo","Case Number":"27386","Viewing Distance":"501 Feet - 1 Mile, Unknown","Country":"United States","Latitude":"41.665818","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.665818,+-83.545932(27386)&iwloc=A&hl=en\"> mufon case (27386) map </A>","divs":["Sighting DetailsI woke up at approx. 6:30 a.m. on Thursday, Jan. 13, 2011 and looked out the bathroom window (facing North) to see if it was snowing. I saw what I thought was an airplane in the Northern sky. Since we live near Metcalf Airfield, thought it was just another private plane coming in for a landing. As it came closer, it looked too large to be an airplane and it looked to be triangular, with white lights all around it. Then at one time as I watched it, the lights went out and red lights came on for a few seconds, then they went out and white lights came on again. I didn't hear any sound. I watched it until it passed over our house and headed South, but did not see it overhead to get a better description, since it was too cold to go outside and observe. I drew a sketch of what I saw to the best of my ability. If it was an airplane with lights around it, it would have to have been travelling tail-end first heading South because of the way the lights were around it and the way it was moving. I faxed the sketch copy to Lake Twp. Police and I don't know if it was ever determined to be an aircraft. Having lived in this area for over 40 years, I see airplanes very often in the sky at night and early morning, but this was definitely different."],"Summary":"Triangular shaped aircraft cruising above with white lights around it, changing to red, then white.","Sighting Duration":"00:10:00","Region":"Ohio","files":["/var/www/straped/mufon/html2text/27386.html.txt","/var/www/straped/mufon/org/27386.html"],"Log Number":"US-01142011-0004"}