{"Date Submitted":"01/13/2011 08:12 UTC","Summary":"Bright white circular object in the sky.","trends":["There have been 4 other sightings in Braintree","There were no other sightings in Braintree on or around January 10th 2011"],"Object Flight Path":"Hovering then path","Region":"Massachusetts","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.230638,+-70.996057(27380)&iwloc=A&hl=en\"> mufon case (27380) map </A>","Longitude":"-70.996057","Disposition":"IFO","Tags":"City","Source":"MUFON","Object Shape":"Circle","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"42.230638","Case Number":"27380","City":"Braintree","Date of the Event":"01/10/2011 02:30 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/27380.html.txt","/var/www/straped/mufon/org/27380.html"],"Log Number":"US-01132011-0006","divs":["Sighting DetailsMy husband and I were on our way back home heading South where I stopped at a traffic light. Something just happened to catch my eye and in the sky right ahead of us was this very strangely shaped object. In my mind I was not thinking \"UFO\" at all but just \"what is that weird thing I am looking at?\" It was circular shaped and looked like the sun was reflecting off it in a serious way. I thought it was a plane or weather balloon or something except that I had never seen one with such a bright white light. It almost looked like it was made out of glass or something. The middle of it was not shiny but almost seemed transparent in the clear blue sky. What was most noticeable was the shiny, shiny bright white light. I said to my husband \"what the heck is that??\" and pointed. He said \"where?\" and was looking around but didn't know I meant up in the sky or just wasn't looking in the right place. It was a bit high in the sky - like as high as I might see a plane or helicopter or whatever. I repeated \"right there!\" and kept pointing but it started to move horizontally to the left until a nearby tree was crossing the sight of it. I tried to keep my eyes on it and the light turned green so I drove forward so I could get passed the trees to show my husband what I had been looking at. But when I got passed the trees (maybe 5 seconds later) it was nowhere to be seen. My husband asked \"well what did it look like?\" so I described the thing and that was when he said \"I think you just saw a UFO\". After a moments thought I came to the conclusion that he might be right. I had never seen such a thing in my life. When I saw it I genuinely was simply curious as to what this strange thing might be. Never in my life might I think I would be reporting such a thing. I am in complete awe of what I saw and can not find any other logical explanation. It occurred to me that it could have been some sort of reflection on my wind shield but no matter how I tried I could not re-create the thing. I am about 100% sure that whatever it was it was definitely there in front of us in the sky. At the speed it was traveling there is no feasible explanation as to where it could have disappeared to s quickly either."],"Sighting Duration":"Undisclosed"}