{"Summary":"Saw craft as a child","Sighting Duration":"00:05:00","Viewing Distance":"21-100 Feet","Country":"United States","Disposition":"Insufficient Data","Weather Factors":"Unknown","Case Number":"2738","City":"Martinsburg","trends":["There have been 9 other sightings in Martinsburg","There were no other sightings in Martinsburg on or around September 30th 1980"],"Object Features":"Undisclosed","divs":["Sighting DetailsI was 7 years old and in the back seat of the car on my way to my grandmothers.My parents were in the front seat and my sister in brother were in back with me,but to young I believe to notice or anythingthey were 4 and 2. We came to astop at the end of the trailer park getting ready to enter the main roadway andI just happened to look up at the shy through the rear window of the car and sawthe object. It was a clear night sky and the object blocked out directly abovestars. It was black and perfectly triangular. It was maybe 20-30 feet above ourvehicle. Immediately I became excited and started telling my parents to look atthe aliens ship. They however didnt and were involved in telling me it was aplane from the nearby Air National Guard. I remember trying to tell them itwasnt but being unable to explain. However something told me t was not a plane. It was very slowly moving, just faster than a hovering craft, and it wassilent. I heard nothing or saw no lights or anything else, just the triangularobject that was jet black against the sky and clearly oultined as a triangle andblocking out my vision of otherwise clearly visible stars. My father thenpulled onto the main road and I lost sight as we drove away and just felt verycalm about what I had seen. I just always thought this was wild and alwaysthought about the object, because until the past few years I had never heard oftriangular shaped ufos, only saucer shaped."],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/2738.html.txt","/var/www/straped/mufon/org/2738.html"],"Longitude":"-77.956327","Region":"West Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=39.46232,+-77.956327(2738)&iwloc=A&hl=en\"> mufon case (2738) map </A>","Date Submitted":"09/30/1980 12:00 UTC","Source":"MUFON","Tags":"City","Date of the Event":"09/30/1980 12:00 UTC","Latitude":"39.46232","Log Number":"","Object Shape":"Triangle"}