{"Disposition":"Insufficient Data","divs":["Sighting DetailsWent outside to smoke a cigarette at approximately 6:15 pm on January 12. After a minute or two I noticed a bright light high in the northern sky moving towards the south. I first thought it to be a flood or landing light on a aircraft but then realized it was too big and bright and never lost its intensity. I then opened the door and asked my wife to come outside and see if she could make it out. My wife and sister came outside and witnessed the obect. They too could not identify it because it had no distinct shape or lights of any color. It appeared as a bright star moving quickly but at a steady pace then instantly switched direction at the edge of Ft. Benning towards the southeast. We watched it for a minute or so then my wife and I went back inside because it was rather cold outside. My sister stayed outside for another minute or so and came in and said that it continued towards the southeast then turned into a glowing red color that faded and then the obect was gone. My sister noted the time was 6:22 pm. WE watched the news to see if anything would be reported but no such luck. I would have thought that others had to see this object."],"files":["/var/www/straped/mufon/html2text/27398.html.txt","/var/www/straped/mufon/org/27398.html"],"Region":"Georgia","trends":["There have been 22 other sightings in Columbus","There were no other sightings in Columbus on or around January 12th 2011"],"Object Features":"Undisclosed","Object Shape":"Star-like","Date Submitted":"01/14/2011 09:32 UTC","Summary":"On January 12th near Ft. Benning Georgia, I seen a unusally bright star-like obect at a high altitude move from the north to south then switched direction towards southeast.","Weather Factors":"Unknown","Date of the Event":"01/12/2011 06:18 UTC","Source":"MUFON","Case Number":"27398","Viewing Distance":"Unknown","Log Number":"US-01142011-0016","Longitude":"-84.980159","Latitude":"32.466056","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.466056,+-84.980159(27398)&iwloc=A&hl=en\"> mufon case (27398) map </A>","Object Flight Path":"Undisclosed","Sighting Duration":"00:04:00","Country":"United States","City":"Columbus"}