{"Date of the Event":"01/01/2011 03:00 UTC","Weather Factors":"None","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.958047,+-93.104709(27397)&iwloc=A&hl=en\"> mufon case (27397) map </A>","Source":"MUFON","Summary":"Three bright white lines with two dots. the dots were stationary while the lines slowly moved towards the dots. They seem to flutter like heat waves.","divs":["Sighting DetailsI was driving in rush hour traffic in the city. I was facing west in crawling traffic. The sun was low in the clear sky. As I creeped along,I was facing the sun, and couldn't wait to get under the over pass to block it. When I got that far, I could look towards the sun without blinding myself. While I was looking up, I first noticed a bright dot in the sky, just right of the sun. I thought it was wierd because it was in the foreground and should be dark. I continued to creep along and try to keep an eye on the dot. As traffic began to flow, I would look up each time I was facing west. The dot was still there and then, there were 2 bright white lines that were the same height in the sky and close to the dot. Now I was really curious, again, there were no clouds and the sun was setting by now so it was weird that they were so bright and were \"shimmering\" like heat waves on hot pavement. Then as I sat at a red light, faceing west, I was amazed to see a third white line and a second dot. The dots seemed to be stationary while the white lines slowy moved towards the first dot. Then my street light turned green, I had to go. When I got to my destination, I quickly tried to go see the horizon again, but they had been slowly going the direction of the sun, not staying over one spot. And the sun was going down. I know what I saw and even called someone while I was driving(remember, crawling in traffic) to ask them to go outside and see if they could see what I could see but they weren't in a good spot to look west. I was mad at myself for not having my camera on me. Not sure if it would have picked up the image. (Facing the sun) I can assure you, it was not whispy clouds or stars. I saw something unidentifiable. In the past, late at night I have seen a small white object (not satellites)cross the sky and change direction, but kept it to myself. This latest one was worth mentioning. I'll be keeping my eyes on the sky from now on, And will surely have my camera with me."],"Object Shape":"Other","Object Features":"None","Log Number":"US-01142011-0015","Viewing Distance":"Unknown","Latitude":"44.958047","files":["/var/www/straped/mufon/html2text/27397.html.txt","/var/www/straped/mufon/org/27397.html"],"Date Submitted":"01/14/2011 09:23 UTC","Tags":"City","trends":["There have been 22 other sightings in St Paul","There were no other sightings in St Paul on or around January 1st 2011"],"Longitude":"-93.104709","City":"St Paul","Region":"Minnesota","Object Flight Path":"Stationary,Hovering then path","Case Number":"27397"}