{"Tags":"City","Date Submitted":"01/14/2011 03:44 UTC","Sighting Duration":"Undisclosed","Case Number":"27393","Summary":"It was like a missile or a burning satellite in the atmosphere","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 31st 2009"],"Country":"United States","Latitude":"34.209097","map":"<A HREF = \"http://maps.google.com/maps?q=34.209097,+-118.51371(27393)&iwloc=A&hl=en\"> mufon case (27393) map </A>","Longitude":"-118.51371","City":"Los Angeles","Region":"California","Object Features":"Undisclosed","Log Number":"US-01142011-0011","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Straight-line path","Date of the Event":"07/31/2009 12:00 UTC","divs":["sighting detailsi had dismissed this because i thought there was a reasonable explenation for this, but then i read online another ufo report just like this and in the same county around the same time i saw mine. it was dark out i was walking to a 7\\11 on corbin and vanowen, going east about a block away. i looked up and saw a red fireball with like an amber glow around it shooting about east across the sky though i think it vanished towards the end because i had looked away for a split second and looked up and there was nothing. it was very large and bright, not an airplane but looked to me like what a satelite or some kind of missile would look like as it burned and streaked. it was breaking up and had 2 larger chunks trailing behind slightly spreading as it went. it was too slow for a comet or a meteorite and too low in altitude as well, but not any aircraft. it was very bright like an led. and it had a glowing like tail like a comet. i thought it was a plane blowing up, but never heard or read anything in the news about it. just a matching ufo report so i thought id share. thanks"],"files":["/var/www/straped/mufon/html2text/27393.html.txt","/var/www/straped/mufon/org/27393.html"],"Weather Factors":"Unknown","Object Shape":"Bullet, Missile, Star-like, Teardrop","Disposition":"IFO","Source":"MUFON"}