{"Country":"Canada","Summary":"UP CLOSE ENCOUNTER","Viewing Distance":"101-500 Feet","Object Features":"Other","Latitude":"46.733319","Tags":"City","trends":["There have been no other sightings in Marten River","This sighting has been favorited 1 time."],"Region":"Ontario","Date of the Event":"09/30/2001 12:00 UTC","divs":["Sighting DetailsFirst I would like to say that this was not MY experience, but one that I ampassing on from my grandparents. Both are embarrassed by this experience and donot wish to talk about it... although I feel it is important for someone else toknow. My grandparents told me about their personal encounter at our familycottage in the fall of 2001. My grandmother had set the alarm for 4am to get upto view a meteor shower, but she awoke early and went to get a glass of water inthe kitchen. She looked out the front window to the north and noticed what shethought was the aurora borealis. So, she returned to the bedroom to get herglasses and came back, stunned by how beautiful they were she once againreturned to the bedroom, only this time to wake my grandfather. They decided toget a better view and go outside. They were viewing the north from our deckoutside with the cottage behind them to the south they told me for what theythought was close to 10 minutes. Finally my grandmother turned around only tosee as she described it a disc, hovering less than 5 feet above the trees. Mygrandfather described it to me as more umbrella shaped. It was very large and tothe southeast just over the rear of the camp and the very tall about 50 feetspruce trees behind the camp. They described colourful streams of light floatingdown from the object as how a neon light blub has bubbles through it when itsstarting to burn out. My grandmother and grandfather both saw the colourfulbubbles floating off the craft. They told me they felt calm, and not threatenedin any way. They told me they stood there, quiet, watching the object not morethan 400feet away for nearly 20 minutes. And as my grandmother described it, themosquitos came out of nowhere and persuaded them to return to bed. I was shockedto hear this because the object remained above the camp as they went backinside. They told me again they felt safe and went back to sleep. I would reallylike to discuss this with someone who is somewhat qualified in the area of UFOsightings. Thank you for your time."],"Disposition":"Unresolved","Object Shape":"Disc","City":"Marten River","files":["/var/www/straped/mufon/html2text/2740.html.txt","/var/www/straped/mufon/org/2740.html"],"Longitude":"-79.801731","Date Submitted":"09/30/2001 12:00 UTC","Log Number":"","Sighting Duration":"00:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=46.733319,+-79.801731(2740)&iwloc=A&hl=en\"> mufon case (2740) map </A>","Weather Factors":"Fog","Source":"MUFON","Object Flight Path":"Stationary","Case Number":"2740"}