{"Longitude":"-86.224302","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Santa Rosa Beach","Country":"United States","Summary":"Bright light in sky brighter than all other stars. Not a planet.... Too bright! Stationary. Only visible after330 am central timezone until","files":["/var/www/straped/mufon/html2text/27403.html.txt","/var/www/straped/mufon/org/27403.html"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.399572,+-86.224302(27403)&iwloc=A&hl=en\"> mufon case (27403) map </A>","Latitude":"30.399572","Date of the Event":"01/15/2011 03:44 UTC","Log Number":"US-01152011-0003","Tags":"City","Case Number":"27403","trends":["There have been 2 other sightings in Santa Rosa Beach","There were no other sightings in Santa Rosa Beach on or around January 15th 2011"],"Source":"MUFON","divs":["Sighting DetailsFor the last week or so I have not been sleeping well so I will usually go outside and look around. I have noticed one light in particular in different spots on different nights. Mostly in the south eastern sky over the gulf of mexico. Strangely it is only visible after usually of what seems to be the hours of 330 a.m- ? It has been cold so I have not actually sat to watch it. But recently I have been checking on it when I do see it and it will remain stationary and then will just be gone after a couple hours. I am looking at it now and it is actually now showing different lights ! This is crazy! I don't know if it is playing tricks on my eyes but there is something definitely different and unusual going on here. It has been here every other night. I have flashed lights at it to try and get a response but I think it is to far away. But I can't really tell. It honestly doesn't look but to be a couple miles high. It is easily the brightest light in the sky and sticks out like a sore thumb. Someone please help me understand this!"],"Region":"Florida","Object Shape":"Star-like","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Date Submitted":"01/15/2011 06:03 UTC","Viewing Distance":"Unknown"}