{"Object Shape":"Other","Longitude":"-115.165916","Sighting Duration":"Undisclosed","City":"Las Vegas","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 22nd 1983"],"Region":"Nevada","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.119356,+-115.165916(27408)&iwloc=A&hl=en\"> mufon case (27408) map </A>","Date of the Event":"12/22/1983 02:30 UTC","Latitude":"36.119356","files":["/var/www/straped/mufon/html2text/27408.html.txt","/var/www/straped/mufon/org/27408.html"],"Summary":"RECTANGULAR OBJECT ON GOLD ROAD BEHIND ME-A MILLION DANCING LIGHTS IN THE REAR VIEW MIRROR-A HOLE IN THE NIGHT SKY- LIGHTS PASSED THROUGH-THEY TAILGATED US !","divs":["Sighting DetailsSUDDENLY, IN THE REAR VIEW MIRROR, I SAW RECTANGULAR WINDOWS LIT INSIDE WITH SOMETHING ALIVE ( I HESITATE TO SAY THEY WERE HUMAN) MOVING AROUND INSIDE. I COULD NOT SEE THE SHAPE OF THE CRAFT, ONLY THE WINDOWS. ALMOST IMMEDIATELY, AFTER CHECKING THE ROAD (AS I WAS DRIVING), I SAW A REAR VIEW MIRROR FULL OF LITTLE DANCING LIGHTS THAT WERE DANCING IN PLACE. AN INSTANT LATER THE LITTLE LIGHTS WERE NO LONGER VISIBLE, BUT A BLUE AREA WAS VISIBLE WITH A LITTLE LIGHT ADJACENT TO THE OPENING. I THOUGHT THE LITTLE LIGHT WAS THE FIRST STAR I SAW THAT NIGHT, BECAUSE IT WAS THE DARKEST NIGHT I HAD EVER SEEN.A FOGGY HAZE HAD ENVELOPED THE LITTLE LIGHT JUST BEFORE I SAW TWO MORE LIGHTS, ABOUT THE SAME SIZE AS THE FIRST LIGHT,COME INTO THE OPENING AS IF THEY HAD COME FROM BEHIND A CURTAIN (WHICH WAS THE BLACK NIGHT SKY). THEY PASSED THROUGH THE OPENING AND JOINED THE FIRST LIGHT. THE OPENING DISAPPERED AND THE THREE LIGHTS, BEING IN A RANDOM FORMATION, CAME UP BEHIND THE CAR AS FAST AS YOU COULD BLINK YOUR EYES. THEY WERE SO STILL, THEY LOOKED AS THOUGH THEY WERE GLUED TO THE REAR WINDOW. THEY MADE NO SOUND. THEY WERE ABOUT FIVE FEET ABOVE THE GOLD ROAD, ABOUT THREE FEET APART, AND ABOUT FIVE INCHES IN DIAMETER. AFTER SOME TIME, TWO OF THE LIGHTS MOVED AS IF TO PASS ON MY RIGHT SIDE, THEN THEY DISAPERED,ONE LIGHT STAYED WITH US JUST BEFORE WE WERE GOING TO CROSS HOVER DAM. THE LIGHT WOULD NOT COME INTO THE LIGHTED AREA WITH US. THE LIGHT DISAPERED JUST BEFORE THE LIGHTED AREA. DURING ALL THE EVENTS TAKING PLACE, I WAS TRYING DECIDE IF THESE LIGHTS WERE MOTOR CYCLES, A BIG TRUCK, A BUS OR A CAR. I DID NOT CONSIDER AT THE TIME THAT THESE LIGHTS MIGHT BE OUT OF THIS WORLD. HOW CAN A HOLE APPEAR IN THE NIGHT SKY AND LIGHTS PASS THROUGH IT? HOW IS THAT POSSIBLE? I WAS NOT UNDER THE INFLUENCE OF ANYTHING! I WAS NOT EVEN TOO TIRED TO BE DRIVING! I WAS ON THE GOLD ROAD TO LOS VEGAS. JUST CHECKING THE REAR VIEW MIRROR. I THOUGHT THE FIRST OBJECT WAS A BUS OR TRAIN. MY FEELINGS WERE NORMAL, I WAS NOT STRESSED, WORRIED, OR AFRAID. I KNOW WHAT I SAW WAS REAL,I JUST DONT KNOW FOR SURE WHAT THEY WERE. I HAVE NOT EXPERIENCED ANYTHING LIKE THIS SINCE 1983."],"Viewing Distance":"20 Feet or Less, Unknown","Source":"MUFON","Log Number":"US-01152011-0008","Case Number":"27408","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"01/15/2011 02:51 UTC","Object Flight Path":"Path with directional change,Unknown","Object Features":"Window(s), Unknown","Weather Factors":"None, Does Not Apply"}