{"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=34.059564,+-118.241845(27400)&iwloc=A&hl=en\"> mufon case (27400) map </A>","Viewing Distance":"Unknown","Longitude":"-118.241845","Disposition":"IFO","Source":"MUFON","Object Flight Path":"Path with directional change","City":"Los Angeles","Date of the Event":"01/14/2011 05:55 UTC","Date Submitted":"01/14/2011 11:56 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around January 14th 2011"],"Sighting Duration":"Undisclosed","Case Number":"27400","Tags":"City","Region":"California","Country":"United States","Log Number":"US-01142011-0018","Object Features":"Unknown","divs":["sighting detailsi was sitting outside of the staples center in downtown los angeles waiting to go to work in that building. i was early so i reclined on one of the large, cylindrical concrete sculptures outside of the entrance near the convention center (essentially lying on my back). i was looking upward at a patch of sky that was between the staples center and nokia center. as there was a lakers game this night, there was commotion on the street and numerous spot lights were shining into the sky, criss-crossing each other. i was watching these crossing lights and noticed that when one looked at a star, one could create an optical illusion such that the star looked like it was moving slowly in relation to the moving spotlights. oddly, while observing this phenomenon, my eyes caught a small, orange, star or planet-like object that was genuinely moving. i knew it was moving for real as opposed to the optical illusion i was noticing because i compared its motion to the stability of sky-scrapers and stars. my heart began to race and i stood up still watching the object. it was darting across the sky at a quick but not exceedingly fast rate. it moved in seemingly random directions without stopping at all when it changed direction. my first thought was that it was a reflection of some kind (perhaps a laser pointer) off of overcast\\clouds\\smog but the sky was clear enough to see stars even in downtown. i wanted to call someone's attention to what i was seeing but did not want to lose sight of the object. i considered the possibility of a helicopter but it was evidently much higher than a helicopter could possibly fly and moving in ways a helicopter could not. it covered relatively large areas of sky in no time at all, but not such large areas as to seem completely impossible, but i have absolutely no knowledge of any human vehicle that could move in the same way. i watched the light move around the sky for about 10 to 20 seconds. the light eventually moved over the staples center from my perspective and i could no longer see it. i walked partially around the building and was not able to locate it again. my immediate reaction was a sense of some panic and shock. i am a college educated person. i am no ufo \"nut\" or devotee. i have never been opposed to the idea of extra-terrestrials but i also have maintained skepticism. i have never actively sought a ufo. i have no real reason to believe that this incident does not have a logical explanation, but i can't think of what it would be. i know what i saw, i just don't know what it was."],"Latitude":"34.059564","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27400.html.txt","/var/www/straped/mufon/org/27400.html"],"Summary":"Small, orangish light. Darting in seemingly random directions at a moderate-fast rate"}