{"Longitude":"-84.798197","Object Shape":"Unknown","Viewing Distance":"Unknown","Region":"Georgia","City":"Newnan","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"01:20:30","Disposition":"Insufficient Data","divs":["Sighting DetailsIn July, 1985 for my 7th Birthday I was given a Tasco Telescope and I was a SUPER space nut. In December 11-12 th in 1985 the Geminid Metor Shower was going to take place, but it was going to be at 11pm-3am before you could see it well so I went to bed at 2:00pm that afternoon and my father promised to wake me to see it at 11pm. At 11pm or right after Johnny Carson went off, my Dad came and woke me and I took my telescope outside. I was SUPER excited to watch \"Falling Stars\" for the first time and we watched for a while. About 12 or later, my Dad gave up and went inside. I was standing on a HUGE back porch that was about 1000 square feet. In the back we had a pasture and a barn to the left so there was pleany of open room for viewing. All of a sudden, from behind me going west to east was a HUGE form in the sky. It was flat on the bottom and the size of at least 3 football fields as it took up most of the viewing sky. I saw a ton of small lights that were weird white color and now know they were LED type color. My first thought was that it looked like a flying battle ship or aircraft carrier. I remember feeling intrigued and not scared, but still get emotional and teary when I think on it. I was thinking how suprised of its size and how low it was flying. Couldnt have been more than 1000 feet in the air if that. Since it was dark, I could not make out any defining features. But it was moving slow..and was going west to east. Then what happened next was strange, I had lost time. I was looking at the object and the whole time could not have been more than 30 seconds before it happened. I heard my dad call my name and say it was cold, 2am..and I needed to get my butt back inside. I was looking at the sky still and the UFO was gone. I was confused but not lightheaded or anything. I didnt tell him as I knew he would make fun of me or think I was lying..and my father was NOT forgiving with lying or pranks. There is NO doubt in my mind this happened and I saw it. I have been in Military Intelligence and had a Top Seceret Clearance. I am a very reliable witness and doing research and reporting myself I tell you you can take out fatique, dosing off, or any other explaination of this other than I SAW it."],"Country":"United States","Log Number":"US-01162011-0009","files":["/var/www/straped/mufon/html2text/27419.html.txt","/var/www/straped/mufon/org/27419.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.382372,+-84.798197(27419)&iwloc=A&hl=en\"> mufon case (27419) map </A>","Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 4 other sightings in Newnan","There were no other sightings in Newnan on or around December 12th 1985"],"Latitude":"33.382372","Summary":"Huge UFO seen during Geminid Metor Shower","Tags":"City","Case Number":"27419","Date of the Event":"12/12/1985 12:00 UTC","Date Submitted":"01/16/2011 04:57 UTC"}