{"City":"Brandenburg","files":["/var/www/straped/mufon/html2text/27417.html.txt","/var/www/straped/mufon/org/27417.html"],"Sighting Duration":"Undisclosed","Date Submitted":"01/16/2011 03:56 UTC","Date of the Event":"11/30/1994 10:00 UTC","divs":["Sighting Details At home at night after rainstorm, I went outside onto the front porch and stood at the corner of it facing toward town. I looked up at the sky and noticed a very dark cloud. While looking at the cloud, suddenly, there was a greyish white light that revolved around in the cloud. As the light went around from left to right, the light would disappear as if there were a solid object inside the cloud, only to reappear again, as if making a trip around a solid object. This occurred a few times, until there appeared a second light following the first one. They both revolved around the solid object a few times, until on one revolution, the second light caught up with the first light, and merged together, forming only one light revolving around object. I immediately thought the object was a UFO, and it was just silently hovering inside the dark cloud, making no noise whatsoever. I was not afraid while watching the revolving lights. I felt calm, and I had asked my mother to come out and look at it and she did, but for only a few seconds, then she went back inside her house, but I stayed there looking at the light revolving around the solid object. The object just hovered noiselessly inside the huge cloud. It appeared to be so low in the sky, I felt I could throw a rock at it, to describe how low it was. I thought the object had to be the size of a football field. That's the best description I can give concerning the incident. I stood watching the object about ten minutes, then, I just calmly went inside the house. The object remained in the cloud as I left."],"Tags":"City","Region":"Kentucky","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Latitude":"37.998959","Longitude":"-86.169414","Object Flight Path":"Stationary","Weather Factors":"None, Rain","trends":["There have been no other sightings in Brandenburg","This sighting has never been favorited."],"Object Shape":"Circle","Object Features":"Unknown","Log Number":"US-01162011-0007","map":"<A HREF = \"http://maps.google.com/maps?q=37.998959,+-86.169414(27417)&iwloc=A&hl=en\"> mufon case (27417) map </A>","Disposition":"IFO","Summary":"Observed stationary object in cloud at night with revolving white light circling it after rainstorm.","Case Number":"27417"}