{"Region":"Maryland","Summary":"Odd bright light in sky gliding about in odd patterns. Witnessed by multiple individuals.","Longitude":"-76.770578","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","City":"Charlotte Hall","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/27423.html.txt","/var/www/straped/mufon/org/27423.html"],"divs":["sighting detailsi was at my house at about 11:30 pm. me and a friend were standing outside on my back porch smoking a cigarette. i was staring at the stars, when i noticed an unusually bright sphere. it appeared to be a bright star at first, but upon closer inspection it observed odd behavior. the object would glide about in figure-8 motions or from side to side. other times the object would fly noticeably further away from its previous position, going towards my direction. at times the object seemed to flicker or glow at different intensities. my friend denied at first that the object was anything other then a star, but upon closer inspection order by myself, he began to realize that this was not an ordinary light in the sky. when close enough, the object's body was slightly illuminated by the bright light. it appeared to be either a triangle, disk, or combination of both. (was hard to see, it is dark outside.) after seeing this, my friend was overcome with a fear i have never seen in him before, as he is a very intelligent, stolid, and skeptical individual. i felt a sense of unrest, as if something was wrong. after retreating indoors for a while, we decided to return outside to see if the object was still there, but before we could get to the door we both heard a very strange, disturbing sound. it sounded as if a cricket was chirping (think signs,but different), but with tones that were easily definable. (it sounded as if two individuals were speaking in our direct vicinity.) it is winter, and no crickets or similar insects are about that this time. after going back into my room following this, we both shared extreme feelings of dread. eventually, we gained enough courage to leave my room and inspect our surroundings. (finding nothing.) the ufo was still present when i went to sleep that night, but in a much different location in the sky. i, and other friends and family have seen this object many nights in a row, including last night. (1\\15\\11)"],"Object Shape":"Flash, Star-like, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.494344,+-76.770578(27423)&iwloc=A&hl=en\"> mufon case (27423) map </A>","trends":["There have been 4 other sightings in Charlotte Hall","There were no other sightings in Charlotte Hall on or around January 13th 2011"],"Disposition":"Unresolved","Log Number":"US-01162011-0013","Date Submitted":"01/16/2011 09:45 UTC","Date of the Event":"01/13/2011 11:30 UTC","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"38.494344","Case Number":"27423"}