{"files":["/var/www/straped/mufon/html2text/27421.html.txt","/var/www/straped/mufon/org/27421.html"],"Object Features":"Unknown","Date Submitted":"01/16/2011 05:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.952487,+-90.916812(27421)&iwloc=A&hl=en\"> mufon case (27421) map </A>","Country":"United States","Weather Factors":"Unknown","City":"Moscow Mills","Disposition":"IFO","Viewing Distance":"101-500 Feet","Source":"MUFON","Longitude":"-90.916812","Summary":"nightly reocuriing,7pm on,seems to respond to my movements","Log Number":"US-01162011-0011","trends":["There has been one other sighting in Moscow Mills","There were no other sightings in Moscow Mills on or around January 15th 2011"],"Object Shape":"Sphere","divs":["Sighting Detailsabout 3months ago,i saw an unusually bright group of lights.they were about 100yds away in an open field. looking at them thru binoculars they appeared to be glowing red white and blue after watching for 2 weeks i decided to walk accross the field,with a camera and flashlight.after about 50 yards into approach one of them rose up about 100 feet tilted at about 45 degrees and headed what i thought was my way.i ran like a scared boy dropping my flashlight.i slipped and fell on my patio,then got up ran jnside and locked the door shaking.they didnt appear for a few days. they cme back but the lights appeared smaller.about 2or 3 feet in diameter.they continue to appear nightly,ussually 1 to 3 lights on north side and 1 on field to the south .one light in particular seems to mimmic my movements ie. left right up down around.the others are strictly buisness.other strange red white and blue figures hover around above the cloud line.my kids think i am crazy,but i am scared.this has never happened to me before and i dont know what to do. this is very real and i think not reporting it would be an injustice to man kind. please study this seriously."],"Sighting Duration":"09:00:00","Region":"Missouri","Case Number":"27421","Object Flight Path":"Hovering then path","Latitude":"38.952487","Tags":"City","Date of the Event":"01/15/2011 07:59 UTC"}