{"Region":"Florida","Country":"United States","Log Number":"US-01162011-0014","City":"Cocoa Beach","Weather Factors":"Unknown","trends":["There have been 10 other sightings in Cocoa Beach","There were no other sightings in Cocoa Beach on or around January 16th 2011"],"Summary":"probably not ufo, but very strange magnetic field","Source":"MUFON","Case Number":"27425","Object Features":"Undisclosed","Latitude":"28.321697","map":"<A HREF = \"http://maps.google.com/maps?q=28.321697,+-80.605201(27425)&iwloc=A&hl=en\"> mufon case (27425) map </A>","Date Submitted":"01/16/2011 10:24 UTC","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/27425.html.txt","/var/www/straped/mufon/org/27425.html"],"Date of the Event":"01/16/2011 05:40 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsLast night I arrived in Cocoa Beach, Florida for vacation. Today me and my family drove up to Kennedy Space Center Visitor Center Museum. We got there about 5:15 pm and left and headed back towards Cocoa Beach, Florida shortly thereafter because the Visitor Center was about to close. About twenty minutes later we arrived just in front of the Ron John Surf Shop and stopped at a red light when we noticed two very bright flashes that looked like lightning to the front of the vehichle, even though it wasn't storming and was hardly overcast. We arrived at Doubletree Hotel in Cocoa Beach a few minutes later and tried to open our hotel room door with our key cards. I had one in my wallet, my fiance had one in her purse. Neither card would open our door. We went to the front desk and told the clerk so she recharged the cards so they would open the door. Both had been cleared of their magnetic signature. The clerk told us that could happen if the card got exposed to magnetic charges or too close to a cell phone. Both cards were stored in seperate places in the vehichle, however. Which means the vehichle must have encountered a magnetic field of some sort that erased both cards. We also had a strange interference with our GPS on the way back. We turned it on as soon as we left the Visitor center and it contininuously blurted out \" you are exceeding the speed limit\" even when we came to almost a complete stop at a stop sign. So, I looked on the internet, because I immediately thought it might have to do with the Space Port area and immediately found blogs about FLORIDA'S SPACE PORT having its own magnetic field, and also about some sort of magnetisphere devise that recently arrived at the port for deployment to space in February of 2011. Only a few weeks away. I immediately became concerned about my debit card's magnetic signature being affected, so I went to the atm and checked it out. It appeared intact. So whatever it was, it was strong enough to wipe out my hotel key card and my GPS but not my atm card. Probably not a UFO, but definetly something very strange proven to be happening with the magnetic fields around NASA's Space Port Located Just north of Cocoa Beach."],"Object Shape":"Unknown","Tags":"City","Longitude":"-80.605201","Sighting Duration":"00:30:00"}