{"Region":"North Dakota","Date Submitted":"01/17/2011 06:01 UTC","Object Features":"Unknown","Weather Factors":"Fog","Object Shape":"Unknown","Date of the Event":"Unknown","Longitude":"-111.383244","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.071956,+-111.383244(27428)&iwloc=A&hl=en\"> mufon case (27428) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Viewing Distance":"20 Feet or Less","Latitude":"33.071956","Source":"MUFON","trends":["There have been no other sightings in Florence","This sighting has never been favorited."],"Log Number":"US-01172011-0002","files":["/var/www/straped/mufon/html2text/27428.html.txt","/var/www/straped/mufon/org/27428.html"],"City":"Florence","Summary":"Late night Oregon Coast Highway 101.Bright light into windshield.Suddenly we were 60 miles farther up the road.2 Babies 9 months later..","Tags":"City","Case Number":"27428","Disposition":"Unknown","divs":["Sighting DetailsWe were driving from San Luis Obispo, California, traveling North on Highway 101. There were four of us, two boys, two girls. All between the ages of 15 and 18. Our intentions were to turn East at Florence towards Eugene, our final destination. It was late night past the middle of November, 1967. It was foggy and we had been behind a logging truck since somewhere near the border of California. The road is winding as it follows along the Coast, with sharp drop-offs to the Ocean on the left side and steep hillside on the right. We stayed behind for so long because there was no safe place to pass and no turn-offs. We grew weary and our driver finally decided to risk it. Just as we were on the left-side (the ocean-side) of the log-truck, a blinding bright light shown into the windshield of the car from directly in front. I was in the front seat. I was certain it was another log-truck and we were going to die. But then, all of a sudden, we were parked alongside a small gas station in a small town. There was a Woman there. We were very disoriented and asked where we were. Somehow we were 60 miles farther up the road. With the road conditions, that would have been two hours of driving time. We couldn't understand how the truck that we were passing just disappeared. We were confused and wondered what had happened because we KNEW that SOMETHING out of the ordinary had occurred but we didn't know WHAT. In the third week of August 1968, the girl who had been in the back seat gave birth to a healthy baby. And a week later the other girl did."]}