{"Latitude":"36.07088","Case Number":"27429","files":["/var/www/straped/mufon/html2text/27429.html.txt","/var/www/straped/mufon/org/27429.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.07088,+-94.153586(27429)&iwloc=A&hl=en\"> mufon case (27429) map </A>","Object Shape":"Sphere","Object Features":"Window(s), Appendage(s)","Tags":"City","Source":"MUFON","Summary":"Driving on highway at night large spherical UFO passed in front and above car.","Weather Factors":"Unknown","Log Number":"US-01172011-0003","Date Submitted":"01/17/2011 06:35 UTC","Date of the Event":"11/30/1982 10:30 UTC","Disposition":"Unresolved","Country":"United States","City":"Fayetteville","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was driving alone from Fayetteville, Arkansas to Harrison, Arkansas on U.S. highway 68 (Now U.S 412)at about 10:30 PM. I was not under the influence of alcohol or drugs; nor was I tired. I was in a very rural area of Carroll County with not many farm or house lights. While driving I noticed that the embankment in front of me and to my left lit up brighter than what I expected my headlights to illuminate. I looked over to the right hand side of my windshield and saw a UFO. I was traveling north-northeast and the UFO was traveling from southeast to northwest. I was probably driving at about 45 MPH but slowed down when I saw the UFO. When I first saw the UFO it appeared at least 4-5 times larger than a full moon would appear to the naked eye. In the course of a few minutes with what appeared to be a constant speed it had completely disappeared. It did not quickly accelerate nor did it dissolve or blink out. The UFO was spherical in shape with 6 rows of windows equally spaced from an equatorial line and evenly spaced within the row. The windows were oval or elliptical. A butterscotch yellow light emanated from within the craft through all the windows. I did not see occupants. From both the 1 o'clock and 7 o'clock positions (as in a clock face) there were appendages resembling lightning bolts. From what I remember there were 3 angles on each of the appendages. At each bend or angle change there was a small white light. The white lights blinked on and off in succession starting from the tip of one appendage and ending at the tip of the opposite appendage and reversing. As soon as I got home I made a drawing of what I saw. I don't recall losing time or having any physical problems related to the sighting. There was absolutely no sound from the UFO."],"Longitude":"-94.153586","trends":["There have been 21 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around November 30th 1982"],"Viewing Distance":"Unknown","Region":"Arkansas"}