{"City":"Cottage Grove","Log Number":"US-01172011-0013","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Weather Factors":"None, Does Not Apply","Date of the Event":"11/30/1989 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.797623,+-123.059525(27439)&iwloc=A&hl=en\"> mufon case (27439) map </A>","files":["/var/www/straped/mufon/html2text/27439.html.txt","/var/www/straped/mufon/org/27439.html"],"Region":"Oregon","Sighting Duration":"Undisclosed","Longitude":"-123.059525","Source":"MUFON","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Triangle","Date Submitted":"01/17/2011 03:18 UTC","Latitude":"43.797623","Summary":"Triangular UFO","Case Number":"27439","Disposition":"Unknown","Object Features":"Unknown","divs":["Sighting Details probably should've reported this a long time ago, but it never occurred to me to do so. Better late than never (I hope). Time: It was around 1989-1990, so I was about 13 or 14. It was around 4:30 or 5:00 am. Place: Just outside of Cottage Grove, Oregon (right next door to the Delight Valley elementary school). Basic background info: Mom was a single parent, & to make ends meet she had a rural paper route. I was \"lucky\" enough to get to help before school. She'd drive, pull up to the boxes, & I'd stuff the papers in the boxes. So that's why we were both out there so early in the morning. We had stopped to get some more paper-bundles from the back of the truck. In front of us, against the night sky we saw 3 lights in an equilateral-triangular pattern. The thing just hovered in the sky. There was no sound. After a few moments (a minute, perhaps) it went from \"not moving\" to \"moving blindingly fast\" and zig-zagging in an apparently random pattern....then it would stop, & stop instantly. After the \"zig-zagging\", it zoomed away. At the instant it disappeared, I saw a bright flash that filled up the entire sky for a fraction of a second. This next part is very difficult to describe, but I'll try my best.... At the instant it disappeared, during the moment it flashed, the flash was accompanied by something I can only describe the following way: Y'know how in the opening credits of Star Trek: the Next Generation, the Enterprise zips into \"warp drive\", & at the instant it does there's that diamond-shaped flash? It was kind of like that, except the flash wasn't diamond-shaped. It was sort of like a tangled-web of lightning-bolts (the apparent size of my hand at arms-length), but only visible for the tiniest fraction of a second. I'm not sure if this was a real effect of the object, or if it was some kind of effect the flash had on my eyes, like when someone turns on a light when you're not ready for it, & you have that afterimage in your vision for a moment...I only saw the \"lightning effect\" for the briefest of moments, & there was no afterimage so it was probably real, but I'm not sure. My mother didn't notice the \"lightning effect\", or if she did, she doesn't remember. After the \"big flash\" it was gone....for a minute or two. Then we saw it (or was it another, separate object of the same kind?) drift over the hills to our left. Then it drifted back over the hills & was gone. Here's where the plot thickens: Mom & I have talked about this many times & she would occasionally reference the metallic appearance of the thing. I never understood how she could discern the appearance of the surface because even though it was close, it was still far enough away that all I could see was 3 lights in a triangle pattern. I would tell her this. She would always respond with, \"But it was RIGHT OVER US!\". I would think, \"Ummm.....nooo....it was off in the distance in front of us just above the hills\". It turns out that, at some point Mom looked out of her window & looked up...and it was directly over the truck. She said it was \"maybe 2 or 3 tree-lengths\" above us, & so big she couldn't see the sky. That's when she started the truck & drove off (fast!). I don't remember this happening...probably because this thing could travel huge distances virtually instantaneously without making any noise, so perhaps it was only above us for a second or two, & I just didn't notice. Years later, I found out that others have seen similar triangular objects (like the one sighted over Belgium) Some other points (I'm sure you've heard this stuff before...I certainly have, but regardless here it is) -It could go from \"not moving\" to \"moving blindingly fast\" instantly -It could turn on sharp angles without slowing down -It could stop without decelerating -It could go in any direction at any time without changing its orientation relative to its direction (ie, it didn't have to \"face\" the direction it was traveling) -It didn't make any noise -It didn't have any apparent exhaust or contrail -It was obviously a piece of manufactured hardware, & not an amorphous blob of light or comet or meteor or any sort of natural meteorological phenomenon. So there you have it. I'm sure you've all heard this stuff before, but now you've got one more account."],"trends":["There have been 2 other sightings in Cottage Grove","There were no other sightings in Cottage Grove on or around November 30th 1989"]}