{"Sighting Duration":"Undisclosed","City":"Davis","Object Features":"Unknown","Source":"MUFON","Summary":"triangle lights flying slowly in Davis California","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was driving along Covell Blvd West bound about 1.5miles East of Wildhorse Golf Course. There's a large open field we were driving by and I saw white lights in a triangular formation outlining what appeared to be a dark triangular object. I don't remember exactly how many lights, but I want to say 4 lights per side, including the corners - all white. One light was blinking about once per second - I think recall the one blinking light to be the \"leading\" light. It appeared to be 15-20 yards wide and was about 150' to 200' in the air. It was about 200 yards from us. It seemed to be flying at about 10-20MPH. I thought it was a small plane, but then noticed the triangular formation which caught my attention. I rolled down my window as we were passing it in the opposite direction and could not hear a sound over the \"driving wind\". My wife saw it, but she was driving and we didn't really discuss it, nor did I reveal to her how peculiar I thought it was. If I were driving by myself, I would have pulled over, but I was only able to watch it for a little less than 2 minutes until houses eventually blocked my view of it. I don't mind MUFON contacting me by email if my event is of interest. I would like to know if anyone else in the area reported similar occurrences. Please don't post my name online."],"Tags":"City","Log Number":"US-01172011-0010","Latitude":"38.551496","map":"<A HREF = \"http://maps.google.com/maps?q=38.551496,+-121.735887(27436)&iwloc=A&hl=en\"> mufon case (27436) map </A>","Region":"California","Case Number":"27436","trends":["There have been 8 other sightings in Davis","There were no other sightings in Davis on or around January 14th 2011"],"Date of the Event":"01/14/2011 12:00 UTC","Disposition":"IFO","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Longitude":"-121.735887","files":["/var/www/straped/mufon/html2text/27436.html.txt","/var/www/straped/mufon/org/27436.html"],"Date Submitted":"01/17/2011 01:49 UTC"}