{"Object Shape":"Chevron, Star-like, Other","Summary":"\"Stars\" traded positions then flew off the the east one by one","Case Number":"27449","Sighting Duration":"Undisclosed","Latitude":"39.563052","Date of the Event":"12/31/1991 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"01/18/2011 01:52 UTC","Country":"United States","Disposition":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON","Log Number":"US-01182011-0006","Tags":"City","trends":["There have been no other sightings in Atchison","This sighting has never been favorited."],"City":"Atchison","Longitude":"-95.121636","Region":"Kansas","divs":["Sighting DetailsI was home for winter break during my freshman year of college, so this happened in very late December 1991 or early January 1992. I was in my bedroom with the lights off listening to a casette tape and looking out the window to the north. There was a very bright star that held my attention as I sang along to Sanitarium by Metallica. Suddenly the light changed and the star began moving to the west. As it did so, another \"star\" came from the east to replace the star in the north. Once it got to the relative location of the first craft it stopped moving and just hovered there, looking like a very bright star. I was astounded and kept watching. After approximately 15 minutes, the craft in the north moved off to the location in the west, another craft from the east took its location in the north. At this point I donned a coat and went outside to get a view of the entire sky. Sure enough, the original craft was now in the south hovering with one in the west, one in the north, and another in the east. When they changed positions again, the craft in the south continued on to the east over the Missouri bluffs, leaving 3: North, west, south. There they hovered. After another 15 minutes or so, they changed positions again with the southern craft continuing on toward the east. This time I saw the lights on the underside of the craft and could make out a silhouette against the moon. The lights on the underside formed a chevron (as opposed to a full triangle). I can't remember how many lights there were but I've drawn an approximation on the attached image. I remember no sound. Against the moon, it appeared the craft had wings like a standard military jet except the wings angled up from the body of the craft. I'm pretty sure there was a stabilizer, too. One by one, the objects would hover silently like stars for a period of time then switch positions with the southern object flying over the eastern horizon. Based on the silhouetted view of the craft I've always believed they were military. Indeed, there's an AFB in the St. Joseph, MO area. I acknowledge other possibilities, though, such as holographs. How a winged aircraft hovers silently and completely still is a mystery to me! I check MUFON's UFO Stalker almost every day and am always irritated by \"new\" sightings reports from years ago - it honestly never occurred to me until recently to add my own. I've never heard another story like this but would love to know if anyone else has ever seen something like it. Keep up the good work, MUFON! And please keep an eye on the sky, America."],"Object Features":"Wings","files":["/var/www/straped/mufon/html2text/27449.html.txt","/var/www/straped/mufon/more/27449_submitter_file1__Sighting.jpg","/var/www/straped/mufon/org/27449.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.563052,+-95.121636(27449)&iwloc=A&hl=en\"> mufon case (27449) map </A>","Object Flight Path":"Stationary,Hovering then path,Path then hovering"}