{"Region":"California","Object Flight Path":"Undisclosed","Log Number":"US-01182011-0002","Longitude":"-115.498883","City":"Calexico","Object Features":"Undisclosed","Latitude":"32.678948","Country":"United States","Sighting Duration":"00:00:20","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27445.html.txt","/var/www/straped/mufon/org/27445.html"],"Tags":"City","divs":["sighting detailsthese events i will never forget as long as i live.back in july 20th 1969 we were summer vacationing in the border town city of mexicali baja california mex.i was almost 7 years of age back then.earlier that day my family and i ,like most of the world were watching the lunar landing event on the tv.later that day all of us kids went to play outside on that warm evening.while we were running and jumping one of the neighborhood kids stopped and pointed to the clear dark sky and yelled for all of us to look.i looked up to where he was pointing at and i could see 7 or 8 low flying yellow-orange lights, flying at a great speed and out of formation but near to one another and absolutely no sound of engine or any noise of anykind from them. now as an adult i calculate their speed at around 600 mph flying low from north to south.about 20 miles nw of mexicali thers is the u.s.naval air base station near el centro ca.as years have gone by i often remember that event but have not looked further in to it, untill now.do you have any records of this event?there had to be thousands of witnesses.what all of us kids did after looking at these lights flyby was that we ran inside to tell the adults but by the time they came out to see, the lights were long gone.i would really appreciate anybody e mailing me with any info to *(email address removed -- cms\\sg)."],"Case Number":"27445","Disposition":"Insufficient Data","Object Shape":"Circle, Sphere","Viewing Distance":"Unknown","Date Submitted":"01/18/2011 03:55 UTC","trends":["There has been one other sighting in Calexico","There were no other sightings in Calexico on or around July 20th 1969","This sighting has never been favorited.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.678948,+-115.498883(27445)&iwloc=A&hl=en\"> mufon case (27445) map </A>","Summary":"1969 Lunar landing day UFO's sighting.","Date of the Event":"07/20/1969 12:00 UTC"}