{"files":["/var/www/straped/mufon/html2text/27440.html.txt","/var/www/straped/mufon/org/27440.html"],"Object Features":"Unknown","divs":["Sighting DetailsI was driving south on 2nd Avenue in Manhattan from 128th Street, when a strange pulsating orange light appeared in the southern sky, heading eastbound. Pulsating like the flame of a candle or a star, not like a plane's lights. My only guess at the time would have been a blimp, but a blimp unlike any I've ever seen. Also, it was more spherical than blimp-like. Soon other identical lights came into view, passing from behind tall buildings on the west side of 2nd Avenue. I pulled onto the next street I could, 119th Street, and immediately hopped out and started filming on my cell phone. Total I would say there were 7 lights that were in the sky, but I was only able to capture 4 on my phone. Three seemed to fly together in a pyramid formation before the 4th came flying into view. They didn't fly in consistent patterns either, sometimes changing directions distinctly. At the end of this experience, which lasted about 4 or 5 minutes, each light seemed to climb higher into the clouds until they were no longer visible. If they were balloons, they were definitely producing light and massive in size. I didn't see any smoke trails or quick, random movements to make me think they were flairs. The flight patterns, while they did change directions, didn't alter in velocity, from my point of view."],"Viewing Distance":"Over One Mile","Longitude":"-74.000273","Case Number":"27440","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.721213,+-74.000273(27440)&iwloc=A&hl=en\"> mufon case (27440) map </A>","Log Number":"US-01172011-0014","Country":"United States","Object Shape":"Circle, Fireball, Sphere","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"New York","Summary":"Orange pulsating lights, flying in random patterns, over NYC","Disposition":"IFO","Date of the Event":"01/16/2011 10:12 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Tags":"City","Region":"New York","Date Submitted":"01/17/2011 03:17 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around January 16th 2011","This sighting has never been favorited.",""],"Latitude":"40.721213"}