{"map":"<A HREF = \"http://maps.google.com/maps?q=37.097518,+-113.573286(27451)&iwloc=A&hl=en\"> mufon case (27451) map </A>","divs":["Sighting DetailsI was traveling alone on I-15 from Los Angeles on my way to Davenport, IA during September 1978. (At that time in my life I did not drink nor take drugs or medication of any type.) I spent the evening outside Las Vegas at a rest stop, then left Las Vegas at about sun up and traveled straight through NW Arizona into Utah. It was a clear day, no clouds, no rain, no fog, sun was bright and the skies were clear. Entering Utah, near St. George, at approximately 8 a.m., I noticed on my left a shimmering orb floating without moving, just sort of hanging in midair about 30-50 feet above the ground. The road wound so I lost track of it occasionally, and there were cars ahead and behind me who also saw the object as I could see them pointing to it. Finally, we, myself and the other cars, came to a stopping point. I got out of the car, as did the others, and looked at the object as it was about 300 or 400 feet away from where we had parked. There was almost a translucency about it, kind of silvery-grey. I saw no lights, or portals, windows, or markings of any kind on it. It made absolutely no sound. I saw no source of how the orb was powered. If it weren't so huge, it seemed to be approximately 100-200 feet in diameter, I would have thought it a hologram. It was translucent NOT transparent so I could not see through it. After watching it just hang there for about a minute it blinked out. If I had turned my head I would have missed it. I scanned the skies but saw no trace of it. Strange, the others standing there all had the same response I did, we looked at each other and some of us just shrugged then we got into our cars and left. I have wondered all these years why we didn't talk to one another, exchange numbers, names, something."],"files":["/var/www/straped/mufon/html2text/27451.html.txt","/var/www/straped/mufon/org/27451.html"],"Summary":"Perfectly spherical, approx. 100-200 ft. diameter, 30-50 ft. above ground, floating still","Weather Factors":"Unknown","Country":"United States","Object Features":"None","Date Submitted":"01/19/2011 03:39 UTC","Region":"Utah","trends":["There have been 6 other sightings in St George","There were no other sightings in St George on or around September 11th 1978"],"Latitude":"37.097518","City":"St George","Sighting Duration":"00:01:00","Longitude":"-113.573286","Log Number":"US-01192011-0001","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Circle, Sphere","Object Flight Path":"Undisclosed","Case Number":"27451","Date of the Event":"09/11/1978 08:10 UTC","Disposition":"Unknown","Source":"MUFON"}