{"Country":"United States","Sighting Duration":"01:34:00","divs":["Sighting Details January 16 2011: Part 1 of 2: (I am uploading one of the video segments later on today. My story? Ok. I woke up early as usual and checked the sky for Venus and the \"death star UFO\" that has been reported here in Chicago...spotted in the Southeast by multiple witnesses on December 15th, 2010...early in the morning. So...I always just take a look to start my day...usually lately...it is cloudy and you cannot see the stars or anything as storm systems have been hanging around this area for a while. (like everywhere else in the United States...this has been a rough winter WORLD WIDE so far.) I immediately noticed something irregular up there. I saw this unusual flashing, sparkling and pulsating light. It is important to note...this thing was NOT in the spot that Venus usually aligns in the morning. This thing was lower than Venus normally is and it was drifting back and forth. I grabbed my camcorder and filmed it with a mini tripod to keep it steady. I did the best I could for just waking up. Sure you can say it is Venus...until I zoom in. I tried to zoom in and out to give the object some background and some points of reference as the sun was just starting to come up. I tried to keep quiet too, but lost it a few times, so I am sorry for the language. (Disclaimer for the youngsters) Right click and select \"Open With\" and select \"Windows Images and Fax Viewer\" then zoom in...USE THE LITTLE ZOOM ICON TO ZOOM IN...AND POINT IT TO THE RIGHT OF THE WHITE OBJECT YOU WILL THEN SEE 2 objects. I saw only 2...the white one (the disk) and red one (Mars maybe?) (I say that later on in the footage you will get later), but then there is also a blue object below it. You can see the white object is leaning downward is is clearly a disk shaped object. You can also see the rotation and motion in the footage and the photo. At some points in the video you can clearly see it is a SILVER DISK with an electromagnetic glow around it. The red object could be Mars, but I swear...as I was filming...I did see the red object moving too. Video footage to come later. When I upload my camera footage...there are few doubts left over after you watch the whole thing, but I took 2 photos and this is one of them. Plus...when I zoom in and it goes nuts...there is without a doubt some type of rotation. The object made absolutely no noise and it is camouflaged as a star. That has been my theory and they are ALWAYS UP THERE...at night and it is TOP SECRET because there is nothing we can do about it. If that is not a security threat, then what is? To the avid sky watcher...dig in...take your camera and zoom in on ANY LARGE SHINING OBJECT AND EVENTUALLY WE WILL ALL EXPOSE THEM BY SIMPLY ZOOMING IN OUR CAMERAS...AND YOU WILL SEE FOR YOURSELF THAT MY CAMOUFLAGE THEORY HAS ALWAYS BEEN CORRECT. UNCOVER THE TRUTH...THEY ARE UP THERE FOR YOU TO SEE IF YOU MAKE THE EFFORT. I have seen one seriously close...you will not be able to see the details on the craft until it comes close, but then you will RUN and no freaking way you will worry about proving it was real and you will not be interested in filming it. Trust me on this...your curiosity will be satisfied and you will know within ONE SECOND that is NOT from earth. You will know what it is and YOU WILL RUN. MOST PEOPLE ARE NOT EVEN CLOSE TO BEING READY TO FILM AND HOAXES RUIN ALL CREDIBILITY FOR THE REAL SIGHTINGS AND THAT IS A DAMN SHAME. Was I filming different stages of an abduction? Were they observing or exploring? Why did this thing show up near Chicago 2 times in a one month period? Who knows? Anyway...I filmed from a 2nd floor (open) window, then I moved outside to get another angle in the 15 degree weather here in Park Ridge, IL. You can see the object move slowly. I totally ADMIT I AM AN INSIGNIFICANT PERSON. I am not a doctor, scientist, or anyone even remotely important...I am a complete and total NOBODY, SO FOR WHAT IT IS WORTH...HERE IS MY OPINION...AND ADVICE...(WHICH I know it is NOT WORTH MUCH OF ANYTHING..and you are reading this saying who the hell is this clown and who the hell cares about his opinion?) I AM HERE TO TELL YOU...YOU SEE SOMETHING...ZOOM IN ON IT...NOT ALL STARS ARE STARS...BUT I ADVISE YOU...DO NOT GET CLOSE...IF IT COMES NEAR YOU...GET THE HELL AWAY FROM IT. THEY KNOW FULL WELL VENUS SITS IN THE SOUTHEAST SKY IN CHICAGO RIGHT NOW...AND MOST PEOPLE WILL EXPLAIN IT AWAY. Yes...it is in the Southeast, BUT NOT WHERE VENUS USUALLY IS. It was much lower and it was moving and changing shape...and something was coming off the object several times. The video...you can see what I mean, but here is one of the 2 photos I took. I have nothing to prove. I already KNOW aliens are real and I just have this feeling that many of you out there will have your own experience and I have no doubt what I have seen UP CLOSE before this event...was extraterrestrial and not of this earth. Within one second...all my questions were answered. NO ONE HAS TO TELL ME. IF THE CIA WERE TO TELL ME THEY ARE NOT FOR REAL AND SCIENTISTS OR SKEPTICS THAT ARE SMARTER THAN I AM...THEIR OPINIONS WOULD ONLY MATTER TO ME IF THEY SAW THE OBJECT UP CLOSE TOO. OTHERWISE...THEY ARE WASTING THEIR BREATH AND TIME. COME TALK TO ME WHEN YOU HAVE BEEN CLOSE...AND A BEAM COMES DOWN AT YOU. Once you can explain that away...AFTER experiencing that...you can have your own opinion, but YOU WILL NEVER BE ABLE TO CHANGE MY OPINION. YOU WANT TO SEE A UFO? You have to be ACTIVE about it and put some effort into seeing one. In nice weather...take a glance up in the sky at night. Summer time...take an hour per night and watch...I BET YOU WILL EVENTUALLY SEE IT. Search YouTube for: \"UFO in HD\" there are multiple videos uploading NOW. Keywords or tags: UFO ufos orb orbs alien aliens extraterrestrial experimental aircraft MUFON real close details disk unidentified flying object unexplained lights Chicago IL Illinois Sighting Sightings spotted spots footage"],"Longitude":"-87.622688","trends":["There have been 221 other sightings in Chicago","There were 2 other sightings in Chicago on or around January 16th 2011","This sighting has never been favorited.",""],"Disposition":"IFO","Weather Factors":"Does Not Apply","Latitude":"41.886754","Date of the Event":"01/16/2011 05:11 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Illinois","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.886754,+-87.622688(27452)&iwloc=A&hl=en\"> mufon case (27452) map </A>","Case Number":"27452","Object Shape":"Diamond, Disc, Star-like","Source":"MUFON","Summary":"Electromagnetic Camouflage Over Silver Disk","files":["/var/www/straped/mufon/html2text/27452.html.txt","/var/www/straped/mufon/more/27452_submitter_file1__DrakeDietrickStudio016.jpg","/var/www/straped/mufon/org/27452.html"],"Date Submitted":"01/19/2011 08:12 UTC","City":"Chicago","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Features":"Dome, Patterned Surface","Log Number":"US-01192011-0002"}