{"Object Features":"Unknown","Region":"Idaho","Date of the Event":"12/13/2010 01:20 UTC","Longitude":"-114.458511","Source":"MUFON","Object Flight Path":"Straight-line path,Unknown","Sighting Duration":"Undisclosed","Case Number":"27459","divs":["Sighting DetailsI was upstairs in 2 story house on my computer.It was during lunch break of the elemen school down the street @12-1 pm.Suddenly the doors started rattling in their frames throughout the 2nd story and the upstairs swayed violently.I know earthquakes,was sure it was one, then huge thud, thought perhaps explosion or something ran into the house.Began shouting at those on 1st floor below and they shouting back at me.When I was able to go down the stairs (felt stunned & afraid to go down at first)they gave me a different scenario, not feeling the house sway or doors rattle, but heard HUGE sound like \"WOWWWWW WOWWWWW WOWWWW\" over and over,very deep and also stunning.Then heard the kids at the school start screaming,which they often do,but not the same as play,but like fear. Before I made my way downstairs I went from window to window to look out to see if any vehicle had hit the house and saw about 5 large cloud-like discs, like pin-wheels standing on edge,separate, hanging in the sky over large elm trees down the block.It was a completely overcast day,except for this one open spot of blue sky filled with HUGE round pinwheel clouds.I thought them very odd, but was very rattled and was not thinking clearly and didn't think of my cellphone camera to take pictures and wish I had. Nor did I think more about the pinwheels until the next day as I watched evening local news KMVT when they asked if anyone had any additional information regarding the cause of the unknown sound of a large explosion on the 13th, Monday at noon.It wasn't until that moment that I realized what I had seen in the sky,puffy contrail of those whatever they are: drones,jets,UFos that create fluffy trails that expand in grids over everywhere today,first noticed by me in Portland,OR. I did call the station and advise of what I had seen, but after that time, didn't hear anything more about it.Strange thing, time seemed locked in place during this event and we all laughed (nervously) about \"the Mother Ship\" stealing time from us because we felt disoriented for quite a long time after.We have no idea what it was, military aircraft? UFO? drone? If anyone knows, they aren't talking.Am attaching sketch of disc clouds."],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=42.566917,+-114.458511(27459)&iwloc=A&hl=en\"> mufon case (27459) map </A>","Weather Factors":"Unknown","trends":["There have been 9 other sightings in Twin Falls","There were no other sightings in Twin Falls on or around December 13th 2010","This sighting has never been favorited.",""],"Disposition":"Unknown","Country":"United States","Tags":"City","Latitude":"42.566917","Summary":"Sound vibrations so deep as to effect earthquake-like and stunned effect","Object Shape":"Circle, Other","Date Submitted":"01/29/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/27459.html.txt","/var/www/straped/mufon/org/27459.html"],"Log Number":"US-01202011-0001","City":"Twin Falls"}