{"divs":["Sighting DetailsThe event took place in the eastern suburbs of Denver, Colorado. It was a perfectly clear fall night, no moon, no clouds. I was admiring the beautiful sky, looking straight up. Down from very far away, came three disks in formation - one in front, two behind forming a triangle. They were green in color, semi-transparent and seemed to glow somewhat. They went from being the size of stars to the size of a quarter, held at arm's length, in about one second. I could see them arc into level flight as they slowed down. They slowly flew across the sky for about two or three seconds, then took off in level flight at about the same speed they came down, disappering over the mountains to the west in about one second. The speed they were travling was incredible. I could see the whole event in perfect perspective. The disks were flat descending and turned on edge when they flew away. The disks were quite clear and in focus. I've never talked to another person that has seen anything quite like this, and since then, I've watched many TV shows about UFO's hoping to see somthing similar reported, but never have. Even though it was a long time ago, I thought you folks might want to hear about it."],"Latitude":"39.733452","Tags":"City","Date Submitted":"01/18/2011 11:29 UTC","Sighting Duration":"Undisclosed","Date of the Event":"09/30/1969 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.733452,+-104.82717(27450)&iwloc=A&hl=en\"> mufon case (27450) map </A>","Country":"United States","Case Number":"27450","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around September 30th 1969"],"Disposition":"Unknown","Object Features":"None","City":"Aurora","Source":"MUFON","Log Number":"US-01182011-0007","Viewing Distance":"Unknown","Object Shape":"Disc","Object Flight Path":"Path with directional change","Longitude":"-104.82717","Region":"Colorado","Summary":"Three disks descending from above","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27450.html.txt","/var/www/straped/mufon/org/27450.html"]}