{"files":["/var/www/straped/mufon/html2text/27464.html.txt","/var/www/straped/mufon/org/27464.html"],"divs":["Sighting DetailsI remember it was a sunny, summer day. Blue skies and warm. It was a saturday, and myself, my husband and 13yr old son were running errands, and I think we ate lunch prior to this also. We were stopped at the intersection on Redwood Road and 9800 South at the stop light. The all of a sudden we heard a loud BOOM in the car!! Our windows were rolled up, and we don't think it was a car backfire at all. It sounded like a shotgun went off inside of the car. I started shaking and tried to turn to see if my son was ok in the back seat. I was disoriented, so were they. My husband was checking himself for blod on his shirt and so was my son. I looked down at myself also, but I was frieghtened that I would see blood. It was like a jolt hit us or something. I finally said \"is everyone ok?\" My son replied, \" yea mom I'm ok\". We were all ok. The light turned green and we started to go finally. No one around us was affected, by that I mean others in cars around us. We were all saying what the heck was that? It was very strange and weird. My son felt like maybe we were hit by a time warp and got put back or something. It took me an hour to calm down from shaking and being scared. I still won't drive around that area at all. We have had other sightings and strange things happen to us. But that day still frightens me a lot!! The lady from Idaho's comments from today made me remeber this."],"Sighting Duration":"Undisclosed","Case Number":"27464","Object Shape":"Unknown","Latitude":"40.61241","Country":"United States","Log Number":"US-01202011-0006","Object Flight Path":"Undisclosed","trends":["There have been 10 other sightings in West Jordan","There was one other sighting in West Jordan on or around July 31st 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.61241,+-111.934173(27464)&iwloc=A&hl=en\"> mufon case (27464) map </A>","Viewing Distance":"Unknown","Summary":"Heard a loud BOOM, then possible time warp?","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Longitude":"-111.934173","Disposition":"Hoax","Date Submitted":"01/20/2011 06:25 UTC","Date of the Event":"07/31/2009 12:00 UTC","City":"West Jordan","Region":"Utah","Object Features":"Undisclosed"}