{"Date Submitted":"01/20/2011 12:48 UTC","Object Features":"None","Weather Factors":"None","Latitude":"34.488411","files":["/var/www/straped/mufon/html2text/27460.html.txt","/var/www/straped/mufon/org/27460.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Disc, Fireball, Sphere, Star-like, Triangle","Summary":"Fireball in sky then turns into crafts and cross the sky.","Sighting Duration":"00:15:00","Region":"Arizona","Tags":"City","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around January 19th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.488411,+-114.315655(27460)&iwloc=A&hl=en\"> mufon case (27460) map </A>","Date of the Event":"01/19/2011 08:00 UTC","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path,Path with directional change","City":"Lake Havasu City","Case Number":"27460","Longitude":"-114.315655","Log Number":"US-01202011-0002","Country":"United States","divs":["sighting detailsi was taking my dog outside to do her business. i always watch the night sky because i have seen other suspect objects. but i have never seen anything like this. i saw a bright orange light that looked like a fireball. i got my sister to see this, and she got my neighbor and my 3 year old nephew came out. it dulled and became less intense. then it started moving and separated into 2 orange\\yellow spheres. 1 started going off to the left and the other flew directly over us. when it was above us it went from being a glowing orb to a saucer looking object with many lights. it was very low but silent. after watching them for a little bit it looked as if they were flying parallel to each other. when they crossed the entire sky they flew high up. the one that flew over us turned around and passed over us again and the other one flew off into the distance. we notice many other objects in the sky. not sure if they were some sort of ufo or planes. but there were many moving lights. the one we paid most attention to was the one that flew over us and turned around, after it passed over again it turned yellow again. and my dog was getting annoying so i took it inside. came back out shortly and saw another craft that looked similar to what we had saw earlier. then turned yellow and looked like it ascended into the sky and just looked like a yellow star from that point on. and in another part of the sky i saw a bright red light. i watched it for a few seconds then it got really bright and disappeared and i didnt see it again."]}