{"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=32.2798,+-98.827112(27467)&iwloc=A&hl=en\"> mufon case (27467) map </A>","Country":"United States","Tags":"City","Summary":"multiple Orange orbs in the sky accompanied by small bright white lights","files":["/var/www/straped/mufon/html2text/27467.html.txt","/var/www/straped/mufon/org/27467.html"],"Latitude":"32.2798","Date Submitted":"01/20/2011 10:24 UTC","Case Number":"27467","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy husband and I were returning home from dinner around 7:45 in the evening of January 20th. We were traveling on Texas Hiway 6 just south of I-20. We were observing the beautiful moon rising in the east that looked as large as the sun and was a golden orange color as well. Beautiful moon, so our eyes were toward the sky. I turned my head to the south again and out of the corner of my eye I saw a bright oranage orb out the passenger side of the truck about 35 degrees above the horizon. I thought it was a star at first and then it went out. I told my husband I thought I saw that UFO again. (Incidently. we had seen some before on March 23rd, 2010 reported on this sight. Please see artist depiction of that particular sighting around that date) Suddenly the orb appeared again. We turned off the road thru a gate and saw it go out. We stopped and watched for about 10 miniutes and observed again this time one, two three four five come on all in a row and stay steady for about 5-10 seconds then they all went out at the same time. As we watched the dark sky we saw some tiny bright white lights appear breifly here and there around where the orbs appeared. The in a few minutes we saw one large one to the West appearing to be toward the direction of Cisco or maybe about 7 miles south of Cisco. I told my husband that I thought that was the star that hangs out over there all the time, but just as I said that it went out! We continued to watch directly to the south and the string of orbs appeared again in sequence, one, two, three, four, five and stay on just briefly and then went out. We saw the little bright white lights again briefly around where the string had appeared. We came on into the drive and parked the truck and got out and continued to observe for about 5 more minutes single orange orbs appear here and there. Like I said this is the second time we have seen this string of orange orbs in this area appearing to be just over the City of Carbon, Tx. We continued to watch but didn't see anymore for a good while and as it was very cold outside we went inside around 8:10 PM. Unfortunately, we had no camera but we did observe cars stopped on the side of the highway watching as well so maybe they will report their sighting as well and maybe have a photo."],"Longitude":"-98.827112","Object Shape":"Oval, Sphere","City":"Carbon","trends":["There have been 4 other sightings in Carbon","There were no other sightings in Carbon on or around January 20th 2011"],"Weather Factors":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-01202011-0009","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Region":"Texas","Date of the Event":"01/20/2011 07:45 UTC"}