{"map":"<A HREF = \"http://maps.google.com/maps?q=32.802633,+-116.955737(27466)&iwloc=A&hl=en\"> mufon case (27466) map </A>","Case Number":"27466","Object Shape":"Circle, Oval, Sphere","Object Features":"None","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/27466.html.txt","/var/www/straped/mufon/org/27466.html"],"trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around January 20th 2011"],"Disposition":"Unknown","Summary":"3 balls moving very slowly, No change in direction or speed.","Date Submitted":"01/20/2011 09:49 UTC","Latitude":"32.802633","Date of the Event":"01/20/2011 11:24 UTC","Country":"United States","Region":"California","Object Flight Path":"Straight-line path","Longitude":"-116.955737","Weather Factors":"Unknown","divs":["sighting detailsat exactly 11:24 am on 1\\20\\11 i was driving, and was traveling east at the intersection of broadway & east 2nd ave in el cajon, ca in san diego county. i noticed 3 peculiar oval, circle, or spherical objects due east. i pulled into the cvs parking lot at the intersection as i was driving my work truck, to observe the objects. they looked like they were hovering just above or behind the mountains, and they were spaced the same distance apart from each other in a line and were not changing altitude or speed or distance. it was a very clear sky today, about 75 degrees and the sky was so blue, not a cloud in that area, that they stcuk out like a sore thumb. they weren't huge, but if someone were to see them, they definitley would have stuck out. i thought they might be planes at first, but i could see planes taking off and landing to the north of me at the airport. these objects were not in the airports flight line, and even when helicopters are far away, i can see the rotors, and i've never seen silver helicopters moving that slowy, in synchrnization or commercial or private planes. except for military planes flying in tandem, but at such slow speeds? at the same time i saw a single engine plane to the ese of me, but in front of another mountain, at roughly the same distance, flying in front of the other mountain. an analogie for how slow the objects were moving to the plane in front of the mountain, would be to compare 3 people walking in slow motion to a person running. i watched them for 10 minutes and they disappeared behind the mountain. i was in the navy, and i'm aware san diego has a lot of military activity, but these were something i couldn't explain. after i left the area, i was traveling west on highway 8 when to the north i noticed what looked like an f-18 moving extremley fast at about 2,000 ft altitude, in the direction i saw the objects. that was about 10-15 minutes after i had left the parking lot watching the objects."],"Sighting Duration":"Undisclosed","City":"El Cajon","Log Number":"US-01202011-0008","Viewing Distance":"Unknown"}