{"Log Number":"CA-01202011-0004","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around November 25th 2010"],"Country":"Canada","Weather Factors":"Rain, Medium","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City","Date of the Event":"11/25/2010 08:00 UTC","Object Shape":"Circle","Case Number":"27462","map":"<A HREF = \"http://maps.google.com/maps?q=45.51538,+-73.552762(27462)&iwloc=A&hl=en\"> mufon case (27462) map </A>","Longitude":"-73.552762","files":["/var/www/straped/mufon/html2text/27462.html.txt","/var/www/straped/mufon/org/27462.html"],"Date Submitted":"01/20/2011 10:25 UTC","Latitude":"45.51538","City":"Montreal","Object Features":"Dome","Source":"MUFON","Object Flight Path":"Path with directional change","divs":["Sighting Details I was on my way to the pharmacy after dinnertime in the early evening, and I noticed while I was driving, that there was something strange reflecting on my windshield, so I stopped to verify what was happening. I stepped out of my car and saw in the sky below the level of aircraft which were flying way above, were not a reflection at all but a very wonderous sight, It was raining, the sky was dark and grey but the `thing in the sky was clearly observable,hard to describe in one word, there were four small craft veiled in a fuzzy cloud of light they were turning counterclockwise at the same time and then instantly met in the center where they formed a large ball of light. They then repositioned back into the circles edge at 90 degree intervals,turned counterclockwise for which appeared to be of the same distance as the time before, It seemed as though they recentered every 90 degrees of rotation. when I reached the pharmacy it continued to hover at the same height, ther were only a few people in the parking lot, they did not look up into the sky even though I was standing ther and staring at it. I didn`t feel right about calling attention to it, I said I will wait and see if anyone else notices before I speak up, unfortunately no one caught on at the pharmacy so I continued back home all the while keeping my eye on this thing, finally I see two teenagers waliking their dogs on the sidewalk staring up in the sky, I stop my car and ask them if they see what I am seeing, they said yes, I was very relieved to know I was not seeing things. I asked them if they had a camara, they said yes, and they said they tried to take a picture with their cell phone camera, but it was not showing up well. I told them they should try to film it and put it on you tube or something. I got home and felt very helpless. I wish I had taken greater measures and have invested in a disposable at the pharmacy, I felt negligent. From now on I keep that old cell phone charged in case I do see this thing again. I have roamed the internet since and have been checking for similar sightings, to my amazement I discovered something extremely similar in an Ohio sighting on May 16,2010. This is why I have decided to come forward and describe my sighting in a public forum. Thank you for this website"],"Region":"Quebec","Viewing Distance":"501 Feet - 1 Mile","Summary":"4 small blurry crafts rotated counterclockwise in sychronicity and then joined at the center , rotated and then centred again constantly while moving horizontaly over land . It was below the level of aircraft."}