{"Sighting Duration":"01:34:00","Weather Factors":"Unknown","Object Shape":"Diamond, Disc, Flash, Star-like, Unknown","City":"Chicago","Latitude":"41.886014","Source":"MUFON","Date of the Event":"01/16/2011 05:11 UTC","Disposition":"Insufficient Data","Longitude":"-87.624878","Viewing Distance":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.886014,+-87.624878(27469)&iwloc=A&hl=en\"> mufon case (27469) map </A>","Country":"United States","Log Number":"US-01212011-0002","Tags":"City","Region":"Illinois","divs":["sighting detailsthere are 3 more videos that accompany this one. search you tube for \"ufo in hd\" and you can see more angles of the craft. read the descriptions for each video for details. *best spot on this video attached is at around 1:58 and you will clearly see it is a silver disk rotating when i zoomed in. then you can clearly see some type of weird electromagnetic camouflage come over the object. this obscures it..and shields it from view. from a distance...it looks just like a venus or a star, but the flashing was undeniably strange and you would notice it right away. background\\update...i woke up and always check the sky for venus. (it is up at an angle i have to strain my neck to see it at a high angle off the horizon...way up there), from the window and i position i am at...it is almost out of view...on a consistent basis. out of nowhere...i took a glance out the window, and saw a pretty big object that was flashing and seemingly pulsating...then i swear to you...it started to move...slowly...nothing drastic. i ran down the hall and grabbed 2 camcorders and 2 tripods...this is one of the original clips. i starting filming at 5:11 am on sunday january 16th, 2011. it was off the horizon at around a 70 degree angle, not up high where venus is, but i would estimate about sears tower altitude on it. the ufo was lower than venus and in a completely different area. i would say it was hanging right over the norridge or harwood heights areas. as it was finally clear here in chicago...(today 1\\21\\2011), i checked the sky...same time today...nothing was in this area...at all. nothing. saw venus...same spot...way up...you can see it but barely. venus does not change positions like that. this object (on video and i attached a photo) was only there on dec. 15th and jan. 16th. (i have 94 minutes of footage...including the departure of the craft and i will send a copy of both dvd's to mufon) (i tried as hard as possible to keep quiet and keep the camera steady, but i lost it a few times, and so parental guidance is suggested i say a few bad words...could not help reacting...i lost it a few times.)"],"Case Number":"27469","files":["/var/www/straped/mufon/html2text/27469.html.txt","/var/www/straped/mufon/org/27469.html"],"Object Flight Path":"Undisclosed","Summary":"UFO in HD Video Attached: (Search You Tube for UFO in HD)","Date Submitted":"01/21/2011 12:35 UTC","trends":["There have been 221 other sightings in Chicago","There were 2 other sightings in Chicago on or around January 16th 2011","This sighting has never been favorited.",""]}