{"Viewing Distance":"Unknown","Longitude":"-117.152795","Weather Factors":"None","Object Flight Path":"Straight-line path","Source":"MUFON","Summary":"spotted short cylinder object with eye, observed through binoculars, it disappeared","Country":"United States","Object Features":"Other","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/27479.html.txt","/var/www/straped/mufon/org/27479.html"],"Date of the Event":"01/21/2011 11:45 UTC","Tags":"City","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around January 21st 2011"],"Region":"California","divs":["sighting detailssouthern california, high noon, clear sky. i was sitting on the beach with my dad between 11 am and noon on january 21, 2011. while looking up and watching helicopters and commercial jets overhead, i noticed a white object far above the local traffic traveling from north to south at a rather slow pace. odd, because air traffic here is going east\\west most of the time. the exception is military craft going south\\north\\north\\south at lower altitude and easily identified with the naked eye. (this might not be totally accurate - just my general observation of traffic.) i thought it might be an international airliner at high altitude traveling towards mexico or south america. it was certainly not a blimp, satellite, or anything else i could readily identify. i fetched a small pair of binoculars from my car and continued to track this object for about 10 minutes. it appeared to be a white\\shiny, short, cylinder-shaped object with no discernible wings or lights, and it moved in a straight line. all i was thinking was it must be very high up to appear to be moving so slowly. as i was watching, the whole object flashed on and off a few times and then completely disappeared. i continued to search the sky, wondering if i'd somehow lost sight of the object. as i tried to find it, it seemed to me there was some kind of cloud cover very high up. i asked my dad and he said the sky was clear. so, what was it? how does a craft disappear in broad daylight and plain view? and are there any other recorded sightings above san diego at this time? still wondering!"],"City":"San Diego","Object Shape":"Cylinder","Sighting Duration":"Undisclosed","Log Number":"US-01222011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=32.723939,+-117.152795(27479)&iwloc=A&hl=en\"> mufon case (27479) map </A>","Latitude":"32.723939","Date Submitted":"01/22/2011 03:34 UTC","Case Number":"27479"}