{"Log Number":"US-01222011-0004","Country":"United States","Summary":"Triangle passes over our house very low. Could have hit it with a rock. Yelled for girl friend to confirm.","Latitude":"37.749347","Source":"MUFON","Date of the Event":"12/18/2010 08:00 UTC","Region":"Kentucky","Weather Factors":"None","divs":["Sighting DetailsWhile standing out back smoking I notice two bright lights off in the distance heading my direction. It took a few minutes to get close enough to make out what it was. After a couples more minutes I decided to run in and yell for my girlfriend to come look at it. Stupid me never told her to grab the camcorder! She was so excited and kept talking asking what it was. I asked her shush and listen. I'm hard of hearing and could not hear any sound it was making. I asked her if she could hear anything and she stated \" I hear a low humming sound. \" at that point we walk to our side gate to see if we could get the neighbors to come out and look. They had a house full of people and couldn't hear me yell. The triangle was right over top of us. It was so big and bright and very low. I could have threw a rock and hit it. My girlfriend tried to get her cell phone camera to work and couldn't. She ran to the other side of the house to see if she could get the other neighbor to see it but she was leaving. We watched this thing for a good 15 minutes as it floated across the sky very slow from South East to North West. It was headed right toward the love's truck stop out to interstate 75. What I would say was the front of the thing had two lights like head lights. The under side had three lights in each corner. Around those three lights were smaller lights. The smaller lights were in a circle around those three. Across what I say was the back had two flashing lights. I'm sure someone else had to see this thing because it was to big and bright. I'm positive it was bigger than the lot our house is on."],"files":["/var/www/straped/mufon/html2text/27477.html.txt","/var/www/straped/mufon/org/27477.html"],"City":"Richmond","trends":["There have been 10 other sightings in Richmond","There were no other sightings in Richmond on or around December 18th 2010"],"Sighting Duration":"00:15:00","Date Submitted":"01/22/2011 10:03 UTC","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Longitude":"-84.290154","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.749347,+-84.290154(27477)&iwloc=A&hl=en\"> mufon case (27477) map </A>","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Case Number":"27477","Object Features":"Unknown"}