{"Longitude":"-123.033766","Country":"United States","divs":["sighting detailsat about 7:12pm on 01\\21\\2011 i was on my way to the store and i looked out the window toward the west and there were 6 possibly 7 red and then orange lights in the sky. my first thought was stars but the sun had gone down around 4 pm so it couldn't haven't been the sun lighting them up that color, and they slowly started to move. they started out in the formation of a constallation but then move into a line. some would fade in and out, but when they changed color from red to orange and back again they did it together. eventuly they all went from a straight line to a small circle and then dissappered. this all took pace within about 7mins. i think i was so amazed by my sighting that i didn't intirely pay attention to the time so for give me if my time is off but i know what i saw and all the thoughts put toward what they could have been were most trully false. hot air balloons with lights on them (no it was too windy to have that kind of control) air planes helicoptors (no way no noise and they dont have those colored lights) stealth plane (nope cuz they never once formed a triangle like some reports say)"],"City":"Salem","Summary":"6 fireball-like lights in the sky.","Region":"Oregon","Object Shape":"Circle, Fireball, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=44.952648,+-123.033766(27474)&iwloc=A&hl=en\"> mufon case (27474) map </A>","Date Submitted":"01/22/2011 12:04 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around January 21st 2011"],"Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27474.html.txt","/var/www/straped/mufon/org/27474.html"],"Case Number":"27474","Object Features":"Other","Weather Factors":"Windy","Date of the Event":"01/21/2011 07:15 UTC","Disposition":"IFO","Log Number":"US-01222011-0001","Latitude":"44.952648"}