{"Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unknown","Longitude":"-106.887196","Case Number":"27488","files":["/var/www/straped/mufon/html2text/27488.html.txt","/var/www/straped/mufon/org/27488.html"],"Sighting Duration":"00:20:00","Date of the Event":"01/22/2011 12:00 UTC","Object Shape":"Other","City":"Socorro","Region":"New Mexico","Latitude":"34.06099","trends":["There have been 3 other sightings in Socorro","There were no other sightings in Socorro on or around January 22nd 2011"],"Log Number":"US-01232011-0003","Date Submitted":"01/23/2011 01:13 UTC","Weather Factors":"None","Object Features":"None","Tags":"City","Summary":"silent red lights over Socorro NM","divs":["Sighting DetailsStepped outside and saw 5 red lights about 70 degrees in elevation and to the southeast. They appeared to be about a few thousand feet in the air and hundred to a few hundred feet apart. Four made a sort of square configuration and 1 was trailing behind. They did not seem connected. They were headed from the northeast towards the southwest. It was partly cloudy and the clouds were moving generally to the east. As the lights moved overhead I noticed an additional 3 trailing behind by a couple of hundred feet and separated a couple of hundred feet. I watched for about 5 minutes until they disappeared into the clouds. At there rate of speed it would take about 1 minute to cover ~90 degrees of sky. I then went inside for about 5 minutes and then back outside to see if there were more lights. There were 2 more lights, separated by about the same distance apart, and they also appeared to be coming from the northeast. At this point, I climbed to my roof to see if I could see any more approaching from the horizon. I could see a red light traveling above the rio grand river, ~ 5-10 miles away, but heading south. After watching for ~ 2min and this light disappearing, I waited for another 5 minutes and didn't see any more lights. I teach an astronomy lab at the university, so I am familiar with celestial objects and what conventional aircraft look like at night. These objects were silent, small, and very bright. The center of the light was a bright white - red, and seemed to glow solid red. I've never seen anything like it. I'm curios if anyone happened to video tape the objects or get a picture. Please contact me if you have any questions"],"Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.06099,+-106.887196(27488)&iwloc=A&hl=en\"> mufon case (27488) map </A>"}