{"Sighting Duration":"Undisclosed","Longitude":"-121.987442","City":"Fremont","Date of the Event":"01/22/2011 12:27 UTC","Tags":"City","Region":"California","Viewing Distance":"Unknown","Case Number":"27489","Object Shape":"Other","Summary":"Mushroom captured on camera, complete surprise when I looked at the shot later.","Object Features":"Dome","Source":"MUFON","divs":["Sighting DetailsEarly afternoon I noticed some cool clouds so I grabbed my camera, headed out to the front yard and got four quick shots. When I viewed them on the laptop a few moments later I noticed one had an odd mushroom shaped cloud that wasnt quite the same color as the other clouds. I thought maybe it was a sonic boom so I perked up the midtones and put it on my website as a mystery. A few hours later I got to wondering, and after checking dozens of available pics online I found that the only ones that matched my shot were possible ufo's, not fighter jets. Since I didnt notice the object while I was outside I have no detailed info on its movements. One thing I found interesting was a purplish arc at the edge of the picture behind the object, it isnt on any other pics I have taken with that camera and doesnt strike me as flare. Had I taken the shot a fraction of a second later we may have seen something interesting trailing that craft. Attached 2 photos, one is the full shot with object circled in the lower right, the tones have been adjusted for best color but that is all that was done to that shot. one is a cropped and enlarged view of the object taken straight from the original picture, no touching up has been done on that shot."],"trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around January 22nd 2011","This sighting has never been favorited.",""],"Date Submitted":"01/23/2011 02:22 UTC","Latitude":"37.55193","files":["/var/www/straped/mufon/html2text/27489.html.txt","/var/www/straped/mufon/more/27489_submitter_file1__ThiscouldbeaUFO.jpg","/var/www/straped/mufon/more/27489_submitter_file2__CloseupofUFO.jpg","/var/www/straped/mufon/org/27489.html"],"Object Flight Path":"Unknown","Weather Factors":"Windy, Medium","Log Number":"US-01232011-0004","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.55193,+-121.987442(27489)&iwloc=A&hl=en\"> mufon case (27489) map </A>","Country":"United States"}