{"Country":"United States","City":"Otisville","Latitude":"41.473427","Summary":"high in the sky, thought it was a star but moved like a plane. zig-zaged slowly, fly up higher and higher then swirled","files":["/var/www/straped/mufon/html2text/27484.html.txt","/var/www/straped/mufon/org/27484.html"],"Longitude":"-74.538493","map":"<A HREF = \"http://maps.google.com/maps?q=41.473427,+-74.538493(27484)&iwloc=A&hl=en\"> mufon case (27484) map </A>","Date of the Event":"01/22/2011 07:30 UTC","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Case Number":"27484","Log Number":"US-01222011-0009","Object Features":"Undisclosed","Region":"New York","Source":"MUFON","Object Shape":"Cigar, Star-like","Disposition":"IFO","Date Submitted":"01/22/2011 09:13 UTC","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been no other sightings in Otisville","This sighting has never been favorited."],"divs":["Sighting DetailsI just got home from the store. I sat down on my porch and lite up a cigarette. The sky was very clear so I started to look at the stars. When I looked near the Orion belt to find this strange looking star. It was more of a yellow color compaired to the other stars. At first I thought it was a star but noticed it moving. So I then thought it was just a plane, but I noticed all the other planes had the blinking lights and this one did not, it was also moving a lot slower than a plane. It started to move up into the atmosphere at a slow steady pace when all of a sudden it swirved to the right then back in its path. It continued to move up in the sky when I ran inside to get my boyfriend. When we came back out it was higher then when I left. I showed him and he saw it moving side to side then it stopped for a couple of seconds. when it started to move it was rotating in a circle in a clockwise direction then in a counter clockwise direction. The whole time still staying in one spot. It would continue to do this over and over for about 15 or 20 min. But in between it would move higher, every slowly just enough to notice it was moving. When it rotated in circle then stop and then move up, it would sometimes suddenly move side to side. I lost veiw of the object when it became to high in the sky to see. Like I said bfore it was a clear night so I could see pretty far. I would describe myself as open mined but I am the kind of person that has to see to beleive. I saw and now I believe."],"Weather Factors":"Unknown"}