{"Date Submitted":"01/23/2011 05:01 UTC","Latitude":"35.965628","trends":["There have been 50 other sightings in Knoxville","There was one other sighting in Knoxville on or around January 23rd 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/27495.html.txt","/var/www/straped/mufon/more/27495_submitter_file1__GEDC0360.JPG","/var/www/straped/mufon/more/27495_submitter_file2__GEDC0358.JPG","/var/www/straped/mufon/more/27495_submitter_file3__GEDC0361.JPG","/var/www/straped/mufon/org/27495.html"],"Viewing Distance":"Unknown","Region":"Tennessee","Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=35.965628,+-83.911039(27495)&iwloc=A&hl=en\"> mufon case (27495) map </A>","Object Features":"Window(s)","Disposition":"IFO","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Log Number":"US-01232011-0010","Country":"United States","City":"Knoxville","Weather Factors":"Unknown","Longitude":"-83.911039","Date of the Event":"01/23/2011 12:00 UTC","Object Flight Path":"Straight-line path","Summary":"SAW CLOUDS THAT LOOKED LIKE A UFO WAS HIDDEN IN IT, LIKE IT WAS INVISIBLE","divs":["Sighting DetailsI was sitting on a lawn chair in the back yard. My husband was playing ball with the dog and the two children were on the trampoline. We had been out all morning since the sun was out. I take photos of nature and enjoy taking pictures of the clouds and the likes. I took several pictures this morning. When I saw this weird shaped clouds in the sky. I had never seen these forms in a clouds in nature. TO Sum it up, it looked like a spacecraft with windows on the side. It looked like it was invisible spacecraft in the clouds but somehow, passing through the sun and going through a cloud made it visible. I am a skeptic and really don't believe in this stuff but this was beyond belief. It looked like those crafts that people always talk about: flat, sphere like with windows on the sides that go all the way around the craft. This photo shows it as if it is just one side visible passing through but it looked like a circular craft. It passed very slowly in front of the sun and just moved along as a cloud would. I felt freaked out and did not tell the family what I was seing. I have heard stories of people saying UFO's have an invisible shield and that is why they hide in the clouds and we can't ever seen them. I don't know but these shapes were nothing a cloud has ever made before and I take lots of photos of clouds. Best way to contact me is by email."],"Case Number":"27495"}