{"divs":["Sighting DetailsToday I left my house to take our son to school at Hardin Valley elementary in Knoxville Tennessee. After I turned right off Lovell road to Hardin valley road, I noticed something I THOUGHT was a helicopter going parallel to Hardin Valley Road. It was traveling slightly faster than traffic which was flowing about 45 mph since I could not keep up. I noticed right after I turned (about where the shell rocky top gas station is at and the new Mc Donalds. It was on the right of the cars and following the traffic. There was a whole file of cars in front of me and they were slowing down to look. I could not stop since the traffic was heavy and it is a 2 lane road. I had my camera in my hand since I never leave home without it. Here is where I am trying to describe the object to the best of my ability. It was triangular. It passed me and the underside looked like a typical plane shape from underneath but it was dark. The only thing with that is it was HOVERING> I know planes can't fly so low next to traffic by power lines and just hover, they fly . I noticed lights blinking: red, blue, white on the tips and underneath. The lights were a lot brighter than helicopter lights, like those super bright LED lights they have now, except a thousand of those put together.THe lights blinked in a similar pattern as those of a plane: 1-2, 1-2, 1-2-3 and repeat but the intervals were uneven. As I pulled in to the drop off line at the school, i made a right off hardin valley and was able to grab my camera and start it up. At this time the object was over the Food city grocery store by the school and hovering over the parking lot. It was triangular, blinking and hovering. I could NOT see or hear chopper blades. The lights were too bright when they blinked to make out anything on the craft.. It was moving back and forth, not like a plane but like a fast helicopter, fluidly. It then zoomed off to the mountain ridge right by Cambpell station road and beyond. I followed it with my eyes and it was a the top of a mountain just hovering. Then I lost it with my eyes. I had to cut the camera off when I dropped off my son and then I lost the flying craft by the time I pulled out onto the main street. I downloaded the video and since it was night, i was disapointed to see that all it showed was lights and not the triangle shape that I saw. It was still partly dark out at 7:20 am and my camera is not super. What I saw was way more than was the movie shows. I think I messed up by zooming in. The bottom line is: I have seen lots of helicopters and when they search, they have their spotlights on. This is the only reason a chopper would be in a residential area. It certainly would not fly as low as power lines and street lights, when school is in. I called the knox county dispatch and asked if there might have been a call in the area for a knox county sheriff helicopter to be dispatched to a call. She asked me to hold on as she was checking on the calls from 7 am to 7 :30 in the Hardin Valley area and Hardin valley school area. She came back on the phone and told me that no, they were not called for emergency or anything else. I then asked her is the county helicopters got brighter lights. She said not, the only time the lights are bright is when the spotlight is on. She said they would not do training in that area at that time of day. They don't usually go there to train anyhow. She said she will look into if a private citizen has a helicopter and was flying it because he should not have been flying it that low and in that area. She asked for my phone number and told me if anything else arises she will call. I said so there were no helicopters there? she said to me: not ours. There is not an airport in the area. The nearest one is Maryville. The craft did not have the usual search light had it been searching for a suspect. I just wish the video had been taken when it was following the cars on the main road, I was staring at the craft and could have gotten a better shot of it (maybe). It is just so hard to film anything at night it seems. The film is what I got on camera."],"Date of the Event":"01/24/2011 07:15 UTC","Latitude":"35.968568","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.968568,+-83.911089(27498)&iwloc=A&hl=en\"> mufon case (27498) map </A>","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/27498.html.txt","/var/www/straped/mufon/org/27498.html"],"Longitude":"-83.911089","Object Shape":"Triangle","Disposition":"IFO","Weather Factors":"Unknown","Log Number":"US-01242011-0001","Object Features":"Undisclosed","Country":"United States","Case Number":"27498","Viewing Distance":"Unknown","Region":"Tennessee","Date Submitted":"01/24/2011 08:58 UTC","Sighting Duration":"Undisclosed","Summary":"while taking son to school triangle shaped object traveling besides traffic. Looked like plane but behaved like helicopter, triangle shaped","City":"Knoxville","trends":["There have been 50 other sightings in Knoxville","There was one other sighting in Knoxville on or around January 24th 2011","This sighting has never been favorited.",""]}