{"Weather Factors":"None","Date Submitted":"01/23/2011 11:38 UTC","Latitude":"26.251748","Sighting Duration":"Undisclosed","Longitude":"-80.178935","Country":"United States","Object Features":"None","Object Flight Path":"Stationary,Hovering then path","Case Number":"27497","Summary":"2 Big Orange Balls of Light","divs":["Sighting DetailsI was coming home from the store and turned West towards my house. That is when I saw the 2 BIG Orange balls of light. I knew immediately it wasn't a plane. I kept saying to myself What is that? I never in my life thought I would post here or see a real UFO. Well it was 2 Big Orange balls of light, not like a craft. It wasn't a balloon as it was light. It wasn't being projected from the ground. They were huge SOLID lights, not blinking so it wasn't an airplane which those lights in the sky are small. These Huge orange balls of light were like the size as if you saw a hot air balloon in the sky at a close distance. I had a camera in my purse but it had a dead battery. I kept trying to turn it on (cursing) because I wanted to take a good digital photo. My other phone I had left at work which would of been a poor camera quality as its a cheapie free phone. I immediately called my sister's cellphone to tell her what I had seen but got her voicemail. I left a voicemail. The objects where 1 right below the other. Verticle and just \"floating\" stationary in the air. That's the thing they weren't moving they just stood still for a few minutes and never pulsated, just solid orange globes. When the cloud cover went by, they were covered up and then they were gone. I had called my sister because she lives near by and I wanted her to go outside as she lives further North and might see them. Its funny but I always watch movies where people stare at UFOs and I think idiot run in case something might beam you up or get you but there I stood, just staring. I couldn't look away from it because I guess my mind was trying to process or figure out what it was. There have been some other reports earlier in this month in the same county of similar description. honestly I was excited when I pulled in the garage and went to jump out to continue looking at it but at the same time scared it could of been threatening. If I had to give you an area of where it was, over NorthEast Coral Springs, FL or by Parkland, FL."],"Source":"MUFON","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/27497.html.txt","/var/www/straped/mufon/more/27497_submitter_file1__2Orangelights.jpg","/var/www/straped/mufon/org/27497.html"],"trends":["There has been one other sighting in Coconut Creek","There were no other sightings in Coconut Creek on or around January 23rd 2011","This sighting has never been favorited.",""],"Log Number":"US-01232011-0012","Region":"Florida","City":"Coconut Creek","Date of the Event":"01/23/2011 08:40 UTC","Object Shape":"Circle","Disposition":"Insufficient Data","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.251748,+-80.178935(27497)&iwloc=A&hl=en\"> mufon case (27497) map </A>"}