{"Disposition":"IFO","divs":["sighting detailsat approximately 2305 hours on 01\\23\\2011,in la porte, texas. i was walking my dog when i heard a strange humming sound. when i looked up i saw a black flying object, shaped like a teardrop but with angular wing like protrusions pointing backwards. three(3)very bright orange lights were facing forward. two(2)of the lights were on each side of the craft facing forward and one(1)orange light was in the middle or nose area of the craft. the craft made a sound that was like high current electricity, a loud humming sound. the craft's sound was like no sound that i have ever heard before from a man made flying machine. when i saw the craft, i was transfixed by the very bright orange lights. at no time was i scared or did i feel threatened in any way. the craft was traveling north at approximately 500' above the tops of the houses. the forward velocity seemed to be approximately 60 mph.the craft was traveling in a straight orientation. i saw this flying craft for approximately three(3) minutes. i lost sight of the object after it passed overhead and continued north. i could hear the low humming sound longer than i could see the flying craft. c i have not seen this flying craft since this initial sighting."],"Longitude":"-95.011173","Latitude":"29.673794","Date Submitted":"01/25/2011 10:10 UTC","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Straight-line path","Summary":"black flying object approx 500' above houses travelling North","trends":["There have been 5 other sightings in La Porte","There were no other sightings in La Porte on or around January 23rd 2011"],"Log Number":"US-01252011-0001","Case Number":"27503","Tags":"City","Date of the Event":"01/23/2011 11:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.673794,+-95.011173(27503)&iwloc=A&hl=en\"> mufon case (27503) map </A>","City":"La Porte","Region":"Texas","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27503.html.txt","/var/www/straped/mufon/org/27503.html"],"Object Features":"Wings, Other","Weather Factors":"Medium","Viewing Distance":"101-500 Feet","Object Shape":"Teardrop, Other"}