{"Longitude":"-81.670792","Date of the Event":"01/24/2011 08:15 UTC","Region":"North Carolina","Object Flight Path":"Undisclosed","Latitude":"36.225235","Case Number":"27509","Weather Factors":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.225235,+-81.670792(27509)&iwloc=A&hl=en\"> mufon case (27509) map </A>","Viewing Distance":"Unknown","Country":"United States","Summary":"Brief encounter at close range","Date Submitted":"01/25/2011 04:10 UTC","Disposition":"Hoax","City":"Boone","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-01252011-0007","Tags":"City","Object Shape":"Triangle","trends":["There have been 11 other sightings in Boone","There were no other sightings in Boone on or around January 24th 2011"],"divs":["Sighting DetailsEvening time around 8pm; I was leaving home to go to band practice. Outside home in rural residential area all of the neighborhood dogs were barking. I realized I was hearing a fairly loud metallic scraping and ripping sound; very high pitched coming from the top of the closest hill. I could not see anythin, but the sound persisted for approx. 30-45 seconds. At times the sound reached high pitch range close to a siren. It was very unidentifiable, eiry, and definitely bothering the dogs. When it stopped it was suddenly very quiet. I thought it was strange, but none the less got in my car, left my home, and began driving on a local hwy towards town ~40mph. Within five minutes of leaving home I saw a slow moving triangular shaped craft with three bluish white lights located on each of the apex points flying at tree top level across the highway. I appeared to moving very smoothly, almost gliding across the valley. The area in which it was seen is a commercial strip with multi-story residential buildings and fairly populated with college students. I was completely enthralled by the UFO, and began to track its movement. I followed it and ended up driving into a hayfield off the highway, stopped my car and got out. I watched it go behind a stand a tress near to the multi story housing area. It was probably 300' away from me when it began to disappear. It was completely silent and appeared to surveying the area. It was on a straight line trajectory flying perpendicular to the ground. It was not a helicopter because it would have made a loud noise; it was absolutely silent. I got back in my car, started it up and began to pull around back towards the highway when a light lit up my car from above. It was not a bright white spotlight one would expect from helicopters. It was a soft light and it encompassed my vehicle for approximately 3-5 seconds. I stopped again got out and saw nothing. I feel as if I had been scanned by this light beam. Not sure why, but I do believe this to be the case. Later that evening I played the best music I have ever been able to play amazing my fellow musicians. Perhaps, the light interacted with my energic field and was able to raise my aural energies?"],"files":["/var/www/straped/mufon/html2text/27509.html.txt","/var/www/straped/mufon/org/27509.html"]}