{"divs":["Sighting DetailsI am a night shift RN and went outside to see where Mars was in August. Inoticed two bright stars, but they also had pulsating lights of blue, green,red. I called out several of my psych techs and they also observed the lightsand found a couple more, too. One even saw them also pulsating in yellow. Wethought they might be some satellites or aerial observation to do with Marsbeing so close to Earth. Something colleges or weather bureaus had put up,maybe to take pictures of Mars. This is December and they are still there. Iwatch them every night. I didnt really think of reporting it until I read onthe Coast to Coast talk show web site about others seeing these lights in Londonand our east coast. They just hang there in the same spots in the sky andpulsate these four colors. Many techs have also seen them over the past months. They dont seem to move or make noise....just hang there. We sure would like toknow what they are. Out here in the middle of the desert it sure cant be causedby humidity or ice crystals We can also hear that persistent humming tone duringthe night when everything is quiet that people are talking about. It soundslike a semi-truck engine idling in the distance."],"Summary":"Pulsating lights in sky","Log Number":"","Object Flight Path":"Stationary","Object Shape":"Undisclosed","Tags":"City","Date Submitted":"08/01/2003 12:00 UTC","Region":"Arizona","Object Features":"Undisclosed","City":"Yuma","Case Number":"2750","map":"<A HREF = \"http://maps.google.com/maps?q=32.696051,+-114.617952(2750)&iwloc=A&hl=en\"> mufon case (2750) map </A>","Weather Factors":"Unknown","Date of the Event":"08/01/2003 12:00 UTC","Longitude":"-114.617952","Latitude":"32.696051","Disposition":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around August 1st 2003"],"files":["/var/www/straped/mufon/html2text/2750.html.txt","/var/www/straped/mufon/org/2750.html"],"Sighting Duration":"01:59:00","Source":"MUFON"}