{"Summary":"ufo in the western sky","Viewing Distance":"Unknown","Latitude":"20.884943","Object Flight Path":"Hovering then path","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"27507","City":"Lahaina","Date of the Event":"04/11/2002 12:00 UTC","divs":["Sighting DetailsI lived in Maui for 6-7 years. At the time of this occurence I was in Napili HI. Napili is located on the west side of Maui, about 8 miles past Lahaina. I was on the beach having a smoke, looking west towards the island of Lanai. It was dark at the time. I noticed it right away! It was brighter and lower than any star. It looked barely over the island of Lanai. It wasn't moving though, it also changed hues from red to green to silver back to red or green etc. I didn't know what it was. I asked a newlywed couple to take a look at it. It didn't move and it didn't look like a star or plane. Here's what happened.... It stayed stationary for about 20-30 minz, consistently changing hues, low in the horizon. When it left was the interesting part. It went from completely still to dropping in the horizon at a sw movement. (SW meaning looking at it. It moved down and to the right in a straight line) Way to fast for a plane! Then it stopped on a dime and zoomed upwards with an arc. It left a tail as it vanished almost instantly. I was curious if anyone else had seen this, the newlywed couple was from Florida, it was at their condo. They saw it too."],"map":"<A HREF = \"http://maps.google.com/maps?q=20.884943,+-156.68072(27507)&iwloc=A&hl=en\"> mufon case (27507) map </A>","Object Features":"Unknown","Date Submitted":"01/25/2011 01:34 UTC","Source":"MUFON","Longitude":"-156.68072","Disposition":"Unknown","trends":["There have been 5 other sightings in Lahaina","There were no other sightings in Lahaina on or around April 11th 2002"],"Object Shape":"Sphere, Star-like","Log Number":"US-01252011-0005","files":["/var/www/straped/mufon/html2text/27507.html.txt","/var/www/straped/mufon/org/27507.html"],"Region":"Hawaii","Tags":"City"}