{"files":["/var/www/straped/mufon/html2text/27515.html.txt","/var/www/straped/mufon/org/27515.html"],"City":"Tarboro","Tags":"City","Longitude":"-77.529315","map":"<A HREF = \"http://maps.google.com/maps?q=35.906554,+-77.529315(27515)&iwloc=A&hl=en\"> mufon case (27515) map </A>","Object Flight Path":"Stationary,Path with directional change","Country":"United States","Latitude":"35.906554","Weather Factors":"Unknown","Case Number":"27515","Disposition":"Unknown","Date Submitted":"01/25/2011 09:03 UTC","Log Number":"US-01252011-0010","trends":["There has been one other sighting in Tarboro","There were no other sightings in Tarboro on or around January 24th 2011"],"Object Shape":"Sphere, Star-like, Unknown","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","divs":["sighting detailsoutside with husband on the porch. my husbands eyes look out to the horizon. he says what the.....!!!i turn around to see just above the tree tops far away facing south what appear to be three separate red lights hovering far in the distance. each light appeared about the same size as a large star. if you can imagine . . . these dots represent the exact formation of these 3 bright red lights, never in my life had i see such a thing. it stayed motionless for a few minutes. no sound. i grabbed my binoculars. looking in them we couldn't see anything but lights, no shape observed. then they appeared to move perfectly aligned but tilted up on the left moving toward southwest direction slowly moving away in the distance. if you were to hold your arm outstretched and closed your fist, that would be about how wide the entire 3 lights were. i love to star watch and pay attention to air traffic and patterns. this in no way shape or form looked like an airplane or star. the way they\\it moved together looked exactly like a formation or one very mothership large craft. both my husband and i are x military and agreed that they were not jet exhausts or trails. my star charts confirm no planets or stars at those degrees at that time. my thoughts and feelings.....wow, i was scared and excited at the same time. my husband was more curious than anything. he is a long time skeptic but i think this stumped him."],"Sighting Duration":"Undisclosed","Date of the Event":"01/24/2011 07:57 UTC","Object Features":"Unknown","Summary":"THREE BRIGHT RED LIGHTS IN A ROW Motionless for minutes","Region":"North Carolina"}