{"Object Flight Path":"Undisclosed","Region":"Ohio","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"07/04/2010 12:00 UTC","Object Features":"Undisclosed","Longitude":"-81.693019","Date Submitted":"01/25/2011 10:20 UTC","Summary":"right before fireworks and july 4th at whiskey island in cleveland ohio","Log Number":"US-01252011-0011","Case Number":"27516","Object Shape":"Egg, Fireball","divs":["Sighting Detailsme and several friends attend the festivities at whiskey island in cleveland ohio pretty much every year on july 4th...as the day time activities drew to an end...a few hundred people in attendance started to get situated for the evenings fire works display. a friend of mine pointed up to the sky and i saw a orange object that looked like a flame of a lighter, horizontal to the ground traveling east at what appeared to be an amazing rate of speed, at a very high altitude. weather conditions were very clear, aside from a few white clouds in the sky. several people took notice and talked briefly about it. i would like to say that i am positive that it was not a firework, a chinese lantern...just for the record. as the object flew over head, it looked like it was headed higher and higher...but not flying straight up...more like how a plane increases altitude. after it passed everyone kind of was just quite. kind of like \"sh*t\" that was neat, weird, or \"cool\". all of us as a group even discussed the craziness of reporting a ufo sighting on july 4th! once the fireworks ended everyone started to make their way to their cars, only to wait in traffic for 45 minutes. my friend that originally spotted the orange ufo had gotten out of the traffic about 15 minutes before i did, called me and said he saw \"it\" again headed in the same direction...i however was unable to see it. about ten minutes after that brief conversation, my girlfriend noticed \"it\" flying at what looked like the same altitude, but this time south west of where we are. i would like to note that i am award of many colorful things in the sky on july 4th AND that i am very very well aware of the one major and one small airport in cleveland...this, however was something different, and i feel very fortunate to be able to say i saw it!!!"],"Weather Factors":"Unknown","City":"Cleveland","Latitude":"41.509115","trends":["There have been 47 other sightings in Cleveland","There were 2 other sightings in Cleveland on or around July 4th 2010"],"Disposition":"IFO","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27516.html.txt","/var/www/straped/mufon/org/27516.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.509115,+-81.693019(27516)&iwloc=A&hl=en\"> mufon case (27516) map </A>"}