{"divs":["Sighting DetailsI was at my home and I went to close the sliding glass door that leads to my backyard. I noticed two glowing balls of light, pretty decent size for how far away they were, southwest of my location. I went outside to get a better look and then another glowing ball appeared and then a fourth one appeared. They were grouped together in pairs. They would stay illuminated for about ten minutes and then fade away. They did this cycle about three times until they disappeared and did not appear again. They never seemed to move which is why I did not believe that they were flares even though they faded out like a flare would seem to do. The objects seemed to be about 20 - 30 miles away but were about 2 - 3 times the size of airplane lights. I felt a little strange because I have been out in my backyard at night many times to star gaze and Ive seen numerous flying aircraft because we are in the flight path for the phoenix airport but this was nothing like anything I have seen before. I was hoping for a little more clearer view though because they seemed so far away."],"City":"Avondale","Longitude":"-112.349602","Object Features":"None","Country":"United States","Object Flight Path":"Stationary","Date of the Event":"01/25/2011 10:45 UTC","Weather Factors":"None","Source":"MUFON","Tags":"City","Log Number":"US-01262011-0001","Disposition":"IFO","Date Submitted":"01/26/2011 02:54 UTC","Summary":"I saw one to four glowing balls of light in the distant sky. Each one disappeared and reappeared over 30 minutes","files":["/var/www/straped/mufon/html2text/27518.html.txt","/var/www/straped/mufon/more/27518_submitter_file1__201Copy.jpg","/var/www/straped/mufon/more/27518_submitter_file2__203.JPG","/var/www/straped/mufon/org/27518.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.435598,+-112.349602(27518)&iwloc=A&hl=en\"> mufon case (27518) map </A>","trends":["There have been 5 other sightings in Avondale","There were no other sightings in Avondale on or around January 25th 2011","This sighting has never been favorited.",""],"Region":"Arizona","Sighting Duration":"Undisclosed","Case Number":"27518","Viewing Distance":"Over One Mile","Object Shape":"Circle, Fireball, Sphere, Teardrop","Latitude":"33.435598"}