{"Region":"Tennessee","Latitude":"36.17455","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/27514.html.txt","/var/www/straped/mufon/org/27514.html"],"Summary":"A ufo the size of a beer bottle from 1 foot away from my face was the size of it from 3 stories above me at 3 miles.","Longitude":"-86.780523","Object Shape":"Disc","Case Number":"27514","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around August 14th 1996"],"divs":["Sighting Details A ufo the size of a beer bottle from 1 foot away from my face was the size of it from 3 stories above me at 3 miles. It was saucer shaped, and had an American flag on it. A friend of mine who works near Oak ridge air force pace didn't confirm or deny, but said it wasn't out of the realm of possibility. The location was in between Oak ridge and cook ville when I was around 7 years old. Ar first I thought it was indeed an airplane. Except an airplane wouldn't be saucer shaped. And the few experiments that were done, couldn't get more than 5 feet in the air. However this was about three stories. It was flying straight, however very slowly. I had another sighting a few years later, but this one seemed more unusual. For many years after the sighting, I experienced nightmares about being chased by alien creatures. I lost sight of it after turning away after 30 seconds. What was particularly bizarre, was that nowone else seemed to see it, so I was hesitant for many years, cause i don't want to seem crazy."],"Date Submitted":"01/25/2011 08:52 UTC","Object Features":"Insignia","Object Flight Path":"Straight-line path","City":"Nashville","Date of the Event":"08/14/1996 12:00 UTC","Log Number":"US-01252011-0009","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.17455,+-86.780523(27514)&iwloc=A&hl=en\"> mufon case (27514) map </A>"}