{"Region":"Nebraska","Date Submitted":"01/25/2011 11:01 UTC","trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around October 23rd 2010"],"Source":"MUFON","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.259763,+-95.990738(27517)&iwloc=A&hl=en\"> mufon case (27517) map </A>","Case Number":"27517","Sighting Duration":"Undisclosed","Object Shape":"Triangle","City":"Omaha","Country":"United States","Latitude":"41.259763","Tags":"City","Object Flight Path":"Path with directional change","divs":["sighting detailsmr. *(wit's name deleted--cms\\sg) was heading west bound on west center street and approaching 69th street, approximately at 6:30 pm in omaha, nebraska, just getting dark when he first notice the lights directly south of him (to his left). the craft was triangular in shape, with three white lights on the corners and a consistant strobing red light in the center. the craft was approximately, three to four blocks away, 500 ft off the ground, heading due east at an approximate and constant slow speed, estimated at 20 mph. *(wit's name deleted--cms\\sg) stated that he had to look back\\forth to the craft while driving, heading to border's book store that evening. the craft had multiple colored lights above the craft.. green, blue, orange and red. the craft then move to a sse direction, more so to offutt afb before he lost sight of the craft due to driving situation. during the time the craft was moving in the sse direction, the front white light faded out over time, while all other lights remained their original brighteness. *(wit's name deleted--cms\\sg) stated that he heard no noise and there seem to be little or no other traffic\\cars during his observation. *(wit's name deleted--cms\\sg) felt an euphoric feeling during and after the sighting and even so after two weeks. he stated that he became nauseated for some time after several weeks after his sighting."],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/23/2010 06:30 UTC","files":["/var/www/straped/mufon/html2text/27517.html.txt","/var/www/straped/mufon/org/27517.html"],"Longitude":"-95.990738","Disposition":"Unknown","Summary":"See narrative.","Weather Factors":"None","Log Number":"US-01252011-0012"}