{"Longitude":"-94.574547","Latitude":"39.108426","Date Submitted":"01/26/2011 03:25 UTC","Case Number":"27523","Object Features":"None","Summary":"Large black craft zooms over downtown KC then shoots north","Log Number":"US-01262011-0005","Country":"United States","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.108426,+-94.574547(27523)&iwloc=A&hl=en\"> mufon case (27523) map </A>","Region":"Missouri","Object Flight Path":"Path with directional change","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27523.html.txt","/var/www/straped/mufon/more/27523_submitter_file1__1-25-2011Pic1MissouriNortheast.jpg","/var/www/straped/mufon/org/27523.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was headed west towards Kansas City at dusk when I noticed a large black object in the sky (it would take a quarter to cover it at arm's length) approximately 2,000 feet above the downtown area. At first I thought it was a helicopter, but it moved may times faster than a helicopter, about the same speed as fast as a fighter jet, except it did not stop at each point before moving in a different direction. It was much larger than a helicopter - about the size of the stealth bomber. I attempted to get my cell phone ready to take a picture but was driving and was unable to do it. I did not have my regular camera with me. There were a couple of other traffic helicopters in the area and this looked nothing like them. This was an oval shape but with a flat bottom and was completely black with a dull finish, and no markings, lights, tail or wings. As it moved back and forth, the shape never changed. From my vantage point on a high hill, I could see a large area. This object flew back and forth in a ziz-zag pattern very quickly several times at super fast speed, the went back (west) and forward towards me (east), then shot north at an extremely high speed and out of sight in a second. I immediately called another field investigator who lives north of K.C. and he stopped his car and took several photographs of the sky east of his position. He saw a vapor trail at about 2,000 feet (see photo attached) but nothing else. Note: I will close this report out since I am a MUFON field investigator and it is in my area."],"Date of the Event":"01/25/2011 05:36 UTC","Disposition":"Unknown","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around January 25th 2011","This sighting has never been favorited.",""],"Weather Factors":"None","Tags":"City","Object Shape":"Oval","City":"Kansas City"}