{"Date Submitted":"01/26/2011 07:34 UTC","divs":["sighting detailsi was sitting on the living room couch doing my home work, when suddenly i got this strange urge to look out the living room window. when i did i could see 3 bright greenish lights coming out of the south moving to the north as i watched them come closer to our house i grabbed my cell phone and got it ready to take a photo i waited till it was just over the tree rows close to the house and snapped the photo, i was going to take another photo but my phone mysteriously lost power and i couldn't get it to power back up. then all the lights in the house flickered on and off like we where going to lose power. i could now see this thing was moving right in front of our house and could now see it was a triangle craft with bright greenish glowing solid lights at each of the points of the triangle. i could also see a very faint florescent greenish line that looked lit coming from the front light going to the middle or center of the triangle and then it y'ed off to each of the rear lights on the triangle (kinda like a peace sign)i couldn't see any thing else it looked to be a dark black smooth surface on the bottom. this triangle seemed to just glide through the air i heard no sounds, i lost sight of it as it went over the house about a minute or 2 after that the lights stopped flicking i tried to power up my cell phone and it did work the battery level was 3\\4 full totally freaked out and scared, i called my dad to tell him what happen and he calmed me down a little. i have seen satellites and many other aircraft at night while with my dad, and this was not none of those things. the photo i took is attached."],"Object Shape":"Triangle","Object Features":"Other","Weather Factors":"None","Source":"MUFON","City":"Bowling Green","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Log Number":"US-01262011-0008","Case Number":"27526","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 25 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around December 18th 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.99726,+-86.434242(27526)&iwloc=A&hl=en\"> mufon case (27526) map </A>","files":["/var/www/straped/mufon/html2text/27526.html.txt","/var/www/straped/mufon/org/27526.html"],"Latitude":"36.99726","Summary":"Sitting at home doing my homework I got this strange urge to look out the window. When I did, I saw 3 bright lights in the sky.","Object Flight Path":"Straight-line path","Longitude":"-86.434242","Date of the Event":"12/18/2010 07:44 UTC","Tags":"City","Region":"Kentucky"}