{"Case Number":"27521","Summary":"A small orb, about the size of a quarter enters bedroom.","Source":"MUFON","Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date of the Event":"11/30/1976 12:00 UTC","Object Features":"None","Latitude":"34.070601","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/27521.html.txt","/var/www/straped/mufon/org/27521.html"],"divs":["Sighting DetailsIt took place in 1977, at the time I was working as a teller at at bank. It occurred in my parnet's home in Monterey Park, California. Monterey Park is a city about eight or nine miles east of downtown Los Angels. On the night of my experience the house was, has it usually is, quite and dark. I laid awake in bed with my eyes open, thinking about things and waiting to bo back to sleep. I'm sure I'd laid there for at least 30 minutes before my episode began. here's what happened: While laying there I was startled by a point of a white light that suddenly appeared in the hall. It was passing in front of the bedroom door, moving very slowly. My first thoughts were it was my dad with a flashlight. I've known my dad to do repair work late at night, like a just discovered (to him) leaking faucet. Buy realizing my dad would just turn on a light, I suddenly found myself in terrible fear, thinking it was an intruder with a flashlight. Someone broke into the house! Being helpless in bed I thought the best thing to do was to lay still and watch. But has my eyes adjusted to the light, I could see no one there; it was light floating in the air! This light moved until it got halfway passed the door, and then it paused for a moment. It then made a 90 degree tune and came into the bedroom. Moving very slowly, it traveled into the room a foot or so. It then made another 90 degree turn. It moved of to my right. Although I was experiencing shear terror, I watchted it. It appeared to be an orb about the same size diameter has a quarter. It moved until it paused a second time. When it moved again it made another turn at 90 degrees. Now it was moving parallel to my bed. I watch with great terror and disbelief of what I was seeing. My mind was racing with the thoughts of telling myself that I was indeed awake, and I assuring myself what i was seeing was really there. This orb then traveled to a point that was even with the end of the bed. I could still see it in the corner of my eyes. Here, the orb paused again and stood there for a few moments. It then made another 90 degree turn and came toward me! In a second or two, I sensed it was directly over my head. Terrified, I decided to jump out of bed and turn around to look at it. But when I tried to do so I found out that I could not move! I felt this enormous crushing force holding me down, as if the Earth's gravitation pull increased ten fold over my bed. I could feel my muscles were working, trying to obey my command to jump out of bed, but I could not move! With this force pushing down on me, I had trouble inflating my lungs. I could only take in small gasp of air. Has the seconds passed, I became aware of a pain growing in my stomach. It felf much like muscle ache as if I was trying to do hundreds of sit-ups. I don't remember seeing anything when this was going on, my eyes must have been closed. This seizing force seemed like it lasted for about one to two minuets. What stands out in my memory was how hard I was pushing my arms down on the bed to try to lift myself up, the growing pain in my stomach and the gasping for air. I was in a panic for air. As I struggled to get away I could rememer having the thought I was very close to breaking free. With what enerby I had left I tried even harder to excape. Then all of a sudden I jolted up, to a \"sit-up\" position, believing I over came the force that was holding me down (or \"it\" let go). When this happed I must have open my eyes because I clearly and distinctly remember getting a glimpse of the orb shooting out of the bedroom with great speed. It traveled directly over my body and headed for the bedroom door. Once in was in the hall it made a 90 degree turn without stopping and disappeared out of view. It was gone in an instant. Once the orb was gone, I laid back into the bed. I remember thinking: \"what ever it was, it's gone now and I could go back to sleep\" I quickly fell asleep. Looking back at this behavior, it seems ver odd. What felt like a few minuets later I awoke at the usual time. Everything seem to be so normal. The sun was shining throught the window and I could hear my mom and dad talking in the kitchen. I sould smell coffee. The first thing I thought of was the orb that came into the bedroom. I wonder about it for a moment till I realized something very odd about myself, something I never experience before or since; under the blankets, I was soaked wet with perspiration! Pulling the blankets off, I examined my T-shiret and pajamas, they were sticking to me in some places. When I got out of bed I felt the cooling effect it had on me. I went to take my morning shower. While taking off my clothes I was very astonished of how sweating I was. My T-shirt and pajamas came off with a peel. After the shower, I got dressed for work and went into the kitchen for coffee. I then went into the living room. There, my mom was drinking coffee. I sat across the room from her. Still thinking about the orb, I almost came out and told her about the experience. But for some reason, I'd stopped. It would be years before I would have told anyone. Today I believe an orb did come into the bedroom and I was held down by some force. But what happened when this was going on? It dawned on me later that my body probably did not produce that much perspiration wetness in bed in two minutes. So was there missing time? Was I told to keep my eyes closed? Did they tell me to \"go back to sleep?\" Was I told not to tell anyone? I wonder about the orb. Did it know I was awake when it entered the room? It seeemed to cautiously go round me. Did it pause to see my response to its presents and then proceed after I had no reaction? The memory of seeing the orb shoot out of the room immediately after I \"jolted up\" makes me wonder too. Did it try to get out of the room before I saw it or did I suddenly startle and frighten it after I sat up in bed? It seems to have taken off in a panic. When this encounter was taking place it was certainly terrify, I hope it never happens again. Ever since, however, till today, I never look back at this experience with fear or dread, but with curiosity and wonderment. I could also add a feeling of nonchalance. I always thought of it as if it was no big deal, not workth memtioning. After reading about other people's experience, however, I now feel it was quite extraordinary event. It has been about 33 years or so now, and my life has been totally uneventful as far as orbs or UFO's are concern. Not a peep, unless they did a return visit while I was sleeping."],"Tags":"City","Longitude":"-118.121058","Weather Factors":"Unknown","City":"Monterey Park","trends":["There have been 6 other sightings in Monterey Park","There were no other sightings in Monterey Park on or around November 30th 1976"],"Log Number":"US-01262011-0003","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.070601,+-118.121058(27521)&iwloc=A&hl=en\"> mufon case (27521) map </A>","Date Submitted":"01/26/2011 12:54 UTC","Object Shape":"Other"}