{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/27529.html.txt","/var/www/straped/mufon/org/27529.html"],"Date of the Event":"03/01/1998 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.122776,+-115.171276(27529)&iwloc=A&hl=en\"> mufon case (27529) map </A>","divs":["Sighting DetailsAfter enduring a multi-level marketing seminar, I and three others were driving around the outskirts of Las Vegas, Nevada late at night around 1 or 2 AM (Pacific Time). It was late February or early March of 1998. I was the first person in the car to see what at first looked like a small but bright streak of rainbows in the sky. Within seconds of my notifying the other 2 passengers and the driver, we all saw what appeared to be a dark-colored, triangular object with a streak of rainbow-like colors trailing behind it. I estimate the object was between 100 and 300 feet in length, but it is difficult to know for sure as the object was at least 5-10 miles away and varying with time. The movement of the object in question was completely inconsistent with that of an airplane or helicopter, as it would suddenly and drastically change altitude, direction, and speed. I suspect the U.F.O. was using a sort of anti-gravity technology since the object moved in ways contradictory to the standard aerodynamic forces of lift, gravity, drag, and thrust. This sighting lasted for roughly 30-45 minutes. We tried to drive in the general direction of the object, but it kept changing speed, altitude, and heading.....eventually disappearing. I would estimate the object's altitude varied between 1,500-6,000 feet above ground level (NOT MSL). The speed of the said object ranged between 50 knots and 600 knots, varying constantly. None of us were under the influence and we concluded this was definitely NOT a hallucination. Our observations were validated the following morning when we saw that this sighting was not our's alone....as this sighting was mentioned on the local news in Las Vegas. The female news anchor claimed this sighting was just a missile test. I know what missiles look like. This was NOT a missile, nor a helicopter, nor was it an airplane.....and it surely was not a weather balloon. I apologize for not mentioning this event sooner. I was not aware of this website until just this evening. Thank you."],"Sighting Duration":"00:45:00","Object Features":"None","Viewing Distance":"Over One Mile","Summary":"Fast-moving triangular-shaped object incorporating anti-gravity technology","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around March 1st 1998"],"Country":"United States","Source":"MUFON","Latitude":"36.122776","Longitude":"-115.171276","Date Submitted":"01/26/2011 11:58 UTC","City":"Las Vegas","Case Number":"27529","Log Number":"US-01262011-0011","Weather Factors":"Unknown","Region":"Nevada","Object Shape":"Boomerang, Chevron, Triangle","Tags":"City"}