{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.732482,+-119.042048(27522)&iwloc=A&hl=en\"> mufon case (27522) map </A>","City":"Lockwood Valley","divs":["Sighting Detailsi was in Lockwood valley in Ventura county my gold diging budy got atack by a bear and is missing.early that day. that night it all started i was driving back and forth on lockwood valley rd.till on my left theres a reaily big field dark green grass. it looked like 4 semi trucks 1030 at night driving along side me but there are no roads there.40 mile an hour my speed. then i looked two front trucks stared to get higher then the back two were as if they were going up a mountain.so i saw a mound of dirt on my left i turned my van sharp left turned on my brights there it was 30 feet of the ground right in front of me a ufo hovering right in front of me i jumped out of my van it was so UN believable.the circle ship had four groups of lights under it .as if the lights are on the 4 corner of a square two blue to were you can see blue all under nith it, two small orange lights and one red and blue mix with a hint of black. i felt it was the most passion it color,i felt it was used to tap in to the soul, and the mind.in my mind i felt as if theese beings are my family my brothers in the sky.i went to a truck stop to hid to sho some one els then in my mind they wanted to know were ron was he did not show back at camp. i spent five month at that camp digging for gold ron always talk about the aleians and gold how he was connected two both, i felt in that time in my dreams they come to me. the law did not do anything about the bear attack earlier but these 7 ships will help me find ron so i drove almost 12 miles with these ships along side me when we got to were ron got attacked they flew over me saw them flying30 feet of the ground with blue light all over one ship stayed above me one ship to my right stayed with me till morining that night the influence they had on my sight it was as if i had lens on my eyes.about 4 in the morining they led me down a realy long driveway fience on both sides but the fience were sparking as i drove on through at the end of the driveway it looked about ten people standing there but there eyes were bigger than normal glowing blue i should have gotten out and talked but i was to overwelmed.i felt that if they want me i will park on the road"],"Object Shape":"Circle, Cross, Disc, Sphere, Other, Unknown","Source":"MUFON","Sighting Duration":"10:13:26","Object Features":"Dome, Window(s), Patterned Surface","Viewing Distance":"20 Feet or Less, 21-100 Feet","Longitude":"-119.042048","Region":"California","trends":["There have been no other sightings in Lockwood Valley","This sighting has never been favorited."],"Summary":"there were 7 of them 1 really big the frist one i saw, they were on a serch and resqie mission same as me.then they stayed with me for three days","Tags":"City","Date of the Event":"05/05/2009 10:33 UTC","Case Number":"27522","Latitude":"34.732482","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27522.html.txt","/var/www/straped/mufon/org/27522.html"],"Disposition":"Hoax","Date Submitted":"01/26/2011 01:44 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Log Number":"US-01262011-0004"}