{"Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"01/27/2011 07:27 UTC","Latitude":"52.033882","divs":["Sighting DetailsMy wife and myself (who both do not drink) popped out for a cigerette on the eve of the 1st of january. We where both staying at her parents house for the festive season. It was my wife who saw it first and pointed it out to me. It was moderatly high n the skie but no more than a 1000 feet. It appeared to be oval shaped and a little hazy but certainly a solid object. It floated slowly over head toward the horizon then stopped and appeared to 'drip' a fire like object. It then shot of at a right angle to the left, before stopping dead in its tracks to 'drip' again. My wife then tugged my jumper and said 'There is another one' and true enough another appeared in the spot the first one was when we saw it. This too, followed the same path as the first, stopped 'dripped' then shot of upward, closely followed by the first object. This whole event lasted for an hour or so, just floating and shooting away. This was also wittnesed by another person who contacted me (a friend who knows I am interested in UFOs) to tell me what she saw at the same time as myself and my wife. Her account was the same as ours (withouth any prompting from myself)I did not even tell her what I had seen untill she had finished her account, so as to varify it to myself and not influence her account. I did look into the sighting on a uk ufo site and the same objects where seen not only over herefordshire but also yorkshire and cornwall, all within half hour to an hour of each other."],"Summary":"sighted for over an hour over Ledbury, Herefordshire, uk","files":["/var/www/straped/mufon/html2text/27532.html.txt","/var/www/straped/mufon/org/27532.html"],"trends":["There have been no other sightings in Ledbury","This sighting has never been favorited."],"Case Number":"27532","Disposition":"Unresolved","City":"Ledbury","Region":"England","Source":"MUFON","Date of the Event":"01/01/2010 01:00 UTC","Longitude":"-2.423574","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=52.033882,+-2.423574(27532)&iwloc=A&hl=en\"> mufon case (27532) map </A>","Object Flight Path":"Path with directional change","Log Number":"GB-01272011-0003","Weather Factors":"None","Country":"United Kingdom","Object Shape":"Fireball, Oval"}