{"trends":["There have been 9 other sightings in Brunswick","There were no other sightings in Brunswick on or around January 26th 2011"],"Date Submitted":"01/27/2011 12:16 UTC","files":["/var/www/straped/mufon/html2text/27530.html.txt","/var/www/straped/mufon/org/27530.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.152273,+-81.483029(27530)&iwloc=A&hl=en\"> mufon case (27530) map </A>","Object Features":"None","Longitude":"-81.483029","Viewing Distance":"Unknown","Summary":"Just happened to look up and saw two u.f.o.'s flying next to each other.","Weather Factors":"None","Source":"MUFON","Latitude":"31.152273","Case Number":"27530","Date of the Event":"01/26/2011 11:25 UTC","Tags":"City","Country":"United States","divs":["Sighting DetailsI was having a cigarette on my back porch. When I was done, I went to dump the butts from the tray in to the trashcan. For no reason I looked up and saw two blurry greenish objects moving VERY rapidly, AND I MEAN RAPIDLY!, from the east south east. I was awe struck. At first I thought it to be a meteorite.Then I realized there is NO WAY this is a meteor! The object's looked to be about one foot apart. They did not appear to be at a very high altitude, such as a passenger jet. Probably about half as much. Both of the objects made a tight turn like a 'C' and headed out to the Northwest. In PERFECT formation with the other. That is when they went behind the trees and I lost sight of them. I know what jet's, fighter jets, and everything we know about looks like. Day or night. These things were moving WAY to fast, silentley and in such a manner that I cannot relate in words. This was absolutly the most incredible sight I have ever seen. I'm alway's looking up to see something like this, but I just happened to look up and got blown away. I hope someone else in the area saw it too."],"Object Shape":"Oval, Teardrop","Region":"Georgia","City":"Brunswick","Object Flight Path":"Path with directional change","Log Number":"US-01272011-0001","Sighting Duration":"00:00:06"}