{"map":"<A HREF = \"http://maps.google.com/maps?q=39.766324,+-75.085417(27531)&iwloc=A&hl=en\"> mufon case (27531) map </A>","Region":"New Jersey","Latitude":"39.766324","Sighting Duration":"00:00:15","Summary":"Green Orb and Electrical Disturbance/Malfunction","Object Shape":"Sphere, Star-like","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/27531.html.txt","/var/www/straped/mufon/org/27531.html"],"Tags":"City","divs":["sighting detailstime: approx 11:35pm date: 1\\26\\2011 location: washington township, nj weather: moderate snowstorm. visiblity reduced over long but very enhanced over short distances. approx. 4 - 5 in. accum already. incident report: glowing neon green orb approx the size of a basketball whizzes by side of my house at a high rate of speed. i'm sitting in my chair watching tv when the power goes out in the room i'm sitting in. the light in the kitchen also went off. electrical failure happens an instant before the green orb passes by and lasts for approximately 10 - 15 seconds thereafter. light whooshing sound is heard. outside inspection of the entire home perimeter 10 minutes later reveals no disturbances in the snow. visibility is very good because of relective quality of the snow. lighting equivalent to twilight. power lines are connected on the side of the house where orb was detected. all electrical power wires are in there proper place and still connected. nothing seems out of the ordinary. oddly enough, back inside it seems that only the one side of the house where the orb passed by experienced electrical disturbance. computer upstairs on the other side of the house is as i left it and shows no signs of having rebooted. alarm clock is not flashing. report completed: 12:12am 1\\27\\2011 if anyone else had a similiar exp. here please report it. eom"],"Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Washington","There were no other sightings in Washington on or around January 26th 2011"],"Source":"MUFON","Weather Factors":"Unknown","Country":"United States","City":"Washington","Case Number":"27531","Log Number":"US-01272011-0002","Longitude":"-75.085417","Object Features":"Undisclosed","Date of the Event":"01/26/2011 11:35 UTC","Date Submitted":"01/27/2011 12:38 UTC","Object Flight Path":"Undisclosed"}