{"Object Features":"Undisclosed","Latitude":"39.953475","Log Number":"US-01282011-0006","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27548.html.txt","/var/www/straped/mufon/more/27548_submitter_file1__photo.JPG","/var/www/straped/mufon/org/27548.html"],"Source":"MUFON","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around January 10th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.953475,+-75.159039(27548)&iwloc=A&hl=en\"> mufon case (27548) map </A>","Object Flight Path":"Undisclosed","City":"Philadelphia","Longitude":"-75.159039","Case Number":"27548","Country":"United States","Tags":"City","Date of the Event":"01/10/2011 06:14 UTC","Object Shape":"Triangle","Weather Factors":"Unknown","Summary":"Gigantic ship over Garden of Reflection 9-11","Region":"Pennsylvania","divs":["sighting detailsover the previous 3 or 4 days, i have been working on some new theories on existence, consciousness, multiple dimensions and faster than light travel. i believe my theories may be correct but i do not have the formalized math background or the means to pull it off. the day i had the encounter i was drawn for some reason to the grey nuns down the road chapel down the road. after seeing their chapel, i drove to the garden of selection... walked around in the snow a bit and perused the benches. i sat near the woods and the animals were very loud. i was mad at god and\\or the world for the stupidity that we live in. i got tired of living in a cubicle and started walking through the woods. walked through a frozen creek. followed tracks. lots of military planes overhead. left the woods. heard a noise by the mole hill. climbed it. was able to make some stars move... thats when iooked overhead and saw the giant black starsship. i was completely amazed. it had red white nad blue lights. too big to shoot with my iphone. my theory is that some people are on the wavelength to see them, others aren't. all that week i also kept having my cell phone appear and disappear out of my pocket."],"Date Submitted":"01/28/2011 03:07 UTC","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data"}