{"Object Shape":"Unknown","Date Submitted":"09/30/1998 12:00 UTC","Case Number":"2754","Log Number":"","Object Features":"Undisclosed","Region":"Indiana","Disposition":"Hoax","Tags":"City","Object Flight Path":"Unknown","divs":["Sighting DetailsThis is just one of many extraterrestrial contacts Ive had over the years. Since Ive had so many contacts, including abductions, I thought I would write abook. What you will read is chapter 3.INTRUDER ALERT - 1309YYXYZ BUG09Serious events often happen in this world that cause me to worry. When thingsof a national or global nature occur, many people92s lives are affected. There isn92t a lot I can do, but I don92t feel totally helpless. As a citizen, I believe it92s my civic duty to write letters to public officials. I write to express myviews when I think there92s a chance I can help people in positions of power understand reality a littlebetter.09When I write, I often use symbolism and analogies. Since everything in theuniverse is relative, it92s sometimes easier to step back and look at the situation from a different,relative angle. Once I grasp the basic principle, I92m in a better position to apply my knowledge to the situation. Some can getthe wrong idea about what I92m trying to do when I write letters.09In September, 1998, I felt the need to write a letter to the President of theUnited States. Our president was in the process of being impeached from officeand impeachments don92t happen every day. I thought he might be able to use a little moral supportfrom a fellow citizen.09I thought I was writing him a private letter, but I learned there is no suchthing as a nine-page, private letter written to the president. The number-10envelope was about an inch thick. I92m certain the envelope raised eyebrows when it reached the White House - andpossibly, before it got there.09I had serious doubts as to whether I should mail it. I wanted to be certain Iwas doing the right thing by expressing my thoughts. The letter sat on my deskfor a few days before I finally decided to mail it.09On the way to the post office, a man in an old car with an American flag onthe front bumper pulled up behind me. I heard one of those little voices insidemy head. I thought the voice was telepathic and coming from the man in the car. The voice said,93That92s a good letter, Avery.9409I wondered, How does he know it92s a good letter There92s no way he could have read it.09After I mailed the letter, I didn92t think much about it until the following day. I was on my way home from myreal estate office. A guy in a truck pulled up beside me at one of manystoplights. He was in the next lane to m"],"Source":"MUFON","Summary":"I was attacted and questioned by a Gray extraterre","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around September 30th 1998"],"City":"Indianapolis","Longitude":"-86.151534","Country":"United States","files":["/var/www/straped/mufon/html2text/2754.html.txt","/var/www/straped/mufon/org/2754.html"],"Viewing Distance":"Unknown","Sighting Duration":"00:10:00","Date of the Event":"09/30/1998 12:00 UTC","Latitude":"39.773296","map":"<A HREF = \"http://maps.google.com/maps?q=39.773296,+-86.151534(2754)&iwloc=A&hl=en\"> mufon case (2754) map </A>","Weather Factors":"Unknown"}