{"Object Features":"Undisclosed","Source":"MUFON","Tags":"City","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Latitude":"40.342015","Viewing Distance":"Unknown","Date Submitted":"01/28/2011 08:13 UTC","City":"Lebanon","map":"<A HREF = \"http://maps.google.com/maps?q=40.342015,+-76.40444(27545)&iwloc=A&hl=en\"> mufon case (27545) map </A>","Country":"United States","Disposition":"Hoax","Object Shape":"Circle, Disc","divs":["Sighting DetailsI was driving to Harrisburg, PA, south on interstate 81, when I noticed traffic in front of me slowing down. As I approached the traffic, I noticed bright white lights a few hundred feet off the ground to the right of the highway. I slowed down and got into the passing lane for a better view of the lights. The object or lights began to move slowly to the right about a half a mile, then to the left about the same distance. I thought it might have been a helicopter at first, but when I rolled down the window I could not hear anything, I did not see any vibration from the lights which would be normal with a helicopter inflight. There was no navigation lights at all, just three white lights at first, as I came up on the object it appeared to look disc shape or circlular with more lights around the object. It really started to get my heart pumping. The white lights were on steady with no flashing, vibration, or color changes. All the vehicles in front of me had come to a complete stop to view the object. At one point the object just hovered at about a 30 degree angle over what I believe was a field. At this point, I took a picture of the object with my camera phone. All of a sudden the object moved across the field and the lights disappeared. The event lasted for about maybe 7 minutes, not sure, I kind of lost track of time observing this unusual event. I heard of people being wittness to strange objects in the sky, but I never thought I would be one of them. It certainly was an interesting event, what ever it was."],"trends":["There have been 3 other sightings in Lebanon","There were no other sightings in Lebanon on or around January 27th 2011"],"Sighting Duration":"Undisclosed","Log Number":"US-01282011-0003","Longitude":"-76.40444","Region":"Pennsylvania","Summary":"Observed unusual event over the skies of Lebanon, Pa","files":["/var/www/straped/mufon/html2text/27545.html.txt","/var/www/straped/mufon/org/27545.html"],"Date of the Event":"01/27/2011 07:45 UTC","Case Number":"27545"}