{"Country":"United States","trends":["There have been no other sightings in Gasquet","This sighting has never been favorited."],"Tags":"City","Object Shape":"Star-like","Object Flight Path":"Straight-line path,Path with directional change","Region":"California","Sighting Duration":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Over One Mile","Latitude":"41.850811","Longitude":"-123.945801","Source":"MUFON","Date of the Event":"08/15/2000 09:45 UTC","Case Number":"27556","Object Features":"Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.850811,+-123.945801(27556)&iwloc=A&hl=en\"> mufon case (27556) map </A>","City":"Gasquet","Summary":"3 star-like satelites moving in a triangular formation at the same speed, distance and direction together.","divs":["Sighting DetailsI was working for the U.S. Forest Service and i was camped out at the Panther Flat campground just east of Gasquet,CA along hwy 199. The date was in middle August of 2000 just before starting my final semester of College. The time was around 9:45 pm and there was still twilight but no moonlight. Myself and my co-worker decided to get in our sleeping bags so we could get a good night sleep. My co-worker decided to sleep under a tree with his dog while I decided to sleep out in a small meadow area with my dog. We didn't use tents and I wanted to be able to see the stars. This time at night and the incredible clear skies made it possible to see lots of satellites flying overhead. It also helps being so far away from any towns or cities that have lights that would interfere. I was lying down with my head propped on my pillow so I could have a westerly view down canyon. Behind me trees blocked my view, and off to both sides(north and south) there are tall ridges rising about 2000 ft. I estimate that I only have about 35 degrees of view to either side. I was astounded how many satellites I was able to see at that time. They were single satellites and they came from every direction moving across the sky. There seemed to be about 2 to 4 satellites in view at any time. I had been watching for about 15 to 20 minutes when I saw a satellite come from directly behind my head. It was moving west. It was followed by two more, moving the same direction. The formation these three made was an equilateral triangle. There was separation between them and the three objects were independent, not attached in anyway. The separation between the objects was about the length of an adult males forefinger from tip to knuckle. These objects moved together at the same speed without any break in the formation. They looked just like all the other satellites in size and white color. I was in awe because I had never seen three objects moving together like this. Then suddenly, the three objects changed direction at a 45 degree angle toward the southwest. They all moved together and in an instant!!! No rounded corners or anything. No changing speed. The direction change had the two objects now leading the formation with one trailing. I watched as they disappeared over the southern ridge line toward the southwest, which confirmed that I didn't imagine their direction change. If they didn't change direction they would have disappeared on the horizon at my feet. I yelled out to my co-worker telling him what I saw and if he was looking up at the sky. He said it was my imagination and that he had his eyes closed so he didn't see anything. I felt uncomfortable the rest of the night and felt vulnerable and exposed out in the meadow, but felt comforted by my dog and that soon after a Law enforcement ranger drove by on patrol. I never told anyone about this incident except my wife who I met and started dating 2 years later. BUT.... it gets more interesting and this is why I want to have this investigated. In 2003 I started a new job with the National Park Service. I worked with the same co-workers for 3 years. In the summer of 2004 and also in August, one of my co-workers (Jules) went camping with her husband and several friends to a wilderness area in Northern California called the Marble Mountains. They were at the top of the mountains near some lakes and in a meadow at about 7000 ft. in elevation. There aren't many trees at this elevation so they decided to watch to stars before going to bed. She said they saw lots of satellites but the strangest thing of all was to see 3 satellites in an equilateral triangular formation fly from east to west. What is also interesting is the area that they camped was about 40 miles ESE of where I saw my sighting on a very similar flight path. I also fell out of my chair and I told her that I saw 3 similar objects. Then I asked her questions about the objects and they were exactly like the ones I saw. The only thing she said is that they continued on a straight line from horizon to horizon without changing directions, but the 3 objects never broke formation, traveled at the same speed and direction towards the west, and were definitely independent objects. This really helped to confirm what I saw and puzzled the both of us more since we have never seen anything like this formation before and didn't think satellites could be aligned to move like this. But I definitely saw them change direction without changing speed and that will stick with me forever."],"Date Submitted":"01/29/2011 12:08 UTC","files":["/var/www/straped/mufon/html2text/27556.html.txt","/var/www/straped/mufon/org/27556.html"],"Log Number":"US-01292011-0001"}