{"Date of the Event":"12/09/2010 10:40 UTC","Object Shape":"Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=27.311896,+-98.670282(27563)&iwloc=A&hl=en\"> mufon case (27563) map </A>","Source":"MUFON","Object Features":"Unknown","Case Number":"27563","divs":["Sighting Detailson the night of dec-9-2010 at around 10 pm i was driving a buddy home and as soon as i pulled out of my drive way i first looked up and saw two white balls of light flying in the sky like if ther were fire flies. I immedietly told my friend to look and he also saw the manuverous the lights were making. The night was clear so we decided to try and chase the lights , well as were were following the lights we noticed that one of the other lights dimmed out and it was just one light flying crazy doing circles and just freeflying like a freewriter writting lines on a paper. Then all of a sudden the second light came back But the other light flew out from the single light!!!!! After that we knew that this light we were seeing was not normal or neither an airplane at all. we followed until the lights chose to fly north east towards alice tx at a low altitudue but an escessive speed that we could not even get to the other side of town to try and follow. i had planned to report this sighting asap however my family did not have the internet so i am now making my report. I hope we get more reports in this county because there are alot of strange lights that appear however it is such a small town that no one bothers to notice these lights"],"Tags":"City","Log Number":"US-01292011-0008","files":["/var/www/straped/mufon/html2text/27563.html.txt","/var/www/straped/mufon/org/27563.html"],"Sighting Duration":"Undisclosed","Date Submitted":"01/29/2011 12:03 UTC","Latitude":"27.311896","Viewing Distance":"20 Feet or Less","Country":"United States","Weather Factors":"None","Disposition":"Unknown","Region":"Texas","Longitude":"-98.670282","Summary":"while taking a friend home we witnessed two strange lights flying in the sky like fire flies,","City":"Hebbronville","trends":["There has been one other sighting in Hebbronville","There were no other sightings in Hebbronville on or around December 9th 2010"],"Object Flight Path":"Path with directional change,Unknown"}