{"Log Number":"US-01292011-0010","Object Flight Path":"Undisclosed","divs":["Sighting Details\"Last night around 10pm my boyfriend came to pick me up from my parents house in Brandon, Fl. As we wer...e driving away i noticed a red pulsing light in the sky behind the tree line, i didnt think much of it because it was probably just a radio tower. As we made it past the tree line i noticed that is was not only one red pulsing light but two red pulsing lights accompanied by a green light that pulsed between the pauses of red. It was moving rather quickly across the sky in a sweeping motion covering about a 2-3 mile distance every time it changed direction. I was ecstatic and made my boyfriend turn the car around to go back as i didn't want to loose sight of it. He made a u-turn and pulled into a gas station parking lot and i jumped out of the car. It was very low in the sky and passed directy over my head. It looked to me like it was blimp shaped, def. was NOT a airplane or a chopper as i would have been able to discern at that distance. It was accompanied by noise, kind of like and airplane would make but not as loud as i think it should of been given the close proximity to me. My boyfriend saw it, he did not think it was unusual and told me it was probly just a blimp. I did not know blimps could move that quickly or fly that low. As soon as it passed me overhead we got back into the car to continue our trip across the bridge to St Petersburg, Florida. As we are driving on I-75 my eyes are to the sky, still stunned by what i had just seen when i noticed in the distance a STROBING white light. Now i grew up on airforce bases and KNOW what the lights on a plane look like, this was not the case. This light was flashing continuously FAST. I kept my eyes on it and was excitedly telling my boyfriend what i was seeing he didnt see it because he didn't want to take his eyes off the road. It started getting closer and closer to us travelling perpendicular to our car. I rolled down my window to see if i could hear anything or get a closer look, i did not hear any noise coming from it but did happen to catch what looked like a dark triangular shadow beneath the light. It passed over top of the car and i lost sight of it. It reappeared on the driver side yet this time it was a steady red ball of light; my boyfriend saw this. I remember feeling an overwhelming sense of happiness and love. I was not scared just very excited!"],"Region":"Florida","Case Number":"27565","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Object Shape":"Blimp, Star-like, Triangle","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.945341,+-82.280235(27565)&iwloc=A&hl=en\"> mufon case (27565) map </A>","Date of the Event":"01/28/2011 12:00 UTC","trends":["There have been 21 other sightings in Brandon","There were no other sightings in Brandon on or around January 28th 2011"],"files":["/var/www/straped/mufon/html2text/27565.html.txt","/var/www/straped/mufon/org/27565.html"],"Summary":"Witnessed two sperate UFO. One being blimp(?) shaped with red and green pulsing lights and the other being triangle(?) shaped with white strobe that turned into steady red light.","Tags":"City","Object Features":"Undisclosed","Date Submitted":"01/29/2011 02:39 UTC","Viewing Distance":"Unknown","Latitude":"27.945341","City":"Brandon","Country":"United States","Source":"MUFON","Longitude":"-82.280235"}