{"Disposition":"IFO","Weather Factors":"Unknown","Longitude":"-116.202076","Object Features":"Unknown","Region":"Idaho","Case Number":"27566","Object Shape":"Star-like","Date Submitted":"01/29/2011 02:42 UTC","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/27566.html.txt","/var/www/straped/mufon/org/27566.html"],"Date of the Event":"01/28/2011 08:00 UTC","Object Flight Path":"Straight-line path","Summary":"brighter than stars, flashing green, white,red, moves with stars. not there everynight. east of Boise","Tags":"City","Viewing Distance":"Over One Mile","Latitude":"43.620991","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around January 28th 2011"],"Log Number":"US-01292011-0011","map":"<A HREF = \"http://maps.google.com/maps?q=43.620991,+-116.202076(27566)&iwloc=A&hl=en\"> mufon case (27566) map </A>","Source":"MUFON","divs":["Sighting DetailsWhile coming and going from my home I see this from my driveway. Almost every night but not every night I am seeing a bright light like a bright star to the north by north east of Boise That changes colors from red to green and white and blue. It rotates in the sky like as if it was a star meaning it seems to stay in formation Of the natural star rotation. I see it very well on clear nights and often and best around 7 to 8:30. You can see it is brighter than most stars and When looked at with binoculars, it for sure changes colors. I do not understand that it is not there every night and This last week it moved a bit to a more north location. I have observed this over the last several weeks. Gotta be some logical answer, right? At least this is what I am thinking. At first I thought it may be a stationary satelite or space station but it is not there every night. It will be there 3 or 4 nights and then be gone a few and then back but in a different location and with in 30 degrees or so of original sighting. I watch it for a few minutes and check back on it every 30 min. or so. Sometiomes it is gone and some times it is there until late when I go to bed. What might you know about this. I am sorry no photos, it is distant and really not to much exciting to look at."],"City":"Boise"}