{"map":"<A HREF = \"http://maps.google.com/maps?q=50.823447,+-1.073503(27564)&iwloc=A&hl=en\"> mufon case (27564) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Disposition":"Unresolved","Summary":"Sighted only on upload of holiday pictures taken from my digital camera","Date of the Event":"08/20/2009 12:00 UTC","Country":"United Kingdom","divs":["sighting details 1 .on holiday on the isle of wight uk . august 20th 2009. i was taking digital photos of a perfect sunset over the solent towards southampton\\portsmouth. 2. the what i can describe , metallic ball object was only noticed by me at my holiday home thorness bay isle of wight the same evening as i transfered the pictures from my digital camera to my laptop. i noticed the strange object straight away , however had not seen it with my naked eye at the time the picture was taken.3. at first my family who were with me said it was proberbly a hot air balloon, but i personally had to dismiss this because surely there would have been the shape of the basket below it.perhaps it is something to do with the suns rays in the photo? but ive seen many other photos of similar objects on the internet and on you tube sightings. 4 . a ball shaped metallic object .no witness of its motions due to it only behing descovered when veiwed on my laptop pc.5.i have very strongs feelings about any unexplained sighting of anything ufo related or supernatural . i think the fact of not having a rational explination of what is seen with the human eye feels me with facination and curiosity. i have kept this picture close to my personal feelings since my holiday in august 2009 and only my children , parents , and partner have seen this photo and i seem to be the only person who has strong feelings towards this subject. i now have for some reason a strong facination for the unexplained and or especially ufo sightings.6. only noticed when photo was first veiwed, therefore can not answer point 6."],"Source":"MUFON","Region":"England","Object Shape":"Egg, Sphere","Latitude":"50.823447","Date Submitted":"01/29/2011 12:27 UTC","Weather Factors":"Unknown","Case Number":"27564","Viewing Distance":"Unknown","Longitude":"-1.073503","Log Number":"GB-01292011-0009","City":"Portsmouth","files":["/var/www/straped/mufon/html2text/27564.html.txt","/var/www/straped/mufon/more/27564_submitter_file1__035.JPG","/var/www/straped/mufon/org/27564.html"],"Object Features":"Other","Tags":"City","trends":["There have been 6 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around August 20th 2009","This sighting has never been favorited.",""]}