{"Object Features":"Undisclosed","Latitude":"34.132244","Object Flight Path":"Undisclosed","Date of the Event":"01/18/2011 01:30 UTC","City":"Highland","files":["/var/www/straped/mufon/html2text/27561.html.txt","/var/www/straped/mufon/more/27561_submitter_file1__129.JPG","/var/www/straped/mufon/more/27561_submitter_file2__1431.jpg","/var/www/straped/mufon/more/27561_submitter_file3__144negitivelightufo.jpg","/var/www/straped/mufon/org/27561.html"],"Disposition":"IFO","divs":["Sighting DetailsYES..!I HAVE SEEN THE LIGHT ORBS IN MY BACK YARD SkY AND IN SOME PHOTOS THEY ARE NOT SEEN WITH THE NAKED EYE...! i even found a beamship way out in inerspace and other craft. view the photos let me know what you see...after you blow them up..(O: I was praying because of the ufo experience I've had on the 1-17-11 i heard a voice in my head say we will reviel ourselves to you tommorow 12 o'clock i was late being 1:30 but when i went outside in my yard i looked up at 12:00 and there i saw a bright light orb twinkeling and moving slow 3 or 4 miles an hour it was hovering and moving slow in a long horse shoe form for about ten minutes looked liked a snow ball adgitating and twinkeling i felt releived and calm because i know in my heart that i had prayed for the truth and that they would show up and they did. i can't ay they will show up every time i pray God knows when. I am jut earching for the truth in this matter of fact they do exsist. after blowing the pictures up i found more crafts i have photos and a video that was interferd with while filming and i was not facing the sun."],"Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"01/29/2011 08:28 UTC","Tags":"City","Log Number":"US-01292011-0006","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-117.201631","Object Shape":"Egg, Oval, Sphere","trends":["There have been 15 other sightings in Highland","There was one other sighting in Highland on or around January 18th 2011","This sighting has never been favorited.",""],"Case Number":"27561","map":"<A HREF = \"http://maps.google.com/maps?q=34.132244,+-117.201631(27561)&iwloc=A&hl=en\"> mufon case (27561) map </A>","Summary":"Bright white light orb spotted in my backyard sky...2011"}