{"Region":"Tennessee","Date Submitted":"01/30/2011 07:25 UTC","Latitude":"36.17398","Sighting Duration":"Undisclosed","Object Shape":"Disc, Fireball","Date of the Event":"07/31/2005 12:00 UTC","Summary":"A round glowing object viewed from my apartment porch.","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27576.html.txt","/var/www/straped/mufon/org/27576.html"],"divs":["Sighting DetailsI was in my apartment on White Bridge Road in Nashville the summer of 2005. I had stepped out on my porch to get some air when I spotted this round, glowing object in the westerly sky. It would have been difficult to miss as it was obviously not a star but was large enough to catch my eye. I tried to eliminate as many possibilities as I could. It was not moving (At least perceptibly) so It couldn't have been an aircraft. It glowed as if it were lit internally. Unfortunately my telephoto shots were initially pretty shakey but I eventually found something to support my arm on. I kept zooming in and out to give an idea of it's size placement in the sky in relation to my immediate surroundings. At one point the object appears to move enough to slowly pass behind some utility lines supplying our apartments. In the final frames of the video I zoom in on the object and it appears to be \"dazzling\" or brilliantly flashing. During this time I had no emotional reaction other than \"Holy ****, what the hell is that?\" For some reason I just abruptly stopped taping and went back inside so I never saw it depart. When I went out later it was gone. I will attempt to upload a copy of my video. If this does not work just contact me by email and tell me where I can send a copy"],"trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around July 31st 2005","This sighting has never been favorited.",""],"Log Number":"US-01302011-0004","Object Flight Path":"Stationary","City":"Nashville","Weather Factors":"None","Disposition":"IFO","Case Number":"27576","Country":"United States","Longitude":"-86.782513","map":"<A HREF = \"http://maps.google.com/maps?q=36.17398,+-86.782513(27576)&iwloc=A&hl=en\"> mufon case (27576) map </A>"}