{"Log Number":"US-01302011-0002","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27574.html.txt","/var/www/straped/mufon/org/27574.html"],"Date Submitted":"01/30/2011 03:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.097329,+-118.320501(27574)&iwloc=A&hl=en\"> mufon case (27574) map </A>","Source":"MUFON","Disposition":"Unknown","Longitude":"-118.320501","Country":"United States","Case Number":"27574","Region":"California","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Circle, Disc","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 17th 1979"],"divs":["Sighting DetailsIt was in the Fall of 1979. My mother and I during this time were living with my grandfather. My mother was attending her Buddist Meeting while my grandfather watched me until she came home. During this time period,I was nine years old, I was in the fourth grade and was in a private school. On the night of the event, I had been home from school for about two hours. I hadn't changed out of my uniform. I was working on my math homework. As I was trying to work out a math problem in my head, I had looked up at a raw, white, crystal quartz that was on top of the fireplace mantle. I then turned my head to the right to look out of the French doors located behind me. I saw hugh blinking lights flying slantedly over the hillside heading towards my house. My first thought was that maybe it was an airplane that was about to crash. I immediately put down my math book, paper and pencil, and stood up and walked over to the French doors, that lead to the side of the house, which over looked the city. My grandfather was in the kitchen at this time washing the dishes. I quickly walked past him without saying a word and made my way outside to the driveway. Once out side it was as though time seemed to slow down and everything seemed to move in slow motion. The craft was slowly gliding while at the same time it was spinning in a circular motion. I yelled to my grandfather, \"Granddad, come out here quick!\" \"There is something flying in the sky!\" My grandfather quickly came out to investigate. He looked up at the craft. The craft was as high up in the sky a helicopter. My grandfather said to me, \"It could be an airplane\", I said, \"NO, airplanes don't hover.\" He then said, \"Maybe it's a helicopter.\" I said, \"NO, helicopters have four windows, two in the front and one on each side of it.\" This craft has at least 24 light blinking on and off and it has a hugh red glowing ball on top of it and it looks like the ball is floating above it.\" I said, \"Helicopters don't look like that and besides, helicopters and airplanes make a noise. He said, \"Maybe it is the Goodyear Blimp.\" I said, with little frustration,\"Granddad, IT IS NOT THE GOODYEAR BLIMP, because even the Goodyear Blimp has a humming sound to it.\" I said, whatever it is this thing has no sound to it at all.\" My grandfather said, \"stay here I am going to get a flash light.\" I stayed outside watching this craft still gliding and at the same time spinning in a circular motion and what it had appeared to STILL be approaching our house. Like I said before, everything seem to be going in SLOW MOTION. My grandfather came back with his flash light and flicked the flash light on and off several times. When he did this, the craft suddenly stopped gliding and was now hovering almost over our house. I felt my heart racing, because I didn't know what was going to come next. The craft continued to hover for approximately ten minutes before it started gliding back to in the same direction from which it came. I ran back into the house to where the French doors were, just to see it glide back over the hillside. Once it was gone out of sight, my grandfather and I resumed back to what we were doing, never discussing any further what we had saw. When my mother came home, my grandfather and I told her that we saw a craft in the sky that was not a helicopter, airplane or the Goodyear Blimp. That waa all we said to her and did not discuss the matter anymore. She told me later that night that it would be best to not tell everyone what I thought to be a UFO, because not everyone understands that. Through the years I drew pictures of the craft that I had saw that night in 1979. I sketched one recently free hand style the way in which I saw the craft that night. Unfortunately, I am having trouble uploading the sketch of the craft to my E-mail to then transfer to this web site."],"Tags":"City","Object Flight Path":"Undisclosed","Date of the Event":"10/17/1979 08:20 UTC","Summary":"Circled disc with light in between with a hugh red pulsating sphere in top.","Viewing Distance":"Unknown","Latitude":"34.097329","City":"Los Angeles"}