{"Weather Factors":"Light","Latitude":"-37.808597","City":"Melbourne","map":"<A HREF = \"http://maps.google.com/maps?q=-37.808597,+144.96708(27584)&iwloc=A&hl=en\"> mufon case (27584) map </A>","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around January 31st 2011","This sighting has never been favorited.",""],"Country":"Australia","Viewing Distance":"Unknown","Object Features":"None","Longitude":"144.96708","Case Number":"27584","divs":["Sighting DetailsI was at work taking a moment to make tea, as I had just started for the morning. I saw a colleague in the lunch room and chatted to her as I made my tea, but was drawn to a brilliant ball of light outside the window. I had to have a closer look and went right up to the window to see if it was a reflection. It was a very hot day and the sun was bright so I thought this the most likely explanation. However, I could not tell for certain that the light was on a building in the distance or on a hill, as I tried to move perspective and I couldn't say for sure that it was 'attached' to anything. I asked my colleague her opinion and she was a little taken aback but was sure that it must have been reflecting off something. I took a photo with my phone, so it is a terrible quality but allowed me to get a reference shot. I went back to work, planning to check on it in a little bit to see if I could get a clearer impression. Probably not even half an hour later, another friend invited me to take a break as he was going out for a cigarette and I told him about it. From the ground outside (the office is on the 16th floor) it was impossible to see anything. After we went back up I went straight to the lunch room to see if the view was any clearer. I lined my view up with the picture I had taken and couldn't even see a tiny reflection. I had wondered if maybe the sun had moved dramatically and so the 'reflection' was gone. However, I knew from being outside that the sun was pretty high overhead so I can't imagine it could've changed the sight so dramatically. I've decided to wait another day and see if the spectacle repeats itself tomorrow morning. If so, then it is definitely some kind of 'trick reflection' - though I have been checking google maps all day to try and figure out what kind of building could be there to cause such an amazing sight. There is absolutely nothing in the air between the two points I used as reference (a building and a church spire). I've been reading too much of this stuff, so I'm busy convincing myself it was nothing. However, I came onto this site and noticed that someone else in Melbourne has seen the same thing a few days ago and so did someone in Japan, by the sound of it, so I'm waiting to see what tomorrow brings, evidence-wise. I can be contacted for further questions or whatever. I have a picture (low quality) which I will attach."],"Log Number":"AU-01312011-0003","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/27584.html.txt","/var/www/straped/mufon/more/27584_submitter_file1__Image000.jpg","/var/www/straped/mufon/org/27584.html"],"Tags":"City","Date of the Event":"01/31/2011 09:40 UTC","Object Flight Path":"Stationary","Summary":"Motionless star-like light in or near Melbourne. Tried to discern if it was some kind of reflection.","Region":"Victoria","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"01/31/2011 07:47 UTC"}