{"Case Number":"27589","Summary":"Two glowing oval shaped objects in sky.","Sighting Duration":"Undisclosed","Date of the Event":"01/27/2011 11:00 UTC","Country":"United States","Region":"New Jersey","trends":["There have been 9 other sightings in Vineland","There were no other sightings in Vineland on or around January 27th 2011"],"Weather Factors":"Unknown","Source":"MUFON","City":"Vineland","Object Shape":"Oval","Latitude":"39.488997","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was driving with my boyfriend around 11 in the morning on Thursday January 28th 2011. He noticed an airplane very high in the sky and he said \"That airplane is really high!\" I looked up to see the airplane and I did see it. But then I looked up again and there I saw two twin oval shaped objects in the sky even farther up then the plane was, they were moving next to each other at the same speed. At first I thought it was just my imagination then I slowed the car down and looked again for a longer time. As I was looking I said to my boyfriend \"What is that?\" and then the objects began weaving in and out of each other slow at first. I then stopped the car completely in the middle of the street and stared at them and they began going faster weaving in and out of each other. Then I noticed I was stopped in the middle of the street and there were other cars coming so I had to drive. I then looked back up again and they were gone. I was a little freaked out but I was also so excited because I had never seen anything like it before and new there was no explanation for that."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.488997,+-75.017011(27589)&iwloc=A&hl=en\"> mufon case (27589) map </A>","Date Submitted":"01/31/2011 05:11 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/27589.html.txt","/var/www/straped/mufon/org/27589.html"],"Log Number":"US-01312011-0007","Disposition":"Insufficient Data","Longitude":"-75.017011","Viewing Distance":"Unknown","Object Features":"Undisclosed"}