{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.369055,+-89.516248(27588)&iwloc=A&hl=en\"> mufon case (27588) map </A>","Summary":"Triangle with 7 lights","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"01/31/2011 11:52 UTC","Region":"Mississippi","Log Number":"US-01312011-0006","City":"Oxford","divs":["Sighting DetailsI went outside my house, on to my back porch to have a cigarette, it had been raining and was very overcast. I thought the ground was strangely illuminated for it being so overcast, so I went out from under the coverage of my screened in porch, and looked up. I saw what seemed to be a low flying object, I thought it was a plane at first, but it was way too big and moving much too strangely. It was triangular in shape, with 7 lights 6 of them were along the edges of the bottom surface of the object and were a moderately bright yellow, the seventh seemed to be in the center and much larger than the others, but dim in comparison. The rest of the craft was black against the overcast sky. The object was rotating clockwise, at about 2-3 rotations per minute if I had to guess, and seemed like it was drifting in a southernly direction. It drifted for what seemed like a very long time, but it was only about 5-7 minutes, then it instantaneously changed directions and moved west at a highly accelerated rate of speed. It left my field of vision, I went inside and grabbed a bottle of whiskey. I am now coming to terms with this, I have never really thought much about ufo's or paranormal stuff, but I started looking stuff up and read something about mufon so I found the site and here I am."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27588.html.txt","/var/www/straped/mufon/org/27588.html"],"Disposition":"Unresolved","Object Features":"Other","Date of the Event":"01/17/2011 05:15 UTC","Case Number":"27588","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"34.369055","trends":["There have been 3 other sightings in Oxford","There were no other sightings in Oxford on or around January 17th 2011","This sighting has never been favorited.",""],"Longitude":"-89.516248"}