{"Sighting Duration":"00:15:00","divs":["Sighting DetailsWhen i went Melbourn with my Wife and my daughter, We had a stop over at my brother in law's house to feed my 10 month old daughter. His house situate in David street (infront of the davis st berry st intersection). When got down from the car i heard a helichopter sound, which sounds like moving very slow. Before i enter inside the unit i looked at the ske in Western Direction towards the sound of the helichopter and found a very slow moving choper at very high Altitude and also I saw a star like object (which was stationary) near by and which drew my attention as the time was mid noon and in a clear sky no one can see the star. I called my wife and pointed the direction but she couldn't be able to noticed it as she has bad vision. As we were in hurry to resume our journy to melbourne i went inside to feed my daughter. 10 min later I came out side to have a look and still the object was there but there were some black objects move close to the object, but I'm not sure about the black object as It may be the due to sun light. But the Other star like object was definitely an object. 15 min later when i checked the sky the object was dissappeared."],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=-36.080778,+146.916469(27583)&iwloc=A&hl=en\"> mufon case (27583) map </A>","Country":"Australia","Object Features":"None","Log Number":"AU-01312011-0002","Case Number":"27583","Viewing Distance":"Unknown","Region":"New South Wales","files":["/var/www/straped/mufon/html2text/27583.html.txt","/var/www/straped/mufon/org/27583.html"],"Object Flight Path":"Stationary","Longitude":"146.916469","Summary":"Star like object in the day light sky","Date of the Event":"01/28/2011 02:20 UTC","City":"Albury","trends":["There have been no other sightings in Albury","This sighting has never been favorited."],"Source":"MUFON","Latitude":"-36.080778","Disposition":"Unresolved","Tags":"City","Object Shape":"Star-like","Date Submitted":"01/31/2011 06:45 UTC"}