{"files":["/var/www/straped/mufon/html2text/27597.html.txt","/var/www/straped/mufon/more/27597_submitter_file2__IMG_0119.JPG","/var/www/straped/mufon/more/27597_submitter_file3__IMG_0118.JPG","/var/www/straped/mufon/org/27597.html"],"divs":["Sighting DetailsSaturday January 29th at approximately 8 Pm I was Looking at the Sky as it was fairly clear when I noticed to my Southeast a stationary object in the Sky.I recorded it on Video however Video is bouncy as I tried to steady against a tree but back to the UFO. It just remained still but it was projecting all colors from it in a very rapid fashion. I am sending in Video to you. I watched it in the sky for at least an hour. I also noticed a Blue Sphere like object just below it.(have photos of both) After watching for so long I started to look around in the sky. That was when I noticed a Jet at a high cruising altitude and to the left of it a Red to Brown colored Sphere seamed to be following same direction as Jet.(to my North) I had my bright LED Flashlight with me with a strobe function on it so I flashed my light towards the Object. I was then shocked to see the Object(or UFO)switch it's direction. It circled back for a few seconds,and then it just went in the opposite direction back North again. I went back to look at flashing UFO as it was still there. I stopped watching when my Wife came home upset(we have been caring for my father who has Cancer). Later I looked out of the living room window and it was still out there only in a short but different position. Lost sight of object when I went to bed. Saturday was a very strange night."],"Log Number":"US-02012011-0006","Region":"Oklahoma","trends":["There have been no other sightings in Skiatook","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.368424,+-96.001385(27597)&iwloc=A&hl=en\"> mufon case (27597) map </A>","City":"Skiatook","Source":"MUFON","Object Shape":"Unknown","Object Features":"Unknown","Case Number":"27597","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"01/29/2011 08:00 UTC","Date Submitted":"02/01/2011 12:37 UTC","Longitude":"-96.001385","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Latitude":"36.368424","Summary":"UFOs over Tulsa County","Weather Factors":"Windy, Light","Country":"United States","Disposition":"Unknown"}