{"Date Submitted":"01/31/2011 11:55 UTC","Weather Factors":"Unknown","Disposition":"Insufficient Data","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=27.672827,+-81.507414(27591)&iwloc=A&hl=en\"> mufon case (27591) map </A>","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Summary":"hidden","Object Shape":"Oval, Triangle, Other","Date of the Event":"05/27/2008 02:00 UTC","Case Number":"27591","divs":["Sighting DetailsI have been having multiple sighting for a few years now I dont know what they mean either. In may 2008 I was on vacation in florida on the gulf coast, I love to go for walks on the beach at nights. One night I was sitting on the beach it was a wierd night no lights were on in the houses so the sky was clear, as I sat on the beach there was no clouds in the sky. A few minutes passed when I heard a strange humming sound, I thought nothing of it, then I see a really random cloud flying really low towards the beach I kept looking at it because the humming was getting louder and this cloud was really big, then it stopped but the wind was really blowing steadly. As I stood there I then see a light shoot down from the cloud into the water so bright you could see to the bottom, it made a sound like someone turned on a light switch too. Then I started getting nervous so I backed up but I was strangle courous so I stayed and watched it hover to the dunes where it went down near some trees and then a spiral of lights appeared for a brief few seconds. That following sunday I was back home, my wife and I decided to go for a walk as we were walking down the street I felt the need to look up and on the right of me was three objects in the air hovering, they looked like oddly shapped orbs alot like the movie flight of the navigator ship. I also noticed there was no air traffic in a heavy traveling area. I stood there staring when one just vanished, the other one turned around and poined its nose downward and flew off really fast, the other went another direction, a few minutes later air traffic started again. Another one was in 2010 when I was driving to work I noticed something shinny in the air near the toll roads, and there was another object just hoving there and then dissapeared. The most recient one was on halloween of 2010, I was having a very small get together we were all on the pourch when my wife asked me to put the strob light near the tree, as I walked onto the lawn I looked up and saw a triangle shapped object flying very low heading perfectly south, I noticed it because it had an orange light on in the center, I felt good because I got my wife and her two friends to witness this too. Im not sure why I am seeing all these things but I would like some answers, these are all real sighting. Thanks"],"trends":[],"Log Number":"US-01312011-0009","files":["/var/www/straped/mufon/html2text/27591.html.txt","/var/www/straped/mufon/org/27591.html"],"Region":"Florida","Latitude":"27.672827","Viewing Distance":"20 Feet or Less","Tags":"City","Longitude":"-81.507414","City":"Undisclosed"}