{"Source":"MUFON","Log Number":"US-02012011-0002","Disposition":"Unknown","Object Shape":"Unknown","Object Flight Path":"Unknown","Tags":"City","Date of the Event":"12/31/2010 12:00 UTC","Date Submitted":"02/01/2011 02:19 UTC","City":"Grass Valley","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around December 31st 2010"],"Object Features":"Unknown","Viewing Distance":"21-100 Feet","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=39.227321,+-121.052071(27593)&iwloc=A&hl=en\"> mufon case (27593) map </A>","files":["/var/www/straped/mufon/html2text/27593.html.txt","/var/www/straped/mufon/org/27593.html"],"Weather Factors":"Unknown","Country":"United States","Summary":"Several times in one week I felt my ankles grabbed in bed, one night saw a flash and heard multi-toned ringing in my ears.","divs":["Sighting DetailsI have always been different. Many say I am an Indigo. I am not sure I was abducted, I don't have lucid memory of any abduction. Here is what happened: Several nights in a row within one week in January 2011 I had the feeling of someone grabbing my ankles in bed. Some of the times when I was clearly awake. One night when this happened I looked out my large bedroom wall window to see about 5 fast flashes of light and then I experienced a loud multi-tonal ring in my ears for about 30 seconds. I have seen what I thought was craft 3 times in my life. In childhood there was a time I went for a walk in the woods with a friend (we were 12) and were scared and ran back home to be reprimanded for being gone so long. We thought we were away from home only a short period of time. I am curious to hear your input. Since the last experience happened this month I have had a heightened sixth sense (more than normal), and a sudden obsession with ETs. When I see certain photos of aliens I feel unexplainable deep compassion mixed with some fear. There are also 2 windows in my home that I won't walk by at night by myself, just those 2, I am afraid of, no others. Also, suddenly, I feel like I am part of something large going on. I feel a strong sense of duty. If so inclined, your input would be appreciated."],"Latitude":"39.227321","Sighting Duration":"Undisclosed","Longitude":"-121.052071","Case Number":"27593"}