{"Sighting Duration":"00:02:00","Object Shape":"Oval, Star-like","Longitude":"-117.804126","Object Flight Path":"Undisclosed","Summary":"Fast moving star-like object traveling at incredible speeds from East to West.","Case Number":"27594","map":"<A HREF = \"http://maps.google.com/maps?q=34.111536,+-117.804126(27594)&iwloc=A&hl=en\"> mufon case (27594) map </A>","Date Submitted":"02/01/2011 04:54 UTC","files":["/var/www/straped/mufon/html2text/27594.html.txt","/var/www/straped/mufon/org/27594.html"],"Object Features":"Unknown","Disposition":"IFO","Latitude":"34.111536","Date of the Event":"01/27/2011 11:30 UTC","Region":"California","Source":"MUFON","Country":"United States","divs":["sighting detailsfirst, i see a lot of ufos on a regular basis. this one stands out by far. at around 11:30 to 12:30, i was looking at the stars (as i usually do) and see a very faint, very dim light shooting across the sky. i was able to see the international space station a few weeks ago (california), and i think it travels around 17,000 mph. at that altitude, this ufo had to have been going at least 6-10 times the speed of the iss. i first saw it while looking at the normal constellations i see. i am looking basically straight up, and i see movement. i focus on the movement, and realize how fast it is going first. its very dim, and looks very large, almost as if i have an out of focus view on a star; but traveling at amazing speeds. i would say it would cross from horizon to horizon (maintained at an average speed) in less than 4 minutes. i've never seen any ufo travel so fast, and making it difficult to see makes me believe it's extra-terrestrial instead of government craft. this occurred for about 15 seconds, at which point it went dim and i could no longer see it (i have 20\\20 vision and am far sighted, so i see these better than a lot of my friends). it seemed to have maneuvered to the south, but just barely. a small correction of flight trajectory, if you will. i had no emotions other than excitement and amazement that i was able to see this. my friend from inside heard me as i said in awe things along the lines of \"what is that?\" and \"i've never seen any ufo do that\" and came outside to see what i was saying. it disappeared shortly before that unfortunately. somewhat of an oval shape, but hard to distinguish. it looked very out of focus, and very dim."],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-02012011-0003","trends":["There have been 4 other sightings in San Dimas","There were no other sightings in San Dimas on or around January 27th 2011"],"City":"San Dimas"}