{"Date of the Event":"02/02/2011 01:01 UTC","files":["/var/www/straped/mufon/html2text/27607.html.txt","/var/www/straped/mufon/org/27607.html"],"Date Submitted":"02/02/2011 06:45 UTC","Case Number":"27607","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.78437,+-122.409916(27607)&iwloc=A&hl=en\"> mufon case (27607) map </A>","Summary":"1 AM Northern Ca. bright greenish blueish white bright lights","City":"San Francisco","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAbout 1:AM I was outside in my patio smoking a cig.talking on the phone on a long distance call for about five minutes when my call was disconected suddendly. I stood up to put my cig. out when I noticed a bright light up in the sky. I stared at it to see if it was moving or questioning if it was just a street light. then I noticed this very bright light was moving rather slow. As it got closer I was then trying to figure out if it was an airplane but it wasn't an airplane at all. The lights were too bright to be an airplane and it was flying too low. I thought an airplane wouldn't be flying that low. As it passed by me appox. (the same height as an airplane) it passed slow but it took about a minute to pass before the building obstructed my view. It had greenish blueish white lights on the front shaped like a V but appeared to also be circular on the sides. It passed slow and the sound coming from it was a humming sound. Only way I know how to discribe it. When I first noticed it I thought it cant be a street light because it's too high and it cant be a plane because it's too low and lights are too bright. My feelings were OMG it's a ufo spaceship & I reached for my cell phone to take a picture of it but It wasn't on me I was using the land line. Then I realized that may have been the reason my call was disconnected (my calls have never been disconected like this before) I went inside the condo to wake my adult daughter & let her know what I had seen and wanted her to see it from her bedroom window. By the time she saw it, it was already up higher in the sky hovering over one area & it appeared to be North from me. I decided to call 911 to find out if there were other reports made about this and the dispatcher said no one else had called to report anything about this. I thought it irather strange that no one else would call to inquire about it because the lightss were so bright and (it is my assumption that it was flying too low to be an airplane) finelly around 2:AM we lost sight of it and no longer hovering in the sky. Wow this was trippy. I didn't feel scared or nervous but felt more of a sense of disbelief of what I was seeing. When I called 911 it was then (as I was discribing it) that I began to feel more shook up. I am so glad my daughter found this web site. I needed confirmation of what I saw by reading other reports here about the same object with the same lights was real and true by knowing someone else saw it did set my mind at ease knowing i wasn't immagining this."],"Log Number":"US-02022011-0003","Tags":"City","Weather Factors":"Unknown","Latitude":"37.78437","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around February 2nd 2011"],"Object Features":"Undisclosed","Object Shape":"Chevron","Longitude":"-122.409916","Object Flight Path":"Undisclosed","Region":"California","Source":"MUFON","Disposition":"Insufficient Data"}