{"Tags":"City","Object Shape":"Circle, Oval, Star-like, Other","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Case Number":"27608","Log Number":"US-02022011-0004","map":"<A HREF = \"http://maps.google.com/maps?q=33.780205,+-117.940338(27608)&iwloc=A&hl=en\"> mufon case (27608) map </A>","divs":["sighting detailsi took my dog out to do her business out in the backyard around 11:20 p.m. as we walked out on to the porch, i noticed two very bright lights in the southwestern sky. a few minutes later i saw they had not moved and now a third light was flickering, as if it were one of those new \"energy safe\" light bulb just turning on. they made no noise and sat still in their triangle like formation. i immediately run in the house and grabbed my camcorder to document what was happening. i had a hard time keeping the lights in frame as they were also quite low, and view was often obstructed by trees. so i got my ladder and went on my roof to film. i sat in awe watching and filming the amber\\orange colored orbs for next 17 minutes until they began to change shape, almost appearing like a helicopter before flying away one by one. i uploaded my video to youtube right away that same night. around 30 minutes after the last orb vanished into the night, two helicopters (i assume police) began to sweep the area in the direction they were headed as they disappeared. this sweep lasted almost an hour, then returned again the following night repeating the actions performed the night of the event."],"City":"Garden Grove","Disposition":"IFO","Region":"California","Date Submitted":"02/02/2011 07:07 UTC","Latitude":"33.780205","Summary":"Three bright orbs in a triangle formation strobing and pulsating silent 17 Min.","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around January 26th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/27608.html.txt","/var/www/straped/mufon/org/27608.html"],"Viewing Distance":"Unknown","Longitude":"-117.940338","Date of the Event":"01/26/2011 11:20 UTC"}