{"Disposition":"Unknown","divs":["Sighting DetailsIt was about 2-3 after midnight. I went outside to smoke a cig and after 10 minutes. I heard a low pitch sound like a slow one cylinder engine, .It was pitch dark. I looked to the south and above me at a angle of 12 degrees and about 100 yards away, three lights were moving from east to west above the valley below.The valley is small and directly behind the house facing south. The lights were about the size of a quarter held out arms distance and were only half circle.They moved very slow around 4 mph.The lights moved along the valley for less than about half mile until I lost sight of it because it was so low. I could not see anything between the lights. The lights were bright but didn't light up anything but the lights themself. It was the sound which attracted my attention the whole time.It was moving so slow it took about 6 minutes from start to finish. The lights were contained and not seperate. This makes the second sighting I have had. the other was in okla. city,ok. The sound there was a very high pitch sound, It was about a blook away and about 200ft above the ground over a public park near my home. It remained in a still position for about 5 minutes. I could see it very plain, it was circular and had a dome on top.At first I thought it was a toy someone was playing with at the park. It was silver in color. I could describe it more but it would take to much time here."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.868408,+-92.117652(27604)&iwloc=A&hl=en\"> mufon case (27604) map </A>","Viewing Distance":"101-500 Feet","Longitude":"-92.117652","Country":"United States","Weather Factors":"None","Object Shape":"Triangle","Log Number":"US-02012011-0013","Case Number":"27604","Date Submitted":"02/01/2011 11:21 UTC","Latitude":"35.868408","Object Flight Path":"Straight-line path","Date of the Event":"11/30/2002 03:09 UTC","Summary":"3 half dome lights on bottom in triangle shape","Sighting Duration":"Undisclosed","City":"Mountain View","Source":"MUFON","Tags":"City","Region":"Arkansas","files":["/var/www/straped/mufon/html2text/27604.html.txt","/var/www/straped/mufon/org/27604.html"],"Object Features":"Undisclosed","trends":["There have been no other sightings in Mountain View","This sighting has never been favorited."]}