{"Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","Tags":"City","Case Number":"27602","Object Flight Path":"Path with directional change","City":"Anchorage","Longitude":"-149.895848","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around December 31st 2010"],"Region":"Alaska","Weather Factors":"Unknown","Date Submitted":"02/01/2011 07:58 UTC","divs":["sighting detailsi was taking out the garbage around 5:25 pm on 12\\31\\2010 in anchorage alaska within a few blocks of the intersection of debarr and bragaw streets. i noticed a really bright orange light to the east at about 20 to 30 degrees above the horizon and called for my wife to see it too. it was slowly approaching with a steady motion along a straight line in my general direction. when it got to about a 45 degree angle above the horizon, it continued to move slowly but changed course moving to my left. at the same time the light slowly went out while maintaing the same intensity. it was like i was looking at a bright fuzzy surface that maintained it's intensity and the amount of surface i was watching slowly went to zero. at this point i could just make out a faint small oval shape that continued moving to the left. after traveling a total distance of about 20 degrees to the left, it changed course again and continued slowly moving away from me. it finally was obscured by the roof of a building about 100 yards to my east. there are really tall mountains to the east that go way above the roof of this building, so it had to be betwwen me and the mountains. total duration was about 5 minutes. my wife has seen military flares and was certain this was not a flare. she said flares don't make u-turns. the head lights and running lights of airplanes are usually not orange. the intensity was greater than any airplane headlights i have observed and there was no discernable aircraft engine noise. there must have been other witnesses. i could hear a lot of neighberhood fireworks. maybe the occupants wanted a better view of the fireworks :-) i regret not thinking to signal it with a laser pointer."],"map":"<A HREF = \"http://maps.google.com/maps?q=61.221876,+-149.895848(27602)&iwloc=A&hl=en\"> mufon case (27602) map </A>","Summary":"Bright orange light slowly made a U-turn, went dim, had oval shape","Object Shape":"Oval","Object Features":"None","Latitude":"61.221876","Log Number":"US-02012011-0011","files":["/var/www/straped/mufon/html2text/27602.html.txt","/var/www/straped/mufon/org/27602.html"],"Date of the Event":"12/31/2010 05:25 UTC","Sighting Duration":"Undisclosed","Disposition":"IFO"}