{"Case Number":"27614","Object Features":"Unknown","Longitude":"-117.149255","Summary":"Every other night occurance","City":"San Diego","Tags":"City","Source":"MUFON","Region":"California","Viewing Distance":"Unknown","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around January 30th 2011"],"divs":["Sighting DetailsHey guys, I live in San Diego, CA and every other night between 1am and 3am I see, facing west, a small bright star-like ball in the sky outside my window. I know its not a planet or a satellite because of the way it moves. Its slow... but I've seen it move as fast as a plane flying would be, but then suddenly it stops dead. The first night I saw this about a month ago, there was 2 star-like things in the night sky. Its not a helicopter because sometimes it stays still for quite awhile and is far enough away that a helicopters light probably wouldn't be visible, I believe this object to be over the pacific ocean somewhere. Ive seen it fade out and then come back, and get a little bigger and a little brighter as though it was slightly closer as it was at first glance. Its slightly larger then regular stars, first time I saw it I thought it was the North Star, but over the ocean?? I don't think so. It also flickers very brightly, and it flickers blue, red, and green. I've used binoculars to get a better look, but its far enough away that it just looks like a large star flashing weird colors. It stays for usually 10 or 15 mins usually and then drops behind the horizon of some apartment buildings across the street from me, very slowly. I've been out in the desert plenty of times and seen satellites, shooting stars, planes, jets, and helicopters. I've thought of everything I possibly could think of and can rule out every one. Can anyone help shed some light on this weird sighting? I know I'm not seeing things because I've had my girlfriend and parents both look at it. Ive tried to take pictures and a video of it but my stupid camera wont focus on it. Also, Ive seen it move, like I said its really slow but it does move up, down, left, right. So I am completely stumped as to what the hell I'm seeing. If anyone has any info on Government Satellites or ha ha \"weather balloons\" I would love some feed back. Before I'm willing to accept my info to be sent to a third party. I would like if I can speak to someone via email. I mean if someone tells me what I'm seeing isn't worth it then no third party is necessary. If someone contacts me through my email and tells me they think I can make a case, then I'd be willing to let my info go to a third party."],"Log Number":"US-02022011-0010","Date Submitted":"02/02/2011 08:35 UTC","files":["/var/www/straped/mufon/html2text/27614.html.txt","/var/www/straped/mufon/org/27614.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.723529,+-117.149255(27614)&iwloc=A&hl=en\"> mufon case (27614) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"None","Latitude":"32.723529","Date of the Event":"01/30/2011 12:00 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering,Other","Object Shape":"Star-like","Disposition":"IFO"}