{"Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband woke up in the middle of the night from a terrifying dream that was so bizarre that he had to write it down.. he Titled it \"Liquid City\" He wrote: We were all together riding in a small boat going down a channel of a lake when we felt this feeling over us that we were gonna have to go.. all of us.. all 5 of us. We were going faster down the channel when it came to a halt- the craft.. There were small aliens standing next to like a small cave where a small channel of water went down. They were motioning us to go in. I remember them trying to pull me in. Evidently everyone else was pulled in but they were trying to pull me. I remember them talking to me in my mind and I remember them being really strong and taking a hold of me thrusting me back. I gave it all I had by fighting and I was making them mad. I felt lifeless as they just pulled me in. I know they knew everyone of my thoughts. Big headed and ugly but had quite a sense of humor about them they were letting us know that they were waiting for us. My husband told me that after writing this he calmed back down and tried to fall asleep. He got up early that morning finding my 10 year old son telling him that he saw a big oval shaped light in our back field around 6am. My son told my husband that it was bright red and danced around by the trees then disappeared. My husband chose not to tell him about the dream. My son went back to bed..later my 15 year old daughter woke stating that she had a weird dream that involved tornados and aliens.. Totally weird and really began to upset my husband to the point that he didn't want to talk about it anymore. I wanted write this to find out if anyone else experienced this kind of vivid dream. It is disturbing enough but to find that 2 of the 3 kids vocalized a link to this situation. Very weird."],"Region":"Indiana","Case Number":"27617","Object Features":"Undisclosed","Summary":"dream with weird coincidence","Sighting Duration":"Undisclosed","Longitude":"-85.598874","Object Shape":"Oval","Latitude":"40.556936","Object Flight Path":"Undisclosed","City":"Undisclosed","Country":"United States","Tags":"City","trends":[],"Date of the Event":"12/31/2010 12:00 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.556936,+-85.598874(27617)&iwloc=A&hl=en\"> mufon case (27617) map </A>","files":["/var/www/straped/mufon/html2text/27617.html.txt","/var/www/straped/mufon/org/27617.html"],"Viewing Distance":"Unknown","Log Number":"US-02022011-0013","Date Submitted":"02/02/2011 10:09 UTC"}