{"City":"Chicago","Sighting Duration":"Undisclosed","Summary":"Bright Blue Flash of Light Hoffman Estates IL","Object Flight Path":"Other","Object Features":"None","Disposition":"IFO","Source":"MUFON","Country":"United States","Tags":"City","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=41.879434,+-87.627958(27612)&iwloc=A&hl=en\"> mufon case (27612) map </A>","Object Shape":"Flash","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around February 1st 2011"],"Weather Factors":"Windy, Snow, Heavy","Region":"Illinois","Case Number":"27612","Log Number":"US-02022011-0008","divs":["Sighting DetailsOn February 1st of 2011 at around 9:30-10pm CST in Hoffman Estates,IL my friend and I were traveling westbound on route 58 (Golf Rd), near a heavily wooded forest (forest preserve) during a terrible blizzard. As we were driving, suddenly we witnessed a bright L.E.D blue flash of light that seemed to come from our right side. The flash of blue light remained for about 3 seconds. It surrounded the whole area to where the high winds of the snow were no longer visible, as the bright glow surrounded us completely and engulfed the whole car in this light, which is the brightest we had ever encountered. We never experienced anything like it. It was so startling that the car in front of us stopped dead in his tracks. We almost rear ended him and could have also caused a collision with the cars following us from behind as well. Thank goodness we didn't get stuck in the foot high snow that was on the ground at the time. I'd also like to state that as intense as the light was, I have ruled out the possibilites that it could have been lightning, or a meteorite as there was no sound of thunder following the bright flash, or any sonic booms, or vibrations in the ground. We have no idea what else this could've been. We were left feeling confused and struggling with the idea of what it could've been, or what could've caused that. There was nothing else we saw that night."],"Date Submitted":"02/02/2011 03:14 UTC","files":["/var/www/straped/mufon/html2text/27612.html.txt","/var/www/straped/mufon/org/27612.html"],"Date of the Event":"02/01/2011 09:30 UTC","Latitude":"41.879434","Longitude":"-87.627958"}