{"Summary":"Cat head shaped UFO.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27626.html.txt","/var/www/straped/mufon/org/27626.html"],"trends":["There have been 10 other sightings in Bloomington","There were no other sightings in Bloomington on or around June 10th 2000"],"Country":"United States","Sighting Duration":"00:02:00","Tags":"City","Case Number":"27626","Weather Factors":"None","Object Flight Path":"Hovering then path","Latitude":"40.487223","Date of the Event":"06/10/2000 12:00 UTC","Viewing Distance":"20 Feet or Less","Longitude":"-88.990747","Object Features":"Window(s), Other","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.487223,+-88.990747(27626)&iwloc=A&hl=en\"> mufon case (27626) map </A>","Log Number":"US-02032011-0007","Region":"Illinois","divs":["Sighting DetailsMe and my friend Ryelee were in 4th grade. This is the scariest thing that has ever happend to me. We were playing in the sprinkler, and all of a sudden everything got dead silent. the breeze stopped blowing, everything...nothing moved anymore. we turned around to look right above my house and there it was. it was RIGHT above my house....it was medium sized. it was dark black, it was a circle with two points on the front. it was shapped as a cat head(in one of your logo's you have an object like this, it looked like that). It slowly pointed downwards at us...there was a window on front but it was too tinted, we could not see in to it. We starred in disbeleif, i couldn't even think i was so confussed. after about 1 minute of it hovering there, it flew away as quick as it came and dissapeared behind a cloud. I have seen things ever since this day. i know what i saw was reall, my friend remembers it all too. have you ever seen anything like this? please e-mail me with any information you have about an object like this, i have been researching it for a while now and have found nothing."],"Date Submitted":"02/03/2011 11:14 UTC","Disposition":"Insufficient Data","City":"Bloomington"}