{"Summary":"Round dot in sky like a satellite","Date of the Event":"08/07/2006 11:30 UTC","trends":["There have been no other sightings in Copper Harbor","This sighting has never been favorited."],"Source":"MUFON","Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsMy wife and I were sitting on a bench in the very northern point of the Keweenaw peninsula of upper Michigan across from Fort Wilkins State Park. I was looking for satellites to track. All of a sudden I spotted one and started tracking it, but within seconds it had changed directions. It headed west then reversed itself, then reversed again.Then suddenly headed south for almost out of sight and reversed again to about where I first saw it and beyond to the north, then west again and another reversal. Then suddenly it just vanished. This was the day after the space shuttles \"return to flight mission\" after the re-entry disaster. My wife Susan witnessed the whole dance in the sky. I know the difference between a satellite trajectory and speed compared to what we saw. This was 3 to 4 times faster. When we saw the footage a few years later of what the space shuttle captured on film I got a chill down my spine. Over the past 30 years I have witnessed similar incidents of what I thought was a satellite suddenly making a 90` turn and vanishing. In the mid 80's, in Auburn Hill, MI I saw a craft in the fog. It was huge, and it made no sound. It appeared as large as a jumbo jet, but it was only about 150 feet off the ground. It had three lights across the back and the colors were more of a pastel shade. It was more of a cigar shape and the lights were equally spaced. One in the middle and one at each end. I am writing to you now because I am no longer afraid of what others would think. My wife and I know what we saw. As a test, I traced what I remembered the Aug 2006 sighting was and I asked my wife ; \"do you know what this is\",, her reply was \"yeah, that's what we saw in the Keweenaw. During the original incident, I was excited to see it. I have never been scared of a UFO, I have always believed it was ludicrous to think we are the only species in the universe. I honestly pray, before I die, that the world publicly admits to such events."],"Object Features":"None","Region":"Michigan","Viewing Distance":"Unknown","Longitude":"-87.89032","City":"Copper Harbor","Latitude":"47.468311","Case Number":"27624","Log Number":"US-02032011-0005","map":"<A HREF = \"http://maps.google.com/maps?q=47.468311,+-87.89032(27624)&iwloc=A&hl=en\"> mufon case (27624) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Circle","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/27624.html.txt","/var/www/straped/mufon/more/27624_submitter_file1__August2006UFO.jpg","/var/www/straped/mufon/more/27624_submitter_file2__Mid80-sUFO.jpg","/var/www/straped/mufon/more/27624_submitter_file3__Late70-sUFO.jpg","/var/www/straped/mufon/org/27624.html"],"Country":"United States","Date Submitted":"02/03/2011 10:13 UTC"}