{"Date of the Event":"11/30/1977 12:00 UTC","Latitude":"31.55502","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Longitude":"-110.270026","Log Number":"US-02032011-0008","Viewing Distance":"20 Feet or Less","Tags":"City","Object Features":"Unknown","City":"Sierra Vista","Weather Factors":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.55502,+-110.270026(27627)&iwloc=A&hl=en\"> mufon case (27627) map </A>","Region":"Arizona","Object Shape":"Unknown","Date Submitted":"02/03/2011 11:38 UTC","Source":"MUFON","Case Number":"27627","divs":["Sighting DetailsIt's been over 30 years and my mother and I are still disturbed about it. We will never forget it. It haunts us. I will do the best that I can to describe it. 1978,Sierra Vista-Ft. Huachuca; we were watching tv in the late evening when a very loud machine(not an engine not a motor)hovered directly over our house. It's so hard to describe a sound that you have never heard before or since. There were two different sounds. One was a constant hum, low in tone and loud; but soft not deafening like a E-A6B. The other was rotating counter-clockwise higher in pitch. The closest thing I can associate it with is a hula hoop; but, it wasn't a steal ball (or bearing) rolling. More like a metal scrapping. We looked at each other, jumped up ran to the door and IT WAS GONE! The neighbors ran outside too. There was nothing out there. No traces of sound, light, vehicle--nothing. The whole thing lasted 10-12 seconds. The most disturbing thing about it was that we had this sensation (not quite a vibration, closer to fuzzy) feeling. And we new some how they were watching us. I've read a lot of stories. Everyone describes lights and no sound. There was no light. It was dark outside. If there was a light we would have seen it. I read about this one women that thought she had been scanned. I believe that. It's the only thing that makes sense. I have lived next to military bases all my life(50years). For the last 30 years, I have lived under the flight path. I can sometimes wave to these pilots they are so close. NOTHING LIKE THIS! And there is nothing that appears and disappears that fast."],"files":["/var/www/straped/mufon/html2text/27627.html.txt","/var/www/straped/mufon/org/27627.html"],"Summary":"Huge hovering circular machine directly above our house. It was loud! Gone in 10 seconds without a trace.","trends":["There have been 11 other sightings in Sierra Vista","There were no other sightings in Sierra Vista on or around November 30th 1977"],"Country":"United States"}