{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.488356,+-76.772072(27623)&iwloc=A&hl=en\"> mufon case (27623) map </A>","Log Number":"US-02032011-0004","Case Number":"27623","Longitude":"-76.772072","divs":["sighting detailsme and two other friends were leaving my house to go to a convenience store at 8 pm. it was completely dark outside, and we noticed an object that we have seen before in the sky. it appeared to be a bright orb floating about in the sky. its light puslasted slowly at different intensities, and clearly was not a star. it moved to many different positions in the night sky. it observed no typical aerial movement attributed to planes of helicopters. it just floated around for hours! long enough to have one of my buddies with a high quality camera to come over and photograph and videotape it after we came back from the convenience store. (these photos will be emailed to a mufon investigator when i get them later today.) meanwhile, about 5-10 minutes into our drive towards the wawa in charlotte hall, we observed three of the same orbs in a triangular formation about halfway up the size of a cell phone tower like this one *(link moved to additional evidence section--cms\\sg) in the sky. these objects then exhibited the odd behavior of producing smaller red lights that, then floated up into the sky. after this, the objects dissapeared one after another. (another friend in another place in the county was observing the same object and reported them to dissapear at the same time i saw my glowboys dissapear.) at least 5 people witnessed this event from different locations. when we returned to my house, we proceeded in photographing the inital object we saw. i did not lose sight of the object, as last time, and ended up just going to bed a few hours later. i can provide names and contact information of the other witnesses, as they would be glad to validate this claim."],"Region":"Maryland","Date of the Event":"02/02/2011 08:00 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"02/03/2011 09:39 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/27623.html.txt","/var/www/straped/mufon/org/27623.html"],"Summary":"Two stange sightings observed by 5+ people. First one is a similar object from a previous sighting. Odd bringht orbs in the sky.","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Shape":"Star-like, Other, Unknown","Latitude":"38.488356","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","City":"Charlotte Hall","trends":["There have been 4 other sightings in Charlotte Hall","There were no other sightings in Charlotte Hall on or around February 2nd 2011"],"Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed"}