{"Summary":"Triangle shape or formation.","Tags":"City","Disposition":"Unknown","Source":"MUFON","Latitude":"41.167537","Sighting Duration":"Undisclosed","Case Number":"27638","Object Shape":"Triangle","City":"Galva","Longitude":"-90.042614","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/27638.html.txt","/var/www/straped/mufon/org/27638.html"],"Date of the Event":"02/03/2011 09:30 UTC","divs":["Sighting Details We recently had one of the hugest snow storms since 1979. I had driven across town in Galva, Il to visit friends. After the snow storm a high pressure system moved into the area dropping the temperature to below zero. I went outside about 9:30 pm to start my car to let it warm up. The street runs north and south. I walked outside looking south and up into the sky noticing how clear a night it was. As I was still walking I scan the night sky turning my field of vision to the north. As I looked north I noticed a triangle shape or formation heading south. The approximate altitude was around 1500 to 200O feet. All I saw was three dull amber lights moving together. As the triangle banked to its right based on relative flight path two of the lights seemed to come closer together. Then it disappeared. Flight speed would be equal to or greater than a F-16 moving at supersonic speeds There was no sound. No strobe light. No red and green lights for right away flight. I have flown Cessna's and this was not an aircraft. When I first saw the object I thought, \"Oh my god that's a UFO!\" I did have a camera and did attempt to get a photo however the object or objects had already banked right and disappeared"],"Object Flight Path":"Path with directional change","Weather Factors":"None","Country":"United States","Region":"Illinois","Date Submitted":"02/03/2011 11:29 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.167537,+-90.042614(27638)&iwloc=A&hl=en\"> mufon case (27638) map </A>","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02032011-0018","trends":["There have been no other sightings in Galva","This sighting has never been favorited."]}