{"Date Submitted":"02/03/2011 08:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.742305,+-84.553535(27634)&iwloc=A&hl=en\"> mufon case (27634) map </A>","Disposition":"IFO","Object Flight Path":"Undisclosed","Latitude":"42.742305","Case Number":"27634","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around February 3rd 2011"],"Summary":"Gray Flying Object Near Lansing Airport as Jet was taking off","Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","Region":"Michigan","Sighting Duration":"Undisclosed","City":"Lansing","Longitude":"-84.553535","Source":"MUFON","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/27634.html.txt","/var/www/straped/mufon/org/27634.html"],"Country":"United States","Date of the Event":"02/03/2011 05:15 UTC","Object Shape":"Egg, Oval","Log Number":"US-02032011-0014","divs":["Sighting DetailsI work at a business that is located at the end of an airport. I walked out my office door and looked to the right as there was a jet flying over the grounds just taking off from the airport. As I looked up at the jet, I noticed a small gray object flying about 200 ft. above and to the right of the jetliner. It caught my eye because it seemed odd that another aircraft would be flying so closely to where a jetliner was taking off, and that it was quite low. The object was very small in comparison to the jet. As I looked at the object, I realized that there were no wings, nose, tail, lights or anything that resembled even a single engine aircraft. It moved in a very straight and steady deliberate path and pace. It did not flounder from its path like a single engine aircraft often does. I continued to follow the object with my eyes until it was impossible to see against the blue sky and the setting sun. The color of the object appeared to be a solid gray color with what appeared to be a stripe down the side (but could have been shadowing). My immediate reaction is that it was not a normal aircraft, and it was out of place."]}