{"Object Flight Path":"Path then hovering","Case Number":"27637","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27637.html.txt","/var/www/straped/mufon/org/27637.html"],"Tags":"City","Disposition":"Insufficient Data","Weather Factors":"None","Object Shape":"Star-like","trends":["There have been 11 other sightings in Port Charlotte","There were no other sightings in Port Charlotte on or around February 1st 2011"],"Longitude":"-82.080815","divs":["Sighting DetailsWhile anchored at Pelican Bay, about three hundred yards NE of the docks at Cayo Costa Island, I observed a strange series of lights in the sky at about three am, and woke up my friend who joined me to observe the phenomena. I happened to be on deck getting some fresh air, and enjoying the starlit skies, when I noticed moving lights over my shoulder. At first I thought it was an airplane, but it stopped moving. There were three white pulsating lights in a row. As I watched,thinking that perhaps it was a helicopter, it changed shape into a sphere with a cluster of smaller lights that were colored red, white, and green. I was excited to observe this and made enough noise to wake my friend Barbara. She got her glasses and joined me. We both observed the lights for about twenty minutes. Constantly checking other areas of the sky, and stars for comparison sake. We shared a pair of 10 x 50mm binoculars during the event. The object held position. In the distant background were multiple flashes of lightning and very low rumbles of thunder. From our position the object was due west over the gulf of mexico, about fifteen degrees above the horizon. The object was distant enough for us to believe that a photograph would yield little usefull data. After twenty minutes with no movement or changes, we were tired enough to go back to bed even though the object was still visible. In hindsight this seems horrible, but we were exhausted and the light show was not stunning enough to keep us awake. We have no idea when it left the area. We slept soundly after the sighting. Later we checked some pistures of the Naples sightings, and thought it could be the same sort of thing."],"Sighting Duration":"00:20:00","Log Number":"US-02032011-0017","Region":"Florida","Summary":"Two witnesses saw 3 pulsating lights changing shape from rectangular array to spherical array. Colors changed from pulsating white to combination of white, green & red. Were anchored in Pelican bay looking west over Cayo Costa 15 degrees above horizon.","Object Features":"None, Unknown","Date of the Event":"02/01/2011 03:00 UTC","Date Submitted":"02/03/2011 11:09 UTC","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"26.980611","Country":"United States","City":"Port Charlotte","map":"<A HREF = \"http://maps.google.com/maps?q=26.980611,+-82.080815(27637)&iwloc=A&hl=en\"> mufon case (27637) map </A>"}