{"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Shape":"Star-like","City":"Canastota","Summary":"Brights light to the West, followed by low flying plane.","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=43.085602,+-75.741441(27636)&iwloc=A&hl=en\"> mufon case (27636) map </A>","Latitude":"43.085602","divs":["Sighting DetailsI was just glancing out the window at around 9 pm and I saw what looked like a big star in the sky, spotted West toward Syracuse, NY. This was odd because there was thick cloud cover and no other stars were visible. I noted a steady light down and to the right, just above the tree line but not too far away, a few miles I guess depending on how big the thing really was...anyway that one was moving a bit from one side to the other but behind the branches at the top of the trees a few blocks away so I couldn't say that it WASN'T a plane for sure. But the other star was up in the sky, no branches. I looked at it for a while because it seemed to be making subtle movements. But after a while I left to take a shower, planning to come see afterward if the \"star\" had moved...and it had. 30 minutes later, it was down to nearly tree level and traveling what would have been north. Sfter watching for about 2 minutes I lost track of them in the branches and clouds, but was suprised to see a very low flying plans seemingly searching the sky in that area...(and it didn't look very far away). There is an old military complex in Verona, NY (not too far away) that is \"abandoned,\" I can't find any info on it online, my old boss who lives in the area said it was an air force base. Just throwing that out there..."],"Source":"MUFON","Disposition":"IFO","Tags":"City","Log Number":"US-02032011-0016","Object Features":"Unknown","Longitude":"-75.741441","trends":["There has been one other sighting in Canastota","There were no other sightings in Canastota on or around February 3rd 2011"],"files":["/var/www/straped/mufon/html2text/27636.html.txt","/var/www/straped/mufon/org/27636.html"],"Case Number":"27636","Date of the Event":"02/03/2011 09:00 UTC","Date Submitted":"02/03/2011 10:11 UTC","Region":"New York","Country":"United States"}