{"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Undisclosed","Tags":"City","Country":"United States","Log Number":"US-02042011-0009","Disposition":"Insufficient Data","divs":["Sighting DetailsI was driving home from a meeting and to my surprise I saw huge white lights in the sky, they were the biggest lights ive ever seen, almost looked like a car was up in the air, I could tell it was nothing normal, it was pretty low to the ground, as I got right close up to it I saw that it was just hovering in the air and I saw the exact shape of it, it was a triangle ufo with two lights on one side and a even bigger one underneath, it was the most insane thing ive ever seen in my life, it started slowly moving again so I flipped around my car and followed it for 10 minutes or so and finally I saw that it once again had came to a stop and within seconds of me stopping my car one of the spotlight beams shined down towards my vehicle, which scared the crap out of me, another car pulled up behind me which was nice to know I wasnt the only one seeing this huge ufo. I got so scared and freaked over the light on my car I flipped around and sped off as soon as I could, I didnt want to be an abductee or anything. But I never thought in a lifetime I would see something like this ever."],"trends":["There has been one other sighting in Milton-Freewater","There were no other sightings in Milton-Freewater on or around February 4th 2011"],"Source":"MUFON","Date of the Event":"02/04/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.932635,+-118.387744(27648)&iwloc=A&hl=en\"> mufon case (27648) map </A>","City":"Milton-Freewater","Case Number":"27648","Object Shape":"Triangle","Summary":"Huge triangle craft with big lights","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/27648.html.txt","/var/www/straped/mufon/org/27648.html"],"Region":"Oregon","Latitude":"45.932635","Weather Factors":"Unknown","Longitude":"-118.387744","Date Submitted":"02/04/2011 01:51 UTC"}