{"Longitude":"-87.627778","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Source":"MUFON","Region":"Illinois","Viewing Distance":"Unknown","Summary":"Circle Starlike UFO Changing Directions","Date Submitted":"02/04/2011 02:15 UTC","Case Number":"27643","City":"Chicago","files":["/var/www/straped/mufon/html2text/27643.html.txt","/var/www/straped/mufon/org/27643.html"],"Sighting Duration":"01:22:14","Object Features":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.885674,+-87.627778(27643)&iwloc=A&hl=en\"> mufon case (27643) map </A>","Tags":"City","Latitude":"41.885674","Object Shape":"Circle, Star-like, Other","divs":["Sighting DetailsI was standing looking out my open window On the second floor appartment, while I was smoking a cigarette. I noticed a flashing light in the sky and thought it was a plane at first. But it was not moving like a plane. It would move in diferent directions instead of going in a straight line like a plane would travel. Then I thought it might be a wheather Balloon. Until I watched it more closely. And noticed it would move to the right and then back to the same spot. Then it would move to the left and then back to the same spot. Then it would move in an L shape to the right and then go back to the same spot. Then it would do and L shape to the left and move back to the same spot. then it would move in a circular motion. and go back to the same spot. Then it would move up in the sky and move down in the sky. Then it would go right back to the same spot it was. It was kind of hard to tell exactly what shape it was. But the best discription is that i can give is that it was like a circle, but a star-like with some type of redish greenish color to it. When I saw this object I went to get my brother inlaw to show him. but at first he thought I was joking and didn't want to come and see. So I went back to see if it was still there and it was. I then again went and got him and covinced him to take a look. He saw the exact same thing I was looking at and told me to get the video camera. And he filmed it. It looks kinda small on the video but it looked pretty far off in the distnace too. We stopped flming it. It disapeard over the appartment out of our site. So I came to the computer to see how to report a UFO siting. And here I am telling you my story. When I first seen the object I really wasn't shocked or anything like that. I just thought I was going crazy and thought I was seeing things until my brother inlaw saw exactly what I was seeing. After that I was kinda excited. The only thing that I would like out of this whole expeiance is to find out what i was actually looking at. I did not have time yet to down load the video yet. If you would like to see the video I will send it when asked for it. Thank you for your time."],"trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around February 4th 2011"],"Weather Factors":"None","Date of the Event":"02/04/2011 11:45 UTC","Country":"United States","Log Number":"US-02042011-0005"}