{"Summary":"The UFO was dull gray, like the current cloud cover. Silent and stationary with no lights.","Object Flight Path":"Stationary","Case Number":"27646","Date Submitted":"02/04/2011 01:21 UTC","Object Features":"Window(s), Patterned Surface, Unknown","files":["/var/www/straped/mufon/html2text/27646.html.txt","/var/www/straped/mufon/org/27646.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.61364,+-122.324881(27646)&iwloc=A&hl=en\"> mufon case (27646) map </A>","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around February 4th 2011"],"Weather Factors":"Windy, Medium","Tags":"City","divs":["Sighting DetailsI was watching two bright objects from my bedroom window. At first I thought they were stars, but there was a heavy cloud cover, so knew that no stars or moon would be visible. I could hear the sound of a helicopter, but these objects did not appear to be helicopters at first sight. I was looking through binoculars. As I scanned the sky to see what was going on, off to my right, among the trees, I saw a disc shaped, dull gray craft - totally silent and stationary, no lights, no sound, with circles of the same color running around the edge. I couldn't tell if the circles were windows or some sort of marking as nothing was lit up. I called my son, who is 49 years old and lives with me, to see if he could verify what I was seeing. I called 911 to report this and told them I just wanted to let them know what I was seeing in case any other calls came in. I was totally surprised by my reaction and the emotional state I was in. I'm a rational, clear thinking person and make any judgements based on facts as I see them. I work for the Federal Government and with an office full of attorneys, so I deal with facts all day long. I fell apart and could hardly talk to the 911 operator. All I could say was, \"Oh, God, oh God, oh God!\" I managed to convey what I was looking at and the 911 operator was kind and made sure I stayed on the line. I knew, however, that I was being humored. They wanted to send the police to my home, but I asked them not to because I didn't want to alarm the neighbors. Of course, the police came anyway. They stated that there had been a bad traffic accident and the two bright lights in the sky were police helicopters. I told them, however, that did not explain the disc shaped object in the trees. This sighting happened in only a matter of five minutes or so. When I moved the binoculars from the disc back to the helicopters and back to the disc again - the disc had disappeard. I discounted the fact that what I was seeing might have been some of the lenticular clouds the area around Mt. Rainier is famous for as the cloud cover was moving rather quickly to the northeast and the object I was observing was absolutely still and not moving at all. My lingering question is was the disc observing the helicopters? Were the helicopters aware of the disc? Did the disc cause the accident? I guess I'll never know. I feel that I need to further explain myself to the local police so they won't discount me as some unbalanced person, but I'm afraid that if I do that, it will only make matters worse. How does a person defend themselves in this kind of situation? Why do I feel that I have to defend myself? I know what I saw."],"Date of the Event":"02/04/2011 07:05 UTC","Object Shape":"Disc","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"47.61364","Longitude":"-122.324881","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-02042011-0007","City":"Seattle","Region":"Washington"}