{"City":"Mamou","Case Number":"27645","Tags":"City","Region":"Louisiana","Source":"MUFON","Weather Factors":"None","Object Shape":"Square, Rectagular, Unknown","Date Submitted":"02/04/2011 12:02 UTC","trends":["There have been no other sightings in Mamou","This sighting has never been favorited."],"Object Features":"Window(s), Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.633809,+-92.419299(27645)&iwloc=A&hl=en\"> mufon case (27645) map </A>","files":["/var/www/straped/mufon/html2text/27645.html.txt","/var/www/straped/mufon/org/27645.html"],"Longitude":"-92.419299","Latitude":"30.633809","Disposition":"Unknown","Log Number":"US-02042011-0006","Sighting Duration":"Undisclosed","Date of the Event":"06/15/1983 12:00 UTC","Summary":"Military/Experimental or Craft not one of ours crashing but didn't????","divs":["Sighting DetailsI was 19 at the time and was living in a large wooded area, decided to go and shred grass with a tractor, tractor was kept in large quansit barn 80' Wide X 200' Long, and 25 ' tall. I went inside opened the large rollup door on the north side, drove tractor through the door turned east then south driving alongside the barn, when I reached the southeast corner and could see across the 40 acre field, I saw somthing across the field in the southwest corner and it was below the treeline trees in that area along the boundry of the field are approx 40 -50 ft. tall. I began reacting very irrationally fearful, angry, and began shaking my fists and shouting at what I was seeing while the tractor was still moving forward, I think about that time I put it in neutral as I rember wanting to jump off of the tractor,(I dont think I did though, The thing is I could not put a name to what I was seeing, what I am trying to relate to you here is there was no picture in my mind that could relate to understand what I was seeing,(very freaky) Anyway while all of this was going on in my mind, I kept my eye on it. BTW I remember that it was large, I mean this is a forty Acre field and this thing was big. Well next thing that happend is that the craft began coming up as though it was a plane coming out of a stall, it begsn to rotate with the cockpit facing me and I actually have a picture in my head of the pilots helmet that I could see through the canopy. Time kinda stood still in a way for a moment there as I looked at him and I felt that he was looking at me (eye to eye, contact) weird didn't feel right, I dont remember watching it fly off I just kind of lost contact with the pilot, maybe that's when I jumped off of the tractor and went back inside to calm down. At the time I called my pop and told him that a military jet must have almost crashed doing some kind of a stall maneuver over one of our fields, but was able to pull itself out of the stall and had not crashed. So now 27 years have passed and I began to re think about this event again I now have a few questions. Why could I not recognzse that it was a plane even if it was upside down? Could a plane really survive a stall that low to the ground,(it was below the treeline I mentioned above) and if it could why dont I remember any large amount of energy being expended to lift itself out of the stall? One of the questions that really freaks me out is, What are the odds that exactly at the time I saw it was it at that perfect position in the stall that it appeared to me as it was motionless, i.e. Hovering, Why did that pilot canopy and his helmet be so clear to me I mean what about the rest of the plane why cant I rember anything about that, the wings jet engines etc.I do seem to rember everything being black though. As far as hearing it, well I have written that off because of the building I went into to get the tractor and then the noise of the tractor engine. I have looked for other stories similar to this one but can't find any maybe you guys have and that's one of the reasons for wrighting this, maybe someone else has had an experience similar to this. BTW the area I was in at that time is very sparsley populated, the next closest home is a couple of miles away and I believe that they were thinking that no one would be around as I got the feeling at that time that they were just as supprised to see me as I was to see them. Hope to hear back from someone on this. Thanks JD"],"Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Country":"United States"}