{"Tags":"City","Sighting Duration":"Undisclosed","Case Number":"27651","files":["/var/www/straped/mufon/html2text/27651.html.txt","/var/www/straped/mufon/org/27651.html"],"divs":["Sighting DetailsI had woken up at around 7 A.M and was lying in my bed still half asleep until I saw a sudden flash through my curtains. I have seen this flash since, but this was the first time it had happened, consequently I looked out of my window after hastily lifting up the curtain. My eyes were immediately drawn to directly above the opposite houses beyond the garden and end of my road. There seemed to be a bright white light that looked as if it was climbing up in the air, making me originally think it was a plane because they often fly over my house and there can be more than one at any time. I wasn't alerted by it at this point because I was thinking it was a plane, until I realised that I should be hearing the engine noise at that time. I became interested and watched it carefully. It didn't do anything dramatic and it acted very much like a plane. Then another light lit up directly behind it,(there was a gap between them). It was then that I also noticed a plane coming in from my left and I realised the first object's flight path crossed over the plane's. The first object passed right in front of the plane but I'm not sure if they were at the same altitude. Once past the plane, the light went out and I came to the conclusion that it wasn't plane due to the fact I could easily see the outline of the plane from the left and I couldn't see an outline from the light. The second bright light passed just behind the plane before also going out suddenly. During all this I was incredibly intrigued and once they had both gone out I was left with a shock. I haven't seen anything like this before or since. I told a couple family members but they said others would have seen something like that, but I doubt many people would be awake and looking at the skies at 7 in the morning."],"Region":"England","map":"<A HREF = \"http://maps.google.com/maps?q=53.009628,+-2.169854(27651)&iwloc=A&hl=en\"> mufon case (27651) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 8 other sightings in Stoke-on-Trent","There were no other sightings in Stoke-on-Trent on or around May 30th 2008"],"Viewing Distance":"101-500 Feet","Source":"MUFON","City":"Stoke-on-Trent","Log Number":"GB-02042011-0012","Country":"United Kingdom","Object Shape":"Sphere","Summary":"Two bright flying objects","Date of the Event":"05/30/2008 07:10 UTC","Latitude":"53.009628","Disposition":"Unresolved","Object Features":"Unknown","Longitude":"-2.169854","Weather Factors":"None","Date Submitted":"02/04/2011 02:31 UTC"}