{"Date of the Event":"06/19/2010 12:00 UTC","Disposition":"Unknown","Object Flight Path":"Undisclosed","Region":"New York","Source":"MUFON","Summary":"Large, low flying triangluar ufo with, bright light on\" front tip\", and strange opening on the under belly.","Latitude":"41.800621","Country":"United States","Log Number":"US-02042011-0015","Weather Factors":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-73.923867","Tags":"City","City":"Hyde Park","Object Shape":"Triangle","Viewing Distance":"Unknown","Date Submitted":"02/04/2011 08:58 UTC","files":["/var/www/straped/mufon/html2text/27654.html.txt","/var/www/straped/mufon/org/27654.html"],"Case Number":"27654","trends":["There have been 2 other sightings in Hyde Park","There were no other sightings in Hyde Park on or around June 19th 2010"],"divs":["Sighting DetailsI was taking my dog out for a walk, around 10 o'clock(as usual). My driveway is probably 50 yards or so. When I reached mid point of the driveway instantly I had noticed a very bright light at what appeared to be a new flood light atop the neighbors house. After noticing the light I realized the only noise in the neighborhood was the sound of dogs barking. First the dog barking came from further down the road. As the light approached me the dog barking followed. By the time I had reached the end of my driveway the craft was directly above. This ufo was so low even my dog had taken notice. The only sound emitting from this craft was a very low hum. When it was over head I noticed a strange opening on the bottom, and inside looked to be \"red veins\". Normally I would brush this off as some type of airplane but, something just didn't seem right. Even my dog was watching this craft with such intensity. When I had seen the under side for some odd reason my heart dropped. I stood there dumb founded, watching this craft disappear behind the trees."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.800621,+-73.923867(27654)&iwloc=A&hl=en\"> mufon case (27654) map </A>"}