{"Tags":"City","Weather Factors":"None","Longitude":"-75.944094","Disposition":"Insufficient Data","Object Shape":"Circle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27659.html.txt","/var/www/straped/mufon/more/27659_submitter_file1__TotalEclipseoftheMoon2010350.JPG","/var/www/straped/mufon/more/27659_submitter_file2__TotalEclipseoftheMoon2010366.JPG","/var/www/straped/mufon/more/27659_submitter_file3__TotalEclipseoftheMoon2010367.JPG","/var/www/straped/mufon/org/27659.html"],"Summary":"Four bright circles of light appear in photo during moon's eclipse.","Object Features":"Unknown","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around December 21st 2010","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=36.745984,+-75.944094(27659)&iwloc=A&hl=en\"> mufon case (27659) map </A>","City":"Virginia Beach","Viewing Distance":"Unknown","Country":"United States","Date Submitted":"02/04/2011 10:16 UTC","Latitude":"36.745984","Case Number":"27659","Region":"Virginia","Log Number":"US-02042011-0020","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn December 21, 2010 (Winter Solstice) I was taking images as the moon eclipsed. I live in Sandbridge Beach, which is in Virginia's Outer Banks and an isolated area of Virginia Beach. Sandbridge Beach is essentially a five mile sandbar that is attached to the mainland and juts out into the ocean. It is defined by two main roads punctuated by one stop light. It is a thriving beach community in the summer, but very underpopulated in the winter. I am at the end of Sandbridge Beach, just before the Back Bay National Wildlife Refuge. I was very excited about seeing this historic lunear eclipse, as a deserted sandbar is the perfect place to see an eclipse in all its glory. No people, per se. No lights in the direction of the west. And I was alone when I took the images. I took maybe 20 pictures during the (approximately) 1.5 hour eclipse. At last the moon totally eclipsed and Sandbridge Beach was engulfed in pitch black darkness. So I just held the camera steady and clicked away, hoping for the best. It wasn't until I downloaded the images that I noticed one very curious frame. I saw four, fiery circular shapes in one frame. I was clicking clicking instantaneously in succession. Maybe the fiery circles are just flying insects...I don't know. But I'm curious enough to show you the image of the four, oval-shaped objects. What troubles me is that I don't recall seeing ANY lights anywhere at the exact time the moon totally eclipsed. I'm absolutely sure of that. But, on that night, even the air felt surreal. My son said he has spotted multiple UFO's, but he didn't share this with me until recently. I guess he didn't want to scare me. Perhaps he's been seeing IFOs, as Virginia Beach has the sixth largest naval base in the world. On the other hand, we are used to the sound of planes over Sandbridge Beach. On the night of the lunear eclipse, I did not hear ANY noise and I have very sharp hearing. -End"],"Date of the Event":"12/21/2010 12:00 UTC","Object Flight Path":"Unknown"}