{"Sighting Duration":"00:10:00","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.305278,+-68.151944(2766)&iwloc=A&hl=en\"> mufon case (2766) map </A>","divs":["Sighting DetailsOn December 28, 2003 at approximately 2025 hours local, I took our dogs outsidebefore going to bed for the evening. While coming out our door I noticed a tightcluster of lights with a strobe in the western sky. I went inside to get my 8x35binoculars to have a closer look because this didn92t look like normal aircraft running lights.While looking at the object I realized it was actually two tight clusters oflighta larger one on the left and a smaller one immediately to the right. The one onthe right had the strobe. Initially I thought it was a military aircraft with achase plane, but after watching it move, it appeared to be he same object, justilluminated on two different areas of the object.The general direction of flight was north to south from my viewing position atapproximately 20 - 30 degrees above the western horizon. There was very lighthaze outside, but not enough to obscure the stars and the moon. The object madeno sound.Because this aircraft was flying, it changed its position relative to my viewingposition, therefore what I saw also changed. As it flew, the configuration oftwo clusters of lights changed to a triangular configuration, then to a straightline of three lights. A few minutes later it appeared to fly to the southwestand I am assuming directly away from me. The view of the lights at this time was4 or 5 white to yellow-white lights forming a low angle arc. The lights strobedflashed from left to right. There was a haze or aura around it, but I dismissedthis haze due to the general haze in the area. Still no sound was heard. Novapor trails were left. I observed it until the tree lined obscured viewing. Theentire duration was ca.10 minutes. The temperature was 32 F, the barometer was29.783, and the winds were ENE at 3 mph.Our location is directly under the path for commercial aircraft flying to andfrom European destinations, These commercial flights are generally directlyoverhead flying at altitude. Most of these aircraft can be heard and most leavevapor trails. Occasionally we have helicopter traffic performing border patrolduty. The USCanadian border is one mile away. The four nearest airports areEdmundston, New Brunswick, Frenchville, Maine, St. Leonard, New Brunswick, andCaribou, Maine. All are for private aircraft. The last aurora activity we hadwas November 2003. Loring Air Force Base is closed.Rough sketches will be forthcoming.Thank you."],"Date of the Event":"12/28/2003 08:25 UTC","Country":"United States","City":"Grand Isle","Longitude":"-68.151944","Case Number":"2766","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/2766.html.txt","/var/www/straped/mufon/org/2766.html"],"Weather Factors":"Unknown","Tags":"City","Object Features":"Other","trends":["There have been no other sightings in Grand Isle","This sighting has never been favorited."],"Date Submitted":"12/28/2003 08:25 UTC","Latitude":"47.305278","Region":"Maine","Summary":"Silent lights in the sky changing shape and direct","Object Flight Path":"Unknown","Log Number":"","Source":"MUFON","Viewing Distance":"Over One Mile"}