{"Case Number":"27667","trends":["There have been 13 other sightings in Moreno Valley","There were no other sightings in Moreno Valley on or around May 1st 1996"],"Region":"California","files":["/var/www/straped/mufon/html2text/27667.html.txt","/var/www/straped/mufon/org/27667.html"],"Source":"MUFON","Date Submitted":"02/04/2011 11:44 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.952316,+-117.224082(27667)&iwloc=A&hl=en\"> mufon case (27667) map </A>","Country":"United States","Summary":"Triangle shaped object flew over my home with little or no sound, with three steady red lights at each point of triangle. It was huge....the size of a football field.","Log Number":"US-02042011-0027","Disposition":"IFO","Latitude":"33.952316","Object Shape":"Triangle","divs":["Sighting DetailsI believe it was late April or early May of 1996. My husband is a pilot in the Air Force Reserves and he was in Florence, Italy doing support missions for the Bosnian war efforts. Two other wives and I had decided to join our husbands for a short visit, but first we were going to tour Rome for four days prior to taking a train to where our husbands were. I had decided to hire a young college student to housesit for me while out of the country and was in the process of \"interviewing\" her the evening of this particular sighting. I had concluded our interview and was walking her to her car that was parked in my driveway. It was a nice spring evening, lots of stars and lots of lights in the nearby distance of Moreno Valley which was about 7 miles from my home. I should also mention here that this location is approximately 5 miles from March Air Force Base in Southern California. Anyway, as we were saying our goodbyes, movement in the sky to my left caught the corner of my eye and what I saw took my breath away....what I saw was an object enormous in size (the size of a football field)in the shape of a triangle with three red steady lights one at each point, moving very slowly and making no sound that I could detect at first....as it moved overhead, I could detect a \"humming\" sound. This was nothing remotely close to anything we have aviation wise on this planet. I was completely mesermized, as was this young gal. We both saw it and kept our eyes on it as it seemingly \"floated\" over my home towards the hills and mountain range behind my home. It literally blocked out the evening sky and stars as it went over the house. I said to the student, \"You saw that right?\" She confirmed that she did and seemed as unsettled as I was about this sighting. Later when I related this story to my husband, his tendancy was to blow it off as a \"blimp\", a stealth fighter...etc. There was no convincing him otherwise. I eventually gave up trying to convince anyone that this was a real UFO and let it fade into memory. But let me tell you, I was born and raised in the Air Force and have had a love affair with aviation all my life, so when this happened, I KNEW it was out of the ordinary. In the past few years there has been more and more sightings of unusual objects with a lot of media attention paid to these stories instead of being reported as hoaxes. On more than one of these programs other people have witnessed the same type of craft I am describing here. I finally don't feel so alone in this.... I wish I could remember the name of the student I hired to housesit for me, but she did such a horrible job of taking care of my animals and home that I wanted to put her out of mind as soon as possible. This has been cleansing...thank you for providing a means for venting."],"Longitude":"-117.224082","City":"Moreno Valley","Viewing Distance":"101-500 Feet","Date of the Event":"05/01/1996 09:00 UTC","Tags":"City"}