{"divs":["Sighting DetailsThis happen at night and this ufo did same moves 3 nights in a row and move very fast and jimp around. now when i look at I had some other thing to look at to make sure I was not seeing things one night i saw airpane and i know how airpane flys and this did not do what airpane will do and the ufo did the same thing I said it did.next night the same ufo was in the same palce as the night befor now I had a falling star and i keep one eye on the falling star and the ufo and did the same thing as the night be for jumpingand moving around. The last nigth I had slow moving dot in the sky I think this was a sallite. Now this ufo did the same thing so i did the same thing as befor and keep one eye on sallite and ufo and did the same thing as be for. the 4 th night It was gone not be seen any more. at time I was out side TI did very differnt and stars don!t do that at all all it was a dot in the in sky and move arond with dacing around moviement. my feeling was this was some thing that will not do how dos this thing work i have look at thing on nasa and I saw after i saw the ufo a spacecrafe fly in the sky some time after that and i sad must have seen a ufo I keep this info and i can recall what i saw. at time on the 3 nigtsI saw this never lost of this object on 3 nights i saw it."],"Sighting Duration":"Undisclosed","Object Flight Path":"Other","Source":"MUFON","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around June 12th 1997"],"Log Number":"US-02042011-0025","Viewing Distance":"Over One Mile","Latitude":"36.163922","Weather Factors":"Unknown","Summary":"I saw this for 3 nights ina row in same place every time.","City":"Tulsa","Case Number":"27664","Object Features":"Undisclosed","Longitude":"-95.990085","Date Submitted":"02/04/2011 11:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/27664.html.txt","/var/www/straped/mufon/org/27664.html"],"Object Shape":"Star-like","Date of the Event":"06/12/1997 07:03 UTC","Disposition":"Insufficient Data","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=36.163922,+-95.990085(27664)&iwloc=A&hl=en\"> mufon case (27664) map </A>","Country":"United States"}