{"Region":"Arizona","Date of the Event":"08/31/1993 12:00 UTC","Tags":"City","Latitude":"33.419238","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.419238,+-111.541168(27666)&iwloc=A&hl=en\"> mufon case (27666) map </A>","City":"Apache Junction","Source":"MUFON","Case Number":"27666","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was in the backseat of the car, Father was Driving and mother was in passenger seat, one car was in front of us. We were heading home from Apache Junction Arizona toward Phoenix on Route 60 around the Tomahawk Rd. Exit. All the exits ahead have an overpass, with a ramp coming down to the highway, I said to my dad, look at that truck coming toward us , it has 3 headlights. It looked as if it was coming down to the highway from an overpass, but as soon as i said that it \"with lack of a better term\" shot stright up and toward our car. It was Floating about 100 yards in front, and about 30-40 feet above our car..We were traveling about 70mph at the time.It then \"swooped over our car back and forth: from front to back of our sight:, it then went to the left of us, and was weaving back and forth between the light poles on the side of the road at the same exact speed of our car. It then again swooped up and was floating in front of the car, flew back and forth over the car a few more times and then shot out of our sight to the south into the desert. All this took abywhere from 2 to 4 minutes. My father and I were completely baffled by what we saw, and my mother was very frightened and crying. When the craft was \"swooping, it was making 90 degree turns, and complete 180 stops and starts with a precision i have never seen. It would take off with a speed that i know without a doubt no technology we have will do. Its size is hard to say, If i had to compare, i would say it was about the size of a small 2 seater plane. I could not see the structure. There was 3 lights and they were too bright to see a structure. I can say beyond a shadow of a doubt that what we saw was unlike anything i have ever seen, and moved like nothing i have ever seen. Its hard to explain in writing with good detail, but hopefully this was a good explaination. Ive wanted all these years to report this and have not ever known anywhere to do it until i found out about this site through some reserach. Thank you and i hope someday i could know what we saw."],"trends":["There have been 16 other sightings in Apache Junction","There were no other sightings in Apache Junction on or around August 31st 1993"],"Object Features":"Undisclosed","Disposition":"Insufficient Data","Longitude":"-111.541168","Summary":"3 bright lights about 40 feet above us on the highway pacing our car","Date Submitted":"02/04/2011 11:37 UTC","Log Number":"US-02042011-0026","Viewing Distance":"Unknown","Object Shape":"Triangle","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/27666.html.txt","/var/www/straped/mufon/org/27666.html"],"Weather Factors":"Unknown"}