{"Latitude":"36.33471","Summary":"Big Black Blimp","Date Submitted":"02/04/2011 11:06 UTC","trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around September 30th 2008"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"27665","Object Shape":"Blimp, Triangle","Longitude":"-94.117377","Object Features":"Undisclosed","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Region":"Arkansas","divs":["Sighting Details I was chilling with a friend actually talking about UFO's when out of the corner of my eye I notice a very large object moving very slowly maybe 200 feet off the ground just cruising over Walnut, which is one of the main roads that runs through Rogers. My friend is a non believer and upon seeing this turned and went inside and refused to come out until it was gone. I was at a loss because I know what it resembled but it was dark and I could not make out the edges clearly because the color was either black or reflective and it reflected the night sky giving it a black appearance. But I could tell that it was triangular in shape because I saw its rear and it had four huge lights that glowed orange kind of like a jet turban. I had seen pictures of an aircraft that is rather large known as the stealth blimp. At the same time though this craft was a good deal larger than the descriptions I have read about the stealth blimp but I do not dismiss the idea that it was not. The object moved slow enough to be a blimp and seemed to be just cruising. I watched it for about three to four minutes when I lost site of it due to obstructions in town. It appeared to be as large as a super center parking lot and maybe four stories in height. my feelings on the subject was and still is indifferent, I know what I saw but I could not say with out conviction that it was absolutely not of this world. I had no camera except for my telephone and it was useless at night. my only witness to the event refused to stay and witness it. I know not if it was observed by anyone else but I did see a couple of car that was diving down walnut continue driving like nothing was there and passed right underneath it. this was also a way to get a reference of its size. When the whole craft came into view and a car drove under it at the speed limit of 35 mph it too a couple of seconds to be clear of it, I counted 2 and almost 3 seconds and at 52 feet a second I gathered it to be approximately 300 feet long give or take a few."],"Country":"United States","files":["/var/www/straped/mufon/html2text/27665.html.txt","/var/www/straped/mufon/org/27665.html"],"Source":"MUFON","Tags":"City","Weather Factors":"Unknown","Log Number":"US-02042011-0026","map":"<A HREF = \"http://maps.google.com/maps?q=36.33471,+-94.117377(27665)&iwloc=A&hl=en\"> mufon case (27665) map </A>","City":"Rogers","Date of the Event":"09/30/2008 12:00 UTC"}