{"Weather Factors":"Unknown","Disposition":"Unresolved","Longitude":"-122.024706","Region":"California","Date Submitted":"02/05/2011 12:01 UTC","City":"Santa Cruz","Source":"MUFON","Tags":"City","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around July 18th 1976"],"Object Shape":"Sphere","Latitude":"36.980427","Object Flight Path":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/27669.html.txt","/var/www/straped/mufon/org/27669.html"],"Case Number":"27669","Summary":"amber ball came from ocean and stopped in front of us","Date of the Event":"07/18/1976 01:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.980427,+-122.024706(27669)&iwloc=A&hl=en\"> mufon case (27669) map </A>","Log Number":"US-02052011-0001","divs":["Sighting DetailsWorking swing shift and living in Boulder Creek, Ca we would comute on Skyline Bldv. around 12:30-2:00AM (the mountain ridge that divides all of south bay area from the ocean)to back home from Redwood City,Ca.wher we worked. Around Palo Alto county on top of the mountain one can see both the bay area lit up at night (on the left side driving south) and the beach and ocean on the right. Very few people if any comuted that far from the bay area at that time. Around 1:00AM on the ridge, we saw a large amber ball of light that came out of the Pacific ocean at Pescadero Beach, Ca north of Santa Cruz. It was a very clear night and could see the beach and waves (about 10 miles west from the road which is about 1,200' above sea level) I told my partner to pull over in a turn out (he was scared), and he would not. So I reached over and took the keys out of the ignition to turn off the engine, and so he had to pulled over, and we stopped with the front lights on. I jumped out of the car (1972 Toyota Landcruiser with a large spot light on top of the roof) excitedly waving my arms and jumping up and down to see what would happen as it moved closer to us and got larger and larger. My partner would not get out of the car and wanted to continue to go home. The amber large ball of light stopped in front of us with no sound (about 1,400-1,600' above see level and about 100 yards from us on the west side of the ridge (ocean side). I went to the car and jokingly ask my partner if we wanted to invite them for dinner. He said \"let's go home\". I decided to use the spot light on top of the roof and signal the object with an SOS code ...---... of light. At a complete stand still in front of us it responded by moving up and down, side to side, diagonally then came back to the same position (with no sound whatsoever) I repeated the signal many time (about for 20 minutes) and this large amber ball of light would respon to me with the same manuvers each time. Then within a second it took off straight up leaving a com trail (no sound) out of sight. That mourning I called the San Jose Mercury to ask some questions to a \"Betty Barnicle\" that would do reports of these things. I asked her if anything happened that night, and she said there was a sighting and descibed the same strange object (large amber ball of light) aound the same time (I never told or described what we saw). She said the report of this same object was in Pheonix, Ar. My question is what is in the ocean at Pescadero Beach that is incompasse by the deep Monterey Bay. I have a couple more incidences happening that same month if you would like to contact me. Most people I have written to say that is too old of a story or don't answer me. I flew every night in Vietnam in a OV-1 Mohawk for a year, and I know air craft, because I was stationed at Hollowman Air Force Base and would track US experimental air craft and could not reveal that until 10 years later. I also knew the flight patterns of commercial air craft would go to San Jose and SF airports. This is a true but brief statements."],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed"}