{"Region":"Michigan","Object Flight Path":"Stationary","Latitude":"42.337967","Summary":"I saw a strange light in the sky and took a couple of photos of it.","Object Features":"Unknown","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around February 3rd 2011","This sighting has never been favorited.",""],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02042011-0022","Weather Factors":"None","Longitude":"-83.041524","Case Number":"27661","City":"Detroit","map":"<A HREF = \"http://maps.google.com/maps?q=42.337967,+-83.041524(27661)&iwloc=A&hl=en\"> mufon case (27661) map </A>","Disposition":"Unknown","Source":"MUFON","Date of the Event":"02/03/2011 07:07 UTC","Sighting Duration":"Undisclosed","Object Shape":"Oval, Sphere","Date Submitted":"02/04/2011 10:35 UTC","divs":["sighting detailsi live in a house on the detroit river across from winsor, ontario. i woke up at about 7 am on the morning of 2\\3\\11. i got up to take the trash out to the end of the driveway. i went downstairs and took the trash out, it was still rather dark and very quiet outside. i came back upstairs to get back in the bed. on my way past the windows that look out over the detroit river, i noticed a very bright light in the sky. the light was on the canadian side of the river. it was so bright that i stopped to watch it to see if it was an airplane coming from winsor, canada. there were no navigation lights and i didn't hear any engine noise. i also looked up to see if there were any stars visible and i couldn't see any. the strange light didn't move, it just sat there and was very white with a silver edge on the right side. i still thought it might be an airplane, but i knew that airplanes don't typically fly over that early. it looked like a sphere, but i could see that it was somewhat oval. it seemed that the brightness obscured the actual shape, the clearest view was on the right side of the light. i was so sleepy that i decided to take a couple photos of it and get back in the bed. after i got in the bed, i listened to see if i could hear or see (through the sky light) an airplane fly over the house, but i didn't hear or see anything over the next few minutes. i went back to sleep. during the years that i've lived here, i've never seen any light like this in the sky during the morning hours. it didn't flicker like a star and it didn't fluctuate like an airplane light. this light was very still and extreemly bright. i don't know what it was but, it's bothered me ever since i saw it. i hope i never see it again!"],"files":["/var/www/straped/mufon/html2text/27661.html.txt","/var/www/straped/mufon/more/27661_submitter_file1__050.JPG","/var/www/straped/mufon/more/27661_submitter_file2__051.JPG","/var/www/straped/mufon/org/27661.html"],"Country":"United States"}