{"Source":"MUFON","Summary":"noticed peculiar cloud formations....took 2 pics","map":"<A HREF = \"http://maps.google.com/maps?q=33.42761,+-111.932265(27663)&iwloc=A&hl=en\"> mufon case (27663) map </A>","Disposition":"Insufficient Data","divs":["Sighting DetailsPunched out where i work to take my lunch break,as is my custom i drove to the south end of our complex to eat in peace. i was parked facing due north. As i was eating i noticed very strange, peculiar cloud formations, as if some of the clouds were forming vertical tubes that flared out at the bottom. I got my cell phone and took 2 pics. The first has nothing in it, the second has what my wife thinks is a helicopter. I would swear that there was nothing in the sky that day except the clouds i was taking a picture of. I would have seen this as i was standing by my truck taking the picture looking up at these clouds....there was no helicopter in sight. to see whatever this is on the 2nd pic look at the top left of the pic. i had to zoom in 400% to get a good look at it. I heard no engine noise, it must have have been at medium altitude,(10,000..15,000 feet?)it almost looks like it has camo paint, i don't know what this is, if it is a helicopter then so be it, if not you decide. thank you"],"Longitude":"-111.932265","Date of the Event":"03/15/2010 03:00 UTC","Tags":"City","Object Shape":"Cigar, Cylinder","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around March 15th 2010","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","Region":"Arizona","Weather Factors":"Does Not Apply","Date Submitted":"02/04/2011 10:54 UTC","Viewing Distance":"Unknown","Case Number":"27663","Latitude":"33.42761","Object Features":"Unknown","City":"Tempe","Log Number":"US-02042011-0024","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/27663.html.txt","/var/www/straped/mufon/more/27663_submitter_file1__0125001251.jpg","/var/www/straped/mufon/more/27663_submitter_file2__0125001251a.jpg","/var/www/straped/mufon/org/27663.html"]}