{"Summary":"There's a light in the sky that has been there MOST nights since the end of Dec. 2010","Latitude":"36.117576","Viewing Distance":"Over One Mile","Country":"United States","Region":"Nevada","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 27th 2010"],"Date Submitted":"02/05/2011 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.117576,+-115.170496(27674)&iwloc=A&hl=en\"> mufon case (27674) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/27674.html.txt","/var/www/straped/mufon/org/27674.html"],"Case Number":"27674","Object Shape":"Star-like","Object Features":"Undisclosed","City":"Las Vegas","Date of the Event":"12/27/2010 12:00 UTC","Source":"MUFON","Disposition":"Hoax","Weather Factors":"Unknown","Log Number":"US-02052011-0006","Longitude":"-115.170496","divs":["Sighting Details I watched your show for the first time tonight. There was a man that said, these things can last seconds to months and it's important to report it because you never know when it's going to be gone. That inspired me to make this report. My wife came to me the begining of Jan. this year. She works the graveyard shift at a world class hotel. She was telling me about this light she keeps seeing when she gets home in the morning. She gets home around 4:30 am. It's still very dark out. The sun has not yet begun to come up. We have had a sighting together before so when she came to me, I took her very serious. On one of her nights off about three weeks ago, we stayed up real late together and deciceded to go take a look. Sure enough, it was there. At first glance it looks like a star. A bright star sitting exceptionally low in the sky. Almost as if it's a light on the mountain line in the backround but, it's not. It's above the mountain line. When I saw it I thought, \"after what we've seen in the past why would she be so adimant about this?\" I went in the house and got my bionoculars. Got it lined up and realized this thing was changing shape and color. It was moving really slow. The thing that got me was when we went in the house to get the bionoculars by the time we got back it had jumped in the sky an unreal distance. We were inside for mabey 3 min and had come back out to find that it had moved so far to the south and had raised up. Gotten much higher. It was incredible. I don't have anything to see this thing up close. My bionoculars aren't the best but this has to be some kind of oddity. It's not there every night. It's not in the same spot every night. It's always in the same area but never the same spot so I know it's not a star. I know it's not a backround light. I can't identify this thing and would like your help figuring this out. I didn't believe in this stuff until about a year and a half ago. My wife and were leaving a friends house at ten o'clock pm here in Las Vegas. We had our children and put them in the car to go home. As I was getting in the car we saw these ufo's coming over the hilltop. Looked like something out of Independence day film. They were so low to the mountain I couldn't believe my eyes. Yhey started about 50 yards to my left, coming over the hill at maybey 15mph. Not fast at all. I quickly grabbed my flashlight and started flashing them. One by one they came over the hill and the more that came over, the closer they got. By that I mean the 50 yards to the left was getting smaller and smaller. They were lining up with us. By the time they were inline with us one of them stopped over my car. It shined the scarriest, brightest light over our car. It was undescribeable. I just don't have the words. They were all completely silent. Not a sound. Absoloutely nothing. The ufo slowly took off after shutting the light off. I decided to follow it. We followed these things for about 20 miles into a residential area near Henderson NV. I know what i'm saying sounds crazy but because of this, i'm a believer. My wife can confirm everything that I have said. She was with me for both these \"events\". I know i'm not crazy and I know these things are here. I just need your help to prove it. I appreciate your time and look forward to hearing from you guys. Thank you."],"Sighting Duration":"Undisclosed","Object Flight Path":"Other"}