{"Object Shape":"Fireball","Disposition":"Unknown","Case Number":"27671","Log Number":"US-02052011-0003","Object Features":"Undisclosed","Country":"United States","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/27671.html.txt","/var/www/straped/mufon/org/27671.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.265082,+-81.17769(27671)&iwloc=A&hl=en\"> mufon case (27671) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"08/30/2007 09:00 UTC","Latitude":"35.265082","Viewing Distance":"Unknown","Longitude":"-81.17769","Summary":"like a comet; but going wrong direction and then left a vapor trail back up","Source":"MUFON","Tags":"City","Weather Factors":"None","Region":"North Carolina","City":"Gastonia","trends":["There have been 8 other sightings in Gastonia","There were no other sightings in Gastonia on or around August 30th 2007"],"Date Submitted":"02/05/2011 01:16 UTC","divs":["Sighting Details My husband and I put our daughter to bed and went back out to my car in the driveway. We left groceries in the trunk from earlier shopping that day. My husband was in front of me and he shut the trunk and all of a sudden there was a bright, white fire ball comming down from the dark sky. My husband said that the look on my face was so shocked that he looked up too. The fire ball stood still and then took off real fast in the opposite direction. It left a vapor trail of smoke .I was real \"skeptical\" of \"UFO's\" in the past. Trust me, after that experience I am able to admit that there is no known explanation for what we both saw.I was fearful too after that. I kept thinking a lot about it and wondered if we would ever see it again. We joked between us about it. I use to say things when we woke up in the morning like, \"did ya get abducted last night?\" We laugh about it now; but we both were shocked that night and will never forget it. We also have a lot more respect for people who admit they have seen UFO's as well. What ever this was; was completely silent. Maybe this is a stupid question, but why did it stop when we looked up and be still for a second or two? Did it know we saw it? It went so fast out of sight that we lost sight within a second or two. The light was so bright."]}