{"Longitude":"-87.620028","trends":["There have been 221 other sightings in Chicago","There were 2 other sightings in Chicago on or around January 16th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Summary":"SEARCH YOU TUBE FOR \"UFO DEPARTURE\"","map":"<A HREF = \"http://maps.google.com/maps?q=41.881504,+-87.620028(27677)&iwloc=A&hl=en\"> mufon case (27677) map </A>","Log Number":"US-02052011-0009","Case Number":"27677","City":"Chicago","Object Shape":"Diamond, Disc, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/27677.html.txt","/var/www/straped/mufon/org/27677.html"],"Country":"United States","Source":"MUFON","Region":"Illinois","Date Submitted":"02/05/2011 07:06 UTC","Tags":"City","divs":["Sighting DetailsWATCH THE VIDEO AND READ THE DESCRIPTION. SEARCH YOU TUBE FOR \"UFO DEPARTURE\". Update on Jan. 16th, 2011 sighting. There have been only 6 or 7 clear days since then. I checked this area of the sky every single morning since then...and THERE WAS NOTHING UP THERE. IT WAS EMPTY IN THAT ENTIRE AREA. Video description: IT MOVES SLOWLY SOUTH and you can tell the camera is still and I am not talking about the clouds moving by, either. Place your cursor in the middle of the screen as a reference...this thing is moving, South...toward NORRIDGE. Watch from 4:37 to 4:45 to see points of reference...etc. I zoomed back out...then zoomed back in. This is EXACTLY why I kept filming (Jan. 16th, 2011). I picked up on a 2nd camera, (in standard definition) when my card ran out of room on the other (HD) camera. There is no glass or screen in front of me, so no it is not a reflection, either. It is not Venus or a satellite, because in the clear days since then...it would have been around the same area from 5:00 am to 7:00 am. There is absolutely nothing up there. I actually filmed the UFO for a total of 94 minutes. I wanted to catch it LEAVING...or VANISHING INTO THIN AIR on film. MY CAMERA WAS adjusted a few times, but still and STATIONARY ON A MINI TRIPOD...you can totally see when I adjust the camera a few times, but for the most part...I left the camera alone the last 25 MINUTES OF FILMING THIS THING. YET...you can see the craft MOVE across your screen (SOUTH) and you can see it slowly moving UPWARD and a bit higher in altitude. It flies into cloud cover and out of view. Just fades away. See other videos under \"UFO In HD\", FEEL FREE TO DOWNLOAD ANY OF THESE FILES AND FEEL FREE TO THROUGH RIGOROUS TESTING. I DID NOT TOUCH ANY OF MY FILES AND I STAND BY THEM (UNLIKE THE PEOPLE WHO FILMED THE UFO IN JERUSALEM.) WHERE ARE THEY? NONE OF THE people who uploaded any of those videos WILL ANSWER ANY QUESTIONS ON YOU TUBE. The burden of proof is on the person who shot the film. Period. Not only do I stand by mine, but I promise to get it much closer on film next time. I have had 2 close encounters that you can find in the MUFON database. This thing was close enough to see details and was without question...under intelligent control. It was either experimental or extraterrestrial."],"Object Features":"Undisclosed","Sighting Duration":"01:34:00","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date of the Event":"01/16/2011 05:11 UTC","Disposition":"Hoax","Latitude":"41.881504"}