{"Sighting Duration":"Undisclosed","Latitude":"32.41562","Summary":"Something caught my peripheral ,there it was hovering,grabbed my cell phone and snapped a shot","Case Number":"27679","Viewing Distance":"101-500 Feet","Country":"United States","files":["/var/www/straped/mufon/html2text/27679.html.txt","/var/www/straped/mufon/more/27679_submitter_file1__UFO2701fm603JAN232011.jpg","/var/www/straped/mufon/org/27679.html"],"Source":"MUFON","Date of the Event":"01/23/2011 06:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.41562,+-99.484291(27679)&iwloc=A&hl=en\"> mufon case (27679) map </A>","Date Submitted":"02/05/2011 01:20 UTC","trends":["There have been 4 other sightings in Clyde","There was one other sighting in Clyde on or around January 23rd 2011","This sighting has never been favorited.",""],"Log Number":"US-02052011-0011","Object Shape":"Disc","City":"Clyde","Object Flight Path":"Stationary","Disposition":"Hoax","Region":"Texas","Object Features":"Patterned Surface","Longitude":"-99.484291","Weather Factors":"None","divs":["Sighting DetailsI was in Clyde, wiping down my truck, when something caught the corner of my eye. I turned and saw this unusual shaped thing hovering over the power lines... I reached for my cell phone and snapped a picture of it. The craft was there for what felt like an eternity, but was approximately a minute. its lower edges pulsed and glowed white. It was completely silent but the strange thing about it was I could almost feel it's presence. It is hard for me to explain, almost like touching a 9Volt battery to your tongue but milder and throughout the body. Almost made me lose balance... As i stared at whatever that was, it just vanished, I mean, it just disappeared... No sound, no trail, no sonic boom, no visual distortions... I do realize that I live close to an AFB . and I know they do some top secret stuff there, but this what I saw would not be part of our Human weapons arsenal. To move the way that thing did, no chance a human could handle the shock without instant death. aftermath: felt a bit euphoric i guess or it was the excitement of seeing something out of the ordinary... Let's not kid ourselves people... We are not alone. I was there with my friend who wishes to remain anonymous, for fear of being ridiculed . I am just sending you this photo in hopes that you can figure out what it is i got a picture of. I wish to remain anonymous but feel free to ask me questions if you should need. I am a big fan of your work. Expose the truth !"]}