{"Longitude":"-81.018208","files":["/var/www/straped/mufon/html2text/27686.html.txt","/var/www/straped/mufon/org/27686.html"],"Object Flight Path":"Stationary,Straight-line path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.934467,+-81.018208(27686)&iwloc=A&hl=en\"> mufon case (27686) map </A>","trends":["There have been 5 other sightings in Rock Hill","There were no other sightings in Rock Hill on or around September 14th 2010"],"Region":"South Carolina","Object Features":"Window(s), Patterned Surface","Source":"MUFON","Object Shape":"Flash, Unknown","Log Number":"US-02052011-0017","Date of the Event":"09/14/2010 07:15 UTC","Latitude":"34.934467","Weather Factors":"None","Date Submitted":"02/05/2011 09:43 UTC","Tags":"City","Country":"United States","divs":["Sighting DetailsWell i can start by tellin you my story... Ever since i was a child i have always been different. I used to see alot of things that was unexplained. On september of last year, i started seeing strange lights every single day. You see i love working out and hiking so i go jogging everyday at 7 o'clock with my dog and the next hour by myself. But everyday i saw these lights that were just amazing and so beautiful and they hung high and sometimes low in the sky. Some are flashing lights and some flash but will be still in the sky, way different than helicopter lights and plane lights. To ensure myself that i wasn't seeing things, one night when i was out jogging with my dog i called my friend and told her to step outside to see one of the lights this one was this huge white light it was kind of steady but it still flashed on and off. When i called her and she stepped out side as soon as i asked her if she saw it the light went in another direction! She saw it too and was amazed! Also i had two other people see it and they too were shocked and amazed sometimes there will be dozens of these lights spread out in the sky. A couple of weeks after i started seeing the lights, i saw a beautiful memorizing craft. Again i was out walking my dog, and everytime i go walking or jogging i listen to music. Well this night was a dark night and everything was so still and calm and i didn't notice this at the time but there was barely any cars going by in my neighborhood at all. So every house in my neighborhood have trees in the yards, and the houses are really tall and wide. So i'm walking and i see this white light coming from behind this house and one of the trees and it was VERY low so i freaked out because i thought a plane or something was about to crash (that's how low it was). So i took a couple of steps back and as it came across this craft was so long and the front was like no other i've ever seen before and the side was almost like a very distinctive check mark and the lights were these pretty blue lights and it was flying soooooo low, and barely made a sound, also the window of the front was very dark so i couldn't see inside. I wanted to get my phone out and take a video but something wouldn't let me do it. On down the road trying to get home i ran into my friend going in his house from practice and i asked if he could walk me home soo he did. But we ended up going jogging for a mile after we dropped off my dog and way off in the distance i saw the craft again! And he did too but it was far off in the distance. Til this day i still see the lights off and on. I have a great nikon camera but it sucks cause it doesn't have night vision the guy from national ufo center wanted me to seen a video. But every sense then i had some strange dreams about what i saw and about people after me. About two weeks ago, woke up to this TERRIBLE back ache and i was just soo sick it was just so random for it to happen and then next day i was fine. I really don't know what to make of this at all. I really need help. This has just happen but in the past TWO NIGHTS not counting yesterday i saw three shooting stars. A couple of days ago my friend and eye wanted to go start gazing and see if we could catch something in the woods, and he too saw the strange lights and not only that but this small light appeared to drop out the sky and into the woods that i can not explain. Again i still til this day see strange lights and things in the sky, i'm being honest and truthful i just need help, please. Thank You."],"Summary":"Flashing lights that shift in the sky and A strange huge object.","Disposition":"Unknown","Viewing Distance":"20 Feet or Less, Unknown","Case Number":"27686","City":"Rock Hill"}