{"Longitude":"-73.294197","Weather Factors":"None","trends":["There has been one other sighting in Easton","There were no other sightings in Easton on or around July 31st 1989"],"files":["/var/www/straped/mufon/html2text/27683.html.txt","/var/www/straped/mufon/org/27683.html"],"Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"08/07/2011 12:08 UTC","Log Number":"US-08072011-0039","Date of the Event":"07/31/1989 11:05 UTC","Latitude":"41.315104","Object Flight Path":"Straight-line path","Summary":"Flyover","Object Features":"None","Object Shape":"Chevron","divs":["Sighting DetailsLiving in Danbury CT at the time & working at Sikorsky Aircraft in Stratford CT (where I'm still employed). I've worked third shift since 1984. My dad is a pilot, Ive flown many hours with him in GA aircraft & have many airline miles under my belt. I'm an A&P mechanic & have worked on everything from light aircraft to business jets apart from my full time job at Sikorsky. At Sikorsky I work on all the Hawk series (Army & Navy), S76, S92, CH53E, MH53E. Ive been in aviation all my life & I know how aircraft look & sound in flight. One night on the way to work going down RT 25 thru Trumbull & Monroe there is a section of road that changes from a two lane to a divided highway & also crosses Rt 111. There is a stoplight there before you get on to the highway part of Rt 25 heading south. As I was stopped at the light heading south I noticed in the distance bright white lights. Initially I thought it was an airliner low & slow which at the time would be very unusual. It was big. After proceeding thru the light the highway bends to the right a bit & as I rounded the curve I saw several cars pulled over & people out of their cars. It took me a couple of seconds to realize they were watching this object I thought was an airliner. As I was slowing down trying to watch this object in the sky & watch where I was going, I realized this was not any kind of normal aircraft. I pulled over & got out & as I watched closely I saw seven clusters of lights. Red green & white in a chevron or boomerang pattern. At this time (late 80's) there had been rumors of ultralights flying at night trying to look like ufos & spook people. I thought maybe thats what it was since I realized it was flying too slow to be any kind of large aircraft. As it got closer I kept waiting to hear noise, jet noise, recip noise, wind thru the wires type of noise. Nothing, totally silent. As it passed overhead ( approx 1000 ft) I would say the span was approx 200 -300 ft. Thats when I really got scared. The weather was hot & humid at the time but you could see the stars. As the object passed overhead (still totally silent) it blocked out the stars & you could see a solid shape. This was not any formation flight of ultralights or small airplanes, this was big & silent. I think thats the only time in my life when I felt the hair on the back of my neck go up. It was moving a little faster than the northbound traffic on the other side of the highway maybe 70 -90 mph. As we watched it just slowly continued north until it was out of sight. I want to say some people had called in to the local radio station (WICC Bridgeport) but I dont remember for sure. Well, thats what I saw & thats the only one Ive ever seen. I always thought it would be fantastic to meet ET's or whatever but this experience scared me. It was a very strange thought provoking experience..."],"Region":"Connecticut","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.315104,+-73.294197(27683)&iwloc=A&hl=en\"> mufon case (27683) map </A>","Source":"MUFON","City":"Easton","Case Number":"27683"}