{"Country":"United States","Disposition":"Hoax","Object Flight Path":"Undisclosed","Longitude":"-77.858091","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.795805,+-77.858091(27699)&iwloc=A&hl=en\"> mufon case (27699) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27699.html.txt","/var/www/straped/mufon/org/27699.html"],"trends":["There have been 10 other sightings in State College","There were no other sightings in State College on or around February 6th 2011"],"Date of the Event":"02/06/2011 03:10 UTC","Summary":"UFO Flying Very Low over Residential Areas","Tags":"City","Object Shape":"Chevron","Weather Factors":"Unknown","City":"State College","Region":"Pennsylvania","Date Submitted":"02/06/2011 04:43 UTC","Latitude":"40.795805","divs":["sighting detailsas my friends, redacted, redacted, redacted, and *(name deleted--cms\\sg) were walking to a party late at night, we heard some strange high pitched whirring noises. the air was cold, and it was a long walk until the party, but we did not think anything of it, so we kept our heads down, and our minds on the party. it was going to be an awesome party, and it turned out it was. it was a communist themed party, and it was a three dollar cover, unless we dressed as communists. we were not informed of this detail beforehand, so we ended up paying the three dollar cover, which was low considering the amount of live bands they had. as we got onto the street of the party, the whirring noise came back, and was louder, but nothing was going to deter us from going inside of the party, so we went into the party. music was blaring from the basement, and there were tons of hipsters and cool people there. if you were wondering what a hipster is, it is a person who wears black rimmed glasses and likes offbeat stuff. so we made our way into the kitchen, and i met my friend **(name deleted--cms\\sg) and she was really quiet. she wasn't really into the party, and i get it, that type of party is not many people's scene. but we were trying to enjoy the party, so all of us went downstairs into the basement, and listened to some really cool bands. after about half an hour, we were looking for a drink, and we noticed that the party was bring your own beer, so we all ventured out of the house to the nearest liquor store. on the way back from the liquor store with boxes of beer and some 40 ounce alcohol containers, we heard the whirring noise, and what sounded like an engine from overhead. but we had so much alcohol on us, that we completely ignored it and went back inside of the party. after listening to some more bands, and drinking some more beer, our friends band was on, and they were great. they played a cover of the who's, \"baba o'riley,\" which i mistakenly thought was called teenage wasteland. my friend quickly corrected me, saying that it was baba o'riley, and i had an epiphany, and was like, \"oh, yeah, you're right.\" it was really hot, so me and my friend **(name deleted--cms\\sg) went outside for some cigarettes. while standing on the porch, we saw a flash of light moving really fast over the trees, and **(name deleted--cms\\sg)said to me, \"that was really strange,\" to which i agreed. then, we went back inside of the party, because it was a really great party. so then, there was some sort of dance off going on in the basement, and everyone was banging on the walls and ceilings, and our friend, redacted, came in 5th place, which was a lot of fun and there are pictures of it on facebook if you want to see. afterwards, we decided that we would leave the party, and go back to my place to have a drink. so all of us were walking on the street, when a chevron shaped objected flew over our heads, and we noticed it was a ufo. and it was."],"Object Features":"Undisclosed","Sighting Duration":"01:10:00","Log Number":"US-02062011-0008","Case Number":"27699"}