{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/27708.html.txt","/var/www/straped/mufon/more/27708_submitter_file1__DSC03094.JPG","/var/www/straped/mufon/more/27708_submitter_file2__DSC03094d.jpg","/var/www/straped/mufon/org/27708.html"],"Weather Factors":"None","trends":["There has been one other sighting in Cromer","There were no other sightings in Cromer on or around September 16th 2004","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was at my annual visit to the Kelling Heath Star Party. Yes, I am an amateur astronomer. I specialise in visual astronomy. I spend more time looking at the sky and looking through telescopes. The event is held at the Kelling Heath Camping and Caravan Park. The location is ideal for the hobby, as it provides very dark skies- weather permitting. The star party is also known as the Equinox Star Party. It is one of many events held in the UK.I had made this trip with my wife and two yound children aged 3 and 2 years of age. I recall waking early (around 8am) since I had been awake late observing the previous night. Having made a coffee, I was about to stroll to see who else was up. I always carry my camera around with me at camp. I was just admiring the lovely pristine clear skies and hoping it would give us another clear night of observing. When, I noticed the object in the sky. At first I thought, it might be a helium ballon (for birthdays) or an advertising balloon. But, it was just hanging in the sky motionless and quite. I immediately aimed my Sony F717 dsc camera and took a shot. I looked at the image in the lcd screen, zoomed in to check it was captured and it was. I the looked at the object again to frame it. I may have looked at it for no more than 2 seconds, when it dissappeared at the blink of an eye. I could not fathom what it could have been. I was totally stunned and just stood there for a good 30 seconds, in case it came back. I was not scared in any way. Just curious. I mentioned it to another astronomer and showed him the picture. He just laughed at me warned me to be careful at night, in case it came back for me. Of course, it never came back. Of course having a more science back ground from my hobby about the universe than joe public, I do believe there is a high probabality of Extra Terrestrials. When I am out under the cover of a starry night, I do see a lot of strangely behaving lights, but these are all logically explained ie. satellites, meteors, birds, weather phenomenons ets. But, my event is not like the ordinary one I come across. I have good knowledge of telescopes, cameras and weather variables. I truely think this experience is a rare one. Would I like to experience another one, not so sure."],"Tags":"City","Country":"United Kingdom","Viewing Distance":"Unknown","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=52.937588,+1.308066(27708)&iwloc=A&hl=en\"> mufon case (27708) map </A>","Log Number":"GB-02072011-0002","Case Number":"27708","City":"Cromer","Region":"England","Date of the Event":"09/16/2004 08:38 UTC","Sighting Duration":"Undisclosed","Longitude":"1.308066","Disposition":"Unresolved","Summary":"whilst walking at campsite, noticed an object in the sky. It was very still. No sound. There was no movement. I observed it for around 10 seconds. Managed to photographed it. It literally dissappeared, at the blink of an eye.","Object Features":"Unknown","Latitude":"52.937588","Object Shape":"Oval, Saturn-like","Date Submitted":"02/07/2011 02:41 UTC"}