{"trends":["There have been 106 other sightings in San Jose","There was one other sighting in San Jose on or around February 6th 2011"],"Sighting Duration":"00:30:00","Date Submitted":"02/07/2011 03:48 UTC","Region":"California","Source":"MUFON","Object Flight Path":"Hovering then path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.303437,+-121.936099(27709)&iwloc=A&hl=en\"> mufon case (27709) map </A>","Longitude":"-121.936099","Summary":"It came back again! Welcome Back!","Date of the Event":"02/06/2011 10:45 UTC","Latitude":"37.303437","Case Number":"27709","Tags":"City","Country":"United States","Log Number":"US-02072011-0003","divs":["Sighting DetailsHere I am, once again reporting another sighting. This time, it was not seen through my telescope (it kept moving in and out of the tree line, and my line of sight). Anyway, it was above what looked like the area above Cambrian Plaza. So it was a star-like object but lower than a star, hovering and moving a bit left, right, up, and down slowly. It was at about 45 degree angle at my view point from my back patio. It appeared to be the size of a pencil eraser top, and was illuminating red, blue, and white. It wasn't so much as \"flashing\", but more like one of those lights that doesn't flash, but slowly changes into another color. That's what this one was doing, but really fast. I watched it from 22:45 hrs, till 23:15 hrs. It kept moving like I said, but in a hovering fashion. I gave up and debated if I was going to put in a report, but decided to because there was no way this was a plane, chopper, or anything explanable. The sky had some thin clouds, but in the area of the object, it was crystal clear. It appeared to me to be at about 600-700 feet above ground, and I was unable to determine any sound from it. During the time that I was observing this, there were no planes, choppers, or any other items in the sky in the area. Very odd since all week the objects have had planes and choppers hanging around close by."],"City":"San Jose","Weather Factors":"None","Object Shape":"Star-like","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/27709.html.txt","/var/www/straped/mufon/org/27709.html"],"Object Features":"None"}