{"Object Features":"Undisclosed","Tags":"City","Object Shape":"Flash, Sphere","City":"Belfast","Object Flight Path":"Undisclosed","Longitude":"-5.926268","Region":"Northern Ireland","trends":["There have been 5 other sightings in Belfast","There were no other sightings in Belfast on or around February 2nd 2011"],"Date Submitted":"02/07/2011 05:24 UTC","Disposition":"Unresolved","Country":"United Kingdom","Sighting Duration":"00:07:00","Latitude":"54.605853","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=54.605853,+-5.926268(27712)&iwloc=A&hl=en\"> mufon case (27712) map </A>","Log Number":"IE-02072011-0006","Source":"MUFON","divs":["Sighting DetailsI was walking home from the local shops after buying some groceries, I was just coming into my street, my house is at the bottom of the street so probably still a minute away by foot. as i entered my street i noticed out of my peripheral a red pulsating light, much like that you would see on the wing of an air plane, where I live this is not an unusual sight as there are two airports in the city, what struck me as strange was the speed the object was going, way too fast to be a plane and i actually remember saying in my head 'woaw that planes going really fast', i kept watching the object as it paced across the sky just above the roof lines, when it stopped dead. at this point my eyes were glued to the object, i was still walking down my street when I got to my front door, eyes still on the object, i knocked on the door and my fiance came out and she also saw the object. she brushed it off as an airplane and went back inside. i stayed out to watch completely confused at the pulsating light, stationary in the sky. after a few minutes from behind me over my roof, very high in the shy another two lights shot across the sky in the direction of the red pulsating light, these two lights however were solid and very bright, almost white with a slight yellow tinge. as they aproached the pulsating light they abruptly turned right and disapeared into the sky, a few moments later the red pulsating light started to drift slowly away until I could no longer see them behind the roof tops. at this point i went inside. i am very confused as to what i saw, however i went on youtube and searched for ufo sightings in my city and they seem to be quite common. thank you"],"Case Number":"27712","Summary":"Pulsating lights in sky.","Date of the Event":"02/02/2011 07:00 UTC","files":["/var/www/straped/mufon/html2text/27712.html.txt","/var/www/straped/mufon/org/27712.html"],"Viewing Distance":"Unknown"}