{"Object Shape":"Sphere","Weather Factors":"None","Viewing Distance":"Unknown","divs":["Sighting DetailsMy dad, sister, friend and I were driving into S San Francisco going to get the car washed when I noticed a slow moving silver light in the sky. It mostly hovered very high up not doing much besides very randomly flashing and eventually leaving our line of sight in the most mind blowing quickest way possible (very reminiscant of the recent Temple Mount UFO video except in daylight). All of us saw it and none of use could explain it away. I absolutely believe in the existance of technologies that are beyond the comprehension of the average sheep (person), whether they are terrestrial secret tech or other worldly objects I don't know. I do however know what I saw was one of those two things. I do have a photo my sister took with a digital camera but it's rather far away and a bit grainy. if you would like me to send it I will gladly e-mail it directly to someones address. Oh btw, my eyes are always to the skies and I have witnessed just one other unbelieveble event in my life. As soon as I saw the object I knew what it was and honestly I wasn't at all suprised as I firmly believe that very soon the whole world will be certain this type of technology exists. Whether they are piloted by the 'greys' or very privledged pilots on the payroll of the Naval Department, will remain to be seen. Please feel free to contact me by mail or phone. This is very honestly real."],"Date of the Event":"02/07/2011 01:00 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.77755,+-122.410666(27717)&iwloc=A&hl=en\"> mufon case (27717) map </A>","Object Flight Path":"Hovering then path","Country":"United States","Tags":"City","Log Number":"US-02082011-0001","Sighting Duration":"Undisclosed","Case Number":"27717","Latitude":"37.77755","Source":"MUFON","Region":"California","Disposition":"Unknown","Longitude":"-122.410666","City":"San Francisco","Date Submitted":"02/08/2011 12:08 UTC","files":["/var/www/straped/mufon/html2text/27717.html.txt","/var/www/straped/mufon/org/27717.html"],"Summary":"Strange object in sky today","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around February 7th 2011"]}