{"Longitude":"-103.13083","Weather Factors":"Unknown","Region":"New Mexico","divs":["Sighting DetailsAs I was driving home this evening, I noticed a bright light in the southern sky, over Hobbs, NM. The sky was very clear, and at first I thought it was a really bright star, because it was still. However, as I watched, I noticed that the object was pulsating with red and blue lights. Then, I thought maybe it was a plane or helicopter, but it stayed low on the horizon for more than 1 hour in the same spot. Now, I thought, would a helicopter really stay stationary in one spot for so long? I kept going back to look, because I really couldn't figure it out. I asked my husband to come out and look and see if he thought it was a plane or helicopter or star, but he thought it was weird, too. This object stayed in one place for nearly 2 hours, pulsating with red, blue, and at times, white light. It was very bright, very large, and low in the sky. Around 10 -10:30 PM, it started to move very, very slowly across the sky toward the southwest. I saw at least 4 airplanes fly near this object, which is also strange, because Hobbs is a small town, and I rarely see airplanes flying over, day or night."],"Object Features":"Unknown","Date of the Event":"02/07/2011 08:30 UTC","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27723.html.txt","/var/www/straped/mufon/org/27723.html"],"Viewing Distance":"Unknown","Object Shape":"Star-like","Date Submitted":"02/08/2011 07:46 UTC","Object Flight Path":"Stationary,Hovering then path","City":"Hobbs","Disposition":"Unknown","Case Number":"27723","Summary":"Large pulsating light","map":"<A HREF = \"http://maps.google.com/maps?q=32.708942,+-103.13083(27723)&iwloc=A&hl=en\"> mufon case (27723) map </A>","trends":["There have been 5 other sightings in Hobbs","There were no other sightings in Hobbs on or around February 7th 2011"],"Log Number":"US-02082011-0007","Tags":"City","Latitude":"32.708942"}