{"Region":"California","Object Features":"Other","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around August 31st 2007"],"Latitude":"36.976027","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","City":"Santa Cruz","Disposition":"Unresolved","Country":"United States","Source":"MUFON","Log Number":"US-02082011-0005","Object Shape":"Chevron, Triangle","files":["/var/www/straped/mufon/html2text/27721.html.txt","/var/www/straped/mufon/org/27721.html"],"Weather Factors":"None","Summary":"Object off california coast Traveling rediculously fast","Tags":"City","Date Submitted":"02/08/2011 01:17 UTC","Date of the Event":"08/31/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.976027,+-122.024896(27721)&iwloc=A&hl=en\"> mufon case (27721) map </A>","Case Number":"27721","Longitude":"-122.024896","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMe and a friend walked out on the rocks at the very end of pleaser point in santa cruz basically facing south. Out of the corner of my eye to the north I noticed something that looked like a single, dark grey (but with a glow from the moon) object traveling down the coastline about a mile off the land. Right when I saw it I pointed at it and kept my finger in line with the object til my friend confirmed he saw it too. We continued to watch the object travel into the monterney bay(at a rediculously fast speed). It made no sound and traveled just bearly off the water. Once the object got to a certain point in the bay it made a upward breaking right monuver and completely exited the atmonsphere and disapeared.When the object pulled above the horizon we relized it was in fact three objects traveling very close together in a V shape with one craft in front leading the other two. Once that happened my friend and I looked at eachother and we both new it was something extra terrestial. We then proceeded to walk quickly back to the truck discussing if we should be reporting the phenonenom to anyone."]}