{"Case Number":"27728","Object Flight Path":"Path then hovering","Disposition":"Unknown","divs":["Sighting DetailsHeading south on I-165 after 9pm a star on the hill on my left following us, my girl friend and I were in the car and she asked if I see that bright star, it's following us, I say what is it, she says a ufo, I say I don't believe it, then it came down the hill from my left, I could tell it was flying because it didn't bounce like a bike or jeep coming down the hill, when it reached the gutters edge it expanded into a yellow-orange oval shape, and hovered over the road right in front of us for over 20 mins, so I dropped from normal headlights to parking lights only, then to no lights , then back up to parking lights only, then up to normal headlights again, hoping to communicate somehow I waited, soon it flashed a bright light from it's top and was gone. note, that the illumination the whole time as it was hovering there was brighter on the top and shined upward almost like a beam, and the skin was glowing yellow-orange. My Dad was a pilot, I've flown with him alot and I'm well aware that this object was not man made. It had no stobe lights and no wings, no windows, and what kind of plane or helicopter glows!? I could through google earth give the exact latitude and logitude of this event. I've looked for my report in then past to make corrections. so here it is again only corrected this time. I have no doubts, this was not man-made."],"Longitude":"-122.0515","Object Features":"Dome","City":"Carbonado","Weather Factors":"None","Tags":"City","Log Number":"US-02082011-0012","files":["/var/www/straped/mufon/html2text/27728.html.txt","/var/www/straped/mufon/org/27728.html"],"Source":"MUFON","Country":"United States","Region":"Washington","Date of the Event":"09/16/1994 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.079825,+-122.0515(27728)&iwloc=A&hl=en\"> mufon case (27728) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"02/08/2011 05:01 UTC","trends":["There have been 2 other sightings in Carbonado","There were no other sightings in Carbonado on or around September 16th 1994"],"Summary":"Bright white star too yellow-orange oval with brighter dome on top","Latitude":"47.079825","Viewing Distance":"21-100 Feet","Object Shape":"Flash, Oval, Star-like"}