{"Disposition":"Unknown","Object Shape":"Other","Summary":"a close encounter with alien being","City":"Lake Orion","Case Number":"27726","Date Submitted":"02/08/2011 01:01 UTC","Weather Factors":"Unknown","Tags":"City","trends":["There has been one other sighting in Lake Orion","There were no other sightings in Lake Orion on or around September 30th 2006"],"Sighting Duration":"Undisclosed","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.784475,+-83.239661(27726)&iwloc=A&hl=en\"> mufon case (27726) map </A>","Viewing Distance":"Unknown","Latitude":"42.784475","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/27726.html.txt","/var/www/straped/mufon/org/27726.html"],"Object Flight Path":"Undisclosed","Log Number":"US-02082011-0010","Longitude":"-83.239661","divs":["sighting detailsi was followed by a vehicles bearing u.s. govt plates when i lived in florida in 2004 and was followed every day. my wife and other family members seen this as well.it has to do with what i was investigating.i moved to michigan in 2005 and i kept being followed there to. my wife's family in mi said to me \"what did you get yourself into\"? in october of 2006 i found myself being followed out of the lake orion,mi library. i was traveling at 45 mph the vehicle behind me was traveling at same rate of speed.i sped up and started speeding at 80 mph and turned around going towards the vehicle,in my lane of course. the vehicle pulled off the road, and i stopped in my lane next to it.i made eye contact with a woman for like 8 to 10 seconds, then a gold illuminating like dust started appearing engulfing her body going slowly in a counter clockwise direction and in seconds,she was gone. i have had these visions\\thoughts since this encounter in which i cant explain.my life has not been the same since then.i only reported this to mr.bill birnes of ufo magazine,and he suggested i report this to a man named maximillian delalafayette. i have not contacted him yet,i wanted to report it to your agency first. it is scary to have visions\\thoughts of the past and future of humanity. i have kept silent on this since 2006. i just thought who would believe me.some of the visions\\thoughts from the past include earth being nothing but \"an animal planet,and an asteroid did not take out the dinosaurs,aliens did,and they took the dna from the chimpanzee and mixed it with theirs and made a hybrid race. they are here on earth now,and have been since their creation of humanity.i know what they want from us for the future. i can be reached by cell at *(wit's telephone numbers and email address deleted -- cms\\sg). sincerely, **(wit's name deleted--cms\\sg)."],"Source":"MUFON","Country":"United States","Date of the Event":"09/30/2006 12:00 UTC"}