{"map":"<A HREF = \"http://maps.google.com/maps?q=43.499721,+-87.850367(27736)&iwloc=A&hl=en\"> mufon case (27736) map </A>","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27736.html.txt","/var/www/straped/mufon/org/27736.html"],"Longitude":"-87.850367","City":"Belgium","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/09/2011 03:00 UTC","Object Features":"Unknown","Region":"Wisconsin","divs":["Sighting DetailsI have and intense passion for anything other-wordly. I've had several sightings within the past year and the very first one pushed me into making UFO chasing a hobby. Tonight I wasn't even looking really. Tonight's purpose was to console my best friend who is going through a rough time at the moment. We did some back country driving and venting and out of the corner of my Eye I spotted it (a small gold colored orb) . I pointed it out to my friend (who is also interested in this hobby) and she was amazed. It hovered still as if it might be observing. I flashed my brights at it and then it took off with great speed. It was gone. No where to be seen. So out of curiosity I decided to go in the direction where it went. It appeared again as a bright star and the closer we got to it, it drifted away but still remained the same size and shape but it still seemed like one of them \"door at the end of the tunnel\" situations. Once we reached an intersection we finally caught up to it. It sat stationary over a large field with no trees or houses. At this point we noticed that it had a pulsating bright red light along with the white light. It did not blink like and air plane would. very lovely. I decided to take a right down another road because I could not go straight toward it since the road cut off at the intersection. I turned around on a whim and noticed that the object was now following us!!! gleee!!! I found a driveway and turned around to face it and then it started going back in the other direction. I was a little upset by this and then out of curiosity I turned my brights off. After that it stopped and sat there. I get the feeling that whatever it was wasnt very fond of bright lights. This ufo friend hung around for the majority of the night...like a watcher. Very interesting and fun indeed. second sighting of the evening: This one stands out the most to me and is also very important to me because this is a new style of sighting and one of the most interesting that I've seen. After playing tag with the first one we noticed 3 dim orbs off in the distance that slowly inched toward each other. They were horizontal in the horizon and resembled a formation that of Orions belt. The second orb and the third orb came together with the first orb and created one very large and very very bright orb! The orb would grow dim and very bright....dim and very bright....And than disappeared completely. After this we stopped at a gas station and then decided to head back home. On the way home we were followed by two of these orbs up until about a few miles from home. Folks of southern wisco....someone had to have seen this too..at least id hope so...people seem to take the sky for granted these days and tend to keep their head down but never upward toward the possibilities....but there are a handful of you out there with an open mind...Don't be afraid to come forward if you've seen anything tonight as well."],"Summary":"I think I got their attention.","trends":["There have been no other sightings in Belgium","This sighting has never been favorited."],"Sighting Duration":"02:00:00","Tags":"City","Log Number":"US-02092011-0004","Disposition":"Unknown","Object Shape":"Fireball, Sphere, Star-like","Case Number":"27736","Country":"United States","Latitude":"43.499721","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Date of the Event":"02/08/2011 10:04 UTC"}