{"Source":"MUFON","Tags":"City","Disposition":"Unknown","Summary":"Light orb reconnaissance","files":["/var/www/straped/mufon/html2text/27733.html.txt","/var/www/straped/mufon/org/27733.html"],"Object Shape":"Star-like, Unknown","Case Number":"27733","City":"Tacoma","Weather Factors":"Windy, Light","Latitude":"47.259527","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around February 7th 2011"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-122.439611","Date Submitted":"02/09/2011 12:27 UTC","divs":["Sighting DetailsThis story could have very easily been made up. One might think that, perhaps, it's the delusion of someone hoping to have a UFO experience of his own. But, I tell you the truth when I say this, from what I've been reading about these things, they are not good. They are not what they seem. The fruits of their actions only reveal bad intention. I would like to think that I did not see what I saw, that this story isn't true. But it is. My roommate and I just got back from the Humane Society where we picked up a dog and I went to the back porch to smoke a cigarette. I had remembered that earlier I had seen a rainbow, so I looked around in the clouds to see if it was still visible. It was not. Instead, I saw an orb of light moving around. It seemed about the size of a small or distant plane flying, but it contained itself to a single area and maneuvered too quickly around to be a planeThe event was occurring just above a line of trees, so I watched to see if it was a kite or something, but then I noticed another circle. And in another few seconds another and another. Soon (within 20 seconds of the first sighting) there were 7+ orbs flying around in that area. None of them were rising from the ground, but gathering together from other parts of the sky. All of them were flying around each other. If these were kites, surely the strings would have tangled together and I would have seen them crashing to the ground. They did not. I have been reading different books about UFO's recently (Communion by Streiber, Redfern's Final Events, and a few books by L.A. Marzulli) so I'm not surprised that my first interpretation of the event was \"UFOs.\" But, because the very name indicates ignorance, I kept watching to see whether these orbs would begin showing behavior typical of some explainable object. They did not. They continued their dance in the sky and I continued to watch them. I had no other camera on me but my phone camera, which would not have been able to zoom in close enough to capture an image of these orbs. After 8-9 minutes, I went inside and called for my roommate to \"Come, see this!\" I had hoped for another eye-witness to this event. I went back outside and turned my attention back to the sky, but to my dismay, all but one had disappeared and just as my roommate stepped back onto the porch, that one flew into the cover of the clouds and could no longer be seen. The rainbow was again visible, however. We went back inside where I told him the story of what happened and he told me that it sounded like something that he saw years back."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"02/07/2011 05:00 UTC","Log Number":"US-02092011-0001","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=47.259527,+-122.439611(27733)&iwloc=A&hl=en\"> mufon case (27733) map </A>","Country":"United States","Region":"Washington"}