{"Log Number":"US-02082011-0016","Tags":"City","Region":"Illinois","Summary":"Yellowish Oval light","Date of the Event":"02/08/2011 05:50 UTC","divs":["Sighting DetailsI'm reporting this event for my son who is 10yrs old. He does homework in the kitchen, on the west side of the house. We are half an hour from O'Hare and he knows the difference between commercial air traffic and something else. He was sitting at the kitchen table working on homework facing the west window. I walked in and he had this serene but perplexed look on his face and just calmly said, \"Dad, I think I just saw a UFO\". I said, ok.. what did you see? He said... \"I looked up from my homework and saw this glow and it looked different from a plane. I got up and walked to the window by the sink and saw this glowing oval shaped light just sitting there. Then it started to move slowly *south (*I'm adding clarification of direction) and then zipped away super fast, way faster than a jet. Then about thirty seconds later, I saw a black jet like my model jet zoom past in the direction the light went\" Now... we were not talking about UFOs, I was busy in my office, on a conference call, working. We have not watched or discussed UFOs or aliens recently. While he described this to me, there was plenty of traffic coming from O'Hare. So, as a jet approached from the west, they fly directly towards and over our neighborhood, I asked if the light was sparkling like the headlights on the planes. He said it was dull and tried to adjust the light over the kitchen table to duplicate it. Then I asked him to tell me when one of the approaching jets were about the same distance. As he indicated what the distance seemed to be, I asked how much bigger or smaller the light was. He said several times larger. A little later I told him that I was playing a trick on him and that I was shining a flashlight in the window. He said, \"Dad, you'd be like in the Guiness book of world records for special effects\". I said I was just kidding. He said, \"I know what I saw and you could not have faked the jet going by afterwards either\". I also asked him to stare off into the distance and count out the time it took for the jet to fly by in the direction of the object."],"Sighting Duration":"00:01:30","map":"<A HREF = \"http://maps.google.com/maps?q=40.637535,+-89.393458(27732)&iwloc=A&hl=en\"> mufon case (27732) map </A>","files":["/var/www/straped/mufon/html2text/27732.html.txt","/var/www/straped/mufon/org/27732.html"],"Case Number":"27732","City":"Undisclosed","Disposition":"Unknown","trends":[],"Latitude":"40.637535","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"None","Date Submitted":"02/08/2011 11:09 UTC","Source":"MUFON","Country":"United States","Weather Factors":"None, Does Not Apply","Object Shape":"Oval","Longitude":"-89.393458","Viewing Distance":"Over One Mile"}