{"Object Features":"Dome","City":"Springfield","Log Number":"US-02092011-0002","map":"<A HREF = \"http://maps.google.com/maps?q=42.110953,+-72.581781(27734)&iwloc=A&hl=en\"> mufon case (27734) map </A>","Viewing Distance":"101-500 Feet","Region":"Massachusetts","Date of the Event":"09/14/1972 10:30 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27734.html.txt","/var/www/straped/mufon/org/27734.html"],"Date Submitted":"02/09/2011 01:38 UTC","Disposition":"Unresolved","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around September 14th 1972"],"Country":"United States","Tags":"City","Object Flight Path":"Stationary","Summary":"Saw ufo hovering over a corn field-many people present","Object Shape":"Disc","Case Number":"27734","Sighting Duration":"00:15:00","Latitude":"42.110953","Longitude":"-72.581781","divs":["Sighting Detailsi was returning home after spending time with my Aunt at that time i lived in Springfield.As I came down a hill working my way toward rte 57,I avoided the center of town because there was a Fireman's Carnival was going on.It was approximately 10:30pm. As i came down a small hill at the end of Depot St,my radio in the car became scratchy,and eventually went out .This had never happened before so I wondered what was going on that made it work inproperly. I still headed toward rte 57.I came to the corner,which had a school on one corner and diagonally across the street was a corn field.As i looked toward the left to make sure there were no cars coming in from the left i saw a ufo hovering just above the corn.I thought it was an attraction from the Carnival so I did not pay any attention to it. Over toward my right on a small strip of grass were about 25 people,among them was my uncle David,so I tooted the horn and went along my way toward home.When I arrived home my Mother asked why I was so late in getting home.It was 3 am!I was not aware that I had lost three and a half hours. i have no conscious memory of any unusual occurance.I had insisted to my Mother i was not late in getting home,that i had left at 10:30pm. Recently i was chatting with my Aunt about seeing this and she told me in 1972 she saw a ufo along College Highway.I said \"wow\" and went on with my day."],"Weather Factors":"Unknown"}