{"Region":"Pennsylvania","City":"Doylestown","Log Number":"US-02092011-0012","Date Submitted":"02/09/2011 09:04 UTC","Tags":"City","Longitude":"-75.122944","Case Number":"27747","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around May 31st 2008"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.319986,+-75.122944(27747)&iwloc=A&hl=en\"> mufon case (27747) map </A>","Source":"MUFON","Object Shape":"Triangle","Date of the Event":"05/31/2008 01:30 UTC","Summary":"Triangular Craft with Military Escort","Disposition":"Insufficient Data","divs":["Sighting DetailsI lived in New Hope, PA during the summer of 2008. I frequently look up when I'm outside at night because you just never know what you might see. I had gone outside my house to smoke a cigarette and just sit and stare up at the sky. Then, I heard the distant sound of approaching military jets. This was not unusual because we're not too far from the Willow Grove Naval Air Station. Well, I looked up and saw the two fighter jets, possibly F-117's but that was not what caught my attention. Between the two military jets and a little above them, there was a triangular craft just like a lot of the sketches I see reports of people seeing. Actually, it looked almost exactly like the triangular craft from the famous blurry photograph taken over Belgium in the 1980's I believe. What struck me was that I could hear the distinct sound of the two jets which sounded like they were coasting into the Willow Grove Naval Air Station. I heard no other sounds. I assumed it was a military craft because it was being escorted by the jets making every movement with them. Also, I could tell the triangular craft had lights at the corners and one round one right in the center of the bottom. The thing was, the lights weren't shining. They did look like they were on but it was like they were shifted a bit out of our spectrum. I had a very clear view of the craft but it seemed to be \"grayed out\" or something. The lights seemed on but they weren't shining like a regular light source. I was a little excited at the time I didn't think much of it because I just figured it was a military black project. But, now I'm seeing more and more things about people seeing this thinking it's from outer space. I believe it to be a military aircraft and completely terrestrial. I wanted to report my sighting to you to give you another point of view from someone who has also seen this object. It came to mind tonight while I watched a program on TV about the UFO flap in the summer of 2008. Unfortunately, I didn't take any pictures because for one, it was in the middle of the night and I didn't have a good camera at the time. I carry my camera with me at all times now."],"files":["/var/www/straped/mufon/html2text/27747.html.txt","/var/www/straped/mufon/org/27747.html"],"Object Features":"None","Object Flight Path":"Straight-line path","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Latitude":"40.319986"}