{"City":"Oak Park","files":["/var/www/straped/mufon/html2text/27743.html.txt","/var/www/straped/mufon/org/27743.html"],"Date Submitted":"02/09/2011 01:12 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Tags":"City","Object Flight Path":"Stationary,Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=34.171667,+-118.757778(27743)&iwloc=A&hl=en\"> mufon case (27743) map </A>","Object Shape":"Boomerang, Flash, Other, Unknown","divs":["sighting detailsmonday feb 7 at aprox 7:30opm we were eating dinner, my 13 year old saw a very large green light out the window and asked what it was..so i went in the back yard and saw a giant green light and i think at least 2 large red lights flashing, i didnt see a shape, it looked like a cluster of pulsating lights slow moving west. my daughter came outand says she thought it had a outline of oval and or boomerag shape. we both tried to take a picture and video with our cell phones and we couldnt, it wouldnt come out on the camera. i tried so many times for like 15 min., i didnot hear any noise from the object, but my daughter thought it was like a swooshing water sound. it moved slowly towards the coast near malibu it looked like and then it seemed to go over a hill and then there was a flashing red light that stayed there all night. i have looked outside last night and noticed that the small flashing red light on the hill is always there, must be like a coast guard light. we have seen some white lights on january 24, 2011 up here in a triangular shape, but that seems to be very common on these sites. this was very different, it was huge...something i have never seen before. i did check out to see if maybe it could be one of those military planes, but it moved so slowly , almost stationary...so i dont think it was anything from this planet..i noticed today that other people may have seen what i saw in my area, in los angeles...i would love to compare notes...my email is *(wit's email address deleted--cms\\sg)."],"Log Number":"US-02092011-0011","trends":["There have been 2 other sightings in Oak Park","There were no other sightings in Oak Park on or around February 7th 2011"],"Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Case Number":"27743","Summary":"VERY LARGE RED AND GREEN PULSATING LIGHTS /SLOW MOVING","Date of the Event":"02/07/2011 08:00 UTC","Latitude":"34.171667","Longitude":"-118.757778","Region":"California","Object Features":"Unknown","Weather Factors":"Unknown"}