{"Disposition":"Unknown","Date of the Event":"02/09/2011 06:20 UTC","Case Number":"27749","City":"San Diego","Country":"United States","Log Number":"US-02092011-0014","Viewing Distance":"Unknown","divs":["sighting detailsi was walking on mount putman avenue in the clairemont area of san diego. i was looking at orion's belt and a light caught my eye. at first i thought it was a satellite so i watched for a few seconds and saw it flast (nothing extraordinarily bright) twice and thought it was an iridium sattelite - i remember thinking \"cool - just saw a flash of light off of a sattelite\". the point of light stopped, then i thought that i had just lost sight of it. the light then accelerated suddenly heading due west. i don't know what altitude it was at as it was just a point of light (no shape or multiple lights). however, it was high enough that the acceleration was quite astounding. in the space of a couple of seconds it was out of sight. it didn't just go from a dead stop to the final speed but seemed to \"rev\" up (at arms length the \"rev up\" time took about from the tip of my thumb to my index finger with my fingers as wide apart as i can stretch them - i was describing the \"what ever it was\" to someone and used that as an example about 5 minutes after i witnessed this). the sighting lasted only about 1 minute from the time i noticed it, the flashes, then the sudden acceleration. it wasn't dramatic to witness and would be lost unless you happened to be looking at exactly the right place at the right time. just an interesting little sighting of something. have drawn no conclusions other than it was out of the ordinary. thank you, [witness name removed cms\\dr]"],"files":["/var/www/straped/mufon/html2text/27749.html.txt","/var/www/straped/mufon/org/27749.html"],"Object Shape":"Star-like","Weather Factors":"None","Object Flight Path":"Path with directional change","Latitude":"32.717899","Object Features":"Unknown","Summary":"Satellite in Brightness, 2 Flashes, Stopped then Sudden Acceleration","Date Submitted":"02/09/2011 09:53 UTC","Sighting Duration":"Undisclosed","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around February 9th 2011"],"Region":"California","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.717899,+-117.153665(27749)&iwloc=A&hl=en\"> mufon case (27749) map </A>","Longitude":"-117.153665"}