{"Date of the Event":"01/04/2004 04:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.271608,+-107.75061(2774)&iwloc=A&hl=en\"> mufon case (2774) map </A>","City":"Deming","Longitude":"-107.75061","Viewing Distance":"101-500 Feet, Over 1 Mile","Summary":"rectangular box 2004","Tags":"City","Date Submitted":"01/04/2004 04:45 UTC","Sighting Duration":"01:00:00","Object Shape":"Square, Rectagular","Object Flight Path":"Stationary","Latitude":"32.271608","files":["/var/www/straped/mufon/html2text/2774.html.txt","/var/www/straped/mufon/org/2774.html"],"Source":"MUFON","Weather Factors":"None, Unknown","Object Features":"Unknown","Disposition":"IFO","Region":"New Mexico","trends":["There have been 17 other sightings in Deming","There were no other sightings in Deming on or around January 4th 2004"],"Country":"United States","divs":["Sighting DetailsWe were drivin east on I10, from Tucson,Az, heade back to Santa Fe, NM. John wasdriving, I was just looking out the window. We were about 10 miles west ofDeming, NM. I saw someting ahead to the south. It was bigger than an airplane,but not by much. It looked kind of like an army helicoptor. As we got closer,I could tell it hadnt moved. I thought that if it had been moving toward us, itwould have passed us by now. When we got across from it, It was stillstationary. I wantched it for a good 10 minutes. At one time it seemed tochange shape, just for a coulple minutes. It looked more like a saucer shapewith fuzzy whiteness above it. The clouds behind it could have made thatappearance. When we got into Deming, we lost sight of it because of the housesand trees. We were starving and went to eat. When we left Deming, we headedNE on a shortcut road to Hatch, NM. I could then see the object again. Itappeared to be a little larger, and to be sitting higher above Deming.John had only seen the object for a minute while we were driving into Deming.I would like to know if anyone else saw this and reported it. Is that possible"],"Log Number":"","Case Number":"2774"}