{"Longitude":"-96.775853","City":"Maud","divs":["Sighting DetailsWas out rabbit hunting beteen the hours of 2130 CDT to about 2315 CDT on a farm outside of Maud , Oklahoma. It was a clear and cold night with a qauter moon out. I was armed with an a pump -action tactical shotgun and a Kimber 5in. 45. cal. pistal along with about 100 rounds of 45 and 45 shotgun rounds. Both weapons are equiped with high end wight lighits. Upon returning to my home , about 2315 CDT, I walked up on my patio which is about 5 feet off the ground. When I saw a large human like figure that was bigger then any man I ever saw. I used the surefire white light on my shotgun to see better. Due to light fog, I could only see about 25 feet with the light. The creature was out in the open enough to see an outline of the figure. I had seen all my animals act unsual pior, a feeling of being wacthed at hours of darkness on more then one time. The figure was wacthing me and made eye contact. It was very large and close to 7 to 8 feet tall , was very stocky build, would guess over 400 lbs. The figure seemed anyoed that I pointed my shotgun at it. Seemed to have no fear of me or my animals. To inculed a military trained dog. My dog cowared down and would not respond to commands. I did contact a \" bigfoot team \" that showed up within 72 hours of this. No evidence was found. No footprints, hair, nothhing. I did experince some lapse in memory there after. I am a Ret. special forces sniper with 10 yrs. experince and 3 tours in Iraq. To inculed the Iraq Invasion with the 3 rd Inf. Div. on the frontlines. I have no knowlede after all I seen and done to descripe this figure. I do need to be kept out of any public report becuse of my background and security cleacnce with the military. I just want answers and will provide full croporation in person . The biggest thing that bothers me is the lack of fear from the figure and my fear back . I fear very little in life. Just want to get to the bottom of this."],"Latitude":"35.130355","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.130355,+-96.775853(27750)&iwloc=A&hl=en\"> mufon case (27750) map </A>","files":["/var/www/straped/mufon/html2text/27750.html.txt","/var/www/straped/mufon/org/27750.html"],"Object Shape":"Unknown","Region":"Oklahoma","trends":["There have been no other sightings in Maud","This sighting has never been favorited."],"Source":"MUFON","Case Number":"27750","Sighting Duration":"00:04:06","Tags":"City","Weather Factors":"None","Log Number":"US-02102011-0001","Date of the Event":"04/15/2010 11:00 UTC","Date Submitted":"02/10/2011 01:42 UTC","Summary":"Had close encounter less than 40 feet or 20 yards"}