{"files":["/var/www/straped/mufon/html2text/27751.html.txt","/var/www/straped/mufon/org/27751.html"],"Date of the Event":"01/23/2011 07:15 UTC","Log Number":"US-02102011-0002","Region":"California","City":"Watsonville","Case Number":"27751","Sighting Duration":"Undisclosed","Date Submitted":"02/10/2011 02:11 UTC","Disposition":"Unknown","Object Flight Path":"Stationary","Weather Factors":"None","Latitude":"36.918361","Tags":"City","Longitude":"-121.751915","Summary":"Bright Orb Flashing On and Off While Hovering - Eventually powers down, after dropping a light to the ground.","Source":"MUFON","divs":["Sighting DetailsDriving on a dark road near my rural Santa Cruz County home at a little after 7pm, I round a corner and was faced with an obvious, couldn't have missed it if I tried, scenario. Above and beyond the hillside separating the road from the beach, about five to ten miles away, at about 3000 to 5000 feet, I was blown away by the dramatic and unexplainable phenomena hovering and flashing at a slow and steady rate - on and off. I pulled off to the side of the road - after a minute, I got out of my car to watch more effectively. The flashing orb must have hovered and shone it brilliant bright, yet soft while light, for about three or four minutes. I began to feel as though it sensed my awareness and consequently, felt a bit of fear star to hit me. However, it was far enough away, that I had a certain sense of safety. Anyway, after about four or five minutes, the flashing orb powered down to a fraction of its original brilliance. At this point, the hovering ended and the dimming light began moving away from the ocean and toward the interior. As it got further away, it had smaller red lights involved in some way or another. This was an event that launched me into a whole new stratosphere of determination to do my part to help people prepare for the changes we are experiencing in an ongoing manner. However, the changes we are facing could very well require a level of wisdom and intelligence that goes beyond the kind of cleverness that has succeeded in the past. As Eckhart Tolle said: intelligence joins, cleverness divides."],"Object Shape":"Sphere","Viewing Distance":"Over One Mile","Country":"United States","trends":["There have been 4 other sightings in Watsonville","There were no other sightings in Watsonville on or around January 23rd 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.918361,+-121.751915(27751)&iwloc=A&hl=en\"> mufon case (27751) map </A>","Object Features":"Undisclosed"}