{"Country":"United States","Latitude":"34.257526","Sighting Duration":"Undisclosed","Longitude":"-118.354961","Viewing Distance":"Unknown","Date Submitted":"02/10/2011 07:40 UTC","Log Number":"US-02102011-0008","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around February 7th 2011"],"Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.257526,+-118.354961(27757)&iwloc=A&hl=en\"> mufon case (27757) map </A>","Region":"California","Tags":"City","Disposition":"Insufficient Data","divs":["Sighting DetailsI go outside to have a cigarette or two every night, and i love to stare at the stars.. and i have seen satellites and helicopters and planes and know the difference between stars and planes.. But there is one star in particular, that begins moving, it will shoot up, then back down, then go in circles.. and the star i usually use as a reference point for it, moves with it sometimes as well. This star is very bright, a bright cobalt blue with a very bright shinning white.. and yet sometimes it looks like there are little rotating flashes of red and green. it gets brighter and brighter sometimes and looks like its spotlighting you or something. i see this EVERY night i go outside.. there is also a red star that will move around as well. These stars appear every night over my house.. and i know that stars flicker and get brighter, and things throughout the night, but this is different. This night was different because the bright star would flash, and then a star to it's right would flash and then another to the left like they were in order, responding to each other. I feel crazy, describing it to my friends, even now, but it happens every night.. Sometimes it feels like they are trying to communicate with me, but i realize how selfish and crazy that sounds. But do other people see moving stars? I know it sounds odd, but i feel like they are trying to get my attention.. i feel like they have revealed themselves to me, and i don't know what else to do. I see them EVERY night! and i can point them out every night, i know where they are at all hours with the rotation of the earth. I just dont know what the point of showing me is. what am i supposed to do with this? im saving to buy a better video camera that can record these dancing stars, so i can show my friends i'm not nuts. But i wanted to step up and ask some people who are pros on the subject o UFO's.. i'd really appreciate any kind of help or explanation, i feel like im going crazy.. but i KNOW what i have seen, i just dont know what IT is :) thank you for your time."],"Date of the Event":"02/07/2011 07:30 UTC","Weather Factors":"None","City":"Los Angeles","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/27757.html.txt","/var/www/straped/mufon/org/27757.html"],"Object Shape":"Star-like","Case Number":"27757","Summary":"stars that appear every night in the sky, and \"dance\" around"}