{"map":"<A HREF = \"http://maps.google.com/maps?q=33.49873,+-111.922802(27756)&iwloc=A&hl=en\"> mufon case (27756) map </A>","files":["/var/www/straped/mufon/html2text/27756.html.txt","/var/www/straped/mufon/org/27756.html"],"Source":"MUFON","Tags":"City","Sighting Duration":"00:01:00","City":"Scottsdale","Object Flight Path":"Straight-line path","Object Features":"None","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Case Number":"27756","Longitude":"-111.922802","Summary":"Orange ball missed plane bolted off","Latitude":"33.49873","Object Shape":"Circle","Disposition":"Unknown","Date Submitted":"02/10/2011 04:06 UTC","Region":"Arizona","divs":["Sighting DetailsMy dad was driving me back from walmart, and as we were nearing 64th to cross to our side, I saw an orange circular thing in the air and pointed it out to him, we watched it move while we were driving to our house, and I never lost sight of it. I saw it because I always look up at the sky when you can see the stars. at first I though it was maybe a small hot air balloon because it was a fire-like orange, but it wasn't flickering like a fire would. The object was also moving from north to south at a pretty good pace even though there was no wind at all. Then it came within 50 feet of a small airplane, and my dad was yelling \"Oh my god it's gonna hit it,\" but it barely missed it and then my dad thought it had disappeared or gone out because he thought it was a small hot air balloon still, but I saw it still until it was too small to see it any longer. After it had passed the plane, it gained speed very rapidly and went into the night sky at about a 45 degree angle. I was scared at first because I do believe in intelligent beings visiting us, but I was also happy partially because my dad has always put me down for believing that. I ran inside really fast because I was scared, nothing I've ever seen in the sky has scared me that much. I lost the object because it went beyond my eyes capabilities."],"trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around February 9th 2011"],"Weather Factors":"None","Date of the Event":"02/09/2011 08:00 UTC","Log Number":"US-02102011-0007"}