{"Latitude":"30.220443","Date of the Event":"02/10/2011 09:15 UTC","trends":["There have been 2 other sightings in Crowley","There were no other sightings in Crowley on or around February 10th 2011"],"Object Features":"Undisclosed","Case Number":"27766","Summary":"Strange UFO appears again","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.220443,+-92.370516(27766)&iwloc=A&hl=en\"> mufon case (27766) map </A>","divs":["Sighting DetailsThis is the third time I have seen this object. The first time was about an hour before sunset a few months ago. I was able to see what looked like a permanent contrail the same size of the object hovering in sky to the west of my location. It would move back and forth, but never closer or farther from me. The sun began to set & the clouds took over & I lost sight until night fell. I noticed the ball of light. It stayed in the sky for approx half an hour before I saw these planes (about 8) coming from EVERY direction. The UFO never moved. I was able to see the ball of light & the light from these encircling aircrafts within close vacinity of each other. Suddenly I didn't see the UFO ball of light anymore & then the other aircraft simply left in the same direction from which they came. The 2nd time I saw it, it was just simply there...hovering. No chaser planes this time. ON FEB 10th, 2011...I saw it again. Thank goodness my husband was outside with me at the time. He doesn't believe in UFOs or any type of conspiracy theories. I told him to look to our west. He said it was a plane. I told him about the 1st experience I had in the same location. He said it looked like it was moving. I told him that we should come back in a half hour & that it would still be there. He looked at me like I was crazy. Anyways, right before we went inside, the object disappeared. We never took our eyes off it. He looked at me in an unsettling manner & said that maybe they turned the lights off & turned his back towards me. We both began to laugh. He was spooked & I knew it. I was so excited that he was able to see it with his OWN eyes & that he had proof that I wasn't crazy. There is something strange going on in this area. My husband ssaid it may be military. I think I need to do some searching on the approx area. I haven't seen other article of someone experiencing this except for in TX...which isn't really that far from my location. The 1st experience I had with this UFO, i did google to see if anyone else seen it. There was a sighting in LAKE CHARLES, LA...which again isn't that far from where I am. I'm so glad for this site so that we can all share our experiences with each other. I would just like answers. Military or no military..."],"Viewing Distance":"Unknown","Disposition":"Insufficient Data","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other","files":["/var/www/straped/mufon/html2text/27766.html.txt","/var/www/straped/mufon/org/27766.html"],"Weather Factors":"Unknown","Log Number":"US-02112011-0006","Date Submitted":"02/11/2011 10:39 UTC","Country":"United States","Object Flight Path":"Undisclosed","Longitude":"-92.370516","Region":"Louisiana","City":"Crowley"}