{"files":["/var/www/straped/mufon/html2text/27761.html.txt","/var/www/straped/mufon/org/27761.html"],"Summary":"Row of orange lights again","Longitude":"-98.811702","Region":"Texas","Object Shape":"Sphere","trends":["There have been 2 other sightings in Eastland","There were no other sightings in Eastland on or around February 10th 2011"],"Case Number":"27761","Log Number":"US-02112011-0001","Sighting Duration":"Undisclosed","Disposition":"IFO","Source":"MUFON","City":"Eastland","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.40598,+-98.811702(27761)&iwloc=A&hl=en\"> mufon case (27761) map </A>","Object Flight Path":"Stationary","Latitude":"32.40598","Weather Factors":"Unknown","Object Features":"None","Tags":"City","divs":["Sighting DetailsI went for a drive around Lake Leon tonight. Truthfully, I just had a hunch that I would see something tonight, and I did. I was making a loop around the lake going south on Ranch Rd 2461 (I was at the southeast corner of the lake). I was making the bend right before the road meets up with Ranch Rd 2214. While taking that bend I saw the orange lights. They were in the southern sky, were quite low in altitude and quite close. There was a string of 4 or 5 orange lights in a row with two \"stray\" orange lights above and out to the sides of the main row. The lights came on slowly, burned brightly then dimmed out. The lights were in the same formation and behaved in exactly the same way as the lights I reported over Eastland cemetery in November of 2008. After the lights had disappeared I noticed a large swarm of military jets in the area. Their white strobes covered the sky, and they seemed to sweep the area farther south after the sighting towards De Leon and eventually seemed to split up into pairs and sweep north. Immediately after the sighting, I stopped the car at the intersection of 2461 and 2214 and texted some friends who had seen the same type of ufo with me 11 months earlier over the nearby town of Cisco. One of my friends texted me back and said he was on his way to the nearby town of Ranger (northeast of where I was). I told him to keep his eyes peeled. A few minutes later at 7:50pm, he texted me and said he just saw two ufos. A few minutes later at 7:52 he texted me again and said he saw the ufo again. I texted him and told him that what I had seen was a row of orange lights like the ones we saw over Cisco last year and asked if he was seeing the same thing. He texted me back and said \"yes\" he was seeing the rows of orange lights like we had seen together over Cisco. Later at 8:27pm he texted me stating he was seeing jets everywhere. I have seen these same orange lights in Eastland county for several years. I'm curious about them but can never deduce anything about them except that they are arbitrary lights in the sky. The lights always appear disembodied--no visible craft they appeared attached to, but seeing the lights in the similar rows of 4 or 5 with a few extra above makes me wonder if they aren't actually attached to a fixed-shaped craft that happens to be \"cloaked\" in some way. The lights seem to hover or creep along at a snail's pace and are totally silent. Military jets always accompany the sightings. One more thing. I also have noticed that the sightings tend to occur when the moon is in its quarter phase (tonight is first quarter--this is what gave me my \"hunch\" that I would see something). Sorry, no footage. Again, event happens within a matter of seconds with no time to grab a camera."],"Date Submitted":"02/11/2011 12:02 UTC","Country":"United States","Date of the Event":"02/10/2011 07:36 UTC"}