{"Object Shape":"Unknown","Region":"Kentucky","Source":"MUFON","Latitude":"38.676737","Viewing Distance":"20 Feet or Less","Date Submitted":"02/11/2011 05:58 UTC","trends":["There have been 8 other sightings in Falmouth","There were no other sightings in Falmouth on or around October 31st 1991"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.676737,+-84.330214(27774)&iwloc=A&hl=en\"> mufon case (27774) map </A>","Object Features":"Unknown","Log Number":"US-02112011-0014","Summary":"While looking for Trespasser on property (Hunters) came up on 3 types of different Alien beings. I turned around and the next thing It was night time, I had missing time.","Sighting Duration":"Undisclosed","Weather Factors":"None","City":"Falmouth","Country":"United States","Disposition":"Unknown","Object Flight Path":"Other","divs":["sighting detailsi was working on a large 160 acre farm in pendleton county, ky. i had several duties. on this day in question i was eating lunch and a local friend stop bye to say that he had saw some hunters sneaking on to the property, i told him that i would let them get settled down and after my lunch i would go out and round them up. so i finished lunch got my gun and started walking down the fence row my plan was to cut into the woods and sneak up on them. i had been out there around 45 mins to an hour and as i was making my way though the woods suddenly something step out from behind a tree. i yelled friend or foe and point my gun at it. i couldn't believe my eyes there standing in front of me and my gun was a 3 and 1\\2 foot tall gray being, suddenly i had the thought that it was talking to me though my mind, i had the felling that it was a young female and it was scared and telling me it was going to run up a little knoll, just then it took off running up that knoll. i followed it with my gun barrel as it reach the top of the hill there was a flash of light and a door way opened up out of no where. it was about 4 ft wide and probably 8 ft tall it was brightly light inside and i could see the little being standing in it, now it looked like it was wearing a tight black suit of some sort. suddenly out of the corner of my left eye, i see what looked like something was running toward me i wheeled around and right in front of me was a lizard like man about 5 to 6 ft tall and he was holding a long staff like thing in one hand, his face was more insect looking to me though, and it had dark blue eyes. again i caught the feeling that it was the little females father, or guard. okay i know this sound weird but just then to my right there was a 7ft or 8 ft brown hairy bigfoot creature just standing there. i didn't hear him speak but i did hear in my mind no! don't hurt him. just then the lizard looking one, looked right at me and his eyes changed right in front of me to a yellowish gold. i turn to run and when i did. i was just standing there in the dark in the woods, yes it was night time. i stood there in shock for a moment trying to collect myself. i looked around and i was alone. i started my walk out of there. back to the farm house, when i got back there was another farm hand that said where have you been we thought you got lost. i didn't say a thing. i come forth now, because i have tried to live with this for years, but recently i was watching tv the history channel show ancient aliens and saw something that looked like the lizard man on the tv. it brought back memories of that day and i started having dreams again and thinking strange thoughts like, could that have be a portal i saw the little one go into? are they interdenominational? or time travelers?, is this why no one finds bigfoot bones? and so on, also i'm having dreams about our future. i need to know what happened to me, out there that day. so i come to you for help."],"Date of the Event":"10/31/1991 01:00 UTC","Tags":"City","Longitude":"-84.330214","Case Number":"27774","files":["/var/www/straped/mufon/html2text/27774.html.txt","/var/www/straped/mufon/org/27774.html"]}