{"City":"Hico","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=31.991465,+-98.030105(27770)&iwloc=A&hl=en\"> mufon case (27770) map </A>","Date Submitted":"02/11/2011 12:56 UTC","divs":["Sighting DetailsMy mother and i were pulling into the driveway when she stopped and asked me if i could see the strange lights in the sky. Sure enough there were strange flashy lights that appeared to be bouncy and extremely inconsistent. We called my father, who was riding his horse in our arena, he could see them as well. My mother and i parked the car and ran to the arena to continue watching them. They would dissappear and reappear. Just when the sky would be dark and we would think they were gone these bright orange lights would appear slowly first one, then a second one, a third, and then a fourth. These lights were compleyely still. Sometimes they would be really close together, even over lapping, while other times they would be spaced out... At one point they were lined up in a. straight line. Then they would completely dissappear again. The flashy, bouncy lights would reappear. When we first the lights they were really close but seemed to be moving west. We are used to seeing planes and fighter jets and these lights were nothing of the sort. The movements were so inconsistent and sporatic.. Its completely unxplainable. My mom reported our sighting and within 20 minutes there were fighter jets or similar air crafts flying near our property... But after they left the sporatic lights reappeared in the west and occasionally we would see the still bright orange lights. We called our friend lived not too far from us and he ccould see them too. We watched them for about an hour. I tried taking pictures but could not capture the lights."],"Viewing Distance":"Unknown","Latitude":"31.991465","Object Features":"Undisclosed","Summary":"multiple lights with sporatic flashing no consistency. would disapear and reappear. 4 bright orange lights would slowly appear and then disapear.","Log Number":"US-02112011-0010","files":["/var/www/straped/mufon/html2text/27770.html.txt","/var/www/straped/mufon/org/27770.html"],"Date of the Event":"02/10/2011 12:00 UTC","Source":"MUFON","Region":"Texas","Longitude":"-98.030105","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other,Unknown","Sighting Duration":"Undisclosed","Case Number":"27770","trends":["There have been 7 other sightings in Hico","There were no other sightings in Hico on or around February 10th 2011"],"Object Shape":"Flash, Unknown","Country":"United States"}