{"Date of the Event":"02/11/2011 07:00 UTC","Sighting Duration":"00:04:00","Region":"Arizona","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/27778.html.txt","/var/www/straped/mufon/org/27778.html"],"Latitude":"33.303175","Summary":"7-8 bright red orbs danced about the west valley sky west of Avondale and Goodyear, AZ between 7:00- 7:05 PM","City":"Goodyear","trends":["There have been 8 other sightings in Goodyear","There were no other sightings in Goodyear on or around February 11th 2011"],"Weather Factors":"Unknown","Log Number":"US-02112011-0018","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsAt about 7:00PM I got into my car to go to the store. I put my car in reverse (backing toward the north). I got halfway down my driveway, and was looking to my right (toward west) when I noticed what I first thought were fireworks in the air. I also had street lights in my view (orange) and I thought I was catching some weird optical illusion effect through the window. They were more closely grouped when I first spotted them, there were about 7-8 bright red lights just kind of suspended in no particular formation hovering at between 30-40 degrees. I actually stopped to figure it out. It didnt seem right, I thought maybe it was glare, perhaps the reflection of the street lights behind me. I quickly realized it was not glare, so I turned off the car. I got out of the car and stared for about 5 seconds to make sure I was really seeing it, and I raced into my house to yell for my family. I was gone for about 10-15 seconds total, and when I returned to the driveway the lights were still there, but had spread a bit further out. The were ALL red. Some were brighter at times, but usually they had about the same intensity. They all moved slightly and calmly, no sharp turns or bolting off. But the all moved in different directions, at different times, in no particular formation or pattern. some up, down, or any other obscure direection they wanted. I would estimate that it took about the next 3 minutes from the time I got back into my driveway for them all to eventuially burn out one by one. My wife, and both of my kids saw it. We were all very moved, we know we saw something special. We were just standing outside on the sidewalk watching the show. I tried to take a good picture but the street lights would not make it possible with my horrible camera phone. I managed to obtain one picture that I believe shows ONE of the orbs, I think the others are drowned out by the street light glare. This just happened, and I can't get through to the news. I hope someone else saw this, I would love to see a video or better picture."],"Country":"United States","Object Shape":"Fireball, Star-like, Teardrop, Other","Date Submitted":"02/11/2011 10:26 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.303175,+-112.358024(27778)&iwloc=A&hl=en\"> mufon case (27778) map </A>","Case Number":"27778","Longitude":"-112.358024"}