{"Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Unknown","Object Flight Path":"Undisclosed","Case Number":"27786","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.853432,+-73.411509(27786)&iwloc=A&hl=en\"> mufon case (27786) map </A>","Summary":"Strong impression of visitation","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/27786.html.txt","/var/www/straped/mufon/org/27786.html"],"Date Submitted":"02/12/2011 02:03 UTC","Latitude":"40.853432","Weather Factors":"None","Object Features":"Undisclosed","Log Number":"US-02122011-0007","Country":"United States","trends":["There have been 4 other sightings in Huntington Station","There were no other sightings in Huntington Station on or around October 26th 2010"],"divs":["sighting detailssometime during my sleep on that night, i was hit with a strong frisson of fear and the immediate impression that i said (to who, i have no idea) either 'don't take me' or 'don't leave me'. immediately after that i felt, physically felt, firm but gentle pressure on both my biceps above my elbows, pushing me backwards onto my mattress and into my pillows. at the exact same moment, i felt an overwhelming sense of peace and calm, and almost felt sad when the pressure ended. i regained awareness that i was in my bed a short time later, and didn't feel any sense of fear or anxiety, just kept the calm, peaceful feeling. my dog didn't seem to have been bothered by anything, and nothing looked out of place in my room. but i was certain something had happened. the next morning i awoke with an amazing sense of joy, purposefulness, and was incredibly energetic and productive at work. the only odd thing was that i heard a ringing\\buzzing in my right ear that lasted for days after. but since then i've been a bit more attentive to the phenomenon, which has prompted a bit of a paradigm shift in my thinking. something else occurred later that has me thinking perhaps we are going to be given the opportunity to meet these 'others', whoever they may be. i'm going to try not to get too freaked and try to keep an open mind and heart."],"City":"Huntington Station","Date of the Event":"10/26/2010 02:00 UTC","Longitude":"-73.411509","Region":"New York"}