{"Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy sister walked in the house in a panic saying she had just seen a UFO. I was 15 years old and very skeptical of her story so I told her to takHoe me out and show me. We drove around for about an hour with no luck so we were heading home. Within a quarter mile of our house we spotted an enormous circular object hovering no more than 200 feet over the road in the exact spot she said to have seen it an hour earlier. She drove her car directly under the craft and stopped. We were in total shock and amazement as we stared up through her t-tops at this silent but incredibly bright circular object hovering over us. It had every color imaginable on it and was huge. I would estimate 500 feet across. We were very scared and after a minute or so I was so hysterical I begged her to get us out of there. We sped away and did not see the craft leave because honestly, we were too afraid to look back. We then went home and called Selfridge Air Base and reported our experience. We also called the state police but were not treated as very credible. This was by far the most amazing thing I have ever seen in my life and can say without a doubt that this craft was not of human engineering. My sister and I are more than willing to take lie detector tests or do anything else to verify our story. To this day we always say \"If we had only had a camera.\" This incident happened on Ray Center road between 28 mile rd. and 29 mile rd."],"Object Shape":"Circle","City":"Romeo","Log Number":"US-02122011-0009","Date Submitted":"02/12/2011 06:39 UTC","Summary":"My sister and I drove under it and stopped.","Longitude":"-83.007367","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27788.html.txt","/var/www/straped/mufon/org/27788.html"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Region":"Michigan","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.805328,+-83.007367(27788)&iwloc=A&hl=en\"> mufon case (27788) map </A>","trends":["There have been 5 other sightings in Romeo","There were no other sightings in Romeo on or around September 16th 1988"],"Date of the Event":"09/16/1988 12:00 UTC","Case Number":"27788","Tags":"City","Latitude":"42.805328","Sighting Duration":"Undisclosed","Disposition":"Unknown"}