{"map":"<A HREF = \"http://maps.google.com/maps?q=42.734655,+-84.553645(27783)&iwloc=A&hl=en\"> mufon case (27783) map </A>","Source":"MUFON","Log Number":"US-02122011-0004","Object Features":"Undisclosed","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27783.html.txt","/var/www/straped/mufon/org/27783.html"],"City":"Lansing","Latitude":"42.734655","Date Submitted":"02/12/2011 10:03 UTC","Case Number":"27783","Sighting Duration":"Undisclosed","Longitude":"-84.553645","Region":"Michigan","divs":["Sighting DetailsI have read a few other reports on here about seeing a bright white light with a trail so I thought I would report what I saw the other night in Michigan. I have seen many things here in Michigan and I know others who have too, but rarely do they get reported on here. As an avid sky watcher (when you can see it not snowing), I have been watching a bright light in the western sky that looks like it changes color--it is not high enough to be a star--it may be a plant, but I am not sure, my daughter and I have both watched it and it often looks like it shape changes. I went out for a drive to try and get a better look at the \"object\"..but realized as I was trying to locate it, I either disappeared or moved out of the viewing area. I continued my drive and as I was driving south on Creyts Road in Lansing I looked out my driver's side window (facing East) and at that moment saw a bright white burst of light with a trail. It was over before I finished saying, \"what the heck was that...\" Had my camera in my lap but didn't even have time to snap a photo. It appeared to be dropping down out of the sky, but could have been moving across the sky. Perception is difficult when you are looking up in the dark, night sky. For a second I thought maybe it was a flare as it resembled what a flare might look like, but there was absolutely no reason why a flare would be in the area. No plane or helicopter flying over. This is a warehouse district. The light was high enough in the sky to not be anything on ground level that would have caused it. I have seen shooting stars before, which were very high in the sky and orange in color. This was not like that. This was a very bright white ball of light with a trail, and was much lower than an average \"star\". There was a semi-truck driver in the lane next to me and may have witnessed it also, but don't know."],"trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around February 8th 2011"],"Summary":"Bright white light with trail","Disposition":"Hoax","Tags":"City","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"02/08/2011 12:00 UTC","Object Shape":"Flash, Unknown"}