{"divs":["Sighting DetailsI was standing outside my house observing the sky in a southeastern direction. Directly above my head was what looked like an old time flash bulb. A bright cirle with a dark center. This event lasted for a few seconds. After this flash I could see no object in the area where this event took place. I continued to watch the general vicinity and the event occured again in what I could describe as higher up or deeper into space. The events were exactly the same, a bright flashbulb like burst lasting about two seconds and no observable object in the place of this flash afterwards. After waiting about ten minutes I walked out away from the house into the street at that moment an object at about eleven o'clock in the sky blinked like a strobe on an aircraft however it was way out there and no color was eminating from it. This object moved or should I say \"jumped\" to a position southeast of me and was blinking and moving although I could'nt see the movement. It was changing it's position without any observable movement. The pattern of it's blinking was not steady. It seemed random. I watched it \"jump\" away and lost it on the southern horizon. As a sidenote: my neighbor saw an object streak across the sky way up there moving from west to northeast. He said it came to a complete stop and went straight up and disappeared. This event occured about a week before my event. The whole event really had me \"creeped out\" I could'nt help feeling like I was being watched somehow. It was hard to sleep that night."],"Object Flight Path":"Undisclosed","Latitude":"41.526694","Date of the Event":"12/21/2010 07:30 UTC","Object Shape":"Flash, Saturn-like","Longitude":"-71.253863","Case Number":"27799","City":"Newport RI/Fall RiverMA","Log Number":"US-08092011-0059","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/27799.html.txt","/var/www/straped/mufon/org/27799.html"],"Source":"MUFON","trends":["there have been no other sightings in newport ri\\fall riverma","This sighting has never been favorited."],"Country":"United States","Sighting Duration":"00:02:30","Viewing Distance":"Unknown","Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"Rhode Island","map":"<A HREF = \"http://maps.google.com/maps?q=41.526694,+-71.253863(27799)&iwloc=A&hl=en\"> mufon case (27799) map </A>","Date Submitted":"08/09/2011 12:05 UTC","Tags":"City","Summary":"Flashbulb and erratic movement of star-like object"}