{"Weather Factors":"Unknown","Country":"Canada","Longitude":"-79.306255","Object Features":"Dome, Wings","divs":["Sighting Details Well, my friend and I regularly watch the nighttime sky for satelites and regular star gazing. We live about a half an hour North of Toronto, Ontario. It was during my friends 19th birthday party that we were outside of the house staring at the sky, my fiancee was looking in a westerly direction when she exclaimed You guys will probably not beleive this but I just saw something really weird. Well we did beleive her, she said it was roughly triangular with 2 or 3 running lights. That got our interest as she also said it was flying very low, perhaps only a couple of hundred feet up We began watching the sky with a renewed interest, and it wasnt very long before we all 6 or 7 of us saw amazing things. For about the next hour or so we saw what appeared to be moving starsnot satelites, I know the difference, however they did not behave like stars. There were probably about 8 sightings that night, each one different from the others. There were single crafts, as well as formation flying of 3 to 10 different craft at a time. They were mostly visible as points of light, but depending on the angle at which they passed us the shape of the ship was more apparent. Sometimes they appeared to be fling completely straight, other times they would jink about and wobble. When they were in formation, one would be in the lead while 2 or 3 would fly behind the first swapping positions with each other in almost the same way that Canada geese fly. Occasionally there would be clusters of several individual lights moving togethersometimes steady points of light other times they would fade in and out. Except the first sighting of my fianceewhich was very low to the ground, all the rest were at an altitude that small Cessna planes might fly at. They were completely silent as we watched them come from the southfrom the Toronto area and pass over the house and continue in a roughly Northern direction. The objects vanished when they got close to the Northern horizon. There was no vapour trail or any emissions visible. I must say that for myself I felt completely elated and overjoyed, feelings that warmed me inside as I watched open mouthed.Our first sightingsthe one described above happened in March of 2002 @ 1030 PM,the next sighting was only a week later at the same location"],"Latitude":"43.689527","Object Shape":"Unknown","Log Number":"","Date Submitted":"03/27/2002 10:41 UTC","Date of the Event":"03/27/2002 10:41 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around March 27th 2002"],"Disposition":"Unresolved","Summary":"Formation flying of multiple orbs","Viewing Distance":"501 Feet - 1 Mile","City":"Toronto","Tags":"City","Case Number":"2779","Sighting Duration":"01:59:00","files":["/var/www/straped/mufon/html2text/2779.html.txt","/var/www/straped/mufon/org/2779.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.689527,+-79.306255(2779)&iwloc=A&hl=en\"> mufon case (2779) map </A>","Region":"Ontario"}