{"Log Number":"US-02122011-0011","Summary":"4 square like very Bright White objects.","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/27790.html.txt","/var/www/straped/mufon/more/27790_submitter_file1__chemtrails026.JPG","/var/www/straped/mufon/more/27790_submitter_file2__chemtrails027.JPG","/var/www/straped/mufon/more/27790_submitter_file3__chemtrails028.JPG","/var/www/straped/mufon/org/27790.html"],"Source":"MUFON","Country":"United States","Object Flight Path":"Path then hovering","Latitude":"28.18976","Object Features":"Unknown","Date Submitted":"02/12/2011 09:02 UTC","Weather Factors":"None","divs":["Sighting Details I was taking pictures of an amazing 360 degree sunset & some chemtrails when I noticed a very bright white object by them. I`m right on the west coast of FL and was looking North East. At that time I took one pick that didnt turn out before it disappeared ... Then I looked south east & seen 3 identical objects to the first one, hovering above the direction of Tampa International Airport, higher than any planes I`ve seen approach it or flying near it. Two disappeared while one hovered for maybe 20 seconds before disappearing, at that point I was able to get 3 pretty good pictures, one has a bird in, the other two are pretty startling zoom shots, to me anyway. Clearly not a plane or weather balloon !! I labeled the download chemtrails but these are NOT chemtrails you`ll be viewing. I`m not sure how or what format you`ll be using. I`v only ever exchanged photos on twitter. But when you tweet pics on twitter there is a full view image option on the top right, please check that out if you have it. I`m sure your aware of it tho. The photos are still on my video camera & will keep them there for anyone to examine if they want."],"Sighting Duration":"Undisclosed","Longitude":"-82.738205","map":"<A HREF = \"http://maps.google.com/maps?q=28.18976,+-82.738205(27790)&iwloc=A&hl=en\"> mufon case (27790) map </A>","Object Shape":"Square, Rectagular","Disposition":"Unknown","trends":["There have been 12 other sightings in Holiday","There were no other sightings in Holiday on or around February 12th 2011","This sighting has never been favorited.",""],"Region":"Florida","City":"Holiday","Case Number":"27790","Date of the Event":"02/12/2011 06:00 UTC"}