{"Log Number":"US-02132011-0002","Region":"Michigan","Country":"United States","Source":"MUFON","Date of the Event":"06/12/2010 12:00 UTC","Object Flight Path":"Undisclosed","Latitude":"42.668246","map":"<A HREF = \"http://maps.google.com/maps?q=42.668246,+-83.145112(27797)&iwloc=A&hl=en\"> mufon case (27797) map </A>","City":"Rochester Hills","Case Number":"27797","Object Shape":"Cigar, Circle","Weather Factors":"Unknown","Longitude":"-83.145112","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Undisclosed","Viewing Distance":"Unknown","divs":["sighting details*(name deleted--cms\\sg) 16 yeares of age was walking with a friend when all of a sudden they looked up and they saw a cigar shapped ship moving strangly fast it had lights flashing off and on, **(name deleted--cms\\sg) had never even thought about ufo's he was affraid as was his friend. i myself saw a round ship many years ago, it was over a tree on my street, it had many lights flashing red, green, blue and looked like white. people made fun of me but one thing i can say is that i know what i saw, the strange thing i will always remember is how when the round ship turned to it's side i could not see a thing at all when all of a sudden it turned around i could see it again, at that point it took off so fast i had never seen anything like it or since. i have had strange dreams over the many years where i was told that i was pregnant, and less than three months later i was introduced to a child, this happened many times. i believe that i have been abducted at least thre times, one time a needle was put inti my navel it was painful, another time one was put into my temple, and another time i don't rembember or don't want to remember what was done. i remember when i was around 16 yrs of age, something must have been placed in my right ankle, and i remember that whenever i would brush against it electrical shock would go up my leg, i could feel it and i knew it was there but i did not know what it was. **(name deleted--cms\\sg) incident happened in the spring of 2010 ***(wit's name deleted--cms\\sg) do you believe perhaps that we as a species where brought here from another planet maybe for punishment to farm the earth? and that perhaps the first group knew that they were brought here and they wanted to go back home and that is why they were trying to build the tower, which became the tower of babal. ***(wit's first name deleted--cms\\sg)."],"trends":["There have been 10 other sightings in Rochester Hills","There were no other sightings in Rochester Hills on or around June 12th 2010"],"Date Submitted":"02/13/2011 12:13 UTC","Tags":"City","Summary":"MY gRANDSON AND HIS GIRLFRIEND WERE WALKING WHEN THEY LOOKED UP AND SAW A CIGAR SHAPPED SHIP MOVING FAST","files":["/var/www/straped/mufon/html2text/27797.html.txt","/var/www/straped/mufon/org/27797.html"]}