{"Summary":"cigar shaped as large a passenger jet","Date Submitted":"02/12/2011 10:18 UTC","trends":["There has been one other sighting in Marble Hill","There were no other sightings in Marble Hill on or around May 15th 2009"],"Longitude":"-89.970379","Source":"MUFON","Latitude":"37.305887","Country":"United States","Case Number":"27791","Viewing Distance":"Unknown","Region":"Missouri","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/27791.html.txt","/var/www/straped/mufon/org/27791.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.305887,+-89.970379(27791)&iwloc=A&hl=en\"> mufon case (27791) map </A>","City":"Marble Hill","Weather Factors":"Unknown","Disposition":"Unknown","Log Number":"US-02122011-0012","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","divs":["sighting detailsthis cigar shaped [i would say as big jet fusealoge] came just south of our home at a very low level[less than a 1000 feet] and at a distance at the closet spot of less than a 1\\8 mile.it was silver,no windows,no noise in a north east direction and it flew in a straight line we were very excited when we saw it and we couldn't believe our eyes after it went by and discussed it for a long while afterwards. it didn't seem to be going at a exburant rate of speed as i have been very close to fighter jets and i know what they can do. my wife seen it first while getting clothes off of the line in back yard and hollered at me while i was in the shop working on something and when i saw it i rushed over to my son's home [which is 200 ft past the shop]and hollered at them to come and look and my daughter-in-law,granddaughter,and grandson also saw it.my granddaughter run in to get a camera but it was to far away to really get a picture by then. in this area there have been a lot of strange things one night behind our house in the woods there was a bright lite shining down into the woods with no noise moving real slow and just disappeared as well as several other strange things i have seen in my life as we live near the piedmont,mo area that was the ufo hotspot of the seventys's.i have been told stories by my family back two generations of there experencies with ufo's and i don't think they would lie about it as they keep it to there selves for years before they would even talk about it. if you are interested in knowing any of there sighting i would gladly tell you. what i have told is as truthful as i can."],"Date of the Event":"05/15/2009 06:30 UTC","Object Shape":"Cigar","Tags":"City"}