{"Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-122.326341","Disposition":"IFO","Viewing Distance":"20 Feet or Less","Object Shape":"Triangle","Sighting Duration":"00:02:00","Source":"MUFON","Region":"Washington","Country":"United States","Date of the Event":"02/13/2011 06:20 UTC","Object Features":"Unknown","Summary":"West Seattle - Triangle of 3 white lights and 1 blinking red","City":"Seattle","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around February 13th 2011"],"files":["/var/www/straped/mufon/html2text/27804.html.txt","/var/www/straped/mufon/org/27804.html"],"Tags":"City","divs":["Sighting DetailsI have 12 foot windows that face west and have a expansive view of the sky. I was sitting down to watch tv, facing the windows when an object with lights travelled from overhead, west away from my point of view. It travelled to the hill opposite, moved 20-30 feet to the right, hovered and then slowly landed as if it were a helicopter. As it's very dark out tonight, I only saw lights, not an actual object. I saw three white lights in a triangle pattern, the apex heading away from me. I'd say the object was small, perhaps about the size of a car. In the center of the object was a blinking red light. Entire sighting lasted 20-30 seconds. I noticed it because there is no flight path here. The only times we have planes in this area is when the Blue Angels are practicing for Sea Fair. I thought I was seeing a plane and the lights were on it's landing gear. So, I watched it to see if I could verifiy that it was indeed a plane. That's when it reached the opposite hill, moved right, and then hovered, before landing. There is no helipad where it landed and it did not have lights like helicopters do. Additionally, it was silent. If it were a helicopter, I would have heard it. In reading other reports here, it does seem like there have been two other cases of a black triangle object with lights in a similar pattern to what I saw. I'm reporting this in case others may have seen something that can't be explained."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.6148,+-122.326341(27804)&iwloc=A&hl=en\"> mufon case (27804) map </A>","Weather Factors":"None","Case Number":"27804","Latitude":"47.6148","Date Submitted":"02/13/2011 10:28 UTC","Log Number":"US-02132011-0009"}