{"Object Flight Path":"Straight-line path","Longitude":"-83.315374","Weather Factors":"None","Object Features":"None","Latitude":"43.057866","Viewing Distance":"Unknown","divs":["sighting detailsa friend of mine and i had stayed out late (until about 4am) messing around with some walkie-talkies that i had. i was about 13 at the time, but i still remember exacly what i saw. i can't give the exact time or date, but i estimate that it would have been in the summer sometime because we were on break from school. as for the time i saw the craft, it was around 2 or 3am (sometime well after midnight). i was looking directly up at the sky from an empty lot next door to my house. i remember looking at a cluster of dim stars until something caught my eye. one dim yellow\\white light (that i thought was a satellite) moved very slowly into the cluster of stars directly above me. in an instant it seemed like the entire thing \"uncloaked\" and became this massive black isocelese triangle shape with one light in each corner. it was a lot bigger than a commercial airplane. the lights were dim, yellow\\white. it was considerably low in the sky and it blocked out the view of the stars above it. it was almost completely silent; there was only a quiet rumble or hum coming from it. it was moving slow, traveling north towards imlay city road. (eventually it could have gone over bowers road. etc.) right when i noticed it, i yelled out to my friend who was only a few feet behind me, telling her to look at it. she confirmed what i was looking at, but we had no idea what it was. it gave me and odd, almost unsettling feeling. i lost sight of it about 30 seconds to a minute after i initially saw it. it didn't disappear, it just continued to fly north until i was unable to see it. we didn't have any way to record it or take photos, but i can provide a visual of what it looked like."],"Country":"United States","Date of the Event":"08/13/2007 03:00 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.057866,+-83.315374(27803)&iwloc=A&hl=en\"> mufon case (27803) map </A>","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/27803.html.txt","/var/www/straped/mufon/more/27803_submitter_file1__Triangle.jpg","/var/www/straped/mufon/org/27803.html"],"trends":["There have been 9 other sightings in Lapeer","There were no other sightings in Lapeer on or around August 13th 2007","This sighting has never been favorited.",""],"Log Number":"US-02132011-0008","City":"Lapeer","Case Number":"27803","Summary":"Massive black triangle with 3 lights resembling stars. Low in the sky, Traveled slow.","Date Submitted":"02/13/2011 10:21 UTC","Region":"Michigan","Tags":"City","Source":"MUFON","Object Shape":"Triangle"}