{"files":["/var/www/straped/mufon/html2text/27802.html.txt","/var/www/straped/mufon/org/27802.html"],"Source":"MUFON","Case Number":"27802","Log Number":"US-02132011-0007","trends":["There have been 9 other sightings in Elgin","There were no other sightings in Elgin on or around February 13th 2011"],"Viewing Distance":"Unknown","Region":"Illinois","City":"Elgin","Date Submitted":"02/13/2011 08:54 UTC","Date of the Event":"02/13/2011 06:30 UTC","Object Shape":"Flash, Triangle","Latitude":"42.045929","Weather Factors":"Unknown","Summary":"Long String of orange Lights in a V pattern","divs":["sighting detailsmy son and i were out snowmobiling and noticed a strange pattern of orange lights in a giant v shape off in the distance thinking they were just 12 aircraft in a hold pattern for ohare intl airport we drove up to a large hill and turned off the snowmobile to watch the lights. after sitting there for over 30 minutes the lights never moved from their location only their pattern changed. from a single row of lights in a v shape to a double row of lights that would split off from the original v. this is hard to explain but then the highest light\\object in the v shape pattern would start to rotate in a spiral clockwise pattern about 30 rpm then stop and become a single light in the sky.they are still visable in the sky and have been now for almost an hour. i am going to feel realy stupid if this turns out to be a hot air ballon event but i'm pretty sure they don't keep their burners on for an hour straight! gonna head out now with the old sony video cam with super night shot and see if that will pick up the lights. the flip video cam and my g1 cell can't even see the stars out tonight. wish me luck, if i can get them on video i'll follow up. wish me luck!"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.045929,+-88.27819(27802)&iwloc=A&hl=en\"> mufon case (27802) map </A>","Disposition":"IFO","Sighting Duration":"02:00:00","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Longitude":"-88.27819","Country":"United States"}