{"Log Number":"US-02142011-0015","Summary":"Chevron Shaped Object seen overhead","Date Submitted":"02/14/2011 10:28 UTC","Object Flight Path":"Undisclosed","Date of the Event":"02/14/2011 08:44 UTC","files":["/var/www/straped/mufon/html2text/27819.html.txt","/var/www/straped/mufon/org/27819.html"],"City":"State College","Country":"United States","Object Shape":"Chevron","Region":"Pennsylvania","divs":["Sighting DetailsSo my roommate and I were walking home from our friend's apartment, we had just started to watch a movie, The Vanishing, with Jeff Bridges. It is a remake of a film from 1988, it was released in 1992 I think, it was remade by the same director. Some people say that this version of the movie lacks the dark and cynical punch of the original, but we find that this one has an unintended comedic effect. Jeff Bridges' dialect in the movie is like a cross between doctor evil from the Austin Powers movies and, well, you get the idea. So we get a case of beer and some Olde English 40s and have some drinks when watching the movie. And it is a stereotypical 90s thriller movie. We even made a drinking game for it, where if you can correctly predict a movie cliche that is coming up, everyone drinks, but if you get it wrong, you drink twice. Like in one scene, (spoiler alert), jeff bridges is in kiefer sutherland's apartment to kidnap and kill his girlfriend, and I correctly predicted that his girlfriend would sense that someone was in the apartment, but would not be able to find him. So everyone drank. So I went out to my car to get my laptop just before the movie started, because I had a paper due the next day. We paused the movie, so we were only like 3 minutes in, and when I was out by the car, I heard this strange whirring noise coming from over the trees. I know that some people might think that they could mistake this for like, another car, a groundskeeping machine, or a heater or something. Well I know all of the sounds in that neighborhood, and it was not any of them. But I wasn't really that interested in it because I was really into this movie, because it was crappy movie night. (Explained earlier in the encounter) Thinking nothing of the noise, I went back inside with my laptop, charged it, put some popcorn in the microwave, and sat down to have a drink. Our friends were drinking light beer, and we were drinking malt liquor, because we feel like it is a better deal than the 12 pack of beer, though the 12 pack of beer is a little more convenient in case you do not want to drink it all, because, you know, then you don't have to open the whole thing and have it go to waste if you can't finish it. But we were reasonably confident that we would be able to finish it, because it was just one bottle of malt liquor. Just then, we heard some banging noises coming from the other room, and it was echoing throughout the house. My friend got really freaked out by it, but I knew that it was just the popcorn. (He's a really jumpy person.) So we get back into watching the movie, and I'm eating cookie cake because my birthday was a few days earlier and my mom sent me a cookie cake. Which, I know you're thinking, \"Hey, you're in college, why is your mom sending you a cookie cake?\" Well it was a nice gesture on her part, and my friends and I enjoyed it over a beer. It was actually a decent cookie cake too, it was reasonably thick, and was fresh. It was easily the best cookie cake I had ever eaten. Just then, about half an hour into the movie, there was a knock at the door, and the guy delivering the wings came and delivered the wings. While I was at the door, there were bright red lights coming from over the trees. They seemed to be in a distinctive pattern, but I was mainly focused on the wings, so I ignored them. And we went back to see The Vanishing, and at the end of the movie, jeff bridges tells kiefer sutherland that he has to drink some drugged coffee to see what happened to his old girlfriend. He says, \"Drink this,\" and at that point, every time he says that, we were supposed to drink. I won't ruin the ending of the movie for you, but our friend Matt was reasonably drunk. He had opened a bunch of beers, and then went for his first bottle of malt liquor, which is weird because he's kind of described himself as a connoisseur of beer, wine, and spirits. But whatever. After the movie was over, people were passed out on the ground, and others were going to a bar. The whole place was a mess. I started to clean up, and I opened the blinds of the window, and I saw a chevron shaped object hovering over the soccer fields next to my friends apartment. Then I came up with this plan where we would pretend that The Vanishing had disappeared in the mail, so we could keep it, and not send it back to Netflix. So we'll see how that plan works out. But it was definitely Chevron shaped."],"Latitude":"40.801225","Weather Factors":"Unknown","Sighting Duration":"02:30:00","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.801225,+-77.855811(27819)&iwloc=A&hl=en\"> mufon case (27819) map </A>","Case Number":"27819","Source":"MUFON","trends":["There have been 10 other sightings in State College","There were no other sightings in State College on or around February 14th 2011"],"Longitude":"-77.855811","Disposition":"Hoax","Viewing Distance":"Unknown","Tags":"City"}