{"Log Number":"US-02142011-0012","divs":["Sighting DetailsAs my son and I were sitting in the living room watching television I began to hear a quiet rumbling. It sounded as if someone was pulling up to our home. As i listened the rumbling became increasingly louder, as if I were at an airshow and their was a low flying aircraft sporting its after burners. I proceeded to run outside and look up into the sky. What I saw were two lights over a ridge that is not far from my home. They had the appearance of being stars but in that position in the sky there are typically no stars. Being as it was cold, I went inside and continued to look at the lights through my living room window. As i watched closer it appeared that the lights were moving slowly, one following the other. Just when i noticed that they were indeed moving the front one disappeared followed quickly by the second. At this point the rumbling noise had decreased quite significantly. As soon as i saw them disappear i ran back outside and looked toward where the lights had been. As I was staring i saw, what appeared to be extremley close, a \"shooting star\" which followed the path of the lights. After seeing this i did not quite know how to react. It was neat to see it but at the same time i want some answers as to what it was."],"Date of the Event":"02/04/2011 12:00 UTC","Source":"MUFON","Country":"United States","Object Features":"Unknown","Viewing Distance":"Unknown","Region":"Utah","City":"Vernal","Summary":"Two lights above a ridge and a \"shooting star\" following quickly behind them.","Date Submitted":"02/14/2011 03:43 UTC","Longitude":"-109.520918","Weather Factors":"None","Case Number":"27816","Tags":"City","Object Shape":"Star-like","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.459666,+-109.520918(27816)&iwloc=A&hl=en\"> mufon case (27816) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Vernal","There were no other sightings in Vernal on or around February 4th 2011"],"Latitude":"40.459666","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/27816.html.txt","/var/www/straped/mufon/org/27816.html"]}