{"Tags":"City","Disposition":"Unknown","City":"Arnold","Longitude":"-79.766715","Sighting Duration":"00:02:00","Latitude":"40.580067","trends":["There have been no other sightings in Arnold","This sighting has never been favorited."],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/27820.html.txt","/var/www/straped/mufon/more/27820_submitter_file1__black_triangle_ufo.jpg","/var/www/straped/mufon/org/27820.html"],"divs":["Sighting DetailsI had just come home from picking up a neighbor who had a false labor scare from Magee womens hospital. It was shortly after midnight, I dropped them off at their house and came around front to park my car. I exited the car in front of the house and when I went to close my door I realized that there was a bright light in the sky. I looked up and saw a triangular shaped object, off in the distance. It appeared to be black, with large lights on the corners, the sides of the object looked to be sharp and from my perspective I could also see a large center light which appeared to be shining down from the craft but appeared to stop before it made it to the ground, it was an intense beam of light. very bright, and the lights on the corners were less bright but still bright. The center light could be compared to the brightness of a large spotlight, while the corner lights were similar to high beams from a car. After approximately a minute or two of being completely stationary and silent, the crafts corner lights flashed and became very bright while the center light disappeared and it moved off very quickly and in about 1 to 2 seconds was gone and out of sight. I have attached a picture i found on the internet that is very similar to what I saw but the picture I uploaded does not have the dramatic center light in it."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.580067,+-79.766715(27820)&iwloc=A&hl=en\"> mufon case (27820) map </A>","Summary":"Triangular object seen overhead in Arnold PA","Weather Factors":"Unknown","Region":"Pennsylvania","Date of the Event":"Unknown","Object Flight Path":"Hovering then path","Case Number":"27820","Source":"MUFON","Date Submitted":"02/15/2011 12:45 UTC","Log Number":"US-02152011-0001","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Window(s)"}