{"divs":["Sighting DetailsHello again. The object observed this evening was a large bright orb off in the distance. My friend( who will remain annonymous at this time) and I decided to drive toward it. The whole while driving toward this round gold colored object it remained stationary as if observing something until we got up to it. Once we reached the object it began to slowly move away. At this time we noticed that there was a small amount of flashing behind the object. I have a small amount of video footage to put toward the sighting. Once the object went across the road it was no longer an orb. It was a very large multicolored craft with absolutely no sound what so ever. It flashed in a strobe like fashion. The colors seen were red, white, blue, and green. L.e.d like. Very beautiful. I knew exactly what the object was when I went toward it. Considering it was absent of sound. As low to the ground as it was I would expect to hear an awful lot of engine noise or helicopter noise but with this object there was nothing except a wonderful sight to see."],"Longitude":"-87.823422","Tags":"City","Disposition":"Unknown","Case Number":"27821","Date of the Event":"02/14/2011 07:45 UTC","trends":["There have been no other sightings in Cedar Grove","This sighting has never been favorited."],"Object Features":"Undisclosed","Date Submitted":"02/15/2011 12:36 UTC","Object Flight Path":"Hovering then path","Region":"Wisconsin","Weather Factors":"None","Object Shape":"Fireball, Flash, Saturn-like, Star-like, Other","City":"Cedar Grove","Summary":"closer each time","Sighting Duration":"00:25:00","files":["/var/www/straped/mufon/html2text/27821.html.txt","/var/www/straped/mufon/more/27821_submitter_file2__IMG_0176.JPG","/var/www/straped/mufon/more/27821_submitter_file3__IMG_0172.JPG","/var/www/straped/mufon/org/27821.html"],"Source":"MUFON","Latitude":"43.56972","Log Number":"US-02152011-0002","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.56972,+-87.823422(27821)&iwloc=A&hl=en\"> mufon case (27821) map </A>","Viewing Distance":"501 Feet - 1 Mile"}