{"Disposition":"Insufficient Data","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/27824.html.txt","/var/www/straped/mufon/org/27824.html"],"Date of the Event":"11/30/2010 02:00 UTC","divs":["Sighting DetailsOK, I can't believe Im doing this but I did see a UFO last December 2010 looking out on the back lake dock at Lake Giles in Orlando, FL. I did try to video tape it but it wasn't that great of a video to post. There is Orlando International Airport about 10 mins. south of me and I see planes and ect. all the time. This light was much differnt as I sat out on the dock with my dog I always look up at the sky and that night just before Christmas I saw a light in the sky slowly pulsating from white to red...it wasnt like any plane light I've seen many times. It was exciting for me enough to take a video of it now im not saying it was from another planet but I do believe that its crazy to not leave that open. When I was a kid around 1990 I live in Illinios and went out to watch the northern lights and saw 3 UFOs that I tried to get my parents to go out and see them too but they just sat in front of the TV laughing at me...then a few years later when I was in High school I was with a bunch of friends one night and one of them started talking about the UFOs she saw the night of the northern lights a few years back and I felt so much better that she saw the same thing I did and she was also very excited because she was made fun of and the 2 friends she was with when they told people. Now the ones I saw over 20 years ago were more convincing becauce they were closer to the ground in seemed and were triangle with a slow pulsating red light in the middle. They also moved allot fast then stopped and turned more 90 degrees..which i was only a kid back then but I knew better that that and how all other planes I saw fly. Again though it could be a secret government plane, but I dont rule out that its from \"somewere else\". If anyone else saw that same \"UFO\" over Orlando, FL it would be nice not to be alone."],"City":"Orlando","Object Shape":"Other","Case Number":"27824","Log Number":"US-02152011-0005","Date Submitted":"02/15/2011 03:58 UTC","Object Features":"Undisclosed","Latitude":"28.541256","trends":["There have been 112 other sightings in Orlando","There was one other sighting in Orlando on or around November 30th 2010"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.541256,+-81.370816(27824)&iwloc=A&hl=en\"> mufon case (27824) map </A>","Weather Factors":"None","Summary":"UFO in Orando, FL and one in IL when I was a kid around 1990","Region":"Florida","Country":"United States","Object Flight Path":"Undisclosed","Longitude":"-81.370816"}