{"Object Features":"Dome, Appendage(s)","Date Submitted":"02/15/2011 03:08 UTC","Weather Factors":"Unknown","Country":"United States","Latitude":"37.876023","Object Shape":"Diamond, Fireball, Teardrop","Tags":"City","Region":"California","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.876023,+-122.266597(27823)&iwloc=A&hl=en\"> mufon case (27823) map </A>","Source":"MUFON","Summary":"UFO seen over Bay Area in California and video of the object shot next to a freeway","Case Number":"27823","Longitude":"-122.266597","City":"Berkeley","Date of the Event":"02/12/2011 11:03 UTC","divs":["sighting detailsthis video was taken at 11pm in berkeley california. it is a recording of a orb-like ufo (on camera although i could make out a bizarre torch-like figure in the moonlight). the ufo caught my attention as i entered onto the i-80 freeway because the red light emanating off the object was too strong and steady to be normal. the light didn't flicker or change from its red, which usually happens with planes. so i kept my gaze as i drove (not a safe thing to do). had a feeling this craft wasn't normal so i pulled to the side of the freeway and began recording it through my opened window. now the coolest part, and maybe the most mysterious part of the video is, the ufo just disappears. this happens after you see it come next to the moon. now what i saw, and which the video does not show, is the ufo's red light slowly dimming or getting smaller as if it is turning it off or it rose in elevation fast enough to alter the size of the light to a significant degree. the object eventually disappeared. in the video, you can see that i got out my car to get a better angle of the object but nothing can be seen. i could see it with the naked eye still so that is why the video phone was still positioned at a particular place. the ufo was definitely not a typical craft nor was it a saucer shaped object. the video is my proof that what i am saying is absolutely true. check it out: *(link moved to additional evidence section--cms\\sg)."],"trends":["There have been 7 other sightings in Berkeley","There were no other sightings in Berkeley on or around February 12th 2011","This sighting has never been favorited.",""],"Disposition":"Unknown","Log Number":"US-02152011-0004","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/27823.html.txt","/var/www/straped/mufon/org/27823.html"]}