{"Date Submitted":"02/15/2011 12:37 UTC","Sighting Duration":"Undisclosed","Latitude":"35.223331","Region":"Arizona","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Country":"United States","files":["/var/www/straped/mufon/html2text/27832.html.txt","/var/www/straped/mufon/org/27832.html"],"Log Number":"US-02152011-0012","Longitude":"-114.223011","divs":["sighting detailscontinuation of event previously noted: there was so many i didnt think to count them until the ending of the event (which is still ongoing!) i was noticing several styles of orb's an ufo craft's. again since i have a sweeping 180 degree view of the valley i happen to be the lucky guy who got to see a spiritually mindblowing event! all night i stayed up watching them, trying to understand them. the one that was closest to me (approx 1\\2 mile) had the disc shaped craft as from what i could see was supervising the orb's to do its command? as i could see the craft darting all over the skyline an from what i could tell, communicating with the orb's. heres where it gets strange. i'm a witness to a historical event! as i stated, it got strange, i heard a voice in my head stating, \"do not be afraid!\" and i communicated a thought back to them,it,whatever! \"i'm not afraid!\" i will not harm you! just, please, do not go away! an i'm not sure if that communication was rec'd back? but i was so sure this \"voice\" was close to me, that after i had time to consider the mental implication's of what happened i actually started to think that the voice had to of been sent from behind me as i am backed up to the black mountain's i think the \"voice\" came from secret pass, which is behind my position an to my left.yet it was inside my head! i am part abenaki indian an something inside of me tells me these are ancient being's? i also wish to add that the feeling of wanting to defend them if nessessary also went thru my mind? an last night at approx 9:21 pm i had the feeling i was looking directly at the \"leader's\" craft, as it was gold toned and of course the flashing light's were very apparant almost like how our military leader's where their medal's an ampulets on their attire was the distinct way this craft looked an acted. all biz! an as they were all over the sky's, so to was this craft! an it appear's as they begin their upward accent this is done slowly as if their \"collecting\" something. we mere human's only at best get to see the bottom of the craft's an automatically assume, ah, its just a star. a very clever camoflauge! an the extraordinary thing is these craft never ever made a sound! until i thought to get out my native flute an strike a few cords to see if i could get any possible flashing directed back to me, but uh nope, sure didnt, i got a weird sound directed back to me, as if to say, \"this is what i listen too!\" from them. i truly hope my new found friend's are coming back tonite because i have slept lil since they burst onto my view! my scottish blood that love's machine's, is so badly wanting to learn their engineering way's! also, i am not completely sure that the ufo's have to be near a military operation, a ancient site, and also some other parameter to be seen? i think these \"being's\" are capable of going anywhere! but the fact is kingman used to be a army base for testing stuff, missle's etc. an for the fact that behind my position here at the shack there is in the black mountain's, an old indian burial cite. are they gathering some \"energy\" from the ground? are they getting energy's from where the missile testing was done? is there something they collect from the power station's? also, i noticed two (every night) thus far, of the disc shaped craft's sit in the sky an simply hover between the opening of the valley on the kingman side an are possible sentinel's? while the \"other's do their \"mining\"? an thats the rationale i gave it from being able to view the operation. an at first, from the beginning a part of me felt as though they were looking for something. from where they would hover, but then i changed my opinion in it after viewing the entire 5 night affair, that they are working, gathering something. whichever the case, this is definately extrordinary an am grateful to bear witness to it! i see that i'm out of space to type, an so much more!"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Summary":"seemed to be 3 different styles of ufo's an orb's up to 134","map":"<A HREF = \"http://maps.google.com/maps?q=35.223331,+-114.223011(27832)&iwloc=A&hl=en\"> mufon case (27832) map </A>","Case Number":"27832","City":"Golden Valley","Weather Factors":"None","Disposition":"Unknown","Date of the Event":"02/15/2011 12:00 UTC","Tags":"City","Object Shape":"Cone, Circle, Disc, Egg, Oval, Sphere, Square, Rectagular, Star-like, Triangle, Other","Object Features":"Dome, Patterned Surface, Insignia, Appendage(s), Wings, Other","trends":["There have been 6 other sightings in Golden Valley","There were no other sightings in Golden Valley on or around February 15th 2011"]}