{"Case Number":"27836","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around February 13th 2011"],"Viewing Distance":"Over 1 Mile, Unknown","Region":"Oklahoma","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27836.html.txt","/var/www/straped/mufon/org/27836.html"],"City":"Oklahoma City","Longitude":"-97.388661","map":"<A HREF = \"http://maps.google.com/maps?q=35.510933,+-97.388661(27836)&iwloc=A&hl=en\"> mufon case (27836) map </A>","Object Shape":"Circle, Star-like","Object Features":"Unknown","Latitude":"35.510933","Date of the Event":"02/13/2011 06:20 UTC","Country":"United States","Tags":"City","Date Submitted":"02/15/2011 02:50 UTC","Weather Factors":"None","Disposition":"Unknown","divs":["Sighting DetailsTraveling west on 23rd Street from Douglas Street coming from the Walgreens Store. We past Spencer Road and I noticed what looked like contrails out it seemed in western OKC or further. But I could not see any planes. I told my husband who was driving to look. We counted 7 of what we thought were contrails. Then we thought maybe comets or space debris hitting the atmosphere. They were coming in in all different directions. They were going very fast and very high up. We decided to pull over just past Mid West Blvd. Then we noticed to the left a jet fighter passing by with the same type contrails. He was to high up to have taken off from Tinker. We just kept looking then we noticed a star like object to the right of the road. Then another one to the left of the road. This was right before the sun was setting. Then the one on the right side of the road moved to where the other one was. And back and forth. Then the left one moved, but we didn't notice it move as much. We just sat in the car and watched as another jet past us to the left going in the same direction. The lights just kept dancing in the sky while it seemed that jets were watching them. We decided to try to get a better view but as we drove further down 23rd we lost the view as we were going downhill. When we got back to a hill, we did not see any of it anymore. We did not have the camera with us."],"Sighting Duration":"00:12:00","Summary":"Moving Stars","Log Number":"US-02152011-0016"}