{"Sighting Duration":"Undisclosed","Object Shape":"Cone, Circle, Disc, Flash, Oval, Sphere, Star-like, Teardrop, Triangle, Other","Disposition":"Unknown","divs":["Sighting DetailsAn incredible event which started last thurs at 1am I noticed a trapazoidal shaped object over whats called Castle Rock, estimate is 50 ft at its widest point hovering above the mtn top, flashing white,red,blue,yellow,green lights.I watched closely thru my spotting scope from my front yard at the base of the Black Mtn foothills on the other side of the valley, slowly the craft started unfolding itself into an hourglassed shape outlined in blue an the what I would term the body a beautiful lavender color. The shape ended up looking like a pyramid top touching a pyramid top but flat.(I also have a witness to this event)seemed to swirl around the air an flutter over the mountaintop to what appeared to be the middle of the valley approx 3500ft in the air over the Maverick Store where it cont'd in its hourglass shape, after 20 minutes it went an reconstructed itself back into its trapazoidal shape craft an began its upward climb very slowly an from my vantage point I was able to focus in on it an as it went overhead I saw a white light an this was I considered a great camoflauge accent because you are not able to see the lavender an blue coloration of flashing lights as it appears to look like a everyday run o the mill star. Day 2 - Began with 2 flashing orbs located somewhat near kingman,AZ an again I watched them closely thru my spotter scope an as I watched them I at that time realized there was many more of these orb's in different areas so I strained my scope an sure enough started noticing many orb's! ALL across the Valley, behind me down to BHC, down to past Mohave Valley, all the way over to Yucca on the otherside of the valley as far to the laft of me as Chloride! I also saw an encounter with a regular plane an which that pilot made 3 fly-by's an it occurred to me that there is a good poss that pilot's cant see them if their above them!"],"Country":"United States","Latitude":"34.052918","trends":["There have been no other sightings in Golden Valley,Kingman,Yuc","This sighting has never been favorited."],"Summary":"started 5 days ago","Log Number":"US-02152011-0010","Tags":"City","files":["/var/www/straped/mufon/html2text/27830.html.txt","/var/www/straped/mufon/org/27830.html"],"Longitude":"-111.089611","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Case Number":"27830","Date of the Event":"02/14/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.052918,+-111.089611(27830)&iwloc=A&hl=en\"> mufon case (27830) map </A>","Source":"MUFON","Weather Factors":"None","City":"Golden Valley,Kingman,Yuc","Region":"Arizona","Object Features":"None","Date Submitted":"02/15/2011 11:40 UTC"}