{"Date of the Event":"01/05/2011 12:00 UTC","Object Features":"Undisclosed","Latitude":"55.869147","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27835.html.txt","/var/www/straped/mufon/org/27835.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI showed my mum the Jerusalem video very quickly as she was standing in the hall way because i thought it was interesting, she then replyed- \"that is the exact thing me and that lady saw standing outside the bingo hall that i was telling you about\" thats when i remembered she told me a couple of weeks ago she saw a glowing orb like ball of light beside 4 or 5 flashing lights, she said she watched them for a few mins before the clouds coverd them. She also said that the lady next to her said \"can you see what i'm seeing\" and my mum replyed \"yes\" I dont know if that video posted on youtube about the ball of light is fake or not but i was very surprised my mother knew what it was. My mother told me how herself and that lady standing having a cigarette, during the bingo interval were the only ones outside and how she wished at that moment she had a video or a phone. My mum is not interested in that sort of thing, and i only ever look at the odd videos recomended on the net. And find it a wierd coincidence that she related to it."],"Longitude":"-4.247586","Viewing Distance":"Unknown","Object Shape":"Unknown","trends":["There have been 22 other sightings in Glasgow","There were no other sightings in Glasgow on or around January 5th 2011"],"Tags":"City","Country":"United Kingdom","Date Submitted":"02/15/2011 02:02 UTC","Summary":"my mum saw the exact same thing as the jerusalem video posted jan 2011","map":"<A HREF = \"http://maps.google.com/maps?q=55.869147,+-4.247586(27835)&iwloc=A&hl=en\"> mufon case (27835) map </A>","Log Number":"GB-02152011-0015","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Case Number":"27835","Region":"Scotland","City":"Glasgow"}