{"files":["/var/www/straped/mufon/html2text/27837.html.txt","/var/www/straped/mufon/org/27837.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.517413,+-112.010202(27837)&iwloc=A&hl=en\"> mufon case (27837) map </A>","Object Flight Path":"Stationary,Hovering then path","Region":"Utah","Longitude":"-112.010202","divs":["Sighting DetailsIt was night and my kids and I were just getting things cleaned up in the house when my 9 year old went outside to take the trash out when he came running in yelling for me to come outside he sees a UFO. I told him to stopped playing and to help clean he kept at me and kept at me so I figured okay go with it. So I went outside and he showed me where it was and i told him that it was a plane then i second guessed myself and said no that aint its got green red and white init so then i told him it just a helicopter then well i noticed it was NOT MOVING i figured okay this is tooo weird. I knew that there was no such thing. But i am rethinking that now. I dont know how to explain its shape other than it was like the ones on the movies. The thing just sat there in the sky i got my binoculars and looked through them and the bottom was moving REALLY REALLY slow but it just sat in the sky. my kids are believeing in UFO's but me I really dont know i just think that if i had more to see or proven i would believe. I never lost sight but i gave up and went to bed at about 10:30 11 o'clock and it was still there"],"Tags":"City","Country":"United States","Case Number":"27837","Log Number":"US-02152011-0017","Latitude":"41.517413","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"02/14/2011 07:50 UTC","Object Shape":"Disc","Viewing Distance":"Over One Mile","City":"Brigham City","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Appendage(s)","Date Submitted":"02/15/2011 02:57 UTC","trends":["There have been 2 other sightings in Brigham City","There were no other sightings in Brigham City on or around February 14th 2011"],"Summary":"changing light colors very still"}