{"Sighting Duration":"Undisclosed","Log Number":"CA-02152011-0020","Disposition":"Unresolved","Object Features":"None","Case Number":"27840","Latitude":"51.260865","Country":"Canada","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=51.260865,+-85.314654(27840)&iwloc=A&hl=en\"> mufon case (27840) map </A>","Date of the Event":"02/15/2011 12:00 UTC","Object Shape":"Disc","trends":[""],"Region":"Ontario","Viewing Distance":"101-500 Feet","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI was just out driving my friend home who lives down the street from my house. As I turned onto my street something caught my eye. I looked up and saw what looked like a frisbee in the air and I didn't really think anything of it. Then I realized it was maybe a hundred or two hundred feet up and keeping a steady height. So instead of going home I followed it and saw that it was a red disc almost like one of those automated vacuum robots. It was completely silent, I rolled down my window to hear it and it was pretty close over my head. It was probably only a few feet in diameter and it was traveling horizontally, not vertically meaning it was not a balloon. It also didn't shake in the wind, it moved flawlessly but it wobbled as it flew, almost like when frisbee or disc is wabbling on the ground. What also caught my attention is that it was flying literally over the same streets and area as the only other UFO I've ever seen. I am completely baffled at this one because when I saw it I figured it had to be fake but I ruled out every possible option as I was following it. There didn't seem to be any features on it. It was close enough so that I could tell it had a smooth red surface. I'm going to search red wabbling disc videos and pictures that look like it so I can give you guys an idea of what I'm talking about. I lost it after about 45-60 seconds when I got to the bottom of the street because it was a dead end. I turned right to go to my friends house as I was calling him so it was behind me and when I stopped and got out to look for it I couldn't see it anymore but it would make sense because of it's size. Yes I did think of taking pictures but no I didn't get any. That was actually the first thing I thought of and I was about to run home first to get my moms good camera but I didn't want to lose it so the only camera I had was my LG Rumor camera which is absolutely terrible and is actually the same camera took the terrible pictures in thread I linked to. Although the disc was close enough and big enough in the sky so that it would have captured it but my memory was full and my battery was about to die so it unfortunately wouldn't let me take pictures... Just a side note, when I called my friend as this was happening, the phones kept cutting out and lost signal multiple times. I attached a picture of an iRobot automated vacuum. It looked like this but it had a larger diameter."],"Object Flight Path":"Straight-line path","City":"Undisclosed","Summary":"a frisbee in the air","Longitude":"-85.314654","files":["/var/www/straped/mufon/html2text/27840.html.txt","/var/www/straped/mufon/more/27840_submitter_file1__wobble.jpg","/var/www/straped/mufon/org/27840.html"],"Date Submitted":"02/15/2011 05:14 UTC"}