{"Date of the Event":"08/22/2010 09:00 UTC","Summary":"First UFO Family Sighting","files":["/var/www/straped/mufon/html2text/27845.html.txt","/var/www/straped/mufon/org/27845.html"],"Weather Factors":"Unknown","Date Submitted":"02/15/2011 11:44 UTC","Viewing Distance":"Unknown","Case Number":"27845","Object Features":"Undisclosed","Log Number":"US-02152011-0023","Region":"Nevada","divs":["Sighting DetailsI live in North Las Vegas, Nevada and in the beginning of last August for a week I saw a metallic round object appearing and disappearing in the sky around the park where I take my walks every day around 9 AM to 10:30 AM. I told my husband when he went to walk the dog to please check the sky around that area also because I thought I was loosing it. That Friday my husband came back to the house all excited because he saw it as well. We decided to ask our son ,since he has a video-camera, to come with us on a family UFO hunting picnic, to see if we could see the object and film it. That Sunday morning we got there at 9 AM, we saw the UFO five times. My son got it on video twice and exactly what we saw is the video I am sending you. I'm not saying it is ours and I'm not saying that it is not ours I'm saying that I don't know. What you are going to see in the video is exactly what we saw. I would appreciate it if you would be so kind as to give me your opinion. Thank you for your time and effort."],"Longitude":"-115.110001","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around August 22nd 2010","This sighting has never been favorited.",""],"Object Shape":"Disc, Sphere","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.199869,+-115.110001(27845)&iwloc=A&hl=en\"> mufon case (27845) map </A>","Latitude":"36.199869","City":"North Las Vegas","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed"}