{"Object Flight Path":"Unknown","Summary":"Triangle Object w/huge \"suction cup-like\" light ar","Date Submitted":"01/07/2004 07:30 UTC","Region":"Georgia","Sighting Duration":"00:05:00","Log Number":"","Weather Factors":"Unknown","Date of the Event":"01/07/2004 07:30 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.002879,+-84.144638(2784)&iwloc=A&hl=en\"> mufon case (2784) map </A>","City":"Duluth","Disposition":"Unknown","divs":["Sighting DetailsNarrative of witness provided to MUFON.------------------------------------------------------ I was in Duluth, GA in my neighborhood, coming home from a friends. I wasadmiring the beautiful, clear sky and the outrageously full moon. All of asudden I noticed these bright, white lights sorta of glide by. It happened soquickly that it caught me off guard. When I realized that the object attachedto the white lights was triangular, and large, I watched it for a few secondsand quickly turned onto my street. At first I thought a big stealth (craft), itjustlooked really big and those lights were bright and had a circular ring aroundthe large round light in the middle of the suction cup. At that point we weretravelling parallel to each other. It was ahead of me and a little above thetrees. I sped up and realized it was going faster than it seemed. At one pointthe trees blocked it and then it reappeared. By the time I reached the end ofthe street, it started to ascend and bank ever so slightly and easily to theleft. All the time I could see the four huge suction-cup-like lights underneathit. One at each point of the triangle and one sort of in the middle.and then it was gone.During all this I was trying to get my cell phone out of my purse to call myfriend to hurry and run into the street, but it fell out of my hands onto thefloorboard.My windows were up and the radio on, so I dont know about the noise. When Ireached the end of the street, there were two neighbors standing on the cornerwith their dogs. I didnt ask them if they just saw what I saw, I just keptgoing around the block. I may go down and ask them tonight.That is pretty much it.When I got home, I called my friend, the police, Channel 11 (local NBC) and theFernbankScience Center. Nobody had any other calls about the object. My friend saidwhat I described sounded like other sightings in the past three years.I saw a UFO in the late 60s, but it was very different shaped.....round, with adome on top of it with a bank of windows. This object was very different, verylarge."],"Object Shape":"Triangle","Longitude":"-84.144638","Country":"United States","trends":["There have been 4 other sightings in Duluth","There were no other sightings in Duluth on or around January 7th 2004"],"Viewing Distance":"101-500 Feet","Source":"MUFON","Case Number":"2784","files":["/var/www/straped/mufon/html2text/2784.html.txt","/var/www/straped/mufon/org/2784.html"],"Object Features":"Appendage(s), Other","Latitude":"34.002879"}