{"Source":"MUFON","Object Shape":"Bullet, Missile, Disc","trends":["There have been 2 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around February 14th 2011"],"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Summary":"I could swear I seen 2 flying saucers leave the air base and disappear in the clouds ...they looked like silver bullets","Latitude":"34.86882","Case Number":"27841","City":"Jacksonville","Date of the Event":"02/14/2011 12:00 UTC","divs":["sighting detailsit was valentine's day, february 14th, 2011.it was around 2:00 - 2:30 pm. i seen something, i don't know what they were but they didn't have wings or a tail, they were silver and large like 747's and they went straight up, and when i stretched back in my chair to get a better look at them they appeared flat...they went up into a cloud and disappeared, no chem trail...nothing just gone. 1.) where were you and what were you doing at the time? i was sitting at my kitchen table taking a break from my housework. i was looking out my carport door which faces a horse field owned by the air base. 2.) what made you first notice the object? the way they lifted off from behind the tree line-about 1 1\\2 miles from my carport door. the runways are about 5 miles from my home. 3.) what did you think the object was when you first noticed it? i thought it was planes. 4.) describe the object and it's actions and motions. there was 2, they appeared to lift directly off the ground rather than a forward uplift. the closest being further behind than the second one-they were silver , like aluminum, no markings and no lights. the top tips looked smaller as in bullet shaped, they were very large, like 747's, no wings and no tails. i stretched back in my chair to get a better look at them and they appeared flat, at that point they looked to be in perfect unison-side to side with a little distance between them. i watched them disappear into the clouds and they did not come back out. no chem trails...nothing. i watched from my carport door several more minutes and seen nothing else of them. 5.)describe your feelings, reactions and actions, during and after sighting the object. during the sighting i just felt like...what the heck was that? after about an hour i felt slightly depressed and on edge for a few hours. 6.) how did you lose sight of the object? they went into the clouds and never came back out."],"Region":"Arkansas","Longitude":"-92.101146","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.86882,+-92.101146(27841)&iwloc=A&hl=en\"> mufon case (27841) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/27841.html.txt","/var/www/straped/mufon/org/27841.html"],"Log Number":"US-02152011-0021","Date Submitted":"02/15/2011 05:24 UTC","Object Features":"Undisclosed","Viewing Distance":"Over One Mile"}