{"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Features":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsWell I thought because of the rain they may not be back. But I kept the search up just the same an finally after an exhausting search located 2 almost hidden in a small canyon virtually hidden next to the Hualapai Mtn range on the kingman side. There was no orbs this time that I could see an however I finally got some credible footage to document the event from the start where I found them all the way to the trip upwards to the heavens. All 3 used the mesa across the valley from me to make their exit. Sorta like their launch pad. These are again the same as the previous nights, flashing bubble gum machine lights on top but again, only 3 this time much to my dismay. An they must have a way to communicate with each other from far away as the first two left one after the other an it wasnt till an hour an a half later the 3rd one appeared an had to have been working the northeast side of the valley because that are is beyond my scope reach an I didnt notice it until later when it went to go up to the heavens after the other 2. Since they were in an entirely different part of the valley its my belief that its 2 choices, either their mining something that we don't see or their looking for something. But the fact they were located in a not very busy part of the valley an few houses but yet they were right on the outskirts of Kingman township. An it could be purely an observation mission but for the fact the terrain they were in was rather obscure to see much that they havent already seen from above. An they were at one point near the summit of the mtns. Yet they chose to remain away from the airport an the lights? So my thoughts are they are mining or gathering some strange energy source that we have yet to discover. An then same as the previous night's, they took off. I tried to stay awake long enough to see where they were picked up in the stratosphere at but I was too tired and plus the cloud cover was scattered so the viewing ceiling was under 10k ft. (I'm estimating) I'm going to keep up the same vigil tonight an again hopefully bring more light on the subject matter but its been the same routine except different part of the valley. Jim, I do have video this time!"],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/27855.html.txt","/var/www/straped/mufon/org/27855.html"],"Country":"United States","Summary":"finally they came in from the other side of the vallley but only 3","Tags":"City","Source":"MUFON","Longitude":"-114.048256","Case Number":"27855","Log Number":"US-02162011-0010","Sighting Duration":"Undisclosed","Object Shape":"Cone, Disc, Sphere, Other","trends":["There have been 35 other sightings in Kingman","There was one other sighting in Kingman on or around February 15th 2011"],"City":"Kingman","Date of the Event":"02/15/2011 12:00 UTC","Weather Factors":"None","Region":"Arizona","Latitude":"35.196993","Date Submitted":"02/16/2011 12:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.196993,+-114.048256(27855)&iwloc=A&hl=en\"> mufon case (27855) map </A>"}