{"Region":"Connecticut","Country":"United States","City":"West Hartford","Date Submitted":"01/07/2003 10:00 UTC","Case Number":"2785","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.771784,+-72.733875(2785)&iwloc=A&hl=en\"> mufon case (2785) map </A>","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was driving south on Trout Brook Drive in West Hartford CT around 10 PM on172004 and I saw two very bright lights in the sky, hovering and moving slowlyabout 300 feet above the ground. As an avid sky watcher, I am familiar with allof the planets and constellations and I know I did not mistake these objects for93Venus94 or anything. The moon was full, high in the sky and the sky was crystalclear. I thought at first that they might be helicopters, but they were movingin a way that I have never seen a helicopter move...hovering slowly in a sort ofcircular motion One of the objects started moving away and I lost sight of it,so I focused on the other. I had to turn my car around and follow it and itturned from one bright object into a triangular shaped form with three whitelights on each corner of the triangle and a few blinking red lights on it. Ipulled my car over to the side of the road, as did a bunch of other people totry to get a better look. I rolled my window down to see if I could hearanything, but it was completely silent. If it was a plane or helicopter, it wasclose enough where I would have definitely heard something. At this point itwas much lower, probably 75-100 feet off the ground. It hovered and movedslowly and I continued to watch it for another couple minutes until itdisappeared behind the tree line and I lost sight of it. Because of thelighting on the ground, I had a bit of a difficult time trying to decipher thedimensions, but I would have to guess that it was about 20 to 25 feet in lengthand about 10 feet in height. It looked like it was black, but being dark, I92m not completely sure."],"Disposition":"Unknown","Latitude":"41.771784","Object Flight Path":"Stationary","Summary":"2 Triangular Crafts Seen","Date of the Event":"01/07/2003 10:00 UTC","Longitude":"-72.733875","files":["/var/www/straped/mufon/html2text/2785.html.txt","/var/www/straped/mufon/org/2785.html"],"trends":["There have been 4 other sightings in West Hartford","There were no other sightings in West Hartford on or around January 7th 2003"],"Object Shape":"Triangle","Sighting Duration":"00:10:00","Log Number":"","Source":"MUFON","Weather Factors":"Unknown","Tags":"City"}