{"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=35.193723,+-114.047656(27857)&iwloc=A&hl=en\"> mufon case (27857) map </A>","Object Features":"Undisclosed","trends":["There have been 35 other sightings in Kingman","There was one other sighting in Kingman on or around February 14th 2011"],"Case Number":"27857","City":"Kingman","divs":["Sighting DetailsThis is my first report on the sightings here in Golden Valley. It is a regular occurrence and because of the reports that someone else has made on the area I decided to report as well. This has been happening out here for years! Me and my wife have lived in Golden Valley now for about 10 yrs and it's always the same, Amber colored silent orbs going across the sky, Usually North West to South East. Recently In the South East we have been seeing Reddish Orange Orbs dancing above the Hualapai Mtn range's. I'm judging it's the Hualapai's but am unsure. The sighting's are random but when they occur they are in the same area, always. \"shimmering\" best describes their behavior. One will show then more will appear either to the side or above the first one. This time one appeared above the others and in a \"domino effect\" type of display Two or three rose diagonally upward then faded out. It's almost as if they materialize individually then fade out but that they are all part of the same group. It rang a bell about the couple that were coming from Las Vegas to Phoenix on Hwy 93 seeing the same objects to the South East, very interesting. For some reason Golden Valley is having a flap. I will document what I can and report when I can."],"Latitude":"35.193723","Log Number":"US-02162011-0012","Longitude":"-114.047656","files":["/var/www/straped/mufon/html2text/27857.html.txt","/var/www/straped/mufon/org/27857.html"],"Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Sphere, Star-like","Region":"Arizona","Date Submitted":"02/16/2011 02:17 UTC","Tags":"City","Country":"United States","Summary":"Shimmering Reddish Orange Orb's In the South East.","Disposition":"Unknown","Date of the Event":"02/14/2011 12:00 UTC","Viewing Distance":"Over One Mile"}