{"Date Submitted":"02/16/2011 08:54 UTC","trends":["There have been 3 other sightings in Bandera","There were no other sightings in Bandera on or around February 15th 2011"],"Summary":"UFO sighting with loud jet like engine sound","Sighting Duration":"00:01:00","divs":["Sighting DetailsLast night I was watching tv and i heard something very unusual in this area of the hill country near Bandera Tx. We arent in any flight plan and never see jets fly over here. The sound was like a commercial jet flying low. At first I thought it was plane crashing. I muted the TV to hear it better. It lasted about 1 minute then went quiet. Then got loud again so I went outside to look expecting to see an explosion or something. I didn't so I looked up and saw this light in the sky moving horizontally then it did a sharp 180 and as it turned back,I saw a rounded side gray colored reflecting off the moon kinda looked partially invisable or \"cloaked\" and then it went straight up. I could only see it going up a short time must have went into the clouds. The whole time I could hear a really loud jet sounding engine which got quieter as it ascended into the sky. I noticed in all the other posts nobody reported hearing anything.The only way I can explain the sound is it was like sitting at the end of a runway with jet flying over you. When I saw it shoot straight upwards I was saying , \"Oh my god\" over and over and started feeling like I just saw god or something. It was very exciting! My husband came out when I was yelling Oh My God!! He didnt see the light but he could hear the loud sound and still cant explain it. We both listened for about another minute till it was gone."],"Longitude":"-99.069856","Source":"MUFON","Log Number":"US-02162011-0016","Country":"United States","Object Features":"Unknown","Case Number":"27862","map":"<A HREF = \"http://maps.google.com/maps?q=29.736193,+-99.069856(27862)&iwloc=A&hl=en\"> mufon case (27862) map </A>","Date of the Event":"02/15/2011 08:36 UTC","Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","Latitude":"29.736193","Weather Factors":"None, Does Not Apply","Region":"Texas","City":"Bandera","Tags":"City","Disposition":"IFO","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/27862.html.txt","/var/www/straped/mufon/org/27862.html"]}