{"Summary":"3 objects flying in formation in Vegas one returned","Weather Factors":"Does Not Apply","Disposition":"IFO","Object Flight Path":"Path with directional change","Tags":"City","Date of the Event":"02/12/2011 02:00 UTC","City":"Las Vegas","Viewing Distance":"Unknown","Region":"Nevada","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.118016,+-115.163026(27869)&iwloc=A&hl=en\"> mufon case (27869) map </A>","Sighting Duration":"Undisclosed","Case Number":"27869","Object Shape":"Circle","Date Submitted":"02/17/2011 01:00 UTC","Source":"MUFON","Log Number":"US-02172011-0005","Longitude":"-115.163026","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around February 12th 2011"],"files":["/var/www/straped/mufon/html2text/27869.html.txt","/var/www/straped/mufon/org/27869.html"],"Object Features":"None","divs":["Sighting DetailsThis past weekend I was in Vegas at Sam Boyd Stadium for the IRB 7's tournament. During the afternoon matches I glanced up to the sky and was dumbfounded by three circular objects flying in a \"V\" formation moving to the NE. The objects had the afternoon sun reflection so they appeared to be white. I watched them curiously as they were travelling at a high rate of speed. They continued passing through the sky and suddenly one object moved directly north with the other two remaining in formation. The objects soon became out of sight and I continued watching the match. I was questioned by one of my friends as to what I was looking at and I told him. He was unable to focus on them as the objects left my sight. My only thought was that it was an odd occurance. I immediately thought of the many things it could have been including baloons being caught in the wind however the tight formation couldnt explain that nor could the movement of one of the objects moving directly and abrubtly north keeping the high rate of speed. I continued watching the match, glancing occassionaly upward. Approximately 30 seconds to a minute later one object perfectly matching the previous description travelled in the complete opposite direction at the same high rate of speed. My theory of the wind carrying a baloon was immediately shot. I attempted to point out the object to my friends but the speed was so great they had no idea what to look for. That was it. I realize there could be many explanations to this but to me it met the definition of Unidentified Flying Object simply because I have no idea what it was. Aircraft were flying in the sky the entire day but nothing close to what I have described. I would greatly appreciate an identification should one be confirmed."],"Latitude":"36.118016"}