{"Case Number":"27879","Latitude":"42.221928","files":["/var/www/straped/mufon/html2text/27879.html.txt","/var/www/straped/mufon/org/27879.html"],"divs":["Sighting Details i was looking out thru my front door window,and seen what at first glance seemed to be an unusually bright light i first considered it to possibly be an airplane i fixated the object at a point in the window pane i was looking thru,not seeing any movement iconsidered it to somehow perhaps be a star,however it seemed rather large and too bright as well as being seemingly close for a star. after viewing for approx. 5 min i finally seen some planes in the distance to relate to this object, they were clearly airplanes higher than the object further south with blinking red lights and they were moving unlike the object that was stationary in comparison.i went to my computer to see if i could find any news of this sighting 5 min later clouds had rolled in sky became daylight and nothing else to report other than my sighting was in the southeastern view from my vantage point,prior to looking out and viewing this object i had awaken and was watching television,i did'nt see movement or description other than bright light,i felt as if i was seeing something highly unusual and i could'nt help but wonder if the planes i saw also could be viewing this object from their location and proximity,afterwards i called a friend to tell her about it she was somewhat freaked out but certainly beleived my sighting to be more than a star or anything either of us have an explanation for."],"Country":"United States","Date Submitted":"02/18/2011 08:20 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.221928,+-83.184925(27879)&iwloc=A&hl=en\"> mufon case (27879) map </A>","Tags":"City","Source":"MUFON","Object Flight Path":"Unknown","Weather Factors":"Unknown","Object Shape":"Unknown","Sighting Duration":"00:10:00","Longitude":"-83.184925","Date of the Event":"02/18/2011 06:30 UTC","Disposition":"Unknown","Region":"Michigan","Log Number":"US-02182011-0001","trends":["There have been 2 other sightings in Southgate","There were no other sightings in Southgate on or around February 18th 2011"],"Summary":"bright light","Viewing Distance":"Unknown","City":"Southgate"}