{"Object Flight Path":"Path with directional change","City":"Overland Park","Country":"United States","Case Number":"27885","divs":["Sighting Details1. I was in the parking lot of Scooter's Coffee about 30 minutes after a fireworks show at Corporate Woods. The exact address the parking lot was : 11106 Antioch Road Overland Park, KS 66210-2420 2. I was sitting in my car with the windows down with my girl friend and I looked up at the sky because I love looking at the stars at night especially waiting for the traffic to leave the parking lot. 3. At first, I thought I was just seeing another fire work or burning ash from a firework but it was thirty minutes after the show and the light never burned out. 4. It started about a mile or so north of were I was. It slowly and I mean really slowly started moving south. If I could guess how fast it was moving I would say about five to ten miles an hour. As the UFO for about 10 minutes kept moving slowly south at the same slow speed it then made an exact 90 degree turn east moved about 100 to 200 feet east then made another 90 degree turn back north. It spent another two minutes going slow back north from which it came and all the sudden it left a warp streak in the sky and was gone. 5. At first I thought it was just ash but then I felt confused about how this ash never burned out. Then I started to get excited because I have seen two UFO sightings before but never for this long and clear. I just frustrated afterwards that I didn't bring a camera to document it. 6. I lost sight of the UFO when it when into light speed and left a brief orange streak in the air."],"Summary":"Orange light ufo sighting on the Fifth of July 2010","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.985328,+-94.664192(27885)&iwloc=A&hl=en\"> mufon case (27885) map </A>","Sighting Duration":"00:15:00","Region":"Kansas","Longitude":"-94.664192","Date Submitted":"02/18/2011 08:07 UTC","files":["/var/www/straped/mufon/html2text/27885.html.txt","/var/www/straped/mufon/org/27885.html"],"Disposition":"Unknown","Date of the Event":"07/05/2010 10:00 UTC","Weather Factors":"None","Log Number":"US-02182011-0007","Source":"MUFON","Object Features":"None","Latitude":"38.985328","trends":["There have been 34 other sightings in Overland Park","There were no other sightings in Overland Park on or around July 5th 2010"],"Viewing Distance":"Unknown","Tags":"City"}