{"divs":["Sighting DetailsI was bow hunting on a private farm in Agency, Missouri ( Buchanan County )October 5th 2005. I list the time of encounter to be that of approx 1 hour but I would estimate that it was actually longer in retrospect. I was sitting in a fixed position behind a downed tree on the north side of 2 large fields and had a clear view or both, as well a corn silo and farm equipment directly across from me on top of a hill which was approx 500 yards from my location. At approx 4:00 pm I noticed a large thin object approaching the corn silo on the hill. It appeared at that point to be the size of a half dollar at arms length when held horizontally. At that time to me it appeared to be a large military plane heading north towards my location and my view was that of looking at an airplane heading towards me. I resumed my hunting looking for any deer in the area, then with some elapsed time I looked back towards the object,and it was still there and at that point made me somewhat curious because it did not appear to have not progressed towards my location at all. It was one of those moments that you just say hmmmm and I continued my hunting. I scanned the fields and noticed a farmer combining his field on the adjacent property approximately 600 to 700 yards away. I then looked back towards the silo and noticed the craft had advanced a little closer though and appeared to me to be now above the silo and larger then a silver dollar at arms length. I became more interested as being use to seeing aircraft fly by out towards Kansas where Roscrans Air Guard is located, I surmised that this was unusual because of the amount of time that had passed and the lack of ground it had covered. It had been approx 15 to 20 minutes at this point and any other aircraft would have flown past sometime ago. The object had my attention now but being the hunter that I am, I did another scan of the fields. When I returned my view to the location of the silo, the object no appeared to sitting in a 45 degree angle over the silo, the object now had my full attention and I did not look away from it again. It remained in this position for for about 15 to 20 minutes, it then slowly righted itself and appeared to go back to its original course and position in the air. I noticed now that it slowly moved away from the silo in a northwesterly direction at the speed of a very very slow moving helicopter. This entire time the object appeared to be as twice the size of a silver dollar held horizontally at arms length. Withing approx 8 mins it had worked its way to the top tree line on the southern part of the field I was sitting which was no further then 160 yards, it still appeared as a thick line with no protrusions of any kind on it, as thick as pack of cigarettes held at arms length and very long maybe 100 yards long. It made no noise what so ever no movement of the trees, I took my eyes off it for a second to look over to see if the man on the combine was looking at it but he appeared to be oblivious to it or maybe unable to see it from his location. It continued to move ever so slowly across the tree line and seemed to me to cover approximately 10 to 12 full grown large oak trees at the tops. The object worked its way slowly until it passed right in front of me above the tree line, I still had no idea what it was until it reach my 1 o'clock position still less the 160 yards from me and right above the tree tops, it was gigantic. When it hit my 1 o'clock it rolled up with its belly turning flush towards the north, the only way to describe it was like it was riding up a wave and then going down the wave or like a piece of paper turning up and floating down changing its course to the south. I had an unobstructed up close view of the bottom of this object. it was a perfect long triangle like that of a slice of pizza, dull grey metal not shiny at all. on the bottom it was covered in evenly spaced symmetrical dull white globe lights that appeared to me to look like dull white halves of a globe but much much larger. I could not get an exact count of the lights because because I was in awe at what i was looking at so to speak. I would say around 9 lights that filled the whole bottom of the craft in uniformity. After turning its belly up to the north floated ever so slowly to the south and then west following the tops of the trees until it moved away from and appeared to move back behind the trees some ways off. I have never in my life seen anything like this before and have not seen anything like this since. I have since moved from Missouri, but the owners of the property have told me they too have seen this craft a cpile different times during the night flying over the fields and at one time shinning a light like a beam onto the field."],"files":["/var/www/straped/mufon/html2text/27881.html.txt","/var/www/straped/mufon/org/27881.html"],"trends":["There have been no other sightings in Agency","This sighting has never been favorited."],"Object Shape":"Triangle","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.644718,+-94.739961(27881)&iwloc=A&hl=en\"> mufon case (27881) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Date of the Event":"10/05/2005 12:00 UTC","Date Submitted":"02/18/2011 11:41 UTC","Summary":"Dull grey pizza slice shaped triangle viewed for 1 hour or more","Disposition":"Unknown","Longitude":"-94.739961","Weather Factors":"None","City":"Agency","Latitude":"39.644718","Tags":"City","Country":"United States","Log Number":"US-02182011-0003","Object Features":"Other","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"27881","Region":"Missouri"}