{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Date of the Event":"08/03/1978 12:00 UTC","trends":["There have been 3 other sightings in Paradise","There were no other sightings in Paradise on or around August 3rd 1978"],"Viewing Distance":"20 Feet or Less","City":"Paradise","Summary":"bright light moving at will","Case Number":"27882","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.763826,+-121.617598(27882)&iwloc=A&hl=en\"> mufon case (27882) map </A>","Log Number":"US-02182011-0004","Region":"California","Object Features":"Dome, Window(s)","Country":"United States","Date Submitted":"02/18/2011 12:39 UTC","Latitude":"39.763826","Longitude":"-121.617598","divs":["Sighting Detailsdriving out of Paradise California toward Oroville, down a dark county road, saw a light on the road about a half a mile, but I noticed, it never got closer or further away, so, I turned to my mom, who was driving and asked her if she noticed and I don't remember her response, I don't think she did notice it until I brought it to her attention, but right when I did, all of a sudden, it start coming towards us, and boom, it came right over us, it didn't make a sound, my mother was scared she was squeezing my hand I thought she was going to break it, let's be honest here, I was scared too. Then after some time, it finally went directly west, then straight up into the clouds, now, it went directly west from were we were about a good 10-20 miles from were we were then straight up in the clouds all in a matter of two seconds, I never reported it, because I knew, I would be put in the funny farm and committed for life. I only told my family, because my mother was with me. I have never told anyone, except my wife. This thing when it was over us, made NO noise at all, it completely lite up the sky, I looked up at it because my first thought was a helicopter why would a helicopter be out here at this time of night and how in the world was a helicopter maneuvering between all of these trees, that were lining the road, the road we were on, had big trees and they covered the road, so that anything that would fly over it, would surely get caught in them and I couldn't believe it didn't crash into one of them when I realized, it wasn't a helicopter...."],"Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","Object Shape":"Bullet, Missile","files":["/var/www/straped/mufon/html2text/27882.html.txt","/var/www/straped/mufon/org/27882.html"],"Tags":"City"}