{"Log Number":"US-02182011-0005","Object Features":"Undisclosed","Longitude":"-106.451618","Object Shape":"Circle, Star-like","Weather Factors":"Unknown","Region":"Texas","Viewing Distance":"Unknown","Disposition":"IFO","City":"Ciudad Juarez","Case Number":"27883","Sighting Duration":"Undisclosed","Latitude":"31.764844","trends":["There have been 2 other sightings in Ciudad Juarez","There were no other sightings in Ciudad Juarez on or around February 17th 2011"],"Object Flight Path":"Undisclosed","Country":"Mexico","Source":"MUFON","Summary":"Observed four objects flying in a pattern over southwest Austin that were orange and glowing; moved very slowly.","files":["/var/www/straped/mufon/html2text/27883.html.txt","/var/www/straped/mufon/org/27883.html"],"Date Submitted":"02/18/2011 01:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.764844,+-106.451618(27883)&iwloc=A&hl=en\"> mufon case (27883) map </A>","Date of the Event":"02/17/2011 06:46 UTC","divs":["sighting detailspulled out of my garage in my car at 6:42 cst as i proceeded to drive up my neigborhood street, which is normally full of kids and parents at that time but no one was visible anywhere (not that it has any bearing). as i began driving up my street which is a slight incline i noticed this odd light in the sky to my left above the tree line (glowing oragne\\yellow color light) not really moving - airpline traffic can get busy in this area. initially i just thought it was some sort of manned aircraft but given its odd glowing color, no sound as it was maybe 500' in the air and given it was not moving i got out of my car to take a picture of it with my phone camera which is not very good. i observed the object begin to move north to northwest of my position and i then telephoned a buddy to tell him what i was seeing. after maybe 60 seconds a 2nd object appeared from behind the tree line; same color, etc...everything was the same and it moved above the treeline at about 5:00 relative to the other object and they moved in unison maintaining the same distance. maybe 15 seconds later a third one appeard moving slowly in the same direction - i was then starting to get an adrenaline rush talking to my buddy and then suddenly maybe 10 seconds later the fourth one appeared. it too was positioned at 5:00 relative to the third one. they all moved in unison very slowly towards the north to northwest. the whole event lasted just less than four minutes as they moved further away from my postion disappearing in the clouds. all the objects were glowing; there were no flashing lights light on an airplane or helicopter. i just can't say how big they were. i'm looking to see if anyone else saw this; no other cars drove by nor did anyone walk by my postion. i was really hoping someone would drive up - i parked my car in the middle of street with my emergency flashers on because i really wanted someone else to see what i was looking at but to no avail. i may walk the area this evening to see if anyone else walking in the area may have seen it. i had a sighting when i was 11 and i was with my brother, mother and grandmother but it was only one object and it didn't look like these. just curious if anyone else saw this. it occured over the southwest part of austin and travis county."],"Tags":"City"}