{"Date of the Event":"Unknown","Weather Factors":"Unknown","Case Number":"27880","Tags":"City","Longitude":"-82.630859","divs":["Sighting DetailsWell I was a cartpusher for walmart at the time, and I worked on 3rd shift(10-7am) I was outside getting buggys and I remember going to the bottom of the lot and working my way back to the top. Im almost done getting them in that isle and I just happened to look up and there it was above the store, I spottted a UFO. This was a clear night out so there was no interferance by anything in the sky that woulda made me think it was just a plane or something common like that. Best way I can describe is that it was like a perfect circle and was a lime green glow color. Dont know how big it actually was, but it looked the same size of a bright street light to me. How lights sometimes have that little outer glow of light to them, this to had that only it was lime green. But it was there for about 2 seconds, then with little effort at all it just took off behind the building and that was the last of it. After this had happened I just kept playing it over and over through my head about what I saw. I tryed to debunkify my thoughts of it being a UFO but I couldnt. My mind was clear and focused, no way I was seeing things and no way someone has a light that powerful. I mean it was as bright as the batlight for Batman. Once it all sunk into my head that I really did see what I thought I saw, I sorta just accepted it. I knew noone would beleave me so I just told a few co workers about it and pretty much got laughed at. Steriotypically no one was outside and looking where I was looking when it happened so im the only one who seen it. Id like to beleave it was alien species, but most likely it was top secret military flying. If you have any explanations about this or any UFOs spottings like this one, please send me an email telling me about it, would love to know im not the only one."],"Source":"MUFON","trends":["There have been 17 other sightings in Ashland","There were no other sightings in Ashland on or around"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.487524,+-82.630859(27880)&iwloc=A&hl=en\"> mufon case (27880) map </A>","Latitude":"38.487524","Summary":"Seen a green blur of light above walmart for only 3 seconds, and then it just took off. no sound at all","Region":"Kentucky","Object Shape":"Circle","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/27880.html.txt","/var/www/straped/mufon/org/27880.html"],"Disposition":"IFO","Log Number":"US-02182011-0002","Sighting Duration":"00:00:03","Country":"United States","Object Flight Path":"Undisclosed","City":"Ashland","Object Features":"Undisclosed","Date Submitted":"02/18/2011 08:42 UTC"}