{"Weather Factors":"None","trends":["There have been 21 other sightings in Laredo","There were no other sightings in Laredo on or around February 16th 2011"],"Sighting Duration":"Undisclosed","Longitude":"-99.502602","Log Number":"US-02182011-0006","Viewing Distance":"Over One Mile","Country":"United States","Latitude":"27.511287","Object Shape":"Circle","Source":"MUFON","Date Submitted":"02/18/2011 07:47 UTC","Tags":"City","Disposition":"IFO","Summary":"Two very bright white lights that came on and off in a five secound space.","map":"<A HREF = \"http://maps.google.com/maps?q=27.511287,+-99.502602(27884)&iwloc=A&hl=en\"> mufon case (27884) map </A>","files":["/var/www/straped/mufon/html2text/27884.html.txt","/var/www/straped/mufon/org/27884.html"],"Object Features":"Unknown","Region":"Texas","Date of the Event":"02/16/2011 07:30 UTC","Case Number":"27884","Object Flight Path":"Stationary,Path with directional change","City":"Laredo","divs":["sighting detailsi was on mines road about thirty miles north of laredo, texas. others had seen lights in the sky to our north i had seen some strange lights in that area about three years ago. 3\\26\\2008. so i was looking north twards polares. just below the north star i saw what looked like a jet, white blinking light, flying west. it suddenly turned, very sharp turn, and headed east. as the \"jet ?\" turned a very bright white lite came on in what had been the flight path if the \"jet ?\" had continued west. once the \"jet ?\" was heading east a secound bright light came on about 45 degrees to the right and several inches below the first. the lights were only on for about a secound, they didn't brighten and then fade but came on and went off like a light switch. while on the lights where about the size around as a pencil veiwed from the end. i kept watching for a third flash and didn't see were the \"jet ?\" went. if it was a jet it was going very fast. as high as it was it looked more like an orbiting satalight. the turn was very sharp for any kind of jet i,ve ever seen."]}