{"Latitude":"40.060835","Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.060835,+-95.601929(27899)&iwloc=A&hl=en\"> mufon case (27899) map </A>","Case Number":"27899","Tags":"City","Object Shape":"Bullet, Missile, Flash","Region":"Nebraska","divs":["Sighting DetailsThe morning of February 7, 2011, I was driving to work. It was a particularly dark morning, cloudy, and the moon and stars weren't visible. As I was driving along the two lane highway, off to the west I could see something glowing over a hill, much like a combine looks when it's harvesting at night in the fall, or even like the sun might look as it's coming up over the horizon in the east. Just a glow. I drove for a mile or two, keeping an eye on the glow, wondering just what it was coming from. I cleared a hill on the highway and could see around the hill, and as soon as I looked to see what was causing the glow, something shot from the ground to the sky, almost like a falling star would look, except going up instead of down. It was so fast I didn't have time to make out a shape or any details, except that it seemed to have a greenish glow to the trail it left, which dissipated within seconds. The whole thing, from time I saw the glow, til it disappeared into the sky, was maybe a minute, tops. The flash of it disappearing into the sky was very quick. I was searched the sky to try and see what it was, but couldn't see anything. The glow had disappeared from over the horizon. I was quite shaken by what I saw. I've driven country roads by myself at night and in the dark ever since I was a teenager and nothing's ever made my skin crawl like seeing this did. I didn't file any reports (what would I say?) and the only people I told were my brother and a friend who is also interested in UFOs and unexplained events. I still drive by that place in the field every morning when I go to work, but haven't seen anything since that day. I do get an eerie feeling though, just remembering what I saw."],"Date Submitted":"02/19/2011 11:17 UTC","trends":["There have been no other sightings in Falls City","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/27899.html.txt","/var/www/straped/mufon/org/27899.html"],"Log Number":"US-02192011-0007","Object Features":"Unknown","Summary":"UFO spotted flying out of cornfield from country road","Country":"United States","Longitude":"-95.601929","Disposition":"Unknown","Date of the Event":"02/07/2011 04:45 UTC","City":"Falls City","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None"}