{"Object Flight Path":"Stationary","City":"Springfield","divs":["Sighting Details2-18-2011 about 1:30 pm cental time. Springfield, IL My sister was driving north on Dirksen Parkway in the right lane approaching the Sangamon Avenue stop light, yet still far enough away from the intersection coasting down from the Railroad overpass. I looked east and above the tree line was this motionless metal craft...I made my sister look and said I think that's a UFO but she didn't stop the car or pull it off into either one of two close restaurants on that side of N Dirksen Pkwy, being Sonic and McDonalds, she was approaching a stop light and I knew that the group of trees by the stop were closer to us and would block the view. Even though it's winter and they're bare I still lost sight. So we were trying to think how far away it was. It was farther east than the tree line, the tree line would be about 300+ feet from the road. If I were to equate size and distance with my hand holding my arm out, it was the the width of my thumb. It's possible that would put it by highway 55. When the stop light changed, driving north past the trees, it was gone. I saw it for probably less than 30 seconds, it had a highly refective, smooth, slightly angled surface towards the front top (front I'd say facing north). Back side wasn't as highlighted from the sun, bottom was shaded. Shape didn't appear disc, or oval because it had angles, bottom wasn't flat at the back it angled a distinct type of fin or area that dropped, bottom was more flat to the front, made the craft look uneven, unbalanced in it's form, but was hanging straight in the sky. I felt I was looking at it from a side view but could see some of the bottom. There are also two radio towers that stand among the tree line, it was far enough south of the towers that it couldn't be something attached to the top of the towers. It was too big for a kite or baloon. I am a bad witness, because I didn't think of my cell phone to visually record it I'm sorry to say. I'm hoping someone else did. This probably has nothing to be associated...but within 5 mins we pulled into Cullivers parking lot(east from Dirksen further north of Sangamon) we saw a hellicopter west from Dirksen in the sky going north. Flying above the buildings. By the time we are on Dirksen again 3 to 4 hours later southbound in the same area, I notice again, west of Dirksen the helecopter has reversed direction, heading south...I remarked that the helecopter was a little late on the sceen(& too far north) from our sighting, but it was too weid to see it again around 5:30 heading back."],"Date of the Event":"02/18/2011 01:30 UTC","Date Submitted":"02/19/2011 01:51 UTC","files":["/var/www/straped/mufon/html2text/27895.html.txt","/var/www/straped/mufon/org/27895.html"],"Tags":"City","Object Shape":"Bullet, Missile","Source":"MUFON","Viewing Distance":"101-500 Feet","Disposition":"Unknown","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around February 18th 2011"],"Country":"United States","Log Number":"US-02192011-0003","Summary":"it was silver reflecting sunlight, a cloudless day, motionless in the sky","Case Number":"27895","map":"<A HREF = \"http://maps.google.com/maps?q=39.784921,+-89.640648(27895)&iwloc=A&hl=en\"> mufon case (27895) map </A>","Region":"Illinois","Weather Factors":"None","Sighting Duration":"Undisclosed","Longitude":"-89.640648","Object Features":"Unknown","Latitude":"39.784921"}