{"Summary":"Driving down a lonely Texas highway and visited from the world outside","Case Number":"27908","Object Shape":"Star-like","Object Flight Path":"Stationary","Latitude":"31.827368","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/27908.html.txt","/var/www/straped/mufon/org/27908.html"],"Source":"MUFON","Longitude":"-99.426453","Viewing Distance":"Over One Mile","Disposition":"IFO","trends":["There has been one other sighting in Coleman","There were no other sightings in Coleman on or around February 17th 2011"],"Sighting Duration":"Undisclosed","Date of the Event":"02/17/2011 07:30 UTC","Object Features":"Unknown","divs":["Sighting DetailsIt all started out with my wife and I traveling south on US 283 towards Coleman, TX at night. With my cruise control set, the radio tuned and near perfect driving conditions I was set for the long haul south to San Antonio. Driving down the dark, desolate highway with hardly any traffic I remained focused on the highway searching for the one line backer deer to confront my three quarter ton truck. In the course of driving I looked over to see a green sign telling me I had ten miles to Coleman and my wife telling me to look over at the full moon that was on its way up like a homesick angel. I gazed at the moon for several seconds and observed several airliners passing by along with a low flying airplane with distinguishable nav lights and anti-collision lights. We continued driving when my wife said look at the satellite moving across the sky towards the moon. With a clear sky I was able to locate the moving object and watched it travel from the south to the east and disappear as most satellites do. I continued my drive down the highway when my wife pointed towards the moon and said look. I looked and observed an orange light directly below the rising moon which appeared stationary for several seconds and then disappeared. My first thought was Dyess Air Force Base was in nearby Abilene and that the B-1B bombers were out playing and lighting the afterburners. I continued to search for the orange light for several minutes with no sight. Finally we arrived in Coleman, TX. I located a Pizza Hut off the highway and pulled in for some gratification. As I exited my truck I looked towards the moon and saw the same color object, but smaller in size with no movement or noise. Usually if a bomber with a lit afterburner was near we would hear the rumble. I told my wife, but she missed that sighting. We walked in grabbed a few pizzas and sat down at a booth facing towards the direction of the moon so we could try to see anymore lights. It was almost humorous to be eating pizza and the both of us focused on the outside. Eventually we look out the window and pointed at the mysterious light and about the same time an airplane flies near it, which then made me realize what we saw was not at all an airplane. The light in no way resembled an airplane. The light remained on and eventually disappeared. Minutes later the same colored light comes on in which we both pointed to it in excitement and then two more lights appeared spaced apart. As before they remained on for several seconds and disappeared. My wife and I thought what the hell. The waitress comes by to fill our cups when I asked her if there have been people in the local area reporting lights or seeing strange objects. The young girl said there have been reports online and in the Coleman paper about people spotting mysterious lights. Even A&E did a report about UFO sightings in Stephenville, TX. We explained to her what we saw when she became excited and said, \"Really?!\" She started to look out the window and became excited as we were. I told her now that the out of towners told a third person the mysterious lights will not light up the sky to only show us as being crazy. I will tell you this, I have never seen anything like that before and my wife and I will say, what we saw that night was not an airplane, but most definately an unidentified flying object. I truly believe we were visited by the outside. Take care and hopefully this helps."],"Date Submitted":"02/19/2011 08:53 UTC","Tags":"City","City":"Coleman","Region":"Texas","Log Number":"US-02192011-0016","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.827368,+-99.426453(27908)&iwloc=A&hl=en\"> mufon case (27908) map </A>"}