{"trends":["There have been 11 other sightings in Muskegon","There were no other sightings in Muskegon on or around November 15th 2010"],"Source":"MUFON","Object Shape":"Fireball, Flash","Latitude":"43.235911","Date of the Event":"11/15/2010 01:00 UTC","Disposition":"IFO","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.235911,+-86.246802(27905)&iwloc=A&hl=en\"> mufon case (27905) map </A>","Sighting Duration":"Undisclosed","Longitude":"-86.246802","divs":["sighting detailsmy girlfriend and i sit out and look at the night sky almost every night in the summer we are used to seeing satellites all time but about 3 mounts ago se saw a shooting star coming from the s\\east and it stopped no big deal but a few seconds later one came from the s\\w and stopped at the same spot freaky but then a third came from the n\\w and stopped in the same spot in what looked like perfect 120* angles but then a extremely bright light started flashing right where they all stopped but not in a pattern. ive never been scared by anything i've seen in the sky but that gave me chills (still does) i,ve seen the 3 red light triangles (in tandem) but this scared the crap out of me unfortunately i no longer have a night video camera so i cannot document what i see..oh also after that incident there where like 20 or more satellites that appeared to cruse the area. where we are you can see one every few min but they where all in a 10 min period that was weird by itself.the weeks before and after there where a lot of strange things shooting stars and what looked like satellites that changed direction not in a 90* sharp turn but more like an arch. we have not been out much in the last few mounts its winter here but soon we will be out there. we where not looking for that kind of thing its just pretty out here and we like seeing shooting stars this was not expected."],"Case Number":"27905","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/27905.html.txt","/var/www/straped/mufon/org/27905.html"],"Weather Factors":"None","City":"Muskegon","Object Flight Path":"Straight-line path,Other","Region":"Michigan","Date Submitted":"02/19/2011 07:05 UTC","Log Number":"US-02192011-0013","Tags":"City","Summary":"shooting stars turn into blinking lights"}