{"City":"Detroit Lakes","Country":"United States","trends":["There have been 4 other sightings in Detroit Lakes","There were no other sightings in Detroit Lakes on or around July 23rd 2009","This sighting has never been favorited.",""],"Date of the Event":"07/23/2009 01:25 UTC","Object Flight Path":"Hovering then path","Latitude":"46.826481","Source":"MUFON","Longitude":"-95.841145","Date Submitted":"02/19/2011 10:01 UTC","divs":["Sighting DetailsThere were 12-15 people sitting around a campfire, 2 of us have green lazers(star pointers) that we use during the day for tree estimates. We were pointing at stars and everything in the sky. I was pointing straight accross from us at stars and 2 lights appeared. My friend said point it at the airplane at that time I turned it off and said that you shouldn't do that. We continued to watch these 2 lights come towards us, they were moving slow and no flashing lights. They came to hover where I think that they could see us. They hovered for several minutes enough time for my friend to catch some photos of these lights. After several minutes had passed 1 of the lights went straight up in the sky and vanished the other went out away from us and blipped away. Just then the five of that saw these lights said did you see that what was that. The strangest thing of the experience is that out of 15 of us only 5 saw these and the whole time we were watching we never said look at those lights in the sky to anyone else. We were stunned by what we had seen. Not sure if they were craft or entities."],"Summary":"2 ORBS in sky at 10K festival orangish red on top and white on bottom","Case Number":"27909","files":["/var/www/straped/mufon/html2text/27909.html.txt","/var/www/straped/mufon/more/27909_submitter_file1__10kfestival013-2.JPG","/var/www/straped/mufon/more/27909_submitter_file2__10kfestival011.JPG","/var/www/straped/mufon/more/27909_submitter_file3__10kfestival012.JPG","/var/www/straped/mufon/org/27909.html"],"Disposition":"IFO","Tags":"City","Object Shape":"Sphere","Region":"Minnesota","Sighting Duration":"Undisclosed","Log Number":"US-02192011-0017","map":"<A HREF = \"http://maps.google.com/maps?q=46.826481,+-95.841145(27909)&iwloc=A&hl=en\"> mufon case (27909) map </A>","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None"}