{"Log Number":"US-02192011-0018","Date of the Event":"02/19/2011 05:53 UTC","City":"Las Vegas","Date Submitted":"02/19/2011 10:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.122346,+-115.165626(27910)&iwloc=A&hl=en\"> mufon case (27910) map </A>","Disposition":"IFO","Country":"United States","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around February 19th 2011"],"Weather Factors":"Unknown","Summary":"Fast moving Bright Object","Object Shape":"Star-like","Region":"Nevada","Case Number":"27910","divs":["sighting detailsi was outside my home smoking. i like to watch aircraft approaching mccarran. saw a southwest 737 on downwind for 25l, and anotheir aircraft climbing after take off from runway 19l\\r. i saw a very fast and bright object approached, seem lower but faster than the south west aircraft, also, it wasn't traveling on the same direction, it was heading towards the ne of the city as opposed to the southwest ac flying to the east on downwind. at first i taught it was an aircraft, but i taught it was too bright, so i stared at it waiting to see the aircraft lights (anti collision and strobes) but the more it kept on traveling i could not see aircraft lights. i taught maybe it was the angle at which the object was moving, so i kept on watching it, but the furtheir it went away, i could still not see aircraft lights, also it was traveling way faster than the otheir aircraft on the air at that time, suddenly it became lees bright and became more like a dim star but it kept on moving. i calculate the object being over mccarran or furtheir away, when it completely dim out and disappeared like it was their and then it wasn't. i don't think it was a meteor, as it was flying level, and it also decelerated, also; i saw it flying level for over 2 minutes. i hope some one at the tower\\person or other aircraft saw it."],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-115.165626","Tags":"City","Latitude":"36.122346","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/27910.html.txt","/var/www/straped/mufon/org/27910.html"]}