{"Sighting Duration":"00:07:16","Source":"MUFON","Longitude":"-80.222759","Latitude":"25.791369","map":"<A HREF = \"http://maps.google.com/maps?q=25.791369,+-80.222759(27918)&iwloc=A&hl=en\"> mufon case (27918) map </A>","City":"Miami","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around January 13th 2008"],"Country":"United States","files":["/var/www/straped/mufon/html2text/27918.html.txt","/var/www/straped/mufon/org/27918.html"],"Date of the Event":"01/13/2008 07:17 UTC","Tags":"City","Log Number":"US-02202011-0005","divs":["Sighting Detailsone day a friend told me that he saw a ufo in the sky. one day I went to the denists office and took a picture of him. I went to a website and I saw a picture of him and it turns out that his real name is xavier 278 and I went and then we took a picture of a guy named irving and we went to the website and it turns out that once he was on a ship and another alien pushed him off the ship accidentally .and he landed in syria and Irving bought him there and sold him to the dentists office and he made up a lie that if you have ever had mint gum then your tung is too big. x-avier278 told everyone that lie and he made up this thing called a y-ray wich is an x-ray for your mouth and a kid came in to the office and the dentist put a cream that made you have a rash around your mouth and then when the dental hygienist came in and every time she tried to do a y-ray he couldn't open his mouth because of the cream and then when the dental hygienist went to call the dentist the dentist put water on the kids mouth so to wash of the cream but then xavier278 was purpesly making the y-ray not fit in the kids mouth so the kid had to com back next time. when the kid was leaving he saw a line on floor so he followed it and it led him to the cream that the dentist put on his mouth. so he disabled it and broke it and the the dentist had to clean it up and threw it into the garbage.when the dentist was finished cleaning up the cream he went to one of the rooms and saw one of his robot friends from the ship his name was x-avier279 and he said that another robot pushed him off the ship by accedint and then he said the exact same story that the dentist said so now the two of them were friends forever. I was at home and 4 hours after it happened I got a phone call and I asked if we should report it and my friend said no but I thought that we should so thats why I reported it. I was frightend"],"Region":"Florida","Date Submitted":"02/20/2011 11:48 UTC","Object Features":"None","Object Flight Path":"Path with directional change","Weather Factors":"Windy, Snow","Summary":"a friend told me that a ufo was in the sky that day and I saw him at a dentists office.","Case Number":"27918","Disposition":"Hoax","Object Shape":"Blimp, Diamond, Oval","Viewing Distance":"101-500 Feet"}