{"Sighting Duration":"00:04:05","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around February 19th 2011"],"Date of the Event":"02/19/2011 11:35 UTC","files":["/var/www/straped/mufon/html2text/27915.html.txt","/var/www/straped/mufon/org/27915.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.056794,+-118.238285(27915)&iwloc=A&hl=en\"> mufon case (27915) map </A>","Viewing Distance":"Unknown","Log Number":"US-02202011-0002","City":"Los Angeles","Source":"MUFON","Summary":"bottom lite like two seperat parts, circular disck shape lights on sides not windows, lighting like malfunctioning","Weather Factors":"Rain","Longitude":"-118.238285","Case Number":"27915","Disposition":"Unknown","Latitude":"34.056794","Object Features":"Patterned Surface, Other","Tags":"City","Country":"United States","Object Flight Path":"Path then hovering","Date Submitted":"02/20/2011 04:15 UTC","Object Shape":"Circle, Disc, Saturn-like","Region":"California","divs":["Sighting DetailsI was on my way home from work around 11:35pm. On mission road near the Lincoln Hgt DMV and Plaza De La Raza. I noticed what looked like a light was reflecting on the bottom of a hang glider (that's the only way i can describe it) It had two separate points of light. As I moved forward in my car I at a point was directly under it, It was NOT two separate parts it was plasma looking lights that were on a circular vehicle. The object was moving toward the San Gabriel Mountains. As I proceeded toward downtown los angeles it was then on the right side of my car. It had two separate panels of light, box in formation. These lights lit randomly almost like something was broke or malfunctioning on the machine. The top had a pulsating red light but it didnt strobe like on an airplane it would stay on for a while then turn off. Im not sure how to say it but all of the outside of the vehicle was circulating left to right around the craft in a circle. Like the outside circle was connected but separated from the main body. Like the picture on this sight but a flat bottom and the whole thing was the same size equal in demention. As I continued driving there was a police car that was ahead of me that pulled over one of the the officers got out and started watching it. At this point the thing was maybe 3miles away and from what i saw the lights went out completely. We just got done with an unusual sever storm 2-3hrs before the incident. I was on the phone with my mother in Madison Wisconsin during the whole thing describing everything to her. It lasted probably 2-3mins if that. While it was moving it was kind of a swooping motion it did pause at points but it moved very continuously forward no rapid changes of direction yet it was moving very fast. I came home and drew a picture of what I saw. Went over the events with my mother again and my boyfriend. I was shaky and anxious. I don't have any pictures but I have the drawing that I drew when I got home."]}