{"map":"<A HREF = \"http://maps.google.com/maps?q=35.994303,+-79.935314(27916)&iwloc=A&hl=en\"> mufon case (27916) map </A>","trends":["There have been no other sightings in Jamestown","This sighting has been favorited 1 time."],"Tags":"City","Latitude":"35.994303","Disposition":"IFO","Country":"United States","Object Features":"None, Unknown","Weather Factors":"None","Source":"MUFON","divs":["sighting details i was pulling into my driveway and noticed a fairly bright orb heading in my direction. i got out of my vehicle as it was flying over my neighborhood (almost directly over my house). no blinking lights were observable and no noise from the craft could be heard. this craft was fairly low as it flew by faster than aircraft i've seen leaving the airport. i observed the craft until it flew out of sight which was a very short amount of time. when i could no longer see the craft, i went in the house and told my wife and mother-in-law what i had just seen. it was difficult to judge the height of the craft at night, but i could tell it was low enough for me to hear the engines\\jets if it was a conventional aircraft. i took a picture with my iphone but it's not note worthy. the orb was very fluid in movement as if it was moving with no drag through the sky. the glowing orb was unlike anything i've ever seen. there is an airport close by and i served in the military and know what conventional aircraft (civilian and military)look like. i hope others in my area have seen what i saw."],"Date of the Event":"02/16/2011 07:35 UTC","Sighting Duration":"Undisclosed","Summary":"When I was pulling into my driveway a glowing orb was heading over my house.","Region":"North Carolina","Date Submitted":"02/20/2011 04:25 UTC","Log Number":"US-02202011-0003","files":["/var/www/straped/mufon/html2text/27916.html.txt","/var/www/straped/mufon/org/27916.html"],"Object Shape":"Sphere","Case Number":"27916","Longitude":"-79.935314","City":"Jamestown","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path"}