{"Country":"United States","Case Number":"27912","divs":["Sighting DetailsMy boyfriend and I were parked on a back road watching the stars near Avenue D on the west side of Yuma. We started to see a couple of orange lights flash on in a row and then turn off one by one. We thought they were flares at first, but we didn't see any smoke coming from the lights. We were getting a little sad that we didn't have enough time to grab the camera and catch it, when all the sudden more lights turned on. Excited and a little scared, I grabbed my camera and started recording. These lines of lights showed up a few times but I always managed to miss it all due to the fact that when they appeared it was only for a couple seconds. This is the best video that captured exactly what we saw. There was no noise at all, no sounds of planes, and no smoke coming from the lights. After seeing what we saw in the video, the lights stopped lighting up and we did not see them anymore. In the video there is one light that shows up at the beginning and then right around the 3 minute mark is when a whole bunch showed up."],"Tags":"City","Date of the Event":"08/18/2009 09:14 UTC","files":["/var/www/straped/mufon/html2text/27912.html.txt","/var/www/straped/mufon/org/27912.html"],"Viewing Distance":"Over One Mile","Latitude":"32.702201","Source":"MUFON","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around August 18th 2009","This sighting has never been favorited.",""],"Log Number":"US-02192011-0020","Object Flight Path":"Straight-line path","Date Submitted":"02/19/2011 11:28 UTC","Weather Factors":"None","Disposition":"IFO","Sighting Duration":"Undisclosed","City":"Yuma","Longitude":"-114.619382","Object Shape":"Circle, Fireball, Other","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=32.702201,+-114.619382(27912)&iwloc=A&hl=en\"> mufon case (27912) map </A>","Summary":"Lights turning on and off in a line","Object Features":"None"}