{"Summary":"Strange object over Kittaning Pennsylvania","Date Submitted":"02/20/2011 02:37 UTC","files":["/var/www/straped/mufon/html2text/27919.html.txt","/var/www/straped/mufon/org/27919.html"],"Region":"Pennsylvania","City":"Ford City","Country":"United States","Log Number":"US-02202011-0006","trends":["There have been 2 other sightings in Ford City","There were no other sightings in Ford City on or around February 18th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.781656,+-79.525377(27919)&iwloc=A&hl=en\"> mufon case (27919) map </A>","Case Number":"27919","Object Shape":"Sphere","divs":["Sighting DetailsI was standing on my porch because i went outside to smoke a cigarette when i noticed this object up in the sky it caught my attention because it flashed a few times and kept changing in brightness then it started to move to my right and i watched it go up into the clouds when i first noticed it i was stunned because the first thing i thought was oh my god thats a freakin ufo just based on its shape and the way it moved through the sky there was no stream like you would see from a jet and it manuevered to quickly to be a small plane. it began diving in and out of the clouds in a clockwise circular motion down towards the treeline. the storm cluds were gathering so i beleive that puts the object at around 2000 feet when i first saw it and i would have to guess its distance from my point of view was around five to ten miles away i was whitish silver and spherical or maybe circular it was hard to tell from that distance i watched it form a few minutes and i was mesmerised by it because i couldnt beleive what i was seeing in my own backyard figuratively speaking. i remember thinking that i had to document this or noone will beleive me so i ran inside to grab my camera its a sony cybershot with a 10 megapixel resolution but only a four times zoom when i came back outside the object had moved into the clouds and i lost sight of it i then regained sight of the object a few moments later and noticed it heading off to the northwest i tried my best to capture it on film but theres only so much you can do with a four times zoom i did get a video a little over a minute long and i must have watched it twenty times now and i cant pinpoint exactly where it is in the video. the second time i lost sight of it moved off in a straight line into the clouds far out on the horizon if anyone wishes to view the video for themselves i have it on my computer and i made copies on discs however i think you are going to need some sort of video enhancing software to really dig through it and get some good hard evidence from it i apologize for the crappy quality and wish i could have got it sooner but i was pretty much dumbstruck by this thing. i also wanted to add that i was a physics major for a little over a year before i left college and this thing just behaved in a way that i found made me question wether or not i was actually seeing what i thought i was seeing it was just wierd... i alsoi called some of the small local airports in the area that night and left messages asking if there were any planes in the area saying that i saw something strange and as of today february 20 2011 i have gotten no responses"],"Longitude":"-79.525377","Sighting Duration":"00:05:00","Tags":"City","Date of the Event":"02/18/2011 06:00 UTC","Object Features":"None","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Latitude":"40.781656","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Path with directional change"}