{"Date Submitted":"02/20/2011 06:41 UTC","Latitude":"41.574987","Region":"Illinois","Tags":"City","Case Number":"27920","files":["/var/www/straped/mufon/html2text/27920.html.txt","/var/www/straped/mufon/org/27920.html"],"Longitude":"-87.778554","Object Shape":"Triangle, Other","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around February 19th 2011"],"Date of the Event":"02/19/2011 06:15 UTC","divs":["sighting details2\\18\\2011 at about 6:30pm, my husband and i went out for dinner. headed to pepe's on 159th street in tinley park. we left our subdivision and headed north on 88th ave towards 191st. i looked to my right and saw several, very bright, white lights in the sky. my husband noticed them as well. we continued driving down 191st towards harlem and watched the lights the entire time. we couldn't figure out what we were looking at. when we turned onto harlem, heading north, our view became obstructed. it was about that time i noticed two planes (i think they were planes...could only see their lights) and it appeared to me they were flying low and very fast towards the lights. we had no clue what was going on but will never forget it. the next night (2\\19\\2011) around the same time (6:15pm) my husband left the house to go to jewel to pick up things he needed for his nascar party the next day. he called me from his truck to tell me he saw the lights again. instead of going to the store, he turned around and picked me up. i grabbed the camcorder and we headed down 191st again. we drove down 191st and just past harlem ave, we pulled over. i got out of the truck and start recording. i have video footage of these lights. this time though, they were not white. they were orange. they appeared to be changing colors and were in a triangular formation. as i continued recording, the lights (all at the same time) suddenly blew up (i don't think they really blew up...i just don't have the words to describe what i recorded). the lights were gone for maybe a second or two and then reappeared. they continued to do this (suddenly bursting and then reappearing again). truly the oddest thing we've ever seen and i am hoping someone will be interested in my video. it would be great if someone could explain what we saw because i sure can't. i can't email the video. i tried to send it to a friend but the attachment was too large and google would not let it go through. please let me know how i can get it to you."],"Source":"MUFON","Summary":"Orange lights in sky of triangle shape. Turned off and on.","Disposition":"Unresolved","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.574987,+-87.778554(27920)&iwloc=A&hl=en\"> mufon case (27920) map </A>","Weather Factors":"Unknown","Log Number":"US-02202011-0007","City":"Tinley Park","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Unknown","Viewing Distance":"Unknown"}