{"Date Submitted":"02/21/2011 12:33 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=37.547745,+-77.426868(27928)&iwloc=A&hl=en\"> mufon case (27928) map </A>","Viewing Distance":"Unknown","Summary":"Had an alien at the foot of my bed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27928.html.txt","/var/www/straped/mufon/more/27928_submitter_file1__120_0046.JPG","/var/www/straped/mufon/org/27928.html"],"trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around September 28th 1996","This sighting has never been favorited.",""],"Object Shape":"Other","Object Flight Path":"Undisclosed","Latitude":"37.547745","Disposition":"Unknown","divs":["sighting detailsi was asleep with my husband next to me. we had watched a movie and the tv was now on a blue screen with no other lights on in the room. i woke up and saw an alien at the foot of my bed holding onto the rod iron railing. i have a sleigh bed. as i was waking up i started to re-wet my contacts by blinking alot. then when i realized what i was seeing i started to freak out. i never believed people when they said they were so scared they were \"frozen\" until that night. when i saw it i tried to scream and nothing came out. i tried to hit my husband but my arms wouldn't move. it was shear terror feeling. after about 10 seconds (which felt like and eternity) i was able to get my arm to move a little. he saw me move and then his mouth went from this tiny little hole to a big opening and he ran out of my bed room and into the kitchen which was 3 feet from my bedroom door. i heard his feet when he hit the floor in the kitchen. after another 30 seconds or so i was able to scream and start moving. i hit my husband and got him up and told him what i saw. i turned every light on into the house and went into the kitchen. the back door was not open. i can tell you he is about 3 and a half feet tall. with reptile like skin, and is kinda glossy. it was a weird green \\ gray color. he had 3 fingers kinda long, and yes they were on my bed railing. i took my bed railing off and it's been in my attic ever since. i can't look at it. i told my father (a retired lt. colonel from the army national gaurd) the next day and other family members. so do i believe in aliens. yes i have seen one!!! i worked at ruth's chris steak house for 8 years so you know i am not a nut case.:) i am still married. my husband does commercial heating and air and i have twin boys 8 months old and a 2 year old daughter."],"Country":"United States","Log Number":"US-02212011-0005","Sighting Duration":"Undisclosed","Date of the Event":"09/28/1996 03:00 UTC","City":"Richmond","Tags":"City","Longitude":"-77.426868","Case Number":"27928"}