{"Object Flight Path":"Unknown","Tags":"City","Object Shape":"Square, Rectagular, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=33.012354,+-94.365471(27923)&iwloc=A&hl=en\"> mufon case (27923) map </A>","files":["/var/www/straped/mufon/html2text/27923.html.txt","/var/www/straped/mufon/org/27923.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsBack in 1996, during a 2week period of time, I witnessed four events on different nights, that seem to be all ufo related. For a long time before any of that my mom would call to me at night from down below my balcony. She would always be talking about how a star up high was a ufo because it was not just white. I did not think one way about it or the other, because I had never witnessed anything like that. Anybody in the world can give me a polygraph or hypnosis or whatever about anything that I have ever said that I witnessed, and I would pass because I have no doubts. Those four times were the only times that I've ever witnessed any ufo activity, but since I was 7or8 years old, I've witnessed all sorts of paranormal things and haven't known who to tell that can really make sense as to why. Anyway, here's the story. One night about 2am back in 1996, I was sitting indian style on my balcony with my headphones on.I had the lights on out there, and felt like something was looking at me or something. I turned my head to the right and looked down. What I saw that night no words can describe. I immediately saw 4 white lights in equal distance apart, and I slowly stood up with the railing, and took off my headphones. There was a craft hovering the ground down beside my house. There was a semi-circle on top where it appeared someone or something could see me out of. As I stood there, my jaw dropped in fear and amazement. I was not about to make any sudden movements,because I don't know anything about them,and it did not either.That craft was longer and wider than my house,and slowly came up over the top of my balcony where I was,and the middle of it stopped and hovered silently above me.There were alot of very small white lights on the bottom;a lot of a little bit bigger neon green ones and in the center was one big red blinking one. As it did, white smoke came out of it. I was frozen with fear but in complete awe.It defied all logic and gravity. After a few minutes, it slowly went on passed, and went up into the east until I couldn't see it anymore.After that,one night I saw millions of moving red lights in the fence rows. Another night, I saw 2 trianglar ufos,one behind the other flying high from east to west. I came home from a friend's at night and my mom,dad,aunt,and uncle were looking at a white circle at the top of trees with something flying through it every few seconds. About a month after all of that happened, I was up with my dad in the kitchen getting ready to go to high school.We would listen to the trading post and drink coffee before hand. I had my hair in a ponytail and proceded to walk back to go get my books, when my dad shreaked,jumped, and said what's that?! I asked him what he was talking about and went to the bathroom to look and see. Behind my left ear was a brown circle about the size of a dime.Dad was right in that it favor a ringworm but it wasn't. It favored one,because it was just a brown,lined circle with my skin color inside, but never any itching or burning.Over years of time, the mark would fade and get smaller. If it is completely gone now it has only been in the last year or so and I am 31 now. Ive always been scared after that happened to come forward, but watching a ufo program on tv was the first time I had ever heard of Mufon and I thought I should even after all this time so maybe those who love to know the real truth will know."],"Log Number":"US-02202011-0010","Summary":"large rectangular craft flying over my house","Source":"MUFON","Viewing Distance":"20 Feet or Less","Region":"Texas","Longitude":"-94.365471","Case Number":"27923","Date Submitted":"02/20/2011 10:03 UTC","Sighting Duration":"00:10:01","Date of the Event":"08/24/1996 02:00 UTC","Disposition":"Unknown","Country":"United States","Latitude":"33.012354","City":"Linden","Object Features":"Dome","trends":["There has been one other sighting in Linden","There were no other sightings in Linden on or around August 24th 1996"]}