{"files":["/var/www/straped/mufon/html2text/27926.html.txt","/var/www/straped/mufon/more/27926_submitter_file1__photo1.jpg","/var/www/straped/mufon/more/27926_submitter_file2__photo2.jpg","/var/www/straped/mufon/org/27926.html"],"Case Number":"27926","Disposition":"Unknown","trends":["There have been 10 other sightings in Alexandria","There were no other sightings in Alexandria on or around February 20th 2011","This sighting has been favorited 1 time.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=38.807736,+-77.043321(27926)&iwloc=A&hl=en\"> mufon case (27926) map </A>","Date of the Event":"02/20/2011 04:59 UTC","Source":"MUFON","Object Features":"None","Tags":"City","Object Shape":"Circle, Egg, Sphere","Longitude":"-77.043321","Region":"Virginia","Country":"United States","Weather Factors":"Unknown","Date Submitted":"02/21/2011 09:03 UTC","Summary":"Black Object over Alexandria, VA appearing to travel northwest towards Washington DC","divs":["Sighting DetailsMyself and my wife were walking into the Giant Food grocery story located at 6800 Richmond Highway Alexandria, VA 22306-1704. We were facing north. We first noticed the object just as we were about to go in. I saw it and asked my wife \"what is that?\". She saw it and said she didn't know and then continued to walk into the grocery store. I stayed outside and continued to slowly walk in the direction of the object and took several pictures with my iPhone camera. When I first saw the object, I thought it could be a group of black balloons or a blimp. It was large enough to be noticeable in the sky and was black. The black shape was easy to see against the grey clouds of the sky. It was moving too slowly to be an airplane and did not look like a helicopter. It seemed to change shape slightly like a group of balloons would but it seemed to be very high up and would need to be a very large balloon. As I walked toward it and took more pictures I saw a very small dot like object slowly circle the larger object at least once at what seemed like very close range. There were several commercial airplanes flying off to the east as they took off from Reagan National Airport. They looked larger then the object from my perspective but this could mean they were closer as well. As the object moved away I couldn't make out any more detail and went inside the grocery store. I was very excited about the sighting but when I got home my pictures barely showed anything."],"Sighting Duration":"00:05:00","Latitude":"38.807736","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","City":"Alexandria","Log Number":"US-02212011-0003"}