{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/27925.html.txt","/var/www/straped/mufon/org/27925.html"],"Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","Summary":"UFO over 5 freeway C.A","map":"<A HREF = \"http://maps.google.com/maps?q=33.917236,+-118.012009(27925)&iwloc=A&hl=en\"> mufon case (27925) map </A>","Region":"California","Tags":"City","divs":["sighting detailsfebruary 19,2011 about 1am coming home from a night out. driving on the 5 freeway north bound in la mirada c.a me and my guy saw a ufo over the freeway it seem to be 30 feet long with bright yellow\\amber lights rotating. you can tell the other cars on the freeway saw this ufo because cars were slowing and some stopping looking at the bright thing in the sky. it seem to be square rectangular [_________________] with what look like small box shape\\ windows [_] of brite yellow\\amber lights that seem to rotate and it seem to glide or hover. where were you and what were you doing at the time? on freeway in car what made you first notice the object? bight yellow amber lights what did you think the object was when you first noticed it? ufo describe the object and its actions and motions. long square\\rectangular brite lights that seem to rotate and it seem to float or glide. describe your feelings, reactions and actions, during and after sighting the object. i kept saying no way and opened the sunroof of the car and stuck my head out to get a better view and after words just kept talking about it. how did you lose sight of the object? after it past over it was going south as we were going north on freeway and just lost sight of it."],"Latitude":"33.917236","City":"La Mirada","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"US-02212011-0002","Object Features":"Window(s)","Date of the Event":"02/19/2011 01:00 UTC","Date Submitted":"02/21/2011 02:59 UTC","Disposition":"Unknown","Object Shape":"Cigar, Square, Rectagular","Sighting Duration":"Undisclosed","Case Number":"27925","trends":["There have been 6 other sightings in La Mirada","There were no other sightings in La Mirada on or around February 19th 2011"],"Longitude":"-118.012009"}