{"Weather Factors":"Unknown","Date of the Event":"07/16/1978 10:30 UTC","trends":["There have been 4 other sightings in Fremont","There were no other sightings in Fremont on or around July 16th 1978"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/27922.html.txt","/var/www/straped/mufon/org/27922.html"],"Date Submitted":"02/20/2011 09:42 UTC","Viewing Distance":"21-100 Feet","Tags":"City","City":"Fremont","Log Number":"US-02202011-0009","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.436971,+-96.490827(27922)&iwloc=A&hl=en\"> mufon case (27922) map </A>","Longitude":"-96.490827","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Latitude":"41.436971","Summary":"Hovering craft over five children","Region":"Nebraska","Case Number":"27922","divs":["Sighting Details Visiting cousins in Freemont, Neb.. My sister, brother, two cousins, and myself had just gotton back from watching Grease the movie at the local theater. We'd asked if we could sleep outside and had just made our bed in the back of an El Comino in the front yard. We we're running around playing tag when I noticed it had gotton completly silent. As I looked into the sky I noticed something slowly emerging over the tree tops. I called for my sister and brother and two cousins to look at what I was seeing. We stood in a group and watched as the craft became one quarter visible to use. It was obvious it was huge as the portion we could see seemed to take up our entire corner of the property. It was difficult to see againt the night sky, even though it was right over head. It appeared to have a rounded edge as this seemed to be the most \"solid\". Yet still there were lights all around at different points. I remember really trying to figure out just how they were attached at it seemed that they were at the end of spike like protrutions or some cases anteneas. I think my mind was just trying to get a better picture by trying to fill in the blank, transparent, cloaked or just hard to see portions. At this point, as we stood together, my sister yelled to look at the side window. As I looked, my eyes adjusted to sight of rectangle windows on the visible edge of the ship. We could make out the image of one \"being\" in the window. Then we realized that another being moved over to the right of the first figure. We WERE looking at a spaceship and aliens and we knew it. I ran to the house and stood in the doodway yelling for my uncle and grandfather to come outside and see that there was a spaceship over the house. They were watching Johnny Carson and told me it was a weather baloon. I ran back to the yard passing my cousin who was now going to the house to yell for them. They never came outside. At this point the craft moved over a field to a small air field across the street about a mile away. It hovered over the rotating airport light and got very, very bright. It then passed back over head. I got excited thinking it was coming back for us but, it passed and started following a fright trains main engine. The engine ran it's horn, \"I know there's an engineer out there somewhere who should be able to remember this\" the craft lit up again very bright as it followed the engine for a half mile or so before it slowly lifted away. The last thing it did was quickly move to the south, then up, and in a huge Z patern, shot away so quickly I could make out the Z shape for a split second. My brother can barely remember the event. My sister and I have the same memory but, we are the oldest. Writting this account has made me want to get us all together and get hypnotized just to find out what (if anything) happend to us."],"Object Features":"Appendage(s)","Disposition":"Unknown"}