{"divs":["Sighting DetailsI was 23 yrs old living in Milford on my way to the gym. It was 7:50 p.m. I remember the time because I had an 8:00 p.m. class to get to and I didn't want to be late. It was dark out. I looked up and saw a strange object with lights under it hovering in the sky just to the left of the bridge at exit 61, off of I95 in Milford, CT. I had to cross the bridge to get to the gym in the center of town. I was driving south towards the I95 bridge when I looked up and saw this huge object with lights hovering just to the left of the bridge not very high up and I remember thinking WOW what is that? It was as big as a football field and looked rectangular-which may have seemed larger at the time because when I go back to visit my old neighborhood, it seems so small now. It wasn't a blimp I remember checking to make sure it wasn't a blimp. It wasn't moving, so I stopped and rolled down my window to see if I could hear anything, but heard absolutely nothing. I thought it was a UFO. I was debating whether to drive to the police station to report it or go to the gym to my class. For some reason I decided I didn't want to miss my class (now I am regretting that decision-I guess I figured I would see one again and as of yet I have not) I didn't report it then, but wish I had. I remember looking in the newspapers for a couple of weeks to see if anyone else saw it and I do remember seeing some reports of UFOs in the area. I don't know where to go to find the Archives for 1970's. (It may have been 1972-I am not absolutely sure). It was at the beginning of fall sometime. I think it was September, but it could have been October. It was so long ago. I was going to knock on a neighbor's door, but I didn't see any lights on. I was afraid of being abducted, so I stepped on the gas and just gunned it across the bridge and never looked back. I was sooo afraid. I went to my class and told my husband when I got home. I will never forget that night. I have believed in UFOs ever since that happened. I think the lights on it were red and white, but I don't really remember. I wonder if anyone else in Milford saw the same thing I did."],"Log Number":"US-02212011-0016","Latitude":"41.23043","files":["/var/www/straped/mufon/html2text/27939.html.txt","/var/www/straped/mufon/org/27939.html"],"Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.23043,+-73.05404(27939)&iwloc=A&hl=en\"> mufon case (27939) map </A>","Longitude":"-73.05404","Object Features":"Unknown","Region":"Connecticut","Viewing Distance":"101-500 Feet","Country":"United States","Source":"MUFON","Disposition":"Unknown","City":"Milford","Date Submitted":"02/21/2011 03:40 UTC","Weather Factors":"Unknown","Date of the Event":"08/31/1973 07:50 UTC","Object Shape":"Square, Rectagular","Case Number":"27939","Object Flight Path":"Stationary","Summary":"It was the size of a football field with lights under it.","trends":["There have been 8 other sightings in Milford","There were no other sightings in Milford on or around August 31st 1973"]}