{"divs":["Sighting DetailsHorses and dogs woke me up a little after 2am on Feb 13th 2011, I saw UFO's moving and shooting beams of orange lights down in the distance, I woke up my wife and she looked through the telescope and saw a ship with three vertical white lights, the lights were so bright they had a spectrum look to them. We also so saw a ship that was triangular shape with orange lights on the bottom of the craft, this one flew real low over our house. I saw many moving lights, many different colors in the sky that night that where no way planes. These lights didn't strobe like an airplane. Also they didn't move like no airplane I have ever seen. I did catch a few photos and video but to be honest none of them are clear and show anything like what we saw with our own eyes and telescope. It was really cold outside so we were shivering, needless to say our videos and photos are shaking and blurry. We used our digital camera to video. When the morning came a large ship came and all of a sudden we saw what we thought were stars start flashing and take off across the sky until we could no longer see them. However we did see moving things in the sky for the next three nights as well. My brother also saw lights moving in the sky and he lives three miles away."],"Weather Factors":"Unknown","Region":"Missouri","City":"St Clair","Object Flight Path":"Stationary,Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/27932.html.txt","/var/www/straped/mufon/more/27932_submitter_file1__ufo001.JPG","/var/www/straped/mufon/more/27932_submitter_file2__ufo002.JPG","/var/www/straped/mufon/org/27932.html"],"Country":"United States","Tags":"City","Date Submitted":"02/21/2011 02:14 UTC","Case Number":"27932","Log Number":"US-02212011-0009","Longitude":"-90.982778","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.349722,+-90.982778(27932)&iwloc=A&hl=en\"> mufon case (27932) map </A>","Summary":"Lots of UFO's","Object Shape":"Circle, Disc, Flash, Star-like, Triangle","Disposition":"Unknown","trends":["There have been no other sightings in St Clair","This sighting has never been favorited."],"Date of the Event":"02/13/2011 02:59 UTC","Sighting Duration":"Undisclosed","Latitude":"38.349722","Viewing Distance":"Over 1 Mile, Unknown"}