{"Summary":"I was traveling west bound on I-480 . I made a right turn exit onto I-77 north. I notice a black shaped object coming slowly towards my location. It look like a flying black aspirin with black cast top and bottom. The side wall radius look like dark black","Object Features":"Other","Date Submitted":"02/21/2011 02:48 UTC","divs":["Sighting DetailsI was traveling on I-480 west bound to I-77 north bound. I noted a dark object flying towards me. It look like a black aspirin floating slowly turning right to I-480. It bank right on it's fly-bye. I was riding my motorcycle while this event ocurred. The top and bottom of the object had cast iron look to it. the side wall radius appeared to be dark plastic with no visible stems to it. The top surface had a three pronged antenna that rotated counter clock wise. My estimated size of the object to be about 10-15 feet in diameter. The height of the object about 3 feet. I'm guessing the object was a probe or a drone by it's size. You have to understand I was riding my motorcycle in the opposite direction and not see where it vanish into the sky. I was curious that no one saw this object or reported it to any of the news media. I felt a deep longing to see again. I was not afraid of the object but why did it appeared to me?"],"files":["/var/www/straped/mufon/html2text/27937.html.txt","/var/www/straped/mufon/org/27937.html"],"Object Shape":"Other","Source":"MUFON","Log Number":"US-02212011-0014","Latitude":"41.450052","Region":"Ohio","Date of the Event":"07/30/2002 03:10 UTC","Case Number":"27937","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.450052,+-81.663462(27937)&iwloc=A&hl=en\"> mufon case (27937) map </A>","Country":"United States","trends":["There have been no other sightings in Newburgh Heights","This sighting has never been favorited."],"City":"Newburgh Heights","Viewing Distance":"21-100 Feet","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Disposition":"Unknown","Longitude":"-81.663462"}