{"Object Flight Path":"Hovering then path,Path with directional change","Object Features":"None","Case Number":"27930","Date of the Event":"12/24/2010 12:00 UTC","divs":["Sighting DetailsI am 99% sure it was Christmas Eve. I had been at my aunts house and decided to drive home. Once I parked in front of my house, I got out and looked up at the stars. I tend to do this every time I park because of odd things I have seen in front of my house in the past but I can't list because I don't remember the dates, just can recall the years of the other sightings. Anyways, so when I exited the car that night, in the sky directly above me there were 3 orbs. One large and 2 smaller. They flew and hovered in a triangular motion. I stood in the middle of the street and watched them for a few minutes and walked as I followed them. I tried to take photos with my iphone but the objects were much to high. They were very very high up, much to high to be a plane or helicopter or jet. They also flew much to slow to my knowledge to be something like a plane. I followed it down the block about 5 houses down. There was some overcast so I kept my eyes on where I believed it was until the clouds moved and would follow it again. The objects seemed to high they could be in space. The largest moving orb would be slightly smaller than the North Star in size, the others were maybe one to two sizes smaller than that. After watching for a few minutes, I had called my neighbor to come out. When he came, I asked to him to tell me I wasn't crazy and to tell me what he saw. First he said that it was a plane or something like it and then once he saw how they moved he said he could not explain what it was. They would hover at times, then move quickly then slow. It never went straight for long it seemed as if it could move in whatever direction it wanted, go backwards ect. I felt very frightened at first when it was directly above me because I of course thought it would descend down. Once it started moving I had kept my eyes and my feelings changed to curiosity. I just want to know what we saw and if anyone else observed it that night. After 20 minutes had past, the overcast was much to heavy to see it any longer."],"Weather Factors":"Unknown","Summary":"3 UFO'S Over Street","map":"<A HREF = \"http://maps.google.com/maps?q=37.812314,+-122.269564(27930)&iwloc=A&hl=en\"> mufon case (27930) map </A>","trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around December 24th 2010"],"Longitude":"-122.269564","Tags":"City","Disposition":"Insufficient Data","Region":"California","Date Submitted":"02/21/2011 01:42 UTC","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Log Number":"US-02212011-0007","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"37.812314","Country":"United States","City":"Oakland","files":["/var/www/straped/mufon/html2text/27930.html.txt","/var/www/straped/mufon/org/27930.html"]}