{"Log Number":"US-02212011-0011","Disposition":"Hoax","Latitude":"40.85367","Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"04/05/1957 12:00 UTC","Tags":"City","Case Number":"27934","City":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.85367,+-73.864816(27934)&iwloc=A&hl=en\"> mufon case (27934) map </A>","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsI lived in a housing project on the top floor, The truth of this matter is far from a boar, Did Alliens from space land on top of my roof? Bright lites in my window I felt so uncouth! I was seven years old as I laid in my bed, Somehow I was Petrified from toes to my head! I saw two figurines which appeared in the night,They stood near my bed,I felt so up tight. Another night I heard crushed gravel on the top of my roof. I heard someone walking I did not need proof. From the hole in covers I saw two little men. Uninvited guest, who dare let them in! I tried calling my Brother who slept soundly near by, I was FROZEN in time,I was unable to cry! Third nite came about,I was armed to a T, I found an inner strength somewhere with in me. I placed a bean shooter through the hole in my sheet, I waited for their arrival to stand near my feet. Again I saw the light,heard the gravel and a noise near my bed. I BLEW through my bean shooter,hitting both in the head. A direct hitas they ran and scattered like mice, I gave chase behind and blew at them twice. I stood in the living room in the dark al alone, Somehow from this battle,I matured I had grown. I tried telling my mother and after all that I said, Her disbelief was a paassive pat on the back of my head. I knew what I saw and I saw what was true. You would not believe it untill it happens to you. I was in my bedroom trying to sleep I saw them (Alliens) near my bed side I could not believe my eyes The two figurines moved around my bed I felt scared but I was cool"],"Region":"New York","Date Submitted":"02/21/2011 02:27 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around April 5th 1957"],"files":["/var/www/straped/mufon/html2text/27934.html.txt","/var/www/straped/mufon/org/27934.html"],"Weather Factors":"Unknown","Object Shape":"Unknown","Longitude":"-73.864816","Object Flight Path":"Undisclosed","Summary":"I Observed two allien in my be my bed room I wrote a poem about it"}