{"Latitude":"34.176461","Log Number":"US-02212011-0018","Case Number":"27941","Sighting Duration":"00:02:00","Summary":"We viewed from our van a craft rising up out of the woods.","Region":"Oklahoma","Object Shape":"Disc","divs":["sighting detailsmy family and i had just left the gospel lighthouse church on north texaco road. it was around 9pm. we turned west on hwy 70 heading back to wilson oklahoma. we had gone approximately 3\\4 of a mile when we noticed a really bright beam shooting up into the clouds. it was drizzling rain and a low cloud ceiling. rolled down my window and pulled over to the side of the road. i motioned for the kids and my wife to look across the road at the beam of light. there were no houses over there and we thought at first it was maybe coon hunters fooling around with their lights. but as we watched, we realized the beam was going higher and that is when we noticed a craft shaped light a disc which was lighted blue on top with a white lighted band around the middle and a glowing orange bottom and the beam of light was coming not from the ground but going to the ground from underneath the craft. we watched this for about a minute and it rose slowly up into what appeared to be a dark lowering. the light and the craft disappeared into the dark cloud or lowering. we do not know for sure if it was a cloud. it was drizzling and spitting rain. our children were in the van with us and so was their cousin. everyone saw the craft and the light. even today, they are grown men and still remember what they saw."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.176461,+-97.140455(27941)&iwloc=A&hl=en\"> mufon case (27941) map </A>","Longitude":"-97.140455","files":["/var/www/straped/mufon/html2text/27941.html.txt","/var/www/straped/mufon/org/27941.html"],"Source":"MUFON","Object Flight Path":"Hovering then path,Other","Date Submitted":"02/21/2011 09:01 UTC","Object Features":"Unknown","City":"Ardmore","trends":["There have been 4 other sightings in Ardmore","There were no other sightings in Ardmore on or around November 10th 1993"],"Date of the Event":"11/10/1993 09:00 UTC","Country":"United States","Weather Factors":"Rain, Light","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City"}