{"files":["/var/www/straped/mufon/html2text/27945.html.txt","/var/www/straped/mufon/org/27945.html"],"Region":"Texas","City":"Kingsville","Country":"United States","Summary":"white lattice type structure on side of road","Viewing Distance":"20 Feet or Less","Sighting Duration":"00:10:00","Longitude":"-97.856109","Latitude":"27.515869","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=27.515869,+-97.856109(27945)&iwloc=A&hl=en\"> mufon case (27945) map </A>","Object Features":"Other","Tags":"City","divs":["Sighting DetailsYears ago, probably about 1968 (not sure), my mom (now deceased) myself (in college at the time) and a friend were leaving a gate house where my father worked as a gate watchmen. The gate was located about 2 miles north of Kingsville, Texas. The gate was the entrance to a small gas & oil plant (I think it belonged to Exxon). The gate was located in a fairly remote area at the end of a winding road about 2 or 3 miles long (no longer there) through thick south texas brush land. We had just left the gate house after visiting with my dad (also now deceased), and were heading home probably around 10 pm. We were no more than a quarter of a mile from the gate house, yet out of view because of a curve. I was driving at a speed no more than 40 mph, and probably slower. I noticed on the side of the road (the right side) a small object about 3 feet tall which was bright white and similar to a lattice or trellis. It was maybe 2 feet wide at the base and seemed to taper like a triangle. It appeared to sit on a pedicel or post of some kind. After realizing what I saw, I stopped immediately and asked my mom and friend if they had seen it. Both replied yes, so I backed up past where I saw the object. We all got out of the car and searched but the object was gone. Obviously, the object had to be able to move on its own or someone had to move it. Judging from the time it took to back up, and our extensive search of the surroundings, we felt no person was involved. We were all very puzzled, and to this day have no explanation. Through the years I have mentioned it to some, but really never tried to investigate. Of course, back then there was no network like yours, so the incident was pretty much forgotten in time. I have no idea why I'm only now trying to find out - perhaps I was prompted by one of your TV shows. I thought perhaps someone else may have reported something similar and you would have it in your archives."],"Weather Factors":"Unknown","Date of the Event":"07/15/1968 10:00 UTC","Log Number":"US-02222011-0002","trends":["There have been no other sightings in Kingsville","This sighting has never been favorited."],"Date Submitted":"02/22/2011 11:41 UTC","Source":"MUFON","Case Number":"27945","Disposition":"Unknown","Object Flight Path":"Stationary"}