{"Region":"Pennsylvania","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Monroeville","There were no other sightings in Monroeville on or around February 19th 2011","This sighting has never been favorited.",""],"Longitude":"-79.781772","City":"Monroeville","Log Number":"US-02212011-0020","files":["/var/www/straped/mufon/html2text/27943.html.txt","/var/www/straped/mufon/more/27943_submitter_file2__NorthHuntingdonUFOreport.jpg","/var/www/straped/mufon/more/27943_submitter_file3__P2191273.JPG","/var/www/straped/mufon/org/27943.html"],"Country":"United States","Tags":"City","Viewing Distance":"Unknown","Latitude":"40.42441","Object Shape":"Boomerang, Circle, Diamond, Sphere, Square, Rectagular, Star-like, Other","Disposition":"Unknown","Case Number":"27943","Summary":"SEVERAL HUGE FLEETS of ORBS traveling with 4 large crafts over North Huntingdon towards Monroeville","divs":["sighting detailsi live in a residential neighborhood located south of route 30 in north huntingdon, westmoreland county, pa. my location being south of route 30 is under a common flight path for pittsburgh international airport and allegheny county regional airport so i'm very familiar with the looks and behavior of planes and helicopters in our area. being a smoker and having a dog, i frequently go outside for the dog and smoke while waiting. normally i don't pay a large amount of time looking around the sky, but since finding an old school chum online recently that i haven't seen in 30 years and finding out what she's been seeing in her neighborhood nne of me and several other areas around us, i've been looking for 'usual' sky objects for about 2 weeks now every chance i get. even though i was told about some of the strange objects seen in the area, it did not prepare me for what i witnessed in person this night. approximately 11:15 pm doing the dog\\smoke thing and paying particular attention to the sky since receiving a text from my friend in murrysville who was seeing a few unidentified objects there, i saw what i can only describe as 'shock and awe'. i am still pretty much in shock. it has turned my world upside down. glancing around the sky which was full of partly cloudy skies and brisk winds coming from the nw heading se, i noticed many small star-like self-illuminated objects traveling from the sse toward the nnw. when i say 'many', i mean like several hundred (and i say that as an understatement) of round spheres all moving in a static, fairly fast pace all heading in the same direction nnw towards monroeville coming from the direction of west of irwin, which is sse of here. my response was naturally, \"wtf are those!?\" i couldn't believe my eyes were seeing these things. there seemed to be large groups of these round objects passing, then a pause, some stragglers, then another large cluster of them. some above the clouds, some below the clouds. it was like the sky's starfield was moving across the sky -- yet i could see the real stars holding their places. maybe 3 feet wide at arm's length in width. first, i tried to wake my husband, but he had to work at 5 am, and wouldn't get up to see them. after ten minutes of this action, i then tried to call my friend to see if she was seeing it as well, but no answer. some of them seemed to be grouped together in geometric shapes, some even in a \"v\" shape or boomerang configuration. seeing as they were bright like stars, these could not be birds in migration nor balloons flying upwind, and the number of them rules out satellites or even aircraft. i need to mention that early on during the first batch or two, a helicopter with red lights was flying in approximately the same path, not unlike it was pacing the spheres, or the reverse. i was in awe. i couldn't believe what i was seeing. it seemed too unreal. they kept coming, one batch after another.then i saw higher up 2 very large crafts above the clouds moving like half the speed of the spheres\\orbs. very large as in 6 inches wide at arm's length! a drawing is attached. they reminded me of reddish spider web shapes with a weighted red light in center, pulling it down. reminded me of an upside down pyramid or a \"princess cut\" diamond shape, a polygon but with 2 pie-like slices missing. i could see a faint gray \"cast\" of the craft showing sections. it had steady white lights at tips, 2 blinking smaller red lights, with bigger red light at 'tip'. most lights were pretty dim. only because it's fairly dark here could i see the detail. i kept trying to call my friend hoping she'd answer. (she had texted me earlier that night, she told me there was alot of activity the night before and asked me to come over - i couldn't make it tonight - who would have though all this would happen over my house tonight). finally at 11:45 pm she answered. she'd been in her hot tub and didn't hear the phone. i frantically explained what i had been seeing. they were still coming in groups. she searched her skies but couldn't see anything from her location during the time on the phone (which was from that period onward). she told me to grab a camera and try to get any pictures i could with a timed exposure if possible. as we talked, 2 more big pyramid\\diamond shaped ones went by, one was underneath the other. i tried to take pictures, but they didn't turn out too well (best one attached). she was thinking of trying to drive to catch them to film them, but the direction they were traveling wasn't conducive to doing so (the distance was too great and terrain is mountainous). at the direction (nnw towards monroeville --see satellite map) and speed they were traveling, it would have made it very unlikely they could be caught on film with better equipment, we thought. but then more of them kept coming. even after midnight, they were still coming in clusters. i don't know how long i was out there, it could have lasted until about 12:30 am or so on the 20th. in my best estimate, i'd say that at least 800 to more than 1000 of the small spheres\\orbs were seen, plus the 4 bigger crafts. then it stopped. my friend checked all of the available webcams around the area in direction of travel, but most don't show too much sky, unfortunately. the pittsburgh skyline one doesn't have an archive view option either. just to make sure it wasn't my mind messing with me, she even pulled up the online flightaware.com screen which showed no commercial aircraft in my area at all. i just needed confirmation that some sort of new aircrafts weren't flying around that i hadn't seen before. i wish i had the right equipment to film them. the only videos i could find that showed similar behavior, but a much smaller amount of them is the online video of \"ufo fleet guadalajara mexico\". my friend had a video she shot of a similar craft flying by her in 2009 that has a similar shape (9\\14\\09), but different lights (attached small portion of her video). she says they can morph shape and size and change lighting, so perhaps it was one of the same kind flying by her area that i saw. my first real undeniable ufo sighting experience, and all i can say is wow. i'm not sure how to take this. i'm not sure what to do about this information -- that we are not only not alone in the universe, but that we are being visited on earth by some visitors who come here with a very large number of crafts. the sad thing is that most don't even know they are here. i hope that others who may have witnessed this amazing sighting will come forward. i can't believe i could be the only one who saw them. i am feeling extremely anxious now not knowing what will happen due to their presence. the next time they show up, if my husband's sleeping, i'm going to bash him on the head to come and witness this with me."],"Sighting Duration":"01:15:00","Object Features":"Undisclosed","Date Submitted":"02/21/2011 10:01 UTC","Date of the Event":"02/19/2011 11:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.42441,+-79.781772(27943)&iwloc=A&hl=en\"> mufon case (27943) map </A>","Source":"MUFON"}