{"Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-02222011-0003","Disposition":"Unknown","divs":["Sighting DetailsMy friend Joel and I went for a walk through the Burlington Country Club on Friday the 18th of February to star gaze at around 9:00 p.m. About five minutes into our walk I noticed two orbs moving across the top of the tree-line to our right... One orb was higher than the other, although both orbs stayed the same distance from one another as they floated from right to left (they were moving at exactly the same speed). We immediately started to sprint across the snowy course off the path to keep up with the orbs. We finally connected with a different road than the one we'd originally been traveling down and continued following the orbs until we were on the top of a hill where we could overlook the Williston area as well as the South Burlington area (near the airport). The two orbs stopped but the one on the right hand side began to blink on its own tempo. After about five minutes of blinking, both lights started to turn on and off as they pleased until both vanished. It was hard to tell how far away the orbs truly were. Last night, we went back out to the country club and spotted a single glowing orb... This time we noticed it in the distance and it made its way towards us at a slow pace, getting brighter as it drew nearer. This orb couldn't have been more than 50 ft above the tree line and it's glow became more intense as it got closer, again no noise. When it got within a half mile of us, it started to change direction. We followed it back towards where we came and lost it in the trees... Within a minute, a cop car came down the road but didn't stop to chat as we were no longer on private property. I have one picture from the first sighting and a video from the second (last night). In the picture, you can see the moon and the orbs to the lower right hand side of the moon."],"Summary":"Two orbs equidistant from one another about 1000 ft above ground, no sound, stopped and blinked.","Longitude":"-73.094907","Date of the Event":"02/18/2011 09:30 UTC","Case Number":"27946","Date Submitted":"02/22/2011 12:24 UTC","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Williston","There were no other sightings in Williston on or around February 18th 2011","This sighting has never been favorited.",""],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/27946.html.txt","/var/www/straped/mufon/more/27946_submitter_file1__Picture1.png","/var/www/straped/mufon/org/27946.html"],"Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Star-like","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.448388,+-73.094907(27946)&iwloc=A&hl=en\"> mufon case (27946) map </A>","Weather Factors":"Unknown","City":"Williston","Latitude":"44.448388","Region":"Vermont"}