{"Disposition":"Unknown","City":"Hyde Park","Weather Factors":"None","Summary":"Glowing orange balls float through sky","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-73.929467","Log Number":"US-02222011-0007","trends":["There have been 2 other sightings in Hyde Park","There were no other sightings in Hyde Park on or around February 22nd 2011"],"Region":"New York","files":["/var/www/straped/mufon/html2text/27950.html.txt","/var/www/straped/mufon/org/27950.html"],"Tags":"City","Date of the Event":"02/22/2011 08:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.794021,+-73.929467(27950)&iwloc=A&hl=en\"> mufon case (27950) map </A>","Object Features":"Unknown","Country":"United States","Source":"MUFON","Latitude":"41.794021","Viewing Distance":"Over One Mile","Object Shape":"Circle, Fireball, Sphere","divs":["Sighting DetailsI was outside smoking a cigarette and saw 3 spheres float across the night sky, they were much larger than stars and it was obvious they weren't airplanes (bigger and sphere shaped) They glowed bright orange, the glow grew dimmer and brighter on and off. At first I assumed they were meteors or similar-because I had never seen a meteor shower before. But they were much bigger, and didnt simply fall from the sky to the ground. They seemed to fall towards the earth at first, and then floated right, then started to fall again. They moved in unison until the rightmost one trailed off to the right and seemed to dissapear. The others fell behind a nearby mountain and I lost sight. When they started to float and move right rather than downwards-it was in unison, seemed unnatural I guess. I was outside with about 15 people who also noticed it. It seemed really strange to me and I've always thought about extraterrestrial life and things like that- Id like there to be a believable explanation for these lights but Im not sure there is any."],"Case Number":"27950","Sighting Duration":"00:10:00","Date Submitted":"02/22/2011 09:09 UTC"}