{"Disposition":"Unresolved","Longitude":"-80.413939","Date of the Event":"02/17/2011 06:05 UTC","files":["/var/www/straped/mufon/html2text/27957.html.txt","/var/www/straped/mufon/org/27957.html"],"Weather Factors":"None","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsI was outside saying good bye to my wife who was on her way to work. I noticed a very bright light in the sky about 600 or 700 feet off the ground tracking very slowly from west moving east. it appeared to be about 3 or four miles away in a north east direction from my drive way. I noticed to was very much unlike a normal aircraft, there were no flashing red or green lights like conventional aircraft have. it was moving way to slow to be a conventional aircraft it hovered a few times as it tracked and seem to back up once or twice before moving forward again at times it would move vertically in what i would guess would be several hundred feet in a split second then drop back down. it did not appear to be a star because i could see it clearly moving under cloud cover. after watching this thing move slowly across for about nine or ten minutes it shot like a bullet out of view heading toward the direction of Richmond. that's about it. I am sure it was not a helicopter or any conventional aircraft I am aware of. when it was visible it moved too slowly for conventional aircraft and when it departed it moved too fast for conventional aircraft. as it tracked across my view it sped up and slowed down several times along with the \"jumps\" in vertical space also unlike any conventional aircraft. it was bright, too bright for a star at that hour of the morning. no other stars were visible because of the dense cloud cover that morning the sun was coming up and it was visibly traveling below the cloud ceiling. sorry i did not get a photo or video as my equipment was in the house and i didn't want to lose sight of it. I would like to know if anyone else witnessed this event in the area."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.229573,+-80.413939(27957)&iwloc=A&hl=en\"> mufon case (27957) map </A>","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","City":"Blacksburg","trends":["There has been one other sighting in Blacksburg","There were no other sightings in Blacksburg on or around February 17th 2011"],"Country":"United States","Object Shape":"Star-like","Log Number":"US-02232011-0003","Summary":"bright light tracked very slowly and irraticly from west to east about 3 mile north of my location","Region":"Virginia","Source":"MUFON","Case Number":"27957","Latitude":"37.229573","Date Submitted":"02/23/2011 07:21 UTC","Tags":"City","Object Features":"Unknown"}