{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.274923,+-97.733461(27952)&iwloc=A&hl=en\"> mufon case (27952) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"None","Log Number":"US-02222011-0009","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around February 22nd 2011"],"Date of the Event":"02/22/2011 08:22 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27952.html.txt","/var/www/straped/mufon/org/27952.html"],"Object Features":"Undisclosed","Summary":"Star like ufo in my backyard 8:20 to 8:28 02-22-11","Disposition":"Insufficient Data","divs":["Sighting DetailsI am in my backyard letting the dog out for water. I look up like I always do and light my cig. I dont know all the stars by name but I know the dippers and orions belt and a few others. I dont know if its venus or the north star or what its called that orions belt points to. From that star up and to the left, a couple of hand lengths away there were two stars and I thought hmmmmm that is a really bright star and I dont remember a bright star being so close to another and in that location. I've lived in austin all my life and I know what the sky usually looks like. And yes when I was a kid chemtrails didn't exist and I noticed them first and now everyones talking about them. Anyway... I've seen shooting stars one night with my father and we saw about 50 of them. They tend to have a slight bit of color to them. I watched the space shuttle with my father from one side of the horizon to the other and it took 3 min. like the papers said it would. All this from my backyard. That shuttle was hard to see and looked dim like other stars. THIS STAR was brighter than any other so I was puzzled that it only had white light with no sparkle or twinkle. THIS STAR was at a stand still. The two stars together were for several puffs of my cig. sitting together. The more I looked at it, it was as if it knew I was watching. Then it moved. There was a brief instant of shock. I thought is it moving or is it the tree making it look as though it's moving. There is a big bare tree easily seen through in the middle of my yard. I put my hand up to make the Texas long horn HOOKEM HIGH sign to get some degree of distance between them, to see if they were actually separating. Over what felt like an 8 second time span my fingers grew wider until I could not spread my index and pinky any further apart. It moved about 6 to 8 inches in a straight line, the length of my fingers apart, while streached out pointing at the sky. Then it slowly like a bulb or batteries going out in a flash light, went out. But it was moving up into space because it was no longer moving in any direction but away. I've seen enough planes to know if it should have still been in my vision from the size of the light to the distance and time it took to move like it did. This was nothing other than a ufo.. be it reversed enginered or other worldy life forms,don't know don't care. I'm not in shock or anything but I am amazed. You always want to see one but dont know how you will think about it after. PS I dont know whats going on with your county button but you should look at it in this form."],"Latitude":"30.274923","Object Flight Path":"Undisclosed","Object Shape":"Star-like","City":"Austin","Date Submitted":"02/22/2011 10:52 UTC","Case Number":"27952","Longitude":"-97.733461","Tags":"City","Region":"Texas","Viewing Distance":"Unknown"}