{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/27956.html.txt","/var/www/straped/mufon/org/27956.html"],"City":"San Diego","Date of the Event":"02/23/2011 01:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.716879,+-117.155155(27956)&iwloc=A&hl=en\"> mufon case (27956) map </A>","Source":"MUFON","Tags":"City","Longitude":"-117.155155","Object Shape":"Circle, Sphere, Star-like, Unknown","Region":"California","Sighting Duration":"Undisclosed","Case Number":"27956","divs":["sighting detailslast night while going to visit a friend in the e.r. (near uc merced campus) i decided to glance at the nigh sky before heading into the car. my eyes were immediately greeted by a large color changing\\ pulsating light (to the west). although it seemed to be a star it was switching colors rapidly and seemed to be in our atmosphere. it strobed green, blue yellow and violet, and although it was difficult to see (due to distance) it seemed as if it was growing and shrinking slightly. it was definitely awe-inspiring. i have seen many ufo's and sometimes come off as strange when i discuss it with people so i calmly asked my roommates what they thought of it (i have never discussed ufo stuff with them). they at first wrote it off as a star, then began to stammer and finally concluded that it was a ufo. we watched it for 10 0 15 mintues to see if anything would happen (it stayed stationary the entire time), sadly we had to rush to the hospital to see our friend. it was beautiful to view not only for its display of colors but the undeniable fact that it was not something often seen."],"Viewing Distance":"Over One Mile","Disposition":"IFO","Country":"United States","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around February 23rd 2011"],"Summary":"Flashing light","Latitude":"32.716879","Weather Factors":"Unknown","Date Submitted":"02/23/2011 05:25 UTC","Object Flight Path":"Stationary","Log Number":"US-02232011-0002"}