{"Source":"MUFON","Region":"California","Summary":"looked like a flashing star at times like the star of bethlaham blue streaks at times really bright.","Tags":"City","files":["/var/www/straped/mufon/html2text/27951.html.txt","/var/www/straped/mufon/org/27951.html"],"Case Number":"27951","Viewing Distance":"Over One Mile","Weather Factors":"None","Disposition":"IFO","Object Flight Path":"Hovering then path","Date Submitted":"02/22/2011 10:41 UTC","divs":["sighting detailsapproximately 7:00 pm on tuesday february 22nd my husband, daughter and i saw what we can only describe as a ufo to us in the sky. we were standing in our back driveway and i looked up to see a bright \"star\" moving erradically in the sky. i watched it for a few seconds and realized that it was moving much too quickly for any object i had ever seen in the sky and was moving too jerkily and quickly to be real. we watched it for a period of perhaps 5 or 6 minutes and then it took off across the whole horizen of the sky in the matter of 2 or 3 seconds and disappeared. we have never in our lives seen anything like this, and never expected to in our lives. we don't say this is alien or manmade but we saw it with our own eyes and are as amazed by it as anyone could be. our daughter only had her cell phone to get pictures of it and in the pictures it only looks like a series of dots in progression but there were plenty of stars in the sky that didn't show up in the pictures. it was not a plane, a helicopter or anything we are used to seeing. we reported it to fox news and you. please let us know if you had any other reports. thanks for your time . *(wit's name deleted--cms\\sg)."],"Latitude":"34.108339","trends":["There have been 8 other sightings in Rancho Cucamonga","There were no other sightings in Rancho Cucamonga on or around February 22nd 2011"],"Country":"United States","Object Features":"Other","Longitude":"-117.591488","Object Shape":"Flash, Sphere, Star-like","Sighting Duration":"Undisclosed","City":"Rancho Cucamonga","Date of the Event":"02/22/2011 06:45 UTC","Log Number":"US-02222011-0008","map":"<A HREF = \"http://maps.google.com/maps?q=34.108339,+-117.591488(27951)&iwloc=A&hl=en\"> mufon case (27951) map </A>"}