{"Disposition":"Insufficient Data","City":"Vandergrift","Weather Factors":"None","divs":["Sighting DetailsI was driving home shortly after 9 PM talking on my cell phone with my fiance when I noticed a triangle of lights, two red lights in the \"back\" of the object and one bright \"spot light\" or \"headlight\" in the front of the craft. It looked like the light was just shining ahead, it was probably 50-75 feet above the trees it was over, which was up a hillside from where i was at, so it was about 500 feet or so from me. When I noticed the craft I immediately told my fiance what I was seeing and I pulled over into a parking lot directly down the hillside from where the object was (next to a building that says \"Uncle Charlie's Sausage\" on the side). I was trying to explain it away to her and myself as a helicopter searching for something or someone, but as I stated above the light was just shining forward, not at the ground or anything except maybe the tree tops. I also realized at this point after I had gotten out of my vehicle that the thing was making absolutely no noise, there was a train running about a quarter to half mile behind me and I could hear it, but not this craft that was much closer to me. That had me worried but I was still trying to explian it away, After I had watched it hover above the tree line for what seemed like forever but was probably only a minute or so, it began slowly moving up to my left and away from the trees, it turned off the front spot light and I then saw it had a third red light up front as well that matched the back two. I assume the spot light was so bright I couldn't see the third red light at first. I don't believe the red lights were blinking like a regular air crafts would be. It slowly moved up higher and toward some thin clouds, it briefly turned the spot light back on for about ten seconds, then back off again. I watched the red triangle of lights maybe another 30 seconds until I couldn't see it anymore. I'm not sure what happened, it either turned off all lights or sped off. The clouds it was near weren't thick enough to conceal the lights. I then got in my car and continued home. I wanted to report this just to see if anyone else had reported anything in the area, or i there was indeed some kind of air craft in the area at that time."],"trends":["There have been no other sightings in Vandergrift","This sighting has never been favorited."],"Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27963.html.txt","/var/www/straped/mufon/org/27963.html"],"Date Submitted":"02/23/2011 02:38 UTC","Log Number":"US-02232011-0009","Region":"Pennsylvania","Tags":"City","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-79.564767","Case Number":"27963","Latitude":"40.602843","Object Features":"Unknown","Date of the Event":"02/16/2011 09:15 UTC","Object Shape":"Triangle","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.602843,+-79.564767(27963)&iwloc=A&hl=en\"> mufon case (27963) map </A>","Summary":"Triangle silent object with three red lights and one \"headlight\" moving slowly then disappeared","Country":"United States"}