{"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.416665,+-95.333584(27966)&iwloc=A&hl=en\"> mufon case (27966) map </A>","Object Features":"Undisclosed","Viewing Distance":"Unknown","Region":"Kansas","trends":["There have been no other sightings in Nortonville","This sighting has never been favorited."],"Date of the Event":"10/07/2010 08:15 UTC","files":["/var/www/straped/mufon/html2text/27966.html.txt","/var/www/straped/mufon/more/27966_submitter_file1__cigarshapeshifter.JPG","/var/www/straped/mufon/org/27966.html"],"Source":"MUFON","Weather Factors":"Unknown","Longitude":"-95.333584","City":"Nortonville","Latitude":"39.416665","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Other","Date Submitted":"02/23/2011 10:44 UTC","Case Number":"27966","Object Flight Path":"Undisclosed","Log Number":"US-02232011-0012","Country":"United States","Summary":"Shape-shifter, vertical cigar to horizontal cigar to sphere","divs":["Sighting DetailsI was driving North on a country dirt road twords Nortonville, when a bright object in front and slightly to the right of me up in the sky caught my attention. I observed what appeared to be a brilliantly lit pencil or cigar shape, which quickly changed shape or moved to a horizontal positon. Whatever the object was I observed, it glowed brilliantly and was beautiful! Quickly thereafter the object moved or changed into a sphere, and promply disappeared or accelerated out of sight in moments. There were no other object or aircraft in the sky at the time, or the remainder of my trip into Nortonville, Kansas. I have no idea what it was that I saw, but the entire event elapsed no more than 30 seconds, and I would have missed it completely, except that the object glowed so brilliantly, it drew my attention. I prefer to remain anonymous; do not want any contact nor attention; the only reason I'm reporting the event at all, is my curriousity what it was I observed, and if anyone else saw something similar around the same date(s) and time."]}