{"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.711905,+-121.278381(27962)&iwloc=A&hl=en\"> mufon case (27962) map </A>","Sighting Duration":"Undisclosed","City":"Citrus Heights","Region":"California","Source":"MUFON","Longitude":"-121.278381","Case Number":"27962","Date Submitted":"02/23/2011 12:42 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/27962.html.txt","/var/www/straped/mufon/org/27962.html"],"divs":["sighting detailswhile traveling south on garry oaks drive in citrus heights at 8:30pm, i spotted 3 very bright lights in the sky ahead of me. the lights were amber\\orange in color. i watched for a moment and then pulled over to get a better look. the lights were traveling from south to north and passed just off my left side. i was parked at approximately: n38 42.558 w121 15.720. when i first spotted the lights, they were at an approximate heading of 170 degrees from my location at an elevation of approximately 25-30 degrees above the horizon. they were 3 independent lights and were traveling together, though not in a fixed formation. i estimate the visual magnitude of the lights to be at least -4 or brighter. their brightness varied and they seemed to occasionally change heading, but maintained a consistent south-to north track across the sky. during observation, they changed positions relative to each other. they sky was clear and i could see the star field between and behind the lights. i estimate the altitude of the objects to be between 500-1000 feet agl. i was able to capture video of the object movement on my mobile phone. based on the speed and movement of the objects, i believe they were some sort of aircraft, but they did not move like a typical helicopter or fixed-wing aircraft. their behavior was more like an ultralight. i could not see any wingtip navigation (red\\green) lights. i could occasionally glimpse some structure to one of the objects, but not clearly enough to identify it. when the lights were directly across from me (east of my location), their elevation was approximately 40-45 degrees above the horizon. they continued on a northerly track, roughly in the direction of the city of rocklin. i left the area when the objects were low to the horizon to the north, just above rooftop level from my view. total observation time was probably 5-10 minutes. the attached video is 2 separate clips and has been processed to reduce file size. the original video is in 3gp format and is approximately 107mb in total size."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Summary":"3 bright amber lights moving slowly from south to north","Log Number":"US-02232011-0008","Date of the Event":"02/22/2011 08:30 UTC","Latitude":"38.711905","Object Shape":"Star-like","Tags":"City","Disposition":"Unknown","trends":["There have been 9 other sightings in Citrus Heights","There were no other sightings in Citrus Heights on or around February 22nd 2011","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path"}