{"Weather Factors":"Unknown","Date Submitted":"02/24/2011 02:46 UTC","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","trends":["There have been 33 other sightings in Vancouver","There were no other sightings in Vancouver on or around February 18th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/27968.html.txt","/var/www/straped/mufon/org/27968.html"],"Object Shape":"Sphere","Longitude":"-123.105967","Log Number":"CA-02242011-0002","divs":["Sighting DetailsI was two blocks east of 18th Ave and Cambie St in Vancouver. I was going to my truck to get my jacket and looked west up in the sky (something I'm always doing I think in this case though I was looking up to see what the weather was like) It was clear skies for the most part. My gf's street is has a lot of trees on it so the spot i looked up was really one of the few openings I could see from where my truck was parked. I could see planes flying off in the distance, but something different caught my attention. There was a bright Orange object in the sky. I would say a little larger and a little brighter than what a planet looks like in the sky only this was Orange in color. It seemed pretty far away, i would say at least a few miles. That's what stuck out initially. I told my gf to look at it (she is very skeptical about this type of stuff) while I grabbed my jacket quick. She even made some comments that it didn't look like a plane or anything (you could see another plane north west of it with marker lights and everything). I stood there for another minute and watched it move. The orange object made kind of a clockwise circular movement and then at the 6oclock position it started to move in a straight line and then stopped. We now began to walk west towards Cambie St hoping to get a better vantage point. I was even tripping a few times on the sidewalk as I was glued to the sky. Once we got a better view I stopped because it started to get dimmer. My view was framed to the left by a large tree, the bottom by a house, and to the right was a smaller tree. The Orange object was located i would say about a 45o angle of elevation. As it was fading (slowly) it wasn't moving it only flickered a few times. I paid attention to the fact that it wasn't moving over anything on the horizon. And then just like that it was gone. And I went on with my night. The sighting was really fast, I only had my cell phone and don't think it would have showed that well. I think my drawings will better represent what we saw. My gf can verify everything we saw from the movement, it's brightness, and it fading to nothing while not moving."],"Case Number":"27968","Tags":"City","Latitude":"49.269606","City":"Vancouver","Country":"Canada","Disposition":"Unresolved","Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=49.269606,+-123.105967(27968)&iwloc=A&hl=en\"> mufon case (27968) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"02/18/2011 08:30 UTC","Source":"MUFON","Summary":"Bright Orange object random movements then fades or disappears","Region":"British Columbia"}