{"Case Number":"27972","Object Shape":"Square, Rectagular, Star-like, Triangle","Source":"MUFON","Date Submitted":"02/24/2011 02:16 UTC","Viewing Distance":"Unknown","Latitude":"43.198152","Weather Factors":"None","Object Features":"Other, Unknown","Region":"New Hampshire","files":["/var/www/straped/mufon/html2text/27972.html.txt","/var/www/straped/mufon/org/27972.html"],"Date of the Event":"02/24/2011 01:17 UTC","Log Number":"US-02242011-0005","City":"Undisclosed","Longitude":"-71.564425","Disposition":"Unresolved","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=43.198152,+-71.564425(27972)&iwloc=A&hl=en\"> mufon case (27972) map </A>","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI looked out the window about 1:17 am into our backyard(facing wnw)because the moon was bright and mayby I would see a deer. I saw a bright object with strobing red, white, yellow colors. My fist thought was that must be one of those stars that is old and flashs a lot. My second thought was no it looks to close to be a star, it must be a helicopter because of the way they can hoover. Then I realized I had seen this before and mayby it's a satellite, but why all the strobing colors? So back to the hellicopter thought I stepped outside to see if I could hear it. No sound. I went back into the house and got the binoculars. I went to the window and looked through the window and now its about 5 minutes later and it seemed to be moving very slowly to the nw horizon because now it was closer to the outline of the huge tree that we have in our back yard. So I went back outside to look through the binoculars and I saw the strobe pattern change from circular to triangular, and then to an upright long triangular shape And I was trying hard not to move the binoculars by resting my elbows on the deck railing. So I kept looking through the binoculars and it just kept moving more towards the wnw and I stopped watching it around 1:30 am. Buy then it was behind our backyard tree. So later today I tried to search for UFO sightings in NH and found this sight. I do not think that it was a satellite it seemed to close to the earth to be out there with the planets."],"Object Flight Path":"Hovering then path,Straight-line path","Summary":"I looked out the window because of the brightness of the moon to see anything and saw stobing colors.","Country":"United States"}