{"Latitude":"39.087667","Object Features":"None","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Object Shape":"Cigar","Log Number":"US-02242011-0004","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","divs":["Sighting DetailsI was cooking dinner that night and as i waited for the water to boil i looked out the window in my living room area of my house and i saw one bright light so i went over the the window and looked out and saw that light gradually get closer. Then, i looked off to the left of it and there were two more lights but the one in the middle of the 3 i could barely see the body. It was long and cigar shaped with a single light in the front. Almost as if it was leading the group. At first i thought it was just a military formation but i heard no sounds coming from the crafts and i don't recall any military or commercial aircraft that are shaped like a cigar. They moved in a straight line but as they got closer to my apartment building they slowed to a stop above it but i lost sight of it after it positioned itself above my apartment building. So i rushed out side of my apartment to look out and i saw nothing. Not even in the air in all direction i looked. After the incident i just felt amazed that i saw this because it was my first ufo encounter in my life."],"Tags":"City","trends":["There have been 7 other sightings in Rockville","There were no other sightings in Rockville on or around February 23rd 2011"],"Disposition":"Unresolved","Case Number":"27971","Country":"United States","Longitude":"-77.148258","Source":"MUFON","Date Submitted":"02/24/2011 12:24 UTC","City":"Rockville","map":"<A HREF = \"http://maps.google.com/maps?q=39.087667,+-77.148258(27971)&iwloc=A&hl=en\"> mufon case (27971) map </A>","Date of the Event":"02/23/2011 08:00 UTC","files":["/var/www/straped/mufon/html2text/27971.html.txt","/var/www/straped/mufon/org/27971.html"],"Region":"Maryland","Summary":"Formation of long cigar shaped crafts flying over my apartment building. Triangle Formation."}