{"trends":["There have been no other sightings in Saint-Lazare","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Region":"Quebec","Date of the Event":"05/15/2004 08:28 UTC","divs":["Sighting DetailsI'll make this short... Back when I was in high school, my buddy and I were out for a stroll around 8pm in the summer. And we usually talk about screwed up stuff, like alien theories and conspiracies etc. Just beginning our walk, we noticed a weird engine sound in the thick overcast weather above us. We didn't think anything of it, that time. So now we were deep into a conversation about the possibilities of an alien species watching us, right now as we walked in the night and we were just getting to an open area where the sky wasn't covered in overhanging trees. While we walked on the road in the open area, we heard that engine sound again. It sounded like something was directly above us in the fast moving clouds, we then got a little scared. We continued walking and before we knew it the overcast was gone and we were looking up at a fairly lit up milky way. We did not stop to look at the stars and we continued on our way. Just then, I saw something over then next tree line. A red ball, jumped up out from the tree line and danced around for a couple of seconds then left so fast it disappeared in front of our eyes. I like to describe it as if someone had a laser pointer, and were pointing it at the stars and waving it around. Sporadic small movements in different directions then gone. My buddy remembers the night, but not the sighting really, I try to refresh his memory and he just plays along. The only proof I had to back up the story, is \"why did we run all the way back to your house\" I told him this and he instantly remembered us, running full speed 20 blocks... I've seen other UFO's, but this is the first. I remember I had an alien abduction dream that night...I really wish I didn't BELIEVE..."],"Tags":"City","Country":"Canada","Case Number":"27977","files":["/var/www/straped/mufon/html2text/27977.html.txt","/var/www/straped/mufon/org/27977.html"],"Latitude":"46.649779","Log Number":"CA-02242011-0010","City":"Saint-Lazare","map":"<A HREF = \"http://maps.google.com/maps?q=46.649779,+-70.800333(27977)&iwloc=A&hl=en\"> mufon case (27977) map </A>","Object Shape":"Fireball, Star-like","Summary":"Talking about UFO's then...","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-70.800333","Date Submitted":"02/24/2011 06:39 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON"}