{"trends":["There have been 2 other sightings in Southport","There were no other sightings in Southport on or around"],"Sighting Duration":"Undisclosed","Longitude":"-78.014738","Date of the Event":"Unknown","Weather Factors":"Unknown","Summary":"Family abductions.","City":"Southport","Source":"MUFON","files":["/var/www/straped/mufon/html2text/27983.html.txt","/var/www/straped/mufon/org/27983.html"],"Country":"United States","Disposition":"Insufficient Data","divs":["Sighting DetailsMy wife and children as well as two other family mambers complain af having the same dream where they are all in a large room and can see each other but are unable to communicate. The next day they all contact each other and describe the same things to each other. There are unexplained marks on my wife and children and they bleed. They even complain about having the same type of test performed using the same type of instrument in similar locations. We are scared to death and have been trying to contact John Kledis but have been unsuccessful. I spoke by phone to someone at the MUFON Office in California and was instructed to contact Mr. Kledis. We need someone to either debunk this or help us to understand what has happened and continues to occur. These things do not like my dog and they know that I have weapons. My children have drawn pictures depicting my wife being pulled aboard a craft within some type of beam while I attempt to prevent it from hapenning. We all have specific areas on our bodies that vibrate occasionally. Most of us have unexplained nose bleeds. You have no idea how helpless it makes me feel to have my children tell me what they think is happenning to them and for me to not to be able to make it stop. If I can get to my weapons the next time they are at my house I WILL have as many of these bastards to study as I can empty my gun into. And I hope they have a soul and I hope they go to hell pissing gas. They are not nice to us and frankly we do not deserve this. We need somebody to help us. Either prove to us that all concerned are having some type of ESP dream at the same time on the same night or help us to deal with this and tell us what to do. Contact me at or ###### preferrably at ####### This may not be the proper place to seek assistace but I cannot get in touch with John Kledis. PLEASE FOR GOD'S SAKE HELP US or give this information to someone who can. We are either at home or at a new construction site that we protect when this happens to us."],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.930763,+-78.014738(27983)&iwloc=A&hl=en\"> mufon case (27983) map </A>","Tags":"City","Region":"North Carolina","Log Number":"US-02252011-0004","Latitude":"33.930763","Date Submitted":"02/25/2011 02:53 UTC","Object Features":"Undisclosed","Case Number":"27983","Object Flight Path":"Undisclosed","Object Shape":"Triangle, Other"}