{"City":"Portland","Latitude":"43.666961","files":["/var/www/straped/mufon/html2text/27997.html.txt","/var/www/straped/mufon/org/27997.html"],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/26/2011 05:02 UTC","Source":"MUFON","Summary":"FLYING TRIANGLE WITH RED LIGHTS AT TIPS","Weather Factors":"Unknown","Longitude":"-70.247266","Sighting Duration":"Undisclosed","Region":"Maine","trends":["There have been 17 other sightings in Portland","There were no other sightings in Portland on or around August 16th 2010"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.666961,+-70.247266(27997)&iwloc=A&hl=en\"> mufon case (27997) map </A>","Tags":"City","Date of the Event":"08/16/2010 09:30 UTC","Country":"United States","Case Number":"27997","Object Shape":"Triangle, Other","divs":["sighting details so it started with me and my friends walking down his driveway at night. it was a clear night, the moon lit the area very well and you could see the stars clearly. as were walking and talking, i am looking up at the sky and notice how in the darkness with the stars, the stars were disapearing then reappearing like somthing was moving in front of it. thats when i noticed it was in a triangle shape and it had bright red flashing lights on the ends of the triangle. now i told my friends and they saw it too, but they both believed it was just military aircraft doing high altitude operations. but being an aviation enthusist my self and knowing a good amount of knowledge about planes, i knew this wasn't normal because no beacon light on a aircraft that high could be so bright, the 3 red lights couldn't be flying in perfect in triangle shape formation either. i eventually lost sight of the object as it moved over the woods and i lost sight of it in the trees. also, there was no sound it was dead silence, and nothing explains the movement i saw in front of the bright stars. and one more thing about the military aircraft theory, usually high altitude aircraft are used for survelance and stealth, so why would there be a bright red light on it? and if it was up sooo high, then it must have been moving way beyond super sonic because this was crusing at a fine pace across the sky, and the farther away a mobile object is, the slower it moves, this was a big triangle. my friends still dont belive me, but it was definitly not normal, other wise the government is doing some amazing things behind the publics back. the video i provided isnt mine, the object i saw didnt drop white lights either. this is very similar in shape and brightness of the lights i saw. *(link moved to additional evidence section--cms\\sg)."],"Object Features":"None","Disposition":"Unresolved","Log Number":"US-02262011-0007"}