{"map":"<A HREF = \"http://maps.google.com/maps?q=41.023596,+-80.554956(2799)&iwloc=A&hl=en\"> mufon case (2799) map </A>","Source":"MUFON","Object Flight Path":"Unknown","Longitude":"-80.554956","Viewing Distance":"Unknown","Summary":"High school drive","Tags":"City","Latitude":"41.023596","Object Shape":"Unknown","divs":["Sighting DetailsI have not thought of this incident for sometime and I dont know if I am wastingyour time but here it goes. There were four of us driving in my buddies cardrinking a few beers during 12 time at our schools Poland Seminary Highbasketball game when we turned a corner on an old road near a limestone quarrywhere we both saw a troll-like creature with big eyes and pointy ears standingon a little knoll just watching us go by. We had to be traveling about 10 mphand the cars side-lamps or a bit of the headlamps caught the image. I remembersaying to the guy next to me, did you see that and I remember his response as ifit was yesterday. He said, Yea and we both went back and forth describing indetail what we saw. I had never really spoken to Bob Freedman before since hewas a mutual friend of the 2 guys in the front seat. Bob was an honor studentand was rumored his father was with the FBI. I have not spoken to him about thissince, but am sure of what we both saw and am sure he would testify to the same.I have been in touch with the mutual friend over the years and have been temptedto ask him if he was able to contact Bob. I dont know what this thing was but Ido know we both saw it and were both afraid to bring it up after that night. Iguess because we thought we would be labeled in school as freaks. I now own myown company and am a musician. I would have no reason to make a bit of this up.I dont even know what this could do for you but I have told about 3 other peopleabout this and I felt it may ruin my credibility with friends so I now keep itto myself."],"Weather Factors":"Rain","Date of the Event":"09/30/1984 09:00 UTC","Sighting Duration":"00:00:59","files":["/var/www/straped/mufon/html2text/2799.html.txt","/var/www/straped/mufon/org/2799.html"],"Region":"Ohio","Country":"United States","Case Number":"2799","trends":["There have been no other sightings in Poland Township","This sighting has never been favorited."],"City":"Poland Township","Log Number":"","Date Submitted":"09/30/1984 09:00 UTC","Disposition":"Insufficient Data","Object Features":"Undisclosed"}