{"Date Submitted":"02/26/2011 05:41 UTC","Latitude":"34.058464","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI was in an alley behind a restaurant on melrose avenue when I spotted three glowing objects about five blocks east and one block north of me gliding westward towards me. They were about 100-150 feet above the ground. I started to video them on my iPhone and captured them for about ten seconds but, unfortunately stopped videoing them to call my friend in the shop to come outside. I will never stop kicking myself for stop shooting as, for one thing my friend didn't answer, and for another what I saw next was absolutely unbelievable! As the objects dre near to above my head two of them became out of my line of sight behind a building but the one I could still see glided along silently about as high as a low flying hellicopter then began to accelerate forwards and climb vertically upwards then dissapear before my very eyes. The video I have appears to be three white dots like many pictures I have seen but if you watch it on a enlarged screen and pay close attention to the way they float and sort of weave it is bvious they are not planes or hellicopters. Also they didn't appear as white dots in person, they were sort of conical shaped amber glowing objects about as big as volkswagon beetle and were not far above the power lines and very clearly dissapeared in an instant."],"Region":"California","Object Features":"Undisclosed","Case Number":"27999","Object Flight Path":"Undisclosed","Log Number":"US-02262011-0009","files":["/var/www/straped/mufon/html2text/27999.html.txt","/var/www/straped/mufon/org/27999.html"],"Longitude":"-118.235465","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around February 6th 2011"],"Viewing Distance":"Unknown","Date of the Event":"02/06/2011 07:30 UTC","Tags":"City","Source":"MUFON","Summary":"3 conical amber glowing objects glide along then dissapear.","Object Shape":"Cone","Disposition":"Unknown","City":"Los Angeles","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.058464,+-118.235465(27999)&iwloc=A&hl=en\"> mufon case (27999) map </A>"}