{"Object Flight Path":"Stationary","Tags":"City","Summary":"Two flashing lights above horizon","Disposition":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.203767,+-117.233076(27992)&iwloc=A&hl=en\"> mufon case (27992) map </A>","Object Shape":"Flash, Sphere","Viewing Distance":"Over One Mile","Case Number":"27992","trends":["There have been 11 other sightings in Vista","There were no other sightings in Vista on or around February 26th 2011","This sighting has never been favorited.",""],"Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-117.233076","Region":"California","Date of the Event":"02/26/2011 01:15 UTC","files":["/var/www/straped/mufon/html2text/27992.html.txt","/var/www/straped/mufon/org/27992.html"],"divs":["sighting detailsi was getting ready to leave my friends house at 1:15 am, my two friends and i decided to go outside and have a cigarette before i left. after about 15 seconds of standing there, she asked what that glowing, flickering light in the sky was. pointing above the mountain horizon, i saw what appeared to be a yellow\\orange\\white light glowing sporadically in the sky. i pulled my cell phone from my pocket and filmed it as steady as i could. we first argued that maybe it was a car pointing its light on the horizon directly at us, but then we realized that they would have to be very strong lights. we also talked that maybe it was a fire, however, that was disbanded because fires tend to glow softly from that distance. no, this was definitely above the mountain horizon. after about 2 minutes or so, my friends asked what the other light in the sky was. however, looking only at the original, i had no idea there was a brighter, bluish-white, much more active glowing one to it's left. i recorded both close together in the second video. i had to leave and quit filming because it was late. when i got home, my step-father saw the video and recommended to be placed here."],"Date Submitted":"02/26/2011 06:45 UTC","Latitude":"33.203767","City":"Vista","Log Number":"US-02262011-0002","Object Features":"Undisclosed"}