{"Disposition":"Unresolved","Longitude":"-48.988201","trends":["There have been 2 other sightings in Agudos","There was one other sighting in Agudos on or around February 8th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/27995.html.txt","/var/www/straped/mufon/more/27995_submitter_file1__ovni2.jpg","/var/www/straped/mufon/org/27995.html"],"Weather Factors":"None","Summary":"Clear time day sighting","Date Submitted":"02/26/2011 01:40 UTC","Log Number":"BR-02262011-0005","Object Flight Path":"Hovering then path","Region":"São Paulo","divs":["sighting detailsi actually was not the one that captured it but i really would like to hear mufon comments about the video. i know portuguese and i come from the same state the ufo was recorded, and i can tell that the reaction from the person shooting the video is extremely reliable. the pattern of the speech, the use of slangs and the harmony of the voice really seems to match the real excitement and disbelief of the moment. it was first posted in you tube and reported by the local newspaper. apparently people in the city of bauru, nearby agudos where the video was shot from, reported tremors, like small earthquake about the same time the video was shot. so the local newspaper ran the story correlating the sighting with the reports of the tremor. it would be really great if you could contact the person who posted it and try to get to the bottom of it. here is the link for the video: *(link moved to additional evidence section--cms\\sg). here is the link for the newspaper: **(link moved to additional evidence section--cms\\sg). i hope to hear back from mufom soon. this seems to be a very credible story and i am very intrigue to know your opinion. best regards, (wit's first name deleted--cms\\sg)."],"Latitude":"-22.461443","City":"Agudos","Sighting Duration":"Undisclosed","Date of the Event":"02/08/2011 12:00 UTC","Object Shape":"Cylinder, Oval","Country":"Brazil","map":"<A HREF = \"http://maps.google.com/maps?q=-22.461443,+-48.988201(27995)&iwloc=A&hl=en\"> mufon case (27995) map </A>","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Object Features":"Dome, Other","Case Number":"27995"}