{"Weather Factors":"Unknown","trends":["There have been 2 other sightings in Lander","There were no other sightings in Lander on or around July 31st 1977"],"files":["/var/www/straped/mufon/html2text/2800.html.txt","/var/www/straped/mufon/org/2800.html"],"Disposition":"Hoax","Longitude":"-108.728042","Country":"United States","Latitude":"42.842854","Object Flight Path":"Unknown","City":"Lander","Object Features":"Window(s), Other","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.842854,+-108.728042(2800)&iwloc=A&hl=en\"> mufon case (2800) map </A>","Sighting Duration":"00:05:00","Case Number":"2800","Date Submitted":"07/31/1977 08:00 UTC","Source":"MUFON","Date of the Event":"07/31/1977 08:00 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was with a friend at his parents ranch. It is located about 30 miles southeast of Lander. We were sitting in his car talking when we had the sighting. Wehad been fishing in a pond located about a half a mile from his house and wewere getting ready to go there. As we talked a very large flaming, flashingobject came into veiw. It was massive in size. We were at the bottom, near thenorth west side, of a 10 to 15 mile wide canyon or depression near the foot of amountan. The object came into view crossing the opposite side of the canyon fromus, going towards the mountain. The light from the object light up thesurrounding area, making the brush, rocks, and terrain visible as if daytime.The object appeared to have windows, and some type of markings that may havebeen writing. It seemed to move as if in slow motion. It looked like it wasriding on a flaming cloud and the flames rolled up half the length of the sideand also off the back. There were many lights along the object and I think theywere blue and white. The shape of the object was similar to what the spaceshuttle looks like from the side, but many many times larger, and no visiblewings. When I saw it I remember feeling like I couldnt move. I felt paralizedand like a panic attack. I tried to look at my friend and ask him if he wasseeing this too, but I could not move or take my eyes off the object. It wasonly visible for a maximum of 5 minutes but it seemed like it lasted for anhour. The object looked like it was so close to the ground and mountain sidethat it might start the area on fire. It filled half the width of the canyon ormore. It followed a nearly straight path towards the mountain. The onlydirection change was to adjust for the rising altitude of the ground, and as itreached the mountain it turned to move along the pass between the next mountainsand then it disappeared. After it was out of site it took several moments beforI, or my friend said or did anything. Eventually we excitedly compaired what wesaw. We booth described feeling paniced, scared and nearly in shock. We wereupset that we could not tell any"],"Log Number":"","Summary":"Huge craft very close.","Region":"Wyoming"}