{"Weather Factors":"None","Case Number":"28002","files":["/var/www/straped/mufon/html2text/28002.html.txt","/var/www/straped/mufon/org/28002.html"],"Object Flight Path":"Path with directional change","divs":["sighting detailsi was starring up at the night stars while enjoying the jaquzzi.living where i'm at is an approach for airlines to land.i see them go by all the time with lights on and strobes lit up and easy to identify.this thing was,well i don't know what i saw and was hoping somebody else saw this thing to.its been on my mind ever since i saw it and i can't stop thinking about it and its shape. this object had a leading edge shaped like a finger nail curvature. so you could say boomerang! its leading edge was the finger nail arch and the trailing back edge was a concove arch,like two finger nail edges. with the left and right ends going to a point where both curvatures met. there was a distintive outline of an object with a center area to it.but the center area was almost completely clear almost like it matched the back drop od the night sky.the only difference is the middle portion had a slightly different color tint to it like and aqua colored water but just not that bright,tone the aqua color down substainually.there was no sound,no lights forward,on the bottom or at the back of this thing.i watched this thing make a change in its course and back again.from there it continued towards the ocean and away from my line of sight.it was amazing to me and it had to be under some intelligent control to move like it did.so i know what it saw and have to say it was either millitary or i saw something i never thought i would see? has any body seen something like this? gosh i would like to know? wish i had my camera on me but i was wet and i never would have thought in my wildest dreams i would see this! *(wit's first name deleted--cms\\sg)."],"Date Submitted":"02/26/2011 06:14 UTC","Object Features":"None","trends":["There have been 18 other sightings in Dana Point","There were no other sightings in Dana Point on or around January 28th 2011"],"Summary":"enjoying my jaquzzi and watched the finger nail shaped object fly by","Sighting Duration":"Undisclosed","Latitude":"33.476052","map":"<A HREF = \"http://maps.google.com/maps?q=33.476052,+-117.688578(28002)&iwloc=A&hl=en\"> mufon case (28002) map </A>","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Longitude":"-117.688578","Tags":"City","Object Shape":"Boomerang, Other","Country":"United States","Source":"MUFON","Date of the Event":"01/28/2011 11:45 UTC","Log Number":"US-02262011-0012","City":"Dana Point","Region":"California"}