{"Disposition":"Hoax","Object Flight Path":"Undisclosed","Summary":"different lights, lights were changing, the unkown crafts were multiplying and some seemed to go into a bigger craft","Longitude":"-115.168256","Date Submitted":"02/26/2011 07:06 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/28008.html.txt","/var/www/straped/mufon/org/28008.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.122866,+-115.168256(28008)&iwloc=A&hl=en\"> mufon case (28008) map </A>","City":"Las Vegas","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-02262011-0018","Date of the Event":"04/13/2008 03:12 UTC","Object Shape":"Unknown","Tags":"City","Latitude":"36.122866","Weather Factors":"Unknown","Case Number":"28008","Object Features":"Undisclosed","Region":"Nevada","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around April 13th 2008"],"Country":"United States","divs":["Sighting Details I was walking across the street from my wifes friends house to go pick up my son at his grandmas house.. I randomly was just looking at the sky and i noticed some weird looking crafts were kinda coming from behind the moon. I took out my cell phone and called my brother he came running out and watched the event with me and my wife. A few seconds later the rest of the family came out and they were ranging from 7 to 64 years of age. There was about 6 or 7 at first and then more came out from this more bigger advanced ship( approximately 2 or 4 crafts came out) Some of the crafts were blinking with a red and blue light some of them disappeared and re appeared. It kinda looked like they were conversing with each other and they slowly drifted away towards the area of my wifes mothers backyard. as we went to the backyard we saw them still doing the same thing they were doing ( floating around and moving extremely slow) As a few minutes past by my son went to go get binoculars and at the time me and my brother were laying on the floor outside looking upwords. He came back with the binoculars and we all looked through them and my family described it as looking kinda like a manta ray. Then I pointed the binoculars towards one that was roughly 700 feet above me and it was close the the roof of the house far enough for it to look smaller than it appeared but it was still pretty close. As i pointed the binoculars towards it, it looked like it was spinning pretty fast( it kinda looked like a being painted it) with sun or gamma rays kind of deflecting of it so it made it look bright yellow ish. As it moved it started to look like it was changing shapes slowly or it was rotating. A few minutes past and they started going away and as they were out of sight a plane flew by( just a regular plane) and we could all tell the distinctive traits from what we just saw to a normal airplane."]}