{"files":["/var/www/straped/mufon/html2text/28006.html.txt","/var/www/straped/mufon/org/28006.html"],"Sighting Duration":"01:00:00","trends":["There have been 8 other sightings in Oak Harbor","There were no other sightings in Oak Harbor on or around November 19th 1974"],"Date of the Event":"11/19/1974 12:00 UTC","Disposition":"Unknown","Object Shape":"Circle, Sphere","Region":"Washington","Object Features":"None","divs":["Sighting DetailsThis event was unusual in that hundreds of people saw this event, although I only talked about it with a few dozen. There were seven sighted objects. They were only points of light and moved slowly into stationary position about a mile in diameter over the airfield of Whidbey Island Naval Air Station, Near Oak Harbor, Washington. One man came into my shop and told us about it and about 8 of us went out to watch together. Within 3 minutes the Navy launched the 'Ready 5' attack aircraft. (five minute launch) They launched three heavily armed F-14 aircraft. The F-14's chased the spots of light at about 3000 to 10,000 feet of elevation. The spots would remain stationary until the aircraft approached then suddenly dart away in some direction either vertical or horizontal. This silly chase went on for an hour. No weapons were fired, and none of the F-14's came closer than a couple hundred yards of the UFO's. Eventually, (in about an hour) the UFO's tired of the game and simply accelerated vertically in formation right up and out of sight. Other aircraft including helicopters were launched but no aircraft came close to them. The lights of the UFO's was just large enough to see clearly like a white ball. Approximate size was that of an F-14. Their acceleration was instantaneous, as was their stop. They would seem to slide across the sky, stop instantly, and return to their prior location. We could hear the F-14's but heard no noise from the lights. My girl friend at the time was working in the control tower on base. When I asked her later what she saw on the scope, she replied... \"It has been deemed classified, and since I don't want to spend time in Leavenworth... You won't find out any thing from me.\" She never did tell me anything.."],"Latitude":"48.301486","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=48.301486,+-122.641904(28006)&iwloc=A&hl=en\"> mufon case (28006) map </A>","Summary":"Seven bright lights surrounding the Naval Air Station at elevation","Log Number":"US-02262011-0016","Tags":"City","Longitude":"-122.641904","City":"Oak Harbor","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/26/2011 06:52 UTC","Country":"United States","Case Number":"28006","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Source":"MUFON"}