{"Object Shape":"Fireball, Other","Disposition":"Unknown","Tags":"City","Log Number":"US-02262011-0010","Date Submitted":"02/26/2011 05:43 UTC","files":["/var/www/straped/mufon/html2text/28000.html.txt","/var/www/straped/mufon/org/28000.html"],"Latitude":"42.531333","Region":"Idaho","map":"<A HREF = \"http://maps.google.com/maps?q=42.531333,+-114.300686(28000)&iwloc=A&hl=en\"> mufon case (28000) map </A>","Country":"United States","Source":"MUFON","City":"Hansen","Weather Factors":"Unknown","Date of the Event":"11/15/1967 04:15 UTC","divs":["Sighting DetailsIt was the first day of hunting season in southern Idaho area known as 'The South Hills' in 1967. I was 14 on my first hunt. About 4:30 am my father and I came around a corner to see about 50 vehicles pulled off the side of the road so we stopped too. As we walked around the bend on the mountainous road going directly south from Hansen, Idaho a bright light became visible about 1 mile away. The light looked like a pile of burning magnesium about 2oo feed wide. Some people thought it was an aircraft crash but I did not. It was far too bright (it lit up an area a mile wide as bright as day.) It was so bright you could read your watch (I did). I could have read a newspaper. About 100 hunters stood and watched it in silence. Suddenly it launched vertically (leaving no residue or damage to the area) and went up into the night sky so fast that it shrunk to a pinpoint then vanished and was invisible in less than 30 seconds. Then we got in our car and went deer hunting. As I recall, my father placed a report with the Twin Falls, Idaho Sheriff's office the next day. Everyone gasped in surprise at the speed of the thing when it launched. We were convinced at that time that it was a UFO. So was everyone there as I remember. I wasn't fearful, just amazed and excited to have seen such a thing."],"Object Flight Path":"Stationary","Object Features":"None","Case Number":"28000","Sighting Duration":"Undisclosed","Longitude":"-114.300686","Summary":"Bright light at night seen from a distance of about a mile","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Hansen","This sighting has never been favorited."]}