{"Country":"United States","Date Submitted":"02/26/2011 06:47 UTC","Longitude":"-73.285738","Case Number":"28005","City":"Grand Isle","divs":["Sighting DetailsMyself and a passenger were traveling down route 2 after work. Upon reaching a long straight away on the route I saw what I first took to be an airplane in the sky. It was not moving to either side so I assumed it was coming toasted us. I even joked, \"What's he going to do land on the road?!\". As we neared it I could see it was a huge black triangular \"craft\". I stopped directly under it and put the car in park. We both pulled ourselves up onto the windowsill of our doors. As I looked up into the sky I was simply dumb founded by what I saw. It was about 100 to 150 feet up and it was huge. A triangular shape that was at least 100 feet long and almost as wide. It was absolutely still in the sky! No movement and absolutely no sound what so ever! The three tips were slightly rounded and looked to have what appeared to be a light at each end. The whole under side was covered with a vast network of trenches valleys and pipework of sorts. A totally overwhelming feeling of, \"This doesn't belong here!\" come over me. We sat under it for probably 30 to 60 seconds when it turned 90 degrees to it's left, towards the lake. Again absolutely silently, no down draft, no jets. Once it was pointed towards the lake, it shot away. In about 4 seconds it was beyond our sight. We were stunned and set there several seconds longer yelling exclamations of disbelief! One more strange bit of the sighting that never struck me until later that day was the fact that not one other car passed the sighting on this main route during a summer day. It was the single most amazing event of my life and I remember it today like it had just happened yesterday!"],"Weather Factors":"Unknown","Disposition":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.72803,+-73.285738(28005)&iwloc=A&hl=en\"> mufon case (28005) map </A>","Log Number":"US-02262011-0015","files":["/var/www/straped/mufon/html2text/28005.html.txt","/var/www/straped/mufon/org/28005.html"],"Viewing Distance":"Unknown","Region":"Vermont","Object Features":"Undisclosed","trends":["There has been one other sighting in Grand Isle","There were no other sightings in Grand Isle on or around July 15th 1994"],"Summary":"We parked under a triangle shaped craft. It was totally still and silent in the sky approximately 100 to 150 feet above us.","Sighting Duration":"Undisclosed","Latitude":"44.72803","Date of the Event":"07/15/1994 12:00 UTC","Source":"MUFON","Tags":"City","Object Shape":"Triangle"}