{"map":"<A HREF = \"http://maps.google.com/maps?q=32.919834,+-96.630603(28003)&iwloc=A&hl=en\"> mufon case (28003) map </A>","Latitude":"32.919834","Case Number":"28003","Summary":"Massive Fireball passing from East to West from western horizon to Eastern horizen","Country":"United States","Disposition":"IFO","Tags":"City","Weather Factors":"Unknown","Object Shape":"Fireball","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28003.html.txt","/var/www/straped/mufon/org/28003.html"],"trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around June 14th 1972"],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-96.630603","Date Submitted":"02/26/2011 06:21 UTC","City":"Garland","divs":["Sighting DetailsI do not remember the exact month or date of this event even though my entire family witnessed it and Dad called it into the police at the time. Note: I personally witnessed the daytime Columbia Shuttle destruction several years later, and the Columbia event was FAR smaller in size than this one. It is my best opinion that this was a iron meteor of immense size that passed through the highest reaches of the upper atmosphere ... except that it did not leave an a fire trail behind it... (As the Space Shuttle Columbia did) and did not leave a visible smokey trail. It maintained an exact heading and did not change size or shape and continued completely out of sight over the Eastern horizon of Texas. There was no visible calving of other burning objects, explosion or impact. The time it took to cross the entire night sky was less than 5 minutes. For size, I could cover the fireball with the ball of my first finger at arm's length. My guess of elevation was around 120,000 feet. It was massive. It burned a yellow orange but did not illuminate my surroundings significantly. (we were standing in our front yard in Texas) If I were to guess at it's size I would say the object was over 100 yards wide. It was at least 10 times the size of the Space Shuttle Columbia. We were excited and talkative as we had time to watch and discuss the event."],"Log Number":"US-02262011-0013","Date of the Event":"06/14/1972 08:30 UTC","Object Features":"None","Region":"Texas","Viewing Distance":"Unknown"}