{"Longitude":"-82.552155","files":["/var/www/straped/mufon/html2text/28001.html.txt","/var/www/straped/mufon/more/28001_submitter_file1__Pasturephoto1.JPG","/var/www/straped/mufon/more/28001_submitter_file2__UFOoverourpasture2secondslater.JPG","/var/www/straped/mufon/org/28001.html"],"Source":"MUFON","Object Flight Path":"Hovering then path","divs":["Sighting DetailsWe had just moved from Philadelphia, PA to Western North Carolina. I was taking some photos for our family to see our small farm. I stepped out onto our porch with my digital camera (Canon PowerShot A530) made sure the lens was clean and began photographing the beautiful sunset toward the end of our road, over the larger pasture. I remember the sky being so blue and clear against the contrast of the sunset. The first photo I took was of the end of the road. A few seconds later I took the second photo. Eager to see the photos I downloaded them from the media card onto my computer. At first I didn't notice anything but the sunset. Later when I showed them to my husband he asked about the image in the upper left hand corner. I was shocked to find an object in the photo that hadn't been in the previous photo! What the heck is it?? When I enlarge it on my PhotoShop program the object did not pixilate; it held its shape? We were watching UFO's Over Earth and realized a group of guys fishing in Fayetteville, NC in January 2007 (the same year I took my photo) witnessed some sort of UFO. That's when I dug out the photos and decided to send them to you. Attached are the two photos. I'm not certain that I want my information passed onto a third party until unless this photo has credibility. I am a published author and would not want my readers or employer to judge me on this incident. I would truly appreciate your investigation of this object."],"Tags":"City","Date of the Event":"07/20/2007 12:00 UTC","Region":"North Carolina","Date Submitted":"02/26/2011 06:00 UTC","Latitude":"35.605935","Country":"United States","Summary":"Photo of Unidentified Flying Object","map":"<A HREF = \"http://maps.google.com/maps?q=35.605935,+-82.552155(28001)&iwloc=A&hl=en\"> mufon case (28001) map </A>","Object Shape":"Saturn-like","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Case Number":"28001","Log Number":"US-02262011-0011","Object Features":"Dome","Weather Factors":"Unknown","City":"Asheville","Sighting Duration":"Undisclosed","trends":["There have been 28 other sightings in Asheville","There were no other sightings in Asheville on or around July 20th 2007","This sighting has never been favorited.",""]}