{"Disposition":"Unknown","Latitude":"34.87829","Summary":"3 horizontal flashes of light, first two white, then red, all laser like traveling east to west at a very fast pace","Region":"Arizona","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Features":"Unknown","Longitude":"-111.75391","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around February 27th 2011"],"Sighting Duration":"Undisclosed","Country":"United States","Case Number":"28018","map":"<A HREF = \"http://maps.google.com/maps?q=34.87829,+-111.75391(28018)&iwloc=A&hl=en\"> mufon case (28018) map </A>","divs":["Sighting DetailsI had been sleeping restlessly upstairs (with stomach distress) from 12:34 AM until 4 AM.when I finally decided to get up to drink some herbal tea so I could feel better. Turns out I had food poisoning but long story short, my cat was up with me and I noticed her watching outside of our LR windows downstairs. I had my back facing those windows but when I turned around to see what see was looking at I saw a very bright rapid traveling light in front of our house moving low in the horizon from east to west, followed by another rapid bright traveling white light and then a red light (exactly like the first two but red). If I were to discribe them, I would say they looked like bright laser lights. I felt like I was watching starwars in front of my house. I yelled upstairs at my husband to see if he was awake and told him I had just seen some very strange lights. When I looked back out, the roof of a neighboring home adjacent to ours lit up with a circular pattern above it. I then jumped up to run to the window and I asked my husband if he had seen anything. He had gotten up and pulled the blinds open but had not seen the lights. I didn't hear anything or see any motor vehicle lights; we had just received a snowfall which is rare in our area, so it was very quiet out. There could not have been any aircraft flying in this weather, nor was there any traffic going by. The entire time from when I first awoke til after these lights disappeared, the sky had an eerie hue to it. Lights were reflecting off of the low lying clouds. My cat was acting strange and kept watching outside the window. I have never seen anything like this and wished I had felt better when I woke up so I could have focused more on what I was seeing. I am now obsessed with what I saw and wonder if anyone else in my area had seen any strange lights. I'd say I was scared more than curious at the time though."],"Weather Factors":"Snow, Light","City":"Sedona","Log Number":"US-02272011-0006","Date Submitted":"02/27/2011 01:31 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Object Shape":"Flash","Source":"MUFON","Date of the Event":"02/27/2011 04:15 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/28018.html.txt","/var/www/straped/mufon/org/28018.html"]}