{"map":"<A HREF = \"http://maps.google.com/maps?q=55.033333,+82.916667(28016)&iwloc=A&hl=en\"> mufon case (28016) map </A>","Date Submitted":"02/27/2011 09:41 UTC","divs":["Sighting DetailsHello: This is the second report i have submitted from Novosibirsk. I am a Canadian who lives and works in Siberia. I went outside my house for a cigarette and noticed what I thought was Mars but I noticed it was in the wrong location. I then looked with a little bit more concentration and noticed it was surrounded by three other stars and made what looked to be a cross. I then noticed it was too bright for a star and Mars and was almost a violent red or burnning orange. I then watched it change colour and become smaller. At first I thought maybe there was cloudcover obscuring my view but the sky was clear and bright. I then noticed a plane was coming close to that part of the sky and it then became smaller fast and gone. I did notice some movement in an Easterly direction but after about ten seconds nothing. AS I noted in a sighting about a year ago my feelings were entirely one of observation and for the second time I didn't bother to grab my camera. I since gone to look at the same spot and still nothing. I lost sight of the object simply because it vanished. The witnessess to this event were my wife and her friend. I am sorry but I can't be bothered filling in all their data and I have not asked for their consent so bare with me."],"Date of the Event":"02/27/2011 08:25 UTC","Object Flight Path":"Stationary","Tags":"City","Viewing Distance":"Unknown","Latitude":"55.033333","Object Shape":"Star-like","Object Features":"Unknown","Source":"MUFON","trends":["There have been no other sightings in Novosibirsk","This sighting has been favorited 1 time."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Country":"Russian Federation","files":["/var/www/straped/mufon/html2text/28016.html.txt","/var/www/straped/mufon/org/28016.html"],"Longitude":"82.916667","Weather Factors":"Unknown","Case Number":"28016","Summary":"It was a bright re/orange glowing star-like object. It changed from bright red to orange and then white. It was very big then small and then dissolved.","City":"Novosibirsk","Log Number":"RU-02272011-0004","Region":"Novosibirskaya oblast"}