{"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=36.10439,+-80.238206(28013)&iwloc=A&hl=en\"> mufon case (28013) map </A>","Latitude":"36.10439","Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28013.html.txt","/var/www/straped/mufon/org/28013.html"],"Date of the Event":"03/31/1998 10:00 UTC","Region":"North Carolina","Object Features":"Patterned Surface, Other","Disposition":"Unknown","Log Number":"US-02272011-0001","Tags":"City","Country":"United States","City":"Winston-Salem","Longitude":"-80.238206","Object Shape":"Circle, Sphere","Case Number":"28013","divs":["sighting detailsmy mother, myself, and another child whom she was driving to school, where on our way to school\\work around 9:30-10:00am. about 5 miles from my mothers work, we noticed rainbows, very short about the size of the sun, on either side of the sun. we observed this for about 3 minutes. when we bagan to turn onto the highway, we saw a small black swirl appear in the center of the right rainbow. the hole stayed open for a few minutes, as we parked, we stepped out and continued to observe the rainbows and black hole. after a few minutes we noticed something begining to peek from the hole, it was silver and looked as if it was trying to roll up hill, under weak power before exiting the rainbow\\hole. the silver ball object soon exited the black hole which closed behind this object. the object hovered at the exit point for about a minute. i could see small red points on it's outside. it then very slowly began to descend towards the ground finally disappearing behind the tree line. we waited and watched for about 10-15 minutes afterwards and never saw the object again. it appaeared to be about 20 miles away. and i would estimate it's size to be roughly 60ft in circumference. we were all mezmorized by the sighting, but suffered no adverse effects."],"Source":"MUFON","trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around March 31st 1998"],"Summary":"Ball dropped from a black hole in a rainbow.","Viewing Distance":"Over One Mile","Date Submitted":"02/27/2011 01:47 UTC"}