{"Summary":"Huge, boxy, floating, disappeared before my eyes.","Source":"MUFON","City":"Watertown","divs":["Sighting DetailsThis was an amazing moment in my life, i was on my way to classes at the local college and i was sitting in my parked car listening to the radio when out of no where a boxy, airplane like figure was floating in the sky. not moving, just floating there for almost 5 seconds, i gasped, i knew it was a ufo that i had seen. it looked so much like an airplane, almost like the aliens are copying our designs of our air crafts in order to get closer to our land with out suspision. i know what i saw, call me crazy but they are coming. i know they are, why else would they copy our models of design? to get closer of course and figure out how to defeat us. at first i thought the object was just a weird looking airplane since we live next to a military base, then i noticed it was not moving, at all. just floating until it completely vanished; almost like it was able to go to another dimension whenever it pleased. the object only floated, it was boxy and was silver-ish in color and it was very low to the ground, that is why it caught my attention."],"files":["/var/www/straped/mufon/html2text/28024.html.txt","/var/www/straped/mufon/org/28024.html"],"Object Shape":"Square, Rectagular, Other, Unknown","Case Number":"28024","Latitude":"43.982194","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","trends":["There have been 4 other sightings in Watertown","There were no other sightings in Watertown on or around October 15th 2010"],"Date Submitted":"02/28/2011 12:15 UTC","Disposition":"Hoax","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.982194,+-75.901786(28024)&iwloc=A&hl=en\"> mufon case (28024) map </A>","Object Features":"Wings, Other","Longitude":"-75.901786","Log Number":"US-02282011-0001","Region":"New York","Date of the Event":"10/15/2010 03:00 UTC","Weather Factors":"None"}