{"Summary":"Triangular craft","Tags":"City","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 30th 1985"],"Log Number":"","Disposition":"Unknown","Date Submitted":"11/30/1985 12:00 UTC","Object Features":"Undisclosed","Date of the Event":"11/30/1985 12:00 UTC","Longitude":"-95.36179","Latitude":"29.766813","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"00:10:00","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/2802.html.txt","/var/www/straped/mufon/org/2802.html"],"Object Flight Path":"Unknown","divs":["Sighting DetailsIt has been such a very long time since this incident that I must questionthings such as, Was there really a hum or any sound If so, I am confident itwas only a hum- as this seems to be what I remember, though, admitedly, I cannot ascertain unequivocally there was any sound at all. In my recollection, Irecall a total of 6 lights on the underside of the craft. Ive searched forevidence of others who have seen the 6 light set and have not yet found them,though I remember these lights well.I was 15 at the time of the incident... It was late, perhaps 900 PM, the sky wasdark. We resided in a neighborhood that was pretty rural and woods surroundedour house- which was the only one on the street- although we did have neighborson adjacent streets. I was smoking a cigarette, just kind of walking aroundwhen I saw it. It was moving very slow and heading toward me. I was in awe. Ifelt an amazing feeling of elation as it came to rest directly above me. Itsimply hoovered there for a minute- and then it BACKED UP, and started slowly inanother direction. I was overwhelmed by what I was seeing and chased the craftuntil it was too far into the woods for me to follow any longer and I could onlyobserve from a distance as it grew farther and farther away. It traveled veryclosely above the treetops. I watched it until it disappeared- from distance orsome type of hyperspace propulsion I simply cant be sure.I ran inside and told my step-father who dismissed my claim as ludicrous andinsisted it was merely a clandestine military craft, and the incident wasdropped.Now that I am much older, I realize that what I saw couldnt have been a militarycraft and I hunger for a true explanation."],"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=29.766813,+-95.36179(2802)&iwloc=A&hl=en\"> mufon case (2802) map </A>","Region":"Texas","Case Number":"2802","City":"Houston","Country":"United States"}