{"Viewing Distance":"Unknown","City":"Surrey","files":["/var/www/straped/mufon/html2text/28025.html.txt","/var/www/straped/mufon/org/28025.html"],"Object Flight Path":"Undisclosed","Date of the Event":"06/15/2009 02:11 UTC","Disposition":"Unresolved","Longitude":"-122.825196","Object Features":"Undisclosed","Source":"MUFON","Latitude":"49.108147","Date Submitted":"02/28/2011 12:49 UTC","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"02:00:15","Case Number":"28025","Region":"British Columbia","Country":"Canada","trends":["There have been 11 other sightings in Surrey","There were no other sightings in Surrey on or around June 15th 2009"],"divs":["Sighting DetailsIt all started when i was walking back from meeting some friends during June 15 2009 and around 2 am as i was heading through my little field that is very small i happed to look up in the sky like i always do but to my surprise i noticed something in the corner of my eye and upon further investigation it turned out to what look like a Triangle shaped object directly above me about the normal hight that a private air plane is allowed to fly at. The Object was hovering motionless above me with no sound at all during a clear full moon light light, the object had no lights at all and seemed to be silver in color. And upon seeing this object i got the feeling i was being watched and i also had a feeling of fright so i ran the rest of the way home. Now upon that night i had a dream where all i can remember is lying in bed having the feeling of being watched through the darkenes of my attic room and all i can really remember after that is i was lying on a what felt like a cold steel table and i remember looking up and to my horror i remember seeing four alien greys all standing around my head examining my head. Ever since that event i feel as tho i am being watched and like some people in this world i put allot of resurch into aliens and government cover ups and even the possibility that aliens might be living among us hiding. But whenever i feel im getting somewhere with all of this when i feel im geting close i get headaches painful ones and im not sure why. to this day i feel i am still being watched but i have no idea by who, weather it be aliens or the men in back."],"Object Shape":"Disc, Triangle","Log Number":"CA-02282011-0002","map":"<A HREF = \"http://maps.google.com/maps?q=49.108147,+-122.825196(28025)&iwloc=A&hl=en\"> mufon case (28025) map </A>","Summary":"Dark Triangular Object"}