{"Object Flight Path":"Stationary,Hovering then path","divs":["Sighting Details(8:40 p.m.) While traveling down 20th street, also known as Cty Rd. K, from Oshkosh to Omro, Wisconsin, my girlfriend and I crested a hill near my home which is located in the countryside of both cities. On the downslope of the hill I was conversing with my girlfriend when I noticed a series of orange orbs over the treeline of my neighbors home. They quickly flashed and disappeared. I could not verify distance or size because it was so sudden. At first I was shocked, and was not certain of what I had saw. I thought perhaps it was reflection of a garage light or aircraft of known origin as we are about twenty miles from an airport. Regardless, my girlfriend did not notice the lights or the flash as she was intent on the road at the time. (8:45 p.m.) She pulled into my driveway, which is located on the corner of K and Sand Pit Road. While entering my home, I turned to wave goodbye, and noticed a single orb over the field across the road. I pointed and attempted to get the attention of my girlfriend, who put her car in park and turned just to see the orb collapse upon itself. At this point I knew I was dealing with something out of the ordinary. (8:50 p.m.) I walked back to the car, as my girlfriend exited the vehicle, and while staring into the distance to the point where the orb had finished (about a half mile west), a large, chandelier shaped object appeared less than a quarter mile away from us above the filed across the road. It had several small orange orbs surrounding a large central ball of a darker orange hue. This object stayed lit for several seconds before collapsing upon itself. (9:00 p.m) At this point my girlfriend, who was shaken by the incident, returned home. About a minute after she had left, I still remained outside staring in wonder at the night sky. Suddenly, a V shaped formation of orange lights hovered, flashed, and dimmed heading southwest. These lights appeared once more and disappeared. I entered my home to inform my family of the incident. I noticed several cars parked alongside K which must have noticed the object too. I grabbed a pair of keys and jumped into my father's car and took off down K toward the last spot I saw the lights. Two vehicles were parked alongside K between Knot Road and Cty Rd FF. I turned down FF, heading south, and swung into my friend's home on the corner of FF and Hwy 91. I asked if anyone had seen anthing out of the ordinary. (9:45 p.m.) Having shared texts with two friends who had seen the lights and explaining my story to those at my friend's house, I decided to go out for a cigarette. While scanning the skies, the orange lights appeared as a single line above the tree lines south of Hwy 91. I scanned for several minutes before returning inside to grab my keys. (10:00 p.m.) I returned home without another sighting of the lights. I contacted the Oshkosh Police Department and informed them of my sighting. An officer came to my home and took a police report on the lights. He also informed me that the nearby airport and air traffic controllers did not claim to have any aircraft in the area at the time of the incident. He took the names of the other witnesses, and after telling me he gets reports in this area from time to time of similar lights and to not worry about it, he left. *These sightings persisted for several weeks, and months, to this day. Though not as frequently as they did for the last two weeks of November. I've contacted several individuals who saw the lights on multiple occasions, and in different areas of the night sky, although mostly located in the area of K and Sand Pit Road. I have had three sightings myself since the original November sighting including a streaking light that reminded me of a roman candle styled firework, except each ball remained lit and collapsed in sequence. Generally speaking, the sightings are of single orbs, however, as described above, they do occasionally drift from that description.* (I do have sketches of the sightings, however, I do not have them uploaded to this computer yet. To date, several attempts to videotape the lights has failed. Two photographs do exist, but the quality and lighting makes it impossible to determine what the object is.)"],"Weather Factors":"None","Object Features":"Undisclosed","Country":"United States","Date Submitted":"03/01/2011 12:24 UTC","Disposition":"Unknown","Object Shape":"Flash, Sphere, Other","Log Number":"US-03012011-0001","map":"<A HREF = \"http://maps.google.com/maps?q=44.039426,+-88.744277(28035)&iwloc=A&hl=en\"> mufon case (28035) map </A>","Case Number":"28035","trends":["There has been one other sighting in Omro","There were no other sightings in Omro on or around November 15th 2010"],"Sighting Duration":"Undisclosed","City":"Omro","files":["/var/www/straped/mufon/html2text/28035.html.txt","/var/www/straped/mufon/org/28035.html"],"Source":"MUFON","Tags":"City","Summary":"Series of orange lights in V-formation, chandelier, and singular orb seen over period of two hours.","Date of the Event":"11/15/2010 08:45 UTC","Latitude":"44.039426","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"Wisconsin","Longitude":"-88.744277"}