{"Case Number":"28031","files":["/var/www/straped/mufon/html2text/28031.html.txt","/var/www/straped/mufon/org/28031.html"],"Sighting Duration":"Undisclosed","Latitude":"42.66116","Date of the Event":"07/15/1980 12:00 UTC","Longitude":"-70.996726","Source":"MUFON","Object Features":"Other","Region":"Massachusetts","map":"<A HREF = \"http://maps.google.com/maps?q=42.66116,+-70.996726(28031)&iwloc=A&hl=en\"> mufon case (28031) map </A>","divs":["Sighting DetailsI was driving a friend home from a night out. We both saw a large craft in the sky moving slowly (10 - 25 mph) from east to west. We stopped the car and got out. We watched it moving very slowly, above the roadway and treetops. We were astonished by what we were seeing! I have never seen anything like it before or since. Estimated altitude was 1000 ft. The size of the craft was estimated to be three to five football fields in diameter. We were on the edge of and directly below it. It was flat bottomed with a scattering of small, round colored lights. The color of the craft was dark or black. It was so large that we could not distinguish the outline of it's shape. It made NO SOUND! It was completely silent! The trees on either side of the road obscured our view somewhat, so that we could not see the entire craft at one time. It took about 10 minutes to completely pass by. After it had passed, we got in the car, turned around and proceeded up the road to another road that ran in nearly the direction the craft was moving. We attempted to chase it but could not locate it. I cannot explain what we saw that night. Many years have passed since then. I haven't thought much about it since then. But in recent months, it has been more at the forefront of my mind. To me, it proves that there is a way to fly silently and that the craft was likely from another world."],"Summary":"Very Large craft seen flying low, silently, slowly.","Date Submitted":"02/28/2011 07:54 UTC","Country":"United States","Object Shape":"Disc, Unknown","Disposition":"Unresolved","City":"Boxford","Object Flight Path":"Straight-line path","Tags":"City","trends":["There have been no other sightings in Boxford","This sighting has never been favorited."],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02282011-0008"}