{"Tags":"City","Log Number":"US-02282011-0010","files":["/var/www/straped/mufon/html2text/28033.html.txt","/var/www/straped/mufon/org/28033.html"],"trends":["There have been 7 other sightings in Blaine","There were no other sightings in Blaine on or around February 27th 2011"],"City":"Blaine","Object Features":"Other","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=49.003223,+-122.739409(28033)&iwloc=A&hl=en\"> mufon case (28033) map </A>","Date Submitted":"02/28/2011 11:16 UTC","Region":"Washington","Object Flight Path":"Path with directional change","divs":["Sighting DetailsMy dad and I were heading South on I-5, when we both spotted two giants bright lights in the sky. Looked as if they were coming towards us like a plane, but continued to watch. Almost 360'd the craft and the lights were still as bright as they had been before. Finally, pulled off the road and watched it. As it flew towards us, we could hear a noise like that of an airplane, and it was descending fast although no airport nearby anywhere. As it came closer, there were 6-8 red blinking lights, and 4 giant bright white lights; 1 on each corner of the craft and one right in the middle. While flying over us the noise got louder and louder. Continued to watch. Well, it started to loop around to where it was on the other side of the northbound traffic to where there is a huge field. There was only one tree blocking our view of the field. It continued looping, and looping, until behind the tree. We waited a good minute until my dad pulled forward more on the road and turned off the car. There was no sound but cars going by us. And we could not see ANY bright lights with how low it was. Obviously if this was a plane, we would have seen it land or crash in the giant field. I begged my dad to go see what it was and if it had landed. But we were already on a tight schedule. On our way home, we went back to the field and went through all the back roads it could have been on where we would have seen it. Nothing. If anyone else saw this, or any of the strange other things going on here, please report it. We have had at least 2 or 3 sightings in the past week."],"Viewing Distance":"20 Feet or Less, 21-100 Feet","Date of the Event":"02/27/2011 10:20 UTC","Longitude":"-122.739409","Object Shape":"Diamond, Triangle","Disposition":"Unknown","Source":"MUFON","Latitude":"49.003223","Summary":"HUGE black triangle with tons of lights, flew right over us disguised as a plane, then disappeared.","Case Number":"28033","Weather Factors":"Unknown","Country":"United States"}