{"map":"<A HREF = \"http://maps.google.com/maps?q=33.639099,+-112.390208(28043)&iwloc=A&hl=en\"> mufon case (28043) map </A>","Object Flight Path":"Straight-line path","Region":"Arizona","Source":"MUFON","Summary":"Ship like object appears in unattended motion activated video","files":["/var/www/straped/mufon/html2text/28043.html.txt","/var/www/straped/mufon/org/28043.html"],"Disposition":"Unknown","Object Features":"Dome, Appendage(s)","Weather Factors":"Unknown","Date Submitted":"03/01/2011 01:20 UTC","Sighting Duration":"00:00:03","Viewing Distance":"Unknown","Country":"United States","Case Number":"28043","Object Shape":"Other","Date of the Event":"01/27/2011 08:56 UTC","Log Number":"US-03012011-0009","trends":["There have been 11 other sightings in Surprise","There were no other sightings in Surprise on or around January 27th 2011","This sighting has never been favorited.",""],"Longitude":"-112.390208","Latitude":"33.639099","Tags":"City","divs":["sighting detailsrecorded 1\\27\\2011 at 2056 on yukon night ranger with video output to easy capusb device and recorded with ufo capture software v2.2 first part has date time stuff, then video stops movement, then continues without date time, near end little sat appears in bottom right. video stopage happens alot on long running videos and do not know why. this is an unattended recording using software that is motion activated. the software is recording all the time so when motion is detected, it show the frames leading up to the event as well. the camera was pointed sse at approx 160deg, elevation was approx 40deg. the main ir illuminator was off, but short range ir was on. the sun had set for about an hour, and the object moved from east to west. a satillite moving west to east can be seen at the end of the video, in the lower rh corner. the video was started at 2056:12 and was written to the disk at 2058:25 so it took about 2 min 13 seconds. the ufocapture avi lasted 1 min 41 seconds with some dead time noted on the screen. many of my captures do this, don't know why? first i thought the software had injected an image onto the video while recording, cause it looked so strange. and my trial version of the software was set to expire.it looked at first like a big rocket ship, so weird. i noticed this the next day while reviewing the videos captured the previous night. the report with my group can be found at: *(link moved to additional evidence section--cms\\sg)."],"City":"Surprise"}