{"Source":"MUFON","Sighting Duration":"00:08:00","Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.750035","Region":"Georgia","files":["/var/www/straped/mufon/html2text/28045.html.txt","/var/www/straped/mufon/more/28045_submitter_file1__U.F.O.2-1-2011.JPG","/var/www/straped/mufon/org/28045.html"],"Weather Factors":"Fog, Rain","Country":"United States","Object Shape":"Circle, Sphere","Summary":"bright star. got about 10 times brighter.","Log Number":"US-03012011-0011","Case Number":"28045","Longitude":"-84.380962","Date of the Event":"02/01/2011 07:15 UTC","Object Features":"Undisclosed","Date Submitted":"03/01/2011 09:44 UTC","Tags":"City","Object Flight Path":"Stationary,Hovering then path","City":"Atlanta","Disposition":"IFO","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around February 1st 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.750035,+-84.380962(28045)&iwloc=A&hl=en\"> mufon case (28045) map </A>","divs":["Sighting DetailsMe and my fiance was out on my front poorch. She was talking on the phone with her mom. I had walked out onto the walk way and saw a real bright white light. I told my fiance hurry come look at this! She got up from the swing and came to where I was standing and the light we looked at got brighter and brighter. If you stretched out your arm and pointed your index finger it got about the size of a nickle maybe a little bigger. It got so bright that it would actually hurt your eyes at times. I have never seen anything in my life this big and bright. I took a picture of it with my phone before it got to its full size. I am still amazed as to what we saw. My son also witnessed this. My fiance doesnt believe as I do in the UFO stories. But she was actually dumbfounded as was my son. I started walking threw my yard over to the edge of my Nighbors yard so I could get a better picture of it, as this was the time of the brightest it got. As I got the point of taking a picture it dimmed out and started going to the left and was then flashing with 2 red lights. As it was moving away a Jet plain came threw to where its location was at the time(I believe this Jet liner is the reason it moved away.) The location it was in is the location of the air traffic Atlanta airport travels. Another note to this story I as was looking at it at its brightes point it was like it was shooting light into me. It's really hard for me to explain this for I've never had any exsperience like this before. I also felt incedibly good. I mean really good like I was on cloud 9. I know this sounds crazy but I'm trying to see if anybody else has experienced this before. I have reported sighting to you guuys before a few years ago as to this area seems to be A spot these objects like. I also calle the local Sheriff's office and asked if anybody else reported this sighting. They informed me that knowone else had reported anything. The picture I took I sent it to a friend of mine who has also seen objects with me at a time they where there almost every night. He told me it looked like the moon. Then I told him it got about 10 times bigger than that. My fiance doesnt believe but after tonight she has a totally different opinion LOL!"]}