{"Disposition":"Unknown","divs":["Sighting DetailsI was on my balcony looking up at the sky while taking a smoke break from some computer work & noticed 3 different objects that caught my eye. The first was red & white blinking lights. I initially thought it was an airplane because that seemed like the most logical explanation. Then I noticed the wasn't really any sort of pattern to the blinking of the lights. I was a crew chief for a cargo plane in the USAF so I know what planes in the night sky (should) look like. As it moved furher away I still thought \"this could be an airplane flying east\". I then noticed the object move right, left, up and down very quickly. It finally moved so far out of sight that I could no longer see it. While standing there contemplating what I just saw, I noticed a large bright star towards the right (higher than the 1st object). It was really bright and looked like a star. The star like object began to look more and more oval shaped. I assumed the research I had done on UFO's could be making my mind play tricks on me. I shrugged it off and looked towards a park that I live about a block away from. I noticed what I thought at first were birds flying in a triangular shape formation (as birds often do). As the \"birds\" got closer I realized none of them were flapping their wings and they stayed in a perfect boomerang like formation. Not moving apart or together, up or down. They were just cruising along. I then thought maybe I'm misjudging distance and started really focusing on the objects. I then thought well maybe it's jets flying in formation since it's not uncommon here since I live somewhat close to a navy base. I watched as they got closer & closer and began to pass my house. As I watched I waited to hear the jet engines but heard nothing. This boomerang shaped object just cruised right along not moving higher, lower or side to side. It moved in a steady straight line like it had a specific destination it was aiming for. It then dissappeared out of sight. I almost forgot what I had seen about a half an hour later until mentioned it to my friend. While talking with him on the phone I went back out to look at the odd \"star\" I had seen 30 minutes prior and it was gone. No stars at all where I had just seen this \"star\". He said he had seen something similar a few years ago and suggested I report it to this web site. So, here I am and this was my experience. Think what you want, but I saw what I saw!"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.907079,+-90.134256(28047)&iwloc=A&hl=en\"> mufon case (28047) map </A>","trends":["There has been one other sighting in Westwego","There were no other sightings in Westwego on or around March 1st 2011"],"Country":"United States","Date of the Event":"03/01/2011 07:00 UTC","Object Shape":"Boomerang, Fireball, Star-like","Latitude":"29.907079","Object Features":"Unknown","Region":"Louisiana","Log Number":"US-03012011-0013","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Sighting Duration":"00:03:00","Tags":"City","Longitude":"-90.134256","Summary":"I was on my balcony looking up at the sky while taking a smoke break from some computer work & noticed 3 different objects that caught my eye.","Weather Factors":"Unknown","City":"Westwego","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/28047.html.txt","/var/www/straped/mufon/org/28047.html"],"Source":"MUFON","Date Submitted":"03/01/2011 10:33 UTC","Case Number":"28047"}