{"Case Number":"28059","map":"<A HREF = \"http://maps.google.com/maps?q=60.491168,+-151.049353(28059)&iwloc=A&hl=en\"> mufon case (28059) map </A>","files":["/var/www/straped/mufon/html2text/28059.html.txt","/var/www/straped/mufon/org/28059.html"],"Log Number":"US-03032011-0003","divs":["Sighting DetailsAfter doing a normal nightly scan of the sky, I noticed a strange odd pentagon-like shaped star constellation in the sky I have never seen before. Upon saying this outloud to myself, a star just outside the pentagon-like constellation began moving. Obviously stars dont move, but here in Alaska, I have been watching them for some 12 years off and on now, but this is the first one I have caught in quite some time. It lasted longer than most \"moving stars,\" as most sightings the objects are moving much faster and out-of-sight within two or three minutes. This object began in the SW sky and traveled NNW for over four minutes before fading out of view. It was a light white and slightly orange in color. It did not shift from its slow straight path, but was not a satellite either. I would have to say if it was in our planets orbit it must have been at around 60-70+ thousand feet high. NOTE: My wife reported a UFO for the first time in her life only back in January, in which the following night a strange \"blackout\" happened in which my wife and I either both had the same dream, or she had an abduction. {Ironically, when my dad's mom was 5 months old, he was in the car with my grandmother and grandfather, and my grandmother was abducted in Orange County, California in the spring of 1953. I was the first grandson of 7 sisters and brothers, and our son was 9 months old when the \"possible\" abduction of my wife took place.}"],"Weather Factors":"Unknown","Region":"Alaska","Source":"MUFON","trends":["There have been 5 other sightings in Soldotna","There was one other sighting in Soldotna on or around March 2nd 2011"],"Country":"United States","City":"Soldotna","Longitude":"-151.049353","Object Shape":"Star-like","Date Submitted":"03/03/2011 01:37 UTC","Summary":"Star like moving object at 60-70+ thousand feet","Viewing Distance":"Over One Mile","Disposition":"IFO","Object Flight Path":"Straight-line path","Object Features":"None","Latitude":"60.491168","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"03/02/2011 09:12 UTC"}