{"divs":["sighting detailsi am filling out this report on behalf of some friends who witnessed and recorded this event. my friends (3 witnesses in total) were standing in front of their residence which is about a 1\\4 mile ne of cisco, tx. they were looking due south toward the town of cisco. at 7:15pm they began seeing solitary orange lights flash on above the town in various places in the sky and then slowly fade. the objects appeared to hover. they would appear in one spot and fade away in the same spot. finally, one of the witnesses pulled out their phone (a motorola atrix 4g) and began taking video (see attached file). as soon as he began recording (it was 7:45pm at this point), the witnesses immediately viewed one of the orange lights appearing, immediately 5 more lights appeared in succession forming a titled disc pattern in the sky. once all of the 6 lights were present, all six lights faded in unison. this particular event is what was captured on the video. as you can tell from the audio, one witness thought the lights could be flares while another questioned this as there were no planes in the sky at the time. the lights in the video that are below the ufo are the lights of interstate 20 that runs east\\west, just south of cisco."],"Date Submitted":"03/02/2011 11:58 UTC","Object Features":"Undisclosed","Object Shape":"Circle, Disc, Flash","Object Flight Path":"Stationary,Hovering then path,Unknown","Longitude":"-98.971154","City":"Cisco","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/28056.html.txt","/var/www/straped/mufon/org/28056.html"],"Latitude":"32.394066","Source":"MUFON","trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around March 2nd 2011","This sighting has never been favorited.",""],"Log Number":"US-03022011-0009","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"03/02/2011 07:45 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.394066,+-98.971154(28056)&iwloc=A&hl=en\"> mufon case (28056) map </A>","Viewing Distance":"Unknown","Summary":"Orange lights make ring in the sky","Case Number":"28056","Region":"Texas"}