{"Log Number":"US-03022011-0006","City":"East Stroudsburg","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in East Stroudsburg","There were no other sightings in East Stroudsburg on or around February 17th 2011","This sighting has never been favorited.",""],"Region":"Pennsylvania","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Longitude":"-75.179441","files":["/var/www/straped/mufon/html2text/28053.html.txt","/var/www/straped/mufon/more/28053_submitter_file1__lineofsight.JPG","/var/www/straped/mufon/org/28053.html"],"Date of the Event":"02/17/2011 03:30 UTC","divs":["sighting detailsi was working the overnight shift at the wal mart in east stroudsburg, pa. on the morning of febuary 17th at around 3:30 am i went out to my truck to have a cigarette and listen to the news on my radio. i looked out of the drivers side window towards interstate 80 which is south of the store. i saw a small white light in the sky i first thought was a plane dead centered over a small wooded mountain south of the interstate about 1 1\\2 miles away. the light grew brighter and larger. from my perspective lets say from a pencil point to 1\\2 inch diameter at arms length. the light hoovered for about 2 minutes then began to slowly drop. as it neared the mountain the light it emmitted lit the peak to the point i could see the shadows cast on the snow by the trees on the northern slope of the hill. the main body of the object dropped behind the mountain but i could still see it's light. the light grew brighter for a few seconds and then disapeared. i know the area of that little peak very well and there is nothing but woods and a small lake behind it and no place for a helicopter or plane to land. i've added a google earth capture with a black line showing my position in the parking lot to the estimated area of my sighting."],"Date Submitted":"03/02/2011 11:25 UTC","Disposition":"Insufficient Data","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Latitude":"41.008949","Object Features":"None","Summary":"I was sitting in my truck on a break from work when I saw what I first thought was a small plane grow bright then slowly desend behind a mountian.","Case Number":"28053","map":"<A HREF = \"http://maps.google.com/maps?q=41.008949,+-75.179441(28053)&iwloc=A&hl=en\"> mufon case (28053) map </A>","Country":"United States"}