{"Object Features":"Unknown","Country":"United States","Object Shape":"Other","Date Submitted":"03/03/2011 12:12 UTC","Case Number":"28069","Viewing Distance":"Unknown","Log Number":"US-03032011-0013","files":["/var/www/straped/mufon/html2text/28069.html.txt","/var/www/straped/mufon/org/28069.html"],"Latitude":"34.054094","Source":"MUFON","Disposition":"Unknown","Date of the Event":"08/15/1973 10:30 UTC","Longitude":"-118.236385","map":"<A HREF = \"http://maps.google.com/maps?q=34.054094,+-118.236385(28069)&iwloc=A&hl=en\"> mufon case (28069) map </A>","Summary":"Approx 6 objects obs West to East stop completely, proceeded south, stopped again and continued east out of sight.","Sighting Duration":"00:00:10","Weather Factors":"Unknown","Tags":"City","Region":"California","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around August 15th 1973"],"divs":["Sighting Details1973, (I want to say it was late summer) I was a Marine Corp. Air Traffic Controller stationed at MCAS Santa Ana, CA. We concluded air operations at about 10:00 p.m. This particular night it was my turn to take the trash down while the rest of the crew finished the days flight strips and straightened up for morning operations. I was standing at the base of the tower in the dark, the airfield lights were off. I was wondering what was taking my co-workers so long and looked up to see if the interior tower lights were off (which would indicate they were on their way down). The lights were off. As I was looking up, I observed what appeared to be a formation of high flying, extremely fast moving aircraft, traveling from the west to the east. I couldn't hear any sound of jet engines (Santa Ana is in fairly close proximity to the El Toro Marine Air Base where a number of fighter squadrons are based). I immediately concluded two things; one, they were too high to be jet aircraft (the individual craft appeared to be a little bit bigger than a satellite, but two, they were traveling about the speed of what I had seen on other occasions in the night sky and guessed the object to be a satellite. The flight path west to east was observed for maybe three to four seconds, when abuptly they stopped almost directly over head. I couldn't tell if they slowed, it didn't appear to me they did, but I am certain they stopped suddenly. Maybe, not more that a second or two, but then took off again, heading due south towards San Diego. Their speed appeared to be the same as I initially observed on the easterly course. Just before they were to get out of my vision, (maybe three seconds) I observed them to stop again. Another short pause and I observed them track back east bound, where I lost sight of them. I of course told my fellow controllers what I had seen and none of them took me serious. I never really pursued the incident after that but whenever anyone talked about the possibility of UFO's I would always relate my incredulous observations of that night. One night, I guess it was a year or so ago now, I was watching television. It was a program on UFO's and this program in particular featured a gentleman who lived in England who had seen what he believed to be a UFO. I don't recall the specifics of his sighting but he drew on a piece of paper for his interviewers what the formation he saw looked like. It appeared to be very close to the same formation I had seen in 1973. I say close because, I can't remember if the V- formation had three or four aircraft on one side. What I mean to say is that the V-formation we often see in our own military aircraft fly-by's or even in birds was not the same length on each side. It appeared that there was four or five craft on one side and two or three on the other. I say craft per side because even at the height they were at, it didn't appear to me that the lights didn't appear to be evenly spaced. I got the impression that each of the lights were separate craft. The point is that this person saw the same thing I had seen probably twenty or so years earlier, (I assume his sighting was in the 1990's) I had always wondered if anyone else had seen what I observed. I did watch the paper and listen to the news to see if anyone wrote about the unusal sighting in 1973. But I never saw anything. I did report this years ago to some UFO site I had found on the Web but nothing ever came of my report. I don't even remember now what the site was called. I saw your site listed on a television program the other day and decided to give it one more try for whatever it is worth. Thank you"],"Object Flight Path":"Path with directional change","City":"Los Angeles"}