{"Source":"MUFON","Weather Factors":"None","Summary":"I witnessed what looked like an angel high up in the sky flying from west to east directly over head","City":"Westminster","Date Submitted":"03/04/2011 03:13 UTC","Case Number":"28079","divs":["Sighting DetailsI was at my local library taking a break outside having a cigarette all alone when a white object in the western sky caught my eye. It was out far towards the mountains in the western sky flying in a straight line directly over head, I assumed it was a plastic shopping bag caught in an updraft but as I continued gazing up, as it came closer into view I recognized what appeared to be two sets of flapping wings two pointing forward and two facing backwards kind of like how butterflies wings are positioned. I also noticed the humanoid was clothed in a long flowing white gown that fluttered in the wind and if I had to give an estimate of how high this thing was in the sky I would say the same altitude as commercial plaines flying over colorado. I also realized this thing must be huge if I would compare it to a human I would guesstamate it to be at least 4 to 5 times larger. It took all of 15 min to past me and as it did I thought out loud (DON'T GO COME BACK) and it did. It banked to its left turning in my direction and coming down at me in an almost 3 dimensional effect I felt like a gold fish in an aquarium and a huge human hand was reaching in to grab me. I asked my self is it really coming at me...I then took a step back filled with excitement and fear and shouted GO AWAY! It complied . It then turned back in the direction it was going and continued on. I watched it until it was a speck in the east sky It was by far the weirdest experience I have ever had."],"Tags":"City","Longitude":"-105.035505","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around June 25th 2009"],"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.841393,+-105.035505(28079)&iwloc=A&hl=en\"> mufon case (28079) map </A>","files":["/var/www/straped/mufon/html2text/28079.html.txt","/var/www/straped/mufon/org/28079.html"],"Sighting Duration":"Undisclosed","Object Shape":"Other","Country":"United States","Latitude":"39.841393","Region":"Colorado","Object Features":"Wings","Viewing Distance":"Over One Mile","Log Number":"US-03042011-0002","Date of the Event":"06/25/2009 12:00 UTC","Disposition":"Hoax"}