{"City":"Bear","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/2807.html.txt","/var/www/straped/mufon/org/2807.html"],"Tags":"City","Weather Factors":"Unknown","Longitude":"-75.658263","Log Number":"","Source":"MUFON","Date of the Event":"05/31/1981 11:30 UTC","Sighting Duration":"00:05:00","Summary":"This is an old siting that I never reported.","Object Shape":"Other","Region":"Delaware","Object Features":"Undisclosed","trends":["There have been no other sightings in Bear","This sighting has been favorited 1 time."],"divs":["Sighting DetailsMyself and witness 2 were returning from a date. The time was approximate. Wewere traveling North on Bear-Christiana Rd., which is a two lane rd. As Ilooked ahead, I noticed search lights over the Department of Transportationvehicle yard. The facility is located at 250 Bear-Christiana rd. Bear, DE 19701. I first noticed the lights when we were approximately 300-400 metersaway. Kimberly asked me what the I thought the lights were. I responded thatit looked like maybe the police were using a helicopter and were searching forsomething. When we were approximately 100 meters away I slowed the vehicledown. It was a very humid evening and the windows were down in the vehicle. Inoticed that I couldnt hear the rotor wash, which is what I would expect from ahelicopter. I immediately pulled off the road to the protest of Kimberly. Atthis point, we were approximately 50-75 meters away from the vehicle yard and onthe opposite side of the road. I sat in the car listening and wondering what itwas that was over the yard. I asked Kimberly if she could see anything. Shedidnt respond. I asked her again and she replied by saying, I want to leavePlease, lets go I looked back at Kimberly who was visibly shaken by what wewere seeing. I got out of the car, again at the protest of Kimberly, to getback in the car and leave. I stood beside the drivers side looking slightly NEacross the road and up at the search lights. The lights were emitting downwardfrom above the vehicle yard. There were 3 distinct lights shining down andmoving slowly in a circular motion. All 3 of the lights shown down, eminatingfrom an unknown point and fanning out in a conical fashion where the widestportion shown over the vehicles in the yard. They circled, methodically, slowlyover the vehicles. I noticed that the tops of the trees surrounding the vehicleyard we were swaying as if in a moderate wind. There was NO SOUND. I searchedfor the shape or anything that I could identify as a helicopter or vehicle. Isaw nothing. As I continued to search the air above the search lights, Isuddenly noted a dark, blue line, like neon, that ran E to W, that from mydistance, appeared to be at least 30 feet long and approx. 1 foot high. Nosooner did I notice the line that it suddenly was chased away by a dark, redline. and the search lights began to move away to the W, slowly. I still couldnot make out an outline of whatever it was, nor did I ever note any sound. Iran up the road close"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.629279,+-75.658263(2807)&iwloc=A&hl=en\"> mufon case (2807) map </A>","Case Number":"2807","Country":"United States","Viewing Distance":"Unknown","Latitude":"39.629279","Date Submitted":"05/31/1981 11:30 UTC"}