{"map":"<A HREF = \"http://maps.google.com/maps?q=39.747514,+-104.983103(28078)&iwloc=A&hl=en\"> mufon case (28078) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Latitude":"39.747514","City":"Denver","Log Number":"US-03042011-0001","divs":["Sighting DetailsI experienced this sighting around 2001. It was in Denver Colorado in the month of Aug. around 4pm I was in the back yard sitting on a trampoline with my then girlfriend at her house looking up in the sky and out of no where two balls of light shoot threw a small cloud that was right over head,blue and red and They looked like they were playing tag like children and they were so bright they glowed during the day. I vividly remember the light shining threw the cloud in the middle of the day....That freaked my girl friend out something crazy. As she ran off into the house terrified I stayed and watched them dematerialize into thin air then they come back in the middle of the cloud and bolt up into the atmosphere. Not more than 3-4 minutes passed when two Air-Force jets came screaming out of the east right threw the very cloud I witnessed the lights..... obvious radar detection .I believe they were two F-15's I remember thinking those are tactical fighters meant for one purpose.... air superiority. Each orb had its own unique color, the lighter one was more blue than white and the reddish one more of a amber color. The interceptors made one low ( I meen LOW) pass threw the cloud where the orbs were witnessed but later on 5 minutes or so ) I heard the jets far of in the distance but at a much higher altitude this time round. The sky was clear only a hand full of clouds in the sky. My then girlfriend was terrified possibly because she thought they were some kind of demonic force or angelic, I later asked her to verify what we had seen and she described it as seeing angels and demons in the sky...what an imagination, My self had no fear at all during the sighting. I just felt fascination and a thirst for an explanation. I recall seeing them when I was younger ma-by around the age of 7, I'm 33 years old now and I asked my late grandmother if she recalls seeing balls of light fallowing us in the fields along the highway on our way from Texas to Colorado and she confirmed."],"Object Shape":"Fireball","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around November 30th 2000"],"Object Features":"Undisclosed","Date of the Event":"11/30/2000 12:00 UTC","Country":"United States","Disposition":"Hoax","Summary":"Two Balls of lintense light chasing eachother buring the day.","Region":"Colorado","Case Number":"28078","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28078.html.txt","/var/www/straped/mufon/org/28078.html"],"Sighting Duration":"Undisclosed","Longitude":"-104.983103","Object Flight Path":"Undisclosed","Date Submitted":"03/04/2011 02:28 UTC"}