{"Case Number":"28072","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Tags":"City","Date Submitted":"03/03/2011 01:46 UTC","divs":["sighting detailsnote: i am guessing at the year, as i really don't know for sure. seems like around 2002 or so. i was sitting on my front porch steps, looking at a clump of telephone wires that had been tied off in a spidery looking shape. day-dreaming, resting. my eyes absent-mindedly followed one of the telephone lines over my sidewalk, to my right, and that is how i happened to notice a very distinct, yet almost unnoticeable (if i hadn't have looked almost exactly at it's spot accidently) silver-ish tiny 'dot'(a teensy bit bigger than a dot) just off the phone-line, to my perspective. it was obviously miles away, to north, and quite high up. so i just kept staring at it, wondering what it could possibly be. this was broad daylight, but i could see the sunlight glinting off of it to 'its' west, the direction of the sun at that time. one thing that struck me also, was that there's no way i would ever have noticed it, unless i looked almost exactly at its spot in the sky. but i wonder how it may have looked to anyone under it, or nearer to it. i didn't dare take my eyes off of it, for fear i'd lose it. so i sat there for a good 10 mins, thinking about the oddity of it. mainly that it kept it's exact position as i referenced it to the telephone line (as my marker). it wasn't moving in relation to me. after about 10 mins., i finally decided to run inside to see if my binoculars were somewhere easy to find. no, couldn't find them quickly so i went back outside and looked and it was still there, so i sat back down to keep watching it. after another minute (approx.) i saw it shoot to the west, slightly upward in a split second, and then it was gone. i think about it a lot, even these many years later. wish i could see it again. ;-d p.s. i did try to figure out approx what area it was over, which i realized was hard to fathom exactly due to how high and i didn't really know how big\\far it was. but one thing in it's 'general' area, was the old trojan nuclear plant that used to be located just outside goble, oregon. they destroyed it a few years ago. but it still stood at the time i saw this silver, stationary dot in that direction."],"Country":"United States","City":"Portland","Object Shape":"Circle","Object Features":"None","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around November 30th 2001"],"Weather Factors":"None","Viewing Distance":"Over One Mile","Region":"Oregon","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"45.531592","map":"<A HREF = \"http://maps.google.com/maps?q=45.531592,+-122.668277(28072)&iwloc=A&hl=en\"> mufon case (28072) map </A>","files":["/var/www/straped/mufon/html2text/28072.html.txt","/var/www/straped/mufon/org/28072.html"],"Source":"MUFON","Longitude":"-122.668277","Log Number":"US-03032011-0016","Date of the Event":"11/30/2001 04:00 UTC","Summary":"Tiny metallic shining dot stayed EXACTLY in place, very high and miles over from me. After approx 10 mins, SHOT to the west, disappeared."}