{"Date Submitted":"03/03/2011 09:26 UTC","Object Flight Path":"Undisclosed","Country":"United States","Object Features":"Undisclosed","Summary":"star like didnt move but flashed colors and different lite patterns","Weather Factors":"Unknown","Object Shape":"Star-like","Region":"Florida","Tags":"City","Longitude":"-82.530547","map":"<A HREF = \"http://maps.google.com/maps?q=28.485368,+-82.530547(28076)&iwloc=A&hl=en\"> mufon case (28076) map </A>","files":["/var/www/straped/mufon/html2text/28076.html.txt","/var/www/straped/mufon/org/28076.html"],"Latitude":"28.485368","trends":["There have been 12 other sightings in Spring Hill","There were no other sightings in Spring Hill on or around July 3rd 2011"],"Viewing Distance":"Unknown","City":"Spring Hill","Log Number":"US-03032011-0020","Sighting Duration":"Undisclosed","divs":["Sighting Detailsmy son was taking our dogs out when he came back in to the house really excited. he was telling us to go outside something weird was in the sky. i went out to see what it was assuming he saw a plane or helicopter,because we really dont live very far from a small local airport. it was about 8:05pm on a thursday night when i looked up and in the distance there was an object pretty far up in the sky and it seemed stationary, but it was flashing brightly and different colors and after watching it constantly for over an hour it never moved even though we watched several other aircrafts go up and they appeared to get very close to it and then they would continue on their path. it was so strange whenever anything seemed to get close to it in the air it would start rapidly changing colors and flashing faster. after the airplanes were gone the flashing object didnt flash so fast. it just was too strange i was trying to explain to my children what it was they saw but honestly I dont know what I saw I know what I think it was and to me I have never seen any aircraft stay in the same place for over an hour and act like it has a mind of its own anytime something got too close. I had to stop watching it because I had to put the kids to bed but as of 9:22 pm its still in the same spot."],"Disposition":"Insufficient Data","Source":"MUFON","Date of the Event":"07/03/2011 08:15 UTC","Case Number":"28076"}