{"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/28074.html.txt","/var/www/straped/mufon/org/28074.html"],"Country":"United States","Disposition":"Insufficient Data","Object Features":"Unknown","Latitude":"41.349559","trends":["There have been 8 other sightings in Ottawa","There were no other sightings in Ottawa on or around March 2nd 2011"],"Sighting Duration":"Undisclosed","Longitude":"-88.835477","Region":"Illinois","City":"Ottawa","Log Number":"US-03032011-0018","Viewing Distance":"Unknown","Date of the Event":"03/02/2011 08:00 UTC","divs":["Sighting DetailsWe live out of the city limits so stars are always clear on a clear night. People in the city of Ottawa usually cannot see the stars due to lights from the city. Anyway, this is the second time I have seen an object as I stood on my deck that is not a plane or stars. Its pretty clear actually. One is very big and a perfect triangle with a light in three places. The other appears smaller but it is much higher up so I don't know. They just stayed there in the same place the whole time. What I do know is, the smaller one was an elongnated triangle and it was blinking red and blue. I watched it for over an hour. My sons friend who is about 22-23 years old came over and he started showing me different star systems and named them by name. I pointed to the smaller triangle and asked him what was that? He said, \"I don't know, it looks like a ship.\" We laughed a little, but we both just kept looking at it. I asked him if he thought what I was seeing as a perfect triangle looked like a ship and he said, \"It seems different than stars--maybe\". After a while he left and I starred for maybe a half hour trying to get a better mental picture of the big one and finally went into the house. I felt stange at the time and got a bit light headed looking up for so long. I don't have cameras that would have taken a good picture. Now, I am a school teacher and I just pay attention to things. This is not the first time I have seen something like this. I saw a really big triangle one time just over the other side of the river, north of the town bridge this past fall. It just stayed there. I kept looking for information as its hard for me to believe no one else saw this. Well, if they did, they didn't report it. I figured I should mind my own buisness so never said anything, but now, it seems odd to see it again and this time another one at that. I am going to talk to the tech person at my school and find out what kind of camera to buy to get a good shot for long distance and have it on the ready. My cell phone would not have been able to pick this up so I didn't bother. Anyway, I just thought someone needed to say something and I'll keep my eyes open and get a camera. If you have any advice, I'd like to hear it. Its rather spooky because we are a small town of about 18,000 people stretched out all over a pretty big area. I cannot figure what the attraction would be, but I'm telling you I saw those two triangle whatever they were."],"Summary":"There were two objects that were in the sky--way up. This is not the first time I have seen it, but this time my sons friend saw them too.","Case Number":"28074","Object Shape":"Triangle","Date Submitted":"03/03/2011 06:46 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.349559,+-88.835477(28074)&iwloc=A&hl=en\"> mufon case (28074) map </A>","Source":"MUFON","Object Flight Path":"Stationary","Tags":"City"}