{"Sighting Duration":"00:02:29","Country":"United States","Log Number":"US-03042011-0011","Latitude":"40.734948","Disposition":"Unknown","trends":["There have been 7 other sightings in Jersey City","There were no other sightings in Jersey City on or around November 9th 1965"],"Date of the Event":"11/09/1965 08:29 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/28088.html.txt","/var/www/straped/mufon/org/28088.html"],"Case Number":"28088","divs":["Sighting DetailsI was sitting on the stoop of my house viewing the unusual sight of New York City in blackness ( it was the night of the North East and NYC blackout of 1965. The night was clear and I had pretty much an unobstructed view of NYC as it is in direct line of sight of my house. Everything was dark except for a moving point of light moving slowely in the sky, over Manhatten from north to south. At first I thought it to be an airplane but when it reached a position over where the trade center would later be built it came to a dead stop and remained there for just under a minute as I recall. Then it shot straight up into the clear dark sky at an astonishing rate of speed. I'll never forget that night. The reason I am reporting this now is because of a recent UFO video that has been on the news. It is the one that shows a glowing object over the Dome of the Rock. That video shows EXACTLY what I witnessed in 1965 over New York City when I was 17 years old. It behaved in EXACTLY the same way."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.734948,+-74.070132(28088)&iwloc=A&hl=en\"> mufon case (28088) map </A>","Object Flight Path":"Straight-line path,Path then hovering,Other","Longitude":"-74.070132","Weather Factors":"None","City":"Jersey City","Date Submitted":"03/04/2011 04:51 UTC","Object Shape":"Sphere","Source":"MUFON","Region":"New Jersey","Tags":"City","Summary":"Object moved in straight line from north to south over Manhatten. Stopped over lower NYC then shot straight up at extreme velocity.","Object Features":"Unknown"}