{"Object Shape":"Square, Rectagular","Date of the Event":"09/30/1961 09:09 UTC","Weather Factors":"None","Latitude":"39.488267","Country":"United States","Summary":"larger than football field-windows surrounded veh.-lights-felt like someone was watching me-immence fear-felt like long time driving to get away- persons with me saw same thing-fear engulfed us both-we both decided not to ever speak of incident-did not","divs":["Sighting Details38 yrs later met up with same person while visiting someone. As soon as I saw her the first thing out of both our mouths & chillswas. Remember the UFO we saw that night? Neither one of us had ever mentioned it to anyone for all that time. It was very large and hovered could not see anyone looking out of windows but felt like I was bring watched. Traveling north on East avenue towards Strawberry ave it felt like it took a very long time to go approximately 3 blocks. Fear was overwhelming & we both agreed to never speak of the incident ever again. I never did. Until that night when I walked into my friends house and saw this person after 38 yrs. I had always wondered about her but never mentioned the incident to anyone. For both of us upon seeing each other after that long a time to say the same thing at the same time after swearing we would never speak of it ever again was spooky. I think our mutual friend thought we were crazy. I was 17 when it happened and 57 when I ever spoke of it again. The object was nothing of this world and so big and hovering so low over an open field that you would have to have been blind not to see it. It was just above the tree tops. It just hovered. I was overcome with immence fear and put the pedal to the metal of the car I was driving. I felt like the car was not moving and that it took a very long time to get away from the object. I cannot remember the time reference now. I never looked back and never mentioned it to anyone...who would have believed me at that time. No one believes anyone now!"],"Case Number":"28085","Log Number":"US-03042011-0008","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=39.488267,+-75.020511(28085)&iwloc=A&hl=en\"> mufon case (28085) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/28085.html.txt","/var/www/straped/mufon/org/28085.html"],"Disposition":"Unknown","Region":"New Jersey","Sighting Duration":"Undisclosed","Longitude":"-75.020511","City":"Vineland","Source":"MUFON","trends":["There have been 9 other sightings in Vineland","There were no other sightings in Vineland on or around September 30th 1961"],"Object Flight Path":"Hovering then path","Object Features":"Window(s)","Date Submitted":"03/04/2011 03:51 UTC"}