{"Log Number":"US-03042011-0005","Viewing Distance":"Over One Mile","Disposition":"IFO","Object Features":"Other","Longitude":"-100.437514","Source":"MUFON","Date of the Event":"02/18/2011 08:48 UTC","files":["/var/www/straped/mufon/html2text/28082.html.txt","/var/www/straped/mufon/org/28082.html"],"Country":"United States","Case Number":"28082","trends":["There have been 4 other sightings in McClusky","There were no other sightings in McClusky on or around February 18th 2011"],"Weather Factors":"Unknown","Summary":"One orange beam horizontal and four orange beam's exactly the same came down staying inside a cloud.","Object Shape":"Other","Sighting Duration":"00:00:10","Date Submitted":"03/04/2011 12:37 UTC","Region":"North Dakota","Tags":"City","divs":["sighting detailson friday, 2\\18\\2011. i went to let my two dogs outside. i was standing on my side porch looking east. at first i noticed how the moon was behind an evergreen tree that is in my yard. the tree is approximately 60 ft high. it was cloudy out and one of the clouds that was a darker white was located to the left of the tree. when comparing it to the evergreen tree it was approximately 48 ft high to the left of the tree. the clouds seemed to be one mile away and less than 800 ft high in the sky. in this whiter cloud there was a very bright orange light the size of a golf ball at arms length. it started to move leaving a orange very bright line in the cloud. it reminded me of taking a laser pointer and drawing a straight line horizontally across the cloud about two feet. the light beam stayed for about 10 seconds then disappeared. i yelled for my husband who was in his office in the basement. i looked at the time on the stove and it was 8:46pm. went back on the porch. before he could get up stairs, in the same cloud. four more beams. orange in color and very bright, same in size, length just like the first one came straight down leaving its orange beams stayed for about 10 seconds. then all four disappeared at the same time. my husband didn't get to see them. it just scared him because of the way i yelled and one of our dogs where barking. i wasn't scared, just more in amazement. i did get goosebumps and kept looking out the window. my dog kept wanting to go outside and kept barking. she would only go outside if i would go out with her and wouldn't leave my side all night."],"Latitude":"47.494671","map":"<A HREF = \"http://maps.google.com/maps?q=47.494671,+-100.437514(28082)&iwloc=A&hl=en\"> mufon case (28082) map </A>","City":"McClusky","Object Flight Path":"Straight-line path"}