{"Case Number":"28087","Weather Factors":"Unknown","Date of the Event":"11/10/2008 12:00 UTC","Sighting Duration":"Undisclosed","Date Submitted":"03/04/2011 04:36 UTC","Source":"MUFON","City":"Lake Havasu","Tags":"City","files":["/var/www/straped/mufon/html2text/28087.html.txt","/var/www/straped/mufon/org/28087.html"],"Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","Object Flight Path":"Stationary","trends":["There have been 8 other sightings in Lake Havasu","There were no other sightings in Lake Havasu on or around November 10th 2008"],"Log Number":"US-03042011-0010","Object Shape":"Cigar","Region":"Arizona","Summary":"Viewing F-16 flying and observed Large Cigar craft.","Latitude":"34.346692","Country":"United States","Object Features":"None","divs":["Sighting DetailsWas at My home on Arabian Dr in lake Havasu. I was watching a F-16 plane fly over the city. I grabbed my Binoculars too see it more clearly. As the plane headed west towards Calif. I lowered my glasses to get a bearing on direction and I was looking west just above the horizon when I saw a flash. It initialy appeard to be of metal but the plane had gone North of my location. I was on the south facing side of my home so I lost the plane but was taken by the flash west of me. I looked west and could not see anything. I then used the glasses (Binoculars) and saw what did appear as a Cigar just above the desert floor. The craft was yellow-Orange in color and had a band of a darker color towards one end. This appeared as a Cigar band on a Cigar. I took the glasses away and could not see any thing with eyes only but when I put glasses back up I found it again. Th craft appeared to be 20-30 miles away. It was stationary not appearing to move at all when suddenly it was just gone before my eyes. I walked around the front of the home and could not locate the object. There was no change in Sun light or clouds as there was none. In 2009 Iwas watching a show called UFO Hunters and they were in England talking to a pilot who,over the English Observed 2 or 3 of the same craft I saw. I was charged. Only know am I reporting but this craft is real and man I hope more have seen it..."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.346692,+-114.168993(28087)&iwloc=A&hl=en\"> mufon case (28087) map </A>","Longitude":"-114.168993"}