{"Case Number":"28092","trends":["There have been 12 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around January 10th 2011"],"Date of the Event":"01/10/2011 12:00 UTC","Log Number":"US-03042011-0015","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.757242,+-77.428391(28092)&iwloc=A&hl=en\"> mufon case (28092) map </A>","Latitude":"34.757242","Disposition":"IFO","Region":"North Carolina","Source":"MUFON","Sighting Duration":"00:01:30","City":"Jacksonville","Object Flight Path":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Date Submitted":"03/04/2011 07:37 UTC","divs":["Sighting DetailsMy sister and I invited some friends over to our house. Shortly after people arrived I went out our back door alone. I lit a cigarette while walking out the door into the back yard. You're going to hate that I had recently broken my phone and sent it off for repair. As I lift my head up the first thing that strikes me is odd bright lights in my left peripheral vision. I glance to my left, over the neighbors wooden fence and there in the sky are two perfectly still large ovals on the horizon behind a row of distant trees, but still clearly visible. I would estimate the distance to be between 1 and 2 miles and the elevation to be about 60-70 feet high (near tops of pine trees). The ovals were fat and elongated horizontally and glowing a bright pale yellow. I could not decern any features of the ovals aside from light. The lights were much larger and much brighter than a street light which I conveniently had for comparison alongside them. The ovals would be about the size of a quarter if I held my arm at length. I stared in awe for a few seconds, blinking, wondering if they were a reflection of some kind on my glasses, because they were spaced similarly to a pair of giant eyes. So, I began to walk further into my yard to view these lights from a better perspective. The ovals hovered perfectly sill in the sky. Not any indication of movement in any direction. I took maybe 10 paces and turned to face the lights directly, ever curious as to what I was witnessing. They vanished instantaneously without movement after a little over a minute. I told my friends what I had just seen, but had no real explanation. I have never seen anything like it in the sky. Any ideas? Please contact me."],"Summary":"Two brilliant, perfectly still, oval lights stare me down then vanish","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/28092.html.txt","/var/www/straped/mufon/org/28092.html"],"Longitude":"-77.428391","Object Features":"Undisclosed","Viewing Distance":"Unknown"}