{"Summary":"Bright light in sky that went from very fast to very very slow, it turned got brighter and disappeared.","Longitude":"-119.344088","Sighting Duration":"00:05:00","Case Number":"28093","Viewing Distance":"Unknown","Latitude":"36.211979","divs":["Sighting DetailsI went to bed that night as usual. I felt fine and had not been recently ill. I woke up at approx. 2:15am because I felt myself starting to throw up, which has never happened to me even when I have been sick. Immediately the thought came into my head that I woke up too soon. I don't even know why I would think that. I sat on the side of my bed confused as to why this had happened. My husband did not wake up. I got out of bed, went into the living room and turned on the TV. Still confused. By about 2:30 I went out into the front yard to have a cigarette. I sat down in a chair and looked around the yard and neighborhood as usual and noticed it was much quieter than usual. I live close to HWY 99 and there is usually traffic noise buy not this night. I looked up into the Western sky across the street and noticed a bright yellow light moving East very very fast. Then I realized there was no noise from this light that seemed to be at the altitude a local plane would be flying at and I Should hear something. When I wondered to myself what is that the light slowed down very very slow, so slow that I wondered if it is a plane is it going to crash. Once I noticed the light I NEVER took my eyes off of it. It went from moving very fast to moving what seemed to me to be way too slow like it noticed me watching it. The the thought popped into my head does it see me watching it? It made a horseshoe turn to go back West, it got a little brighter then disappeared. By this time I am standing in the middle of my front yard with my mouth open in disbelief as to what I saw and wondering where it went. There was no light or sound from the object, it was just gone. I was left screaming in my head to myself What was that? What the hell was that? After a few minuted I went back inside and sat confused and bewildered as to what had happened. At about 4am I went back to bed still confused but I went back to sleep. I woke at about 6am when my husband got up for work. I told him what I saw and he couldn't explain what he didn't see. At about 6:15am I went back out front and sat in the same chair and had another cigarette. I then noticed a local flying plane in the sky. This I know was a plane. I could hear it, see it's lights and the numbers on the side of the plane. Even the color of the plane. It was flying North. Out of the corner of my eye I noticed a silvery white light going South. Just a ball of light, no sound, not identifying marks like the plane I was seeing. The light was slightly higher than the plane and when the two were about to pass each other the silvery white light got a little brighter and disappeared. Just like the yellow light from earlier. I thought the plane must have seen what I saw. I couldn't believe it. Twice in the same morning? What just happened? What did I see? I can't explain it. All I do know is that whatever I saw both of those times that morning did NOT act like anything I would expect to see in the sky. Planes don't just disappear and they all make noise. I think of myself as an intelligent logical reasonable person and so does everyone else I know, and everyone I have told this to believes I saw something but nobody can give me an explanation. After this strange sighting I started thinking back and realized I have seen a few other unexplainable lights in the sky over the past several years always in the early morning hours. There is more to my story of unexplainable things happening to me. Like waking up with a welt on my stomach twice. I tried to explain it away but couldn't. Like my son waking with strange dots on his back like he was kicked by a golf shoe but with the marks closer together than a golf shoe would have. My husband being told by a Dr. that he has no appendix but has never had it removed. I'm not saying we have been abducted but these are unexplainable things to us. If someone can give us a reasonable explanation we welcome it. Thank You"],"Log Number":"US-03042011-0016","Object Shape":"Circle, Sphere","Source":"MUFON","Country":"United States","Date of the Event":"09/17/2010 02:35 UTC","Disposition":"Insufficient Data","Region":"California","City":"Tulare","trends":["There have been 2 other sightings in Tulare","There were no other sightings in Tulare on or around September 17th 2010"],"Object Flight Path":"Path with directional change","Date Submitted":"03/04/2011 07:51 UTC","files":["/var/www/straped/mufon/html2text/28093.html.txt","/var/www/straped/mufon/org/28093.html"],"Tags":"City","Weather Factors":"None","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.211979,+-119.344088(28093)&iwloc=A&hl=en\"> mufon case (28093) map </A>"}