{"Weather Factors":"None","Summary":"golden orb sphere hovering over highway 80","Region":"California","trends":["There has been one other sighting in Loomis","There were no other sightings in Loomis on or around March 4th 2011"],"Longitude":"-121.193004","Object Flight Path":"Stationary","Country":"United States","divs":["Sighting DetailsI was a passenger in our car as my husband drove down highway 80 a few minutes East of the highway 65 exit near Roseville. The object was directly over the highway approximately at least one hundred feet, but this is difficult to estimate. It was noticeable because it was relatively low (relative to what one would expect from an aircraft), hovering centered over the highway not to the side where a lightpost would be, relatively small(compared to aircraft), spherical, and glowing with a deep golden radiating light. For a second I thought it could be a helicopter, but it was too stationary, with no flashing lights, of an unusual golden color radiating from all sides, and probably too small to be a helicopter. The object moved only slightly if at all hovering directly over the highway as our vehicle approached. I noticed it ahead and strained to watch it from the front windshield and then as we passed it, I watched it out of the back window. I told my husband that the object qualifies as an object that I cannot identify and that he should turn around and pull over along the road so we could study it more closely. As he did not see the object, and did not see an exit nearby or a suitable place to pull over we kept on going. I felt that this was a mistake and that we should have turned around to go back. I felt that the object was extremely unusual and had a somewhat supernatural appearance."],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.821289,+-121.193004(28098)&iwloc=A&hl=en\"> mufon case (28098) map </A>","Case Number":"28098","Object Features":"None","Tags":"City","Latitude":"38.821289","files":["/var/www/straped/mufon/html2text/28098.html.txt","/var/www/straped/mufon/org/28098.html"],"Object Shape":"Sphere","City":"Loomis","Source":"MUFON","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"03/04/2011 07:15 UTC","Date Submitted":"03/05/2011 01:04 UTC","Log Number":"US-03052011-0002"}