{"Country":"United States","Case Number":"28097","files":["/var/www/straped/mufon/html2text/28097.html.txt","/var/www/straped/mufon/org/28097.html"],"Object Shape":"Disc","Tags":"City","Log Number":"US-03052011-0001","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.105108,+-84.50272(28097)&iwloc=A&hl=en\"> mufon case (28097) map </A>","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around July 10th 1999"],"Date Submitted":"03/05/2011 01:01 UTC","Region":"Ohio","Object Features":"Undisclosed","Summary":"Disc shaped, silent, slow moving, colored lights.","Object Flight Path":"Undisclosed","City":"Cincinnati","Date of the Event":"07/10/1999 10:30 UTC","Viewing Distance":"Unknown","Latitude":"39.105108","Weather Factors":"Unknown","Longitude":"-84.50272","divs":["Sighting DetailsMyself and a few friends (5 or 6 of us total) were swimming in the pool in my backyard at approximately 10:30 PM Eastern Standard Time. This occurrence took place on a hot summer night in a suburban area outside of Cincinnati, OH. There was very little cloud coverage (some bright stars were visible however the proximity of my house to downtown Cincinnati usually limits star visibility on an average night), no precipitation was present. We were relaxing in the pool when a friend noticed some odd lights behind some tree cover. Eventually over the tree line came a brilliantly lit craft. Right away we all asked each other very seriously \"what the hell is that thing!?\" I immediately recognized this craft as something extra-terrestrial because of the way that it looked like nothing I had ever seen before. It was moving at approximately 10-20 miles per hour. Judging by the height of the trees and the distance from the craft to the wooded canopy it was approximately 50 yards off the ground. It was a dark grey pewter color. It was metallic looking. I could not make out too many details about the construction of the craft, however I didn't notice any bolts, rivets, etc.. It was disc shaped, with green, purple, and white lights illuminating the bottom. It passed almost directly above us so our view was mostly of the bottom of the craft, however, when we first noticed it come from over the trees we responded by getting out of the pool to try and get a better vantage point. I was able to see a small part of the side of the craft. It was not completely disc shaped in the way that the stereotypical UFO looks like. It was a rounded, symmetrical hexagonal shape. It appeared to have a cockpit or dome type structure on top but that was unclear. The lights were fairly bright and I could make out the placement of them on the vehicle. There appeared to be one white light paired with one green or purple light on each corner of the hexagon shape. This craft was completely silent as it passed overhead. Had this been a man made aircraft at the proximity it was to us there is no way we wouldn't have heard it. Also, I have ruled out that it was a man made aircraft because there was no FAA required navigation lights present. It was moving much to slow to be an airplane, and no visible sign of a propulsion system (such as helicopter blades, propellers, etc.) were seen. The lights did sort of shutter or gain and lose luminosity however they did not blink. There was never a time when the lights were completely not visible. The movement of the craft itself was very smooth. It never stopped to hover, just kept moving at a steady speed. After about 30-45 seconds from first sight the craft had left our range of visibility going behind another wooded area. Unfortunately there was not a camera nearby nor time to go inside to get one to document the sighting. I recently gained interest in the subject of UFO research and decided to contact all the people that witnessed this event with me over ten years ago. In doing so I have confirmed that all of them remember the sighting very clearly and recall it very similarly as myself."],"Sighting Duration":"00:00:30","Disposition":"Unknown"}