{"Date Submitted":"03/05/2011 10:23 UTC","Latitude":"1.530976","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Kuching","Object Flight Path":"Stationary,Hovering then path","Region":"Sarawak","map":"<A HREF = \"http://maps.google.com/maps?q=1.530976,+110.34422(28100)&iwloc=A&hl=en\"> mufon case (28100) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28100.html.txt","/var/www/straped/mufon/more/28100_submitter_file1__UFO1.jpg","/var/www/straped/mufon/more/28100_submitter_file2__UFO2.jpg","/var/www/straped/mufon/more/28100_submitter_file3__UFO3.jpg","/var/www/straped/mufon/org/28100.html"],"Longitude":"110.34422","Viewing Distance":"Over One Mile","divs":["Sighting DetailsIt all happened when we were arriving home around 9.30pm and my youngest son, Manuel was crying. So his daddy, Nolan diverted his attention to colourful lights in the sky, asking him to look at the aeroplane. When he stared longer he said it the lights do not look like aeroplane. As we watched, the object has flickering lights with blue, green, white, red and the object was seen hovering. At first we thought that it was a helicopter. Then we took out our binoculars and digital camera. Viewing with the binoculars, the lights were colourful, blue, red, green and white and the object was hovering. Nolan says it changes shape when he viewed through the binoculars. Then I took a few pictures with my digital camera. As I did not have my tripod and it was dark and my zoom lens was only 80-200mm, the image was not sharp. I wanted to take some video shots but was not in time as the object started to drift further and suddenly it disappeared. The incident of the object hovering with fantastic colourful lights happened for around 20 mins."],"Country":"Malaysia","Case Number":"28100","Object Shape":"Boomerang, Disc","Log Number":"MY-03052011-0004","Date of the Event":"03/04/2011 09:30 UTC","trends":["There have been no other sightings in Kuching","This sighting has never been favorited."],"Disposition":"Unresolved","Summary":"Hovering with Colourful lights","Tags":"City","Object Features":"Unknown"}