{"Region":"Nevada","Source":"MUFON","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=38.8056,+-116.414969(28101)&iwloc=A&hl=en\"> mufon case (28101) map </A>","Viewing Distance":"20 Feet or Less","trends":[],"Object Features":"Other","Case Number":"28101","Longitude":"-116.414969","Sighting Duration":"Undisclosed","Date Submitted":"03/05/2011 11:45 UTC","Country":"United States","Date of the Event":"08/15/2001 03:30 UTC","divs":["Sighting DetailsOn the above time and date was working security at a gated community and was parked in front of the clubhouse. I observed a light floating near to the ground. I exited the security vehicle and walked over to the light and stood about three feet from it. The light was the shape and size of a hockey puck and it had the appearance of a fluorescent light bulb in color. It was lightly raining and the object appeared to be hovering erratically over the wet grass and I would estimate it to be about two inches off the ground. My first impression was that it was smelling the wet grass. I was tempted to reach down and pick it up but did not as I could not understand why it was floating above the ground. I looked up in the sky to see if there was something controlling it but it was overcast and raining and did not observe anything in the sky. After watching it for a couple of minutes it slowly drifted across the paved entrance road and went down a dead-end alley next to the clubhouse. When it went down the alley it turned on the motion detector lights on the clubhouse. I did not follow it into the alley because at this time I was a little concerned about my safety as I could not understand how such a small thing could activate the lights. I checked the area about one hour later and everything was normal and secure. I am reporting this now as I started thinking about this event after watching a TV show about ufos."],"Disposition":"Unresolved","City":"Undisclosed","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/28101.html.txt","/var/www/straped/mufon/org/28101.html"],"Weather Factors":"Unknown","Log Number":"US-03052011-0005","Summary":"Sighted small ufo at close distance","Tags":"City","Latitude":"38.8056"}