{"Country":"United States","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Lights and streaks in the western sky that I couldn't identify","Date of the Event":"03/02/2011 06:00 UTC","Object Features":"Unknown","City":"Albuquerque","files":["/var/www/straped/mufon/html2text/28119.html.txt","/var/www/straped/mufon/org/28119.html"],"Object Flight Path":"Stationary,Straight-line path","Latitude":"35.085941","Object Shape":"Other","Region":"New Mexico","Longitude":"-106.643137","divs":["Sighting DetailsMy partner and I were driving west on Lomas Blvd. on Tuesday evening, March 2nd at a few minutes after 6:00pm. The sun was setting and the sky was bright in front of us with some long, thin horizontal clouds that were dark on the horizon. We saw some lights, for lack of something better to call them. Highest in the horizon were two bright streaks of light that were moving downward at an angle slowly. If they had been all we saw I would have thought they were meteors or jets, but they seemed strange in combination with the rest of the lights. Below them was a spear tip shaped streak of light (as if a spear tip were lying on its side) which seemed to be stationary. Below the spear tip and continuing down to the bottom of the horizon, were three more bright lights. They also appeared to be stationary. As we drove down Lomas we noticed a light descend from the spear tip. It was as if the spear tip separated into two parts, yet retained its shape while the descending light moved down and away from the tip. We were theorizing about what all the lights might be as we drove and could come up with plausible theories until the tip divided. We didn't have a name or a theory for that. We kept asking eachother, \"What is that?\" and saying, \"That's definitely not normal.\" The light descended for a couple of minutes and disappeared. Then the same thing happened again: the spear tip seemed to separate, yet stay in tact, and a light descended down and away from it. We pulled off the road near University Blvd. and watched until the sun set. This was about 20 minutes in all. As the sun set the streaks and lights faded and disappeared. It was difficult to decide whether they had been lit by the setting sun or were making some light of their own, or both. We weren't frightened - just couldn't make sense of it. Some parts seemed natural and explainable, but the dividing spear point, well - we couldn't make sense of that and wonder if anyone else saw it or has an explanation."],"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around March 2nd 2011"],"Case Number":"28119","Date Submitted":"03/05/2011 10:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.085941,+-106.643137(28119)&iwloc=A&hl=en\"> mufon case (28119) map </A>","Viewing Distance":"Over One Mile","Disposition":"Unknown","Weather Factors":"None","Log Number":"US-03052011-0023"}