{"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Columbia City","There were no other sightings in Columbia City on or around September 15th 1973"],"Case Number":"28118","City":"Columbia City","Log Number":"US-03052011-0022","Disposition":"Insufficient Data","Source":"MUFON","Date Submitted":"03/05/2011 09:28 UTC","Region":"Indiana","Tags":"City","Object Shape":"Diamond","Viewing Distance":"101-500 Feet","Latitude":"41.166399","map":"<A HREF = \"http://maps.google.com/maps?q=41.166399,+-85.485123(28118)&iwloc=A&hl=en\"> mufon case (28118) map </A>","Object Features":"None","Country":"United States","divs":["sighting detailsi and 2 of my friends were driving south east of columbia city, in. our home town at around 8-9 pm , we were on raber rd.. we were seniors at the local high school just out for a fun ride. when on our left, over a group of trees we suddenly noticed a bright light that was right on top of the tree level, very unusual. we instantly stop the car in the middle of the road and we all piled out. we stood in the middle of the country road as the diamond shaped craft slowly moved toward us at a height of not more than 200' in the air. it slid off the top of the trees moving at some where between 10 and 20 mph unbelievable. it made an unusual sound sort of a hum, not one i had ever heard from a plane. we stood there looking up saying to each other \"what the hell is that\". i'am glad you have a diamond shape listed. because this craft was diamond shaped flying point first with colored lights blinking at all four tips of its shape. it was dark on the bottom and i could not make anything out, but the craft had a bright light on top. and we could only see the glow of the light. the craft past over us giving no indication that it saw us or cared. the car was stopped and running with its lights on. the craft continued to fly in a straight line over a pasture on the other side of raber road. it traveled for another maybe 1\\8 of a mile in a straight line. then it took off at 45 degree angle and vanished from view in less than 2 seconds. we were left dumbfounded standing in the middle of the road. one of the most amazing things about this event is that my friends and i never spoken of this event to each other even to this today. and i never told my family or friends the first time i told anyone of this sighting was my wife a few years later."],"Date of the Event":"09/15/1973 12:00 UTC","Sighting Duration":"Undisclosed","Summary":"A diamond shaped UFO past over us a 200 feet , moving at 10-20 MPH, it disappeared in less than 2 seconds, this event lasted less than 1 min.","files":["/var/www/straped/mufon/html2text/28118.html.txt","/var/www/straped/mufon/org/28118.html"],"Longitude":"-85.485123"}