{"Source":"MUFON","City":"Tucson","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around January 16th 0001"],"Case Number":"2811","files":["/var/www/straped/mufon/html2text/2811.html.txt","/var/www/straped/mufon/org/2811.html"],"Date Submitted":"01/18/0001 04:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.227433,+-110.923979(2811)&iwloc=A&hl=en\"> mufon case (2811) map </A>","Region":"Arizona","Weather Factors":"Unknown","Object Flight Path":"Unknown","divs":["Sighting DetailsMy children and I were reclining on a blanket on a hill on the north side ofHimmel Park near Treat Ave. and Speedway Blvd. in Tucson, AZ on Sunday, January18, 2004 at about 415 PM. I was lying face down reading a novel, and my 12-yearold and 9-year-old kids were sitting up playing video games and looking around.We had only been in the park about 10 minutes when my son noticed two points oflight like stars directly overhead. I turned over and my daughter and I lookedup to see them. The sky was very clear and blue except for some thick low grayclouds scattered at the horizon in the north over the Santa Catalina mountainsand in the east over the Rincon mountains. I thought wed immediately see thestars, but it took some concentration to see them clearly. They were nearlydirectly overhead at a high noon position on a roughly horizontal line.I thoughtthat perhaps because of the late hour of the day, though not yet at dusk, thatperhaps we were literally seeing stars or planets. Still flat on my back, Iextended my arm directly over my head and made a fist with my thumb extended. IfI placed my thumb midway between the two points of light, there was about a 14of an inch of space between the sides of my thumb and the two points of light.Much to my surprise, the two lights began very slowly rotating in the sameconfiguration as though fixed to a line until they were somewhat vertical. Thenthey very slowly began drifting toward the northeast. The moved roughly in anarc of about two arms-length. We watched about 10 minutes, until my kids askedme to move over to make more room on the blanket. I did so, but lost eye contactwith the points of light and was never able to see them again. After about fiveminutes of searching, my son was able to see them again for just a minute untilthey seemed to disappear. The phenonema that seemed most peculiar was a barelyvisible purplish cloud or mist I estimate to be about two miles in diameter thathovered and moved with the points of light. I had a sense of some type ofcloaking phenomena happening. The purplish mist was very indistinct and seemedto completely blend in with the sky at times.At all times during and after my kids and I felt completely in control of ourconsciousness and emotions. We simply felt some curiosity and a sense of wonderabout what the star-like lights could be. We speculated that they might be somelead lights of a large craft or some sort of satellite. There were scatteredpeople in the park, mostly walking, jogging, playing with balls and frisbe"],"Summary":"Viewed points of light Jan. 18, 2004","Tags":"City","Log Number":"","Latitude":"32.227433","Object Features":"Undisclosed","Disposition":"Unknown","Sighting Duration":"00:30:00","Object Shape":"Undisclosed","Date of the Event":"01/18/0001 04:15 UTC","Viewing Distance":"Over One Mile","Longitude":"-110.923979","Country":"United States"}