{"Tags":"City","Date Submitted":"03/05/2011 06:02 UTC","Latitude":"41.089611","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Mahwah","There were no other sightings in Mahwah on or around March 6th 2011"],"Summary":"Hovering over mine shaft all caught on my I phone from 35 yards away","Viewing Distance":"Unknown","Object Shape":"Other","Case Number":"28115","Disposition":"Insufficient Data","City":"Mahwah","Object Flight Path":"Undisclosed","Longitude":"-74.134757","Region":"New Jersey","Object Features":"Undisclosed","divs":["sighting detailsat aprox. 10:30 pm i was on a nightly hike i do in harrimen state park on the boarder on nj and ny. i was about 4.6 miles into the trail and i saw what i thought was ground light over the next summit on the trail. it looked exactly like hid lights from a new car but i'm 4.6 miles away from any road. i had just called my wife and she sent me a text so i had my iphone out while i was walking. i took the phone out and i tired the hi res camera on and started to take video. as i came over the top of the hill i saw a very bright disk. as i saw it i yelled out loud, the disk took of instantly from the ground with no noise more rapid then anything i have ever seen. it was the size of a black hawk helicopter and as it pushed off the ground it displaced all of the air in the area making a soft wind much less then a chopper. it was insane and i have never been on a site about ufos before and never have really thought about them but this was 100% the real thing. the most insane part is when i went to the spot about 35 yards away from me where it was it was hovering over what i thought was an abandoned mine shaft. you can't even see the bottom of this shaft and it's on old government land. i have absolutely perfect video and sound of this. what do i do. is the government going to come after me for sending it to you. i need you to see this so you can tell me what the he'll i should do. call me asap. *(wit's phone number deleted--cms\\sg)."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28115.html.txt","/var/www/straped/mufon/org/28115.html"],"Country":"United States","Date of the Event":"03/06/2011 10:28 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.089611,+-74.134757(28115)&iwloc=A&hl=en\"> mufon case (28115) map </A>","Log Number":"US-03052011-0019"}