{"Object Shape":"Circle, Unknown","Weather Factors":"Unknown, Does Not Apply","Log Number":"PR-03052011-0025","Region":"Michigan","Date of the Event":"03/05/2011 10:30 UTC","trends":["There have been no other sightings in Isabella","This sighting has never been favorited."],"Tags":"City","Summary":"More than 100 red lights emerge from the ground","Case Number":"28121","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"Over One Mile","Country":"United States","divs":["Sighting DetailsMe and my dad we're coming back from the other side of the island when we run into a traffic jam. It seemed to be a roadblock. We saw the police lights from far away. As we got closer to the police they weren't stopping anyone, they were just there. As my dad noticed that a police officer was looking at the sky we both just took a glimpse. I noticed around four orange lights emerging from the ground. I imediantly thought it was a UFO and my dad didn't have any other reaction, but just staring at it and he continued driving. I reached my camera and started recording. By the time I pulled out my camera there were around a dozen of them. My dad then continued driving until he pulled over and the numbers were growing. This is when my dad realized that the sky was full of more than 30 orange lights headed in the same direction. People started pulling over on the side of the street and they were all amazed. After around 50 UFOs floated around the sky they all disappeared in the same spot. Afterwards 50 more of those lights started appearing and in the same pattern. All the orange christmas like lights disappeared in the same spot. After that a few more lights went by and they also disappeared. I was exited during the whole event. Meanwhile the other people were in shock, scared and amazed."],"Longitude":"-84.856793","City":"Isabella","Latitude":"43.598799","Object Features":"Unknown","Date Submitted":"03/05/2011 10:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.598799,+-84.856793(28121)&iwloc=A&hl=en\"> mufon case (28121) map </A>","files":["/var/www/straped/mufon/html2text/28121.html.txt","/var/www/straped/mufon/org/28121.html"]}