{"files":["/var/www/straped/mufon/html2text/28120.html.txt","/var/www/straped/mufon/org/28120.html"],"Object Shape":"Sphere","Tags":"City","Country":"United States","Log Number":"US-03052011-0024","Date Submitted":"03/05/2011 10:16 UTC","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Disposition":"Unknown","Summary":"Saw 2 bright orange round objects with different colored lignts off the coast of Carpinteria.","Case Number":"28120","Weather Factors":"Unknown","divs":["sighting detailsdriving home around 9:30, i thought i saw 2 helicopters coming down the coastline. but as they got closer i saw round bright orange objects with colored lights. they were drifting down the coastline, then stopped and stood still. i pulled off the freeway to get a better look. by the time i found a place to pull over, and when i got out of the car, only one object was left. then, it slowly evaporated. a minute later, the 2nd object rose up from the horizon and just stood still. then it also slowly just evaporated. (they could have just gone quickly up into space, but it looked like they just evaporated into nothingness). i have told my wife and a couple other people who would not think i was crazy. my feelings: i knew these objects were not helicopters, and that they were unidentified flying objects. i would like to see such things again. i keep looking out over the channel all the time now when i drive home from work. questions i have: are they military? was this a weather phenomenon? why would aliens want to send these objects down here (to monitor vandenburg afb or pt. magu naval air station)? are they spiritual beings? questions can never be answered i guess... thank you, [witness name removed-cms\\dr] educator"],"trends":["There have been 5 other sightings in Carpinteria","There were no other sightings in Carpinteria on or around February 24th 2011"],"City":"Carpinteria","Latitude":"34.401044","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.401044,+-119.510956(28120)&iwloc=A&hl=en\"> mufon case (28120) map </A>","Longitude":"-119.510956","Viewing Distance":"Over One Mile","Source":"MUFON","Date of the Event":"02/24/2011 12:00 UTC"}