{"Latitude":"38.871783","Tags":"City","trends":["There have been 2 other sightings in Newcastle","There were no other sightings in Newcastle on or around May 31st 1990"],"City":"Newcastle","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-03052011-0026","map":"<A HREF = \"http://maps.google.com/maps?q=38.871783,+-121.114487(28122)&iwloc=A&hl=en\"> mufon case (28122) map </A>","Case Number":"28122","Disposition":"Unresolved","Date of the Event":"05/31/1990 12:00 UTC","Date Submitted":"03/05/2011 11:13 UTC","divs":["Sighting DetailsIt was between college Jr. and 4yr 1989-90. Living in New Castle CA. at the time. Went to get mail from mail box that was on Indian Hill Road. Can see all the way to the Bay Area from the top of the hill where I lived. I walked back to the house on a rise above the road, turned suddenly so see a huge, I mean huge white wing rising above the hill out of an abyss that seperates New Castle from Auburn. It was so bright. Red marking letters etc on body. Immediately I assumed it was an experiment from the Air Force Base over by Chico, Ca. I stood with my mought open, never seeing such a thing or even knew they existed. I remember saying aloud \" Isn't that beautiful\". I don't remember how long I stood there, don't know when I stopped looking at it, didn't stay to my knowledge to see it glide down the hill and on if it did go on. Didn't hear a sound. Didn't tell another sole for some time, months yrs. I have looked it up on the internet from time to time with no answer. When I moved to the State of Wa. I worked in a museum. A fellow came in and I started a conversation with him. Don't remember telling him about the wing, I might have. Anyway he told me he was one of the men who worked on \"the wing\". Thats it."],"Viewing Distance":"101-500 Feet","Object Shape":"Square, Rectagular, Triangle","Region":"California","files":["/var/www/straped/mufon/html2text/28122.html.txt","/var/www/straped/mufon/org/28122.html"],"Country":"United States","Longitude":"-121.114487","Object Features":"Window(s), Insignia, Wings","Summary":"Wing","Sighting Duration":"Undisclosed","Source":"MUFON"}