{"Object Features":"Unknown","Sighting Duration":"00:17:00","Region":"Arizona","Object Shape":"Circle, Flash, Oval, Other","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.492691,+-114.317955(28124)&iwloc=A&hl=en\"> mufon case (28124) map </A>","Date Submitted":"03/05/2011 11:42 UTC","Tags":"City","Object Flight Path":"Stationary,Other","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around September 17th 2010","This sighting has never been favorited.",""],"Case Number":"28124","Viewing Distance":"Over One Mile","Date of the Event":"09/17/2010 09:59 UTC","Longitude":"-114.317955","files":["/var/www/straped/mufon/html2text/28124.html.txt","/var/www/straped/mufon/more/28124_submitter_file1__NUMEROUSUFOSonGround.WMV","/var/www/straped/mufon/org/28124.html"],"Weather Factors":"Does Not Apply","Log Number":"US-03052011-0028","Source":"MUFON","Summary":"The very top pulsating lights are of the STATIONARY UFO'S\" The lights on the LEFT FRONT are of a home . The 5 little lights on the RIGHT FRONT are a driveway. The somewhat black mass, between the lights in fore front and the pulsating UFO lights, is the D","Latitude":"34.492691","divs":["Sighting Details I have been taping the sky here in Lake Havasu, AZ. since the beginning of Sept. and I knew there was something going on in here. I've been watching this specific mountain range ever since and it has proved to be extremely interesting. I was only able to tape about 17 min. because I did run out of tape. That's is also why I did try to edit it like I did. My camera isn't the best and also the night sky here is extremely dark. So I try my best to send what I have and not waste your viewing time with dead air. With my reports to SETI on Nov. 18th, 2010 and the next day, Nov. 19, 2010 over this city were 2 black ops military helicopters and jets flying LOW circling the area trying to find SOMETHING. Those helicopters are scary looking. Since then, there has been many jets and as of approx. 3 weeks ago (Mid Feb. 2011). 8 military helicopters AGAIN flew over our city, landed at our TINY airport and then I was told they then flew to KINGMAN, AZ. area. 1. At my home, outside and watching for \"BLINKIES\" 2. I couldn't help but notice a BUNCH of ROTATING LIGHTS especially as far away as they were (3-4 miles) 3. UNDENIABLY the UNKOWN 4. There were at least 4 huge ROTATING DISC'S STATIONARY and they just stayed there pulsating and rating those lights. 5. I was simply stating: \"I knew there was something on that mountain, I knew it!\" (my husband kept telling me it was cars. There aren't even any roads there. It's native american land 6. I didn't have anymore tape and I finally tired."],"City":"Lake Havasu City","Disposition":"IFO"}