{"Disposition":"Insufficient Data","Date Submitted":"03/06/2011 10:44 UTC","Log Number":"US-03062011-0003","Date of the Event":"10/01/2003 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-86.169983","Region":"Indiana","Object Features":"Undisclosed","Object Shape":"Sphere","trends":["There have been no other sightings in Medora","This sighting has never been favorited."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/28128.html.txt","/var/www/straped/mufon/org/28128.html"],"Latitude":"38.825054","City":"Medora","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.825054,+-86.169983(28128)&iwloc=A&hl=en\"> mufon case (28128) map </A>","Case Number":"28128","Country":"United States","Summary":"sun like orbs that changed speeds, direction, and would disappear and re-appear.","divs":["Sighting DetailsAn evening after work approximately 5pm a friend and I were traveling on highway 235 towards medora, IN. We spotted an orange colored orb very similar to the sun. It was almost directly above white river and appeared to be cloud high. I stopped the vehicle on the side of the road and watched the orb. Then another orb appeared. We saw three total, but they would appear and disappear. They also changed speeds, direction, and could remain stationary. They were all three the same in color, shape, and size. Im not sure how much time passed as we watched probably ten or fifteed minutes. Both of us were sure of what we were seeing, but had no clue as to what it was. We weren't scared or frightened because it was a sunny day with blue skies and a few clouds. I would say we were shocked and amazed because we couldn't explain what we were seeing. Finally they just disappeared and we left. There was no visible structure or shape to the objects. No disc, or triangle shape normally associated with ufo's. They just appeared to be orange sun like orbs that moved in ways that I have never seen before. Im still not saying we saw something extraterrestrial, but we did see something we cant explain. What I want is someone to tell me what we saw."]}