{"Date of the Event":"03/06/2011 07:08 UTC","Summary":"Fast moving bright white object traveling East","Sighting Duration":"00:01:03","Country":"United States","Tags":"City","Date Submitted":"03/06/2011 08:46 UTC","Object Shape":"Sphere","trends":["There have been 5 other sightings in Bismarck","There were no other sightings in Bismarck on or around March 6th 2011"],"Log Number":"US-03062011-0008","Weather Factors":"Unknown","Longitude":"-100.774689","map":"<A HREF = \"http://maps.google.com/maps?q=46.812277,+-100.774689(28133)&iwloc=A&hl=en\"> mufon case (28133) map </A>","City":"Bismarck","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"46.812277","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/28133.html.txt","/var/www/straped/mufon/org/28133.html"],"divs":["Sighting Details While watching \"Death at a funeral\" this evening, I noticed a white light object traveling at an even speed from west to east. This object was at a fairly low altitude. I would estimate this object to have been traveling at an altitude of between 1500-2000 feet.This object was observed from indoors during the entire duration of the sighting event. I would estimate the speed of this object to be in excess of 400 m.p.h. as I live very near the Bismarck,N.D. airport and am quite accustomed to seeing aircraft in flight. I estimate this object to be somewhat small. Perhaps the size of a small airplane. This object was of a consistent light intensity during the duration of this sighting. It did not have any F.A.A. lighting configurations. The light was a single light source. It did not blink, flutter pulse or fade until it faded from my view. I ran for and retrieved my video camera as soon as I saw this object was clearly not an airplane and I did manage to capture the object on video tape. I would guess that I filmed it for 15-20 seconds before it faded out of view. This object faded from my view before the horizon( from my perspective). In the filming of this object I framed the window that I observed it through and then zoomed in to get a closer look at the object then zoomed out to give a wide view perspective that included my neighbors house. This video tape will be provided to M.U.F.O.N. field investigators."],"Disposition":"Unknown","Case Number":"28133","Region":"North Dakota","Object Features":"Unknown"}