{"trends":["There have been no other sightings in Oakland","This sighting has never been favorited."],"divs":["Sighting DetailsAt my girlfriends house standing in kitchen looking out back window at the horizon. I noticed a light not very high in sky and it would change colors every 2 to 3 seconds from blue to green to red and it looked like it was wavering back and forth or up and down. Kind of like a balloon or a piece of light paper would, if the wind was blowing slightly. This is the second time I have seen this. The first was about 3 or 4 years ago at my moms house around the same time of year and time of night except that time it wouuld go from blue to green to red then dissapear for a few minutes then come back but didn't waver around like this time. I also saw other wierd things years ago on that same night. I have always been interested in UFO's but was skeptical until I had an experience with a \"dream\" about actually seeing feeling and meeting some \"things\". I don't know if I was dreaming or if it actually happened. It was very realistic and vivid yet vague when I try to recall details. It was also very terrifying and not really like anything I have ever heard or seen. In short there were five different things. They all looked different from one another. The only thing they had in common was thier color. They weren't gray like people say. They were sort of bluish with a white-gray color all blended together and they glowed like a sea nettle does when you break it if the moon is full. They weren't bright though. It is wierd and hard to explain. I have never really told to many people about it because it is hard to describe and I am not even sure if it was a dream or an actuall event. The lights in the sky for sure happened and this time I pointed it out to my girlfriend who thought it may be a satellite and blew it off. She's the only one I have told in complete detail about the \"meeting\" I had and she doesn't believe me I think. I would like to go into more detail if possible, but do not really feel comfortable doing it here. (Feel free to e-mail me) The main reason I am posting this is to hopefully find out if it was a satellite or if anyone else in the area has came forward about something similar. ------ I noticed it because ever since my first experience I always look at the night sky. the first time I saw it was because I live in the country and on that night the stars seemed closer than usuall if that makes any sense as well?? I lost sight of the light because I got tired of watching it and my girlfriend insisted. When I first saw it I felt relieved in a way that I had seen it again and that someone else was there to see it too. I also felt a little intimidated by the memory of my \"meeting\" and was actually afraid it may happen again. Thankfully it didn't though had it occured again I would know I wasn't dreaming the first time. One final thing I should mention is that there have been fighter jets flying around here lately and that's not very common at least not that I have noticed, so maybe that is an explanation or something. Also if the Big Dipper was behind you at 6 O'clock then this thing wouldve been at about 1 O'clock but from where I was it only looked like it was a few feet off of the horizon.28"],"Date of the Event":"03/04/2011 01:30 UTC","Region":"West Virginia","Disposition":"Insufficient Data","Summary":"Floating light like a star that changed color from Blue 2 Green 2 Red Wavered in sky","Date Submitted":"03/07/2011 11:53 UTC","Object Flight Path":"Stationary,Other","Log Number":"US-03072011-0005","Country":"United States","Object Shape":"Fireball, Star-like","Case Number":"28142","Longitude":"-79.393631","Tags":"City","Latitude":"39.422837","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.422837,+-79.393631(28142)&iwloc=A&hl=en\"> mufon case (28142) map </A>","Object Features":"None","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Windy, Does Not Apply","City":"Oakland","files":["/var/www/straped/mufon/html2text/28142.html.txt","/var/www/straped/mufon/org/28142.html"]}