{"Log Number":"","Longitude":"-71.011047","Date of the Event":"08/31/2003 07:00 UTC","Summary":"saw one small, dark disc","Region":"Massachusetts","map":"<A HREF = \"http://maps.google.com/maps?q=42.465142,+-71.011047(2814)&iwloc=A&hl=en\"> mufon case (2814) map </A>","Country":"United States","trends":["There has been one other sighting in Saugus","There were no other sightings in Saugus on or around August 31st 2003"],"Latitude":"42.465142","Date Submitted":"08/31/2003 07:00 UTC","City":"Saugus","Object Shape":"Disc","Weather Factors":"Unknown","Case Number":"2814","Source":"MUFON","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsI was standing outside a club called the Rockpile in Saugus, MA. I play in aband and due to new no smoking laws, was standing outside smoking a cigarette.It was still light out I have a tendency to look at the sky, due to the factthat I have seen numerous anomalies throughout my life. I noticed a small, darkcolored disc seem to come out of the clouds and fly in a ridiculously straightpattern directly over my head and off in to the distance until i could no longersee it. I remember thinking how VERY straight it was traveling. It madeabsolutely NO noise wahtsoever, although for some reason i want to say thatthere FELT like a hum or a vibration, or something. But that could have been theexcitementincredulity not only at what i was seeing, but at the fact that therewere easily 8 - 10 other people all around in various positions in the parkinglot, and not one person even looked up or seemed to notice and i seemed unableto say anything. I didnt want to seem like a fool, who knows, maybe they seethat sort of thing every day there, maybe it was nothing. But i felt completelyunable unwilling to point it out to other people around me. The disc seemedrather small, like the size of a compact car, maybe even smaller... again, thestraightness of its path was amazing to me for some reason. There were no lightson it at all that i could see. Left me with a feeling of disbelief and notreally being sure what the hell i had just seen. Because it was so small, yet itwas still light outside, the cloud cover was behind it, defining it even more,and it literally just kept going until i couldnt see it anymore. It went rightover my head, i saw the bottom of it clearly. Small, round, dark and obviouslysolid. I couldnt believe that nobody else around me saw this thing, but it didhappen very quickly inconspicuously, and people at these kinds of concerts aregenerally more interested in how cool they look and where the girls are, sothere you have it. Couldnt help but think that it was some sort of spying thing.But Ive probably seen too many movies hat would influence my thoughts afterseeing something like this. But it was solid, dark, small, I saw it VERYclearly, and it was obviously being controlled by someone or something. It neverchanged altitude nor did it change its course. Very strange and cool too."],"Sighting Duration":"00:00:59","Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/2814.html.txt","/var/www/straped/mufon/org/2814.html"],"Object Features":"Undisclosed"}