{"Longitude":"-72.316052","Latitude":"42.106205","Sighting Duration":"Undisclosed","Region":"Massachusetts","Object Features":"Undisclosed","Summary":"Lighted Triangle hovering low over large hill road. 3 Black helicopters in same area days after","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Object Shape":"Boomerang, Triangle","Case Number":"28143","Tags":"City","Date of the Event":"03/02/2011 12:00 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date Submitted":"03/07/2011 01:42 UTC","trends":["There has been one other sighting in Monson","There were no other sightings in Monson on or around March 2nd 2011"],"Log Number":"US-03072011-0006","Source":"MUFON","divs":["sighting detailsthis took place last wed, night (march 2,2011)i was coming home with my kids. we turned onto the street leading to my house and i saw the light, looked like from a tower,wasnt moving but very bright. as we got onto my road, i could see it was three lights; it seemed to be coming from the north-west. as we pulled in the driveway, it was basically hovering directly over our rd; our house sits in the middle of a large hill and it seemed to be at the top ofthe hill. this object seemed low, the lights were big. my oldest son(15) and i stood out at the end of my driveway,got a good look at it...triangular\\wide boomerang, possibly flat-iron shaped, with three big\\bright lights along the middle (one was red, the other two white) with a small blinking light toward one side (from our view, the left side) it seemed to sit there not moving, and we both mentioned the noise; no noise, just a weird electronic-kind of hum (like dolby noise from cassette tapes? or when youd turn on an old-style tv,that couple minutes of hum?) anyway a couple seconds later, a small plane came along the flight path (from east to west, like i usually see planes do around here) and the object started moving faster, but not at all *fast* and headed to the south, still as low\\bright til it disappeared behind the tree line. saturday morning (before noon, march 5), i brought out the trash and watched a solid black helicopter, barely above the tree line, heading in the same direction we saw the *thing* head....i ran in to tell my son, and out the picture window on the other side of the house, we saw two more of the same heading in the same direction. on a local internet forum back in january, three or four different people reported seeing something over the school area. and that following week, there was a black helicopter circling each one of the schools (which i saw while picking my kids up, and all the kids were talking about it) at the time i didnt think anything about it but now it all seems odd."],"files":["/var/www/straped/mufon/html2text/28143.html.txt","/var/www/straped/mufon/org/28143.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.106205,+-72.316052(28143)&iwloc=A&hl=en\"> mufon case (28143) map </A>","City":"Monson"}