{"Sighting Duration":"00:00:07","Date Submitted":"03/07/2011 05:48 UTC","Case Number":"28146","Summary":"3 dim lights flying low and fast together traveling south across the sky. no sound or flashing lights. flying side by side","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/28146.html.txt","/var/www/straped/mufon/org/28146.html"],"Date of the Event":"03/06/2011 09:50 UTC","divs":["Sighting DetailsI went outside on the deck to finish my half-cigarette with my coffee. I was looking at the stars because they were so visible and the night sky was very clear. then, from the right side, i noticed three small lights moving together in a row. they looked like they were flying about as high as a small private airplane but at a faster rate of speed. As i watched them go by, i couldn't make them out to be a plane, shooting stars, a satellite, or anything that looked familiar. There were no flashing lights and they didn't block out any stars when they went by so i know they weren't part of one solid object. They looked like dim stars flying together. There was also no sound whatsoever. A very clear and quiet night (sunday around 9:50pm EST). The orbs were somewhat close to each other, equally spaced out, and flying in a line from north to south across the sky. the sighting lasted for about 7 seconds before the trees blocked my view. I was not drinking. I was not high. After the lights were out of sight, i went inside and told my family \"I'm pretty sure i just saw a UFO or three,\" and explained what i saw. Of course they had to dismiss it as a plane or shooting star..."],"Longitude":"-83.34584","Object Features":"None","trends":["There have been 16 other sightings in Livonia","There were no other sightings in Livonia on or around March 6th 2011"],"Viewing Distance":"Unknown","Region":"Michigan","City":"Livonia","Country":"United States","Log Number":"US-03072011-0009","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.37522,+-83.34584(28146)&iwloc=A&hl=en\"> mufon case (28146) map </A>","Latitude":"42.37522","Object Flight Path":"Straight-line path","Object Shape":"Other","Tags":"City"}