{"Summary":"looked black oval blimp shape","Region":"California","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was awakened by my alarm clock. I get up and start to get my things ready to go to court. i jump in the shower and i looked outside the window to see if it was raining since it was cloudy. Thats when i noticed a black oval looking object. I thought it might have been a trash bag, but it seemed to big to be a bag. I kept on looking at it trying to figure out what it could be. It moved from left to right then it started going towards the mountains. I was very excited to witness this since i've witnessed other things in the sky in the past. I kept on looking at the object and i started to loose sight of it as it kept going farther. I got out the shower and told my girlfriend about it. Then i drew it on a dry erase board. i turned on the news and started watching them. I saw a story about a police helicopter that had to make an emergency stop because the emergency lights went off. i thought it might have been coincidental since i've heard that whenever theres UFOS near they mess up their equipment. Today(march, 8, 2011) I was watching the news and I saw a report at Redondo Beach about millions of dead anchovies. Now I wonder if it could in fact have been a UFO or something else. Hopefully there's someone else out there that saw it too,(in pomona or around pomona)."],"Country":"United States","Longitude":"-117.744985","City":"Pomona","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28158.html.txt","/var/www/straped/mufon/org/28158.html"],"Date of the Event":"03/07/2011 09:10 UTC","Disposition":"Insufficient Data","Log Number":"US-03082011-0005","Tags":"City","Latitude":"34.061257","Case Number":"28158","Object Shape":"Blimp, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=34.061257,+-117.744985(28158)&iwloc=A&hl=en\"> mufon case (28158) map </A>","trends":["There have been 16 other sightings in Pomona","There was one other sighting in Pomona on or around March 7th 2011"],"Object Features":"Wings","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Date Submitted":"03/08/2011 02:21 UTC"}