{"Source":"MUFON","Log Number":"US-03072011-0016","Date Submitted":"03/07/2011 11:47 UTC","Object Flight Path":"Hovering then path","trends":["There have been 2 other sightings in Macks Creek","There were no other sightings in Macks Creek on or around March 7th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.970683,+-92.968106(28153)&iwloc=A&hl=en\"> mufon case (28153) map </A>","Country":"United States","Region":"Missouri","Summary":"a row of about 50 lights a mile in the air....","Longitude":"-92.968106","divs":["Sighting Detailsi was outside of my parents house walking to my house next door in macks creek missouri in a wooded area around 830pm and looked up at the sky through the trees i could see 3 lights in a triangle shape about 10ft apart where there are normally no lights at all. the lights always had 2 lights going at the same time in alternating patterns. all 3 lights were stantionary. lighting resembled flare guns thats what it looked like at first. at this time i ran and got my girlfriend and rest is what we witnessed together. the 3 lights bounced around in the sky for several minutes. then in the oppisite direction an airplane come flying in. and the 3 lights dissapeared. when the plane was totally gone the sky was totally black. then out of no where straight ahead of us im a clearing less then a quarter a mile away a mile in the air was a row of 50 lights side by side the size of a walmart supercenter. no sound no pressure nothing. all you could make out was the very very bright lights. it was so dark we couldnt make out any shape to the craft. then slowly it went up into the clouds. then apprx. 30 min later were heard fighters jets flying over. and my girlfriend growing up around airplanes said they were flying in a tactical manuver in the same direction that the lights left in. i was very excited during the whole thing and all i could think was this only happens in movies but my girlfriend was very freaked out by the whole thing. it is a very cloudy night with no stars or moon light."],"Latitude":"37.970683","City":"Macks Creek","Case Number":"28153","Weather Factors":"None","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"03/07/2011 08:30 UTC","Object Shape":"Square, Rectagular, Triangle","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/28153.html.txt","/var/www/straped/mufon/org/28153.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City"}