{"Region":"Washington","Date Submitted":"07/31/1990 11:00 UTC","files":["/var/www/straped/mufon/html2text/2815.html.txt","/var/www/straped/mufon/org/2815.html"],"Weather Factors":"Unknown","Summary":"UFO observed by aviation professional","Log Number":"","Date of the Event":"07/31/1990 11:00 UTC","Object Flight Path":"Straight-line path","Country":"United States","trends":["There have been no other sightings in Government Camp, Oregon","This sighting has never been favorited."],"Source":"MUFON","Latitude":"45.37244","City":"Government Camp, Oregon","Viewing Distance":"501 Feet - 1 Mile","Case Number":"2815","divs":["Sighting DetailsFirst, I would like to say that I have been an airport manager of a publicairport for the last 21 years, I hold a commercial pilots license, and it wasnot easy to even report this event after so many years, since Im not retiredyet. But I needed to tell someone about this incident, because I know what Isaw, and what I saw was not of this planet. Mankind has nothing that could movethis fast, and if we did, the stops and starts of this object would have brokenanyones neck. What I saw was the same type shape and size of object that half ofthe folks in Mexico City observed many years ago. You are probably aware of thisincident. I would like to talk to someone at your organization about thisincident. Your welcome to call me at my airport exo anytime. The number isabove. With this said, the rest of my report is below. Thank you for your time.Best regards,Pat Mayo1. I was trecking on Mt. Hood, Oregon, above Palmer ski lifts, at 8500 MSL meansea level.2. I noticed a light, and first thought a pilot out of PDX PortlandInternational Airport forgot to turn off his landing light3. A passenger jet.4. When the light stopped in mid air directly over Mt. Hood, higher than ahelicopter can hover, I stopped walking in the snow and pinched myself toconfirm that all my facilities were working. I stood still and observed theobject until it flew out of sight.5. The object appeared round in shape and shinny. After the object came to astop, est at about 12,000 msl or 600 agl above ground level, the brightness ofobject became stronger for a second or two, then the brightness faded. Then theobject made a quick movement directly north for approx. 3 miles and came to astop, all this happened in a split second. Then the object moved directly southto a point of about 6 miles south of the top of Mt Hood, and also came to acomplete stop, all within a second. Then the object zipped back to its originalposition directly over Mt. Hood, within another second. Then the object startedmoving directly east again, increasing speed until it flew out of sight, allwithin two to three seconds.6. The object flew out of sight and was gone faster than any object that we havenow, or willhave for a long time to come. Up to this time, I never believed inUFO sightings, but now I do."],"Longitude":"-121.975096","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.37244,+-121.975096(2815)&iwloc=A&hl=en\"> mufon case (2815) map </A>","Object Features":"Undisclosed","Object Shape":"Sphere","Sighting Duration":"00:00:59","Disposition":"Unknown"}