{"Object Flight Path":"Undisclosed","Region":"New York","Log Number":"US-03072011-0013","Object Shape":"Sphere","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.718653,+-73.998843(28150)&iwloc=A&hl=en\"> mufon case (28150) map </A>","Summary":"Two bright lights originating from north traveling southeast","Disposition":"IFO","divs":["Sighting DetailsAt approximatly 7:00PM tonight i decided to step outside for a cigarette. As per usual i figured i go out back and see if it was clear enough to check out some stars, and bam crystal clear sky. So upon scanning the sky i noticed two stars that seemed to move from their location. At first i thought it was a visual perception trick, so i looked around got a fix on some other stars and looked back at the two original stars. Dont you know it they did the same thing. So i scanned around the sky again real quick and still none of the other stars were platying this trick on me. Now i decided i will focus all concentration on these two stars, and dont you know they were definatly moving. Both shown with the intensity of a very bright star, and there was no blinking as with an airplane, or redness as with a satellite. What made the whole thing even weirder was that they stayed the same distance apart the entire time they were visable, which was about 4 minutes moving from a north to southeast diection, and then just flickered out long before we should have been able to not see them. And yes i said we because once i realized what was happening i went and grabbed my roommates just to make sure there was something, and all agree that it was unlike anything they have seen before. This was probably the coolest thing i have seen to date in correlation with my want to beleive, hands down. One of my roomates tried to get a video on his phone but it didnt come out at all :("],"Date Submitted":"03/07/2011 08:20 UTC","Sighting Duration":"Undisclosed","Longitude":"-73.998843","Country":"United States","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around March 7th 2011"],"Source":"MUFON","City":"New York","Latitude":"40.718653","Object Features":"Undisclosed","Date of the Event":"03/07/2011 07:00 UTC","Case Number":"28150","files":["/var/www/straped/mufon/html2text/28150.html.txt","/var/www/straped/mufon/org/28150.html"],"Tags":"City","Viewing Distance":"Unknown"}