{"Tags":"City","Disposition":"Unknown","Weather Factors":"Unknown","Date Submitted":"03/08/2011 01:26 UTC","Object Flight Path":"Undisclosed","City":"Homer City","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsI had just gotten into the passenger side of my car, when my daughter asked why the stars were moving so fast. I opened my door and left my car, and gasped at the eastern sky. There were two star-like objects, moving at a great rate of speed, together in perfect unison. To my eyes, there was about a six inch span between them which was maintained the entire time they were within my view. They were bluish-white in color, and the one on the left side was almost twice the size of the one to the right. My daughter and I watched in awe as they raced together through the sky- not as fast as a shooting star, but much faster than anything I've ever encountered in the sky before. I called out to my husband to watch, but by the time he got to the car where he could see, they had all but disappeared behind some scraggly pines. We drove out to the main road, where by all rights we had a better view and should have been able to pick them back up, but they were gone. It was about 6:59pm when we saw them, and the sky was losing the last bit of color from the day. Most stars were still one with the sky, with the exception of Polaris and a sliver of moon. The entire ordeal lasted less than two minutes..it was over as abruptly as it began. Just wondering if anyone else witnessed this...or what it possibly could have been? These objects stayed together as if attached- no flashing, no blinking, no red or green lights. Something else to keep in mind.. they appeared to be moving from north to east.. across the sky (roughly southwest) was the Homer City Power Generating Station. Any feedback is appreciated."],"trends":["There has been one other sighting in Homer City","There were no other sightings in Homer City on or around March 7th 2011"],"files":["/var/www/straped/mufon/html2text/28154.html.txt","/var/www/straped/mufon/org/28154.html"],"Longitude":"-79.162257","Latitude":"40.543401","map":"<A HREF = \"http://maps.google.com/maps?q=40.543401,+-79.162257(28154)&iwloc=A&hl=en\"> mufon case (28154) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-03082011-0001","Object Features":"Undisclosed","Date of the Event":"03/07/2011 12:00 UTC","Case Number":"28154","Object Shape":"Star-like","Summary":"Two star-like objects moving across the sky in unison","Region":"Pennsylvania","Source":"MUFON"}