{"Object Features":"Undisclosed","Source":"MUFON","City":"Mankato","Latitude":"44.168848","Date of the Event":"02/14/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.168848,+-93.98942(28162)&iwloc=A&hl=en\"> mufon case (28162) map </A>","divs":["Sighting DetailsI noticed a very bright, amber, pulsating orb. I first noticed this orb because I pay great attention to the sky, day and night. I knew emmediately what it was. It was what i call a \"watcher.\" I believe these are spiritual entities, and are not related to alien activity. I pulled over near Williams Nature Center on highway 68, in Mankato, Mn. I set up my tripod. I videotaped it for a short while, but opted to stop filming, because I have so much footage of the orbs. It was very close. I would say around 125 yards at the beginning of the event. I believe it came closer, as it flew in my direction. I have seen thousands of these in the last six months, and have studied their behavior, only to make startling discoveries. I thought this one was quite clear, bright, and beautifull. My feelings while viewing this orb were nearing boredom. I have seen and taped many much closer than this. I have spent alot of time in the dark with a camera. I prefer the low flyovers. The watchers are exciting to videotape, when there is more than one in the view, and they interact. Either way, I have not lost interest, and still tape when it is clear. I lost sight of this object, because I lost interest and looked away. They are plentifull."],"Tags":"City","files":["/var/www/straped/mufon/html2text/28162.html.txt","/var/www/straped/mufon/org/28162.html"],"Country":"United States","Log Number":"US-03082011-0008","Sighting Duration":"Undisclosed","Summary":"Pulsating amber orb very bright","Case Number":"28162","Longitude":"-93.98942","Viewing Distance":"Unknown","Region":"Minnesota","Object Flight Path":"Undisclosed","Disposition":"IFO","trends":["There have been 18 other sightings in Mankato","There were no other sightings in Mankato on or around February 14th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Shape":"Circle","Date Submitted":"03/08/2011 04:35 UTC"}