{"Latitude":"33.756285","divs":["sighting detailsi was driving near the corner of mercer university drive & mcmanus rd. in macon, ga., headed due east, on my way to enter i-75 south. here is the exact google streeview of where i was located. http:\\\\tinyurl.com\\maconufo i looked up and saw what resembled venus except for the fact that venus a) is lower in the sky at that time of the day and b) doesn't not set in the east and c) too bright to be venus. i do amateur astronomy and i see venus on my way out of my drive way every morning. so my first reaction went from , \"oh , there's venus\" to \"now way that's venus!\" within seconds. at first i thought it may have been a reflection and while that is possible, this maintained the strong brilliance until i had to look away as i was driving. i was able to catch it a second time and tried my best to look for a \"shape\" like an airplane or jet but i could not. it was moving due north very slowly. this particular area is close to warner robins air force base and most of the time air craft has a smoke trail behind it but this did not. literally, the skies in my area are constantly littered with smoke trails every day. the third time i looked back at the object i could not see it. i tried over and over to find it but it was gone. this object was indeed strange-looking and in particular had a very bright white light that very quickly called my attention. i'm pretty sure too that the people in the car behind me saw the same thing as they seemed to be looking up as well."],"Object Flight Path":"Straight-line path","Log Number":"US-03082011-0007","Case Number":"28160","Region":"Georgia","Date of the Event":"03/08/2011 06:52 UTC","Weather Factors":"None","Source":"MUFON","Object Shape":"Star-like","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.756285,+-84.386902(28160)&iwloc=A&hl=en\"> mufon case (28160) map </A>","Object Features":"None","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around March 8th 2011"],"Summary":"Star/Venus-Like Object Seen Due East Moving Slowly Then Disappeared","Date Submitted":"03/08/2011 03:18 UTC","Country":"United States","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/28160.html.txt","/var/www/straped/mufon/org/28160.html"],"Longitude":"-84.386902","City":"Atlanta"}