{"Date Submitted":"03/09/2011 03:45 UTC","Source":"MUFON","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around March 8th 1992"],"Date of the Event":"03/08/1992 07:45 UTC","Object Features":"Unknown","Log Number":"US-03092011-0006","Case Number":"28177","Object Flight Path":"Other","Latitude":"32.226156","Viewing Distance":"Unknown","divs":["Sighting DetailsAt around 7:45 on March 8, 2011 around 9 miles south of Stephenville, Texas, a relative told me to come outside because he had seen something UFO-like in the sky, specifically amber flashes of light. I went outside and waited. At first there was nothing to be seen, but after five minutes or so I too saw a flash of amber light towards Comanche that disappeared in, quite literally, a blink of an eye. That peaked my interest so I stayed. Then around four-five minutes later multiple flashes of amber colored light could be seen descending in a step light pattern. There were about six flashes of light that vanished in a few seconds. The lights origanted towards the south and ended towards the north. We live in an area prone to fighter jets so I assumed they were flares of some sort. Then (by my estimation around 6 minutes later) two lights appeared in the sky, they were coming from around Stephenville. They were blinking, and I couldn't tell if they were representative of one craft with two lights (one at either end), or two crafts with one light a piece, but they did remain at a fixed distance and moved at the same speed. It looked to be a few hundred yards across. It moved slow enough that I could easily see it across the sky, unlike the fighter jets that seemed to be following it. The unknown craft(s)then made a pass towards Comanche, seemed to make a turn and headed back. I should also note that the craft(s) were wholly silent. As it was heading towards Stephenville the relative I was with pointed towards the trees directly towards the north of us. Above the line of trees, a few hundred feet up, was an orb-like \"thing\" that seemed to be moving in circles. It was a bit hard to see because it gave off no light. That was far more disconcering to be than the previous sighting of the craft(s) with the light because had it not been pointed out I would have had no way of knowing it was there, because it was also silent. I saw it twice in the span of about two minutes. The craft(s) with the light then came back into sight and moved back towards Comanche. As usual, it was followed by the low rumble of jet fighters. It then disappeared and I did not see anymore of it, though the jets continued to be heard for some time after (which in and of itself is not uncommon for where we live). I would have loved to document this (especially the rather creepy orb thing) but my phone's screen is cracked and isn't good for much of anything at the moment. PS: I put down the sightings lasted about five minutes total, but there were gaps of time between each sighting."],"Weather Factors":"Windy","Object Shape":"Unknown","Summary":"Multiple UFO sightings, Hico, TX","Region":"Texas","Longitude":"-98.200053","Tags":"City","City":"Stephenville","map":"<A HREF = \"http://maps.google.com/maps?q=32.226156,+-98.200053(28177)&iwloc=A&hl=en\"> mufon case (28177) map </A>","Disposition":"IFO","Country":"United States","files":["/var/www/straped/mufon/html2text/28177.html.txt","/var/www/straped/mufon/org/28177.html"],"Sighting Duration":"00:05:00"}