{"Region":"California","divs":["Sighting DetailsWE WERE WALKING THE DOG AND RETURNING HOME TONIGHT. VERY CLEAR NIGHT IN LONG BEACH SO KIND OF BRIGHT CITY LIGHTS BUT CRESCENT MOON SO DARKER THAN USUAL. MY FRIEND DMITRI NOTICED WHAT HE THOUGHT WAS A SATELLITE AND I LOOKED AND THOUGHT IT LOOKED WAY TOO CLOSE & TOO BRIGHT TO BE A SATELLITE. I KEPT LOOKING FOR FLASHING LIGHTS AND LISTENING FOR A NOISE BUT HEARD NOTHING (FULLY EXPECTING IT TO BE A HELICOPTER OR SOMETHING I COULD IDENTIFY). THE OBJECT MOVED LIKE A PLANE IN FLIGHT PATH AT FIRST FOR ABOUT 5 SECONDS, THEN STARTED TO SLOWLY SWERVE LEFT & RIGHT SORT OF LIKE A BALLOON WOULD MOVE. THEN IT GOT FAINTER AND FAINTER (QUICKLY 4 SEC BEFORE IT WENT FROM IT'S FULL BRIGHTNESS TO DISAPPEARING) UNTIL I COULDN'T SEE IT ANYMORE. IT WAS DIFFICULT TO DETERMINE WHETHER IT WAS MOVING UPWARD AND THUS GETTING FAINTER OR IF THE LIGHT WAS JUST GETTING DIMMER LIKE A FLASH LIGHT DOES WHEN THE BATTERIES DIE. I GOT EXCITED AND THEN THOUGHT THIS IS NUTS IT CANNOT BE. THEN I WONDERED MAYBE SOME ELSE SAW IT BESIDES MY FRIEND AND ME. I DECIDED TO REPORT IT SO IF SOMEONE ELSE SAW IT AND SAW IT WAS REPORTED THEY MIGHT REPORT WHAT THEY SAW. I ALWAYS THOUGHT THAT IF I SAW SOMETHING I COULD CALL A UFO IT WOULD BE REALLY OBVIOUSLY A UFO. THIS WAS JUST SOMETHING IN THE SKY THAT I ABSOLUTELY CANNOT IDENTIFY."],"Case Number":"28170","map":"<A HREF = \"http://maps.google.com/maps?q=33.810037,+-118.156196(28170)&iwloc=A&hl=en\"> mufon case (28170) map </A>","Log Number":"US-03082011-0016","Sighting Duration":"00:00:20","Object Shape":"Star-like","Country":"United States","Latitude":"33.810037","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around March 8th 2011"],"Longitude":"-118.156196","City":"Long Beach","Object Features":"None, Unknown","Tags":"City","Date Submitted":"03/08/2011 11:05 UTC","Weather Factors":"Unknown","Object Flight Path":"Other","Summary":"LOOKED LIKE JUPITER (BRIGHTNESS) MOVING SLOWLY & IRREGULARLY THEN GOT FAINTER & FAINTER & DISAPPEARED","Source":"MUFON","Disposition":"Unknown","Date of the Event":"03/08/2011 07:30 UTC","files":["/var/www/straped/mufon/html2text/28170.html.txt","/var/www/straped/mufon/org/28170.html"],"Viewing Distance":"Over One Mile"}