{"map":"<A HREF = \"http://maps.google.com/maps?q=42.868955,+-76.977744(28173)&iwloc=A&hl=en\"> mufon case (28173) map </A>","files":["/var/www/straped/mufon/html2text/28173.html.txt","/var/www/straped/mufon/org/28173.html"],"City":"Geneva","Summary":"bright light(star like) moving high rate of speed across the sky","Tags":"City","Longitude":"-76.977744","Latitude":"42.868955","Date of the Event":"03/08/2011 10:15 UTC","Viewing Distance":"Over One Mile","Object Shape":"Star-like","trends":["There has been one other sighting in Geneva","There were no other sightings in Geneva on or around March 8th 2011"],"Log Number":"US-03092011-0002","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Case Number":"28173","Disposition":"IFO","divs":["Sighting DetailsI WAS TRAVELING FROM THE CITY OF GENEVA,NY GOING SOUTH ON RTE 96 TOWARDS THE HAMLET OF WILLARD NY.I WAS NEAR SAMPSON STATE PARK AND THE NOW FORMER SENECA ARMY DEPOT WHEN I NOTICED A VERY BRIGHT LIGHT TO THE NORTH WEST OF MY LOCATION.THE LIGHT WAS COMING ACROSS SENECA LAKE TRAVELING AT A HIGH RATE OF SPEED. THE LIGHT CONTINUED ACROSS THE SKY NOW MOVING WEST TO EAST THEN ABRUPTLY CHANGED DIRECTION AND MOVING NOW IN A NORTH EAST DIRECTION TOWARDS THE WATER TANK LOCATED AT 5 POINTS CORRECTIONAL FACILITY.THE LIGHT CONTINUED TO TRAVEL AT A HIGH RATE OF SPEED IN THIS DIRECTION UNTIL I COULD NO LONGER VIEW IT.THERE WERE NO INDICATIONS TO ME THIS WAS AN AIRCRAFT,MILITARY OR OTHERWISE.THERE WERE NO OTHER VISABLE MARKER LIGHTS AS THERE WOULD BE WITH PRIVATE,COMMERCIAL OR MILITARY AIRCRAFT...I HAD STOPPED MY VEHICLE INITIALLY JUST SOUTH OF KENNEDY ROAD THEN PROCEEDED TO THE ENTRANCE TO SAMPSON STATE PARK WHERE I FURTHER OBSERVED THIS BRIGHT LIGHT.I INITIALLY THOUGHT THIS WAS SOME TYPE OF AIRCRAFT BUT WAS MOVING WAY TO FAST AND THE LIGHT WAS TOO BRIGHT. I WAS NOT ABLE TO MAKE OUT ANY SHAPES OR HEAR ANY NOISES.THIS WAS JUST SOMETHING VERY DIFFERENT.I WAS SCARED TO SAY THE LEAST. I CALLED MY WIFE ON MY CELL TO EXPLAIN WHAT I OBSERVED.I DID NOT EVEN THINK TO TRY TO VIDEO TAPE THIS.THIS EVENT CAUGHT ME OFF GUARD. THAT AND THE FACT I WAS TALKING ON THE PHONE TO MY WIFE AT THE TIME AS WELL"],"Object Features":"None","Date Submitted":"03/09/2011 12:30 UTC","Source":"MUFON","Country":"United States","Region":"New York"}