{"map":"<A HREF = \"http://maps.google.com/maps?q=42.254529,+-84.394226(28178)&iwloc=A&hl=en\"> mufon case (28178) map </A>","Date Submitted":"03/09/2011 05:53 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle","Object Features":"Unknown","Region":"Michigan","Weather Factors":"None","Disposition":"Unknown","Log Number":"US-03092011-0007","Longitude":"-84.394226","Source":"MUFON","City":"Jackson","divs":["Sighting Details Early April 2010 I was at my parents home in Jackson Michigan. Just before dusk my father and I went outside to the front deck to have a smoke. We stood on the deck for about five or ten minutes having a normal conversation consisting of everyday occurances that a father and son would converse about sports, news, current events etc. I dont recall the exact context of our conversation when suddenly I happened to look in my father's direction (north) and I saw what first appeared to be a firework of some kind. Noticing that the object in question was moving parallel to the ground rather than ascending upward like fireworks I stopped my father in mid sentence and said what the $#@! is that. To our astonishment we saw a orange and red circular object about 400 feet in the air and about 500-600 yards away. Having lived in the home which was about five miles away from reynolds airfield ten years before starting a family of my own, we were accustomed to seeing various types of aircraft in the skies all throughout the day and night. My father's reaction was quite that of mine with many explitives spouted out in curiousity. If I had to guess the speed of the object, I would estimate that it was traveling about 60-80 miles per hour. The speed is purely a guess as I have little or no knowledge of aviation. We watched the object for what seemed like hours anticipating a closer view. The flight path of the object was going to bring right overhead. It then abruptly stopped about 200 yards away and turned with tremendous acceleration heading east almost all in one motion. Feeling a little disappointed the object changed flight paths we stood in utter amazement the object could perform such a maneuver. By this time my fiance, mother and brother were on the deck wondering what we were looking at so admirably. They too seen the object though by this time it was significantly smaller and farther away. Amidst all The Comotion my brother grabbed a plastic telescope which was intened for a child's toy. I tried vigorously to pick the object up in the lense but excited and a little frightened from what I had witnessed I did not have the steady hand required to perform such a task. The object stayed in sight for about a half an hour seemingly sitting still at a higher altitude than before. Everyone else eventually lost the object among the cluster of stars that filled the night sky as it was a clear night. I stared at it for another five or so minutes before it vanished as if someone simply flipped a light switch. The next few days and weeks I could not think about anything else other than the encounter. I have been interested in the topic of UFOs and other intelligences in the universe since a young age but never dreamed I would experience such an encounter. I'm not claiming the object was other worldly nor am I disclaiming the idea all I know is I had never seen anything like it before or since. The validity of the object's origin may never be known. I never heard of anyone else witnessing the event nor really talked of it until now..."],"Tags":"City","Object Flight Path":"Path then hovering","Sighting Duration":"00:40:00","files":["/var/www/straped/mufon/html2text/28178.html.txt","/var/www/straped/mufon/org/28178.html"],"Summary":"Orange and red circular object moving south then abruptly changing direction heading east staying in sight as far as 30 miles away","trends":["There have been 10 other sightings in Jackson","There were no other sightings in Jackson on or around April 1st 2010"],"Latitude":"42.254529","Country":"United States","Case Number":"28178","Date of the Event":"04/01/2010 04:35 UTC"}