{"Disposition":"IFO","Country":"United States","Log Number":"US-03092011-0008","divs":["Sighting DetailsI was out smoking on the steps watching some planes. I look of to my right and bamb, there was a huge fiery ball, which looked like a cherry off a cigarette. It was about 500' the most about a quarter of a mile away. I ran in to get my binoculars to see what it was. I seen attached to this light was a translusent body which looked like a half diamond. I go back in the house and tell my wife to look out the window, theres a ufo. She said, thats not a ufo. Then as it was moving to slow twards the north. She wanted to go out side and watch it. She also seen the translucent body. Then It got to where it was parallel to us straight to our west, hovers lets us watch it, then shoots up till it looked like a star. Goes east for about a mile blinking its fiery ball on and off. Turns north for a short distance then turns off the fireball and all you could see was its translucent body as it starts to fall very fast spinning and changing shape to what apeard to be a raindrop. Get this. then it swoops twards us, like a bull would very fast. right then my wife trys to pull me in but Im just watching it. She starts crying and just then it just drops down below my nahbors mobilhome which is about 15' the most. After that no bangs booms or flashes. It took place around 2 hours. I watched it pretty much the hole tim with my bino's. 1)I was smoking. 2)I was watching planes and stars. 3)I just thought it was a low flying plane. 4)A half diamond that was translucent with its fiery ball off light under it. Came close to us, waited, then shot up high in the sky to what seemed about 35,000 or more feet. Traveled a little then dropped, spinning, changing shape, then swooping at us, then to what seemed as if it did a quick ducked as if hiding from my wife freaking out. 5)I was at an awe, drawn to it. I just wanted to watch it. 6)I lost it over my nahbors house."],"Object Shape":"Diamond, Fireball, Teardrop","Date Submitted":"03/09/2011 06:15 UTC","Latitude":"34.065754","Source":"MUFON","Longitude":"-117.648758","City":"Ontario","Case Number":"28179","Weather Factors":"Fog","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been 18 other sightings in Ontario","There were no other sightings in Ontario on or around February 28th 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Region":"California","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.065754,+-117.648758(28179)&iwloc=A&hl=en\"> mufon case (28179) map </A>","files":["/var/www/straped/mufon/html2text/28179.html.txt","/var/www/straped/mufon/more/28179_submitter_file1__IMAG0047.jpg","/var/www/straped/mufon/more/28179_submitter_file2__IMAG0045.jpg","/var/www/straped/mufon/more/28179_submitter_file3__IMAG0044.jpg","/var/www/straped/mufon/org/28179.html"],"Summary":"It was close, then shot up. Went out then came back.","Object Features":"None","Date of the Event":"02/28/2011 11:30 UTC","Viewing Distance":"20 Feet or Less"}