{"Log Number":"CA-03092011-0003","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-123.107967","map":"<A HREF = \"http://maps.google.com/maps?q=49.265186,+-123.107967(28174)&iwloc=A&hl=en\"> mufon case (28174) map </A>","Summary":"I was walking my dog in the evening when I noticed a group of strange lights moving from West to East overhead.","Latitude":"49.265186","Source":"MUFON","Case Number":"28174","divs":["Sighting DetailsI lived in an apartment in Richmond, B.C. on the ground floor, and on the edge of Steveston Park. i was taking my little dog for his evening walk (approx: 8:30-9:00). It was a very clear evening and we did our usual stroll around the building and back to the patio entrance to my apartment. Something caught my eye and I looked up to see 5 or 6 big white blobs sailing over our three story building travelling west to east. I ran into my apartment and then back out again to call my neighbour, Stan. All the time I was talking to my dog saying \"Henry, what am I seeing?\" Realizing the event would be over before I could get Stan's attention, I stood and watched them sail across the park and off into the distance. They did not appear to be flying in any formation and appeared somewhat oval in shape, there was no sound coming from them. I felt very strange, and it scared the Hell out of me. My apartment was quite close to the Vancouver International Airport, so needless to say, I was familiar with planes flying overhead, and these, in no way, resembled any aircraft I had ever seen. I called the airport, University of B.C., and a University in Washington State. No one seemed to be of any assistance, or terribly interested. The University in Washington, however, did ask me to draw a picture of what I had seen and send it to them, which I did. I never heard another word regarding the matter. I called my Grandson to tell him what I had just seen and to ask who I should contact. He told me he was listening to a report on the radio of strange lights sighted in Pheonix, Arizona at the same time I was watching the objects. In the Province Newspaper the following day there was a small picture someone had taken from their balconly in Vancouver. I have been unable to find anymore information on this picture, No one at the paper seems able to help me find the article, and at 86 years old, I am not able to get to the Vancouver Public Library to check the archives for the photo. This was a breathtaking, yet scary incident. Seeing shows about UFO's on TV still provokes a strange feeling, and my daughter suggested I share this story, as it has bewildered me for so long, but is never far from my mind. It is so difficult to explain to people what occurred that night and the feelings that come with the experience. I would like some validation about this incident, but can't seem to find any."],"files":["/var/www/straped/mufon/html2text/28174.html.txt","/var/www/straped/mufon/org/28174.html"],"Disposition":"Unresolved","Date Submitted":"03/09/2011 02:06 UTC","Country":"Canada","City":"Vancouver","Sighting Duration":"Undisclosed","Object Shape":"Egg","Tags":"City","Object Features":"Unknown","Region":"British Columbia","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","trends":["There have been 33 other sightings in Vancouver","There were no other sightings in Vancouver on or around March 13th 1997"],"Date of the Event":"03/13/1997 08:30 UTC"}