{"Longitude":"-112.047642","divs":["Sighting DetailsWas In backyard smoking ciggarette when I looked up at the sunnyslope mountain the one with the big white s on it. All of a sudden a bright red ball of light came from behind it and was dropping little balls of ligh. There was no sound what so ever, it dropped at least 2 or 3 balls of light. They would fade out before they hit the ground I ran inside to get my cousin to see it we both rushed out to see if it was still there,it was we observed it for about about another 10 to 15 seconds before it got very bright and then it shot out sparks all over the place almost like a sparkler firework but out didn't make any sound.it was new years yes but fireworks make some kind of noise but thing didn't make any noise at all. After that it disappeared and I lost sight of it it was an unexspected exsperience I mean it completely vanished. Thought it might have been a plane at first but again no noise and the while craft was a red light really bright I stood there for a few seconds to make sure it wasnt a plane my heart starting beating fast got excited I have seen one before but was years ago.my cousin also witnessed the same thing he did not see the craft dropping the balls of light but he did see the craft shoot out the sparks. The sighting was at night.afterwards me and my cousin were extremely excited because we knew how rate it was to witness a ufo, we stood there in amazement as it silently flew over the neighborhood before dissppearing"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Country":"United States","Case Number":"28186","Tags":"City","Latitude":"33.058106","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.058106,+-112.047642(28186)&iwloc=A&hl=en\"> mufon case (28186) map </A>","Weather Factors":"Unknown","Summary":"Back yard smoking ciggarette red ball of light came from behind mtn","City":"Maricopa","trends":["There have been 33 other sightings in Maricopa","There were no other sightings in Maricopa on or around December 31st 2010"],"Object Shape":"Circle, Oval, Sphere, Star-like","Disposition":"IFO","Date Submitted":"03/10/2011 08:53 UTC","Region":"Arizona","files":["/var/www/straped/mufon/html2text/28186.html.txt","/var/www/straped/mufon/org/28186.html"],"Date of the Event":"12/31/2010 11:50 UTC","Log Number":"US-03102011-0004","Source":"MUFON","Object Flight Path":"Straight-line path","Object Features":"None"}