{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.289322,+-120.657356(28188)&iwloc=A&hl=en\"> mufon case (28188) map </A>","Summary":"second night in a row ive seen lights moving through the sky silently then disappear","Disposition":"Unknown","Region":"California","trends":["There have been 8 other sightings in San Luis Obispo","There was one other sighting in San Luis Obispo on or around March 9th 2011"],"Country":"United States","files":["/var/www/straped/mufon/html2text/28188.html.txt","/var/www/straped/mufon/org/28188.html"],"Log Number":"US-03102011-0006","Source":"MUFON","Latitude":"35.289322","Case Number":"28188","Object Flight Path":"Undisclosed","Object Features":"Other","Tags":"City","divs":["Sighting Detailsjust as i had seen the night before this, only an hour earlier this night i went outside to have a cigarette, also with the same witness. we look up after last nights sighting and see a reddish orange light moving across sky to slow to be a plane or satellite in the southern view of the sky it came from the west above the ocean headed east. i turned to go get my girlfriend who was inside as she didnt believe me the night before she came to the front door which is facing south and looked into the sky right when the object was straight south of me, where i would assume it to be hitting the southern california coastline. it disappeared. she asked if it was a plane that was flying above us saying thats all she could see. of course she didnt see it.. i shut the door and left her alone. we sat outside looking in southern sky for another 5 to ten minutes and discussed it. the plane was more above our central coast the ufo was south of here. the only difference from what i seen one night earlier and this night were the direction the craft was flying, the area of the sky it was in, and the height of the craft on the second night seemed to be much lower than the first night. lower than big planes fly but higher than little cessnas. it was also closer to my location enough so that i could tell without a doubt that i was not seeing a plane or helicopter. please report these lights if youve seen them too."],"Sighting Duration":"Undisclosed","Object Shape":"Unknown","Longitude":"-120.657356","Date of the Event":"03/09/2011 10:15 UTC","City":"San Luis Obispo","Date Submitted":"03/10/2011 12:37 UTC","Weather Factors":"None"}