{"map":"<A HREF = \"http://maps.google.com/maps?q=40.110928,+-76.715801(28185)&iwloc=A&hl=en\"> mufon case (28185) map </A>","Longitude":"-76.715801","Log Number":"US-03102011-0003","Date Submitted":"03/10/2011 02:04 UTC","files":["/var/www/straped/mufon/html2text/28185.html.txt","/var/www/straped/mufon/more/28185_submitter_file1__9-18-10195.JPG","/var/www/straped/mufon/more/28185_submitter_file2__9-18-10196.JPG","/var/www/straped/mufon/more/28185_submitter_file3__9-18-10197.JPG","/var/www/straped/mufon/org/28185.html"],"Sighting Duration":"Undisclosed","divs":["Sighting Details On 09-18-2010 at around 20:30 I was in the backyard grilling when I noticed an orange orb in the sky. I went to get my wife who was in the house preparing the remainder of our dinner. She and her brother came outside with our son and we then called her uncle who on the second story of the house in his room with his girlfriend. My wife's father had just come back in the house from the alley where his cousin was still working in the garage. There were 8 of us total who, within about 1 minute from the first time I seen the object, were witnessing this strange phenomena for about 20 minutes. When we first saw the object we all began to wonder at what it might be. We immediately knew that it was not any type of normal aircraft as we all have served in the military and are very familiar with aircraft and air travel. As we paid close attention the orb it seemed to understand that we were interested in it and that it was noticed by us. At this point it begin to descend upon us and it's shape begin to be more recognizable. Once we all noticed the same features and talked about it for about 2-3 minutes, we begin to notice that it was traveling with several other orbs which were not the same in color but were the same in shape and form, as well as motion. This continued for about 10 more minutes. After this, the orb begin to make slow broad sweeping motions across the sky staying at approximately the same altitude at which time we saw 2 star-like projectiles issue out of the western side of the orb, as we were facing towards the north. We continued to observe this orb for about 10 more minutes after which time it moved higher in altitude and off to the North West at a steady pace dimming, brightening, dimming, brightening until it passed from view into the night sky only to return later on. When the orb had faded from view we all went into the house that we might see what pictures and video we had gleaned from our encounter with the object that had shown itself to us. After about 25 minutes of looking at these pictures I looked at the front door because I felt a warmth coming from it. I heard a voice in my spirit that said, \"They're back out here.\" I didn't pay close attention and looked away only to feel the warmth again and look back at the door when I heard the same thing in my spirit: \"They're back out here.\" This time I ran out the front door because I knew that I was hearing from a power greater than myself that I needed to witness this event again. (Just so you know I was a skeptic before this and told YAH [GOD] that He would have to prove these things to me if they were in fact true.) He in fact did just that. After seeing the objects from the front of the house we all ran back to backyard where we saw the orange orb with its' friends for about 7-10 more minutes before it left in the same manner as before. There were 8 of us that saw this at the same time in the same place. This was a very exciting time for all of us and I believe that it was it meant to happen that we might all witness creation that we are not yet well acquainted with. . ."],"Weather Factors":"Unknown","Summary":"Orange Sphere appearing and seemingly wanting to be seen by eight persons.","Region":"Pennsylvania","Date of the Event":"09/18/2010 08:30 UTC","Country":"United States","Case Number":"28185","Object Shape":"Fireball, Saturn-like, Sphere, Star-like, Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"York Haven","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Tags":"City","trends":["There have been no other sightings in York Haven","This sighting has never been favorited."],"Object Features":"None","Source":"MUFON","Disposition":"Unknown","Latitude":"40.110928"}