{"Country":"United States","Object Features":"Unknown","Region":"California","City":"San Luis Obispo","divs":["Sighting Detailsi live one block off the beach. the sighting was in the north view of the sky. i stepped outside to smoke a cigarette with a friend and we noticed a plane in the sky flying south down the coast, the plane attracted us to another orangish red light moving much slower and with no noise in a northwest to southeast direction. the sky was clear with a full view of stars as the unidentified craft reached the center of our view of the sky it disappeared. we looked for another few minutes for any movement and saw nothing. this incident was repeated the following night about an hour earlier. i will make a report of that too. is anyone else seeing these lights up the coast at night?. these encounters were only visual, there was no feelings tied to the sighting that i can relate, at first it seemed to be a satellite but satellites dont go this slow and they dont disappear halfway across the sky. we should have seen this craft for another 5 minutes at the rate it was going. i know of no craft that can simply disappear."],"Tags":"City","Object Shape":"Unknown","Weather Factors":"None","Source":"MUFON","Date Submitted":"03/10/2011 12:03 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.289042,+-120.652296(28187)&iwloc=A&hl=en\"> mufon case (28187) map </A>","Longitude":"-120.652296","Summary":"red/orange lights attached to unknown craft moving slowly and silently through sky","Case Number":"28187","trends":["There have been 8 other sightings in San Luis Obispo","There was one other sighting in San Luis Obispo on or around March 8th 2011"],"files":["/var/www/straped/mufon/html2text/28187.html.txt","/var/www/straped/mufon/org/28187.html"],"Date of the Event":"03/08/2011 11:00 UTC","Latitude":"35.289042","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","Object Flight Path":"Undisclosed","Log Number":"US-03102011-0005"}