{"Log Number":"US-03102011-0002","Object Features":"None","Region":"Arizona","Date of the Event":"03/09/2011 06:21 UTC","Latitude":"35.192213","Longitude":"-114.047986","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"00:03:00","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.192213,+-114.047986(28184)&iwloc=A&hl=en\"> mufon case (28184) map </A>","Summary":"Light Yellow Orb Traveling N. West to S. East","Date Submitted":"03/10/2011 01:16 UTC","Country":"United States","City":"Kingman","divs":["Sighting DetailsGolden Valley, AZ Again, Me and my wife were traveling eastbound on hwy 68 coming home from work. I have been having vehicle trouble causing me to pull over and call for tow service. While waiting outside something in the northwest sky caught my eye. The signature light yellow to amber colored orb traveling silently across the sky until dimming to a dull grey and then disappearing. I would judge this object as traveling below any aircraft flight paths. I called my wife who was waiting in the vehicle and drew her attention to it. She got out of the vehicle and watched it with me until it faded as these objects always do. Notably about these objects is \"how\" they move. If you watch very carefully you will notice their movement is not in a straight path but in a jittery, wobbly type of motion. It is not extremely noticeable but you can see it. It has been about a week and a half to two weeks without any real activity here or it could be \"my\" timing of seeing them but they are for sure still happening. I managed to take some pictures with my phone but image quality is not the great."],"Object Shape":"Sphere, Star-like","Disposition":"IFO","Tags":"City","files":["/var/www/straped/mufon/html2text/28184.html.txt","/var/www/straped/mufon/more/28184_submitter_file1__2011-03-0918.22.51.jpg","/var/www/straped/mufon/more/28184_submitter_file2__2011-03-0918.22.44.jpg","/var/www/straped/mufon/more/28184_submitter_file3__2011-03-0918.22.51.jpg","/var/www/straped/mufon/org/28184.html"],"Weather Factors":"Does Not Apply","Case Number":"28184","trends":["There have been 35 other sightings in Kingman","There were no other sightings in Kingman on or around March 9th 2011","This sighting has never been favorited.",""]}