{"Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.757222,+-77.421181(28193)&iwloc=A&hl=en\"> mufon case (28193) map </A>","divs":["Sighting DetailsI was on my way home from a freinds house at around i belive to be 8 pm. i get to the intersection to cross the main road in the neighborhood when i see.. well i dont know what i seen honestly it was a ball of light about 5-10 feet above tree lvl. it hovers in the air with out moving much if any for about 45 sec to a min then it starts moving iraticly left to right, then it starts to gain altitude probly acouple hundered feet, then hovers there for about 2 min and then all of a sudden drops down below the tree line and then just as fast as it drops down it shoots straight up into the sky and out of site. what made me see the object in the first place was orriginaly thought it to be street light till i noticed where it was located. the object made no noticable noise that i could here. and my reaction was more or less like nothing happend it wasent till i got home and started thinking about what i seen that i realized that what i belive i saw was a ufo and even then my reaction was like it was no big deal or like it was something compleatly normal or happed on a regular basis. there was no panicking or anything like that. i ..i realy dont know how to explain it or describe the feeling better then that."],"Source":"MUFON","Case Number":"28193","Weather Factors":"None","Viewing Distance":"20 Feet or Less, 21-100 Feet","Object Features":"Undisclosed","Region":"North Carolina","Sighting Duration":"Undisclosed","trends":["There have been 12 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around December 1st 2010"],"Log Number":"US-03112011-0001","City":"Jacksonville","files":["/var/www/straped/mufon/html2text/28193.html.txt","/var/www/straped/mufon/org/28193.html"],"Date Submitted":"03/11/2011 12:09 UTC","Object Shape":"Circle, Sphere","Date of the Event":"12/01/2010 08:00 UTC","Summary":"was walking home from freinds house when i see a sphere of light probly 5-10 feet above the tree tops","Latitude":"34.757222","Longitude":"-77.421181"}