{"trends":["There have been 8 other sightings in Amsterdam","There were no other sightings in Amsterdam on or around February 27th 2011"],"Date of the Event":"02/27/2011 11:30 UTC","Object Features":"None","Country":"The Netherlands","Case Number":"28191","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=52.376326,+4.898088(28191)&iwloc=A&hl=en\"> mufon case (28191) map </A>","files":["/var/www/straped/mufon/html2text/28191.html.txt","/var/www/straped/mufon/org/28191.html"],"Date Submitted":"03/10/2011 08:26 UTC","Latitude":"52.376326","Disposition":"Unresolved","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"4.898088","Object Shape":"Star-like","divs":["sighting detailsbeing outside to smoke a cigarette one overcast night on february 27, 2011, in amsterdam, netherlands, i looked idly about the street and noticed a light in the sky. it was a single, star-like object, bright as venus (or brighter), about the same color as the local orange street lights, moving about the same rate as a light aircraft, glowing steadily. [there is lots of air traffic over amsterdam, but all of it flashes and none have orange lights.] once i noticed the light, i started walking down the street to keep it view as it moved. it 'flew' silently in an approximately straight line from the southern sky towards the north-west where it flickered out or went behind buildings\\clouds--couldn't tell in the dark. i watched it for at least 10 seconds, long enough to take a close look and ponder over possible explanations. no one else on the street seemed to notice. i'm an experienced sky watcher and student of unusual natural phenomena. for me, this simple, unremarkable object fit none of the usual categories of explanation."],"Region":"Noord-Holland","City":"Amsterdam","Summary":"An unidentified orange light was observed briefly over Amsterdam.","Log Number":"NL-03102011-0009"}