{"Longitude":"-118.900044","trends":["There has been one other sighting in Three Rivers","There were no other sightings in Three Rivers on or around March 10th 2011"],"Date Submitted":"03/12/2011 01:45 UTC","Source":"MUFON","Sighting Duration":"00:02:00","City":"Three Rivers","map":"<A HREF = \"http://maps.google.com/maps?q=36.446916,+-118.900044(28204)&iwloc=A&hl=en\"> mufon case (28204) map </A>","Country":"United States","divs":["Sighting DetailsI stepped outside on our deck to smoke a cigarette, I usually look at the stars at night as well. The house I am in is on the side of a mountain and away from the city. Out of the corner of my eye I saw something bright. I looked up more and saw this round bright object moving through the sky at a very fast rate. I have seen ufo's in the sky before, and they are usually a little slower, smaller, and more of a bright white light and looks like one of the dimmer stars moving wierd. This time it was different than I had ever seen. It was a lot larger, larger than any of the stars in the sky, brighter than any of the stars in the sky. In brightness, it was as bright as the moon was last night, only more of a yellow color. The moon looked white compared to it..almost like the yellow of a light bulb...but it was so bright that it was almost too bright for my eyes when I looked at it through my binoculars. When I first noticed it, it was to the right of Orion's belt and the moon; it moved straight up, then started moving fast to the left. It was about 3 times as fast as planes when you see them in the sky..not quite as fast as a shooting star though...but bigger and brighter than any shooting star I have seen..and I saw a big one later that night. It moved to the left above Orion's belt and kept moving to the left and then went down and disappeared behind the mountain. When it stopped moving left and started moving down, it was right around the constellation Monoceros...below Gemini. It did not stop and suddenly start going down instead of left, it moved almost like an arc right before it reached the Gemini constellation, then went down. When I looked at it through my binoculars, it looked like a vertical oval that was solid bright yellow light and on the right side of it, was jagged, like the tail end of flames or something...hard to describe. But it was definitely not like any I have seen before. It was very visible without binoculars...but I wanted to try to get a closer and better look at it. There was no sound at all or flashing..just solid super bright yellowish-white glowing object."],"Weather Factors":"Unknown","Object Features":"Undisclosed","Latitude":"36.446916","Viewing Distance":"Unknown","Log Number":"US-03122011-0001","files":["/var/www/straped/mufon/html2text/28204.html.txt","/var/www/straped/mufon/org/28204.html"],"Date of the Event":"03/10/2011 07:30 UTC","Object Shape":"Circle, Oval, Star-like","Disposition":"Insufficient Data","Region":"California","Summary":"bright yellow light larger than stars or planes, moving fast.","Tags":"City","Object Flight Path":"Path with directional change","Case Number":"28204"}