{"Log Number":"US-03122011-0005","map":"<A HREF = \"http://maps.google.com/maps?q=39.40486,+-75.032444(28208)&iwloc=A&hl=en\"> mufon case (28208) map </A>","Date of the Event":"06/26/2007 12:00 UTC","Date Submitted":"03/12/2011 12:37 UTC","trends":["There have been 5 other sightings in Millville","There were no other sightings in Millville on or around June 26th 2007","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/28208.html.txt","/var/www/straped/mufon/more/28208_submitter_file1__p_00160.jpg","/var/www/straped/mufon/org/28208.html"],"Source":"MUFON","Longitude":"-75.032444","Summary":"Black Triangle UFO in a wooded area...Millville, New Jersey","Object Shape":"Triangle","Region":"New Jersey","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"00:02:30","Weather Factors":"Unknown","Tags":"City","Country":"United States","City":"Millville","divs":["Sighting DetailsWent to a wooded area with a trail with my ex-girlfriend around 1:55 AM, around 2 AM I wondered off by myself to find a place to urinate and found a nearby lake with a suitable area to urinate (not in the lake). While in the process of urinating I noticed an Object in the sky probably around 100ft away from me, When I noticed it wasent anything I have everseen I noticed its features, Black Triangle with 4 glowing lights, suprisingly quiet, no movement at all like it was spying on me. Frightened by what I saw I turn around to run to my car but trip forgetting my pants were down, as soon as I pull my pants up and get up I was suprised to see that the object was no longer in the sky. The object disappeared in seconds with no sound indicating to me at the moment that I would hear it if the object moved, I immediately went home and recorded my experience in my notebook, I would have reported it to mufon earlier but I did not have internet till late 2010, I did make a sketch by myself the same night"],"Viewing Distance":"Unknown","Case Number":"28208","Disposition":"Insufficient Data","Latitude":"39.40486"}