{"Tags":"City","Latitude":"28.325857","Viewing Distance":"Unknown","Log Number":"US-03122011-0002","Longitude":"-80.603141","files":["/var/www/straped/mufon/html2text/28205.html.txt","/var/www/straped/mufon/org/28205.html"],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=28.325857,+-80.603141(28205)&iwloc=A&hl=en\"> mufon case (28205) map </A>","Object Shape":"Circle, Star-like","Object Flight Path":"Path with directional change","Region":"Florida","divs":["Sighting DetailsI was on vacation, at the beach, staying in a condo on the ocean. I was out on the condo's 2nd floor with some friends of mine, looking east out towards the ocean at all the beautiful stars, away from all the city lights, while listening to the waves crashing in the background. There were no clouds at all in the sky. We were talking about the different constellations, and one of us said, \"it's a perfect night to see a meteor\". Our eyes were already gazed up at the sky, watching faint satelites fly by, hoping to see shooting star. Probably 2 minutes later, I noticed these two balls, which seemed not too high in the sky, coming from the east out over the water. They appeared out of nowhere, and I initially thought is was a shooting star, and yelled \"look\"! Not even a second later, I noticed there were two of them, and they were going way too slow to be a shooting star, not to mention there were two of them together. As the came from the east, they were flying together, side by side. They were two white balls, or orbs, not too bright, but visible easily to the naked eye. They flew together, like they were attached somehow, and then as they came closer to us, they noticably split apart a little more than they had been flying, just for a brief second or two, then came back instantly to their original distance, still moving exactly the same speed and direction. As they flew over us, I jumped up on the balcony ledge, to watch them continue over the condo, heading east still. They then did a little 360 circle, and kept on going east, until theywere out of my sight. The entire event lasted approx. 6-10 seconds. I knew immediately that it wasn't anything I have ever seen, as I am a big star gazer, watching satelites, meteor showers, and even the ISS fly over whenever possible. After my instant excitement about possibly seeing a shooting star, I just as instantly knew, this was nothing I have ever seen before, and nothing I can think of that might have looked and acted similar. As I had said earlier, we had seen planes, satelites, and even birds fly over that night. Immediately after, my friend, who is an engineer, tried to explain away what he had also just witnessed, and couldn't come up with a viable answer for it. Me, being a big astronomy buff, also could not come up with anything it could have been with my knowledge. We conversed for a long time, and even into the next day, what this, or these \"things\" could have been. Nothing we came up with, matched the speed, distance, size, and manuverability of the objects."],"Sighting Duration":"Undisclosed","Case Number":"28205","City":"Cocoa Beach","Country":"United States","Object Features":"Undisclosed","trends":["There have been 10 other sightings in Cocoa Beach","There were no other sightings in Cocoa Beach on or around March 11th 2011"],"Weather Factors":"Unknown","Date Submitted":"03/12/2011 10:39 UTC","Date of the Event":"03/11/2011 01:45 UTC","Summary":"two small white balls(orbs) flying together in unison.","Source":"MUFON"}