{"files":["/var/www/straped/mufon/html2text/28203.html.txt","/var/www/straped/mufon/org/28203.html"],"Latitude":"34.056028","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Case Number":"28203","Date Submitted":"03/11/2011 09:03 UTC","Date of the Event":"03/09/2011 07:30 UTC","Log Number":"US-03112011-0010","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsI came home from my parents house and my neighbors are outside. I am talking with my neighbors when I stop them mid sentance because I see several hovering lights and one that is very close.(mabey 10 miles away). I came to find out later that the other lighs were jets on a particular flight path, and are completely explainable. But there is one light that is not. the one that was really close. I hear an apache, well what I am assuming is an apache coming from the southern part of the sky, from what I am guessing is williams air force base. I thought at first that the white light was the helicopter until the helicopter came in to view and started to chase the white light. It chased the light at very high speeds probably 200+ miles an hour and was as close to him as one football field at times. I remarked that it was strange that the light wsa heading in the opposite direction as us yet we could still see it's headlights. I also said it is strange because planes aren't allowed to get that close together. The only was it makes sense to me in my head is if an orb of light with intelligent control was either being held by a silent helicopter which had no flasher and pretty good but not to fantastic maneuvering capability better than the one that was chasing it at least. or being moved under it's own power. I think mabey the light was something that the helicopter was supposed to follow as like training or somehting it didn't make a lot of sense in my head so I thought i would report it. I googled it before I came here and see that alot of people have seen what I have, there is even pictures.I don't know if this is explained or not actually. But it was really strange. On my way to work in the morning there was an commercial on the radio that talked about car accidents , news and aparently they said that there would be planes doing training excercies, at wiliiams throughout the day. was it the night before too? 180 Description: Helicopter chases white light at high speeds over Apache Junction, AZ near Mesa border."],"trends":["there have been no other sightings in apache junction\\mesa bord","This sighting has never been favorited."],"Weather Factors":"None","Summary":"Helicopter chases white light at high speeds over Apache Junction, AZ near Mesa border.","Longitude":"-111.089251","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Circle, Fireball, Sphere","Region":"Arizona","Source":"MUFON","City":"Apache Junction/Mesa bord","map":"<A HREF = \"http://maps.google.com/maps?q=34.056028,+-111.089251(28203)&iwloc=A&hl=en\"> mufon case (28203) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed"}