{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.708936,+-90.724572(28206)&iwloc=A&hl=en\"> mufon case (28206) map </A>","Object Features":"None","Region":"Illinois","Viewing Distance":"101-500 Feet","Country":"United States","trends":["There have been no other sightings in Griggsville","This sighting has never been favorited."],"Case Number":"28206","Weather Factors":"Unknown","divs":["Sighting DetailsI don't remember the exact date or time, it was in the early 70's and I was in high school, but it's one of those things, that when recalled, is as vivid today as when it happened. My boyfriend and I were out riding around and were headed west down a country road that is a half a mile from town. He was looking to the south and noticed a light in the sky that seemed to be moving very slow. We stopped to watch it and could tell it was moving slow because we had lined it up with the top row of wire on a barbed wire fence. The closest town to the south is 8 miles and that is how far this light seemed to be from us. It was just a small white light in the sky moving slowly. For some reason he decided we needed to go into town and tell our local cop. We were less than a quarter mile from the main highway that leads into town. We turned right onto the highway and as soon as he began to speed up he asked me if I could still see it. I turned around to look out the back glass and said, \"Uh yeah! It's right behind us!\" And it was. It was behind us not too far up in the sky as I could see it through the back glass, and it was no longer a small light, it was a big bright white light. He was driving fast and just before we got to the city limits we turned right into the parking lot of a local manufacturing plant. We stopped parallel to the highway and the bright white light stopped exactly parallel to us over the field to the left of the highway. He said \"What the hell is that!?!\" We sat there for just a few seconds and the light never moved. Then we sped out of the parking lot, turned right onto the highway and into town. There was a small cafe a quarter mile from us on the right. It was closed for the evening but the parking lot was a good place to hang out and visit with friends and as we approached it there were several cars there. The light was still with us, not behind anymore but traveling at the same speed we were and exactly parallel to us. We turned right into the parking lot and came to a screeching stop. I could still see the light as it had stopped when we did. He jumped out of the car, pointed up in the sky and said to the crowd \"Do you see that!\" and just as he said it, the light disappeared and no one else saw it. To this day when I recall this event I get the same weird feeling...it \"knew\" we were watching it, it seemed to have traveled a great distance in an extremely short amount of time, and it \"knew\" what we were going to do even before we did it."],"Source":"MUFON","Date of the Event":"11/30/1971 12:00 UTC","Disposition":"Unknown","Tags":"City","Summary":"bright light chased us","Sighting Duration":"Undisclosed","City":"Griggsville","Latitude":"39.708936","files":["/var/www/straped/mufon/html2text/28206.html.txt","/var/www/straped/mufon/org/28206.html"],"Date Submitted":"03/12/2011 12:03 UTC","Log Number":"US-03122011-0003","Object Shape":"Circle, Sphere, Star-like","Longitude":"-90.724572"}