{"Disposition":"Unknown","Object Features":"None","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","City":"Absecon","Summary":"Weird lights in the sky!","trends":["There have been 3 other sightings in Absecon","There were no other sightings in Absecon on or around March 11th 2011"],"Date of the Event":"03/11/2011 09:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.43075,+-74.491138(28210)&iwloc=A&hl=en\"> mufon case (28210) map </A>","Longitude":"-74.491138","Country":"United States","divs":["Sighting DetailsMy fiance,our kids and I were traveling north on rt.9 heading home. As I was driving my fiance noticed some lights out of her window. She wasnt sure what it was, so then she asked me \"babe what is that?\". When I looked I couldnt make out what it was and I was sworving to figure it out, she then ask me to pull over and as I come to a complete stop the lights were gone! it seemed as though they dimmed down then disappered. It was a total of six lights (2 rows of three). We then got out and look for what we had seen and there was nothing in sight , not a plane, or any object near that could of produced those lights! In our county we have an airport and an airforce base. So having aircraft circle all around us everyday, I can be sure to tell you what we saw was NOT a plane!!!! The lights were like orange and red and they were in formation brighter than anything that my fiance and I have seen before.When we got home she called the local news station and asked if anyone else had reported it but no one else did. Our friends dont believe us nor does our immediate family members but we find comfort in the fact that we all saw it, including the kids. Honeslty we were all pretty much just trying to figure out what we saw.The children were frightened by it, my fiance and I were more or less excited and wanted to see it again so we circled around and then drove a little down the road north bound again to see if it traveled to another spot but we saw nothing. Today the 12th I drove out to the spot where we had stopped to see if there was any kind of water tower or some kind of structure that may have produced those lights but it was all clear sky ......nothing passed the tree lines. What ever it was it seemed as though it was hovering over the bay, I do know for sure it wasn't an air craft, nor any type of star (it was to low to be that). Well we remain here with the curiosity in hope to know what we saw but I doubt it!"],"Object Flight Path":"Stationary","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/28210.html.txt","/var/www/straped/mufon/org/28210.html"],"Date Submitted":"03/12/2011 02:06 UTC","Latitude":"39.43075","Object Shape":"Square, Rectagular","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"New Jersey","Case Number":"28210","Log Number":"US-03122011-0007"}