{"Date of the Event":"03/11/2011 08:02 UTC","Summary":"4-5 bright spherical objects drifting 100-200ft over Lowell MA","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28217.html.txt","/var/www/straped/mufon/org/28217.html"],"City":"Lowell","map":"<A HREF = \"http://maps.google.com/maps?q=42.634525,+-71.311972(28217)&iwloc=A&hl=en\"> mufon case (28217) map </A>","Object Shape":"Circle, Fireball, Sphere","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Viewing Distance":"21-100 Feet, 101-500 Feet","Country":"United States","Disposition":"Unresolved","Source":"MUFON","Region":"Massachusetts","Case Number":"28217","Log Number":"US-03132011-0001","Object Flight Path":"Straight-line path","Date Submitted":"03/13/2011 12:39 UTC","trends":["There have been 9 other sightings in Lowell","There were no other sightings in Lowell on or around March 11th 2011"],"Latitude":"42.634525","divs":["Sighting DetailsI was driving on Rt 3 in Lowell MA to get to 495 South. While on the highway I noticed 5 spherical objects drifting in formation. I remember thinking that they looked like balls of fire because they were a bright burning orange and yellow color. However, they appeared to be perfect spheres. I pulled over on the highway and snapped a quick photo on my phone. Unfortunately my camera could not zoom and it just looks like dots in the sky. I took the next exit and pulled into a parking lot. This was at 8:02 PM judging by a phone call I made during this sighting. By this time there were only 2 in the sky. One at a time, they slowly decreased in size until they were no longer visible. It did not look like they were moving further away, but rather like they were fading. Which also made me qeustion whether or not this was something on fire, and slowly going out. That is the best way to explain how they were fading. I drove away to get back on the highway and then I look up and see that all 5 are back in the same formation that they were before. I pulled into a closed gas station to get a better look. Next door was a Mcdonalds which had several customers outside looking and filming the objects. We all stayed, staring and discussing what we were seeing until they all faded away again. We stayed a few minutes to see if they would reappear, but they did not. I have checked youtube in hopes of finding someone who has posted a video, but have not found anything on this date. Using my best judgement and logic, I cannot begin to suggest a plausible explanation of what these objects were. I have never seen anything like this before. (Nor had the other people who were standing outside the McDonalds). It may also be important to note that after the incident it became extremely foggy. It was also a fairly cloudy night, so these objects were definitely under clouds. It is hard to judge their height any reference points, but my best guess would be 100-200 ft. above ground. They were drifting very slowly together. They were sporadically aligned, not in a strict formation, but drifting at the exact same speed without changing their relative positions. I hope this dictation is clear enough."],"Longitude":"-71.311972"}