{"Region":"Texas","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Object Shape":"Unknown","Log Number":"US-03132011-0002","Date Submitted":"03/13/2011 12:53 UTC","Weather Factors":"Unknown","Sighting Duration":"00:00:04","map":"<A HREF = \"http://maps.google.com/maps?q=32.567922,+-97.137217(28218)&iwloc=A&hl=en\"> mufon case (28218) map </A>","Object Flight Path":"Hovering then path","Disposition":"IFO","trends":["There have been 6 other sightings in Mansfield","There were no other sightings in Mansfield on or around March 12th 2011"],"Latitude":"32.567922","files":["/var/www/straped/mufon/html2text/28218.html.txt","/var/www/straped/mufon/org/28218.html"],"Summary":"green shape appeared out of nowhere then shot away up to clouds.","Source":"MUFON","City":"Mansfield","Date of the Event":"03/12/2011 10:40 UTC","Case Number":"28218","divs":["Sighting DetailsI was walking my dog tonight at 2240 and since it was a beautiful clear night I was looking up at the stars. Out of nowhere, where there had been only stars, a green light appeared and just hovered in the sky. It was a solid green light that had an almost neon-like glowing quality to it - but it was definately a solid green light that did not change it's shape while it hovered. Just as I saw the light, as it was standing still, it shot off amazingly fast leaving a white tail behind and then the light and the white tail just disappeared. As the light was jetting off it changed into a short imperfect cylinder shape like it was stretching and a large white tail was left behind as it moved. The green light moved straight then curved slightly upward and then disappeared along with the bright white tail. I did not hear any noise at all - it simply appeared in a clear sky and I felt as if this object was low in the sky but I don't know what makes me think that since the event lasted just seconds. I have seen many shooting stars and this was an object that was not dependent on gravity for movement - this object moved under it's own power. I am not someone who looks for UFO's as my thinking is if they are intelligent enough to visit us they are intelligent enough to not be seen. Awesome experience and one I will never forget."],"Longitude":"-97.137217","Object Features":"None"}