{"Sighting Duration":"Undisclosed","Summary":"Looked up and saw the UFO shadowing a Jet liner on the co.pilots side. keeping up with the plane in front of the wing but along side like staying even with the cockpit.","Region":"Texas","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around March 12th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.275153,+-97.734501(28216)&iwloc=A&hl=en\"> mufon case (28216) map </A>","Date Submitted":"03/12/2011 10:16 UTC","Object Features":"Unknown","Country":"United States","Latitude":"30.275153","Object Shape":"Sphere","Date of the Event":"03/12/2011 09:44 UTC","Log Number":"US-03122011-0013","Longitude":"-97.734501","Disposition":"Insufficient Data","Viewing Distance":"Unknown","divs":["Sighting DetailsIt was about 9:44 am, I had gone to the back yard with my dog. I sat in a chair while she ran around. There were some small puffy clouds and I looked up facing the North, I saw an airliner about 22.000ft heading south-east. Then I noticed a small, shinny object by the plane. it looked like a sphere. I looked at it and at first I thought why is that so close to the plane? I thought it might have been a small plane and it looked like it was close to the plane...then I noticed it was keeping pace with the plane. I kept watching it and as the plane flew this object along side of it was bobbing around slightly as it stayed with the plane. It stayed near the section of the plane were the pilots sit on the co-pilot's side. It was close to the wing but to the front of it. Then.....it hit me....OMG....it's a UFO messing with this plane and it freaked me out. then they were heading for a cloud...and they both went in the cloud but only the Jet came out. It was about 30-40 seconds before they went into the cloud. I watched the cloud for a few minutes to see when or if the UFO would come out. I sat there for about 5 minutes watching the cloud and I never saw the UFO again. But were I live, I have lived for 12 years...This is not my first UFO... and I watch the sky all the time. I know how long it takes a jet high up to cross the sky. And This Jet was not cruising....it was hauling, like something was chasing it. It stayed in it's South-East direction. I was shaken by this and just so happens today was a MUFON meeting at 1 p.m..... I was still shaking even in my voice when I got there. There was just something about this craft being so close to the plane that freaked me out. In all the years I have lived here and all the planes I have seen fly over....I have never, ever seen a UFO near any of them and I spend a lot of time watching the sky. Please let me know if ANY ONE else saw this."],"Object Flight Path":"Straight-line path","Case Number":"28216","files":["/var/www/straped/mufon/html2text/28216.html.txt","/var/www/straped/mufon/org/28216.html"],"Tags":"City","City":"Austin"}