{"Date Submitted":"03/13/2011 04:15 UTC","Object Flight Path":"Stationary,Straight-line path,Path then hovering","trends":["There have been 16 other sightings in Killeen","There were no other sightings in Killeen on or around March 12th 2011"],"Object Shape":"Circle, Sphere, Teardrop","Latitude":"31.120799","Region":"Texas","Summary":"I saw a bright , lime-green, circular object just appear silently out of the sky. It looked like it was searching for something and I thought it was a search light at first.. It hovere, zigged and zagged and then continued moving until it just vanished.","Case Number":"28224","Date of the Event":"03/12/2011 10:00 UTC","Weather Factors":"Windy","City":"Killeen","files":["/var/www/straped/mufon/html2text/28224.html.txt","/var/www/straped/mufon/org/28224.html"],"Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=31.120799,+-97.725616(28224)&iwloc=A&hl=en\"> mufon case (28224) map </A>","divs":["Sighting DetailsI left my house to take a short drive to our local Walmart Gas Station. Its was a very clear and dark night. I was driving on a country road. No street lights at all on this stretch of road. Im very observant when Im driving at night because we do have a lot of deer running around here and Im always extra careful so I dont have a run-in with one. Out of the sky, directly in front of me I saw a bright lime green sphere. I thought maybe it was a helicopter, airplane or search light. We are military and live near the Ft. Hood Army Installation Base. So we always have some type of training going on and all types of aircraft flying around. I couldnt help but notice it. But there was no sound at all and no lights hitting the ground. It hovered, zig and zagged, took off and disappeared. It was a perfect circle. Like a marble enclosed in a cloud. As it flew away it had a tail which made it look like a teardrop with the cloudy green color making it look like its firey exhaust, and then it just disappeared. Im a Vet and I thought my eyes were playing tricks on me. But I know what I saw last night and I will never forget it. It came in silently and left the same way. At least I know that Im not alone and others saw and experienced the same thing last night here in Texas. I kept driving, went to the store and came home as fast as I could. I talked to my Brother who is a Cop and he told me to report it on this site. If I ever have another situation like this, I hope I have a camera to show proof of what my eyes have encountered."],"Disposition":"Unknown","Longitude":"-97.725616","Log Number":"US-03132011-0008","Tags":"City","Object Features":"None","Viewing Distance":"101-500 Feet","Source":"MUFON"}