{"City":"Garberville","Longitude":"-123.79309","Date of the Event":"03/07/2008 12:00 UTC","Date Submitted":"03/13/2011 09:47 UTC","Log Number":"US-03132011-0013","Weather Factors":"Unknown","Latitude":"40.101483","Region":"California","Summary":"i felt like i was on acid right after i saw an object fly by 20 ft over head","divs":["Sighting DetailsI was outside smoking a cig when i saw what looked like lights coming down alderpoint road. It was around midnite and fog was moving pretty fast and the wind was blowing good too. As it seemed like it was getting closer cause the lights were flashing through the trees, i was waiting to see what it was and all of a sudden i see what looks like a blacked out object with no lights . The back of it looked like a trail of dust or smoke was left behind and it looked like a ciggarette being put out behind it as zoomed at a rate of speed that i barely could keep up with it with my eyes. Right after that happened i felt like i was on acid . everything i looked at in the sky was moving . I started to to think to my self \"was i dosed by somebody earlier in the day?\"or \"was i just dosed by that dust that went over me\"? while im trying to figure all this out i sat in the driver seat of our suburban all i could think it was how confused i was . I was seeing red tints on all the shadows . the air started to feel heavy and at some points got so hard to see it was like i was blacking out but not losing consiosness only my sight. I would look up at the sky and just see massive amounts of lights moving . but then again everything was looking a little wavy. this is my first report but i need to report another close sighting involving my son and wife. thank you"],"trends":["There have been 4 other sightings in Garberville","There were no other sightings in Garberville on or around March 7th 2008"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.101483,+-123.79309(28229)&iwloc=A&hl=en\"> mufon case (28229) map </A>","Viewing Distance":"Unknown","Tags":"City","Object Features":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","Case Number":"28229","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/28229.html.txt","/var/www/straped/mufon/org/28229.html"]}