{"files":["/var/www/straped/mufon/html2text/28225.html.txt","/var/www/straped/mufon/org/28225.html"],"Disposition":"Unknown","Latitude":"33.810767","Weather Factors":"None","Country":"United States","Date of the Event":"03/12/2011 09:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.810767,+-118.151326(28225)&iwloc=A&hl=en\"> mufon case (28225) map </A>","Object Shape":"Oval, Sphere, Star-like, Other","City":"Long Beach","Tags":"City","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around March 12th 2011"],"Summary":"4 dimly lit orbs traveled in sync for 10sec and the separated as they danced around in a noiseless flight.","Date Submitted":"03/13/2011 04:22 UTC","Sighting Duration":"Undisclosed","Log Number":"US-03132011-0009","Viewing Distance":"20 Feet or Less","Object Flight Path":"Hovering then path,Path with directional change","Region":"California","Longitude":"-118.151326","Case Number":"28225","divs":["Sighting DetailsI was walking out from my buddies apt along with his brother. As we waited for the buddie who's appartment we were at in the front(downtown long beach), something caught my attention from the corner of my eye. I then noticed a small cluster of dimly lit lights crossing the sky probably 200-400 feet in the air moving slowly and gracefully. I then asked the brother who was outside with me waiting to look at these objects, at first glance he thought it was an airplane naturally, but after getting a good glance at what was a very clear and easily identifiable view we both saw four separate orbs or balls of light moving slowly twards the beach. I attempted to yell out his brothers name so that he too could witness what we were absolutely amazed by, during my attempts to call him out we kept our eyes locked on the four lights and they suddenly began to sort of like dance around eachother while still heading west twards the ocean. These objects were in our sight for a good minute maybe untill the buildings in the horizon took them out of our sight, but before they were no longer in our vision they manuvered around eachother in circular and zig zagish patterns, giving me the sense that these werent aircraft because they almost seemed alive by the way they just glid around eachother very softly. I admit the encounter left me totally perplexed. It happened in a highly populated city at the peak hour when social events bring everyone out from city to the streets. And because of the soft light they gave off clearly visable to the naked eye but not so bright as to be an immideate attention grabber I now truly ponder just how frequently they traverse our sky's like they did on this extraordinary night in Long Beach California."],"Source":"MUFON","Object Features":"Other"}