{"Sighting Duration":"Undisclosed","Longitude":"-112.070847","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around March 10th 2011","This sighting has never been favorited.",""],"Weather Factors":"None","Tags":"City","Log Number":"US-03132011-0005","Country":"United States","Object Flight Path":"Hovering then path","Latitude":"33.454027","Date of the Event":"03/10/2011 06:06 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Object Shape":"Oval, Sphere, Other","Case Number":"28221","Summary":"Sitting outside in spa, small objects high in sky caught my eyes. 12 amber lighted objects were moving slowly. Got video.","divs":["sighting detailsi was outside in the hot tub. i bring binoulars with me as i like to skywatch. i also had my little camera with a 3x zoom. the sky was very clear. i switched spots in the hot tub, and looked up while moving and some very small objects caught my eyes. i thought there were so many and up so very high...not hot air balloons. moving unlike other air vehicles, so did not seem to be planes or groups of balloons. grabbed the binoculars. counted 12 objects, all in the same area; a grouping. they were moving slowly, in the north\\nne sky towards the south. i could see 4 at once with binoculars. using the binoculars, they each looked like 3 cigar shapes, all the same size, attached by something invisible, and changing orientation...with some blue sky in between them. they also, i could see with the bino's, were amber\\orange color and looked vivid and kind of \"lit up\". at this point, i had to get out of the hot tub and find my brand new video camera, that i was unfamiliar with since i just got it the day before. no tripod either. so i \"wung it\" and gave it my best. i was able to see them with my eyes, was more difficult to find them with the camera and the 78x zoom. i finally located one, and stayed with it until i moved the wrong way and lost it. it looked totally different with the video on 78x. now it appeared to be a cluster of balloon type things. i think all 12 objects were the same or similar. the \"balloons\" appeared to be stressed, sort of morphing. i did not have tripod so video is shaky. the objects were not shaking. they were \"gliding slowly in a group\". i got about 2 minutes on video. then my husband came home, i lost the image and we watched a little longer with the bino's and naked eyes, took a couple photos with the 3x zoom...then they they all faded away and were gone. it was very exciting, i was nervous while getting video..i was very anxious, and when it was over i wanted to see it again! wished i had more practice with my camera before this event but was so very glad i caught it on video."],"City":"Phoenix","Object Features":"Unknown","Region":"Arizona","Date Submitted":"03/13/2011 12:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.454027,+-112.070847(28221)&iwloc=A&hl=en\"> mufon case (28221) map </A>","files":["/var/www/straped/mufon/html2text/28221.html.txt","/var/www/straped/mufon/more/28221_submitter_file2__DSC07224.JPG","/var/www/straped/mufon/more/28221_submitter_file3__DSC07225.JPG","/var/www/straped/mufon/org/28221.html"],"Source":"MUFON"}