{"Object Features":"None","Summary":"Moon like globe shoots across the sky from left to right","Region":"Texas","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around March 12th 2011"],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/28223.html.txt","/var/www/straped/mufon/org/28223.html"],"Object Shape":"Circle","Disposition":"IFO","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting by my pool facing the east playing my flute. It was a warm evening with good visablity. While I was playing my flute, all of a sudden I saw in the corner of my eye a bright white light coming in to my view from the southeast part of the sky. I stopped playing and watched as this bright white globe streamed across the sky from right to left, (southeast to north), desending from right to left at about a 40 degree angle towards the ground. It was very close, not far away. I did'nt know what it could be. I really didn't have time to think about it, it happened really fast. It looked like it was just above the greenbelt behind my house. It appeared like the full moon, yet it was at least twice as large as a full moon. Also, the moon was behind me and was only partially lit, maybe a 3rd of the moon was lit. So it definitly wasn't the moon. It almost seemed like it was just east of the house next to me, maybe a little further, maybe a 2-4 hundred yards, where there is a green belt that separates our houses from the apartments that are on the top of the hill. As it streamed across the sky, after about 2 seconds it produced two little white flare like jets of fire one on the top and one on the bottom of the globe. The globe then started spinning in a clockwise motion while it was descending. This lasted about 3 or 4 seconds. Then, it fell towards the ground. When it was about to hit the ground I screamed stood up and screamed \" Oh My God \", as I expected to hear a large explosion. But it went behind the trees and dissappeared with no sound. I looked at my watch and it read 10:35 PM CST. I want to repeat that this globe was large and moving very fast from left to right at a 40 degree angle downwards. It wasn't the moon, it wasn't an airplane or helicopter. I've never seen a ufo before,and I never expected I would ever see something like this. It's the most incredible thing I've ever seen in my life. In regards to my feelings, I started thinking about the events that are happening around the world. In Japan, New Zealand, and the volcanoe in Indoensia erupting. I started becoming concerned that this was a sign or a warning. I was worried that more was about to happen, but it didn't. At least not last night. These were just my feelings. The experience was very intense and I still have so many questions. That's really all I can convey at this time."],"Tags":"City","Log Number":"US-03132011-0007","Case Number":"28223","Date of the Event":"03/12/2011 10:35 UTC","Date Submitted":"03/13/2011 03:23 UTC","Weather Factors":"Unknown","Latitude":"32.733069","Object Flight Path":"Straight-line path","Longitude":"-97.31461","map":"<A HREF = \"http://maps.google.com/maps?q=32.733069,+-97.31461(28223)&iwloc=A&hl=en\"> mufon case (28223) map </A>","City":"Fort Worth","Source":"MUFON"}