{"Longitude":"-81.758491","Country":"United States","Disposition":"Unknown","Date of the Event":"12/29/2010 12:00 UTC","Region":"Ohio","City":"Orrville","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsOn the morning of Dec. 29th 2010 at 5:50AM I was awoken by a noise that sounded like it came from the kitchen. No one else was home at the time. I live in a ranch with the bedrooms on the far side of the house from the kitchen The kitchen faces toward the rear of the house. The noise sounded like a low hum that a high voltage transformer makes under load. I am an electrician so I have heard this sound numerous times. I got up and went over towards the kitchen expecting to find a cell phone or pager vibrating. The sound appeared to becoming from the counter area next to the sink. I checked the top of the counter and there were no devices operating that would make such a sound. I checked in the drawers below the counter and found nothing. The sound was a contiuous hum varing in intensity over a couple of seconds. It was sable and non varying in pitch. I went down into the basement where there is a crawl space directly under the kitchen. The sound was not noticed in the basement. This led me to believe that the noise was external to the house. I live in a development with under ground utilities, there are no transformers hanging from poles in the egress between the houses. The nearest transformer is located across the street and is pad mounted. If the noise had been coming from that direction I would have heard it in the living room which I did not. After concluding that the noise was external to the house I went to the window which is about three feet from the location of the noise and over the kitchen sink. As soon as I touched the curtains over the window the noise stopped. I became frightened and retreated into the living room, I did not have the presence of mind to look outside. The next day at approximately the same time in the morning I heard a large double bladed helocopter pass over the house. I was in the military and am familar with the sound of these types of helecopters. This is unusual but has happened before as they pass over a couple of times a year, usually during the day. I would be interested to know if anyone else saw or heard anything during that time period or if what I have discribed has ever been heard by anyone else."],"Log Number":"US-03132011-0010","Summary":"rythmic sound","files":["/var/www/straped/mufon/html2text/28226.html.txt","/var/www/straped/mufon/org/28226.html"],"Object Flight Path":"Unknown","Viewing Distance":"21-100 Feet","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.849846,+-81.758491(28226)&iwloc=A&hl=en\"> mufon case (28226) map </A>","trends":["There has been one other sighting in Orrville","There were no other sightings in Orrville on or around December 29th 2010"],"Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"40.849846","Case Number":"28226","Date Submitted":"03/13/2011 04:57 UTC"}