{"Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Stone Mountain","There were no other sightings in Stone Mountain on or around March 14th 2011"],"Date Submitted":"03/15/2011 04:24 UTC","Source":"MUFON","Summary":"My family and I were on our way to the store. As I was standing in the drive way I saw something that appeared to be a star but it was a little dimmer than a regular star.(note this is not the first time I have seen this star like object. I have seen it a","Object Shape":"Boomerang, Star-like, Other","Date of the Event":"03/14/2011 12:00 UTC","Disposition":"Insufficient Data","Case Number":"28238","City":"Stone Mountain","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-03152011-0001","Tags":"City","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=33.811821,+-84.162936(28238)&iwloc=A&hl=en\"> mufon case (28238) map </A>","divs":["Sighting DetailsMy family and I were on our way to the store. As I was standing in the drive way I saw something that appeared to be a star but it was a little dimmer than a regular star.(note this is not the first time I have seen this star like object. I have seen it at least 4 times within the last 2 months.) As we leave our subdivision I say \" that's the same star I saw the other night and its always in the same spot.\" As I say that the light goes DIM. And then it's completely gone. When my husband looks up its gone. I was like oh my god did you see that? He said no. It was If It herd me.. I contine to look at the spot I had saw the Star but it was gone. SO as we continue on down the road I se the star reapear and it is fast!! almost as if it were following us I point it out to my family but they say it was a plane but this was no plane. It was FAST Because we were going at least 60mph.And it was keeping up. We were on HWY 78 at this point in Snellvile going twords Stone Mountain. As I contined to watch the object it kinda looked like a Boomerang shape with 2 white light on either end and in the middle there was what appered to be a red light. On the sides that were streched outlooked like there was a violet strobe light kinda like what you see under a car that has the lights under them. AS it Past us my husband said it was a plane. But a plane was flying by and the obeject seemed to be alot higher. The plane was slow but the obejust was fast. And it speed up more then disapeared this FREAKED ME OUT. This is the first time the obeject as ever chased us sort of speak. The last time I saw a object like this it was hovering over my house and My daughter and I saw it. it was as if it were watching us. and when I acknowledged that it was there it disappered."],"Country":"United States","Weather Factors":"Unknown","Latitude":"33.811821","files":["/var/www/straped/mufon/html2text/28238.html.txt","/var/www/straped/mufon/org/28238.html"],"Longitude":"-84.162936"}