{"files":["/var/www/straped/mufon/html2text/28231.html.txt","/var/www/straped/mufon/more/28231_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/28231.html"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.223711,+-97.128868(28231)&iwloc=A&hl=en\"> mufon case (28231) map </A>","Tags":"City","Source":"MUFON","Summary":"up close being round with bright green/blue smaller circles on the sides and one in the middle","divs":["Sighting Detailsim a security guard and i had just gotten off of work. With the rock concert event that was going on it was all dead quite when everybody left. i had just sighned off the clock and was waiting for my dad because my car had broke downin in denton texas and he was my ride home. i was just standing leaning back against a truck wen i look across the street pitch black a big circular object comming out of no where like a shooting star and disapearing. at fist i thought it was one of those lights that clubs use to shine in the sky. But it was way too clear, even for me which i didnt have my glasses on and cant see good. it was big but i couldnt see the color of it do to of it being pitch black. Only the smaller circular lights being bright geenish-blue underneathe it that formed a circle and another one in the middle.I couldnt beelieve what i just saw when i asked a lady behind me if she saw it and she said yes, described it perfectly. Later my dad picked me up i didnt talk i was shivering and paranoid about the whole thing. When i got home i stepped inside into the living room i heard a sound like the mesquitto sound and it stopped then i heard a sort of radio wave for a while n stopped. my heart was heating so fast i couldnt sleep all night. i drew a sketch on how it looked like when then i went on google and searched for ufo's and i found one so close to what i saw except the glowing circles where bigger."],"Region":"Texas","Latitude":"33.223711","Sighting Duration":"00:00:04","Country":"United States","Case Number":"28231","Object Features":"Undisclosed","Object Shape":"Circle, Disc","City":"Denton","Log Number":"US-03132011-0015","Longitude":"-97.128868","trends":["There have been 22 other sightings in Denton","There were no other sightings in Denton on or around March 12th 2011","This sighting has never been favorited.",""],"Date of the Event":"03/12/2011 10:30 UTC","Weather Factors":"Unknown","Disposition":"IFO","Viewing Distance":"Unknown","Date Submitted":"03/13/2011 10:21 UTC"}