{"Disposition":"Unknown","Sighting Duration":"00:30:00","Log Number":"","Region":"Kentucky","Weather Factors":"Unknown","Object Shape":"Sphere","Summary":"Hovering, Pulsing Light In the Distance With Jets","Object Flight Path":"Stationary,Other","Latitude":"38.4223","files":["/var/www/straped/mufon/html2text/2823.html.txt","/var/www/straped/mufon/org/2823.html"],"Longitude":"-83.733808","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.4223,+-83.733808(2823)&iwloc=A&hl=en\"> mufon case (2823) map </A>","Date Submitted":"01/22/2003 07:45 UTC","Case Number":"2823","Tags":"City","Viewing Distance":"Over One Mile","Country":"United States","Object Features":"Undisclosed","trends":["There have been 3 other sightings in Flemingsburg","There were no other sightings in Flemingsburg on or around January 22nd 2003"],"divs":["Sighting DetailsFlemingburg, KentuckyI live in a rural area which is usually very dark. I was going to the garageand I exited my house via a southward facing door. As soon as I steppedoutside, I saw a very bright light in the distance above the treeline in theneighboring field. The light was very bright white and seemed to pulse. Atfirst I thought it might be a dirt bike headlight or some such thing on the hilltop. So I stopped to see what might be going on, since it is usually quiet atnight. After my eyes had a few minutes to adjust to the darkness, it becomeclear that the light was quite a bit above the treeline and definately not onthe hill top. You could see the night sky clearly underneath it. The hill topis about 500-600 feet in the distance, with trees at the top that are abour 30feet tall. The hill top is about a 50-75 foot increase in elevation from thelocation of my house. After realizing that it wasnt a bike, I thought it mightbe a hovering helicopter.I watched the light for two or three minutes. Every once in a while, it wouldwobble from side to side very quickly if it were a penny in my hand at armslength, it would be a 12 movement in each direction and return to its originalposition. Also, it would occasionally flare. It would go from a dime sizedcircle of light and then flare to the size of something slightly larger than apenny. When it flared, the light got brighter and whiter. Then immediatelyafter a flare, the light would become a blue-white color. I watched for about3-4 minutes, but it got very cold, so I went inside to put more clothes on.I went back outside about 1-2 minutes later and it was still in the exact sameplace doing the exact same thing. I went into the garage and came back out afew minutes later because I was curious as what the light might be. Afterstudying it, I put its distance from me at about 2-3 miles.This is also when I became aware that something out of the ordinary was goingon. On a normal day, if I stood around outside all day and all night, I mightsee two planes pass overhead. Well when I came out of the garage, I saw theblinking red lights of planes above. At first, I noticed one coming towards mefrom the NE. The looking around the sky some more, I spotted two comingWest-NW. After a few minutes of scanning the sky, I found the red blink lightsof 5 planes moving towards the objecttwo NE, two West-NW, and one from the South. As the NW and NE planesapproached, I could hear the distinct roar of jet engines. I couldnt tell whatkind, but they were definately jets. These five jets began to make a widecircular path around the obje"],"Date of the Event":"01/22/2003 07:45 UTC","City":"Flemingsburg"}