{"Weather Factors":"None","Tags":"City","Case Number":"28244","Sighting Duration":"00:00:30","City":"Santa Barbara","Summary":"Twin lights bob and weave northward above Southern California","Object Features":"Undisclosed","divs":["Sighting DetailsMe and my two roommates were in front of my apartment building talking when I decided to lay on my back along a garden wall and look up at the sky while my friends carried on the conversation. I immediately noticed the big dipper, it being one of the few constellations I can recognize. As I was looking up, two dim orange-red lights appeared overhead and began travelling at a tremendous speed in a northerly direction. They traversed the entire span of the sky in only a few seconds. The lights traveled parallel to one another, varying the distance between them in a rhythmic, repeating cycle. They appeared directly overhead in the constellation of the Big Dipper at approximately 11:20 PM (PST) on Tuesday March 15, 2011. They moved north quickly and steadily, fading rapidly in and out of view, and they bobbed toward each other as described above. Before I could get my roommates to look up, the lights disappeared behind a tree and were gone. When I first noticed the object I thought it might be a plane. I thought it immediately unusual that the lights would appear overhead so suddenly after I had already been staring at the sky. The lights were much broader than the lights I'm used to seeing on planes at night, and there was no audible noise. The lights at their furthest distance from one another were a thumb's width apart. At their closest, they were half that distance from each other. The speed of the lights astounded me. They were much slower than any shooting star and much faster than any aircraft I'm used to seeing. After years of service on a naval air station, I'm quite used to the appearance and sound of aircraft at a distance. When I realized the unusual nature of what I was seeing I jumped up, and tried to get my friends to notice. All I could say was \"Whoa -- whoa -- whoa!\" while pointing and jumping. They didn't look up until the lights were out of sight. All I want are answers. I'll take any plausible explanation. I'm really weirded out by the whole thing. Anything moving at that rate was either really close or really fast. The way the lights seemed to fade up and then down suggested to me that they entered and exited the atmosphere in a simple ballistic trajectory -- with the exception of the lights bobbing toward and away from each other. If the lights didn't mirror one another's actions in this weaving motion, I'd be much less perplexed. I was not under the influence of any debilitating substance."],"Country":"United States","Source":"MUFON","Date Submitted":"03/16/2011 06:28 UTC","Object Shape":"Sphere, Star-like, Other","Log Number":"US-03162011-0005","Region":"California","Date of the Event":"03/15/2011 12:00 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/28244.html.txt","/var/www/straped/mufon/more/28244_submitter_file1__sighting.jpg","/var/www/straped/mufon/org/28244.html"],"Viewing Distance":"Unknown","Latitude":"34.42691","Longitude":"-119.69179","trends":["There have been 20 other sightings in Santa Barbara","There were no other sightings in Santa Barbara on or around March 15th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=34.42691,+-119.69179(28244)&iwloc=A&hl=en\"> mufon case (28244) map </A>"}