{"divs":["Sighting DetailsI was driving along Bruce B Downs Blvd on my way to work and the day featured a clear, bright blue sky, with absolutely no clouds. I kinda saw something in my peripheral vision and I looked up. There was what looked like a triangle with a curved base (Teardrop shape) made up of a bunch of white dots. I initially thought it was a flock of birds flying together really high at first. After a second or two, all of the dots faded out simultaneously and disappeared completely from sight. I looked all around and couldn't see the formation anywhere. I assumed that maybe there were high fog-like clouds that I couldn't see that maybe obscured the formation. Then slowly, the dots appeared again slowly and simultaneously like a fade-in and I tried to squint and see it better. It definitely wasn't birds and wasn't really moving from it's position at all either, so it wasn't a plane. Then it faded away again until it was completely gone. After a second or two, it came back and I tried to look around and see if it was attached to something and couldn't find a source. It faded in and out about 3 more times. Then, I got a shock. I literally gasped and shouted \"No freaking way!\". I swear to God, a line just above the curved base blinked one dot at a time and it looked like that particular lower section moved in a counterclockwise motion with the blinking dots. Then the entire thing faded away and completely disappeared again. I never saw it again after that no matter how hard I looked."],"Weather Factors":"None","City":"Tampa","Viewing Distance":"Unknown","Sighting Duration":"00:02:30","Object Flight Path":"Stationary","Case Number":"28245","Date Submitted":"03/16/2011 08:18 UTC","Region":"Florida","Disposition":"Unknown","Summary":"Unexplained phenomenom seen in the sky above New Tampa","Country":"United States","Latitude":"27.958985","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=27.958985,+-82.451908(28245)&iwloc=A&hl=en\"> mufon case (28245) map </A>","Object Shape":"Cone, Teardrop","Log Number":"US-03162011-0006","Longitude":"-82.451908","Tags":"City","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around March 13th 2011"],"files":["/var/www/straped/mufon/html2text/28245.html.txt","/var/www/straped/mufon/org/28245.html"],"Date of the Event":"03/13/2011 02:45 UTC"}