{"Summary":"white disc shaped five or more seen on davao airspace.","map":"<A HREF = \"http://maps.google.com/maps?q=10.323399,+123.894147(28240)&iwloc=A&hl=en\"> mufon case (28240) map </A>","Region":"Central Visayas","Sighting Duration":"Undisclosed","Case Number":"28240","Weather Factors":"Unknown","Latitude":"10.323399","Date of the Event":"11/03/2010 04:16 UTC","Log Number":"PH-03162011-0001","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/28240.html.txt","/var/www/straped/mufon/more/28240_submitter_file1__davao11310.png","/var/www/straped/mufon/more/28240_submitter_file2__davaopaint.JPG","/var/www/straped/mufon/org/28240.html"],"Date Submitted":"03/16/2011 12:13 UTC","Longitude":"123.894147","divs":["Sighting Detailsit was sunny afternoon. at around 4:16pm. davao philippines. me and family were on vacation. i was baby sitting my baby girl.i was holding my 6 month old baby girl,when i saw 5 to six white disc objects passing from the south going to north of where i was standing.we where at my in laws house at that time. i called out to anybody from the house to get the camera quick. my wife said \"why?'. i shouted just give me the camera! i thought they are ufo as we are near the airport, those cannot be planes. they are white disc. no sound,no wings, no rotors, no tails. then my wife niece came out of the house with the camera. a digital ixus 200is. i said go and shoot pictures at them pointing at these white dics. she ask me what are those?. they are going for a cloud. i said just shoot the pictures first. she was shaking when she took the picture. so i said give me that camera. and i have this pictures taken. she then asked me,\" are those alien ufos? i said maybe. then they disappear when they passed behind the cloud. i was expecting them to come out of the cloud, but they just simple went \"in\" the cloud. or behind the cloud. i was happy somebody from my family also saw it. at least we got also a picture. so were not crazy or seeing things. so im sending the original photo. with the second photo with circles indicating them"],"City":"Cebu City","Object Shape":"Circle, Disc, Oval, Sphere","Source":"MUFON","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in Cebu City","There were no other sightings in Cebu City on or around November 3rd 2010","This sighting has never been favorited.",""],"Country":"Philippines","Object Features":"Unknown","Viewing Distance":"Unknown"}