{"Source":"MUFON","Object Flight Path":"Unknown","Sighting Duration":"01:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.47336,+-97.513378(2824)&iwloc=A&hl=en\"> mufon case (2824) map </A>","Tags":"City","Country":"United States","Date of the Event":"12/24/2003 03:00 UTC","Date Submitted":"12/24/2003 03:00 UTC","Longitude":"-97.513378","Summary":"Unknown Object Seen in Sky on 122403 in Oklahoma C","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Case Number":"2824","Latitude":"35.47336","Log Number":"","files":["/var/www/straped/mufon/html2text/2824.html.txt","/var/www/straped/mufon/org/2824.html"],"trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around December 24th 2003"],"Object Features":"Undisclosed","divs":["Sighting DetailsI was on my way to bed at 300 a.m. on December 24 when I looked out my bedroomspicture window facing south. There were no lights on in the room or the rest ofthe house. To give a location reference, a major east-west highway the onceheavily-traveled Hwy 66 but known in the city limits as N.W. 39th Expresswayisfive streets south of us our house is on N.W. 44, and we are just east of themajor north-south thoroughfare of Portland Ave in OKC. A strip mall located onthe corner of 39th Portland and several motels and businesses up down 39thhave lighting bright enough that the sky always seems light looking south fromour house. I invariably look out the window on the south side of our bedroomthat overlooks the back yard. Currently, there is no shade nor window covering,so the view is good both of the sky and of the houses located on Treadwell St.that back up to our lot. Im not sure what made me look up to my right, but whenI did was in a state of wonderment at this unique phenomenon I observed.It was high in the SW sky and I thought at first it might be a starconstellation, since it was far too large to be a single star. But then itappeared to be too close to be any kind of star and did not have the shiningbrightness of a star. It was distinct, though, in appearance from the darkerblue of the sky around it. I could see other stars in the sky, but they seemedto be at a much greater distance. Whether I observed the bottom of something orthe side, I cannot tell. There was what appeared to be a pale aqua band aroundthe edge of the entire object and the sides were not straight but rather curved. It seemed to be quite high but was large enough to be easily seen by the nakedeye. There was no movement. It did not move the entire time I observedit--approximately 30 minutes. Several lights or sources of light could be seenwithin it, but they seemed to be coming from several crevices located in atleast two places on either side toward the upper edge. When I use the termcrevice, I mean an area with a deep indentation like a trench with areas oferosion or less-deep indentations raying out almost like the rays from a starbut not as random, since the center indentation was longer than the ones comingout from the sides. Whether these lights pulsed or not, I could not tell butthey seemed to be muffled or glowing in a nebulous way as though there wereclouds that covered the sources of light. The object seemed almost transparentor translucent, really quite beautiful unlike anything Id seen before. If Ihad to compare"],"City":"Oklahoma City","Disposition":"Unknown","Region":"Oklahoma","Object Shape":"Unknown"}