{"map":"<A HREF = \"http://maps.google.com/maps?q=45.96554,+-66.638715(28246)&iwloc=A&hl=en\"> mufon case (28246) map </A>","Latitude":"45.96554","Longitude":"-66.638715","Date Submitted":"03/16/2011 10:26 UTC","Object Shape":"Chevron, Sphere","City":"Fredericton","Disposition":"Unresolved","divs":["Sighting DetailsAs I was driving southward over a familiar road in a rural area (known locally as the \"Royal Road\" just northwest of Fredericton, New Brunswick, Canada)in the community called Tay Creek, I saw, just above the horizon in front of me, hovering at approximately 1000 feet, something that was either several objects or one object with serveral attached orbs. The main body of the object was chevron-shaped, and there was a single orb above the chevron attached by a short column. There were several other orbs, but I couldn't tell if they were attached or detached because of the brief nature of my sighting - only 30 seconds, to the best of my recollection. The objects were completely still, and they seemed to be made from a dull, silver metal (like pewter) that glowed or radiated light. All parts of the object, or all of the objects were radiating a silver-white light that illuminated the space around them to, once again, approximately 1000 feet in every direction. In my perception, the spheres appeared to be approximately the size of small cars, eg. Volkswagon Beetles; the chevron component the size of say, a Leer jet; and the column the connected the chevron to the top sphere about the size of a telephone booth. All objects, taken as a whole, covered an area of approximately 500 yards in a roughly circular configuration. When I first saw the sight, I struggled to understand what I was seeing - my mind wanted to create the image of a helicopter or something else familiar to me. So, when I finally realized I was looking at something quite fantastic, I had only a few seconds to grasp the details. I was descending down a steep slope into a small valley as I drove along, and quickly lost sight of the objects. When I drove up out of the valley and ascended the ridge, the sky was completely empty; there was no air traffic of any sort, no hovering objects, nothing! It was a brief encounter, but the event was utterly convincing. I don't know exactly what I saw, but I know I have never seen anything even remotely similar. Anything that could appear and disappear that quickly - and be that large - was clearly and undoubtedly not fabricated by human hands. (Post Script - your drop-down menu with regard to time zones was a little complex for me, so I'll leave you with this - the event took place at approximately 7:10 PM, Atlantic Standard Time, on Monday, March 14th)"],"Viewing Distance":"501 Feet - 1 Mile","Region":"New Brunswick","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"03/14/2011 07:10 UTC","Country":"Canada","Object Features":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28246.html.txt","/var/www/straped/mufon/org/28246.html"],"Log Number":"CA-03162011-0007","Object Flight Path":"Stationary","Tags":"City","Summary":"Still object (s) hovering at approximately 1000 feet above ground in a remote rural area.","trends":["There have been 8 other sightings in Fredericton","There were no other sightings in Fredericton on or around March 14th 2011"],"Case Number":"28246"}