{"Date of the Event":"03/16/2011 05:40 UTC","City":"Sacramento","Sighting Duration":"00:00:45","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/28253.html.txt","/var/www/straped/mufon/org/28253.html"],"Object Shape":"Disc, Sphere","Viewing Distance":"501 Feet - 1 Mile","Case Number":"28253","divs":["Sighting DetailsUFO Sighting over I-5 Capitol City Freeway Interchange - Two UFO's were sighted at approximately 1940 hrs flying at approximately 1500' AGL in SE direction. One UFO was first sighted moving at approx 200 knots and then slowed to a near stationary position and quickly joined by second craft, both craft increasing velocity and executing lateral and vertical turns at high speed with no degree of bank or loss of airspeed and executed vertical and diving maneuvers before departing vertically in high speed vertical helical maneuver, both craft spinning around each other. Both craft changed color with acceleration in climb and dive from brilliant white, to turquoise green and red before disappearing into high vertical cloud. I have 25 years experience as a flight crew member in the Air Force flying throughout the world. I am certain that these were not winged or rotary aircraft. No sound was heard by me as I was travelling in an SUV. Craft were observed in late twilight conditions of near perfect visibility due to clear air from departing storms."],"Summary":"While proceeding thru interchange I5 Capitol City Fwy I observed first one than two flying craft executing high speed and stopping maneuvers while airborne.","Disposition":"Unknown","Longitude":"-121.49235","Tags":"City","Latitude":"38.590512","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.590512,+-121.49235(28253)&iwloc=A&hl=en\"> mufon case (28253) map </A>","Region":"California","Object Features":"None","Country":"United States","Weather Factors":"Windy","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around March 16th 2011"],"Log Number":"US-08102011-0035","Date Submitted":"08/10/2011 07:26 UTC"}