{"Log Number":"US-03172011-0006","Disposition":"Unknown","Country":"United States","Object Features":"None","Summary":"bright white shining object stationary in sky","Sighting Duration":"Undisclosed","City":"Hoboken","Viewing Distance":"Over One Mile","Date Submitted":"03/17/2011 12:34 UTC","Longitude":"-74.029973","Region":"New Jersey","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/28257.html.txt","/var/www/straped/mufon/more/28257_submitter_file1__object1wires.jpg","/var/www/straped/mufon/more/28257_submitter_file2__object2building.jpg","/var/www/straped/mufon/more/28257_submitter_file3__object3building.jpg","/var/www/straped/mufon/org/28257.html"],"Weather Factors":"None","Latitude":"40.75132","divs":["Sighting Details at 11 am on march 4th i was walking from my home to a local coffee shop 3 blocks away. looking up into the clear blue sky i noticed a bright starlike object at about 10 oclock high and towards the north. i remember the sun was behind me towards the southern sky. what struck me is that it was completely still and did not appear to move in the 15 to 20 minutes i looked at it. after pointing it out to a local person from my town i decided to walk back to my car where my canon 20 d camera was. i had already taken a few pics from my i phone but did not believe they showed the object which was about the size of a large star. i then started to take several pics keeping in mind to include the corner of a building or power lines for comparison to scale and focus. the object was silent and appeared to me to be within our atmosphere and like a round silver white star in a bright daytime sky. i sterted to walk back to the coffee shop keeping my eye on the object the entire time. at the coffee shop i asked two people to come out and view it. they were also stumped as to what the object could be? it was silent and stationary. after a little while i noticed it started to move towards the east and over nyc. there were some thin clouds forming and eventually it moved over nyc and disappeared behind the clouds. the entire sighting lasted a little more than an hour."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.75132,+-74.029973(28257)&iwloc=A&hl=en\"> mufon case (28257) map </A>","trends":["There have been 7 other sightings in Hoboken","There were no other sightings in Hoboken on or around March 4th 2011","This sighting has never been favorited.",""],"Tags":"City","Source":"MUFON","Case Number":"28257","Object Flight Path":"Stationary","Date of the Event":"03/04/2011 11:00 UTC"}