{"Sighting Duration":"Undisclosed","Latitude":"42.039701","Case Number":"28265","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.039701,+-88.079116(28265)&iwloc=A&hl=en\"> mufon case (28265) map </A>","Object Flight Path":"Undisclosed","Date Submitted":"03/17/2011 10:46 UTC","Region":"Illinois","trends":["There have been 8 other sightings in Schaumburg","There were no other sightings in Schaumburg on or around March 17th 2011","This sighting has never been favorited.",""],"Disposition":"Unresolved","Tags":"City","Log Number":"US-03172011-0014","Country":"United States","Date of the Event":"03/17/2011 06:40 UTC","Viewing Distance":"Unknown","Object Shape":"Triangle","City":"Schaumburg","files":["/var/www/straped/mufon/html2text/28265.html.txt","/var/www/straped/mufon/more/28265_submitter_file1__Location.png","/var/www/straped/mufon/org/28265.html"],"Longitude":"-88.079116","Weather Factors":"Unknown","Summary":"Frozen In Mid Air with a red pulsating light","divs":["Sighting DetailsMy Wife and I was driving to work. It was 6:40am and as we were approaching schaumburg going north on I-290. My wife wakes me up as we get close to the higgins road exit. She quickly looked out the window since she was driving and said what is that. At first I could not see it but when see said look over at the building, we saw an object completely stationairy over 2 buildings. The location of these buliding would be on the other side of I- 290 south bound across the street from higgins rd next to the streets of woodfield. The building building are made of that shiny glass. Anyway the object was frozen in mid-air. It was floating maybe 25 - 50 feet from the taller of the 2 buildings but was Frozen still over the smaller building. Its shape to me look it was rectagular from the side with a mark or line going in the middle. On the front end of it there was a pulsating light which would travel back and forth from 2 points. My wife from what she saw described it as triangular shaped. She said it resembeled a tripod. the height wise from top to bottom it was about an inch and a half if measured from a distance with are thumb give or take. She feels it was triangular because the red pulsating light would only would only travel back and forth from only 2 of its edges. the red light was not blinking it stayed on and would shine brightly when it would hit one edge point then dim slightly travel back to the other point and blink again. I looked all over I saw airplanes taking off with there headlight appearing whitish yellow so it wasnt a plane i saw at that distance no plane could stay perfectly still. It wasnt a helicopter because again helicopters move and you can hear them. Plus the lights on a helicopter blink they do not pulsate traveleing in a line. So me and my wife called a friend immediately afterwards and told him what we saw. We were just amazed that we got to see something like that. We drove off the exit it was close to work time we didnt wanna be late. We rushed to the fifth floor to see if we could maybe see it from our building but another building blocked the view. Later after work we drove by those building when going home. I looked at the roof of the buliding to try and debunk it. Maybe construction extended lamps off roof but there was nothing there that could have produced that image."],"Object Features":"Undisclosed"}