{"map":"<A HREF = \"http://maps.google.com/maps?q=33.598913,+-117.280037(28263)&iwloc=A&hl=en\"> mufon case (28263) map </A>","Region":"California","trends":["There have been no other sightings in Wildomar","This sighting has never been favorited."],"Date Submitted":"03/17/2011 06:25 UTC","Weather Factors":"Unknown","Date of the Event":"03/17/2011 12:00 UTC","Object Flight Path":"Hovering then path","Tags":"City","divs":["Sighting DetailsMy friend's mom, Debbie Harman, and I were walking out of her apartment so she could take me home, when I spotted a bright orange light floating in the sky. I pointed it out to Debbie, she said it was more then likely a helicopter, she is not a believer of the extra terrestrials. I persistently said it was hovering in the same place for about a minute, so we got in her car, and drove by it on Preilipp Rd. near Clinton Keith Rd. off of the 15 fwy in Wildomar, CA. It was hovering over an open field of grass. We parked on the side of the road, and I got out to take a picture with her camera phone. It was dome shaped at the top, and on the bottom was a really bright orange light, and when I say bottom I mean the bottom of the craft, not like a light on a plane, it looked centered on the craft kind of like the ufo's in movies, it was hovering, and I was distracted by the picture, Debbie pointed out to me, that it looked like static was shooting from the bottom, at the same time as it was dropping objects into the field. I focused on it, and sure enough, it was hovering and dropping what looked like little charcoal grey boxes into the field. It started floating away horizontally to the left hand side of the Santa Rosa apartments, and what struck me as strange was there was no sound coming from the craft and it was moving very slowly, much too slow to be a plane and too quiet to be a helicopter or jet or any kind of conventional man made air craft, so she insisted that we follow the object, so we made a right turn onto Inland Valley Drive, where the object was no where to be found, it almost seemed like it disappeared within 3 seconds of making a turn. We continued to look for it, and could not find it anymore. Later on that day (in the daylight hours, the sighting was at around midnight) I walked the field with my cousin Thomas Nielson to search for any kind of debris or evidence but found none. The picture that I am sending is a cellphone image, altered with a night vision setting on picnik.com I thought that the shape was odd and I'm upset that the picture did not come out better but this is what we have to work with, though it is still interesting. Remember, cellphone cameras tend to have a hard time picking up light, but it still picked up.."],"files":["/var/www/straped/mufon/html2text/28263.html.txt","/var/www/straped/mufon/more/28263_submitter_file1__tn.jpg","/var/www/straped/mufon/more/28263_submitter_file2__ufosighting.jpg","/var/www/straped/mufon/org/28263.html"],"Case Number":"28263","Object Shape":"Oval","Country":"United States","Disposition":"Unresolved","Latitude":"33.598913","Summary":"Dome shaped craft with light emitting from bottom, dropping objects. moved horizontally and then disappeared.","Source":"MUFON","City":"Wildomar","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Longitude":"-117.280037","Object Features":"Dome","Log Number":"US-03172011-0012"}