{"Region":"Minnesota","Country":"United States","trends":["There have been 18 other sightings in Mankato","There was one other sighting in Mankato on or around March 15th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/28261.html.txt","/var/www/straped/mufon/org/28261.html"],"Latitude":"44.167828","Date of the Event":"03/15/2011 09:00 UTC","Disposition":"IFO","Longitude":"-93.99418","Log Number":"US-03172011-0010","Object Shape":"Other","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.167828,+-93.99418(28261)&iwloc=A&hl=en\"> mufon case (28261) map </A>","City":"Mankato","Source":"MUFON","Date Submitted":"03/17/2011 05:21 UTC","Tags":"City","divs":["sighting detailspulled to side of highway near mankato, began filming numerous ufos. they are traveling as our aircraft. they can be seen day or night. this short clip is representation of the phenomenon. the object which appears as a star, i call a watcher. this object flew closer and closer, until becoming stationary. numerous blinkers flew quite close to the watcher. this is one clip, displaying what to look for. these are very numerous. they are pretending to be planes in the dayling. at night they are watchers and blinkers. they are tricky, and are usually found above my house on an clear night. they are quite adept at the \"plane\" deception, but are full of anomalies in the near infra read. they emmit ufos in broad daylight. these are what is known as \"chemplanes.\" they are the same entities that once traveled as discs. they are now planes, choppers, watchers, and sprayers. they are manipulating the climate. for sure. if you want to see the anomalies i speak of look on (*link moved to additional evidence section--cms\\sg) on youtube. i think i am ready to meet, if you are still interested. i feel the puzzle has been solved. i am confident i know what these are and what they are doing. the word needs to get out fast. thank you."],"Summary":"Witnessed numerous ufos short period of time","Viewing Distance":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"28261","Object Flight Path":"Undisclosed"}