{"Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting Detailswe were about 20 miles from roads end to the mt. st. helens overlook when we pulled over to get some water out of a pond at the base of a rock cliff with a small water fall trickeling into the pond. as i walked towards the cliff i could here the water fall, then everything went dead , no sound and the air was dead like. then i noticed this strange wispy fog streaming by the rock wall. and the water wasent falling any more. i thought this was verry strange, so i looked up the road and there was a river comeing down the vally but it was turned to a heavy smoke looking stream now. so i looked up and there was a thick fog layer 200 ft. above us and i noticed that there was a perfect round hole in the fog above us and i could see the stars, then i noticed this one star started to move in a eratic hexagon pattern real fast then stop. then it did it agin , this went on for several min. it was definetly verry far away out in space. all of a sudden i saw a beam of light comeat me from the distance i got scared and i knew it was not from earth. then it materialized at the opening above me. the whole place lit up like daylight but it was a wierd light, the trees looked funny. then i could see the ufo 200ft. above my headwith these beautiful blue & red tiny lights rotateing around the rim of the ship, acolor like nothing i ever seen before. my girl frind was sitting in the car , i told her to look at it several times , she just sat there like she was paralized, then the ufo took off so fast it was gone. the hole in the fog closed up and everything returned to normal. i wish it would of stayed, i had a feeling of perfect content while it was there. i felt abondond and left out when it left. i discovered a strange lump under my sholder blade. they may of abducted me , i see ther faces and close up of the edge of the light of the ufo sometimes."],"Weather Factors":"Unknown","trends":["There has been one other sighting in Randle","There were no other sightings in Randle on or around July 15th 2001"],"Latitude":"46.536885","Longitude":"-121.94969","Date Submitted":"03/17/2011 05:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.536885,+-121.94969(28262)&iwloc=A&hl=en\"> mufon case (28262) map </A>","Object Shape":"Disc, Fireball, Flash","Date of the Event":"07/15/2001 12:00 UTC","Summary":"saw ufo on road to mt. st. helens","Object Features":"Undisclosed","Country":"United States","Log Number":"US-03172011-0011","City":"Randle","Case Number":"28262","Disposition":"Unknown","Source":"MUFON","Region":"Washington","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/28262.html.txt","/var/www/straped/mufon/org/28262.html"]}