{"Case Number":"28271","Summary":"Blinking orbs in chemcloud *(Info moved to Additional Evidence Section--CMS/sg).","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/28271.html.txt","/var/www/straped/mufon/org/28271.html"],"divs":["sighting detailsi was experimenting in near infra-red. taping some strange clouds, what many call chemclouds. i was using 1000nanometer filter and was unaware at the time, what was in the shot here. after analyzing the footage, i discovered a few neat anomalies. a small \"blinker\" and a small watcher. i estimated this cloud to be 7000 feet, so these orbs whould have appeared small at that distance. they are generally the size ofa basketball at close range. either way, neat footage. there are alot of neat little critters in these clouds, especially in the 680 nm range. i have alot of this footage to analyze but not much time. all i know is that i havent seen the discs of old, but alot of \"fake\" planes. it looks like they changed it up on us bigtime. these things are flying everywhere. i think you need to put \"fake plane\" on the mufon site as a choice for sighting. i would be checking the box alot. i leftmy name, ifyou would like to learn more please contact me. this phenomenon is now solved, and documented. thank you. **(link moved to additional evidence section--cms\\sg). here is the video link. i am not on my video computer and can't upload. thanks."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.166288,+-93.99554(28271)&iwloc=A&hl=en\"> mufon case (28271) map </A>","City":"Mankato","Latitude":"44.166288","Country":"United States","Region":"Minnesota","Disposition":"IFO","Date of the Event":"11/18/2010 12:00 UTC","Weather Factors":"Unknown","Longitude":"-93.99554","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"03/18/2011 02:10 UTC","trends":["There have been 18 other sightings in Mankato","There were no other sightings in Mankato on or around November 18th 2010"],"Tags":"City","Log Number":"US-03182011-0004","Viewing Distance":"Unknown","Object Shape":"Star-like, Other","Source":"MUFON"}