{"Date of the Event":"05/31/1974 12:00 UTC","Object Shape":"Disc","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Warminster","There were no other sightings in Warminster on or around May 31st 1974"],"Latitude":"40.206788","Object Flight Path":"Straight-line path","City":"Warminster","Region":"Pennsylvania","Disposition":"Insufficient Data","Case Number":"28287","Tags":"City","Weather Factors":"None","Object Features":"Window(s)","divs":["Sighting DetailsThis incident occurred when I was kid approximately 1974 or 1975. I was approximately 9 or 10 years old. It was so long ago I'm not sure exactly when it occurred, I do remember school was still in, and it was warm out, so it was toward the end of the school year. I was with a friend of mine who I grew up with, he was a year younger than me. We grew up together in a development in Warminster not far from the Johnsville Naval Air Development Center that was located on Jacksonville Rd at Street Rd. We were down in the woods at the (then) dead end of Mearns Rd. These woods had a large cornfield in the middle with a treeline all the way around the field that separated the field from the yards of the homes in the development that surrounded that area. On the far side of the woods beyond the trees and out of my sight was Arch Bishop Wood Catholic High School. This night I could hear the High School marching band was out at the school playing, I figured they were out practicing or that there was a football game going on. It was around dusk and starting to get dark, my friend and I had gotten separated in the woods as we were exploring different areas. We were supposed to be home before dark. I was waiting near the edge of the woods where they met Mearns Rd. It was dusk and I knew it would be getting dark soon so I was waiting for my frined to come out of the woods when I saw a large metallic disk come out over the treetop level from my right and it slowly tracked across the sky over the field and moved from my right to my left and just slowly continued in the same direction until it disappeared out of sight. It was traveling directly toward the Johnsville Naval Air station. It had round lights on the side of it that I woud compare to a porthole on a ship except they looked like lights and the disk slowly spun making the lights turn around the perimeter of the object. It had a flat shape with straight sides and the round portholes were in the sides. It wasn't spinning around very fast at all, and it wasn't moving across the sky very fast either. I would compare it in size to a tractor trailer. I remember when I first saw it come it out of the trees that I thought it was some sort of thing related to the marching band at the High School, that they were having a football game and they were setting off some kind of fireworks or there was some sort of aircraft involved with the football game. Once I could completely see the object I knew it had nothing to do with the football game. After the object disappeared out of sight my friend came out of the woods and he was petrified. He wanted to get out of there as fast as he could and go home, and he did not want to talk about it. I asked him if he saw the object, and he said yeah, and he did not want to talk about it. He just wanted to get home. He was nearly crying. I just wanted to talk about it to make sure he saw what I saw. I also wondered if anyone else in the neighborhood saw it, because I couldn't believe someone else couldn't have seen it since it was still light out and this thing just flew over the neighborhood. I remember as I looked at it, I just wanted to stand there and stare at it. I was completely mesmerized by it. I wanted to go home too, but I wanted to tell my father what I saw and bring him back to the woods to show him where I saw it. When I went home I found my father and my older sister in the kitchen I started to tell them what I saw and wanted my Dad to go down to the woods with me. Instead of listening to what I told them, they began to make fun of me and tease me. So after that I never really discussed it with anyone else, because I didn't want to be made a fool of. Since my friend didn't want to talk about it, I just forgot about it. When I saw the show tonight in Bucks County where I grew up, it made me think about that time again. The people on the show seemed to be in close proximity to Willow Grove Air Base. I went to my computer and went to look at a map of Warminster. I looked at the area where the field used to be (its now a development) and where Johnsville Air Base was. I looked at where the Willow Grove Air Base was and it was almost in a straight line from Johnsville with that field in between. It made me wonder if that object hadn't been coming from Willow Grove to Johnsville and went over that field on its field, but I never heard of a report of anyone else ever seeing this thing in the sky. That made me wonder if the thing just didn't rise up out of the woods and then move toward the Johnsville Air Base. I just see it appear from over the treetops and move over the field out of sight. I had no idea where it came from or where it went to. I never experienced anything like this in my life, before or after. When UFO conversations came up in my life, if someone said they had seen something in their life I always remembered this incident, but I really didn't talk about it much because I didn't want to come off as some nut. I just would tell others \"yeah I think I saw something when I was a kid.\" I sometimes questioned if I really saw what happened that day. I never could understand why others didn't report seeing it, or why my friend was so scared and didn't want to ever talk about it. I also wondered if it was some project that the Navy was working on at the Johnsville Air Base. It was well known in town back then, that it was a research base for working on experimental Naval aircraft, and had involvement in the U.S. space program including astronaut training."],"Source":"MUFON","Viewing Distance":"101-500 Feet","Longitude":"-75.099807","Date Submitted":"03/19/2011 12:10 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.206788,+-75.099807(28287)&iwloc=A&hl=en\"> mufon case (28287) map </A>","files":["/var/www/straped/mufon/html2text/28287.html.txt","/var/www/straped/mufon/org/28287.html"],"Log Number":"US-03192011-0001","Summary":"I saw a disc shaped object with illuminated port hole shaped windows track across the sky at treetop level."}