{"Case Number":"28288","Object Flight Path":"Path with directional change","trends":["There have been 2 other sightings in West Liberty","There were no other sightings in West Liberty on or around March 17th 2011"],"divs":["Sighting Detailsmy wife says i nedd to tell you folks about this. it sent a chill down my spine then as it does to type this right now. last night i went out our back door to take our pug out to do her business . i was standing in the drive way when something in the sky coming from the south caused me to look up. what i saw was beyond any thing i could comprehend . there was something with three lights in the shape of a triangle going very fast it was coming from the south going north. it went right over our house.as it got closer it slowed down.the three lights were as bright as a full moon.as it got closer i then realized this thing was HUGE i am getting goosebumps typing this right now. i ran to the deck and yelled to my wife to come and look at this thing in the sky.as she came out it had just gone over our house.we stood in awe and watched as it faded in the night sky to the north. as it went over i noticed there was on noise,none,erie and it was extra quit outside.now the most chilling part of this was how big it was.i told my wife if i had to guess this thing had to be a mile wide.i know this sounds crazy but i stand by my estimate.we will never forget how this thing moved through the sky.i can only hope that other people saw this because it troubles me.it was tramatic and left me with nothing but wonder.if you must know it was very scary. i find myself going to the deck door and just staring at the night sky.makes me wonder does our government oranother government have something this big the flys? i wish i had never seen this. thank you"],"Object Shape":"Triangle","Source":"MUFON","Region":"Iowa","Date of the Event":"03/17/2011 08:15 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.571389,+-91.261111(28288)&iwloc=A&hl=en\"> mufon case (28288) map </A>","Log Number":"US-03192011-0002","files":["/var/www/straped/mufon/html2text/28288.html.txt","/var/www/straped/mufon/org/28288.html"],"Latitude":"41.571389","City":"West Liberty","Tags":"City","Date Submitted":"03/19/2011 12:18 UTC","Longitude":"-91.261111","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Summary":"very very large, three lights on corners, black","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown"}