{"Date Submitted":"03/18/2011 11:23 UTC","City":"Fitchburg","Summary":"Not a UFO sighting. photo with, possibly, alien and weird interference","trends":["There have been 8 other sightings in Fitchburg","There were no other sightings in Fitchburg on or around November 29th 2009","This sighting has never been favorited.",""],"Disposition":"Unresolved","Country":"United States","Object Shape":"Other, Unknown","Weather Factors":"Unknown","Tags":"City","divs":["sighting detailsi was in my room getting ready for bed after i worked the nightshift. i wanted to see how my new underwear set looked on me, so i decided to take a picture. after i took the first photo (11\\29\\2009 11:43 a.m.) i turned my camera around to see and i noticed some weird light patterns that were pretty intricate. so i took another, and this picture was covered in more light patterns. i ended up taking a couple more, and got more interference. when i first took the pictures, i didn't think of aliens at all, i really didn't know what to make of them. i just knew that these weren't the typical light flashes you see in your pictures sometimes, the lines were too detailed. i only came to the idea that it might be alien interference in my pictures after i had a vivid alien dream over a year after i took the pictures. i will only be posting one of these pictures, due to the fact that there is personal images(my face)in the others and i don't want to post them online to the public. i hope to get some feedback to what the photo analyst makes of the picture."],"Case Number":"28282","files":["/var/www/straped/mufon/html2text/28282.html.txt","/var/www/straped/mufon/more/28282_submitter_file1__DSC01102.JPG","/var/www/straped/mufon/org/28282.html"],"Log Number":"US-03182011-0015","Region":"Massachusetts","Longitude":"-71.806968","Viewing Distance":"Unknown","Latitude":"42.612066","Date of the Event":"11/29/2009 11:43 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.612066,+-71.806968(28282)&iwloc=A&hl=en\"> mufon case (28282) map </A>","Object Features":"Undisclosed","Object Flight Path":"Undisclosed"}