{"Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/28295.html.txt","/var/www/straped/mufon/org/28295.html"],"Case Number":"28295","Source":"MUFON","Longitude":"-110.923269","Tags":"City","Disposition":"Unknown","Log Number":"US-03192011-0009","Object Features":"Unknown","divs":["Sighting DetailsAt appox 730pm I was in my back yard playing with star map app on my phone and digging weeds out, when I just happen to look up and witness at first what appeared to be a group of ballons released into the sky, traveling from the south heading north. As the \"ballons\" approached closer, I saw no swaying movement, and saw what appered to be a soild object. Due to tonight being a full moon, and as the object came closer to the moon itself, the moon light reflected off of a triangle shaped \"craft\". The wind a the time was coming from the west at a breeze, yet the object traveled unhindered by the wind, in a straight path, south to north. It is hard to exactly describe the way the light was reflecting off of the object, it was disorted and mirage-like, but the shape of a triangle was clearly visable in this small window of time viewed. As the object came closer to the moon, I could see what looked like miraged orbs along the outside of the triangle shape, wavey, much like the lights in a swimming pool, with fluxing movement. As the object passed the moon, all reflection was lost and the object vanished into the sky. It was as if a trick was played on my eyes when it appeared and when it vanished. The event itself lasted no longer than 5 to 7 seconds. The object made ZERO sound, not a humm, not a buzz, nothing. This, along with the speed at which it was moving was the most disturbing part of this whole event to me. I can not gauge how high the craft was, but it was most certainly not at the altitude of commercial aircraft, but more around the altitude of aircraft circling in before landing. The object was at appox 70-80 degrees overhead. I live right outside Davis-Monthan AFB, I was enlisted in the AZ Air National Guard for 6 yrs, and I grew up on the southside of Tucson, where the Tucson Internationl Airport is located, so I KNOW what a plane & fighter jet look and sound like. The speed at which this object was moving is about equal to one of our ANG F-16s taking off at full afterburner, which I have seen more times than I can remember. Had it not been for the light of the full moon, I would not have seen this object."],"Object Shape":"Triangle","Sighting Duration":"00:00:07","Latitude":"32.231313","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around March 18th 2011"],"Country":"United States","Object Flight Path":"Straight-line path","Region":"Arizona","Date of the Event":"03/18/2011 07:30 UTC","Summary":"Moon lit triangular craft traveling from south to north at a high speed but making no sound.","map":"<A HREF = \"http://maps.google.com/maps?q=32.231313,+-110.923269(28295)&iwloc=A&hl=en\"> mufon case (28295) map </A>","City":"Tucson","Date Submitted":"03/19/2011 02:12 UTC","Viewing Distance":"501 Feet - 1 Mile"}