{"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","Disposition":"Unknown","Log Number":"US-03192011-0008","Tags":"City","Source":"MUFON","Country":"United States","Summary":"Brief glimpse of something I have never seen before. one other known witness. vibrant green light. shaped like a square-ish","Region":"Tennessee","trends":["There have been 6 other sightings in Antioch","There were no other sightings in Antioch on or around October 20th 2010"],"Case Number":"28294","City":"Antioch","Latitude":"36.06549","Object Flight Path":"Straight-line path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=36.06549,+-86.666042(28294)&iwloc=A&hl=en\"> mufon case (28294) map </A>","Object Shape":"Diamond, Square, Rectagular","Longitude":"-86.666042","Weather Factors":"None","divs":["Sighting DetailsMy friend, his brother, and I were sitting on his front porch at his house, waiting on someone else to show up. As we were waiting a police officer drove by,(from the right, heading left) and my friend and I stared at the officer, trying to determine if he was one we are familiar with. As he drove down the road where the road curves right, in the sky about two fingers above the tree line of the horizon, there was a very vibrant, large, neon green ish, square or diamond shaped, and flashing or pulsing light heading down past the trees. It was only visible for at most five seconds. However it was enough time to get one good look at it before it was out of sight. My friend and I were both suprised at what we saw. It was not visible long enough to get a picture or anything of the sort. To date, I still do not know what it could have been. I know for a fact that it did not resemble any aircraft I have ever seen. I'm sharing this with your organization only to see if you have ever incountered anything similar to: a flashing or pulsing, neon green ish, fairly large, square or diamond shaped, sighting such as this. Let me please emphasize I am not implying this to be an alien craft or anything of the sort. I am unable to identify it, and cannot match its description with anything on the internet. Perhaps your organization has seen something or recieved reports from the area (or even state) that fits the description?"],"files":["/var/www/straped/mufon/html2text/28294.html.txt","/var/www/straped/mufon/org/28294.html"],"Date Submitted":"03/19/2011 01:49 UTC","Date of the Event":"10/20/2010 11:30 UTC"}