{"Date of the Event":"07/08/2008 09:20 UTC","Disposition":"Unknown","City":"Middlesboro","Source":"MUFON","Object Shape":"Cigar, Cylinder","Log Number":"US-03192011-0013","divs":["Sighting DetailsI had finished mowing grass and as I came out the door I wanted to look toward the sunset, which was long gone except for a few very high thin clouds. It was only starting to get dusky dark when I noticed it. I thought it was in space or very high until it went under the clouds. It was NOT a refection from a plane; It did'nt even look like one. No wings; absolutly no sound at all, but close enough that there should have been. It was shaped like a big cigar, Just like one! It kept changing colors like a firelog glowing ember like. I was facinated by it for some reason, because it did'nt dawn on me right away that somthing was'nt right. It was going way too fast for there to be no sound. I don't drink or do drugs, so no hallucination's. I thought it to be very pretty. I've never seen anything like it before. After it left, the first thing that came into my mind was,'' Well; Now you've seen one too''. I thought on it for a day or two, then on the third day I seen it coming back and that time it was night; Same thing, only this time it was moving faster than anything I've ever seen fly! No sound. after you could have counted to about ten, There were two military jet's giving chase. After they went by you sure could hear a boom! I've always thought there were other civilization's out there, but why wuold they even want to come here! Mostly just war and corruption; Probably think it might be catching, like a sickness or something. I can't see what we'd have to offer them. If they can come here from out there, they'd be so far ahead of us; It would be like us watching grass grow. But if thier there[ And I know they are now], God made them too. Maybe He's told them to leave us alone; Maybe they can watch and that's all. When I saw that report about the sighting's that fall, I knew then that I'd seen it to. I live in the country with not a lot of streetlight's and the like to block the starlght view. I was 46 when I saw that. I've been a star gazer since I was a kid. Seen a lot of stuff; But NOTHING LIKE THAT!!!"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.614198,+-83.72084(28299)&iwloc=A&hl=en\"> mufon case (28299) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28299.html.txt","/var/www/straped/mufon/org/28299.html"],"Longitude":"-83.72084","Date Submitted":"03/19/2011 04:02 UTC","Case Number":"28299","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Unknown","Latitude":"36.614198","Summary":"cigar shaped, entire thing glowed, changing firelog like orange/red","Region":"Kentucky","Tags":"City","trends":["There have been 3 other sightings in Middlesboro","There were no other sightings in Middlesboro on or around July 8th 2008"],"Object Flight Path":"Straight-line path","Viewing Distance":"Over 1 Mile, Unknown"}