{"map":"<A HREF = \"http://maps.google.com/maps?q=41.760928,+-124.194487(28298)&iwloc=A&hl=en\"> mufon case (28298) map </A>","City":"Crescent City","Object Features":"None","trends":["There have been 11 other sightings in Crescent City","There were no other sightings in Crescent City on or around September 1st 2010"],"Object Flight Path":"Hovering then path","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Tags":"City","Weather Factors":"Unknown","Region":"California","divs":["Sighting DetailsON A LATE SUMMER EVE. ABOUT 11-12 PM I WAS WALKING BACK TO MY CAMPSITE ON A 67 ACRE RANCH MY FRIEND OWNS,I HAD TO WALK OUT INTO THE OPEN PASTURE FROM THE TREES WE WERE SITTING UNDER HAVING A COOK OUT,WHEN I WALKED OUT FROM THERE INTO THE OPEN I NOTTICED WHAT A CLEAR NIGHT IT WAS & YOU COULD SEE ALL THE STARS CLEARLY.I WALKED ABOUT ANOTHER FEW STEPS WHEN I LOOKED UP AGAIN I NOTICED A SPOTLITE WHAT LOOKED TO BE A HELICOPTER BECAUSE IT WAS HOOVERING,MABEY 500-700 FT UP.THEN A FEW SECONDS AND IT STARTED MOVING UP & THE LITE FLASHED,REAL BRIGHT,THE BRIGHTEST WHITEST LITE I EVER SEEN.IT THEN TOOK OFF AT SUPER FAST SPEED UP,I FOLLOWED IT THIS WHOLE TIME TILL IT WAS UP THERE WITH THE STARS,BUT IT WAS BRIGTER THAN THE STARS. IT TOOK ABOUT 4 SECONDS TO GET UP THERE,STRAIGT UP! I LOST SIGHT OF IT AS THE LITE TURNED INTO SUCH A SMALL DOT PASSING STARS AND DISAPERING INTO SPACE. I WAS IN TOTAL SHOCK AND PINCHED MY SELF AND RUBBED MY EYES.MY FRIENDS WERE LESS THAN 100 FT AWAY BUT IT HAPPEND SO QUICK I COULD NOT REACT. I DID NOT REPORT IT TILL NOW,BUT THE LOCAL PAPER HAD UFO REPORT AROUND THAT TIME.I HOPE OTHER PEOPLE SAW THIS THAT NIGHT,IT WAS A UFO OR GOV, PROJECT,FASTER THAN THE SPACE SHUTTLE BY 1000%. BOTH MY GRAND FATHERS WORKED FOR NASA IN THE CAPE,IN FLORIDA,THEY SAID UFO WOULD COME TO THE BASE & HOOVER AND TAKE OFF A UNFAVNABLE SPEED. ONE WAS DESCRIBED AS THE SHAPE OF AN AIRPLANE WING,PERFECLY SMOOTH & METALIC. THE PEOPLE THAT WORK FOR NASA HAVE HAD MANY EXPERIANCES.MY FAMILY FROM THE SPACE COAST & MANY FAMILIYS TALK ABOUT UFO ACTIVITY THERE."],"Object Shape":"Circle, Flash, Sphere, Star-like","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-124.194487","Latitude":"41.760928","files":["/var/www/straped/mufon/html2text/28298.html.txt","/var/www/straped/mufon/org/28298.html"],"Summary":"WALKING ON RANCH IN OPEN PASTURE WHEN ABOVE ME TO THE N/W A BRIGHT LIGHT APPERED TO BE HELICOPTER SPOTLIGHT THEN TOOK OFF STRAIGHT UP AT SUPER HI-SPEED TO THE STARS.","Date of the Event":"09/01/2010 12:00 UTC","Log Number":"US-03192011-0012","Case Number":"28298","Date Submitted":"03/19/2011 03:31 UTC"}