{"Tags":"City","divs":["Sighting DetailsI had just finished watching Bonanza on tv. I put our big chair back against the wall. I went down the hallway to my room. I pulled back the covers and put my dog on the bed. I turned off the light and had just started to cover myself when my dog jumped up and growled. I then heard a low whirring type sound. My dog jumped off the bed and went down the hallway.during this I heard a crackling or zapping sound. the whole room was lit up as though the light was on. I got up and looked out both windows. Everything was lit up all around the house, very, very bright. I was drawn to the living room [A feeling I had to go] I went down the hallway and I stopped at the end. Looking across the living room toward the sliding glass door stood someone, very tall [top of head was higher than rod at the top] Completely shadowed[I could not see features] I said what do you want? no answer. I again said what do you want? Here it gets confusing for me,as if I am missing pieces. Time!! I next remember looking behind me at my dog and then toward my visitor. then I am in my room again. I hear the crackling sound again. Then the whirring sound getting steadily louder. I then hear a vehicle and look out my window. There is a jeep with two military guys and a large spotlight in the back. One is driving and the other is directing the light. The back one points and they take off down the road. I ran to the other window but only saw the jeep go around the curve. I went to bed and pretty much just passed out. In the morning I told my dad about it and he said he would check on it. Last time he ever talked to me about it. I feel at ease, not a bad experience. But something? This has haunted me for 43yrs PLEASE HELP ME!! I feel I want them to come back."],"files":["/var/www/straped/mufon/html2text/28292.html.txt","/var/www/straped/mufon/org/28292.html"],"Log Number":"US-03192011-0006","Object Shape":"Unknown","Disposition":"Unresolved","Object Flight Path":"Unknown","Case Number":"28292","Region":"California","Date Submitted":"03/19/2011 01:06 UTC","Date of the Event":"12/31/1967 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.253098,+-122.032636(28292)&iwloc=A&hl=en\"> mufon case (28292) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"Travis AFB alien encounter in my living room","Latitude":"38.253098","Source":"MUFON","trends":["There have been 15 other sightings in Fairfield","There were no other sightings in Fairfield on or around December 31st 1967"],"Country":"United States","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","City":"Fairfield","Longitude":"-122.032636"}