{"Tags":"City","Date Submitted":"03/19/2011 11:54 UTC","Object Shape":"Chevron","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-03192011-0015","map":"<A HREF = \"http://maps.google.com/maps?q=40.825039,+-91.156536(28302)&iwloc=A&hl=en\"> mufon case (28302) map </A>","Object Flight Path":"Hovering then path","Date of the Event":"02/15/1991 06:00 UTC","Latitude":"40.825039","trends":["There have been no other sightings in West Burlington","This sighting has never been favorited."],"Weather Factors":"None","Case Number":"28302","Object Features":"Undisclosed","Longitude":"-91.156536","divs":["Sighting DetailsI was with a friend driving at night from Middletown, Iowa to Burington on Route 34 East when we saw bright lights in the sky to the south. They seemed relatively close because they were so large and bright, and low in the sky. The object seemed to turn and we saw more lights that made it look like it was a huge V shaped craft with 3-4 lights in a straight row on each side of the V. We tried to follow it by getting on Route 61S and heading toward airport but we lost sight of it due to trees. We drove all the way to the airport and parked and watched to see if it would reappear and it didn't. When we first saw it we thought it was some sort of airplane, but the way it hovered made that impossible. So we considered it might be a helicopter but when it turned and we saw the V shape we both agreed it must be a UFO. I was excited, not afraid. My friend seemed to share my excitement but may have been scared. We both wanted to follow it. When it turned south it moved slowly then increased speed but was still not going very fast. We were able to see it for nearly 10 minutes from first sighting when we pulled onto shoulder for about 5 minutes, then as it moved and we followed it for what seemed like 5 minutes or so. It was 20 years ago so I am not totally sure about the date and time."],"Disposition":"Unknown","Region":"Iowa","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/28302.html.txt","/var/www/straped/mufon/org/28302.html"],"Summary":"driving on Rt. 34E looking S toward airport saw string of 3-4 large lights floating in sky, rotated and headed S toward airport showing more lights and V shape","City":"West Burlington","Source":"MUFON"}