{"trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around March 18th 2011"],"Source":"MUFON","Tags":"City","divs":["Sighting DetailsIt was between 8 and 9pm Arizona time, I went out back to have a smoke. My husband decided to stay in. Since I was alone I decided to get my binocculars and gaze at the beautiful full moon. There were patchy streaks of clouds passing the moon. The clouds were not very dense and I could clearly see the features of the moon through them. As I was gazing, I saw a small black shape to the east of the moon. I blinked a few times, as I thought perhaps it was an optical illusion. The black shape appeared triangular. The object was flying within the clouds. It was very close to the moon but did not pass in front of the moon. A few seconds later I then saw the black object come from just below the moon on the lower east side and sweep across to the west side of the moon. The cloud it was in was brightly lit by the moon. The object stayed within the halo of light around the moon. I could still clearly see crators on the moon. After the object swept just below and to the other side of the moon I was able to see it for a good 5+ seconds. At this moment the shape of it appeared more elongated. When it reached the western side below the moon it made a short upward sweeping motion and rotated at the top of the upward sweep. As it rotated it then swept back downward and slightly westward. It started to level back out, still just below the moon, then it was just gone. For size referance... Using a quarter as the full moon, the black craft first looked to be the size of a pencil lead tip viewed straight on. Then as it turned it was the size of the pencil lead viewed from the side. I would not of seen the object if I wasn't using binocculars. The object looked solid and had a sharp contrast against the lit cloud. I watched a little longer and kept going back out but never saw it again. There is one other odd thing, a few min after the object dissapeared a military jet came from the directon of Luke AFbase and crossed directly in front of the moon. It was going faster than other planes in the sky and was headed east. The jet was not flying on any of the usual air trafic routes."],"Case Number":"28307","Date of the Event":"03/18/2011 12:00 UTC","Object Flight Path":"Path with directional change","Latitude":"33.450877","Weather Factors":"Lightning, Light","City":"Phoenix","Region":"Arizona","Summary":"Watching clouds as they passed full moon, saw a dark triangle near moon.","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-03192011-0020","Viewing Distance":"Unknown","Longitude":"-112.066337","Date Submitted":"03/19/2011 02:57 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.450877,+-112.066337(28307)&iwloc=A&hl=en\"> mufon case (28307) map </A>","Object Shape":"Square, Rectagular, Triangle","files":["/var/www/straped/mufon/html2text/28307.html.txt","/var/www/straped/mufon/org/28307.html"],"Disposition":"Unknown"}