{"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Region":"Illinois","files":["/var/www/straped/mufon/html2text/28303.html.txt","/var/www/straped/mufon/more/28303_submitter_file1__03142011UFOPic23_14_20118_08PM_0001.jpg","/var/www/straped/mufon/more/28303_submitter_file2__03142011UFOPic3_14_20118_09PM_0001.jpg","/var/www/straped/mufon/more/28303_submitter_file3__03142011UFOPic33_14_2011MayanUFOGuttergawker.jpg","/var/www/straped/mufon/org/28303.html"],"Date of the Event":"03/14/2011 07:00 UTC","Country":"United States","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.882836,+-87.81194(28303)&iwloc=A&hl=en\"> mufon case (28303) map </A>","Latitude":"41.882836","Object Shape":"Chevron, Diamond, Fireball, Sphere, Square, Rectagular, Triangle","Disposition":"Hoax","City":"Forest Park","Weather Factors":"Unknown","Case Number":"28303","Log Number":"US-03192011-0016","trends":["There have been 15 other sightings in Forest Park","There were no other sightings in Forest Park on or around March 14th 2011","This sighting has never been favorited.",""],"Source":"MUFON","Summary":"HD Photos and Video Red Shape Shifting Red UFO Chicago 3/14/11","divs":["sighting detailsi watched a red ufo shape shift and mimic a airplane or helicopter for close to two hours starting at 6:55 pm cdt on the night of 3\\14\\2011 in forest park near chicago. it flew in a w, n, e, s rounded off square pattern in the sky and the lights would change color and configuration the sound of the craft flying over head changed to. search *(link moved to additional evidence section-cms\\sg) on youtube for the video. i attached some enlarged and enhanced to see better still frame photos from the video. pic number 3 looks like the ufo flew off the mayan calendar. the images are quite remarkable imo. if it was a helicopter is sure was quiet and if it was a plane it did not have the proper required faa aircraft lighting. it was around for a while so i am sure other people saw it i just don't think they knew what they were looking at since it tried to fake and perpetuate itself as a regular airplane. the ufo may have been searching for something by how it moved. hopefully someone else saw it and report it as well. 2012 is getting close from the looks of it these things will be getting closer as they show more frequently. thanks for reading."],"Object Flight Path":"Undisclosed","Date Submitted":"03/19/2011 12:07 UTC","Longitude":"-87.81194"}