{"Sighting Duration":"Undisclosed","Case Number":"28304","map":"<A HREF = \"http://maps.google.com/maps?q=41.691281,+-86.246607(28304)&iwloc=A&hl=en\"> mufon case (28304) map </A>","Source":"MUFON","Region":"Indiana","Tags":"City","Date Submitted":"03/19/2011 12:48 UTC","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around March 18th 2011"],"Viewing Distance":"Unknown","Weather Factors":"Windy","City":"South Bend","files":["/var/www/straped/mufon/html2text/28304.html.txt","/var/www/straped/mufon/org/28304.html"],"Disposition":"Unknown","Country":"United States","Latitude":"41.691281","Summary":"Loud humming noise did not sound like known aircraft","Object Shape":"Unknown","Object Flight Path":"Hovering then path","Object Features":"Undisclosed","Date of the Event":"03/18/2011 11:44 UTC","Longitude":"-86.246607","Log Number":"US-03192011-0017","divs":["Sighting DetailsAround 11:PM there was a loud noise that sounded like a loud wind throuh the trees or a train off in the distance but i know both these noises and it wasnt them. It lasted only a minuite that i can recal and sounded like it was above my house. And then abrubtly stoped. But it was strange cause it didnt start off with a slow growing noise it was loud right from the start(it was as loud as a house hold sweaper) so that made me think \"this is not a air craft\" because there is a millitary base not far from here and it didnt sound like anything from there. And the train tracks about 2 miles away and they dont make that kind of noise, all of the sudden like that, also i didnt hear the horns like i normally do. The sound did not pulsate, is was a long low hum that. I was not able to see it and i did not see any bright lights from the window. I missed it, because the sound came from my front door and by the time i got there it went back towards my room and it went west and then slowly got quite, but at the same time abrubtly stoped. like of some one was to turn down the volume and then the radio shut off before it got all the way quite, if that makes any scence. Other information from this morning at about 3:00 AM, one my neighbors accross from my house(unsure who) shot off at lease 30 shot with his gun. Its not hunting season and he normally doesnt shoot his gun its my other neighbors that do. 5 AM a cop had his lights on and was looking for something, he didnt have any one pulled over and was near the bridge by my house. next time it happends im recording the sound, it was so out of place."]}