{"Tags":"City","Date Submitted":"03/19/2011 02:38 UTC","Longitude":"-75.334957","Disposition":"IFO","trends":["There have been 12 other sightings in Quakertown","There were no other sightings in Quakertown on or around August 20th 2010"],"Date of the Event":"08/20/2010 10:19 UTC","City":"Quakertown","Region":"Pennsylvania","Object Features":"Unknown","Object Flight Path":"Other","divs":["Sighting DetailsI was sitting in the passenger seat of my fiancee's car. We were literally 10 feet from pulling into our driveway when a green light from the drivers side caught the corner of my eye. It resembled a \"glow stick\" or fireworks which was my first thaught as to what it may be. The only problem is that it was falling downward on an angle, at a very fast speed and started from very high up. I turned my head and moved my neck to see around my fiancee's head and out her window, but the object was gone. My fiancee immediatly asked \"you seen that too?\" I said yes. She, however, seen a differnt color, a discription she was so firm on that it almost sparked an argument, because I am sure the object was green.(is that common in sightings?) Before an arguemnt happend though, we turned the car around and drove up the road a little to the point where we both agreed the object may have touched gound. Of course there was nothing there and we just went home for the night. Though I have held an intrest in UFO from youth, my fiancee has not and imeadiatly dismissed any supernatural origins. I only come forward now after watching an episode of the series \"UFO's over earth\" in which MUFON investigates a \"flap\" in bucks county, something I was completly unaware of until watching this TV show. I figure any info at all may help you guys"],"Weather Factors":"None","Log Number":"US-03192011-0019","Latitude":"40.447308","Object Shape":"Bullet, Missile, Fireball, Flash","map":"<A HREF = \"http://maps.google.com/maps?q=40.447308,+-75.334957(28306)&iwloc=A&hl=en\"> mufon case (28306) map </A>","Case Number":"28306","Country":"United States","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/28306.html.txt","/var/www/straped/mufon/org/28306.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Green Flash shooting downward from sky"}