{"Source":"MUFON","Object Features":"Appendage(s)","Summary":"I went out on my deck with my digital binoculars and shot a 9 fr/1second long autoseries of a UFO flying,","Date of the Event":"11/04/2003 10:15 UTC","Region":"Montana","City":"West Yellowstone","files":["/var/www/straped/mufon/html2text/28317.html.txt","/var/www/straped/mufon/org/28317.html"],"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Object Shape":"Cylinder, Square, Rectagular","Weather Factors":"Unknown","trends":["There has been one other sighting in West Yellowstone","There were no other sightings in West Yellowstone on or around November 4th 2003","This sighting has never been favorited.",""],"Country":"United States","Latitude":"44.662149","divs":["sighting detailson october 23, 2003 i attended the funai golf classic at disneyworld in orlando, florida and purchased a set of the new bushnell digital binoculars that had the capability of taking 72 1.2mp photos on its internal memory storage. and it had the capabilities of taking a series of shots for 1 second (9 frames) on the sports-action setting. these binoculars are a wysiwyg device that takes the photos with out the ability to change any settings (all-automatic). so i took all of the photos and when i returned to montana to my home i downloaded the 72 photos and cleared the memory. on the night of the 4th or 5th of november, 2003,i went out on my deck and i took a one second string of 9photos with the lens pointed up at approximately 45 degrees and due south. when i first saw the photos after downloading i thought i had left the lens caps on because it was just a black photo until i realized that the binos didn't have lens caps. when i opened up each photo then i saw the ufo. i had my brother take the photos to an eastern major university and his friend in the photo lab analyzed the photos and all of them show the same stars in them and the movement of the craft was most likely the beat of my heart which causes a slight movement effect that makes the craft look like it's jumping around. each photo is sequential and 1\\10th of a second long with approximately 8-10 millisecond shutter interrogation time for the lens to clear. i contacted the tech support division at bushnell and they gave me the info on the shutter speed and the rest of the specs. i need to send you the other six photos which shows the craft with multi-colored propulsion streams and then it stops and changes shape and then in the 7th frame the craft travels all the way across the sky and goes through a red gas cloud. and then in the next frame the red gas cloud is gone but it still shows two red light which are gone in the last frame. which means it covered the entire distance from where it was located in the sky and then travelled through the gas cloud during the 8-10 millisecond shutter interrogation time. how do i send the rest of the photos? thanks and please let me know how to send the rest. *(wit's name deleted--cms\\sg)."],"Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.662149,+-111.104109(28317)&iwloc=A&hl=en\"> mufon case (28317) map </A>","Tags":"City","Longitude":"-111.104109","Log Number":"US-03202011-0001","Case Number":"28317","Date Submitted":"03/20/2011 12:08 UTC"}