{"Sighting Duration":"Undisclosed","Region":"Florida","Case Number":"28319","Log Number":"US-03202011-0003","Tags":"City","Object Shape":"Circle, Sphere","Weather Factors":"Unknown","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around March 19th 2011","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Latitude":"27.968683","divs":["Sighting DetailsWe were at our friend's house on the water in clearwater, fl (Island Way Estates) facing the east taking pictures of the SuperMoon around 10:58 PM when I filmed these videos on my ANDROID phone using first the \"posterize\" filter (first two videos) and then back to the normal mode (last video). We saw these mysterious lights in the Eastern Sky just below the full moon. They were much brighter than appear on this video probably because the moon was so bright just above. It happened so fast I didn't think to switch back to normal mode at first, but when I realized it was in the \"posterize\" filter mode, I switched back to normal. I think you can tell that we were somewhat surprized and excited by this event having had no prior experience with such unusual phenomenon. It looked like flares floating in the air (attached to balloons or paratroopers?). There was no sound coming from them and they were drifting at about the same altitude moving from North to South just under the full moon if facing East. There was probably about 6 initially and then they turned off one by one or either drifted out of sight that way. We could not tell. About 20 minutes later I confirmed that the wind was blowing from North to South at I would say at about 8-10 knots. It looked as though they were over the waterway, so I am sure we were not the only people who saw them. There were a lot of tourists at the beach this weekend and most knew about the super moon."],"Date of the Event":"03/19/2011 10:59 UTC","Country":"United States","Source":"MUFON","Object Features":"Unknown","Object Flight Path":"Straight-line path","City":"Clearwater","Longitude":"-82.798193","files":["/var/www/straped/mufon/html2text/28319.html.txt","/var/www/straped/mufon/org/28319.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.968683,+-82.798193(28319)&iwloc=A&hl=en\"> mufon case (28319) map </A>","Date Submitted":"03/20/2011 02:03 UTC","Summary":"We were at our friend's *(Name deleted---CMS/sg) in clearwater, fl facing the east taking pictures of the SuperMoon around 10:58 PM when was these lights.","Disposition":"IFO"}