{"City":"Olney","files":["/var/www/straped/mufon/html2text/28325.html.txt","/var/www/straped/mufon/org/28325.html"],"Disposition":"Unresolved","Longitude":"-77.059233","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Object Shape":"Oval","Latitude":"39.158033","Log Number":"US-03202011-0009","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Olney","There were no other sightings in Olney on or around February 4th 2011"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailsit was 9:50 pm on 2\\4\\11, it was a cloudy night and i was driving to olney, md to go to work. at the intersection from fieldcrest road to route 108 i noticed what at first i thought was just a spot light hitting the cloud cover above. the light was going in a circular motion that looked much like when you see a spot light at a construction site being projected in the air. i thought nothing of it, stopped at the traffic light and i turned right on 108 to head towards olney md. after driving for a minute i noticed the light was in front of me again and i could see it moving in the same circular motion, covering a lot of ground as it made each complete circle and at the same time moving forward with each circle it completed, heading in the same direction towards olney. i put down my windows and heard no sound from above, the clouds seemed to be kinda low so my only guess is maybe a helicopter could have been above it shinning a spot light down and moving it in a circular motion while it was traveling the same direction i was traveling. however i do not feel this is the case since looking at the oval shapped light it seemed as if it was glowing and having some sort of mass rather then being just a point of light being projected from above. i really do not know what i saw however its characteristics such as the way it moved acrossed the sky was significantly different from a plane or a helicopter. why would an air craft make spiral like motions to move from point a to b? the object finally went out of my sights as it headed towards sandy spring, md. at that time i had turned into work. it was certainly an odd thing to see."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.158033,+-77.059233(28325)&iwloc=A&hl=en\"> mufon case (28325) map </A>","Date Submitted":"03/20/2011 12:13 UTC","Region":"Maryland","Source":"MUFON","Case Number":"28325","Tags":"City","Summary":"I saw a light above the clouds moving in a circular motion across a span of 6 miles","Date of the Event":"02/04/2011 09:50 UTC"}