{"Weather Factors":"None","Object Features":"None","Region":"Ohio","Date of the Event":"09/02/2008 07:38 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","City":"Marietta","Latitude":"39.420982","trends":["There have been 5 other sightings in Marietta","There were no other sightings in Marietta on or around September 2nd 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.420982,+-81.446144(28320)&iwloc=A&hl=en\"> mufon case (28320) map </A>","Log Number":"US-03202011-0004","Object Shape":"Bullet, Missile, Cigar, Cone, Cylinder","Summary":"Long Cigar/Cylinder Metallic Object noticed when sun reflected off of it above Marietta Ohio. totally silent, no exhaust","files":["/var/www/straped/mufon/html2text/28320.html.txt","/var/www/straped/mufon/more/28320_submitter_file1__skycruiser001.jpg","/var/www/straped/mufon/more/28320_submitter_file2__skycruiser002.jpg","/var/www/straped/mufon/org/28320.html"],"Date Submitted":"03/20/2011 03:13 UTC","Longitude":"-81.446144","Viewing Distance":"Over One Mile","Tags":"City","Disposition":"Unknown","Country":"United States","Case Number":"28320","divs":["sighting detailsmy friend and i were leaving the mounds cemetery in marietta, ohio around 7:30pm on the evening of 9\\2\\2008. while walking out i happened to look up and noticed this very long cigar\\cylinder shaped metallic object moving fairly quickly through the sky. it moved silently and left no exhaust. completely silent! at first i thought it might be a commercial airliner however, it had no wings like a plane. i did not notice any windows. as it streaked across the sky we followed it on foot then by car and tried to get a good picture. however, it was moving too fast and we lost it in the trees. it moved in a straight line across the sky and with no clouds and it being very sunny that day it was very noticeable with the sun beaming off of it. it was very shiny silver and metallic. i did happen to catch it two times with my camera and i will attach the pictures. they are unaltered- still original size. again this thing moved fairly quick, was very long and made absolutely no sound. left no exhaust as well. my feelings were of intrigue. i could not imagine what this possibly could be. maybe government\\military?? i still don't know how it could fly at the same altitude or a little lower than a commercial plane but it made no sound, left no exhaust, and had no wings!! we lost sight of it behind the trees. we rushed to the car and tried to track it down but couldn't catch up through town and lost it. it was heading in a southeast direction from marietta, ohio."],"Sighting Duration":"Undisclosed"}