{"Longitude":"-120.991478","Case Number":"28321","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.640867,+-120.991478(28321)&iwloc=A&hl=en\"> mufon case (28321) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-08042011-0075","Object Shape":"Boomerang, Triangle","files":["/var/www/straped/mufon/html2text/28321.html.txt","/var/www/straped/mufon/more/28321_submitter_file2__0317112128.jpg","/var/www/straped/mufon/more/28321_submitter_file3__0317112118.jpg","/var/www/straped/mufon/org/28321.html"],"Date Submitted":"08/04/2011 11:51 UTC","Summary":"Two UFO's one Boomerang, One Trainagular flying irratically","Region":"California","Viewing Distance":"101-500 Feet","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around March 17th 2011","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was leaving school with my girlfriend and we were walkng to my car. As we were approaching my car, we noticed what appeared to be an indigo blue light, that was very bright along with a teal light that I believed at the time to be a human aircraft, in the distance. It was far enough that it could be sen without major movement of our eyes or head. I started my car, and I felt more and more compelled to look at it. My girlfriend felt somewhat disturbed by it. I watched the set of lights twirl about the sky, both constantly but erratically change brightness levels. The indigo object then did something I had never seen before. It proceeded in a direction, got very bright, then completely disappeared, the reappeared a good ways behind its starting point, moving in the same direction. After this, I dismissed the indigo blue light as being conventional, and convinced my girlfriend that we should get closer to it. We drove deeper into the city following the lights which had stayed close together. The teal light then began to come into shape. It appeared to be far but somewhat large. It also had a set of light underneath it that came on and off randomly but were in the form of a triangle or delta. The craft would roll and flip occasionally completely disappearing and reappearing and the indigo blue dot would accelerate and decelerate covering distances at speeds I've only seen fighters cover. But the acceleration and deceleration were considerably sharper. During the drive the delta shape disappeared completely and did not return. Eventually I got up to right underneath the indigo blue object. It appeared to be somewhat large, much large than a fighter aircraft, but moved more than effortlessly. It was somewhat boomerang shaped. It seemed to be flat on the backside while having rounded front edges. It made absolutely no noise, and I observed it for the better part of about 3 to 5 minutes up close. It would float around, become difficult to see and then become bright again. the sky was clear so clouds were not an issue. It did however consistently pull a maneuver that closely resembled a Pugachev's Cobra. Flying is a stalled position. Because of previous commitments however I was required to abandon observation, however the craft was still moving about when I left. The light it created was very unique. At a distance it appeared indigo blue, however up close the light appeared similar to that of a black light but at the intensity greater than modern car headlights. I was able to take a few pictures with my cellphone camera and recreate what I saw loosely in 3D. The shape of it is represented however the the piercing light is not."],"City":"Modesto","Weather Factors":"Unknown","Tags":"City","Latitude":"37.640867","Country":"United States","Object Features":"Undisclosed","Date of the Event":"03/17/2011 08:00 UTC"}