{"divs":["sighting detailsmy wife and i were on the front part of our property taking night pictures of the super-close moon. we did not see the object with our eyes. it wasn't until we came in and put the pictures on the computer to process that we saw the light moving across the sky. we ruled out plane\\jet as we should have seen that with our naked eyes. there was no sound, but it was far away and very high. as you can see from the progression of the light it doesn't appear in the first photo, then starting with the 2nd it comes up from the tree line and goes up and to the right until it goes off the photo edge in the last picture. when it was enlarged we could see the different lights. they appear to be moving around the object in a rotating pattern. since we did not see the object until we processed the photos we had no reaction while it was going across the sky. but once we enlarged the object we could tell that it was not a plane or weather balloon. the lights make it a totally unknown object to us. perhaps you can help us out on what it could be? i am attaching 3 of 6 3000 high resolution photos showing the object in progression from beginning to end."],"files":["/var/www/straped/mufon/html2text/28326.html.txt","/var/www/straped/mufon/more/28326_submitter_file1__DPP_0013.JPG","/var/www/straped/mufon/more/28326_submitter_file2__DPP_0014.JPG","/var/www/straped/mufon/more/28326_submitter_file3__DPP_0015.JPG","/var/www/straped/mufon/org/28326.html"],"Longitude":"-96.290528","Country":"United States","Latitude":"30.535621","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Disc","Source":"MUFON","Date of the Event":"03/19/2011 08:30 UTC","Weather Factors":"None","Disposition":"IFO","Log Number":"US-03202011-0010","Sighting Duration":"Undisclosed","Summary":"While taking pictures of the full moon we captured a lighted object going across the sky.","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"28326","Object Features":"Unknown","Region":"Texas","City":"College Station","Date Submitted":"03/20/2011 01:21 UTC","trends":["There have been 10 other sightings in College Station","There were no other sightings in College Station on or around March 19th 2011","This sighting has been favorited 1 time.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=30.535621,+-96.290528(28326)&iwloc=A&hl=en\"> mufon case (28326) map </A>"}