{"Region":"Colorado","Viewing Distance":"Over One Mile","Date of the Event":"03/20/2011 08:25 UTC","trends":["There have been 11 other sightings in Broomfield","There was one other sighting in Broomfield on or around March 20th 2011"],"Latitude":"39.925931","Country":"United States","Object Features":"None","Case Number":"28337","map":"<A HREF = \"http://maps.google.com/maps?q=39.925931,+-105.08107(28337)&iwloc=A&hl=en\"> mufon case (28337) map </A>","Log Number":"US-03202011-0021","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28337.html.txt","/var/www/straped/mufon/org/28337.html"],"Disposition":"Unknown","Weather Factors":"Windy, Does Not Apply","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Three red lights hovering in the Northeast skys of the front range North of Broomfield Colorado","divs":["Sighting DetailsI was standing outside on the front porch of my home looking Northeast in the skys. I noticed 3 red lights at first in the North sky moving in a line and equally apart in distance but moving very slowly towards the Northeast sky. My first impression was they were helicopters hovering over the area but I could not understand why all 3 lights were red only. As they reached directly Northeast of my sight they stopped moving. They probably sat in this position for about 5 minutes then two of them slowly and I mean very slowly continued on Northeast but they did not stay in a straight line to each other. One was in a slightly higher position then the other. The third red light stayed where all three had stopped earlier but slowly moved a little higher in the sky at that position and just stayed there. Eventually after 15 minutes of watching them one of the two red lights that continued further Northeast the lower red light just disappeared. The other two the one still directly in front of me and the other higher red light of the two that went further Northeast continued to shine. But shortly after the first red light disappeared about 2 or 3 minutes later the two remaining red lights at the same time disappeared. I did not hear any noise from them this could be they were to far out in distance from me to be able to. They did not appear to be helicopters as I had thought initially. Where I live I see helicopters daily flying around my home but at night they have white lights on when approaching a small metro airport just south of my home where they have a helicopter training school. I can not explain by the way the moved and did not move what exactly they could have been other than possibly some kind of military exercise of some short using only red lights on their craft which I do not think is legal to do in an area of the sky that is used heavily as a flight path for landing at Denver International Airport. There were no commercial aircraft in the area at the time of the sighting. There were two other witness with me. The only issue with them as witnesses is that they had been drinking all day. I first saw the lights and then ran back into the home to get them to come out to see what I was seeing. One stayed with me until we both saw all the lights disappear. I do not drink I was clearly aware of what I was seeing."],"Object Shape":"Star-like","Date Submitted":"03/20/2011 11:44 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-105.08107","City":"Broomfield"}