{"Date of the Event":"03/20/2011 08:30 UTC","Longitude":"-105.08101","Tags":"City","Summary":"flashing red lights","trends":["There have been 11 other sightings in Broomfield","There was one other sighting in Broomfield on or around March 20th 2011"],"Latitude":"39.924651","map":"<A HREF = \"http://maps.google.com/maps?q=39.924651,+-105.08101(28338)&iwloc=A&hl=en\"> mufon case (28338) map </A>","Log Number":"US-03212011-0001","Object Shape":"Circle, Flash","Case Number":"28338","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/28338.html.txt","/var/www/straped/mufon/org/28338.html"],"Region":"Colorado","Source":"MUFON","Date Submitted":"03/21/2011 01:36 UTC","City":"Broomfield","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was at work went on brake, i was talking to my wife on the phone when i got in to my car and looked up and to my east and saw 4 lights in a diamond pattern in the sky. 4 flashing red lights. they was just hoovering there, I told my wife to look turds my work and tell me if she sees any thing. as i was running to the door to get my co workers to see this. my boss came out and saw them just as they we moving in to a strait line. he said they was choppers. I pointed out to there was only a red light, no other colors.he called the other workers out. I was telling my wife what i was seeing. they started moving north east at a very slow pace. there was no sound, and there was no other air craft in the area, as they moved north they seemed to spread apart from each other, one heading more east then north.then the lite farthest from me just vanished.the other 3 kept moving north east, it took about 3 min before my wife said she could see them from Brighton, which is 16.4 miles north east of my work.she had my night vision scope looking at them.as she told me she could see them they flashed 2 times and vanished like the first one did.they seemed to move north and east and stop at times then move north east again."],"Viewing Distance":"Unknown"}