{"Summary":"Large low to the ground slow moving disc.","Log Number":"US-03202011-0020","Sighting Duration":"00:15:00","Longitude":"-95.22978","divs":["Sighting DetailsI lived across the river from my job. Where I worked as a late shift rep. for a cable company. I left my house to go to my job by walking across the 6th street bridge. As I walked across I looked at the water as it ran over the dam. About half-way across I got a feeling that I needed to look up. When I did I ducked thinking something was falling from the sky. Then noticed that what I thought was falling was slowly moving stright across. It was a large flat black disc. That made no sound. Had no lights that I could see. It had no seems or rivet marks. It looked like looking at the bottom of a large bowl. I was in like shock just staring at it. I thought to my self I can't be seeing what I'm seeing. And noone is going to belive me. So I looked around to see if there was anyone else walking or driving by that could see this too. But there was noone around just the sound of the water was all I could hear. I stood there just watched as it followed the river down stream. It got down the river a good distance when it took off in a flash at an angle and disappeared. I got to work and told two of the guys that I worked with that I just saw a big UFO and they just laughed. The only reason I know the date so well is because it was the day before my birthday."],"Object Features":"None","Case Number":"28336","Region":"Kansas","Latitude":"38.976199","Object Flight Path":"Path with directional change","City":"Lawrence","files":["/var/www/straped/mufon/html2text/28336.html.txt","/var/www/straped/mufon/org/28336.html"],"Date Submitted":"03/20/2011 11:17 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.976199,+-95.22978(28336)&iwloc=A&hl=en\"> mufon case (28336) map </A>","Object Shape":"Disc","Country":"United States","Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"09/06/2009 09:30 UTC","trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around September 6th 2009"],"Disposition":"Insufficient Data","Source":"MUFON"}