{"Log Number":"US-03202011-0015","Weather Factors":"Unknown","Region":"Oregon","Date Submitted":"03/20/2011 03:59 UTC","Country":"United States","trends":["There have been 3 other sightings in Canby","There were no other sightings in Canby on or around February 24th 2011"],"Case Number":"28331","City":"Canby","Source":"MUFON","Longitude":"-122.690348","Latitude":"45.268864","map":"<A HREF = \"http://maps.google.com/maps?q=45.268864,+-122.690348(28331)&iwloc=A&hl=en\"> mufon case (28331) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Tags":"City","Object Flight Path":"Path then hovering","Object Shape":"Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/28331.html.txt","/var/www/straped/mufon/org/28331.html"],"Disposition":"Unknown","divs":["Sighting Detailsfor the past six months i have been going to said address to watch and care for my g-ma. at night before i go to bed, i usually go outside, walk the property, smoke a cig then go to bed. Well that night it was really clear out. so i took a few extra minutes to check out the stars and stuff. It was a gorgeous night that night. about halfway done with my cig, i looked southward because a bright light caught my attention. It looked like a clear xmas bulb. it came from the south, cleared the treeline behind my house. In my field of view( lookin south) it appeared in the south then kinda started to go from my right to my left. As it was doing so it dimmed then brightened 2 or 3 times very slowly. It was absolutely silent! If i went to grab a camera i would have missed it! i was fixated anyway. when it was about to float 100 ft in front of me and slightly to my left, I yelled HEY!!! 3 times and opened my arms up. when i did that, it circled me slowly one time then shot off so fast i couldnt believe it!!! I will admit that i already subscribe to the ancient astronaut theory and i do believe that life must exist elsewhere. This \"light\" was so silent and dimmed and brightened 3 times very slowly it was about 50 feet of the ground. Now i am a definite believer that we are being visited."],"Summary":"bright clear xmas bulb silently clears the treeline and circles me once then shot off","Date of the Event":"02/24/2011 12:00 UTC"}