{"Log Number":"US-03202011-0017","Object Shape":"Circle, Disc, Sphere","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Waterville","This sighting has never been favorited."],"Longitude":"-83.71827","divs":["Sighting DetailsI was working second shift at the time, coming home around 1 - 2AM. It seemed when traveling south on the Anthony Wayne Trail, right before hitting Waterville, I would see the same light above the tree line on my left. It was a white light, about 60-80 feet in the air. I never thought about it again, until it was the third night in a row I had seen it. This night was slightly different, however. The light slowly went from the east side of the trail to the west side, into the suburb of waterville. I took the way I normally went home, turning onto Canal rd., then left onto Wilkshire. As soon as I turned onto wilkshire, the light was hovering (estimate) about 60 feet off the ground, right above me. I pulled over, and got out of my car. I was staring at the light, trying to grasp what it was. It was dead silent outside, I initially thought it was a helicopter, but to my suprise, silence. This is a small community, and there is little to no traffic after 11pm. I would say I was there about 2-3 whole minutes, with the light not moving at all. Then, the light started moving southbound on wilkshire. I followed it through Waterville, and starting going out to the country. It started moving faster and faster away, but I was able to track it. I was going about 80mph, until I hit a stopsign. The light shot across the road again, and went into, what I thought was the field about 100 yards away. It lit up the whole area and you could see it come close to the ground, lighting up the ground, and then nothing. It completely disappeared. No sounds, nothing, just gone. I sat at the stopsign for about a minute, and went home. The next night, the light was not there anymore on my drive home, and I had never seen it again. Upon telling this story, I do vaguely remember seeing this same light in the past coming home from church one night. I was young, and the parishoner who was taking me home, commented on it as well. The light was swinging back and fourth the country road ahead of us, and just vanished. The site of this incident was not far from the same field that the light disappeared from in the most recent sighting. Strange, i know."],"Case Number":"28333","Summary":"UFO Chase after several nights of seeing the same object","Source":"MUFON","Weather Factors":"None","Tags":"City","Object Features":"None","Date Submitted":"03/20/2011 08:53 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=41.500886,+-83.71827(28333)&iwloc=A&hl=en\"> mufon case (28333) map </A>","Country":"United States","Date of the Event":"06/11/2006 01:00 UTC","Disposition":"Unknown","Latitude":"41.500886","Region":"Ohio","City":"Waterville","files":["/var/www/straped/mufon/html2text/28333.html.txt","/var/www/straped/mufon/org/28333.html"],"Sighting Duration":"00:10:00"}