{"Object Shape":"Oval","Region":"Michigan","Object Flight Path":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/28344.html.txt","/var/www/straped/mufon/org/28344.html"],"Latitude":"45.062989","Country":"United States","Date of the Event":"09/01/1995 04:30 UTC","Disposition":"Unknown","Summary":"HUGE, Glowing White w/ faint swirling electrical lines-red yellow.orange green blue -silent","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"00:20:00","map":"<A HREF = \"http://maps.google.com/maps?q=45.062989,+-83.430773(28344)&iwloc=A&hl=en\"> mufon case (28344) map </A>","City":"Alpena","trends":["There have been 5 other sightings in Alpena","There were no other sightings in Alpena on or around September 1st 1995"],"Log Number":"US-03212011-0007","Weather Factors":"Unknown","Object Features":"Undisclosed","Longitude":"-83.430773","divs":["Sighting DetailsSept.1st 4:30a.m. my dogs started barking,not wanting them to wake up my friend I put them out. As soon as I got them out, I witnessed a HUGE glowing oval craft hovering 20ft. over the trees across the street from the end of my driveway about200ft. from where I was standing.Freaking out, I yanked the dogs back in the house, grabbed a gun, woke my friend up from a sound sleep& dragged her outside in her stocking feet. We both stood there & witnessed a craft so HUGE we could not see either end of it. It was glowing very bright white with faint swirling thin lines of red,yellow, orange,blue&green,like flowing electricity.It was just hovering silently 20ft. directly over the tree line. I was mortified-scared out of my witts.I was thinking WHO'S flying that thing? All my instincts were screaming get away from it-we were standing 200ft. from this thing that was bigger than a city block. We ran back in the house after only a couple minutes & I called 911! I told the officer what we saw & he gave me a MUFON #. I called the MUFON # & made a report. The MUFON guy told me that he had been getting the same reports from Indian River-45 miles from us for the last 10 days.He asked if it was still out there, my friend looked out the window & confirmed it was. I talked to the MUFON guy for about 10 minutes, he asked me to write out a report & send it in which I never did until now.I always regreted not watching it longer or seeing it fly away, but I've never been so scared in my life. I think about it every day since,seeing a UFO so close & so big has changed my life forever."],"Case Number":"28344","Date Submitted":"03/21/2011 10:25 UTC"}