{"Weather Factors":"Unknown","Region":"Minnesota","Sighting Duration":"00:00:59","Country":"United States","Disposition":"Insufficient Data","City":"Inver Grove Heights","Date Submitted":"11/30/1978 12:00 UTC","Object Flight Path":"Straight-line path","Summary":"lighter than air craft in IGH, MN","Tags":"City","Case Number":"2834","Latitude":"44.849572","Log Number":"","files":["/var/www/straped/mufon/html2text/2834.html.txt","/var/www/straped/mufon/org/2834.html"],"Object Features":"Undisclosed","Longitude":"-93.039005","Object Shape":"Oval","trends":["There have been 5 other sightings in Inver Grove Heights","There was one other sighting in Inver Grove Heights on or around November 30th 1978"],"Date of the Event":"11/30/1978 12:00 UTC","divs":["Sighting DetailsI worked at a department store in W.St.Paul. I didnt have a car, so my dad wasdriving me home when the sighting occurred. It was about 200 a.m. or a littleearlier. I cant recall the exact date. I know it was before Christmas becausewe worked unusually late due to the season. We drove East on 55th Street, thenturned South onto Cahill. We noticed bright lights like daylight shining intoour car. I commented to my dad that these street lights were really bright. Ilooked out the window to look at the street lights and I saw the bottom of thishuge oval shaped craft. It was quiet and floating about 200 feet above ground. I asked my dad what it was. He said he didnt know. I looked at the undersideof it for any airforce or military markings. I commented to Dad that I hope itsnot a Russian spy blimp. There werent any markings like a tail number. Wediscussed that it could be a UFO, and laughed about the odds of us seeing a UFO. Lights were shining down from the bottom of it, almost like search lights, butthey illuminated the entire area under it. When it passed over our car, itseemed like we were in the dark even though there were street lights. I watchedit continue to float Northwest and I noticed how bright the ground below it wasilluminated. It disappeared over the horizon we were at the bottom of a hill soit went out of sight I think our radio stopped when we were under the thing. We were waiting to hear the news about what we had just seen and I recall dadpunching different stations trying to find news. We concluded that it was somesort of experimental military craft, but that was over 20 years ago, and Ivenever heard anything more about it. Its hard to recall exactly what it lookedlike because it was so long ago. I am quite clear about the bright lightsshining down on us and that it was huge -- probably 4 football fields. When Itold a friend about it, she made fun of me, so I have kept quiet about it. Dadand I havent discussed it for years other than when we decided it was probably asecret military aircraft. Did anyone else see it Id like to remain anonymousand keep this private, but Im really curious to see if anyone else saw this. Ive never seen anything like it before or since then."],"Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.849572,+-93.039005(2834)&iwloc=A&hl=en\"> mufon case (2834) map </A>"}