{"Log Number":"US-03212011-0009","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.046052,+-87.902154(28346)&iwloc=A&hl=en\"> mufon case (28346) map </A>","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Case Number":"28346","Summary":"Saw 4 saucers glide slowly and then take off in a flash.","Longitude":"-87.902154","files":["/var/www/straped/mufon/html2text/28346.html.txt","/var/www/straped/mufon/org/28346.html"],"Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Saturn-like","Region":"Wisconsin","Latitude":"43.046052","divs":["Sighting DetailsIt was either early winter or late winter (no snow on the ground) in late 1965-early 1966. I was 10. The weather was very overcast, sometime mid to late afternoon. One of those days that was just really dark all day, but not at or near sundown. I had just entered my bedroom when I had a strong feeling to look out my window to the south. I saw four glowing saucers lined up at an angle seeming to glide to a stop and then took off in a split second in an \"S\" curve to the east. They were bright as car headlights look like on a rainy day, and the s shape burned into my vision for several minutes. I could see that the center of the classic saucer shapes was glowing with a slight golden tint, could see the contours of the rest of the shape on either side of the lighted part. It all took place in 1-2 seconds. They were located a little under a mile directly south of my house, probably over Alverno College, near Morgan Avenue in Milwaukee WI. After I came to my senses (no missing time that I remember) I went downstairs to tell my dad \"I think I just saw a ufo.\" He looked at me a little frightened, either because he'd seen something too, or maybe he thought I was crazy. I was into ufos and paranormal phenomena from a very young age, loved science fiction and ghost stories, and I realized as I told him about what I saw that he thought I was seeing things. His response was \"You're just imagining things.\" But he had this weird look on his face. I have made several reports in the last few years, yet this is my first sighting; maybe I finally was able to condense the information to write it in a few paragraphs. This sighting was pretty damn close, I was wondering if anyone else saw this? Am trying to recreate the incident using Photoshop. Will send when completed."],"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","City":"Milwaukee","Date Submitted":"03/21/2011 08:40 UTC","Date of the Event":"02/28/1966 03:02 UTC","Object Flight Path":"Undisclosed","trends":["There have been 35 other sightings in Milwaukee","There were no other sightings in Milwaukee on or around February 28th 1966"]}