{"Log Number":"GB-03222011-0008","Object Shape":"Unknown","Case Number":"28356","files":["/var/www/straped/mufon/html2text/28356.html.txt","/var/www/straped/mufon/org/28356.html"],"Weather Factors":"Unknown","Longitude":"-3.17091","Country":"United Kingdom","Source":"MUFON","Date Submitted":"03/22/2011 06:09 UTC","Latitude":"51.488021","Date of the Event":"03/18/2011 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.488021,+-3.17091(28356)&iwloc=A&hl=en\"> mufon case (28356) map </A>","Region":"Wales","Sighting Duration":"00:02:00","Summary":"Orb morphing into fake plane","Object Flight Path":"Undisclosed","City":"Cardiff","divs":["Sighting DetailsSo I was standing in the back garden of my house for about half an hour since 8pm, and it was a clear, calm, mild night. I thought at first I witnessed a shooting star in the West South West direction as I was standing by the back door of my house. I thought, 'did I just see a shooting star? or was it just the bright star to the left of Orion which was in the vicinity of West South West too'. I also heard one dog barking nearby just prior to witnessing this object. Not too long after this, I believed that I saw something round, shining or brightening up in the distance. I believe it was yellowish-orange in colour. I first thought it was just a chinese lantern rising up but I wondered how it would move with zero wind, and why is one floating about in March, that's why it got my attention. I felt sure that I witnessed a yellowish orb powering up or brightening up in the distance. Anyway, something kept my attention so I made sure I paid attention to what it might do next. I believe the actions and motions of the object made a steady motion towards me, in a straight line probably at a height of about 200 -300 feet, speed about 40 mph I would guess, and perhaps it descended slightly in height over its trajectory. At some point from watching this, I became aware that the object had changed or morphed into what I would describe as a light aircraft. I also heard the sound of what seemed to be an engine. I would describe this sound as a drone noise as opposed to a piercing or vibratory noise which I believe a real light aircraft would emit. I clearly remember that this object had a long, cylindrical light or beam, I believe in its centre, from front to back. I think it was white, or maybe light turquoise. I also remember one light flashing which may have been yellow. It may also have had a small side light on each wing, I don't know the colours. I sincerely cannot recall what shape it was, because I was surprised at the long thin white beam on the object, so I do not want to hazzard a guess. The object came over just to the left of my house, perhaps 100-150 feet above the ground. I just watched it fly past thinking, 'no way is that a plane, that is NOT a plane :)'. Then I quickly moved to see if I could follow its trajectory as it passed by. I would say it went at a fair speed, say 40-50 miles per hour. I believe it covered a distance of about 1.5 to 2 miles from its start point to when I lost sight of it. My feelings as I saw this was just that there was something not quite right about this scenario. one, because it was supposedly a light aircraft flying low over my house, and two, it was mid evening. So as it came nearer to my house I thought with a smile 'no way can this be a plane'. When I thought it could have been a UFO, I got a little anxious and nervouse at that point. I wondered if it could have been an A.I. controlled object, whether it knew I was standing below it, or even whether it put on some display for confirmation, I cannot answer the real motive here. Other than what I have described I had no other reactions. I had a wry smile on my face watching it. So absolutely no telepathic communication going on, no electrical or radiological discharge or anything, no tractor beams, fancy light display, no missing time (I believe) or timelessness, no altered or heightened state like love or fear etc. I finally lost sight of the object because it disappeard into the darkness in about 5 seconds. I don't know if it literally vanished, went invisible or shot off into the sky. I just can't believe noone else may have seen it. So what I remember most of all is this long thin white beam on the object and one flashing light, maybe yellow, and of course the sound of a light aircraft passing close at low altitude over my house. I cannot remember the shape of the object, nor the size, perhaps it was the size of a light aircraft. The frustrating thing was, I did not have any instruments at hand to record it, view it or even signal to it. It caught me completely off guard. So I have no video or still photo as further evidence."],"Viewing Distance":"Unknown","Tags":"City","Disposition":"Unresolved","trends":["There have been 7 other sightings in Cardiff","There were no other sightings in Cardiff on or around March 18th 2011"],"Object Features":"Undisclosed"}