{"Disposition":"Unknown","Object Flight Path":"Path with directional change","Weather Factors":"Windy, Fog, Light","files":["/var/www/straped/mufon/html2text/28355.html.txt","/var/www/straped/mufon/org/28355.html"],"Region":"Iowa","Object Features":"Other","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around March 22nd 2011"],"Summary":"Lost Black Flying Wing Faking as Passenger Jetliner.","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-03222011-0007","map":"<A HREF = \"http://maps.google.com/maps?q=41.602715,+-93.601906(28355)&iwloc=A&hl=en\"> mufon case (28355) map </A>","Object Shape":"Boomerang, Triangle","Tags":"City","City":"Des Moines","divs":["sighting detailsbetween mile marker 61 and 62 south of des moines, iowa and north of iowa\\missouri state line where i am driving south on interstate 35. i noties low level lights of what at first look like a approching passenger airline flying low from a southeast flight path and heading northwest at a 45 degree angel north to interstate 35. the craft was about 300 feet above the tree tops and flying very slow as if on a landing approch. it had non-blinking white lights on the ends of each tip of what at first look like wings and had two very large spot lights where the nose landing wheels should be, but the flood lights were not spoting forward like normal airliners. this was my first indication this was not a normal jetliner. as the craft slowly approched 35, about 200 feet before the craft would had crossed over interstate 35 and over me, the craft quickly turned off the forward flood lights and made a hard bank right turn away from the highway (as if the pilot was saying \"opps! wrong runway!\"). when it banked i could see it was not a passenger airliner but a black triangle shaped flying wing with a boomerang shape leading edage. i would say it was a very large craft with a 250 to 300 feet wing span and about 325 to 350 feet long. the structure was not made from metal but more like a black dull composite fiberglass. it slowing flew away at a 45 degree angel northeast and i could see it had no vertical stabalizer nor any exhaust or sound from any engines. the side white marker lights never turned off but now i could see a set of red anti-collision light blinking off-center to the right of the flying wing as it flew away. i watch the flying wing make slight flight path ajustments as if they where looking for some new place to land. i noted the time of 5:54am and keep driving south on 35."],"Viewing Distance":"101-500 Feet","Case Number":"28355","Date Submitted":"03/22/2011 04:48 UTC","Longitude":"-93.601906","Date of the Event":"03/22/2011 05:50 UTC","Latitude":"41.602715","Source":"MUFON"}