{"Summary":"outside on apartment patio(second floor) saw object with colored lights flashing around perimeter","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsWell I have been seeing these objects for the past 6 months or more. They are usually just far enough away to question whether or not they are UFOs but last night this one was closest it had ever been...Just about a day after I submitted my report on spinning orbs the object shows itself to me. Its almost as if its letting me know its there because soon after I turned back to look at it over my left shoulder(my back was to the wall with the left side of my face to the outside of my patio) it totally disappeared. I turned to look at it about four times in a total of 5 minutes. I was feeling very uncomfortable so I went to let the dog out of my childs room to stay with me. I had woke my child when I opened the door and asked if he would come lay on a pallet near my bed. He knows i see these and he has seen them but cant confirm what they are either..As he got up I opened patio door to see if it was still there and of course it was but twice as far away SW direction of sky. Just reappeared there. Scares me a little but very curious about them..A cop in the town right next to us(where my kids go to school) reported the same thing some months ago??????"],"Object Features":"Undisclosed","Log Number":"US-03222011-0010","Object Shape":"Disc, Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.740087,+-97.101126(28358)&iwloc=A&hl=en\"> mufon case (28358) map </A>","Source":"MUFON","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around March 21st 2011"],"Date Submitted":"03/22/2011 08:28 UTC","Latitude":"32.740087","Sighting Duration":"Undisclosed","Case Number":"28358","Longitude":"-97.101126","Date of the Event":"03/21/2011 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/28358.html.txt","/var/www/straped/mufon/org/28358.html"],"Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","City":"Arlington","Region":"Texas"}