{"Weather Factors":"None","Tags":"City","Object Flight Path":"Stationary,Other","Date of the Event":"03/23/2011 09:30 UTC","Case Number":"28375","trends":["There has been one other sighting in Eloy","There were no other sightings in Eloy on or around March 23rd 2011"],"divs":["Sighting DetailsThe top description pretty much covers it, I have seen these several times last year and reported once on this site. I don't know what it is, nor does anyone that lives around here. They are basically very large orange orbs that turn on and off, and don't move, they seem to do something like a hyperjump, if that makes sense, one turns off as another turns on, they don't fizzle out they just shut off instantly as another lights up, I have seen this phenomenon while it was still rather light outside, and you cant see anything when they shut off, no object, no smoke trail, nothing. This event was brighter than I have seen in the past, so I thought I would report it and see if anyone else has seen it. My In-laws also seen the tail end of the event but they will be heading back to Hawaii so I have not included them in the report, however if it turns out to be necessary I am sure they would talk with you."],"Region":"Arizona","Country":"United States","Log Number":"US-03242011-0005","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","Longitude":"-111.611716","Object Features":"None","City":"Eloy","Object Shape":"Circle, Sphere, Other","Latitude":"32.794773","Date Submitted":"03/24/2011 04:43 UTC","files":["/var/www/straped/mufon/html2text/28375.html.txt","/var/www/straped/mufon/org/28375.html"],"Summary":"Bright orbs that seem to jump around in the sky without moving, they seem to move instantly or teleport or something, hard to explain, it is like they multiple lights are playing leap frog and the one they jump over disappears.","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.794773,+-111.611716(28375)&iwloc=A&hl=en\"> mufon case (28375) map </A>"}