{"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=30.276553,+-97.738831(28379)&iwloc=A&hl=en\"> mufon case (28379) map </A>","Object Flight Path":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Date of the Event":"05/03/2010 12:00 UTC","Case Number":"28379","Longitude":"-97.738831","Summary":"Black Triangle with Amber Lights seen over Austin in Night Sky","files":["/var/www/straped/mufon/html2text/28379.html.txt","/var/www/straped/mufon/more/28379_submitter_file1__belgianufo.jpg","/var/www/straped/mufon/org/28379.html"],"Sighting Duration":"Undisclosed","Region":"Texas","divs":["sighting detailsthis is an update from a previously submitted report. on sunday, may 2, 2010 at approximately 9:40 p.m. my husband and i were on our way back to our home in southwest austin. while driving down latta rd. we both noticed two bright amber lights beneath a large object in the night sky. the lights appeared to be around 4-5 blocks in distance from each other. the entire end of the object that was closest to our direction was approximiately 200 - 300 ft. across. my husband stopped the car and we both stepped out to get a better look. the object continued to glide northward in the sky. the object seemed to be about 300 ft. from the ground and floated noiselessly. the object blacked out the night sky behind it. another car came up behind us so we jumped back in the car and turned back to follow the object but soon lost sight of it. the object did not bear usual markings of explained aircraft. we tried taking photos of the object with our cell phones but were unsuccessful. after scouring web sites i have finally come across an image of an object that looks like what we saw. the object that was seen by j.s. henrardi over belgium (triangle) looks exactly like what we saw here in austin. [link moved to additional evidence section\\cms\\tg]"],"trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around May 3rd 2010","This sighting has never been favorited.",""],"Country":"United States","Date Submitted":"03/24/2011 11:42 UTC","Weather Factors":"Unknown","City":"Austin","Latitude":"30.276553","Tags":"City","Log Number":"US-03242011-0008","Object Shape":"Triangle","Viewing Distance":"Unknown"}