{"Weather Factors":"None","Log Number":"US-03242011-0006","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.0355,+-74.955915(28376)&iwloc=A&hl=en\"> mufon case (28376) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI am not sure of the exact date, but it seems around the fall of 1976. While returning home from grocery shopping around 8:30-9:00PM with my mother, I was traveling south on RT.130 and crossing the bridge over the Rancocas Creek near Bridgeboro Road when my mother, who was sitting in the passenger seat, noticed and brought to my attention something sitting above the water in close proximity next to the bridge on her side of the car. I slowed up, after checking that there was no traffic behind me, and there was none on the bridge at all, I almost brought the car to a slow stop as I approched the top of the bridge and noticed, through the front windshield and to my right, a craft of some kind within 200' of the right side of the bridge, just hovering in a stationary position about 70' above the waters surface. It stood there motionless with no apparent sound emanating from the object. The windows of the car were closed, but if it were a helecopter that close I'm sure we would of heard the sound and probably would of felt the buffeting effect from the rotors. As I observed the the object through the front windshield I could clearly see that the object was round in shape and typical of what would be described as a \"flying saucer\" in description. Even though it was dark out, it was round in shape with a gray color metallic surface. The exterior of the craft I could discern, because there was a series of lights, that were yellowish in color around the circumference of the craft that sort of glowed around the crafts surface so I was able to make out the features of the craft. There was a round lower bottom section of the craft, then another smaller diameter round section on top of that bottom section that had a series of lights in a row around it with what appeared to be a dome shape above that section which appeared to be transparent with some kind of windows that went around the dome. It appeared that I could see a figure or a form of something in the dome section of the transparent dome bubble top. The craft appeared to be about the size of a trailer which a tractor trailer would pull. The object then started to slowly ascend and as it did the lights seemed to rotate around the craft and the faster the craft ascended the lights seemed to rotate faster. The object ascended and crossed slowly over the bridge in front of us and headed east and appeared to follow the creek. At this time, as it crossed over the bridge, I was still moving slowly forward in the car. As it moved from my right to my left over the bridge, I got my last look of it behind and to my right as it appeared to follow the Rancocas Creek. This was a very frightening experience for the both of us and something that is just as vivid today as it was that night. I was told, latter that week, that there was a newspaper article, which I did not see, that was published the following day about an unexplained object that was seen near Lumberton that same night. When my brother-in law approached me about writing this report, I told my boss about it and he said he had a relative who lives near the Rancocas Creek in Lumberton and saw an object that same night near his home. I have his name as well."],"Source":"MUFON","Longitude":"-74.955915","trends":["There has been one other sighting in Riverside","There were no other sightings in Riverside on or around September 30th 1976"],"Disposition":"Unknown","Latitude":"40.0355","Region":"New Jersey","City":"Riverside","Object Features":"Dome, Window(s)","Date of the Event":"09/30/1976 08:30 UTC","Object Shape":"Circle","Case Number":"28376","Tags":"City","Date Submitted":"03/24/2011 08:55 UTC","files":["/var/www/straped/mufon/html2text/28376.html.txt","/var/www/straped/mufon/org/28376.html"],"Country":"United States","Viewing Distance":"101-500 Feet","Summary":"Observed unknown craft hovering next to bridge within 200'"}