{"Disposition":"IFO","Longitude":"-74.487103","Date of the Event":"11/30/2007 05:20 UTC","Object Shape":"Other","Date Submitted":"03/24/2011 11:44 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","Object Features":"Other","Case Number":"28380","Summary":"Similar to that of a comet. Leading was fireball with long tail.","map":"<A HREF = \"http://maps.google.com/maps?q=41.57676,+-74.487103(28380)&iwloc=A&hl=en\"> mufon case (28380) map </A>","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/28380.html.txt","/var/www/straped/mufon/org/28380.html"],"Latitude":"41.57676","Region":"New York","Sighting Duration":"Undisclosed","Log Number":"US-03242011-0009","trends":["There have been no other sightings in Wurtsboro","This sighting has never been favorited."],"divs":["Sighting DetailsIt was appoximately 3 years ago so time of day and month are a little foggy to me. I currently reside in town of Glen Wild New York. At the time I was employed at Outback Steakhouse in Miiddletown New York. I got ready for work was closing restaurant that nite so I was in little later that day. I was driving on route 17 headed to Middletown when I was drivin thru Wurtsboro Valley still in 17 when I noticed something out of corner of left eye. seemed like small comet, leading fireball with long tail. I then slowed down to get a better look at it when I saw it,dont know if u would call it crash,but disappeared quickly into swamp. Was some distance off approx 5-7 miles most and there was a mountain behind it so was able to to view entire thing til gone. It probably only lasted a minute or two. There was no impact explosion, was like it knew where it was goin. Never told anyone about cause didnt want all the jokes n all else that goes with it. After watchin your show on TV I thought maybe should tell you people, might be first time you could actually find something. No fake pictures of stuff to be examinedby yours there and our professionals. Just some swamp exploring, could probably pinpoint smaller area that 5 - 7 mile radius. Was pretty exciting, kind of like a small shooting star, but never saw one that close let alone crash or land however its termed. Would like to say for the record, do I know what it was, no. Did I see something I've never seen before with a finish that doesnt make sense, yes. It was goin wayto fast to stop that quick but yet no impact explosion of any kind. Just thought I'd share story n maybe help put an end to question, Are we alone?"],"City":"Wurtsboro"}