{"Longitude":"-79.01369","Tags":"City","Disposition":"Insufficient Data","Latitude":"35.766773","City":"Undisclosed","divs":["Sighting Details I Was out side looking at the stars and saw three objects with four lights just hovering they moved in like a flash movement and hovered agian. i've seen this several times before but never really paid this any attention untill i seen this several times it keeps me woundering if this is ufo activity. Being that fort bragg and camp mccall is near i was afraid to say anything about this. the ufo's would always be in diffrent places in the sky with the same type of activity a flah like movement and then hovering. I would go inside my house and look out the window and still see the ufo's. I was afraid so i would say to myself that's not a ufo so i would go to bed. the next night i was outside and saw the same thing agian. It is now 2011 and the month of june and july is comming so i may see these ufo's agian. i've lived here for eleven years and every once in a while i would see these objects winter and summer. what really made me notice the objects is when the lights flashed and the objects moved in a flash like movement. i thought that the objects were a military type of craft and i know a moving plane when i see it. These objects are always the same and the movements are the same."],"Country":"United States","Case Number":"28381","files":["/var/www/straped/mufon/html2text/28381.html.txt","/var/www/straped/mufon/org/28381.html"],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=35.766773,+-79.01369(28381)&iwloc=A&hl=en\"> mufon case (28381) map </A>","Region":"North Carolina","Date Submitted":"03/24/2011 11:55 UTC","Summary":"Two small crafts one large in the middle four lights on each red blue and yellowish orange","Log Number":"US-03242011-0010","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"05/31/2005 12:00 UTC","Object Shape":"Oval, Other","Object Flight Path":"Hovering then path","trends":[],"Weather Factors":"None"}