{"Sighting Duration":"Undisclosed","Latitude":"41.347339","Summary":"Ufo with face looking down","Disposition":"Insufficient Data","Date Submitted":"03/24/2011 12:56 UTC","Country":"United States","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.347339,+-88.838857(28385)&iwloc=A&hl=en\"> mufon case (28385) map </A>","Tags":"City","Date of the Event":"08/22/2010 02:52 UTC","Weather Factors":"None","Longitude":"-88.838857","Region":"Illinois","Log Number":"US-03242011-0014","files":["/var/www/straped/mufon/html2text/28385.html.txt","/var/www/straped/mufon/more/28385_submitter_file1__Familyphotos2472.JPG","/var/www/straped/mufon/more/28385_submitter_file2__Familyphotos2474.JPG","/var/www/straped/mufon/org/28385.html"],"divs":["sighting detailsafter a long day, i was sitting in a patio chair on my back deck, trying to relax,looking up at the night sky. i noticed a very bright what i thought was a star, but was changing colors, red,blue,white,green, and moving slightly at first then making strange patterns in the sky. i went inside the house and grabbed my digital camera, walking back outside i took a few pictures, and then decided to take video for the time that my camera allowed. i took video for about 4 minutes, and then it disappeared. i downloaded the video and pictures to my home computer, and viewed them and was not impressed with the quality. thinking no more about it till my home computer started to run slowly and purchasing a new one was the only option. i started to go through all the family video and photos and which one to save and put on my new computer, i came across the video\\pictures i took last august. i put them on my computer and with the new media viewer installed looked at the photos and zoomed in and to my shock i saw what looks like a star in the center of a swirling mass. the next photo is the same thing but with what looks like the profile of a face sticking out of the star shaped object. i was spooked to say the least."],"Case Number":"28385","Object Shape":"Star-like","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Ottawa","There were no other sightings in Ottawa on or around August 22nd 2010","This sighting has never been favorited.",""],"City":"Ottawa"}