{"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date Submitted":"03/24/2011 09:15 UTC","Object Shape":"Unknown","Case Number":"28390","Latitude":"29.428892","divs":["Sighting Details This happened around 1979 my mom was making dinner and asked me if i wouldn't mind driving down to the \"Mr M\" convenience store to get a few sodas for dinner and gas so she wouldn't have to do it in the morning.I drove down our street to Hunt Lane and made a right. i drove down to the store got the sodas and gas and started up hunt lane toward our street. between the store and our street is a small bridge and the drive is about half a mile. it was dark out around 8pm, on the right of the road is nothing but woods. i crossed the bridge and when i saw our street sign i was about to pull down the left turn signal and began to step on the brake when all of a sudden i heard this whistling noise up in the sky above and behind the car, then i heard a sound as if something metallic had fallen off the back of the car.Then this light shown down from above all over the car,i looked to my right and saw that the wooded area was all still dark so i knew that the light was only on the car.then it was gone and this all happened in a matter of seconds.i was freaked out and then noticed that the radio was blaring and the dash board lights were working(before this incident our dash lights and radio were not working)i looked up for the street sign and stepped on the gas a little then a little more then realized i was back on the other side of the bridge(that i had already crossed) i drove home and it wasn't till i got there that i realized the radio was still blaring. i called out my mom and she asked what took so long, a trip that should have taken 10min had turned into an hour. and don't even get me started about the dreams i began to have afterward. late-c"],"Longitude":"-98.492448","Source":"MUFON","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around August 31st 1979"],"Log Number":"US-03242011-0017","Summary":"MY UFO EXPERIENCE","Region":"Texas","Country":"United States","City":"San Antonio","map":"<A HREF = \"http://maps.google.com/maps?q=29.428892,+-98.492448(28390)&iwloc=A&hl=en\"> mufon case (28390) map </A>","Date of the Event":"08/31/1979 12:00 UTC","files":["/var/www/straped/mufon/html2text/28390.html.txt","/var/www/straped/mufon/org/28390.html"],"Object Flight Path":"Undisclosed"}