{"Latitude":"33.988716","Date of the Event":"03/24/2011 09:45 UTC","Object Features":"Unknown","trends":["There have been 2 other sightings in Dacula","There were no other sightings in Dacula on or around March 24th 2011"],"Log Number":"US-03242011-0022","Viewing Distance":"Unknown","Disposition":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Country":"United States","Sighting Duration":"00:20:00","Weather Factors":"None","Object Shape":"Star-like","Longitude":"-83.897957","Case Number":"28395","Summary":"5 star-like, 2 were bright and 3 were dimmer","map":"<A HREF = \"http://maps.google.com/maps?q=33.988716,+-83.897957(28395)&iwloc=A&hl=en\"> mufon case (28395) map </A>","City":"Dacula","files":["/var/www/straped/mufon/html2text/28395.html.txt","/var/www/straped/mufon/org/28395.html"],"Source":"MUFON","divs":["Sighting DetailsIt's that time of year again! My husband and I were taking out the trash and on the way back to the house, he noticed a \"bright star\"(1) moving quickly to the right. We both stopped and watch it \"fly out of\" the Big Dipper and and head towards the direction of Orion (SE to SW). After about 3 seconds it had made it half way across our visible sky and then just disappeared. We see these each year around this time and I have previously reported them. Because this was something we were used to, we glanced around the sky to see if we could spot more. (We typically see more than one). It was only a few seconds later that we spotted another one(2) which was dimmer coming from the direction of Orion and heading towards The Big Dipper (the opposite direction as the one before - SW to SE). That one quickly disappeared. We then saw ANOTHER one(3)! At this time we were facing The Big Dipper and I turned around to look behind me and saw it. Again, this one was dim, but noticeable (NW to SW). We lost track of it after a few seconds. Without a doubt, I know these aren't satellites, they move FAR too quickly and move in various directions. After about a total of 5 minutes, we had seen 3. With it being a very clear night, nothing was blocking our view. After a couple minutes of watching the sky, we saw another bright one(4) and it was easy to follow. This one \"came from\" Orion, passed \"under\" Sirius and faded out (but was still visible). We followed it across the sky (NE to NW) and watched as it brightened back up... only to disappear like the others. Again, only seconds later, (on the complete opposite side of the sky), we saw the last and final one (NE to SE). A dim one headed \"into\" The Big Dipper. Once it reached the middle of the constellation, it disappeared. I have an app on my phone that allows me to track satellite movement, so I opened it and pointed it towards the sky. It showed me the orbits of the satellites and they were NOWHERE near the paths of these \"stars\". Like I said, we see these often around this time of year. Sometimes, it's one a week. At times, it's a couple in one night. This is the first we've seen this year, but I will keep records on them as I see them."],"Region":"Georgia","Date Submitted":"03/24/2011 10:47 UTC","Tags":"City"}