{"files":["/var/www/straped/mufon/html2text/28399.html.txt","/var/www/straped/mufon/org/28399.html"],"Longitude":"-92.438236","map":"<A HREF = \"http://maps.google.com/maps?q=42.536799,+-92.438236(28399)&iwloc=A&hl=en\"> mufon case (28399) map </A>","City":"Cedar Falls","Object Features":"Unknown","Log Number":"US-03252011-0004","Sighting Duration":"00:01:30","Weather Factors":"None","Object Shape":"Triangle","Tags":"City","Viewing Distance":"Unknown","Latitude":"42.536799","Region":"Iowa","Date of the Event":"03/24/2011 11:47 UTC","Disposition":"Unknown","Case Number":"28399","Date Submitted":"03/25/2011 03:13 UTC","Summary":"Second of two sightings of lighted, triangular-shaped UFOs seen near my home","Source":"MUFON","divs":["Sighting DetailsI was getting a ride home from a friend after we had left from a visit at a second friend's house. We were on Iowa Highway 57 when I happened to glance out of the front passenger side window and saw a pattern of moving lights in the sky. At first, I only saw two white lights with a smaller red blinking light in the middle, but after a moment I noticed a third white light with them, forming a triangle shape. At first I had mistaken it for the wing section of an airplane, but after seeing the third, triangle-forming light and carefully observing the way it was moving, I realized that it was not a normal aircraft and that it was extremely similar to the first one I had viewed in February. When I made this connection, I got very excited and asked my friend to stop the car. He did, and luckily for us there are not many vehicles going down the highway around midnight. I rolled down my window on the passenger side and stuck my head out to get as good a look as possible. It moved more fluidly than any aircraft I usually see, and it seemed to be rotating slightly as it passed over a neighborhood that was to my right, then over our car and off into the distance, which is a more undeveloped part of town (We were on the outskirts.) As it got further away from us, it seemed to shift slightly, and when I saw it in the distance I saw an angled row of flashing red lights."],"Object Flight Path":"Straight-line path","Country":"United States","trends":["There have been 4 other sightings in Cedar Falls","There were no other sightings in Cedar Falls on or around March 24th 2011"]}