{"files":["/var/www/straped/mufon/html2text/28398.html.txt","/var/www/straped/mufon/org/28398.html"],"Latitude":"42.537579","Date of the Event":"02/17/2011 10:00 UTC","trends":["There have been 4 other sightings in Cedar Falls","There were no other sightings in Cedar Falls on or around February 17th 2011"],"Tags":"City","Summary":"First of two sightings of lighted, triangle-shaped UFOs seen near my home","Country":"United States","Region":"Iowa","Longitude":"-92.442046","Object Flight Path":"Hovering then path","Object Features":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date Submitted":"03/25/2011 02:54 UTC","Log Number":"US-03252011-0003","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.537579,+-92.442046(28398)&iwloc=A&hl=en\"> mufon case (28398) map </A>","Case Number":"28398","City":"Cedar Falls","Source":"MUFON","divs":["Sighting DetailsAs I was driving home one evening after a theater practice, I happened to look up out of my windshield and see an unusual thing in the night sky. It was a group of lights, three large white ones forming a triangle with at least one smaller, blinking red light in the middle. I seem to recall red blinking lights on the sides as well. It was slowly hovering across a main road in my town, moving from the east to the west, from the more populated and busy center to the more remote outskirts. I was hypnotized by this UFO, slowing down my car to stare at it and even driving up over a curb. After moments of it slowly seeming to hover and rotate across the road, it began to move faster and went west, causing me to lose a good sight of it. I turned off onto a side street and drove in its direction, but could not catch up. The thing that interested me the most in this experience was the fact that I saw this in the middle of town, not that late at night, so I assume many people could have and probably did witness it. I immediately posted about the events on Facebook, which is why after over a month I still have a record of the date and approximate time."],"Weather Factors":"None","Object Shape":"Triangle"}