{"Disposition":"Unknown","Object Features":"None","Date Submitted":"03/25/2011 02:33 UTC","Date of the Event":"03/04/2011 12:00 UTC","Region":"Alabama","Weather Factors":"None","Longitude":"-85.390489","City":"Dothan","files":["/var/www/straped/mufon/html2text/28404.html.txt","/var/www/straped/mufon/org/28404.html"],"Log Number":"US-03252011-0009","Latitude":"31.223231","Country":"United States","divs":["Sighting DetailsI was waiting in my wife's van outsice K Mart with my camera looking for cloud formations to photograph when suddenly I saw two very shiny round chrome-like objects moving fast...making no noise shoot into a cloud bank nearly overhead. I tried to get off two shots but did not get the objects. They were one behind the other about the same size. I was in USAF and am familiar with most flying machines..helicopters...of which I shot a photo of one while waiting there and planes...also of which I shot a photo of one while sitting there. Both made considerable sound. These two made no sound. The clouds were pretty extensive but I could see the far end of them and kept waiting for them to come out the other side but I never saw them. They seemed too small for a large plane and no wings...too fast for a balloon... Size is difficult but considering the height of the clouds I'd guess they had to be 15-30 ft in diameter headed south. I have only seen one other set of UFOs that I could not explain and that was in the 1980s over a field in NW Florida which numbered either 5 or 7 solid black cigar shaped objects. Not helicopters...as we have the worlds largest helicopter base in the world near here and I am familiar with helicopters quite well. No rotors at all. But this was seen by me, my wife and child. My wife seems to have some memories of some incident but no details and my daughter (a child then) remembers nothing. Again it was a momentary sighting but too long to add here to explain why. Thank you."],"Object Shape":"Circle","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Dothan","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.223231,+-85.390489(28404)&iwloc=A&hl=en\"> mufon case (28404) map </A>","Summary":"Was looking for clouds to photograph when I saw two shiny objects moving fast.","Object Flight Path":"Straight-line path","Case Number":"28404","Source":"MUFON"}