{"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/28400.html.txt","/var/www/straped/mufon/more/28400_submitter_file1__Ufo.jpg","/var/www/straped/mufon/org/28400.html"],"Region":"England","divs":["sighting detailsme and 3 friends where camping in my friends back garden and we where all inside are sleeping bags but our body's where outside the tents asleep, i woke up and was looking up at the sky, when i first noticed the object i shouted to my friends to wake up and pointed up at the sky and said (*words deleted--cms\\sg) is that and i started shivering all over) i knew straight away what it was and that was an alien craft because it couldn't have been anything else, one of my friends ran inside and would not come back out, we all seen this object about 300ft hovering above us when i pointed it out to them, the ufo was disk shaped and had red square lights in a ring around the bottom spinning clockwise and blue square lights ring around the bottom spinning anti-clockwise but in a smaller circle, the craft was just hovering in the same place directly above us for about ten minutes. after staring at it for about 5 minutes i just started smiling without knowing i was, i was also over come by this strange feeling of relaxation and serenity that i have never felt since. i also don't remember loosing sight of the object because when i was overcome with this weird sensation i must have fell asleep i just remember waking up in the next morning. i could better describe this by speaking to someone as i find it hard to explain stuff in righting."],"Summary":"Ufo hovering silently about 300ft with red & blue rings","Log Number":"GB-03252011-0005","Weather Factors":"None","Viewing Distance":"101-500 Feet","Date Submitted":"03/25/2011 08:20 UTC","Sighting Duration":"Undisclosed","Country":"United Kingdom","Object Features":"Patterned Surface","Tags":"City","Object Shape":"Circle, Disc","Case Number":"28400","Longitude":"-4.12837","map":"<A HREF = \"http://maps.google.com/maps?q=50.374716,+-4.12837(28400)&iwloc=A&hl=en\"> mufon case (28400) map </A>","Latitude":"50.374716","Date of the Event":"07/16/1999 10:15 UTC","Object Flight Path":"Stationary","trends":["There have been 3 other sightings in Plymouth","There were no other sightings in Plymouth on or around July 16th 1999","This sighting has never been favorited.",""],"City":"Plymouth","Source":"MUFON"}