{"Object Shape":"Sphere","trends":["There have been no other sightings in Runcorn","This sighting has never been favorited."],"Date of the Event":"10/23/2003 07:05 UTC","Weather Factors":"Unknown","Latitude":"53.342078","Log Number":"","files":["/var/www/straped/mufon/html2text/2840.html.txt","/var/www/straped/mufon/org/2840.html"],"divs":["Sighting DetailsI had gone out for a walk to a place in Runcorn called Norton Priory just toclear my head. I had been at an away day with Halton YMCA what is more a friendhad said something about a former member of staff that I an found of that hadupset me. That is why I wanted to clear my head. when I had got up to NortonPriory I went up to the wall garden end. part of the wall garden area is calledKITTYs GATE and it backs onto one of the faxtorys on the Maner Park Industrialarea of Runcorn. There is a hole in the fense at witch point went throught itabd looked to my left. that is when I saw the lights. They gave of no sound atall. They seemed to be move above the River Mersey and heading in the directionof the Siver Jubiley Bridge. The reson I lost sight of them is that tere weresome trees and buildings in the way. The Video that I am on about in the formis video footige the was showen on BBC North West Tonight a few weeks before ofthem flying over the Speak area of Liverpool. In that footege they were headingfor the River Mersey. So that is why I reconised them as some sort of UFO likecrft. The only reson I have filled in the PROVENS part is the setup would notlet me send this with that part blank."],"Sighting Duration":"00:00:00","Object Flight Path":"Straight-line path","Longitude":"-2.729673","Source":"MUFON","City":"Runcorn","Object Features":"Other","Tags":"City","Summary":"fLOOK OF LIGHTS.","Date Submitted":"10/23/2003 07:05 UTC","Disposition":"Unresolved","Country":"United Kingdom","Region":"England","map":"<A HREF = \"http://maps.google.com/maps?q=53.342078,+-2.729673(2840)&iwloc=A&hl=en\"> mufon case (2840) map </A>","Case Number":"2840","Viewing Distance":"Over One Mile"}