{"Country":"United States","divs":["Sighting DetailsI am aware I am little late in reporting this incident as this event took place when I was 22 yrs old ( now 35). At the time I was living in Harvest Alabama and was on my way to the gas station at around 10:00 PM central time to meet up with a couple of friends. I arrived at the gas station Exxon on Jeff rd and got out of my car to wait. It was a clear night and a few minutes passed waiting for my friends to arrive when this big triangular thing was in the sky. ( I had nothing better to do but stare into the stars waiting) The triangular thing had three red lights at each of the three points. Initially I thought it was three separate floating red lights that were in perfect formation, but on closer observation the stars were disappearing in the center of where the lights were. I knew this thing was solid and moved extremely slow across the sky I would say no more than 15 miles an hour. The triangular UFO was moving slowly west to east and I was facing the northern sky. I just stared at it in shock and a few minutes passed and it was still slowly moving east when all of a sudden one of the red lights dropped a white sparkly that started falling towards the earth. A couple more minutes passed and then another red light dropped two white sparkly lights that also started to fall to earth. This continues for about another 15 minutes and then all of a sudden the red lights simply disappears just like as if it just turned off the lights. I honestly thought I must be going crazy or something and left it alone and never spoke a word of it to nobody ever since. Well today 3-24-11 I currently live in Denver Colorado. I was watching our local news station and they showed a clip of a possible UFO sighting in Lafayette CO. Needless to say my jaw dropped as those red lights they showed was exactly the same thing I saw over 13 yrs ago! The only difference was that I did not see any of the three red lights dropping the white sparkly lights that fall to the Earth. I have goosebumps all over as I am typing this because I wrote it off as I was seeing things and those memories from years ago all flooded back to me. What those people in Lafayette CO captured last night on video is real! I felt like this was something I needed to finally disclose to the rest of the world. Thank you all for listening to my sighting that took place many years ago."],"files":["/var/www/straped/mufon/html2text/28402.html.txt","/var/www/straped/mufon/org/28402.html"],"Object Shape":"Triangle","trends":["There have been 2 other sightings in Harvest","There were no other sightings in Harvest on or around October 15th 1998"],"Summary":"Triangular With 3 Lights At the points that were Red Solid No Sound With White Sparklies Falling from it","Case Number":"28402","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.858744,+-86.748242(28402)&iwloc=A&hl=en\"> mufon case (28402) map </A>","Sighting Duration":"Undisclosed","City":"Harvest","Latitude":"34.858744","Viewing Distance":"Unknown","Log Number":"US-03252011-0007","Object Features":"Undisclosed","Longitude":"-86.748242","Date of the Event":"10/15/1998 10:30 UTC","Date Submitted":"03/25/2011 11:45 UTC","Tags":"City","Disposition":"Unknown","Object Flight Path":"Straight-line path","Region":"Alabama","Weather Factors":"None"}