{"Object Shape":"Sphere","divs":["sighting detailsmy wife, granddaughter and i were in our back yard setting off fireworks on the 4th of july, it was towards dusk. suddenly, my wife said in a very excited voice,\" eric what is that\". i looked toward the sky and noticed a bright spherical object in the sky almost directly above our heads. the object was making very erratic movements in the sky and ducking in and out of the clouds. my wife went in and grabbed the video camera, and immediately started filming the object. we were able to capture 10-15 minutes of film before the object disappeared. the next night we were describing our experience to my wife's son( my stepson) and his girlfriend. they told us they had experienced the exact same phenomenon. we loaned them our video camera and they filmed about 45 minutes of additional footage of the same object. the footage that we have is on 8mm beta film and we do not have the technology to convert it to our computers for attachment to this statement. we would like to have an expert look at this footage, but are hesitant to let it out of our sights. if you can help us please contact me via cell phone, or my email which is; *(wit's email address deleted--cms\\sg) thank you for your interest in this matter, sincerely, *(wit's and wife's names deleted -- cms\\sg) holt, michigan."],"Date Submitted":"03/25/2011 07:38 UTC","Summary":"A glowing spherical object object over our house.","Latitude":"42.736135","Object Flight Path":"Hovering then path","Country":"United States","files":["/var/www/straped/mufon/html2text/28406.html.txt","/var/www/straped/mufon/org/28406.html"],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Date of the Event":"07/04/2009 08:20 UTC","City":"Lansing","Source":"MUFON","Log Number":"US-03252011-0011","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around July 4th 2009"],"Object Features":"Dome","Case Number":"28406","Region":"Michigan","Sighting Duration":"00:15:00","Longitude":"-84.553585","map":"<A HREF = \"http://maps.google.com/maps?q=42.736135,+-84.553585(28406)&iwloc=A&hl=en\"> mufon case (28406) map </A>"}