{"divs":["sighting detailsi was out on the patio at a house in emerald isle smoking a $5.25 cigar. i looked up and was followinf whar i thought to be a helicopter flying down the beach very high up. all of a sudden the light zipped back (and i di mean zipped back to where i 1st started watching it !!! there were 3 in all. i looked at the cigar and then started yelling (ya'll better get out here \"to my son, daughter-in-law, wife and grand-children to get out there !!! all i could see were green objects (start's) at 1st i thought that maybe saylors were flying kites with glow sticks in them they acted like kites. i got my wife, daughter-in-law, oldest son (the grandkids were going ballastic) i got my digital camers in-zoomed in all the way and started snapping pictures. i have one that you can see a v shape with windows on 2 sides. they made no noise and would change shapes into see through \"orbs\" at will. they could move miles at the blink of an eye or fly as slow as a feather in the wind. the pictures will help. freeked us all out, scared the crap out of us to. i can photocopy you the pictures with a scanner (can't figure out how to hook mine up) but, i have friends at church with a scanner that works and will do so sunday (if they come to church !!!) if not, i will try to connedt mine to my computer. i am sure that you will be impressed. i watch alot of ufo programs on the educational channels. my feelings said (that is a ufo) it could-not have been anything elce. unless some sailors on off shore boats hat cables 2 & 1\\2 miles long and had; very good contral of the kites they were flying. however, i have never seen a kyte fly straight for 1 mile them immediately go back to it's starting place in the bling of an eye. impossible, unreal, fasinating. my wife and daughter-in-law watched them the longest. grandad had to take care of the histerical grandchildren !!!"],"Weather Factors":"None","Latitude":"34.68623","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date Submitted":"03/26/2011 12:19 UTC","trends":["There have been 4 other sightings in Emerald Isle","There were no other sightings in Emerald Isle on or around June 24th 2005"],"Case Number":"28409","Object Flight Path":"Undisclosed","Tags":"City","Date of the Event":"06/24/2005 08:15 UTC","Log Number":"US-03262011-0002","files":["/var/www/straped/mufon/html2text/28409.html.txt","/var/www/straped/mufon/org/28409.html"],"Longitude":"-76.947936","Object Shape":"Triangle","Summary":"I was at the beach out on the patio smoking a cigar and was watching a greanish object (I thought to be a helocopter) flying for 5 or so minutes. All of a suden, it zipped back to where I 1st saw it in a split second.","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.68623,+-76.947936(28409)&iwloc=A&hl=en\"> mufon case (28409) map </A>","Disposition":"Insufficient Data","City":"Emerald Isle","Region":"North Carolina","Sighting Duration":"02:00:00"}