{"City":"Montgomery","trends":["There have been 659 other sightings in Montgomery","There were no other sightings in Montgomery on or around March 25th 2011"],"Object Features":"Undisclosed","Date of the Event":"03/25/2011 04:59 UTC","Object Flight Path":"Undisclosed","Latitude":"32.372705","Tags":"City","Log Number":"US-03262011-0006","Viewing Distance":"Unknown","divs":["sighting detailsafter watching this light replayed from where the night vision cameras recorded the bright light on top of neighbors hse @ 3 am something grey jumps off the roof i did not c it with my own eyes! then the grey creature jumps back on to the same roof! (everything was recorded by night vision cameras) for the last three nights starting at 3am we have seen that se light that was on my neighbors roof but up in the trees! i waited to see what would happen to these \"star\" like objects in the trees. these star like lights slowlyove up the tree then come out the top of the tree as dawn gets closer they move higher up in the sky. i have each movement recorded. then right before dawn you can see a metallic shape then when dawn breaks they can not be seen. there are a few other incidences too! i finally got a flir and had thermally loocated something in the woods. as i kept a bright spot light on this image it made a weird noise a couple of x and all of a sudden myself and my 11 and 8 yr old kids saw what would look like a falling star. only it sprung up from where i had been shinning the light on it . it flew up from the ground arched accross the neighbors house and went up into the sky! i can send u video of all of this! i really need someone to come witness this! *(wit's name deleted--cms\\sg). i don't know how to attach video will email them i do have one on youtube!"],"Longitude":"-86.298509","Source":"MUFON","Region":"Alabama","Case Number":"28413","files":["/var/www/straped/mufon/html2text/28413.html.txt","/var/www/straped/mufon/org/28413.html"],"Country":"United States","Date Submitted":"03/26/2011 04:08 UTC","Weather Factors":"Unknown","Summary":"Have night vision security cameras recorded BRIGHT FLASHING Light on top of hse","Object Shape":"Square, Rectagular, Star-like, Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.372705,+-86.298509(28413)&iwloc=A&hl=en\"> mufon case (28413) map </A>","Disposition":"Insufficient Data","Sighting Duration":"04:59:15"}