{"Object Shape":"Other","Object Features":"Unknown","Object Flight Path":"Straight-line path","Disposition":"Unknown","City":"Houston","Latitude":"29.769793","Region":"Texas","Summary":"I observed a rotating hour glass shaped object cross the sky","map":"<A HREF = \"http://maps.google.com/maps?q=29.769793,+-95.36798(28416)&iwloc=A&hl=en\"> mufon case (28416) map </A>","Date of the Event":"03/27/2011 01:45 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsAs i was outside listening to music and having a conversation with the family. I was trying to see the stars out night, being that it was a very clear night. I notice something come into my periphal vision. It was a orange object shaped like an hourglass that was laid over on it's side. It was spinning and moving at a high rate of speed. I live very close to Bush Iah airport I am familar with airplane flight patterns (they usually fly right over head from a north to south) and this object wasn't moving on the usual path. For takeoff or arrivals. It wasn't bright but it was definitely there. I tried to get others to see it but it moved to fast for them to locate in the sky. It was moving at a pretty impressive speed. Now I'm not saying that I am certain it was a \"SPACESHIP\" or that this couldn't be explained away as something else. But I am pretty familar with airplanes and helicopters that fly over head and this didn't look like anything normal.It moved too fast to get an accurate look at it and it was dimly lit. I thought I would just pass this along to you to see if you had any other reports."],"Case Number":"28416","Date Submitted":"03/27/2011 03:06 UTC","Weather Factors":"Windy","Longitude":"-95.36798","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around March 27th 2011"],"files":["/var/www/straped/mufon/html2text/28416.html.txt","/var/www/straped/mufon/org/28416.html"],"Log Number":"US-03272011-0002","Country":"United States","Viewing Distance":"Unknown","Tags":"City"}