{"Longitude":"-85.321994","Object Shape":"Flash, Saturn-like, Star-like, Triangle, Other","Source":"MUFON","Object Flight Path":"Path with directional change,Other","Case Number":"28417","files":["/var/www/straped/mufon/html2text/28417.html.txt","/var/www/straped/mufon/org/28417.html"],"Latitude":"51.257845","trends":[],"Object Features":"Wings, Other","Country":"Canada","Log Number":"CA-03272011-0003","Sighting Duration":"Undisclosed","divs":["Sighting Detailssomething around 2 AM I'm smoking on the balcony then I'm staring to see flashing dots above the lake Ontario south of me. I tried to focus and YES BINGO here they are. Flying down to the lake beyong it dissapering in the space, flying beyong skyline diagonally, I didn't notice solid styraight fly from none of them. Some objects there making a line from buttom to up and rotating opposite clock wise horisontially. Corrdct my english if looks weird. I'm shoked. I called police they came late but they have noticed the dot still in the sky I assume mother ship because all other at some point have been moving from to and away of it... I noticed this ship may be in a hour of my first seen. Some objects were making fly beyong the lake. One object 5-7 lights angle shape made diagonal fly towards East with accelarating insdane speed. One object came from above very bright since then my mom started to belive me that I'm seeing something she wear glasses, but even shge was explaining to police we have seen this guys. My congrats boys and girsk UFO are here. Lots of them. Video I captured I don't know whjat you wanna find were I watched it already nothing... WOW. At some point looked like they have been flying into the lake and then again up and away with crazy speeds - not ours... one object made it beyong the lake to the east and then round shape right up!!! they are here, I'm not crazy! One plane went towards them than turned little and went away... Helicopter made it 5 click away of shore and flew away too. But they had to see... I dunno my video no good unless you can may be retrive something,,, cointact me me come over I will show directions how they flew... No reason for now attache video... I will look once again for editing"],"City":"Undisclosed","Date Submitted":"03/27/2011 05:52 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.257845,+-85.321994(28417)&iwloc=A&hl=en\"> mufon case (28417) map </A>","Date of the Event":"03/27/2011 12:00 UTC","Summary":"A benefis of huge amount (hundreds) of objects with not our speeds above lake Ontario","Region":"Ontario","Tags":"City","Viewing Distance":"Over One Mile","Disposition":"Unresolved"}