{"Object Flight Path":"Stationary,Unknown","divs":["Sighting DetailsA friend and I were sitting outside of my house smoking cigarettes when we noticed the three lights in the sky. There were clouds in the sky, but not where the lights were coming from. We were facing south, and we were in east Longmont, near 9th and County Line Rd 1. We proceeded to watch the lights, confused, because they were all the same brightness, much brighter than stars, and they were barely moving. It was very hard to tell how far they were from us. We sat there for an hour or two watching them, unable to look away. They moved very slowly, but changed from a triangle that seemed somewhat even when it came to lengths apart from each other. But as they slowly moved, two of the white lights got closer to each other, but the other dot either remained in the same place, or moved farther away from the other two, it was very hard to tell how they were moving. It was not an airplane, it was much to far away to be an airplane by the size of \"it\" or \"them\". I actually had forgotten about this until I watched the videos and saw the pictures of the UFO sightings in Lafayette, because as soon as I saw the footage, it set me back immediately to what I saw about a year and a half ago or so.. it's hard to remember the exact date but I believe what I saw happened between late October to December 2009. Unfortunately, I didn't get any pictures because me and M only had our phones, which didn't capture the lights."],"City":"Longmont","Case Number":"28426","Object Features":"None","Summary":"3 lights in the sky moving incredibly slow, started out as a triangle, then turned into a sort of right triangle.. and then disappeared one by one.","trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around October 15th 2009"],"Object Shape":"Triangle, Other, Unknown","files":["/var/www/straped/mufon/html2text/28426.html.txt","/var/www/straped/mufon/org/28426.html"],"Region":"Colorado","Sighting Duration":"01:00:00","Longitude":"-105.093498","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","Latitude":"40.175957","Source":"MUFON","Date Submitted":"03/27/2011 08:11 UTC","Country":"United States","Date of the Event":"10/15/2009 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.175957,+-105.093498(28426)&iwloc=A&hl=en\"> mufon case (28426) map </A>","Log Number":"US-03272011-0012"}