{"Case Number":"28423","Weather Factors":"Unknown","Latitude":"43.02756","Summary":"Orange Light hovering in the sky, started moving NE and just disappeared. After the light disappeared there appeared to be aircraft lights where the object was.","Log Number":"US-03272011-0009","Tags":"City","Object Shape":"Circle, Fireball, Sphere","Object Features":"Undisclosed","Date Submitted":"03/27/2011 06:52 UTC","Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-83.075495","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28423.html.txt","/var/www/straped/mufon/org/28423.html"],"Region":"Michigan","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.02756,+-83.075495(28423)&iwloc=A&hl=en\"> mufon case (28423) map </A>","Object Flight Path":"Hovering then path","divs":["Sighting DetailsMy cousin and I were driving to his house from mine. It was around 10:30pm, we were about a mile from his house outside Imlay City, MI. I looked out the drivers side window and noticed an orange ball in the sky, it was just hovering in the air. After a few seconds of discussing what it could possibly be, my cousin pulled the car over on the side of the road. We sat there for about 5 minutes just watching this orange ball of light, it looked like it was over Imlay City or just outside Imlay City. Then it started moving Northeast kind of quick, the next thing we knew the orange light just vanished and in the exact place where the orange ball vanished, red and blue flashing lights appeared, which looked like aircraft lights, but they were flashing faster than aircraft lights ive seen before. I was a mechanic on F-15 Aircraft in the Air Force, and this was totally different. We then watched the red and blue lights go behind some trees and we lost track of it. This is not the first ufo i have seen. My cousin had not seen one before that night."],"Date of the Event":"03/25/2011 10:30 UTC","trends":["There have been 2 other sightings in Imlay City","There were no other sightings in Imlay City on or around March 25th 2011"],"Disposition":"Unknown","City":"Imlay City"}