{"Country":"United States","Region":"Pennsylvania","Object Flight Path":"Straight-line path","Date of the Event":"03/26/2011 09:30 UTC","Longitude":"-75.185869","Latitude":"40.141791","trends":["There has been one other sighting in Fort Washington","There were no other sightings in Fort Washington on or around March 26th 2011"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28428.html.txt","/var/www/straped/mufon/org/28428.html"],"Date Submitted":"03/27/2011 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.141791,+-75.185869(28428)&iwloc=A&hl=en\"> mufon case (28428) map </A>","Log Number":"US-03272011-0014","Source":"MUFON","Summary":"Aircraft like lights, in a row, all white, one white strobe, very slow,lights were trailing","City":"Fort Washington","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Case Number":"28428","divs":["Sighting DetailsTraveling Westbound I276 at 9:26pm, I passed the Fort Washington Interchange. I looked at the clock because I was curious how long it took me to get to this point as I was traveling to my brother's residence and I was in a hurry. (It was getting late and I was tired. I rise at 5:15am). The turnpike is straight from before the interchage at Fort Washington heading west for a few miles. It is however not level. I was traveling in the middle lane. I believe you pass under an overpass approximately midway in the straight section of road prior to its bending to the left at the top of the rise. As I past the overpass, I looked up and forwared of my position to notice what appeared to beaircraft leading edge landing lights approximatel 2 inches across( looking at your outstretched hand to measure. I thought that , well there is a military base nearby, forgetting that the base has been closed. The visibility here is focused forward somewhat not only because of your direction of travel, but also because the embankments to either side rise 25 ft or more. In addition there are3 tall trees on bothe sides at the top of the embankments. At approximately 65 mph I expected that the lights would get brighter and further apart as I approached and I expected it would do the same. Most aircraft lights for landing are brighter than the other lights. These brighter lights were on the outside edges, with the less bright lamps on the inside of the \"wingtip\" lights. They were in a row and a single white strobe was blinking slightly below and centered. All lights were white. Red lamps are traditionally on the left of the aircraft, and green on the right side of the aircraft wingtip. Assuming it was coming toward me, I would have expected to see these shortly. Within 20-30 second It appeared 5-6 inches across, again using your hand at arms length to measure. I wasn't thinking of looking for colored lamps. I was thinking that it was odd for an aircraft to be that low over an interstate. Perhaps it needed to land, a provision from the interstate design( allowing x number of miles of straight away for emergency landings was part of the design. As I approached what seemed to be almost underneath its position, I realized that it was not moving fast, I had overtaken its position and it was not coming toward me , but away from me, and it appeared to be going slower that I was. How curious.. At that point the road bends to the left about 25 or 30 degrees. I looked out the window not once, but twice and could not see the lights anymore. The lights were on the trailing edge, not the leading edge, unless it turned away immediately as I had traveled to the left on the highway I didn't see it again. The distance of the lights were comparable in feeling to watching jets fly overhead on a landing strip. It felt large. At least the size of a jet airliner. Before rounding the bend I had my last look at the lights,(before I lost sight of it). My thoughts were that it was large, an aircraft?, and it must be low for its lights nearly spanned the visible clearing of sky between the tree lines on both sides of the highway...I was actually ducking while looking out of th car toward it"],"Disposition":"Insufficient Data","Tags":"City"}