{"Weather Factors":"None","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.446925,+-79.993286(28422)&iwloc=A&hl=en\"> mufon case (28422) map </A>","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/28422.html.txt","/var/www/straped/mufon/org/28422.html"],"Case Number":"28422","Region":"Pennsylvania","Date of the Event":"03/26/2011 11:10 UTC","City":"Pittsburgh","Log Number":"US-03272011-0008","Country":"United States","Summary":"Close contact with unknown aircraft","Tags":"City","Object Shape":"Triangle, Other","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around March 26th 2011"],"Date Submitted":"03/27/2011 06:45 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsShortly after 11 at night, I was on the way back to my house with two friends. While looking out the window I noticed what looked like the headlights of a car in the sky. I assumed it was a helicopter at first because it was clearly hovering. Once our car was directly below the object, however, I observer from a very short distance that the object was very oddly shaped and now had green, red and white lights in odd placements along the edges of what looked like an obtuse scalene triangle. The craft then began to travel with our car but then boasted two very bright lights and one red one. Like I said, I was right below it and I could clearly see a perfectly solid triangular shape disproving a blimp or helicopter as explanations. After driving further up the road, the object sped off very quickly and stopped relatively far away but in plain sight still. It maintained that position for about 5 seconds, then simply vanished. My friends and I were all amazed by what we had just seen although I think we were all too embarrassed to say it was a UFO. It was honestly one of the most incredible experiences of my life, so I felt it necessary to report the sighting. Hopefully my writing skills do not spoil the magnitude of the situation for whoever reads this. I had my phone in my pocket so I really wish it would have occurred to me to film the spectacle but I was far too entranced to consider that. Sorry, but enjoy!"],"Longitude":"-79.993286","Latitude":"40.446925","Source":"MUFON","Object Features":"None"}