{"Weather Factors":"None","Latitude":"37.044956","Log Number":"US-03272011-0013","Disposition":"Unknown","Longitude":"-122.148022","trends":["There has been one other sighting in Bonny Doon","There were no other sightings in Bonny Doon on or around October 31st 2010"],"Summary":"a falling star, which turned out to be a flying aircraft","Region":"California","Object Flight Path":"Other","Viewing Distance":"Over One Mile","Object Features":"Dome, Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28427.html.txt","/var/www/straped/mufon/org/28427.html"],"Date Submitted":"03/27/2011 08:18 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.044956,+-122.148022(28427)&iwloc=A&hl=en\"> mufon case (28427) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"10/31/2010 12:00 UTC","City":"Bonny Doon","Object Shape":"Circle, Disc, Sphere, Star-like","Case Number":"28427","divs":["Sighting DetailsI was with a girlfriend on top of moon rocks in bonny doon, california, which is located on a high elevated hill on martin rd. I have been a frequent visitor since I moved to Santa Cruz in 2002. We were the only ones there, talking about life, and enjoying the view of the pacific ocean and and the stars, as the moon was waning, I think. I was looking over the ocean, and I saw what looked like a falling star. I often see them. I told the girl to turn around and she saw, what appeared to be a falling star. It was very bright. It looked like it was going to fall into the ocean, and the ocean below it started to light up a rather large area, because it was not hard to see from where i was, miles away. maybe 10 miles or less. anyway, the object stopped before it hit the ocean, and so far no more than 5 seconds had elapsed. the object rose suddenly and hovered over the ocean. it was not a plane. i could not see how the object looked, as its lights had turned off. but i could still see the object, with what looked like dim lights. then, it suddenly turned around and i saw a green flame come out of a jet, and the object turned out towards the pacific and took off flying away and upwards at a sharp angle. the girl saw it too. she was amazed. i though it was military, but i don't know. it was shaped like a disc, metallic and shiny. very quick, and it must have been somewhat large for me to see it. the green color of the flame surprised me. it all happened so suddenly. no more than 10 seconds. before i knew it, there was no trace of the object. there was definitely a back and front of the object, as the green flame was so bright, that i finally saw the entire shape of the object from the back.i saw cylinders, maybe two or three, from which the green flame came. a disc shape..."]}