{"map":"<A HREF = \"http://maps.google.com/maps?q=26.021108,+-80.305683(28433)&iwloc=A&hl=en\"> mufon case (28433) map </A>","Tags":"City","Sighting Duration":"00:03:00","Log Number":"US-03282011-0005","Latitude":"26.021108","Object Flight Path":"Path with directional change","Longitude":"-80.305683","Region":"Florida","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date Submitted":"03/28/2011 05:46 UTC","Country":"United States","Disposition":"Unknown","trends":["There have been 9 other sightings in Pembroke Pines","There were no other sightings in Pembroke Pines on or around March 28th 2011","This sighting has never been favorited.",""],"Object Shape":"Circle, Disc","Case Number":"28433","Date of the Event":"03/28/2011 12:00 UTC","City":"Pembroke Pines","Object Features":"Patterned Surface","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28433.html.txt","/var/www/straped/mufon/more/28433_submitter_file1__ufoDM2906_468x327.jpg","/var/www/straped/mufon/org/28433.html"],"divs":["sighting detailsat approximately 12:05am, i had just passed the guard gate of century village in pembroke pines, fl. where my mother resides and approaching the building while riding my motorcycle, i noticed two dark red lights almost burgundy in color up in the sky that caught my eyes. i also observed two airplanes to the left side of these red lights. the planes were easily identified by their wings, general shape and the green and red lights on each wing, however, the dark red lights were much larger in size and appeared to be independent of one another. i noticed how these lights separated as they traveled through heavy clouds and each went in separate directions. i immediately stopped and got off my bike to get a good glance at the nearest of the two red lights which suddenly stopped illuminating the red color and broke through a heavy cloud and now observed the object charcoal grey in color below the cloud directly over me possibly about one mile up and perfectly detailed as a round disk shape with a smaller round disk in the center with lines that radiated from the smaller center round disk in several pie shaped patterns outward. the disk traveled fast in a westard direction as it passed directly overhead. judging by the speed of the nearby private and commercial planes, i would have to estimate the speed of the disk to be between 4 to 5 times faster. my observation of seeing this ufo that displayed so much classic detail had me in shock and while the experience seemed surreal at first, i immediately attempted to video record and then snap some still images using my cell phone camera. as the disk progressively escaped my vision behind neighboring trees, i mounted my motorcycle and proceeded to give chase in order to position myself for better photographs and i soon found myself racing behind it for a few miles then totally losing site of it by the time that i reached state road 27\\ okeechobee road all the time looking up searching for the ufo, i proceeded west on i-75 towards naples, florida at a high rate of speed, but upon realizing that i had lost it, i turned back and returned home in coral springs, where i immediately started searching the internet for photographs to compare my sighting to and was completely shocked to see that the ufo that i had observed was nearly identical in detail to other ufo's that were reported by pilots and law enforcement personnel in the past. i do not know if the videos and still photos that i attempted to take can be reviewed by an expert but i would be glad to show whomever is interested in them. the attached photo is an internet drawing that is remarkably similar in shape and design to the ufo that i observed earlier today."],"Summary":"Observed a charcoal disk shaped UFO flying overhead and attempted to video and take still pho"}