{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.954363,+-74.378734(28435)&iwloc=A&hl=en\"> mufon case (28435) map </A>","Weather Factors":"None","Sighting Duration":"Undisclosed","Summary":"I was driving when I saw a bright white/blue orb floating above the treeline.","Date of the Event":"08/17/2005 10:20 UTC","trends":["There has been one other sighting in Manchester Township","There were no other sightings in Manchester Township on or around August 17th 2005"],"Tags":"City","Country":"United States","Viewing Distance":"21-100 Feet","Disposition":"Unknown","Latitude":"39.954363","Longitude":"-74.378734","Region":"New Jersey","Date Submitted":"03/28/2011 12:32 UTC","Object Flight Path":"Hovering then path","Case Number":"28435","divs":["sighting details i was driving with my sister and friend on a back road by my house, when i saw a bright white\\blue orb of light hovering about ten feet above the treetops. it looked to me to be about as big as an suv. as i got closer along the road, the light began to expand and increase in brightness. when i was about 20 yards from the object, (as i was driving still), it shot off at an unbelieveable speed across the road and was lost from sight. . my sister and friend, were talking and joking in the back of the car, and because of this missed the whole thing, as it was probably a minute or less. i told them what i saw and we were all very excited to see it again.i attempted to drive in the direction it went, but was unable to find it. when i returned home, my brother had very interesting news. his first words to me were \"justin just saw a ufo!\" justin was our friend. he and my brother were sitting outside my house in our street. justin saw a bright orange orb floating above the cul de sac. it moved from left to right, before going down into the trees behind the cul de sac, as if it was landing. this was happening at approx the same time as my sighting. the distance between where we saw these objects is about 1 mile."],"files":["/var/www/straped/mufon/html2text/28435.html.txt","/var/www/straped/mufon/org/28435.html"],"Log Number":"US-03282011-0006","Object Shape":"Circle","Object Features":"Unknown","City":"Manchester Township"}