{"files":["/var/www/straped/mufon/html2text/28439.html.txt","/var/www/straped/mufon/org/28439.html"],"Log Number":"US-03282011-0010","Date Submitted":"03/28/2011 01:12 UTC","Country":"United States","divs":["Sighting Details I have been taping the nights sky for some time now because I have been seeing this star like object in the southwestern sky that looks like nothing I have seen in my 37 years of star gazing. When on March 27 2011 at or around 11:30 that night I was outside in my front yard video taping that object that I have been noticing when a flash that looked like a shooting star caught my eye it shot across the sky from east to west and then suddenly stopped which amazed me because of what it was able to do I then proceeded to zoom in for a closer look. There were two objects one was a flashing light that was above and to the right of the other which I could not focus on and the other looked like a cigar or some sort of cannon and what look to be something above this object honestly it looked like the sky above this object was warped or opened opened up I wish I could find the words to describe what I saw very humbling for me. Unfortunately my battery started to flash because it was low and I could only get approximately 7 minutes of video of this object with my cameras battery being low it kept me from getting a better picture because it wouldn't let me use my night vision which if I could have used that I would have seen this ship with a better view This object did not move it was stationary in the western sky very very high in the sky I can only wish I had a full battery so I could have gotten more video time of it"],"Disposition":"Unknown","Region":"Ohio","Object Flight Path":"Stationary,Straight-line path","Date of the Event":"03/27/2011 11:28 UTC","trends":["There have been 2 other sightings in Brunswick","There were no other sightings in Brunswick on or around March 27th 2011","This sighting has never been favorited.",""],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.24452,+-81.839731(28439)&iwloc=A&hl=en\"> mufon case (28439) map </A>","Case Number":"28439","Summary":"I was video taping the night sky when a flash caught my eye I then zoomed in to see this object","Tags":"City","Weather Factors":"Unknown","Object Shape":"Blimp, Bullet, Missile, Cigar, Star-like, Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"41.24452","Viewing Distance":"Unknown","City":"Brunswick","Longitude":"-81.839731"}