{"Viewing Distance":"Unknown","Date of the Event":"03/28/2011 10:30 UTC","Source":"MUFON","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around March 28th 2011"],"Summary":"Many little yellow lights moving quickly towards and away from each other","Log Number":"US-03292011-0005","Object Shape":"Other","Date Submitted":"03/29/2011 03:41 UTC","Tags":"City","Latitude":"36.120366","Disposition":"Insufficient Data","Region":"Nevada","Object Features":"None","City":"Las Vegas","Longitude":"-115.171496","files":["/var/www/straped/mufon/html2text/28449.html.txt","/var/www/straped/mufon/org/28449.html"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.120366,+-115.171496(28449)&iwloc=A&hl=en\"> mufon case (28449) map </A>","Sighting Duration":"Undisclosed","Case Number":"28449","Country":"United States","Object Flight Path":"Path with directional change,Other","divs":["Sighting DetailsMy boyfriend and I were at the drive in (West Wind Drive In) watching a film. Now, granted that's near an airport, I've lived near airports all my life. This was unlike anything I have ever seen before. There were about 12-15 little lights, pinhead sized if you were looking at them. They seemed to move in towards each other, and then away.. similar to an organized flock of birds. No sounds either, as there were no planes taking off. Simply all that could be heard was the quiet sound of the movie. Nothing you'd hear if it were a group of planes. I tried to point them out to my boyfriend, but by the time he actually looked to see, they had diapered to the northeast. I continued to watch the sky in hopes that I'd see them again, but nothing showed up that wasn't an airplane. I honestly thought that maybe it was a plane, but there were too many of them and they moved too much to be one. I was shocked after noticing them. I have never seen a ufo before, nor did I ever think I'd see one. I was irritated that my boyfriend didn't see them before they diapered. Unfortunately, with it being dark in the car, and cluttered with the various blankets, pillows, popcorn, candy, etc, I couldn't find my phone fast enough to take video or even picture. Not to mention, I didn't want to lose sight of them."]}