{"City":"Yuma","Viewing Distance":"101-500 Feet","Object Shape":"Boomerang","Summary":"The object was in the shape of a boomerang, grey in color, no lights, no sound, and the object was andulating, like a lot of little waves on the object.","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Region":"Arizona","Date Submitted":"03/29/2011 01:35 UTC","Case Number":"28445","Log Number":"US-03292011-0001","map":"<A HREF = \"http://maps.google.com/maps?q=32.698261,+-114.617922(28445)&iwloc=A&hl=en\"> mufon case (28445) map </A>","files":["/var/www/straped/mufon/html2text/28445.html.txt","/var/www/straped/mufon/org/28445.html"],"Date of the Event":"03/28/2011 09:15 UTC","Disposition":"Unknown","Latitude":"32.698261","Weather Factors":"None","Source":"MUFON","Country":"United States","divs":["Sighting Details1. When I saw the object, my husband and I were walking the dogs outside at approximately 9:15 p.m. I always look up to the stars at night. 2. I was looking up at the stars like I do each night and directly over my house was this moving object. I noticed it because not only was the craft moving from left to right, but the object shape was endulating like little waves or something. The endulation was contained within the shape of the boomerang. It was light gray and was visible in the dark sky. 3. I first thought I was viewing a flock of birds flying in a \"v\" formation, but dismissed it quickly because the shape was too perfect having very defined edges. I've seen flocks of birds flying before and they are always making noises and never in a perfect formation. The object emitted no sound at all. 4. The object was in the shape of a boomerang, but not with a pointy tip. Where the tip would be, it was straight. It was moving quickly, but not like an airplane. I saw it for only 10 or 15 seconds. The endulating motion was contained within the shape of the object. It came from the south and was moving to the north. 5. My husband saw the flying object as well. I was a little shocked to have seen something so strange. We had a flashlight to watch our doggies and I was afraid that the object would see us with our flashlight. I was a little bit scared. I immediately went into our house and called my boys and told them what we saw. 6. The object disappeared into the night sky."],"trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around March 28th 2011"],"Object Flight Path":"Straight-line path","Longitude":"-114.617922"}