{"divs":["Sighting DetailsWe were inside eating pizza when my cousin's son called and told us to go outside and look at the sky because there were three bright red lights. So we went out back of the house facing west and saw the 3 lights in the sky. First of all, there was not a star in the sky. There must have been high cloud cover. The sky was pitch black and all you could see were these bright red lights in a triangular form hovering at what appeared to be approximately 3000-5000 feet in the sky. The lights were steady but seemed to glow. They did not blink. There was absolutely no sound. They were as bright as stars, but red in color. They were the only lights in the sky. We watched them for almost 20 minutes as they slowly moved from Northwest to Southeast. After about 15-20 minutes, we stopped to talk to my cousin's neighbors for a second and when we looked back up, one of the lights had vanished. We watched for a few more minutes, when the lower right light vanished. Within a second or two, the third light vanished. We couldn't tell if they just went out or seemed to fly off. It appeared to be three separate objects, but I cannot be sure. They did seem to elongate at one point, but it was hard to tell if that was due to our perspective in relationship to where it was. It also appeared that one of the sides of the triangles moved further apart at one point; but again, that could be due to our perspective. I want to stress that there was absolutely no sound and the lights were steady. The video makes them seem to blink or glow, but that is due to the video. The lights also seemed much closer and brighter in person than on the video. I've had people speculate that they were sky lanterns, aircraft and satellites. However, because they were below the clouds, that rules out satellites. I believe they were too bright for sky lanterns, but that may be the most common explanation. Unless our government has completely silent aircraft with steady red lights that do not blink, I can't imagine it being aircraft. It took nearly 20 minutes to travel maybe 20 miles. I'm not sure what it was, but it would be nice to have some sort of explanation. Watching the object(s) was surreal for all of us. We all felt very strange as if anything could happen at any time. All sorts of thoughts were going through our heads. You can hear much of what we were thinking in the video."],"Sighting Duration":"00:20:00","files":["/var/www/straped/mufon/html2text/28440.html.txt","/var/www/straped/mufon/org/28440.html"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Case Number":"28440","Object Flight Path":"Hovering then path","Object Shape":"Triangle","City":"Lafayette","Region":"Colorado","Log Number":"US-03282011-0011","Longitude":"-105.082156","Date Submitted":"03/28/2011 01:38 UTC","Summary":"3 bright red lights in triangular form. No sound. No blinking.","Object Features":"Unknown","Latitude":"40.002106","Tags":"City","Date of the Event":"03/20/2011 08:45 UTC","Disposition":"Unknown","trends":["There have been 6 other sightings in Lafayette","There were no other sightings in Lafayette on or around March 20th 2011","This sighting has never been favorited.",""],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.002106,+-105.082156(28440)&iwloc=A&hl=en\"> mufon case (28440) map </A>","Source":"MUFON"}