{"Disposition":"Insufficient Data","Date of the Event":"Unknown","Region":"Missouri","Object Shape":"Square, Rectagular","City":"Advance","Object Features":"Undisclosed","Summary":"The Glowing Dining Room","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"20 Feet or Less","Sighting Duration":"00:10:00","Tags":"City","Log Number":"","Latitude":"37.104496","trends":["There have been no other sightings in Advance","This sighting has never been favorited."],"Country":"United States","Case Number":"2845","Longitude":"-89.910649","map":"<A HREF = \"http://maps.google.com/maps?q=37.104496,+-89.910649(2845)&iwloc=A&hl=en\"> mufon case (2845) map </A>","divs":["Sighting DetailsIt was around 1OO a.m..,everyone 6 was asleep. I had been reading and turned offthe lights for about 15 mins. I noticed what looked like car headlights comingin through my blinds, from the south. They continued to get brighter and closeras if they were right outside my bedroom,which is impossible because there is afeild and fence. Then the lights were so intense they were striking throughevery part of the blinds and I, still in bed saw that my diningroom was glowingin the brightest white light I have ever seen. I would say it was luminescent. Icouldnt make out anything in the room, the light was blinding. What is so odd isI just layed there. I didnt even attempt to wake up my husband. I felt no fear,but I couldnt seem to gather my thoughts. I couldnt tell you how long it lasted.Finally it seemed I could think and move though I wasnt conscious of not beingable to. This is were my son comes into the story. My bedroom opens to thedining room seperated by the staircase.My son has a open loft room, with onewindow and black curtains and saw hardly any light up in his room. What woke himup was the glowing diningroom. He made it to the landing and was sitting therewhen I came through in a very odd position, sort of in a leaning against thewalls with his legs pulled up, and my son is very stiff and never sits likethat. He seemed to be disoriented when I saw him. The light was slowly leavingit was no longer glowing but gradually growing dimmer. I didnt hear anything,nor did I even attempt to look out. I asked Blaine did you see the lights And hesaid they woke him up but for some reason he didnt come down and thats all heremembers is the bright lights. After that he slept on the couch. The entireevent we both were very much not ourselfs."],"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/2845.html.txt","/var/www/straped/mufon/org/2845.html"],"Date Submitted":"02/02/2004 08:21 UTC"}