{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=48.539281,+-121.746251(28452)&iwloc=A&hl=en\"> mufon case (28452) map </A>","Date of the Event":"01/01/2011 12:00 UTC","divs":["Sighting Detailsmy brother and I were outside in my farm field on new year eve night. At midnight we went outside to shoot off our shotgun and my brother shot and about two seconds after he shot he said come and look and I saw two red lights moving in the distance they were moving together and pretty low. It seemed to be about four hundred feet from us, then I took the gun and said I will shoot at that star and as soon as i shot these lights appeared again exactly where i shot, they seemed to react to our shooting. What i think is there was a craft sitting there and we did not see it even though we were shooting at it unknowingly. This area is a crossroads for sightings we have seen dozens of crafts over the last several years.Two weeks ago we saw two objects flying overhead they were two yellow objects glowing and moving together with each other. Most of these sightings are later on in the evening and also seen several stars that seemed to be quite bright and were flashing and then all of a sudden they were moving off across the sky. You could tell they were much closer than regular stars. Also my brother was out one night and saw a flashing object and had a multi colored flashlight with him and he started flashing his light at the object and it flew over to where he was standing. that scared him pretty bag and now when we see these objects he will not do that any more especially if he is by himself. Just a few lines to let people know there is all kinds of stuff out there. ."],"files":["/var/www/straped/mufon/html2text/28452.html.txt","/var/www/straped/mufon/org/28452.html"],"City":"Concrete","trends":["There have been no other sightings in Concrete","This sighting has never been favorited."],"Longitude":"-121.746251","Latitude":"48.539281","Summary":"2 red lights.","Object Features":"Undisclosed","Region":"Washington","Object Shape":"Circle","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Case Number":"28452","Tags":"City","Log Number":"US-03292011-0007","Country":"United States","Date Submitted":"03/29/2011 01:57 UTC","Disposition":"Unknown"}