{"Disposition":"Unknown","City":"Los Angeles","Latitude":"34.056134","Case Number":"28450","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"03/28/2011 11:15 UTC","Source":"MUFON","Country":"United States","Sighting Duration":"00:00:40","files":["/var/www/straped/mufon/html2text/28450.html.txt","/var/www/straped/mufon/org/28450.html"],"Longitude":"-118.235695","Log Number":"US-03292011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=34.056134,+-118.235695(28450)&iwloc=A&hl=en\"> mufon case (28450) map </A>","Object Shape":"Triangle","Date Submitted":"03/29/2011 04:43 UTC","Region":"California","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around March 28th 2011"],"Weather Factors":"Unknown","Tags":"City","Object Features":"Undisclosed","divs":["Sighting DetailsAt 11:05PM Monday night March 28,2011 I stepped out to my backyard located on Palos Verdes Penninsula, Los Angeles County, Southern CA, to get some fresh air and was just stargazing looking upward in the sky in the southeast direction, when at the corner of my right eye, 10 minutes later at 11:15PM, I saw some movement at about 280 degrees. It looks like it had just flown over the ocean and now going over the area I was at. It looked like it came in at a WNW direction from a higher altitude gradually descending to a more West direction as it looked as it was passing by around my street or maybe a couple of streets to the West, towards Los Angeles. When first seeing this unknown object I thought they were 3 white Birds, but when I focused my eyes It was way to bright to be Birds but now realized they were 3 bright White lights almost flourescent. I also noticed the lights were at a fixed place while descending and turning the curve towards west-NW to Los Angeles, it did not act like any kinds of Birds! While flying closet over my sighting I noticed the relection from the ground lights casted a shadow over the lights which I clearly saw a Perfect Black Triangle, outlining the lights. They were located only on the bottom of the craft. It was going really fast but not shaking, it was more like a very fast and smooth, curved down the way it flew, nothing like any jet or conventional aircraft would fly like. I noticed ther was NO SOUND, emitting from it , and remember this is at night when things are down, in a very quiet neighborhood. I was almost in shock when I saw it and when it flew by, my sight time of the object was about 30-40 seconds, but it was enough to clearly see what it looked like and what it was doing when passing by. In about 5 minutes later at the time of the sighting, at about 11:20PM, I noticed a Jet flying at about the same altitude when the object was flying over the area earlier, but it was coming at North To South direction, and when it flew by its jet engines roared, which I then realized it was probably a military aircraft flying that low and fast, that is when I realized that the dark triangle object with 3 white lights did not make any kind of sound, and the jet flying by right afterwards was probably looking for the object. My feelings at the time was shock, and a little more frightening after I quickly processed in my mind of what I had just seen. It must have been close above where I was at because I lost sighting once it passed over the house, because of the verticle structure of house. I have wathced UFO documentaries mentioning ufo's that were triangles, and the scenario that played out afterwards with the jet, and that looks like what happened. After seeing this object it is amazing that I spotted it at that particular moment in time, when I was actively looking up at the stars trying to get some fresh air."],"Summary":"At night , while looking up saw 3 white lights descend then curve towards Los Angeles,when passing above saw outlining of perfect black triangle going at very high speed., NO Sound emitting from it. 5 minutes later possible military jet flys by N to S DIR"}