{"Object Features":"None","Disposition":"IFO","Object Flight Path":"Stationary","Source":"MUFON","Date of the Event":"03/29/2011 06:45 UTC","Summary":"Portland bright cluster of white lights accompanied by a group of smaller but also very bright lights","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around March 29th 2011"],"divs":["Sighting DetailsRiding the bus into work this morning, I was listening to the radio,. headphones on, eyes closed. We were on the Ross Island Bridge traveling west when I suddenly thought to open my eyes and look out over the Willamette River and check out the Portland skyline. It was about 6:45 a.m. and dawn was rapidly becoming full morning. What I immediately beheld was a cluster of bright lights over the river at ahout the same elevation as the bridge I was on, There were three bright white lights that seemed to flicker or flash rapidly, all very close together, and to their left was a lively little cluster of bright colored lights that blinked and seemed to tumble around each other. The whole group of lights hung in the air as I craned my neck around to keep them in sight as long as possible. This object was maybe a quarter of a mile away. About 15 seconds passed before the bus drove over the bridge and into the city innards. I discerned no identifiable shape and have no idea what it was. Sure would like to know if anybody else saw what I saw this morning. I've been watching the skies the last few months, especially since I viewed some YouTube videos of UFOs taken right here in Portland, just north of where I was, along the east side of the Willamette. Sometimes I shout st the heavens, urging the mystery to reveal itself. Maybe I was heard."],"Country":"United States","files":["/var/www/straped/mufon/html2text/28458.html.txt","/var/www/straped/mufon/org/28458.html"],"Longitude":"-122.669347","map":"<A HREF = \"http://maps.google.com/maps?q=45.533042,+-122.669347(28458)&iwloc=A&hl=en\"> mufon case (28458) map </A>","Object Shape":"Unknown","Date Submitted":"03/29/2011 11:47 UTC","Region":"Oregon","Case Number":"28458","Log Number":"US-03292011-0012","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"None","Latitude":"45.533042","City":"Portland","Viewing Distance":"101-500 Feet"}