{"trends":["There has been one other sighting in Taipei","There were no other sightings in Taipei on or around July 31st 1971","This sighting has never been favorited.",""],"Disposition":"Unresolved","Longitude":"121.559834","Log Number":"TW-03302011-0003","map":"<A HREF = \"http://maps.google.com/maps?q=25.091075,+121.559834(28462)&iwloc=A&hl=en\"> mufon case (28462) map </A>","City":"Taipei","Object Features":"Undisclosed","Object Shape":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28462.html.txt","/var/www/straped/mufon/more/28462_submitter_file1__photo9589atNASA13.png","/var/www/straped/mufon/more/28462_submitter_file2__photo9589atNASA23.jpg","/var/www/straped/mufon/more/28462_submitter_file3__photo9589atNASA33.png","/var/www/straped/mufon/org/28462.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Summary":"NASA Released 10 km Mothership in Photos by Accident in Apollo Archives","Case Number":"28462","Viewing Distance":"Unknown","Country":"Taiwan","Date of the Event":"07/31/1971 12:00 UTC","Latitude":"25.091075","Region":"","divs":["sighting detailsnasa released 10 km mothership in photos by accident in apollo archives when looking over the apollo 15 panoramic images, i came across a photo that has a mothership in it. its not a cloud. clouds do not exist on the moon. so i enlarged the photo and saw that not only was it a ship, it looked a lot like the star ship voyager from star trek. now this ship sits inside the edge of waterman crater, very close to tsiolkovskiy crater. tsiolkovskiy crater is 185 km across long ways and about 160 across the short ways. waterman is unknown. 15 of these ships would fit across the tsiolkovskiy crater the short ways, therefore the mothership is just under 10.6 km in length. waterman crater is located on the moons far side and cannot be viewed directly from earth. now if you google the apollo missions you will see that due to lack of money nasa cancelled the missions 18-20. i have to ask you, what do you think nasa would do if they discovered a 10.6 km long alien vessel parked on the lunar surface on the far side of the moon? yeah, they would set up a retrieval mission or at the least explore the interior for technology that they could take home. please don't take my word for it, instead look at the nasa link i put below. copy the photo to your computer and enlarge it, looking at the far left side. *(info placed in additional evidence section--cms\\sg)."],"Date Submitted":"03/30/2011 04:49 UTC"}