{"files":["/var/www/straped/mufon/html2text/28463.html.txt","/var/www/straped/mufon/org/28463.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=-8.695247,+115.165331(28463)&iwloc=A&hl=en\"> mufon case (28463) map </A>","Object Features":"None","Object Shape":"Diamond, Triangle","Date of the Event":"03/18/2011 01:20 UTC","City":"Kuta","Summary":"Triangle, three main lights, oscillating lights underneath, no sounds, fast","Case Number":"28463","Tags":"City","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsMy friends and I were on holiday in Bali, it was our last night and we were hanging outside by the pool just looking at the sky and talking. All of a sudden one of my friends quickly jumped up and pointed to the NW region of the sky just below the moon and said in excitement \"is that a plane or a UFO?\" by the time I jumped up and looked, the object was more overhead and straight away I knew it was definitely not a plane. It was moving quite fast through the sky, for the height that it was flying. As we watched we were surprised to hear no sound emitted from this object, now we can call it a craft because it was being controlled by some sort of intelligence. As it passed directly over head (moving from NW to SE making a slight turn more to the east) we could see the underbelly of the traingular craft, there were three main lights on the points of the triangle and about 20 lights in the centre pulsating around like a carousel, one of the lights (pretty certain it was the front one) was red. This was an extremely exciting feeling to see something like this, all three of us were standing there with our jaws on the floor in amazement, afterwards we couldnt shake the shocked feeling, I had a lot of trouble sleeping that night, not because I was scared but just out of sheer adrenalin. A couple of things to point out with this as well, it happened on the night of a thunderstorm, the craft came from a patch of sky where there was a lot of lightning, and where it flew to, there was more lightning. This could just be a coincidence, but it was quite weird to see. When my friend first saw the craft he thought it was more of a diamond shape, but when it passed over head it appeared more triangular. It was moving way too fast for me to run inside and get my camera, which is frustrating, especially telling the event to skeptics. After this happened we stood outside for a while, recounting the event and watched two jetliners fly overhead, just to confirm that what we saw was not a commercial airliner. Three main factors that were the big standouts are 1. No noise 2. Extremely fast 3. Oscillating light patterns. From the time we saw it, to the time it flew out of sight it covered the sky in about 20-30 seconds. It entered our sight at 315 degrees NW (trusty old iphone compass) Thank you for having such a great website where regular people can openly discuss their experiences with out the fear of being ridiculed."],"Longitude":"115.165331","Region":"Bali","trends":["There have been no other sightings in Kuta","This sighting has never been favorited."],"Date Submitted":"03/30/2011 09:52 UTC","Weather Factors":"Unknown","Country":"Indonesia","Sighting Duration":"Undisclosed","Latitude":"-8.695247","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Log Number":"ID-03302011-0004"}