{"Object Flight Path":"Straight-line path","Region":"Ohio","Case Number":"28469","Sighting Duration":"00:15:00","files":["/var/www/straped/mufon/html2text/28469.html.txt","/var/www/straped/mufon/org/28469.html"],"Log Number":"US-03302011-0010","trends":["There have been 6 other sightings in Logan","There were no other sightings in Logan on or around May 10th 1994"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.542717,+-82.400279(28469)&iwloc=A&hl=en\"> mufon case (28469) map </A>","Object Features":"Unknown","Summary":"4 SQUARE SHAPED WHITE LIGHTS ARRANGED IN A SQUARE PATTERN.","City":"Logan","Date Submitted":"03/30/2011 06:04 UTC","Disposition":"Insufficient Data","Date of the Event":"05/10/1994 10:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["Sighting DetailsI CAN'T BE SURE OF THE DATE,HOWEVER THIS IS WHAT HAPPEND. MY WIFE & I WERE VISITING MY PARENTS IN LOGAN,OHIO.I BELIEVE IT WAS IN THE SPRING BECAUSE IT WAS A WARM,MOONLESS NIGHT. I DON'T REMEMBER SEEING ANY STARS EITHER, SO IT MUST HAVE BEEN OVERCAST. ANYWAY, WE WERE STANDING OUTSIDE THE BACK DOOR WITH NO OUTSIDE LIGHTS ON. MY DAD SAW IT FIRST AND SAID \"'WONDER WHAT THE HELL THAT IS?\" WE ALL LOOKED TOWARD TOWN,WHICH IS A MILE & A HALF DUE SOUTH OF THE HOUSE AND SAW A WHITE LIGHT IN THE SKY.WE COULDN'T JUDGE THE ALTITUDE OF THE OBJECT,OR THE DISTANCE,BUT WE NOTICED IT WAS MOVING IN OUR DIRECTION. THE POWER LINE RUNS OVER OUR PROPERTY DIRECTLY FROM TOWN,SOUTH TO NORTH AND THE OBJECT SEEMED TO BE FOLLOWING THAT EXACT PATH. AS IT GOT A BIT CLOSER WE COULD SEE IT WAS 2 LIGHTS,OR SEEMED TO BE. AS IT GOT EVEN CLOSER WE SAW IT WAS ACTUALLY 4 SQUARE LIGHTS ARRANGED IN A SQUARE PATTERN. IT MADE ABSOLUTELY NO SOUND THROUGHOUT THIS TIME. AS IT GLIDED OVER THE HOUSE, WE JUST STARED.AS I SAID BEFORE,WITHOUT POINTS OF REFERENCE WE COULDN'T JUDGE ITS SIZE BUT IT FILLED THE SPACE BETWEEN THE TREES BEHIND THE HOUSE & THE ONES ACROSS THE ROAD. WE COULD NOT MAKE OUT A SHAPE THE LIGHTS WERE MOUNTED ON. AS THE THING DISAPPERED PAST THE HOUSE WE JUST STARED AT EACH OTHER. WE NEVER SAW IT \"ZOOM AWAY\" OR ANYTHING BECAUSE WE WERE KIND OF ROOTED IN OUR TRACKS.(NOT PARALIZED OR ANYTHING, JUST SHOCKED) AS WE STARTED TO SPECULATE WHAT THE THING COULD HAVE BEEN, WE HEARD 2 BLACK HELICOPTERS JUST HAULIN' ASS RIGHT OVER THE HOUSE AT TREETOP LEVEL! IT COULDN'T HAVE BEEN A MINUTE OR TWO AFTER WE SAW THE LIGHTS,AND THESE'COPTERS WERE L-O-U-D! SO THEY HAD TO BE MILITARY. THEY HAD TO BE RUNNING ON INFRARED BECAUSE THEY SHOWED NO LIGHTS WHATSOEVER. I KNOW THIS BECAUSE THEY WENT RIGHT OVER THE HOUSE! WE THOUGHT THEY WERE GOING TO HIT THE HOUSE OR THE TREES! ANYWAY,WE NEVER SAW ANYTHING IN THE PAPERS OR HEARD ANYONE TALKING ABOUT IT,SO WE LET IT GO."],"Object Shape":"Square, Rectagular, Unknown","Tags":"City","Source":"MUFON","Latitude":"39.542717","Longitude":"-82.400279"}