{"Disposition":"Insufficient Data","Weather Factors":"None","Longitude":"-111.935005","Case Number":"28461","Viewing Distance":"Unknown","Object Features":"Undisclosed","divs":["Sighting DetailsI decided that I wanted to stand at my bedroom window and look at the stars. It was weird because I never stand and look outside my window at the stars. But I felt like it and I wanted to see a UFO, and i did! All of a sudden I saw a red and white strobe light type object move quickly across the sky. The lights seemed to be right next to each other- maybe one on top of the other and they would blink one at a time VERY quickly- red, white, red, white, etc. It moved from the east to the west (Mesa to Tempe onwards toward Phoenix) I have seen this twice before (but didn't report it till now) I felt excited and my heart was racing. I was kind of perplexed because I wanted to see one, looked outside and I saw one...it all happened so perfectly! While I was watching it I wanted it to slow down so I could see more detail-but it didn't. After the sighting I felt calm- since I've seen this before. And I decided to look on the internet to see if anyone else had reported it. Since i didn't see anything, I decided to report it myself. I lost sight of the object when I couldn't see out the right side of my window anymore."],"Summary":"Bright Red and White flashing object","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28461.html.txt","/var/www/straped/mufon/org/28461.html"],"Region":"Arizona","Date Submitted":"03/30/2011 02:14 UTC","Sighting Duration":"00:00:09","Date of the Event":"03/29/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.42794,+-111.935005(28461)&iwloc=A&hl=en\"> mufon case (28461) map </A>","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around March 29th 2011"],"Object Flight Path":"Unknown","Tags":"City","Log Number":"US-03302011-0002","Latitude":"33.42794","Object Shape":"Flash, Unknown","Country":"United States","City":"Tempe"}