{"map":"<A HREF = \"http://maps.google.com/maps?q=39.962598,+-76.727745(2847)&iwloc=A&hl=en\"> mufon case (2847) map </A>","Date of the Event":"02/03/0001 08:30 UTC","Disposition":"IFO","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around February 1st 0001"],"Country":"United States","Log Number":"","Source":"MUFON","Case Number":"2847","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Object Shape":"Other","Date Submitted":"02/03/0001 08:30 UTC","City":"York","Region":"Pennsylvania","Longitude":"-76.727745","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/2847.html.txt","/var/www/straped/mufon/org/2847.html"],"Object Features":"Undisclosed","Sighting Duration":"00:30:00","Summary":"Unidentified Red, Blue, White and Yellow Lights in","divs":["Sighting DetailsAt approximately 2030, my wife, who was seated upon the living room couch of ourFourth Floor apartment, saw a bright light shining through a crack in the closedblinds, through the bedroom window. Both my wife and myself went to the bedroomwindow to open the blinds and get a better look at the light in the Western sky.Once I realized that I was, occasionally, witnessing yellow and blue lights, andmy wife was viewing orange-yellow, white and blue lights, in some type ofirregular pattern, along with the primary colored light, which was red, I videotaped the lights through the bedroom window, which has an unmatchable screen onits outside.After a couple of minutes of attempting to video tape the Unidentified Lightsthrough the veil of the screen, I dressed for the outside weather, ran down fourstories of stairs and went to a street corner, a short distance to the North andvideo-taped the ONLY lights in the entire night sky.At first, I thought that the red light might be the planet, Mars. Then, I sawother lights shining in the area adjacent to the light, and I realized that itcouldnt be the planet, Mars. Then, I questioned myself as to whether it could bea plane. But, beside the fact that my wife and I, in four years of living in thevery same apartment, have never seen a plane follow that kind of flight patternat night, the lights were glowing much too brilliantly at the distance, between1.000 and 1600 meters from our position, the lights were positioned in the couldcovered sky. In fact, Even when a plane has flown directly overhead, at analtitude of 1,000 feet, at night, I have NEVER witnessed any plane light thatwas as bright as the lights I videotaped in that Western sky.At times, the lights seemed to hover for a minute or so. Then, it would, veryslowly, continue on in its Westward journey, once more.After about ten or eleven minutes of the light show, I went back into theapartment. Then, after a minute of conversing with my wife, I looked out thebedroom window, and the lights had vanished and did not reappear."],"Tags":"City","Latitude":"39.962598"}