{"Summary":"UFO stopped above my tanker when I was fueling a locomotive.","Log Number":"US-08092011-0074","Source":"MUFON","Case Number":"28486","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Region":"North Dakota","City":"Minot","Country":"United States","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=48.24019,+-101.292493(28486)&iwloc=A&hl=en\"> mufon case (28486) map </A>","files":["/var/www/straped/mufon/html2text/28486.html.txt","/var/www/straped/mufon/org/28486.html"],"Latitude":"48.24019","Object Shape":"Cylinder","Sighting Duration":"00:05:00","Weather Factors":"None","Date of the Event":"07/03/2010 12:00 UTC","divs":["sighting detailsi was fueling a locomotive at gavin yard, minot, nd. fueling a locomotive takes about 20-30 min. there is a airport nearby about 4 miles. i saw what look like a plane flying real slow over gavin yard and also flying a little low. there were no blinking lights under the object, just a bright white looked like a landing light for a plane. the height of the object was about one and a half telephone poles high. i was wearing a headlamp on my hard hat and i decided to flash my light at it to signal it just to humor myself. the object changed direction and headed in my direction. the object stopped right above my tanker(semi-tractor) the object made no sound had no wings, no smell that i could remember nor wind. the object was black and cylinder in shape about forty feet in length with a white light pointing down and a little faint red light at the end of it. i got on my radio to see if anyone else could see it but everyone else was inside the tower, as soon as i got off the radio it moved to the south, i watched it for about two minutes and it went slow maybe about 20mph, i looked at my fuel gauge on the locomotive and then looked back to see it and it was gone! the wind was blowing from the west\\south west at 11:15 pm july 3rd, 2010."],"Disposition":"Unknown","Date Submitted":"08/09/2011 12:53 UTC","Longitude":"-101.292493","trends":["There have been 11 other sightings in Minot","There were no other sightings in Minot on or around July 3rd 2010"],"Object Features":"None","Tags":"City"}