{"Summary":"Massive Blue Flash","Source":"MUFON","Longitude":"-91.388315","map":"<A HREF = \"http://maps.google.com/maps?q=44.944755,+-91.388315(28480)&iwloc=A&hl=en\"> mufon case (28480) map </A>","Date Submitted":"03/31/2011 02:03 UTC","divs":["sighting detailsi was driving home from work got off highway 94 and on to highway 29 near chippewa falls, wi. about 1\\4 of a mile on to highway 29 off to my left was a massive blue flash of light. i would say it was probably a mile or two away from me to the east. imagine a gigantic camera flash only 100,000 times more intense and blue. it was extremely bright low to the ground and there was like a blue aura higher in the air. i would say the width of the flash was about 300 feet and the height of the flash was close to 200-300 feet possibly higher. i honestly have never seen anything like this in my life and i can't even tell you what in the hell it was. the second i saw it my head jerked and my heart was racing, i literally said out loud what in the f***? i felt scared...i called the county sheriff department and then when i got home i hopped on google and typed in massive blue flash. the reason why i came here is apparently this has happened elsewhere according to the internet. the question is what the heck was it? there is no way, absolutely no way at all that was a transformer blowing or anything. this was huge! the weather was clear. looking forward to answers."],"Weather Factors":"Unknown","Log Number":"US-03312011-0002","City":"Chippewa Falls","Disposition":"IFO","Latitude":"44.944755","Date of the Event":"03/31/2011 12:00 UTC","Region":"Wisconsin","Case Number":"28480","files":["/var/www/straped/mufon/html2text/28480.html.txt","/var/www/straped/mufon/org/28480.html"],"Viewing Distance":"Over One Mile","Object Flight Path":"Other","Tags":"City","Object Features":"Unknown","Object Shape":"Flash","trends":["There have been 5 other sightings in Chippewa Falls","There was one other sighting in Chippewa Falls on or around March 31st 2011"],"Country":"United States","Sighting Duration":"Undisclosed"}