{"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Region":"Utah","Viewing Distance":"501 Feet - 1 Mile","Summary":"Stationary black disc sitting atop fluffy cloud.","Date of the Event":"03/30/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.762139,+-111.882757(28481)&iwloc=A&hl=en\"> mufon case (28481) map </A>","Longitude":"-111.882757","Object Shape":"Disc","Object Features":"Undisclosed","Disposition":"Unresolved","Latitude":"40.762139","City":"Salt Lake City","Source":"MUFON","divs":["Sighting DetailsI was in seat 4D, a window seat, on a flight from Salt Lake City, Utah to Redmond, Oregon. As we ascended to the skies I took advantage of my window seat and pressed my forehead, snug against the plastic triple pane windows of the small passenger jet. As we climbed the skies and rose above the clouds my hearts begins to race a bit. Nothing too weird. I write it off as elevation sickness. We move along, parralell to the clouds and I see a black dot out of the corner of my vision. I focus on the shadowy object and notice it's disc-like. My goodness! Am I actually seeing a UFO. I stare at the mass, mouth open like a little kid. I say to myself it's a plane. We just took off, it makes perfect sense. The disc doesn't change it's position. I say to myself, if it's a plane, it should be gone when I open my eyes. I close my eyes for three second and open them again. It is still there. Sitting atop the clouds. If my next-seat neighbor hadn't given me the aura of introverted recluse, I would have turned to her for confirmation. After the incident, I felt nauseous the whole flight."],"Case Number":"28481","Log Number":"US-03312011-0003","Date Submitted":"03/31/2011 03:12 UTC","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around March 30th 2011"],"files":["/var/www/straped/mufon/html2text/28481.html.txt","/var/www/straped/mufon/org/28481.html"],"Weather Factors":"Windy, Heavy","Country":"United States","Tags":"City"}