{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Longitude":"-90.192094","City":"St Louis","files":["/var/www/straped/mufon/html2text/28483.html.txt","/var/www/straped/mufon/org/28483.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.636672,+-90.192094(28483)&iwloc=A&hl=en\"> mufon case (28483) map </A>","Case Number":"28483","divs":["Sighting DetailsI work at the casino and was walking across the parking lot towards my car at around 4am. It was very quiet. I saw a light in the distance that was heading towards me. I thought it was a helicopter at first, with it's front spot light on. But as it got closer, I realized it wasn't making a sound. Soon it was almost directly over my head and I just stopped walking and stared at it. I saw no shape of the object itself just the lights. There were 3 orange tinted, triangle shaped lights that were in a triangle formation. Picture two upside down triangles side by side and a third centered below them. Then there were 3 smaller, round, green tinted lights around it. It honestly looked like the Star of David without the lines connecting the lights. It's hard to say how big it was, but I'm thinking not much bigger than a helicopter or maybe a small plane. This thing looked like it was on course to fly right over the casino, which I was excited about because we have search lights on the roof, so I thought I'd be able to get a good look at the physical features of the object. Well, as soon as it got close, it changed course and went around the lights, completely avoiding them. Once on the other side of the casino it continued its original course northward apparently along the Mississippi River. I could see it for some time as the lights were pretty bright and it wasn't very high... maybe the typical height that a helicopter would fly. I finally lost sight of it because of the tree tops."],"Source":"MUFON","Sighting Duration":"00:20:00","Object Shape":"Triangle","Date Submitted":"03/31/2011 03:54 UTC","Disposition":"Unknown","Object Features":"Unknown","Latitude":"38.636672","Region":"Missouri","Object Flight Path":"Path with directional change","Country":"United States","Summary":"Ufo quietly flew over head northbound. It seemed to be following the course of the mississippi river, but it avoided the search lights coming from the roof of the casino.","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around August 31st 2010"],"Log Number":"US-03312011-0005","Weather Factors":"None","Date of the Event":"08/31/2010 04:00 UTC"}