{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/28493.html.txt","/var/www/straped/mufon/org/28493.html"],"Case Number":"28493","Tags":"City","Object Shape":"Sphere","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"04/01/2011 01:17 UTC","divs":["Sighting DetailsMy brother and I were sitting in my fathers car which sat on a hill behind our house. I had the door open for ventillation when I saw a large very bright glowing green sphere shoot across the sky. It had no meteor like tail and to give you an idea of how bright it was, it was daylight and it still had a very bright glow. I remember at the time i compared the size to a full size van so approx 15-20 feet in diameter and it seemed to be no more that 50 feet above the tree line. I was shocked and scared at first so as soon as it passed over the hillside I ran down to tell my father about it only to find my other brother whom had been sitting in the house was frantically telling my stepmother that he had seen the same thing. when I asked him what he had witnessed he said he was sitting on the couch in the house and saw the object thru the living room window hovering over town making irradic changes in movement. When I heard his account of what happend my stomach sank because there is no way he could have seen the same object as I did from inside the house... the obeject i seen went only in a straight line and was not visible from inside the house which means their was either more than one object or we both witnessed the same obeject NAVIGATING. Not knowing what this was has bothered me for quite some time, I would really appreciate it if some one could tell me what we saw. thank you"],"Region":"Kentucky","Disposition":"Unknown","Weather Factors":"Unknown","trends":["There have been no other sightings in Whitesburg","This sighting has never been favorited."],"City":"Whitesburg","Summary":"Very bright green glowing sphere, no tail, approx the size of a full size van, flying low and very fast.","Latitude":"37.118432","map":"<A HREF = \"http://maps.google.com/maps?q=37.118432,+-82.826826(28493)&iwloc=A&hl=en\"> mufon case (28493) map </A>","Object Features":"Undisclosed","Date of the Event":"05/31/1998 12:00 UTC","Source":"MUFON","Longitude":"-82.826826","Country":"United States","Log Number":"US-04012011-0001"}