{"Country":"United States","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=39.961176,+-82.998794(2849)&iwloc=A&hl=en\"> mufon case (2849) map </A>","Log Number":"","Summary":"INFLIGHT COLLISION WITH UFO CRYSTAL SPHERE","files":["/var/www/straped/mufon/html2text/2849.html.txt","/var/www/straped/mufon/org/2849.html"],"Region":"Ohio","Object Features":"Other","divs":["Sighting Details On a bright sunny summer afternoon in 1986, while AT 6,500 feet in my Grumman AA1B and on Port Columbus International radar Ohio, I got permission to vector over to a huge sphere about the diameter of half a football field that was NOT showing on their radar. It was only about 5 miles from them and hovering behind a cloud at 5,000 feet. I collided with the sphere and sustained damage to the outer third of my left wing. What I saw breaking across the leading edge of my wing were perfectly shaped 5 or 6 sided crystals about 4 to 5 inches long that were pointed on both ends. There were millions of them all spaced equally from each other and not moving in any fashion. As I approached the sphere it looked incredibly bright like a second sun but then as I collided with it the light went instantly out and I realized that the light was a reflection of the sun above deflecting through the crystals. These crystals were NOT ice. The collision caused so much drag on my left wing that it caused my plane to flip counter-clockwise and almost cartwheel. To this day I am the only pilot that I know of that has intentionally collided with a UFO and lived. Also to this day, I havent found any way that the sun could possibly have deflected off those crystals at the angle they were all positioned given the sun was almost directly overhead and I was approaching from above. I landed immediately to asses the damage to my wing."],"trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around June 15th 1986"],"City":"Columbus","Disposition":"Insufficient Data","Case Number":"2849","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Object Shape":"Sphere","Tags":"City","Latitude":"39.961176","Date Submitted":"06/15/1986 02:00 UTC","Source":"MUFON","Object Flight Path":"Stationary","Longitude":"-82.998794","Date of the Event":"06/15/1986 02:00 UTC"}