{"trends":["There have been 6 other sightings in Charlottetown","There were no other sightings in Charlottetown on or around April 1st 2011"],"Source":"MUFON","Case Number":"28496","Longitude":"-63.11184","Disposition":"Unresolved","City":"Charlottetown","divs":["Sighting DetailsYesterday and this morning I've awakened fully at 4:00 a.m. which is very unusual for me. After an hour of useless attempts to get back to sleep, I felt the urge to go outside. I sat with my head resting on the back of the lawn-chair and noticed an large bright white star that seemed unusual in that it was the size of Sirius. The rest of the stars seemed small pinpoints in comparison. It was approx. 80 degrees up from the horizon in the southern portion of the sky from where I was sitting. I was aware of it for about 2 minutes as I looked at the rest of the sky. Then it started moving in an arched but mostly straight line to the southeast. There was absolutely no sound and no blinking. It did look about twice as large as when it was stationary...and brighter. It's speed didn't vary, nor did it's line of direction. I watched it for about 15 seconds until it disappeared behind a bank of clouds near the horizon. I've seen this type of silent, white star sightings often over Prince Edward Island and several times star-like objects which are silent and solidly coloured reddish orange."],"Viewing Distance":"Unknown","Summary":"Stationary, big white star in still, dark morning sky which suddenly moved from south to south east.","Weather Factors":"Unknown","Date of the Event":"04/01/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.253147,+-63.11184(28496)&iwloc=A&hl=en\"> mufon case (28496) map </A>","Country":"Canada","Date Submitted":"04/01/2011 04:42 UTC","Tags":"City","Log Number":"CA-04012011-0004","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Region":"Prince Edward Island","Object Flight Path":"Hovering then path","Latitude":"46.253147","files":["/var/www/straped/mufon/html2text/28496.html.txt","/var/www/straped/mufon/org/28496.html"],"Object Features":"Unknown"}