{"Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"21-100 Feet","Longitude":"-91.149311","Object Shape":"Circle, Disc","Date Submitted":"04/01/2011 02:55 UTC","files":["/var/www/straped/mufon/html2text/28495.html.txt","/var/www/straped/mufon/org/28495.html"],"City":"Cornell","Region":"Wisconsin","Tags":"City","Weather Factors":"None","Case Number":"28495","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.167188,+-91.149311(28495)&iwloc=A&hl=en\"> mufon case (28495) map </A>","Latitude":"45.167188","Date of the Event":"11/24/2009 01:00 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn the following statement I will include two separate UFO sightings. One of them was sighted by My grandfather,grandmother, and uncle. The other sighting was sighted by myself. It was the 09' deer gun season. My grandfather, grandmother, and Uncle were deer hunting in Cornell, WI near Firth Lake and were camping off a road called Moses Lake Road. Approximately 1 am my grandfather spotted what looked to be about 30 lanterns outside hovering above Firth Lake. He stepped out of the camper and to his amazment this was a craft...a disk shaped craft hovering over Firth Lake approximately 20 feet above the lake and the craft was approximately 40-50 feet wide. My uncle stepped out of the camper and was also amazed at the sighting. He grabbed a flashlight and flashed it at the UFO. My grandfather yelled at him to not do that. My grandmother did see it from inside the camper, however, she didn't go outside. She pulled the covers over her head and hid. My grandfather immediately knew what it was as now he states when he was in the air force \"they\" had a hangar were they kept a \"captured\" UFO. He called it NFO for the longest time, but he meant UFO. Approximately 10 minutes when by and the craft as they say shot what seemed to be 100,000 mph into space and didn't even make a sound. The second sighting was sighted by myself, however, I was bow hunting with my uncle. Approximately late October 2010 at around 4pm. I was in my tree stand and I could see Firth Lake through the trees pretty clearly. All of a sudden a white orb comes out of nowhere and is circling the lake. It was moving up and down as well. This lasted for about 5 minutes and then the white orb disappeared into the woods. I had such a clear sight of it, it was just unreal. I knew there was no explanation for whatever this was. I was pretty shook up and I went to my truck early. My uncle came out and asked me why I was out of the woods already. I told him, he said \"hmmm maybe it was a duck boat?\" This is the same Uncle who tells the story of the first UFO incident by the way. Anyways I told him no, absolutely not, I saw this thing very clearly literally going in FAST circles around the lake and moving up and down. I haven't been back to that hunting area since then. They still hunt there."],"Summary":"Firth Lake UFO's","Log Number":"US-04012011-0003","Country":"United States","trends":["There have been no other sightings in Cornell","This sighting has never been favorited."],"Disposition":"Unknown"}