{"Longitude":"-71.056843","Latitude":"42.363251","Weather Factors":"None","Country":"United States","Source":"MUFON","Region":"Massachusetts","Tags":"City","City":"Boston","map":"<A HREF = \"http://maps.google.com/maps?q=42.363251,+-71.056843(28498)&iwloc=A&hl=en\"> mufon case (28498) map </A>","Log Number":"US-04012011-0006","Sighting Duration":"Undisclosed","Date of the Event":"07/14/1986 09:30 UTC","divs":["sighting detailsi was spending a very nice summer night on a fairway at belmont country with my girl friend. the night was as clear as it possibly could be. we were looking up at the stars and noticed movement. at first i thought it must be a satellite but the light was much to bright and big. we then noticed two more of the exact same object\\light. what was really strange was the positioning in the sky, direction of travel and exactness of speed and spacing of the objects. it was not like they were close by any means. one object was coming from the north horizon, one from the south and the other from the west. if they were in the earths atmosphere, it was not by much. the distance they had to cover was huge. as i said before, they were all traveling at the same speed and toward each other. the north and south object were traveling directly towards each other and the object from the west was headed toward were they were going to intersect. neither of us had ever seen anything like this before. it took the objects approximately 5 to 10 minutes to cover half of the distance of the night sky. as they got close, we thought they were going to collide. amazingly, the moment they came together, it almost seemed as if they became one and they were gone. i have told a lot of people about this event over the years. looking back, i guess i was more of a skeptic than a believer. not the case any since. with the new alien\\ufo shows on tv, i have been thinking about it more. that is also why i am reporting it now. i know we are not alone and if my case can help coo berate another then i have helped. thank you, *(wit's first name deleted--cms\\sg)."],"Object Flight Path":"Straight-line path","Date Submitted":"04/01/2011 10:24 UTC","Disposition":"Unresolved","Case Number":"28498","files":["/var/www/straped/mufon/html2text/28498.html.txt","/var/www/straped/mufon/org/28498.html"],"Object Features":"Unknown","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around July 14th 1986"],"Summary":"Three star like objects traved toward each other met and shot off","Object Shape":"Star-like","Viewing Distance":"Unknown"}