{"Object Shape":"Diamond","files":["/var/www/straped/mufon/html2text/28508.html.txt","/var/www/straped/mufon/org/28508.html"],"trends":["There have been 8 other sightings in Bristol","There were no other sightings in Bristol on or around March 30th 2011"],"Object Features":"Window(s)","Source":"MUFON","divs":["Sighting DetailsMy boyfriend and I were driving down Lake Avenue from Southington, CT heading towards Bristol CT around 1:30 AM the morning of March 30th, 2011. I was sitting in the passenger seat and my boyfriend was driving when he noticed a very peculiar star in the sky, as I identified it as being the brightest thing in the sky you could tell it wasn't a solid color, but was red and white and moved around in the sky differently from anything else, he thought it was a planet at first but the object quickly appeared to be very large because it came towards us at amazing speed as we continued down the road and he began to slow the car down. The object did not make a sound, and was defiantly not a plane or a helicopter or anything else that could of been explained away, the shape seemed fluid as it got closer, the white lights seemed to be pointy and protruded from the center of the object kinda like spikes , my boyfriend has better eyes than I do and as it hovered just above the treetops he could see definition of the object and described it as saucer-like with windows in the center, from what we both could see the center of the object was bright red, and was surrounded by 6 very bright but smaller white lights, 4 of them on the sides and one on both the top and bottom, the object was about as wide as the 2 lane street we were on, and about twice as tall. As soon as I realized that the object was not a man made helicopter or of earthly origin I became very frightened and had my boyfriend turn the car around and flee in the other direction. The saucer was so large and bright that it lit up the tops of the trees, and it also had what seemed like a beam of light that came down to the ground as it approached us, it was only a few hundred feet away. It seemed aware that we were watching it and also it seemed as if it was curious about us as well, my boyfriend was mesmerized by it and would of continued to approach it had I not become stricken with fear and demanded we get as far away from that saucer as possible, I have never been so afraid of something before in my life. As we drove away the object was still very bright and visible in our rear-view mirrors, this thing defiantly was not a man-made object. My boyfriend and I have had UFO sightings in the past, 2 times last year in the same neighborhood in which we had the most recent encounter. The 2 previous sightings were last year of 2010, in the spring and summer, both sightings occurring during the day. On one occasion we saw 4 strange single-white-light flying objects that seemed to dance in and out of the clouds then come close down to earth, and dart around some more. This went on for several minutes and then the objects disappeared. During the other sighting, we saw a single bright white light hovering right on the top of the mountain, as our home was at the bottom of the mountain, we had a pretty clear view to the top, we saw the light hang in the air for almost an hour, it had the same kind of white color that the object with 6 lights and one red one in the center had, it stayed at the top of the mountain and kind of hovered higher then lower and higher again, and eventually it settled down into the treetops. The other sightings have not bothered me or shocked me the way the most recent sighting has. There was no question of what I saw approach us a few days ago, it was terrifying and very real. I really wish I had my camera that night, just so people would believe me, but I know what my boyfriend and I saw was not human. Whats really going on out there? ? I would like to know if anyone has had any similar sightings in the area"],"Longitude":"-72.94257","Sighting Duration":"Undisclosed","Date of the Event":"03/30/2011 01:39 UTC","Tags":"City","Summary":"6 Bright white lights surrounded by one large red light","Case Number":"28508","Region":"Connecticut","Country":"United States","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Log Number":"US-08092011-0023","Weather Factors":"Unknown","Date Submitted":"08/09/2011 07:53 UTC","Object Flight Path":"Straight-line path,Path then hovering","City":"Bristol","Latitude":"41.673135","map":"<A HREF = \"http://maps.google.com/maps?q=41.673135,+-72.94257(28508)&iwloc=A&hl=en\"> mufon case (28508) map </A>"}