{"Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"00:05:00","Disposition":"Hoax","Date of the Event":"04/01/2011 08:00 UTC","Region":"Colorado","Tags":"City","Summary":"Four distinct very bright lights in the sky along the front range of Colorado on 4/1/11 at 8pm","Log Number":"US-04022011-0003","City":"Lakewood","Case Number":"28509","Latitude":"39.71138","Date Submitted":"04/02/2011 02:53 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28509.html.txt","/var/www/straped/mufon/org/28509.html"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.71138,+-105.075403(28509)&iwloc=A&hl=en\"> mufon case (28509) map </A>","Object Features":"Unknown","Country":"United States","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around April 1st 2011"],"Viewing Distance":"Unknown","Object Shape":"Unknown","divs":["sighting detailswe were driving home in littleton around 8:00pm on 4\\1\\11 and saw two *very* bright lights in the sky. initially we thought they were two helicopters with spot lights that were only 10-20 or so blocks away. the lights were about as bright as you would expect if the spot light was pointed toward you from this distance. as we started moving again, we realized the objects were much further away--what looked to be over golden\\lakewood, but high in the sky. at this point, we both realized we were seeing something very unusual. both lights appeared to be completely still. the lights rotated through different colors subtly, but were mainly white. we decided to keep driving to see if we could make them out better. a third light appeared. then a fourth. they seemed miles apart from each other, forming a perfect square\\diamond formation. they were separate because you could see empty sky\\clouds between them. they all remained completely still. this all happened over a couple of minutes, then the lights all moved north and beyond the horizon, out of site. other drivers were looking and pointing at them from their cars. the most striking part was the quality of the lights, which were all incredibly bright--very different than standard airplane\\helicopter lights. there were no particular sounds associated with these objects. there were also no other lights in that area of the sky at the time, which might be indicative of an aircraft practicing flare drops."],"Longitude":"-105.075403"}