{"Date of the Event":"04/01/2011 10:15 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/28503.html.txt","/var/www/straped/mufon/org/28503.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.687528,+-84.968913(28503)&iwloc=A&hl=en\"> mufon case (28503) map </A>","Summary":"triangle with one red light on the left and one green light on the right and a bright white light @ the tip!","Country":"United States","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","City":"Sherman","Date Submitted":"04/01/2011 10:55 UTC","Source":"MUFON","Log Number":"US-04012011-0010","Object Features":"None","divs":["Sighting DetailsI was driving north on north littlefield rd to a friends house when i saw what i thought was a helicopter going across the sky to the west, it then went behind some really thick tall area of woods and i could no longer see it i lost vision of it @ river road. Then as i continued to drive north still i started to approach basline i started to see rhis object again plain as day it was probaly 1mile off the ground as it was coming back over the trees towards me then it turned horizontally over an open field and i noticed it wasnt a helicopter it was a triangle so i listened and could hear no sound! As im watching this thing out my drivers window it kept right even with me for about a half mile i was going approx 45mph then i started to get scared so i hit my brakes n the object started to move quite fast so i hurried about another 300yds down the road to my friends pulled in parked my van and got out, at this time it had just passed above their apt so as you can imagine im a lil shook up so then i get back into the van and once again lose sight of the object! So i start to head back south from 835 n littlefield rd and go about 300 yds back to the empty field and once again here was that same triangular shape coming over top of the trees! I then turned right down baseline to attempt to find it to get a better look but without success it dissapeared!"],"Object Flight Path":"Path with directional change","Case Number":"28503","Tags":"City","Longitude":"-84.968913","Latitude":"43.687528","Sighting Duration":"Undisclosed","Weather Factors":"Does Not Apply","Region":"Michigan","trends":["There have been no other sightings in Sherman","This sighting has never been favorited."]}