{"Object Flight Path":"Straight-line path,Path with directional change,Unknown","Tags":"City","City":"Boulder","Region":"Colorado","Log Number":"US-04012011-0013","Summary":"Witnessed three","files":["/var/www/straped/mufon/html2text/28506.html.txt","/var/www/straped/mufon/org/28506.html"],"Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-105.260656","Weather Factors":"Windy","Case Number":"28506","divs":["Sighting DetailsAt approximately 10:10pm as my husband and I were watching television, he looked out of our balcony door (to the outside) and said, \"What's that light?!\" I didn't respond immediately, but his reaction was strong enough to get me off the couch to check it out. When I looked I saw nothing. He said, \"What?! It's gone? That's crazy.\" He didn't believe me so he got up and we both went outside onto our balcony for a better look (we live on the second floor, on the back or Eastern facing side of the building). There was some scant cloud cover, but through breaks in the cloud, I saw what appeared to be a red, twinkling light, ascending very quickly. It wasn't moving straight up, but it was an incredibly severe ascension. We also noted two other similar reddish twinkling (not really flashing) lights moving just as quickly in other directions. One of them travelled due South, and unfortunately we couldn't track the other as well - I'm afraid I don't know what became of it. Our primary focus was the ascending light because it was the most baffling in behavior. There was also an airplane in our line of vision which appeared normal. In comparison to the lights we saw it seemed as though it were flying at a snail's pace. We have a limited sky view from our balcony so it wasn't long before we couldn't see anything anymore except the plane. When we came back inside (and as I immediately got on the computer) I asked my husband what he initially saw. He described a very bright, intense white light that appeared to be moving our direction (East to West). He assumed it was the headlights of an aircraft though the light was unusually bright for an aircraft that was likely to be quite a distance away. I think this is why he was so surprised mere seconds later when I looked and didn't see anything. The whole \"event\" lasted maybe only 30 seconds - definitely not longer than a minute. After we came inside, I looked at the clock on our computer which read 10:12pm. We were both completely baffled by what we saw and had different ways of dealing with it. He kind of didn't think it was a big deal, but conceded that it was very strange. I, on the other hand, remembered the reports from Lafayette last week and was looking online to see if anyone else saw what we saw or if NORAD, or somebody, was performing scheduled exercises. I also posted something on facebook, which people thought was an April Fool's prank. I didn't know what to do, where to report it, if I should report it, or how to explain what we saw. I kind of assumed that other people would have seen the same thing given the population of this area. My guess is that these lights were quite far from our location which leads me to think people in other communities certainly could have witnessed these fast flying lights. Unfortunately we have no photos or video; it happened so quickly and neither of us wanted to step away. I really hope this is helpful to somebody and I also hope I haven't made anything more difficult by not reporting it immediately."],"trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around March 31st 2011"],"Disposition":"Unknown","Object Features":"None","Latitude":"40.016856","Date Submitted":"04/01/2011 11:05 UTC","Object Shape":"Star-like","Date of the Event":"03/31/2011 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.016856,+-105.260656(28506)&iwloc=A&hl=en\"> mufon case (28506) map </A>","Source":"MUFON"}