{"Sighting Duration":"Undisclosed","Date Submitted":"04/03/2011 11:36 UTC","City":"Kokomo","Weather Factors":"Unknown","Log Number":"US-04032011-0004","Longitude":"-86.125373","Date of the Event":"04/03/2011 12:00 UTC","Object Flight Path":"Hovering then path","Disposition":"Unknown","Summary":"Choose a digital video camera","map":"<A HREF = \"http://maps.google.com/maps?q=40.491227,+-86.125373(28519)&iwloc=A&hl=en\"> mufon case (28519) map </A>","Object Features":"Other","Country":"United States","divs":["Sighting DetailsI had just gotten home from taking boyfriend to the er and pulled in the driveway, when i happen to notice this round light going in a circle over the neighbors back yard. My first thought was a spotlight, however the more i looked at it, the light was a very small circle compared to that of the normal track of spotlight and also there was no light trail going to it. It was extremely quite outside, i had thought maybe someone is outside with some sort of light or something but again no trail going to it. There was not a sound outside so no way it could have been a plane or helicopter that didn't even cross my mind. i continued to stare at this because i couldn't figure out what i was seeing. I then realized that light was not going up but coming down from the sky. the reason i say this is because there was thick cloud cover and i happened to noticed the clouds were in front of this light. I thought about running in and grabbing camera cause i wanted to be able to show my boyfriend but i never made it inside as i just stood there staring at it trying to figure out what it was. after i few more minutes i went inside. this whole process was approximately 5-10 minutes long. I am unsure of what i seen but no matter what i can seem to figure out any logical explanation and seeing that the light was coming down and the clouds were going in front of it kind of knocks out anything i had thought of to try and explain what this was."],"Object Shape":"Circle","Viewing Distance":"Unknown","Region":"Indiana","Latitude":"40.491227","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around April 3rd 2011"],"Tags":"City","Case Number":"28519","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28519.html.txt","/var/www/straped/mufon/org/28519.html"]}