{"Summary":"DON'T KNOW WHAT IF ANY IT WAS!","Country":"United States","Log Number":"US-04022011-0006","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.95781,+-88.950076(28512)&iwloc=A&hl=en\"> mufon case (28512) map </A>","Source":"MUFON","Date of the Event":"04/02/2011 11:08 UTC","trends":["There have been no other sightings in Dana","This sighting has never been favorited."],"Object Features":"Unknown","Latitude":"40.95781","Case Number":"28512","City":"Dana","Viewing Distance":"21-100 Feet, Unknown","Object Shape":"Circle, Unknown","Region":"Illinois","divs":["sighting detailsi live in farm country on a road not used a lot. was on my was to the store in town. was an almost cloudless morning with bright sun. as i left my driveway heading west about half way between my home and 8th road approx. 5\\8 of a mile i noticed a circular shadow on the ground, stretching across 3rd road ( my road i live on ) and also into each field on the north and south side of the road. best guess the circular shadow was about 150 to 200 feet across. i did not notice any thing in the air. as i drove threw the shadow at about 45 mph, my engine stalled, i coasted thru the shadow and brought my car to a stop. noticed all gauges were inoperable, got out of my car, shadow still present, looked up and around saw nothing but almost clear sky. tried to restart my car with no success, wouldn't even crank. figured a bad battery connection, looked all was okay. as i looked back at the shadow, it just seemed to up and disappear. got back into my car and it now started right back up. have had a weird feeling in my person ever since that moment. a queezy type feeling, shaking some as well. the shadow lasted about 8 minutes on the same spot, if it were clouds they would have moved during that time. figure i'd tell someone, it's evening and still feeling queezy, after this. ufo? something else?"],"files":["/var/www/straped/mufon/html2text/28512.html.txt","/var/www/straped/mufon/org/28512.html"],"Object Flight Path":"Stationary,Unknown","Disposition":"Unresolved","Date Submitted":"04/02/2011 08:38 UTC","Longitude":"-88.950076","Sighting Duration":"Undisclosed","Weather Factors":"None"}