{"Latitude":"33.805887","Case Number":"28514","Summary":"Stationary pinpoint of bright white at high altitude during the day.","files":["/var/www/straped/mufon/html2text/28514.html.txt","/var/www/straped/mufon/org/28514.html"],"Object Features":"Undisclosed","Object Shape":"Unknown","divs":["Sighting DetailsI was out in my backyard admiring a beautiful incredibly clear blue sky and that the jet going overhead was only leaving a 'real' vapor trail as opposed to the chemtrail spew when I saw that there was a bright white pinpoint spot of something at a much higher altitude than the jet as the jet and trail obscured the object before I noticed it. The fact that it was a small pinhead point of white in the bright blue of the sky and absolutely stationary made it odd. I spotted it between power lines so I had a reference point to track movement if it moved in a direction and the space between the object and the lines changed. It didn't. And the pinpoint of white did not appear to be rising either like say, a helium balloon might. It didn't waver in any way from its position.No birdlike attributes or flapping or soaring, no wings like a plane and it certainly wasn't flying anywhere. Even a satellite would be moving in it's orbit but you can't see those in the daytime sky. I had company staying with me so I called them outside as well and they observed the same object and behaviour. I watched for several minutes, went to find a camera but battery was dead, used the bathroom and when I got back out it had vanished. There was nothing else in the airspace during the time we observed it except the jet that originally flew overhead. No clouds, no other aircraft. I live under an approach flight path for small fixed wing aircraft to a large metropolitan airport and can view the main approach for the heavy traffic in as well from the front porch. I see all kinds of aircraft from vintage to stealth, all day, everyday. This object was at very high altitude as the commercial jet was quite high as well, probably at 29-35K feet on a long range flight at cruising altitude. I didn't see it arrive at it's position and I didn't see it 'leave' but 3 of us saw it sitting up there for a good 15 minutes or so, unmoved in it's position. I can't say that I or we 'felt' anything but curiosity. I'm not claiming it to be an alien anything, but it wasn't a plane, bird or balloon. Thank you for your time to read this."],"Sighting Duration":"Undisclosed","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.805887,+-118.156256(28514)&iwloc=A&hl=en\"> mufon case (28514) map </A>","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around April 1st 2011"],"Date of the Event":"04/01/2011 10:45 UTC","Longitude":"-118.156256","Viewing Distance":"Unknown","Region":"California","Log Number":"US-04022011-0008","Date Submitted":"04/02/2011 10:26 UTC","City":"Long Beach","Object Flight Path":"Undisclosed","Tags":"City","Country":"United States"}