{"Object Shape":"Other","Country":"United States","Summary":"Blinkies in the sky. Amber orbs in the woods and hovering above trees. Fakers hovering above fields and powerlines","files":["/var/www/straped/mufon/html2text/28510.html.txt","/var/www/straped/mufon/org/28510.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsWe were cruising along Androstic Rd. towards Uschak Rd. Seeing blinkies we made a right to the top of the hill on Uschak and pulled into a driveway across from Fairview Lane. We saw two orange balls rise from the woods in between us and the Elks golf course. They came out one at a time, hovering and then quickly moving then stopping along the ridge line in the direction of Route 22, finally disappearing below the hill on the 981 side. At the same time hovering red craft with reddish colored lighting were just to the right of the driveway hovering about 200 feet apart from each other. We moved when a faker (mimicking conventional craft) came right over us fairly low, no sound. Feeling nervous we traveled in the direction of Pandora Rd on Uschak Rd. and stopped at the fields by the old railroad bed and power lines. Two erratically blinking orange balls were in the woods at roughly ground level between us and Stewart road. At the same time, 2 hovering fakers surrounded by blinkies were along the power lines in the same direction. This is the same kind of phenomenon a lady in Murrysville, PA is seeing and has documented numerous hours of on video. We will try and get photos and video of this stuff on our next outing."],"City":"Latrobe","Date of the Event":"03/29/2011 12:00 UTC","Longitude":"-79.372591","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"04/02/2011 03:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.322521,+-79.372591(28510)&iwloc=A&hl=en\"> mufon case (28510) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been 4 other sightings in Latrobe","There were no other sightings in Latrobe on or around March 29th 2011"],"Tags":"City","Case Number":"28510","Log Number":"US-04022011-0004","Latitude":"40.322521","Region":"Pennsylvania","Object Features":"Unknown"}