{"divs":["Sighting DetailsMy Family and I was driving home to Ellettsville, Indiana from Indianapolis, Indiana after a ultrasound appointment and a day of shopping and dinner! It was around 9pm and I am tired and feet are aching, my husband is eager to get home as well cause he as a head cold and wanted to watch the basketball game! We are on Highway 37 going South between Indianapolis and Moorseville When my husband looks out the front window of my minivan right above the dash and yells \"What is that\"? I look and was shocked I couldn't believe what I was seeing. I am surprised I didn't crash. I saw a very large triangle shaped with rounded corners flying very low between the two highways of 37. It looked like it was flying straight and slow with no side to side or up and down motion but only got to see it for a minute if that cause it was flying North and I was driving South at 60 mph. My husband and children said they saw what I saw but my husband noticed it cause he was in the passenger said and noticed the flashing light hovering very low! There was a large also rounded trianglar shaped light under it that was very bright and flashing. I looked in my rear view mirror and could see it flashing going over cars and headed to Indianapolis! I wanted to turn around and follow it but my husband wouldn't let me! We was all just in shock I think just stunned about what we just saw and confused but knew there was no way that was a flying craft from our world.I thought about it all night was just surprised that it was very quiet and very low to the ground. I would never had seen it if my husband hadn't said something! I am sure others had to see it as well there was lots of traffic but it was very dark and most people might of just thought it was some kind of airplane but I have never seen an airplane fly that low or be that quiet or that large! I thought in the past a few times that I saw a UFO from a distance but this one was up close and personal so I know for sure now I am not crazy and others are not crazy that there is other kinds out there! I really wished we could of gotten a photo or video of it but it will for sure be in our minds forever!"],"Weather Factors":"Unknown","Latitude":"39.773926","Summary":"Large rounded trianglar shape with flashing lights flying low between Highway 37 in Indiana","Date Submitted":"04/03/2011 11:21 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28518.html.txt","/var/www/straped/mufon/org/28518.html"],"Tags":"City","Object Shape":"Triangle","Object Features":"Undisclosed","Case Number":"28518","Country":"United States","Longitude":"-86.155884","Disposition":"Insufficient Data","Log Number":"US-04032011-0003","Viewing Distance":"Unknown","Date of the Event":"04/02/2011 12:00 UTC","City":"Indianapolis","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around April 2nd 2011"],"Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=39.773926,+-86.155884(28518)&iwloc=A&hl=en\"> mufon case (28518) map </A>"}