{"Tags":"City","Object Shape":"Cylinder, Disc","divs":["sighting detailsi run *(link moved to additional evidence section--cms\\sg) a paranormal blog, and i took a trip to sedona, az last week for fun and to see if i could capture anything on film for my blog. i had been told by locals that things often show up on camera near the \"vortexes\" that don't show up to the naked eye. as my parents and i hiked up bell rock, i took several pictures of the sky and carefully scanned first to make sure i wasn't photographing any planes, hawks or helicopters. the sky was totally clear to my eye when i took this. upon reviewing my photos last night, i found several anomalies only in the skies of sedona photos, but this was the strangest one. it appears to be disc-shaped, grayish or silver, with some kind of white vertical cylinder in the center. i have attached the un-edited, full-size original photo, as well as a close-up of just the object. to find the ufo in the full-size, look at the center of the sky area, then slightly up and slightly left."],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Unknown","Summary":"UFO over Bell Rock Sedona, AZ, only on camera","Case Number":"28523","Date Submitted":"04/03/2011 04:48 UTC","Sighting Duration":"Undisclosed","Latitude":"34.87083","Region":"Arizona","Disposition":"Unknown","City":"Sedona","Source":"MUFON","Longitude":"-111.7562","Object Features":"Unknown","Log Number":"US-04032011-0008","Weather Factors":"Unknown","Date of the Event":"03/28/2011 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/28523.html.txt","/var/www/straped/mufon/more/28523_submitter_file1__ufobellrock.jpg","/var/www/straped/mufon/more/28523_submitter_file2__disccloseup.jpg","/var/www/straped/mufon/org/28523.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.87083,+-111.7562(28523)&iwloc=A&hl=en\"> mufon case (28523) map </A>","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around March 28th 2011","This sighting has never been favorited.",""]}