{"trends":["There have been no other sightings in Rahim Yar Khan","This sighting has never been favorited."],"Log Number":"PK-04032011-0010","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWhere were you and what were you doing at the time? In the fall of 2009, I had been living with my family in the North Pakistan city of Lahore for four months as my father, whose a provincial bureaucrat from the Sindh province of Pakistan, was sent by the Sindh government there for some professional training. He completed his training on January 10, 2010 which was the date we set off for our home province and its capital Karachi. We travelled by highway and I used my Sony Handycam DCR-HC96E to record the passing scenery from the window of my car. I was using the memory card mode of the camera to make it easier to upload the pictures and video to my computer instead of the miniDV tape mode. It took us four days to reach Karachi. On the way, we stayed in the cities of Multan, Rahim Yar Khan and Sukkur. What made you first notice the object? We were somewhere on the highway between the cities of Multan and RYK, more closer to the latter, when I saw the phenomenon while recording the local scenery. I recorded the phenomenon for as long as it was visible. I also took a picture of it. What did you think the object was when you first noticed it? When I was recording it I thought it was probably the afterburn of a missile or Air Force jet. I could not identify or see any vehicle at the other end of this streak of fire. I even took a picture of the phenomenon but still couldn't identify the source. I was also intrigued by the absence of any missile test announcements by the Pakistan govt and military. Describe the object and its actions and motions. It seemed to be the fire trail or afterburn of a missile or a jet. It was quite far yet clearly visible in the sky. I could not make out any visible source of it. How did you lose sight of the object? It simply disappeared. I would like to reiterate that I have a video recording of the phenomenon as well as a picture. If approached by your representative, I would gladly share both."],"City":"Rahim Yar Khan","Source":"MUFON","Region":"Punjab","Object Shape":"Bullet, Missile","Date Submitted":"04/03/2011 09:09 UTC","Latitude":"28.416417","Longitude":"70.29975","files":["/var/www/straped/mufon/html2text/28525.html.txt","/var/www/straped/mufon/org/28525.html"],"Date of the Event":"01/12/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.416417,+70.29975(28525)&iwloc=A&hl=en\"> mufon case (28525) map </A>","Summary":"Probable UFO over Northern Pakistan","Disposition":"Unresolved","Country":"Pakistan","Viewing Distance":"Unknown","Object Features":"None","Case Number":"28525","Weather Factors":"Unknown","Tags":"City"}