{"Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"00:00:07","Disposition":"Insufficient Data","Object Features":"Undisclosed","Latitude":"40.428869","Log Number":"US-04032011-0006","Tags":"City","files":["/var/www/straped/mufon/html2text/28521.html.txt","/var/www/straped/mufon/org/28521.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.428869,+-86.898256(28521)&iwloc=A&hl=en\"> mufon case (28521) map </A>","City":"West Lafayette","Country":"United States","Longitude":"-86.898256","Object Flight Path":"Undisclosed","Region":"Indiana","Date Submitted":"04/03/2011 03:00 UTC","Source":"MUFON","divs":["Sighting DetailsI was at Ross Hills Park playing disc golf and football with friends, and I was watching the sunset too because I thought it was pretty with all the jet vapor trails streaking the golden sky. Also, it was so quiet that you could hear the jet engines making muffled sonic booms in the distance. But then I saw something I've never seen before. (It should be noted that this area is somewhat close to an airport so jets are very common.) There was a shiny object in the western sky, about the same altitude as the jets, and I wondered what it was. At first I thought, \"Oh, it's just a plane without a vapor trail. But it wasn't making a sound, and I couldn't see a tip or a tail and it was thicker. It almost seemed to be turning and giving off its own light, but I just kept watching and stopped what I was doing. The object was moving at a modest pace, and the glare of the sunset made it very visible. I didn't think too much of the object until it accelerated inexplicably. Not only did it accelerate across the sky, but it seemed to move away from the Earth; either that, or it just became decreasingly opaque with the increase in speed. Either way, it vanished very smoothly. I have seen jets and shooting stars during the day and night, and this was neither."],"Date of the Event":"04/02/2011 12:00 UTC","Summary":"Shiny Disc illuminated by a sunset glare","trends":["There have been 7 other sightings in West Lafayette","There were no other sightings in West Lafayette on or around April 2nd 2011"],"Object Shape":"Disc","Case Number":"28521"}