{"Object Flight Path":"Undisclosed","Summary":"Low Altitude Barely Audible Bright Solid Yellow Red Pulsating Lights Chevron/Triangle Craft","Sighting Duration":"Undisclosed","Disposition":"IFO","Log Number":"US-04032011-0014","Object Shape":"Chevron, Triangle","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around April 3rd 2011","This sighting has never been favorited.",""],"divs":["sighting detailswas walking along a power line walking trail in horsham pa circa 2-2.30am april 3rd 2011 (almost a week after nearby willow grove naval air station transferred all aircraft elsewhere due to closure, so there should be no aircraft flying that low nearby here). i stopped on the trail because a house's outside lights kept flicking on and off and i thought someone might have been messing around but after walking away and watching from distance after a fifteen minute walk away they were still flicking off and on, so i figured it must have been electronic malfunction. the lights were not dimmed like a dying bulb would look like. so i return to the trail where this home is located very nearby and i notice in the sky four bright, yellow lights flying extremely low over a corn field\\patch of woods. lights were located, from this vantage point, one on each wing tip. if you were to divide the wingspan from tip to tip into three equal sections, the other two lights would be at the points where the middle section meets the two outer divisions. flying i believe to be around half a mile, at the most, in the air, coming from south east going north west i was basically looking straight at its head\\nose section at the point. i initially thought it was hovering over the field but subsequently came to realize it was just moving very slowly. at the altitude it was flying i believe a car could easily outdistance it driving at forty miles\\hour. i quickly grabbed a pair of 16x binoculars and by then, noticed the craft appeared to be gaining altitude and possibly speed, as well. it flew directly overhead of me and that is when i began to hear the propulsion. it was low, rumbling but not loud enough to wake the residents of the community it passed over. note: sound was only audible as it flew overhead. right overhead i noticed what appeared to be an obtuse triangular shape, with the obtuse angle being the nose. although i don't believe it was truly a triangle because the back end seemed to be bent inward toward the nose, similar to the f-117 - chevron shaped almost. again it was dark out and i could have mistaken it. i noticed that rather than four lights there were six that i can definitely remember. once it was overhead i saw that the wing tips had two yellow lights where the diagonal would meet the obtuse angle. there was a blinking red light underneath, in the center of craft that turned on and off about every second or two. also there were definitely what appeared to be masses of something on either side of the red light under the 'wings'. they reminded me of those detachable bombs from wwii movies, but again i could not confirm what they were. it flew off at a higher altitude and was eventually barred from view by trees. all the while and subsequently the lights of this house were still flickering. i'd also like to note this is the second encounter with this same craft at the same location within a week, all details the same. the initial encounter happened on march 28th 2011 before midnight, i believe between 11pm and midnight. i'll be out there with a camera to document as it seems this is a fairly frequent travel route. i have included a very rough drawing of the craft made in ms paint with a view from straight ahead and one from underneath."],"Tags":"City","Date Submitted":"04/03/2011 10:16 UTC","Source":"MUFON","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=39.959785,+-75.157179(28529)&iwloc=A&hl=en\"> mufon case (28529) map </A>","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Philadelphia","files":["/var/www/straped/mufon/html2text/28529.html.txt","/var/www/straped/mufon/more/28529_submitter_file1__triangle.jpg","/var/www/straped/mufon/org/28529.html"],"Date of the Event":"04/03/2011 02:20 UTC","Case Number":"28529","Longitude":"-75.157179","Latitude":"39.959785","Viewing Distance":"Unknown","Country":"United States"}