{"Object Features":"Undisclosed","divs":["Sighting DetailsOn this night, three young women sat in bed staring out the window. after a few miniuts of looking, two of the three look away. but just as they are doing so the one girl still looking sees a blue light, about the size of the stars above. she said it appered about 60 feet away from the window. She then made the other girls look up and watch, but only one kept looking with her. as the two girls watched, they once again saw the light. It was electric blue, with a shimmer. it stayed about 10 seconds befor it disared again, it had this same pattern each time. is really freeked out all of the girls. shortly after that, they were still watching, and the dot appered again, except this time, is streched into a beam of blue light. the girls became very scared, slamed the window. after the quite paniking, got back in the bed, turned off the light again, their was a growl. it was similar to a cat crossed with a dog, but it was dark, maleviolent, and sinister. it was quick and fast, bt extreemly scarie. it was almost like it was in the room with us, but it sounded almost like it was coming from the window."],"Object Shape":"Circle, Cylinder, Disc, Oval, Other","Date Submitted":"04/04/2011 10:22 UTC","Source":"MUFON","Sighting Duration":"00:15:28","Country":"United States","Viewing Distance":"Unknown","Region":"Georgia","Case Number":"28531","map":"<A HREF = \"http://maps.google.com/maps?q=33.752135,+-84.382762(28531)&iwloc=A&hl=en\"> mufon case (28531) map </A>","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around April 3rd 2011"],"Tags":"City","Object Flight Path":"Undisclosed","Log Number":"US-04042011-0002","Date of the Event":"04/03/2011 12:00 UTC","Longitude":"-84.382762","files":["/var/www/straped/mufon/html2text/28531.html.txt","/var/www/straped/mufon/org/28531.html"],"City":"Atlanta","Weather Factors":"Unknown","Latitude":"33.752135","Disposition":"Hoax","Summary":"series of small blue dots appearing in different places at different times."}