{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"03/24/2011 07:00 UTC","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.168218,+-93.99635(28539)&iwloc=A&hl=en\"> mufon case (28539) map </A>","Source":"MUFON","City":"Mankato","Log Number":"US-04042011-0010","Disposition":"IFO","Region":"Minnesota","Longitude":"-93.99635","Country":"United States","files":["/var/www/straped/mufon/html2text/28539.html.txt","/var/www/straped/mufon/org/28539.html"],"Object Features":"Undisclosed","Tags":"City","Latitude":"44.168218","Date Submitted":"04/04/2011 08:46 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"(sg) *Link moved to Additional Evidence Section--CMS/sg.","divs":["sighting detailsi submitted a portion of this video in march. i have decided to release the full version, except for audio. i have lots of similar video of this activity. the fist portion was shot in near infra red, then regular shot, and that near infrared again. the final shot was takin with a different camera(sony108) with a better zoom as the object is flying away. it was traveling very slow as you can tell by thelength of ther video. this is really typical activity. nothing special. i have seen these thousands of times. these watchers are morphing into planes and are hidden in plane sight from an unsuspecting public. it is really sad to know that peoiple are so unaware of the deception, and so little truth is made available to them. this video was shot on digital 8 tape, which is not able to be edited. it is real. it is common in mankato. i could go out tonight and get another similar video. that is how common it is. it is obvious that the truth is being hidden. it is also obvious the public really doesnt care anyway, so why tell them? right? *link moved to additional evidence section--cms\\sg."],"trends":["There have been 18 other sightings in Mankato","There was one other sighting in Mankato on or around March 24th 2011"],"Case Number":"28539"}