{"trends":["There have been 7 other sightings in Covington","There were no other sightings in Covington on or around March 31st 2011"],"Summary":"covington","Object Shape":"Oval, Star-like","Viewing Distance":"Unknown","Country":"United States","Region":"Kentucky","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"03/31/2011 09:55 UTC","Source":"MUFON","Tags":"City","divs":["Sighting Details There is and has been orbs in the sky over covington since at least September 1st of last year. Friday night I was playing video games when I suddenly felt fear come over me and I felt that I should go look out side to see if the orbs were visible and they were. One in particular stood out from the rest It seemed as though i was tiring to get my attention. It was moving up and down and then in in circles and then left to right and then it would just start to wonder away but the abruptly move back to its position. this orb was showing similar mannerisms as other orbs I have observer in the past and what seems to be a recurring theme is that while some orbs positioned in and around the area above the city do not move much they all flicker red and white light but the one that is active is actually gradually moving across the sky at a very slow rate of speed I would not able to guess the rate of speed accurately but if I had to guess I would say less than 1000 ft per hr.! I called up a friend of mine that lives close by to see if he could verify the orb however he was on his way to work and told me that he saw channel 12 news vans on Winston ave. because of a car accident. So I decided that since the accident was only about 2 blocks away that they might want to check out the orb (actually this orb and the others were probably visible from where the news vans were located and all they would of had to do is look up!) So I called the 12 \"action\" hotline and A lady answered the phone and I asked her if there was a news crew on Winston ave. and she said yes and so I asked if the thought they might be interested in filming a UFO? and as soon as I said that the orb I was watching shot straight up like a flash and this lady's attitude changed and she told me that \"We\" are only interested in \"serious\" news and hung up on me. I got the impression that she and at least 12 news personnel are told to dismiss any information regarding UFOs!,and that she could not talk to me any further or risk getting in some sort of trouble. However as soon as the call was over the orb came back. It dropped down past the clouds by Fort Right and gradually worked its way back into its flightpath."],"Log Number":"US-04042011-0004","files":["/var/www/straped/mufon/html2text/28533.html.txt","/var/www/straped/mufon/org/28533.html"],"Date Submitted":"04/04/2011 04:18 UTC","Longitude":"-84.504324","City":"Covington","map":"<A HREF = \"http://maps.google.com/maps?q=39.090321,+-84.504324(28533)&iwloc=A&hl=en\"> mufon case (28533) map </A>","Weather Factors":"Unknown","Case Number":"28533","Latitude":"39.090321","Object Flight Path":"Undisclosed","Disposition":"Unknown"}