{"Summary":"faint solid light surrounded by faint \"cloud\" passed across approx 90 degrees arc of sky W to E in seconds without sound, very high","Disposition":"Unknown","Tags":"City","Latitude":"33.69037","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around April 2nd 2011"],"Log Number":"US-04042011-0008","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.69037,+-78.883694(28537)&iwloc=A&hl=en\"> mufon case (28537) map </A>","Region":"South Carolina","Date of the Event":"04/02/2011 09:00 UTC","Object Flight Path":"Straight-line path","Longitude":"-78.883694","divs":["sighting detailsmy daughter & i went outside of a cabin in a clearing at myrtle beach state park approx. 9 pm on saturday 4\\2\\11 where i was pointing out to her the big dipper & north star. a fast-moving white object, the same size and light intensity of a distant star in a faint irregular cloud that was much larger than the star and was a little lighter than the dark background sky, caught my eye as it moved from west-north-west to approx. east. the point of light was too small to make out any shape, and the light intensity did not change (i.e., did not pulsate or flash). speed and direction were constant. i watched it for 4-5 seconds before it disappeared behind trees. i heard no noise from the object. it seemed very distant (many miles to light years) and one could have very easily missed it. the arc it took across the sky in which i watched this was about 90 degrees, as i recall, before it disappeared behind trees. it was perhaps 70-75 degrees above the horizon to the northwest when i first noticed it. the cloud did not extend from the rear of the light, but was irregular and generally oblong, with most but not all of the cloud being behind the point of light; some of it may have been in front of the light. i've seen meteor showers and many meteors. i've seen a couple of satellites. relative to the meteors and satellites that i've seen, this was way too slow for a meteor yet way too fast for satellites, and was surrounded by the odd cloud. i was so surprised and it was so fast that i was speechless and couldn't even tell my daughter to look (not that she would have spotted it anyway in that time). i was trying to figure out what this could be. after the sighting, we walked down to the beach and looked up again and saw a small flock of large light-colored birds flying very high parallel to the beach--migrating north, i assumed--i ruled out a flock of birds, for the \"ufo\" that i saw earlier had a point of light in it, it was much faster and distant, and its cloud seemed to have a uniform density. weather conditions at the time were cool (50's), clear sky, and calm."],"Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/28537.html.txt","/var/www/straped/mufon/org/28537.html"],"Object Shape":"Other","Country":"United States","City":"Myrtle Beach","Sighting Duration":"00:00:05","Date Submitted":"04/04/2011 08:14 UTC","Case Number":"28537","Viewing Distance":"Over One Mile"}