{"files":["/var/www/straped/mufon/html2text/28540.html.txt","/var/www/straped/mufon/org/28540.html"],"Longitude":"-86.613811","map":"<A HREF = \"http://maps.google.com/maps?q=30.428411,+-86.613811(28540)&iwloc=A&hl=en\"> mufon case (28540) map </A>","Object Flight Path":"Straight-line path,Path then hovering","Weather Factors":"Unknown","Object Shape":"Triangle","Country":"United States","Date of the Event":"04/03/2011 09:00 UTC","Log Number":"US-04052011-0001","Source":"MUFON","divs":["Sighting DetailsYesterday, Sunday,I had just completed a 2 day kite festival in Ft Walton Beach, Florida. We were staying at the 4 Points Sheridan hotel right on the beach. I was supposed to meet some new friends I met at the fest around 9 pm to night fly with me. At approx. 8:50 pm, I went out to the beach to fly one of my two line stunt kites with about 6 flashing different colored LED lights attatched.(I had done this same exact thing Friday night-April 1st from 8:30pm till Midnight and saw nothing) People tell me all the time my kite looks like a UFO when flown at night with lights. Ok, so, I'm flying my kite on the beach, not really a whole lot of people were out on the beach at the time. I had my kite in the air,lights flashing, ipod on, and was just flying and tricking my kite. It was a totally clear night, millions of stars, it was beautiful and peacefull. A small group of people walked past me looking at the colorful night display I was putting on. When they were about 100 ft. in front of me ( I know this because my kite lines are 85') I noticed movement in the sky out the right corner of my eye. First initial thought was a falling star. When I fully looked in the direction of the movement, I FROZE, What I saw defied explanation. 4 lights in a triangle pattern, 1 in front, 3 a distance behind it, all in a row moving south over the Gulf coming from land. . . . . They blended in perfectly with the stars above, same brightness, size, intensity, everything. You could see stars through it. I immediately let go of my kite handles, ripped off my ipod and screamed at the group of people ahead of me and asked if they see that? What, they asked? A ufo I replied. They must have thought I was joking, because they just ignored me and kept walking. When I looked back up in the sky, I saw the lights had stopped. They were still there, but stopped moving. I stood there not moving and observed the lights for about 20 minutes, too shaken up to do anything else. About that time, my new acquantiances showed up, and I relayed the story, OMITTING the fact that what I saw was STILL THERE. We continued flying for another 20 or so minutes and every 5 or 10 seconds, I would gaze up and it was still there. My wife shows up about this time and I tell her the same story omitting the fact it was still there. I didn't tell them it was still there because I didn't want to sound too foolish, and the fact that I wasn't sure what I had seen, and what I kept looking at was in fact still there even thought it looked exactly like stars. Finally, I couldn't take it anymore and pulled my wife aside intent on showing her the lights. Much to my surprise, they were gone!!! My wife says to me, Oh yeah, I saw them too ( while they were stationary ) and thought it was the little dipper. But she too noticed that it wasn't there anymore!! This was way too large to be a airplane,totally silent, but the massiveness of size was what really freaked me out. What did I see? anyone ever see anything similar?"],"Latitude":"30.428411","Region":"Florida","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date Submitted":"04/05/2011 12:19 UTC","City":"Fort Walton Beach","trends":["There have been 24 other sightings in Fort Walton Beach","There were no other sightings in Fort Walton Beach on or around April 3rd 2011"],"Object Features":"None","Case Number":"28540","Summary":"4 lights in a triangle pattern, 3 in the back in a row, 1 up front","Tags":"City","Viewing Distance":"Unknown"}