{"Country":"United States","Date Submitted":"04/05/2011 02:10 UTC","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-04052011-0008","Longitude":"-93.703259","trends":["There has been one other sighting in Aitkin","There were no other sightings in Aitkin on or around April 30th 1968"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.537113,+-93.703259(28547)&iwloc=A&hl=en\"> mufon case (28547) map </A>","Summary":"I was going to town to see movie, car stopped on road ufo passed over car .","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/28547.html.txt","/var/www/straped/mufon/org/28547.html"],"Latitude":"46.537113","Disposition":"Unknown","Object Shape":"Disc","Object Flight Path":"Straight-line path","divs":["Sighting DetailsARE FAMILY WERE ALL UP NORTH AT OUR CABIN ON SPIRIT LAKE. AFTER BEING THERE FOR A DAY, I WANTED TO GO INTO AITKIN TO SEE A MOVIE THAT EVENING,I LEFT THE CABIN JUST AS THE SUN WAS SETTING,I ONLY DROVE ABOUT ONE HALF MILE FROM CABIN ON CTY ROAD 28 GOING WEST TO HWY 169,I WAS HALFWAY UP A SMALL HILL AND THE CAR JUST STOPPED IN THE MIDDLE OF THE ROAD, I REMEMBER TRYING TO START THE CAR AND NOTHING HAPPENED. I JUST HAPPENED TO LOOK OUT MY WINDOW ON DRIVERS SIDE ,SUDDENLY THIS BRIGHT RED GLOWING DISC ABOUT FOUR FEET THICK AND ABOUT FIFTEEN FEET ACROSS CAME RIGHT OVER THE TREES FROM THE SOUTH,PASSED RIGHT OVER THE CAR FROM LEFT TO RIGHT OVER THE TREES ON THE OTHER SIDE OF THE ROAD HEADING NORTH TOWARDS AITKIN. IT MADE NO NOISE AND IT WAS JUST ABOVE THE TREES MOVING VERY SLOW BUT STEADY, IT ONLY LASTED ABOUT 30 SECONDS OR LESS. I DID NOT KNOW WHAT TO DO, IT TOOK A COUPLE OF MINUTES AND I WAS ABLE TO START CAR AGAIN,I QUICKLY TURNED THE CAR AROUND AND WENT BACK TO TELL MY PARENTS, THEY LAUGHED AT ME AND DID NOT BELEIVE ME,I WAS MAD THAT THEY DID NOT BELEIVE ME,VERY MAD. AS SOON AS IT CAME OVER THE TREES I KNEW WHAT IT WAS,NOTHING FROM THIS EARTH. CRAZY I KNOW BUT TRUE . I WOULD TAKE A LIE DETECTOR TEST !!!!!!!!!!!!!!!!!!!!! THANKS FOR LISTENING I WILL NEVER FORGET WHAT I SAW."],"Weather Factors":"None","Source":"MUFON","Tags":"City","Region":"Minnesota","Date of the Event":"04/30/1968 08:00 UTC","Case Number":"28547","City":"Aitkin"}