{"Case Number":"28551","Disposition":"Unresolved","Longitude":"-113.576776","Country":"United States","Log Number":"US-04052011-0012","map":"<A HREF = \"http://maps.google.com/maps?q=37.097318,+-113.576776(28551)&iwloc=A&hl=en\"> mufon case (28551) map </A>","Object Features":"Unknown","Object Shape":"Unknown","Weather Factors":"None","Tags":"City","trends":["There have been 6 other sightings in St George","There were no other sightings in St George on or around June 30th 1987"],"Object Flight Path":"Unknown","Region":"Utah","divs":["Sighting DetailsI was driving home from ogden utah on the I-15,i was with my daughter,friend and brother in-law.getting close to St. George around 2to3 hundred miles to go i started to get sleepy, every one else was tired so i told them that i was going to pull over and rest. as i closed my eyes a bright light came over our car, i could not move or talk, i was scared, a tall suffer kind of guy approached our car and i began to float out, he wore a dark swimsiut and told me that everythung was alright, not to be scared. that they just wanted to do some experiments, i saw 7 to 8 tall figures standing behind him, i saw the car clock and it read 1207. i saw my brother in-law next to me leaning against the passenger door ,my friend and daughter wre in the back asleep.the next thing i remember was being placed back into the car. everthing went silent and then i sceamed, everybody was screaming for me to get the car out of there. I would like to talk to someone about this, hopefully under hypnosis. this happened in 1987 and every time i want to talk about this the others don't. If we can talk i know the oters will talk also. CAN YOU PLEASE HELP!. Please Contact!"],"files":["/var/www/straped/mufon/html2text/28551.html.txt","/var/www/straped/mufon/org/28551.html"],"Source":"MUFON","Sighting Duration":"01:07:00","City":"St George","Date Submitted":"04/05/2011 07:57 UTC","Date of the Event":"06/30/1987 12:00 UTC","Viewing Distance":"20 Feet or Less","Summary":"dirving home stpoped to rest ,bright light ,floated out, told everything was o.k put back in car.","Latitude":"37.097318"}