{"Tags":"City","Log Number":"NO-04052011-0011","Source":"MUFON","Latitude":"59.008719","Viewing Distance":"Over One Mile","Region":"Ostfold","Object Flight Path":"Hovering then path,Other","Object Features":"Other","Summary":"Ufo in the skies over Norway","Longitude":"11.590195","map":"<A HREF = \"http://maps.google.com/maps?q=59.008719,+11.590195(28550)&iwloc=A&hl=en\"> mufon case (28550) map </A>","Country":"Norway","divs":["Sighting DetailsAround 5 days after the main airport in Norway was closed for 2 hours because of a UFO hovering in 8000 feet, i took this picture on my roof, i'm a proffesional aviation photographer, and had a plan to take picture of a plane coming in for landing at an airport 30 miles from where i live, i had a plan to take a picture with long shutterspeed so i could get the red stripes from the beacons on the plane across the picture with the stars in background, but another light around 2-3 miles away from me in around 2000-3000 feet of height caught my eyes, i then forget about the plane and put camera in position and took what i think is a clear proof of a UFO, i have the original RAW file, which can not be done any changes too, but the picture i show you here i have put my copyrights on, for safety and copyright reasons, I was looking at this object for around 2-3 minutes i think, and then it suddenly took off in a speed and climb rate not possible for any aircraft i know about, and i know a lot of aircraft types,because of my work. the picture is taken from my home adress, the small dots you see around on the picture is the stars, also this gives a good view of the size of this UFO, the area was complete silent."],"files":["/var/www/straped/mufon/html2text/28550.html.txt","/var/www/straped/mufon/more/28550_submitter_file1__Img_1509_UFO_ostfold_WM_TI.jpg","/var/www/straped/mufon/org/28550.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date of the Event":"03/29/2011 11:17 UTC","Date Submitted":"04/05/2011 06:24 UTC","City":"Halden","trends":["There has been one other sighting in Halden","There were no other sightings in Halden on or around March 29th 2011","This sighting has never been favorited.",""],"Object Shape":"Disc, Oval","Case Number":"28550"}