{"Latitude":"39.833271","files":["/var/www/straped/mufon/html2text/28553.html.txt","/var/www/straped/mufon/org/28553.html"],"Object Features":"Undisclosed","Country":"United States","divs":["Sighting DetailsI was looking at the moon off my back porch. I took notice of all the stars and as I was looking at the stars I turned to the left and saw 4 very large bright bright White lights, It was rectagular shape (long straight across) and it looked like the 4 lights lined up next to each other (with a little space in between) as if it was one large object . At first It looked as if it was still, so I ran into get my camera (because it was close by) turned it on ,went to take the picture and the batteries acted like they died, you know the sound of the camera when the batteries are dying, so at that time the object had turned to go toward the front of my property,so I ran out that way , just got a slight look at the side, it was gone! it probably all lasted about 2 minutes. So then I thought let me check my camera to make sure I didn't get a picture, then I thought oh I won't be able to because it probably dead, well it wasn't, just for the heck of it I took a couple of pictures of my floor after that and it didn't die. hmmm, It looked as if it was probably 600 - 800 ft away. I live in Airville , in between Delta and FawnGrove ,Pa. Its also called Mason Dixon Line. Border of Md and Pa. I would love to know of any other reporting of this. I have never seen anything like this before. I am kind of sorry now that I wasted that time going getting my camera when I could have watched it more to be able to have a better description of it . But I was excited."],"Viewing Distance":"Unknown","Longitude":"-76.407791","Object Shape":"Square, Rectagular","Source":"MUFON","Summary":"Rectagular with 4 large bright white lights","City":"Airville","Log Number":"US-04052011-0014","map":"<A HREF = \"http://maps.google.com/maps?q=39.833271,+-76.407791(28553)&iwloc=A&hl=en\"> mufon case (28553) map </A>","Date of the Event":"04/05/2011 08:55 UTC","Date Submitted":"04/05/2011 10:09 UTC","Weather Factors":"Unknown","Case Number":"28553","Tags":"City","Disposition":"Unknown","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Airville","This sighting has been favorited 1 time."],"Region":"Pennsylvania","Sighting Duration":"Undisclosed"}