{"Object Flight Path":"Path with directional change","Tags":"City","Disposition":"Unknown","Date Submitted":"08/09/2011 10:54 UTC","Weather Factors":"Unknown","divs":["sighting detailsi'm eastern time so it was just about the end of dusk, i was outside smoking a cigarette looking up at the stars\\moon as i usually do whilst smoking.i saw this object flying really low in the sky (750-1250 feet) and making no noise whatsoever. no jet engines and i think i would have even been able to hear a propeller if it was a small aircraft. anyway, it looked sort of triangular in shape with three lights on it, two where white and one was green. hard to judge its size but i would estimate it was about 60x80 yards. i saw it fly behind two symmetrical buildings, so my view was obscured for a few seconds, then it passed by the two buildings. i looked away for a few seconds, then saw it fly by the buildings in the same area and direction i had seen it fly not 2 seconds ago. i don't know of any human made craft that could change direction like that. i got this sense like \"that's not human\" when i saw it, this gut reaction. i know it won't mean much here but my intuition is usually quite sharp. after i had this feeling like i saw something unusual and somewhat exciting."],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Case Number":"28555","Latitude":"41.817031","Summary":"Triangular UFO, 2 white/1 green light","Log Number":"US-08092011-0049","Sighting Duration":"00:00:04","Object Shape":"Triangle","Region":"Connecticut","Country":"United States","Longitude":"-72.246873","Date of the Event":"04/05/2011 08:05 UTC","files":["/var/www/straped/mufon/html2text/28555.html.txt","/var/www/straped/mufon/org/28555.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.817031,+-72.246873(28555)&iwloc=A&hl=en\"> mufon case (28555) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Mansfield","There were no other sightings in Mansfield on or around April 5th 2011"],"City":"Mansfield"}