{"files":["/var/www/straped/mufon/html2text/28568.html.txt","/var/www/straped/mufon/org/28568.html"],"City":"Kirby","Weather Factors":"None","Case Number":"28568","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Latitude":"34.26075","map":"<A HREF = \"http://maps.google.com/maps?q=34.26075,+-93.644653(28568)&iwloc=A&hl=en\"> mufon case (28568) map </A>","Longitude":"-93.644653","Source":"MUFON","Date of the Event":"04/06/2011 09:30 UTC","Summary":"Cluster of red and blue lights with one flashing white light","Region":"Arkansas","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Kirby","This sighting has never been favorited."],"Date Submitted":"04/07/2011 12:20 UTC","Object Shape":"Other","Disposition":"Unknown","Country":"United States","Log Number":"US-04072011-0001","Object Features":"Unknown","divs":["Sighting DetailsAt around 9:30pm I walked outside to enjoy the night air, it's around 65 degrees and clear enough to see the Milky Way. I was standing on the front porch steps and looked south out over Lake Greeson and a flashing light caught my eye. It flashed white about 3 times (maybe once per second) so I just thought it was a plane but then I noticed it turned into 2 flashing white lights. One all I saw was a steady red light with a flashing white light heading south towards the Nashville,Ar direction and was behind the tree line pretty fast. The other was heading north in my direction with the bright flashing white light with a cluster of what looked like three red lights on the left side and a cluster of three blue lights on the right. I could not make out a shape but it was close enough I should have heard something if it was a single engine plane. In the skyline it took it about 3-4 minutes to travel fifty or so yards then it turned west and went out of site over the trees. Again there was not any sound, it was so quiet I could hear a vehicle driving on the mountain across the lake and air liners that frequently fly over."],"Tags":"City"}