{"Country":"United States","files":["/var/www/straped/mufon/html2text/28560.html.txt","/var/www/straped/mufon/org/28560.html"],"divs":["Sighting Detailsi was coming back from visiting family in Las Vegas. it was about 7:55 or 8:10 in the night. i was looking out on the side of the road towards the mountains and there was lots of planes in the skies that night. i was feeling angry because we had to leave and the fact that we could have left on monday. i saw a triangle shaped craft that was like about 700 or 800 feet high. this happened while we were in the car and my dad,mom,sister,brother, and myself who were there too. my sister was the one that noticed it first because she was amazed at the amount of planes that night. this triangle thing that i saw was just there and not moving and it had three white lights at each angle. it was strange because this thing wasn't moving and all the other planes were. and about 25 minutes my mom noticed like flashing lights on the bushes to the side of the car and she pointed to me what she was seeing and about 30 seconds later all these small lights started popping out of no where and it was really weird because there was no one on the side of the road that night. at first i thought i was seeing things but everyone in the car saw it. later on we told a few people what we had seen and they told us someone was experimenting o the bushes....i thought thats impossible because i know exactly what i saw. but i guess that about it i think if people were to ask me questions about it i could explain it better."],"Summary":"a triangle and later on weird flashing lights","Object Shape":"Flash, Triangle, Other, Unknown","Case Number":"28560","Log Number":"US-04062011-0004","Sighting Duration":"Undisclosed","Latitude":"36.118796","Object Features":"Undisclosed","Region":"Nevada","Tags":"City","City":"Las Vegas","Date of the Event":"04/03/2011 08:03 UTC","Disposition":"Unresolved","Longitude":"-115.170166","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.118796,+-115.170166(28560)&iwloc=A&hl=en\"> mufon case (28560) map </A>","Viewing Distance":"Unknown","Date Submitted":"04/06/2011 12:24 UTC","Source":"MUFON","trends":["There have been 229 other sightings in Las Vegas","There were 3 other sightings in Las Vegas on or around April 3rd 2011"]}