{"map":"<A HREF = \"http://maps.google.com/maps?q=34.959521,+-84.952724(2857)&iwloc=A&hl=en\"> mufon case (2857) map </A>","Sighting Duration":"01:00:00","Weather Factors":"Windy","Longitude":"-84.952724","Source":"MUFON","Latitude":"34.959521","divs":["Sighting DetailsI had just bought a Cannon 8mm camcorder and had seen this done with camcordersa few years ago.I went out to the front of my house on 02.01.04 at about 1030am to 1230pm.I filmed the eve of my house for focusing purposes and for referrances as theSun was behind my house and only shooting in the rays of the Sun,to the rightsof the rays. As I was looking from around the view finder, I noticed a shadowcoming up over my house, from the SW and as I found it in the view finder, ithad a light shadow on the bottomwhich you can definitly see the UFO go overhead as I filmed it. It is disk orsaucer shaped. After it passed over, I started focusing again in between thepoints of small christmas light hangers on my roof and a tree in the back of myyard.While doing this there are on filmseveral and I mean several transparent, saucer or disk shaped objects flying inand out of the view finder. One comes in from the left goes half way in the viewfinder then makes an 180 degree turn back toward the left of the view finder.They appear to come from the right going to the left and bottom to top of theview finder. Motion can be seen,wobbling,spinning on its axies. They aretransparent and then it looks loke either they change or the Sun reflects onthem to small star like lights moving toward and up. Their shape is very clearlyof a saucer or disk."],"Date Submitted":"02/01/0001 11:15 UTC","files":["/var/www/straped/mufon/html2text/2857.html.txt","/var/www/straped/mufon/org/2857.html"],"Log Number":"","Case Number":"2857","Region":"Georgia","Object Flight Path":"Straight-line path","Summary":"VIDEO TAPED 30 MINUTES OF UNIDENTIFIED FLYING OBJE","Tags":"City","Object Features":"Other","trends":["There have been 2 other sightings in Cohutta","There were no other sightings in Cohutta on or around February 30th 0001"],"City":"Cohutta","Disposition":"IFO","Object Shape":"Unknown","Viewing Distance":"Unknown","Country":"United States","Date of the Event":"02/01/0001 11:15 UTC"}