{"Country":"United States","Viewing Distance":"Unknown","Log Number":"US-04072011-0010","trends":["There have been 27 other sightings in Kansas City","There were no other sightings in Kansas City on or around April 6th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.121983,+-94.624114(28578)&iwloc=A&hl=en\"> mufon case (28578) map </A>","Sighting Duration":"Undisclosed","Longitude":"-94.624114","Region":"Kansas","files":["/var/www/straped/mufon/html2text/28578.html.txt","/var/www/straped/mufon/org/28578.html"],"Date of the Event":"04/06/2011 08:30 UTC","Weather Factors":"Unknown","Case Number":"28578","Latitude":"39.121983","City":"Kansas City","divs":["Sighting DetailsWednesday April 6, 2011 approximately 8:30pm CST. I was stopped at a stop sign at the intersection of 8300 and Parallel Parkway, Kansas City, Kansas looking towards the north. I saw 5 amber glowing lights in a \"V\" formation going from the northeast to the southwest. I thought these were not FAA standard lighting for aircraft, and the fact that they were amber glowing lights with no strobe or flashing effect (constant glow). My next thought was to get to higher ground to get a better visual of the event. Then I realized I had to drive the 3 blocks west on Parallel to get my camera to document the event immediately. Upon entering the garage door, I ran into the house and had my wife retrieve the camera telling her \"there are UFO's flying over the house right now\". We went into the driveway and could see above and slightly north of our home two amber lights and started taking camera video. The objects passed directly above us with no sound at all. They were in a constant distance from each other. As it went over, the back light seemed to radiate around the other light as they headed in tandem southwest over Parallel Parkway. The farther south they went the leading light seemed to flicker and disappear, then the following light dissipated the same fashion. My feeling during the event was \"I need to get home to get my camera to document as it goes over my neighborhood\". My wife got on the internet and tried to see if anyone else was seeing this phenomenon. She ended up calling Fox 4 television to see if anyone else had reported this, they wanted the video. It was posted to Facebook, no one called back to confirm our information."],"Source":"MUFON","Object Shape":"Boomerang, Circle","Summary":"5 Amber lights in a \"V\" shape over Kansas City Kansas","Disposition":"Unknown","Tags":"City","Object Flight Path":"Path with directional change","Object Features":"Unknown","Date Submitted":"04/07/2011 05:56 UTC"}