{"Longitude":"-84.288494","files":["/var/www/straped/mufon/html2text/28587.html.txt","/var/www/straped/mufon/org/28587.html"],"Object Shape":"Circle, Triangle","Weather Factors":"None","trends":["There have been 10 other sightings in Richmond","There were no other sightings in Richmond on or around April 4th 2011","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Region":"Kentucky","Log Number":"US-04082011-0005","Tags":"City","Source":"MUFON","Object Features":"Unknown","Latitude":"37.757657","divs":["Sighting DetailsOn April 4th I was visiting Richmond KY. As I was enjoying the country life and driving to see my family, I was taken by the beautiful sunset so I asked my daughter to roll down the window and take a photograph of the sunset for me. It was only upon looking at the series of photographs the next day that I noticed the bright star in the upper right corner of all the shots and decided to zoom in for a closer look. Much to my surprise, it was not a big bright star but clearly a big bright white triangle shaped object. Upon further examination, I noticed that directly below the triangle, to the right of the light post, is a black circle object that does not look like a plane or helicopter. The most significant thing about the place I took the photographs is that it is directly adjacent to the Blue Grass Army Depot - which houses large munition storage, chemical weapons, and a new chemical weapon destruction facility. My thoughts about these photos are either, good job America on the new technology, or, heads up US Government and military, we have visitors eyeing Blue Grass Army Depot and weapons of mass destruction. Americans better hope the intelligence behind this spy craft is ours, and is protecting the airspace around these weapons of mass destruction. Let us hope that BGAD is not being targeted for mass destruction of America."],"Summary":"Bright Large Triangle UFO, and Circle UFO captured on Photo","Disposition":"Unknown","Date Submitted":"04/08/2011 07:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.757657,+-84.288494(28587)&iwloc=A&hl=en\"> mufon case (28587) map </A>","Country":"United States","Object Flight Path":"Unknown","Case Number":"28587","City":"Richmond","Date of the Event":"04/04/2011 07:30 UTC","Sighting Duration":"Undisclosed"}