{"Weather Factors":"None","Tags":"City","Source":"MUFON","Log Number":"US-04092011-0001","Disposition":"Unknown","Viewing Distance":"21-100 Feet","Object Features":"None","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Longitude":"-83.14563","Latitude":"42.610179","Date of the Event":"05/05/2005 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.610179,+-83.14563(28589)&iwloc=A&hl=en\"> mufon case (28589) map </A>","divs":["sighting detailsat around 10 to 11 pm myself and 5 others witnessed a ufo flying north from across the backyard of my home, at the time, in troy. in total there were 7 of us all standing outside yet only 6 could see the object as it blended in almost perfectly with the night sky. this large group of people included my own brother and another man who would later join the air force of which he is currently enlisted. we were in the back yard of the home smoking cigarettes when an individual frantically pointed to the sky asking something like, \"what is that?!\" i remember the date because it was not only cinco de mayo but also 5\\5\\05. had there not been others around to witness the event i likely would have never told anyone about it. the object was flying extremely low. it was traveling so slowly that if one of us had chased after it we would have been able to keep up. it was not a large craft. it was a triangular object that gave off absolutely no sound or reflection of the lights below. it almost completely blended into the night sky in a way that seemed like it was mimicking it. it gave off no lights and had no lights on it that i remember seeing. however this event did occur nearly 5 years ago. the object traveled across the entire length of my yard and crossed over south boulevard\\ 20 mile rd into rochester hills. because it was so difficult to see against the night sky everyone lost sight of it after it had only traveled a short distance. less than 100 yards. the object flew directly above us and never changed speed. when the object crossed south boulevard i could see that it was flying only slightly higher than the telephone poles it was passing over. it also released no vapors or any kind of trail that i could see behind the object. even though one of the people in the group was unable to see the object it is likely due to his poor vision or unwillingness to accept what was occurring around him. other than shock there were no feelings i experienced during this incident. i know what i saw and so do the others who witnessed this event. there is no way this aircraft was earth technology. it made no noise and seemed to cloak itself against the sky. if the object was under intelligent control it would have easily been able to see us gawking at it. it was literally flying so low as it was passing over us that i could have thrown a baseball at it and hit it. this event deeply disturbed me for some time after. it is only until recently that i discovered this website and thought it was necessary that i share my experience."],"City":"Troy","Sighting Duration":"00:00:30","Country":"United States","files":["/var/www/straped/mufon/html2text/28589.html.txt","/var/www/straped/mufon/org/28589.html"],"trends":["There have been 18 other sightings in Troy","There were no other sightings in Troy on or around May 5th 2005"],"Summary":"Small, silent, triangular shaped UFO witnessed by 6 people flying extremely close to the ground in Troy, Michigan on Cinco De Mayo 2005.","Region":"Michigan","Date Submitted":"04/09/2011 04:39 UTC","Case Number":"28589"}