{"Weather Factors":"Unknown","divs":["Sighting DetailsOk So I'm looking over this hill we call 4 corners cause there are 4 roads on the top of the hill leading diffrent ways. I took these photo's when I saw a plane passing by but I picked up other lights next to it and also 2 weird images below what I thought was a plane to my extent. The lights in the middle should of been a plane but the lights on the right side are not. This was very strange since the other photos I took after do not show any images like this one. It started out seeing a small blinking light then it moved to the right out of my sight. Just a tad later what I thought was a shooting star another white blinking light appears out of no where and shows up where this shooting star passed by. So I started taking photos. When I couldn't see them anymore I started taking more photos when I thought a plane was passing by. So the two red lights in the middle is most likely a plane but I still ended up with other lights in the photo which I do not know what they are. And I know for sure when a plane is passing by thats why these white blinking lights caught my attention so much. to put in matters short In one of the photos when I zoom in on the images below the lights...maybe a plane I make out a alien face. You can see yourselfs...I still don't know what it was. The last photo will be one I sent before but I want you to compair both alien faces to the most resent one. The one I sent before still boggles my mind cause I still don't know what to make of it. All I did in the photo was adjust the light and color temp to see these images below the lights clearer. The original photos show the images too even on the camera screen I shot the photos on. Remember the red lights are most likely a plane but the white lights are something else. I will send the rest of the photos right after this."],"Disposition":"IFO","Date Submitted":"08/08/2011 11:52 UTC","Date of the Event":"04/02/2011 12:00 UTC","Viewing Distance":"Unknown","Object Features":"Undisclosed","Region":"California","Summary":"Plane or was it? Weird figures below it","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28581.html.txt","/var/www/straped/mufon/more/28581_submitter_file1__100_0123.JPG","/var/www/straped/mufon/more/28581_submitter_file2__100_0126.JPG","/var/www/straped/mufon/more/28581_submitter_file3__UFOalienlookingatme.jpg","/var/www/straped/mufon/more/28581_submitter_file3__UFOalienlookingatme.jpg.1","/var/www/straped/mufon/org/28581.html"],"Source":"MUFON","Country":"United States","Object Flight Path":"Undisclosed","Longitude":"-122.543516","map":"<A HREF = \"http://maps.google.com/maps?q=37.914237,+-122.543516(28581)&iwloc=A&hl=en\"> mufon case (28581) map </A>","Object Shape":"Circle, Triangle, Unknown","Tags":"City","trends":["There have been 7 other sightings in Mill Valley","There was one other sighting in Mill Valley on or around April 2nd 2011","This sighting has never been favorited.",""],"Latitude":"37.914237","Case Number":"28581","City":"Mill Valley","Log Number":"US-08082011-0134"}