{"Sighting Duration":"Undisclosed","Longitude":"-80.088399","divs":["Sighting DetailsOk. I was with my bff Loura, and her boyfriend, Jason. It was the night of my 16th birthday. That night, I had a bday party . We were just enjoying the fresh night air outside.We were all looking at the stars, watching for shooting stars. I started hearing a loud but muffled humming noise, like a bumble bee makes.but it sounded electrical, a very unique noise I'd never heard before. All of a sudden, my girlfriend shouted, \"Oh my GOD!!! WHAT THE HELL IS THAT!!??\" I looked over my left shoulder to the mansion across the street from my moms house.on top of this huge house was a craft. It had circle lights of red, orange, green and yellow all around the middle of the craft. It was hovering over the house in a constant, frozen like state. we were simply MESMORIZED ! It did not move. And I know that not even a helicopter or even a fighter jet can do that for as long as this craft did.We stood there with our eyes wide open staring and our mouths agape. \"NO REALLY guys, what IS that?? It's not a plane, not anything from our technology! \" I said, trying to make sense of what we were all three seeing plain as day right in front of our very faces. We stood there, amazed and in a trance. We were simply spellbound by the mysterious thing we saw and how it hovered motionless and magically and perfectly just a foot above this house.we watched it for a good ten to 15 minutes. I wAs totally mystified by this bright colorful disc that I saw. It was about 100 feet across. It was about 20 yards away. It continued to hover above the house . Then suddenly I got very very scared.I was frozen with fear. What was this amazing thing?? \"it's probly abducting the people in that house\" I said.Laura agreed, she thought so too.I asked Jason if he saw and heard what we did.he reluctantly said\"yes, I do see that and it's actually really starting to creep me out!\" I felt a shockwave of emotion building up inside me. I have never been so amazed and fascinated and so scared in my whole life. Jason started walking towards the craft. Laura shouted , \"what are you crazy where do you think you are going, mister?\" \"no... It's ok... I want to see \"them\"! It'd be so cool!\" he argued.Then out of still night I just got this strong feeling that WE were being watched.Like whatever WE had been looking at realized that we were there, RIGHT there next to it. A big whitelight shined down from the bottom center of the disc. Well I wasn't ABOUT to stick around there and find out what Happens next. I turned around and ran as fast as I could back to my moms house. Laura and Jason quickly followed suit. Once we got inside the house, we went into my bedroom and I opened the window.I looked out my window and I could still see the white light,it was scanning over my moms house and yard. Like \"they\" were searching for us. It was scary as hell. Just then, our toy terrier TEddy started barking and yelping. I didn't want to wake anyone up so we all sat on the bed in my room, stunned, in total awe and silence. , and total disbelief of what we had just seen. \"Are you sure that thing wasn't a plane?\" Laura asked.\"awjeez babe, that was crazy! That's what it was!\" we nervously all laughed it off.still amazed , We all three agreed with a pinky promise to never breath one word of what we saw, for fear of ridicule. Noone would believe us... they'd think we were stupid, crazy, or just lying for attention. Just last year (20 years later) I finally spilled the beans to my parents about what happenned and what I saw that starry night. They laughed, thinking I was kidding.\"no mom, for real.\" I argued. \"must of been some good drugs...\" my dad kidded me.Well we Were completely sober.Neither myself nor Laura or Jason have scitzophrenia or dilusions. We had no drugs, this thing was as real as real can be. I SaW this fascinating thing and ever since have been abducted. I am seeking hypnosis therapy to recall surpressed memories of these encounters.all I know is that One night last week I fell asleep in my bed and later that night must have traveled thru astral plains.I was taken out of my bed and placed on a table.the Greyson put this nasty gel in my mouth, I think to keep me from screaming. When I woke up I still had some gross jelly stuff in my mouth , tasting it still. and could still smell the hospital like, sterile but mediciny like smell of the beings. I woke up feeling violated, in every way. I would like to know what is going on.!!"],"trends":["There have been 14 other sightings in Jupiter","There were no other sightings in Jupiter on or around July 31st 1991"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.938845,+-80.088399(28599)&iwloc=A&hl=en\"> mufon case (28599) map </A>","Object Flight Path":"Stationary,Hovering then path","Country":"United States","City":"Jupiter","Object Shape":"Disc","Region":"Florida","Date of the Event":"07/31/1991 04:00 UTC","Case Number":"28599","Latitude":"26.938845","Weather Factors":"Windy","Tags":"City","Viewing Distance":"20 Feet or Less","Object Features":"Dome, Window(s)","Log Number":"US-04092011-0011","files":["/var/www/straped/mufon/html2text/28599.html.txt","/var/www/straped/mufon/org/28599.html"],"Source":"MUFON","Summary":"I saw it VERY CLOSE up! In fact, it was hovering over the house across the street!!it made a humming, \"electrical\" sound and had lights all around the silver disc. It was as long as the house, big!","Date Submitted":"04/09/2011 07:56 UTC","Disposition":"Unknown"}