{"Object Features":"Wings","Object Shape":"Triangle, Other","Date of the Event":"04/09/2011 09:03 UTC","Log Number":"US-04092011-0006","Case Number":"28594","Tags":"City","Weather Factors":"Unknown","Disposition":"IFO","City":"Soldotna","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"04/09/2011 02:28 UTC","Longitude":"-151.054713","Region":"Alaska","map":"<A HREF = \"http://maps.google.com/maps?q=60.496578,+-151.054713(28594)&iwloc=A&hl=en\"> mufon case (28594) map </A>","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Latitude":"60.496578","Source":"MUFON","Summary":"Chemtrail, \"Rods\", triangle flock of 8 oval shaped birds or UFO's?","trends":["There have been 5 other sightings in Soldotna","There were no other sightings in Soldotna on or around April 9th 2011","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/28594.html.txt","/var/www/straped/mufon/more/28594_submitter_file1__chemtrailheadedWSW.JPG","/var/www/straped/mufon/more/28594_submitter_file2__chemtrailheadedWSW.JPG","/var/www/straped/mufon/more/28594_submitter_file3__DSCF1644.JPG","/var/www/straped/mufon/org/28594.html"],"divs":["Sighting DetailsIT was 9am, and the family was sleeping in, rather unusual because so did our new puppy. I was laid back on the couch, much calmer and awake then usual, staring out the window and noticed the chemtrail over Soldotna, Alaska that was rather low in the sky and shortly after noticing the chemtrail I spotted a \"rod,\" or a \"sky fish\" as some people would call them streak across the sky behind view of the Cottonwood tree in our front yard. This caught my attention enough to grab the digital camera and take pictures of the chemtrail. I filled up the memory in the camera with the two pics, and while I was deleting some old pictures off the camera, I spotted what was a strange formation of what I originally though were a flock of geese but as I squinted and cleared my eyes to get a better view, it wasn't a flock of anything but 8 oval objects flying in a triangle formation with 2 on the left, 1 in the middle, and 4 or 5 on the right. So I zoomed in with the camera as they got farther away and snapped two pics, and upon pulling the camera away from my eyes, the objects were gone! So of course the next words out of my mouth were profanity....wtf. Followed by, what the hell, where did they go?!? The first sky shot I tried to get shows nothing at all, even when superimposed I have found nothing. The second shot was done with the flash on, and again, no objects even faintly appear in the picture YET three strange lines appear in the picture vertically in the sky that were not visible to the naked eye.....obviously this could have been from the flash. Still, I have lived in Alaska my entire life, and flocks of birds dont dissapear after taking a picture of them, this flock wasn't flapping. These objects were solid white and oval, with black triangle stationary wings aiming down at about a 35-45 degree angle towards the earth. The objects headed in a southern direction, which with the snow melting early this year, this would not have been the path of migratory birds anyways. They would have been headed north."],"Object Flight Path":"Straight-line path"}