{"Sighting Duration":"00:01:00","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around November 6th 2009","This sighting has never been favorited.",""],"City":"Fort Worth","Object Features":"Other","Disposition":"Insufficient Data","Object Shape":"Sphere","Case Number":"28595","Log Number":"US-04092011-0007","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Latitude":"32.734079","Date Submitted":"04/09/2011 02:30 UTC","divs":["sighting detailsi use to shoot of estes rockets when i was young so when my youngest son got old enough to enjoy them i built a couple to show him. we have a 1\\4 acre behind the house that's historic land. (old camp bowie). suburb all around us. good for shooting of rockets. i took some video of the take off by laying the camera on the ground facing up. after down loading and or playing them on big screen we noticed some real strange things appearing flying disappearing even what looks to be on a flight path to my head ???? only its way up in the sky! all of these orb shape things have what appears to be a lasso with a smaller orb at the end that is circling the big orb. they can change direction in a frame or two. fly very fast and always in motion even when sitting still (lasso circling constantly) i have maybe 10 different videos of these things. i have made copies and blown them up to investigate myself(i still have all the original video on the camera from the original day they were recorded) i really cannot enplane any of them. file 1 two orbs move to head if you view frame by frame you can see what i have described. file 2 slow start but close to end an orb appears in middle. file 2 was the first one we noticed. after reviewing all videos have some orbs or ufo in them."],"Summary":"reacuring sightings in vidio's of my home made rocket flights","map":"<A HREF = \"http://maps.google.com/maps?q=32.734079,+-97.3135(28595)&iwloc=A&hl=en\"> mufon case (28595) map </A>","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","Country":"United States","Region":"Texas","Weather Factors":"None","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/28595.html.txt","/var/www/straped/mufon/more/28595_submitter_file1__ericmagnetVID00028.jpg","/var/www/straped/mufon/org/28595.html"],"Date of the Event":"11/06/2009 12:00 UTC","Longitude":"-97.3135"}