{"Weather Factors":"Unknown","Date Submitted":"04/09/2011 03:00 UTC","Region":"California","Object Shape":"Disc, Star-like","Case Number":"28596","Object Flight Path":"Straight-line path","Latitude":"34.692365","divs":["Sighting Details9:55am Standing on my NW facing balcony I heard what sounded like a LOUD military craft directly over head. Then the sound just stopped. I looked up north and saw what looked like a very bright star but then it turned indigo, then back to white. I watched it move east in a slow but steady manner in a straight line slightly going upwards. I ran inside to grab my camera and it seems it appeared in one of my picture. Upon blowing it up and tinkering with the pic using embossing and black and white reverse I indeed confirmed a disc or round shaped object there in the sky. I lost sight of it as it passed over my roof and out of my view. No other feelings accompanied this siting other that frenzy to get a pic before it went over the roof. Cannot determine altitude but I've never seen a plane EVER fly that high and it made no noise that I could detect after the cessation of the other jet I heard in the beginning."],"files":["/var/www/straped/mufon/html2text/28596.html.txt","/var/www/straped/mufon/more/28596_submitter_file1__DSC00654.JPG","/var/www/straped/mufon/more/28596_submitter_file2__DSC00654a.JPG","/var/www/straped/mufon/org/28596.html"],"Log Number":"US-04092011-0008","Tags":"City","Summary":"Small star like blob pulsing between bright white and indigo","map":"<A HREF = \"http://maps.google.com/maps?q=34.692365,+-118.152063(28596)&iwloc=A&hl=en\"> mufon case (28596) map </A>","Country":"United States","Disposition":"Insufficient Data","City":"Lancaster","Sighting Duration":"Undisclosed","Longitude":"-118.152063","Object Features":"None","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 15 other sightings in Lancaster","There were no other sightings in Lancaster on or around April 9th 2011","This sighting has never been favorited.",""],"Date of the Event":"04/09/2011 10:55 UTC"}