{"Case Number":"2859","divs":["Sighting Detailsapprox 2200 hrs, myself and a friend were walking NW through the holbrook golfcourse to the holbrook gas station. as we approached the parking lot fields,adjacent to CR-19 patchogue-holbrook rd my friend pointed to a light in the skythat was moving strangly NE from where we were standing. i looked and assumedit was a helecopter search light. as i watched the object move in the sky asmall white ball of light, it grew many times in size and then somehowtransformed into a large, box shaped object, at about a 45 degee angle from us adistance of no more then three hundred feet. the object was at tree top leveland clearly visable. it had a series of some odd shade of red lighting,flickering on and off as it hovered at tree top level. I felt compelled to rununder it and did so, only to be stopped by my friend, about 50-75 feet fromwhere it was hovering. we then found ourselves sitting on the ground crying. it was still dark. after some time had passed, it looked as if it drove away onsome sort of invisible road, in a NW direction. after the incident we ran homeand told our parents. no report has been filed ever, I am now 24 and feelcompelled to report it to someone. i can not get in contact with the otherwitness at this time and am excluding his name and contact info. after someweeks had passed, we disgussed what we had remembered of the incident, andconcluded that the normally busy road, CR-19, had no traffic on it as theincided occured. We noticed no sound from anything around us, including trafficsounds and normal night sounds. this has disturbed me for years. im notlooking to make a big case out of this, I just want to finally report thesighting. if you would like, you can call me after 630 pm, EST."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.81232,+-73.078443(2859)&iwloc=A&hl=en\"> mufon case (2859) map </A>","Object Shape":"Square, Rectagular","Viewing Distance":"101-500 Feet","Latitude":"40.81232","Date Submitted":"08/15/1997 10:00 UTC","Object Features":"Other","Tags":"City","City":"Holbrook","Object Flight Path":"Unknown","Date of the Event":"08/15/1997 10:00 UTC","Summary":"close encounter, holbrook long island","Country":"United States","Source":"MUFON","Sighting Duration":"00:05:00","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/2859.html.txt","/var/www/straped/mufon/org/2859.html"],"trends":["There has been one other sighting in Holbrook","There were no other sightings in Holbrook on or around August 15th 1997"],"Longitude":"-73.078443","Log Number":"","Region":"New York","Disposition":"IFO"}