{"Viewing Distance":"Unknown","Date of the Event":"04/10/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/28605.html.txt","/var/www/straped/mufon/org/28605.html"],"Source":"MUFON","Country":"United States","Tags":"City","Region":"Alaska","divs":["Sighting DetailsAfter scanning the sky for around 15 minutes, focusing SSW where the living room window has the best view, I had been looking up at the Crovus Constellation and focusing on it when a brilliant yellow fireball like object, black in the front, glowed and streaked towards the direction of the dark side of the moon that was due west in the sky, before abruptly fading out to nothing. It was gone and lasted maybe four or five seconds. As the view of the moon started becoming obstructed, I headed outside with camera in hand, and kept focusing west towards the moon while still scanning the rest of the sky. At 1:09am a second object, this one, came out of no where and was brighter and much lower then a normal star, like the previous fireball like object (as the moon was only about 15-20 degrees up in the sky, and it flashed brighter and also streaked from south to north directly towards the dark side of the moon before immediately fading out......to fast for a closed digital camera to respond. If anyone else saw anything strange around the moon tonight, April 10th, 2011, DONT HESITATE TO POST IT HERE ON MUFON!!!"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=60.3375,+-151.274444(28605)&iwloc=A&hl=en\"> mufon case (28605) map </A>","City":"Kasilof","Object Shape":"Fireball, Flash, Star-like","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Log Number":"US-04102011-0004","Object Features":"Undisclosed","Date Submitted":"04/10/2011 05:27 UTC","Case Number":"28605","trends":["There have been no other sightings in Kasilof","This sighting has never been favorited."],"Latitude":"60.3375","Summary":"Two seperate objects, 18 minutes apart, head N towards crescent moon","Longitude":"-151.274444","Disposition":"Unknown"}