{"Summary":"Bright neon green light which exploded into an orange color then flew across the sky and disappeared in a heartbeat.","Date of the Event":"04/10/2011 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Weather Factors":"None","Source":"MUFON","Object Shape":"Cylinder, Fireball","Object Features":"Undisclosed","Tags":"City","Country":"United States","Log Number":"US-04102011-0001","trends":["There have been 13 other sightings in Lockport","There were no other sightings in Lockport on or around April 10th 2011"],"Region":"New York","files":["/var/www/straped/mufon/html2text/28602.html.txt","/var/www/straped/mufon/org/28602.html"],"Disposition":"Insufficient Data","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=43.178953,+-78.68765(28602)&iwloc=A&hl=en\"> mufon case (28602) map </A>","City":"Lockport","Longitude":"-78.68765","Latitude":"43.178953","Case Number":"28602","divs":["Sighting DetailsI was driving heading east on saunders settlement road in lockport, ny with my friend mat around 12:45am. We were just talking then all of the sudden a huge green flash caught our eyes to the left over a large farm field. I immediately jumped in my seat and was frightened by this bright neon green flash in the sky because it came out of no where. Before we could even say anything to each other about it the green flashing light exploded in to a bright orange color then took off at an incredible speed horizontally then disappeared in a blink of an eye. The object seemed to be a clyndrical shaped fireball almost. After both seeing this we reacted by looking at each other in fear and saying \"oh my god! did you just see that?!\" We couldn't believe what we've just seen. Both of us we're very frightened, I even had goosebumps and found myself breathing very quickly. We were both very freaked out by this..we tried dismissing the sighting off between each other but everything we seemed to suggest it could've been just didnt make sense. We tried dismissing it as a firework or flare of some kind but we both came to the conclusion there is no way thats was possible. A firework or flare doesnt just come into sight from no where with that kind of green explosion, then change almost instantly into orange then fly across the sky horizontally at what seemed like light speed and disappear into nothing. For the remainder of the ride to drop off mat at his house we kept discussing what we had just seen and how scary and freaky it was to have witnessed such a thing. After dropping mat off I found the drive home alone even more scary after just seeing that object in the sky, especially to close to home. I've never seen anything like that in my life, it was extroardinary. Mat and I both agreed most people would probably think were crazy if we even tried to explain to them what we witnessed."],"Date Submitted":"04/10/2011 02:04 UTC"}