{"Case Number":"28600","Object Shape":"Square, Rectagular, Triangle","Disposition":"Insufficient Data","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.979751,+-86.112114(28600)&iwloc=A&hl=en\"> mufon case (28600) map </A>","Latitude":"39.979751","City":"Carmel","Summary":"Rectangle shape ufo sighted in Central Indiana","files":["/var/www/straped/mufon/html2text/28600.html.txt","/var/www/straped/mufon/org/28600.html"],"trends":["There have been 10 other sightings in Carmel","There were no other sightings in Carmel on or around April 6th 2011"],"Sighting Duration":"00:05:00","divs":["Sighting DetailsIn the sky the night of April 6 near 11:30pm I saw something that I can not explain. I was coming up to a four way stop when I saw an approximately 120 ft object gliding southeast at the speed of maybe a helicopter. With my driver side window rolled down I could not hear anything that resembled the sound of an aircraft, however it was the sight of the object that has changed my mind changed about whether or not something else of higher intelligence could living amoung us. The object appeared to be heading away from where I was heading; however, within 30 seconds at the next intersection - which happened to be a very well traveled road through Carmel,IN (N Keystone) - I saw the same object now changing directions. I almost hit a truck at the intersection (roundabout) trying to follow what the object was doing in the sky. As I continued the same direction as I had been travelling when I saw the object, the object had changed direction and was heading parallel to the diection as my car off off to the left, but much further away. I travelled about another mile to the North - away from the object - while the object must have been travelling due West. At my destination, I got out of my car and spotted the object near the treeline behind the neighboring housing across the street and it finally disappeared from my sight approximately 5 minutes from when I first saw it. This location is very important, becuase just a few months back I spotted a flying object with lights that were pulsating one at a time in a circular motion just like the object that I had just seen from directly beneath. A few months back the object was hovering in an upwards and downwards motion in realitively the location I lost sight of it the second night. When I had spotted an object hovering up and down I thought the shape of the object must have been circluar like a flying saucer that you would normally think of when you think of ufos. (Still describing my first sighting) From my perspective looking through an upstairs window the object had flashing lights which lit up one at a time in a sort of triangular fashion - which would make sense for it to be a large disc. However, the second night when being directly below the object, I saw its four sided bottom with a light at each of the corners pulsating one at a time. From my point of view beneath the object it distictively had a square bottom. The four sides appeared to each be at the least approximately 120 feet. Being as large and flying relatively low I am sure I can not be the only one who saw this object on the night of April 6, 2011. I easily came to terms with the first night I saw the strange lights hovering up and down against the treeline that it must have just been some kind of helicopter; however, after seeing the same pattern of flashing lights directly above me - not exactly the same as when I was underneath the object I clearly saw the fourth light that was not visible from afar - I now have the mindset that humans both nights I had spotted a ufo. I know there could be explanation for the flying object with a flat square bottom and four flashing lights, but until I see or hear about a human-made aircraft I can give no other explanation than seeing something from outerspace. I did not have the ability to take a good picture either night, but I would like to know if anyone else may have captured this object on camera or could at least share the same type of bewilderment after seeing this object on April 6. After seeing this I can certainly did have a feeling of embarrasement to describe what I saw to anyone, but I believe the truth must be told, so I submit this anonomously."],"Country":"United States","Log Number":"US-04092011-0012","Region":"Indiana","Viewing Distance":"Unknown","Object Features":"Unknown","Longitude":"-86.112114","Weather Factors":"Unknown","Date Submitted":"04/09/2011 07:58 UTC","Object Flight Path":"Path with directional change","Date of the Event":"04/06/2011 11:30 UTC"}