{"Region":"West Virginia","Disposition":"IFO","City":"Fairmont","map":"<A HREF = \"http://maps.google.com/maps?q=39.528863,+-80.232131(28603)&iwloc=A&hl=en\"> mufon case (28603) map </A>","files":["/var/www/straped/mufon/html2text/28603.html.txt","/var/www/straped/mufon/org/28603.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","divs":["sighting detailsthe first time i saw this was two days prior to second, something caught my eye in sky, at first, thought it was a star; upon further view it had white light in middle then flashing green and red. i called out my boyfriend and dad to witness and to question what it was. it was not a plane it hovered for about thirty minutes. it would flicker in and out and would jump up and down and left and right until it just disappeared. the next night was cloudy, so waited until tonight, and again in the same spot was the same star like object; this time had binnoculars and when looking through them the object seemed to swirl and had same lights. it was higher in sky and seemed closer. i watched it for about twenty minutes until it went behind trees. it moved very slow. now, i live on hill near woods so the western sky view is the clearest but in the eastern and southern sky there were atleast two more. i caught some of this on my camera\\recorder but not the best visual; of course!! and you cant make out the lights on my camera; but alteast i did capture the object. my question is: if this is a satelite then why the green and red strobe type lights; and it was definately not a plane!! nor do i believe that it is sirius or orion like some sites have suggested. but what in the heavens is it?"],"Object Features":"Undisclosed","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Date of the Event":"04/09/2011 10:30 UTC","Tags":"City","Date Submitted":"04/10/2011 01:58 UTC","Latitude":"39.528863","Object Flight Path":"Undisclosed","Longitude":"-80.232131","Log Number":"US-04102011-0002","Source":"MUFON","Summary":"On two occasions, I saw star like object in W sky; with green, red, and white lights","Case Number":"28603","Country":"United States","trends":["There have been 5 other sightings in Fairmont","There was one other sighting in Fairmont on or around April 9th 2011","This sighting has never been favorited.",""]}