{"files":["/var/www/straped/mufon/html2text/28601.html.txt","/var/www/straped/mufon/org/28601.html"],"Date of the Event":"04/09/2011 09:35 UTC","Object Shape":"Blimp, Diamond","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.545124,+-87.393217(28601)&iwloc=A&hl=en\"> mufon case (28601) map </A>","Disposition":"Unknown","Tags":"City","trends":["There have been 12 other sightings in Marquette","There were no other sightings in Marquette on or around April 9th 2011"],"Date Submitted":"04/09/2011 10:01 UTC","Sighting Duration":"Undisclosed","Case Number":"28601","City":"Marquette","Weather Factors":"Unknown","Object Features":"Unknown","Latitude":"46.545124","Longitude":"-87.393217","Object Flight Path":"Straight-line path,Other","Region":"Michigan","divs":["sighting detailswhile sitting on my couch, i noticed a light moving out of the corner of my eye. it seemed initially like a headlight, but the color wasn't right, which caught my attention. i turned my head and saw an orange light rise in the sky. it was moving fairly quickly, and leveled off right about eye level (i was on the third story of the house). i watched it for a few seconds. it occurred to me i should go get my boyfriend, who was in the other room, but i was afraid i'd lose sight of the object. after maybe thirty seconds, i ran into the room he was in, and we went out onto the balcony. i pointed it out to him, and i ran inside to get the camera. we tried to video tape the object, but the memory card was full. by the time i deleted a few pictures, we had lost sight of the object. it was headed north, moving fairly quickly. because we live in an area with quite a few trees, it's difficult to tell if the object just disappeared completely, or was obscured by trees\\distance. my boyfriend says it disappeared, whereas it looked more to me like there were just trees blocking the view."],"Log Number":"US-04092011-0013","Viewing Distance":"501 Feet - 1 Mile","Summary":"Orange light in the sky"}