{"Viewing Distance":"Unknown","Region":"Arizona","Tags":"City","Weather Factors":"Unknown","Object Shape":"Circle, Star-like","Country":"United States","Summary":"4 bright yellow lights encircling inside outer rim of crescent moon. Smaller lights flashing inside inner edge of crescent.","Object Flight Path":"Undisclosed","City":"Tucson","Longitude":"-110.922399","Date of the Event":"04/10/2011 01:30 UTC","Disposition":"Insufficient Data","Log Number":"US-04112011-0003","divs":["sighting detailsi had stepped outside my home onto my back porch and was staring at the crescent moon when 4 starlike circle objects appeared on the crescent moon sitting low on the northern horizon. at first i wasn't sure what i was seeing so i moved back and forth to see if it changed. it didn't. there was 4 large lights inside the outer rim of the crescent moon shining very brightly when suddenly smaller ones began to appear on the inside edge of the crescent and then more appeared towards the left point of the crescent that were lighting up and then disappearing. the 4 large cirle objects were evenly spaced and covered about 2\\3 of the outer rim and began just below the right point at the top of the crescent. as i stared the smaller lights began to appear and some were moving and disappearing while a few ringed the inner edge of the crescent just inside the edge. next the moon appeared to be shimmering with lights. i ran to get my son up to see it but by the time we returned outside it was gone. the color of these lights was the same color of the crescent moon having the color yellow on the horizon. i believe it was around 1:30 to 2:00 as i did not record the exact time. it was cool to watch when the lights were causing the shimmering effect and this is why i ran to get my son to see it. my son searched and noticed someone in alaska saw something similar to what i saw so i am making this report."],"Case Number":"28619","Object Features":"Undisclosed","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around April 10th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.230613,+-110.922399(28619)&iwloc=A&hl=en\"> mufon case (28619) map </A>","files":["/var/www/straped/mufon/html2text/28619.html.txt","/var/www/straped/mufon/org/28619.html"],"Source":"MUFON","Latitude":"32.230613","Sighting Duration":"Undisclosed","Date Submitted":"04/11/2011 04:50 UTC"}