{"Date of the Event":"04/08/2011 11:00 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/28618.html.txt","/var/www/straped/mufon/org/28618.html"],"Latitude":"27.639843","Date Submitted":"04/11/2011 01:42 UTC","Source":"MUFON","Summary":"Bright star traveled away from the moon and then stopped in sky for a short time before disappearing.","divs":["sighting details hello! thank you for reading our report. this event happend friday night april 8th, 2011. my girlfriend and i frequently sit out front with the dog and stare up at the stars. we know the planets by now and several of the brighter stars up there thanks to her sky map\\phone. we thought it would be fun to take some moon pictures so i got out all the gear to do so. i set up a big telephoto lens with a 2x magnifier and mounted it to the tripod. i dialed it in at about 2200mm so that the moon was filling most of the frame. when you're zoomed in that close, the moon moves pretty fast through your field of view so you end up readjusting the thing fairly often. we watched the moon for about twenty mins, chatting away and taking pictures. suddenly, a very bright star appeared, very close to the moon on the bottom left. we both shouted at the same time \"did you see that!?\" it stayed right next to the moon for maybe 20, 30 seconds and then started to travel at a 45 degree angle up and to the left away from the moon. it was no bigger than the stars it was passing by but it was many times brighter. it traveled slowly across the sky in a direct line from a to b which was about index finger to pinky distance if you hold your hand out and make a bullhorn (that's what i did lol). then it stopped and stayed lit up for maybe 30 seconds more before it blinked off. we were certainly excited to see this and a little bit \"spooky ookey\" afterward but its that feeling of amazement you cant describe when you know that you are witnessing something other worldly. \"so where's the damn picture?\" well, i was trying to readjust\\refocus on the moon when this thing blinked on and i just stopped thinking. we both simply could not take our eyes off of it! that's prob the hardest part to explain. we had it all set up to take pictures, tripod, giant lens and i'm even aimed right at the damn thing and all i could do was stare, up, in awe. well we're on the lookout now! good luck on your search!"],"Country":"United States","Tags":"City","Longitude":"-80.389444","Region":"Florida","Log Number":"US-04112011-0002","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Vero Beach","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.639843,+-80.389444(28618)&iwloc=A&hl=en\"> mufon case (28618) map </A>","Object Flight Path":"Undisclosed","Object Shape":"Star-like","trends":["There have been 14 other sightings in Vero Beach","There were no other sightings in Vero Beach on or around April 8th 2011"],"Disposition":"Insufficient Data","Case Number":"28618"}