{"Object Shape":"Boomerang, Cone, Circle, Cross, Sphere, Triangle","Country":"United States","Object Flight Path":"Undisclosed","Tags":"City","trends":["There have been 3 other sightings in St Peters","There were no other sightings in St Peters on or around April 10th 2011"],"Case Number":"28616","Sighting Duration":"00:00:10","City":"St Peters","Weather Factors":"Unknown","Date Submitted":"04/10/2011 11:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.788095,+-90.598281(28616)&iwloc=A&hl=en\"> mufon case (28616) map </A>","Latitude":"38.788095","divs":["Sighting DetailsOk so me and my friend were driving our bikes and like out of no were this huge thing comes out of the sky and illuminates A part of a tree in lareal park so were like what the hell is that?!?!?!? So right as me and my friend looked at it it turned of the lights and vanished so fast my friend took a picture of it but when we looked at it there was nothing there and the UFO had been there for 10 seconds and we took it I. 5 so were like wow that's creepy and right as it vanished we we when'd to check out where the UFO was pointing his beam at and when I was it there was a tree on the ground so were like wtf?!?!?!!?!?! The first thing that made me notice it was that it made q beam at a tree and so me and my friend were really wanting see what it is first we thought it was a plain crashing but the. It looked like a cross and crap and it had like 5 more of them in driferent shapes so were like o **** alien !!! And right as we stared riding our bikes towards the beam they dissapires so. Fast like ultra lighting speed"],"Log Number":"US-04102011-0014","Longitude":"-90.598281","Summary":"Huge flashing lights right as I looked at it it vanished had 3 more with it","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"04/10/2011 09:10 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/28616.html.txt","/var/www/straped/mufon/org/28616.html"],"Disposition":"Unknown","Region":"Missouri"}