{"Log Number":"US-04112011-0004","trends":["There have been 17 other sightings in Honolulu","There were no other sightings in Honolulu on or around March 26th 2009"],"files":["/var/www/straped/mufon/html2text/28620.html.txt","/var/www/straped/mufon/org/28620.html"],"Latitude":"21.312334","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"04/11/2011 07:50 UTC","Case Number":"28620","City":"Honolulu","Object Features":"Undisclosed","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsMy two friends and I were fishing at kailua beach when i noticed the light and said jokingly to my friend that the light was back. I said this as he and I had witnessed what appeared to be the same object approximately a year and a half earlier in the same location. After the first event I carried a binocular in my fishing gear for a least a year waiting for it to reappear, then finally gave up and left it at home. It finally did reappear on the 26th of March, 2011. We witnessed this light that appeared to change color moving about near the horizon, at about 5-10 degrees above the horizon These movements were erratic and random and at varying speeds in all directions. It moved near the horizon at first and then gained altitude at times to at least 50 degrees. It made sudden stops and starts and moved like no terrestrial aircaft physically could. The light would dim at times and fade out of view only to return in a short while and continue its movements. We were amazed and continued to observe it for over and hour until we finally gave up fishing. Here is the most interesting part; one of my friends used his cell phone in an attempt to document this phenomena. His phone would only record video for a short period of time,and he recorded three times in a row for the length of time his phone allowed, which I estimate to be 15-20 seconds at a time. In the first recording you could here us talking and the sound of wind in the microphone. In the next recording which was seconds later a tremendously strong signal was recieved that sounded like random static, and underlying this was sounded like talking in an unintelligible language. It was definitely a verbal communication of some kind and lasted until the time elasped. The last recording which was again, seconds later, was the same as the first; just us talking and the sound of wind. My friend still has it saved on his phone and it gives you goosebumps to hear it. Several days later this same friend was able to catch something visually on his phone and it is quite amazing. I have encouraged him to submit the evidence he has, so that others could hear it and perhaps offer some explanation. It was an amazing event, and the additional recorded evidence was interesting, but I am making no claim that the light and the recording were related, just a curious coincidence perhaps, or possibly something more. This is my recollection to the best of my ability, and I state these words as fact that is unquestionable in my mind, and is only reported so there is a record of this occurence."],"Region":"Hawaii","Summary":"light, that appeared to change color","Date of the Event":"03/26/2009 12:00 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=21.312334,+-157.854033(28620)&iwloc=A&hl=en\"> mufon case (28620) map </A>","Longitude":"-157.854033","Viewing Distance":"Unknown","Object Shape":"Unknown","Tags":"City"}