{"divs":["sighting detailsmonday april 11th, 2011 approximately 1:15a.m. my friend and i were driving home in glendale, ca when i noticed an electric blue light flash in the left corner of the clear night sky through my windshield. i pointed with enthusiasm and exclaimed, \" shooting staaa...\" and before i could finish my sentence my mouth dropped into a look of amazement and fear because it was not a shooting star. i looked over to my friend to see if she had noticed the same thing and immediately out of a sort of instinct she looked away to her right. all this happened as i slowed my car and looked back at the sky and saw what i could only describe at a ufo or an aircraft of some sort. the craft was almost a diamond shape, dark in color almost camouflaging with the sky but i could see its outline with three distinct circular shapes in what seemed to be its front. the craft was so close to the earth, closer than a plane and quiet, we had no music playing in the car. it shot up away from us, not straight up, but curved almost forward and disappeared in a matter of half a second with the electric blue light trailing, widening away from the object. it was so close, and big, i don't know what to use as a comparison to its size. in that half a second it was like nothing was ever there. i pulled over in shock and tears rolled down my cheeks and i yelled, \" did you see that?!! do you know what that was?!\" my friend turned to me with a look of panic and tried to laugh it off then yanked at my gear shift in desperation to leave and said, \" get the **** out of here before they come back!\" i drove to her home and we sat in the car for about a half out in shock\\ fear of what we had seen."],"Object Flight Path":"Undisclosed","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/28624.html.txt","/var/www/straped/mufon/org/28624.html"],"Region":"California","City":"Glendale","Disposition":"Unknown","Summary":"A dark space craft hovering close to earth then darting away with a trail of electric blue light attached to it","trends":["There have been 13 other sightings in Glendale","There were no other sightings in Glendale on or around April 11th 2011"],"Date Submitted":"04/11/2011 02:07 UTC","Longitude":"-118.253265","Object Features":"Undisclosed","Log Number":"US-04112011-0008","Sighting Duration":"00:00:03","Date of the Event":"04/11/2011 01:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.146178,+-118.253265(28624)&iwloc=A&hl=en\"> mufon case (28624) map </A>","Case Number":"28624","Latitude":"34.146178","Object Shape":"Cone, Diamond","Viewing Distance":"Unknown","Weather Factors":"Unknown","Country":"United States"}