{"Tags":"City","Latitude":"35.65377","Log Number":"US-04112011-0006","Source":"MUFON","Object Features":"None","Case Number":"28622","Region":"North Carolina","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-77.775534","map":"<A HREF = \"http://maps.google.com/maps?q=35.65377,+-77.775534(28622)&iwloc=A&hl=en\"> mufon case (28622) map </A>","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Saratoga","This sighting has never been favorited."],"Date of the Event":"04/02/2011 10:10 UTC","divs":["sighting detailsme&*(name deleted--cms\\sg)were watching the ky\\conn basketball game.it was half time so i told him i was going outside to smoke a cigarette.he went to put his shoes on and i went outside.i leaned against his car and looked toward the north.about 300'above the trees which are about 1mile away,i saw a red light.it moved straight down to the ground,sat for about3 or 4 secounds and disappeared.mr.reid came out of the house a few seconds later,but the light was gone. i was telling him what i had seen,we looked up almost straight up and saw 8 to 10 white blinking lights,but we thought these were small planes.we got into my truck and went to where i thought the red light had sat down.we saw nothing.we also went down the road futher and turned down a path into a fieid,went down path for about 1\\2 mile but still nothing. i didnot call law enforcement at this time. the red light i saw after it was on the ground was a complete circle misty red and appox.25' to 30' across.the conditions outside was clear with very little wind.the object made no sound,did not blink,did not flash,did not flicker,and did not light up the ground around it. from mr reids house to where this light was,approx. 1 mile. behind the light is oak&pine trees approx.100'tall. off to the left at this same distance is a white building maybe20'x20'.to the left of it us a telephone tower with a red blinking light. the tower is approx.1 1\\2 miles away. to the right of where the light sat down is a double wide mobile home about300'. between where i was and the trees,the white building and the mobile home is a 4 lane highway 264.this road runs east to west.i didnot report this untill 4\\4\\2011 to the wilson co.sherrif.i did not get the officers name but i have his cell phone# *(phone number deleted--cms\\sg)."],"City":"Saratoga","Summary":"RED LIGHT ABOVE TREES 300' CAME STRAIGHT DOWN GOT TO GROUND SAT FOR 3 OR 4 SECONDS & DISAPPEARED","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28622.html.txt","/var/www/straped/mufon/org/28622.html"],"Date Submitted":"04/11/2011 11:33 UTC","Object Shape":"Circle"}