{"Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"02/28/2011 12:00 UTC","Disposition":"IFO","Object Features":"Unknown","Tags":"City","Longitude":"-118.097777","Viewing Distance":"101-500 Feet","Date Submitted":"04/12/2011 03:11 UTC","divs":["Sighting Details I awakened to use the bathroom.I went downstairs,turning on no lights,then returned to my room,upstairs,in short order.I went to the window to look out at the moon and the Orion constellation (I often look out at the night sky before returning to bed).The night was crystal clear and cloudless and I looked to my left at the stars and moon.I was immediately distracted by moving lights to my right and turned and saw a flying craft unlike any I have ever seen. It was shaped like a box,square at the front with rectangular sides and underside.The sky was very dark blue and the object was black against it.The perimeter of the underside was lined with lights,red and green (alternating),that sequentially turned on and off,giving a rotating effect similar to that of the lights bordering a theater marque. This object was large and very low.I estimate the front to be thirty feet square and the length ninety feet.The surface of the object was absolutely smooth,featureless and non reflective.There were no windows.The lights circling the lower perimeter were numerous.I estimate one hundred.They were not circular but shaped like footballs standing on point and as large. The window through which I was watching this object was closed but The left side of my face was against the glass and I heard no sound.This was curious because this thing was so close.I estimate the altitude at about two hundred feet but heard nothing.Equally as curious was the speed at which it was moving forward.Maybe fifteen miles per hour and no variation.Its motion forward and level attitude also did not vary. There was nothing above the object holding it up and nothing below supporting it.Nothing was ahead of it and nothing trailing. The object passed out of my view over the back of the house and I turned,stepped to the center of the room,paused,and then sat down on my bed.Looking back,this inaction and loss of curiosity is out of character for me.I sat on the edge of the bed for a few minutes,eventually laying down,and slept until morning."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.747576,+-118.097777(28634)&iwloc=A&hl=en\"> mufon case (28634) map </A>","Source":"MUFON","Weather Factors":"None","Latitude":"33.747576","Summary":"box shaped object with green and red lights at lower perimeter.Moving East, low and slow over backyard.","City":"Seal Beach","Case Number":"28634","files":["/var/www/straped/mufon/html2text/28634.html.txt","/var/www/straped/mufon/org/28634.html"],"Log Number":"US-04122011-0005","Object Shape":"Other","Region":"California","Object Flight Path":"Straight-line path","trends":["There have been 5 other sightings in Seal Beach","There was one other sighting in Seal Beach on or around February 28th 2011"]}