{"Latitude":"28.291213","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"04/11/2011 11:15 UTC","files":["/var/www/straped/mufon/html2text/28637.html.txt","/var/www/straped/mufon/org/28637.html"],"Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Country":"United States","Region":"Florida","Date Submitted":"04/12/2011 08:16 UTC","Longitude":"-80.719028","divs":["sighting detailsi was leaving a popular strip mall in viera florida last night, i did my usual run where i would sit there with my boyfriend a few dear friends and just chit chat all night until we all decided to go elsewhere or just go home. well, 11pm rolled around and we dexided to leave after a while. we all walked out to our cars said our \"godbyes\" and left. right as i was pulling out with my roommate\\bestfriend, i looked in the sky, an what i saw didn't suprise me i grew up keeping an ee out for this stuff, and saw my share of ufo's, the shock factor here was, how low it was! plus it was my friend's first ever ufo sighting. i slowly pointed up, assuming she'd miss it or something, and said \"dude, what the hell...? did you se that? please please tell me you see that!\" and thankfully, she did. \"what on eart?! what is that? holy crap that's weird!...is that a???\" it was 3 green lights, lit up in the shape of a triangle. then all at once, they blackened into the night...i get excited and call my boyfriend to tell him. when he answers i begin to tell my story about what we just saw, then suddenly he cuts me off. come to find out he saw the exact same thing! so, i tried to call our other two friends who had left as well. no answer. a few hours later they showed up at our door. and when i mentioned something being in the sky, they replied \"oh yeah! we saw the traingle green lights! my boyfrind also told me later, he watched the ting hovering in just one spot for a long period of time, and again no sound at all. he coul see it from afar when the lights turned back on he said. but then it dissapeared again..... we are not alone. *(wit's first name deleted--cms\\sg)."],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.291213,+-80.719028(28637)&iwloc=A&hl=en\"> mufon case (28637) map </A>","Object Flight Path":"Undisclosed","Summary":"it had 3 greens lights shaped like a Triangle, gliding low, no sound at all, and would just hover in one spto for a long time. Then dissapeared.","Disposition":"Unknown","Viewing Distance":"Unknown","Log Number":"US-04122011-0008","trends":["There have been 9 other sightings in Rockledge","There were no other sightings in Rockledge on or around April 11th 2011"],"Case Number":"28637","City":"Rockledge"}