{"Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"04/12/2011 06:05 UTC","Disposition":"Insufficient Data","Sighting Duration":"00:10:00","Summary":"Flashing lights in the Western Sky during daylight","Object Shape":"Flash, Star-like","Object Flight Path":"Other","Tags":"City","files":["/var/www/straped/mufon/html2text/28635.html.txt","/var/www/straped/mufon/org/28635.html"],"Date of the Event":"11/06/2010 11:12 UTC","Region":"Arizona","Longitude":"-112.069037","map":"<A HREF = \"http://maps.google.com/maps?q=33.453297,+-112.069037(28635)&iwloc=A&hl=en\"> mufon case (28635) map </A>","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 6th 2010","This sighting has never been favorited.",""],"Country":"United States","Latitude":"33.453297","City":"Phoenix","Case Number":"28635","Object Features":"None","Log Number":"US-04122011-0006","divs":["Sighting DetailsI was attending an outdoor strings concert at which my son was to perform his cello in the fourth grade orchestra. The performance was held at Castles N' Coasters in Glendale. My sons class along with other fourth grade strings classes were to perform for 45 minutes then spend the rest of the day burning up the rides. While waiting for the performers to get tuned and ready, I noticed four to six lights in the sky to the West. I watched as they seemed to fade in and out of the sparse cloud cover. I had brought my video camera and started recording clips of the strange objects, hoping they would show in the footage. (Of course it's hard to tell by replaying the footage in the bright sunlight on the cameras 2 inch monitor.) I continued to scan the sky and took six or so short clips of the objects, not expecting for much to show in the video result. I even approached another parent ,who was holding a video camera with a zoom lens,and asked if he could see what I was seeing, but through his zoom lens. He glanced to where I was looking but quickly lost interest. After viewing the footage on a larger res monitor, I was surprised that not only had the camera picked up what I saw, but also innumerable other anomalous lights or objects moving about in an erratic manner."],"Weather Factors":"None"}