{"Summary":"Night fishing for eel on the sandy river, heard a whooshing sound overhead, looked up and saw triangle craft .","Case Number":"28639","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date of the Event":"07/15/1978 12:00 UTC","Object Features":"Other","Object Shape":"Triangle","divs":["Sighting DetailsThree of us, July 1978, teenagers at the time, were night fishing for eel on the shore of the Sandy River in Strong Maine. We heard a whooshing sound, like the wind, directly overhead, we looked up, and said at the same time, \"Wow look at that\", and there was a black triangle, with rounded points. Each point had a fixed colored light, (not blinking)red, blue, and green. The round lights were at least 10 feet in diameter, much bigger than any man made aircraft lights i've seen otherwise. The triangle was an estimated 300 feet each side. The craft was approximately 300 to 400 feet above us and made no noise except the sound of the craft cutting the air. The speed of the craft was about 20 miles per hour, too slow to be a conventional aircraft. It was below stall speed and should have crashed, but it kept slowly flying west, up river until it went out of sight. Time span was about 30 seconds. my brother still thinks to this day that it was an experimental military aircraft. In my opinion, it was a technology out of our reach and beyond our capabilities at the time. This is the only flying triangle I have seen. I have had 9 other experiences that I will share at another time,4 of which were during my childhood in the 1970s. Keep looking skyward my friends. Phil62."],"Country":"United States","Weather Factors":"Unknown","Longitude":"-70.220833","City":"Strong","files":["/var/www/straped/mufon/html2text/28639.html.txt","/var/www/straped/mufon/org/28639.html"],"Region":"Maine","Latitude":"44.8075","Date Submitted":"04/12/2011 12:00 UTC","Log Number":"US-04122011-0008","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=44.8075,+-70.220833(28639)&iwloc=A&hl=en\"> mufon case (28639) map </A>","Tags":"City","trends":["There have been no other sightings in Strong","This sighting has never been favorited."]}