{"trends":["There have been 7 other sightings in Chehalis","There were no other sightings in Chehalis on or around April 11th 2011"],"Object Flight Path":"Straight-line path","Region":"Washington","Date Submitted":"04/12/2011 12:28 UTC","Country":"United States","City":"Chehalis","Date of the Event":"04/11/2011 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Disc, Triangle","Longitude":"-122.961448","Summary":"Helicopters carrying ufos in nets","Object Features":"Undisclosed","Tags":"City","Case Number":"28642","Sighting Duration":"00:00:10","files":["/var/www/straped/mufon/html2text/28642.html.txt","/var/www/straped/mufon/org/28642.html"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"46.665718","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=46.665718,+-122.961448(28642)&iwloc=A&hl=en\"> mufon case (28642) map </A>","divs":["Sighting DetailsAround 1:00 pm on day of sighting 2 chinook helicopters flew south along I5 corridor. Several Copters were in the area flying low making triangulation difficult. They were in the area around 30 minutes when a group of helicopters flying low, app 300' flew from the east heading west at a high rate of speed. They crossed I5 at the Green Hill exit, I think mp 76. Three Blackhawks flew with a net slung between them, one in the lead two trailing, and two gunships after them with guns trained on the loaded net. The air speed was app 140mph limiting the sighting to several seconds per group. Two of the cargos contained disc shaped loads, 15' diameter. The third, not necessarily in that order contained a isocelles triangular shaped object, simillarly sized to the Blackhawk copters. It was reported by a neighbor that a convoy of deuce and a half trucks were seen going up highway 6 at around noon, heading east. Troops were seen inside one of the trucks. At midnight an observer drove east on highway 6 app 10 miles. The road was void of traffic except for two Washington State Patrol cars parked together. At midnight there was nothing in the air. I went up on a hill in Olympia and watched for 30 minutes at 1:00 am surveying a huge area and did not see anything flying. This is a main flight corridor for SeaTac, Portland International, and McChord Air Force Base. At this point you can clearly see the Olympia airport, flights out of McChord, and the flight corridor between Seattle and Portland."],"Log Number":"US-04122011-0011"}