{"Disposition":"IFO","Object Shape":"Flash, Star-like, Other","Date Submitted":"04/13/2011 03:36 UTC","Latitude":"42.803416","Date of the Event":"04/12/1981 10:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/28657.html.txt","/var/www/straped/mufon/org/28657.html"],"trends":["There have been 7 other sightings in Fenton","There were no other sightings in Fenton on or around April 12th 1981"],"Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-83.69766","Log Number":"US-04132011-0008","Object Flight Path":"Undisclosed","Summary":"Red and Blue -ish Flashing Lights","divs":["Sighting Detailsi was in fenton, mi were i live currently. i was letting my dog out, and had to run out to my car for something. as soon as i opened the back door i noticed a bright flashing light to the NE direction(back porch faces north). as i looked closely and said to myself, \"what the hell is that\", i noticed there were blue and red lights flashing, almost like a strobe light. i immediately started to think of logical explanations, because afterall it was pretty obvious and visible to anyone who would look in its direction. i went to my car, got my stuff, and came back to the backyard. the light was still there. so i watched, thinking that eventualy it would make sense. i noticed that it was moving slightly. not fast, almost like a helicopter maybe. it went left, right, up, down, higher and lower, but stayed in the same general area and distance for at least 3 hours. the size or brightness of the light did not change much durring this time, thats why i say it stayed in same general area and distance. the way i know it was actually moving around, rather than my eyes playing tricks on me, was caause i had a treeline (a little mini woods)right in my yard were the light was. i watched the light move above the tree line, when i could see it clearly, and below the tree line were it would b hard to see as well because of branches blocking my view. i also watched it move from behind one tree to another, left and right. these were thick trees that didnt move to much with winds, the light was moving behind the trees. note: it wasnt the the trees blowing back and forth that made the light move, the light was moving,slowly. durring about the first 20 minutes of me watching this light, i noticed and heard a plane fly over my house,pretty high up, normal height for a plane, going towards the direction of the light. it didnt look like a comercial plane, but im not sure. about 10 minutes after that, a loud, low helicopter took off in the same direction, and basically flew slow, wide circles of the area. i didnt really see it after that (the Helicopter, but could still hear it here and there and catch a glimpse of its lights in the distance. i kept stareing at anything i could see or hear. i just started to take notice of everything going on in the sky. i turned around, now facing west or northwest, and i seen, what i would say looks like a small plane in the dark, flying only a couple hundred feet high. NO NOISE at ALL! it was honestly the lowest flying plane ive ever seen. if i had a baseball, i coulda probaly hit it with it. it had big bright yellowish lights acroos the whole side that i seen. thats why i say looked like a plane. i really freaked me out, as i watched it glide slowly and sliently across the sky. if i had to guess it was probaly traveling about 60 mph, give or take a few. eventually it flew out of my vision behind a tree line (a different tree line). all i could hear the whole time was a car on the road here and there, and alot of dogs barking. there is an airport in flint, but it was at least 10 to 15 miles away from were i seen this. my friend lives across the street from it, and when a plane takes off or lands, its really loud and shakes the house pretty much, so i know that the object not making any noise was unusual, especialy bein that low. after that, other than the light in the sky i was watching, there wasnt anything else in the air flying the whole time. after watching the original light for a total of 2 hours, as it hovered around bak n forth, i decided to go inside at about 1230 am. i couldnt just forget about it, so i found a window that had a view of it and watched it for another hour. it actually started to come a little closer to my houses area at one point, but took its time. at about 2 i decided to call it a night, but it was still there when i left it. conclusion: it could of been helicopter, thats what i originally thought, but a helicopter staying and hovering in one general area for 3 hours, without any noise, doesnt seem likely. but idk? as far as the low silent flying object to my west, i think it coulda been a plane, but it was silent and really really really low. im a pretty down to earth, logical dude, but last night made me question myself, cause i could not find anything logical about the light to my east. btw, i tryed to take pics and video, but my camera sux and my phone camera sux even worse. as"],"Object Features":"Undisclosed","Case Number":"28657","Weather Factors":"Unknown","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.803416,+-83.69766(28657)&iwloc=A&hl=en\"> mufon case (28657) map </A>","Source":"MUFON","City":"Fenton"}