{"files":["/var/www/straped/mufon/html2text/28659.html.txt","/var/www/straped/mufon/org/28659.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.970078,+-83.916949(28659)&iwloc=A&hl=en\"> mufon case (28659) map </A>","Weather Factors":"Windy, Light","Latitude":"35.970078","Disposition":"Unknown","Log Number":"US-04132011-0010","City":"Knoxville","Sighting Duration":"Undisclosed","Date Submitted":"04/13/2011 06:53 UTC","Region":"Tennessee","Source":"MUFON","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"28659","divs":["Sighting DetailsI was walking counterclockwise on the track at local park between 3pm and 3:45 pm. Walking E to ENE I happened to look up at the sky and saw a small bright multicolored object in the sky. I was wearing polarized sunglasses at the time and object was still visible without them on but image was not as crisp. The object really didn't have any particular shape and was moving N to S very slowly. I did see a jet at altitude near it displaying a contrail and this object moved beneath the contrail. Very hard to gauge distance for the sky was utterly clear and very blue. There was a 5-10 mph wind blowing from the North so I presumed it was a lost mylar balloon or some kind of reflective debris. It randomly flashed red, blue, yellow, green and silver as if glinting in the sun. I finished my walk and moved my car near a bench on the west side of the walking track that I could rest on and the bench was facing ESE. The moon was rising in front of me on the tree line across the park. Thinking about what I had seen I looked up at the sky again and was watching jets plow across the sky when I saw another object but this was ball shaped and solid white. It too was moving roughly N to S at a very slow pace and I could not determine how high up it was, greater than 1000' no doubt but I had no frame of reference in the sky to compare it to. Certainly lower than planes that were producing contrails this day. It lazily tracked on a straight line when I saw another pair of white objects downrange from the first one. These appeared somewhat stationary. The first single object moved into the area of the pair and I lost track of them due to distance and glare. My wife called me and I was telling her this nutty story when I noticed nearly directly above me another of the flashing multicolored objects. This one was at about the same distance and was moving NE to SW I lost track of it when it moved behind the branches of a tree behind me. It was 70 deg. with a light N to S wind with the mid afternoon sun to my back. There were plenty of other people at the park but no one else seemed to pay any attention to these things. They didn't exhibit any non ballistic behavior other than the very slow rate of speed. Much slower than the many aircraft in the sky at the time. These without a doubt could be trash or balloons or something similar. The odd thing was the number of then in such a short period of time. I would expect to maybe look up and see a single object and be satisfied and write it off as a balloon but to see 5 of them and traveling in different directions in a 45 min period was a bit too odd for me."],"Object Features":"None","Viewing Distance":"Unknown","Longitude":"-83.916949","Object Shape":"Circle, Egg, Flash, Sphere","Country":"United States","Summary":"Mixture of mutlicolored and solid white objects in sky","Date of the Event":"04/13/2011 12:00 UTC","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around April 13th 2011"]}