{"Viewing Distance":"Unknown","Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"04/13/2011 03:49 UTC","Country":"United States","trends":["There have been 2 other sightings in Township of Springfield","There were no other sightings in Township of Springfield on or around April 10th 2011","This sighting has never been favorited.",""],"Latitude":"40.705924","Tags":"City","Sighting Duration":"Undisclosed","City":"Township of Springfield","divs":["sighting detailsi posted some of this last nite.well i went through them again tonight because i caught so many pictures\\images...and was so excited, (it was by far the most unreal event i've pretty much ever witnessed!!) and i should have tried to list them as they started arriving and departing... it was the most action in a long...long time!!! it started at 11:30pm and it continued up until 2am at which time i went to bed and couldn't continue watching anymore...bcuz i was gonna pass out...ok so its monday night its pouring rain...cold and nobody that i know of is taking a helicopter tour over manhattan on a night like that. and it isn't any airplane, besides the fact that after 911 planes are restricted over nyc.. and i have pictures of lights that appear on the water as well..... just watch these cams especially cam 3 and cam 4...you wont believe the things you will see my friend contact my email through the web page and ill send you pictures that will make you say...whats going on ???"],"Summary":"NYC RED UFO ??...REAL???.... i'd say so !!!","Disposition":"Unknown","Object Shape":"Cigar, Cone, Circle, Cylinder, Disc, Sphere, Square, Rectagular, Triangle, Other, Unknown","Object Flight Path":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28651.html.txt","/var/www/straped/mufon/org/28651.html"],"Date of the Event":"04/10/2011 12:00 UTC","Log Number":"US-04132011-0002","Case Number":"28651","Region":"New Jersey","Longitude":"-74.314135","map":"<A HREF = \"http://maps.google.com/maps?q=40.705924,+-74.314135(28651)&iwloc=A&hl=en\"> mufon case (28651) map </A>"}