{"Disposition":"Insufficient Data","Tags":"City","Date of the Event":"02/23/2011 10:55 UTC","Region":"Pennsylvania","Object Flight Path":"Undisclosed","City":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.206922,+-77.187265(28654)&iwloc=A&hl=en\"> mufon case (28654) map </A>","files":["/var/www/straped/mufon/html2text/28654.html.txt","/var/www/straped/mufon/more/28654_submitter_file1__phonephotos159.jpg","/var/www/straped/mufon/more/28654_submitter_file2__phonephotos159.jpg","/var/www/straped/mufon/org/28654.html"],"Summary":"I saw a thick triangle with red and white light, I slowed to a stop saw it wasnt moving. then started moving very slow was as big as a two story house. crossed the street speeding up no sound then it was gone.","trends":[""],"divs":["Sighting DetailsI was driving back to my house on Rt316 leightersburg rd just at the maryland Pennsylvania state line after visiting my parents and was on the phone with a friend and my line started to get static and I was complaining about it to her and then I noticed a bright light out of the corner of my left eye. It side view was tall as a bill board and glowing bright white. It then rotated slightly while still in the same place and I could now see it had a triangular shape with the other side having red and white light constant glow nothing was blinking I put the windows down and heard no noise at all. the object was on the left side of the street with myself facing twards the maryland state side. It then started moving crossing the street and heading to the right of the road I was frozen as it was distancing it finally dawned on me to take a photo with my phone I was shaking a little but rested my arm on each other as I would my rifle when I was in the military. As I took the picture it sped up till I could no longer see it over the tree line. I have had problems sleeping ever since this occurance."],"Latitude":"41.206922","Longitude":"-77.187265","Date Submitted":"04/13/2011 01:43 UTC","Case Number":"28654","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Country":"United States","Object Shape":"Triangle","Viewing Distance":"Unknown","Log Number":"US-04132011-0005"}