{"Log Number":"US-04132011-0007","Summary":"UFO witnessed with twelve on-duty State College police officers","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/28656.html.txt","/var/www/straped/mufon/org/28656.html"],"Object Flight Path":"Undisclosed","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.795195,+-77.850881(28656)&iwloc=A&hl=en\"> mufon case (28656) map </A>","Country":"United States","Date of the Event":"07/02/2009 04:30 UTC","Latitude":"40.795195","Longitude":"-77.850881","Case Number":"28656","Viewing Distance":"Unknown","City":"State College","Region":"Pennsylvania","Date Submitted":"04/13/2011 03:29 UTC","divs":["Sighting DetailsI'm not a great writer to bare with me. I was walking home from a local 24hr Sheetz gas station with my at the time 14 year old son. I was pointing out an object to the north that was not a star that had a strobe effect. He thought it was a helicopter cause the object was stationary. After returning home, I wanted someone else to see what I was seeing. I reluctantly called 911 to report it. The said they would send out a car. Clouds covered the object two minutes before the first officer arrived. I explained to him I was not drinking and told him my story thus far. Then a second object appeared in the eastern sky. It was a pale orange sphere that would grow fifteen times bigger with in a fraction of a second. He radioed another car and more officers showed up. This went on for 45 minutes to an hour. when all was said and done there was eight cars and twelve officers. This was never in the paper or the local news. The officers were freaking out cause they didn't know what it was. There response was \"swamp gas\", \"light refracted off of Venus.\" Then they said \"you can call us again, but there is nothing we can do about it.\" They also got several photos possibly video as well."],"Weather Factors":"Unknown","trends":["There have been 10 other sightings in State College","There were no other sightings in State College on or around July 2nd 2009"],"Disposition":"Unknown","Object Features":"Undisclosed"}