{"trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around February 7th 2003"],"Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Stationary","Date of the Event":"02/07/2003 07:50 UTC","divs":["Sighting DetailsWhatever it was that I saw, I cant really say that it was UFO. It was SOMETHING,but it was unlike ANYTHING Id ever seen before. I dont even really know how todescribe what I saw. I can only explain what it was LIKE, not what it was,because there arent any words to fit what it was.Me and four friends were standing outside of a restaurant in Columbus ArenaDistrict waiting for the valet to bring our car around. It was after sundown,and I remember the exact time because we were concerned about missing the playwe were going to. I was 750 PM, so the sun had been down for almost two hours.It was a perfectly clear night.One of the people in my group said, hey, whats that And pointed almost straightup. I looked up. In the sky were two beams of light. It looked like someone hada REALLY, REALLY powerful flashlight and was shooting it through a fog bank. Butnone of the fog was outside of the shafts of light. They were pretty closetogether, and not perfectly parallel. Each of the beams were probably only about15 times as long as it was wide. They were not incredibly bright, but to see thelights at such an altitude, it would have to have been bright.They stood there motionless for several minutes. No movement of any kind. Wealso noticed two other beams, of exactly the same size, dimensions andarrangement, but quite a bit higher above the first two much dimmer, off to theside a bit, and rotated 90 degrees counter-clockwise. These two stayed in placejust like the first ones.My first thought was that an airplane with its headlights on was coming in for alanding at the Columbus Airport, and was just happening to come through a tinycloud that you couldnt really see. Except that the airplane would have had to bestuck in the exact same spot for all that time. When I say that there was nomovement, I mean there was absolutely ZERO movement.We stood there staring at this phenomenon for what seemed to be 5 minutes untileveryone else got bored and cold. Note that we were watching it this long eventhough we had plans to see a play. I wanted to stay and keep looking. It seemedodd to me that the other three witnesses seemed to lose their interest in thebeams.So we got in the car and drove to our destination about 5 minutes away. I kepttrying to see the lights through the windshield, but since they were straightabove us, I could not. When we got out of the car perhaps five minutes later, Ilooked up, and they were gone.So there you go, four beams of light, flo"],"files":["/var/www/straped/mufon/html2text/2866.html.txt","/var/www/straped/mufon/org/2866.html"],"Longitude":"-82.997174","Summary":"Short, stationary light beams, motionless in the c","Sighting Duration":"00:05:00","Log Number":"","Source":"MUFON","Region":"Ohio","Date Submitted":"02/07/2003 07:50 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.964126,+-82.997174(2866)&iwloc=A&hl=en\"> mufon case (2866) map </A>","Object Shape":"Cylinder","City":"Columbus","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","Latitude":"39.964126","Tags":"City","Case Number":"2866"}