{"Latitude":"41.675328","files":["/var/www/straped/mufon/html2text/28667.html.txt","/var/www/straped/mufon/org/28667.html"],"Longitude":"-85.706101","Object Features":"None","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.675328,+-85.706101(28667)&iwloc=A&hl=en\"> mufon case (28667) map </A>","Weather Factors":"None","Source":"MUFON","Summary":"Three large triangular shaped objects moving North in a line","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"02/10/2011 08:30 UTC","Log Number":"US-04142011-0005","Tags":"City","Country":"United States","Date Submitted":"04/14/2011 02:48 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving South into the town, heading to the grocery store when I noticed a couple of red lights in the sky. My first impression was that they were the beacon lights on some radio towers, but I knew that there were no towers where the lights were. I slowed down to look closer and realized that there were three lights forming a triangle and they were slowly moving North. My second thought was that they were fire kites By this time, the lights were almost overhead, but off to my left. Then I noticed another set of lights directly behind the first and in the exact same triangle formation. The ligts appeared to be 300 to 400 feet in the air and the shape they made about 100' long and 35-40 feet across at the back (base) of the triangle. I pulled to the shoulder of the street and rolled down my window, but could not hear anything. I decided to move up to a parking lot and get out. As I turned into the parking lot, I noticed a third set of lights directly behind the second - the same size and shape and moving in the same direction. I have never seen fire kites maintain such a tight formation and move at exactly the same speed. From my truck, I saw all three lights from almost head on. The triangle form was very clear. After I pulled into the parking lot, my viewing angle made the triangles flatten out - telling me they were not very high up. I grabbed my cell phone, ran to clear area and took a quick video of the third set of lights. Unfortunately, the video quality is poor, the lights appear to blink and go in and out of view. These lights stayed consistent orangish red color, never blinked and never made a noise. I have attached the video taken directly off my phone. In the frame, there are two telephone posts. At the beginning, the lead light of the object is just to the left of the right post, about halfway up. The trailing lights are just below the flare from the street light. The lights will move between the two posts, the lead light almost in line with the top of the second post. The angle makes the trailing lights almost appear as one, but the angle I first saw them at showed a good distance seperating them. There is another light dancing in the middle of the shot - this is a flare from something on the camera lense. The three light can be seen obviously moving. Cars go by oblivious to what I am watching. I did not think I was getting any video, so I quit shooting. Immediately after I turned the camera off, I heard someone behind me exclaim \"oh my god\". The parking lot I stopped in was the VFW hall and someone came out to see why I had jumped out of my truck leaving the door wide open. Two people from the hall also witnessed the lights, but I did not get there names. I am not someone who is quick to lable something supernatural, but I do not have an explanation for these lights. I was in awe when I saw them, then schocked. I thought about getting back in my truck and following them for a while, but then I thought I was being silly and just went on to the grocery store. I posted the video on Facebook that evening, but immediately pulled it down for fear of ridicule. I know what I saw, but it's hard to get others to believe it."],"Region":"Indiana","Case Number":"28667","trends":["There have been 2 other sightings in Middlebury","There were no other sightings in Middlebury on or around February 10th 2011","This sighting has never been favorited.",""],"Disposition":"Unknown","City":"Middlebury"}