{"Tags":"City","Disposition":"Unknown","Log Number":"US-04132011-0012","Longitude":"-84.547755","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around April 11th 2011"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"04/13/2011 09:41 UTC","City":"Lansing","map":"<A HREF = \"http://maps.google.com/maps?q=42.734065,+-84.547755(28661)&iwloc=A&hl=en\"> mufon case (28661) map </A>","Object Features":"Undisclosed","Source":"MUFON","Object Flight Path":"Undisclosed","Latitude":"42.734065","Summary":"Two Unexplained Flying Crafts","Country":"United States","Case Number":"28661","files":["/var/www/straped/mufon/html2text/28661.html.txt","/var/www/straped/mufon/org/28661.html"],"Object Shape":"Cigar, Triangle","Region":"Michigan","divs":["sighting detailson 4\\11\\11 about 11:00-11:30 p.m. my entire family witnessed two unknown objects about 200 ft above the tree lines coming in from the ne and flying sw. neither object made any noise. we had been watching the night sky observing different lights when suddenly out of nowhere from the ne, we saw a very odd shaped object flashing red\\blue lights. then from a more northern direction was a \"plane-like\" craft seemingly following the first object at about 3\\4 mile behind. if you were not outside observing these two objects flying overhead you would have never known they had flown over. neither object made any noise. they were both flying about 50-60 mph. the second craft appeared to be in the shape of a triangle and had two amber large circle tail lights on either end of the craft. the tail \"lights\" were very far apart. i believe that what we saw here in lansing is the same thing that the person in fenton reported seeing. we were also all very shocked and could not figure out what we were looking at. the first object that was flashing the red\\blue lights, i can't even explain the shape, it looked like the bottom object had a second object stacked on top as if it was carrying something. both objects continued flying southwest and eventually flew out of our sight."],"Date of the Event":"04/11/2011 12:00 UTC","Viewing Distance":"Unknown"}