{"Date Submitted":"04/14/2011 12:18 UTC","files":["/var/www/straped/mufon/html2text/28664.html.txt","/var/www/straped/mufon/org/28664.html"],"Summary":"Three star like lights lined up perfectly in the western sky. The wobbled to and fro. The lights were on steady but seemed to be twirling.","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Kankakee","There were no other sightings in Kankakee on or around April 13th 2011"],"Case Number":"28664","divs":["Sighting DetailsWe were closing up the house for the night. It was beautiful outside nice and bright from the moon and the stars were very brillant as it was so clear out. So, I decided to step on out and look at the very brilliant night as I so often do. Its warmer and no wind blowing so i scanned the sky and immediately noticed the 3 star like objects lined up... that are NEVER there any other evening. I was looking westward and slighty up. I called to my mother and fiancee to look at the stars. Not mentioning what \"I\" am visualizing and thinking. Right away my mom picked up on those \"new stars\" over the field west of us. My fiancee was having a hard time admitting what his eyes were telling him at first and then at the same time my mother and i said,\" Look the one on the left is raising up!\" It was clear then that they were all kinda hovering and moving closer to each other then back apart. Sometimes going higher or lower than each other. Not blinking, not colored but steady bright white lights just a little different shade than the stars, a little brighter. They were close compared to the stars as well. Its a guess but am thinking they were 2000 ft up. Maybe 200 ft apart at times. We watched over a steady 15 min. period. I would go do other things and come back and check on them. After 25 min. had passed since I first noticed them, they were gone. Yet all the other stars in the sky were unmoved. I know what we seen and I have to admit after having another more terrifying \"sighting\" a couple of years ago with other witnesses, I am disturbed. For one the sighting is in the exact same place within a mile of the other incident. Two we have heard strange things in the night, not explainable. Last but not least third to have witnessed such an event more than once in a lifetime is just shocking! Why are they here, just watching us? The three of us are sure without uncertianity that we are not alone here on earth!!! I never reported to MUFON what happened to us two summers ago for I was unaware of mufon, but I am willing to speak with someone about that incident."],"City":"Kankakee","Weather Factors":"Unknown","Latitude":"41.127782","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Hovering then path","Date of the Event":"04/13/2011 09:50 UTC","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-04142011-0002","Source":"MUFON","Object Shape":"Star-like","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.127782,+-87.854953(28664)&iwloc=A&hl=en\"> mufon case (28664) map </A>","Region":"Illinois","Longitude":"-87.854953"}