{"Latitude":"49.148655","Object Flight Path":"Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=49.148655,+-122.912533(28660)&iwloc=A&hl=en\"> mufon case (28660) map </A>","City":"Delta","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn April 8th, 2011, at approximately 02:00 hours, I was working outdoors near the intersection of Centre St and Dunlop Rd in Delta, BC. After completing a task at a nearby park, I got into my car and began to drive eastbound on Dunlop Rd towards Terrace Dr. The sky was clear and stars were visible overhead. My eyes were drawn to numerous orange coloured lights in a \"V\" pattern flying in a northerly direction towards the river. There were approximately 11 orange coloured lights that outlined the \"V\" shape. I immediately pulled my car over and got out to look at the object more closely. I have worked a lot of night shifts over the years, and I have never seen any aircraft lit up like this before. As I looked up at it, it continued to fly north towards the river. It appeared to be quite large, and no sound could be heard from it. I would describe its speed as \"leisurely\" as it did not appear to be going fast or slow. I watched for a short while as the object continued north. My observation of the object was eventually blocked by a tree line as it continued north. I was able to move closer to the trees and view between them, and I watched as it continued north. It did not appear to be descending or ascending. It could very well have been a plane of some sort, but like I said, in all of my years working night shifts I have never seen an aircraft quite like that or even lit up like the way it was lit up. I did not have the opportunity to photograph or videotape the object."],"Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Delta","There were no other sightings in Delta on or around April 8th 2011"],"Source":"MUFON","Region":"British Columbia","Disposition":"Unresolved","Object Features":"Unknown","Weather Factors":"Unknown","Date of the Event":"04/08/2011 12:00 UTC","Country":"Canada","files":["/var/www/straped/mufon/html2text/28660.html.txt","/var/www/straped/mufon/org/28660.html"],"Case Number":"28660","Date Submitted":"04/13/2011 07:59 UTC","Log Number":"CA-04132011-0011","Summary":"Boomerang w/ orange lights (approx 11 lights) across entire front.","Longitude":"-122.912533","Object Shape":"Boomerang"}