{"Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=36.155982,+-95.987485(28663)&iwloc=A&hl=en\"> mufon case (28663) map </A>","Object Features":"Other","Case Number":"28663","Latitude":"36.155982","City":"Tulsa","Source":"MUFON","Date of the Event":"04/13/2011 11:50 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Log Number":"US-04142011-0001","divs":["sighting details my wife and i were headed west on hwy. 11 in tulsa,oklahoma at 11:50am about 6 miles north of downtown tulsa. i saw thru my windhield at about 11-12 o'clock high into a clear blue sky something oval to almost round shaped with like 2 very very bright lights inside the shape. it seemed to be a shiny metallic outside the lights. my wife saw it about the same time. at first i thought it might be a bright reflection on windshield from the sun but the sun was behind the car over my left shoulder. the object was moving to n\\w direction. after driving 2 miles watching the object we turned to north on hwy. 75 to go to an appointment in bartlesville. the object had started loosing the 2 bright lights and seemed to change to dull gray color and shaped like a cigar or missle shaped. it seemed to sort of fade away briefly. after heading north on hwy. 75 for about 15 seconds we could still see it but it faded away again. after a few seconds it appeared again from lower in west sky and accelerated up at about a 20 degree angle going north\\west direction still dull gray in color cigar shaped with like a rudder on the back of it. we watch it for about a mile down the hwy. headed north and it just faded away or disappeared. we should have been able to see it in the blue sky for quite a ways with the weather conditions but it just vanished. really weird and we'll never forget it."],"Summary":"about 6 miles North of Tulsa Very bright at about 11 o'clock in sky moving N/W up and down and changing shape & disappearing.","files":["/var/www/straped/mufon/html2text/28663.html.txt","/var/www/straped/mufon/org/28663.html"],"Country":"United States","trends":["There have been 59 other sightings in Tulsa","There was one other sighting in Tulsa on or around April 13th 2011"],"Longitude":"-95.987485","Date Submitted":"04/14/2011 12:01 UTC","Object Shape":"Bullet, Missile, Cigar, Oval","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown"}