{"Summary":"Circle of lights as from my report of 1960's","Object Flight Path":"Undisclosed","Object Shape":"Circle","City":"Tacoma","files":["/var/www/straped/mufon/html2text/28685.html.txt","/var/www/straped/mufon/org/28685.html"],"Latitude":"47.255557","Date of the Event":"07/04/1988 12:00 UTC","Case Number":"28685","Log Number":"US-04152011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=47.255557,+-122.436671(28685)&iwloc=A&hl=en\"> mufon case (28685) map </A>","Object Features":"Undisclosed","Disposition":"IFO","Tags":"City","divs":["sighting detailsit was the end of a 4th of july extravaganza on the tacoma waterfront. i was guest of a band that played for the freedom fest (tacoma is a military town). as all were packing up and the crowd was begining to disperse, my eye was drawn to the sky. it was anomolous that a bright light would still remain long after the fire works display. i did not connect it to my early teen's sighting that i have just reported to you because of the time\\memory thing. i did point it out to adjacent bystanders. i could interest none of them in the spectacle... a silent ring of many lights that first hovered-again at approx 200ft-it then began to move northeast along the shoreline towards point defiance. there was about five minutes of time before it rounded the point, turned south and disappeared around the bluff at the point and presumably went south through the narrows. as a pilot i have flown in and out of the narrows airport many times. i know the airspace parameters and layers. the object was at all times-when in my sight-below the tacoma narrows airspace and therfore presumably below their radar."],"Source":"MUFON","Longitude":"-122.436671","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around July 4th 1988"],"Region":"Washington","Sighting Duration":"Undisclosed","Date Submitted":"04/15/2011 03:11 UTC","Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Unknown"}