{"Viewing Distance":"Unknown","City":"Falls Church","Longitude":"-77.169971","Disposition":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Latitude":"38.884524","divs":["sighting detailslate last night (on or about 3:08 a.m., 04\\14\\11) i stepped outside for a smoke. all of a sudden i heard an increasing in volume thunderous roar, approaching from the north-west. this made me look up. it sounded like military jet with the pilots really pushing the pedal to the metal. i did not see the jets, but it sounded like the ones i saw flying over andrews airforce base in maryland. commercial jets do not sound anything like that and fly much higher. (i see a lot of them, since i live about 15 minutes away from dulles international airport). these jets seemed to be flying pretty low and i have never seen or heard them flying over at this time of night - never. i looked up to see what is making all that noise, but did not see the jets. however, panning the skies from west to south, i saw what looked like a very bright large star, crossing the sky from west to south in the south-western quadrant of the sky. it had the same bluish-white tint to it that the stars do. the line of sight was at about 30 degrees angle to the ground. i could not judge the distance and did not see any shape that might have been associated with the object, but it crossed the sky in under 10 seconds and disappeared behind the trees i have to the south of my house. the strangest thing about the object was that it was blinking in a very peculiar manner. commercial jets have red and green light, blinking continuously without interruption. this thing was bluish-white, would blink 3 times within approximately 1 second, then would stop blinking all together for a second, then blink 3 times within approximately 1 second again, then stop blinking for a second, etc., during the whole 10 seconds or so it took it to cross the visible to me south west quadrant of the sky. these was no noise at all coming from the ufo directing - the roar i heard was rapidly approaching from the north - west. as i said before, the ufo disappeared behind the trees in about 10 seconds, but i kept hearing the roar for another 5 minutes or so. sounded like the jets kept flying around. then everything went silent. half an hour later the roar came back, but i was already in bed and did not run outside to see what was going on. it would not do any good anyhow, since the speed with which the object moves - it would have been gone by the time i got out. i came to work and had to tell someone what i saw. i told the story to a security guard that i am friendly with and he said that he lives right near andrews airforce base and he heard they scrambled jets several times last night, which, according to him, they never do at night. he thought someone might have flown into washington dc no-fly zone or something. this confirms my suspicions that the roar i heard was military jets. the object could not have been a satellite. i have seen those and they do not blink, do not fly at 30 degrees angle above the horizon and do not get chased by the military jets because the jets cannot fly that high."],"Sighting Duration":"00:00:15","Date Submitted":"04/15/2011 03:52 UTC","trends":["There have been 3 other sightings in Falls Church","There was one other sighting in Falls Church on or around April 14th 2011"],"files":["/var/www/straped/mufon/html2text/28687.html.txt","/var/www/straped/mufon/org/28687.html"],"Region":"Virginia","Summary":"Blinking bluish-white star-like object chased by military jets from Andrews Airforce Base","Tags":"City","Object Features":"Unknown","Case Number":"28687","Log Number":"US-04152011-0008","map":"<A HREF = \"http://maps.google.com/maps?q=38.884524,+-77.169971(28687)&iwloc=A&hl=en\"> mufon case (28687) map </A>","Country":"United States","Object Shape":"Star-like, Unknown","Object Flight Path":"Straight-line path","Date of the Event":"04/14/2011 03:08 UTC"}