{"Object Flight Path":"Straight-line path","City":"North Topsail Beach","divs":["Sighting DetailsIn mid- September 2003 I was sitting on my porch with a friend and noticed anunusually bright star due North that had what appeared to be about 30 or moresmaller bright light orbs pouring out of it. These orbs of light streaked acrossthe sky and then reversed their directions and began playing and interactingwith each other as if in a dog-fight. It reminded me of those old war filmswhere the planes would fly in formation and then breakaway and engage with theenemy...I am a skeptic at heart and did not want to believe what I saw clearly takingplace.These aerobatics continued for some time and we ruled out all of the usualcauses that might have created this illusion1 neither of us was in intoxicated in any way.2 The sky was totally unobstructed by clouds or Moonlight.3 They were not birds or bats due to the velocity of travel across a hugeportion of the sky and the way in which they could stand completely stillthey could veer off in any direction without breaking speed, either.4 I woke up my roommate and had her come and see this orbs also.5 Last, but not least, at 6AM they all returned to the star just beforedaybreak.I might add also that this occurred just days before Hurricane Isabelle beganits journey towards our shore. I live one mile from the Atlantic Coast andIsabelle was headed directly for us as a category 5 hurricane. In the lastapproach to our shoreline Isabelle reduced to a category 3 and changed course tocome inland above us.I know that these were otherworldly craft and wonder if they usually appearbefore catastrophic events and I also wonder if anyone else in our areawitnessed this same phenomenon."],"Disposition":"Insufficient Data","Tags":"City","Date Submitted":"09/18/2003 04:00 UTC","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.469611,+-77.47191(2868)&iwloc=A&hl=en\"> mufon case (2868) map </A>","Object Shape":"Undisclosed","Latitude":"34.469611","Weather Factors":"Unknown","Date of the Event":"09/18/2003 04:00 UTC","Log Number":"","Region":"North Carolina","Case Number":"2868","Summary":"Multiple craft from fixed object in sky","Longitude":"-77.47191","trends":["There have been no other sightings in North Topsail Beach","This sighting has never been favorited."],"Country":"United States","files":["/var/www/straped/mufon/html2text/2868.html.txt","/var/www/straped/mufon/org/2868.html"],"Viewing Distance":"Over One Mile","Sighting Duration":"01:59:00","Source":"MUFON"}