{"Country":"United States","Date of the Event":"04/14/2011 09:27 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-04152011-0009","Source":"MUFON","Object Shape":"Star-like, Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.789308,+-116.952325(28688)&iwloc=A&hl=en\"> mufon case (28688) map </A>","Date Submitted":"04/15/2011 04:14 UTC","Longitude":"-116.952325","City":"San Jacinto","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Three UFOs sighted over San Jacinto Riverside.","Tags":"City","files":["/var/www/straped/mufon/html2text/28688.html.txt","/var/www/straped/mufon/org/28688.html"],"Case Number":"28688","trends":["There have been 6 other sightings in San Jacinto","There were no other sightings in San Jacinto on or around April 14th 2011"],"Region":"California","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Features":"Unknown","Latitude":"33.789308","divs":["sighting detailsmy wife and i were taking a walk and left the house a few minutes past nine pm pst. i shot a short video (32 sec) on my cell that is time stamped \"04\\14\\2011 09:27pm\" we were watching the activity for about a minute and a half or two minutes before i began shooting. the footage does not reveal anything, but it recorded my wife and i talking about what we were seeing and it marked the time. twenty minutes later we saw two more ufos. we were just taking a stroll around the neighborhood. we turned a corner and were facing west. before us at this point was about five miles of open land then there was the outline of the foothills spreading north and south. it is very dark where we were and we stopped to look at the starry sky. high in the sky at about \"one o'clock\" my wife and i saw a bright white light moving very quickily toward the south. it was first a fast moving ball of light then a \"contrail\" appeared on the end of it. it wasn't a contrail, but a long trailing light like a rocket shooting up into space, but this was going north to south and there was no smoke. the contrail appeared only a few seconds. then the light appread to angle down and turn toward us (we were facing west). as it headed north-east (it was veering to our left) angling downward (but not steeply) it flared up and a fan of light radiated out from the front and trailed behind. it was even all the way around and trailed off like a mist of light. we could see the main white light inside this fountain of light that shot out the \"front\". then the fan of light faded, leaving just the ball of light which then disppeared as well. we scanned the sky and the white light appeard again about five seconds later, but it was bigger and closer (but still very far away). this then disappeared and reappeared very quickly even closer and lower. the ball of light then radiated a fountain of light again, but it was red and the white ball inside was now red. this red fan or fountain of light seemed to hover for what seemed a long time, but it was maybe a good 3 or four seconds. the fountain ended, leaving only the ball of now red light and the thing then veered upward and disappeared. we live near an air force base and know the sounds of jets and helicopters. about two minutes after the light disappeared a military jet flew from north to south before us and hightailed it in the same direction as the ball of light. we know a military jet from a passenger jet. this military jet zoomed across our field of vision and went after the red ball of light. about twenty minutes later we saw two more ufos high in the sky straight ahead of us. the second video we took is only 16 sec and is time stamped \"04\\14\\2011 09:50pm\" cheap cell vid is only good for time and our comments. straight ahead of us and almost centered over the foothills was a bright star that was there during the above episode. twenty minutes after the above and we were still watching the sky when we both saw a tiny ball of light come out of the \"star\". the tiny white light came out on the northside of the star and did a backward 'c' move and stationed itself above the star. it hovered for 5 or 6 seconds and zipped up and to the north. at the same time the star moved and went in a straight line to the south. it just began moving southward. this \"star\" was right in front of us during the whole thing and slowy moved in a straight line to the south and disappeared really fast after it begn moving. we kept looking at the sky for another twenty minutes. saw many military helicopters moving in the sky before us, but no more ufo sightings at this point."]}