{"Tags":"City","Summary":"UFO sighting Object alleged in August of 2003","City":"Covington","trends":["There have been 7 other sightings in Covington","There were no other sightings in Covington on or around August 11th 2003"],"divs":["Sighting DetailsNear Covington, KentuckyUFO SightingDate August 11, 2003 - between 730 800 p.m.Location Lewis St., Devou Park, Covington, KY KentonCountySummaryMr. Nick Wright name changed, on file reports thatlast summer, on August 11, 2003 at between 730 to 800p.m., an unidentified flying object was spotted in anarea near Downtown, Cincinnati.Near his residence at 901 Lewis St., Covington,Kentucky, Mr. Wright observed the very strange object inthe company of two other witnesseshis brother andsister-in-law. Lewis Street is situated at a highelevation near Devou Park, which is a main NorthernKentucky scenic location overlooking the cityscape ofDowntown, Cincinnati.The object was first spotted by his brother, who said tothe rest What is thatThe three witnesses, looking to the north-northwest andabout 40-degrees above the horizon, saw an egg-shapedobject holding a stationary position, estimated to hoverabove River Road or Saylor Park, on the Ohio side acrossthe river. The object, which was said to make no noise,was brushed or polished aluminum and its pointed end wassituated straight up at a vertical elevation. The centerpart of the object was comprised of a rotating band. ora strip in the middle portion of the object that hadmovement.The witness estimated the object held a stationaryposition above River Road near Saylor Park and may havebeen visible from the ClevesNorth Bend area. Heestimated its altitude to not be quite as high asroutine air traffic in that area near the landing pathfor planes to the Greater Cincinnati Airport inErlanger, KY, and said it could have been anywherefrom 2,000 to 12,000 foot elevation. From hisperspective, the object was as big as a thumbnail atarms length.The witness said he had plans to run into his mothershouse to retrieve a pair of binoculars. He was gone lessthan 60-seconds and when he returned back outside theobject had disappeared. His brother said that, whiletalking to his wife, he looked away for no more than aninstant and the object was gone.Prior to its disappearance, it was in the same positionfirst seen.Wright indicated that on the day of the sighting, theyhad expected a thunderstorm as some of the clouds werelooking fairly gray.WITNESS INFOThe witness obtained contact info for the hotline bywatching the UFO Update"],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/2869.html.txt","/var/www/straped/mufon/org/2869.html"],"Country":"United States","Log Number":"","Object Shape":"Egg, Oval","Object Features":"Other","Region":"Kentucky","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.083671,+-84.508554(2869)&iwloc=A&hl=en\"> mufon case (2869) map </A>","Latitude":"39.083671","Weather Factors":"Unknown","Date of the Event":"08/11/2003 07:30 UTC","Object Flight Path":"Stationary","Longitude":"-84.508554","Sighting Duration":"00:00:00","Source":"MUFON","Date Submitted":"08/11/2003 07:30 UTC","Case Number":"2869"}