{"Date of the Event":"04/16/2008 03:00 UTC","City":"Los Angeles","Region":"California","divs":["Sighting DetailsI was laying down on the driveway with my scotty dog at a friend's house about 3 miles west of Downtown Los Angeles. Under a shade tree, I had an unobstructed view of a cloudless sky looking towards the east, north, & South. I started observing what I thought was a reddish-orange colored metalic balloon floating in the sky,very faint, traveling slowly from south to north. I then noticed there were two of them, one following the other going south to north. Both were starlight brightness intensity & size during the day. They continued following another, then slowed down basicially directly above me, stopped, then the one to the south pivoted 360 degrees around the stationary one to it's north,then they started heading south from where I first saw them. Once they disappeared to the south, I noticed a third white object directly to the east, which looked like a star since it was uncolored. It moved very slowly to the south. While looking at this object, I then saw a white passenger plane above me to the east of me heading east after it took off from LAX & made the loop over the ocean. A few seconds later I saw one of the red-orange lights fly across the sky towards the plane, going as fast as the plane. They crossed paths and kept going in their respective directions. The sphere crossed the plane at about 30 degrees. The plane was going directly east and the sphere was going in a northeast direction. I was more curious about what I was watching as I really had to concentrate on their locations as they were very small and I assume very far away from me. I stopped watching them as they eventually got too faint to see as they were approaching the horizon,being hidden by trees & buildings. I was never afraid of what I was seeing, just curious. The feeling of seeing this was far different from what I saw on Nov. 14, 2008 when I saw a triangular group of lights & reported that to MUFON as well. That object was much bigger, at night, & more frightening. What's going on?"],"Summary":"two reddish-orange sphere & one white sphere all star sized","Case Number":"28698","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","Longitude":"-118.236135","Weather Factors":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.060274,+-118.236135(28698)&iwloc=A&hl=en\"> mufon case (28698) map </A>","Viewing Distance":"Over 1 Mile, Unknown","Latitude":"34.060274","Object Features":"Unknown","Disposition":"IFO","Tags":"City","Date Submitted":"04/18/2011 04:59 UTC","files":["/var/www/straped/mufon/html2text/28698.html.txt","/var/www/straped/mufon/org/28698.html"],"Object Flight Path":"Path with directional change","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around April 16th 2008"],"Source":"MUFON","Log Number":"US-04182011-0001"}