{"Region":"Texas","Object Shape":"Unknown","Tags":"City","Viewing Distance":"20 Feet or Less","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28700.html.txt","/var/www/straped/mufon/org/28700.html"],"Log Number":"US-04182011-0003","Weather Factors":"None","Date of the Event":"02/19/2011 03:25 UTC","Latitude":"29.428972","Object Features":"Undisclosed","City":"San Antonio","Date Submitted":"04/18/2011 05:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.428972,+-98.492148(28700)&iwloc=A&hl=en\"> mufon case (28700) map </A>","Country":"United States","Summary":"UFO shooting vibrations through roof of house","Object Flight Path":"Undisclosed","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around February 19th 2011"],"Disposition":"Unknown","divs":["Sighting DetailsIn Februay 2011 I was a guest at my Son's home in San Antonio. His house is located off Fountainwood Drive in the Woodstone Subdivision. At approximately 3:25 AM (before sunrise of February 19th) I was awake and laying on the bed reading a real estate investment book. I was laying on my stomach with the book propped up on the headboard and using the light on the side table next to the bed for reading. The bedroom window was open a few inches but the blinds were shut. I heard a sound that seemed like a ping from a submarine coming from the direction of the Julia Semmes library. I next hear the sound as if it were coming from Fountainwood and Judson streets. Then I heard the sound a minute later right outside the bedroom window. That really worried me and I wondered how this strobbing sound could get right up next to the house since there is a wood privacy fence 6 feet high next to the window that prevents anyone from entering the back yard. When I sat up I was glad the blinds were shut and suddenly my vision was blurred by some kind of a vibrational wave that shot down into the room from the ceiling area, travelled through my body, through the bed and floor. There was no sound with it but felt like the vibrations that would come off of a loud amplifier. I was stunned for a few seconds and then, I do not know how this happened, but I suddenly knew that THEY WERE GOING TO COME IN THROUGH THE WALL OF THE BEDROOM TO VISIT ME. I began screaming, in my mind only, \"Don't come in, don't come in, don't come in.\" I was begging them to go away. I then felt that they changed their mind and I suddenly began to feel that I had been respected and they were not going to come in. My sense of normalcy returned, I was telling myself that I was just being silly and stop having an over active imagination and decided to sit back again with my back leaning on the head board of the bed. I moved my feet up and bent my knees so that I could put my book on my thights and started to read again. At this point I was facing the bedroom door to the hallway which also gives me a view of the other bedroom door in the hall. I was the only person on this side of the house by the way. No one else in the family woke up or heard any of this noise as they were asleep on the other side of the house. Suddenly, in my minds eye, I saw two little greys standing in the doorway of the bedroom, one was about three feet tall, the other maybe 5 inches shorter, they were holding hands so seemed non threatening. There was another being in the doorway of the other bedroom, about five feet tall, had a wider body, and head not quite so odd shaped as the greys head shape. No clothing or any body parts were apparent on any of the three beings. I did not feel threatened at all by their appearance. Of course, when I wipped my head up to look with my real eyes there was nothing there. Then I head the sounds of the pinging object moving away from the house, I heard it twice before I lost the sound as it moved away. The sound was travelling towards Woodstone Elementary school. The street my Son's house is off, Fountainwood Street, is a fairly busy street, even at 3:30 AM. It is odd that there were absolutely NO TRAFFIC sounds while this event was taking place. Believe me, I was VERY happy to hear cars driving by again even though they had originally kept me awake that night. I had hoped that during this experience somebody would drive by, slam on their brakes and yell something or a bunch of cars would stop to look at the object so I would not feel so alone in the experience. It was as if all traffic had stopped moving for a few minutes. Let me say that the sound came towards my Son's house diagnonally from the area of the library and departed diagonally towards the elementary school--not using roads but floating over businesses and houses."],"Case Number":"28700","Longitude":"-98.492148"}