{"trends":["There have been 11 other sightings in Petaluma","There was one other sighting in Petaluma on or around April 13th 2011"],"Region":"California","Log Number":"US-04192011-0002","Date of the Event":"04/13/2011 12:00 UTC","Tags":"City","divs":["Sighting Details I was working late in the evening, at home, and stepped outside for a minute. I looked up, as I always do, to gaze at the stars. I was facing west, and noticed three fairly bright stars, but not unordinarilly bright. I noticed them because they formed a triangle, and one of them seemed to be moving, slowly. I assumed it was a plane, but this light was not blinking. I looked to the southwest and saw two other lights, heading in differing directions and blinking. Obviously planes. I looked back to the non-blinking light and watched it for a maybe 20 seconds as the light faded and then disappeared. I looked back to the southwest and saw the other lights (planes), still blinking. I looked back to the west to try and locate the non-blinking light, but there was no sign of it. I thought maybe the light was still there but just too faint to see directly, so I tried looking in the general direction of the non-blinking light, hoping to pick up something in my peripheral vision, but there was nothing. Generally, I wouldn't think anything of the light, but the short duration of its appearance, and the abrupt disappearance seemed unusual. It was a little exciting to see something that I would consider a UFO."],"Longitude":"-122.632572","Latitude":"38.240817","files":["/var/www/straped/mufon/html2text/28706.html.txt","/var/www/straped/mufon/org/28706.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.240817,+-122.632572(28706)&iwloc=A&hl=en\"> mufon case (28706) map </A>","Date Submitted":"04/19/2011 03:19 UTC","Country":"United States","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Summary":"Bright light mistaken for a star, moving slowly, dimmed, then disappeared.","Weather Factors":"Unknown","City":"Petaluma","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Case Number":"28706","Disposition":"IFO","Object Shape":"Star-like"}