{"Longitude":"-83.681316","Region":"Michigan","Tags":"City","Sighting Duration":"11:05:04","Summary":"30to40 feet across 5 to8 feet thick silver in color","Country":"United States","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=43.020527,+-83.681316(28704)&iwloc=A&hl=en\"> mufon case (28704) map </A>","Source":"MUFON","divs":["Sighting Detailsleft home at 1105 pm to see grand parents.our dog was growling and looking up.ilooked in same direction and saw the saucer shape object about 500 ft. it,was a side view of the ufo we could not hear any noise but our sheperd did.it slowly turned its side to us and started moving east towards the ac ,spark plug plant.it was traveling slowly ,turned south above dort highway and it gradually pick up speed then it just left our vision at highspeed.this was observed by a large crowd of people(plant employees )and, a patrol car (city) it was noted in the flint journal and the radio and tv stations talked about it and all the reports to the police were noted. it looked as it was observing the plant.please note this craft was silver untill it got tothe plants lighted area ,it then to on the vapor light colors.it had asingle red strobe on top and white and green lights on its side.i never believed in the ufo storys untill that night but i know they do exist..i was not drinking or doing drugs.i worked on the railroad in flint.i heard that another city north of flint saw the same craft.and during the month of january another wheel shaped object was seen by the east tywas police made those reports to the news."],"Log Number":"US-04182011-0007","Case Number":"28704","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Date Submitted":"04/18/2011 11:08 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Date of the Event":"12/06/1976 12:00 UTC","Latitude":"43.020527","files":["/var/www/straped/mufon/html2text/28704.html.txt","/var/www/straped/mufon/org/28704.html"],"City":"Flint","Object Shape":"Circle","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around December 6th 1976"]}