{"Tags":"City","Viewing Distance":"21-100 Feet","City":"Egg Harbor Township","Log Number":"US-04182011-0004","Source":"MUFON","Case Number":"28701","Date of the Event":"04/14/2011 09:30 UTC","Latitude":"39.397309","Date Submitted":"04/18/2011 06:28 UTC","Longitude":"-74.586521","Region":"New Jersey","Object Shape":"Triangle","Summary":"Large triangular, low flying, craft traveling from south to north.","map":"<A HREF = \"http://maps.google.com/maps?q=39.397309,+-74.586521(28701)&iwloc=A&hl=en\"> mufon case (28701) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 8 other sightings in Egg Harbor Township","There were no other sightings in Egg Harbor Township on or around April 14th 2011"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","divs":["sighting detailsmy husband and i witnessed a triangular craft flying aproxamatly 150 feet off the ground. the craft was flying very low and slow and we heard a kind of low humming noise. we've lived here for 12 years and have seen many different kinds of air plains and helicopters. this vehicle was not like anything we have ever seen! we witnessed the craft right around 9:30 pm on thursday, april 14, 2011. the craft was moving very slow, a traditional aircraft would have fallen from the sky traveling that slow. the craft had lights on the triangular points and other lights as well. i can't stress enough how surprised we were to see this craft! i looked out the powder room window, and just across the road i saw this slow flying triangle and immediatly summoned my husband who was as shocked as i was. \"oh my god what is that, what is it, what is it.\" is all he kept saying. please feel free to contact us if you have additional questions. we would also like to know if there were any other reports of sightings in egg harbor township, nj that evening. thanks in advance, *(wit's names deleted--cms\\sg)"],"files":["/var/www/straped/mufon/html2text/28701.html.txt","/var/www/straped/mufon/org/28701.html"],"Country":"United States","Weather Factors":"None","Disposition":"Unknown"}