{"divs":["Sighting Details9:30 PM Monday, April 18th. 2011. Over Archer, Florida. I was standing on my deck having a cigarette and as usual looked up at the stars. Suddenly while looking south west about 40-45 degrees up, I noticed a bright neon blue light appear in the night sky. A moment later it traveled at a high rate of speed straight up until it faded out within 5 seconds. About 5 seconds later another light appeared at the same location this time a white light and appeared smaller in size, it followed the same direction as the previous blue light at the same speed and faded out after about 5-7 seconds just as the blue light did. There is not a single cloud in the sky for a light to disappear into so they must have left visible range out of earths atmosphere or simply turned off whatever was illuminating them. If they were in fact leaving earths atmosphere at that speed, the blue light must have been as large as an acre and the smaller one half an acre. *Note: I was staring at the section of sky for several moments prior to seeing the orbs appear. I'm 100% convinced these were UFO's for the way they suddenly appeared, how fast they traveled and where they traveled too."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.637934,+-82.347058(28703)&iwloc=A&hl=en\"> mufon case (28703) map </A>","Country":"United States","Log Number":"US-04182011-0006","Weather Factors":"Unknown","Date Submitted":"04/18/2011 09:57 UTC","Tags":"City","Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-82.347058","Latitude":"29.637934","Case Number":"28703","Summary":"2 UFO's over Archer, Florida. One Neon Blue the other White. Same location 5-7 seconds visual time.","Region":"Florida","Viewing Distance":"Over 1 Mile, Unknown","City":"Gainesville","files":["/var/www/straped/mufon/html2text/28703.html.txt","/var/www/straped/mufon/org/28703.html"],"Object Flight Path":"Hovering then path","Date of the Event":"04/18/2011 09:30 UTC","Object Shape":"Circle","Source":"MUFON","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around April 18th 2011"]}