{"Case Number":"28712","Longitude":"-84.136782","divs":["sighting detailsi was outside with my friends *(names deleted--cms\\sg), we were playing and then alex went to go eat, a couple minutes later so did **(name deleted--cms\\sg). so we said we would hangout after we eat lunch. when i got back my parents had just gotten in from the pool in our backyard to get a drink. then we all went back to the pool, my dad was floating on a raft type object and told me and my mom to look up, so we did and right above our pool and house was a object in the shape of a circle\\disc type object. the bottom of it had areas flashing a orangeish color (flames or lights) and it floated in the same spot for about 35 secondeds. my dad ran to get his camera but then in the blink of an eye the craft took off towards the heavily wooded area and was gone. the strange thing is that right when it flew off a usaf ac30(or ac130) cargo plane was flying in the oppisate direction of the object and was kinda close to it. then it was gone and the cargo plane just flew by like nothing was ever there. there was no vapor trail from the object either, just a hole in a cloud that it flew through. we saw the object once again that night. still a bright orange color then it was gone after about 11 seconds. havent seen it since"],"files":["/var/www/straped/mufon/html2text/28712.html.txt","/var/www/straped/mufon/org/28712.html"],"trends":["There have been 2 other sightings in Lilburn","There were no other sightings in Lilburn on or around June 20th 2010"],"Object Shape":"Circle, Disc, Oval, Sphere","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path,Path then hovering","Summary":"floated over head then quickly went away","Log Number":"US-04192011-0007","Weather Factors":"Unknown","Object Features":"Unknown","Region":"Georgia","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.891204,+-84.136782(28712)&iwloc=A&hl=en\"> mufon case (28712) map </A>","Disposition":"Hoax","Date of the Event":"06/20/2010 02:36 UTC","Tags":"City","Country":"United States","Sighting Duration":"00:00:35","Latitude":"33.891204","City":"Lilburn","Date Submitted":"04/19/2011 04:39 UTC"}