{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.767943,+-79.01315(28724)&iwloc=A&hl=en\"> mufon case (28724) map </A>","Longitude":"-79.01315","divs":["Sighting DetailsHello, I am male, 43, father of 5 girls. I have started have very disturbing nightmares of an event that took place when I was a kid involving an underwater UFO. First let me give a little back story. I am from Texas and lived on the Sabine River. My Dad moved us out there when I was about 7 or 8. We had no electric or running water the first 4 years. We lived off the river and the land. I would wake up with my Dad early in the morning to go and check trot-lines. A trot-line is a line that has other lines attached to it with hooks and bait. This is to catch more than one fish at a time. I am sorry if you already know this, but so many people ask me what it is. One Saturday we got up about 4:30am or 5:00am to check for fish. We got in the boat like always and started with the first line. We were about halfway when I noticed a light under the boat. It was small about 4 to 6 inches across. My Dad noticed it too, he turn and yelled at me that I dropped the light. I knew I had not messed with the light, so I quickly scrambled around to find it. I found it and turned it on and shined it at my Dad. He was making his way across the boat to whip my tail, but stopped and look over the side at the light again. I am not sure how it happened but the water around the boat lit up so bright it was like daylight. the light was about 15 to 20 feet around the boat. It came close to the boat and stayed still for a few moments and then bam it shot to the water faster than I had ever seen anything move. I watched for a few moments, by this time the day was getting a little lighter and I noticed a wake forming about a mile or so from the boat. It just rose up out of the water without a boat. I thought it was cool but My Dad looked like he was going to be sick. You have to understand something about my Dad, he was afraid of nothing, but he look like my little brother who was scared of the dark. I sat down and my father drove the boat as fast as it would go. When we got near the boat dock I was getting ready to tie the boat off, but Dad just drove the boat right up on the shore, which he forbade us to do because of cypress knee's. HE got up and grabbed the 10 gal gas tank to bring to the house. It was almost funny. I remember thinking it is not that heavy, by now he had both hands on it and I could see the veins popping out in his arms, then it just let go and the tank came up hit him in the face and in the water he went. I just looked him puzzled as he dove past me grabbing my arm as he went. Now he was scaring me, this was so out of the norm for him I had to look a couple of times to make sure it was him. He dragged me to the truck, ran to the house to get the keys and we flew down the dirt road at a pace that almost killed us a few times. We hit the highway and drove the 45 minutes to my Uncle Dales house in about 10 minutes, how he did not get pulled over and thrown in jail I will never know. He jumped out, so I jumped out he turned and told me to get my ass back in the truck we were not staying. My Dad came out with my Uncle Dale who look just as puzzled as I felt. Dad jumped back in our truck and Uncle Dale followed in his truck. My Dad had to stop and wait for Uncle Dale a few times cussing louder each time. We finally get back to the river and Dad and Uncle Dale go over to the boat. My Uncle Dale had been a radioman in the Air Force so I guess my Dad thought he would know something. I had to stand back from the boat because my Dad was beside himself by now, but I saw them throwing something at the boat, so I eased up to see. They were throwing bolts at the boat and the bolts were sticking. They went back to the house to talk so I went over too the boat and started doing the same thing but when I tried to pull the bolts off I couldn't. I heard my Dad coming so I ran back to where I was playing at, so he would not whip me. I saw them take the boat and our other boat out in the river. I watch as they sunk the boat with everything in it including the engine. I was shocked. my Dad later told me if I ever told anyone about this he would beat me till I was dead, and I thought he would. My wife was the first person I ever told and only after he died. I would like to know if this has ever happened to anyone else. And the boat was an aluminum boat, which I learned many years later that aluminum is not magnetic. A lot of other weird stuff happened after that day,"],"Weather Factors":"Unknown","Sighting Duration":"02:00:00","Tags":"City","Latitude":"35.767943","Source":"MUFON","Date of the Event":"02/01/1976 05:00 UTC","Region":"North Carolina","Date Submitted":"04/20/2011 01:30 UTC","Case Number":"28724","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/28724.html.txt","/var/www/straped/mufon/org/28724.html"],"Summary":"USO, CE/mcm","trends":[],"Object Shape":"Unknown","Viewing Distance":"21-100 Feet","Log Number":"-04202011-0007","Disposition":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed"}