{"Longitude":"-97.669376","files":["/var/www/straped/mufon/html2text/28720.html.txt","/var/www/straped/mufon/org/28720.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.511805,+-97.669376(28720)&iwloc=A&hl=en\"> mufon case (28720) map </A>","Country":"United States","Viewing Distance":"Unknown","Summary":"3 white lights seen moving quickly and independently NE/E","Case Number":"28720","Disposition":"Insufficient Data","Region":"Texas","Object Flight Path":"Undisclosed","Latitude":"30.511805","Date of the Event":"04/19/2011 11:49 UTC","trends":["There have been 11 other sightings in Round Rock","There were no other sightings in Round Rock on or around April 19th 2011"],"Object Features":"Undisclosed","Object Shape":"Fireball","Source":"MUFON","Date Submitted":"04/20/2011 02:19 UTC","divs":["sighting detailsi took the dogs outside before they were to be put in their crate for the night. i went to check the front door and garage door locks, then i went out the back door. i heard a plane and saw it flying south, and it made me remember a story i read on a website about a ufo following a plane. upon remembering that, i tried to get a good look at the plane but it was hidden by my neighbor's tree. i kept looking around in the sky because of some feeling i had that i was going to see something. and sure enough, i saw three white lights in the sky in a triangle shape. at first i thought it was another plane flying overhead because of the placement of the lights, but i not only did not see the body of the plane, but the lights moved independently of each other as they quickly moved east\\northeast. the light on the right (southern-most one) veered away from the other two at an angle, and then they zoomed off until my neighbor's house blocked them from my view. this event took maybe 15-20 seconds from the time i noticed the lights until they disappeared behind the house. i'm not saying it was alien-craft, but it just did not look like anything i had seen before. a minute or two later i went back inside and saw that the time on my stove said 11:49pm (central time, and it might have been off by a few minutes). i'm normally anxious at the unknown, but i was pretty excited to see such a site, not scared at all."],"Sighting Duration":"Undisclosed","City":"Round Rock","Tags":"City","Log Number":"US-04202011-0003","Weather Factors":"Unknown"}