{"map":"<A HREF = \"http://maps.google.com/maps?q=51.504286,+-3.576945(28727)&iwloc=A&hl=en\"> mufon case (28727) map </A>","Country":"United Kingdom","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy partner asked me to fetch the washing in off the line just in case it rained through the night and wet the clothes, while pulling the clothes from the line I happened to look up at the beautiful clear night sky. As I SCANNed th stars I noticed a bright star in the distance, being quite keen on looking at the stars, returning to finish pulling the washing off the line I wondered briefly on what it could be, star i've not noticed or planet, I turn back to check again. It is then I notice this bright light is slowly moving, it must be a satellite I thought, but no, I've seen those plebty of times, this was brighter. Maybe the ISS, but I've seen that plenty of times and it's not even going the same direction that the ISS follows. This light was heading roughly NE - ENE in a straight line. In this time that I've been trying to reason with myself, this vehicle is now pretty much on top of me, it is here that I notice 2 smaller rectangular lights behind (relative to direction of travel) the brighter circular light I first noticed, and a jet engine noise a lot quieter than it's height seemed to be, (although I'm no expert in telling the height of planes and jets, I can tell if they're low or high, this object was pretty low!) this instantly made me concentrate on the object deeper. As I concentrate on this object, I start to see a shape form through the black of the sky... It's triangular in shape, I think that this object has to be a jet of some kind, but there are no flashing directional lights that are on conventional aircraft, this really sets my mind spinning, at this point I lose sight of the object over the top of my house. I rush around the side to catch it out front, and I keep visual contact with the object until I lose sight of it over the hills opposite my house. As soon as I lose sight, I get in touch with my friend who lives further up the valley in the direction the craft was heading, he looked out for it but saw nothing. Seeing this object didn't seem to leave me feeling any different, until I recounted the experience with my brother a few days later. When I think about it, it left me quite shaken, purely because the craft I saw was a definate unknown to me!"],"Summary":"Odd triangle fly by.","Object Features":"None","Latitude":"51.504286","Longitude":"-3.576945","Date Submitted":"04/20/2011 05:53 UTC","Disposition":"Unresolved","City":"Bridgend","Region":"Wales","Log Number":"GB-04202011-0010","Source":"MUFON","trends":["There have been no other sightings in Bridgend","This sighting has never been favorited."],"Case Number":"28727","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/28727.html.txt","/var/www/straped/mufon/more/28727_submitter_file1__206328_2020154581919_1185555910_2506864_7469231_n.jpg","/var/www/straped/mufon/org/28727.html"],"Weather Factors":"Unknown","Tags":"City","Object Shape":"Triangle","Date of the Event":"04/12/2011 10:15 UTC"}