{"Sighting Duration":"Undisclosed","Region":"Alaska","Summary":"Several \"moving\" stars, some of which abruptly changed direction and wobble in the sky","Disposition":"IFO","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Case Number":"28738","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/28738.html.txt","/var/www/straped/mufon/org/28738.html"],"Tags":"City","City":"Soldotna","Date Submitted":"04/21/2011 06:42 UTC","Log Number":"US-04212011-0002","map":"<A HREF = \"http://maps.google.com/maps?q=60.497648,+-151.054873(28738)&iwloc=A&hl=en\"> mufon case (28738) map </A>","Date of the Event":"04/21/2011 12:00 UTC","Object Shape":"Star-like","Weather Factors":"None","divs":["Sighting DetailsStarting at midnight, I was looking west from Soldotna, Alaska, when I began witnessing \"moving stars\" which I have seen in the skies since the late 1990's, but truly a handful of the 30+ moving stars I witnessed tonight could not have been stars or satellites. One of these stars was traveling fairly bright and fast, and would visibally \"wobble\" and \"bounce\" off of other stars it would pass. This one one of the brightest objects of the night and only lasted less than a minute. A second group of stars all began moving simuntaneously around 1-1:15am I believe it was, because I had already told my wife why I was outside, when this cluster began moving so I sprinted inside to grab her, but not before watching them for a good 20-30 seconds. These star-like objects were due directly south in the sky, and before I go any further I would like to explain that these star-like objects appeared as just normal stars in the southern sky before they started moving. One started heading vertically straight down, followed by movement which began from a star parallel to it, which began following the first one. Then as these two star-like objects passed vertically by the stars in the sky below them, these stars started moving too!!! As the lead star-like object gathered other stars to follow it, it changed direction at nearly a perfect 45 degree angle in the sky from slightly south to east, and visually you could witness all other stars following this routine. Eventually en entire pack of 5 star-like objects changed 45 degrees from south to east again until they all were heading directly east and horizontal in the sky.....and as mentioned before, I ran to grab my wife, but came out to find them out of view. In the ten minutes my wife was outside with me, we counted three more moving stars before she headed back to bed. As of 2am, of the 20+ \"moving stars\" of which nearly all appeared in the western sky headed south to north, I did note two which appeared from the north to the south before fading out of view. NONE appeared out of the east, but I would note that there are street lights and trees to the east which impedes my view at night of the stars in the sky. At times, I would note that there were almost a blurriness about the sky, and pointed out to my wife that a good majority of the stars in the sky were not flickering or blinking as most normal stars appear to do before the naked eye. This could be for atmospheric or pollution reasons, or who knows. I want to note in here, I could hear dogs barking all over town over these two hours and that is NOT a usual occurence. Also, electrical equipment across the street came on by itself, and from 11pm to midnight, our DVD player would just stop by itself, which it has never done before. So electrical equipment and animals were both effected, as there were dogs to the east and south of our residence barking and I am a night owl and out at around midnight every night to take care of our own animals, and I NEVER hear animals barking from different directions such a far distance apart from each other at midnight for no apparent reason. Would also like to note that the star-like object which was the brightest and wobbled and appeared to bounce of other stars it passed by I keep seeming to forget about why it was so unique. ALSO WOULD NOTE, I have lived in Alaska my entire life, and I have never heard and seen two large flocks of geese fly over at 1:30am! There were two packs of geese about 30-40 strong each, both flying low for geese, and headed directly due west towards the area where most of the moving star-like objects over the two hours were seen. I did attempt to photograph the geese as they flew DIRECTLY over our driveway and our neighbors place, but am not sure yet if they showed up on film. Also attempted to pick up the moving stars on digital camera, but indeed a cheap camera will not pick up stars simply because they are too dim to see at night, but a SONY 8mm videocamera will pick them up because that is how I videotaped them in the past. I will double check my video tonight though and if I do see anything I will attach it to a second posting. Overall, it gave me more chills then usual. I have not seen this many \"moving stars\" in one night for probably years. Especially witnessing the change in path of five stars which were motionless in the sky for quite some time before they all started moving."],"trends":["There have been 5 other sightings in Soldotna","There were no other sightings in Soldotna on or around April 21st 2011"],"Longitude":"-151.054873","Object Features":"None","Latitude":"60.497648"}