{"Country":"United States","files":["/var/www/straped/mufon/html2text/28733.html.txt","/var/www/straped/mufon/org/28733.html"],"Sighting Duration":"Undisclosed","Log Number":"US-04202011-0016","divs":["Sighting DetailsIt was 7pm still daylight and I was watering plants in back yard when I was yelled at by my child and nieghbor kids to check out what's in the sky. The Black triangle object was pointing east like an arrow tip and was slowly movimg eastbound toward Riverside, Ca. It was directly over the intersection of e.Grand blvd. and s. Howard st. It was very high in the sky and was elevating while moving eastbound. the object seemed to be changing shape and color, the black triangle was turning transparent into a Pinkish Orange color for a few seconds and then a white color and then back to Orange and then Black adain. It finaly once again turned into a Pinkish Orange as it elevated higher and then it looked like a white faint star in the distance and then was out of visual site. Object was to far to be picked up by my cheap camera, only a faint dark spot. I phoned friend in Riverside and told them it's heading your way, before I could say more they spotted it immediatly, same black triangle with orangeish color."],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.962069,+-117.389356(28733)&iwloc=A&hl=en\"> mufon case (28733) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Date of the Event":"04/20/2011 07:05 UTC","Viewing Distance":"Unknown","Date Submitted":"04/20/2011 11:31 UTC","Object Shape":"Chevron, Diamond, Square, Rectagular, Triangle","trends":["There have been 38 other sightings in Riverside","There was one other sighting in Riverside on or around April 20th 2011"],"Tags":"City","Longitude":"-117.389356","Object Features":"None","City":"Riverside","Latitude":"33.962069","Disposition":"IFO","Weather Factors":"None","Summary":"black triangle object drifting eastbound in corona, ca. changing colors to pinkish orangr to white 7pm day","Source":"MUFON","Case Number":"28733"}