{"trends":["There have been 7 other sightings in Waterloo","There were no other sightings in Waterloo on or around April 20th 2011"],"Viewing Distance":"Unknown","Weather Factors":"None","Tags":"City","Case Number":"28732","Object Shape":"Sphere, Star-like","Date of the Event":"04/20/2011 09:12 UTC","divs":["Sighting DetailsMy husband and I just returned home from choir practice. We got out of the vehicle and began unloading instruments, etc. As I grabbed some items, he said, \"Honey, is that a plane?\" I turned around and looked up. The sky was mostly clear with some patches of clouds. He pointed to a large blue light that looked like an oversized star. It was moving slowly across the sky heading northeast. At first I thought it could be a plane. Then we saw a plane with the typical blinking lights flying below the object and heading west. There was another plane to the south. Both planes had small blinking lights like you would typically see with planes at night and you could faintly hear them while they were near. This star-shaped object was solid and much bigger than the surrounding stars. My husband said, \"It's going into that cloud.\" He said it looked like it did a quick fishtail before passing into the cloud. It seemed to flicker and disappear before passing into it. He didn't know how else to explain it. I had looked away at one of the other planes to see if we were really seeing another plane or something else. Then the blue light reappeared after passing through the cloud. It was getting smaller the further away it flew. It never blinked. It was solid. It never made a sound."],"Disposition":"Unknown","Sighting Duration":"00:07:00","map":"<A HREF = \"http://maps.google.com/maps?q=42.500964,+-92.337383(28732)&iwloc=A&hl=en\"> mufon case (28732) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/28732.html.txt","/var/www/straped/mufon/org/28732.html"],"Longitude":"-92.337383","Object Flight Path":"Straight-line path","Summary":"Large blue star shape with no sound","Object Features":"Unknown","Region":"Iowa","Latitude":"42.500964","Date Submitted":"04/20/2011 11:01 UTC","Log Number":"US-04202011-0015","Source":"MUFON","City":"Waterloo"}