{"Longitude":"-86.354016","Weather Factors":"None","Tags":"City","Summary":"Daugter woke me because she saw something coming our way","files":["/var/www/straped/mufon/html2text/28743.html.txt","/var/www/straped/mufon/org/28743.html"],"City":"Logansport","Disposition":"Unknown","Country":"United States","Date Submitted":"04/21/2011 05:02 UTC","Region":"Indiana","divs":["sighting detailsmy daughter who was 14 at the time, came in the house and woke me up hurry\" mom ! mom ! wake up there is something in the sky! i get up real fast and run out off my porch and look to where she was pointing which was coming from behind my house. it was lit up as it came directly over my house coming from the north heading southeast. this thing was a big triangle it was clear as day i could see that it was dark in color\\black no markings underneath \"it was close enough that if it was a marked aircraft with numbers or anything \" i would have seen it it was that close,it sounded like a vacuum air like weird noise that i cannot describe because it sounds like nothing i have heard before. trying to reference the height above my house im guessing it was about 500 feet or so approximately , it was the size of the top of my neighbors house in size comparison. at the time i had just moved into this house and did not have internet access so i just added it to my journal.. and went on all this time not really worrying about reporting it.. but this was a very significant sighting for me.."],"trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around September 18th 2008"],"Date of the Event":"09/18/2008 10:30 UTC","Case Number":"28743","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.756834,+-86.354016(28743)&iwloc=A&hl=en\"> mufon case (28743) map </A>","Latitude":"40.756834","Log Number":"US-04212011-0007","Source":"MUFON"}