{"Weather Factors":"Unknown","Log Number":"US-04222011-0002","Summary":"Silver disc flew over Rt17 from west to east then curved north flying quickly out of sight.","Object Flight Path":"Undisclosed","Object Shape":"Cigar, Disc","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.569146,+-111.850688(28751)&iwloc=A&hl=en\"> mufon case (28751) map </A>","Disposition":"Unknown","Case Number":"28751","Region":"Arizona","Viewing Distance":"Unknown","Country":"United States","Date Submitted":"04/22/2011 12:49 UTC","divs":["sighting detailswe were driving from scottsdale to sedona on the morning of tuesday, april 29th, 2011. i was driving, my husband was in the passenger seat, 2 kids in the backseat. it was a clear, sunny morning. as we approached and passed the camp verde exit on route 17n a small, silver disk\\cigar shaped object entered my field of vision traveling from left (west) to right (east). i immediately noticed it and casually (and jokingly) said to my husband \"look, a ufo\". he looked up from his cell phone and saw it too. we watched it travel extremely quickly and smoothly over the highway and then curve north. it paralleled the highway and flew north. it went from maybe a mile in front of us, which is hard to estimate, to out of site in a matter of a few seconds. we estimate the total distance it flew north was about 10 miles. it was hard to estimate the immediate position because we couldn't quickly figure out what it was, there were no wings, no tail fin, no contrail, nothing. it was moving extremely fast and smooth and was gone to a pinpoint then out of sight in a few seconds. my husband now says \"oh, it must've been a jet\" we saw many planes in sedona later that day; biplanes, small jets, helicopters and they were all easily identifiable and moved so much slower than the object. i'm reporting this because it was so unusual, 2 of us saw it, and maybe someone else saw something too."],"Date of the Event":"04/19/2011 12:00 UTC","Object Features":"Undisclosed","Longitude":"-111.850688","City":"Camp Verde","files":["/var/www/straped/mufon/html2text/28751.html.txt","/var/www/straped/mufon/org/28751.html"],"Source":"MUFON","Latitude":"34.569146","trends":["There have been 2 other sightings in Camp Verde","There were no other sightings in Camp Verde on or around April 19th 2011"],"Tags":"City"}