{"files":["/var/www/straped/mufon/html2text/28757.html.txt","/var/www/straped/mufon/org/28757.html"],"Sighting Duration":"Undisclosed","Tags":"City","Region":"Indiana","Source":"MUFON","Latitude":"39.773776","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around April 19th 2011"],"Date of the Event":"04/19/2011 09:14 UTC","divs":["Sighting DetailsTUESDAY, APRIL 19TH, 2011-WALKING OUT OF \"THE KEYSTONE AT THE CROSSING\" SHOPPING MALL- I GOT INTO MY CAR AND LOOKED AT THE TIME, IT WAS 9:13PM. DRIVING OUT OF THE MALL PARKING LOT ONTO 86TH ST.I TOOK THE FIRST RIGHT (NORTH) ONTO KEYSTONE AVE. TOWARDS THE 465 WEST ENTRANCE RAMP. BEFORE REACHING THE 465 RAMP I NOTICED TWO VERY BRIGHT LIGHTS~MOVING NORTH ON KEYSTONE~BEFORE CROSSING OVER THE 465 INTERSTATE. THE LIGHTS WERE BRIGHTER THAN ANY AIRCRAFT I HAVE SEEN-AND BRIGHTER THAN THE NEARBY CONSTRUCTION LIGHTS. THE OBJECT MOVED VERY SLOW- I FOLLOWED IT UP KEYSTONE-PASS THE 465 RAMP AND CONTINUED FOR 2-3 BLOCKS. DUE TO CONSTRUCTION AND TRAFFIC CONGESTION, I NOTED THAT I WAS TRAVELING BETWEEN 30 AND 32 MILES PER HOUR. I DID NOT GAIN OR LOSE DISTANCE BETWEEN THE OBJECT AND MY CAR AS WE MOVED NORTH. TWO BLOCKS AFTER THE 465 OVERPASS, THE OBJECT STOPPED. THE DISTANCE BETWEEN THE OBJECT AND MY CAR BECAME CLOSER AS I CONTINUED TO MOVE FORWARD- STOPPED FOR ONLY A FEW SECONDS, I DID NOT SEE THE OBJECT TURN AROUND, BUT IT REVERSED DIRECTIONS AND BEGAN RETAKING THE PATH IT HAD JUST TRAVELED, BUT NOW IT WAS TRAVELING SOUTH, TOWARDS ME. AS IT APPROACHED AND EVENTUALLY PASSED ABOVE ME, I NOTED TWO LARGE AND VERY BRIGHT LIGHTS-THEY WERE SEPERATE FROM EACH OTHER-AND LOOKED LIKE HEADLIGHTS ON A CAR. I THOUGHT IT WAS SOME SORT OF SLOW MOVING AIRCRAFT, BUT AS THE UNDER-SIDE PASSED BY (ON MY RIGHT HAND SIDE), I THOUGHT \"WHY DOES THAT REMIND ME OF THE UNDERSIDE OF A PUSH LAWN MOWER?\". I WAS REFERING TO THE SHAPE, IT WAS RECTAGULAR! THE OBJECT WAS SMALLER THAN EXPECTED, IT WAS NOT A MASSIVE AIRLINER SIZE. IT WAS TRAVELING LOW ENOUGH TO THE STREET TO CATCH MY ATTENTION, YET LOGICALLY IT HAD TO BE HIGH ENOUGH TO PASS ABOVE TELEPHONE LINES, TREES ETC. I ROLLED DOWN MY WINDOW AND DID NOT HEAR ANY LOUD NOISE AS IT PASSED OVERHEAD. I CONTINUED ONE BLOCK(NORTH)BEFORE BEING ABLE TO TURN AROUND AND HEAD SOUTH. I THEN WATCHED THE OBJECT PASS BACK OVER 465 (MOVING SOUTH SLOWLY)IT MOVED AWAY FROM MY VIEW."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.773776,+-86.151464(28757)&iwloc=A&hl=en\"> mufon case (28757) map </A>","City":"Indianapolis","Case Number":"28757","Weather Factors":"Unknown","Object Shape":"Square, Rectagular","Disposition":"Unknown","Date Submitted":"04/22/2011 02:29 UTC","Log Number":"US-04222011-0008","Summary":"TRAVELING NORTH ON KEYSTONE AVE (96TH ST.)-INDIANAPOLIS/ CARMEL, I SAW AN OBJECT TRAVELING SLOWLY.","Longitude":"-86.151464","Viewing Distance":"101-500 Feet","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Patterned Surface"}