{"Source":"MUFON","Log Number":"US-04222011-0009","Date of the Event":"04/22/2011 12:00 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Summary":"UFO hovering","Region":"Maine","Latitude":"44.111461","City":"Auburn/Lewiston","divs":["Sighting DetailsI took my dog out for some business about 12:10 this morning. I went out on my stoop and I always look at the sky. Having moved here a little over a year ago, I enjoyed the night sky because it had so many more stars than where I lived before. I noticed what appeared to be a plane above and to my right. It had a couple of lights on, flashing but not going on and off. They seemed to twinkle more than flash. I assumed it was a plane and continued to watch the dog as she sniffed around. After a few seconds, I looked up again and there was one steady light. I thought I must have been mistaken about the additional lights and thought maybe it was a star. Then they came on again. It wasn't moving but it was hovering, and I realized after a minute or two that this was something unusual. The lights flickered, and then it started moving extremely slowly toward me, with no sound at all. That freaked me out a little and I went inside. I looked out the window of the door, and I saw it moving side to side, slowly. Then it stopped and continuted to flicker. At first I thought it looked like it was a boomerang shape. But it could have been a disc. It definitely had an angle to it. It reminded me of a wedding band that had diamonds all around it. Like I said, they were white and flickered, sometimes all of them, sometimes a couple and sometimes just one. It was hovering out towards Lewiston, ME and it was about the height and size of a plane. I watched for about 15 minutes, but because of it moving toward me, I decided to stop watching. It definitely gave me an eerie feeling. I've seen UFOs in the past (many years ago) and they didn't evoke that feeling in me. This just seemed different, maybe because I was by myself and it was so dark out. I watched the news hoping to hear of other reports, but so far there haven't been any. I thought I should mention it to someone. Thanks."],"Object Shape":"Boomerang, Disc","Date Submitted":"04/22/2011 02:44 UTC","Sighting Duration":"Undisclosed","Case Number":"28758","trends":["there have been no other sightings in auburn\\lewiston","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/28758.html.txt","/var/www/straped/mufon/org/28758.html"],"Country":"United States","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=44.111461,+-70.255658(28758)&iwloc=A&hl=en\"> mufon case (28758) map </A>","Longitude":"-70.255658"}