{"Case Number":"28752","Object Shape":"Circle, Fireball","divs":["Sighting DetailsMy husband and I were sitting in the hot tub facing North, at the Seventh Mountain Resort near Bend Oregon looking up at the stars. We noticed a bright amber colored light to the west traveling east across the night sky. There were no flashing lights, and it was very bright much brighter than any stars or satellites. Its path was straight across the sky moving east, and it held its course. The movement of the object seemed similar to a satellite, but it was dozens of times brighter and larger than any satellite we have ever seen. It was completely silent, no noise as it but across the sky opposed to planes and helicopters we had noticed earlier. We definitely felt as though we were experiencing something paranormal and unidentified. It was actually exciting because we were looking at something we had never seen before and was truly unidentified from the moment we saw it. We continued to watch the object until it finally disappeared from our line of vision behind a resort building. Walked home and jumped on the internet to report the sighting."],"Tags":"City","files":["/var/www/straped/mufon/html2text/28752.html.txt","/var/www/straped/mufon/org/28752.html"],"Object Flight Path":"Undisclosed","Source":"MUFON","Region":"Oregon","Date Submitted":"04/22/2011 12:52 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.061483,+-121.30771(28752)&iwloc=A&hl=en\"> mufon case (28752) map </A>","Log Number":"US-04222011-0003","Summary":"Bright amber colored round light holding course and traveling west to east in the sky","Date of the Event":"04/21/2011 09:10 UTC","Viewing Distance":"Unknown","trends":["There have been 20 other sightings in Bend","There were no other sightings in Bend on or around April 21st 2011"],"Longitude":"-121.30771","Latitude":"44.061483","Disposition":"IFO","City":"Bend","Country":"United States","Object Features":"Undisclosed"}