{"Weather Factors":"None","Latitude":"34.39155","trends":["There have been 5 other sightings in Carpinteria","There were no other sightings in Carpinteria on or around April 20th 2011","This sighting has never been favorited.",""],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/28764.html.txt","/var/www/straped/mufon/more/28764_submitter_file1__122.JPG","/var/www/straped/mufon/org/28764.html"],"Sighting Duration":"Undisclosed","City":"Carpinteria","Disposition":"IFO","Longitude":"-119.519026","Object Features":"None","Summary":"round, bright orange, flickering, constant light, moved slowly, but steady, then dissapeared","Case Number":"28764","Date Submitted":"04/22/2011 09:09 UTC","Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Fireball","divs":["Sighting Detailswhile on vacation in california, my girlfriend and myself witnessed a large orange orb shaped object in the night sky. The object traveled west along the coastline above carpinteria state beach and moved relatively slow and steady. We watched this for about five minutes and while watching the object turned out over the ocean and just dissapeared. We dont know what this was but we both saw it and wondered if anyone else witnessed anything similiar. The object was as clear as day and there was a lot of commercial airline traffic visible as well as stars in the night sky, so it didn't dissapear into a fog bank. We could only capture one photo since our camera was in our tent and we were ready to go to sleep. I also tried to email one of your members that night from the los angeles chapter , I used my phone to search for your site and found him, can't remember his name."],"Tags":"City","Region":"California","Log Number":"US-04222011-0015","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.39155,+-119.519026(28764)&iwloc=A&hl=en\"> mufon case (28764) map </A>","Date of the Event":"04/20/2011 09:45 UTC"}