{"Date of the Event":"11/30/1996 02:45 UTC","Case Number":"28765","Weather Factors":"Unknown","Object Shape":"Fireball","Tags":"City","files":["/var/www/straped/mufon/html2text/28765.html.txt","/var/www/straped/mufon/org/28765.html"],"Longitude":"-115.169766","divs":["Sighting Details2-45 AM watching t.v.top floor of my apartment building. Object in distance bright light come straight ahead.no real shape just mass. Every couple of minutes it dripped something that looked liked molten steel in a steel factory. Lasting 30 seconds maybe. 25 -40 miles away after 20 to 30 minutes it made a 90 degree right turn. It went out of sight behind the Treasure Island Hotel. It was like I said 25to 40 miles out of town. Coming from northwest. The next night at the same time 2-45 a.m it came from due north. It did the same thing,only it only lasted 5to 7 minutes. Then it turn left heading east 90 degree turn. Shortly after turning it disappeared. I called George Knapp Mr U.F.O. in Las Vegas after the first day,just to tell him I was one of what I thought would be hundreds of what I saw. He said no one had called him? I didn't call back after seeing it the second night. It never made the news. So that was that,then many years later I saw the story of Bentwaters A.F.B.in England. Well what they saw was what I saw.The dripping is what I mean. Not the landing an all of that.This was being controlled by something.It wasn't a metetor,they don't last20to30 minutes an make 90 degree turns.George Knapp I am sure you know.He is on channel 8 in Vegas,for many years now.If you call him I was able to contact him right away because Eric Green a friend was a camera o prater at th e stationan helped reach George. Maybe George remembers? The Venation Hotel was being built,I can only guess as to what year it was. Ilived there sept 94 till july 98 it was after jan95 when my mother died. The Venation was probably a year or a little more from being opened. That's a guess ,but a pretty good I hope.Ilived on the fourth floor top floor facing the strip At the Meridan Apts.Flamingo an Koval streets.I felt bad I didn't own a camcorder,if you saw it it would have gone all over the news. I was lying on my couch watching t.v. an looking out the balcony glass door when I saw it."],"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"04/22/2011 09:15 UTC","Viewing Distance":"Unknown","Latitude":"36.124266","Source":"MUFON","Disposition":"Insufficient Data","City":"Las Vegas","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around November 30th 1996"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.124266,+-115.169766(28765)&iwloc=A&hl=en\"> mufon case (28765) map </A>","Country":"United States","Log Number":"US-04222011-0016","Summary":"I saw bright light 20 minutes 25-40 miles away dripping like molten sparks evry couple of minutes made 90 degree turn","Region":"Nevada"}