{"files":["/var/www/straped/mufon/html2text/2876.html.txt","/var/www/straped/mufon/org/2876.html"],"Date Submitted":"02/15/2003 02:00 UTC","Region":"North Carolina","Case Number":"2876","Object Shape":"Other","Tags":"City","Log Number":"","Object Flight Path":"Stationary","Longitude":"-80.838837","Country":"United States","Summary":"two bright lights in close proximity to one anothe","Date of the Event":"02/15/2003 02:00 UTC","Source":"MUFON","City":"Charlotte","Sighting Duration":"00:30:00","Object Features":"Undisclosed","Weather Factors":"Rain, Sleet","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=35.233117,+-80.838837(2876)&iwloc=A&hl=en\"> mufon case (2876) map </A>","Disposition":"IFO","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around February 15th 2003"],"divs":["Sighting DetailsWe arrived home girlfriend and I after a V-Day party. Before bed, I decided tolook out of the window of her apartment overlooking parking lot in an urban areaof Charlotte, NC. Having stayed there numerous times, I was familiar with whereutility poles and lamps were located. I instantly was surprised to see twointense white lights at what I would estimate to be no more than 100 feet in theair. Being familiar with high-intensity lights that are used by constructioncrews late at night particularly road crews, I would estimate their intensity tobe almost that strong. They were stationary and there was no noise. I thusassumed that I had missed a tall, unusually intense lamp in the parking lot thatis next door to her apartm. building. The next morning, I looked out the windowbecause I hadnt forgotten about the lights. There was no such pole it wouldhave been a strange one, given the height and intensity of the lights. Therewere trees directly under the lights, anyway. Now, I couldnt make out any sortof craft, so much of the above may in fact be inapplicable to this. I merelysaw two quasi-connected, very bright, white lights in the sky. Because of thebad winter weather, I couldnt have made out any surface details, even if therewere any. Reactions and emotions I guess I was curiousthe only bit of fear that was there has to do with old Unsolved Mysteriesepisodes and the like, that I would remember from childhood. Thanks"],"Latitude":"35.233117"}