{"map":"<A HREF = \"http://maps.google.com/maps?q=29.429862,+-98.487978(28760)&iwloc=A&hl=en\"> mufon case (28760) map </A>","Date Submitted":"04/22/2011 05:21 UTC","Object Features":"Undisclosed","Source":"MUFON","Object Flight Path":"Undisclosed","Latitude":"29.429862","Region":"Texas","Tags":"City","Case Number":"28760","City":"San Antonio","Longitude":"-98.487978","Weather Factors":"Unknown","Date of the Event":"06/19/2006 07:19 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"It stayed still and did not budge , then acended into clouds","divs":["sighting detailswell, i saw this ufo on 6-19-2006 at 7: 19 am on my everyday courier route, which is from san antonio to austin. i show up at 7:00 am to pick up the delivery to austin and on the way i had a post office deliver on perrin beital off of 410 , besides the major route to austin. there is a valero gas station where i gas up for the day and after i was leaving the store is when i saw this ufo, in the air not moving. it was directly over the 410 highway or robert tobin park about 600 to 1000 ft in the air and it was during rush hour. i sat there in my truck in disbelief looking at this ufo for about five minute and i felt this ufo was like looking at me so i took a right to the post office to see if it would follow me. as i was driving down the street i'd look back to see if it was following me but it was not moving, as i got to the post office i'd try see if it was still there and could not see it no more, so i look for it higher in the sky and found it ascending in to the clouds about as fast or faster then a helium balloon and it was gone. i believe this was some type of man made device unless it was trying to look like a helicopter because of the rotor tail with no blade propeller, it had all these different rods or sticks all over the ship and four dark windows and the body color was red in the middle and white on the top and bottom. oh yea one other thing, the next day i told that old lady at the cash register from the gas station about the incident and she kind of look at me strangely and i payed my gas and went to work. the very next day i went to fill my truck, i open the door at the store and heard her say,\" there he is right on time\" and i look around to see who she was talking too, could not find anybody until i look in back where all the beverages in the cooler where, there where two men in trench coats looking at me and i was looking back at them for brief moment, payed my gas went to work. needless to say i never went back to that gas station. *(wit's first name dleted--cms\\sg)."],"Log Number":"US-04222011-0011","files":["/var/www/straped/mufon/html2text/28760.html.txt","/var/www/straped/mufon/more/28760_submitter_file1__6-19-2006Ufo.png","/var/www/straped/mufon/org/28760.html"],"Country":"United States","Viewing Distance":"Unknown","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around June 19th 2006","This sighting has never been favorited.",""],"Object Shape":"Star-like"}