{"Log Number":"EE-04222011-0020","Longitude":"24.761797","Region":"","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"59.44477","Case Number":"28769","Source":"MUFON","trends":["There have been 8 other sightings in Tallinn","There were no other sightings in Tallinn on or around April 23rd 2011","This sighting has never been favorited.",""],"divs":["sighting detailsvideo: *(link moved to additional evidence section--cm\\sg). me and my friend were looking at the stars on our window, it was past midnight already i think. we thought that maybe we would see some ufo's tonight since the sky is very clear etc. we regularly check the skies for ufo's. we're weird like that. we were just gazing at the stars and then my friend pointed at a light in the distance that seemed to move closer to us. although we were hoping it was a ufo, we initially went for the logical conclusion as every rational human should do and told ourselves that it's just an airplane. we wanted to make sure before we started calling it a ufo. the light stopped and seemed stationary for a while, hovering behind some trees and at that moment, another light moved in from another direction, towards that light. but that new one faded away after half a minute or so. the first light started moving again. so a double sighting quickly changed into a single sighting. the second light never came back after slowly dimming its lights. the light kept moving closer to us and once we realized that there was no sound and that the light didn't blink or anything, i quickly ran into my room, grabbed my videocamera, ran back to the window and started filming it. i zoomed in as much as i could, focused it as well as i could (i wish i had a tripod. ok scratch that - i wish i had a 500mm f1.4 lens with canon 5d mk2 or smth and a tripod) and we were looking at a solid, flying object with 4 distinguishable lights. 3 bigger bright white lights and 1 small low red light. the lights were always stationary, as if one with the craft. we couldn't make out the shape of this thing. you will have to watch the video yourself and figure it out. would be cool if someone could. as we watched the object move through the sky (north-east direction), we noticed it was doing this peculiar red blinking thing with the lights, or it seemed as if the lights were shimmering or something, with a pace. it kept moving north-east and then suddenly it changed position or shape (i got the feeling like it had tilted itself) and there was only 2 bright white lights running diagonally and the little red light in the middle. at that moment the object was pretty close and since there was still no sound and the shape was clearly too weird for an airplane, my friend shouted: \"that's a ufo, that's definitely a ufo!\" at that time, one of the white lights on the ufo started to blink, but with a weird pace, not like airplanes. the blinking pace was out of rhythm. then my friend said that we should go to the other room, since the ufo was getting out of sight pretty quickly now and the best place to observe it would be from another window. we did that and only got a small glimpse of it from the other side of the house before it flew away into the distance, probably pretending to be an airplane and vanished out of sight behind some trees. we didn't feel anything weird before, during or after the sighting. we just got a little bit excited when observing and filming this thing, but that's all natural."],"Disposition":"Unresolved","Object Shape":"Unknown","Summary":"Airplane imitating UFO on Easter in Estonia","Tags":"City","Country":"Estonia","Viewing Distance":"Unknown","City":"Tallinn","Weather Factors":"Unknown","Date Submitted":"04/22/2011 11:00 UTC","Date of the Event":"04/23/2011 12:00 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=59.44477,+24.761797(28769)&iwloc=A&hl=en\"> mufon case (28769) map </A>","files":["/var/www/straped/mufon/html2text/28769.html.txt","/var/www/straped/mufon/org/28769.html"]}