{"map":"<A HREF = \"http://maps.google.com/maps?q=33.998014,+-118.465808(28775)&iwloc=A&hl=en\"> mufon case (28775) map </A>","Source":"MUFON","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around August 1st 1985"],"City":"Los Angeles","Date Submitted":"04/23/2011 12:07 UTC","Disposition":"Unknown","Longitude":"-118.465808","Summary":"craft hovering in a circular motion, light beaming downward, flying away","Region":"California","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-04232011-0001","Sighting Duration":"Undisclosed","Latitude":"33.998014","files":["/var/www/straped/mufon/html2text/28775.html.txt","/var/www/straped/mufon/org/28775.html"],"Case Number":"28775","Tags":"City","divs":["Sighting DetailsI was outside of my house, sitting on the side wall of my staircase. I heard a humming noice, low pitched, vibrating in deep frequency. I looked up and saw an oval disc the size of a football field, metallic sage greenish-gray, with 3 beams of light descending downward onto my neighbors apartment building. I knew immediately it was an UFO because this was not my first sighting. It was a coastal foggy, cloudy night. The craft hovered across street from my home for approximately 1 minute. Then the craft rotated very slowly in a circular motion, as the 3 beams of light jetted down. Then the craft moved in a sliding motion side ways, and speeded off (less than a second in time) upward, out of sight. I called the Santa Monica Airport and LAX to ask if someone saw what I saw. I called information and received a number and made a report. I was sent a form and was shocked to discover the questions as I knew someone or group had to have seen a similar sighting in order to ask and set up the questionaire as it was written. At first I was stunned, then afraid, then driven to tell my sighting to someone who would believe me."],"Viewing Distance":"101-500 Feet","Date of the Event":"08/01/1985 10:30 UTC","Object Shape":"Oval","Object Features":"Other"}