{"Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28777.html.txt","/var/www/straped/mufon/org/28777.html"],"Object Features":"Window(s)","Longitude":"-80.698066","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Source":"MUFON","Date of the Event":"12/04/1974 07:28 UTC","Case Number":"28777","Date Submitted":"04/23/2011 12:34 UTC","Log Number":"US-04232011-0003","Region":"Ohio","Object Shape":"Square, Rectagular","Latitude":"41.159026","trends":["There have been 6 other sightings in Girard","There were no other sightings in Girard on or around December 4th 1974"],"Tags":"City","divs":["Sighting DetailsI believe it was just before christmas. It would have been in the mid 1970's. I was born in 1966, this happened when I was around 8-10 yrs old. My brother in law was driving his wife (my sister who was 20 when I was born) and myself to Sharon Pa. We were headed to a department store to go shopping. I was in the back seat looking out the right side window and saw some lights and a craft just over the trees about 2 tenths of a mile away. (At that age I had no idea about acceptable flight heights of crafts to really know that it shouldnt have been permitted to fly that low.) I didnt want to be laughed at by saying look a ufo, but as it got a little closer it was obious it wasnt a plane. I said LOOK A UFO!!! At first they chuckled and said yea uhuh, 10 seconds later they were agreeing with me! The entire sighting didnt last over 3 minutes. I have watched ufo shows for a long time and have never heard my craft explained, nor do I think your choices on this page covers it either, thats why I checked other. The craft was shaped like a pool table, it was about 40 feet long by 20 feet wide it was 10 feet high. Had 6 lights on the bottom, where the pockets would be on a pool table. The craft was black, metal looking, it flew long ways, it had a window in the side of the craft that went top to bottom. There was a control panel visible but no one was seen in the window. The craft flew across the highway just in front of our car and stopped over a trailer park that was right beside the highway. It tilted down over a trsiler and the bottom was 10 to 15 feet from the top of the trailer. I remember that it was just getting dark and there were many headlights coming west and anybody driving would have seen it but as I recall nobody pulled over or stopped, neither did we! I couldnt believe my brother in law kept driving!! But he did. I watched it from the right side, to flying in front of us and watching out the back window as we kept driving. I saw all sides of the craft. I am guessing on the year, I was a child, but I do know it was in the mid 70's. Has anyone ever described a craft such as this? Or reported on this same encounter? My sister has since passed away. When I was in my early 20's I stopped to see my brother in law to ask him about that night. All he remembered was lights in the sky. I was greatly dissapointed, I had hoped he would have recalled some of the details. I am not a good artist but I would be happy to describe it to an artist and share it with your agency. The movements of the craft was in a straight line just as an airplane would fly, there was no up down just a straight flight path to the top of the trailer. Our viewing ended as we continued driving the craft was still above the trailer as we left the viewing range. when I was older I drove down that road again to see what I remembered, and sure enough, there was still a trailer park right next to the highway. If you may recall, there was a famous ufo encounter back in 2007 I believe in Girard Ohio when A policeman had a sighting and chased a craft till his car died. Mt sighting was on the outskirts of that town, roughly 5 air miles from his sighting."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.159026,+-80.698066(28777)&iwloc=A&hl=en\"> mufon case (28777) map </A>","Summary":"A pool table shaped craft flew just above the tree tops in front of our car.","City":"Girard","Object Flight Path":"Path then hovering"}