{"Case Number":"28778","Source":"MUFON","City":"Turbeville","map":"<A HREF = \"http://maps.google.com/maps?q=33.890716,+-80.018406(28778)&iwloc=A&hl=en\"> mufon case (28778) map </A>","Longitude":"-80.018406","Latitude":"33.890716","Country":"United States","Sighting Duration":"00:10:00","Log Number":"US-04232011-0004","Disposition":"Unknown","divs":["Sighting DetailsI was a very avid coon hunter during my teenage years. My friends and I went with an older man and his buddy who could holler real loud to get us out the woods when we went to a tree to get the coon. The older man owned a couple of real good coon dogs that we hunted with. Buck and Sally were the dogs names. We always hunted at night. The older men, Mr. Maxie and Bobby have been deceased for years now. This experience happened in the Winter of 1964 or 1965. I was 16 or 17 years old. Two of us went with Mr. Maxie and Bobby that night. The other guy lives around 25 miles from me now. We went to a place we called the blowup a few miles from Turbeville off Hwy. 378. We drove around behind a house to the edge of the woods where we stopped and built a fire for Mr. Maxie and Bobby to stay warm and let the dogs out to hunt. We usually went hunting around 7:00 pm or a little later. After a while we heard the dogs on a trail and listened to them for a little while. Mr. Maxie told us to go on in the woods and the dogs would be treed by the time we got to them. The two of us got our flashlights and the rifle and left out to go to the dogs. These dogs were very good and there was always something in the tree or had been in the tree if they treed. Most of the time, it was a coon, but ocassionly they would tree a possum or a wildcat. The blowup was were a dam used to be that had been blown up with dynamite sometime in the past. We made our way through the woods down what I call some old cow trails to the blowup. The water was not very high and we crossed the blowup to the other side. The dogs were still trailing at this time. We made our way on through the woods following the dogs barking. We finally came out the woods on the other side to an open field with a line of trees going out to our left and the woods extending on out to our right where the dogs had treed. We followed this line of trees to our left for maybe two or three hundred yards. The dogs were over to our right. We were still on a trail. We started to cross over to where the dogs were treed when they just quit barking. We were puzzled as to why this had happened because it rarely happened with these dogs. We were standing there beside this line of trees to our left when I spotted some discs over the field on the other side of this line of trees. We walked closer to the tree line and looked up at the discs flying around up there at incredible speeds making impossible manuvers that aircraft today cannot think about doing. The discs were well lite up with white light as best as I can remember. They were a few hundred yards out over the field and probably around 300 to 500 feet up in the air. As best as I can remember, they were a little bigger than a big car in a disc shape. We were dumbfounded at this sight. We really didn't know how to react or what to do since we knew we were observing flying saucers. As best as I can remember we watched them for around five or ten minutes and decided about the same time we needed to get out of there. I had the feeling they knew we were there. I remember leaving to get back to the fire and things are very fuzzy after that. This was not a huge woods to get lost in and we were very experienced at going in the woods at night and coming back out. We were probably only 20 or 30 minutes walk from the starting point at the fire. For some unknown reason we could not get out of those woods and find our way back to the the fire for three or four hours. I don't remember hearing Bobby holler or the car horn blowing during this time. We were confused and could not get out the woods. This is mostly lost time to both of us trying to get out the woods. We finally got back to the fire. Mr. Maxie and Bobby said they were about ready to go get a search party to come find us if we hadn't come out when we did. We kept this experience to ourselves for years because we were afraid they might put us in the State Hospital for crazy people if we told anybody. I don't know about my friend, but I have never had any dreams or thoughts about being abducted and I don't think we were. It just seems something confused us and we were not able to find our way out the woods for those hours. This is my only encounter with UFOs in my life. One thing that is different from many other sightings I have seen in programs on TV is that they did something to our minds to confuse us for a few hours. I know they are real and people will still look at me funny when I tell them this story. It happened and they are real."],"Object Features":"Unknown","Summary":"Three to five brightly lite up discs flying around each other over a field as if playing a game or just having fun flying.","Date Submitted":"04/23/2011 01:34 UTC","trends":["There have been no other sightings in Turbeville","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/28778.html.txt","/var/www/straped/mufon/org/28778.html"],"Object Shape":"Disc","Weather Factors":"None","Object Flight Path":"Path with directional change","Date of the Event":"02/20/1964 09:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"South Carolina"}