{"trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around June 20th 1993"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.778746,+-78.633144(28774)&iwloc=A&hl=en\"> mufon case (28774) map </A>","Case Number":"28774","Object Features":"Unknown","Longitude":"-78.633144","Object Shape":"Star-like","Date Submitted":"04/22/2011 11:59 UTC","City":"Raleigh","Log Number":"US-04222011-0025","Disposition":"IFO","Object Flight Path":"Straight-line path","Tags":"City","Summary":"Gold Ball flashing and military apaches","Latitude":"35.778746","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was around 11 years old and I was getting ready to leave my friends house to walk home. It was about to be dark this was around summer so around 8:30 pm. I rember out of the corner of my eye I saw something coming that appeared at first to be a shooting star, but when I looked it was bright gold color almost looking like a gold stud earing, and it was lower than the clouds and coming fast. I rember it was fully lit and then all the sudden it started going dark and then back on like cutting its self off and back on and it was traveling really fast like it was running from something. It never made a sound either it was quiet but fast and I remember thinking it should be loud like a jet or something but no sound, and I remember it lifted up a little in the sky and hit a real speed boost and then went off and I couldnt see it nomore, and it was about not even a minute after that three apache helecopters in what I know now in a fighting formation appeared where i first saw the gold ball appear. They were just above the trees and had real bright lights shining down on the ground as if they were searching for something, and I remember they keep going around the same area and finally they went dark but I could still hear them, and I remember getting scared and running home. I told my mom but of course I was a kid at the time and she thinks I am making it up. I remember about maybe 4 years later I watched this movie I cant remember the name of it but it was based on a true story, and thats when it dawned on me everything that happened the way i seen it was what happened in this movie, it was wear a UFO apperad over this house abuducted this person, and the military picked up on it and try to get to it, and the whole apache helicopters showed up to the seen and everything and I remember getting cold chills from it. I have told friends and stuff over the years but this is the first time I have ever reported it. I think my brother seen it to he may have been with me, I can never forget what I seen all the years later its like it happened yesterday, and the UFO didnt have a bunch of lights on it it was just bright gold no other lights and was traveling 2 to 3 times faster than fighter jets you see flying around. I almost think that something happened to someone around there maybe an abduction, and the military was trying to cover it up I dont know. I am willing to take any kind of lie ditector test anything to prove what I seen and show I am telling the truth and I believe if you were to investigate you may find other people or even the person that may have experienced it. I am a sketchy person so it has to be in my face to believe it, and this happened."],"Weather Factors":"None","Country":"United States","Date of the Event":"06/20/1993 08:25 UTC","Source":"MUFON","Region":"North Carolina","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28774.html.txt","/var/www/straped/mufon/org/28774.html"]}