{"Country":"United States","Longitude":"-79.01503","Date of the Event":"03/24/2011 06:28 UTC","Date Submitted":"04/22/2011 11:35 UTC","Object Flight Path":"Undisclosed","Case Number":"28772","Log Number":"US-04222011-0023","trends":[],"Tags":"City","Weather Factors":"None","Region":"North Carolina","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/28772.html.txt","/var/www/straped/mufon/org/28772.html"],"Latitude":"35.765043","Summary":"Out of control UFO","map":"<A HREF = \"http://maps.google.com/maps?q=35.765043,+-79.01503(28772)&iwloc=A&hl=en\"> mufon case (28772) map </A>","Disposition":"Unknown","Object Shape":"Circle","Source":"MUFON","City":"Undisclosed","divs":["Sighting DetailsI with my son in my car waiting that morning for his bus before school. We were sitting at the end of the drive way it was at 6:20 it was still a bit dark but sun was already coming up. Around i would say 6:28 I just happen to look directly in front of me directly towards the neighbors house when I thought i saw a falling star falling from the sky across the man's backyard beyond the trees but quick to realize that it was not a falling star and then i quickly told my son to look at this thing falling. I had thought at first I was seeing things so I had to ask him to look. He couldn't believe it either but he had a puzzled face. I asked him is it a helicopter, he said no mom cause it's not making any noise and the lights are coming out of it from everywhere. So now I started freaking out cause I wanted to know what it was but it happened in a blinking of an eye. It came down quickly, but like it was out of control and trying to gain control of itself or something. It was a ball like shape i would say with light beaming if that's what you want to call it from every side of it. Well I keeping watching it then out of shock I had to get out of the car just so I could see if I could tell what it was better outside. I still had my eyes on it the whole time because I was afraid it would go away by the time i decided to go outside of my car. By the time I ran out of my car and went about 10ft from my car I saw it still out of control then it vanished behind the trees and some clouds. I do remember thinking that I wish there were no rain clouds cause maybe at least I could have seen it go down better but I don't think that would have mattered because of the trees . Well in amazement and in shock and happy that my son saw it too, but still wondering what that was. If it was a helicopter then we would have heard it fall and crash or something on the news that day because I went home after my son got on the bus and looked up the news and anything that would help me find out what that was if anyone saw that thing that morning and nothing was reported. I still wonder and have no idea what that was. There has to be someone else other than us that saw that. Because this sighting was not that far from my son's school and the church so someone must of seen something, right?"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed"}