{"files":["/var/www/straped/mufon/html2text/28779.html.txt","/var/www/straped/mufon/org/28779.html"],"Summary":"Second night in a row -- confirming another report","Object Shape":"Star-like","Date of the Event":"04/22/2011 09:20 UTC","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around April 22nd 2011"],"Disposition":"Insufficient Data","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Region":"Arizona","divs":["Sighting DetailsOn both April 21 and April 22, 2011, I went outside to breathe fresh air and I saw what resembled a star in the Northwest sky west of the airport. I am familiar with the landing patterns of the airplanes as well as constellations; and whichever planets are present in the sky during the year, as I spend a lot of time outside at night. This object pulsated: white, blue and red, but didn't blink. It just seemed to change colors but stayed lit the whole time. The first night, I watched it hover for about an hour; it seemed to drift further northwest as the hour went by, but much faster than the corresponding stars surrounding it. After that time, it disappeared behind houses and I went back inside. On April 22nd, I again returned outside to find it in the same place that I had discovered it the night before; still changing colors from white, to blue, to red. However this time, there appeared to be interest from other parties, as there seemed to be several planes that flew near it as if the pilots were curious as to what it was. The object didn't seem to care at all, but the planes didn't stick around for long. It was easy to tell the difference between the small planes and this object, as the planes' lights were blinking and the object's lights were not. It followed its \"drifting\" trajectory--the same as the night before--until it disappeared out of my view again behind houses on the horizon. The object was too far away to affect me in any way, and too far away to get a decent video of it. I will try tomorrow to see if I can obtain some sort of recording. My cell phone couldn't take a decent image. I report this because upon reading earlier submissions from April 18 and 20th, it appeared that another person saw this same object. I wanted to let him know that he was not alone and if he's crazy, then so am I."],"Date Submitted":"04/23/2011 02:03 UTC","Log Number":"US-04232011-0005","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.418304,+-111.822772(28779)&iwloc=A&hl=en\"> mufon case (28779) map </A>","City":"Mesa","Latitude":"33.418304","Tags":"City","Case Number":"28779","Source":"MUFON","Object Features":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-111.822772"}