{"Latitude":"42.989589","Object Flight Path":"Straight-line path","City":"Tonawanda","Tags":"City","Case Number":"28789","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.989589,+-78.851288(28789)&iwloc=A&hl=en\"> mufon case (28789) map </A>","divs":["Sighting Detailsit was time for bed so i took the dog out.i was walking down the walkway too the back yard it was a clear night i could see the stars i looked right then left and i saw a orange light in the distance it looked like a brite star i watched it getting closer and though it might bee a shooting star but i was wrong. I have see a shooting star before this was no shooting star. It was a glowing orange disk I figured it was glowning orange from being so hot because it was travilling about 1,000 miles an hour.im not an expert but i cuncider my self a pretty good judge of miles per hour. it was only 200 feet in front of me so i got a very good look at it. it only took it 5 seconds to traville about 20 miles thats as far as you can see if you look from left to right.i thought it was amazing.if i would have had a camara i could have taken a pitcher,i was astonished,i thought no one would belive me i ran back into and told my wife what i saw.she said that i should take the camara with me the next time i go out.and for the next two weeks i did but never saw any thing again."],"Date of the Event":"10/21/1999 10:15 UTC","trends":["There have been 7 other sightings in Tonawanda","There were no other sightings in Tonawanda on or around October 21st 1999"],"Date Submitted":"04/23/2011 01:36 UTC","Longitude":"-78.851288","Object Features":"Window(s)","Object Shape":"Disc","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/28789.html.txt","/var/www/straped/mufon/org/28789.html"],"Country":"United States","Region":"New York","Summary":"glowing orange disk travilling at a very high speed aprocsimetly 1000 miles","Sighting Duration":"Undisclosed","Log Number":"US-04232011-0015","Disposition":"Unresolved","Source":"MUFON"}