{"Sighting Duration":"00:03:00","Date Submitted":"04/23/2011 08:55 UTC","divs":["Sighting DetailsMy 26 year old son and his wife were driiving north on Belvoir road near plymouth road intersection,in a Brand new less than 100 miles on odom)toyota corolla when my son decided to take a few pictures out the window and this is what was seen when reviewing.The actual picture on the camera had more visible objects,at least 10 to 20 more.To put it in todays words\"there was alot going on up in the sky\".When he took the picture neither he nor his wife noticed anything unusual in the sky.I have shown this to other people and got mixed viewpoints from being real UFO'S or just plain dirt on windshield.One man I showed picture to came back later with numerous older published photos showing three similar objects in identical formation.A few days after picture I sat in the front seat of the toyota and looked through windshield at every possible angle and there was no dirt marks or deformities in window.The car had not been washed from the time of photo up to the time I examined windshield."],"Summary":"Unseen to naked eye?","Object Shape":"Unknown","Case Number":"28786","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=39.958335,+-75.160879(28786)&iwloc=A&hl=en\"> mufon case (28786) map </A>","Longitude":"-75.160879","Source":"MUFON","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around January 10th 2010","This sighting has never been favorited.",""],"Date of the Event":"01/10/2010 12:00 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Log Number":"US-04232011-0012","City":"Philadelphia","files":["/var/www/straped/mufon/html2text/28786.html.txt","/var/www/straped/mufon/more/28786_submitter_file1__photo1.jpg","/var/www/straped/mufon/org/28786.html"],"Disposition":"Insufficient Data","Tags":"City","Latitude":"39.958335"}