{"Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Date of the Event":"07/03/2010 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.957335,+-75.159489(28787)&iwloc=A&hl=en\"> mufon case (28787) map </A>","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around July 3rd 2010"],"Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","City":"Philadelphia","Summary":"orange colored, silent","Longitude":"-75.159489","Region":"Pennsylvania","divs":["sighting detailsmy husband and i were sitting on our porch and saw a single orange round light coming toward us from the philadelphia area toward the jersey area. we got our binoculars and watched as it passed. it was completely silent. we got our camera out and sure enough over a short period of time, two more objects came over head within about an hours period of time. by the time the third one passed over, one of our neighbors was sitting outside with us and he witnessed the same thing. it definately wasn't any type of plane or anything that we are familiar with. we did try to take photos, but the photos did not come out. also worth mentioning, we very often see a very bright light in the same exact spot in the sky the stay put for about an hour or so and then will slowly move toward the right of where we are looking until it disappears. this light appears over the oxford valley mall area and heads toward the right of the area. it's not as close as the mall, but that is the direction it appears from. we were not afraid. we were very curious and hoped to video\\photo objects - but like i said, they didn't come out. they were completely silent."],"Log Number":"US-04232011-0013","files":["/var/www/straped/mufon/html2text/28787.html.txt","/var/www/straped/mufon/org/28787.html"],"Object Shape":"Circle","Sighting Duration":"Undisclosed","Latitude":"39.957335","Date Submitted":"04/23/2011 09:25 UTC","Case Number":"28787","Country":"United States"}