{"trends":["There have been 11 other sightings in Bridgeport","There were no other sightings in Bridgeport on or around August 31st 1979","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/28782.html.txt","/var/www/straped/mufon/more/28782_submitter_file1__04-22-2011113016PM.jpg","/var/www/straped/mufon/more/28782_submitter_file2__finalcopyofevents.JPG","/var/www/straped/mufon/more/28782_submitter_file3__04-22-2011113451PM.jpg","/var/www/straped/mufon/org/28782.html"],"Longitude":"-73.186237","Disposition":"Unknown","Log Number":"US-08072011-0049","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Latitude":"41.190878","Country":"United States","Summary":"disk-like w/ counterclockwise chaser lights one light at a time.One black square did not light up,lights skipped that square fast sequence lights .Silent ,mile wide aprrox.","Tags":"City","Region":"Connecticut","divs":["Sighting DetailsTo MUFON investigators,Me and my friend were sitting in the car waiting for my friends parents who were in the store to come out.We were in Bridgeport ,CT and were going to see a movie.I was looking out the passenger window at the coat when I noticed one light that was brighter then the other stars.I saw it moving horizontally and dropped down until I couldn't see it anymore and then it popped back up to the same exact level it was before it had dropped and it kept doing that about 4 times and then I said to my friend \"Oh look a UFO\" I was only kidding but then as we continued to watch I saw it coming directly towards us taking the shape of a football.it continued to come all the way to our position and slowed down on approach to a crawl until it was directly over us and it stopped and was hovering silently. My friend was terrified and hid under the dashboard and I jumped out of the car and said \"I gotta get a look at this\".I stood there with my arms out and said \"look you found me what do you want your scaring us\" It was round when I looked straight up at it.It had to be a mile wide,there was a light sequence going counter clock wise around the perimeter. Even though it was night time I could still see the color which was a polished charcoal.It was totally silent and still even though it was so close to us.The lights lit up one by one except for the one black square that didn't light.As it was still hovering I threaten it and threw rocks at it because I thought I could hit it,but they didn't hit it at all it was out of reach as if it knew.People were running out of the store and between cars passed me as I yelled \"look up,look up\" People were running for their lives because they had evidently seen it already.I dropped the rock I was holding staring at it memorized and in disbelief. It was still just hovering there.it felt as if it was there because of me and my comment about \"look a UFO\".I was yelling at it with aggression and then complimented how nice the ship looked. I said looking up at it you have a beautiful ship there.There were no lines or markings on it,and it was obvious that it was not from this planet.It started to slowly move past me ,stopped..tilted itself upward slightly and then I saw it was football shaped. Then it disappeared so fast that I only saw a blur from it's own light.It was just that fast that it happen.If I blinked I would have missed it.I was in shock but I knew what I saw and I knew what it was. It was to big,perfect,silent. It was weird because everyone around was freaking out and scared but for some reason I was not I was intrigued.I felt that I knew that it was being operated by an extremely intelligent control.The strangest part of all of this is that I know that it understood me because as soon as I said look a UFO it came directly to me.Previous to that it was going up and down in that same pattern as I stated before as if it was working or doing something.I feel unnerved because I feel that it knows a lot about us.I don't know why it came to me? The only thing that I can guess is my voice?! I just don't know why me, but my friend was with me I was 17 he was 16.It felt like it was looking at me,something I will never never forget or want to forget."],"Source":"MUFON","Sighting Duration":"00:15:00","Viewing Distance":"101-500 Feet, Over 1 Mile","Date of the Event":"08/31/1979 09:00 UTC","Weather Factors":"None","City":"Bridgeport","Object Shape":"Circle, Disc, Oval","Date Submitted":"08/07/2011 01:39 UTC","Object Features":"Other","Case Number":"28782","map":"<A HREF = \"http://maps.google.com/maps?q=41.190878,+-73.186237(28782)&iwloc=A&hl=en\"> mufon case (28782) map </A>"}