{"Country":"United States","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around June 30th 1962"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.765479,+-111.888827(28781)&iwloc=A&hl=en\"> mufon case (28781) map </A>","Object Features":"Unknown","Longitude":"-111.888827","Sighting Duration":"Undisclosed","divs":["Sighting DetailsSitting on porch with grandmother when we noticed to the northwest of our location in Midvale, which appeared to be to the west of Salt Lake City a fireball, glowing a red-orange and making some strange maneuvers at high speed. Not aircraft. Made right-angle changes in maneuvers without slowing down. We observed it for about 5 minutes. I don't know if the red-orange color was the craft itself or the sun reflecting off the object. The sun would have started going down when we saw it & no, it definitely wasn't the sun. At the time I was slightly familiar with UFO stories and believed that was what we observed. A number of years ago I had a paperback which had this sighting detailed and the author also stated that this UFO was probably the same one that came down close to an electrical substation somewhere in Nevada. Unfortunately, I no longer can locate the paperback and would dearly love to find it or own it again. This was the first time I observed a UFO. I have had a second sighting, in 1975 while flying in a commercial plane, but I'm more interested in the one in 1962. Would appreciate whatever you can locate in your files."],"Weather Factors":"Unknown","City":"Salt Lake City","Log Number":"US-04232011-0007","Summary":"Fireball making erratic changes in flight at accelerated speed.","files":["/var/www/straped/mufon/html2text/28781.html.txt","/var/www/straped/mufon/org/28781.html"],"Region":"Utah","Object Shape":"Fireball","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Tags":"City","Date Submitted":"04/23/2011 02:35 UTC","Disposition":"Unresolved","Case Number":"28781","Latitude":"40.765479","Source":"MUFON","Date of the Event":"06/30/1962 12:00 UTC"}