{"Object Shape":"Disc, Unknown","trends":["There have been no other sightings in Herceghalom","This sighting has never been favorited."],"Summary":"slowly rotating lights, moving slowly at night","Source":"MUFON","divs":["Sighting DetailsI am sorry to come to the point to report the event so much time after it happened... I live in a village (approx. 2000 residents) 25 km from Budapest. It was a winter evening (2008 or 2009) around 6 to 7 pm (fully dark). It was overcast with cloud base at approx 100 m (300 ft). I drove home from work, parked my car in the garage and went up the (outside) stairs to enter my house. After a few steps on the stairs I could see over the garage and noticed a strange thing. Dim blueish green light sources on a circular pattern, about 10 pcs, rotating slowly around the center, about half rotation per sec. It seemed as they were on the bottom of a circular object, which is spinning horizontally. I could not see the object itself, so unsure about its shape, because there was not any backlight. I could just see the lights on its bottom. It was about 300 m away from me and with the little reference to other objects (some tall trees) I estimate its diameter to be 15 m, and its altitude 50 m over the land. There is a main railway line at the edge of the village and it seemed a bit farther than that, over the lands. It was hovering, no movement and the rotation was also stable. The lights were also stable in color and brightness. First I thought someone was playing with kind of a disco laser light, which would probably project similarly on a very smooth cloud base. But after about 5 seconds it started to move left (East) in a way what was very surprising to me and excluded the disco light possibility. First it tipped left about 20 to 30 deg and started to move in that direction. Then it tipped right the same amount, and continued this slow left-right tipping, while moving slowly to East (50 kmh?), and out of my sight (other buildings, trees and terrain blocking sight). I told my wife what I just saw and to my workmates next day. I am an electrical engineer and have a PPL and tried to identify the object based on my knowledge, but I still cannot explain it."],"Longitude":"18.74525","Object Flight Path":"Hovering then path","Tags":"City","Sighting Duration":"00:00:20","Latitude":"47.49705","Weather Factors":"None","Date of the Event":"01/01/2008 07:00 UTC","Region":"Pest","Disposition":"Unresolved","Country":"Hungary","Date Submitted":"04/23/2011 08:54 UTC","Log Number":"HU-04232011-0011","Viewing Distance":"501 Feet - 1 Mile","Case Number":"28785","map":"<A HREF = \"http://maps.google.com/maps?q=47.49705,+18.74525(28785)&iwloc=A&hl=en\"> mufon case (28785) map </A>","files":["/var/www/straped/mufon/html2text/28785.html.txt","/var/www/straped/mufon/org/28785.html"],"City":"Herceghalom","Object Features":"Unknown"}