{"Region":"Ohio","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/28780.html.txt","/var/www/straped/mufon/org/28780.html"],"Object Features":"Window(s)","City":"Mantua","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.283944,+-81.223991(28780)&iwloc=A&hl=en\"> mufon case (28780) map </A>","Case Number":"28780","Latitude":"41.283944","Disposition":"Unknown","Summary":"Two part sighting","Log Number":"US-04232011-0006","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in Mantua","There were no other sightings in Mantua on or around August 15th 1978"],"Longitude":"-81.223991","divs":["Sighting DetailsIt was somewhere around August 15th on a Sunday in 1978. I remember it well because of a number of memorable events that took place in my life that year. I lived in a town in northeast Ohio known as Twinsburg. I moved there from Cleveland with my parents and siblings in 1963, I was ten years old. 1978 was the very best and very worst year of my life. In January of that year my third child was born, a daughter, who is now a PH.D candidate at a large and very prominent New England university. That year proved to be the warmest January on record to that date. On January 27 of that year the temperature was an unseasonably warm 58 degrees as I recall. Later that same day the temperature dropped 30 degrees in an hour, the winds that brought the temperature change also brought something more ominous. A blizzard caught most northeast Ohioans off guard and left everyone snowed in. The next morning my brother came to my house to tell me that there was a fire at my parents home and one of my brothers was caught in the blaze and had suffered some injuries. Everyone met at my second oldest brother's home and made preparations to go to the hospital in nearby Akron, Ohio where he died five days later. That winter was the coldest on record, there had been news reports of wind chills at 60 below zero. And it caused scientist to speculate that we were headed backward into a new Ice Age. The snow stayed until mid April as snowstorm upon snowstorm left snow piled as high as 16 feet in some areas. I am the oldest of 10 children. And that was the first time any of us had been sick or in seriously ill health. I was 25 years old at the time and I was angry. Angry mostly at God and the weather because, my brother was the third born and nothing should happen to anyone who was only 20 years old. Later that year my wife and I put a bid on a house and won, we were on our way to a home in suburban Cleveland, and for the second time that year something extremely good happened to me and it looked like the curse had been lifted from my family. We were to take possession of that house on the 28th of August in 1978. I told you this story to show a progression or timeline of events that took place in my life that year, in hopes that you would be able to realize why events in my life remain emblazoned in my memory for the rest of my life. My wife grew up in rural West Farmington, Ohio some thirty miles or more from Twinsburg. Her parents and siblings met me at their church on a Sunday when my church was visiting. We were married in 1974 and had a total of 5 children born to our union. That August my wife's parents were visiting Mississippi and Louisiana, where they were born and lived until shortly after they were married. Before embarking on this vacation, the first one they took by themselves, since moving to Ohio. Their children were getting older and did not want to accompany their parents that year. My in laws were somewhat apprehensive about leaving them alone, as my wife was the oldest of eight children and was herself only 22 years old at that time. They asked us if we would chaperon a party the kids were planning that weekend to sort of commemorate the end of summer. We agreed and moved in with them for the weekend. My wife bundled our children into the car along with my 10 year old sister and left for her parents home on Friday. I had to work on Friday and check in at work on Saturday to reconcile some accounts. I left Twinsburg on Saturday in my car, a 1967 Pontiac Firebird, outfitted for the track but still street legal. I stopped by my parents home before leaving to pick up 2 of my brothers that were invited to the party. The next day, Sunday proved to be a clear warm August night. We left West Farmington at about 9:00 pm that evening and arrived at a crossroad of route 82 and route 44 in Mantua Ohio. I always considered that junction to be the halfway point of our trip. Because the town of Mantua was very rural and a farming community there was very little traffic especially after 9 o'clock in the evening. This night was different there was a line of cars sitting at the light and we pulled into line with the rest of the cars and we were about the fourth or fifth car in line. I noticed a woman at the head of the line outside of her car with the hood up and her car appeared to be lifeless. She had some sort of object in her hand she kept hitting the object with her hand and her knee, it may have been a flashlight but we were too far behind to see it clearly. My wife and one of my brothers, my sister and children were a car behind us, somehow a car managed to get between us, my wife was not an aggressive driver like I was. My brother asked me what the red object was circling the light. I told him it that I noticed it and thought it might be a child with some sort of remote controlled helicopter or some sort of toy. I thought that because as it circled the traffic light it also moved up and down at the same time. I also remember thinking at that time that I sure would love to have that same toy. I made a mental note to go to our local Toys R Us store to inquire about buying one. As we waited for the light to change I remember a feeling of calmness like I never felt before, remember I was 25 at the time and given to bouts of road rage at times. The object left and the womans car started up while she was still outside her car and she got in and drove away. I was relieved because I would not have to stop and help her and we could continue our journey home. After driving about a quarter of a mile we came to a stand of trees on the south side of the street. I knew that there was an opening at the end of that stand of trees that was more than a half mile away from our current position. There was a red light at the end of the trees that was just above the line of trees. My brother again asked what the light was. Because it was larger and stationary I told him it was likely to be an oil derrick or someone may have sold the mineral rights to a gas company, although I could not remember seeing one on our way to my in laws, but, it was 1978 and four years after the \"Arab Oil Embargo\" and everyone was digging for oil which was like striking gold in those days. As we drove closer to the stand of trees the red light we saw was pulsing and seemed to be redder and brighter than any light I had ever seen in my lifetime. When we came to the end of the trees the car ahead of us pulled over, what I saw on the south side of route 82 made me pull over behind that gentleman and exit my car, my brother got out also. Right across the street from us, hanging in the air was an object of immense proportions. And I say hanging because it was not on the ground, it was not moving and it was not making any noise. It was hanging as if on a string it was oval shaped and it was bigger than a house ,almost the size of a barn and it had lights, boy did it have lights, it was oval shaped and almost spherical. The light were red white and blue and they appeared to be moving around the object with a life of their own. Just as we got out to view the object my wife was pulling over behind us and as my brother and I stood next to my car, my wife yelled out to me saying \"don't go over there,\" I looked at her and again she yelled \"don't go over there.\" She did not have to worry, my calmness seemed to have left me and was replaced by fear. Fear and wonder. At that moment the guy in the car ahead of us got back in his car and left in a hurry. At the same time the object seemed to open some sort of trap door or window and a light came out beneath it and moved around the ground searching for something, the light was not an ordinary light, it was white light and brighter than any light I have ever seen before or since. The beam was narrow at the top and became progressively wider as it neared the ground, until it splashed the ground in a perfect circle about the size of a mirror attached to a bedroom dresser. Whatever the object was searching for it must have found it because that was when the object moved. It descended just as if it were on a string to the place where the searchlight stopped. My brother chose that moment to be a hero, he began to run across the street toward the object. \"Come back here!\" I shouted, that was when he turned around and came back to the car. \"Let's go, Let's go,\" my wife was almost screaming and in her panic, and given my brothers daring act, I came back to my senses and realized I had a choice, I could stay and see what would happen next, or, I could take caution and not put my family at risk, I could get in my car and go home. As we pulled back onto route 82 toward home my brother said \"why did you stop me? I wanted to see it.\" I said \"David, if I come back home without you, there's no telling what mom will say or do to me, I don't want to tell her she has just lost another son to what, aliens, a spaceship?\" He looked at me and said I still wanted to see.\" I waited a moment and said \"look David, if they can come here and we can't go there, I think it's best if we just leave them be,\" I thought to myself if they wanted us would I be able to stop them? I shuddered at the realization that I would probably have been helpless to stop them. I realized that we were still not out of the woods, we were not home. When we finally made it home I asked everyone to keep it to themselves when we get inside, because if you tell people what you saw, they will call you crazy. I wasted my breath issuing that warning, as soon as we got inside everyone began talking at once relating what we saw. I remember my mother sitting in her favorite chair and telling us that we all needed to have our heads examined. That was thirty three years ago, a number of things have transpired over the years. I am no longer with my first wife I have remarried, I have lived in other states, and have lost 2 more brothers to tragedy, including my brother who rode with my wife that night. My brother who rode with me says he cannot remember the incident. My mother passed away in 2001, and my dad died in 2008, my grandmother passed away this year at the age of 102. I have enjoyed raising my children and beamed with pride as they accomplished goals they set for themselves, and I now have 5 grandchildren, 3 boys and 2 girls. I am retired and living in the southwest of this great country. I think about that night often, I have recurring dreams of UFO's and I'm not so quick to dismiss sightings by others, and anytime I hear people on the news or documentaries trying to explain away peoples' sightings I think of Shakespeare's words uttered by Puck in \"A Mid Summer Night's Dream\" and they are \"Lord what fools these mortals be.\" One thing keeps nagging away at me, it is the one thing I and my ex wife have never shared with anyone else, and that is as we got ready to go to bed that evening I asked my wife if she had the time. She asked, Why didn't I have my watch? \"I said sure I do, but according to the clock in the kitchen my watch is seven minutes slow.\" She looked at me with a stone expression on her face and said, \"mine is too\" \"mine is too.\" Sometime in 1977 Stephen Spielberg directed the movie \"Close Encounters of the Third Kind,\" I never watched the movie until sometime in the 1990's and the mother ship shown at the end of that movie looked almost exactly as the object we witnessed on that warm night in August of 1978."],"Sighting Duration":"00:13:30","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Egg, Oval, Sphere","Date Submitted":"04/23/2011 02:33 UTC","Date of the Event":"08/15/1978 09:30 UTC","Weather Factors":"None"}