{"Date of the Event":"04/20/2011 08:20 UTC","divs":["Sighting DetailsThese creatures have been seen by the two male reisdents of the house. The creatures are short, whiter than white, long tail, looked like it had a cat-faced mouth. The creature had real pointed legs, walking on the two back legs. When you try to hit or touch the creatures, you are stunned and cannot move, until the creature has moved past. No noise! We do not know when the thing is coming but this has been going for at least a year. Sometimes varied but much the same. They touch my Dad on his leg, his knee, they seem to jump on the beds or land on the beds, because you can feel the movement. They mess with me but it is like I am knocked out and when I wake up, I cannot remember. And I am not a drinker or druggie, so I cannot imagine what is going on to me. Now I have a dog, a pitbull, that I thought would scare these things away but they freak my dog out and he is gotten so hyper that I have to get the dog some anti nerve medicine. Sometimes there is more than one creature in the house. They come to the house on Wednesday afternoons and stay until Thursday night. Sometimes we can hear boxes drug across the floor but when I get up and check, there is nothing. This week I found weeds and grass from the outside bushes by the back door, on the patio deck. There was NO reason for that to be there! I have two movie cameras, set on night vision, set up and whatever these things are, they manage to avoid getting caught. One night I was sleeping, that was on camera. All of a sudden my feet started moving up and down, and it was not me doing it. But nothing was caught on the camera other than my feet and me sleeping."],"Latitude":"46.810457","Summary":"Reptilian like creatures come into the house, though locked doors and security system.","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Country":"United States","Disposition":"Unresolved","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.810457,+-100.781919(28791)&iwloc=A&hl=en\"> mufon case (28791) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28791.html.txt","/var/www/straped/mufon/org/28791.html"],"Date Submitted":"04/23/2011 01:59 UTC","Tags":"City","trends":["There have been 5 other sightings in Bismarck","There were no other sightings in Bismarck on or around April 20th 2011"],"Case Number":"28791","Object Shape":"Unknown","Region":"North Dakota","Longitude":"-100.781919","Log Number":"US-04232011-0017","Object Flight Path":"Undisclosed","City":"Bismarck","Weather Factors":"Does Not Apply"}