{"Date of the Event":"04/09/2011 07:20 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.839933,+-76.081988(28798)&iwloc=A&hl=en\"> mufon case (28798) map </A>","Date Submitted":"04/24/2011 10:36 UTC","Latitude":"40.839933","trends":["There have been 2 other sightings in Delano","There were no other sightings in Delano on or around April 9th 2011"],"Region":"Pennsylvania","Longitude":"-76.081988","Case Number":"28798","Country":"United States","City":"Delano","Weather Factors":"Unknown","Source":"MUFON","divs":["sighting detailsi am a nj ufo investigator of 30 years and i am friends with paty j. marcatillio(dr. ufo). i was at a friends house on the morning of april 9th 2011 in washington crossings pa, picking him up to head up to state college. while waiting, i went out to his porch to smoke a cigarette and was looking over the new veterans cematery in washington crossings. coming from trenton and moving west were two huge bright orange orbs moving horizontally across the sky. there is a microwave tower in my view across the field and the two orbs were 3\\4 of the way up the tower. there appeared to be one following the other. they came into my sight and flew horizontally out of my sight within a matter of seconds. there were no flames or structure to be seen. these were not planes,jets,helicopters or balloons. these 2 orbs were contrasted by a clear blue sky as a background. my first thoughts were that of disbelief but bucks county has has a string of ufo's so its not all uncommon. after some research, i found no corresponding sightings or media stories. i did however speak to my friend and he stated he and his boss have been viewing 3 bright white orbs hoving over route 95 that were not orions belt, as they hovered, were considerably larger and hung lower in the night sky."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"2 orange orbs,great size, moving at great speed","Log Number":"US-04242011-0003","Object Shape":"Circle, Sphere","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/28798.html.txt","/var/www/straped/mufon/org/28798.html"],"Object Features":"None","Sighting Duration":"00:00:10","Tags":"City"}