{"Viewing Distance":"20 Feet or Less","Summary":"Abduction and Sighting","divs":["Sighting DetailsI was about 4 years old, asleep in my parents bed. I woke up for no reason, and time seemed to pause. There was a bright light, and a tall, brown life form came into the room. It was speaking a different language but, for some reason, i could understand it. I wasn't sure what it was at first, since i was only a kid. The next thing i knew, i was in a bright, round room. There were other kids in the room, also. They did something with me, and i blacked out. I remember them saying something about \"coming back in 12 Earth years, to see how 'it' was doing and working out\". I still don't know what \"it\" is. I remember a long, dirty hallway, and then, i was in the room again but standing up. They used this scanner thing on me, which kind of felt like a ton of tiny little bugs were crawling on me. I blacked out once again, but this time, i woke up standing in my parent's room. The light outside disappeared, and time started to go again. I had a bloody nose, but I was too terrified at what happened to try to even explain it to my parents. I've only told about three people about this experience, but it's been 11 years now and I'm kind of afraid on what they need to check up on and what they will do next."],"City":"Bradford","Date of the Event":"04/21/2000 03:30 UTC","Disposition":"Hoax","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.961495,+-78.642663(28793)&iwloc=A&hl=en\"> mufon case (28793) map </A>","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Case Number":"28793","Longitude":"-78.642663","Tags":"City","Object Flight Path":"Stationary","Object Shape":"Flash, Sphere, Unknown","Log Number":"US-04232011-0019","trends":["There have been 3 other sightings in Bradford","There were no other sightings in Bradford on or around April 21st 2000"],"Latitude":"41.961495","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28793.html.txt","/var/www/straped/mufon/org/28793.html"],"Date Submitted":"04/23/2011 03:32 UTC","Object Features":"Dome","Weather Factors":"Unknown"}