{"Object Flight Path":"Undisclosed","Date Submitted":"04/24/2011 09:05 UTC","City":"Kanawha","Tags":"City","Latitude":"42.937744","trends":["There have been no other sightings in Kanawha","This sighting has never been favorited."],"Weather Factors":"Unknown","Summary":"repeated abductions.","divs":["Sighting Details I have had past UFO sightings, but that is not the reason that I am contacting you. I have had a lifetime of abductions that are leading to something I dont know. My whole life I have been attracted to this mattter. Since a child i would go to the library and sign out books, watch shows, anyhting related to the topic. Growing up I would have nightmares on a nightly bases about UFO's and aliens abducting me. I wrote it off as a dreams so i could sleep. I am going to be 32 in a couple days, but when i was 22-23-24 years old it started again. After i got married at that time( now divorced) it started to begin to be more of a reality. I started to have physical evidence such as burns, needle holes, bloody noses, bruises etc. I would become paralized and couldnt scream or move or do nothing. I woke one time to them around my bed, but for some reason i layed back down and went to sleep. I finaly told my wife at the time about what was going on.....and she knew. She had been having nighmares of them coming in and takeing me. I can tell when this is going to happen.....almost a sixth sense to it. I dont want to sleep, I hear a humming outside my house etc etc. My girlfriend now has it happen to her, but will not talk about it. she has seen them take me....and have taken her. Not sure what to do......just want to know why"],"Region":"Iowa","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.937744,+-93.793275(28801)&iwloc=A&hl=en\"> mufon case (28801) map </A>","Country":"United States","Log Number":"US-04242011-0006","files":["/var/www/straped/mufon/html2text/28801.html.txt","/var/www/straped/mufon/org/28801.html"],"Longitude":"-93.793275","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Date of the Event":"04/23/2011 12:00 UTC","Case Number":"28801","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unknown"}