{"Country":"United States","Sighting Duration":"00:12:00","Object Features":"Undisclosed","City":"Miami Beach","Case Number":"28800","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28800.html.txt","/var/www/straped/mufon/more/28800_submitter_file2__3contii.jpg","/var/www/straped/mufon/more/28800_submitter_file3__The7ii.jpg","/var/www/straped/mufon/org/28800.html"],"divs":["sighting detailson the morning of august 20th at approximately 9:15am i woke up to an incomming summer thunder storm. since i had just moved to florida these types of storms were new to me and i went outside to get a good look and take some pictures. i was standing right outside of my apartment which was on the water in the normandy isle part of miami just off of the 79th st. (j.f.k.) causeway looking south. almost immediately i saw a a couple very bright spheres flying by my apartment. they were not far away at all, and looked to be spheres. its hard to estimate distances, but i would guess they were less than a 1\\4 mile away and were approximately 30-40 feet in diameter. they were very bright and completely silent. they flew from the east horizon to the west on perfect straight lines. as i looked back to the east i could see more of them coming. by the time it was over there must have been about 10 of them total. all the same size with the same flight characterists. when i saw them i immediately thought they were ufos of some sort. they were easily not a plane\\bird\\blimp\\helicopter etc. while miami is a place where blimps and small planes fly around quite a bit advertising just about everything, there is nothing flown by man that is a sphere and completely silent. as it happened i felt oddly calm. since i was a kid i was always fasinated by the idea of ufos and i would have thought if i would ever see one i would have been anything but calm. but as i stood there taking pictures and one video it all seemed very surreal. if they would have made a noise it probably would have scared the hell out of me. i eventually lost sight of them as they flew out of sight over the horizon."],"Weather Factors":"Unknown","Longitude":"-80.122436","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Object Shape":"Sphere","Latitude":"25.799404","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=25.799404,+-80.122436(28800)&iwloc=A&hl=en\"> mufon case (28800) map </A>","Date Submitted":"04/24/2011 07:43 UTC","trends":["There have been 8 other sightings in Miami Beach","There were no other sightings in Miami Beach on or around August 20th 2006","This sighting has never been favorited.",""],"Summary":"Multiple spheres flying by apartment","Log Number":"US-04242011-0005","Region":"Florida","Object Flight Path":"Undisclosed","Date of the Event":"08/20/2006 09:20 UTC"}