{"Object Shape":"Blimp, Cigar","Weather Factors":"None","Date of the Event":"08/15/1996 01:20 UTC","Country":"United States","Longitude":"-105.217203","Source":"MUFON","Object Features":"None","Disposition":"Unknown","City":"Livermore","Viewing Distance":"Over One Mile","Case Number":"28809","divs":["Sighting Details I sighted this UFO in 1995. At the time I was fixing cattle fence for a ranch near Livermore, Colorado,..close to the Forks Restaurant. I first notice the craft as I stood-up to take a drink of water from a canteen. The craft was a clasic cigar shaped craft, and was SO large that it was hard to miss when I looked up to take a drink of water. At first I thought I was seeing the GoodYear blimp;.. as there is a blimp hangar only a few miles from where I was at the tme. But upon closer inspection of the surrounding background,.. I quickly realized that the craft was much, MUCH, larger than the GoodYear blimp! The craft hovered silently, about 200 feet off the ground for a few minutes, and then slowly moved over the mountains to the West. At first I did not beleive what I was seeing, but soon realized that I was with-out a doubt looking at a cigar shaped UFO! When I looked back up at the Forks restaurant to see if anyone else was seeing what I was seeing,.. I was supprised to see that there was about a half dozen other people standing on the front pourch of the Forks restaurant who were all pointing at the same thing..!!! Sadly,.. after a few minutes;.. the craft floated over the mountains to the South-West of Livermore and left our field of view. Although I witnessed the sighting of this UFO over a decade ago;.. I still have vivid memories and even dreams of that event. It was an event that changed my life..!!! Since that time, I have only told a few people about the event. When I DO mention the event to someone;.. I usually get the classic looks and scarcastic coments, etc. So I finally stopped telling anyone about my sighting. But was a few moments that are burned into my memory, that has changed my life, in a big, BIG way..!!!"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.794426,+-105.217203(28809)&iwloc=A&hl=en\"> mufon case (28809) map </A>","Summary":"Seen at distance (Apx. 1 mile)","files":["/var/www/straped/mufon/html2text/28809.html.txt","/var/www/straped/mufon/org/28809.html"],"Sighting Duration":"01:15:00","Log Number":"US-04252011-0006","Region":"Colorado","Date Submitted":"04/25/2011 01:39 UTC","Latitude":"40.794426","Tags":"City","Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Livermore","This sighting has never been favorited."]}