{"Region":"Alabama","Tags":"City","Latitude":"33.833918","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","Date of the Event":"04/25/2011 09:01 UTC","Log Number":"US-04252011-0012","Country":"United States","Sighting Duration":"00:36:00","trends":["There have been 5 other sightings in Jasper","There were no other sightings in Jasper on or around April 25th 2011"],"Date Submitted":"04/25/2011 11:38 UTC","Object Shape":"Cross, Diamond, Saturn-like, Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.833918,+-87.276105(28816)&iwloc=A&hl=en\"> mufon case (28816) map </A>","Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/28816.html.txt","/var/www/straped/mufon/org/28816.html"],"Source":"MUFON","Object Features":"Unknown","Summary":"UFO over dora alabama, changes shape then vanishes.","Longitude":"-87.276105","Case Number":"28816","divs":["sighting detailsour neaghbor had said that he had seen a ufo the night before but we didnt answer the door when he knocked. tonight he knocked on the door and we came outside to the road in front of our house in dora alabam. in the sw sky there was what looked at first glance to be a star with multiple color flashing lights. i had grabbed binoculars and my mother, her friend, our neaghbor and his wife, and myself all took turns looking at the shape in the sky. it changed shape several times. when i say changed shapes it could have been turning. it looked at first like the head of an arrow, then like a diamond, then like it was taking off (it got smaller and had traces of light around it, like it was moving away but didnt go anywhere) then it looked like a sideways jellyfish. it had a very bright white light. it also flashed yellow, blue, green, and red. the white lights were constant. it had what looked like an orange light hanging behind and underneath. it was small in the sky like it was far away but a plane passed and it looked lower to earth than the plane. my family went inside for a moment. before i went in i watched it for awile and it got smaller and moved like it was dancing sort of. i went inside and drew out what i had seen. i grabbed the binoculars and went back outside. it was no longer in the same spot. it had moved through the sky about a mile north.( i didnt see it move i just spotted it further away.) i saw its shape fairly well before it just vanished. i had tracked the nanosail-d to see if that was what i was looking at, but at that time it was over australia. i could not find a satellite to track that was over the area at that time. thanks for listening. *(wit's name deleted--cms\\sg)."],"City":"Jasper"}