{"map":"<A HREF = \"http://maps.google.com/maps?q=41.888731,+-72.966119(28813)&iwloc=A&hl=en\"> mufon case (28813) map </A>","Viewing Distance":"Over One Mile","City":"New Hartford","Case Number":"28813","divs":["sighting detailsobject flew from se to nnw about the speed of a fast airplane. i first thought i was seeing a bird flapping its wings, but the speed and trajectory clearly were too straight and the light that at first seemed like the underside of a bird's wing clearly became more of a metallic glint. as it was near sunset (about one hour before), the \"light\" appeared like a dark-colored metallic object that flashed to bright (whitish color), but not so bright that it seemed any more than the sun's reflected light. the rate of the \"on-off\" of the light\\reflection seemed to be about 4-5 times per second. the speed and altitude, as subjectively compared to the many airplanes that overfly my house (i am 20 miles from a regional airport), was 15 thousand feet or so, no noise or contrail, about 500-700 knots (faster than all but military aircraft at that altitude in this area). the size was smaller than a regional aircraft, such as a canadair jet often seen in the area, perhaps 1\\2 the size and from my viewpoint (southwest of the object which was about 40 degrees above the horizon) the object's side profile was saucer or cigar-shaped. this was the first time i have ever seem an object that i could not explain. i was outside watching my children jumping on a trampoline. i was not on the trampoline and the children did not see the object, nor did i point it out to them, as my viewing frame was only about 5-10 seconds long before it passed my view due to being blocked by trees."],"Log Number":"US-04252011-0009","Country":"United States","Date Submitted":"04/25/2011 06:54 UTC","Tags":"City","Weather Factors":"None","Latitude":"41.888731","Object Flight Path":"Straight-line path","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/28813.html.txt","/var/www/straped/mufon/org/28813.html"],"Source":"MUFON","Object Features":"None","Summary":"Saw object at approx. 15-20K ft. metallic and flashing like reflected light of sunset","Region":"Connecticut","Sighting Duration":"00:00:10","Longitude":"-72.966119","Date of the Event":"04/25/2011 06:01 UTC","trends":["There have been 2 other sightings in New Hartford","There were no other sightings in New Hartford on or around April 25th 2011"],"Object Shape":"Disc, Flash"}