{"files":["/var/www/straped/mufon/html2text/28827.html.txt","/var/www/straped/mufon/org/28827.html"],"Log Number":"US-04262011-0011","Source":"MUFON","divs":["Sighting DetailsEvery night last summer a few friends and myself would hang out at a local park late into the night. One night midway through July, we decided it was getting late and we should head to one of the girl's house a block away. We had reached the corner of the block that the playground was on when all of us suddenly stopped. We were surrounded in an almost perfect rectangle of green flashing lights, and they almost seemed to pulse. They were moving around us, and I remember feeling like they were targeting us, almost as if they were tracking our location and movements so we could be captured without injury. There were at least three of us standing on that corner, and at the same time (after about two minutes beneath the lights) we all screamed and started running like we had never run the last block to the safe refuge of our friend's house. When we got there, we all compared how we experienced it and found that all of us felt the same things-like they were targeting us, and we all noticed that when the lights passed over our flip-flop exposed toes, we felt a strange warmth coming from them that was uncharacteristic of a still summer evening. Not to mention that this heat was focused solely on the patch that it covered, and the heat vanished the second it moved. Another thing we all remembered was that when we looked up in unison, we saw no source for the lights. This meant that there was no possible way they had been from a plane or jet, because we obviously would have seen and heard it. Looking back on the memories only moments later, we all agreed that when we had started to run, the lights flew away in opposite directions and disappeared after mere seconds. Pulsing lights that targeted a bunch of pre-teens that had no visible source? I can't speak for you, but I don't consider that a coincidence."],"Case Number":"28827","Longitude":"-88.139799","Country":"United States","Disposition":"Unresolved","Date of the Event":"07/13/2010 12:00 UTC","Date Submitted":"04/26/2011 08:50 UTC","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.789043,+-88.139799(28827)&iwloc=A&hl=en\"> mufon case (28827) map </A>","Object Features":"None","Weather Factors":"Unknown","Object Flight Path":"Other","trends":["There have been 6 other sightings in Naperville","There were no other sightings in Naperville on or around July 13th 2010"],"Summary":"At least four green flashing lights with no source","Sighting Duration":"Undisclosed","Object Shape":"Other","Tags":"City","Latitude":"41.789043","Viewing Distance":"20 Feet or Less","City":"Naperville"}