{"Case Number":"28826","Source":"MUFON","divs":["sighting detailsthis ufo contact was not witnessed by me. the person that videotaped this event does not want to be labeled as a nut. this person doesn't want to release this video but has shown it to certain friends. one of these friends (my supervisor being one) says it is for real and sent chills down his spine. this tape is good quality and not grainy from what i've been told. i absolutely trust what he has told me. i've been told it was saucer shaped and very bright. the object is rotating as it comes closer to the camera's view. the saucer slowly stops spinning and a darkened doorway appears right in the middle of the object. this is all i know. this event happened several years ago in or near grand island, nebraska. the son of the witness to this event lives somewhere in omaha, ne. his name is *(name deleted--cms\\sg) --------- and he works in omaha at omaha public power district. he doesn't know that i am giving his name out so please don't use my name if you do try to contact him. i ran in to him at oppd on 4-25-11 and he confirmed that his mother still has the tape(his father has since passed away). i believe that this video will be legit and well worth the effort to coax it out of their possession for viewing. i would certainly like to see it for myself. maybe you can make it available for the public someday. i am not sure i spelled---------correctly. maybe ---------. if you are interested in this tape i might be able to get this person's phone #. my boss' name is ----- ------ 402--------- and he knows that i was thinking about contacting someone about this. he probably wouldn't mind discussing what he saw on the tape so feel free to contact him."],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Undisclosed","Summary":"N/A","files":["/var/www/straped/mufon/html2text/28826.html.txt","/var/www/straped/mufon/org/28826.html"],"Object Flight Path":"Undisclosed","Latitude":"40.927686","Longitude":"-98.338172","Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.927686,+-98.338172(28826)&iwloc=A&hl=en\"> mufon case (28826) map </A>","City":"Grand Island","Date Submitted":"04/26/2011 05:44 UTC","Log Number":"US-04262011-0010","Date of the Event":"Unknown","trends":["There have been 9 other sightings in Grand Island","There were no other sightings in Grand Island on or around"],"Object Shape":"Unknown","Region":"Nebraska"}