{"Tags":"City","Source":"MUFON","City":"Nashville","Summary":"Smyrna","Object Features":"Dome, Window(s), Insignia","Weather Factors":"Does Not Apply","Object Shape":"Disc, Triangle","Latitude":"36.17449","Longitude":"-86.777223","Disposition":"IFO","Country":"United States","Region":"Tennessee","Date of the Event":"Unknown","Case Number":"28828","map":"<A HREF = \"http://maps.google.com/maps?q=36.17449,+-86.777223(28828)&iwloc=A&hl=en\"> mufon case (28828) map </A>","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/28828.html.txt","/var/www/straped/mufon/more/28828_submitter_file1__WhatISaw.png","/var/www/straped/mufon/org/28828.html"],"Date Submitted":"04/26/2011 09:24 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Other","Log Number":"US-04262011-0012","divs":["Sighting DetailsCase One My first memory was of waking up in my grandparents house being abandoned. I walked into my grandparents living room, and I saw that only I was in the room. I walked into the dining room, and saw in the driveway a ten foot flying saucer landed. and then I saw a battalion of brown suite soldiers marching to my door with black rifles. I tried to hide, but then the door opened. Then a black out. Case Two I woke up to see that my houses hall was warping, my family computer and mouse was floating. I looked out the window, and a siren went off. I looked out the window, and I saw a flying saucer chased by a fighter jet. And then the flying saucer split into two flying saucers. I woke up with a scratch on my arm. Case Three This was when I was thirteen, I was at the beach swimming, and felt a jelly fish in my swimming suit, and pulled it out. It felt like 30 minutes passed, but in fact only 3 minutes passed. I discovered i had a rash between my legs. I then went to bed that night, and found myself pulled out of the window I couldnt normally reach. and then I saw a triangular craft pull me into the air. I woke up the next morning, with my underwear turned inside out, and a black mark that lasts to this day. Case Four In this case, I saw 6 grey like being standing in front of my bed. They were about 6 ft tall, and that had no apparent face. The incident lasted 3 minutes. Case Five This one was this year, I had a dream were an insectlike creature was crawling all over my walls, and then it turned its head 900 degress, and then starred at me with daggers. Case Six In this case, I had a dream were instead of seeing a jet fighter chasing the ufo, it was the ufo chasing the jet fighter. All in all, I'm not so much scared, as I am crepped out, and totally confused."],"trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around","This sighting has never been favorited.",""]}