{"Log Number":"US-04272011-0009","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 9 other sightings in Englewood","There were no other sightings in Englewood on or around April 27th 2011","This sighting has never been favorited.",""],"Object Flight Path":"Path then hovering","Region":"Florida","Date Submitted":"04/27/2011 03:40 UTC","Summary":"I went to smoke cig with dad out poarch he pointed to an object. at least a football field silver appeared rotating and silver metallic and stoped","Object Shape":"Cigar, Oval","City":"Englewood","Case Number":"28837","files":["/var/www/straped/mufon/html2text/28837.html.txt","/var/www/straped/mufon/more/28837_submitter_file1__spacecraft.png","/var/www/straped/mufon/org/28837.html"],"Date of the Event":"04/27/2011 02:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.970285,+-82.345475(28837)&iwloc=A&hl=en\"> mufon case (28837) map </A>","Latitude":"26.970285","Object Features":"Window(s)","Weather Factors":"Windy, Medium","Country":"United States","divs":["Sighting DetailsIt was 227pm apr 27 I went outside to smoke cig with my dad and he looked up and pointed and said what is that is that a ufo? I looked and said ya weird what is that. It was going left and was like a frisby and the few was like the side of a friby in flight few. It had some black window looking things it appeared to be rotating like a fan. It went left real fast. Then weirdly it dead stopped for 20-30 seconds. It was silver. It was at least size of football field. Just by the size I saw there it was bigger than any other airplane the US has made. Then after stoped went back left and tree blocked it off and should have came back in view but it was like gone.I was calm at first then i thought about it for seconde got scared,like something odd happened, anxiety. It was gone at 229 I looked at the clock then when it went behind tree i went grab camera it reaed 229. Crazy stuff. I will take polograph swear on a bible. It was not a plane. The only time i saw something like this was on UFO shows. Thanks it was UFO and I am not crazy. i live in engelwood. Rotanda west, FL."],"Longitude":"-82.345475","Disposition":"IFO","Sighting Duration":"00:02:30","Tags":"City","Source":"MUFON"}