{"Country":"United States","Weather Factors":"Windy","Date Submitted":"04/27/2011 03:39 UTC","Disposition":"IFO","Region":"Texas","files":["/var/www/straped/mufon/html2text/28830.html.txt","/var/www/straped/mufon/org/28830.html"],"Longitude":"-101.849076","Log Number":"US-04272011-0002","Sighting Duration":"00:00:05","Object Features":"None","Source":"MUFON","divs":["sighting detailsi was walking on texas tech campus returning to my dorm, and a jet that wasn't commercial from markings \\ light pattern and wing span \\ size, past overhead really low. i never have seen anything like this all year i've been here and it made me look up. when i did, no more than 2-3000 yards away this blue light dropped out of the sky, went from looking like a simple star to growing and getting brighter, then it flashed eastward to follow and overtake the jet. as soon as it did it was gone on the horizon and the jet banked off to follow it. the entire sighting couldn't have been more than 5 seconds at best. i was on the phone with my best friend when it happened. my adrenaline was pumping upon seeing it and all my hairs stood up on the back of my neck. i didn't hear anything but the wind and the jet, and i didn't get any sort of emp effect on anything i owned or that was in sight. however when i called the campus police the receptionist on the phone also told me that he himself had seen it on his way into the shift,but assumed it was part of the plane from his point of view. sadly he hadn't yet gotten any other reports."],"City":"Lubbock","Object Shape":"Flash","Date of the Event":"04/26/2011 09:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Summary":"Bright Blue Light, About the size of the north star from perspective.","Tags":"City","Latitude":"33.587783","trends":["There have been 18 other sightings in Lubbock","There were no other sightings in Lubbock on or around April 26th 2011"],"Case Number":"28830","map":"<A HREF = \"http://maps.google.com/maps?q=33.587783,+-101.849076(28830)&iwloc=A&hl=en\"> mufon case (28830) map </A>"}