{"Longitude":"-89.31144","Object Features":"Appendage(s)","Source":"MUFON","Case Number":"28843","Disposition":"Unknown","Object Shape":"Circle, Disc","Country":"United States","Log Number":"US-04272011-0015","Tags":"City","trends":["There have been no other sightings in Dyer and Maury City","This sighting has never been favorited."],"Latitude":"35.854315","Region":"Tennessee","Summary":"UFO sighting in Crockett and Gibson County TN","Weather Factors":"Unknown","City":"Dyer and Maury City","divs":["sighting detailshello, i am in the army and would like to report a ufo sighting. it has taken me a while to report this. the only reason i am doing it now is that i am watching a documentary on ufos and it reminded me of what myself and someone else saw. i saw this ufo twice in 2009, in the autumn. it was the day that president bush was speaking at ft campbell, ky and we were driving home. it was in the evening after 9 pm. the sighting lasted perhaps 5 seconds both times, in both dyer, tn, and outside maury city tn. with the sighting in dyer, there was someone with me, that was also a witness. the closest i can describe the craft is that it looked like the outline of the craft in district 9. i only figured this out later when i had seen the movie. the craft passed just above tree level it seemed, and was lighted as such so you could see full detail, with a rather orange lighting that shone from several different areas that iluminated the shape of the underside. there was no sound that i could detect. i told the guys in the office at the time, and have mentioned it to a few people but have never officially reported it until now. you may contact me at *(wit's phone number and email address removed--cms\\sg). i cant imagine that we were the only people that saw this. it really was something. sincerely, **(wit's name deleted -- cms\\sg)."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Date of the Event":"10/15/2009 09:00 UTC","files":["/var/www/straped/mufon/html2text/28843.html.txt","/var/www/straped/mufon/org/28843.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.854315,+-89.31144(28843)&iwloc=A&hl=en\"> mufon case (28843) map </A>","Date Submitted":"04/27/2011 09:41 UTC"}