{"Latitude":"38.450649","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28844.html.txt","/var/www/straped/mufon/org/28844.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.450649,+-78.867066(28844)&iwloc=A&hl=en\"> mufon case (28844) map </A>","Object Shape":"Chevron, Triangle, Other","Longitude":"-78.867066","Disposition":"Insufficient Data","Date Submitted":"04/27/2011 09:42 UTC","Date of the Event":"04/27/2011 09:04 UTC","Tags":"City","Sighting Duration":"00:01:00","Object Features":"Wings","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Case Number":"28844","Region":"Virginia","Country":"United States","trends":["There have been 5 other sightings in Harrisonburg","There were no other sightings in Harrisonburg on or around April 27th 2011"],"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI left work and started driving home on the state highway. There were thunderstorms in the distance, about 5 miles away. I have to take several back roads to get to my house, and so I pulled onto one of those. It was a few minutes past 9PM. As I was driving at about 55mph I noticed a dark object with flashing lights on my left. At first I thought it was a plane, or maybe a helicopter, as I see them flying over fairly often, mostly during the day time. But as I stared at it I realized it was unlike any craft I had ever seen. It had blue, red, and white flashing lights that flashed on a ring around the craft. It was lower to the ground than any plane would fly, and was coming at me at a perpendicular angle. I still thought it was some sort of plane until it turned, very sharply, to parallel the road. As soon as I saw the back of the craft I knew it wasn't a plane. It looked more like some sort of space shuttle. There were three yellow circles on the back of the craft arranged in a triangular fashion, much like the thrusters on the back of a space shuttle. The circles were not that bright and I could still see the white and red lights flashing from the back of the craft. It looked like it had two large wings, but the exact shape was hard to tell because the only source of light (other than the craft) were a flash of lighting or two. At this point I realized just how fast this thing was moving. In the span of less than a minute it was just a pinprick in the distance."],"Log Number":"US-04272011-0016","Summary":"I was driving home from work and looked up to see a strange craft in the sky.","City":"Harrisonburg"}