{"Object Features":"None","Source":"MUFON","Disposition":"Insufficient Data","Region":"Pennsylvania","trends":["There have been 9 other sightings in Shamokin","There were no other sightings in Shamokin on or around April 28th 2011"],"Country":"United States","files":["/var/www/straped/mufon/html2text/28857.html.txt","/var/www/straped/mufon/org/28857.html"],"Summary":"It looked like a small red dot in the sky at first I thought it might be a plane but I then realized it wasn't.","Viewing Distance":"Unknown","Object Shape":"Circle, Fireball, Star-like","Longitude":"-76.553287","City":"Shamokin","Case Number":"28857","Date of the Event":"04/28/2011 10:10 UTC","Date Submitted":"08/04/2011 08:29 UTC","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"40.795245","divs":["Sighting DetailsI was sitting out on my front porch looking up at the clear sky and admiring the stars. I then saw something that seemed out of place. It was a small red dot in the sky. At first glance I thought it must be a plane but as I watched it I knew that it couldn't be. I have seen many planes and many different types of planes in our open air space skies. The path it was taking was very odd and it was moving across the sky at a very high speed. It started from what I believe was the north and moved at an angle up towards the south fallowing Pa rout 61. As it moved across the sky it was getting smaller and smaller. It almost seemed to speed up and then it became very smaller the the stars in the sky and just disapeared. This is not the first time I saw this strange red light in the sky. Back in July of last year me and my husband were sitting on our back porch and it was still daylight when we saw what only can be described as a fire ball in the sky. The strange thing about these two sightings were that not only were the same color and shape but the were both seemed to be movinf north to south on Pa route 61. Both times I witnessed this I was left with a strange feeling. I felt like I saw something out of the ordianry and my heart started beating fast and I got the opposite of a chilled feeling I almost felt like I got hot. I know that is strange to say but that is how I felt after both sightings."],"Weather Factors":"None","Log Number":"US-08042011-0049","Object Flight Path":"Straight-line path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.795245,+-76.553287(28857)&iwloc=A&hl=en\"> mufon case (28857) map </A>"}