{"map":"<A HREF = \"http://maps.google.com/maps?q=30.270293,+-97.738351(28859)&iwloc=A&hl=en\"> mufon case (28859) map </A>","Weather Factors":"Unknown","Case Number":"28859","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around April 28th 2011"],"divs":["Sighting DetailsI left my home on Old Bee Caves Rd. at around 11:35-11:40 a.m. heading southeast on Old Bee Caves when just after a mile from my home I looked up to the sky and saw a very bright white light. I was the only car on the two lane road and continued to look while driving, trying to figure out what it could possibly be because it didn't have any red lights or any other like the kind I always see on airplanes that fly over my apartments to Bergstrom airport. I could not see any body of a plane or helicopter. It looked incredibly like a bright star that was closer than any star has ever been just above me in broard daylight. It shoned so bright that it looked like there were light beams reflecting off it to make it look star shaped. It started to ascend in a vertical incline straight up to the sky, and then just a few seconds later simply disappered in the sky. There were no clouds nearby or any airplanes or helicopters. Shortley thereafter I see a Southwest airplane but only see the normal lights on a plane and can see the whole body of the plane, so I know it couldn't have been a plane. Then a while later as I was on IH35 heading to San Marcos I spot two helicopters flying in the same general vicinity that I believe the star was at when I had spotted early on Old Bee Caves Rd. Then I called my boyfriend who likes to follow UFO sightings to ask him if he thought I might of saw one because he knows more about these things, and he seems to think that was exactly what it was. Upon getting to school and telling some friends they believed it might have been something as well, and everyone thought I should report this little bit of information to you. I also feel that I did see something very unique and important, and feel privileged to have this sighting whatever it may be."],"Object Features":"None, Unknown","Date of the Event":"04/28/2011 11:38 UTC","Country":"United States","Region":"Texas","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/28859.html.txt","/var/www/straped/mufon/org/28859.html"],"City":"Austin","Object Flight Path":"Hovering then path","Summary":"I saw a large bright star out the front windshield of my car up above that ascended at an incline then disappeared in a matter of seconds","Date Submitted":"04/29/2011 04:08 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","Longitude":"-97.738351","Latitude":"30.270293","Tags":"City","Object Shape":"Star-like","Log Number":"US-04292011-0008","Source":"MUFON"}