{"Disposition":"Unresolved","Date Submitted":"04/29/2011 11:46 UTC","Object Shape":"Circle, Star-like, Other","Weather Factors":"Unknown","Latitude":"-37.805187","Date of the Event":"04/29/2011 10:30 UTC","Region":"Victoria","Source":"MUFON","Summary":"Spotted a round object flashing through all colours of spectrum heading west","Object Flight Path":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/28863.html.txt","/var/www/straped/mufon/org/28863.html"],"City":"Melbourne","Viewing Distance":"Unknown","Case Number":"28863","Log Number":"AU-04292011-0012","divs":["sighting details1. at home. helping my wife remove the kids & stuff from car after we got home from visiting (eastern suburbs of melbourne, australia) 2. there were 3 actually. we noticed them because they were brighter than the stars & were flickering red\\green\\yellow 3. a star at first. but then used my slr with 300mm lens to take a closer look 4. one object started in the south-east moved westerly then headed south till it could no longer be seen. the other main object remained in sigth over melbourne's south for over an hour till cloud set in. once the cloud sleared the object could no longer be seen. the third was over melbourn'es north. this was further than the other 2. all 3 had the same characteristics. orb-like in shape & changing in color from red to green to yellow & through the whole colour spectrum. only one seemed to move from south east to west then to east. the others were somewhat static. i did however capture one of them move between 2 fames on the still camera. 5. excited. i'm a ufo enthusiast & actually spotted one of these 2 nights before. the one 2 nights before was much closer however i didn't have my tripod so the night shots showed a staggering coloured object rather than the white object shown when the camera was still. 6. i lost sight of the first one when it went so far south that i couldn't see it. i lost view of the other 2 when cloud cover set in. the objects were not visible once the clouds moved on. i have pics of both events & video footage of 29\\april\\2011. the video attached is a small sample. i have 10mins in total."],"trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around April 29th 2011","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Sighting Duration":"01:30:00","Longitude":"144.9727","Country":"Australia","map":"<A HREF = \"http://maps.google.com/maps?q=-37.805187,+144.9727(28863)&iwloc=A&hl=en\"> mufon case (28863) map </A>"}