{"Object Shape":"Star-like","Log Number":"US-04302011-0002","Date Submitted":"04/30/2011 12:17 UTC","Object Features":"Unknown","Summary":"4 Objects Flying South Towards Morgan Hill","Date of the Event":"04/29/2011 08:50 UTC","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","trends":["There have been 106 other sightings in San Jose","There were 2 other sightings in San Jose on or around April 29th 2011"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.348186,+-121.891536(28865)&iwloc=A&hl=en\"> mufon case (28865) map </A>","Tags":"City","Country":"United States","Latitude":"37.348186","files":["/var/www/straped/mufon/html2text/28865.html.txt","/var/www/straped/mufon/org/28865.html"],"Sighting Duration":"Undisclosed","divs":["sighting detailsi was out on my patio star-gazing as usual, and in the distance i can see planes coming into san jose mineta airport. as i watched the planes coming in, i noticed that behind them in the distance i could see this brilliantly bright light appear out of no where. it was about the size of 1\\2 a pencil eraser and appeared to be hovering over the east side (alum rock area). for about 5 minutes, it just hovered, then it slowly started drifting south. then, all of a sudden, two more showed up and their lights appeared out of no where! (kinda like if you were standing in a dark room, and someone turned on a flashlight facing you.) these two didn't hover though. they automatically started moving towards the south following the first one. out of these three, the first one was super bright. the other two were bright, but not as much. i watched them slowly disappear as they moved towards coyote valley and morgan hill. when they were almost completely out of sight, a fourth one appeared from the same spot the other three came from. only, this one started moving slowly towards the north as if it was going up towards fremont. there is no way these were airplanes, or helicopters. they were too bright, had solid white light illuminating with no flashing lights (as per faa regulations), and from my point anyway, there was no sound. these were exactly what i saw about a month or so ago over the cupertino quarry. i wanted to look at them with my telescope, but it is broken and is going to be repaired tomorrow. ever since my experience in dec 2010, i have been calling them my \"friends\", and have hoped to get another good look someday. maybe my chance is coming back soon!"],"Source":"MUFON","Region":"California","City":"San Jose","Disposition":"Unknown","Case Number":"28865","Longitude":"-121.891536"}