{"Tags":"City","Object Features":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"00:20:00","Date Submitted":"04/29/2011 10:20 UTC","Country":"United States","Object Shape":"Circle, Disc, Flash, Star-like","Region":"Florida","trends":["There have been 9 other sightings in Plant City","There were no other sightings in Plant City on or around April 29th 2011"],"Longitude":"-82.111824","Date of the Event":"04/29/2011 09:15 UTC","divs":["Sighting Details Approximately within the time frame of 9:00 P.M. to 9:20 P.M. Eastern Standard time, USA, the night sky's as scene from Plant City, Florida, where very active with fast and slow traveling circular lights moving erratically about the Western sky's. Up to 4 of these UFO's or the same one, was scene a few minutes apart fading in and out, from the sighting of the last one, and moving various directions. There or it's elevation was guessed to be just inside the Earths Atmosphere between were Jet planes fly and satellites orbit. There where no fire trails. Also at 9:15 PM from the same view point, looking straight up in the sky from my location, was scene some type of EXPLOSION IN SPACE. The circular flash like explosion was bright white and from start to fade away lasted three seconds. Guesses were made that it may have been a UFO or a distant sun going Super Nova, but it was ruled out that it was a meteor due to no fire trail and obvious difference. The size of the explosion in a comparison from the view point, would have been similar to a quarter the size of the Moon. A science fiction writer could guess that there was some type of space battle going on. I personally being a studier of all subjects for over 35 years and being level headed, well I could probably say with almost certainty the same thing."],"City":"Plant City","Weather Factors":"Windy","Object Flight Path":"Path with directional change","Log Number":"US-04292011-0009","Latitude":"28.022312","Summary":"Florida skys very active with UFO active in the West & directly above","Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.022312,+-82.111824(28860)&iwloc=A&hl=en\"> mufon case (28860) map </A>","files":["/var/www/straped/mufon/html2text/28860.html.txt","/var/www/straped/mufon/org/28860.html"],"Case Number":"28860"}