{"Sighting Duration":"05:00:00","Viewing Distance":"20 Feet or Less","Disposition":"Insufficient Data","Date of the Event":"08/26/2006 08:37 UTC","Tags":"City","Country":"United States","Date Submitted":"04/30/2011 12:07 UTC","files":["/var/www/straped/mufon/html2text/28864.html.txt","/var/www/straped/mufon/org/28864.html"],"Summary":"5 meters across, black metal disc, red circular lights on its underside","Object Shape":"Disc","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around August 26th 2006"],"Log Number":"US-04302011-0001","Source":"MUFON","Weather Factors":"Unknown","Case Number":"28864","map":"<A HREF = \"http://maps.google.com/maps?q=33.686367,+-117.792854(28864)&iwloc=A&hl=en\"> mufon case (28864) map </A>","Longitude":"-117.792854","Latitude":"33.686367","Object Features":"Other","Region":"California","divs":["Sighting DetailsI was walking home from the grocery store, approximately August 26, 2006 at around 8:37pm, in Irvine on Culver near the freeway. I lit up a cigarette while I was standing on the driveway of the house I was living at. I turned to look at the garage and saw a black metal disc with circular lights on its underside about 5 meters across hovering over it. It hovered forward and backward over the roof then it was gone. It was about 5 meters from where I was standing. I ran into the backyard, which was how I had access to my room, and was trying to locate it but it was gone. I was shocked and felt special because I love the UFO mystery and I actually saw a solid one. The story does not end there... That night, we usually kept the sliding glass door open with the screen shut, I was abducted by six beings who looked like black shadows. I remember the moment when they had me half-way out of the sliding door. I told them, as they were carrying me horizontally, \"I don't want to go, I don't want to go!\". At that moment I saw a fantastic light show outside. it looked like a larger ship. What they did next was they applied pressure with some sort of tool on the top rear of my head. I felt a \"peircing\" pain and I was out, I fell asleep, only to wake up the next morning, which felt like no time had gone by at all. I want to find out what happened that night. I always thought after that moment that I was special to them and they gave me a gift."],"Object Flight Path":"Hovering then path","City":"Irvine"}