{"Latitude":"30.340074","map":"<A HREF = \"http://maps.google.com/maps?q=30.340074,+-81.649811(28861)&iwloc=A&hl=en\"> mufon case (28861) map </A>","Sighting Duration":"Undisclosed","Region":"Florida","Weather Factors":"Unknown","Date Submitted":"04/29/2011 11:25 UTC","Tags":"City","Object Features":"Undisclosed","Case Number":"28861","Date of the Event":"04/29/2011 10:15 UTC","Disposition":"IFO","Summary":"Green fire ball falling toward the west followed by a pastel colored bubble ship appearing toward the south.","Country":"United States","Source":"MUFON","Longitude":"-81.649811","City":"Jacksonville","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/28861.html.txt","/var/www/straped/mufon/org/28861.html"],"Object Shape":"Fireball, Flash, Sphere, Other","Log Number":"US-04292011-0010","divs":["sighting detailsi was out jogging threw my neighborhood at about 10:05 on 4\\29\\2011 here in jax fl u.s.a. i was jogging toward the north when in the corner of my eye i saw a green flash in the sky , i stopped to watch as my first instinct was that it might be a passenger jet with a serious problem. for about 5 seconds i watched a green fireball fall down to the earth ,this was toward the west. the event only lasted about 5 seconds before it disappeared in a bright flash. after seeing the first event i then turned around now heading south in a hurry to get my family outside in case there was more to see. i then noticed a pastel colored object that resembled a symmetrical gathering of light bubbles. i then watched this for about 15 seconds before it disappeared. a few things to note , we get a lot of air traffic here where i live and i am very use to seeing aircraft of all types as i go walking at night often. this includes shooting stars as well. also early on about 2 minutes or so before i viewed the fireball i noticed a group of lights which resembled a plan heading south that performed a sharp u-turn to the north\\west. it seemed to sharp a turn for your average passenger plane."],"trends":["There have been 66 other sightings in Jacksonville","There was one other sighting in Jacksonville on or around April 29th 2011"],"Object Flight Path":"Other"}