{"Sighting Duration":"00:00:05","Disposition":"Unknown","Latitude":"39.515597","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.515597,+-84.743691(28866)&iwloc=A&hl=en\"> mufon case (28866) map </A>","Case Number":"28866","divs":["Sighting DetailsWhile returning home from Oxford, OH to Liberty, IN on Bath Rd. in Franklin Cty., IN, I was looking off to the right towards Liberty. I had been watching contrails from aircraft in a clear blue sky, which we had not seen in nearly a month. The terrain is farmland with a few copses of trees and one can see the cell tower in Liberty, on US 27. While looking out towards that area, suddenly there were several teardrop flashes just above the trees in a straightline trajectory moving from west to east, towards Oxford. There were approximately five of them and to describe it, they moved so fast it was almost incomprehensible. Just as I remarked to my husband, they were gone. It was NOT the cell tower, but looked like the strobes at an airport. There is an airport belonging to Miami University, however, it was to the left and about 5 miles behind us. Further, they do not have those type of strobes. These were silver blue teardrop shapes. Really hard to describe, though. No, I did not think it a tower. I am on that road virtually everyday and know every nook and cranny of it. It looked like the strobes on a runway and very much like an LED light. To describe what I felt? Freaked out. Gave me a creepy feeling. It or they, seemed to have just disappeared behind us into the sky. It was still light out, too."],"files":["/var/www/straped/mufon/html2text/28866.html.txt","/var/www/straped/mufon/org/28866.html"],"Country":"United States","Date Submitted":"04/30/2011 12:24 UTC","Weather Factors":"None","City":"Oxford","Date of the Event":"04/29/2011 08:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Teardrop","Summary":"low flying flashes","Object Flight Path":"Straight-line path","Longitude":"-84.743691","Log Number":"US-04302011-0003","trends":["There have been no other sightings in Oxford","This sighting has never been favorited."],"Region":"Indiana","Object Features":"Undisclosed","Tags":"City"}