{"Object Flight Path":"Straight-line path","Latitude":"-37.807767","Summary":"Dual star like object","Object Shape":"Star-like","Date of the Event":"04/26/2011 06:40 UTC","Object Features":"None","Log Number":"AU-04302011-0006","Weather Factors":"Unknown","Region":"Victoria","Case Number":"28869","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around April 26th 2011"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-37.807767,+144.96616(28869)&iwloc=A&hl=en\"> mufon case (28869) map </A>","Longitude":"144.96616","Tags":"City","Sighting Duration":"Undisclosed","divs":["sighting details26\\04\\2011 just after dark i went out for my routine cigarette and as a ufo enthesiest take the opportunity to look to the stars. mulling on the daily problems initialy i didnt look up but when i did i noticed 2 x star like objects but looked to be seperated by a very small margin, probably less than half the size of the object seperated them, they were extremely close together. when i first noticed the objects i tried several times to refocus my eyes because i thought it was an illusion of the light at distance, my sight is very good so i am left certain that there were two objects or it was 1 object somehow joined as it maintained the seperation for the duration and seemed to be moving as one. i am in the eastern suburbs of melbourne and when i looked up the object was almost directly above but slightly to the east. the object\\s were moving apx from south to north direction and was visible to me for apx 10 secs as it was fading as it moved away. it covered a significant distance and was moving quickly for the distance it was at. the object\\s were a burnt orange colour, they were solid in intensity, no chemtrail or aura. it was a considerable distance and hard to estimate though it did look to be in our atmosphere and mabee moving out of it as it faded away."],"Country":"Australia","files":["/var/www/straped/mufon/html2text/28869.html.txt","/var/www/straped/mufon/org/28869.html"],"City":"Melbourne","Disposition":"Unresolved","Date Submitted":"04/30/2011 03:53 UTC","Viewing Distance":"Unknown"}