{"Date Submitted":"04/30/2011 05:53 UTC","Summary":"2 sets of two lights that shot out a fast blinking light that quickly faded.","Date of the Event":"01/10/2011 08:30 UTC","Latitude":"42.46219","Case Number":"28870","Sighting Duration":"Undisclosed","Region":"Michigan","trends":["There have been 2 other sightings in Otsego","There were no other sightings in Otsego on or around January 10th 2011"],"Log Number":"US-04302011-0007","Object Shape":"Bullet, Missile, Fireball, Star-like, Other","Longitude":"-85.694026","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.46219,+-85.694026(28870)&iwloc=A&hl=en\"> mufon case (28870) map </A>","divs":["Sighting DetailsI was snowboarding at Bittersweet in Otsego, Mi and at the top of the hill I noticed that there were two large lights in the distance. I sat and watched them for a moment, and as I watched I noticed two other glowing lights a bit away, either smaller or further away. I sat for about a half hour and then watched as they both faded in and out periodically. Not in any sort of pattern, but randomly. I've seen UFO's numerous times before and it's something I have a lot of interest in, so I wasn't afraid. Just curious. I watched the trees bordering the horizon to see if it was a stationary object then and neither set of lights were. The bigger two appeared to drift lazily and slowly upward and to the left. The smaller ones then disappeared and after the bigger ones had faded out for some time I decided to go down the hill. After going down the hill a few times I noticed that the larger set of lights were back. The smaller were still nowhere to be seen. I went back up the hill and sat down again, this time calling a few friends over to ask if they seen it too. They said they did and sat and watched with me. Within 10 minutes of us sitting there that time we all yelled out as the smaller set suddenly reappeared and shot out a very fast blinking light towards to other. The fast, and rapidly blinking light went past the other set of lights, circled back around very quickly and then disappeared very suddenly. Both sets of lights disappeared after that and did not reappear while I was there. Two weeks later I was back snowboarding again and again, I seen two bright lights in the distance in the same general direction but more to the right than they were before. They again faded periodically and drifted about lazily. Again, my friends witnessed the same thing. This time it reappeared and disappeared over and over whilst we were there. Eventually we grew tired of it and as we had no way to record it and no explanation we started snowboarding again. I kept an eye on the area throughout the night and it just kept repeating the same behavior while reappearing in different areas. My sister, the next week showed me a video she had recorded of a very similar object. The video isn't great, but it's pretty much the same thing I saw, but not as bright or as close. I believe she's already reported it here, somewhere. I have not seen any more strange lights when I've gone back there."],"Tags":"City","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/28870.html.txt","/var/www/straped/mufon/org/28870.html"],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","City":"Otsego","Disposition":"Unknown"}