{"Disposition":"Unresolved","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28887.html.txt","/var/www/straped/mufon/more/28887_submitter_file1__SomethingflyinginEngland.png","/var/www/straped/mufon/more/28887_submitter_file2__Gotowww.bbc.co.uknewsuk-13200114andzoomin.png","/var/www/straped/mufon/org/28887.html"],"Viewing Distance":"Unknown","Longitude":"-0.118805","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around April 4th 2011","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Latitude":"51.510279","Object Shape":"Disc","divs":["sighting detailsviewing this photograph found at: *(link moved to additional evidence section--cms\\sg) my attention was drawn to some people in the crowd. their attention should have been drawn to the prince william and the duchess of cambridge but some seem to be taking photos\\filming obviously away and up from the location of the prince and duchess. not a normal behavior considering the event and the proximity of the carriages to these people. what are they witnessing? wedding crashers?? zoom in to where the prince is at, then scan to the right area and look at the crowd. many aren't looking in the direction of the prince and duchess but obviously something else has their attention and their gaze had me searching above the tree line and i saw an anomalie and looking further found 2 more anomalies. the darker of the three seem disc shape but it could well be a fighter type plane on an angle, however, the problem i have with the plane is i doubt any would be permitted to fly during the horse drawn carriages, especially not a jet engine. given the distance, could they be birds? it seems unlikely to me but perhaps not impossible? in need of further investigation! film footage analysis of this time frame and hopefully able to come to a definate conclusion on what these are by the mufon investigators; hence my post. someone actually expected ufos to be present at the wedding, if they are ufos, perhaps they were not unexpected guests afterall according to this: **(link moved to additional evidence section--cms\\sg)."],"Date Submitted":"05/01/2011 03:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.510279,+-0.118805(28887)&iwloc=A&hl=en\"> mufon case (28887) map </A>","City":"London","Case Number":"28887","Region":"England","Country":"United Kingdom","Source":"MUFON","Log Number":"GB-05012011-0005","Date of the Event":"04/04/2011 12:00 UTC","Summary":"UFOs, Royal Wedding Crashers!? BBC NEWS HD PHOTOGRAPH *(Link moved to Additional Evidence Section--CMS/sg)."}