{"Longitude":"-105.265836","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around April 28th 2011"],"Region":"Colorado","Tags":"City","Summary":"Orange light twinkling due South. maybe45 degrees from the horizon. two to three times brighter than the brightest star. Phased in and out several times before it disappeared entirely.","Date Submitted":"05/01/2011 12:42 UTC","Log Number":"US-05012011-0001","divs":["Sighting DetailsI was taking the dog out for the last time for the night. We were on the side of my apartment building. I was only outside for maybe five or ten minutes. I noticed it at first because it was very bright in the sky even though some front porn lights were in my eyes. At first, I thought it was a planet, but it was too bright. It stayed in the same position the whole time I observed it. First, the light was steady, then it started to twinkled like a star, then it got brighter. It was yellow-orange in color. Then it seemed to \"phase\" in and out, not like a twinkle, more the whole image came and went. Then it got bright for the last time and disappeared. The whole thing lasted three minutes at the most. I kept my gaze in that direction the whole time. I did not, however, see it appear to begin with, so I don't know how long it was there before I got there. How did I feel? I was in awe. And a bit shocked. I don't know of anything that could do that. Certainly wasn't an airplane or a satellite, couldn't be a star or a planet, so what could it be?"],"City":"Boulder","Object Shape":"Star-like","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Object Features":"Unknown","Date of the Event":"04/28/2011 11:05 UTC","Weather Factors":"None","Country":"United States","Latitude":"40.023056","map":"<A HREF = \"http://maps.google.com/maps?q=40.023056,+-105.265836(28883)&iwloc=A&hl=en\"> mufon case (28883) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28883.html.txt","/var/www/straped/mufon/org/28883.html"],"Case Number":"28883"}