{"Case Number":"2888","Object Features":"Undisclosed","Region":"Indiana","Longitude":"-87.377792","Disposition":"Unresolved","Date of the Event":"10/12/1987 11:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.276436,+-87.377792(2888)&iwloc=A&hl=en\"> mufon case (2888) map </A>","Weather Factors":"Rain","Latitude":"38.276436","Source":"MUFON","City":"Somerville","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Somerville","This sighting has been favorited 2 times."],"Object Shape":"Undisclosed","Country":"United States","divs":["Sighting DetailsOn October 12, 1987, at my fiances house in Somerville, IN, at approximately11:45 p.m., my fiance Darren and I were in bed, in the middle of intercourse, when we both apparently blacked out at the exact same time. The following morning, we were awakened by my mother, who was knocking on the screen door. It was raining outside, and the main entry door was unlocked and wide open. The lights inside the house were all on. We had locked the doors and shut off all of the lights before going to bed the night before. My mother said she heard metal clanging sounds when she came to the door. We had new stove pipe lying on the living room floor, as we were preparing to install a new furnace. She also heard what sounded to her like an old man coughing in a deep tone. When we finally came to, we were both naked and lying in two different directions on the bed. Both of us had tremendous headaches and a feeling that something strange had happened to us, but did not talk about it. For the next two days, when we each tried to think about what had happened, our minds couldn't focus on the event. After some time had passed, we both realized that we could both remember right up to the exact moment that we both blacked out it had happened right in the middle of sex, and we had blacked out at the EXACT same time. Two months later, I found out I was pregnant, and would have conceived at around this same date. Also, I was on birth control pills at the time. A few months later, in Feb. 1988, we were asleep when I was awakened at 2:48 am, by a small, gray, wrinkled-looking being. He had large eyes, no nose, and just a slit where his mouth should've been. He was standing about four feet from the bed, just staring at me. He had a solid, dark-colored outfit on - it looked like a one-piece jumpsuit. I tried to wake Darren, but was unable to move. I tried to scream for him, but was only able to make a wimpering sound. At that time, Darren rolled over towards me, and the being just faded out of existence. I told Darren what I had seen, and we finally got back to sleep. At exactly 4:48am 2 hours later, I was again awakened by the same small, gray being. I laid there looking at him for probably 3-4 minutes"],"Log Number":"","Date Submitted":"10/12/1987 11:45 UTC","Tags":"City","Summary":"SAW GRAY WRINKLED BEING","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/2888.html.txt","/var/www/straped/mufon/org/2888.html"]}