{"Log Number":"US-05012011-0011","Longitude":"-97.213909","Case Number":"28893","Region":"Kansas","Viewing Distance":"Unknown","Date Submitted":"05/01/2011 03:26 UTC","files":["/var/www/straped/mufon/html2text/28893.html.txt","/var/www/straped/mufon/org/28893.html"],"Tags":"City","Disposition":"Unknown","Object Features":"Unknown","Source":"MUFON","Object Shape":"Circle, Sphere","Country":"United States","Date of the Event":"04/30/2011 09:31 UTC","divs":["Sighting DetailsI was parking the car in front of a friend's house when she pointed to the sky and said \"Hey, look at those lights.\" I looked where she was pointing and saw a group of red non-blinking lights flying towards the southeast. The initial group had approximately 8-12 lights. They were flying in formation maintaining a constant altitude and were equidistant from each other. They were in a triangular relationship to each other as well. We tried to shoot footage with our cell phones but nothing was showing up on the screen other than the streetlights, etc. We got out of the car and continued watching more lights coming into view. Is was smaller numbers after the first group containing anywhere from 2-6 lights. I called a friend in the same town at 9:32 PM and told her to look at the sky in the east and she saw the same lights. She alerted her neighbors and they saw the lights as well. We continued watching more going by all on the same flight path. There was no sound whatsoever. They were moving too slowly to be planes. I am not sure how we lost sight of the objects. We just kept getting excited and watching the new ones. It seemed that with the last group they just flew to far to see. I still have the video on my phone and might try to lighten the exposure to see if there is anything visible."],"Object Flight Path":"Straight-line path","City":"Abilene","trends":["There have been no other sightings in Abilene","This sighting has never been favorited."],"Weather Factors":"Unknown","Latitude":"38.917222","map":"<A HREF = \"http://maps.google.com/maps?q=38.917222,+-97.213909(28893)&iwloc=A&hl=en\"> mufon case (28893) map </A>","Sighting Duration":"Undisclosed","Summary":"ABILENE"}