{"Longitude":"-123.58538","Case Number":"28896","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Flight Path":"Straight-line path","Date Submitted":"05/01/2011 09:55 UTC","Latitude":"44.030677","Disposition":"Unknown","Region":"Oregon","Date of the Event":"02/14/2011 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.030677,+-123.58538(28896)&iwloc=A&hl=en\"> mufon case (28896) map </A>","Object Shape":"Triangle","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn February 14th I left my daughter,s house at around 4:35 am to go home to Coos Bay, Oregon. I had chosen to spend the night so that I would not have to drive on route 26 in the dark. Its very curvy and I hate driving at night. Thinking that by the time I got to Veneta it would be starting to get light out. Route 26 from Veneta to Mapleton is also a 'dead zone' for cell phones. By the time I got to Veneta it was very dark out with patchy clouds. I continued toward Noti and it wasn't getting light at all. There was no traffic at all at this time and it was very quiet. I hate driving at night and found that I was driving at 40 to 40 mph hour as it was very dark. I remember entering Walton and pulling over at the Walton Store to let a log truck pass. Only to find out that within 100 feet he turned right onto Nelson Mtn Rd. I looked at my car clock and saw that it was 5:30 am. I thought to myself that I bet everyone in Walton has been abducted at least twice and laughed. I drove for about a couple of minutes when for some reason looked left and saw a large black triangle with 3 white lights on each end. I've seen triangles before but this one in addition to the 3 white lights there was an extra red light several feet ahead of the lead white light on the triangle. I didn't stop as it was still dark and I didn't know of any place to pull over. This triangle followed along beside me at the same speed making no noise at all. It was traveling above pastured areas several feet from the road and homes. I remember thinking that I couldn't believe that it was so close to me and close to homes along the road. The only place I thought to pull over was in someone's driveway which would be awkward and not knowing what it was or what it wanted continued driving. I had to be at work in Coos Bay by 7:30 am. Considering I was driving about 40 mph through Walton the triangle followed along with me for about 5 minutes. I thought to myself that I would love to chat but I had to hurry home. At that moment the triangle's back two lights started to glow very brightly. I got a little worried. The triangle started to slowly rise in the sky as I continued driving. The triangle got to a certain height then banked slightly to the left into a canyon when the red light at the end turned on and lit up an entire canyon in a bright white light. It was so bright I was actually scared for a moment as I have never seen anything that powerful. The triangle then slowly entered the canyon with that blinding light. I continued on my way as it started to downpour. I did not pass any cars or see anyone on the road. It rained all the way to Mapleton where no one was there. I pulled over and called my daughter in Eugene as I knew I had cell service now. I was so shook up that she thought at first I had hit someone. I continued to Florence where I stopped in Safeway and actually saw people! Two days later I saw two black ops helicopters at the airport as I work near there. Considering this isn't the first time I've seen a triangle I can only wonder why they don't seem to be to bothered by me seeing them and this concerns me. I now carry a camera and binoculars in my car for the next time."],"Log Number":"US-05012011-0014","Summary":"Triangle followed along side my car on route 26","trends":["There have been no other sightings in Walton","This sighting has never been favorited."],"Object Features":"Unknown","Weather Factors":"Unknown","City":"Walton","Country":"United States","files":["/var/www/straped/mufon/html2text/28896.html.txt","/var/www/straped/mufon/org/28896.html"],"Source":"MUFON"}