{"Object Shape":"Circle, Disc","Region":"Ontario","Log Number":"CA-05012011-0010","Date of the Event":"06/01/1990 05:00 UTC","Object Flight Path":"Stationary,Hovering then path","Sighting Duration":"Undisclosed","Latitude":"42.981708","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.981708,+-81.237098(28892)&iwloc=A&hl=en\"> mufon case (28892) map </A>","Viewing Distance":"20 Feet or Less","Disposition":"Unresolved","Country":"Canada","Source":"MUFON","Case Number":"28892","City":"London","divs":["Sighting DetailsI am writing about an event that I can remember parts of but I think nobody else remembers or M.I.B paid a visit and said not to remember. I think I was around 12 years old and was visiting my grandparents in the summer on a Sunday..... I still live in the area where it took place too so the memory of what I can remember is clear. We were sitting around talking and suddenly I remember hearing a sonic boom, at the time (1990) nobody knew what a sonic boom was so we all ran outside to see a U.F.O hovering over a building across the street, my friend and I were told to stay inside but ran out anyway. The next thing I remember was my friend was gone already and I was being lifted off the ground and taken into the craft at that time I grabbed a branch and was holding on to prevent being taken, I remember looking down and seeing my grandmother with a knife or something trying to rescue me and then the cops and fire showed up and I was just out of reach.... The next thing I remember is standing next to my friend and we were both naked looking out a big window and next to us was a gray big eye alien as described on T.V. by hundreds of people. They used telepathic communication to tell me that I was a special person and their intent seemed to be that of piece and we were looking down at the earth as they said this. The next thing I only just now remembered is that they may have put a long needle in my head just under my nose above my lip deep into my head but not sure as memories keep coming up over the years. After that I remember being on the ground again and hearing another sonic boom to turn around and see 3 lights far off in the distance, in the shape of a triangle, red green and blue. We ran into the house and at the time only remembered hearing the first sonic boom running out and looking up after hearing the second and when we ran back in my family said we were gone a long time (a few hours) and they had to call the police. I never saw the police after I came back in the house but later I do remember them being there during the event. I asked my family about it years later and they just look away or say they don't remember but it seems like they may not be telling me the truth.... years later I was in my 20's and this is a little bit funny but true, I was in bed and had just bought a cardboard standie that day at a collectors shop and it was Nelix on Star Trek Voyager...... that night as I slept I woke up scared and frozen, my arms felt like I had handcuffs on and my legs were also feeling that way but I could not see anything and could not move.... I was on my side in the fetal position and facing the wall, I turned my head just enough that I could see behind me out of the corner of my eye and I could see the standie almost in the middle of the room but moving near me and as it got closer it would stop and a gray big eye head would pop out from behind it as if to see how close it was and when it was right near me the next thing I remember it was morning again. I know this sounds like a Bugs Bunny cartoon with someone sneaking up to someone else with a fake bush or whatever but it's true as I remember it. One more thing.... as some people have burn marks or evidence of some sort I as well have something that I think may have been a result of visiting them. I now have physic powers they may have made me physic... no bullshit, I have dreams that later come true, I also found some videos online about remote viewing and can do that well. I have also made predictions and have seen things in my mind that I think may be going on at area 51. I need help from someone who will not think I am crazy I am ready to tell my story. I wrote to you before about 5 boys who each have 5 fathers on a desert road and sent you a generated picture of what I once saw. This is the tip of the iceberg, you can contact me for more info...... if you want to."],"files":["/var/www/straped/mufon/html2text/28892.html.txt","/var/www/straped/mufon/org/28892.html"],"Summary":"U.F.O hovering above house and abduction","trends":["There have been 32 other sightings in London","There were no other sightings in London on or around June 1st 1990"],"Tags":"City","Longitude":"-81.237098","Object Features":"Window(s)","Date Submitted":"05/01/2011 12:56 UTC"}