{"Object Shape":"Circle, Sphere","trends":["There have been 3 other sightings in Cherryville","There were no other sightings in Cherryville on or around November 30th 2002"],"Case Number":"28894","map":"<A HREF = \"http://maps.google.com/maps?q=35.378744,+-81.378974(28894)&iwloc=A&hl=en\"> mufon case (28894) map </A>","Date of the Event":"11/30/2002 12:00 UTC","files":["/var/www/straped/mufon/html2text/28894.html.txt","/var/www/straped/mufon/org/28894.html"],"Country":"United States","divs":["sighting detailsi was sitting on my porch around 10:10 pm on 4\\1\\2011 when i was looking up and saw a bright orange red object moving at a very rapid rate of speed coming over the trees toward my house. at first i thought it was a falling star but quickly realized it was something else. i got up and witnessed this object travel toward me and then a light flashed on the object and it dimmed and i could see a solid object against the bright night sky with no sound what so ever and i watched it until it dissapeared from view about 10 to 15 seconds. my mind was racing at what i had just seen and i sat down and looked up and saw two more coming in the same direction toward me and they were traveling one behind the other at the same rate of speed as before, they were the same shape and color as the one before. i ran down in the yard and watched them dim and again i could see the solid round ojects in the sky. i watched them travel away from me heading toward the ocean until they went out of view. i made a point to listen very intensely and they made not a whisper of sound. when i am outside, i am looking up at the sky. i have seen many amazing shooting stars, satalites traveling across the sky but in all my fifty one years i have never seen anything like this before. my heart was racing and i called every member of my family and told them. i called the police and sheriff deptarments and reported the sightings. my neighbor was walking his dog at the time and saw two of the objects as well. we discussed them in detail the next day. they sky was clear and brightly lit with stars. no moon was in the sky. the objects traveled almost between orion and the big dipper heading northeast in direction."],"Date Submitted":"05/01/2011 04:23 UTC","Summary":"Three orange-red UFO's traveled over my home in SC.","Log Number":"US-05012011-0012","Source":"MUFON","Tags":"City","Disposition":"IFO","Object Features":"None","City":"Cherryville","Region":"North Carolina","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Longitude":"-81.378974","Latitude":"35.378744","Weather Factors":"None"}