{"Disposition":"Unknown","Latitude":"29.420076","Log Number":"","divs":["Sighting DetailsMy daughter and I were leaving the pre-investiture celebration for the newBishop Coajutor for the Dioceses of West Texas when we noticed a very brightstar low on the horizon. Upon closer inspection the object appeared to havelights and was circular in shape. The object stayed still and we check to seeif it was a light on a large crane or on top of a building, it was not. Wedecided to find some witnesses to the event and went back towards SunsetStation. We had to walk behind a two story building to get to where the peoplewere and when we came out from behind the building it was gone. We then walkedback towards our car, our original destination, and the object seemed to comeout from a cloud and was in the same spot it originally was. We continued tolook at the object for about a minute, and then it disappeared into the cloud. Then proceeded down 281 north to get some dinner, when we came to the QuarryMall, in Olmos Basin, we looked to the west and say the same object again, justhovering. We then became concerned and exited to Loop 410 and proceeded toBetos Comida Latina restaurant and tolled the night manager, who is anaquaintance what were had seen. When we went home we tried not to look in thesky, because we didnt want to see the object again."],"Country":"United States","Source":"MUFON","Region":"Texas","Viewing Distance":"Over One Mile","Case Number":"2889","City":"Bexar","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.420076,+-98.572102(2889)&iwloc=A&hl=en\"> mufon case (2889) map </A>","trends":["There have been no other sightings in Bexar","This sighting has never been favorited."],"Object Features":"Other","Object Shape":"Disc","Weather Factors":"Unknown","Date of the Event":"02/20/2003 08:30 UTC","Longitude":"-98.572102","Object Flight Path":"Stationary","Sighting Duration":"00:00:00","Date Submitted":"02/20/2003 08:30 UTC","Summary":"Sighting in San Antonio, Texas","files":["/var/www/straped/mufon/html2text/2889.html.txt","/var/www/straped/mufon/org/2889.html"]}