{"City":"West Palm Beach","Log Number":"US-05022011-0004","Sighting Duration":"Undisclosed","Region":"Florida","Case Number":"28904","Viewing Distance":"Unknown","Country":"United States","Object Features":"Unknown","Source":"MUFON","Date Submitted":"05/02/2011 01:48 UTC","Summary":"fast flashes changing alt and dirrection","files":["/var/www/straped/mufon/html2text/28904.html.txt","/var/www/straped/mufon/org/28904.html"],"Weather Factors":"Unknown","divs":["Sighting Details I was out with a friend at some property his family owns about 1.5 miles west of the race track on beeline, i believe its considered martin county i could be wrong. it had to have been about 11-12 pm or so based on a picture i took well prior to it and a text i sent soon after.It was a clear clear night, i was facing east my friend west as we spoke about the planed morning hunt when i bursted out with \"you just missed a shooting star\", he turns and again the light flashes across the sky heading south, he replied, \"wow another one\".i was stunned. for a second i thought metior shower but no, not at all. Its so hard to explain, im facing east, the flash was in my vision about 65-70 degrees in my line of sight and could not have been higher than 10 thousand feet and vanishes, a split second later as my friend turns it flashes again this time about 10 degrees lower in my sight and vanishes, and again still heading south with each flash covering vast sectiions of sky it flashes again this time about 10degrees above my initial 65-70 degrees. this is all happening in flashes of a bright white light a second or less apart, my friend claims he cought a orange glow to it but i cant confirm. by now it had traveled south far just above the tree line.it then flashes west a short distance then east then west again each time about 10 degrees in my line of sight and every time the same distance and it was gone. Minutes later maybe 15 or so i seen it again this time far east if i had to guess i would say either close or past our shore. far enough to be low in the horizon.This time i only seen two flashes of light, the first heading south the second north about half the distance it travelled south also at a higher altitude and gone again without a trace.My friend was answering natures call, either way it happened so fast by the time i said \"there it is again\" it was over. its important you know i am a aircraft mechanic and love aviation while i cant name every aircraft i know a plane from anything else. I heard zero sound, zero sound at that altitude from something moving that fast changing dirrection so radically. in between flashes of light it was out of sight each time for a split second and re-appear above or below its previous path. i cant explain it much better and before i confuse my self thinking about it i wanted to write it down and hear opinion and comments. I know what i seen and glad i wasnt alone because i wouldnt believe it if i heard it."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=26.720332,+-80.045535(28904)&iwloc=A&hl=en\"> mufon case (28904) map </A>","Object Shape":"Flash","Date of the Event":"04/29/2011 12:00 UTC","Object Flight Path":"Path with directional change","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around April 29th 2011"],"Longitude":"-80.045535","Latitude":"26.720332","Disposition":"Insufficient Data"}