{"Date of the Event":"05/02/2011 09:44 UTC","Object Features":"Unknown","Case Number":"28901","Country":"United States","City":"Cheboygan","Weather Factors":"Unknown","Tags":"City","Disposition":"Unknown","Log Number":"US-05022011-0001","files":["/var/www/straped/mufon/html2text/28901.html.txt","/var/www/straped/mufon/org/28901.html"],"trends":["There have been no other sightings in Cheboygan","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.646956,+-84.47448(28901)&iwloc=A&hl=en\"> mufon case (28901) map </A>","divs":["Sighting DetailsI was sitting in my truck talking on my cellphone to my girl friend when i looked out to my left and noticed an extremly bright light coming from the woods, then i realized after watching for a few seconds that it was airborne and was moving toward my position. The light flew quickly thru the trees for a few seconds before nearly instantly flying above my truck, at which point i got out of my truck and ran inside terrified before i went all the way inside i poked my head out of the garage again and it had moved behind my house and switch the direction in which it was moving 90 degrees. then i proceeded to run inside my house and get my mom to come outside, by the time we walked outside it had moved a good distance and we watched it and noticed that it had a slight wobble to it when it moved and after a few seconds of it flying slowly it stopped, moved again for a second, stopped then started moving again and got bright and slowly dissapeared until no longer visible. the way it dissapeared reminded me of a candle slowly burning out. About 2 hours later my girlfriend and i were standing outside talking about the event, and then happened to look over to the original position i saw it pointing, and when sure enough it was there again, exactly the same as i saw it before she saw it and became scared but it only lasted about 3 seconds before it dimmed out and dissapeared exactly the way it had before. The object made no noise at all, flew slowly at times but changed direction and flew extremly fast at times. Ive ruled out it being a satillite because of the way it moved and its visual intesity, also the speed in which it flew horizion to horizion and the fact it dims until dissapearing rule that out. Ive never seen an airplane fly the way it did, and living on an air base most of my life have never been so scared of something in the air. Each time i saw the object i was terrified and had an intese feeling of being followed, had an intese feeling of wanting to run."],"Source":"MUFON","Longitude":"-84.47448","Sighting Duration":"00:01:00","Region":"Michigan","Latitude":"45.646956","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Sphere, Star-like","Object Flight Path":"Path with directional change,Path then hovering","Summary":"A bright white light moving erraticly","Date Submitted":"05/02/2011 12:40 UTC"}