{"divs":["Sighting DetailsAt 9:45pm we were standing outside while some people were enjoying the calm, but cool evening on the deck. Someone said \"what is that?\" and we looked up and saw an extremely bright object that looked like a satellite cruising. However, this was much brighter then any satellite we have seen, not to mention we were in the middle of the city where satellites are rarely if ever seen. The object was at a high altitude, I would guess in between normal commercial air traffic and satellite altitude. The direction it was heading was to the South East. The light was about the size of a dime from our perspective, huge! It crossed the sky fairly quickly and as it quickly crossed the sky it looked as if it had started to climb rapidly until the light which was in clear view eventually vanished in the sky, there was nothing to get in the way of our view. We all were confused, none of us (3 total) could explain what it was. We are used to air traffic from PDX and this was nothing even close to any jet we had ever seen. When it seemed get dimmer and dimmer as if it was climbing straight up the object was no longer visible and I have never seen a jet do that, nor have a seen a plane glow like this object had been glowing. When I say it was bright, it was VERY VERY bright."],"Case Number":"28903","Log Number":"US-05022011-0003","Date of the Event":"04/30/2011 09:45 UTC","trends":["There have been 19 other sightings in Gresham","There were no other sightings in Gresham on or around April 30th 2011"],"Latitude":"45.507206","City":"Gresham","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.507206,+-122.422071(28903)&iwloc=A&hl=en\"> mufon case (28903) map </A>","Weather Factors":"Unknown","Longitude":"-122.422071","Object Shape":"Star-like","Date Submitted":"05/02/2011 01:46 UTC","Country":"United States","Sighting Duration":"00:02:00","Region":"Oregon","Object Features":"None","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/28903.html.txt","/var/www/straped/mufon/org/28903.html"],"Summary":"Extremely Bright Light","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path"}