{"Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Sphere","divs":["Sighting DetailsSaturday April 30, 2011. approximately 1-1:30 pm. it was partly cloudy, with the sun shining, and it was windy. My youngest daughter and i were flying her kite on the fairmont soccer fields, it is flat there, no obstructions, and we had it to ourselves. I was looking up at the kite while my daughter was flying it, and then i saw 6 round objects in a \"V\" formation heading from south to north. At first i thought they were geese and i kept telling myself they were. But as they flew above us they were spherical. they sort of looked like stars. and judging by distance they were probably the size of a fighter jet. i was screaming to my daughter to ask her if she could see them. She couldn't at first. \"That cloud?\" she asked. \"No, above it!\" i answered. \"What the---!\" Just before she said that they dispersed in an erratic pattern. they moved like nothing i had ever seen before. Then, one by one they disappeared into the cloud they were near. i tried to take a photo of it with my phone but it does not take good photos of far away objects. i tried to look to see if there were more of them, but there wasn't that i could see. i felt and still feel uneasy about the entire thing. i felt a little releif when i saw on the internet sightings of the exact same things all over the world. but i don't think will ever look up at the sky for a long time, and i am very nervous about flying in a plane this summer for our family vacation."],"Latitude":"43.652178","Disposition":"IFO","Date of the Event":"04/30/2011 12:00 UTC","Object Flight Path":"Path with directional change","Source":"MUFON","Date Submitted":"05/02/2011 08:48 UTC","Case Number":"28906","City":"Fairmont","Weather Factors":"Windy, Heavy","Region":"Minnesota","Log Number":"US-05022011-0006","map":"<A HREF = \"http://maps.google.com/maps?q=43.652178,+-94.461083(28906)&iwloc=A&hl=en\"> mufon case (28906) map </A>","Longitude":"-94.461083","trends":["There have been no other sightings in Fairmont","This sighting has never been favorited."],"Tags":"City","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/28906.html.txt","/var/www/straped/mufon/org/28906.html"],"Summary":"Daytime sighting UFO's in a V formation."}