{"Country":"United States","Log Number":"US-05022011-0016","City":"Charlotte","Sighting Duration":"Undisclosed","Region":"North Carolina","Date of the Event":"05/01/2011 10:30 UTC","Latitude":"35.235387","Object Features":"Undisclosed","Case Number":"28917","divs":["Sighting DetailsI was sitting on my neighbor's front steps in Charlotte, NC talking with him and saw an orange colored orb come up over the horizon in the night sky. It was around 10:30 pm, and I didn't say anything to my friend at first because I thought it might be a distant plane. But then another orb appeared behind the first one and I told my friend to look up. We started watching and another one appeared and another one. They moved very slow and steady. They were traveling approximately from the south to the north. They looked like orange balls of light, like they were on fire. I picked up my phone and called another neighbor and said come out in the yard right now. He came out and the three of us witnessed a series of about 10-12 orbs following each other across the sky. They made no noise at all. It was really weird. After awhile they seemed to get more distant and more dim. It looked like they were burning out, one after the other, or disappearing. After a few minutes there was a second series of four or five more that followed the same path. I have never seen anything like that before. I called a local television station and reported it. They said no one else had called. Today I called and reported it to The Charlotte Observer. The lady I spoke with said she had not received any other reports. I feel frustrated because I know other people had to have seen what the three of us had seen. These balls of light were floating very low in the sky, right over the city. Wish I had a video camera and could have recorded it. The whole event lasted about ten minutes. I hope other people will send in reports to document the same event we saw."],"files":["/var/www/straped/mufon/html2text/28917.html.txt","/var/www/straped/mufon/org/28917.html"],"Summary":"Series of bright orange orbs traveled across night sky silently one after the other","Object Shape":"Other","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around May 1st 2011"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.235387,+-80.835647(28917)&iwloc=A&hl=en\"> mufon case (28917) map </A>","Disposition":"IFO","Date Submitted":"05/02/2011 11:13 UTC","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-80.835647","Tags":"City"}