{"Longitude":"-81.651761","map":"<A HREF = \"http://maps.google.com/maps?q=30.339294,+-81.651761(28916)&iwloc=A&hl=en\"> mufon case (28916) map </A>","Disposition":"Insufficient Data","Object Features":"Dome","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around March 29th 0001"],"Region":"Florida","Date Submitted":"05/02/2011 11:09 UTC","divs":["Sighting DetailsI witnessed a very bright object descend directly down over an area near Hogan Rd on the eve of April 29th, right after 10pm. I was parked on Town Center pkwy facing the direction of Beach Blvd. I saw a large object, like an upside down cone with a bright yellow-white light go directly down over the cell towers. The object then disappeared behind trees, but then I noticed what I can only describe as a military plane or heli-craft that I have never seen in flight. It was circling the area where I last saw the object. I then tried to follow the craft and noticed a news van was also looking for the object. They soon gave up chase for no reason. I went to the site of the towers the next day and noticed it is also a group of satellites and communication for radio, tv, etc. The object I saw was not a lantern, as suggested by local news. It had to have a span larger than the aircraft I saw afterwards and was brightly lit object that lit up the sky and it descended DIRECTLY down in a controlled fashion."],"Date of the Event":"03/31/0001 10:07 UTC","Summary":"Large teardrop shaped object descends directly over cell towers followed by military craft","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28916.html.txt","/var/www/straped/mufon/org/28916.html"],"Object Shape":"Cone, Teardrop","Viewing Distance":"Over One Mile","Tags":"City","Latitude":"30.339294","Source":"MUFON","Log Number":"US-05022011-0015","Case Number":"28916","City":"Jacksonville","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed"}