{"Tags":"City","Country":"United Kingdom","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around April 29th 2011","This sighting has never been favorited.",""],"Object Shape":"Unknown","Summary":"Royal Wedding Crashers? Anomalies in the Sky near the procession route","Latitude":"51.512179","Date of the Event":"04/29/2011 12:00 UTC","Disposition":"Unresolved","Case Number":"28915","divs":["sighting detailsi couldn't find my intial post which had a wrong event date. viewing this photograph found at link indicated within the photograph my attention was drawn to some people in the crowd. their attention should have been drawn to the prince and duchess but some seem to be taking photos\\filming obviously away, not a normal behavior considering they are there to see the prince and duchess. what are they looking up at? zooming in the sky within the photograph i noted anomalies. the darker of the three seem disc shape but at that distance what could it really be? the problem i have with a plane is i doubt any would be permitted to fly during the horse drawn carriage procession. could these be birds? i noted other anomalies that would suggest birds but these three anomalies have my interest to have mufon investigators further investigate film footage of the event at this location to identify what these are."],"Object Features":"Undisclosed","Longitude":"-0.123555","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.512179,+-0.123555(28915)&iwloc=A&hl=en\"> mufon case (28915) map </A>","Region":"England","files":["/var/www/straped/mufon/html2text/28915.html.txt","/var/www/straped/mufon/more/28915_submitter_file1__SomethingflyinginEngland.png","/var/www/straped/mufon/more/28915_submitter_file2__Gotowww.bbc.co.uknewsuk-13200114andzoomin.png","/var/www/straped/mufon/org/28915.html"],"City":"London","Weather Factors":"Unknown","Date Submitted":"05/02/2011 11:06 UTC","Log Number":"GB-05022011-0014","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON"}