{"Tags":"City","divs":["sighting detailsmy father had just passed away that night at the uniontown hospital, and i was traveling with my companion back to my home, and my brother and his wife were following us in their car, when we all slowed down to watch a hugh bright object hovering above the mountains, we saw a beam of blue light shine down through the trees,and an object of somekind was lifted up by the beam to the ufo? we were all amased by what we were seeing? then the hugh ufo speeded away, and was gone in a flash? we don't know what it was, but we know it wasn't a plane, or man made aircraft, it had to be 200 yards long, and about 2 stories high? i've never seen anything like that before that big? i have however seen several ufo's throuhjout my life going back to my childhood? my most recent experience was inside my bedroom last november 2010 when i was awoken by a greenish-blue bright light at the foot of my bed? i couldn't move, except for my eyes? i was terrified, i felt like something was holding me down, and i could see small shadows in the dreenish-blue light? this lasted about a half hour it seemed? the light vanished, and i was then able to move again? i can remember small beings coming into my room when i was about 5 years old, and screaming uncontrolably!? i have several other cases i would like to share with you. i'm looking forward to hearing from mufon? thank you, sincerely; *(wit's name deleted--cms\\sg)."],"Longitude":"-79.715273","Country":"United States","Latitude":"39.902376","trends":["There have been 7 other sightings in Uniontown","There were no other sightings in Uniontown on or around February 13th 2009"],"Region":"Pennsylvania","City":"Uniontown","Case Number":"28913","Weather Factors":"Unknown","Date Submitted":"05/02/2011 09:44 UTC","Object Flight Path":"Undisclosed","Log Number":"US-05022011-0012","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28913.html.txt","/var/www/straped/mufon/org/28913.html"],"Source":"MUFON","Date of the Event":"02/13/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.902376,+-79.715273(28913)&iwloc=A&hl=en\"> mufon case (28913) map </A>","Disposition":"Unknown","Summary":"Giant Disc/Triangle UFO Hovering over top the nearby Mountains","Object Features":"Undisclosed","Object Shape":"Disc, Triangle","Viewing Distance":"Unknown"}