{"Weather Factors":"Unknown","Object Features":"Unknown","Tags":"City","Case Number":"28923","trends":["There have been no other sightings in Mt Carmel","This sighting has never been favorited."],"Region":"Tennessee","City":"Mt Carmel","Summary":"I saw a bright white light over Holston Army Ammunition Plant, then it shot off into space","Country":"United States","Object Flight Path":"Hovering then path","Object Shape":"Sphere","Longitude":"-82.66099","Date Submitted":"05/03/2011 11:11 UTC","divs":["Sighting Details I was best as I can recall a jr in high school and was going to a basketball game, it was dark but not late. I was on Main St that runs parallel to Hwy 11W I was stopped at a 4 way stop. I was going to make a left to enter Hwy 11w, this interchange is in alignment with an entrance to what was then called Holston Army Ammunition Plant, now BAE, it makes high explosive for the military. So when I looked left to begin the turn a bright white light in the sky caught my eye,it was over the ammunition plant grounds, I thought it was a helicopter, then it dropped slightly and accelerated out of sight kinda going right at an angle like a check mark, that happened instantly. It was almost instantly gone. That made my jaw drop. The way I remember the light was bright white like LED are today, and was round looking. I didn't see a craft. The best thing I can think of to describe the maneuver is check mark shaped. The sight didn't scare me, I thought I just saw a UFO, I am an open minded person so that was pretty cool. I know that wasn't much of a sighting, I hesitated to even mention it but as I listened to other descriptions of sightings over military interests, I realized that others had seen them at about the same time frame."],"Log Number":"US-05032011-0004","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/28923.html.txt","/var/www/straped/mufon/org/28923.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.545377,+-82.66099(28923)&iwloc=A&hl=en\"> mufon case (28923) map </A>","Date of the Event":"11/16/1981 07:30 UTC","Latitude":"36.545377","Disposition":"Unknown"}