{"Case Number":"28924","Object Shape":"Saturn-like, Star-like","Summary":"Rotating lights in distance","City":"Cedar Falls","Latitude":"42.544229","Weather Factors":"None","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/28924.html.txt","/var/www/straped/mufon/org/28924.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.544229,+-92.443516(28924)&iwloc=A&hl=en\"> mufon case (28924) map </A>","Object Features":"Undisclosed","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"05/03/2011 11:30 UTC","divs":["Sighting DetailsMy roommate and I were standing outside on our front porch around 10pm mid-April, and I saw something twinkling between the bare branches of a tree across the street. I knew right away it wasn't a plane, because it did not have the red and green lights a plane does, and it wasn't moving at the steady speed of a plane. I did notice that it was moving, however. The air was still, no wind or breezes, so the tree branches were not swaying in any way, and the twinkling lights were gradually moving left from one branch to another, then up. I asked my roommate if he was seeing what I was seeing, and he confirmed that there was definitely something in the sky moving unlike a normal aircraft. It was bright, and the lights were very defined (red, white, blue, purple, possibly orange) and the twinkling seemed to actually be the light rotating in a disk formation. I looked more steadily at the object and realized that one set of lights was rotating horizontally; there was another set of lights moving vertically, and both were part of the same object. It moved slowly, very slowly, and my roommate used this in comparison to the tree we were looking through to figure out how big the object actually was. The sky was clear, however, so this was very difficult to determine. He did see the rotation of the lights and again confirmed what I saw. We debated on reporting this but considering it could be the International Space Station, we decided to leave it alone. Upon further research I discovered that the ISS does not have rotating lights like the object we saw, and this stuck in my mind for the next few weeks. Last night we were outside again and both of us saw the exact same object in the sky, but significantly lower in its placement (not in the tree but above a coniferous bush-like tree that is approximately 4 feet shorter and 3 feet to the right) and not moving. The lights were still rotating in the same pattern, and again it was a very clear night. We are under the impression this object is in space, since on a cloudy night with even just wisps of clouds we haven't seen the object."],"Object Flight Path":"Path then hovering","Disposition":"Insufficient Data","Log Number":"US-05032011-0005","Date of the Event":"04/20/2011 10:15 UTC","trends":["There have been 4 other sightings in Cedar Falls","There were no other sightings in Cedar Falls on or around April 20th 2011"],"Sighting Duration":"Undisclosed","Longitude":"-92.443516","Region":"Iowa"}