{"Latitude":"39.544671","Disposition":"IFO","City":"Sparks","divs":["Sighting Details This event took place quickly and there are some doubts about what was actually seen as I was not able to view the objects for any length of time. I speculate that I may have witnessed the running lights of two vehicles driving down a nearby foothill at night. The jury is still out! I had gone for a long walk in my neighborhood of \"the Vistas\" in Sparks Nevada. I was heading west down Los Altos Pkwy. towards home. Shortly before 10pm. I looked behind me and saw what at first looked like a commercial jet swooping down at a low height near the east foothills. I would guess only a few blocks behind me and below 500 feet. Suddenly I saw a second object identical in configuration to the first move in behind the first. They weren't flying in formation but definitely traveling toegether. My impression is that the first \"object\" was in a bank and rolled itself level. I could clearly see what looked like running lights on the top and sides of the objects. Two lights on top and one on each end of what looked like a saucer seen edge on. I say saucer, but I could not determine the exact shape in the dark. My impression was of large objects closer to 100ft.in length instead of say 30ft. I became very alarmed as I was by myself and exposed out in the open. I decided to \"duck\" into a side street where I could get another view of the objects and take cover if I needed to. I lost sight of the objects behind trees and homes. I resumed my walk home without further incident. I checked the news for reports from other people but have found none so far. The capture of Bin Laden has dominated the news. I went back after dark to the same place Monday May 2nd to see if maybe I had just seen cars coming down Sierra Summit road. I watched a few cars travel down hill in the dark but they did not look like what I saw Sunday night. These \"objects\" seemingly appeared out of the hills and their large size, stealth and speed with which they maneuvered was startling."],"Country":"United States","Object Shape":"Cigar, Disc, Unknown","Date of the Event":"05/01/2011 10:00 UTC","Longitude":"-119.750879","trends":["There have been 23 other sightings in Sparks","There were no other sightings in Sparks on or around May 1st 2011"],"Summary":"Possible brief nocturnal sighting of two unknown","Region":"Nevada","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Case Number":"28929","Object Features":"Dome","Date Submitted":"05/03/2011 05:38 UTC","Sighting Duration":"Undisclosed","Log Number":"US-05032011-0010","files":["/var/www/straped/mufon/html2text/28929.html.txt","/var/www/straped/mufon/org/28929.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.544671,+-119.750879(28929)&iwloc=A&hl=en\"> mufon case (28929) map </A>"}