{"Disposition":"Insufficient Data","Log Number":"US-05032011-0007","Date Submitted":"05/03/2011 01:06 UTC","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Date of the Event":"05/02/2011 12:00 UTC","Region":"California","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.963691,+-122.619943(28926)&iwloc=A&hl=en\"> mufon case (28926) map </A>","Object Flight Path":"Undisclosed","Longitude":"-122.619943","Object Shape":"Other","Object Features":"Undisclosed","trends":["There have been 11 other sightings in Clearlake","There were no other sightings in Clearlake on or around May 2nd 2011"],"Latitude":"38.963691","City":"Clearlake","divs":["Sighting DetailsThis incident happens almost every day here in Lake Co. It started a few weeks ago. These 'jet' planes that leave a smoky trail were starting to become more frequent as the days went by.Last Sunday, these 'planes' would start early in the am and continue to fly over until dark. I can see for miles where I live and the entire sky is filled with trails of smoke. By evening the sky is so filled with this smoke that it might look like clouds to those who are not paying attention. There are days that it doesn't happen at all. I am retired and spend alot of time walking. The first time I noticed how strange these planes were was when I noticed how one looked like a dark shadow. As I was watching it, it just disappeared! You could see evidence of this...a trail of smoke that just starts and stops randomly. At first I didn't know what it was until I saw it happen. I have reported strange happenings in the past up here in Hidden Vlly. I pray that some day soon somebody will investigate up here again. Also, has anybody noticed the 'star' like lights in the sky? I pointed them out to my family members but they think they are just stars. Stars that are so close that they are in our atmosphere? Hmmmm....."],"Summary":"strange jet","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/28926.html.txt","/var/www/straped/mufon/org/28926.html"],"Case Number":"28926","Country":"United States"}