{"trends":["There have been no other sightings in Winchester","This sighting has never been favorited."],"Disposition":"Unknown","Object Flight Path":"Hovering then path","Latitude":"46.22194","Date of the Event":"10/16/1980 09:30 UTC","Region":"Wisconsin","Summary":"Close encounter for 30 minutes,additional witnesses available.","Date Submitted":"05/03/2011 11:48 UTC","Object Features":"Dome, Window(s)","Tags":"City","Weather Factors":"None","Viewing Distance":"101-500 Feet","Longitude":"-89.89778","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.22194,+-89.89778(28925)&iwloc=A&hl=en\"> mufon case (28925) map </A>","City":"Winchester","Case Number":"28925","Object Shape":"Disc","divs":["Sighting Details I had just gone to bed about 9 pm. As I was lying there still awake I saw a flash of bright light through the window from the direction of our driveway. I waited for a car door to open and close as I thought we had a unexpected guest, but no one had come. I called to my husband to see if anyone had come and he said no. A minute later I saw a strange light through the other bedroom window off in the distance. I was watching it because it was doing very strange things. It was making geometic type movements in the sky like circles, triangles, etc. We lived near an airport but this light was not behaving as an airplane would behave. I got out of bed and sat by the window to watch and called my husband in to see this. As we sat there watching it it came closer to the house. Now it appeared as a very bright white -yellowish light, almost too bright to look at. At this point it was about 200 feet from the house hovering just above tree top level. There was a lone tree in the field next to the house that enabled us to judge it's size and distance accurately. It appeared to be close to the tree and just above it. As we sat there watching it it emitted a search light rotating around on the ground and the area as though it were looking for something. As the light came around it shown right into our bedroom window. It made quite a number of rotations. We looked at each other in disbelief. At this point we decided to run ouside to get a better look. It was cold and still, not even the slightest breeze. I could hear the traffic from the highway which was a mile away. The night sky was crystal clear. We lived in the country on a dead end road far from city lights. We had a very clear veiw of the sky since we lived on the top of the highest hill the county. We often sat outside at night to look at the sky and watch the stars. The craft made no sound of any kind. I felt no moving air from it. If it had been a helicopter we would have been deafened by the noise and barraged with dust and air from the propellers at that close range. As it hovered, it was getting less bright and we could make out more details of the craft. It was disk shaped with a higher area on the top. There were red lights or windows around the top part. As we watched it we could see more details. The red lights looked more like windows with a red light inside it like a dark room that photographers use. I could see five or six silouhetted human like figures inside it moving around. Some of them seemed to be looking at us as we looked at them. The under side of the craft remained faintly glowing with the white yellow light. I would judge the size of the craft to be about 50 feet in diameter. It would have fit into our driveway area between the house and the barn. It just hovered there like that for at least 20 minutes. We could have walked right under it, but we didn't. It did not make any threatening movements or noises. I never felt any sense of danger. After about 20 minutes of watching it, another disk appeared from behind our house. It looked just like the first one. It was hovering moving very slow and close to the ground, below tree top level. The two of them hovered next to our house for several minutes then moved very slow down into the valley below tree level. they disapeared from our sight behind the trees in the valley. We didn't see them again. I was flabbergasted and elated at the same time with our experience. I wanted to report it to someone, but who would even believe us. I had not heard of MUFON yet. The next day I called the airport and spoke to an air traffic controller and asked them if they had seen anything on the radar that night. The man told me he couldn't relate any information about what they see on the radar to the public, even if they saw something unusual he could not talk about it. His response was worded in a way that led me to beleive that they did indeed see something on the radar but could not disclose the information. I did not report it to the police. I didn't think they would write a report on it. Even though I was reluctant to dicuss what we had seen with other people, over the next few days I broached the subject with 3 of our neighbors. The first was our landlord who lived next to us and I figured if he was awake he must have seen something that night. He was not at all surprised at my story and said that he often saw UFO's in the valley over the years. He had been living at that house all his life since it was a family farm that had been in the family for 3 generations. He was 72 years old and was a good resource of information about anything local. He was a credable witness, but he said he didn't see anything that night. We did have a lengthy discussion about the UFO's he had seen in the past. It was pretty much the same thing as we had seen, and he added that he had on several occasions found burn circles in the crops. He said that most of the neighbors around there knew about the UFO's and were ok in talking about it. It was sort of a local rite of passage with new people moving into the area. All the old timers in the area were quite familiar with the phenomenon. Another neighbor who I frequently went horseback riding with said that it hovered over their house for an hour late that night. They had previous experiences with the UFO's also. The third person I talked to about it,was a friend who lived down the road. They knew about the sightings, but were determined that they wanted nothing to do with it. They were Born Again Christians and seemed to be very threatened by the experiences. Two years later we moved due to economic conditions. Over the years I have talked about our experience with many different people. Some are eager to relate their own UFO experience, most are skepticle. I learned very quickly to use caution and to feel people out before relating the whole story to them. Many people still regard UFO experiences as bunk or ridicule it. It may not count for much relating this experience so many years after the fact, but it has always been in the back of my mind. I always had a fascination with the idea of UFO's as a child growing up in the sixties. There were books and stories about it and I held a open minded interest in it as I became an adult. I have always been glad that I had this experience because I know I am not crazy or hallucinating or making it up. I wish I had pictures but we didn't have a very good camera that night. I was too mezmerized by the experience to want to take a picture. Pictures would have been inconclusive any way. It would have shown the bright light but nothing else. I don't know if I can find too many people from that area to corraborate my story except for my husband. We are now divorced but I do know where he lives and he does talk about the experience. We don't live at that address any more, but I have gone by there from time to time. It would not surprise me if there where still sightings in that area. The uniqueness of the geography of that area could be the reason for the sightings. The location is the highest point in the county with a very large valley on the southern side. The valley has no houses in it since it floods every spring. When we lived there we had many storms that produced unusual lightening effects. We where often surrounded by balls of lightening and such intense lightening I would not answer the phone during a storm because the lightening would travel through the lines and ring the phone during storms. I have never experienced such intensity of lightening anywhere else. I was even struck by lightening in the house one day during a storm. Thankfully it was not severe and did no lasting harm. I also believe that Native American people who used to live there had a burial site there. The neighbors found many artifacts there. The area had unusual geography and history and I always felt that there was something different that set it apart from other places I have lived in. There are also high power lines that run over the top of that hill. The farm we lived on where we had the UFO experience was located on Pleasant Valley Rd. near Winchester ,WI. west of Neenah. We lived on the dead end of the road over looking the valley. It was a beautiful place to live back then. I know that there have been subdivisions built in the area since then. I don't know if the old farm is still there. It was owned by Leslie Dobbie, who is now deceased. He was our next door landlord at the time. The other neighbors names I have forgotten. I had many unusual dreams and clairvouant experiences while living at that address, but I never recalled any abduction experiences. It was a life changing experience for both of us. Since then, I have never viewed life or the world we live in with ambivilence. It made me more aware of my planet and my place in the cosmos."],"Source":"MUFON","Log Number":"US-05032011-0006","Country":"United States","files":["/var/www/straped/mufon/html2text/28925.html.txt","/var/www/straped/mufon/org/28925.html"]}