{"Date Submitted":"05/03/2011 02:03 UTC","Summary":"UFO as big as a small city over downtown Saskatoon","Longitude":"-106.644286","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Country":"Canada","Case Number":"28927","Latitude":"52.13659","Region":"Saskatchewan","files":["/var/www/straped/mufon/html2text/28927.html.txt","/var/www/straped/mufon/org/28927.html"],"Date of the Event":"12/18/2010 03:36 UTC","Sighting Duration":"Undisclosed","City":"Saskatoon","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=52.13659,+-106.644286(28927)&iwloc=A&hl=en\"> mufon case (28927) map </A>","Source":"MUFON","trends":["There have been 16 other sightings in Saskatoon","There were no other sightings in Saskatoon on or around December 18th 2010"],"Weather Factors":"Unknown","Log Number":"CA-05032011-0008","Object Features":"Patterned Surface","Object Shape":"Square, Rectagular","divs":["Sighting DetailsI was about to head to bed, I decided to go outside for a cigarette. I went to my front door and lit up. I looked up to the sky and saw what I believe was a UFO which hovered above downtown Saskatoon. I couldn't get over how big it was. I took reference points from various places like trees and a condo unit that is 500 plus meters from my front door. My best estimate was that this UFO was at least 6 stories high and looked to me from the distance it appeared to be away from me to be at least a mile wide to two miles in length. I remember thinking how beautiful it was. The underside was extremely clear and my focus was on the designs that were underneath. They seemed to be mayan or even egyptian designs. With gold or silver trim and black fill the design looked to be some sort of maze. I looked to figure the size of this craft which filled the sky. My reference points were two trees and suggested this was at least a couple of miles wide and by the distance it seemed to be away from me (one mile) this craft was at least as tall as the condo block which it hovered over. It stretched from the condo block as far as my eye could see. Then the UFO flew straight up to space. There was no noise, No recognizable power source it seemed more like some kind of anti gravity propulsion that took it away at an extremely high speed. I was fascinated to see whether the craft would have some heat trail as it left the atmosphere yet there was nothing it just disappeared into the stratosphere. The strangest thing for me was what happened after the event. I went into my house and immediately forgot i'd seen a UFO. It wasn't until two days later when i went out for a smoke at roughly the same time when i looked up to the sky and my brain clicked 'oh that was where the UFO was' Then i nearly fell over in disbelief that i could forget even for a couple of days such an experience. I spent the next day going over in my mind what had really happened. Maybe it didn't happen, Maybe it was a dream, Maybe i'd had some kind of memory wipe or something, after much deliberation i came to the conclusion that this was a real event, I then told my wife and posted on facebook, hoping someone else would have seen it. Nothing came back, no sightings. I have an idea that this and many other UFO's use some kind of cloaking device or even mind manipulation to reduce sighting occurrences. I don't know all i do know is this craft was the most beautiful thing i'd ever seen."],"Disposition":"Unresolved"}