{"map":"<A HREF = \"http://maps.google.com/maps?q=36.157472,+-95.990885(2892)&iwloc=A&hl=en\"> mufon case (2892) map </A>","files":["/var/www/straped/mufon/html2text/2892.html.txt","/var/www/straped/mufon/org/2892.html"],"Source":"MUFON","Longitude":"-95.990885","Region":"Oklahoma","Log Number":"","Latitude":"36.157472","Date of the Event":"06/30/2001 12:00 UTC","Viewing Distance":"101-500 Feet","Object Shape":"Unknown","Object Features":"Other","Object Flight Path":"Straight-line path","Summary":"Observed silvery, unrecognized obect in the sky","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Date Submitted":"06/30/2001 12:00 UTC","Country":"United States","Case Number":"2892","Disposition":"Unknown","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around June 30th 2001"],"divs":["Sighting DetailsI had just parked in my employment parking lot and a co-worker arrived at thesame time. I noticed the object because a large, black crow sitting atop alight pole started crowing really loud. I was waiting for my co-worker to exithis vehicle so we could walk in together, and I heard the crow and thought itodd that it would be there making such a loud noise. I had never noticed a crowin the parking lot before so it kind of stood out. I saw the crow, felt somehowdisconnected to my surroundings, as though I were experiencing a dream in someway. When the co-worker came up alongside me, I pointed the crow out to him andmade a comment about how strange it seemed. Thats when I first noticed theobject in the sky. My first thought was a large mylar balloon drifting in thewind. But the shape of the object was so odd that I couldnt quite fathom justwhat type of mylar balloon it could be. I felt a moment of quiet come over meas the thought struck that I may be seeing something that is different thananything id ever seen before. The object moved slowly, as though drifting on thewind, so we watched it for some time, maybe five minutes, discussing what it maybe. My friend commented that it was certainly strange, but that it must have agood explanation, even though he couldnt think of one himself. He refuses tobelieve that it could have been anything other than of terresterial origin, ashe is not a believer in UFOs I was simply stunned to be seeing this object. Iwanted to chase it to see where it went, but I had to got to work so once theobject was out of sight, we left.Im not good with distance, but the object seemed to be roughly 10-15 in size. It was silver in color though not really as reflective as a true silver colormay be. Possibly lead colored, would be a better description. Its appearencewas that of a bundle of cylinders bunched together. Maybe as many as 8, butcertainly no less than six. Its appearence gave the impression of looking likea six pack of Coors light beer, only without the lettering on the cans and,obviously, much larger. There were no windows or doors or lights that I couldsee, only the six to eight lead colored cylinders moving to the northwest. Theobject moved from a generally southern to northwestern direction, moving slowlybut steady."],"City":"Tulsa","Tags":"City"}