{"Object Features":"Undisclosed","Date Submitted":"05/03/2011 05:24 UTC","Object Flight Path":"Undisclosed","Latitude":"37.956867","Disposition":"IFO","Summary":"Unexplained light(s) apearing and disapearing on mountain ridge","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.956867,+-121.864402(28928)&iwloc=A&hl=en\"> mufon case (28928) map </A>","City":"Somersville","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Unknown","Country":"United States","Case Number":"28928","Tags":"City","Longitude":"-121.864402","trends":["There have been no other sightings in Somersville","This sighting has been favorited 1 time."],"Region":"California","Sighting Duration":"Undisclosed","Date of the Event":"04/27/2011 12:00 UTC","divs":["Sighting DetailsFor the past Two years or so Me and my friend's go to star gaze at this spot on highway 88 near bear river. And sense then have seen multiple ufo sightings. What is most common is a light coming up from the mountain very low on the ridge. It varies in color from a dim orange to super bright white almost blue sometimes. It is hard to describe the shape as the object is about 2 miles away. It's movments are unlike any conventional air craft. It seems to hover low on the mountain side and can change diretion effortlessly. My cousin and I once witnessed (our first sighting) A dim orange light appearing and disappearing on the ridge line, then it lit up very bright whitish blue, and stared moving very erraticly, almost like it couldn't stay still. It also seemed to jump from one spot to another instantly like a quarter to half mile from where it was. From the research I've done on other peoples sightings and belief's the craft definetly seems to be using some sort of anti-gravity technology. After observing the first sighting for over 30 minutes we were a litle freaked out and left. I wish I hadn't now I go back several times a month hoping to see it again. Althogh we do see unidentified light's almost every time we havent seen anything like the first sighting. Usally it's one if not more light's moving along the ridge line at slower speed's but still very weird. I wish I had a nice video cam to get it on tape. But I would like to show this to someone if they are interested in an investigation or even seeing it themselves. I'd love to show you the spot or answer any other questions you may have."],"Log Number":"US-05032011-0009","files":["/var/www/straped/mufon/html2text/28928.html.txt","/var/www/straped/mufon/org/28928.html"]}