{"Longitude":"-81.646611","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"28936","City":"Jacksonville","divs":["Sighting DetailsI had just stepped outside onto my front steps havin' a smoke.It had been a quiet night,my family was settling in for the night when directly in front of me over the tree line this extremely bright object appeared,it was just all of a sudden there,(I was facing west towards Greenlawn Cemetary) and almost instantly it fell to the ground(?)But it didn't really \"fall\" so to speak it was more like it propelled itself directly towards the ground at freefall speed as if you were to hold a tennis ball in your hand and let it go. I could still see it through the tree line as it disappeard. Imagine giving the OK sign with your hand that's how big it seemed (circle within thumb and index finger) when immediately after there seemed to be a flurry of movement of much smaller lights(specks if you will). And that was it.My immediate thought was a falling star and then almost as quick as I dismissed that, realizing it was a friday thought maybe fireworks from the Jacksonville Landing downtown,but when nothing followed I realized I had just truly witnessed something I couldn't explain. My son and I then headed for Landon Middle School where it was relatively dark and scanned the sky with binocs' but didn't see anything.To this date I have mapped a detailed line of sight of fields (5) within about 2.5 miles stretching from my home to the St.Johns river to check out.On a side note I would most certainly like to talk to the that other person here in Jax who reported what they had seen that night MUFON case #28861 feel free to share my email address with them if possible. Also I did email WJXT (newsforjax.com)that night for the record."],"Date of the Event":"04/29/2011 10:20 UTC","Viewing Distance":"Unknown","Latitude":"30.338914","Date Submitted":"05/04/2011 02:15 UTC","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Log Number":"US-05042011-0003","Region":"Florida","Object Shape":"Oval","Disposition":"Insufficient Data","Weather Factors":"Unknown","trends":["There have been 66 other sightings in Jacksonville","There was one other sighting in Jacksonville on or around April 29th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.338914,+-81.646611(28936)&iwloc=A&hl=en\"> mufon case (28936) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/28936.html.txt","/var/www/straped/mufon/org/28936.html"],"Summary":"Not quite a circle, bright white with a tinge of green encircling it.Sped at freefall speed towards the ground.","Source":"MUFON"}