{"trends":["There have been 3 other sightings in Leesville","There were no other sightings in Leesville on or around May 3rd 2011"],"Tags":"City","Weather Factors":"None","divs":["Sighting DetailsIt was about 10:30 p.m. and I took a peek out the windown blinds. I noticed what I assumed might be a planet because it was brighter than any star I'd seen. So I walked outside to take a closer look. I watched for a minute, maybe two, when I started to see the light move. It moved to the left slowly, then it would go up quickly, down, then back to the right. The way it moved reminded me of the way a bee would hover and dart from place to place. As it moved it seemed to get brighter and I thought I saw different colored lights also. So I called my husband outside to have a look and tell me what he saw. He stated that he was, in fact, seeing the same thing. There was no sound whatsoever that night not even coming from the object. We watched the object for probably ten to fifteen more minutes and then my husband went inside and got his binoculars. I took a peek with the binoculars and saw the object pretty clearly. It was a round shape and seemed to have hundreds of lights all over it. The lights seemed whitish and bluish-purple at times. It just radiated. It would get brighter and seemed to pulsate and as it did so it seemed to change shape. I still believed maybe this could have been something military until then but when I looked through those binoculars I just broke out in a cold sweat and instantly felt sick. My husband and I took turns looking through the binoculars in disbelief at what we were seeing. It was a rather cool night but I was still soaked with perspiration and shaking to the point of hardly being able to stand. About an hour and a half after first seeing the first object, my husband noticed two more off to the right almost above our home. These objects all behaved in the same manner and appeared the same. We watched for almost two and a half hours before going back inside. My husband wanted to watch till the objects disappeared or did whatever they were going to do but I was terrified and made him stay inside and go to bed with me. This is our second encounter of this nature. Back in February about 25 miles northeast of where we live we we're driving down the highway and approaching a small town and it wa just after dark. Just above the treetops ahead I noticed a blue light that I assumed maybe was a tower of some sorts although I knew there hadn't been anything there ever. As I looked closer I noticed there were more blue lights, I would say three to four, and they were moving in an irregular triangular pattern just above the treetops. We watched this for about thirty seconds before the lights just disappeard. My husband and father also witnessed this."],"Country":"United States","Region":"Louisiana","map":"<A HREF = \"http://maps.google.com/maps?q=31.151719,+-93.259938(28938)&iwloc=A&hl=en\"> mufon case (28938) map </A>","Latitude":"31.151719","Disposition":"Insufficient Data","Object Shape":"Circle, Star-like","City":"Leesville","Summary":"Myself and my husband witnessed what we assume to be ufo's on two different occasions.","Date Submitted":"05/04/2011 03:18 UTC","Longitude":"-93.259938","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Log Number":"US-05042011-0005","Sighting Duration":"02:30:00","files":["/var/www/straped/mufon/html2text/28938.html.txt","/var/www/straped/mufon/org/28938.html"],"Case Number":"28938","Viewing Distance":"Over One Mile","Source":"MUFON","Date of the Event":"05/03/2011 10:30 UTC","Object Features":"None"}