{"files":["/var/www/straped/mufon/html2text/28941.html.txt","/var/www/straped/mufon/more/28941_submitter_file1__P1000633.JPG","/var/www/straped/mufon/more/28941_submitter_file2__P1000634.JPG","/var/www/straped/mufon/org/28941.html"],"Date of the Event":"05/04/2011 03:00 UTC","Longitude":"-82.466667","Object Features":"Unknown","divs":["Sighting DetailsI was fishing on Lake Wosley on Manitoulin Island from 1pm to 3pm today. I caught no fish but decided to stop and take some photos on my way home. I do this all the time and have taken 1000s of pics of this area. When I got home, I started going through the day's photos and this image showed up. My camera, a 5 mega pixel Panasonic Lumix was in the \"photo burst\" mode. I took two images from the exact same spot. In the first image, there is nothing...in the second image, there appears to be a disc over the lake. I heard nothing...I saw nothing while I was out there. I probably drove around the area for another half hour or so taking photos from other vanatage points. When I was out, I noticed nothing unusual at all. I've used my primitive software to zoom into the disc and it seems quite simply, a disc in the sky. The thing that I find very interesting is the \"photo burst\" nature of the two pics I'm going to upload. The first pic I'm uploading has nothing in it...yet the second pic I'm uploading features this disc. These images were captured less than a second apart. I experience no \"out of the ordinary\" feelings of any kind. It was a very uneventual day until I got home and reviewed my pics."],"Summary":"Out taking pics...when I got home, I discovered an object I didn't see originally.","Country":"Canada","Latitude":"45.916667","Region":"Ontario","Sighting Duration":"00:00:01","trends":["There have been no other sightings in Gore Bay","This sighting has never been favorited."],"Viewing Distance":"Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=45.916667,+-82.466667(28941)&iwloc=A&hl=en\"> mufon case (28941) map </A>","Object Flight Path":"Unknown","Disposition":"Unresolved","City":"Gore Bay","Object Shape":"Disc","Case Number":"28941","Log Number":"CA-05042011-0008","Tags":"City","Source":"MUFON","Date Submitted":"05/04/2011 06:35 UTC"}