{"Object Shape":"Sphere","Latitude":"42.151438","Disposition":"Unknown","Date Submitted":"05/04/2011 11:29 UTC","Tags":"City","Date of the Event":"04/30/2011 11:25 UTC","Summary":"2 red spheres appreared in southwest sky as I looked out my motheres front window","files":["/var/www/straped/mufon/html2text/28947.html.txt","/var/www/straped/mufon/org/28947.html"],"Region":"Michigan","Log Number":"US-05042011-0013","Source":"MUFON","Longitude":"-84.032123","divs":["Sighting DetailsI was sitting in a recliner watching tv and I spotted this red light outside the front window of my mother's home. Both objects were bright red spheres hovering about 60 degrees. I viewed them between the large trees in the yard and it seems they were only a few hundred feet off the ground. The spheres hovered in the same area during the time I watched them. One sphere hovered over the other. I thought it might have been a reflection of something in the livingroom but nothing in that bright color was in the room. After about an hour it travelled southwest and as it travelled I would see a white light on the object as well as the red. There was no sound. On May 1st it appeared again only slightly further away. It hovered in the same area for at least an hour. I could see the white light shine the one hovering lower than the other would travel slightly horizontally in each direction. I didn't see the objects on the May 2nd, but May 3rd and 4th they appreard again. They were farther away but the same direction and the lights had a strobing effect. The nights have been overcast and the red lights were very bright."],"trends":["There have been 5 other sightings in Manchester","There were no other sightings in Manchester on or around April 30th 2011"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Features":"Unknown","Case Number":"28947","map":"<A HREF = \"http://maps.google.com/maps?q=42.151438,+-84.032123(28947)&iwloc=A&hl=en\"> mufon case (28947) map </A>","Sighting Duration":"Undisclosed","City":"Manchester","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change"}