{"Date of the Event":"05/04/2011 08:45 UTC","Case Number":"28945","Object Features":"Unknown","Object Shape":"Circle, Cylinder, Sphere","Date Submitted":"05/04/2011 10:08 UTC","files":["/var/www/straped/mufon/html2text/28945.html.txt","/var/www/straped/mufon/org/28945.html"],"Object Flight Path":"Path with directional change","trends":["There have been 2 other sightings in Dundee","There were no other sightings in Dundee on or around May 4th 2011"],"divs":["Sighting DetailsAbout 3 weeks ago out in Tipton a buddy and I had saw this UFO so we stopped and pulled off to the side of the road to watch. It was a bright orange light with an aura I would say, shooting straight up, fast. Then at a certain point it decided to take off to the left at a ridiculous speed. At that time it's light was going on and off. Then it would shoot straight up again eventually vanishing into the sky. I never thought I'd see it again, but I was wrong. On my way home to Dundee tonight I saw the same exact orange light shooting straight up. I couldn't believe it, right away I call my buddy to tell him. Then I go to look at it but couldn't see it. So I look back at the road and there it is traveling at another high speed to the other side of Dundee. That is when I happened to be driving through town and saw the group of people watching the same thing. I rushed home quickly to see it headed towards Monroe. With the object shutting its light off finally. Then out of nowhere comes either a plane or a jet (I believe jet) and starts to follow it. Whatever the object was though quickly took off and disappeared. I'm just hoping to get some answers here. Thanks! Side Notes: Both times I was driving. What made me notice the object was looking in the sky which I tend to do a lot and saw it shooting straight up. When I first noticed I realized it was a UFO since never seeing anything like it. My feeling is shocked, surprised and wanting to know what it is."],"Weather Factors":"Does Not Apply","Latitude":"41.959168","Disposition":"Unknown","Country":"United States","Log Number":"US-05042011-0011","Longitude":"-83.65637","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=41.959168,+-83.65637(28945)&iwloc=A&hl=en\"> mufon case (28945) map </A>","Tags":"City","Source":"MUFON","Summary":"UFO same one seen 3 weeks apart different countys in Michigan.","City":"Dundee","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile"}