{"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=42.614795,+-83.921485(28946)&iwloc=A&hl=en\"> mufon case (28946) map </A>","Case Number":"28946","Disposition":"Unknown","Country":"United States","Source":"MUFON","Date Submitted":"05/04/2011 11:17 UTC","City":"Howell","divs":["Sighting Detailsmy girlfriend smokes alot, thats bad but its good for me because she goes out smokes and watches the sky. i got her looking up and she saw it with me a few times here at my house so she knows what it looks like. she called me outside and i saw it lower than usual, bright white going pretty slow. i ran in and got my camera ran back out.i filmed it for a few seconds icouldnt hold it steady enough ,so i ran to a pole to lean against but by then it was going behind some trees so i backed up and filmed it again.it went behind somemore trees.i just filled out a sighting just 3 hrs ago that we saw on 4 26 11 i just said i was going to film it,camera was charged up and ready.ive have seen this object at least 30 times. it does right turn angles, it hovers no blinking light, and it shuts it light off.i saw this hover in one spot above my house shut its light off. i new it stopped by a group of stars so i new where it last was. i keep watching that spot i saw it light up dark orange without moving,i saw nothing for 10 min then it lit up dark orange, wasnt moving then it started moving slow.it lit up brighter then shot across the hole sky in 2 seconds max. its back...i got some footage, ill stay out all night every night this summer. im getting more footage soon . its around all the time. wish i could of filmed all the other things ive seen it do. but my camera is going to be ready. i think this is my calling.......later for now. 5 -4 -11"],"Date of the Event":"05/04/2011 09:35 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/28946.html.txt","/var/www/straped/mufon/org/28946.html"],"Summary":"bright round orb going slow ,filmed it finally .not much footage but got some","Object Flight Path":"Undisclosed","Log Number":"US-05042011-0012","trends":["There have been 20 other sightings in Howell","There were no other sightings in Howell on or around May 4th 2011"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Latitude":"42.614795","Weather Factors":"Unknown","Region":"Michigan","Longitude":"-83.921485","Tags":"City"}