{"Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["sighting detailswas on phone talking with my mom. looked out at the the sky to see multiple planes leaving persistant contrails and noticed what appeared to be a bright star in the sky. now it being full daytime and clear blue skies where this object was located. i noticed that it first \"drifted\" west a bit over the course of about 20 minutes. i hung up the phone and ran around my house trying to find aa batteries or to steal them from a wii or dvd remote to power my digital camera, but all that i found were dead. i snapped a picture with my cell phone camera, however i think this object was to high or my cell phone camera just sucks. i looked at the picture i took and from the screen of my cell phone i see nothing but sky. i called my mom back to let he know it was still out there and drifting now slowly north towards the roofline of my apartment (keeping in mind that the contrails were moving south rather rapidly. i suddenly remembered i have a cheap tasco telescope upstairs and ran to get it. this remembering of the telescope was a breakthrough in my frustration..what i saw through it was not what i expected to see. from the ground with the naked eye this object looked like a star would look in a clear night time sky. however this was broad daylight and it was very visable. it took me only seconds to locate the object with my scopr, and as it was moving so slowly it was quite easy to keep in the viewfinder with minor adjustments. i witnessed a clear yet reflective object that was continually changing shapes (morphing) it has no definative shape expect that it was contantly changing shape. it reminded me of a clear\\metallic\\lightproducing garbage bag floating at altitudes equal to the jet contrails being left in a bright blue sky. i am so pleased i got a clear up close look at this thing with my cheapo tasco telescope. once it moved north above my house after about an hour i was tired of watching it. and i have alot going on right now, so i decided to end my pursuit of the object at appx 4pm cdt"],"files":["/var/www/straped/mufon/html2text/28959.html.txt","/var/www/straped/mufon/org/28959.html"],"Object Flight Path":"Undisclosed","Case Number":"28959","Disposition":"Unknown","Object Shape":"Other","Date of the Event":"05/05/2011 03:33 UTC","Tags":"City","Summary":"Bright Shiny Sphere Seen From Back Window Moving Slowly Against The Wind Currents","trends":["There have been 18 other sightings in Murfreesboro","There were no other sightings in Murfreesboro on or around May 5th 2011"],"Longitude":"-86.38579","Latitude":"35.849011","Sighting Duration":"01:00:00","Country":"United States","Log Number":"US-05052011-0012","map":"<A HREF = \"http://maps.google.com/maps?q=35.849011,+-86.38579(28959)&iwloc=A&hl=en\"> mufon case (28959) map </A>","Region":"Tennessee","Date Submitted":"05/05/2011 05:59 UTC","City":"Murfreesboro"}