{"Source":"MUFON","Tags":"City","Latitude":"42.49876","Object Features":"Undisclosed","Longitude":"-82.886054","divs":["sighting detailsthis event i've never been able to explain. witnessed by a friend at the time as well, so i know it wasn't imagined. it had to of been 96' or 97' at the time. st clair shores had just finished it's annual christmas tree lighting ceremony at the 11 mile and jefferson library. on our way home the three of us (me, my mom and my friend) stopped at a party store which no longer runs on the corner of 13 mile and jefferson. as my mom went into the store my buddy and i waited in the car and were amazed by what we saw. as we were looking out the window in the east\\south\\east direction over the lake we noticed a light high in the sky was descending from further south over the lake to north lining up with the direction 13 mile points into the lake. it stayed about the same distance from the shore which i'd have to estimate at about a statue mile but still relatively high at roughly a couple thousand feet until it lined up pretty much exactly with 13 mile and went into a straight downward descent at a mile offshore. as it neared the horizon and water level out there on the lake it slowed drastically and orange and green sequencing illuminations were present. the shape appeared to be saucer on the bottom with larger dome on the top. it entered the water very slowly as we had 10-15 seconds of viewing the lights and the craft to get totally freaked out as it disappeared underwater still somewhat illuminating the water from below far offshore. we said nothing to each other the whole time, then my mother returned to the car, and as we said nothing and craned our necks to watch for anything else she drove off. my mother proceeded to drop my friend off without us saying anything.at the time there was no houses left of the house with the big anchor at the end of 13 mile so the viewing was uninhibited."],"Case Number":"28950","City":"St Clair Shores","Summary":"Craft submerged itself in Lac St Clair","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/28950.html.txt","/var/www/straped/mufon/org/28950.html"],"Date of the Event":"11/30/1996 09:30 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","trends":["There have been 9 other sightings in St Clair Shores","There were no other sightings in St Clair Shores on or around November 30th 1996"],"Region":"Michigan","Object Shape":"Disc","Date Submitted":"05/05/2011 02:26 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.49876,+-82.886054(28950)&iwloc=A&hl=en\"> mufon case (28950) map </A>","Log Number":"US-05052011-0003","Viewing Distance":"Unknown"}