{"Disposition":"Unknown","Weather Factors":"None","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.327778,+-122.709167(28951)&iwloc=A&hl=en\"> mufon case (28951) map </A>","Latitude":"38.327778","Tags":"City","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"28951","Date Submitted":"05/05/2011 03:55 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Region":"California","Date of the Event":"05/04/2011 09:40 UTC","Summary":"Bright orange light","files":["/var/www/straped/mufon/html2text/28951.html.txt","/var/www/straped/mufon/org/28951.html"],"Longitude":"-122.709167","Country":"United States","divs":["sighting detailsbright orange flame like light moving straight and steadily towards us thru the dark starry evening sky at a rate of speed as if it were an airplane, but lacking sound, and having no flashing lights. as it drew close, being about 1,500' up, perhaps 1\\2 mile away or less, it slowed as it seemed to notice us looking at it and dimmed and turned around and headed back somewhat the way it came. it continued to be just slightly visible as a dim orange dot in the sky for about a minuet as it continued to move off. i was walking for exercise a with friend along a path behind a residential neighborhood when i saw this. we were talking about the stars, so it was natural that we noticed this bright orange flame-like light heading right overhead. i thought right away, this is no normal airplane, so i said \"let's stop and wait to see what it is.\" it was heading steadily eastward out of the west and would have gone directly over our position, but just as i said this it began to slow and dim, then turned in a somewhat uneven motion and made a \"u\" turn and headed back slightly to the north of the direction from which it had come. i watched as it moved off but soon gave up as it was so dim as to be barley visible, and seemed to be heading away at a slow speed. this object seemed to look and behave nearly identical to one i saw some time ago not far from this location."],"trends":["There has been one other sighting in Cotati","There were no other sightings in Cotati on or around May 4th 2011"],"Log Number":"US-05052011-0004","City":"Cotati"}