{"Date Submitted":"05/05/2011 10:51 UTC","Case Number":"28952","Tags":"City","Viewing Distance":"Unknown","Disposition":"IFO","Date of the Event":"05/04/2011 12:00 UTC","Object Flight Path":"Undisclosed","Country":"United States","Source":"MUFON","trends":["There have been 11 other sightings in McAllen","There were no other sightings in McAllen on or around May 4th 2011","This sighting has never been favorited.",""],"Longitude":"-98.222202","Object Features":"Undisclosed","Latitude":"26.207297","Summary":"Object photographed within rainbow circle around sun.","map":"<A HREF = \"http://maps.google.com/maps?q=26.207297,+-98.222202(28952)&iwloc=A&hl=en\"> mufon case (28952) map </A>","files":["/var/www/straped/mufon/html2text/28952.html.txt","/var/www/straped/mufon/more/28952_submitter_file1__halo.jpg","/var/www/straped/mufon/more/28952_submitter_file2__halo2.jpg","/var/www/straped/mufon/org/28952.html"],"Object Shape":"Sphere","Region":"Texas","Sighting Duration":"00:30:00","Log Number":"US-05052011-0005","City":"McAllen","divs":["sighting detailson may 4, 2011 at about noon, *(wit's name deleted--cms\\sg) a teacher at mcallen high school, was standing in the administration parking lot at the high school, located at 2021 la vista ave. in mcallen, texas (26.226718,-98.238164), looking up at a strange \"rainbow halo\" effect around the sun. using his smart phone, he snapped a photo. while looking at the photo later, he noticed that there was a bright sphere in the upper right corner of the picture. the rainbow surrounding the sun was caused by high clouds containing ice crystals, according to local meteorologists (link moved to additional evidence section--cms\\sg) and some observers think the bright sphere might be a planet or satellite visible because of the darkness of the halo. the first photo attached (halo.jpg) is the original smart phone photo unaltered in any way. the second photo (halo2.jpg) is zoomed in and has brightness\\contrast enhancement but no other alterations."],"Weather Factors":"Unknown"}