{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28956.html.txt","/var/www/straped/mufon/more/28956_submitter_file1__IMAG0232.jpg","/var/www/straped/mufon/org/28956.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.858382,+-118.379608(28956)&iwloc=A&hl=en\"> mufon case (28956) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Fireball, Sphere, Square, Rectagular, Star-like","Viewing Distance":"Unknown","trends":["There have been 10 other sightings in Redondo Beach","There were no other sightings in Redondo Beach on or around April 14th 2011","This sighting has never been favorited.",""],"Date Submitted":"05/05/2011 03:03 UTC","Case Number":"28956","City":"Redondo Beach","divs":["sighting detailsi live less than 1000 ft to the ocean and as i was driving home about a 1\\2 mile from home i noticed a bright orange object over the ocean which first appeared to be a comet but as i watched it it was headed upward toward the sky. my nephew and his friend were in the car with me when i pointed at it and said \"what is that u guys?\" as we watched we had stop at a light on sepulveda blvd & prospect, but by that time we were all kind of in shock because we realized what we were witnessing was a definite anomaly. about 5 min had passed by the time i had first noticed it and we were able to stop and get out of our car to witness it. by the time we pulled over it had made a 90 degree turn and was heading toward us and was now almost directly over our heads. it was more bright and larger than any other light source or aircraft in the sky and was changing colors, from orange to yellow to white, my nephew saw other colors. it was traveling at a constant slow speed and at about the same altitude as the private airplanes fly at the nearby torrance airport. i have seen stealth fighters, cessna's, f14's, commercial planes, rockets, comets and falling stars, but this was like nothing we had ever seen before. when it was directly over head it disappeared and a few second later reappeared as bright as ever and then promptly burst again never to reappear. whatever this was it flew in an extremely straight trajectory and the light emitted was most bright and prominent in front of the object, i seemed to be pushing through its own light source, kind of like a halo appearance. it also had a comet like tail, but no contrail at all. i had handed my cell phone to my nephew so that he could take video but i did not notice until it was too late that it was in camera not video mode, so when he thought he was turning off the camera to get out of the car he actually took a picture on accident, which is the only picture i have. you can still see the orange object but it is blurred as are the rest of the light sources, i did notice something peculiar about the lights though, they are all blurred in a left angle, except for the orange object in the sky, it is at a left angle. i am assuming some one with a physics background might be able to explain this."],"Log Number":"US-05052011-0009","Region":"California","Country":"United States","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-118.379608","Summary":"Bright orange oblong comet like object originating over open ocean","Date of the Event":"04/14/2011 09:22 UTC","Source":"MUFON","Latitude":"33.858382"}