{"Sighting Duration":"Undisclosed","Log Number":"US-05052011-0013","City":"Rancho Cucamonga","Weather Factors":"None","divs":["Sighting DetailsI was turning on my sprinklers and noticed a strange light in the sky. It was an orange colored light similar to a flame. When I saw it I could not figure out what it was so I went inside to get my wife. She came out and said it was an airplane. As she said that the light dimmed and re-lit. I told her that airplanes don't do that. She then said that it must have gone behind a cloud. I told her that there were no clouds today. She then went inside. Living near Ontario Airport, I've seen many a plane go by, but this was not the same. I watched the object about 1 to two minutes more before it dimmed out. The object was moving at a very slow speed exactly parallel to the horizon and never descended or ascended. It fully dimmed and re-lit twice as I was watching it. At one point it stopped moving and hovered for about 5 seconds, then resumed it's path. After about 2 minutes, it dimmed fully. I then saw a black shadow of an object for about 1 second. My eyes were unable to find the object in the dark sky after that. I stayed out there another minute or two, but the object did not reappear. I then went inside. I have no pictures or video. I was just curious if anyone else saw it and reported it. That is the reason I am reporting it to you."],"trends":["There have been 8 other sightings in Rancho Cucamonga","There were no other sightings in Rancho Cucamonga on or around May 3rd 2011"],"Latitude":"34.122232","Longitude":"-117.598109","Tags":"City","Case Number":"28960","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/28960.html.txt","/var/www/straped/mufon/org/28960.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.122232,+-117.598109(28960)&iwloc=A&hl=en\"> mufon case (28960) map </A>","Disposition":"IFO","Object Features":"None","Date of the Event":"05/03/2011 08:45 UTC","Region":"California","Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"05/05/2011 06:53 UTC","Country":"United States","Object Shape":"Fireball, Sphere, Star-like","Summary":"Orange colored light traveling very slow in a southernly direction parallel to the horizon. Light pulsated twice then dimmed out to a black shadow. No clouds in the sky, light did not float downward. At one point it hovered for a couple of seconds."}