{"Country":"United States","Latitude":"32.816548","Tags":"City","City":"Irving","Case Number":"28968","Date Submitted":"05/06/2011 09:23 UTC","Log Number":"US-05062011-0006","Date of the Event":"05/05/2011 06:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.816548,+-96.943284(28968)&iwloc=A&hl=en\"> mufon case (28968) map </A>","Viewing Distance":"Unknown","Region":"Texas","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Weather Factors":"Unknown","Summary":"two bright points of red light","trends":["There have been 18 other sightings in Irving","There were no other sightings in Irving on or around May 5th 2011"],"files":["/var/www/straped/mufon/html2text/28968.html.txt","/var/www/straped/mufon/org/28968.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy neighbor and I had been at my house all afternoon and we saw my other neighbor through the window so we went outside to say hello. It was so clear and nice out we decided to sit on the grass on the island in the middle of our cul-de-sac. The neighbor who had been with me most of the afternoon and I looked up at the sky at about the same time and both saw a bright, solid red point of light moving east to west. For something in the sky in broad daylight it was very bright, it was more visible than the planes that are normally in the sky. We debated weather or not it was a plane or a balloon of some kind and then it stopped dead in the sky and began to pulse then move slowly in the opposite direction. Another neighbor was out playing with her kids so we called her over to look at it and she followed it with us. It stayed in the same area of the sky, moving around slightly, almost like a helicopter but more precise. It started fading in and out, then another light appeared literally out of nowhere and they began pulsing back and forth, completely disappearing and then getting really bright again. The other light was identical but not as constant as the original light that we were still following. A neighbor brought out a pair of binoculars and I tracked it for a few minutes as it pulsed before it completely disappeared. I studied it pretty closely through the binoculars and couldn't make out any details beyond a bright point of light, usually with binoculars I can make out some details on a plane but there were no wings or real shape to it what so ever. We watched the sky for about an hour after it disappeared but didn't see anything further. I've seen a lot of stuff in the sky, I've seen my share of comets, meteors, planes, helicopters, satellites, even a couple things at night that I've called UFOs but never anything this clear during the day that I couldn't explain. There were 5 of us who all saw it in the sky"],"Object Features":"None","Object Shape":"Fireball, Star-like","Longitude":"-96.943284","Disposition":"Hoax"}