{"files":["/var/www/straped/mufon/html2text/28962.html.txt","/var/www/straped/mufon/org/28962.html"],"Object Shape":"Circle","Date Submitted":"05/05/2011 11:06 UTC","Region":"South Carolina","Sighting Duration":"Undisclosed","Disposition":"Unknown","Source":"MUFON","Longitude":"-80.937046","Object Features":"Unknown","Latitude":"35.01546","Weather Factors":"None","Case Number":"28962","Country":"United States","Summary":"Very bright light moving slowly from south to north directly overhead slowly fades out","Log Number":"US-05052011-0013","trends":["There have been 7 other sightings in Fort Mill","There were no other sightings in Fort Mill on or around May 5th 2011"],"divs":["Sighting DetailsI went outside on our rear deck in Fort Mill and look at the sky as I always do and directly(or appears to be) overhead is a bright round white light that looks like a miniature version of the moon with a hallo around it from slight clouds. Stars still visible around object. Object slowly moving from south to north pattern (not east to west like satellites) for 5 seconds then slowly fades away. The fade away took about 4 seconds. In the path it was traveling I could see stars so it did not go behind clouds, just faded out. Cannot judge size of objects in sky because of distance but the object was close enough to be in our lower atmosphere and looked to be about half the size of the moon and much brighter. I am use to seeing planes in the sky being close to major airport and they fly over all the time. This was no plane, to close, slow, bright, no noise, and solid white light. Did not feel anything when I saw the object. I did think it was weird that it started to fade as soon as I saw it. Like it didn't want me to see it anymore. Very bright, brighter then planes."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","City":"Fort Mill","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.01546,+-80.937046(28962)&iwloc=A&hl=en\"> mufon case (28962) map </A>","Date of the Event":"05/05/2011 10:00 UTC"}