{"Latitude":"43.662126","Log Number":"CA-05062011-0016","Case Number":"28978","files":["/var/www/straped/mufon/html2text/28978.html.txt","/var/www/straped/mufon/more/28978_submitter_file1__DSCN0254.JPG","/var/www/straped/mufon/more/28978_submitter_file2__DSCN0262.JPG","/var/www/straped/mufon/org/28978.html"],"divs":["Sighting DetailsLooking outside my window I noticed a very bright light that was just below the horizon. It reappeared every night for about a week. Showing up in three different places (over three different nights) showing up at the same level (just below the horizon) but moving about 15-20 degrees to the east each night. It was back in the third spot for multiple days. It was very bright and pulsated a little. I could not tell how far away it was. It would appear just as the lights of the city were becoming noticeable, stay in place then just shut off instantly. I though it was a construction light but it was way too bright. On looking at the photos later I realized that it had actually moved as well. The two attached photos show it at the very beginning of the second last night it was there and just a little later. Please note that I have not done anything to the photos. I leave it in your judgment whether you think you should post this sighting or not."],"City":"Toronto","Summary":"Very bright light in the distance, moved very little, could be nothing","Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"None, Unknown","Source":"MUFON","Date of the Event":"02/15/2011 09:30 UTC","Object Flight Path":"Stationary,Other","Date Submitted":"05/06/2011 08:37 UTC","Tags":"City","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=43.662126,+-79.381584(28978)&iwloc=A&hl=en\"> mufon case (28978) map </A>","Object Shape":"Circle, Diamond, Egg, Fireball, Oval, Sphere, Star-like","Sighting Duration":"Undisclosed","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around February 15th 2011","This sighting has never been favorited.",""],"Region":"Ontario","Longitude":"-79.381584","Viewing Distance":"Unknown"}