{"Weather Factors":"Does Not Apply","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/28974.html.txt","/var/www/straped/mufon/more/28974_submitter_file1__u1001.jpg","/var/www/straped/mufon/more/28974_submitter_file2__u1030.jpg","/var/www/straped/mufon/more/28974_submitter_file3__u1043.jpg","/var/www/straped/mufon/org/28974.html"],"Object Flight Path":"Straight-line path","Latitude":"37.110461","Date of the Event":"02/20/2011 04:05 UTC","Summary":"I was watching the dish earth channel on satillite.","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Columbia","There were no other sightings in Columbia on or around February 20th 2011","This sighting has never been favorited.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.110461,+-85.29982(28974)&iwloc=A&hl=en\"> mufon case (28974) map </A>","Date Submitted":"05/06/2011 06:37 UTC","divs":["Sighting DetailsI was watching the dish earth channel showing my wife how the earth looks like from space and saw a round object move through the screen and go behind the earth.At first I thought is was the moon but it was to small and I checked where the moon was supposed to be on that date and it didnt add up. Then I thought it was a planet but it is to big to be one because planets look like dots even through telescopes.to big to be a satillite.I just held my kodak camera up to the T.V and took pictures of it moving and going behind the earth and then coming out the other side and moving out of sight of the dish earth satillite camera.I have been watching the channel since and havent seen it again.I tried to zoom in on my tv screen and get a close up.I downloaded the pics to my computer and sending them to you. Ithink my date on camera was wrong but the date on the dish earth channel is on there. Im sure you could get the actual footage from dish earth channel since I have their time and date on the pics. If you find out what it is tell me please.I have over 60 pics I took going through the screen I dont know If I attached them send to you the right way If you didnt get them all let me know and I will try again. Thank you for your time."],"Country":"United States","City":"Columbia","Object Shape":"Egg, Oval","Disposition":"Unknown","Object Features":"Unknown","Log Number":"US-05062011-0012","Longitude":"-85.29982","Case Number":"28974","Tags":"City","Sighting Duration":"02:00:00"}