{"Date Submitted":"05/06/2011 06:51 UTC","Sighting Duration":"Undisclosed","Summary":"While watching the sun set this thing drops down out of a cloud.","trends":["There have been no other sightings in Heber","This sighting has never been favorited."],"Latitude":"32.730891","Weather Factors":"Windy","Country":"United States","Disposition":"IFO","Tags":"City","Case Number":"28975","Object Shape":"Other","Longitude":"-115.529718","Region":"California","divs":["Sighting Details I was watching the sun set and noticed. That one of the clouds looked like it had ripples in it. Like you would have in water. Then a bump formed. I just was transfixed on this cloud! When this thing started to lower down out of the cloud. I got my camera. I took a picture and soomed in on the picture I had just taken. I was like, \"What the hell is that!\" Emotionaly I was handling it ok till this thing in the clouds lowered its self so far out of the cloud as seen in the pictures. The thing in the cloud looked as if it lowered its self down out of the cloud to release some type of gas or some thing else out of the end of what ever it was in the cloud. Then it slowly went back up into the cloud. The same way it showed up. I showed the pictures to friends and they told me to give the pictures to the right people. So here you go! I have sent three pictures taken of the event."],"Date of the Event":"04/24/2011 06:29 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28975.html.txt","/var/www/straped/mufon/more/28975_submitter_file1__Ginavideo229.JPG","/var/www/straped/mufon/more/28975_submitter_file2__Ginavideo230.JPG","/var/www/straped/mufon/more/28975_submitter_file3__Ginavideo232.JPG","/var/www/straped/mufon/org/28975.html"],"Viewing Distance":"Unknown","Log Number":"US-05062011-0013","Object Features":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.730891,+-115.529718(28975)&iwloc=A&hl=en\"> mufon case (28975) map </A>","Object Flight Path":"Stationary","City":"Heber"}