{"Case Number":"28973","Tags":"City","Summary":"Bright descending light","Country":"United States","Disposition":"Unknown","Sighting Duration":"00:00:15","Viewing Distance":"Unknown","City":"Orlando","Date of the Event":"04/29/2011 10:00 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was traveling north on the Florida turnpike just south of the 528 exit. It was around 22:00 hours and a clear dark night. I could observe the landing lights for the planes approaching Orlando International Airport. As I was driving, a bright light suddenly caught my attention out of the front windshield to the west. It appeared to be in the same flightpath as the approaching planes. My first reaction was that it was an exploding and burning airliner falling out of the sky. It moved from the west to east and descended at a fast rate. My daughter and wife also observed the object and concluded that it was a meteorite. The entire event lasted approximately 10 seconds from the time I first noticed it until it appeared to turn off before striking the ground. We continued driving on the highway to our destination and talked about our sighting. I do not believe it was a meteorite because of the speed at which it was traveling being too slow. There must be more witnesses because of the area in which it occured. There were many other vehicles on the road with us that surely observed the same event."],"Region":"Florida","Longitude":"-81.378036","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=28.548026,+-81.378036(28973)&iwloc=A&hl=en\"> mufon case (28973) map </A>","Object Shape":"Circle, Fireball, Sphere, Star-like","Log Number":"US-05062011-0011","Object Features":"Undisclosed","Date Submitted":"05/06/2011 06:30 UTC","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around April 29th 2011"],"files":["/var/www/straped/mufon/html2text/28973.html.txt","/var/www/straped/mufon/org/28973.html"],"Weather Factors":"Unknown","Latitude":"28.548026"}