{"Date Submitted":"05/06/2011 08:27 UTC","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"09/29/2007 12:00 UTC","Object Shape":"Cylinder, Sphere, Other","Disposition":"Insufficient Data","divs":["Sighting DetailsIt was september 29th 2007 around 12 midnight I was outside on my front steps smoking a cigarette. I was scheduled to leave for a week of bootcamp. Im sitting on my steps looking through the branches of a tree in my neighborghs yard. I remember no leaves were on the tree and I was looking at the stars, I noticed an unproportionatly large orange tinted star way off in the distance. Through the tree branches I watched the object it was stationary for minute maybe two, but it started to drift away from the surrounding stars in an upward slow motion, it then would move right carrying the same speed then move up again. It did this up then right up then right up then right, I felt as if the object knew my eyes had seen it. It then moved in an upward and right positive angle more quickly than it had been traveling before. It was coming towards me covering miles of space within few seconds. As it was coming towards me I got up off the steps and walked into the road and saw the craft the size of a small helicopter but with a much diffrent shape 3 orange circle \"burners\" on the back and had been hovering 10 feet over the houses and trees I tryed to take a picture on my phone but it was too dark and wouldnt show, I ran down the street to get the picture and it slowed down enough that I ran down the street and got about 20feet from where the object was at I got a great visual on the object nothing ive ever seen before. It stayed for a few amazing moments then took off at the extreme acceleration it had came at covering thousands of feet over the school and disapeared behind a watertower in the distance. I was shaken up but at the same time I felt connected with the craft as if they meant to show me what I saw and meant no harm to me. I left the next day for bootcamp in franklin PA I returned a week later and the firat night I was back sleeping in my bed I woke up at night raised my head up and looked to the foot of my bed and at that moment I saw a small person in a black suit standing no taller than 3 feet tall at the foot of my bed, just as I caught glimps of this my body felt paralyzed and heavily forced back onto my pillow I fought it as hard as I could and got no movement from my body except one thing I felt a tear forming from my eye as I lost concience again. That encounter when I returned from bootcamp sent fear into me I havent told anyone til now beside my girlfriend at the time"],"Region":"Pennsylvania","Object Features":"Other","Log Number":"US-05062011-0015","trends":[],"Latitude":"41.205022","Sighting Duration":"Undisclosed","City":"Undisclosed","Longitude":"-77.193415","map":"<A HREF = \"http://maps.google.com/maps?q=41.205022,+-77.193415(28977)&iwloc=A&hl=en\"> mufon case (28977) map </A>","Viewing Distance":"20 Feet or Less, Over 1 Mile","Tags":"City","Case Number":"28977","Summary":"Orange orb slow hover extremly fast acceleration sound canceling","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","files":["/var/www/straped/mufon/html2text/28977.html.txt","/var/www/straped/mufon/org/28977.html"]}