{"Tags":"City","Latitude":"31.76084","divs":["Sighting DetailsI was up really early to take a friend home after a long night of partying at home. As we walked outside I noticed the morning sky looked brilliant and was photo worthy. I ran inside real quick to get my camera to get a couple shots of the sunrise. I snapped two shots just seconds apart. Years later, about 4 or 5, I was going through some old pictures. I found the two I took that day and I decided to use one of them as my desktop background on my pc. When I went to click on an icon on my desktop, I noticed a small object next to it in the photo. I thought to myself, what the heck is that?! I opened the image and zoomed in to see what the thing was. At first glance I thought maybe it was a bird, but after comparing it to the birds sitting on the telephone wires, and realizing the size differences, I ruled that theory out. I opened up the second picture and didn't see the object, although I did notice a second object in a different part of the photo. It looked like it was very high up, and was shaped like a disk of some sort. I'm not sure if the two objects are one of the same and were maybe at two different locations in the two pictures. And I know I didn't see anything in the sky when I took them. I like to take a lot of photos of sunsets and sunrises, and I know that if there happened to be a plane or a helicopter flying through the shot, I'd wait for it to pass. I can't explain what the objects were, but I've held on to those pics ever since. I never thought about reporting them until now... The first photo shows the object at quite a far distance, and seems to be quite large. It looks as though it's heading west and there seems to be leaving a trail of some sort. The second photo shows the second object high above the clouds, yet the object in the first photo is no longer there. Keep in mind these photos were taken one right after the other, so I would assume the objects would be in both photos in the same vicinity...but this isn't the case."],"Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=31.76084,+-106.479591(28972)&iwloc=A&hl=en\"> mufon case (28972) map </A>","Date of the Event":"07/03/2004 06:04 UTC","Case Number":"28972","Log Number":"US-05062011-0010","Date Submitted":"05/06/2011 04:52 UTC","Object Shape":"Disc","Disposition":"IFO","Object Flight Path":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around July 3rd 2004","This sighting has never been favorited.",""],"Object Features":"Other, Unknown","Source":"MUFON","Country":"United States","Region":"Texas","files":["/var/www/straped/mufon/html2text/28972.html.txt","/var/www/straped/mufon/more/28972_submitter_file1__NewImage.JPG","/var/www/straped/mufon/more/28972_submitter_file2__NewImage1.JPG","/var/www/straped/mufon/more/28972_submitter_file3__zoomedin.JPG","/var/www/straped/mufon/org/28972.html"],"Longitude":"-106.479591","City":"El Paso","Summary":"Strange objects in sunrise photos..."}