{"Viewing Distance":"Over One Mile","Latitude":"29.646354","Summary":"Me and my 2 siblings watched a plane chase a red ball from s.e. 2 s.w.","trends":["There have been no other sightings in Newberry","This sighting has never been favorited."],"Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMe and my brother and sister went to watermelon pond to spend some time alone.We parked facing south,got out and sat on the hood to talk.I noticed a red ball running from southeast to soutwest of our possition,i pointed it out to them,we then noticed a plane behind it following it,it was going west,it got to our southwest and turned north(the plane never did gain on the object but didnt loose ground either} so did the plane{we knew it was a plane becouse it had blinking lights consistant with a aircraft)the object and the plane got to our northwest and we noticed another plane coming at it from the east when both planes got the same distance from the object it shot straight up into space(it didnt turn off it faded at terrific speed straight up).We watched the planes for a minute as they circled and decided to go home.We didnt know what it was the only thing we knew for sure was that there was a plane chasing it.I cant tell you what they were feeling but i was in awe and shocked to witness such an event{we didnt speak of it again for 14 years,i finally broached the subject,my brother says that he vagely remembers it,my sister not at all.This was really frustrating for me becouse it was so vivid for me(i can picture this event like it was yesterday).I didnt call or tell anybody else about this for a long time for fear of ridicule.Finally i came to grips with what we saw that anybody that would listen heard the story."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.646354,+-82.606502(28979)&iwloc=A&hl=en\"> mufon case (28979) map </A>","Weather Factors":"Does Not Apply","Log Number":"US-05062011-0017","Object Features":"None","Source":"MUFON","Case Number":"28979","Date Submitted":"05/06/2011 08:47 UTC","Object Shape":"Circle, Fireball, Oval, Sphere","Region":"Florida","Disposition":"Unknown","City":"Newberry","Date of the Event":"12/18/1992 09:28 UTC","Longitude":"-82.606502","files":["/var/www/straped/mufon/html2text/28979.html.txt","/var/www/straped/mufon/org/28979.html"],"Country":"United States","Object Flight Path":"Path with directional change"}