{"files":["/var/www/straped/mufon/html2text/28982.html.txt","/var/www/straped/mufon/org/28982.html"],"Date Submitted":"05/06/2011 09:30 UTC","trends":["There have been 65 other sightings in Fort Collins","There were 2 other sightings in Fort Collins on or around May 5th 2011"],"Source":"MUFON","Summary":"saw a fleet of 8-20 glowitng objects flying in a triangle formation very fast moving W/NW","Tags":"City","Object Shape":"Boomerang, Sphere, Triangle, Unknown","divs":["sighting detailsi was outside smoking on my porch, laying on my back on a couch we have which is roughly parallel to a north\\south line, with me looking at the north\\nw quadrant of the sky. looking at the stars as usual, after about 5 minutes, out of the corner of my eye i suddenly saw a group of fast objects which passed into my view. the lights were white with a hint of orange and all of them were steady, no blinking or alterations in the light. it's hard to say how many lights there were but at least 8-20 objects flying in very close proximity to each other in a triangle\\boomerang formation. they moved faster than anything i've ever seen and quickly passed behind the roof of my house. but i was so astonished by the lights and their speed so i immediately stood up on the couch and was able to see them briefly again as they moved nw direction and disappeared again behind the roof of my house. i heard no noise that remotely resembled the sound of jet aircraft. the lights appeared to be multiple separate craft however they could have been multiple lights attached to one object, it moved by to fast to determine. i say that because what was extraordinary is that all of the objects appeared to move at the exact same speed, heading, and altitude in a close proximity. they moved in what appeared to be a straight planned out line and were not in my opinion, meteors, asteroids, or whatnot because of the many indications that they were under intelligent control. in my mind there are only two possibilities of what i saw: secret military operations or something not of this world. unfortunately it happened to fast to record visual evidence."],"Latitude":"40.59226","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-05062011-0020","Disposition":"Unknown","Longitude":"-105.077913","Object Features":"Undisclosed","Date of the Event":"05/05/2011 09:30 UTC","City":"Fort Collins","Case Number":"28982","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.59226,+-105.077913(28982)&iwloc=A&hl=en\"> mufon case (28982) map </A>","Region":"Colorado","Country":"United States"}