{"Longitude":"153.53848","Weather Factors":"Unknown","Object Shape":"Saturn-like","Log Number":"AU-05072011-0004","files":["/var/www/straped/mufon/html2text/28988.html.txt","/var/www/straped/mufon/org/28988.html"],"Object Features":"Undisclosed","Summary":"I saw a white light with a circle around it while laying on the beach in the day.","trends":["There have been no other sightings in Coolangatta","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=-28.168351,+153.53848(28988)&iwloc=A&hl=en\"> mufon case (28988) map </A>","Country":"Australia","Region":"Queensland","divs":["Sighting DetailsI was laying on the sand sun baking at Greenmount beach Coolangatta Queensland Australia sometime between 13.00 and 14.00 on the 30th May 2000.The sky was crystal clear bright blue as we had a frost that morning,which means the air is very clear.The sun was strong and there was no wind and the day got to 21*C. I was looking straight up at the sky and didn`t have my eyes closed as i had a good sleep the night before.From the east(to my right)a small white light with a ring around it came into my vision and moved west(to my left).It got to directly above Coolangatta airport and slowed and appeared to stop momentarily and it then changed direction and went straight up(90 degrees)and moved so fast that it disappeared in a split second.I remember thinking \"what the f... was that\"? It was in my vision for something like 6-10 seconds.My eyesight was very sharp then and i locked onto it and didn`t look away at all for the whole time it was in my vision. A few seconds after that i heard some jet engines rev up as a plane was about to take off. This thing made no noise and was possibly somewhere between 1 and 3 kilometres high at the time. I felt a little spooked by it when i was in my room that night as i couldn`t explain what i had saw. Some years after that i watched the Close Encounters of the Third Kind movie and saw some objects on it that reminded me of the thing i saw. I know that nobody will be able to explain this thing but i will never forget it. I didn`t know of anywhere to report it nor thought that it would be smart to do so. But maybe because it was so close to controlled air space something was detected....probably not. I am happy to be contacted by email."],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"05/07/2011 02:15 UTC","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"28988","Latitude":"-28.168351","Date of the Event":"05/30/2000 12:00 UTC","Disposition":"Unresolved","City":"Coolangatta"}