{"Sighting Duration":"02:00:00","Object Features":"Unknown","divs":["sighting details there are no artificial lights on the lee canyon side of mt.charleston except for the few cars. i lived there in 1997 in a travel trailer just below the intersection of lee canyon road and deer creek road. i was paid to keep an eye on the property of the late *(name deleted--cms\\sg) by his trustees.i also worked a graveyard shift at the mt. charleston hotel and became familiar with the night sky. the halebop comet was clearly visible from my trailer. i watched the shuttle fly over when it prepared to land at edwards. i once saw a shuttle experment where they sprayed zenon into outerspace like a celestial deodorant. the laser from the luxor was clearly visable. everything had an explanation until that september night. working the graveyard shift i listened to art bell's coast to coast and about ten days prior to my sighting art had everyone in his audience do a mind concentration experment to contact an alien spacecraft. i did it for a minute or two and forgot about it until three weeks later when the sighting occured. i played poker at the tables and was going home up the lee canyon road about ten o'clock at night. my window was down and my arm was out the window i looked up to my left there it was. it just drifted along like impulse power but i could see the stars through it. i pulled off the road and got out my eyes fixed on the object. it seemed enormous encompassing entire constellations and miles high but what struck me maybe the most was geometric rigidity all sharp right angles a perfect semicircle in front. i watched it drift toward the mountain peak for about an hour a couple of cars went by but it was black on black with the stars shining through no one else noticed. eventually i noticed the faintist red glow from the right angles and midway up the edge of the rectangle like a lit cigarette at night seen from a hundred yards. it just drifted across the stars and it was still drifting when i got back in my car and drove home about ten more miles. i never saw it again but it took me two or three days before i could tell anyone. i've tried to imagine it on the ground easily a mile long probably several. my guess is the faint red glows are antigravity generaters and it is bending the starlight around it."],"Tags":"City","Summary":"The object appeared slightly darker than the night sky and the stars were visable through it.","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around September 12th 1997"],"Date of the Event":"09/12/1997 10:00 UTC","Object Shape":"Disc, Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=36.118956,+-115.170216(28994)&iwloc=A&hl=en\"> mufon case (28994) map </A>","Disposition":"Hoax","Source":"MUFON","Case Number":"28994","Latitude":"36.118956","Longitude":"-115.170216","Region":"Nevada","Date Submitted":"05/07/2011 02:01 UTC","files":["/var/www/straped/mufon/html2text/28994.html.txt","/var/www/straped/mufon/org/28994.html"],"Weather Factors":"Unknown","Log Number":"US-05072011-0010","City":"Las Vegas"}