{"Log Number":"US-05072011-0015","Summary":"Two orange, brilliant orbs of light ascending fron WNW horizon in non-linear fashion, moving upward but also left and right eliciting shock and awe from observers","Date Submitted":"05/07/2011 10:11 UTC","trends":["There have been no other sightings in Hanover","This sighting has never been favorited."],"City":"Hanover","Case Number":"28999","Latitude":"38.714226","Country":"United States","Object Shape":"Fireball, Sphere, Star-like","divs":["Sighting DetailsAt 9pm EDT, Three men standing on W facing patio of Lambda Chi Alpha chapter house. Two orbs of orange (they were described to me as orange; I am partially colorblind), brilliant light rose from WNW horizon above the tree line (which is at just less than one handlength for me, so approx 8 degrees) in between NW facing corner of greenwood suites and S side of Coulter house. I was positioned approx two feet N of room ten window. Orbs rose quickly, in fashion that appeared faster than typical plane speed. They were glowing like stars--or more closely, nearby planets like mars or venus, although they were even bigger than those--and did not like planes blink so much as shine and glow like distant fire. Most startling was their motion: as they ascended, they moved left and right, one after another. They at times came near each other's angular position but never truly crossed paths. When they began, the higher orb was just above and right of the lower one, no more than 45 degrees in relation to the lower one. As they moved left and right, the lower orb neared being direclty below or even on top of the upper orb. Their left and right motions were similar in speed but not constant; an upward movement of one space right (or left) could be followed by a movement ofthree or four spaces left. Their overall motion began between Greewood suites and Coulter, and ended roughly over the middle of coulter. At a height of around 3 to 3.5 handlengths (I did multiple handlength measurements during the event) the orbs began to fade, eventually disappearing as they rose into a deck of mid to high level clouds (from my juggement, stratocumulus clouds, with some cirrostratus above and possibly altocumulus). The sighting of the orbs elicited fantastic reactions by all involved;all were startled and engrossed instantly. Photographs were obtained by a few people; I can provide them later, but I can;t attach them now, as the people with the pictures are not at this computer). The event lasted probably 1 to 2 minutes ( my friend has timed photographs that can better answer the duration of the event) I can say with full confidence that the two objects moved in ways dissimilar to any plane or flying object I have ever seen, and that their color, size and briallance was equally unusual. Nonetheless, their movement was not incongruent with the possible motions of human aircraft. My friends who were witnesses are ecstatic right now, marveling about how they have sen a UFO and making claims about it being a non-human space craft, but I am assuring them that there is probably a basic, boring explanation. Simply put: I can't explain what I saw"],"Date of the Event":"05/07/2011 12:00 UTC","Region":"Indiana","Viewing Distance":"Unknown","Sighting Duration":"00:01:30","files":["/var/www/straped/mufon/html2text/28999.html.txt","/var/www/straped/mufon/org/28999.html"],"Longitude":"-85.473571","Disposition":"IFO","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.714226,+-85.473571(28999)&iwloc=A&hl=en\"> mufon case (28999) map </A>"}