{"map":"<A HREF = \"http://maps.google.com/maps?q=40.000096,+-105.084906(28995)&iwloc=A&hl=en\"> mufon case (28995) map </A>","Viewing Distance":"Over One Mile","Tags":"City","Weather Factors":"Windy","Case Number":"28995","Date of the Event":"05/06/2011 08:15 UTC","Date Submitted":"05/07/2011 02:16 UTC","Disposition":"IFO","Summary":"Four bright objects in motionless formation hover east of Boulder, CO before dimming and dissappearing.","Region":"Colorado","Log Number":"US-05072011-0011","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/28995.html.txt","/var/www/straped/mufon/org/28995.html"],"City":"Lafayette","Object Shape":"Star-like","Object Features":"Unknown","Latitude":"40.000096","Country":"United States","divs":["sighting detailsat 8:15 p.m., i drove away from the south boulder recreation center after playing tennis with my friend. as i looked east, i saw four unnaturally bright objects in a trapezoid formation in the sky. i became immediately interested because of how unusually bright they were. i drove to the top of a nearby hill (southern hills middle school) to get a better vantage point from which to observe them. it was dusk, and very easy to see the lights. they seemed to be a brilliant white\\yellow light, and they were twinkling. they were many, many times brighter than passing planes and stars that were beginning to appear in the sky. as i observed them, they did not move in the slightest, and seemed to be about 20 degrees above the horizon. after about ten mintes of observing them, one light quickly dimmed to a small point of light, and slowly travelled southward. the remaining three lights did not change from their initial position. after five more minutes passed, another light rapidly dimmed, and traversed south. another five minutes passed, and the second-to-last light dimmed rapidly and followed the path of the other two southward. after another five minutes, the last light dimmed quickly and moved southward."],"Longitude":"-105.084906","Object Flight Path":"Hovering then path","trends":["There have been 6 other sightings in Lafayette","There were no other sightings in Lafayette on or around May 6th 2011"]}