{"Latitude":"39.118153","trends":["There have been 27 other sightings in Kansas City","There were no other sightings in Kansas City on or around May 6th 2011"],"Source":"MUFON","Case Number":"28996","Viewing Distance":"Unknown","Tags":"City","Summary":"long gigar with square on one end like a the back of a plane..looks like a fin pointing up.dark top light bottom NO LIGHTS","Weather Factors":"Unknown","Log Number":"US-08012011-0001","Object Features":"Undisclosed","Disposition":"Unknown","Date of the Event":"05/06/2011 02:01 UTC","files":["/var/www/straped/mufon/html2text/28996.html.txt","/var/www/straped/mufon/org/28996.html"],"Region":"Kansas","City":"Kansas City","Object Shape":"Cigar, Square, Rectagular, Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.118153,+-94.624164(28996)&iwloc=A&hl=en\"> mufon case (28996) map </A>","Country":"United States","Longitude":"-94.624164","divs":["sighting detailsmy boyfriend and i were driveing home westbound on k-32 with my 3 kids sleeping in the back. we had just left the drive-inn after seeing the battle l.a. movie,so when my boyfriend asked me \"what is that\" while pointing up i thought he was playing around, cuz i joke about seeing them all the time.he was'nt lieing this time, cuz i looked up and seen whatever it was.it sorta looked like a blimp with a airplane fin thing on the backpointing up and was square onthe bottom of it. i thought it might be an aircraft from the army base in leavenworth, the kind where each wing has twoengines on them,saw one wekks before. he said it might be birds but it never changed shape while it moved in the air, kinda looked like it was hovering and slowly moving. i did not have one ligt of any color. it was dark on top and had light square looking shapes on the underside, but no lights. plus, it was suuper foggy and a plane would have needed them, it was way to foggy\\cloudy. it also seemed t be very low. dont know what it was but it is something i have never seen before."],"Date Submitted":"08/01/2011 12:18 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed"}