{"files":["/var/www/straped/mufon/html2text/2899.html.txt","/var/www/straped/mufon/org/2899.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Region":"Virginia","Case Number":"2899","map":"<A HREF = \"http://maps.google.com/maps?q=36.962094,+-78.125(2899)&iwloc=A&hl=en\"> mufon case (2899) map </A>","Object Features":"Dome, Window(s)","Object Shape":"Disc","Log Number":"","Source":"MUFON","City":"Kenbridge","divs":["Sighting DetailsI was in the the second floor huge room that covered the whole top part of thehouse. I and three other young ladies. The first thing I noticed was heatagainst my face. It woke me up and I thought the house was on fire. When Irealized it was something outside, I called the other young ladies. One did notwake up. The other two jumped out of bed with me and we ran to the windowlooking out. The window was up...summer time. When I saw it, I knew what it was.We stood and watched it and I was excited. I observed a UFO...disk shape with adome. I could see the windowsportholes. I saw the bottom part rotate in adifferent dirction from the top... I could see some of the mechanism. The lightsfrom it was rainbow colors. The UfO hovered over the pond just right back of thehouse. I was not fearful. I watched as the UFO slowly moved up as to not want todamage anything. When it got high enough...it went straight...right into heavenin a blink of an eye. It was gone. I will never forget that moment in mylife...but would never tell it...didnt want people being judgemental. I felt Iwas blessed to see an awesome sight. Afterwards...I begin to have visions,dreams, and could feel things that other people couldnt. But I didnt talk muchabout it. I felt people would not understand. i dont recall seeing any beings.There is one thing...but I do not want to reveal it online."],"Sighting Duration":"00:30:00","Date Submitted":"11/30/1965 12:00 UTC","Viewing Distance":"21-100 Feet","Summary":"UFO In Virginia 1966","Country":"United States","Date of the Event":"11/30/1965 12:00 UTC","trends":["There has been one other sighting in Kenbridge","There were no other sightings in Kenbridge on or around November 30th 1965"],"Longitude":"-78.125","Latitude":"36.962094","Tags":"City"}