{"Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Hovering then path","Longitude":"-106.482131","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.76847,+-106.482131(28990)&iwloc=A&hl=en\"> mufon case (28990) map </A>","Latitude":"31.76847","divs":["Sighting DetailsAs I left my apartment from taking my lunch break I proceeded north on Langford St. When I got to the four way stop I could see a red blinking light that looked too close for it to be the repeater towers we have along I-10 so I continued north as I got closer I could see the top and bottom red light blinking but not together and on the right side there was a green and white light not blinking I came to the bend of the road and as I got to a clear area that's when I was able to get a better look at what I was seeing. I parked the security vehicle facing north shut the engine off and got down with some bino's as I looked at it this thing was just hovering over by the church but not right over it. Now that is when I noticed that there was no sound of an engine. I served in the military and I know what sounds any aircraft make so this was no type of aircraft. I stayed there for about five min. watching it in aw when it started to move alittle. The two red lights were blinking taking turns as I looked thru the bino's I could only make the top part of the craft as oval and I could not see the rest. Then it just started moving slowly heading west. It kept on going real slow as if it was just floating up there. Skies were clear to where I could look up and see the star's. As it continued westbound I kept looking at it to see if it would turn back. Now this is something that I have never seen before and I know for a fact this was not an aircraft that we have here. I saw this craft go in between the Franklin Mts. and Juarez and then it was gone."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/28990.html.txt","/var/www/straped/mufon/org/28990.html"],"Viewing Distance":"21-100 Feet","Case Number":"28990","Date Submitted":"05/07/2011 09:32 UTC","Log Number":"US-05072011-0006","Region":"Texas","Country":"United States","Object Shape":"Oval","City":"El Paso","Object Features":"Unknown","Tags":"City","Date of the Event":"04/23/2011 04:40 UTC","Summary":"Two red lights on left side one on top and one on the bottom green and white light on the right side next to each other","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around April 23rd 2011"]}