{"map":"<A HREF = \"http://maps.google.com/maps?q=39.421902,+-81.453544(28993)&iwloc=A&hl=en\"> mufon case (28993) map </A>","Country":"United States","Longitude":"-81.453544","Case Number":"28993","Weather Factors":"None","Region":"Ohio","Summary":"Single Bright blue orb seen in sky stationary then moving","Tags":"City","Object Features":"Unknown","Object Shape":"Sphere, Star-like","Latitude":"39.421902","Date Submitted":"05/07/2011 01:59 UTC","divs":["Sighting DetailsOn the night of May 4th, 2011 I got out of college at 9:00 PM. I went home and got to my house at 9:20 PM. When getting out of my car I grabbed my laptop from the back seat and started to walk up my front yard. Upon looking up at the night sky to admire the stars I noticed this bright blue orb up in the sky. Thinking this is just a star I dismissed it rather quickly. After realizing that in my twenty years of living at this house, I have never seen a star this bright in the area. I glanced back up to observe it some more. When I looked back up into the sky (object was located south) this object started moving east at a steady pace across the sky. When this happened I dropped everything I was carrying and was screaming for my mom and sister to come out of the house to see this object. I tried to get my cell phone out to try and get a recording but the blue orb was moving to fast for me to get the video recorder opened up and it was soon about to disappear behind the trees which are located all around my house. My sister and mom came running out the house almost instantly after hearing me scream for fear I somehow hurt myself. I Point to the blue orb and we stood out in the front yard all seeing the exact same thing. This object was a bright, light blue orb that was much larger than any of the stars in the night sky. This orb had a constant light never blinked or flickered like the air planes I see all the time in the night sky. The most significant thing about this light was that it made no noise at all. After about 3 minutes from when I first spotted it in the sky this blue orb was still heading east and now just barely visible threw the trees. Once it wasn't in sight anymore we all went inside and I started asking my mother and sister about this orb while trying to find a video camera just in case it came back. I had no luck in finding one so I immediately called my friend Nathan who lives just down the road from me to tell him all about this incident that just took place. While on the phone with him I was outside scanning every inch of the sky of any sign of this blue orb. At 10:13 PM still trying to explain what I had seen, I spotted another (or same?) blue orb but this was coming from south to north and was at a much farther distance compared to the first time I saw it. This second spotting had the exact same characteristic as the first spotting but was moving across the sky at a highly faster speed than the first one. The orb had disappeared almost as fast as it showed up. I was outside for the majority of the night but didn't see anything else out of the ordinary."],"trends":["There have been 5 other sightings in Marietta","There were no other sightings in Marietta on or around May 4th 2011"],"Log Number":"US-05072011-0009","Date of the Event":"05/04/2011 09:23 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Source":"MUFON","Sighting Duration":"00:45:00","City":"Marietta","files":["/var/www/straped/mufon/html2text/28993.html.txt","/var/www/straped/mufon/org/28993.html"],"Object Flight Path":"Stationary,Straight-line path"}