{"Weather Factors":"Unknown","divs":["Sighting DetailsMy wife and I went to bed around 10:45 pm on Friday May 6th. We have a south facing window looking over the ridge to the East of our home. At 10:58 I spotted a quick flash of light coming from a Cloud partially illuminated by the glare from the City lights. As I watched another light in a circular shape flashed and moved quickly across the same cloud in the same area. I asked my wife to take a look and make sure I wasn't crazy. I pointed to the area and immediatly another light of the same shape and size appeared and moved around through the cloud in an erratic manner. At one point there were at least four lights moving simutaniously through the cloud in several directions. The lights never left the shape of the cloud. They just moved around it very quickly and in erratic patterns. I am quite certain it was not lightning as there were not thunder clouds or sounds associated with the event, and it did not look like any other lightning event I have ever seen. The lights moved in what my wife described as a strobe light effect. They would come and go in several different directions and make circular patterns in the cloud. This lasted until 11:09 pm when they suddenly stopped. A few minutes later one light appeared to head east and there were no more flashes or objects. My first thought was someone was shining several beams of light into the cloud like you would see at a hollywood event but there were no beams coming from the ground and the lights moved in a kind of 3 dimensional pattern if that makes sense."],"Object Flight Path":"Path with directional change","Date of the Event":"05/06/2011 10:58 UTC","Case Number":"28997","Object Features":"None","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/28997.html.txt","/var/www/straped/mufon/org/28997.html"],"Sighting Duration":"Undisclosed","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=40.59286,+-105.078763(28997)&iwloc=A&hl=en\"> mufon case (28997) map </A>","Date Submitted":"05/07/2011 04:25 UTC","Tags":"City","Log Number":"US-05072011-0013","Summary":"Several circular lights in the cloud South of house","Country":"United States","trends":["There have been 65 other sightings in Fort Collins","There was one other sighting in Fort Collins on or around May 6th 2011"],"Longitude":"-105.078763","Viewing Distance":"Over One Mile","Source":"MUFON","City":"Fort Collins","Object Shape":"Flash, Sphere","Latitude":"40.59286"}