{"Summary":"A light was first seen in the downstairs window in the center of the sky moving rapidly towards the house then myself and my friend went outside to see craft fly over house and disappear alongside another.","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"05/08/2011 01:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.622231,+-105.01064(29006)&iwloc=A&hl=en\"> mufon case (29006) map </A>","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsA little after eleven in the evening myself and my friend Kelly were in the basement of her house getting ready to make the bed when we both noticed the light and I said, you need to see this. We had noticed hours earlier that this starnge glowing orb was sitting in the distance over the rooftops of the houses to the west glowing a bright white light and then flickering in reds and a somewhat blueish green light. When we realized the light was traveling extremely fast to the northeast we ran to the window and Kelly went to turn off the dryer to give us complete silence. I was looking through the window alone at this point and I saw the craft get to the corner of the window just in time to hear nothing...there was complete silence in the house and all we heard was the whoosing sound of the wind, no plane or aircraft has ever sounded like this, there was complete silence other than a very faint whoosh, as if the craft was slowing down over our house. I ran outside followed by my friend and I saw a diamond shaped craft just peaking over the rooftop. The craft had two red light to each side and two white lights on the front and back but from a distance the craft would blink between the red and the white lights. When the red lights were visible the white lights were not. But the other strange behavior of the craft is that as it grew closer it would jump forward in darkness before the red lights would be visible again. It looked as thought the craft was coming through pockets of time, disappearing and reappearing closer than before. The other identifying feature I noticed was that when the lights would turn off, it looked as though a star was still travelling towards us. Then the lights would come back on and it would be an on and off with this star and the craft lights until it got closer. I went outside just in time to see the underbelly of the craft which was dark and shadowy with a somewhat geometric design but it was so dark that I could not make out everything under the craft, but mostly it was a diamond with the four lights, when I saw the craft over the house every single light came on, reds and whites, it lit up the rooftops and then I watched the orb dart into the trees, only 100 feet above the rooftops and then when I had thought it dissappeared behind the trees and the nieghbors house next door I noticed that another bright orb was hovering on the left side of the house, one orb on each side probably a football field away but far enough that I had to walk a few feet to find the other orb on th eother side of the house. The first orb dropped so quickly in the sky, at a very very fast rate and the second orb hovered and then followed the first orb darting towrds the ground and then dissappearing along with the other orb. My friend was standing ten feet behind me during both and she was able to see the side view of this strange diamond craft before it was gone and she noticed the other orb instantly. My friend and I drew a representation of what we saw and we could attach the file at a later date. We did not think to grab the camera because it happened so randomly and took us off gurad, we went running just to catch a better glimpse than what I saw from the window. The whole even took less than ten minutes and we were out on the other side of the street when we saw the craft dip below the houses."],"Disposition":"IFO","Region":"Colorado","Object Features":"Undisclosed","trends":["There have been 29 other sightings in Littleton","There were no other sightings in Littleton on or around May 7th 2011"],"Date of the Event":"05/07/2011 11:14 UTC","files":["/var/www/straped/mufon/html2text/29006.html.txt","/var/www/straped/mufon/org/29006.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Latitude":"39.622231","Longitude":"-105.01064","Case Number":"29006","Log Number":"US-05082011-0006","City":"Littleton","Object Shape":"Diamond"}