{"Object Flight Path":"Undisclosed","Tags":"City","Date of the Event":"05/06/2011 12:00 UTC","trends":[""],"Longitude":"-86.574777","Object Features":"Undisclosed","Summary":"White Disc-shaped object","Source":"MUFON","Date Submitted":"05/08/2011 12:45 UTC","Region":"Tennessee","files":["/var/www/straped/mufon/html2text/29001.html.txt","/var/www/straped/mufon/more/29001_submitter_file1__photo(1).jpg","/var/www/straped/mufon/org/29001.html"],"Object Shape":"Disc","Latitude":"35.520641","Case Number":"29001","City":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"00:00:30","Disposition":"Unknown","divs":["Sighting DetailsMy partner and I were sitting on our patio between 5:00 and 5:30PM yesterday afternoon after I arrived home from work. I noticed a white, disc shaped object moving from West to East to the North of us. I can't approximate speed or altitude, however it was obviously not an aircraft. I was seated when I initially sighted the object as it came from behind trees to the North of our house. It then moved due East and disappeared behind another row of trees. I rose from my seat as the object came into view, and asked my partner \"are you seeing this?\". He stated that he was, and he agreed with me that it was not an aircraft. The object moved in a smooth, linear fashion and exhibited no deviation from it's path in the brief time that I was able to see it. I managed to take a picture of the object just before it moved beyond the tree line. I took the picture with my i-phone, so it is unfortunately not the best quality. However, the object appears as the point of light just to the left of the trees. I have attached the picture. The object was larger than it appears in the photo. My reaction initially was one of extreme curiosity, coupled with a bit of excitement. I was also quite certain at the time that there would be numerous reports about this object, sense it passed over one of the most densely populated parts of the city, in daylight, and at rush hour. However, as of the time of this writing I have found no reference to it in any of the local news media outlets."],"Log Number":"US-05082011-0001","map":"<A HREF = \"http://maps.google.com/maps?q=35.520641,+-86.574777(29001)&iwloc=A&hl=en\"> mufon case (29001) map </A>","Country":"United States","Weather Factors":"Unknown"}