{"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=30.333804,+-81.646811(29008)&iwloc=A&hl=en\"> mufon case (29008) map </A>","Tags":"City","Sighting Duration":"00:00:20","Log Number":"US-05082011-0008","Case Number":"29008","Source":"MUFON","Date Submitted":"05/08/2011 01:58 UTC","Viewing Distance":"Unknown","City":"Jacksonville","Object Shape":"Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29008.html.txt","/var/www/straped/mufon/org/29008.html"],"divs":["sighting detailsit was the start of school for my son and he gets picked up by the bus very early in the morning. i was waiting outside in the driveway with him looking up at the stars. i asked him if he had ever seen the big or little dippers and he said no. i found one, (which one i dont know)and was looking for the other to show him. i was looking at these three stars in a row that curved like the handle of a dipper and before i could look for the pan part the first one started to grow brighter and brighter. it was like it was on a dimmer switch and someone turned it up relatively slowly. it got probably 10-15 times as bright as the other stars and then in a snap went back down to original brightness. before i cound get the thought through my head that i had prob. seen a exploding star it started to move. it moved about 3-4 inches in the sky from its original position and then was gone. it took about 5-7 seconds to make that distance from my estimation. whether it went out or moved out of sight i cannot say but it was gone and a space left dark where i had just seen a star. im not saying it was e.t. but i am very courious to know what i saw. if there is an explaination i would be greatful for a reply. i did call the news weather team later that day and reported it - they had no clue and said no one else had made a report. they did say that that distance in the sky would be very, very great for an object to move. i know what i saw. *(wit's first name deleted -- cms\\sg)."],"Longitude":"-81.646811","Object Flight Path":"Straight-line path","Latitude":"30.333804","Country":"United States","Disposition":"Insufficient Data","Summary":"moving star with light variations","Weather Factors":"None","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around August 24th 2009"],"Date of the Event":"08/24/2009 06:25 UTC"}