{"Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Latitude":"44.805052","Log Number":"US-05082011-0005","Object Shape":"Disc, Triangle","Region":"Maine","trends":["There have been 18 other sightings in Bangor","There were no other sightings in Bangor on or around May 7th 2011"],"Longitude":"-68.769434","Tags":"City","City":"Bangor","Date Submitted":"05/08/2011 12:08 UTC","divs":["Sighting DetailsI saw two bright lights out the window.The lights came from the east and headed west. It appeared to look like a jet headed for a landing in my driveway. When I went outside, it changed direction towards my property which is in a rural area. I then noticed there were two sets of lights. As it got closer I could see two triangular shaped vessels. They were very close to each other. There was the sound of machinery, engine. But it was not like the sound of a jet engine,helicopter, prop plane or aotomobile. The air was still underneath it. It was not a very loud sound. I called for my friend in the house to come out and see it. There were many white lights underneath. There were bbright lights at each corner of the isosoles triangle. When looking up you could see inside the vessel. It appeared to be about20 ft across. As you looked up into it seemed to be constructed like a pyramid. Inside the lights you could see geometric patterns. Lights like search beams eminated from it. The light was very bright but not blinding. At one point the light fixated on me for a few seconds and the vessel continued on like what seemed to be a walking speed. As I stared up at the vessel I knew it was other worldly. It came in from the east and then proceeded south sothwest."],"files":["/var/www/straped/mufon/html2text/29005.html.txt","/var/www/straped/mufon/org/29005.html"],"Object Features":"Undisclosed","Date of the Event":"05/07/2011 09:15 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.805052,+-68.769434(29005)&iwloc=A&hl=en\"> mufon case (29005) map </A>","Disposition":"Unresolved","Case Number":"29005","Summary":"Low flying crafts 200 ft above the ground very slow moving bright white lights and red and green illuminated the whole yard."}