{"Date Submitted":"05/07/2011 10:20 UTC","files":["/var/www/straped/mufon/html2text/29000.html.txt","/var/www/straped/mufon/org/29000.html"],"divs":["Sighting DetailsMy Mother woke me up terrified early morning to tell me what she had wittnessed. After I heard her story, I was excited & a bit confused. Here is what my Mother told me. She woke up early that morning as usual & made herself a cup of coffee & went outside to smoke a cigarette. She heard a very loud bang, like an explosion and since it was the weekend, the first thought in her mind was that someone returned home drunk & that day we would hear that someone had crashed into the gate, in our gated community of residence. She said after a few minutes she sees what she thought was a thief. Less then 80ft infront of her she saw a long, skinny figure come running around the corner of the house face ours & when the figure spotted my Mom, the figure faced the wall of the house it came around on & stood still trying to hide. My Mother said the figures height reached the bottom of the start of the roof, which is around or more then 7ft in height. She said it was very slender like a pole & silver. At this point my Mom was terrified & tried not to show it, but wanted to get back in the house before this figure got to her. So she slowly moved back & at that point like the speed of lightening the figure moved from where it stood to a tree that stood about 15ft away & disappeared. It vanished infront of my Moms eyes. My Mother was startled & frightened & never went outside alone that early. When my Mother was telling me the story, she was telling me how this thief looked & was dressed in silver, all confused. She also said the head of this figure was large. It was an exciting story to hear & I wish I could have seen it with my own eyes, I consider my Mom lucky to have experienced such a thing. ps:(we no longer reside at the address where this took place)"],"Disposition":"Insufficient Data","trends":["There have been 23 other sightings in Palm Springs","There were no other sightings in Palm Springs on or around October 11th 2008"],"Date of the Event":"10/11/2008 05:30 UTC","Object Shape":"Other, Unknown","Case Number":"29000","Source":"MUFON","City":"Palm Springs","Country":"United States","Longitude":"-116.537042","Sighting Duration":"Undisclosed","Summary":"A loud bang & alien sighting","Tags":"City","Object Flight Path":"Other","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.837136,+-116.537042(29000)&iwloc=A&hl=en\"> mufon case (29000) map </A>","Log Number":"US-05072011-0016","Latitude":"33.837136","Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"California"}