{"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Date Submitted":"05/08/2011 03:17 UTC","Object Features":"Patterned Surface","Longitude":"-85.221389","Object Flight Path":"Straight-line path","Source":"MUFON","City":"Chaplin","Latitude":"37.897778","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/29010.html.txt","/var/www/straped/mufon/org/29010.html"],"Log Number":"US-05082011-0010","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.897778,+-85.221389(29010)&iwloc=A&hl=en\"> mufon case (29010) map </A>","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in Chaplin","This sighting has never been favorited."],"Summary":"I was outside and saw 2 different triangle UFO's one after the other about 1 min after the first","divs":["Sighting DetailsI was outside smoking a cigarette at my mother in laws house. It is close to Chaplin KY, which is out in the country. I am from Lexington KY, which is a decent size city. I heard what sounded like a Jet plane going over, much louder though but not out of this world loud. I walked out of the back porch to see what the plane looked like and I saw a triangle UFO I would say about 150 yards off the ground I would guess. It was extremely strange to me because I had never experienced any UFO activity before but I was not in a real tizzy because I thought it could be some sort of government black op plane because it wasn't flying that fast but almost looked like it was kind of gliding through the air. It had like a nuclear greenish orange light in each corner of triangle. I thought it was funny but was not overly concerned because it did not do anything that was out of this world, it was probably only flying about 30 or 40 MPH, maybe less, almost like it was looking for something. 2 min later, I started to hear the same sound, like a jet plane, and automatically looked in the same spot the first one was, and flying at the same height, speed and direction was another triangle UFO but my mouth dropped. This one was exactly the same as the first EXCEPT IT HAD A GLOWING NEON BLUISH spinning orb RIGHT IN THE MIDDLE! My heart was beating so hard because as soon as I saw the second one I knew something was weird about it because of the glowing orb. I was shocked and to be honest it was very scary to me. This thing has changed my life, I was never interested in UFO or aliens etc until Jan 14 2011, I will always remember what happened because it was so unbelievable. One real funny thing was a little while after I looked up any kind of triangle UFO and the internet because I wanted to see if anybody else had seen or whatever and found a picture of something called the TR-3B. That is really close to what it looks like"],"Weather Factors":"None","Region":"Kentucky","Case Number":"29010","Date of the Event":"01/14/2011 12:00 UTC"}