{"files":["/var/www/straped/mufon/html2text/29015.html.txt","/var/www/straped/mufon/org/29015.html"],"divs":["Sighting DetailsMy girlfriend and I had decided that after dinner we would like to go stargazing in a pretty remote area near Lake Isabella. After arriving and laying on the car my girlfriend said she had never been stargazing before. After giving her a brief description of the way I usually go about it, she immediatly noticed that the star she was focused on was moving. I asked her to point it out to me with the flashlight. After she did I was amazed, the object was moving in a swimming like motion around a cluster of stars. It stopped and started, all throughout the time we watched it. It would make a circle and then stop, or make a swimming motion, then move to the left or right in a straight line. After about 30 minutes or so of watching it I came to the conclusion that it was in fact something I had never seen before while stargazing and began flashing it with a flashlight (which I believed would have no effect whatsoever). Thats when things got a little more intense. We were still focused on the object in the sky, when a huge blue flash lit up the tree tops to our left, which shocked us. We were not 100% sure if the 2 events were related, but seemed enough like they were that we left right afterward. Once we left neither of us could believe what we witnessed and were still a little freaked out from the flash of light. We got home safe with no further events."],"Longitude":"-118.473141","City":"Lake Isabella","Latitude":"35.618009","Region":"California","Sighting Duration":"00:45:00","Date of the Event":"05/07/2011 10:30 UTC","Viewing Distance":"20 Feet or Less, Over 1 Mile","trends":["There has been one other sighting in Lake Isabella","There were no other sightings in Lake Isabella on or around May 7th 2011"],"Date Submitted":"05/09/2011 03:11 UTC","Log Number":"US-05092011-0002","Object Features":"Unknown","Disposition":"IFO","Case Number":"29015","Weather Factors":"None","Object Shape":"Flash, Star-like","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.618009,+-118.473141(29015)&iwloc=A&hl=en\"> mufon case (29015) map </A>","Country":"United States","Summary":"Star-like UFO seen near Lake Isabella while stargazing.","Tags":"City","Source":"MUFON"}