{"Latitude":"42.043281","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.043281,+-88.076036(29017)&iwloc=A&hl=en\"> mufon case (29017) map </A>","trends":["There have been 8 other sightings in Schaumburg","There were no other sightings in Schaumburg on or around May 9th 2011"],"Disposition":"Unresolved","Region":"Illinois","Longitude":"-88.076036","Case Number":"29017","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Log Number":"US-05092011-0004","divs":["sighting detailsupon backing out of driveway and pulling away slowly going west, i noticed an object with 4 steady lights and 1 blinking light in the center hovering over local water retention area. it caught my eye because it was stationary for a while. i stopped my car in the middle of the street and watched it, thinking i should get my camera phone out and see if i can capture it. object began travelling east\\southeast. movement was instantaneous, it did not pitch and accelerate like a helicopter, it just started moving at constant speed. i turned my car around and followed it to the end of the block to get a better look and object was gone. possibly misidentifed aircraft at odd angle, but highly unlikely because i watched it hover for a good 30 seconds and fumbled for my camera phone. it appeared \"square\" because of the lighting layout, inlike anything i have ever seen on an aircraft. all lights were brilliant white, no other colors were visible. i could not tell the size or distance but it has to have been within 1 mile, it looked to be hovering over the water retention area that is in my community. very unnerving sighting."],"City":"Schaumburg","Object Flight Path":"Hovering then path","Date Submitted":"05/09/2011 04:16 UTC","Country":"United States","Object Features":"Unknown","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/29017.html.txt","/var/www/straped/mufon/org/29017.html"],"Summary":"Object with 4 lights at corners and blinking light in middle hovering for 30-40sec then headed ESE","Date of the Event":"05/09/2011 12:00 UTC","Sighting Duration":"Undisclosed"}