{"Viewing Distance":"501 Feet - 1 Mile","Case Number":"2901","Date of the Event":"03/01/2004 10:55 UTC","Object Features":"Unknown","Latitude":"33.836763","Log Number":"","divs":["Sighting Details1- On 3-1-2004 I was at work at Disneys California Adventure and was watchingone of the bands playing.2- One of the other employees pointed the object out to me. He asked if Ithought if it might be a ballon or a helicoptor3- When I first saw the object I thought it was just a Mickey ballon. It wasjust hovering in the ski and moving slowly.4- I kept watching it because it because it didnt quite move right for a baloonand I noticed that it was moving against the wind.only the last 5 or 6 seconds of the sighting did I get excited when its shapechanged and it shot off at a very fast speed and went out of sight.5- the object was black against the ski no lights or sound that I heard. from myangle it was kind of round but at times it looked like it became more flatlooking. It was in the west but Im not sure of the distance but I would say itwas fairly high. and was slowly moving to the south. after 5 to 7 minutes itsshape turn long strait and shot of to the east and a very fast speed. It wentout of sight after about 5 or 6 seconds after moving off very fast.6- It went behind some building."],"Sighting Duration":"00:10:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.836763,+-117.904984(2901)&iwloc=A&hl=en\"> mufon case (2901) map </A>","Tags":"City","Object Flight Path":"Straight-line path","Region":"California","Weather Factors":"Windy","Object Shape":"Sphere","City":"Anaheim","Summary":"3-1-2004 A UFO over Anaheim Ca.","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around March 1st 2004"],"Longitude":"-117.904984","Source":"MUFON","Date Submitted":"03/01/2004 10:55 UTC","files":["/var/www/straped/mufon/html2text/2901.html.txt","/var/www/straped/mufon/org/2901.html"],"Disposition":"Unknown"}