{"Viewing Distance":"Unknown","Object Shape":"Fireball, Other","Case Number":"29018","Date Submitted":"08/05/2011 12:32 UTC","Disposition":"Unknown","Longitude":"-110.922839","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.223063,+-110.922839(29018)&iwloc=A&hl=en\"> mufon case (29018) map </A>","Country":"United States","Log Number":"US-08052011-0006","Weather Factors":"None","Tags":"City","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around May 5th 2011","This sighting has never been favorited.",""],"divs":["sighting detailsi enjoy taking photos of the different phases of the moon. i do so on a regular basis, opportunity premitting. i was off on thursday (05-05-11) and out in the yard w\\dog around 20:?? i saw a nice photo op of the moon sliver 2nd day after new. i went and grabbed my camera (fuji finepix s1000fd)and tripod. i shoot in manual mode and as i'm a rookie amature, i start low with shutter speed and quick check the display and adjust accordingly. as for the event, i didn't really see it in full bloom until i transferred the photos to pc. i took a series of about 20 pics. since i can only send 3 files, i will focus on the first 5 pics taken. the first 2 (#49 & 50, not incl) were overexposed (approx 6 sec. exp). the next two, #51 & 52, are the shots of interest. both shots are at 1 sec exposure (the moon shot value is lame as i was warming up, but...). i also include #53 as it taken within the same minute as 51 & 52 but shows nothing but the moon. on shot (#51), (set for a 1 sec exposure w\\2 sec delay) i noticed a red spot on my screed display of my \"moon shot\". as i didn't see it with my naked eye, i thought it was probably some \"noise\" so i refocused and took another shot (same settings)approx. 30 seconds later. this time i noticed 2 red dots (on the review screen) well below the area where i saw the first (in relation to the moon). i was kinda curious but didn't want to miss the photo op for the moon sliver so continued my shoot. about an hour later, i uploaded the pics to my pc and took a look. after some magnification, i know what i think i see. curious as to what you come up with. one of the suggestions here is to descibe how i feel during, after etc.; i am an avid astronomer who sincerely believes in other intelligent life somewhere out yonder but also believe that if \"they\" are smart enough they can see us, we won't see them. gotta stay open minded though. i hope these pics have enough resoulution for you decipher something of value\\interest and you have as much fun looking at them as i do."],"City":"Tucson","Object Features":"Unknown","Sighting Duration":"00:00:30","Summary":"Photo Coincidence-Something (appears to be) traveling beyond Moon orbit.","Date of the Event":"05/05/2011 08:45 UTC","Source":"MUFON","Region":"Arizona","files":["/var/www/straped/mufon/html2text/29018.html.txt","/var/www/straped/mufon/more/29018_submitter_file1__Stuff051.jpg","/var/www/straped/mufon/more/29018_submitter_file2__Stuff052.jpg","/var/www/straped/mufon/more/29018_submitter_file3__Stuff053.jpg","/var/www/straped/mufon/org/29018.html"],"Latitude":"32.223063"}