{"Weather Factors":"Unknown","Date of the Event":"05/08/2011 11:50 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"England","Summary":"large triangle one large light in middle flashing no noise sum sort of vapor coming from it approx 1500ft high","Longitude":"-2.885495","divs":["Sighting Detailsi was out night hunting fox and rabits on a farm in tarpoley cheshire england, there was a lite wind and sum cloud in the sky it was warm the time was 1150pm. i had just set my self up under a big old oak tree to nail sum rabits, i put on my lamp it has a red filter as i did this a larg white light appered above me in the sky, i first thought it was a police helicoptor and it was checking me out, as this is quite a common thing to happen out here as people phone in and say they have seen a man with a gun and they are not happy i am sure you know what i mean, well this was not the police helicoptor that was checking me out. i turned off my lamp and it did the same so i turned mine back on and it did the same. i then came out from under the tree i put the beam of my lamp on the craft as i did this it let sum vapor like fog out from its light the craf was triangal in shape looked black in colour and larg it was approx 1500ft up, there was no noise coming from it. i then started to flash my lamp on and off at it and it did the same back , it then spirail up at a speed i can only say was like a flash and it was gone just like that. i was very overwelmed after the sighting as i new i had just had a encountor with somthing very special"],"Log Number":"GB-05092011-0014","Viewing Distance":"501 Feet - 1 Mile","City":"Chester","files":["/var/www/straped/mufon/html2text/29029.html.txt","/var/www/straped/mufon/org/29029.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.197702,+-2.885495(29029)&iwloc=A&hl=en\"> mufon case (29029) map </A>","Country":"United Kingdom","Object Shape":"Triangle","trends":["There have been 6 other sightings in Chester","There were no other sightings in Chester on or around May 8th 2011"],"Object Features":"Other","Object Flight Path":"Stationary","Latitude":"53.197702","Case Number":"29029","Tags":"City","Date Submitted":"05/09/2011 02:28 UTC","Disposition":"Unresolved"}