{"trends":["There have been 9 other sightings in Rockledge","There were no other sightings in Rockledge on or around May 5th 2011"],"Region":"Florida","Object Shape":"Flash, Other","Case Number":"29027","Object Features":"Unknown","Weather Factors":"None, Does Not Apply","Country":"United States","Date of the Event":"05/05/2011 09:10 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Disposition":"Insufficient Data","Date Submitted":"08/01/2011 06:08 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29027.html.txt","/var/www/straped/mufon/org/29027.html"],"Longitude":"-80.727226","Summary":"Strange pulsating light","divs":["Sighting DetailsI was sitting on my patio with my husband right after I got home from work. I typically look in the night sky just on the off chance that I will see something. When the object first came into view I thought it was an airplane. Airplane traffic is a pretty common thing in our area (not busy, but you see them enough). What I thought was odd though was the color and the way the light pulsated. It looked to be a little bit larger than an airplane with a bluish white light. It was traveling from north to south looking like it was heading towards the Melbourne Airport which is about 15-20 miles south of us. I kept watching it and it went no further than the tree line which is about a block behind our home and about 6 blocks long. My husband then started to take notice of what it was that I was looking at. The object then turned around and started making erratic circles looking like it was preparing to land. It then headed back towards the north making me think that it was never looking to land. When it started heading north it slowed down considerably and at one point hovered for about a minute or two. It then continued on its northward path and we never saw it after that as we remained on the patio till about eleven p.m. e.s.t. The thing I thought most interesting is that during the 15 minutes that we witnessed it there was no airplane traffic in the sky which is rare, seeing as how we'll see one about every 5 to ten minutes. We had an intense interest with what it was because it was so out of the ordinary."],"Tags":"City","Latitude":"28.327638","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=28.327638,+-80.727226(29027)&iwloc=A&hl=en\"> mufon case (29027) map </A>","City":"Rockledge","Sighting Duration":"Undisclosed","Log Number":"US-08012011-0031"}