{"map":"<A HREF = \"http://maps.google.com/maps?q=37.963122,+-121.28522(29022)&iwloc=A&hl=en\"> mufon case (29022) map </A>","Summary":"I was told a planet was appearing daily in the eastern sky. I got out my telescope and watched a saucer for over an hour until it got dark. After dark I could only see the white exhaust and flashes of red, blu, green, and yellow.","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Region":"California","divs":["Sighting DetailsAfter a major medical event I was confined in a Skilled Nursing Facility.Several days into this stay I was informed by another patient that a planet was appearing daily in the eastern sky. The next night I went to the patio and saw the planet. One problen was this planet was under the cloud cover.The other problem wqas thios planet was moving about but stayed in the same place. For several days the cloud cover was too low and thick the planet was hardly visible. I had my telescope brought to my location. A male employee told me this white object was Sirius. He also said he had been watching three UFO's oon most nights. The weather cleared and I went to the patio and got the planet in the scope. I looked for a couple minutes and sat ack in my chair.It is hard to describe the emotions that I immediatly felt. It was hard to reconcile what I was thinking with what I was watching. The planet was a saucer. Absolutely no doub t as to what it was. It looked like it had an aliuminium body. It had a flat ottom with ten to twelve circles around and just inside the perimeterof the body. Each circle was emitting a flame that was similar to the flame of a cutting tourch. These flames were all pointed inwasr and would have merged at a point perhaps two times the height of the saucer. The flat bottom joined to a small curve that came around to about one hundred seventy degrees of arc. Then it formed a simetrical dome over the bottom. On top of the dome was a smaller dome that was about one third the diameter of the saucer in width. Both domes together were about one third to one half the diameter of the saucer's diameter in height equally divided. The bottom aluminium appeared to be clean.The body appeared to have a heavy oxidized surface. The small dome looked copper or a rusty color on the surface. The saucer looked like it was well used. I saw no external lights, windows, or, doors. The saucer rotated and went from horizontal to inverted and displayed in every angle possible.I watched this saucer in bright sun light for about twenty minutesa. Soon I had a lot of patients, employees, and student nurses wanting to look in the scope. They all had the same reaction and some had a hard time trying to rationize what they were seeing. After the sun set all you could see was the white flames.The flames never change and don't appear to be used as thrust. The saucer moves off in any direction. After dark a side angle looks like a line. Looking at the bottom you see the circles and flames. Looking at the top you see a white ring with the dark disc in the center.This was quite an experience. I only got o0ne shot of it in the sunlight. The skies were cloudy and this object moved to the south with the same low altitude but the distance increased so much a close view is impossible. Now here is the rest of the story. After four months of observation I have discovered that there are hundres of these saucers in the sky over Stockton.They set like the sun and stars. They rise every night and occupy the same area each night. They are exact copys of each other. They have unique colors and appearance as they move around. Most are very high and they are below and above the high couds which I think are about fifty thousand feet in altitude. Most nights I see two or thjree at low altitude. Then they rise and appear to have a spiral track as they rise. I think this is due to the lateral movement as they rise. They rise until they look as small as stars. Some will stay in that location the next night.I have been observing this for four months. No mention of these in the medioa. I saw two at low altiotude and close together. I thought they were helicopters. Still no mentio0n of these from any source. Are the sheep so content they never look up? I question why so many and so predictable. What are they observing that they would have hundreds in this small area of the sky.I also wonder how long they have been present. Have your members check this out. This is a curious situation that might have a significant purpose. I am also going to contact Mr. Davenport."],"Source":"MUFON","Case Number":"29022","Weather Factors":"Unknown","Date of the Event":"Unknown","files":["/var/www/straped/mufon/html2text/29022.html.txt","/var/www/straped/mufon/org/29022.html"],"Object Features":"Dome, Patterned Surface, Other","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Disposition":"Unknown","City":"Stockton","Longitude":"-121.28522","Object Shape":"Disc","Sighting Duration":"Undisclosed","Latitude":"37.963122","Date Submitted":"08/05/2011 12:44 UTC","trends":["There have been 25 other sightings in Stockton","There were no other sightings in Stockton on or around"],"Log Number":"US-08052011-0008"}