{"files":["/var/www/straped/mufon/html2text/29039.html.txt","/var/www/straped/mufon/org/29039.html"],"Sighting Duration":"00:02:00","Log Number":"CA-05092011-0023","Weather Factors":"None, Heavy","Tags":"City","Object Shape":"Cylinder, Flash, Star-like","Object Flight Path":"Stationary","Source":"MUFON","City":"Kingston","Longitude":"-76.479554","Date of the Event":"12/07/2007 04:30 UTC","Disposition":"Unresolved","divs":["Sighting DetailsI was driving along our country road on the way to work, when I caught sight of this strange, bright object in the sky ahead of me. I knew that it was not a star, it was too large, and in the wrong position for a star. It was a bright, sunny day, not a cloud in the sky, with lots of daylight left in the horizon. I watched this thing very intently, and observed its behaviour closely. It first appeared as a very large, bright obect, but, as I watched it further, I saw it suddenly change to an orange colour, similar to a incandescent light bulb being turned off, and seeing the filament glowing orange. When it changed to orange, it revealed its shape as a large, cylinder-shaped object (ship), with flat ends, and it was hanging motionless in the sky at a 45 degree angle, with its right end pointing downward, and slightly rotated towards me, so that I could see that the end was flat, and elliptical, indicating that the main body of the ship was a round cylinder. I marvelled at this thing, realizing that indeed it must be a UFO, and I was just so amazed at this possibility! Then I saw it flash, in rapid succession, twice, and as I rounded a corner in the road, I lost sight of the thing behind the trees. But, it only took around 2 minutes to get past the corner, and on to another straight stretch of the road, and into a clearing where I could once more get a clear and a panoramic view of the sky. I knew exactly where to look up to find the object once again, but to my surprise, it was completely gone! I looked everywhere that I could, but there was no trace of it to be seen! I could hardly believe what I had just seen-a real UFO! I later asked around town, to see if anyone else had seen anything unusual in the sky, but to no avail, so I kept it to myself, except for telling family and close friends. However, I recorded the details of my sighting for my own experience, and sat on the information until finally deciding to report it to a legitimate UFO tracking agency."],"Case Number":"29039","Object Features":"None","Country":"Canada","Summary":"Caught sight of object in sky while driving. Appeared as very bright star at first, then turned orange, flashed two times, then disappeared.","Date Submitted":"05/09/2011 09:19 UTC","Latitude":"44.237232","Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=44.237232,+-76.479554(29039)&iwloc=A&hl=en\"> mufon case (29039) map </A>","trends":["There have been 10 other sightings in Kingston","There were no other sightings in Kingston on or around December 7th 2007"],"Viewing Distance":"Over One Mile"}