{"Latitude":"39.710276","Region":"Ohio","Country":"United States","trends":["There have been 8 other sightings in Beavercreek","There were no other sightings in Beavercreek on or around May 15th 1990"],"Tags":"City","Date Submitted":"05/09/2011 03:25 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29031.html.txt","/var/www/straped/mufon/org/29031.html"],"Longitude":"-84.060618","map":"<A HREF = \"http://maps.google.com/maps?q=39.710276,+-84.060618(29031)&iwloc=A&hl=en\"> mufon case (29031) map </A>","Date of the Event":"05/15/1990 12:00 UTC","City":"Beavercreek","Source":"MUFON","divs":["sighting details...because it has no brain. the 5 photos i took was a different shape. yet in each shot on the film it was one same object. dr. b. macabee analyzed them and authenticated them to be a moving object, not a hoax. i knew they were not yet understood since people do these things. in the photos they are saucer in shape with a field around it. though it has been many years past i did not report the second sighting of the same type ship. (seen others in different ships) this one quite larger in size. did not have a camera but did have my dad with me who jokingly called me a nut. but not after this! it was a mofon f.i. that came to my house. asked lots of questions. he could see i was being honest. though at least 3 times he asked me if i was sure i'd not read about ufos and had not. then he gave me a book to read saying 'if at any time you start to feel upset, stop reading. it was upsetting yet found a relief because i now had an understanding of many things. to this day, though i can not proove it, the worse is having (seemingly) a child taken from me while only a few weeks pregant. is female. called it me 'wise baby dream' until.. then saw her again when she was around 6\\7 yrs old in earth years. i call her my star-child yet wonder still... and always will. do not know for sure but a few years ago woke up and by blue eyes had turned green as grass litteraly overnight. not sure if it was them or not. not once have i asked mufon or did any type research. so now i am ready to know, if you would kindly tell me if this has happened to others. when i last contacted mufon i needed time to integrate all i had learned. by rhe way my last name was revis at the time. no one ever contacted me once the photos i kindly gave permission to use at a mufon gathering. am still at the same address. thats basically it. to let tou know me and my dad saw one again...if there is such a thing as a mother ship it would be one. and curious if anyone else woke up with their eyes a different and intense color. (later turned back to my normal color. my mom was aghast! how could anyone know how *i* feel? they are my eyes, after all!) thank you for letting me share and vent a bit and update too. please, i need help to know about what happened to my eyes. sincerely, linda seay-skaggs (revis)"],"Object Flight Path":"Undisclosed","Object Shape":"Circle, Disc, Other","Log Number":"US-05092011-0016","Viewing Distance":"Unknown","Summary":"Disquised as before but BIGGER. Like 'dots' or a huge hoard of insects. Yet makes you 'think' what you see. Took photos of the first one. MUFON has them.","Disposition":"Insufficient Data","Case Number":"29031"}