{"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.643259,+-85.132995(29049)&iwloc=A&hl=en\"> mufon case (29049) map </A>","files":["/var/www/straped/mufon/html2text/29049.html.txt","/var/www/straped/mufon/org/29049.html"],"Case Number":"29049","trends":["There have been 11 other sightings in Connersville","There were no other sightings in Connersville on or around May 4th 2011"],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["sighting detailsmufon investigator submitted this report on behalf of reporting witness. witness submitted e-mails to mufon after posting a may 4th sighting description on a local topix.com form: the following was stated in the form by the witness: may 4, 2011 at 9:25 pm \"something\" was out in the posey township boonies flying around, silent. very bright sphere. came in from the south. slowed down down, then headed southeast in a zig-zagging motion (no pun intended) i even sent an email to certain friends just in case it was observed by someone else. like above, let er' rip. the form gererated several supportive as well as negative comments. in e-mails to mufon the witness wrote: just in case something is said about people seeing something bright in the sky about 9:25-9:35 tonight, i saw it. came from the south, light went dead for about 30 seconds, then bright again heading se. no sound. it was not a plane. laugh, whatever but it was something. and: i sent this email as a backup incase someone saw what i did, it worked. and: i am close to wright pat. afb. saw a cigar shaped, purple lights back in 1969. was documented in a paper called the eastern indiana farmer. glad, because dad thought i was nuts. (senior in hs). this was shaped like a sphere, white light,not a beam or anything, not red. it stopped above the house, then left in a zig-zig motion, then gone. i am 59\\60 (july). like they all say, i know what i saw. that is why i sent the email, for a backup."],"Date of the Event":"05/04/2011 12:00 UTC","Date Submitted":"05/11/2011 01:02 UTC","City":"Connersville","Country":"United States","Log Number":"US-05112011-0003","Object Flight Path":"Path with directional change","Longitude":"-85.132995","Region":"Indiana","Latitude":"39.643259","Object Features":"Unknown","Object Shape":"Sphere","Summary":"Bright white Orb","Disposition":"Unknown","Tags":"City"}