{"Case Number":"29042","Object Shape":"Star-like","Disposition":"Unknown","Log Number":"US-05102011-0002","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Date of the Event":"05/05/2011 09:36 UTC","Region":"Florida","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Source":"MUFON","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsI was in the Food World Parking Lot at Northcross shopping center. I was watching the moonset because it was a deep oranve crescent moon and very big on the WNW horizon. I noticed a very bright star to the left of the moon. It was a little higher on the horizon and less NW than the moon. I thought it was Venus or something. It was still and didn't blink, shrink,or grow in appearance or brightness. After about 6 minutes it started blinking and moving north. It crossed over the moon ( or appeared to from my viewpoint) and slowly went northwest to north. After it started moving, I noticed the blinking lights. blue-white looking. hardly noticeable. I watched it for a few, and wondered if it was a plane, ho could it be so still for so long? It's not a helicopter. I know those. I know what their lights look like. It could be man-made, but I don't know what it was. I didn't feel anything special. No excitement, nothing. I honestly don't remember how I lost sight of the object. I was looking at it moving, then My memory is blank on whether it went behind the horizon or trees or blinked out. Seriously. I was tired, waiting for a friend to come out of the store and aching all over. I was more excited about the moon being so dark orange-reddish brown as it was setting. The light was just something I observed while watching the moon set."],"files":["/var/www/straped/mufon/html2text/29042.html.txt","/var/www/straped/mufon/org/29042.html"],"Sighting Duration":"Undisclosed","Date Submitted":"05/10/2011 03:49 UTC","Country":"United States","City":"Pensacola","Summary":"Bright star-like object. Stationary for over 5 minutes then slowly went North.","Longitude":"-87.212805","Latitude":"30.426709","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around May 5th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.426709,+-87.212805(29042)&iwloc=A&hl=en\"> mufon case (29042) map </A>"}