{"City":"Cheviot","files":["/var/www/straped/mufon/html2text/29040.html.txt","/var/www/straped/mufon/more/29040_submitter_file1__UFOOregon-1.png","/var/www/straped/mufon/more/29040_submitter_file2__ufo-trindade-brazil-1958.jpg","/var/www/straped/mufon/org/29040.html"],"divs":["Sighting DetailsI'm reporting this for my adult niece who is a little too freaked out. I typed her story as she told it to me: I was sitting in the living room engrossed in an online chat with my brother. It was nearly dark outside, the front door faces north. Out of the corner of my eye, I saw piercing white and red lights shining brightly through the small windows at the top of the door. They were very bright like police lights, very piercing bright red and white lights. At first I thought it was some kind of emergency vehicle. I went to the door and on tip toes peeked out the little windows at the top of the door. I saw white and red lights all in a row and on a slant passing above the house. I ran into the kitchen window (faces south) and that's when I got a really good look. It looked like it was moving really slowly, but it probably looked slower than it really was, from it's altitude I might guess it was moving 40mph, but I really can't say for sure. I do know I had time to run from the front to the back of a small house (2 rooms) and had to wait about 30 second for it to appear above the house in the back. I called my cousin downstairs and she saw it too. It was a football-like shaped UFO about the size of a car with a very thin lip around the edge that had the lights on it. There were one or two bright white lights on each end and a bright red light in the middle. The white lights on the ends were thinner but longer, which is why I think there may have been two together on the ends. The red light in the middle was much larger, shorter but fatter, like doubled up. I couldn't tell what color the object was, but I didn't see any kind of shiny surface reflecting light. I would say it was about 150 feet above the house, it was far too close to be a plane or helicopter and there was absolutely no sound and no wind from it. It paused for about 30 to 60 seconds in the sky in a clearing between some trees over the street behind mine (which is lower, I can see over those rooftops), then it moved eastward behind the trees. Then a second UFO just like it suddenly appeared in the clearing where the first was seconds before, and it moved off to the south in a very similar fashion to the first one. My blood pressure started to rise and I started to sweat and feel really hot, even though I wasn't afraid of it, per se. My heart was racing, I guess from adrenaline. I called my aunt and mom who live less than 2 miles from here. They couldn't see it from their house, so they raced over within 5 minutes, talking to me on the phone the whole way, but the objects had disappeared behind trees by the time they got there and they didn't see them. End of my niece's story. I'm the aunt she called and I will tell you that she was extremely tense when she called us, so we kept her on the phone while we raced over as fast as we could. She was describing in very anxious tones exactly what she was seeing while it was happening begging us to please hurry! Unfortunately, it was gone by the time we got there not 5 minutes later, but I believe my niece. She doesn't know ANYTHING about UFOs, stuff like this never even crosses her mind. She was afraid we would think she was making it up, but I could tell by the anxiety in her voice this was all very real, plus she had a second witness in her cousin who also lives in the house. This sighting occurred over Cheviot, Ohio which borders the west side of the city of Cincinnati proper and is a very populated area with lots of houses and street lights. I had her sketch a picture of what she saw immediately after she told us about it. Unfortunately I'm unable to scan it tonight, but I'll keep it and hopefully can add it to this report later. In the meantime, she went online to look for things that were similar. She said the lights looked a lot like this UFO Oregon shot, only without the one light on the top. And she said it was similar in shape to the Trinidad shot, only the lip that circumvents it was much less pronounced, and held the lights."],"Longitude":"-84.606669","Source":"MUFON","Log Number":"US-08082011-0125","Date of the Event":"05/09/2011 09:45 UTC","Region":"Ohio","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Dome, Other","Weather Factors":"None","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Case Number":"29040","Date Submitted":"08/08/2011 09:31 UTC","trends":["There have been 2 other sightings in Cheviot","There were no other sightings in Cheviot on or around May 9th 2011","This sighting has never been favorited.",""],"Viewing Distance":"101-500 Feet","Summary":"Football shaped UFO flew silently over house, joined by a 2nd one","map":"<A HREF = \"http://maps.google.com/maps?q=39.161903,+-84.606669(29040)&iwloc=A&hl=en\"> mufon case (29040) map </A>","Latitude":"39.161903","Tags":"City","Object Shape":"Disc, Egg, Oval"}