{"divs":["Sighting DetailsAt approx. 820 pm, March 3, 2004 Las Animas, Colorado - Southeastern Colorado Iheard a very load roar while watching T.V. in my front room. I went out side tohear what appeared to be a B1-B bomber at an altitude of 500 feet off theground. At this time the sound was extremly loud and much louder than a B1 LasAnimas is located in an MOA - Military Operations Area where B1s, fighter jets,B-52, F-117s train. I expected to see some type of airplane lights and strobesB1 strobes are usually a brilliant very fast strobe, all I did see was a largeoval white light, no stobes moving to the North. It appeared to be at a heightof a commerical jet, 20,000 plus feet. After watching the light move off to theNorth, I went inside and called the Pueblo 80 miles west of Las Animas Airporttower. They said that my area was out of their radar range and I needed to callDenver Central. I did call Denver and related to them the lightcraft and sound.The gentleman I spoke to said he would check and see if there was any militarytraffic or any aircraft in my area at that time. After several minutes he cameback on the phone and told me that it was not a B1 bomber or any military planeor commerical jet, but he did say that it was a classified aircraft on aclassified mission and that is all he could say about the event I have watched alot of aircraft over the years in this area and seen some strange aircraft, butthis one event was very unusual"],"Tags":"City","Object Shape":"Oval","Summary":"Classified Military Aircraft - UFO over Las Animas","files":["/var/www/straped/mufon/html2text/2904.html.txt","/var/www/straped/mufon/org/2904.html"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Longitude":"-103.222708","Country":"United States","Date Submitted":"03/04/2003 08:20 UTC","trends":["There has been one other sighting in Las Animas","There were no other sightings in Las Animas on or around March 4th 2003"],"Latitude":"38.066674","Case Number":"2904","map":"<A HREF = \"http://maps.google.com/maps?q=38.066674,+-103.222708(2904)&iwloc=A&hl=en\"> mufon case (2904) map </A>","City":"Las Animas","Sighting Duration":"00:05:00","Object Flight Path":"Straight-line path","Source":"MUFON","Disposition":"IFO","Region":"Colorado","Viewing Distance":"Over One Mile","Date of the Event":"03/04/2003 08:20 UTC","Log Number":""}