{"Object Flight Path":"Straight-line path","Weather Factors":"None","Object Shape":"Circle, Oval","Disposition":"Unknown","Latitude":"37.78261","Log Number":"US-08052011-0010","files":["/var/www/straped/mufon/html2text/29051.html.txt","/var/www/straped/mufon/org/29051.html"],"Sighting Duration":"00:00:05","Country":"United States","Longitude":"-122.411886","Date of the Event":"04/01/2011 01:30 UTC","Tags":"City","Region":"California","divs":["Sighting DetailsOn April 1st 2011 at about 1:30 A.M. I just got done watching a movie. I was about to watch another movie. I stepped outside on my back porch to have a smoke before the next movie.It was a clear night no clouds you could see all the stars. It was just a beautiful night. As I was standing on my back porch I was looking down at the ground and I see lights reflecting on the ground. And I have never seen lights reflecting off the ground before when I was standing on my porch at night. So I thought that was kind of funny. And I have lived in this house for many years. So to see lights reflecting off the ground was not normal. Anyway I look up to see what the lights were I see up in the sky 2 oval shape amber colered lights that were pulsing in the middle was a small round light it was orange the orange light was not pulsing it stayed bright orange the whole time. It was moving real slow. I watched this thing for about 5 seconds then it was like someone turned off a light switch and it was gone. I was so triped out by this thing that I called one of the local news stations later that moring and ask to speak to someone in the metorology. I asked The person I spoke to if anyone had called in about any thing strange. And he told me he had just got in and had not had a chance to look over anything. I asked him if I could call back later and he said yes. But I never called back. The thing I saw was kind of big and it was nothing I have ever saw I know it was not from this world. And it was not any kind of natural phenomenon. Like I said it was a clear night and this thing it was like someone turned on a light because there was nothing around this thing when it came on or when it went off. And it was flying real slow and there was no noise coming from this thing. It was the strangest thing I have ever seen in all my life I am 49 years old. Now ever time I go out onto my back porch to have a smoke at night I find myself looking up at that same spot hoping it will show itself again. But I know that it was more then likly a one time deal. But it is something I will never forget"],"Case Number":"29051","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around April 1st 2011"],"Date Submitted":"08/05/2011 12:56 UTC","City":"San Francisco","map":"<A HREF = \"http://maps.google.com/maps?q=37.78261,+-122.411886(29051)&iwloc=A&hl=en\"> mufon case (29051) map </A>","Summary":"Pulsing amber lights with small orange light in middle","Object Features":"Unknown","Viewing Distance":"Unknown","Source":"MUFON"}