{"Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","Region":"Virginia","Date of the Event":"05/09/2011 08:54 UTC","Date Submitted":"05/11/2011 09:54 UTC","Case Number":"29061","Longitude":"-77.480962","Summary":"Arch of lights on the western horizon.","City":"Ashburn","Object Features":"None","Object Flight Path":"Stationary","Object Shape":"Star-like, Other, Unknown","Latitude":"39.045167","Tags":"City","divs":["Sighting DetailsAshburn, Virginia 8:50-9:00pm Monday, May 9th 2011 I was leaving work at around 8:50pm and noticed a group of people out in the employee parking lot. I walked over to them and one of them told me to look in the sky to the west. I looked and was amazed to see a arch of lights in the sky, obviously flying crafts of some kind. I first thought they were planes, being that Dulles Airport is about 8 miles away. I asked if anyone had a video camera or phone, as mine was out of batteries. There were 2 short videos shot, one of them is attached, the other I am waiting to get from someone else that was there. The person that took this video had already been watching the lights for 10 minutes before I arrived, with no change in formation, just remaining a steady arch in the sky. I stayed for another 3-4 minutes watching in awe and then the arch broke into 2 seperate small bundled formations with a bright light seperating the two. The lights were white and the center light appeared to be changing colors from redish to white. I watched this for about 5 more minutes and got into my car to go home. One thing that I did notice was that there was NO air traffic in the sky. While driving home, I could see the lights in my rear view mirror. By that time there were only 2 visible and they dimmed away. I have no idea what we saw, if the military was doing training or if they were helicoptors in a formation. All I know is that it was really odd and after being in the Marines for 5 years, I have never seen anything like it."],"Country":"United States","files":["/var/www/straped/mufon/html2text/29061.html.txt","/var/www/straped/mufon/org/29061.html"],"Log Number":"US-05112011-0015","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Ashburn","There were no other sightings in Ashburn on or around May 9th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.045167,+-77.480962(29061)&iwloc=A&hl=en\"> mufon case (29061) map </A>","Source":"MUFON"}