{"Longitude":"-115.171316","files":["/var/www/straped/mufon/html2text/29060.html.txt","/var/www/straped/mufon/more/29060_submitter_file1__100_3562.JPG","/var/www/straped/mufon/more/29060_submitter_file2__unfio.jpg","/var/www/straped/mufon/org/29060.html"],"City":"Las Vegas","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"05/11/2011 09:36 UTC","Object Shape":"Boomerang, Bullet, Missile, Circle, Cross, Diamond, Egg, Fireball, Flash, Oval, Square, Rectagular, Star-like, Teardrop, Triangle, Other, Unknown","Log Number":"US-05112011-0014","map":"<A HREF = \"http://maps.google.com/maps?q=36.118206,+-115.171316(29060)&iwloc=A&hl=en\"> mufon case (29060) map </A>","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 10th 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Latitude":"36.118206","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"05/10/2011 09:30 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy first incounter was last year (10-2010) it was at night, around 11:30pm and i was in bed watching tv and the blinds was open because i like to see the Airplanes flyn by. everytime a Airplane go by; I would look out the windows and when i saw these lights, i thought it was a Airplane, until i got up and looked out the window and saw an UFO flickering, white, blue, green, red, purple, a yellowish orange color and then it turned completly black. it was right in the back of my house, just in the air. I grab my camera in starting taken pictures and filmimg it. I woke my husband, sister and my neice up; to come in wittnes what im seeing. I wasnt scared at all, it just seem so crazy because; even do the Air Force; tries to tell you, that not a such thing! then you see it with your own eyes, is a blessing. i dont know why it choose to stop behind my house but it did. Ive been taking pictures and recording since then. I have over 80-pictures and around 30 recordings. They know im taking pictures and recording of them! sometime they'll put on a good show. I've notice right after that, everywhere i went; i will see as ther appear; looking like a star; they will follow. About a month ago, i was on my way home in seen one by the moon and i wanted to take a picture of it, and i really couldnt get a good picture, so i continue to try to focus on it, and the process i started to take the camera, everywhere i saw particiles, which lead down to the ground and right infront of my window. About an hour later, i got in the bed, then an the corner of my eyes, i saw what looked like a white piece of glitter going by me. I asked my husband to turn off the lights, so i can see better. i took pictures that night and recorded what i caught; little balls was coming out everywhere. sometimes i know their is there without turning on my camera and i took picture last night and recorded; outside and in my room and there they was. I'm not scared, but i do want to know, whats goin on. I'm asking for help; because this truely mean something. Thank You"],"Source":"MUFON","Country":"United States","Region":"Nevada","Case Number":"29060","Summary":"They look like stars but there not! they change colors as well as shapes"}