{"Latitude":"48.431641","Disposition":"Unresolved","Region":"British Columbia","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/29063.html.txt","/var/www/straped/mufon/org/29063.html"],"Object Features":"Undisclosed","Viewing Distance":"21-100 Feet","City":"Victoria","trends":["There have been 14 other sightings in Victoria","There were no other sightings in Victoria on or around July 8th 2006"],"Date Submitted":"05/12/2011 12:30 UTC","Date of the Event":"07/08/2006 03:15 UTC","divs":["sighting detailsi was sitting in an outdoor hot tub with a friend, at roughly 3:15 pm, on the deck of a house 30 feet from the beach. i was facing east. my friend was facing north. i saw a bright round light come straight down from the sky, to 50 feet above the water, then make a sudden and sharp 90 degree angle, and disappear from view behind a small island. the light moved at incredibly fast speed, faster than anything man made. it is the only time i ever saw anything like that. __________________________________________________ i had another experience: i had a sense that my spirit rose out of my body, while i lay in my bed, and flew on a light beam right through the closed glass window into the future. i saw a situation that i was told about one week later. it was as if someone took my spirit into the future on a light beam, showed me something, then sent me back in time to the present. when i came back to my physical body, i saw a luminance ball of living sparkling light, that landed on my chest, and dissipated into my body. i sat up to meet the ball of light and was so shocked, i threw off my nightgown, but the light dissipated into me anyway. __________________________________________________ i had another experience: that i was shown a huge ship or container, with a specific handle that caused the ship\\container to lift off the ground, and fly over a body of water. this was a huge anti-gravity device."],"Longitude":"-123.363536","Weather Factors":"Unknown","Source":"MUFON","Country":"Canada","Case Number":"29063","Log Number":"CA-05122011-0001","map":"<A HREF = \"http://maps.google.com/maps?q=48.431641,+-123.363536(29063)&iwloc=A&hl=en\"> mufon case (29063) map </A>","Object Shape":"Circle, Sphere","Summary":"huge ball of bright light"}