{"Date Submitted":"05/11/2011 11:49 UTC","Case Number":"29062","Object Flight Path":"Straight-line path","Longitude":"-92.651302","divs":["Sighting DetailsI was walking home from a friend's house. It was very dark outside. I looked up to look at the moon, looking at the stars, and, well looking for U.F.Os as I was walking. Then I saw this brilliant orange light. It was about the height of an average air plane so that is what I thought it was at first. It only took me a good 2 seconds until I realized it was a U.F.O. It moved at the exact pace of an air plane but after I took a picture of it with my phone (which did not come out very well)there were three lights flashing on the back side of the orange light. The colors were white, green, and blue. later there was white light flashing at the tip making out a cone shape. I was nervous, I panicked. So I ran the rest of the way home (which was not to far away to begin with). When I got to the back door I stopped to see if it was still there but then I saw something more. Next to the flying object was another flashing light that was very still but it had a very dim and thin ring around it. I ran inside and got a digital camera but I never used this camera before so I had trouble turning it on. By the time I got it working I ran back out side to take a picture, but they were gone. The orange light and the still saucer."],"Summary":"slow orange light with flashing lights making cone shape","Log Number":"US-05112011-0016","trends":["There have been no other sightings in New Sharon","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.470002,+-92.651302(29062)&iwloc=A&hl=en\"> mufon case (29062) map </A>","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Region":"Iowa","Latitude":"41.470002","Tags":"City","Date of the Event":"05/10/2011 09:19 UTC","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/29062.html.txt","/var/www/straped/mufon/org/29062.html"],"Object Features":"Unknown","City":"New Sharon","Object Shape":"Cone","Source":"MUFON"}