{"Tags":"City","Disposition":"Unknown","Object Flight Path":"Unknown","Date of the Event":"05/11/2011 10:00 UTC","Viewing Distance":"Over One Mile","Latitude":"32.440071","Weather Factors":"None","Sighting Duration":"00:00:10","Source":"MUFON","divs":["Sighting DetailsI took my dogs for a walk a little before 10pm. We drove to an undeveloped subdivision in Marana. There are no lights, except in the distance, and the moon was bright enough to see the roadway clearly. There were no clouds. I was admiring the starry night when a light came on slowly in the west. The light glowed a dull yellow orange glow, turned off, and an identical second light appeared,as it went off, a third orange light came on. The pattern seemed triangular, as if the lights were separate corners of a single object, and not a single light moving along. I had the impression of a large object quite a distance away (a mile or more), moving slowly, about 20 degrees above the horizon. I waited for the lights to blink on a second time, but there was nothing else. The whole sighting lastedonly a few seconds. I see lots of planes passing over at night, and the lights appeared nothing like the lights on planes. However, the lights did appear to be in the direction of a small airport, so it can't be ruled out. I would not report this short duration event, but I am curious whether anyone else may have seen the same thing."],"Summary":"Dull orange lights flash in sequence","Case Number":"29075","map":"<A HREF = \"http://maps.google.com/maps?q=32.440071,+-111.215752(29075)&iwloc=A&hl=en\"> mufon case (29075) map </A>","City":"Marana","Object Features":"Unknown","trends":["There have been 3 other sightings in Marana","There were no other sightings in Marana on or around May 11th 2011"],"files":["/var/www/straped/mufon/html2text/29075.html.txt","/var/www/straped/mufon/org/29075.html"],"Log Number":"US-05132011-0001","Date Submitted":"05/13/2011 12:32 UTC","Object Shape":"Circle, Flash, Triangle","Country":"United States","Region":"Arizona","Longitude":"-111.215752"}