{"Region":"Michigan","trends":["There has been one other sighting in Fremont","There were no other sightings in Fremont on or around May 12th 2011"],"Country":"United States","Object Shape":"Blimp, Circle, Disc, Egg, Fireball, Oval, Sphere, Star-like, Unknown","Viewing Distance":"Unknown","Date of the Event":"05/12/2011 04:00 UTC","Longitude":"-85.942001","City":"Fremont","Object Flight Path":"Hovering then path,Path with directional change","Summary":"Orange-orb u.f.o.","Weather Factors":"Unknown","Tags":"City","Object Features":"Undisclosed","Disposition":"Unknown","Date Submitted":"05/13/2011 03:05 UTC","Source":"MUFON","divs":["Sighting Detailsearly in the morning, around 4 a.m., myself, and two friends were standing in a rural driveway chating after we finished some home repair. at one point in our conversation i was relating to one friend how i have researched so much u.f.o. reports, and would love to see one(in which i had never).as soon as i had finished saying that i noticed a bright orange object, seen though a treetop, and at that point i said, \"what the hell is that\", as i point up twords the orb of orange light. at that point immediatly the object intensafied to a brighter, sustaind glow. as soon as my two friends saw the object, i was already moving away from the tree to get a clearer view. the object was in the western sky at about a 45 degree angle, i was standing near maple island log homes, on maple island rd. once in the clear i could see the orb of light dim to almost invisable with the only thing i could see was a dark orange glow with a darker center. very faintly still, it changed direction from heading twords us to traveling sw, within 5 seconds it was out of view. i was immeditly emotional, with water welling in my eyes and a heavy feeling in my chest, and i got shaky."],"Case Number":"29079","Log Number":"US-05132011-0005","files":["/var/www/straped/mufon/html2text/29079.html.txt","/var/www/straped/mufon/org/29079.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.467517,+-85.942001(29079)&iwloc=A&hl=en\"> mufon case (29079) map </A>","Sighting Duration":"Undisclosed","Latitude":"43.467517"}