{"Summary":"long cigar shape, very bright, silver and shiny","Case Number":"29084","Log Number":"US-05132011-0009","divs":["Sighting DetailsI was out on the back deck smoking a cigarette, it was a bright sunny day, about 4pm, with clouds and I happen to look up toward the west in the sky and that was when I had seen a long, cigar-shape, type of unidentified object. It was a very long-distance away, but I could still be able to tell what type of shape and color. The color was a bright, silver that was shiny as if it was illuminated in the sky. There were clouds in the area it was at, and as it was streaking across, it went into the one area of clouds, and never returned to the other side. I am certain it was not any type of plane, or helicopter since of the shape and color and they way it streaked, and the fact it completely disappeared and did not return to my view after flying into the clouds. They way it flew was a fast, streak across the sky type of pattern. I knew instantly, that it was not something that the military uses, since we do have a air base here, and you always see aircraft flyng, but this was not anything I have ever seen before especially with the color, shape, and flyng pattern. At first, I was at a still, and did not want to move or turn away, since I was afraid that it was going to disappear, but it took only a minute to lose sight of it. I know what I have seen, and not one person could convince me that these type of happenings are not real. There is something that is going on, and it has been for thousands to millions of years, till the present time of today."],"Object Features":"None","Country":"United States","Tags":"City","Weather Factors":"None","Object Shape":"Cigar, Unknown","Date of the Event":"05/10/2011 04:30 UTC","files":["/var/www/straped/mufon/html2text/29084.html.txt","/var/www/straped/mufon/org/29084.html"],"Latitude":"39.46032","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.46032,+-77.958337(29084)&iwloc=A&hl=en\"> mufon case (29084) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"05/13/2011 06:00 UTC","Region":"West Virginia","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Martinsburg","There were no other sightings in Martinsburg on or around May 10th 2011"],"Longitude":"-77.958337","Disposition":"Insufficient Data","Source":"MUFON","City":"Martinsburg"}