{"Sighting Duration":"Undisclosed","divs":["sighting detailssaw two boomarang ufos in the west looked like they were over us75 . my wife and i were just leaving the sonic about 7:30pm today 5\\11\\2011. a line of thunderstorm had just passed through the area and it was still raining lightly. we pulled into the grocery store parking lot across from the sonic drivein. with the truck facing west we continued to look at two boomarang clouds white, sharp tips instead of round. they were intese white, while the clouds above them were dark vinilla. the sky looked like it was starting to clear in the west, but just barely. i could see two layers of clouds one passing over the other in different directions. the lower clouds hung down like drap bunchings sagging down like gumdrops across the sky. the two white boomarang shaped clouds, were sitting at a angle the right side of the boomarang higher than the left. still and not moving. we wached them for several mins. they did not move. then either the clouds that were above the boomarangs came down and enveloped them or they receided into the clouds. it looked like they just receded into the clouds and were obscured from our view. the closest one to us may have been 100 feet or more from wing tip to wing tip. twenty feet thick in the middle. just guessing. after the boomarangs receided into the clouds, a business jet came around us from the south, passing in front of us in the west and curving back to the south looking like it was on approach to the mckinney airport nearby. it was low to the ground under the cloud cover. it didn't look much higher than the radio tower to the north of us. we felt excited and that maybe they were looking back at us."],"Latitude":"33.202966","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05152011-0001","Tags":"City","Object Flight Path":"Stationary","Region":"Texas","trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around May 11th 2011","This sighting has never been favorited.",""],"Weather Factors":"Rain, Light","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=33.202966,+-96.634152(29096)&iwloc=A&hl=en\"> mufon case (29096) map </A>","Case Number":"29096","files":["/var/www/straped/mufon/html2text/29096.html.txt","/var/www/straped/mufon/more/29096_submitter_file1__UFOSonicDriveIn.png","/var/www/straped/mufon/org/29096.html"],"Source":"MUFON","Date of the Event":"05/11/2011 07:30 UTC","Object Features":"Wings","Longitude":"-96.634152","Summary":"Boomerangs white clouds not moving","Disposition":"IFO","Country":"United States","City":"McKinney","Date Submitted":"05/15/2011 12:42 UTC"}