{"Case Number":"29091","Source":"MUFON","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around May 12th 2011"],"files":["/var/www/straped/mufon/html2text/29091.html.txt","/var/www/straped/mufon/org/29091.html"],"Longitude":"-121.48732","Date Submitted":"05/14/2011 01:12 UTC","Object Shape":"Square, Rectagular","Sighting Duration":"Undisclosed","Latitude":"38.588012","Object Features":"Unknown","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsAt about 11:15pm, I was traveling N on I-5 to the Sacramento Airport. As I was passing the Hwy 99 split, I saw lights in the sky in the distance ahead of me. They were not moving. Most lights in the sky near the airport move. These did not. Because air traffic flies over I-5, I'm usually pay attention to what's above me whenever I travel on this section of this freeway. As I exited I-5 and traveled the road to take me to Terminal A, I could still see the lights. I was able to make out three lights close together in a row. They still weren't moving. I actually pulled over and stopped my vehicle to make sure the lights weren't moving (and that it was not a helicopter). The three lights were located high above the main parking lot. High enough that they did not appear to be a part of any aviation equipment, based on my observation. As I drove through Terminal A, the person I was there to pick up hadn't made it down to baggage yet. I had to circle around the airport again. When I returned to the road that leads to Terminal A, the lights were gone."],"Object Flight Path":"Stationary","Weather Factors":"Unknown","Disposition":"Insufficient Data","Log Number":"US-05142011-0006","Region":"California","Summary":"Three lights close together, giving the appearance of a rectangle","map":"<A HREF = \"http://maps.google.com/maps?q=38.588012,+-121.48732(29091)&iwloc=A&hl=en\"> mufon case (29091) map </A>","City":"Sacramento","Date of the Event":"05/12/2011 11:15 UTC","Tags":"City"}