{"Region":"California","Sighting Duration":"00:01:00","City":"El Segundo","Case Number":"29094","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Summary":"3 metalic \"meteor like\" shapes","Object Shape":"Disc, Oval, Star-like","files":["/var/www/straped/mufon/html2text/29094.html.txt","/var/www/straped/mufon/org/29094.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.92621,+-118.411545(29094)&iwloc=A&hl=en\"> mufon case (29094) map </A>","Log Number":"US-05142011-0008","Weather Factors":"Unknown","Longitude":"-118.411545","Latitude":"33.92621","Source":"MUFON","divs":["Sighting DetailsI was driving home from a friends house in the middle of a sunny bright day and while climbing up a hill in my car I saw something move in the corner of my eye in the sky. I was looking towards LAX airport but a few thousand feet or so above it. At first it looked like a meteor falling because of the distance it was and the whitish light emitting off of it, but then all of a sudden it came to a sudden instant stop. When it stopped it looked like a star that is visible in the day, it didn't look like an aircraft at all. Then I pulled over and asked myself if I had just seen what I saw? I continued to look up to see if I could still see it and then what I thought was a visible day star just above the object I just saw, instantly moved very quickly to the right and stopped, I then saw a third star like object move to another position. The position of all three of them ended in a triangle shape. I also noticed as they changed position it let off a metallic glare when the sun hit them and that's when I thought to myself I can't believe I'm seeing this right now. I had wished someone were with me to assure myself I wasn't going crazy. The incident only lasted a matter of thirty seconds or so and as quickly as they made the triangular shape they speed off out of sight in a matter of a quarter of a second in the same direction. The flew off so fast I knew it wasn't man made and all I could think about is that it almost looked like they playing with each other in the air, like dancing together the way they moved in such perfect cue and simultaneously."],"Object Features":"Unknown","Tags":"City","Disposition":"Unknown","Date Submitted":"05/14/2011 10:25 UTC","Country":"United States","Date of the Event":"07/01/1998 12:00 UTC","Viewing Distance":"Over One Mile","trends":["There have been 2 other sightings in El Segundo","There were no other sightings in El Segundo on or around July 1st 1998"]}