{"Country":"United States","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Latitude":"41.582043","Viewing Distance":"Unknown","Disposition":"Unknown","Source":"MUFON","Longitude":"-73.404486","Summary":"UFO in New Milford CT","Region":"Connecticut","Object Features":"Undisclosed","Tags":"City","Case Number":"29090","Weather Factors":"Unknown","City":"New Milford","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.582043,+-73.404486(29090)&iwloc=A&hl=en\"> mufon case (29090) map </A>","divs":["Sighting DetailsMyself and two friends have been attending Canterbury school. After study hall we have went up to the soccer field as we did every night to smoke cigarettes. the field over looked a highway and some mountains in the distance. We have first noticed what looked like a bright start compared to other stars. What put this object out of place is the movement in which it moved in. The movement was linear another words it was moving in straight lines. After about ten minutes of watching this thing which must have been rather far away as it only appeared as a bright star, the object appeared to be getting closer. After another five minutes the object appeared to be in front of us and slowly moved over head. The object was tremendous in size. it was triangular in shape with a bright light in the middle and smaller bright lights on each corner. The most amazing thing about it was that it made absolutely no sound. We could actually hear crickets and frogs and no other noise coming from the object. Being in shock and scared my friend and I ran under a tractor which was there and another friend just stood there looking in the sky. As the object moved slowly forward we followed it in the direction it moved. There was another person we meet on the way which was as mesmorized as we were, the hockey rink attendant. He was an older gentleman and stood looking up at the sky as we were. Then as fast as it appeared the object moved across the sky and disapeared. We got back to the dorm and I immedietly called the police dept to report this thing. The operator informed me that no one else reported any other sightings. The following few days some other students were making fun of us so we decided to drop our story. I am not some crazy person and was definitaly skeptical when it came to hearing stories of ufo's. I hope my story helps you. The incident took place in either 1998 or 1999 in New Milford, CT."],"files":["/var/www/straped/mufon/html2text/29090.html.txt","/var/www/straped/mufon/org/29090.html"],"trends":["There have been 4 other sightings in New Milford","There were no other sightings in New Milford on or around November 30th 1998"],"Date Submitted":"05/14/2011 10:59 UTC","Log Number":"US-05142011-0005","Date of the Event":"11/30/1998 09:30 UTC"}