{"Longitude":"-106.268356","Viewing Distance":"Unknown","Region":"Colorado","Source":"MUFON","trends":["There have been no other sightings in Granite","This sighting has never been favorited."],"Latitude":"39.086104","Country":"United States","Object Features":"Insignia, Unknown","Tags":"City","divs":["sighting detailsmy husband and i were joy riding on the motorcycle, north up highway 24. near the town of granite, we pulled off to the shoulder to streatch out the kinks. we were parked on a high bank looking down on the arkansas river. as we got off the bike i looked up and thought i saw 3 jets flying in a triangular pattern. i remarked about how cool it was to see them and pointed them out to my husband. he looked up and upon further watching realized they were not jets. there were very definite lines connecting the three corners and the entire object was moving very slowly, with no sound. we both said out loud, \"is that......a ufo?\" then we said yes it has to be. it was far far too large to be anything of ours, \"human related\". it looked as though it were traveling at about commercial airliner cruising altitude, so i'm guessing about 35,000 feet. yet it was so massive, if on earth, there would be no where to park something that large, and no one see it. the best depiction of size i can give you would be to take a normal sized sheet of printer paper and cut part off to make a perfect square. then cut off two corners to make a perfect triangle. now, mesure 1\\4 of an inch in on each of the 3 points and draw a straight line (forming a 1\\4 inch triagle on the 3 corner of the main paper triangle). these would depict quite well what we first thought loooked like jets flying in formation. taking the size of a jet in everyday life into consideration, and filling in all the rest of that triangle with the same sized jets, you can get an exact idea of how massive this thing was. the points may have been either lights or metalic. it really blended in with the sky very well. it moved very slowly compared to a jet. as it passed over us and the river down below it was moving in a south easterly direction. it eventually faded because there was a thin lacy cloud layer between us and it, but we watched it untill we could not see it anymore. it has been bugging me that i cannot find any reports of other sightings of a triangle this huge. and yes, i don't want people thinking i'm a loon so i have not reported it. we both saw it. we both saw the same thing exactly. another strange thing about the whole incident is that we both agree how strange we felt durring this sighting. i'm not sure how to describe it, except that it was a floaty, dream-like feeling, a sensation that time itself had been effected....it ticked away slower than normal or something. now i wonder if it could have been some kind of magnetic field affect or some such thing that made us feel that way. after that, we went a little further up the road and fished. that was it. but has anything of this size been reported anywhere? that is the frustrating part, besides the fact that we never have the camera with us when we need it. and now, of course, we keep catching ourselves looking and watching for anything in the skies. i have seen a couple other strange things over the last 2 years, but not huge like that triangle. let me know if you want to hear about those. thank you."],"Disposition":"Unknown","Weather Factors":"Does Not Apply","Summary":"Seemed cloaked, mirrored the sky and clouds except for the points. Not just big, but MASSIVE.","files":["/var/www/straped/mufon/html2text/29107.html.txt","/var/www/straped/mufon/org/29107.html"],"Log Number":"US-05162011-0002","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.086104,+-106.268356(29107)&iwloc=A&hl=en\"> mufon case (29107) map </A>","Date of the Event":"07/12/2001 02:00 UTC","Case Number":"29107","City":"Granite","Object Shape":"Triangle","Date Submitted":"05/16/2011 02:08 UTC","Sighting Duration":"Undisclosed"}