{"Object Features":"None","Object Shape":"Cigar, Cylinder, Fireball, Oval","files":["/var/www/straped/mufon/html2text/29103.html.txt","/var/www/straped/mufon/org/29103.html"],"Date of the Event":"05/14/2011 07:30 UTC","City":"Twentynine Palms","Latitude":"34.140988","Disposition":"IFO","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.140988,+-116.047349(29103)&iwloc=A&hl=en\"> mufon case (29103) map </A>","Tags":"City","Viewing Distance":"Over One Mile","Longitude":"-116.047349","Date Submitted":"05/15/2011 09:02 UTC","Weather Factors":"Windy","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path","Summary":"elongated brightly lit object hovered in the sky and then slowlly moved up","Country":"United States","Case Number":"29103","divs":["Sighting DetailsMy wife and I were returning from Keys Views in Joshua National Park around 7:30 PM after a sunset photo shoot. On our way home to our Hotel, but still in the Park, my wife spotted a very bright glowing object sitting low in the clear blue sky. The glow may have been intensified by the setting sun. Above the object was a large dark cloud. My wife asked me if I thought it was a star. I said no because it was too low in the sky. I am a big UFO buff and immediately said it was a UFO. My wife is a very big SKEPTIC and said it was not. Then, to our surprise the object began to move upward very slowly. We could easily follow its trajectory as it crossed slivers of cloud stretching out. We discussed in detail if it could be a plane , helicopter or meteor, but we both agreed that it was clearly not any of those. There were no flashing lights, no noise. A meteor would not be expected to move straight up. It was not a rocket. It moved too slowly for that. There were no contrails. We followed the object's path for about 5-10 minutes until it disappeared into the black cloud. At that point we both deemed it a UFO but not claiming that it was extraterrestrial. For the first time my wife was very intrigued and mystified by the event. In conclusion: We have no doubt we saw a UFO. It was not a conventional aircraft or a star or a meteor etc."],"Log Number":"US-05152011-0007","Region":"California","trends":["There have been 6 other sightings in Twentynine Palms","There were no other sightings in Twentynine Palms on or around May 14th 2011"]}