{"trends":["There have been 3 other sightings in Morris","There were no other sightings in Morris on or around May 4th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.357254,+-88.421178(29105)&iwloc=A&hl=en\"> mufon case (29105) map </A>","Disposition":"Unresolved","Object Features":"None","Summary":"translucent sphere orb visible in Night Vision only","Object Flight Path":"Path then hovering","Latitude":"41.357254","Sighting Duration":"Undisclosed","Region":"Illinois","Date Submitted":"05/15/2011 09:50 UTC","Longitude":"-88.421178","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29105.html.txt","/var/www/straped/mufon/org/29105.html"],"Case Number":"29105","Object Shape":"Sphere, Other","Date of the Event":"05/04/2011 01:15 UTC","Country":"United States","City":"Morris","Log Number":"US-05152011-0009","divs":["Sighting DetailsI arrived home at 1:15am. I live in the country and activily search the night skies with both Gen III night vision and IR cameras. My daughter and I have made one report on mufon for a sighting a couple of years ago. We have activly seen unexplained craft in our night skies ranging from 1 very large diamond shaped craft to other unexplained high altitude craft. My background is former military and active law enforcement. On this evening as I said I just returned home and since the skies were clear I got out the night scope and and spent some time looking up. Withing just about 2 minutes of searching a Glowing translucent white orb or sphere about the size of a beach ball floated between my out building and house. The sphere was only about 40 feet in the air. It was not a bird or owl or bat. Its velocity was slow and deliberate. You could alomost see through the sphere and it glowed more on the outer edges of its outline. I quickly pulled the scope down and looked right above me to try to see it. It could not be seen with the naked eye at night. I reacquired it in the scope and continued to observe it floating direcly over my nieghbors home briefly paausing and then continuing on to the next nieghbors roof top again pausing. I lost sight of it within about 3 or 4 minutes. I made several attempts to reposition myself to locate it but could not. As I stated this was not a bird or other flying animal. The thing I remember just before I saw the object was, I have a pen of game birds which roost at night. Just before I saw the object my birds became very active in the pen. It made me wonder if a critter or coyote might be near them, at that moment the sphere became visible to me over head as I was pointing the scope back near the pen to see what got them going. I stated I actively search the night skies since we had our first spotting a couple of years ago and have seen lots of things in the sky that defy logic and are unexplainable. This event, to me was alarming as it seemed to be intelligently and briefly making stops over our homes in a grid pattern. Since that night I have experiences tremendous nightmares. I guess this one gave me the spooks."],"Viewing Distance":"20 Feet or Less","Tags":"City","Weather Factors":"Unknown"}