{"Sighting Duration":"Undisclosed","Latitude":"38.925743","Summary":"Gray saucer with a long light and two smaller lights","Log Number":"US-05152011-0008","Source":"MUFON","Date Submitted":"05/15/2011 09:38 UTC","Country":"United States","trends":["There have been 52 other sightings in Lee's Summit","There was one other sighting in Lee's Summit on or around May 15th 2011"],"divs":["sighting detailsme my wife and four other friends mine were driving home from a long night out drinking. it was about 4:05 am on 5-15-11 driving down woods chapel road in lee summit, mo. i was looking down the road and i saw in the distance, yet clear as day, a ufo. i yelled at everyone in the car to look up in the sky. oh my god was pretty much the reaction of everyone in the car. the object was large and defiantly an aircraft we had all never seen. as i drove closer in the direction of the craft it seemed to stay at the same height yet either got farther and farther away or just got smaller and smaller. three of us drew out what we saw and all came out with the same drawing of the ship. the strangest part of all this is that i live by an airport that single engine planes usually fly out of. for the last 7 days i have seen multiple apache helicopters landing and flying around the airport. i have lived at my apartment for close to a year and have never seen anything other than single engine planes land there. we are all certain of what we saw and with the helicopters flying around all week i am convinced that their is an alien ship or something of that nature here close to were i live. *(wit's email address removed -- cms\\sg)."],"City":"Lee's Summit","Object Flight Path":"Straight-line path","Case Number":"29104","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/29104.html.txt","/var/www/straped/mufon/org/29104.html"],"Longitude":"-94.380416","Tags":"City","Disposition":"Unknown","Object Shape":"Disc","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.925743,+-94.380416(29104)&iwloc=A&hl=en\"> mufon case (29104) map </A>","Object Features":"Dome","Date of the Event":"05/15/2011 04:01 UTC","Viewing Distance":"Unknown"}