{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29101.html.txt","/var/www/straped/mufon/org/29101.html"],"Longitude":"-116.340755","Disposition":"Insufficient Data","Date of the Event":"05/14/2011 11:30 UTC","Tags":"City","divs":["Sighting Detailsim going to TRY and be brief. driving on the i-10 west headed to LA from Palm spring, indian wells - it started with a flash from an orb like a object coming from high altitude and shooting all the way down [ perfectly vertical ] in a fraction of a second and then disappeared. Knowing the likeness of other objects being around, I carefully chose to drive slowly and take a look. What seemed to appear as red dots floating in the sky seemed to appear a few miles away from where this object was first witnessed. I could tell that it was not a star or anything of any other sort because the visibility tonight was incredible. A breathtaking sky could only give away the fact that indeed these circle like objects were floating in mid air, I could differentiate the fact that these lights were pulsating as if they were monitoring the surrounding skies..... the air had a certain feel to it [that i cant explain ] and so did the rest of the environment until way later that I finally drove out of the desert into downtown LA. It doesn't seem to be just a few...... these objects, whatever they are, wherever they come from and for whatever reason they are here are starting to manifest themselves more and more everyday...... look up russian news.... they had a HUGE sighting just last night, turns out russian military shot up flares into the sky of a village to warn them of the object [ also red ] and apparently fying in zig-zag patterns across the sky. wake up. love."],"City":"Indian Wells","Log Number":"US-05152011-0006","Source":"MUFON","Viewing Distance":"Unknown","Region":"California","Weather Factors":"Unknown","Case Number":"29101","Latitude":"33.717631","Object Shape":"Circle, Flash, Sphere","trends":["There has been one other sighting in Indian Wells","There were no other sightings in Indian Wells on or around May 14th 2011"],"Summary":"beam / ships&or ORBS","map":"<A HREF = \"http://maps.google.com/maps?q=33.717631,+-116.340755(29101)&iwloc=A&hl=en\"> mufon case (29101) map </A>","Object Features":"Undisclosed","Country":"United States","Object Flight Path":"Undisclosed","Date Submitted":"05/15/2011 05:45 UTC"}