{"Summary":"Huge dark grey domed saucer with white lights","divs":["sighting detailsfive of us were going home to a friend's apartment from a night out. we were driving down woods chapel rd going west towards 470 hwy. the driver noticed the ufo first and pointed it out to us. it was staying neutral in the same spot directly in front of us. we only saw it for maybe a minute or two and then it got smaller and smaller really fast like it was moving away from us directly west. it looked like it was the same shape as this one, *(link moved to additional evidence section--cms\\sg). there was a bright circular white light on the right side of it. then along the bottom of it there was a line of white light. the light was very bright, then dimmed slowly to nothing, then back bright again before it disappeared. all of us couldn't believe what we were seeing. everyone was asking, \"are you seeing what i'm seeing?!\" i kept saying, \"oh my god, oh my god\" i'm so mad we didn't pull over and take pictures. although i'm not sure how well the pictures would've turned out because we didn't have actual cameras, just our phones. of course lots of people don't believe us and are assuming that it was a blimp or a helicopter. all of us saw the exact same thing. there's no doubt in our minds that it was an et ufo. none of us have ever seen an aircraft like that before. the friend's apartment that we were heading to, that's located right where we saw the ufo, said that they've seen some apache helicopters flying around the little airport that's right by them in the last week. we were thinking that maybe the authorities know something that's going on and they're monitoring or something..."],"Country":"United States","Disposition":"Unknown","City":"Lee's Summit","Tags":"City","trends":["There have been 52 other sightings in Lee's Summit","There was one other sighting in Lee's Summit on or around May 15th 2011"],"Object Flight Path":"Hovering then path,Straight-line path","Weather Factors":"None","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=38.924753,+-94.373766(29114)&iwloc=A&hl=en\"> mufon case (29114) map </A>","Log Number":"US-05162011-0009","Date of the Event":"05/15/2011 03:50 UTC","Object Shape":"Unknown","Date Submitted":"05/16/2011 10:50 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"29114","Longitude":"-94.373766","Latitude":"38.924753","Region":"Missouri","files":["/var/www/straped/mufon/html2text/29114.html.txt","/var/www/straped/mufon/org/29114.html"],"Sighting Duration":"Undisclosed","Source":"MUFON"}