{"Case Number":"29118","Disposition":"Unresolved","Sighting Duration":"00:00:00","Tags":"City","Weather Factors":"Unknown","Date Submitted":"05/17/2011 03:39 UTC","Object Flight Path":"Undisclosed","Log Number":"CA-05172011-0004","trends":["There has been one other sighting in Yellowknife","There were no other sightings in Yellowknife on or around May 14th 2011","This sighting has never been favorited.",""],"Date of the Event":"05/14/2011 01:30 UTC","City":"Yellowknife","Viewing Distance":"Unknown","Latitude":"62.463948","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/29118.html.txt","/var/www/straped/mufon/more/29118_submitter_file1__noufo.JPG","/var/www/straped/mufon/more/29118_submitter_file2__ufo.JPG","/var/www/straped/mufon/org/29118.html"],"divs":["Sighting DetailsMy roommate and his girlfriend were going for coffee at 12:20 am on Saturday, May 14, 2011 and saw some clouds that formed a smiley face. They took several pictures of the clouds with a camera phone, went for their coffee, and then returned home. The next day when they were looking at the pictures saw something they didn't notice the night before. Near the cloud's \"eye\" they saw what appears to be an object in the sky that is somewhat disc-shaped. They say there was no plane in the sky, no airtraffic at all and there was nothing inside the vehicle reflecting onto the windshield that could account for it. I have showed the photo to some people and they dismiss it as a lens flare. But if it is indeed a lens flare, why was it not in other pictures taken from the same angle and with the same sources of light? I have attached two pictures taken moments apart and would be grateful if somebody could analyze them to determine whether or not what is in the second picture is in fact a lens flare or something else. Best regards."],"Region":"Northwest Territorie","Country":"Canada","Longitude":"-114.371569","Object Shape":"Disc, Square, Rectagular","Summary":"My friends were out driving around and taking pictures of clouds. They noticed something strange in them the next day.","map":"<A HREF = \"http://maps.google.com/maps?q=62.463948,+-114.371569(29118)&iwloc=A&hl=en\"> mufon case (29118) map </A>","Source":"MUFON"}