{"Date of the Event":"05/12/2011 01:30 UTC","Object Features":"Other","Weather Factors":"Unknown","Latitude":"41.887704","Region":"Illinois","Object Flight Path":"Straight-line path,Path with directional change","Country":"United States","Disposition":"Unresolved","Date Submitted":"05/17/2011 03:12 UTC","Log Number":"US-05172011-0001","Longitude":"-87.627558","files":["/var/www/straped/mufon/html2text/29115.html.txt","/var/www/straped/mufon/org/29115.html"],"Tags":"City","Source":"MUFON","Object Shape":"Disc, Sphere","Viewing Distance":"Unknown","Case Number":"29115","divs":["sighting detailsi couldn't sleep and stepped outside for a cigarette on my balcony (facing east). in the east\\southeast sky i could see a disc shaped object with a dark center moving southwest. it traveled above the clouds and my view of it was often obscured by clouds moving in the opposite direction. the object almost seemed translucent and reminded me of a jellyfish somewhat, but the outer rim seemed reddish or pinkish and the center was dark. other smaller lights (much smaller) were scattered around the disc. some darted and away from the disc but they all seemed to be moving in the same general direction (somewhere above midway), sometimes up and down, sometimes in a random path. there were so many smaller lights that i thought i must be seeing things and rubbed my eyes. they reminded me of insects under a streetlight but on a much grander scale. these objects moved out of my sight and behind the apartment building, and i think i must have watched this for about 10 minutes. the main disc moved a bit quicker than any of the jets on their way to o'hare, and the object seemed to be much higher in the sky. earlier that evening i saw a spectacular meteor (or bolide) moving from the southwest towards the northeast, and i can't stop thinking about how much activity was in the sky that night. i am not frightened by what i saw or uneasy, but i am curious as heck. i know i wasn't seeing things, but this object was totally unlike anything i've seen before."],"City":"Chicago","Summary":"Disc-shaped semi-transluscent object with a dark center.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.887704,+-87.627558(29115)&iwloc=A&hl=en\"> mufon case (29115) map </A>","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around May 12th 2011"]}