{"Source":"MUFON","trends":["There have been no other sightings in Southampton","This sighting has never been favorited."],"Summary":"Multiple Reddish Orange Lights, small, compared to larger \"Base\"?, square, red and blueish lights","Latitude":"42.229167","Object Features":"Undisclosed","Date of the Event":"05/11/2011 10:20 UTC","Longitude":"-72.730556","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"29117","divs":["sighting detailsabout 10:20pm, i was bringing my brother home from work (northampton to southampton). on rt. 10 where pomery meadow rd. meet, i first noticed a pair of \"orbs\" flying in the same direction (towards westfield) in unison with each other, lost them over some trees, got to my brother\\parents house, dropped him off, (he did not see them, i at first wasn't thinking anything of it, just some planes..). they live right on rt.10,dropped him off and i pulled out of their driveway, back towards easthampton, i took a right onto clark st.(southampton), a right onto east st. then i noticed a large craft with red and blueish lights hovering over a field on pleasant st. so i took that left, i was amazed, it was making a not too loud humming noise. i kept driving because i admit, i was kinda freaked out, this is my first \"ufo\" sighting. as i kept driving i saw the same \"orbs\" as before, atleast, i think they were the same ones. i slowed down to get a better look, as one of them seemed to be tailing me, everytime i looked out my driver side window, it was right beside me probably a couple hundred yards away. it stayed with my until i reached the center of easthampton, i then lost it. i will say, as i looked at it out my window, i had an amazed look on my face, a big smile all the way home, i kinda felt it was following me purposely. if you need a map of where i was driving, i can come up with one. thank you"],"Viewing Distance":"Unknown","Object Shape":"Circle, Sphere, Square, Rectagular","City":"Southampton","Log Number":"US-05172011-0003","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.229167,+-72.730556(29117)&iwloc=A&hl=en\"> mufon case (29117) map </A>","files":["/var/www/straped/mufon/html2text/29117.html.txt","/var/www/straped/mufon/org/29117.html"],"Sighting Duration":"Undisclosed","Region":"Massachusetts","Date Submitted":"05/17/2011 10:12 UTC","Country":"United States"}