{"Date of the Event":"05/12/2011 04:30 UTC","divs":["Sighting DetailsI woke up at 4:30 and started seeing orbs again....The first one flew north then about 5 min later another one flew south then a few min later I saw another streak through the sky but very short and fast. Then to my amazement! And I mean this is the first craft I have ever seen where it looked just like a space ship! It flew right over my head and out west towards the ocean. I saw it pretty clearly and it was about 1,000 feet in the air and was gliding across the sky at a steady pace. There was an airplane landing and it went directly under the airplane. It had no lights and no noise. It looked like it was semi see through white glowing material like a jelly fish in the ocean. No lights but it had a triangle shape with a pointed nose. It also had the shape of a paper airplane with folds along the sides but the back had 3 or 4 points. This was at 4:40 then right afterwards at 4:43 I saw another orb flying really really slow headed south east. Then another one (they are all appearing from the same spot like before) headed north west turned slowly and headed back north east. This one could not have been a satellite."],"Longitude":"-118.434712","City":"Los Angeles","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.93065,+-118.434712(29119)&iwloc=A&hl=en\"> mufon case (29119) map </A>","Tags":"City","Summary":"Transparent whitish triangular craft gliding out over the ocean.","Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Wings","files":["/var/www/straped/mufon/html2text/29119.html.txt","/var/www/straped/mufon/org/29119.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05172011-0005","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 12th 2011"],"Sighting Duration":"Undisclosed","Latitude":"33.93065","Country":"United States","Region":"California","Object Shape":"Triangle","Date Submitted":"05/17/2011 04:50 UTC","Case Number":"29119"}