{"files":["/var/www/straped/mufon/html2text/29112.html.txt","/var/www/straped/mufon/org/29112.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.598146,+-82.185424(29112)&iwloc=A&hl=en\"> mufon case (29112) map </A>","Source":"MUFON","Summary":"Family watched and filmed disc shaped object","Tags":"City","trends":["There have been 20 other sightings in Bristol","There were 3 other sightings in Bristol on or around August 3rd 2003"],"Country":"United States","Case Number":"29112","Date of the Event":"08/03/2003 04:30 UTC","Date Submitted":"05/16/2011 09:04 UTC","City":"Bristol","Latitude":"36.598146","Object Shape":"Disc","Log Number":"US-05162011-0007","Weather Factors":"Light","Object Features":"None","Disposition":"Unknown","divs":["Sighting DetailsMy son and I were working on his car when I noticed a small obscure object emerging from clouds to my NW. As my son watched the object, I went inside and retrieved binoculars. Upon returning, my son and I were amazed at what we were watching. It was a metallic, copper colored(with darker burned spots) perfect disc shaped object. It slowly moved toward us, occasilnally moving back into clouds. I went back inside and retrieved an old VHS camcorder , returned with my wife and began taping.As my son and wife watched thru binoculars, I taped the object as it performed complex manuevers, moving toward the south, ever closer to my location. I recorded the object for some 12-15 minutes. To describe the object is simple, It was a perfect disc shaed object with absolutely no features, no structures, highly reflective(as it reflected sunlight), silent and demonstrating controlled flight. After the object got at it's closest(approx 8000 feet distant), it moved away to the west behind trees. I immediately called the FAA control tower at the TRi Cities airport to inquire if they had seen anything on their radar since this sighting was in the direct flight path to the airport and was told No that unless the object had a transponder, their radar was not set up to see it. I also called the national Weather service office in Morristown and recieved wind data for that day at height. All wind at every level the object occupied was from the west, the direction the object left, proving powered flight. I also requested approx. distance to the clouds from my location using coordinates. The Culumulus cloud bank from which the object emerged when we first saw it was approx 5 miles distant from me at 16:30 hours. Video was shared with Dr Bruce Macabee for analysis. he also asked for and recieved a video shot with the same camera of a yard stick at 50 measured feet also zoomed and normal. Macabee's analysis was thorough and very professional. He surmised the object was some 35 feet in diameter and had an aspect ratio of 6 to 1. Distance varied greatly from the camera to the object. macabee also stated the object was displaying flight characteristics which defied laws of physics. I originally submitted all this info(including statements from the NWS regarding wind data) to MUFON by paper forms back in 2003."],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Undisclosed","Region":"Tennessee","Longitude":"-82.185424","Sighting Duration":"Undisclosed"}