{"trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around May 17th 2011"],"Date of the Event":"05/17/2011 10:30 UTC","Case Number":"29128","City":"Burbank","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/29128.html.txt","/var/www/straped/mufon/org/29128.html"],"Object Flight Path":"Hovering then path,Path then hovering,Other","divs":["Sighting DetailsWhile driving home last night I noticed a bright orange light above the Burbank Hills. At first I thought it might be just one of the lights on one of the radio towers or perhaps lights coming from a building in the hills and it seemed to be slowly falling and again chalked that up to my perception since I was driving, but once I stopped in a residential area and there wasn't the glare of the city lights in my line of vision, I could see the outline of the hills better and realized it had to have been at least a couple of hundred feet higher than any of the radio towers or buildings would have been and it was in fact slowly floating downward. Before the light turned green again, it actually stopped for a moment, hovered and then started moving up again. Because I live nearby an airport, and previously I lived near a military airbase, I've become very familiar with what the different aircraft coming to and from the locations look like and this was not like any of the aircraft lights I've seen before. For some reason I couldn't stop looking at it but I felt intrigued more than fearful or concerned. I didn't feel as though there was any danger but perhaps as if it was simply observing something. Unfortunately I was unable to photograph it since I was driving but it was at a distance that I don't know if it would have mattered on my camera phone anyhow. I should probably mention that I have seen other objects but felt like this one was one worthy of reporting."],"Region":"California","Date Submitted":"05/18/2011 03:37 UTC","Tags":"City","Source":"MUFON","Latitude":"34.183349","Disposition":"Unknown","Longitude":"-118.305286","Object Shape":"Circle, Star-like, Other","Sighting Duration":"00:14:00","Summary":"Glowing Orange Light Above Hills","Country":"United States","Log Number":"US-05182011-0005","map":"<A HREF = \"http://maps.google.com/maps?q=34.183349,+-118.305286(29128)&iwloc=A&hl=en\"> mufon case (29128) map </A>","Viewing Distance":"Over One Mile","Object Features":"None"}