{"Date of the Event":"11/30/2009 12:00 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"Stepped outside and what I thought was a star turned cigar shaped. Shot off at the speed of light. Amazing!","Country":"United States","Longitude":"-90.192284","Log Number":"US-05182011-0001","divs":["Sighting DetailsIt was fall 2010 between the time of ten to eleven at night I would say. I stepped outside to smoke on my back porch. I started to gaze at the stars like I do everynight,and was instantly drawn to a really bright star. Something about it seemed out of place so I kept watching realizing it did not shimmer like any other star does. It was a perfect white orb. After staring at it about two minutes almost done with my cig it got a little larger in size but as it did the shape quickly turned cigar shape. Thats when a feeling came over me like I knew what I was looking at, but I was not scared. I guess in shock. It stayed like that maybe six seven seconds then shot across the horizon like almost the speed of light. I was amazed! Then almost wishing I could see more a tiny little white dot wiggled down stopping closely in line with where I saw the first orb then shot across the horizon following the other, and then one more repeating after that! The last two came in and shot off in less than ten seconds. I would have to say the speed of these things is mind blowing. Makes Nasa look like childs play. These were silent and when shot off there was no tail of light or sound. I live near the airport and watch airplanes pass all the time so there no confusion here. In my line of sight I would have to guess the first was far away and then moved toward my direction hints the orb getting larger and turning cigar shape. And the other two I think I might have witnessed coming into our atmosphere. I guess i'm just trying to say they were not extremely close someone the next state over could have seen this as well. I feel lucky and a little crazy I seen this. I just wish there was time to grab my camera. Thanks"],"Date Submitted":"05/18/2011 01:45 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Tags":"City","Latitude":"38.635052","Object Shape":"Cigar, Circle, Star-like","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around November 30th 2009"],"Region":"Missouri","Source":"MUFON","City":"St Louis","Case Number":"29124","files":["/var/www/straped/mufon/html2text/29124.html.txt","/var/www/straped/mufon/org/29124.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.635052,+-90.192284(29124)&iwloc=A&hl=en\"> mufon case (29124) map </A>"}