{"Date of the Event":"05/18/2011 05:05 UTC","Country":"United States","Region":"Arizona","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/29138.html.txt","/var/www/straped/mufon/org/29138.html"],"divs":["sighting detailsat above time\\date, was on patrol with another police officer travelling north on the stuart highway, about 10 kilometres north of cadney park homestead in central australia. i was the passenger in our police 4wd and my partner was driving. it was nearing sunset at the time, however the sky was still bright and blue. i had been looking around occasionally but also looking at\\using things inside our vehicle at the time. i lookout straight out of the front windscreen and slightly upwards. i saw what i first thought was a very bright star. i then noticed it appeared to be moving slowly in a south-westerly direction, with reference to a fixed ground point north of our vehicle. it was a quite bright white light no different to a star, despite the movement. i drew my partner's attention to it. he hadn't seen it as his sun visor was down. he instantly called it a ufo. as the sun was getting low in the sky i started to think that the light might've been sunlight reflecting off a light aircraft. the light then began to fade, slowly at first then quite rapidly until it was no longer visible. i thought that if it was an aircraft it might've been banking, and that i would shortly see light reflecting off it again. however after watching for 10 minutes it was not sighted again."],"Disposition":"Unresolved","Log Number":"AU-05192011-0003","Summary":"Bright moving star-like light, eventually fading in a period of seconds","Latitude":"33.564359","Case Number":"29138","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.564359,+-112.081341(29138)&iwloc=A&hl=en\"> mufon case (29138) map </A>","Longitude":"-112.081341","Weather Factors":"None","Sighting Duration":"Undisclosed","Date Submitted":"05/19/2011 01:14 UTC","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Source":"MUFON","Tags":"City","City":"Phoenix","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around May 18th 2011"]}