{"Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Date Submitted":"05/18/2011 11:43 UTC","Longitude":"-78.885364","Object Features":"Undisclosed","Weather Factors":"None","divs":["Sighting DetailsWe live off 707 in Myrtle Beach, down Folly RD. Went outside at 11 pm to take a break from a movie. Looked up at sky and noticed what I thought were two stars directly parallel to each other. I could tell they were moving, I next thought maybe planes. There were no blinking lights or noise. But as we kept examining them I noticed they were not moving away or towards each other. They were moving strangely with no consistent pattern. We joked that maybe it was a ufo and at that moment the object on the right shot out a bright light diagonally towards the ground. It was white. No noise but several dogs in the neighborhood started barking. It almost looked like it came off the object but it looked exactly like a shooting star on it came from this star like light on the right and after it disappeared the like a shooting star would do the two objects, lights, were still there. I quickly ran inside and grabbed my digital camera but was unable to get a shot other than the dark sky. We continued to watch for 25-30 minutes. I reported here in hopes others in my area noticed them too."],"Latitude":"33.69527","Viewing Distance":"Unknown","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around May 18th 2011"],"Date of the Event":"05/18/2011 11:00 UTC","Summary":"Two bright star like objects.","map":"<A HREF = \"http://maps.google.com/maps?q=33.69527,+-78.885364(29135)&iwloc=A&hl=en\"> mufon case (29135) map </A>","Region":"South Carolina","Disposition":"Unknown","City":"Myrtle Beach","Case Number":"29135","Object Flight Path":"Stationary","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/29135.html.txt","/var/www/straped/mufon/org/29135.html"],"Country":"United States","Log Number":"US-05182011-0011"}