{"Case Number":"29136","Latitude":"32.225903","Region":"Arizona","Object Features":"None, Unknown","Object Shape":"Circle, Fireball, Sphere","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"05/18/2011 08:37 UTC","Date Submitted":"05/19/2011 12:43 UTC","Sighting Duration":"Undisclosed","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around May 18th 2011"],"Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Longitude":"-110.922309","Disposition":"Unknown","City":"Tucson","map":"<A HREF = \"http://maps.google.com/maps?q=32.225903,+-110.922309(29136)&iwloc=A&hl=en\"> mufon case (29136) map </A>","Log Number":"US-05192011-0001","Source":"MUFON","Summary":"Orangish, fire-like circle appears in sky, 3 more identical objects appear to multiply from it, move away from the object, return, and all disappear","files":["/var/www/straped/mufon/html2text/29136.html.txt","/var/www/straped/mufon/org/29136.html"],"Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was outside talking on the phone, walking to the eastern side of the backyard. I stopped and looked to the south because out of the corner of my eye I saw an orange light. It looked like a circular, bright, fireball object high up in the dark sky, I and thought it may be strange airplane lights I hadn't seen before. There is a lot of air traffic in this area, and the light didn't match what I always see in the sky. At once, another identical circle began to \"come out\" of it, and it moved in a direct line to the left (and slightly down) of the original circle, and stopped. Another one \"came out\" of the original circle, and flew in a direct line to the right of it and stopped. Another emerged more slowly than the first two from the original circle, and also went to the right of the original circle and stopped right next to it. I couldn't believe what I was looking at, I was dumbfounded and couldn't get the words out to tell my sister (on the phone) what I was looking at. All four circles lingered in each of their spots for a few seconds, and then the circle to the left moved very fast back into the original circle, as if pulled by a magnet. The other two immediately followed, and as if all them were enclosed back in the original circle, it appeared to fold and vanished from sight, like it had been sucked away into an invisible place, leaving no visible trace. I knew I had seen something phenomenal, and felt very small. I went inside to tell my parents what I saw, went back outside and watched the same spot for a while, but there was nothing else."]}