{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.839033,+-117.913264(29131)&iwloc=A&hl=en\"> mufon case (29131) map </A>","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around April 15th 2011"],"Weather Factors":"Unknown","Latitude":"33.839033","Case Number":"29131","Country":"United States","Log Number":"US-05182011-0007","City":"Anaheim","Summary":"2 very small white dots hovering next to each other.","Date Submitted":"05/18/2011 07:32 UTC","divs":["Sighting DetailsI was at my mother's house watching a UFO documentary with her. When it was over she went into the kitchen, and I went outside. The sky was very cloudy with big puffy low clouds, as I was looking for UFOs. Low in the south I saw 2 very small white dots hovering next to each other. Then I noticed they were alternately shooting electricity from them in the form of a bullhorn or cone. The one to my left shot right at me, as though it seen me then the 2 slowly moved together in unison to my right behind a big cloud. That's all I saw. Around 5 years ago I saw at dusk from Tomy's restaurant a small dot of light blue light traveling northward. Every 7 seconds it shot out from it a large cone that seemed to make a hole in the sky about 20 feet in diameter. 4 months I could not sleep, and looking out my window from my bed I saw near the edge of my roof a small blue green hovering light that shot out a cone of white light every 7 seconds. It was about 12,000 feet high, and I watched it for around 10 minutes. Can these objects be effecting our weather? As far as I know weather has been really weird at least around where I live, and in NC and NY. Thank you."],"Source":"MUFON","Disposition":"IFO","Sighting Duration":"00:00:30","Tags":"City","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/29131.html.txt","/var/www/straped/mufon/org/29131.html"],"Longitude":"-117.913264","Date of the Event":"04/15/2011 03:30 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Region":"California"}