{"Case Number":"29148","divs":["Sighting DetailsI woke up at 1:19am and it was very bright in the bedroom. I kinda think that's what woke me up. I didn't think much about it so I went on the back porch to smoke a cigarette. I didn't even smoke the whole thing and I went back to bed, and when I looked at the clock it said 3:30. I thought it was really strange, but went back to sleep anyway. In the am, I remembered that I had a really strange dream about a strange disk in the sky above the neighbors house. I just stared at it till I saw it rotate slightly and I realized it was real! I didn't feel any different in the morning, and my clothes weren't on inside out or backwards or anything. I did notice an itchy bump at the base of my skull a day later, and when I scratched it off... I got a really bad headache like nothing ever before! And I have migrains so I know it was not that. I didn't really give it much thought, untill I saw a story on the news a few days later about several people reporting a ufo south of where I live. Then tonight my friend and I saw an orange throbbing light bobbing through the night sky! But I'll make a seperate report for that one! Looks like something is going on that they might take interest in!"],"City":"Independence","Longitude":"-94.406107","Summary":"Strange disk hovering above the neighbors house to the back.","files":["/var/www/straped/mufon/html2text/29148.html.txt","/var/www/straped/mufon/more/29148_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/29148.html"],"Log Number":"US-05202011-0003","Weather Factors":"None","Region":"Missouri","Country":"United States","Date Submitted":"05/20/2011 04:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.092866,+-94.406107(29148)&iwloc=A&hl=en\"> mufon case (29148) map </A>","Object Shape":"Disc","Object Flight Path":"Hovering then path","Latitude":"39.092866","Object Features":"Other","Viewing Distance":"21-100 Feet","Sighting Duration":"02:10:00","Disposition":"Unknown","Tags":"City","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around May 11th 2011","This sighting has never been favorited.",""],"Date of the Event":"05/11/2011 01:19 UTC"}