{"trends":["There has been one other sighting in Oscoda","There were no other sightings in Oscoda on or around June 30th 1977"],"Longitude":"-83.330797","Object Shape":"Sphere","Object Features":"Unknown","Latitude":"44.420289","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.420289,+-83.330797(29149)&iwloc=A&hl=en\"> mufon case (29149) map </A>","Date of the Event":"06/30/1977 12:00 UTC","City":"Oscoda","divs":["Sighting DetailsSummertime, @1977, Oscoda,MI. Downtown at the park on lake Huron. I was with my friend Robbie around 10PM Playing on the swings, we noticed an aircraft coming towards us, First the lights, then as the object came closer we thought it was a jet landing at Wurtsmith AFB. As it came closer we could see that it was not a jet, but a large black object ( size of a three bedroom house) it stopped and floated there , above the fishing pier about a 100 feet in the air. When the object stopped we noticed it made no sound. Being frightened, we ran into these six foot diameter concrete pipes and watched the object from there. The oject was jet black with rotating and glowing lights ( white) pulsing. It stayed motionless for @ an hour, then all of a sudden it went up and took off extremely fast towards Canada. The object was witnesed by at least three other people besides myself. The weather was clear and warm , a beautiful summer night , no moon.I was told the local Police called the base to ask them if the object was theirs, they said they had nothing on radar, and when they sent two jets to investigate, the object took off so fast across the lake, it was gone within seconds.Official report said it was a weather baloon, however I was there, it was not a baloon, it left too quickly."],"Summary":"Large black object ( big as a small house ) hovered a 100 feet up in the ai r , above the fishing pier. Made no sound,, Less than two miles from Wurtsmith Air Force Base,, Object was witnessed by at least three people,, Object made no sound.","Viewing Distance":"101-500 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/29149.html.txt","/var/www/straped/mufon/org/29149.html"],"Disposition":"Unknown","Case Number":"29149","Date Submitted":"05/20/2011 04:57 UTC","Country":"United States","Log Number":"US-05202011-0004","Source":"MUFON","Region":"Michigan","Object Flight Path":"Hovering then path,Path with directional change"}