{"Region":"Illinois","Case Number":"29145","City":"Clifton","Object Shape":"Boomerang, Chevron, Circle, Disc, Unknown","Disposition":"Unresolved","trends":["There has been one other sighting in Clifton","There were no other sightings in Clifton on or around May 19th 2011"],"divs":["sighting details my mom and i were on our way back from clifton. we were heading north and pulled over by a local creek i fish out of to see how deep the water is in hopes of fishing tomorrow. we were at 3100n and 1000e close to the intersection. i was going back to my car and looked up and saw the object with a row of 4 red lights on what seemed to be the front behind them seemed to be a white hue\\glow. it was pretty high up and it just seemed to be hovering there. it really creeped me out and we felt as though it was watching us. i turned off the car engine and car lights so i could really get a sense of how bright and far this object was or if it was making any noise. it hovered there for another minute or two and without sound or gaining speed it just took off to the southwest. it didn't even turn around or anything just took off but if what we thought we were looking at was the front how is that possible? its hard to say what shape the object was when we were looking at it with these red lights which seemed to ring it as if it was a disk\\round\\half cirle. but, then again it could have been a boomerang cause we were only seeing this one edge of it. if that were the case then its movement wouldn't have made sense. i am baffled. i m gonna guess and say it was a disk. when it took off it started flashing lights and turned out some of the red and looked like a plane would at high altitude. the white glow disappeared. i turned the car around and tried to stay in sight of it but it went directly into cloud cover and we lost sight of it. in total about 5 minutes passed that we got to watch it."],"Longitude":"-87.934485","Object Features":"Unknown","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Summary":"It was a row of 4 red lights with a white glow behind them stationary for about 3 minutes after it was notices hovering then took off to the southwest","Date Submitted":"05/19/2011 11:59 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.935311,+-87.934485(29145)&iwloc=A&hl=en\"> mufon case (29145) map </A>","files":["/var/www/straped/mufon/html2text/29145.html.txt","/var/www/straped/mufon/org/29145.html"],"Date of the Event":"05/19/2011 09:21 UTC","Latitude":"40.935311","Log Number":"US-05192011-0010","Source":"MUFON","Object Flight Path":"Hovering then path","Country":"United States"}