{"Log Number":"US-05192011-0007","Longitude":"-77.795371","files":["/var/www/straped/mufon/html2text/29142.html.txt","/var/www/straped/mufon/more/29142_submitter_file1__arrowomg011anotherorangeorb.jpg","/var/www/straped/mufon/more/29142_submitter_file2__omg023orangeorbcloseup.jpg","/var/www/straped/mufon/more/29142_submitter_file3__omg023.JPG","/var/www/straped/mufon/org/29142.html"],"Object Features":"None","Weather Factors":"None","Source":"MUFON","Object Flight Path":"Stationary","Tags":"City","Case Number":"29142","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=34.218334,+-77.795371(29142)&iwloc=A&hl=en\"> mufon case (29142) map </A>","Summary":"East coast Orb over the ocean","Date Submitted":"05/19/2011 07:12 UTC","Viewing Distance":"Over One Mile","divs":["Sighting DetailsFirst off, im on the east coast. beach facing east south east. almost at the NC SC border. Its a full moon tomorrow (but supposed to be a washout here, so i went to the beach tonight to take pics). I usually go to the beach on full moons, eclipses,storms, hurricanes, water spouts and meteor showers to get some awesome photos. Tonight was the same, i had my family with me ( mom, brother, 2 daughters). there were plenty of other people on the beach as well, it was a warm clear summer night after all. Then as i was holding the shutter down with my bulb setting on my camera, i was staring over the horizon, when suddenly 2 orange orbs appeared. they quickly dissolved (idk how else to describe it) i tried to move my camera to catch them, and suddenly another one appeared, and faded just as quick. but i caught it on my camera faintly. i continued taking photos with long shutter in hopes of catching more of these \"orbs\", and i caught 2 in my photos. but there were more, i just missed them ( had the camera pointing slightly off, dang it!) At this point everyone was talking about them. some people left because they were scared it was going to crash and cause a huge wave. others said \"its like clover field\" and most just stayed and watched on in amazement. these orbs happened several times. the first, 2 appear from up in the sky. like someone throwing a glowing bouncy ball directly at you, they had no tail almost. the faded into existence, got super bright, and the faded back out in a matter of seconds. 2 right beside each other (left one first then the right one and then went away at the same time.), then the were gone and a 3rd one appeared to the left of the other two. about 20 minutes after that, and other one appeared, only larger than any of the previous three. there was no noise other than the ocean. shortly after that, 3 appeared at the same time, only SUPER close, like a plane over head, but still no noise. then one final one was faint in the distance. Everyone was glued to the sky. about 30-45 mins after the last orb seen, military helicopters flew in from the south and north. we heard them coming. the paralleled the coast with lights on as normal. then the lights stopped, we could still hear them but could not see them in the dark. it gave everyone there an eerie feeling. very uneasy. i asked the local news, and they had no word of anything going on off shore tonight. I've lived near marine and army bases my entire life. i know what planes are like. i can tell you the type of plane just by the sound usually. i know what lights are for planes and which are for helicopters. i know what kind of things they do during practices. These lights were not anything that was flying. If i had to guess i'd say, ball lightening, a meteor falling at a straight angle to us, giving it a small tail and almost no sense of falling or a UFO. I have no idea what they are though, im just guessing blindly. The local news deemed it at \"space junk\"."],"City":"Wrightsville Beach","Region":"North Carolina","Object Shape":"Sphere","Country":"United States","trends":["There has been one other sighting in Wrightsville Beach","There were no other sightings in Wrightsville Beach on or around May 17th 2011","This sighting has never been favorited.",""],"Latitude":"34.218334","Date of the Event":"05/17/2011 10:15 UTC","Sighting Duration":"01:15:00"}