{"Longitude":"-118.383351","trends":["There have been 3 other sightings in College Place","There were no other sightings in College Place on or around May 19th 2011"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Log Number":"US-05202011-0002","Latitude":"46.056283","map":"<A HREF = \"http://maps.google.com/maps?q=46.056283,+-118.383351(29147)&iwloc=A&hl=en\"> mufon case (29147) map </A>","City":"College Place","Object Features":"Unknown","Tags":"City","Case Number":"29147","Region":"Washington","Source":"MUFON","Disposition":"IFO","Summary":"Triangle UFO over Walla Walla","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"05/19/2011 10:25 UTC","divs":["Sighting DetailsI was outside facing west when I noticed flashing lights in the distance. I figured it was just an airplane but the flashing lights seemed a little strange to me; there were two white lights that flashed brightly and then a red light in between that flashed when the white ones were off. This continued for a while and then the white lights stopped and it was just two red lights flashing side by side, opposite of the other. By this time I had grabbed my binoculars and was observing the object through them. Through the binoculars I could see that the two red lights just got brighter and dimmer but never turned off. As the object got closer the flashing patterns continued to change between a combination of red and white lights, but once it was directly overhead all flashing stopped and three white lights formed a perfect triangle and there was a red light in the center of the triangle. I observed it in this shape for the rest of the event and it eventually disappeared into thin air in the eastern sky, but it may have just gone behind some clouds. The whole event seemed strange with the flashing lights changing patterns and shapes so often and eventually forming an unmistakable triangle object, I'm not sure what it was."],"files":["/var/www/straped/mufon/html2text/29147.html.txt","/var/www/straped/mufon/org/29147.html"],"Object Shape":"Triangle","Date Submitted":"05/20/2011 02:38 UTC"}