{"files":["/var/www/straped/mufon/html2text/2914.html.txt","/var/www/straped/mufon/org/2914.html"],"divs":["Sighting DetailsI was in my 9th floor Houston office facing North. Spotted an object near thenorthwest corner of the 610 loop around Houston. It was small and hard todetermine the altitude. It seemed to drift slowly to the south then to thesoutheast. The object appeared to be small and round. It seemed to wobble orspin. It flashed a fiery red light at an irregular interval. Sometimes the lightwas quick and dim. Other times it seemed to flare up. I thought it might be alarge balloon reflecting the setting sun in the west but the flashing had amechanical quality and seemed too red for reflected sunlight. As it slowlypassed over the building I lost sight of it and so left my office to godownstairs to see if I could catch it on the other side of the building. When Icame outside and looked around it was gone. However at the same time I lookedsouth and saw a single military aircraft F-16 moving untypically fast from thedirection of Ellington Field and moving WNW. It seemed to be 3-5 miles to thesouth. The plane then went west and I think did a U-turn back toward the east. Iwould note however that President Bush is in town tonight for a fund raiser. Thenews reported scrambeling an F-16 to intercept a private pilot in the same areabut no name or other details were given. It would be interesting to know if thiscould be confirmed with details. Thats it. I dont know what it was. It was NOT aplane or helicopter. It seems like it could possibly have been a balloon of somekind but the flashing was weird - unless it has an irregular surface that wasspinning and possibly reflecting light from the sunset in the west. Plausible -but I just cant say. It was certainly unusual enough to get and hold myattention. I took 3 digital photos of the small object which showed more detailthen I expected when enlarged. Balloon You tell me. If you email me I will sendyou the photos."],"Source":"MUFON","Object Shape":"Cone","Latitude":"29.769993","Disposition":"Unknown","Longitude":"-95.36329","Log Number":"","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Unknown","Country":"United States","Region":"Texas","Date Submitted":"03/08/0001 05:40 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Flashing red sphere over Houston with F-16 nearby","map":"<A HREF = \"http://maps.google.com/maps?q=29.769993,+-95.36329(2914)&iwloc=A&hl=en\"> mufon case (2914) map </A>","Sighting Duration":"00:30:00","City":"Houston","Case Number":"2914","Tags":"City","Date of the Event":"03/08/0001 05:40 UTC","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around March 6th 0001"]}