{"files":["/var/www/straped/mufon/html2text/29160.html.txt","/var/www/straped/mufon/org/29160.html"],"Country":"United States","Weather Factors":"Unknown","Longitude":"-120.143952","Latitude":"47.377073","Object Features":"Undisclosed","Date of the Event":"05/20/2011 10:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.377073,+-120.143952(29160)&iwloc=A&hl=en\"> mufon case (29160) map </A>","divs":["Sighting Details I saw a light emerge from the clouds that was stationary it lasted about 5 seconds. It was about 45 degrees above the horizon, 25 degrees above my treeline, SE direction. It was about 10:45pm pacific time. I was sitting in my back yard star gazing in Rock Island, WA. The light faded in almost the exact appearance of a star except for it got brighter and brighter till it was flaring out about half of the size that the moon is. Looked exactly like landing gear light on an airplane, but only one light off white, with no wing lights or flashing. After it faded out in about 5 seconds, I realized there were no clouds there, that I was almost sure from which it had appeared. No sound. The eerie thing is that it was perfectly stationary like a star, looked like an airplane, no sound and linear fade in and out. Meteor? What are the odds that it could come perfectly straight at me with no color variation, and for five seconds? I wanted to think supernova at first, but very man made looking color like halogen head light. No size just point like emission of light that kept growing. No ability to detect approximate elevation either. The Yakima firing range is about 30 miles SW of here, so I was also thinking maybe some kind of military lighting beam or some energy project. It was substantial enough to put me into shock, and make me want to log on the internet and see if anyone else saw it. Or from where they might have seen it, so we could triangulate a potential altitude. I'm mostly just confounded since I do a lot of star gazing and have never seen anything quite like it."],"Tags":"City","Viewing Distance":"Unknown","Region":"Washington","Case Number":"29160","City":"Rock Island","Summary":"I was stargazing and saw a stationary light fade in about half as bright as the moon, then back out.","Disposition":"IFO","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Object Shape":"Star-like","Log Number":"US-05212011-0005","Date Submitted":"05/21/2011 03:21 UTC","trends":["There have been no other sightings in Rock Island","This sighting has never been favorited."]}