{"Log Number":"US-05212011-0011","Date Submitted":"05/21/2011 02:44 UTC","Latitude":"33.927699","files":["/var/www/straped/mufon/html2text/29166.html.txt","/var/www/straped/mufon/more/29166_submitter_file1__UFOgreg5-20-2011.jpg","/var/www/straped/mufon/more/29166_submitter_file2__UFOMilena5-20-11.jpg","/var/www/straped/mufon/org/29166.html"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"29166","trends":["There have been 4 other sightings in Sandy Springs","There were no other sightings in Sandy Springs on or around May 20th 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.927699,+-84.373518(29166)&iwloc=A&hl=en\"> mufon case (29166) map </A>","Region":"Georgia","Longitude":"-84.373518","City":"Sandy Springs","Source":"MUFON","divs":["Sighting DetailsMy wife and I were in the parking lot of a very crowded movie theater but all the way down at the very end of the lot. We had just left the new Pirates Of Carribean movie and were walking back to out car. When we got to the car I was walking around to open the door for my wife and we were discussing something when all of a sudden my eye caught something moving...I looked up and saw an amazing sight. What looked at first like a fireworks piece was shooting across the sky but it was to me very close maybe only 100-300 feet above us. It was moving fast with no noise and seemed to be about 30-50 feet long and maybe only 4-6 feet wide. This did not seem like a typical UFO type \" craft \" but rather more of a fireball type vessel... It seemed to have a circular head and then brilliant blue, red and orange maybe a little yellow ish tail like rear end. I was so amazed I mumbled \" what is that \" to my wife who then looked up and saw it as well. We both watched together for only 2-3 seconds then as if it knew we had spotted it..while still in motion it simply vanished. No smoke, no sounds nothing just gone. We both stood their amazed and questioning each other what the heck it was. Neither of us has ever seen anything like that ever. Very very amazing and cool to experience and unlike anything we've ever seen. neither of us are artists but we came home and each independently drew best we could what we saw. We have attached."],"Object Flight Path":"Straight-line path","Disposition":"Unknown","Weather Factors":"None","Date of the Event":"05/20/2011 10:28 UTC","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Summary":"outside movie parking lot a moving object caught my eye I looked up and it was moving strait, fast brilliant colors then it vanished","Object Features":"Undisclosed","Object Shape":"Cone, Fireball"}