{"Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/29169.html.txt","/var/www/straped/mufon/more/29169_submitter_file1__8-03-06PMarrow.JPG","/var/www/straped/mufon/more/29169_submitter_file2__8-03-22PMarrow.JPG","/var/www/straped/mufon/more/29169_submitter_file3__8-03-32PMarrow.JPG","/var/www/straped/mufon/org/29169.html"],"City":"Homewood Township","Weather Factors":"Unknown","Disposition":"IFO","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"05/11/2011 12:00 UTC","Case Number":"29169","Region":"Kansas","Tags":"City","trends":["There have been 2 other sightings in Homewood Township","There was one other sighting in Homewood Township on or around May 11th 2011","This sighting has never been favorited.",""],"divs":["Sighting Details8:00PM, May 10, 2011, I was driving south bound on I-35 after a gas-up in Kansas City when I needed to pulling into a rest stop to fix a bad MAP sensor in my 93 Chevy Van. As I was parking my van in the diagonal parking spaces facing North East of this rest stop (location is near Homewood Township, Kansas, elevation 1,040 feet, Latitude: 38-30'53'' N Longitude: 095-22'44'' W.), I noticed a quarter moon setting low in the eastern horizon in a bright red color. Having seen objects in the sky on previous road trips, I was prepared with two tripod mounted digital cameras (#1 cam is a JVC's GC-FM1AU 1080 HD and #2 cam is a Sony's HMS-CM1 MP4 HD camera) ready to shoot which I had setup in the passenger compartment of the van. I quickly brought both cameras out and to the front of the van. I extended the tripods and made sure they where well seated on the concrete sidewalk and I made sure the cameras where adjusted and locked into a level plane before I began shooting photos. The night air had a slight chill but yet the temperature was comfortable. The wind had a constant breeze from the south and the sky was quite clear with no cloud obstructions however there was a cloud formation about 40 to 50 miles south of my location. Just after the red moon set below the horizon, I got a hair-raising-sensation in the back of my neck and rapidly snapped a few more photos with the Sony HMS-CM1 HD MP4 camera. I could only see the stars in the horizon at the time of the hair-raising-sensation so I did not know what I was photographing. After taking this next set of photos, I became real sleepy and decided to pack-up the tripods and take a nap in the van. I believe I sleep for four hours and then continued on my road trip. The photographs enclosed are the four of the eight photos taken after the red moon has set below the horizon. I have used two stars in the horizon as point of reference. What the Non-solid Celestial Object is - is unknown. The time line of photos (there were eight photos take total but these photos 8:03:06PM, 8:03:22PM, 8:03:32PM, and 8:04:12PM) show the object phasing in then out of sight then it is moving into the winds direction. I could not see this thing at the time the photos were being taken, I just had a feeling it was there."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.509021,+-95.373018(29169)&iwloc=A&hl=en\"> mufon case (29169) map </A>","Summary":"Non-solid Celestial Object","Date Submitted":"05/21/2011 03:30 UTC","Longitude":"-95.373018","Object Features":"Unknown","Latitude":"38.509021","Object Flight Path":"Straight-line path","Object Shape":"Other, Unknown","Country":"United States","Log Number":"US-05212011-0014"}