{"Case Number":"29175","Viewing Distance":"Unknown","trends":["There have been no other sightings in Wildorado","This sighting has never been favorited."],"Date Submitted":"05/21/2011 07:58 UTC","Country":"United States","Longitude":"-102.200477","Date of the Event":"01/13/2011 02:15 UTC","Disposition":"IFO","Latitude":"35.209498","files":["/var/www/straped/mufon/html2text/29175.html.txt","/var/www/straped/mufon/org/29175.html"],"Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Undisclosed","Region":"Texas","Sighting Duration":"00:01:00","Object Shape":"Circle","divs":["Sighting DetailsI'm a truck drvr traveling West 1-40 after picking up my trailer from Amarillo, Tx heading to Abq. NM. at approx. 2-2:30am CST. I don't remember the mile marker in which i've seen this object. I can estimate it was between mm#25-45. It was a clear night with few scattered clouds when a glow caught my attention in front of me. I saw it through my windshield as it traveled straight to the east. What I saw was just above the bottom layer of a small patch of clouds. It was flickering, the best way I can describe it, imagine headlights peering through some trees (trees being between you and the headlights)as it travels down the road. It flickered about three times. At first I thought it was a comet or meteor, but it was traveling much to slow. As I studied it, wondering what it could be I could only see the underbelly of this craft. The object was round emanating a white light with a blueish tint. I noticed a dark shaded center spot. Around this spot was a dark shaded ring, about the same shade as the spot. The circumference was also the same dark shade but it seem to have a pattern but not sure. These areas were not completely dark, just a shade. The light emanating from this craft formed a halo affect around it. In the halo I can see the clouds moving away from the craft(not around it)like the way fire moves. This object seem to have some obscured affect, shield or energy not sure but I was able to make it out. Not sure of the size, but i estimate it was the size of a .25 cent coin if you held it just front of you as you. Clouds were not very high, this object was just above the bottom layer of the clouds. I was confused as to what i saw, I tried to rationalize as to what it could be. The feeling I got from it was the feeling that i was not suppose to see it, but it got caught. Then it just dissapeared before it reached the end of the cloud as i waited to see it come out. If you have any questions please call me anytime. I work graveyard I'm up through the night."],"City":"Wildorado","map":"<A HREF = \"http://maps.google.com/maps?q=35.209498,+-102.200477(29175)&iwloc=A&hl=en\"> mufon case (29175) map </A>","Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-05212011-0019","Summary":"Round, white blueish tint,"}