{"trends":["There have been no other sightings in Rd Bluff","This sighting has never been favorited."],"Object Shape":"Flash, Sphere","Viewing Distance":"Unknown","Date Submitted":"05/22/2011 02:03 UTC","Case Number":"29187","files":["/var/www/straped/mufon/html2text/29187.html.txt","/var/www/straped/mufon/org/29187.html"],"Disposition":"Insufficient Data","Tags":"City","Source":"MUFON","City":"Rd Bluff","Summary":"Between 15 or 20 strobing circular objects moving south to north at high altitude, no audible sound fallowed several minutes lated by 10 or 11 bright flashes in the nothern sky","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Latitude":"33.98244","map":"<A HREF = \"http://maps.google.com/maps?q=33.98244,+-118.118246(29187)&iwloc=A&hl=en\"> mufon case (29187) map </A>","Country":"United States","Log Number":"US-05222011-0003","Longitude":"-118.118246","Object Features":"Undisclosed","Region":"California","Date of the Event":"05/21/2011 09:05 UTC","Sighting Duration":"Undisclosed","divs":["Sighting Details let me start by saying, this event occured only an hour and thirty five minutes ago. At 9:05 this evening my self , my friend Bob, and friend Geary wer siting in Bobs back yard. Bob got up, walked int the house and as geary was talking to me I looked up and saw what I believed to be 20 or 25 blue strobing lights, all flying at the same speed in a loose (disorganized formation ?). I jumed up and yelled look,look,look,look!Geary swung around and said \" WHAT THE **** IS THAT\". I did'nt answer him. He then tried to convince me ( and himself ) that they were geese flying north with thier flapping wings being illuminated by the sun, wich was well below the horizon by then. There were plenty of visabe stars in the sky to contrast with these objects.The group was obscured by trees for 8 to 10 seconds and then reapeared. I yelled at Bob \" Bob! Get out here now!\" As he caught view for only for the last 10 seconds before the objects were to hard to see in the northwestern twilight. This event was fallowed 5 to 6 minutes later with a series of bright quick flashes from the north. between ten and fifteen flashes over a perion of about 10 minutes."]}