{"Log Number":"US-05222011-0001","Date of the Event":"05/21/2011 11:05 UTC","Date Submitted":"05/22/2011 12:38 UTC","Longitude":"-83.286747","Region":"Michigan","Tags":"City","divs":["Sighting DetailsMe and 2 friends were driving home when we saw lights in the sky from the front windshield. There were 2 circular lights going around in a pretty big circle. One light was blue one light was red. It was like a light made from a laser, and not a flash light. Then after a short moment, they split up and sort of wandered around, at least one of them was. Then the lights started changing colors to maybe like an orange color and then back to a blueish light. Thats when they got together side by side and took off. They kept going higher and higher then disappeared. When I first saw I thought it was light from like a grand opening, a big event or something. Then I thought it might be a jet. But those thoughts quickly went away and I knew I was looking at a UFO. I used to watch a lot of ufo shows, and these lights I dont know how someone can explain. It was going in a big circle like it was one object, then they flew on their own. They flew pretty far away from eachother, got back together and flew upwards. At first I was looking at the lights in the front windshield, then the side window, and then the back because we were driving. I got a little video while in the back seat but the car was moving and I was more interested in seeing it than capturing it on video. Not the best video, but maybe it can help and hopefully someone in the area reported this incident or happened to record a better video."],"City":"Pontiac","Summary":"red light and blue light going in a circle then split up and wandered around then went upwards","Object Features":"Undisclosed","Country":"United States","trends":["There have been 16 other sightings in Pontiac","There were no other sightings in Pontiac on or around May 21st 2011"],"Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","Case Number":"29185","map":"<A HREF = \"http://maps.google.com/maps?q=42.640172,+-83.286747(29185)&iwloc=A&hl=en\"> mufon case (29185) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"42.640172","Disposition":"Unknown","Weather Factors":"Rain","files":["/var/www/straped/mufon/html2text/29185.html.txt","/var/www/straped/mufon/org/29185.html"],"Object Flight Path":"Undisclosed"}