{"divs":["Sighting DetailsThis sighting happened back in 88, about a year after I graduated. Me, and a friend of mine were out driving around, got a coke and burger, noticed a very intense thunder storm cell to the Northeast. It was intence, lightening every second. More intense than most. Rarely does storms come in from this direction, but, as we watched for awhile, it seemed to be moving toward Roswell. We were kinda looking for something to do. It was getting close to sundown. So, we decided to drive out about 10 miles to the east of roswell where there are some small mountains overlooking the city, close to the pecos river. Everyone calls this place the overlook. We parked, facing the storm, which was very close, still intence. The sun had just went down, and it was kinda getting dark. The storm wasnt like super huge or anything. Kinda like a super, mini cell. It was butifull to watch. No, we werent drinking or doing drugs, thats something I never got into. The winds started picking up as it got closer. We could here a constant rumbling of thunder. The clouds were like rippled, and very low. We were kinda getting nervous, and were talking about getting out of there when I noticed a light dip out from the low rippled clouds. It just sat there for around 30 seconds. I told my friend to look. He seen it too just before it went back up into the cloud. It surely wasnt an airplane, because it wasnt moving. It then dipped back down again, again stopping just below the clouds, then, a few seconds later, a second light dipped out. This one was close to the first one. My friend tried getting a picture, but, only had a cheap regular camera, and of coarse nothing came out. About a minute later, the first light goes back up, followed closely by the second. The winds were blowing like crazy, as it started sprinkling. We braved it out, hoping to see more of the objects, wondering what they were. If they were manmade we thought, it would have had to been helicopters. But, I just couldnt imagine helicopters hovering in an intense thunderstorm like this one. I dont know much about helicopters. But, if they sometimes do things like this, then, maybe it was just helicopters. I just find it hard to believe, with all the lightening and winds. Only other idea I have, is that it might have been ball lightening. But, I dont give that much credit either. The lights seemed to be inteligently controlled, dipping to a certain point, then going back up. Kinda like playing peek a boo. Anyway, Im putting this down, kinda interested in other points of views on what they might have been, and, wondering if anyone else has ever seen anything like this. One last thing, might be strange, might not. But, the storm seemed to change directions, right when it got to the edge of where we were. It slowly drifted back east, going the oposite direction of Roswell......"],"Log Number":"US-05222011-0006","City":"Artesia","Source":"MUFON","Object Shape":"Star-like","Object Flight Path":"Hovering then path,Other","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/29191.html.txt","/var/www/straped/mufon/org/29191.html"],"Case Number":"29191","Longitude":"-104.393706","Tags":"City","Summary":"UFO dipping out from under storm cloud.","Disposition":"IFO","Latitude":"32.850074","Date of the Event":"06/07/1988 12:00 UTC","Object Features":"None","Region":"New Mexico","Date Submitted":"05/22/2011 09:22 UTC","Country":"United States","trends":["There have been 5 other sightings in Artesia","There were no other sightings in Artesia on or around June 7th 1988"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.850074,+-104.393706(29191)&iwloc=A&hl=en\"> mufon case (29191) map </A>","Viewing Distance":"Over 1 Mile, Unknown"}