{"Object Shape":"Disc, Sphere","Summary":"witnessed two UFOs approximately 20 miles north west of Ojai. They maintained identical altitude 45minutes.","Object Flight Path":"Path then hovering","Disposition":"Unknown","Weather Factors":"None, Does Not Apply","Case Number":"29192","files":["/var/www/straped/mufon/html2text/29192.html.txt","/var/www/straped/mufon/org/29192.html"],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.28023,+-119.227315(29192)&iwloc=A&hl=en\"> mufon case (29192) map </A>","trends":["There have been 17 other sightings in Ventura","There were no other sightings in Ventura on or around May 21st 2011"],"Tags":"City","Log Number":"US-05222011-0008","Date of the Event":"05/21/2011 10:50 UTC","City":"Ventura","Region":"California","Sighting Duration":"Undisclosed","Latitude":"34.28023","Date Submitted":"05/22/2011 12:19 UTC","Longitude":"-119.227315","divs":["sighting detailsat 10:50 three objects came into my sight from a distance of 20 miles away or more. they must have been beyond the coast line, possibly over the pacific ocean as i observed them facing due west\\northwest from the city of ojai. initially i thought all three to be airplanes and observed the third object cross my field of vision (consistent with airplane flight) while the other two stopped and maintained there position at an identical altitude, hovering for 45 minutes. during the 45 minutes they were observed moving straight up, down and left\\right. these movements are inconsistent with maneuverability of traditional aircraft. at 11:20 one of the crafts seemed to diminish in size while still keeping the same altitude as the other craft. i believe it was flying away from me or out to sea in this case. at 11:30 the remaining craft descended slowly straight down until it was out of my field of vision. i attempted to film and photograph but was unable due to there distance. i would describe the objects as orbs or disks. unfortunately from the distance i am unclear as to which. the put off a orange light and moved in a way as i can only describe as fluid in any direction. my feeling during the sighting was one of sheer joy and amazement."],"Source":"MUFON","Country":"United States","Object Features":"Unknown"}