{"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/2919.html.txt","/var/www/straped/mufon/org/2919.html"],"Case Number":"2919","Object Shape":"Cylinder, Oval","Summary":"Six disc shaped craft seen in daylight over Denver","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Date of the Event":"03/09/2003 04:15 UTC","Latitude":"39.745044","Region":"Colorado","divs":["Sighting DetailsI was walking my dog in the vicinity of 32nd and Federal in Denver at 415 PM onthe afternoon of Tuesday, March 9th, 2004, and was scanning the clear sky.Almost directly overhead I saw a round object that was about the size of a BBheld at arms length that was moving rapidly to the northeast. As I watched it Ihad to change position to keep the object in sight, and I noticed that therewere five similar objects following the first. They were completely silent andappeared to be flying in a loose formation, and all appeared oval or ellipticalas the flew off the the northeast. I had them in sight for 25-30 seconds. Asthey headed out off the objects reminded me of the 1950 Great Falls UFO film.The objects would have crossed the front of a light plane I saw flying due southbut I believe they were some thousand or more feet above the altitude of theplane. I also looked around and saw a helicopter to the north that appeared tobe hovering in the area of Federal and I-70, which I assumed was a news chopper.At around 1645 I was again out side and looked to the north where I had seen thehelicopter and saw another strange object that hung stationary in the sky. Itappeared as a black cylinder with a white streamer below it. I was able to getmy binoculars and the object appeared to be a group of orange balloons with redlights on them. The white streamer below it appeared rigid and did not move. Iwatched this object for about five minutes before leaving, and when last seenthe object was ascending."],"Object Features":"Other","City":"Denver","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.745044,+-104.982403(2919)&iwloc=A&hl=en\"> mufon case (2919) map </A>","Tags":"City","Country":"United States","Log Number":"","Date Submitted":"03/09/2003 04:15 UTC","Disposition":"Unknown","Longitude":"-104.982403","Sighting Duration":"00:00:30","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around March 9th 2003"]}