{"Tags":"City","trends":["There have been 8 other sightings in Cedar City","There were no other sightings in Cedar City on or around May 22nd 2011"],"files":["/var/www/straped/mufon/html2text/29205.html.txt","/var/www/straped/mufon/org/29205.html"],"Source":"MUFON","divs":["Sighting DetailsI went out camping with my best friend for the weekend. It was just starting to get dark and we were taking our dirt bikes out for one last run when my friend pulled over to the side of the trail and waved back at me to get me to stop. When I took off my helmet and asked what was wrong she told me her engine had kicked out, which is really weird because her bike is less than a year old. As she tried to kick start her bike I saw her frown and point to the sky ahead of us (Eastern Sky) and didn't say a word. We both saw the same thing. Nine or ten lights were glowing bright yellow, connected in a triangular pattern. At first I thought maybe it was a cell phone tower or maybe lights from town, but we were facing away from the nearest town and towards the desert and the longer we watched it, we saw that it was rotating in a slow circle as it moved across the horizon. The distance was hard to judge and I almost thought we were seeing a smaller object nearer to us but one of the tips disappeared beyond the mountain as it spiraled past it; giving me the impression of it being massive in size. Once I got a scope of its sheer size, I sat on my bike with my mouth open and staring in shock, thinking about trying to get closer for a better sight. By the time I worked out that it didn't resemble any aircraft I've ever seen, the lights intensified and the whole shape vanished behind the mountaintop. I started to speak and was interrupted by what sounded like the belated boom from a jet after it passes you and I can only assume the two were related. I don't know if I say aliens or experimental military craft or what, but I know I saw something. Also, my friends bike is still messed up... Don't know if those are connected."],"City":"Cedar City","Object Features":"Appendage(s)","Date Submitted":"05/22/2011 08:32 UTC","Case Number":"29205","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"05/22/2011 08:20 UTC","Region":"Utah","Viewing Distance":"Unknown","Log Number":"US-05222011-0021","Latitude":"37.678767","Summary":"It looked like ten or less yellow lights arranged in a triangle.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.678767,+-113.059393(29205)&iwloc=A&hl=en\"> mufon case (29205) map </A>","Disposition":"Unresolved","Object Shape":"Triangle","Longitude":"-113.059393","Weather Factors":"Unknown"}