{"Date Submitted":"05/23/2011 12:12 UTC","Tags":"City","Case Number":"29213","Summary":"flying above atmosphere, star sized, extremely fast, effortless direction change","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.251314,+-111.624889(29213)&iwloc=A&hl=en\"> mufon case (29213) map </A>","divs":["sighting detailsmyself and my girlfriend, trish, were out front of our house in the garage as we were preparing to move and loading a trailer for the morning when we noticed two star sized objects that were obviously not airplanes. the first flew from the south (tucson) in a northern direction, not in a direct flight pattern, appeared to be weaving through stars, and was the same size as the stars. the object was flying at a high rate of speed and when it first came into view it was as bright as the other stars and then diminished as though it was no longer flying in our atmosphere. the second object appeared to be the same size and brightness as the first, occurring seconds after the first diminished, and came into view flying from the southwest to the same location in the north the first object had flown. the second object also appeared bright, star sized, and flew in a simmilar random star weaving pattern as the first then diminished in brightness as though it was no longer in our atmosphere. the sighting lasted approximately 3.5 minutes at 20:35 hours on 05\\22\\2011."],"Region":"Arizona","trends":["There have been 21 other sightings in Queen Creek","There were no other sightings in Queen Creek on or around May 22nd 2011"],"Source":"MUFON","Latitude":"33.251314","Longitude":"-111.624889","Disposition":"IFO","Viewing Distance":"Over 1 Mile, Unknown","City":"Queen Creek","Date of the Event":"05/22/2011 08:35 UTC","Log Number":"US-05232011-0001","Object Features":"Other","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/29213.html.txt","/var/www/straped/mufon/org/29213.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"00:03:20","Object Shape":"Star-like"}