{"files":["/var/www/straped/mufon/html2text/29229.html.txt","/var/www/straped/mufon/org/29229.html"],"Object Flight Path":"Path with directional change","Object Features":"None","City":"Minneapolis","Log Number":"US-05242011-0002","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Unknown","Latitude":"44.987315","Sighting Duration":"Undisclosed","Case Number":"29229","divs":["Sighting Details1. sitting on 3rd floor balcony with 5 friends, looking at downtown Minneapolis skyline from the southwest by MCTC. drinking jones cola. 2. noticed light moving across two antenna of tallest building in state, behind it. like a helicopter but then it changed directions. 3. thought it was a helicopter but then it changed directions several times and appeared to be moving back and forth across the top of the IDS building, from our vantage point. it was obviously off to the east. 4. it was a small yellow-gold light with a red light underneath. two of us think we saw the lights separate as it climbed, like the red dropped off from the yellow light. its motion was weaving fast back and forth, from the north to the south, above what we saw as the IDS center but since it kept disappearing into the clouds we dont know how far away. MSP and STP airport radar towers is who i would call if i were you. 5. i was incredulous but amazed and completely convinced that it was no aircraft i have ever seen. not a blimp, balloon, wasnt military testing of secret tech over a metro area before midnight. wasnt a helicopter. i felt sincerely like i had waited my entire life to see that. 6. it winked in and out back and forth, hiding in clouds and behind the IDS center for many minutes. last we saw it it popped out from the left side of the IDS building and disappeared into the clouds, about 15 minutes after first sighting. i who am writing this was the first to see it."],"Object Shape":"Flash, Star-like, Other","Date Submitted":"05/24/2011 01:51 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.987315,+-93.255326(29229)&iwloc=A&hl=en\"> mufon case (29229) map </A>","Region":"Minnesota","Weather Factors":"None","Disposition":"Unknown","Source":"MUFON","Summary":"bright, yellow-gold light and smaller red light below it","Longitude":"-93.255326","Date of the Event":"05/23/2011 11:30 UTC","Tags":"City","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around May 23rd 2011"]}