{"Disposition":"Unknown","City":"Philadelphia","Longitude":"-75.159519","Date Submitted":"05/23/2011 05:17 UTC","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/29221.html.txt","/var/www/straped/mufon/org/29221.html"],"divs":["Sighting DetailsI was sitting on the sofa with a friend, watching television, when I was suddenly startled by something approaching from the my left. I was inclined to look down when I spotted a black orb slowly floating about six inches above the floor. It moved slowly, gently and soundlessly floated across the room. When I first saw it, it was approaching the leather chair which is about 6' from where we were sitting, and most likely coming from the area of the kitchen and rear yard before that. I stared at it until the orb reached the front entrance, but was approximately 3' away from the door. It hovered in front of us for almost thirty seconds, then vanished before our eyes. My friend and I looked at each other in sheer wonderment and surprise. I uttered, \"Did you see that?\" He answered, \"Yes. What was that?\" \"I don't know,\" I replied. \"I know it's a sphere, but I have never seen it that color before. It may be some form of new technology to gather information.\" I went on to say that I feel like I'm being watched because of all the previous incidents I've had with vanishing objects as well as people throughout the course of my life. They're probably trying to find out who you are and what is your purpose for being here. I'm just speculating about who these people are. Thank god my friend wasn't thwarted by the sighting. I haven't mentioned all my other sightings and experiences because of the negative stigma connected with UFO sightings."],"Country":"United States","Viewing Distance":"20 Feet or Less","Source":"MUFON","Tags":"City","Object Flight Path":"Path then hovering","Log Number":"US-05232011-0009","Weather Factors":"Unknown","Case Number":"29221","Date of the Event":"08/31/2009 12:00 UTC","Latitude":"39.960065","Object Features":"None","Sighting Duration":"Undisclosed","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around August 31st 2009"],"Region":"Pennsylvania","Summary":"Black sphere, approximately 8-9 inches across. It was not a shiny orb, but rather a flat dark charcoal color.","map":"<A HREF = \"http://maps.google.com/maps?q=39.960065,+-75.159519(29221)&iwloc=A&hl=en\"> mufon case (29221) map </A>"}