{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29220.html.txt","/var/www/straped/mufon/org/29220.html"],"Date Submitted":"05/23/2011 12:29 UTC","Disposition":"Unknown","Object Features":"None","Source":"MUFON","divs":["Sighting DetailsI had just started taking my daily morning walk along a busy Pkway in Las Cruces, NM. It was a CLEAR, blue sky day. About 8:35 a.m. The Moon was pale in the morning sky. No clouds. I usually observe the beautiful morning weather and I live on a ridge so its hard to miss the sky ahead. I live on a main parkway...cars were driving by. I saw something in the sky. At first I thought, that's not the shape of a plane. It seemed white in the sun. Egg or almond shape. The object was stationary. I stopped walking. The object stayed still as I watched it. I knew it was not a star. There were no stars in the sky. The object started to move ever so slightly. I thought...I wonder if my camera can catch this? It was kind of far away. As I stood there and started to retrieve my Blackberry, I kept my eyes on the object. The object started to simply fade and then disappear. It was stationary when it disappeared. I stayed looking at the sky thinking it would return. As I was looking up...a car drove by and a girl yelled out of the window \"It's GONE!\". I knew I was not the only one who saw it. I feel like it was an unidentified flying object. I wrote my children and my best friend right away. I have only lived in New Mexico for 3 weeks. I have never seen anything like that, that I can remember. After about 5 minutes as I continued my walk. I saw a jet in the sky. I thought...I wonder if someone reported the object. I knew that the military sometimes sent up jets as a follow up to a report."],"Longitude":"-106.756944","Object Flight Path":"Stationary,Straight-line path","Summary":"Only object in completely clear blue sky in a.m. Appeared stationary, disappered.","Region":"New Mexico","Viewing Distance":"Over One Mile","trends":["There have been 24 other sightings in Las Cruces","There were no other sightings in Las Cruces on or around May 31st 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.32582,+-106.756944(29220)&iwloc=A&hl=en\"> mufon case (29220) map </A>","Case Number":"29220","Tags":"City","Country":"United States","City":"Las Cruces","Object Shape":"Egg","Log Number":"US-05232011-0008","Latitude":"32.32582","Weather Factors":"Unknown","Date of the Event":"05/31/2011 08:35 UTC"}