{"files":["/var/www/straped/mufon/html2text/29237.html.txt","/var/www/straped/mufon/more/29237_submitter_file1__IMAG0038.JPG","/var/www/straped/mufon/org/29237.html"],"Object Shape":"Other","Country":"United States","Latitude":"41.88617","City":"Villa Park","Object Flight Path":"Undisclosed","Region":"Illinois","Tags":"City","Date Submitted":"05/25/2011 03:29 UTC","Date of the Event":"01/11/2011 05:34 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","Longitude":"-87.969161","Viewing Distance":"Unknown","Source":"MUFON","Summary":"picture of mist including entity","divs":["Sighting Detailsi have been seeing ufos on a regular basis with the blue light in my room and high strangeness. actually i was hearing knocks on my roof while writing this .and the night i got the picture of the entity i was hearing knocks at my backdooor during a meditation and prayer to cleanse my chakras and my home of negative energy and entities . and i stuck my digital camera out th e window took a pic expecting to catch a peeping tom. and also about a week earlier th e same shape was casting a shadow on my bedroom wall from outside my bedroom window .my eyes opened from a sleep and i saw the shadow moving back and forth without making noise in th e leaves out back my girlfriend saw it and tried to wake me but i was already watching it .it seemed to be hovering when it moved cuz it didnt strut moving back and forth in a strange way .when i finally got the courage to look out the window it must of known cuz it left before i even got a chance.i have had many ufo sightings and just last night i got a feeling to look at the sky and saw another star like ufo but ive seen triangles red and orange on m0re than one ocasion and with witnessed sightings of large white orbs one over my neighbors and it moved away when i saw it so fast it almost looked like it disapeared and another time i got a feeling to look at th e space station and saw two orbs go under it one after another and disapear ."],"Case Number":"29237","Disposition":"Unresolved","trends":["There have been 4 other sightings in Villa Park","There were no other sightings in Villa Park on or around January 11th 2011","This sighting has never been favorited.",""],"Sighting Duration":"00:05:01","Log Number":"US-05252011-0003","map":"<A HREF = \"http://maps.google.com/maps?q=41.88617,+-87.969161(29237)&iwloc=A&hl=en\"> mufon case (29237) map </A>"}