{"Region":"Illinois","trends":["There has been one other sighting in Zion","There were no other sightings in Zion on or around May 22nd 2011","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.452352,+-87.82895(29233)&iwloc=A&hl=en\"> mufon case (29233) map </A>","Object Features":"Undisclosed","Date of the Event":"05/22/2011 07:45 UTC","Country":"United States","Summary":"small orange circl","Object Shape":"Circle","Case Number":"29233","Tags":"City","files":["/var/www/straped/mufon/html2text/29233.html.txt","/var/www/straped/mufon/more/29233_submitter_file1__UFOINTHISBITCH.jpg","/var/www/straped/mufon/org/29233.html"],"City":"Zion","Object Flight Path":"Undisclosed","Date Submitted":"05/24/2011 10:25 UTC","Disposition":"Unresolved","Longitude":"-87.82895","Source":"MUFON","Log Number":"US-05242011-0006","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"42.452352","divs":["Sighting Detailsi was at a friends house. We happened to be outside that night. We all love the way the clouds form when its about to thunderstorm. so we were all taking pictures. Anyways to be honest nobody saw it. but later on after we had gone inside, one of my friends was going through her pictures and she showed it to me. She said to look closely at the picture because there was an orange circle in the picture next to the light post. i zoomed in and i yelled out, \" UFO you guys look!!!\" lol funny thing was that when we were all outside taking pictures, nobody saw it because we were goofing off. but the reason why i reacted like that was because that night the sky was full of grey clouds. There wasnt any airplanes or anything on there. I happen to have the app UFO Report Tracker and i searched May 22nd,2011 to see if anybody else saw it and yes people did catch it. check out the picture. Theres an orange light post but thats not it. It's the very small orange circle towards the left side of it. :)"]}