{"Region":"Western Australia","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was sitting in the car waiting for my wife to come out of the bakery. It was a beautiful clear sunny day with wispy clouds in the sky. I was sitting in the drivers seat (RH drive) and i opened up the sun roof to take in the day. I looked up an saw a thin black object shaped like a boomerang moving in a straight line from north to south. It was so high in the sky the distance was really hard to judge. At first glance i thought it was a bird, then i kept watching it and realised it was way too high and moving to fast to be a bird, I also thought it may be a jet or a plane but quickly eliminated these options as there was no sound or jet streams coming from the object. If i wasn't looking i would never have noticed the object. I watched for about 20 seconds then called out to my wife to come outside and take a look at what i was seeing. I pointed out the object to her and she said 'what is that?' and i replied 'what do you see?' and she confirmed seeing a black boomerang shaped object also. We continued to watch it for another 20-30 seconds, as it moved further south i noticed that it jumped from left to right and back again a few times before disappearing. I was excited to see a UFO so clearly during daylight, but my wife was worried and visibly shaken after the event. This is the second time i have viewed a UFO The first was in 1995 the object was triangle shaped and the sighting was at night. I was driving in a remote part of Australia, and the object was flying low overhead and seemed to be keeping pace with my vehicle. This is the third time my wife has viewed a UFO. The first was in 2006, at night, the object was shaped like a teardrop or upside-down ballon, and it moved upwards into the sky. The second was in 2009, also at night, and it was two solid white lights that started at tree level and moved upwards, at a rapid speed, on a diagonal, into the sky."],"Sighting Duration":"Undisclosed","Object Shape":"Boomerang","Disposition":"Unresolved","Country":"Australia","Date of the Event":"05/22/2011 12:30 UTC","files":["/var/www/straped/mufon/html2text/29231.html.txt","/var/www/straped/mufon/more/29231_submitter_file1__boomerang.jpg","/var/www/straped/mufon/org/29231.html"],"Latitude":"-31.947924","Object Flight Path":"Path with directional change","Longitude":"115.860829","Object Features":"Wings","Summary":"boomerang shaped ufo high in the sky in broad daylight, watched for 1min then disappeared","City":"Perth","Weather Factors":"None","trends":["There have been 15 other sightings in Perth","There were no other sightings in Perth on or around May 22nd 2011","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=-31.947924,+115.860829(29231)&iwloc=A&hl=en\"> mufon case (29231) map </A>","Log Number":"AU-05242011-0004","Date Submitted":"05/24/2011 04:29 UTC","Source":"MUFON","Case Number":"29231","Tags":"City"}