{"Case Number":"29235","Tags":"City","Country":"United States","Object Features":"Unknown","Date Submitted":"05/25/2011 01:27 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29235.html.txt","/var/www/straped/mufon/org/29235.html"],"City":"Hempstead","Latitude":"40.706213","Object Flight Path":"Path with directional change","Summary":"Right angle turn at high altitude.","map":"<A HREF = \"http://maps.google.com/maps?q=40.706213,+-73.61874(29235)&iwloc=A&hl=en\"> mufon case (29235) map </A>","Weather Factors":"Unknown","trends":["There have been no other sightings in Hempstead","This sighting has never been favorited."],"Object Shape":"Star-like","Longitude":"-73.61874","Region":"New York","Log Number":"US-05252011-0001","Disposition":"Insufficient Data","Date of the Event":"10/31/1964 12:00 UTC","divs":["Sighting DetailsA freind of mine and myself were walking west along Meadow Street, Garden City, NY on a cold clear evening. We were walking to the phone booths at the Mobil Gas station at Franklin Avenue, GC to call our girlfreinds. In those days, there was only one phone in the house and we didn't want to call our girlfreinds in front of our parents and siblings. On the way to the gas station i looked up toward the sound of a jet passing overhead. Idelwild (now : JFK) international airport is not far away. I noticed a group of star like points of light moving eastward accross the sky. I remember noticing that as they passed the background stars, the stars did not blink out. I thought that was odd. As they continued eastward, they got to a point where the group made a hard right angle and shot straight south with tremendous acceleration. When i say a hard right angle turn, i mean a turn as square as a carpenter's square. We both immediately realized we had seen something extremely strange. We then hurridely proceeded to the phone booths at the Mobil gas station and looked through the phone book for the Air Force. We called a number and attempted to report our sighting. The man who we got through to only said, \"Sorry kids, no ufos sheduled for tonight\" and hung up. At that point my pal got freightened and said that we should not tell anyone about the sighting. As far as i know, he never did tell anyone. But i told everyone i could. No one beleives me. Even today, i still tell anyone who will listen."],"Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed"}