{"Country":"Austria","City":"Vienna","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Summary":"Fast Black Triangle over my head","Latitude":"48.216594","Date Submitted":"05/25/2011 10:25 UTC","Object Shape":"Triangle","Case Number":"29241","divs":["Sighting DetailsOn my way to the train station I saw a Black Triangle object, it was under the height a plane usually is flying and doesn't make any sound... however first of all the sighting lasted just a few seconds (2-3 seconds) but it was close enough that I have been able to describe it to myself as Triangle like and entirely black - with no light on it... however it was a alley so I lost the view on it, in this moment I rushed to the next crossroad where I had a better view, on this position I was able to see it again, but the position was far away, but still I recognized the object (it was about 30 seconds later), after short time I wasn't able to see it anymore. I wasn't able to take a picture (unfortunately because it would be a kind of proof for Triangle UFO's), but I drawed a sketch (it's not very exact, as the sighting lasted for a very short time, I made the sketch from the way I described the UFO to myself during the short close encounter). The Triangle was kinda cut-up, so it was triangle like but also a bit different, I tried to draw this as good as possible on my sketch."],"map":"<A HREF = \"http://maps.google.com/maps?q=48.216594,+16.381959(29241)&iwloc=A&hl=en\"> mufon case (29241) map </A>","Object Flight Path":"Hovering then path","Region":"Wien","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/29241.html.txt","/var/www/straped/mufon/more/29241_submitter_file1__ufo-sketch.jpg","/var/www/straped/mufon/org/29241.html"],"Object Features":"Undisclosed","Log Number":"AT-05252011-0007","Date of the Event":"02/13/2011 07:32 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"16.381959","trends":["There have been 3 other sightings in Vienna","There were no other sightings in Vienna on or around February 13th 2011","This sighting has never been favorited.",""]}