{"Case Number":"29240","Region":"Georgia","files":["/var/www/straped/mufon/html2text/29240.html.txt","/var/www/straped/mufon/org/29240.html"],"City":"Jasper","Object Shape":"Triangle, Other","Disposition":"IFO","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"00:02:00","Date of the Event":"05/16/2011 09:30 UTC","Longitude":"-84.419502","divs":["Sighting Detailswhile potting flowers monday morning on the 16th of may i heard what sounded like a small ultra light aircraft somewhere overhead. we have one with a sail that flies around here a lot especially on week-ends so i am familiar with the sound. when i started looking up to try and spot him i saw another kind of craft coming from the south moving very slow and lower than most crafts would fly, barely topping the tree line. it was moving very slow and the sound seemed to be too loud. it was smaller than a small plane with swept back wings making it look more like a triangle but with prominent tail and nose. it looked metallic silver with patterns like joined plates together, it was that low. the nose is what was so different, it had a projection with a fairly wide cross piece making it look similar to a cross.the way it was moving i figured it was some sort of new plane that was using the nose to make pictures or record some type of information. my husband says maybe it was some sort of drone or some sort of new info gathering device.i watched it for about 3 minutes till it was out of sight. it just seem that the sound and the slowness was not normal for any plane or ultralight. i don't know what i saw but it was unusual for anything around here especially in the daytime."],"Latitude":"34.477639","Log Number":"US-05252011-0006","Object Features":"Patterned Surface, Appendage(s), Wings","map":"<A HREF = \"http://maps.google.com/maps?q=34.477639,+-84.419502(29240)&iwloc=A&hl=en\"> mufon case (29240) map </A>","Date Submitted":"05/25/2011 10:08 UTC","Source":"MUFON","Country":"United States","trends":["There have been 6 other sightings in Jasper","There were no other sightings in Jasper on or around May 16th 2011"],"Summary":"bright patterned silver, swept back wings. nose had aprojection with cross bars"}