{"Object Shape":"Chevron","Weather Factors":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.338611,+-74.268611(29246)&iwloc=A&hl=en\"> mufon case (29246) map </A>","Log Number":"US-05252011-0012","files":["/var/www/straped/mufon/html2text/29246.html.txt","/var/www/straped/mufon/org/29246.html"],"divs":["Sighting DetailsSo I was with my friends last night, and we were playing board games in my friend James' house. We go to James' house all the time, it's like our clubhouse. Can adults have a clubhouse? Nobody actually ever calls James' house a clubhouse though. Kids have clubhouses, so this would be like an adult clubhouse. There aren't any membership dues or anything like that, it isn't a real club, but it is a real house. I know, I've been in it and touched it and stuff. So we're in James' house, and I heard this weird whirring noise, but I ignored it because we were in a really heated discussion about what board game to play. I like Clue, but nobody else really likes it. I like to think that if they would just take the game seriously, it would be fun and full of mystery and intrigue, but we usually just end up wanting to watch the movie Clue. It's alright, not great. It has that guy from Home Alone, I think he worked in the hotel? I guess he was the villain, it's been awhile since I've seen Home Alone though, I don't remember. So while we're arguing, I heard the whirring noise, but it was even louder, but my ears had been acting up ever since I went to that party where loud bands play in the basement. My friend Devan was playing, so I got up real close to hear, but I ended up standing next to an amp, and my ears have been ringing ever since. So we decide to play the game Tribond, which was a lot of fun. They read off three clues, and you have to figure out what connects them. So if your three clues were like, \"Baseball, The Stock Market, and former Boston Celtics superstar Larry Bird,\" then you would obviously answer, \"Things white people like\". So you know, we're playing, having a good time and telling jokes, when this bright light shines down into the backyard of the house. But then we noticed that it was just the house's floodlights, and they were just triggered by an animal, probably a squirrel or something. Maybe a deer. I don't know, it was dark. But I was really into the game, and I was close to winning. Oh man, we had this joke that was so funny about Governor Chris Christie, but I don't want to write it on the internet, or our friend Muhammad might see it and ruin the joke. Muhammad's a nice guy, but he repeats jokes until they aren't funny anymore. He's a joke killer. Like if there was a prison for metaphors, Muhammad would be serving 35 consecutive life sentences for his serial joke killing. So after a while, James wins the game, which was a bummer because I had just gotten a question right where the answer was, \"Soundtracks that feature songs by Kenny Loggins,\" so naturally I was pumped. But James came ahead to win it in the end, and it was tense. Then we all had some snacks. I think I had chips and root beer, but it might have been Teddy Grahams and water. Teddy Grahams are good, but some flavors are just bland, you know? It's weird how so many people like crappy food. My grandpa likes anchovies on his pizza, how crazy is that? But all joking aside, it was a good time. As we all thanked James and got in our cars to leave, we all saw a Chevron shaped object in the sky. On the ride home I listened to \"Subterranean Homesick Blues\" by Bob Dylan. That's a good song."],"trends":["There have been no other sightings in Marlboro","This sighting has never been favorited."],"Disposition":"Hoax","Region":"New Jersey","Viewing Distance":"Unknown","Summary":"Chevon Shaped Object in Sky","Source":"MUFON","Date of the Event":"05/23/2011 12:00 UTC","Country":"United States","Case Number":"29246","Date Submitted":"05/25/2011 04:00 UTC","City":"Marlboro","Longitude":"-74.268611","Object Flight Path":"Undisclosed","Latitude":"40.338611","Tags":"City","Sighting Duration":"00:10:00"}