{"files":["/var/www/straped/mufon/html2text/29245.html.txt","/var/www/straped/mufon/org/29245.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"36.117456","Object Features":"Unknown","Region":"Nevada","Object Shape":"Star-like","Case Number":"29245","Country":"United States","Date Submitted":"05/25/2011 02:42 UTC","City":"Las Vegas","Log Number":"US-05252011-0011","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"5 star-like objects appearing & disappearing high in the sky some with white flashing lights moving rapidly, changing direction suddenly & disappearing into thin air","Longitude":"-115.170836","Disposition":"Unresolved","Source":"MUFON","divs":["Sighting DetailsI live in the northwest part of Las Vegas, Nevada. I walked out into my backyard to smoke a cigarette, looked up at the stars & admire how beautiful the sky looked as I do every night. The sky was clear with no sign of clouds. I was outside for about 3 or 4 minutes & I started to notice something moving at a slow pace past the stars. As I continued to look at this object I saw that it was speeding up & then it slowed down & stopped completely. After that it made a complete circle then saw a bright white flash come from the object then it started to head south & vanished. I went running into my house to alert my husband as to what I saw. After yelling his name through the house he finally came downstairs & I proceeded to tell him what happened. We both went outside to look in the sky to see if it was still there. After about 1 minute my husband saw an object & pointed it out to me. We both saw it moving at a very fast pace then it stopped. It started to move back & forth & then another one appeared. Both of them were circling around then the one on the left disappeared & the one on the right flashed a bright white light and was gone. We looked at each other in complete shock. We knew this could not be an airplane, helicopter, flare or weather balloon. These objects moved in ways that I have never seen before. I said to my husband, oh my God, those are ufos. We both became so excited & I started jumping up & down like a child. We kept looking in the sky for about 2-4 minutes & saw 2 more objects that were either the same objects from before or different ones. They were both just gliding slowly in the same direction. The one on the left stopped, made a quick left & was gone. The one to the right stayed in the sky for about 30 -45 seconds & was traveling east. The object stopped, flashed 2 times with a bright white light & disappeared. My husband & I are both believers & know what we saw last night. To us it doesn't matter what other people think. If people choose not to believe thats their problem not ours. I will remember that moment for the rest of my life. I believe this is just the beginning of what we will be seeing in the future. Peace & love to all."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.117456,+-115.170836(29245)&iwloc=A&hl=en\"> mufon case (29245) map </A>","Viewing Distance":"Over One Mile","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 24th 2011"],"Date of the Event":"05/24/2011 10:15 UTC"}