{"City":"Fayetteville","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=36.06458,+-94.148896(29249)&iwloc=A&hl=en\"> mufon case (29249) map </A>","Date Submitted":"05/25/2011 09:43 UTC","Summary":"Bright, Flashy Object visible for a short time. Traveled Horizontally at a fast pace.","files":["/var/www/straped/mufon/html2text/29249.html.txt","/var/www/straped/mufon/org/29249.html"],"Latitude":"36.06458","Viewing Distance":"101-500 Feet","Log Number":"US-05252011-0015","trends":["There have been 21 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around May 23rd 2011"],"Source":"MUFON","Date of the Event":"05/23/2011 11:00 UTC","Sighting Duration":"00:00:05","Object Shape":"Flash, Unknown","Region":"Arkansas","Tags":"City","divs":["Sighting DetailsI was standing at the edge of our property by the barb wire fence looking westward out into a field. I was watching the clouds of an approaching storm. There was no thunder or lighting at this time. It was around 11:00 a.m. on May 22 or 23 2011. I can't recall which day it was exactly. I'm writing this just a few days after I saw it. I was not expecting to see anything. Something in the sky caught my eye. I saw it against some dark clouds in the western sky. The object was flashy and seemed to shake or hop up and down in a rapid motion throughout it's flight. I was unable to make out a shape as it was visible for such a short time. It could have been any shape, but if I was to pick one, I would say it was probably oval in shape. It traveled horizontally across the sky in a north to south direction. It seemed to pulse slightly with a bright light. It appeared to be higher in the sky some distance above the treeline. I would estimate it to be 200 feet or more above the ground. It was quite small looking from where I was on the ground. It could have been a few meters across or several meters across. There were no colored lights on it only white. The light remained on the whole time, although it seemed to dim and get bright rapidly, thus the pulsing. It didn't seem to change height but maintained a straight line direction across the sky. I saw it come from behind some trees. It's important to note that the object appeared to be a fair distance behind these trees. It then continued in it's direction, disappearing behind another tree appearing quickly on the other side. While still continuing in this direction it disappeared behind a cluster of trees and didn't reappear in the sky. It's also important to note that around the time the object was out of view behind the second tree I held up my cell phone to take a picture and that's when the object disappeared behind the last trees and didn't reappear. All of this happened within 4-5 seconds. The object went across the sky fairly fast. It did not resemble any natural or manmade known object that I can think of. I have studied videos online of satellites, meteors, comets, falling stars, flares, aircraft, balloons, ball lightning, sun dogs, and other phenomena, none of which bear enough resemblance to the object I saw, to say it was any of those things. I at first thought that it was a bird. (It's hard to believe that I saw a UFO as I've heard of few UFO sightings in Arkansas.) However, I can think of no bird that lives in our area that looks like a light flashing in the sky. I am at a loss as to what the object could be. Other things worth mentioning are that I had a dream a couple of weeks before, that I saw several UFO's out in the same field where I saw this object. Also noteworthy, there were cows farther out in the field which looked like they could have been beneath the object. I hope whoever reads this takes this sighting seriously. When I saw the object I felt excitement and intrigue. I was in disbelief of what I was seeing. The longer the object was in the sky, the more I believed that I was witnessing something unknown. I'm not saying that this is for sure a UFO, but if no other explanations can come close I think it probably was one. I just wish I had been able to capture this experience on film. Had it stayed in the sky a few seconds longer, I may have been able to record a video of it on my cell phone. I think it's a bit ironic that it disappeared as I held up my cell phone. This is the first time I have ever seen anything in the sky that resembles a UFO. It's a bit embarrassing to admit to seeing something like this because I'm afraid people will think I'm nuts. I look forward to hearing what you think about this sighting. Please email me something back regarding this event. P.S. This sighting was outside of town. I live in a rural community called Wheeler on a dirt road. Wheeler is located just outside of Fayetteville, Arkansas."],"Longitude":"-94.148896","Country":"United States","Case Number":"29249","Weather Factors":"Windy, Light","Disposition":"Unresolved","Object Features":"Unknown"}