{"Tags":"City","City":"Brandon","Sighting Duration":"00:05:00","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/2924.html.txt","/var/www/straped/mufon/org/2924.html"],"Object Features":"Dome","Object Flight Path":"Unknown","trends":["There have been 21 other sightings in Brandon","There were no other sightings in Brandon on or around March 14th 2003"],"Viewing Distance":"101-500 Feet","Weather Factors":"Windy","Log Number":"","Disposition":"Unresolved","Date Submitted":"03/14/2003 04:48 UTC","Country":"United States","Longitude":"-82.283485","divs":["Sighting Details448 Travelling south on I-75 from Tampa FL to Brandon FL at 70mph. Object wasin the air 1002B feet off the ground. It appeared as a round object. At first I first Ithought it was a larger colored balloon. As I neared the objects path I couldsee it was not a balloon but a disc object tumbling through the sky. Its speedwas very slow as if it was being carried along by the wind. Its altitude wasslowly rising. As the object tumbled through the sky I could see that it wasdisc shaped and could see the leading edge and slight convex shape as it turned. I thought perhaps it was a piece of flying debris. I decided to pull over onthe side of the road to continue to look at it stopped 12 mile north of Brandonexit of I 75 The object had continued to tumble away at slow speed I wouldestimate 10 mph tumbling the entire way. I continued to feel that it was debrisbeing carried along by the wind. I watched the object for several minutes as ittravelled in a NW direction. The odd thing about the object was that despiteits tumbling it did not loose altitude or speed from my point of view. Theobject made noise as it travelled no did I see any emissions smoke, exhaust etc. I stood and watched the object for several minutes as it continued to tumbleaway. I eventually got in my car and continued. The object was still tumblingaway and the same speed and apparantly the same altitude"],"Latitude":"27.946421","Case Number":"2924","map":"<A HREF = \"http://maps.google.com/maps?q=27.946421,+-82.283485(2924)&iwloc=A&hl=en\"> mufon case (2924) map </A>","Source":"MUFON","Date of the Event":"03/14/2003 04:48 UTC","Summary":"Tumbling Disk","Region":"Florida"}