{"Object Flight Path":"Straight-line path,Path then hovering","Date Submitted":"05/25/2011 10:42 UTC","files":["/var/www/straped/mufon/html2text/29242.html.txt","/var/www/straped/mufon/org/29242.html"],"Date of the Event":"08/17/1973 09:30 UTC","Log Number":"US-05252011-0008","Object Features":"None","Longitude":"-90.038041","Sighting Duration":"00:05:00","divs":["Sighting DetailsWas looking out our picture window leaning on the back of the couch with my face up against the glass just star gazing and I just happen to notice some movement in the sky so I focused on the movement and it was three lights in a triangle formation moving slowly across the sky didnt really know what to think at first so I just kept watching for about a minute then decided I wanted someone else to see this so my mother was in the kitchen in the next room ,I didnt want to lose it so I got a really good fix on where it was and the direction and speed it was moving and quickly jumped off the couch ran to the corner and yelled at my mom to come quickly and look at something and returned to the couch in just a couple seconds put my face back at the window and found the object almost imediately as soon as I focused back on it the formation stopped and as soon as it stopped it took off up and at a slight angle out of sight in the blink of an eye, it left so fast that it left a light trace for an instant it was quite amazing and my mother never made it in time to see it, I was 12 or 13 at the time and now I am 50 and I can still remember it like it was yesterday I knew even at that age that it was something not from this world so it profoudly changed the way I think about things, I think thats why I'm so inteterested in the sciences it made me think outside the box and have wondered about it ever since. I also had a day time sighting last summer."],"Summary":"Saw formation moving across the night sky then saw it depart.","Disposition":"Unresolved","Object Shape":"Triangle","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","trends":["There have been 3 other sightings in Bethalto","There were no other sightings in Bethalto on or around August 17th 1973"],"Latitude":"38.914194","Country":"United States","Case Number":"29242","map":"<A HREF = \"http://maps.google.com/maps?q=38.914194,+-90.038041(29242)&iwloc=A&hl=en\"> mufon case (29242) map </A>","Region":"Illinois","City":"Bethalto"}