{"files":["/var/www/straped/mufon/html2text/29254.html.txt","/var/www/straped/mufon/org/29254.html"],"trends":["There have been 8 other sightings in Winchester","There were no other sightings in Winchester on or around April 30th 1996"],"Summary":"Light moved slowly overhead, And suddenlty shot straight up in less than a second it was out of sight","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsFriends have told me that I should contact mufon with my stories. I have had several events in my life. The one above is just one of the most recent. The most dramatic was in about 1974 spring or early summer. I came home from a date and arrived home at about eleven o'clock. I got out of my car and walked to the front of the car and all of a sudden the area around me for about twenty feet or so lit up like daylight. I looked up and I saw a light coming down at me. I ducked and the next thing I knew it was gone. Now when I got home my mother was still up. I could see the light on in the living room when I pulled into the driveway and she said she thought she heard me pull in. But when I got into the house I found it was about an hour and fifteen minutes later. And my Mother was not up and the house was dark. I never told anyone about this event for many years. Except for my mother and she told me she heard me pull in that night but wondered why I didn't come in right away. The next event took place in broad daylight on rout 81 south outside of Chambersburg PA. The traffic on the highway came to almost a stop and many people pulled over. I and my wife at the time also pulled over. What we saw was an orange disc shaped light passing up and down through the clouds. We watched this for about ten minutes and then moved on. We where heading into Maryland to the Cumberland area. When we topped Sideling mountain, the sky was full of military Jets criss crossing the sky, I have never seen so many jets in such a small space of sky in my entire life. Then comes the story above. I used to have to go outside to smoke. I went out about three in the morning. This took place the same year that we could see the space shuttle pass through Orion. So im guessing at all these dates. But this took place after the shuttle event. Where the place i worked at was on the approach to two airports. One was a local public airport in Winchester Va. And the Other was a miitary airport in Martinsburg WVs. Planes would pass over the place where I worked and then tern right or left to the airport they where going too. This particular time this light come over and it seemed to move slower than usual and the light didnt radiat as I thought It should at first I assumed it was a landing light but it was round and landing lights at that angle would not be exactly round and it was a bit larger. It moved out about forty five degrees from me and I realized I heard no engine noise. At that moment it shot straight up and out of site in less than a second. Now it was a clear night and I could see clearly the stars. And this thing went from a large light to nothing in a flash. I have also seen a cigar shaped object south of Winchester in the Strasburg Virginia area at about 5 in the evening. As I said I dont have exact dates or times or witnesses except for my ex wife for the event in PA. And I cant see how this information would be of any benefit. But because my friends said I should still report the events I now have. Also for many years i would have experiences where i know i was awake but could not move. I had what i thought where dreams of flying around the house and through the walls and ceiling etc. And i have had experiences where i dreamed i was in the wall and could hear my mother and father talking and the next day found out that what i though i heard was what they where talking about. I have not had those experiences for many years however. Sorry to waste your time with all of this. But now i can tell my friends i contacted you all. \"D\"."],"Longitude":"-78.156364","City":"Winchester","Region":"Virginia","Tags":"City","Object Flight Path":"Path with directional change,Other","Date of the Event":"04/30/1996 12:00 UTC","Latitude":"39.19242","Date Submitted":"05/26/2011 12:48 UTC","Object Shape":"Cigar, Disc, Other","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.19242,+-78.156364(29254)&iwloc=A&hl=en\"> mufon case (29254) map </A>","Log Number":"US-05262011-0002","Disposition":"Insufficient Data","Viewing Distance":"20 Feet or Less","Country":"United States","Case Number":"29254","Sighting Duration":"Undisclosed"}