{"Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was on vacation in Cabo San Lucus sitting and relaxing in a hot tub with my wife. I happened to look up into the sky and saw a bright object moving slowly from the west. I am an amateur meteorologist at home so I am used to viewing objects in the sky. It was daylight and I used some cirrus clouds that it crossed and so I realized that the object had to be more then 30,000 feet high as it was in back of the clouds. The light was bright and strobe like pulsating very fast. Both my wife and I watched the object for quite a while. I also used part of the building as reference as it approached from the west then drifted off to the west-southwest. The object never rose any higher then say 60 degrees above the horizon. I wish I had my camera! This is not the first time I have seen a UFO in Cabo San Lucus. A time before some 5 years ago in October both my wife and I saw an object when we were having dinner one evening on the beach at a popular Taverna called the Office. There I saw a soft orange object moving very slowly from the East to a point at about 75 degrees above the horizon then turned north. Again we both watched the object for probably 30 minutes. I called on the waiter and jokingly asked him what he thought about the object. He told both my wife and I that it was the gold returning to La Paz. My wife and I have been to Cabo some 7 or 8 times. I can tell you that I will not be without a camera again there! Have you had many reports of UFOs there?"],"Viewing Distance":"Unknown","Longitude":"-109.911527","Date Submitted":"05/26/2011 01:49 UTC","Summary":"Bright object in the western sky moving from the west then heading SW","Country":"Mexico","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29255.html.txt","/var/www/straped/mufon/org/29255.html"],"trends":["There have been 10 other sightings in Cabo San Lucas","There were no other sightings in Cabo San Lucas on or around April 30th 2011"],"Case Number":"29255","Object Features":"Undisclosed","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Latitude":"22.895493","Date of the Event":"04/30/2011 12:00 UTC","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=22.895493,+-109.911527(29255)&iwloc=A&hl=en\"> mufon case (29255) map </A>","Log Number":"MX-05262011-0003","City":"Cabo San Lucas","Region":"Baja California Sur"}