{"Object Shape":"Triangle","Sighting Duration":"00:00:10","files":["/var/www/straped/mufon/html2text/29256.html.txt","/var/www/straped/mufon/org/29256.html"],"Summary":"Triangular with light in each corner ufo traveled west to east over salt lake","Disposition":"Insufficient Data","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsi was outside behind my aprtment having a cigarette at exactly 12:13 am, sitting in a foldable camping chair looking at stars in the east\\northeast area over slc ut. as i was watching a few satellites traveling in their normal pathways, a triangular object with a light in each corner caught my eye traveling at high speed (no sound) from west to east. its line of travel was in a straight line for about 4 seconds and it suddenly shifted to the south on a 20 degree angle very quickly, as though it was making a course adjustment or such. it made another shift to the south a moment later and continued very quickly to disappear from sight to the east over the wasatch mountains. i have seen a video of a triangle object with a light in each corner on youtube... though wasnt convinced it was legit... i now know it is. at least the object i saw tonight was real... it made no noise i could hear, traveled at an extreme speed, and made course corrections which no known in-flight vehicle can perform to my knowledge. it was by far the most amazingly tantalizing visage of my 38 years. i was astounded, and thrilled by my experience. unfortunately i was unable to photo the object... though i can say with certainty, i did not have enough time to even unlock the screen on my phone nor would it have done justice to the object because of the speed at which it traveled through the air space over salt lake. if you dont look... you'll never see."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.763879,+-111.887557(29256)&iwloc=A&hl=en\"> mufon case (29256) map </A>","Longitude":"-111.887557","Date of the Event":"05/26/2011 12:00 UTC","Latitude":"40.763879","City":"Salt Lake City","Date Submitted":"08/02/2011 09:12 UTC","Object Flight Path":"Path with directional change","Region":"Utah","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around May 26th 2011"],"Tags":"City","Log Number":"US-08022011-0045","Country":"United States","Weather Factors":"None","Case Number":"29256","Source":"MUFON"}