{"trends":["There have been 13 other sightings in Hayward","There were no other sightings in Hayward on or around May 26th 2011"],"Case Number":"29260","Summary":"Red Star like object breaks off into smaller pieces and disapears with another object circling.","Date Submitted":"05/26/2011 12:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.67449,+-122.079406(29260)&iwloc=A&hl=en\"> mufon case (29260) map </A>","Country":"United States","Disposition":"Unknown","Tags":"City","Object Flight Path":"Stationary,Path with directional change","Longitude":"-122.079406","Latitude":"37.67449","City":"Hayward","Region":"California","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/29260.html.txt","/var/www/straped/mufon/org/29260.html"],"Object Shape":"Star-like","Source":"MUFON","Viewing Distance":"Unknown","Date of the Event":"05/26/2011 03:10 UTC","Sighting Duration":"Undisclosed","Log Number":"US-05262011-0008","divs":["Sighting DetailsWe returned to station after a call on our 24 hour shift. As I exited the ambulance to back my partner into the building I noticed a bright red star in the eastern sky. I noted to my partner to take a look, he exited the vehicle and noticed the same star. We talked about it for a second and thought it to be Mars, but neither of us are very adept in astronomy and were unsure. As we looked at the star, we noticed that a second star. This star was fairly dim compared to the red star and we noticed that it was moving towards the red star. As we watched the smaller object moved north towards the red star, then descended underneath. It passed the red star completely traveling northward, then ascended upwards as if it was circling the red star. At this point the smaller star just faded from view. As we watched the red star had 3 pieces break off and drop towards the ground in three different directions and the main body of the red star faded from view. This event lasted approximately 3-5 minutes."],"Object Features":"Unknown"}