{"Sighting Duration":"03:25:00","Weather Factors":"Unknown","Latitude":"38.841731","Object Features":"Undisclosed","Tags":"City","Region":"Virginia","Longitude":"-77.423627","Log Number":"US-05282011-0010","Date Submitted":"05/28/2011 04:16 UTC","Summary":"Black Sphere Hovered in Sky Until Obscured By Clouds","Date of the Event":"05/28/2011 12:00 UTC","Case Number":"29288","Disposition":"Insufficient Data","City":"Centreville","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Country":"United States","Object Shape":"Circle, Sphere","divs":["Sighting DetailsI went out for a smoke at approximately 3:25 p.m. I was sky-gazing; merely looking at clouds. When I was done with the cigarette, I looked up at a 45 degree angle toward the North West sky, I noticed an object hovering. It was completely still, despite it being very windy at that moment. I observed it hovering in the blue sky for approximately a minute and half until a dark cloud passed under it, and it was gone. I waited for the cloud to move, and it was no longer there. After that I stayed out for another 10 minutes to see if it had perhaps moved to a different location, which it had not. Once I noticed the object, I pulled out my phone to record it. When I finally went inside, I uploaded it to my computer to review the video, but the phones camera didn't seem to have picked it up. If it makes a difference, I had been outside all day until then, and the air traffic was very light, despite it being memorial day weekend. The weather was partly cloudy and windy, with maybe 50% of the sky having scattered clouds. I have extensive knowledge of aircraft, military and commercial, as well knowledge of air traffic patterns in the area."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/29288.html.txt","/var/www/straped/mufon/org/29288.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.841731,+-77.423627(29288)&iwloc=A&hl=en\"> mufon case (29288) map </A>","trends":["There have been 5 other sightings in Centreville","There were no other sightings in Centreville on or around May 28th 2011"]}