{"divs":["Sighting DetailsIt was a few days before christmas.It was a chilly night, clear and no moon visable @ the time. I lived in an basement apartment that had a seperate entrance that opened to the backyard with stairs leading up out of the basement.I smoke and go outside to do so. On this particular night I was standing towards the top step smoking. It was a clear night and on clear nights I often try to find the constelations orion and the big dipper .I was facing north and to my right I thought I saw orion (east), but somthing seemed off about it.I hadnt had the chance to look at the night sky for a while (due to overcast skys or not being out after dark) usually it seems like orion is usually upright or close to it but it was on it's side this night.I thought this is maybe just how it appears in the sky at this time of year so I looked around at the other stars to see if orion was somwhere else in the sky and I was mistaken at what I first thought was orion.as I looked back and forth something about the \"sideways orion\" in the east caugth my eye I percieved movment but could not locate it at first. Then I began to focuse and was looking at what would be the 3 stars that make up the belt of orion. Remember it was on it's side from my point of view. like if you saw it perfectly upright and someone turned it 90 degrees to the left.So the bottom star of the belt is farthest to the left from my viewpoint.The movement was slow and incredibly fluid all three stars of the belt where moving at the exact same speed but with slightly different trajectory's. The lowest star was moving almost in a perfcet horizontal way from right to left.The other two stars where moving both down and right to left on a course that would intercept the position that the first star(lowest)was moving. Then the first(lowest) star just vanished as if it was just turned off .Then the next highest star reached the position where the first star dissappered and it also \"just turned off\" .Then the third star did the exact same. I was stunned and scared I could not understand what I had just seen and I wished so bad that someone had witnessed it.I felt immediatly the need to tell someone.But knew how crazy it would sound. it was as if everything I knew was turned on it's head. I have always thougt it would be great to see something like that so you would have an answer to whether or not ufo stories where real.Despite all the stories and videos I thought that seeing would be believing, but it did not feel great it was terrifying.Also it didnt answer any questions for me but raised more. This part may sound strange but about 20 minutes after. the whole time I was freaked out and kept asking myself what the hell did i just see? Then an incredibly euphoric feeling came over me, a palpible energy and excitment that I still can not explain it was the exact opposite of what I was feeling minutes earlier. A few days later as I was thinking about it I knew what I saw,but thought well that wasnt orion ,but was it somthing mimicking orion? On christmas eve I told my duaghter and future son in law. At a family get toghether on new years eve I took my daughter and her fiance outside to show them where in the sky I saw it.As I was showing them I was startled to realize that it actaully was orion.I am not an astronomer but I 99.9 percent positve It was the orion constellation I was watching that night of the incident. I was not drinking nor do I use drugs, and as far as I Know I am not crazy.This was not a comet or meteor the speed was way to slow , also I live underneath the flightpath of an international airpot and just 5 miles from an appache reserve airbase, and next to that is a small craft airport.I know what these aircraft look like in the night sky, and they do not explain what I saw. P.S. since then I have had one other experience earily similar, yet different this time with a witness for half the event. I will make a reoprt when I have time as it may be connected to what I saw."],"trends":["There has been one other sighting in Bluffdale","There were no other sightings in Bluffdale on or around December 20th 2010"],"Longitude":"-111.936794","Region":"Utah","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Latitude":"40.495201","Log Number":"US-08072011-0109","Date of the Event":"12/20/2010 06:23 UTC","Date Submitted":"08/07/2011 09:36 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.495201,+-111.936794(29287)&iwloc=A&hl=en\"> mufon case (29287) map </A>","Object Shape":"Star-like","Summary":"stars slowly moving to a single point then dissapearing","Object Flight Path":"Hovering then path","Case Number":"29287","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","Source":"MUFON","City":"Bluffdale","files":["/var/www/straped/mufon/html2text/29287.html.txt","/var/www/straped/mufon/org/29287.html"],"Object Features":"None"}