{"Region":"New Jersey","Tags":"City","Country":"United States","trends":["There have been 5 other sightings in Clinton Township","There were no other sightings in Clinton Township on or around May 28th 2011"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.63462,+-74.864306(29298)&iwloc=A&hl=en\"> mufon case (29298) map </A>","Sighting Duration":"00:15:00","Date of the Event":"05/28/2011 11:00 UTC","Object Features":"Unknown","Object Shape":"Fireball, Sphere","Latitude":"40.63462","City":"Clinton Township","Disposition":"Unknown","Object Flight Path":"Undisclosed","divs":["sighting detailsa friend and i were at another friends house, relaxing on the front porch. we were talking when i looked out over the treeline and saw two red\\red-orange lights relatively close to us. my first thought was that they were the lights on the wingtips of a plane and that a plane was coming in for a crash landing. however there was no sound of an engine, in fact there was no sound coming from the objects at all. then the two lights started weaving towards and away from each other. they changed directions rapidly and appeared to bob around in the sky. they were like orbs and appeared to be lit from the inside at the bottom. the bottom was like a bright red-orange and lit the entire object to a red color. perplexed, we moved to the porch rail to get a better look; they started moving to our left. my friend called out to our other friends father who was right inside in the living room. he came out to view it with us. shortly after he came out a third object of the same type came out over the treeline. it followed the same path as the previous two; first moving towards us and then to the left before it changed directions again to fly off. as they began to fly off we found a pair of binoculars to try and get a better look, however by then they were too far away. they flew off and then flickered out of sight."],"Case Number":"29298","Date Submitted":"05/29/2011 01:16 UTC","files":["/var/www/straped/mufon/html2text/29298.html.txt","/var/www/straped/mufon/org/29298.html"],"Longitude":"-74.864306","Source":"MUFON","Viewing Distance":"101-500 Feet","Log Number":"US-05292011-0007","Weather Factors":"None","Summary":"Three red objects appear over the treeline then change direction and fly away. Made NO sound"}