{"map":"<A HREF = \"http://maps.google.com/maps?q=46.598846,+-112.022831(29296)&iwloc=A&hl=en\"> mufon case (29296) map </A>","Object Features":"Dome, Patterned Surface","Date of the Event":"11/20/1968 09:15 UTC","Summary":"Taken out of body","divs":["Sighting DetailsI had an experience that took me out of body, not a sighting. Just before I went inside to go to bed I was looking at the stars, it was a clear night and the sky was full of stars. I started to concentrate on a small star overhead then I went to bed. Lying there I still was thinking obout this star. Somthing began to happen, I started to loose feeling in my entire body and it felt relaxing. After about a half an hour I found myself awake and inside somthing that had a checked floor that was glowing and there was a semi sphirical with rabbit ear antenna. I thought I was dreaming so I moved forward toward it and it came at me I then became startaled and tried to wake up but I could not. I started to fight to wake up and it was though I was paralized and the my bed felt as though it was spinning. I finnaly was back in my body. I have neve told anyone about this until now nor have I ever had such an expierince since. I don't mess with things I don't understand any more. This was not a dream I had no body but I could move at will. Thank you and you can take this story for what it is worth and you can belive it or not but I know what happened."],"Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Flight Path":"Other","Latitude":"46.598846","City":"Helena","Date Submitted":"05/29/2011 12:40 UTC","Source":"MUFON","Country":"United States","Region":"Montana","Object Shape":"Unknown","Longitude":"-112.022831","Weather Factors":"Unknown","Log Number":"US-05292011-0005","Viewing Distance":"Unknown","Case Number":"29296","trends":["There have been 9 other sightings in Helena","There were no other sightings in Helena on or around November 20th 1968"],"files":["/var/www/straped/mufon/html2text/29296.html.txt","/var/www/straped/mufon/org/29296.html"],"Tags":"City"}