{"files":["/var/www/straped/mufon/html2text/29291.html.txt","/var/www/straped/mufon/org/29291.html"],"Case Number":"29291","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.584953,+-73.402346(29291)&iwloc=A&hl=en\"> mufon case (29291) map </A>","Date Submitted":"05/28/2011 11:40 UTC","Object Shape":"Other","Longitude":"-73.402346","divs":["Sighting DetailsI was driving home from work, and was stopped at a stop sign. The area is very rural on top of a mountain. I noticed out of the left field of my vision a set of 3-4 lavender colored lights set in a horizontal row move towards the middle of my field of vision. These lights were moving slowly and caught my attention because of their strange color. As i drove forward, coming upon the crest of the hill, wherein there is a large field on both sides of the road, i noticed a similiar configuration of lights enter the right side of my field of vision. They were orange-red in color. I looked for indications the lights could be shining up in the sky from the ground, but the area is so rural it seemed unlikely. The lights were also very high up in the sky indication an aircraft of some sort. There were also no trails of light from the ground up that you would usually see from a spot light or laser. I was convinced at that point these lights belonged to an aircraft. As the lights on the right proceeded to fly towards the lights on the left side of the sky, they changed from the orange redish color to the lavender observed on the left side of the sky lights. I slowed and watched the lights begin to circle one another. The right hand side lights moving from being in a horizontal line with the left side lights to swiftly hovering above them in a vertical manner. The lights then began to circle around each other. At this point i was baffled as to what type of aircraft these can be since i have never witnessed these manuvers nor the colors. At that moment i was convinced they were a UFO of some sort and began to feel a bit frightened. I started to drive faster down the road keeping an eye on the lights in my perpihel vision. After watching them circle around each other at a faster rate they disappeared. This occured at 10:18 pm EST on second hill rd in new milford ct."],"trends":["There have been 4 other sightings in New Milford","There were no other sightings in New Milford on or around May 28th 2011"],"Summary":"Lavender horizontal line of lights in sky/ New Milford CT 5/28/11 10:18PM EST","Object Features":"Undisclosed","Weather Factors":"Does Not Apply","Tags":"City","Region":"Connecticut","Log Number":"US-05282011-0013","Latitude":"41.584953","Object Flight Path":"Path with directional change","Date of the Event":"05/28/2011 10:18 UTC","Disposition":"Hoax","Source":"MUFON","Country":"United States","City":"New Milford"}