{"Case Number":"29294","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Sphere","Longitude":"-87.839542","divs":["sighting detailsi was driving to a food center on waukegan and deerfield rd, and i noticed these two strange red lights in the sky. they did not exhibit strobe patterns like your typical airplane at night. when i finally arrived at the food center and walked outside the lot, i noticed more of the same objects coming from one particular area, and that was in the direction of lake michigan. some of them were bright solid red or yellow and they were consistently lit. i began filming since there were so many of them coming in fairly quick succession. all of them appeared to be heading the same way and then they would eventually vanish quickly at a particular point. they were very silent, and i could not hear the sound of jet engines. they were at an appropriate distance to hear engine noise if they were indeed airplanes. eventually no more objects came to follow. in the film i took, the objects appear to be blinking, but that's not how it was when i was there. 38 seconds in to the video you'll notice glare, which is not to be mistaken for something else. the video can be seen at: *(link moved to additional evidence section -- cms\\sg)."],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.180376,+-87.839542(29294)&iwloc=A&hl=en\"> mufon case (29294) map </A>","City":"Deerfield","Date Submitted":"05/29/2011 03:37 UTC","Latitude":"42.180376","trends":["There have been 2 other sightings in Deerfield","There were no other sightings in Deerfield on or around May 28th 2011","This sighting has never been favorited.",""],"Disposition":"IFO","Object Features":"Undisclosed","Date of the Event":"05/28/2011 09:00 UTC","Region":"Illinois","Log Number":"US-05292011-0003","files":["/var/www/straped/mufon/html2text/29294.html.txt","/var/www/straped/mufon/more/29294_submitter_file2__SightandFlightVectors.png","/var/www/straped/mufon/more/29294_submitter_file3__PlaceEvent.jpg","/var/www/straped/mufon/org/29294.html"],"Country":"United States","Summary":"Circular non-blinking objects glowing orange and yellow.","Source":"MUFON"}