{"Log Number":"US-05302011-0003","Object Flight Path":"Stationary","Region":"Kansas","divs":["Sighting DetailsGood friend of mine often records w pics the building of unusual structures he is involved w. Project lasted sev months or more. On this day the camera cot object in air and also other unidentified thing in lft side of frame while they were wrking. No one heard or saw anything. My friend has degree n geology. I wz teacher 4 17yrs. I now do contract labor for museums writing curriculums or surveying exhibit design. We r not ufo ologists or fanatics. He is scared. I m trying to find someone to come look @ photo. Will not send over internet. There is nothing else it could be. The under carriage also has door open that apparently dropped off probe or whatever. This is not a bird or insect. No lens glare. We r perplexed and need assistance. We feel it is an obligation.Less than 20 people have been shown the pic. If I do not hear frm u soon via cell phone...I am going to KUs astronomy department. My friend did not notice object until he was looking at all photos (hundreds) and then called me. Interestingly I had been calling him 2 find out if planets or anything else could be attributing to the energy I wz feeling over the last couple days. I have an education degree (17 yrs of teaching) then went to get a masters @ KU in museum studies n historical administration w minor n anthropollogy. He called me over to look @ photo. This thing looks exactly like u would think a alien spacecraft would look. It is unnerving. THE PROBE wz let out @ the highest pt near lawrence. I will not send a pic this way. U must contact me thru cell phone n make a connection first."],"Date Submitted":"05/30/2011 03:02 UTC","Weather Factors":"None","Latitude":"38.784627","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/29307.html.txt","/var/www/straped/mufon/org/29307.html"],"Country":"United States","trends":["There have been 2 other sightings in Baldwin City","There were no other sightings in Baldwin City on or around August 26th 2010"],"Summary":"Friend set tripod 2 take shots every 30 secs 2 record buildin of barn. during shots on ths day, it wz captured.","City":"Baldwin City","map":"<A HREF = \"http://maps.google.com/maps?q=38.784627,+-95.18006(29307)&iwloc=A&hl=en\"> mufon case (29307) map </A>","Object Features":"Dome, Window(s), Louvres","Longitude":"-95.18006","Sighting Duration":"00:00:30","Source":"MUFON","Case Number":"29307","Object Shape":"Disc, Oval","Date of the Event":"08/26/2010 05:00 UTC","Viewing Distance":"Over One Mile"}