{"divs":["sighting detailsi went out back of my house to smoke a cigarette, and lit 2 tiki torches. after a minute or so i got to looking up and thinking about how me and my ex used to compete at who could see more satellites or shooting stars the torches were making it hard to see so i put the one closest to me out. i kept watching the sky and finally thought i saw a shooting star, then i realized it was three lights. they were evenly spaces solid white in a triangular pattern. they were moving north to south, it's hard to guess how big it was but if i were to hold my fingers gapped 1\\4 inch at an arms length that would be how big it appeared. it flew in pretty much a perfectly straight line but seemed like it swayed ever so slightly, side to side like a surfer i guess it. it was hardly noticeable. i've seen thousands of planes fly by, including military jets but this was nothing like that, there were no strobes or red\\blue markers at all and there was no noise at all absolutely silent. i suppose it could be a meteor that broke into three pieces but it seems slim for it to be perfectly spaces and keep going until the lights disappeared out of view over top of crescent city to the south across the bay."],"Country":"United States","Summary":"3 solid white lights evenly spaced fly by","Tags":"City","Viewing Distance":"Unknown","Latitude":"42.056961","Disposition":"IFO","Date Submitted":"05/30/2011 02:41 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.056961,+-124.279692(29306)&iwloc=A&hl=en\"> mufon case (29306) map </A>","trends":["There have been 5 other sightings in Brookings","There were no other sightings in Brookings on or around May 29th 2011"],"Case Number":"29306","City":"Brookings","Source":"MUFON","Sighting Duration":"00:00:09","Longitude":"-124.279692","files":["/var/www/straped/mufon/html2text/29306.html.txt","/var/www/straped/mufon/org/29306.html"],"Region":"Oregon","Weather Factors":"Unknown","Log Number":"US-05302011-0002","Object Features":"Undisclosed","Object Shape":"Triangle","Date of the Event":"05/29/2011 11:05 UTC"}