{"Object Shape":"Saturn-like","Source":"MUFON","Disposition":"Insufficient Data","trends":["There have been 12 other sightings in Lake Elsinore","There were no other sightings in Lake Elsinore on or around May 26th 2011"],"Weather Factors":"None","Region":"California","Log Number":"US-05292011-0009","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/29300.html.txt","/var/www/straped/mufon/org/29300.html"],"Tags":"City","Longitude":"-117.325962","Summary":"Orange Light Hovering and moving by Lake Elsinore","Latitude":"33.671857","Country":"United States","Viewing Distance":"Over One Mile","Case Number":"29300","Date of the Event":"05/26/2011 10:15 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.671857,+-117.325962(29300)&iwloc=A&hl=en\"> mufon case (29300) map </A>","Date Submitted":"05/29/2011 02:46 UTC","divs":["sighting detailsi was told by my source that when i went to the lake that i would have an opportunity to see a visit and to look for the triangle. the only lake that i was going to in the near future was lake elsinore for a graduation event. around 10 pm, on may 26th, i was told by my source that it was time look for it over the lake. i was a little disappointed because the stadium lights were still on from the graduation and thought it would be difficult to see anything with so much light in the area. i went out to call my husband and tell him about the day's celebration events and was looking across the lake at the mountains from the lake elsinore best western hotel, where i was staying. standing next to the pool area at the hotel and looking across the lake to my right, i was able to see 2 stationary orange lights at near the top of the mountain behind the lake. the lights were parallel to each other and about a 1\\2 mile apart. i was able to determine that these stationary lights were either house lights or lights for the airplanes, as they were identical in size, remained stationary and constant. 2 small airplanes flew by as i talked to my husband. then, between and above the 2 lights, a third orange light came on creating a triangle, with the 2 lights on the bottom. my guess is that it was about 200 feet above the 2 lights. the 3rd light stayed stationary above the other 2 lights and smack in the middle. i told my husband about the 3rd light and stayed on the phone. the 3rd light object was slightly larger than the other 2 lights and seemed to blink more than the other 2 lights. this light stayed stationary for about 2 minutes. i was about to dismiss it as a tower light or some other stationary light\\marker, but then it started moving forward and slightly upwards about as fast as the 2 small planes i saw earlier. then it hovered again for about 20 seconds, flashed brighter, then moved straight up quickly and blinked out. the sky was clear and there were no clouds. i waited a few more minutes, saw another plane and went inside. the next morning i went out and looked at the same area where the lights appeared. the 2 bottom orange lights most likely came from the higher points of near the top of the mountain. the place that the 3rd light appeared would have been above a crevice between the 2 points. i checked my phone and i called my husband that night at 10:12 pm and the call was 5 minutes and 3 seconds. i was on the phone about a minute before the 3rd light appeared and about a minute after it blinked out."],"City":"Lake Elsinore","Sighting Duration":"Undisclosed"}