{"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.750195,+-84.379332(29301)&iwloc=A&hl=en\"> mufon case (29301) map </A>","Date of the Event":"05/26/2011 10:00 UTC","Latitude":"33.750195","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around May 26th 2011"],"Source":"MUFON","Object Shape":"Oval, Square, Rectagular","Object Features":"None","divs":["sighting detailsdue to a severe storm, our power went out for approximately 10 hours starting at 530 pm. around 10 pm, i told my husband i was going to sit in the car with the a\\c on as i was getting overheated. after about 10 min, while i was listening to the radio, i saw a car drive slowly by and watched the tailights disappear from sight. i watched for a little bit to see if they were slowing down or stopping. within about a minute, i saw a row of 4 lavender lights about 10 feet above the road slowly move along the road that is in front of our house. they came from the direction the car just went. our home is about 100 yards from the road but i could see the lights very clearly moving very slowly. i was not able to comprehend what they were and my mind was racing. with what i can only describe as sheer horror, i saw one light break away and slowly move down our driveway. i got out of the car and made my way inside as quickly as possible. i was in such terror i could only blubber out to my husband what i saw. he turned off his flashlight and watched out the window. we both witnessed some fireflies and he assured me that was what i saw. it was not. the lavender lights did not blink and moved very slowly in a straight horizontal line. i tried to disregard what i saw but then saw the other report of the same lights and knew i had to report it."],"Log Number":"US-05292011-0010","Country":"United States","Longitude":"-84.379332","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/29301.html.txt","/var/www/straped/mufon/org/29301.html"],"Tags":"City","City":"Atlanta","Viewing Distance":"21-100 Feet","Date Submitted":"05/29/2011 04:30 UTC","Case Number":"29301","Summary":"Lavender lights in a row above the road","Sighting Duration":"00:00:20","Object Flight Path":"Straight-line path,Path with directional change","Region":"Georgia"}