{"map":"<A HREF = \"http://maps.google.com/maps?q=39.556601,+-105.773567(29305)&iwloc=A&hl=en\"> mufon case (29305) map </A>","Latitude":"39.556601","Date of the Event":"05/28/2011 07:45 UTC","City":"Pueblo Proper","Viewing Distance":"501 Feet - 1 Mile","Case Number":"29305","divs":["sighting detailsat my home in my back yard playing horse shoes i was walking south west ward lookin at the distant mountains-looking up approx 800 to 1000 ft flying sw to ne straight line moved w\\o noise first huvering then moving out of sight within 45 secs to a minute. a very erie sight rotated at its center while huvering when i first observed it, it shown a white beam like light 2 or 3 times. watched it pass directly over my house. i ran into the bottom back door up the stairs and yelled at my wife to follow me outside through the front door she did and by the time i pointed to where it was it was already at the horizon of a ridge approximately 1 mile away my wife saw it as it disappeared over the ridge. the object at first appeared as a cylinder shape round on top and squared at the bottom (honestly it really reminded me of r2d2 in appearence). it was able to and did rotate at its center there were what looked like 2 single extentions at its base when i first saw it i later thought they may have been landing gear? but as it passed over the extensions were no longer visible. the object was almost translucent in its appearence kind of darker at the top and clear at its bottom half. i am a registered nurse 59 years old and an air force vet. i am familure w\\ all sorts of odd looking craft being statinoed at holloman afb for the last 2 years of my enlistment. i think the oddest thing of the entire experience was that there was absolutely no noise made by this craft in fact for just a moment as it passed over head i thought it may have been some sort of weather balloon however it had structure was solid and very multi demensional in its charicter, it had left me astounded,dumbfounded and wondering if it was somthing my mind made up...but my wife saw it as well, a very out of this world experience!"],"Source":"MUFON","Disposition":"Unknown","Object Features":"Dome, Appendage(s)","trends":["There have been no other sightings in Pueblo Proper","This sighting has never been favorited."],"Log Number":"US-05302011-0001","Object Flight Path":"Hovering then path","Tags":"City","Summary":"Looking up approx 800 to 1000 ft flying SW tp NE straight line moved w/o noise first huvering then moving out of sight withing 15 to 25secs. erie sight rotated at its center shown a white beam like light 2 or 3 times. watched it pass directly over my hous","files":["/var/www/straped/mufon/html2text/29305.html.txt","/var/www/straped/mufon/org/29305.html"],"Date Submitted":"05/30/2011 02:39 UTC","Longitude":"-105.773567","Object Shape":"Cylinder","Region":"Colorado","Country":"United States","Weather Factors":"Windy, Light","Sighting Duration":"07:45:00"}