{"Date Submitted":"05/30/2011 12:52 UTC","Tags":"City","Source":"MUFON","Object Features":"Unknown","Date of the Event":"05/30/2011 12:00 UTC","Object Shape":"Other","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29316.html.txt","/var/www/straped/mufon/org/29316.html"],"Log Number":"US-05302011-0012","Region":"Oregon","Case Number":"29316","Disposition":"Unknown","Longitude":"-122.872105","Summary":"lit up night sky so much the buildings and trees had shadows on the clouds","Weather Factors":"None, Does Not Apply","City":"Medford","Object Flight Path":"Unknown","Country":"United States","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around May 30th 2011"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.331835,+-122.872105(29316)&iwloc=A&hl=en\"> mufon case (29316) map </A>","Latitude":"42.331835","divs":["Sighting DetailsFirst, I want to say that I spent my entire childhood in Alaska and know very well what fog refraction, Aurora borealis lights (which brighten the sky during the night), red moon, red tides, midnight stars and a dozen other night lights in the sky, but this was very different. It was shortly past midnight, when the living room's glass door seemed to have a spot light shining on it. The light was so bright that it was shining off my ceiling and onto the kitchen cabinets (no small feat). I noticed all three animals I own were acting very strange, our dog was hovering on the couch, growling very low like he was afraid to actually growl or bark as he would normally if anything was outside. Our cat huddled on the floor behind my husband's shoes, so just his nose and ears were above the rim of the sneakers. He flattened his ears and was staring at the door that he is normally staring out or trying to sneak out (earlier I had let the dog out for his nightly routine and there was nothing strange about the night and our cat tried as usual to sneak out on me). I called him several times before he literally jumped into the air and spun around to stare at me with huge eyes. We also have a dwarf rabbit who was frantically clawing at the bottom of her cage, as if trying to bury herself. The light seemed very steady and bright, so I walked over to look outside. The night sky was lit up like it was daytime, except the clouds (there was broken cloud cover last night, but the moon was in its' waning crescent phase) had the shadows of the building near us and the trees around us, but there was absolutely NO fog last night. It was as if there was a giant beam of light in the southern sky that was being refracted off the ground and causing everything to shadow on the atmosphear in the northern sky. I know this because I actually opened the doors and walked out onto the patio. I was standing there looking around me wondering what in the world was going on, when I noticed that the entire night was void of any sounds, no animals or insects like would be normal for this time of year, no helicopters or planes landing, not even any cars going past...nothing, but silence. Now, I'm normally not frightened by the night time. In fact, I love the nights here in Oregon, but this time I felt a choking sensation, became sick to my stomach and a little dizzy, it reminded me of being in line behind a car with very bad exhaust and being choked, sickened and dizzy, except there was absolutely no odor in the air. So I returned to my seat on the couch. After which, I noticed the television signal (we have directv) kept breaking up until I just turned it off, then I noticed that the VCR lights went brighter and dimmer. The light outside went from normal white type light to a yellow haze, then to an orange color. I watched the light for somewhere between 25 and 55 minutes (I'm not certain because although I recall looking at the VCR clock when it all began, I can't recall what time it was). Although I returned to the couch, I kept a steady eye on the light outside coming from nowhere. I felt a strange tightness rising in my chest and my heart was beating heavily. I grew up with fog, night lights that are organic and man made, but this was like nothing I've ever seen! I can't seem to recall the exact time it began, although I do recall looking at the clock on our VCR, but the next time I looked it was 12:49 a.m., by 12:58 it was gone, just like that it disappeared leaving the normal night time darkness. I am not one to loose my cool and get shook up over very much, because growing up in AK, I saw some very odd stuff, red moons, red tides, lights reflected off of heavy fog that looked doubley bright, but this was like nothing else I've ever seen and I'm no spring chicken either. I've been chased by bears, even had a shark swim between my legs after a salmon one summer and never was as scared as I was last night. And just in case there are those who may want to believe I was asleep and some how dreaming this, you can forget it because I didn't fall asleep until morning broke at 5:20 a.m. and I felt certain the thing was gone. I'm wondering if anyone else out there saw the night sky and the strange bright lights."]}