{"Country":"United Arab Emirates","Log Number":"AE-05302011-0010","Date Submitted":"05/30/2011 11:17 UTC","Longitude":"55.389133","Summary":"Stainless Steel Shine Disc-Shaped UFO","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in Sharjah","There were no other sightings in Sharjah on or around May 30th 2011"],"Source":"MUFON","Region":"Sharjah","Object Features":"Unknown","Sighting Duration":"00:00:20","divs":["Sighting DetailsTo describe the conditions this morning, it was a clear sky, i.e. no clouds in the sky (just the blue sky). Weather conditions were, 28-29 degree centigrade, no wind or dust in the atmosphere and low humidity conditions. It was bright as the sun was up already, hence no chances of any mistakes. I am an Indian national living with my wife in Sharjah (United Arab Emirates). Every morning I drive my wife to work, since the last five years. We take the same route every day, which is a very short one, on the path of which I can recognize all the structures. This morning, i.e. 6:50 AM (30th May 2011), I was driving my wife to work, when I stopped at a big round-about to go left. I was looking towards my left hand side where I was checking for passing by vehicles, when my eyes met this really shiny object just hovering at an approximate height of 300-350 ft. This object was simply hovering without any noise or movement. It was really shiny, the texture which could be best described like that of stainless steel surface (because of the factor as to how the sun light was bouncing off of it). It just hung there, when my wife also saw it. The object was a typical disc shaped, saucer like UFO. I could tell it was a disc-shaped object as it just on its side just for a bit revealing the shape. I witnessed it for nearly 20 seconds, with me and my wife sitting in my car at the round-about just staring at it when it simply just disintegrated into thin air, it just vanished right in front of our eyes. Earlier I have always noticed certain huge round shaped shadows being casted ton the ground, just to look up and see nothing. Also, other phenomenon like strange sky scars that cannot be formed by any AirPlane. It was very phenomenal for us to witness a UFO for the first time in our lives. Unfortunately, since I was in my car with the engine on, I could not get a chance to grab a picture of it, also because I was dumb-struck just looking at it. It was no weather phenomenon, no visual trick, no planet, no blimp, no swamp gas, nothing else but a UFO."],"files":["/var/www/straped/mufon/html2text/29314.html.txt","/var/www/straped/mufon/org/29314.html"],"Object Flight Path":"Stationary,Hovering then path,Other,Unknown","Object Shape":"Disc","Disposition":"Unresolved","Latitude":"25.371497","Date of the Event":"05/30/2011 06:50 UTC","City":"Sharjah","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=25.371497,+55.389133(29314)&iwloc=A&hl=en\"> mufon case (29314) map </A>","Case Number":"29314"}