{"Weather Factors":"Unknown","trends":["There have been 15 other sightings in Atlantic City","There were no other sightings in Atlantic City on or around May 30th 2011"],"divs":["Sighting DetailsI went outside early in the morning after having saw a particularly bright star from my bedroom window as I laid in bed watching online TV. In any event, I decided to go outside and smoke a cigarette while checking the water level in our pool (we are currently filling it up after replacing the liner). Then I saw a similar thing to what I had seen last night. But this time, the object seemed to be much lower with another point of light connected to it. Basically, the object slowly floated towards the horizon--the East--as light was just beginning to come with the dawn. About 20 seconds after it faded slowly into the sky (not the horizon). Also, the whole time the two objects stayed equidistant from one another. Honestly, I have no idea what the objects were. The light was completely steady and white for the whole time--except as it dimmed. Certainly, not flashing like airplane lights though. My reactions were basically just one of awe because I didn't expect to see something again like the anomalous object I viewed the previous night. This time it was much more interesting though. Again, these objects moved slowly as if floating through the sky to the East as dawn was breaking."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.371103,+-74.420387(29310)&iwloc=A&hl=en\"> mufon case (29310) map </A>","Tags":"City","Viewing Distance":"Unknown","Case Number":"29310","Source":"MUFON","Log Number":"US-05302011-0006","files":["/var/www/straped/mufon/html2text/29310.html.txt","/var/www/straped/mufon/org/29310.html"],"Summary":"Two (connected) equidistant Star-like UFO passes","Country":"United States","Object Features":"Undisclosed","Object Shape":"Circle","Object Flight Path":"Undisclosed","Latitude":"39.371103","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","City":"Atlantic City","Date of the Event":"05/30/2011 12:00 UTC","Region":"New Jersey","Date Submitted":"05/30/2011 05:22 UTC","Longitude":"-74.420387"}