{"Latitude":"35.617347","Case Number":"29327","Country":"United States","Log Number":"US-05312011-0006","Summary":"Boomerang or half-moon shaped object with constant white lights along the front traveling silently at a high spped across the sky in Jackson, TN","map":"<A HREF = \"http://maps.google.com/maps?q=35.617347,+-88.806197(29327)&iwloc=A&hl=en\"> mufon case (29327) map </A>","Weather Factors":"Does Not Apply","Sighting Duration":"00:00:10","Source":"MUFON","files":["/var/www/straped/mufon/html2text/29327.html.txt","/var/www/straped/mufon/org/29327.html"],"divs":["sighting detailsat 10:15 pm on may 21, 2011, i was outside sitting on my back deck. it was a clear and windless night. i noticed something out of the corner of my eye and looked up. what i saw was extraordinary. i had no idea what it was as i have never seen anything in my life like it. the ufo was heading exactly due norht at moderate speed(faster than a conventional aircraft). i watched the ufo for approximately 10 seconds until it went completly out of sight. i estimated the ufo was at an altitude of 20 to 50 thousand feet. description: the ufo had at least a dozen, solid, soft white lights that appeared to be placed evenly along the front in a slight boomerang shapped fashion. i could not exactally tell if the lights were attached to a solid body, or were seperate entities flying in a fixed formation. i want to say they were attached, however, if they were, the body of the object was black. the lights appeared to be spaced equally apart along the front of the object and were not blinking as with most conventional aircraft. i estimated the size of the ufo to be at least two hundred yards wide. it was a massive object, but very graceful. it made no sound as it moved across the sky almost directly overhead at about 80 degrees from my observation point. after the object passed out of sight, there was no sound trail. i was in total fasination of what i witnessed. i noted the time on my cell phone (10:15 p.m.)and thought about what to do next. after telling my wife about the object, i called the police aroud 10:20 p.m. i didn't know who else to call. i contacted the national ufo reporting center the following monday (5\\23\\11) and filled an official report with them. i was so amazed by the object, i wanted it to return. i have seen some strange (but explainable) things in my life, but this could not be explained. it was on a controled course and lasted around 10 secondes from the time i spotted it to the time it passed out of sight due north. i have attached a rough sketch as i had no time to get my camcorder."],"Longitude":"-88.806197","Tags":"City","trends":["There have been 4 other sightings in Jackson","There were no other sightings in Jackson on or around May 21st 2011","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Date Submitted":"05/31/2011 09:07 UTC","Region":"Tennessee","Object Shape":"Boomerang","Viewing Distance":"Over One Mile","City":"Jackson","Object Features":"Unknown","Disposition":"Unknown","Date of the Event":"05/21/2011 10:15 UTC"}