{"Disposition":"IFO","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"05/30/2011 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.976944,+-90.048611(29329)&iwloc=A&hl=en\"> mufon case (29329) map </A>","City":"Ste. Genevieve","Object Shape":"Diamond","Object Flight Path":"Straight-line path","Summary":"Extremely bright diamond shaped light moving north","Date Submitted":"05/31/2011 03:31 UTC","Region":"Missouri","Log Number":"US-05312011-0008","Viewing Distance":"Unknown","divs":["sighting detailsi admit i had been drinking. my friends and i had been star gazing practically all night at the lake in rural missouri. we saw several shooting stars and airplanes. i stopped drinking from 2:00am - 4:00am so i could drive back home to st. louis. i was sober at 4:00am. at approximatley 4:00a.m., i walked to my car to leave, and i saw something bright out of the corner of my eye in the northern sky. i looked up\\over, and it was a huge (compared to airplanes, stars and planets) white light diamond shape moving rather fast, south to north. i called my girlfriend to come see it, and she saw it too. we were both freaked out. and then it disappeared over the the next hill's treetops abrutly. i tried to tell myself it was a satellite, but i looked up what they look like, typed in \"diamond shaped light\" and ufos popped up. i thought it was moving in a straight line, but my friend said she thought it looked like it jumped, but that may have been due to her still having a beer in her hand at 4:00am, and it being behind a big tree and the branches may have been moving. it scared me."],"Country":"United States","Latitude":"37.976944","files":["/var/www/straped/mufon/html2text/29329.html.txt","/var/www/straped/mufon/org/29329.html"],"trends":["There have been no other sightings in Ste. Genevieve","This sighting has never been favorited."],"Case Number":"29329","Tags":"City","Longitude":"-90.048611","Object Features":"Unknown"}