{"Country":"United States","divs":["Sighting DetailsI was enjoying the peak of the 2010 Harvest Moon in my backyard. While laying on my back looking at the Orion constellation a circular object lit up then flew away around 3:30 a.m. The circle was 200 yards above my head and went unnoticed until the outer rim lit up a brilliant blue turning white and flew off. Scientifically speaking the area that lit up made it look like a doughnut. The flight pattern was in an upside down 7. It moved to the side then shot off in a long streak which appeared to be upwards though I cannot be sure. The event transpired within a few seconds. I've lived in many different places with many changes in latitude and longitude but have never seen any UFO activity except for Toombs County. There have been many similar events here always happening at night. I have lost count of how many such events personally experienced in this area. These experiences have never surprised me probably because of growing up on Star Wars, etc. All I know is the experience brings awe at the speed in which I have seen these things move. There is nothing I personally know of that can move that fast. I've seen the blackbirds and stealth bomber airplanes flight speed and those pale in comparison with the UFOs. The topography of Toombs County is very unique while sitting on a hot spot. The atmospheric pressure is generally very high here."],"Region":"Georgia","files":["/var/www/straped/mufon/html2text/29320.html.txt","/var/www/straped/mufon/org/29320.html"],"Longitude":"-82.413726","Date Submitted":"05/30/2011 09:39 UTC","Date of the Event":"09/23/2010 03:30 UTC","Summary":"2010 Harvest Moon UFO","Latitude":"32.192794","Source":"MUFON","Log Number":"US-05302011-0016","Tags":"City","Disposition":"Unknown","Weather Factors":"None","Object Features":"None","trends":["There has been one other sighting in Vidalia","There were no other sightings in Vidalia on or around September 23rd 2010"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.192794,+-82.413726(29320)&iwloc=A&hl=en\"> mufon case (29320) map </A>","Viewing Distance":"501 Feet - 1 Mile","City":"Vidalia","Sighting Duration":"00:00:05","Case Number":"29320","Object Flight Path":"Stationary,Path with directional change","Object Shape":"Circle, Other"}