{"Region":"Delaware","map":"<A HREF = \"http://maps.google.com/maps?q=38.725785,+-75.068104(29334)&iwloc=A&hl=en\"> mufon case (29334) map </A>","trends":["There have been 2 other sightings in Rehoboth Beach","There were no other sightings in Rehoboth Beach on or around May 28th 2011"],"Tags":"City","Weather Factors":"Unknown","Object Features":"Undisclosed","Latitude":"38.725785","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/29334.html.txt","/var/www/straped/mufon/org/29334.html"],"Source":"MUFON","Object Flight Path":"Undisclosed","Longitude":"-75.068104","Date Submitted":"05/31/2011 07:43 UTC","Summary":"Woke up to my son crying for a bottle. The wife took care of that and I laid in bed. I heard a weird sound fading in a out for 20 mins.","Log Number":"US-05312011-0013","Country":"United States","divs":["sighting detailslaying in bed, hot as can be, because the family wanted to save money and sleep with the windows open. i couldn't fall back asleep because it was very humid that night. i heard a noise, not too loud, not too faint. the noise sounded sort of like a a\\c compressor pulsing and humming. well been a hvac technician for 2 years working with compressors daily, this was no freon compressor i have ever heard. the noise was very distinct and i could tell what it was. the noise was a electrical humming with pulses in a out. i could tell it was above me, and not below me. i was sleeping on the 2nd floor of the house. after a few minutes you could hear it move to other locations. the only thing that i could think of was a ufo, and it was sitting there scanning us. finally after 20 minutes the noise got very faint, and disappeared. i was in shock after experiencing this. either this was a miliatry craft that doesn't use fuel, or it's gotta be a ufo. i have read up on mufon in the past, so i am a believer, but never thought this would happen to me. i would of have gotten up to look out the window, but i was in shock and could not move. also, as of 5\\31\\11 when i went to write this event. i checked the live event map on the site mufon.com and noticed a post that was from that same night and roughly the same location. that event was about 50 miles away."],"Case Number":"29334","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Rehoboth Beach","Date of the Event":"05/28/2011 12:00 UTC","Disposition":"Insufficient Data"}