{"trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around May 31st 2011"],"Summary":"Spotted Triangle UFO hovering over tree line in our neighborhood","Source":"MUFON","Weather Factors":"Windy, Light","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Region":"Texas","Latitude":"32.920164","Sighting Duration":"Undisclosed","Date Submitted":"06/01/2011 12:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.920164,+-96.633283(29338)&iwloc=A&hl=en\"> mufon case (29338) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/29338.html.txt","/var/www/straped/mufon/org/29338.html"],"Country":"United States","Case Number":"29338","Log Number":"US-06012011-0001","City":"Garland","Longitude":"-96.633283","Date of the Event":"05/31/2011 01:00 UTC","Object Features":"Patterned Surface","divs":["Sighting DetailsThis is the story as it was told to me by my daughter and her boyfriend and I can collaborate it as I was able to witness and hear the UFO as it sped away. My Daughter and her boyfriend had entered our neighborhood which is densely populated with Live Oak trees around 1:00am and noticed there was a stationary object with 2 lights hovering about 25ft. above the treeline at their ten O'clock NE about 3 blocks away. Her boyfriend noticed that the top part of the object seemed translucent and it seemed as though he could see through it and bottom part was more opaque and solid. They turned left on the next street towards our house and my daughter kept the object in sight the entire time. Then they turned right onto the circle where we live. It is a keyhole circle surrounded by trees and we live at the end of it. They then parked the car and got out so they could get a better look. The craft at this time was about a block away and at their one o'clock SE still hovering above the treeline. At this point I got a phone call from my daughter telling me to come out immediately as there was a UFO. I ran out of the house and could hear a whirring noise above my head. I looked up and could see an object speeding ahead of me with lights blinking than disappearing behind the SW tree line in the distance. My daughter's boyfriend looked up as the craft passed directly over his head. He said that after they parked the car and got out. The object moved to the eight o'clock position then made a right angle turn then passed directly over our house and over their heads speeding out of sight behind the trees. My daughter's boyfriend's description of the under belly of the craft was as follows; he said it was as big as a house and was about 50ft to 75ft from the ground. It was triangular with rounded corners, like a billiard ball rack. It had 2 round white lights, one at each end of the bottom of the triangle and 1 amber light at the top, was gunmetal in color and had an inverted rectangular tray shape inset within the triangle which had parallel lines. He also noticed the whirring noise as it passed over, but it didn't seem to be an engine noise but more like a wind noise passing over something. My husband also heard the whirring noise and felt the vibrations as it passed over the house. Nobody heard the noise until it was moving directly overhead. My daughter was not able to get a picture because she was busy calling me and her boyfriends phone died just as he tried to take a picture. This is the second time they have seen a triangular craft in our neighborhood. The first time was around the same time about 6 months ago, a few blocks further away and higher up. It also sped away in a Southwesterly direction."],"Object Shape":"Triangle","Viewing Distance":"21-100 Feet","Disposition":"Unknown"}