{"map":"<A HREF = \"http://maps.google.com/maps?q=47.61607,+-122.327451(29337)&iwloc=A&hl=en\"> mufon case (29337) map </A>","files":["/var/www/straped/mufon/html2text/29337.html.txt","/var/www/straped/mufon/org/29337.html"],"Region":"Washington","City":"Seattle","Latitude":"47.61607","Summary":"oblong, rotating, rotating color","Object Flight Path":"Straight-line path","Date Submitted":"05/31/2011 11:43 UTC","Disposition":"Unresolved","Object Features":"Undisclosed","divs":["Sighting DetailsI was walking south looking up watching the barn swallows flying for their dinner.I was at Volunteer park. Past the birds i thought I saw a bald eagle flying. I love to watch them and so I did. I thought I saw the white of the tail. The movement was strange for a bird , they usually fly up high on updrafts ,circling. This did not circle. It rotated,and sped up and slowed down. It looked like it became two, so i thought oh that's why it weird there are two. I sat and watched, and as it flew I knew that it was no bird, so I started to think it was a mylar balloon. As it rotated tail over end, it would go black , bright flash, then sometimes red , and then disappear.This was a constant the changing of color. Sometimes black to disappear, or black to red to a flash, then it would disappear.It was going in the direction of the wind,but it was moving faster than the clouds. I watched until i could barley see it. and at that point it would go black to a quick flash to clear. It became consistent, perhaps due to the distance.I was like wow that was cool. I felt giddy. I looked around and no one was looking. This lasted for about two to three minutes. It also appeared to have some sort of emissions, but i was not so sure because it was against cloud cover."],"Log Number":"US-05312011-0016","Object Shape":"Cigar","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-122.327451","Country":"United States","Weather Factors":"Unknown","Date of the Event":"05/31/2011 07:55 UTC","Source":"MUFON","Case Number":"29337","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around May 31st 2011"]}