{"Date of the Event":"05/26/2011 01:00 UTC","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Weather Factors":"None","Log Number":"US-08072011-0112","Country":"United States","Tags":"City","Object Features":"Undisclosed","Latitude":"38.484584","Viewing Distance":"Unknown","divs":["Sighting DetailsI was asleep in my bed at our apartment complex. My boyfriend at the time was also asleep. I thought I was dreaming, there were shadows and blobs that looked out of focus like you were looking through a viewfinder. It felt like I was lifted from my bed and could make sounds but could not move. The next thing I remember was waking up to the sound of my six year old son screaming. When I made it to his room he was terrified that some bugs were in his room. He has never done that before and to this day is terrified of \"bugs\". He would not go back to sleep that night. The next day, I was combing my hair behind my ears my left ear was very sore, a friend of mine looked behind my ear and I have a huge scar on it. The scar was not there before and hurts. It felt very hot and the scar is still there. There feels like there is a knot in it that will not go away. We have also on a couple of nights witnessed low flying star like objects flying in all directions. They are DEFINETLY NOT airplanes or helicoptors. They fly very low and make no sound . I hope I am just overreacting and there is nothing to any of this. My current boyfriend has urged me to contact your organization. I don't really subscribe to any of this. I don't know what to think. I have photos of my scar, and every time we see these things flying in the sky I try to take a picture and our camera will not work."],"Source":"MUFON","Region":"Kentucky","Object Flight Path":"Undisclosed","Case Number":"29335","City":"Ashland","map":"<A HREF = \"http://maps.google.com/maps?q=38.484584,+-82.631979(29335)&iwloc=A&hl=en\"> mufon case (29335) map </A>","Summary":"Several very low flying stars moving very slow to very fast in all directions","Date Submitted":"08/07/2011 10:40 UTC","trends":["There have been 17 other sightings in Ashland","There were no other sightings in Ashland on or around May 26th 2011"],"files":["/var/www/straped/mufon/html2text/29335.html.txt","/var/www/straped/mufon/org/29335.html"],"Disposition":"Unknown","Longitude":"-82.631979"}