{"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile, Unknown","City":"Salisbury","Disposition":"Unresolved","Longitude":"-75.590139","Tags":"City","Case Number":"29330","Latitude":"38.366954","Object Features":"Unknown","Log Number":"US-05312011-0009","divs":["sighting detailsactivity: surf fishing date and time: 5\\28\\11 11:35 pm location: lower eastern shore on the chesapeake bay airfields nearby: naval air station patuxent river, salisbury-ocean city wicomico regional airport weather: clear, starry night i was fishing with my brother-in-law late saturday night. i looked up and saw a very large, bright, white, star-like object moving very slowly going northeast across the night sky. i stared at this object with extreme scrutiny and saw no blinking lights of any kind, just a steady bright white light. i observed it moving silently for about 30 seconds then it slowly, slowly faded away until my brother-in-law or myself could no longer see it, total time, around 2 minutes. it is hard for me to say what the altitude of this object could have been. there were planes flying around that night and this object didn't seem to be flying as high as those aircraft (commercial and local). the size of this star-like object was about the size of a penny (and just-a-bit smaller) if you held it up at arms length. i know this was no aircraft or meteor and i am fairly certain it wasn't the space station. i would like to know what it was because it was very interesting to observe."],"Date Submitted":"05/31/2011 03:50 UTC","Region":"Maryland","map":"<A HREF = \"http://maps.google.com/maps?q=38.366954,+-75.590139(29330)&iwloc=A&hl=en\"> mufon case (29330) map </A>","Sighting Duration":"11:35:00","files":["/var/www/straped/mufon/html2text/29330.html.txt","/var/www/straped/mufon/org/29330.html"],"Country":"United States","Source":"MUFON","Date of the Event":"05/28/2011 12:00 UTC","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Salisbury","There were no other sightings in Salisbury on or around May 28th 2011"],"Summary":"i saw a large, bright star-like object move slowly northeast at 11:35pm then it just faded away to nothing.","Object Shape":"Star-like"}