{"Object Features":"Unknown","Object Flight Path":"Path with directional change","Disposition":"Insufficient Data","Longitude":"-116.417539","Viewing Distance":"Over One Mile","Summary":"Not Provided","Region":"Nevada","Sighting Duration":"Undisclosed","Weather Factors":"Windy","Date of the Event":"05/30/2011 04:55 UTC","files":["/var/www/straped/mufon/html2text/29342.html.txt","/var/www/straped/mufon/org/29342.html"],"trends":[],"Object Shape":"Chevron, Diamond, Square, Rectagular","Country":"United States","Tags":"City","divs":["Sighting DetailsWhile coming back from lunch to Fry's, I was on the flyover ramp (facing north) and noticed a large rectangular shape off to the left of of the Mandalay Bay towers. It grabbed my attention and I almost drove into the wall of the flyover. My first thought was that it was a balloon, but that didn't fit. Instead of heading back to work, I took a right into the parking lots and tried to keep the UFO in sight. It was moving north along what seemed to be the general path of the I-15 corridor. When I first saw it, it was at least twice as large as the letters on the top of the Mandalay Bay Casino from my perspective. The object was dark, but you could tell that the haze of the atmosphere that it was not near by. Because of the haze, I would say it was a dark grey in color. The edges seemed defined. At one point it turned on edge and I thought I lost track of it. So it must have been thin when looking \"edge on\". Nothing about it's various orientations during its flight told me that it could not have been a square shape. Total time of view was about ten minutes and I figure that it traveled north along the I-15 corridor in that time so it must have been flying at over 100 mph. Last glimpse of it was still heading north. It had to have flown right by the McCarran Airport and Nellis AFB control centers. I cannot emphasize enough the square shape and the the relative thinness of the object. Also, it flew with it's body at an angle that was not aerodynamic to its direction of movement except for that short time that I thought I lost sight of it. I finally lost sight of it trying to look down Las Vegas Blvd as it appeared to be heading to the peaks of the mountains of the north Las Vegas valley, ironically and generally in the direction of Area 51. I was the assistant state director for Colorado MUFON for eight years and consider myself to be a trained observer."],"Log Number":"US-06012011-0005","Latitude":"38.80897","Date Submitted":"06/01/2011 04:34 UTC","Case Number":"29342","map":"<A HREF = \"http://maps.google.com/maps?q=38.80897,+-116.417539(29342)&iwloc=A&hl=en\"> mufon case (29342) map </A>","City":"Undisclosed","Source":"MUFON"}