{"Object Features":"None","Source":"MUFON","Case Number":"29343","Weather Factors":"None","Country":"United States","Log Number":"US-06012011-0006","City":"Georgetown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29343.html.txt","/var/www/straped/mufon/org/29343.html"],"Object Flight Path":"Stationary","Date Submitted":"06/01/2011 11:25 UTC","Summary":"multiple pairs of lights alternating on/off between each other","Region":"South Carolina","Object Shape":"Star-like","Disposition":"Unknown","Longitude":"-79.288666","trends":["There have been 4 other sightings in Georgetown","There were no other sightings in Georgetown on or around June 1st 2011"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.379664,+-79.288666(29343)&iwloc=A&hl=en\"> mufon case (29343) map </A>","Date of the Event":"06/01/2011 09:30 UTC","Latitude":"33.379664","Tags":"City","divs":["Sighting DetailsLooking out over the ocean (Atlantic) out to the ESE. 45 degrees above horizon a pair of lights illuminated. Simiar to car headlights. After several seconds, the pair of lights extinguised then another pair illuminated off to the right (south) of the original pair. A third pair illumnated below, at about 25 degrees off the horizon. The lights alternated between each other...at one point all 3 pairs were illuminated. The final pair illuminated again then extinguished. The event lasted no more than 2 to 3 minutes - but may have been ongoing before I noticed it. This was witnessed by 2 other observers present with me after I called their attention to the display. I am an avid aviation enthusiast and noted no movent, no navigation lights an no beacons asociated with the lights. The lights did not appear to move - just illuminate then extinguish - followed by the next pair lighting up - almost as if they were in sync with one another - but thousands of yards - if not several miles apart (estimate). This was nothing short of a VERY strange event. These were not flares, fireworks of other pyrotechnics - as they did not ascend or descend. They maintained a constant altitude and azimuth. They simply illuminated and extinguished then repeated the sequence among themselves - at one point all 3 pairs were illuminated. Once they stopped - that was the end. I contnued to look out over the ocean for 20 to 30 minutes to see if anything else would happen - but noticed nothing else unusual."]}