{"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Date of the Event":"05/16/2011 08:58 UTC","Disposition":"Insufficient Data","Longitude":"-81.649401","Case Number":"29345","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around May 16th 2011"],"divs":["Sighting DetailsI decided to get up to watch the Endeavor shuttle launch from my front yard. I must admit, I was watching the sky all around the shuttle for weird cloud formations my mother had mentioned previously witnessing. Shortly after the launch the shuttle was visible from Jacksonville, FL. Out of the corner of my eye, to the right of the shuttle. I am not very good at estimating distances but I believe the object was in Jacksonville airspace, NOT Cape Canaveral. It was high in the sky, about as high as planes normally fly. Initially, I brushed it off as a plane but it didn't look right to me so I kept glancing back over it. It was insanely shiny, silver, chrome looking. From my vantage it seemed completely spherical. It seemed to just be floating and in the same direction as the shuttle and kinda fading and reappearing into view as the sun hit it. My overall impression of the object was that it was an insanely chrome-shiney ball floating at a slow speed. As soon as the shuttle was no longer visible, I looked back to the object. It had stopped moving in the sky and I observed it for a few more seconds before it suddenly shot straight up and disappeared at a VERY high rate of speed and I wished I had pulled out my cell phone camera (odds are I wouldnt have caught much though, it was really far away and my cell phone video camera isnt the best) I immediately called my mom and started to tell her about the object. She then mentioned she had seen the exact same thing but thought her eyes were playing tricks on her. She was facing in the opposite direction of the shuttle launch (she was not sure which way to look, so she missed it) so I believe we did not view the same object. I will admit I was a bit biased before this sighting as I do believe there is unexplained arial phenomena (that I tend to attribute to extraterrestrial forces), but at the same time I personally would like to remain completely impartial. I have been looking to the skys since childhood hoping to see a UFO and have even tried to talk myself into believing the rare blimp sighting or odd looking plane sighting was a UFO sighting, but I always erred on the side of objective reality. The entire time I viewed this object (an object that actually almost distracted me from watching my first shuttle launch ever) I was trying to talk myself out of the bizarre things I was witnessing. The only thing that convinced me this object was NOT an identifiable aircraft was its high speed vertical shoot into the sky."],"City":"Jacksonville","Region":"Florida","Viewing Distance":"Over One Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.340084,+-81.649401(29345)&iwloc=A&hl=en\"> mufon case (29345) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-06022011-0001","Source":"MUFON","Date Submitted":"06/02/2011 02:05 UTC","Weather Factors":"None","Summary":"UFO tracking shuttle launch then quickly shooting upwards and disappearing","Object Features":"None","files":["/var/www/straped/mufon/html2text/29345.html.txt","/var/www/straped/mufon/org/29345.html"],"Object Shape":"Sphere","Latitude":"30.340084"}