{"Object Flight Path":"Undisclosed","Date Submitted":"06/03/2011 09:14 UTC","trends":["There have been 6 other sightings in Tiskilwa","There was one other sighting in Tiskilwa on or around May 31st 2011"],"Summary":"Silver cylinder in daylight","Region":"Illinois","City":"Tiskilwa","map":"<A HREF = \"http://maps.google.com/maps?q=41.293539,+-89.498694(29359)&iwloc=A&hl=en\"> mufon case (29359) map </A>","Tags":"City","Object Shape":"Cylinder","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/29359.html.txt","/var/www/straped/mufon/org/29359.html"],"Disposition":"Unresolved","Date of the Event":"05/31/2011 07:45 UTC","Log Number":"US-06032011-0005","divs":["Sighting DetailsMay 31, 2011 7:45 pm, I went outside to feed horses. I saw a definite silver cylinder with slightly rounded ends, about the apparent same size of an ordinary passenger jet, traveling almost overhead, at a fairly slow speed, although a person could not have outrun it. There was no sound, although about 2 minutes later, well after the object had disappeared, I heard the sound of an ordinary plane coming from the opposite direction and yet could not see this plane. The object traveled west to east at a level altitude but much lower than a commercial plane - perhaps just a few thousand feet. Very smooth movement, very smooth shiny surface, but there were definitely no wings, as I could see the back end of it as it moved away from me. At one point, there seemed to be air displacement around it. Just after that point, I think it may have separated horizontally slightly for a brief moment, at which time there seemed to be a red band between the two sections. The sky was blue and cloudless. From the time I noticed it in the sky until it disappeared, it traveled a distance of perhaps several miles. It seemed to just fade away, but that could have been because of distance. Sighting lasted about 1 minute and was fascinating. I did not have time to go back inside for my camera."],"Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Longitude":"-89.498694","Latitude":"41.293539","Case Number":"29359","Weather Factors":"Unknown","Sighting Duration":"00:01:00"}