{"Weather Factors":"Unknown","Log Number":"US-06032011-0003","Longitude":"-111.834388","Viewing Distance":"20 Feet or Less","Region":"Utah","map":"<A HREF = \"http://maps.google.com/maps?q=41.735486,+-111.834388(29357)&iwloc=A&hl=en\"> mufon case (29357) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"06/03/2011 01:05 UTC","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 3 other sightings in Logan","There were no other sightings in Logan on or around June 3rd 2011"],"divs":["sighting detailsmy wife and i were out looking at the stars se from our house. we saw this super fast moving light moving rapidly through the sky. at first we thought is was just a super fast plane, but was to star shaped for a plain. we then noticed it moving around in circles. it then started to so in s shaped movements. it would disappear w\\o any sign or trace. after about 30 secs. of being gone it would re-appear moving in the same type of patterns then disappear again, this happened for about ten min. total. on it's final return, an object w\\ a similar shape, returned w\\ it. they moved in similar patterns but in opposite directions, then would fly by each other very closely, which in my eyes looked like only inches apart. why wife and i both assured each other that what we were seeing was real and that we both looking at the same thing, it felt that unreal. after watching this for about 15 min or so, while calling friends and family, all of which couldn't see it, they just both disappeared into the night sky. after watching the sky for another 5 min and seeing nothing more we finally just came to this sight to report this unbelievable event. it sounds crazy but it's 100% real."],"Case Number":"29357","Disposition":"Unresolved","Object Features":"Undisclosed","Object Shape":"Star-like","City":"Logan","Latitude":"41.735486","files":["/var/www/straped/mufon/html2text/29357.html.txt","/var/www/straped/mufon/org/29357.html"],"Country":"United States","Date Submitted":"06/03/2011 03:50 UTC","Summary":"1 then 2 flying very rapidly","Source":"MUFON"}