{"divs":["Sighting DetailsI was driving to my girlfriends house in the West Salem hills. To get to her house you must climb a steep hill that, if traveling in a car, puts you facing the western sky. It was very sporadic weather that whole day having been sunny, overcast, and raining. There had also been thunder and lightning earlier. As I was traveling up the hill I noticed two small dots of light in the sky. They were orange in color and appeared to be very high in the air. They caught my attention immediately because they were moving in very random patterns, zig-zaging around in a very erratic ways. I knew quite instantly that I was observing UFOs. I have seen documentaries that describe similar sightings and because I am quite positive nothing that I have ever seen in the air has the ability to move in these ways. I was absolutely in awe of this spectacle, mostly because I am very interested in UFOs and am an unwavering believer in their existence. I stopped my car in the middle of the street and continued to observe the UFOs for a few moments before deciding to pull out my cell phone and call my girlfriend and tell her to go outside and see them for herself. It was at this moment one of the dots seemed to fade quickly away, as if zipping off into the atmosphere. I continued to watch the other one as it danced around in the same random fashion. Just as I got my girlfriend on the phone the remaining UFO zipped away, slower than the first but in the same direction and fashion. I described the event to my girlfriend and several other close friends afterward."],"Longitude":"-123.028036","Weather Factors":"Lightning, Rain, Light","Case Number":"29358","Source":"MUFON","trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around May 31st 2011"],"Viewing Distance":"101-500 Feet, Unknown","Sighting Duration":"00:03:10","Region":"Oregon","Date of the Event":"05/31/2011 07:15 UTC","Country":"United States","Date Submitted":"06/03/2011 05:14 UTC","Object Flight Path":"Other","Object Features":"Unknown","Tags":"City","Log Number":"US-06032011-0004","Summary":"Two small round dancing lights","files":["/var/www/straped/mufon/html2text/29358.html.txt","/var/www/straped/mufon/org/29358.html"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=44.951058,+-123.028036(29358)&iwloc=A&hl=en\"> mufon case (29358) map </A>","City":"Salem","Latitude":"44.951058","Object Shape":"Circle, Star-like, Other"}