{"Viewing Distance":"Unknown","Summary":"2 bright lights, fixed and angled w/ direction of travel (SW to NE) with blue/white haze/light curved downward to make almost a triangle below? No sound. Awe and terror.","Date Submitted":"06/02/2011 07:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.838982,+-104.813113(29354)&iwloc=A&hl=en\"> mufon case (29354) map </A>","Region":"Colorado","Source":"MUFON","Latitude":"38.838982","City":"Colorado Springs","Longitude":"-104.813113","divs":["sighting detailsmonday morning, about 4:22 am, may 31st: firstly, let me say, i am of sane mind, and i was sober (i do not drink or use drugs). i was getting ready to get into my car to go to work, my car was parked facing out of my driveway (west), and i must of glanced up and then turned to get into my car... but, i paused. something caught my eye, so i looked up again. it took a second for my eyes and my brain to make sense of what had caught my eye, but when my confused brain finally figured it out, i about crapped myself (really). above the house across the street, and above it's mature trees, and i believe it was actually fairly high in the sky... but, it was increadably hard to tell how high, there were two bright star-like (only brighter) white lights, slowly following eachother across the sky. but, i don't think that's the part that caught my eye... i think it was the fact that there was a misty\\hazy blue\\white light showering down from them in a curved manner, that almost made it look like there could be a ?solid? upside down triangle benieth them. i even watched to see if the 'triangle' area in the center would pass over any stars and obstruct my view of them, but it didn't even pass over a single star. after looking at it about 10 or 15 seconds, i realized i had my camera on me, so i shakily took it out of my purse, all while repeatedly glancing upward at the object. i began recording, when it was almost strait over-head, and recorded for 1 min, 11 sec, until it disappeared behind some trees beside my house. (unfortunatally, my 14mp kodak camera does not record well at night, so all i got was black screen, heavy breathing, and then 'blair witch' type commentary once i realized how heavily i was breathing on film. but, if any of you official ppl from mufon care to contact me, to analyze my vid and see if you can pull anythiing out of it, that would be great... i know nothing about video editing.) so, once it disappeared from sight, i stopped recording, and though i was terrified, i was also in awe, so i put my camera down and ran around to the side of my house to watch it disappear to the horizon and the very barely early daylight. the creepiest part though, is that the further away it got, the more it appeared as though it was really, litterally spraying something down (the hazy light). this was definatally unlike any ufo footage i have ever seen, it was sooo strange. cannot find anything that compares! never thought i would see a ufo living here, as we have 2 airforce bases, 1 army base and norad!!! the stats (flat out): -2 fixed (not varying in distance from eachother) bright white lights -perfectly angled\\aligned with the direction of travel (approx. sw to ne) -a whitish-blue light\\haze\\mist? showering down from them in a curved manner, almost creating a possible solid upside-down triangle below them. -absolutally no sound -slow steady track across the sky -i belive it was fairly high up, which would make it very large. -no flashing lights -light\\haze\\mist? was not 'trailing' behind them, but rather, keeping constant below them beings i got no good video of the event, i have attatched my best artist rendition of what i saw. please, let me know if this sounds anything like anything anyone has ever seen before!!!"],"Date of the Event":"05/31/2011 04:22 UTC","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around May 31st 2011","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-06022011-0010","files":["/var/www/straped/mufon/html2text/29354.html.txt","/var/www/straped/mufon/more/29354_submitter_file1__100_1417.JPG","/var/www/straped/mufon/org/29354.html"],"Case Number":"29354","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Unknown","Disposition":"Unknown","Object Shape":"Cigar, Cylinder, Star-like, Triangle, Other, Unknown"}