{"Longitude":"-80.815147","Log Number":"","Viewing Distance":"Over One Mile","Date Submitted":"11/30/2003 12:00 UTC","Case Number":"2936","Country":"United States","Object Flight Path":"Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.244337,+-80.815147(2936)&iwloc=A&hl=en\"> mufon case (2936) map </A>","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/2936.html.txt","/var/www/straped/mufon/org/2936.html"],"Weather Factors":"Unknown","Date of the Event":"11/30/2003 12:00 UTC","Latitude":"41.244337","divs":["Sighting DetailsLate 1970s or early 1980, as far as I can remember, it was just after dusk, Icant remember if it was summer or not but it was warm out as we were playingfootball at out friends and we were in tee-shirts. We two of uswere on our wayhome from playing. We first noticed a very large, perfectly triangular objectin the air, only about 300 to 400 feet up, moving from the South to the Northwithout a sound. Several other witnesses near us saw the craft and it wasreported in the Warren Ohio Tribune newspaper the next day. It was so close wethought we would get zapped up into the craft. I told my parents and of coursethey did not believe me, until the paper reported it the next day. Each pointof the triangle had a white lightsteady, not flashing. Propulsion was completely silent. I noticed a definitestructure on the belly of the craft, similar to the structural members on theoutside skin of the John Hancock building in Chicago only much more complex, andit looked heavy, like it shouldnt be in the air. It wasnt moving fast enough toaquire lift so the propulsion is still a mystery to me. Scared the hell out ofme and I will never forget what I saw."],"Summary":"Slow-moving Triangular Craft","City":"Warren","Source":"MUFON","Object Features":"Other","Object Shape":"Triangle","trends":["There have been 8 other sightings in Warren","There were no other sightings in Warren on or around November 30th 2003"],"Disposition":"Insufficient Data","Region":"Ohio"}