{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29363.html.txt","/var/www/straped/mufon/org/29363.html"],"Date Submitted":"06/03/2011 08:31 UTC","Weather Factors":"None","trends":["There have been 11 other sightings in Clearlake","There were no other sightings in Clearlake on or around June 1st 2011"],"Region":"California","City":"Clearlake","Latitude":"38.965931","Viewing Distance":"Unknown","Date of the Event":"06/01/2011 12:00 UTC","Summary":"Very bright Flashing blue and red orb flies over and lands in mountains ever night.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.965931,+-122.622243(29363)&iwloc=A&hl=en\"> mufon case (29363) map </A>","divs":["Sighting DetailsFirst off, this isn't a one time occurrence. This happens every night. I am currently residing in clearlake, ca and the lake is directly behind our house. This is a small town without many people or lights so the sky's are very clear. We always see stars that definately move. They flash different colors, red, blue, white, and green. They stick out in the sky. I have sat on my porch and watched these \"stars\" appear out of thin air, move and disappear. They also seem to interact with each other. I've also seen giant \"balls of light\" in the sky that come up over the mountains and hover for various durations of time before landing and disappearing. The incident on June 1st was as follows. My roommate and I were sitting on the porch waiting for these \"lights\" we always see. We didn't have to wait long. A very large orb came up over the mountain, it was flashing red and blue. It was very bright, almost neon. I ran inside and alerted my room mates so that they could see it to. We were astonished by how bright and strange this particular orb was. It stayed above the mountain for 10 minutes or so before slowly defending and vanishing. I have no explanations for what these things are. I know alot of people who see the same things that I do. B"],"Object Flight Path":"Other","Sighting Duration":"Undisclosed","Object Shape":"Oval","Log Number":"US-06032011-0009","Longitude":"-122.622243","Source":"MUFON","Country":"United States","Disposition":"IFO","Case Number":"29363"}