{"Log Number":"US-06032011-0018","Case Number":"29372","Date Submitted":"06/03/2011 11:04 UTC","Latitude":"47.76412","Disposition":"Unresolved","Date of the Event":"02/09/2011 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Bothell","There were no other sightings in Bothell on or around February 9th 2011"],"Weather Factors":"Unknown","Region":"Washington","Source":"MUFON","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=47.76412,+-122.199234(29372)&iwloc=A&hl=en\"> mufon case (29372) map </A>","Object Features":"None","Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","Summary":"round, bright light in tree 25 feet away","City":"Bothell","divs":["Sighting DetailsOn Feb. 9, 20ll I went outside in the dark to hang up a couple of plastic bags that I washed. The hanger was at the north end of the back deck As I went to hang them up I saw a light in an evergreen tree just 25-30 feet from where I was. I took 6 steps to the edge and looked at the light. It was about 8 inches across and very bright. It went back and forth about 10-12 feet along the branches. However, it was in front of the branch because the density of the light never changed. There was no sound. I stood there my eyes telling me it was seeing an orb in my tree and my brain saying \"no, you do not see an orb in the tree.\" I had no idea what the orb whas when I saw it. ( After it left I called 2 neighbors and asked if their grandchildren were outside playing with a flashlight. They both said no.) I stood there watching for about 2 min. It was getting cold so I ran into the house to get a coat. I grabbed a coat and my cellphone. It was still there!! I stood there watching and called my husband. I thought I was in control but when he answered I yelled \"We have a UFO\". The light continued moving back and forth. It was like an alien student was doing a paper on a fir tree for a science project. The light never moved up or down, just back and forth. I was so stunned I never thought of running through the house to the front yard and looking at the light from the back. My camera would not have had a battery in it so never thought of taking a picture. When it left it went up a few feet and just disappeared. I still can not believe what I saw. However, I still check that tree probably 4 times a week hoping to see it again."],"Longitude":"-122.199234","files":["/var/www/straped/mufon/html2text/29372.html.txt","/var/www/straped/mufon/org/29372.html"],"Object Shape":"Circle"}