{"Log Number":"US-06042011-0002","Weather Factors":"None","divs":["Sighting DetailsI will try to make this as descriptive as possible. Please understand that I was 9 years old and this was, as I sit here today as a 31 year old, one of the most incredible things I have ever witnessed. I'll set the stage, and quite frankly I don't care if you believe me, I just want to tell this story. Somehow telling it makes me feel better about it. Like, if just one person believes me when I stare into their eyes and tell it, I am somehow assured that I am not crazy. So there I was...a smart and naive 9 year old. I loved Batman and I also had a bad habit of staying up way too late. I was working on a homemade bat cave out of cardboard and watching the original Batman movie with Adam West. My mother had long ago given up on making me go to bed, and besides, it was the summer and I was out for school. Suddenly, a strange feeling came over me. As I sat next to two windows that had your standard mini blinds installed, I felt the need to look outside. It was a strange overpowering need to look. I opened one slat of the blinds and was blown away by what I saw...Tears in my eyes as I type this... A large tree was across the street from my home, and there, to the left of it, an enormous craft lay perched...motionless...to its left. It was ENORMOUS. Based upon its position next to the tree but farther away, it must have been hundreds of feet wide and tall. It was a disc in the middle...your classic flying disc. However, on the bottom was a small cone and on the top of the disc was a larger cone. Lights lined the outside of the disc. They were green in color. The top cone was lined with yellow or white lights and the bottom was lined with red lights. The lights were sort of in a corkscrew pattern. I believe, based upon its size, that they were windows. They windows were in such an odd pattern, not symmetrical, but sort of in a corkscrew pattern. I rubbed my eyes in disbelief. For those that have had that kind of encounter, the first thing you feel is the most intense fear you have ever felt. I can assure you, I have never felt fear like that since. Of course, even as a 9 year old, I knew. My belief system, everything that I knew to be the truth was forever shattered. There was no doubt...this object was not of this world, and if the beings that manned it wanted to, we would all be dead...in an instant. I immediately panicked....were we being invaded...what should I do? I turned off the television and all of the lights. I sat in the dark for a few minutes and tried to compose myself. I was too afraid to cry...I had to look again. I opened a single slat of the blinds and looked....it was still there, hovering like a mothership you would see in a movie. Silent and still... I ran to the kitchen; my mother asleep in her bedroom, and my stepfather snoring on the couch. I grabbed a pad and pen and raced back to the room. I looked through the slat again and tried to draw the craft. Unfortunately, I was and still am not an artist. The image is seared into my mind...no tablet necessary. I closed the blinds and paced....what should I do....should I wake up my mother...my stepfather....I opened the blinds again and....it was gone...without a trace. No sound, no lights, just gone. Since that night, there is no doubt, we are not alone. The craft was massive....and there was no doubt that it was not of this earth. Since that date, I know we are not alone. Most importantly, I know that we, or our government, can't do anything to stop them if they decide to stay on a permanent basis. Let us all hope they are friendly...Let us all hope we survive it when they do come. I have not told you a story tonight...I have recounted a memory...one I wish I didn't have. For if I did not...my cozy little naive world would still exist."],"Region":"Pennsylvania","Object Features":"Window(s), Patterned Surface","Country":"United States","Source":"MUFON","Disposition":"Unknown","trends":["There have been no other sightings in South Williamsport","This sighting has never been favorited."],"Object Flight Path":"Stationary","Case Number":"29377","Date Submitted":"06/04/2011 12:56 UTC","City":"South Williamsport","map":"<A HREF = \"http://maps.google.com/maps?q=41.232023,+-76.999134(29377)&iwloc=A&hl=en\"> mufon case (29377) map </A>","Latitude":"41.232023","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-76.999134","Object Shape":"Cone, Disc","Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/29377.html.txt","/var/www/straped/mufon/org/29377.html"],"Summary":"Not exactly your typical flashing lights or far away object","Date of the Event":"08/19/1989 02:00 UTC"}