{"Weather Factors":"Windy","Country":"United States","files":["/var/www/straped/mufon/html2text/2937.html.txt","/var/www/straped/mufon/org/2937.html"],"Longitude":"-84.943034","Date Submitted":"03/19/2004 10:30 UTC","divs":["Sighting DetailsI had recently purchased a Canon ES8600 video camcorder and have been interestedin space UFOs since I had seen one at the age of 12-13 years old.I had seen a science series several years ago on TV that said how to video tapeobjects in the sky, so I tried it after purchasing the camcorder in February2004.On the night of March 19,2004, noticing an object in the sky that did not looklike a star I started video taping. The object has a red white pulsatingcharacteristic that the other stars did not have.This object shows up around 900 pm every night since the 17th of March at about15-20 degrees from the horizon. It is twinkling like a star but red can be seenwith the ordinary eye. In zooming in on the objectit is round, has in its center a round black spotbut has strips of blackness that seems to to come from right top across thecentermiddle to the left botton. Then this blackness can be seen which lookslike it comes from behind on its surface from the top, rolls down the middle tothe bottom. Then this blackness comes from the left side of this object, rollsacross the front, middle and bottom right. This blackness, which looks like ashadow, starts or comes from the right side then rolls around the right sideedge, around the surfaces edge and ends up on the left side of the object andlooks as if it goes behind it You can see blackness from the left top in theshape of an Y that rolls from the left top, down the middle, then bares to theleft and bottom of the object.A jet was going by and can be heard on the tape. I tried to capture the jet inthe viewfinder on the camcorderbut didnt want to let this object out of the viewfinder, so I did not capturethe jetbut the object then emitted what looked like a large cloud which covered most ofits surface"],"Sighting Duration":"01:59:00","Region":"Georgia","Object Flight Path":"Straight-line path","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=34.964391,+-84.943034(2937)&iwloc=A&hl=en\"> mufon case (2937) map </A>","Object Features":"Patterned Surface, Other","trends":["There have been 2 other sightings in Cohutta","There were no other sightings in Cohutta on or around March 19th 2004"],"Source":"MUFON","Disposition":"IFO","Tags":"City","Case Number":"2937","City":"Cohutta","Log Number":"","Viewing Distance":"Over One Mile","Date of the Event":"03/19/2004 10:30 UTC","Summary":"Video Taped Unidentified Object","Latitude":"34.964391"}