{"trends":["There have been no other sightings in Deep Creek Lake","This sighting has never been favorited."],"Country":"United States","Object Features":"Undisclosed","Date of the Event":"06/01/2001 12:00 UTC","Tags":"City","Summary":"At first looked like distant starts then formed into 3 circular balls.","files":["/var/www/straped/mufon/html2text/29388.html.txt","/var/www/straped/mufon/org/29388.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.511682,+-79.315572(29388)&iwloc=A&hl=en\"> mufon case (29388) map </A>","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-06042011-0013","Case Number":"29388","City":"Deep Creek Lake","Longitude":"-79.315572","Region":"Maryland","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Date Submitted":"06/04/2011 09:41 UTC","divs":["Sighting DetailsMe and a friend were out on deep creek lake fishing one night. We were the only people in our area of the lake. While fishing we noticed stars out in the distance that near the horizon. The weird thing is that they looked like they were fluttering. Sometimes gases make a star look like they are moving but they really aren't so after talking about it for a while we just ignored it. On this night the moon was really bright so you really didn't even really need a flashlight. After a few more minutes I looked back behind us and there were thousands of these little lights almost playing in the clouds. They were interacting with each of clearly flying in and out of the clouds. At the altitude of the clouds the UFO's had to a decent size. At this point we weren't scared yet but that would change. After a few more minutes there was 3 large lights, one right over top of us and one on each side of the boat. Once we saw that I threw my shirt over the latern that we had lit on the boat cause i thought maybe that was attracting them. Then I started the bot and we got the hell out of there. I told my parents about the event and they made fun of me and joked about it. My dad was a chief of police back in Washington PA and two week later my step-mom said to me. Did your dad tell you about the Men in Black guys that stopped down at the police station? I said no. She said they asked him if anyone has reported seeing anything suspicious. He said no. He never said anything to me. When we were down in Deep Creek I was using his truck and boat. Maybe this was a coincidence? I was watching your program on June 4th and the story is just like mine, almost. I never saw an alien or a UFO with spikes. But the orbs are exactly the same. I would submit to a polygraph and hopefully someone else can come forward and help explain what I saw. At the time my sisters boyfriend was with me but currently we don't talk anymore. If you think you can help or know someone that saw something around that time let me know."],"Latitude":"39.511682"}