{"Date of the Event":"05/31/2002 09:00 UTC","Weather Factors":"None","Case Number":"29382","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around May 31st 2002"],"Source":"MUFON","Object Flight Path":"Straight-line path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.10615,+-80.648019(29382)&iwloc=A&hl=en\"> mufon case (29382) map </A>","Object Shape":"Circle, Triangle","Longitude":"-80.648019","Disposition":"Unknown","divs":["Sighting DetailsIt was warm outside and I was on the phone talking to one of my friends laying down on the porch at my mother's home. While I was talking to her, and because I was laying on the porch, I was looking up at the sky and I happened to notice an object that reflected the stars, like a mirror would, but it was moving very slowly, and it was very smooth, and very big, just moving slowly over the homes. It is not something that I or anyone would have noticed because, like I said, it was like a mirror where it was showing the stars on the other side, but I was laying down and happened to notice that for some reason, even though it was reflecting the stars and sky it was moving and there was a way it was noticeable from an angle, almost like an optical illusion. I started telling my girlfriend that she had to go outside and look at this object, it was moving so slowly that she should see it in about 10 minutes if she went outside to look, because I told her I didn't want to be the only one seeing what I was seeing. I told her I couldn't believe what I was seeing. I was seeing what looked like a UFO. I don't think she went outside, and she never said she did, and even when she was taking out the trash, she didn't look, I don't think. I was living with my mom at the time, and I know we live by the Vienna Airport, and I also know that the military works at the airport as well, but what I saw was not something that I believe our military has the capability to duplicate at all. The shape was a smooth triangle shape, and it was very sleek, and I really don't think that out military has any sort of capability to reflect the sky so that any plane or Airforce Plane can reflect the sky like this object did. This thing was, also, approximately the size of a football field, and the width was about the same. And from what I could tell from the side, the height of it was big, but not really sure because like I said it was like some sort of optical illusion the way it reflected the sky and you really had to look at it to notice it. I was scared at the time I was looking at this object because of all the UFO stories I have heard, but I was also very fascinated at the same time and did not want to stop watching it wondering what it would do next. Eventually I just went in the house, after it got far enough that it was no longer over my mom's house, and I felt my friend was not going to go out and look at it so I had someone to confirm I was really seeing what I was seeing, and all it appeared to be doing was moving slowly over the area. The direction it was moving was toward the Vienna Airport, also. About 2 or 3 years later I was driving along Main Street in Niles with one of my children and I just so happened to look up in the sky because I noticed something reflecting in the sky. It was really high up in the sky so I am not sure of the size, but from what I could tell it was round in shape and it was silver. I can't remember if my son or daughter was in the car, but I do remember I kept saying look, it is round in shape, and it is just staying in one spot and not moving. What in the heck is that. And I know for sure we don't have any planes that are round in shape and that look silver like that. It scared me, in a way, because of that UFO I saw that night 2 or 3 years prior, and I kept thinking what the heck is going on that these UFO's are all of a sudden appearing. This was during the afternoon hours...not sure what time of day. I just kept thinking I have heard so many UFO stories, I really don't want to have something happen to me. So I just kept driving to my destination, and every now and again looking up to see if it was still there before I got to where I was going. Both instances I was both scared and fascinated. I have told a few people about it. But unless you see it for yourself, who is really going to believe you."],"Latitude":"41.10615","Log Number":"US-06042011-0007","City":"Youngstown","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Other","Region":"Ohio","Summary":"While on my mother's porch, I saw a triangle shape UFO slowly going over the house.","Date Submitted":"06/04/2011 02:09 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29382.html.txt","/var/www/straped/mufon/org/29382.html"]}