{"Date of the Event":"03/16/2003 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been no other sightings in Leakesville","This sighting has been favorited 1 time."],"divs":["Sighting DetailsI was awakened by the telephone. It was my mother, a 20 year special ed teacher, calling. She was very upset and wanted me to go outside and see if I could see anything in the sky. I was talking to her as I walked outside and looked around the sky. Looking to the northeast it was unmistakeable. A huge Jellyfish or squid looking object was in the sky. I was immediately scared as I knew it was no flying object manmade. The object was huge. It had 8-10 long tentacles is the best way to describe it. They where waiving back and forth and had lights going up and down them. I would say the object was no more than 5-10 miles high. I went and woke a friend who was staying at my house and we both sat and watched as what appeared to be little craft flying in and out of the largest craft. I was almost brought to tears as I watched and knew that we in fact were not alone. My mother called the sherriff station and was only laughed at. My mother was approx. 4 miles away from me and we talked on the phone as we both witnessed this event. The Jellyfish made no maneuvers other than the tentacles waving back and forth until just before sun up. As the sun rose the lights on the tentacles began to pulsate brighter and the craft slowly faded from sight. That night made me a firm believer in life from outside our planet. It was a very scary event, as well as a life changing event. I have searched intensily on the internet to find a video or picture of what I saw. If you know of such media, please let me know at the email I have provided. Thank you."],"Log Number":"US-06042011-0009","Disposition":"Insufficient Data","Longitude":"-88.557799","Source":"MUFON","Country":"United States","Object Flight Path":"Stationary,Path with directional change","Date Submitted":"06/04/2011 02:17 UTC","Sighting Duration":"Undisclosed","Object Features":"Dome, Appendage(s)","files":["/var/www/straped/mufon/html2text/29384.html.txt","/var/www/straped/mufon/org/29384.html"],"Latitude":"31.155737","Summary":"Giant Jellyfish","Tags":"City","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=31.155737,+-88.557799(29384)&iwloc=A&hl=en\"> mufon case (29384) map </A>","City":"Leakesville","Case Number":"29384","Object Shape":"Other"}