{"Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Other","Latitude":"36.115533","Weather Factors":"None","Date of the Event":"05/15/1996 08:15 UTC","Object Features":"Dome","trends":["There have been 5 other sightings in Black Rock","There were no other sightings in Black Rock on or around May 15th 1996"],"divs":["Sighting Detailswent outside to see if we could see anything .looking west out of my front door i spotted a bright lite just above the tree line. the light was unusually bright and seemed to be moving in its hovering position. from left to right and up and down very slowly . we walked up the hill to my neighbors to show him.he came to the door and i told him to look as i was pointing at the object. he said what the hell is that . i said i didnt know but ask if he thought it was moving,and stated it was.at that time his phone started ringingand he went inside to answer it. as soon as i heard him say hello ilooked back at the object and out of the bottom came this laser vortex grid . it looked like a basketball net that had been pulled from the bottom and was red lasers. out of that came a fireball shooting tyo the ground. there was a pause of darkness then another fireball all the way to the ground. i then yelled to my buddy to come look and he statede he was on the phone.i turned and yelled for him to hang up and come see.iturned back to look at the object and it haqd disappeared. the 911 calls should be on record at the sheriffs office in lawrence county. there were several callsfrom witnesses.please check this out. ive been wanting to tell my story to someone who underestands the things i saw. ive had four sightings in my life time ands would like to get it off my chest thank you .a former marine sgt"],"Summary":"heard calls on police scanner reporting fireballs in the sky","Case Number":"29383","Date Submitted":"06/04/2011 02:13 UTC","Source":"MUFON","Country":"United States","Longitude":"-91.094477","Viewing Distance":"101-500 Feet","City":"Black Rock","Region":"Arkansas","Log Number":"US-06042011-0008","Object Shape":"Fireball, Star-like","files":["/var/www/straped/mufon/html2text/29383.html.txt","/var/www/straped/mufon/org/29383.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.115533,+-91.094477(29383)&iwloc=A&hl=en\"> mufon case (29383) map </A>"}