{"Disposition":"Insufficient Data","divs":["Sighting DetailsI was looking out my west facing bedroom window when I saw a bright sparkling light rising slowly and moving in a northerly direction. Believing it was a local \"Care Flight \" helicopter I watched waiting for the usual sounds associated with it. When the sounds didn't begin when I knew they should , I ran out to the front room telling my son to look out the west living room window.We leaned out the window and looked closer to see if we could see any position or landing lights. The craft continued gaining altitude and moving north toward the Dayton International airport that sits less than one mile west of our apartment. When I realized it was no ordinary craft I was familiar with, I told my son to get the video camera and managed to get a small amount of video of it. It continued to move without sound as it ascended directly over the airport and suddenly faded out. About two minutes later a typical passenger jet came in from the west and made a normal landing. For me this is about the seventh actual sighting I have had, always expecting a typical answer to what I am seeing but end up puzzeled and near speechless trying to think of a resonable explanation."],"Tags":"City","Object Features":"Unknown","Weather Factors":"Unknown","Log Number":"US-06042011-0006","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"06/04/2011 02:07 UTC","Country":"United States","Latitude":"39.892292","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.892292,+-84.192971(29381)&iwloc=A&hl=en\"> mufon case (29381) map </A>","Summary":"Looking out the back bedroom window I saw a bright sparkly orange light on the south horizonmoving north.","trends":["There have been 6 other sightings in Vandalia","There were no other sightings in Vandalia on or around June 3rd 2011","This sighting has never been favorited.",""],"Case Number":"29381","Source":"MUFON","City":"Vandalia","Date of the Event":"06/03/2011 11:55 UTC","Sighting Duration":"00:04:00","files":["/var/www/straped/mufon/html2text/29381.html.txt","/var/www/straped/mufon/org/29381.html"],"Longitude":"-84.192971","Object Shape":"Sphere, Star-like","Region":"Ohio"}