{"map":"<A HREF = \"http://maps.google.com/maps?q=45.029573,+-84.672302(29386)&iwloc=A&hl=en\"> mufon case (29386) map </A>","Source":"MUFON","Region":"Michigan","Date of the Event":"06/03/2011 12:00 UTC","Country":"United States","Tags":"City","City":"Gaylord","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"29386","Object Flight Path":"Straight-line path","Disposition":"Unknown","Latitude":"45.029573","Summary":"Orange glowing ball 100 feet in the air moving about 40 mph. completely silent.","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Gaylord","There were no other sightings in Gaylord on or around June 3rd 2011"],"divs":["Sighting DetailsI had to be to work by 1:00 pm so I went outside to have a cigarette before I left. I always look to the sky at night hoping to see a ufo. Never in my wildest dreams did I think I would ever see one. I live in a very wooded area so I walked off my porch to get a better view of the sky. As I was looking skyward I seen what first appeared to be possibly a Roman Candle. As I looked closer I thought maybe a flair. The object was about 100 to 200 feet in the air and as it got closer I could clearly see it was a round glowing orange ball about the size of a basketball. This object came directly over my house flying about 40 mph in a straight line heading north east. It was completely silent. I watched it until it flew out of sight. It was not a flair, I see flairs all the time from the Grayling base. This was not a craft of any type. It was a round glowing orange ball. It had to be a probe of some sort. I wanted to get my camera but could not have gotten a photo in the short amount of time, plus I didn't want to take my eyes off of it. I have always been a believer but never thought I would be lucky enough to see something. Again, it was not a craft of any kind, and it was completely silent. And it was not a balloon."],"files":["/var/www/straped/mufon/html2text/29386.html.txt","/var/www/straped/mufon/org/29386.html"],"Longitude":"-84.672302","Log Number":"US-06042011-0011","Date Submitted":"06/04/2011 06:27 UTC","Object Shape":"Sphere"}