{"Country":"United States","Object Features":"None","Disposition":"Unknown","Object Shape":"Fireball, Sphere, Star-like","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-80.223899","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around June 4th 2011"],"files":["/var/www/straped/mufon/html2text/29398.html.txt","/var/www/straped/mufon/org/29398.html"],"Latitude":"25.798719","Log Number":"US-06042011-0022","Tags":"City","Weather Factors":"Unknown","Region":"Florida","Case Number":"29398","Date of the Event":"06/04/2011 09:28 UTC","Date Submitted":"06/04/2011 11:54 UTC","divs":["Sighting DetailsI had just finished washing both of my cars at the side of my house under the flood lights on the west side of my home. Reached down to ring out my wash mitt and happened to look about directly over my house as something caught my eye. I looked and saw what looked like a single pinkish-orange, sodium vapor street light colored, flickery like a flame in the wind, sphere traveling toward the South West about at a compass heading of 240 degrees to 250 degrees toward the SW. It slowed to almost a stop at about almost 95 to 100 degrees from over my house then sped back up to the regular speed, I ran in to get my wife to see it too, and it started a curve more to the west at a heading of 250-260 degrees and gaining altitude till it looked like a very faint moving star that vanished in the the night sky. It was about 9:28 PM. It was completly silent. The sky was mostly clear with small, mid level Cumulus cloud, sprinkled in on a stiff evening breez out of the due East, clouds also traveling from due East to due West. My wife got to see this first light and got to see it vanish into the western sky at a very high atitude at about 2,800 MPH as a jet fighter at 20,000 feet might look with afterburners on, but not conical like afterburners look and too round and flickery. I tried to photo them with my cell phone cam, but it didnt take too dark. My wife went inside to take a shower as she is not much into anything out of the usual and presumes it was a freak airplane or something. Then I was telling the neighbor and his wife, daughter, son and friends, who came out. Right then three more started above the tree line from out of the North East heading in the same direction as the first one at the same speed, one of the three seemed below the cumulus cloud bases, and passed through one small cloud completly illuminating it like a flare would, not a head light or plane landing light that has a forward aiming beam effect, and the others were above them, but the clouds were small and few between. I raced in to get my digital camera and came out to photo these, got three of them in my photos. All 6 of my neighbores, myself and my 8 year old daughter, and my 5 year old son saw these three. My neighbor's son of about 26 years old also got his camera out and took photos. As they passed overhead they too seemed to gain atitude till they were mere faint stars racing toward the almost westerly heading till they dissapeared, then three more rose over the NE horizon also spaced by what I could guess as a two to three mile spacing, one right behind the other also flickering two of thee three changed color to a brilliant red, but kept on flickering like a flame in the wind then they switched back to the pinkish orange as they gradually faded away to faint points of light mixing in the stars to the west of Miami. One last one followed the last three for a total of about 8. I ran back in to get my wife who was in a towel and checked the time it was about 9:35 PM By then a total of 8 people saw them, and my wife was still in the shower, but was brought to the attention more were flying overhead.I then called Miami-Dade Police non-emergency and officer at the phones also said multiple call were starting to come in regarding strange lights in the sky, her name is known and her badge number recorded, but per Margarett Zimmer of Mufon she requested to only not that info in the comments section to avoid trouble. Mary Margarett Zimmer of Miami Mufon will get my photo copys when my daughter downloads them into my computer in the morning, as I am not to sure how to do this task and dont want to loose the photos by mistake."],"Summary":"Bright, flickery, fast moving pinkish-orange fireball spheres","Sighting Duration":"00:10:00","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=25.798719,+-80.223899(29398)&iwloc=A&hl=en\"> mufon case (29398) map </A>","City":"Miami"}