{"Summary":"This actually defies explanation","City":"Newport News","Case Number":"29391","Object Shape":"Star-like","Latitude":"37.091232","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-76.465312","Log Number":"US-06042011-0016","divs":["Sighting DetailsThe date and time are pretty much forgotten, but that information will be in the picture data. I was trying to take a photo of the moon, using a Nikon D60 Gold Edition 10 megapixel camera. As I didn't want to shake or jar the camera, I used the timer button to take the picture so my button pushing wouldn't shake the camera. I had it on manual setting, except for focus, so I had a longer shutter opening than normal. I stood next to the camera as it did its job, watching the sky, the moon, etc. At no time during my time outside did I see anything at all besides the moon in the sky. I had no idea that a strange spot of blue light was in the picture until I came inside and loaded it into my computer. Upon zooming in on the object, it appears as though it is an object of some kind, not a star. Oddly, when the object is magnified, it seems to take on the shape similar to the space ship that was wrecked at the beginning of the movie \"Alien\". What motions it had are totally unknown, as I did not see the object while it was being photographed, as though it were invisible to the human eye. (There was simply nothing in the sky besides the moon as far as I could see). All the info you require below for the witness agreement can also be found in this section, so I'm not going to waste time filling it out. Either it is something that can be explained or it can't. Either way, you DON'T need this huge volume of information."],"Date Submitted":"06/04/2011 11:47 UTC","Date of the Event":"12/01/2009 11:00 UTC","Tags":"City","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.091232,+-76.465312(29391)&iwloc=A&hl=en\"> mufon case (29391) map </A>","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Newport News","There were no other sightings in Newport News on or around December 1st 2009","This sighting has never been favorited.",""],"Source":"MUFON","Region":"Virginia","Disposition":"IFO","Country":"United States","files":["/var/www/straped/mufon/html2text/29391.html.txt","/var/www/straped/mufon/more/29391_submitter_file1__01FirstShot.JPG","/var/www/straped/mufon/more/29391_submitter_file2__04FirstShotZoom1.JPG","/var/www/straped/mufon/more/29391_submitter_file3__06FirstShotZoom3.JPG","/var/www/straped/mufon/org/29391.html"],"Sighting Duration":"Undisclosed"}