{"Source":"MUFON","Object Shape":"Boomerang, Disc","Disposition":"Unresolved","Log Number":"US-06042011-0015","City":"Undisclosed","Case Number":"29390","divs":["Sighting DetailsI have looked into the eyes of 2 different types of ETs, it started when i was 4-5 years old.I became a type 1 diabetic and doctors told my parents i would not be around long,that was 40 years ago. They started to show up at nite when i was in bed, The grays(6+' tall) as we know them today would be in the bedroom they would lead me to the window and on the ground below me was what i called the elfs the little ones(3+'). The reson why they did this is to let me know that they mean me no harm,that the little one is my friend. I have had many encounters with them-other then a few family member i have never talked about this,cause to me they are not here to harm us they have been here long before us and are here to help humanity to servife. All my life doctors have said i should not be alive and i still am,thanks to the ETs, i dont know why they help us but they do. I can tell you of many encounters with them--like one day back in 1970 w'ill an eclispe they came into the house and it was like we knew they were coming and we hid behind the bathroom door and when it was over no one in my family knew of nothing happening-35 years after the fact i was talking with my mom asking her about that day and she says that she dont know what i'm talking about-yet i remember it like yesterday. Throghout my life they have been in and out of it. like i said i dont fear them cause i know in my heart that if they wanted to destroy us they could.I remember they told me they are from 2 galaxsys away from earth- they did not use the world time travel, they used the term time milipeation (bending of time) in average time they said it would talk 360 years to get to earth. But by muilipeation of time the second they leave there they apear here. I have to many things that i remember and am not going to put it in words on paper cause i dont need to read it, i lived it.. thank you for listen to this, you are the first people i have ever told about this-my doctors still say i should not be here but i am and i thank GOD and them. Thank you for reading this..."],"Object Features":"Undisclosed","Tags":"City","Summary":"in the 40 years i have known ETs i have been in a few, you did not list a triangle","Date Submitted":"06/04/2011 10:38 UTC","files":["/var/www/straped/mufon/html2text/29390.html.txt","/var/www/straped/mufon/org/29390.html"],"Viewing Distance":"Unknown","Date of the Event":"11/30/1969 12:00 UTC","Latitude":"42.414061","trends":[],"Sighting Duration":"Undisclosed","Country":"United States","Region":"Massachusetts","map":"<A HREF = \"http://maps.google.com/maps?q=42.414061,+-71.374727(29390)&iwloc=A&hl=en\"> mufon case (29390) map </A>","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Longitude":"-71.374727"}