{"map":"<A HREF = \"http://maps.google.com/maps?q=39.921978,+-88.572008(29397)&iwloc=A&hl=en\"> mufon case (29397) map </A>","divs":["Sighting DetailsMy sister and I were outside jumping on our trampoline. It was beginning to turn dark. I had just seen a plane go by in the same direction, then I turned my head toward my house. The next thing I new when I turned back, a turqoise glowing cigar-shaped object with diamond-shaped dark yellow-orange sparks emmitting from its rear appeared in thin air and traveled at a remarkable speed at a 45 degree angle downward, in the direction of a nearby cornfield. From what I saw, this thing appeared to be crashing. My encounter was brief, because I lost sight of it as it moved behind a tree and I was not able to see it again. At first, I thought it might be fireworks, but it never exploded, did not make noise, did not have a smell, was travelling at a straight trajectory downwards, and did not have smoke nor a visible fuse. Plus, the cigar split into two equal cigars with very little distance between them, and they continued to safely travel in a straight line keeping that exact distance between them. For a while, my sister and I had no clue what this was. We went inside and talked to our mother about it, but she did not believe us. So, without consulting each other, we went to opposite sides of the room and drew pictures of what we'd seen. Then, my mom finally seemed to believe that we'd seen something. I have a graphic design program on my computer, so I will try to recreate the object for you."],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Object Features":"None","files":["/var/www/straped/mufon/html2text/29397.html.txt","/var/www/straped/mufon/more/29397_submitter_file1__objectimage.jpg","/var/www/straped/mufon/more/29397_submitter_file2__objectanimated1.jpg","/var/www/straped/mufon/org/29397.html"],"Object Shape":"Cigar, Cylinder, Diamond, Flash, Oval","Date Submitted":"06/04/2011 06:56 UTC","Log Number":"US-06042011-0021","City":"Bement","Longitude":"-88.572008","Date of the Event":"06/02/2011 08:30 UTC","Sighting Duration":"Undisclosed","Summary":"It appeared out of nowhere in the sky, flew by, then dissappeared behind the trees.","Viewing Distance":"Unknown","trends":["There have been no other sightings in Bement","This sighting has never been favorited."],"Disposition":"Unresolved","Country":"United States","Case Number":"29397","Region":"Illinois","Source":"MUFON","Tags":"City","Latitude":"39.921978"}