{"Tags":"City","Weather Factors":"Unknown","Object Features":"None","Disposition":"Unresolved","Date of the Event":"11/16/1999 07:20 UTC","Date Submitted":"06/05/2011 09:52 UTC","Longitude":"-78.877209","Sighting Duration":"00:00:30","City":"Buffalo","Latitude":"42.895617","files":["/var/www/straped/mufon/html2text/29408.html.txt","/var/www/straped/mufon/org/29408.html"],"divs":["Sighting DetailsIt was a cold, windy night on November 16, 1999. I had to return a purchase to Kmart. I got into my pickup truck, backed out the driveway and started due west. About thirty yards from my driveway, I saw a very bright light on the western horizon, then another appeared...at that point my mind said \"landing lights\"...then a third light. I immediately pulled off the road, turned my radio off, opened my driver's side window, stuck my head out the widow and said, \"What the f... is that?\" By then more lights had appeared. They were very bright orbs, a couple hundred yards to my south and 300-500 feet in altitude. This location has a very large sky...flat land and no leaves on the trees by mid november. When all eight orbs were visable, they strechted across almost halve the sky from first to last. They were in-line, moving extremely fast. No more than 30 seconds from first sight at western horizon to disappearing to the western horizon. As fast as it happened, I was able to count the orbs twice...the first count was seven, but on recount, I'm certain there were eight. There was no noise, either from propellsion or sonic boom as I later thought there probably should have been. They were orbs, no tails, very distinct, bright yellow like an especially full moon. They were so fast and so low that it appeared they may be about to crash. I quickly turn my truck around and followed the path they'd been on. A few miles down the road I didn't see anything unusual and turned around. I was totally stunned. I started to go home and call my friends to tell them, then I just decided to go right to their house...mile and half north of me. When I got there, Jim and Laura were reading books. They knew something was up as soon as they saw me. I talked Jim into coming with me. We went back to the spot in front of my house. I explained what I saw. Then we drove eastward about five or more miles, didn't see any sign of a crash...like flames or police blockade...so we went back to Jim's and talked a bit, then I went back to my item return at Kmart. When I got back home I decided to call channel 4 tv. I asked if anything unusual had been reported...no. The next day I got on-line and found \"UFO Alert\" and made a report. A guy reported seeing the same event from Toronto Canada. A day later I find out a guy in Akron, NY also saw it. My overall feeling was awe struck! The next couple weeks I was buzzing with energy...I had to know more."],"Object Shape":"Sphere","Source":"MUFON","Region":"New York","Object Flight Path":"Straight-line path","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around November 16th 1999"],"Country":"United States","Summary":"Eight spheres traveled from west to east in-line, no noise, 300' to 500' altitude,","Case Number":"29408","Log Number":"US-06052011-0010","map":"<A HREF = \"http://maps.google.com/maps?q=42.895617,+-78.877209(29408)&iwloc=A&hl=en\"> mufon case (29408) map </A>","Viewing Distance":"101-500 Feet"}