{"Latitude":"32.941822","map":"<A HREF = \"http://maps.google.com/maps?q=32.941822,+-97.070545(29403)&iwloc=A&hl=en\"> mufon case (29403) map </A>","City":"Grapevine","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Boomerang","Longitude":"-97.070545","Date Submitted":"06/05/2011 03:17 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/29403.html.txt","/var/www/straped/mufon/org/29403.html"],"Region":"Texas","Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"None","Tags":"City","Object Flight Path":"Hovering then path","divs":["Sighting DetailsMy family and I were on our way back from Fort Worth Texas we were traveling north bound on highway 121 just past DFW airport. Just as as I pass Bass Pro Shop Road to my left I see a group of white static lights, they are not blinking. I've driven this route many times but not usually at night and my first thought was that there were some elevated wires of some kind that had lights on them that I had never noticed before because the lights were not moving. They just hung there. So they had to be on some wires or a pole or something is what I'm thinking. When I first see it, the object is ahead of me on the west side of highway 121. If I'm looking out the front windshield the object is at about 11 o'clock. Five seconds or so later as the object is at about 10 o'clock I see that the lights are in a V shape and I can see the dark outline of the object as it is contrasted against the night sky. There are five lights on at the point of the V and two on each \"wing\". They are evenly spaced apart and they are not strobing or radiating as far as I can tell. They are just on, bright white static lights. I ask my wife and my fifteen year old son if they see it and they say they do. Five more seconds pass and the object is at the 9 o'clock position. There is no doubt that the lights are in a V shape. My wife and son are asking aloud \"What is that?\" and \"How are those lights just floating there?\". We pass the object and I track it in my rear view mirror. It starts out hovering then it begins to float over the freeway moving eastward in the direction of eastbound 635. I want to stop but its at night and we're on the freeway so I keep driving. My wife tracks it from the passenger seat for about 20 more seconds until it's out of sight behind some trees. The whole sighting lasted about thirty seconds. I can only guess as to how far away it was or how fast it floated away so I'll refrain from doing so. It definitely hovered, it definitely floated away and it was definitely V shaped . The object did not have flashing or blinking lights of any kind. I immediately took note of the time, the van clock read 10:51 pm CST and I said it aloud to my wife because I wanted to remember the date and the exact time that we saw the object. I came home and google searched \"dallas ufo\" and as of this writing I have found nothing. So I wanted to make sure the event was documented. It happened over a busy freeway near an airport so it had to have been seen by others."],"Date of the Event":"06/04/2011 10:51 UTC","Case Number":"29403","Summary":"V shaped hovering lights that floated away","Log Number":"US-06052011-0005","trends":["There have been 6 other sightings in Grapevine","There were no other sightings in Grapevine on or around June 4th 2011"],"Disposition":"Unknown"}