{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.155782,+-95.989365(29401)&iwloc=A&hl=en\"> mufon case (29401) map </A>","Weather Factors":"None","City":"Tulsa","Region":"Oklahoma","Latitude":"36.155782","Case Number":"29401","Object Shape":"Fireball, Star-like","Log Number":"US-06052011-0003","trends":["There have been 59 other sightings in Tulsa","There was one other sighting in Tulsa on or around June 4th 2011"],"Viewing Distance":"Unknown","Disposition":"IFO","Object Features":"None","Tags":"City","Longitude":"-95.989365","Date Submitted":"06/05/2011 01:50 UTC","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had just picked my wife up from her babysitting job and we were going to my mother's house to spend the rest of our evening there. We were in a Toyota car and as were approaching her house I noticed in the southern sky about 15-20 amber-colored lights, arranged in a perfectly spaced crescent formation. They were stationary and did not move even when I stopped my car for a few seconds. They just stood there like beacons in the night sky. They were very obvious, anyone facing south tonight could not have missed them. They did not shimmer, flicker, pulsate or blink. I immediately pointed them out to my wife and we both started watching them as I was driving about 15 mph on one of our neighborhood streets in the direction of the lights (south). My first thought was that it was fireworks, because they looked like the fireballs you see on the Fourth of July. But they weren't moving or fading at all after 10 or 20 seconds. My next thought was that it might be some astronomy club demonstration of some sort, because the shape they were in resembled the shape of the big-dipper to my eye. But they were much to high and perfectly spaced and none of them seemed to be drifting. That was when I realized I was witnessing a UFO. It reminded me of the Phoenix Lights. I sped home to my mothers house as fast as possible to tell her so she could them too. I arrived there about 20 seconds later and ran inside and told her to go out and look. Then all three of us went into the backyard and watched the lights. We could just see a few of the lights through the trees that line her backyard fence. The lights then started moving north very slowly, first in a formation then slowly separating. There was not wind tonight. They were definitely being propelled by something other than wind because they were moving quite fast, yet not as fast as a helicopter or plane. I could then see three of them together in a triangle shape. We all stood quietly and my wife and I could hear a sound coming from them. They made a soft whirring sound like a quiet fan would. Or maybe it resembled a small electric motor. It was not loud at all, you would not be able to hear it if you someone was talking next to you, it was quite soft. I was excited by this time and so I ran to go to the park by our house so I could get an unobstructed view but before I made it there the lights had already passed over my position at the same speed but there were only 3 or 4 remaining. As I watched the last few they seemed to be growing dim, like a spark or ember. I thought, \"are they perhaps chinese lanterns?\" I've never seen a chinese lantern before in real life so I don't know. But how could they stay in a perfect, symmetrical shape and move together in unison like that if that's what they were? Besides, they were much much too high to be anything tethered to the ground. Then I walked back to my house and my mother and wife were standing at the end of our street. I guess they were walking to join me at the park and get a better look. Suddenly a car pulled up and stopped. It was our neighbors a couple of doors down. They are a married couple, and friendly acquaintances of ours. My mother asked them if they just saw the lights and they told us that they indeed had and their description was exactly what we saw. They were beside themselves with excitement just as we were. The man said they also saw a shooting start in the eastern sky just a second or two before he noticed the Lights. We talked for about 15 minutes, puzzled about what we had just seen and trying to reason what they could possibly have been. I asked them if they had heard the sound but neither had, maybe because they were in their car. The man said he tried to snap a photo of it on his cell phone but couldn't snap a shot, for some reason which I forget now. Maybe his battery was dead I think. I didn't have a camera on me but even if I did I don't know if they would have shown up on a digital camera. Evidently, while I was walking to the park, my mom called our next-door neighbor and told her to come outside and see this, whereupon she came outside, observed them for a minute and was said\"what IS it? What is it?That is REALLY WEIRD!\" My mother tried calling the airport but nobody answered. She called the police and the dispatcher said that they had about 7 calls about them. She said the number of lights reported by others was 25-50. I could only see 15-20 but perhaps that's because there were tall trees all around that partially obscured my view."],"Summary":"Phoenix Lights revisited","Date of the Event":"06/04/2011 12:00 UTC","files":["/var/www/straped/mufon/html2text/29401.html.txt","/var/www/straped/mufon/org/29401.html"],"Object Flight Path":"Stationary,Hovering then path"}