{"Longitude":"-82.037563","City":"Augusta","Sighting Duration":"00:00:15","Object Features":"None","Tags":"City","Disposition":"Unknown","Source":"MUFON","Latitude":"33.322139","Object Shape":"Circle, Sphere","Date of the Event":"05/18/2011 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.322139,+-82.037563(29400)&iwloc=A&hl=en\"> mufon case (29400) map </A>","Log Number":"US-08082011-0118","Weather Factors":"None","Region":"Georgia","Date Submitted":"08/08/2011 07:57 UTC","divs":["Sighting Details Hello. My name is Ronald, I am a teenager, and I live in Hephzibah, Georgia. I am 18 years of age. The following event took place on May 18, 2011 at around 10:15 pm during a nightly stroll around my neighborhood. The air is warm, the mood is chill, and the skies are mildly cloudy. Derek, a close friend of mine, and I were walking around my neighborhood smoking cigarettes and engaging in worthy conversation. We were pondering on the half-ounce of marijuana we were soon to purchase. Mind you, we were sober at this time as this was before we possessed or smoked any marijuana. Nevertheless, all of a sudden, I noticed two or three spherical orange lights in the sky in front and well above us. They were positioned very high, probably well above the clouds. They appeared to be fairly large, larger than the stars that were in the sky at the time. Honestly, I cannot say exactly how big the lights were as there was no way to gauge exactly how far away the lights were from us. From perspective, they were around three to four times the size of any star that was visible. As I pointed them out to Derek, in a series, two or three lights came on from the left of the already circularly-aligned three. The five or six lights that were now glowing formed a tilted circular shape and according to Derek, \"it appeared to be spinning\". The shape that the five or six lights formed as a whole did not appear to be spinning from my perspective. The lights just kind of hung in the sky and did not move at all; they were completely motionless. After just a few seconds, I'd say around 5 to 8 seconds, the lights went out in no particular order but almost all at the same time. They just kind of winked out. I am not sure if the lights were apart of one big object; each light could have been it's own object. But interestingly the lights formed a plausible saucer shape. And I say again, these lights were orange and spherical in nature. I am very interested in the paranormal and the mystery of UFOs and always have been. I have researched the subject extensively in my spare time. When I first saw these lights appear, I immediately pointed them out to Derek because I have seen orange lights in the sky before, and they never stay on for very long... It's strange. It seems as if the lights know that you are looking at them."],"Summary":"Orange spheres","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/29400.html.txt","/var/www/straped/mufon/org/29400.html"],"trends":["There have been 20 other sightings in Augusta","There were no other sightings in Augusta on or around May 18th 2011"],"Case Number":"29400","Country":"United States","Viewing Distance":"Unknown"}