{"Tags":"City","Date of the Event":"06/04/2011 11:10 UTC","Longitude":"-95.989105","City":"Tulsa","Disposition":"IFO","Viewing Distance":"Over One Mile","Object Shape":"Oval, Square, Rectagular","Latitude":"36.158502","Country":"United States","Log Number":"US-06052011-0016","Summary":"Large red elliptical shapes in eastern sky","Region":"Oklahoma","divs":["Sighting DetailsIt was about 23:10 Saturday 6-4-2011 when my wife took the dog out back. I was on the couch where I had been all day with a touch of a stomach flu. Within about a minute of her going outside she came back in demanding me to get up and come outside to see \"something is wrong with the sky\". I begrudgingly got up to go out back and investigate. When I came out she was at the end of the pool deck facing the eastern horizon and pointing in that direction demanding to look. As I came out of the door, past the stoop and at the end of the deck I noticed numerous large red elliptical shaped objects in the eastern sky. These objects were moving from a south to north direction at about the speed of a slow moving prop plane or helicopter, maybe a bit slower actually. These objects were red in color, with no pulsating lights, no strobe, no change in color, no flickering etc. They were just a constant red glow. The objects all moved at the same rate of speed, same direction and at the same altitude. They never drifted apart from one another always maintaing the same distance from one another. They were very large and you could not have missed them much, much larger than landing lights or marker lights of planes etc. When these objects came to a certain point in the sky, roughly above my neighbors house, the lights would turn off. No fading or flickering, again, just like a light switch and they were out. I followed one to that point and when the light went out I could make out an outline of a rectangular like shape briefly before it was obscured by trees. If I had to judge I would say the altitude was between 1,000 and 5,000 feet. Speed would be less than 100 knots and approximate location (direction or landmark it was following) would have been centered over Memorial Drive, give or take. I know Memorial Drive is a common approach land mark for planes flying into TIA however, these were not planes. There was absolutely no noise coming from them and the amount that were there would have made a racket. In fact, it was oddly quiet for the city on a Saturday night further adding to the no noise. All in all I would say that there was approximately 25 or so of the lights. They seemed organized yet random, if you catch my drift? One grouping had a formation, 5 objects, like geese but without the lead bird. This was my first ever experience of anything that I couldn't put a rational explanation to. It left my wife and I a bit excited, to say the least. My wife took several pictures on her phone but only one came out. I think she was shaking so the objects appear smeared. If you notice in the upper part of the picture you see many more smaller red \"orbs\" I had not noticed these until today."],"trends":["There have been 59 other sightings in Tulsa","There was one other sighting in Tulsa on or around June 4th 2011","This sighting has never been favorited.",""],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/29414.html.txt","/var/www/straped/mufon/more/29414_submitter_file1__photo-3.JPG","/var/www/straped/mufon/org/29414.html"],"Weather Factors":"None","Object Flight Path":"Straight-line path","Date Submitted":"06/05/2011 04:34 UTC","Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"29414","map":"<A HREF = \"http://maps.google.com/maps?q=36.158502,+-95.989105(29414)&iwloc=A&hl=en\"> mufon case (29414) map </A>"}