{"Case Number":"29412","Country":"United States","files":["/var/www/straped/mufon/html2text/29412.html.txt","/var/www/straped/mufon/org/29412.html"],"Region":"Georgia","Disposition":"Unresolved","Summary":"cylinder - grayish black object. moving along tree -line aprox. 200 ft above.","map":"<A HREF = \"http://maps.google.com/maps?q=34.102517,+-84.518285(29412)&iwloc=A&hl=en\"> mufon case (29412) map </A>","trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around April 28th 2010"],"Viewing Distance":"Unknown","Tags":"City","Longitude":"-84.518285","Weather Factors":"Windy, Lightning, Light","City":"Woodstock","Object Features":"Undisclosed","Latitude":"34.102517","Log Number":"US-06052011-0014","Source":"MUFON","Object Shape":"Cylinder","Date Submitted":"06/05/2011 02:33 UTC","divs":["Sighting DetailsMy 7 yr old son, my wife and I were driving down I-575, heading toward towne lake pkwy (exit 8) from holly springs (exit 14). A bad storm was brewing so we were trying to get home before it got bad. As we were approaching exit 11 (sixes rd). My wife says to me \"what is that\" she pointed to my left (i was driving). I look on the north bound side of I-575, hovering about 75-100 ft above the tree line was, plain as day, a blackish-gray cylinder object and it was moving slowly across. Astounded by what I was seeing, I got my sons attention and we all watched this object as we drove past it. I wanted to stop and take a video or something but my wife refused because of the storm. It was not moving fast, it had nothing attached to the bottom of it or the sides. Very strange! i have looked on the internet for a long time trying to find someone else that had seen the same object but no luck. Really and truthfully I dont know why i didnt stop because i have believed in Ufo s since i was a kid. I kinda froze up I guess. My wife did not believe in ufo s before this event. She still claims she does not believe but cant explain the object. PLease comment. anyone else seen something like this in this area??"],"Date of the Event":"04/28/2010 07:00 UTC","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed"}