{"Latitude":"33.860927","Tags":"City","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Disposition":"Unknown","Source":"MUFON","Weather Factors":"None","trends":["There have been 5 other sightings in Lakewood","There were no other sightings in Lakewood on or around June 3rd 2011"],"Object Features":"Unknown","Object Flight Path":"Straight-line path","Summary":"looked up and saw 5 large lights in the shape of a V or arrow","Case Number":"29411","divs":["Sighting Detailswalking dog at approximatly 9:20. Looked up to see the stars, and straight overhead say 5 large dimly illuminated lights in the shape of a V heading in a SSE direction. Estimated to be one object, a few hundred feet in altitude, moving at 50 to 70 mph, guessing size as that of a F-15 or 737. A helicopter was flying about half a mile away and thats the only sound I could hear. I could not see an outline of the object, just the lights. Like I said , it was very dimly lit, so the sighting was only about 15 sec. long. I'm just curious to know if I was the only one to see it. I was standing in front of my house. I always look at the night sky to see the stars and air traffic. I live about 25 miles from LAX and about 10 miles from LGB, so there's usually something in the sky. This object was nothing close to anything I've ever seen. I knew this was a similar looking object to sightings from UFO programs on TV. It moved smoothly and silently. I lost sight of it due to it's quickly dimness. I was a bit stunned, but I knew I saw, what I saw."],"City":"Lakewood","files":["/var/www/straped/mufon/html2text/29411.html.txt","/var/www/straped/mufon/org/29411.html"],"Log Number":"US-06052011-0013","Country":"United States","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Date of the Event":"06/03/2011 09:20 UTC","Longitude":"-118.124956","Region":"California","Date Submitted":"06/05/2011 02:22 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.860927,+-118.124956(29411)&iwloc=A&hl=en\"> mufon case (29411) map </A>"}