{"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=41.360464,+-88.417008(29417)&iwloc=A&hl=en\"> mufon case (29417) map </A>","trends":["There have been 3 other sightings in Morris","There were no other sightings in Morris on or around June 3rd 2011"],"Longitude":"-88.417008","Log Number":"US-06052011-0019","Region":"Illinois","Date of the Event":"06/03/2011 10:15 UTC","Summary":"Numerous high and low altitude spheres","Weather Factors":"None","Sighting Duration":"00:15:00","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Source":"MUFON","Object Features":"Unknown","Disposition":"Unresolved","Case Number":"29417","Date Submitted":"06/05/2011 08:36 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"41.360464","divs":["Sighting DetailsI was outside at 10:15 looking up in the sky with a geniii night vision scope. I saw at least 6 different craft at very high altitude. The craft were mostly traveling from the south to the north. One craft was traveling east to west in a slightly erratic flight path. I was able to film this craft via night vision and iphone. The video is very good and clearly shows the craft stoping mid flight the dissapearing from site. The last craft was a glowing orange sphere at a low altitude and could be seen with a naked eye. This craft was moving from the north to the south. I was able to video this craft and it clearly appears as a very slow moving very very bright glowing object. There are no strobe or flashing lights similiar to typical aircraft. The video is also very good quality. I will try to post the when i am on a desk top or lap top computer. In addition i viewed many aircraft this night and contrails could be clearly seen through night vision. All the craft described above left no trails. It was amazing seeing so many in such a short time. Clearly the skies are getting busier. Just get outside and look up"],"City":"Morris","files":["/var/www/straped/mufon/html2text/29417.html.txt","/var/www/straped/mufon/org/29417.html"],"Tags":"City"}