{"Summary":"Tetrahedron","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.59095,+-105.082863(29416)&iwloc=A&hl=en\"> mufon case (29416) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/29416.html.txt","/var/www/straped/mufon/more/29416_submitter_file1__1stShot.JPG","/var/www/straped/mufon/more/29416_submitter_file2__closeUp1.jpeg","/var/www/straped/mufon/more/29416_submitter_file3__StripeHorizontal.JPG","/var/www/straped/mufon/org/29416.html"],"divs":["Sighting DetailsMy Family and I were having a very late Christmas celebration at my apt in Fort Collins. We went outside to take some photos of the kids by a snowfort, someone had built. My sister in law and my brother made a comment about something in the sky. they thought it might be a hang glider or one of those motorized kites that people can fly around in. I saw it in the distance. Which was west of where we were. I took a few close up photos of it. I do recall that it seemed to be flashing from underneath but I didn't photograph any light coming from it. It actually seemed to be rotating. My Brother and I used my binoculars to look at it. The out side seemed to have a covering of octagonal bumps. Like you find of the shell of a sand turtle. I have attached some of the photos I took which also show it enlarged. There was no noise associated with it and it seemed to be a great distance away. I could not estimate the size of this. I do recall thinking it is going to go away now and it most certainly did by drifting north towards Wyo. I have never heard of anyone here seeing this. At one time I attempted to bring this to the MUFON conference in Denver. I was asked then to make this report. I would be willing to talk about it with a researcher. In the last photo you can enlarge it and see the stripe at a horizontal angle. I didn't know this until I uploaded the photo to my new computer. I have a total of 5 photos and one was taken with my iPhone for GPS tagging of my location."],"Object Features":"Undisclosed","Log Number":"US-06052011-0018","Tags":"City","Object Shape":"Other","Case Number":"29416","Longitude":"-105.082863","City":"Fort Collins","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Region":"Colorado","Date of the Event":"02/09/2010 12:00 UTC","Latitude":"40.59095","Date Submitted":"06/05/2011 08:02 UTC","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around February 9th 2010","This sighting has been favorited 2 times.",""]}