{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/29427.html.txt","/var/www/straped/mufon/org/29427.html"],"Date Submitted":"06/06/2011 07:50 UTC","Longitude":"-87.969869","Disposition":"Unresolved","trends":["There have been 5 other sightings in Vernon Hills","There were no other sightings in Vernon Hills on or around May 21st 2011"],"Date of the Event":"05/21/2011 10:30 UTC","Country":"United States","Object Flight Path":"Path with directional change","City":"Vernon Hills","Case Number":"29427","Region":"Illinois","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","Summary":"one huge triangular shaped object defined by 3 very bright orbs then followed by 6 or 7 singuar orbs l","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.223869,+-87.969869(29427)&iwloc=A&hl=en\"> mufon case (29427) map </A>","Weather Factors":"None","divs":["Sighting Detailsas i walked out the front door of a friend i normally visit two or three times a week, it would most customary for me to look up at the sky to find the moon or just to check the weather as it can change in no time at all in the chicagoland area. this particular eve may 21 2011 at 10:30 pm was exceedingly clear,as i was going to my vehicle again basically looking up to the northern sky i immediatly viewed a huge triangle shaped object heading in my direction coming out of the north heading south 3 very bright orbs and the color of which i still cant identify as anything i've seen before my best guess is a rose-orange. no sound whatsoever i was stunned as ive never seen anything like this other than on tv.i viewed it maybe 10 seconds and then re entered the friends home to have her witness the event it was still heading south or in our direction she couldnt believe it either. as we watched together we were yelling what is it is this real we were quite axcited to say the least. then within maybe 10 seconds out of the east sky tracking southeast another single orb same color and intensity came shooting towards the triangle and another 5 or 6 followed in suit. now sky is lit with these things we ran into the street to get a better angle as ther are a few tall trees. as a pick up truck approached i flagged him him down am not sure why out of excitment i guess of course he had to wonder what does this guy want i was yelling to look up in sky are seeing this he seemed dumbfounded but was cooperatve and asked if we had a camera, well not with unfortunately he didnt know to make of it and watched untill they left. then as the single orbs started catching up to the triangle the triangular object then started to turn in a rather quick arch heading northwest as did the all the other objects. i speculate this occurence lasted from 75 to 90 seconds really plenty of time for an excellent view. being dark it was hard to tell how really close they were to us maybe a quarter mile. they moved effortlessly quickly silently. at about 10:35 i called the vernon hills police dept. to report this leave it on record as i thought maybe someone else may have witnessed this sighting hopefully."],"Log Number":"US-06062011-0008","Latitude":"42.223869"}